[
    {
        "url": "https://www.9news.com.au/national/travellers-to-bali-urged-to-get-measles-vaccination-after-second-case-in-cairns-confirmed/a297fc8e-766a-46bb-a842-656fe2b5735e",
        "title": "Travellers to Bali urged to get measles vaccination after second case in Cairns confirmed",
        "publish_date": "Thu, 11 Sep 2025 22:53:34 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "Queensland health authorities have confirmed a second case of measles in Cairns as they urge travellers to Bali to get vaccinated.\n\nThe latest case is a close contact of a person who was diagnosed with measles last week after travelling to Cairns from Bali, the ABC reports.\n\n\"There's a number of measles outbreaks at the moment in south-east Asia, including Thailand, Malaysia, Vietnam and Indonesia, including Bali,\" Cairns Public Health Unit director Jacqueline Murdoch told the ABC.\n\n3d illustration Measles virus or virus (Getty)\n\n\"If anyone is going to these places over the school holidays or in the upcoming months, please see your GP and make sure you have sufficient immunity to measles.\n\n\"We don't want anyone bringing measles back to Cairns and spreading it in our community.\"\n\nHealth officials have urged the public to be on alert for symptoms, particularly if they were at the following locations at these times:\n\nMad Monkeys Waterfront backpackers, Saturday, September 6 — Wednesday, September 10\n\nRufus Restaurant, Saturday, September 6 (3pm — 10.30pm)\n\nCairns GP Superclinic, Wednesday September 10 (11.30am — 12pm)\n\nThe city's latest confirmed case of measles is a close contact of someone who was diagnosed after arriving in Far North Queensland from Bali.\n\nCairns Public Health Unit director Jacqueline Murdoch said there would be a \"couple of hundred\" close contacts.\n\n\"This case was an unvaccinated contact of our case from last week and we do expect further cases in this outbreak,\" she said.\n\nMeasles is a highly infectious virus that is spread by coughing and sneezing or through direct contact with secretions from the nose or mouth.\n\nThe illness usually starts with symptoms similar to the flu and can include fever and tiredness.\n\nThe onset of symptoms can begin 7-10 days after contact with an infected person but can sometimes take as long as three weeks.\n\nPeople who have been vaccinated against or previously contracted measles are very unlikely to contract the disease.\n\nBabies are routinely vaccinated against the measles at 12 months of age through the National Immunisation Program.\n\nPeople most at risk of contracting measles are those who have a weakened immune system, or those born during or after 1966 and who have not had two doses of the measles vaccine, or people who have not been infected with measles before.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/elon-musk-no-longer-richest-man-in-world/bd28e17a-c79f-48aa-9d47-6e84698f5ee8",
        "title": "Musk loses crown as the world's richest person  then snatches it back",
        "publish_date": "Thu, 11 Sep 2025 14:38:38 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "The battle among billionaires for bragging rights as the world's richest person got heated on Wednesday with the surprising surge of an old contender: Larry Ellison.\n\nIn a stunning few minutes after markets opened, stock in Ellison's Oracle Corporation rocketed more than a third, enough for him to temporarily wrest the title from its longtime holder Elon Musk and hand it to the software giant's co-founder.\n\nBut the stock market is fickle, and Musk was back on top by the end of the day, at least according to Bloomberg, as Oracle gave up a bit of its earlier gains.\n\nMusk was back on top by the end of the day, at least according to Bloomberg, as Oracle gave up a bit of its earlier gains. (AP)\n\nFor those keeping score, the difference now is a billion, which isn't much given the size of the figures: Musk's $US384.2 billion ($578.4 billion) versus $US383.2 billion ($576.9 billion) for Ellison.\n\nThe duelling fortunes are so big each could fund the lifestyles of 5 million typical American families for a year, about the entire population of Florida, allowing them to all quit their jobs.\n\nOr they could just tell all of South Africa to take a vacation for year and produce nothing, based on its gross domestic product.\n\nThe brief switch in the ranking came after a blockbuster earnings report from Oracle powered by multibillion dollar orders from customers as the artificial-intelligence race heats up.\n\nMusk became the world’s richest person for the first time four years ago.\n\nREAD MORE: Married at First Sight star Lachlan Rofe dies suddenly aged 47 ﻿\n\nOracle co-founder Larry Ellison is the world's richest person. (Bloomberg photo by David Paul Morris) (Bloomberg)\n\nA big reason is his stake in a hot, but now cooling, electric car maker, Tesla.\n\nStock in the company has been moving in the opposite direction of Oracle’s, dropping 14 per cent so far this year.\n\nMusk also controls several private companies, including rocket maker SpaceX, his artificial intelligence company xAI and the former Twitter, now called X.\n\nEllison owns about 40 per cent of Oracle, which means its surging stock added $150 billion to his net worth in little over a half-hour after the stock market opened.\n\nThe night before, after trading had closed, the company announced in an earnings report that it had struck more than $451 billion worth of new deals, including contracts with the OpenAI, Meta, Nvidia and Musk's xAI.\n\nKim Kardashian cracks billionaires list View Gallery\n\nIt said that it now expects revenue from its cloud infrastructure business to jump 77 per cent to $27 billion this fiscal year then rise to $216 billion in four years after that.\n\nEllison said in an earnings call that Oracle would not just be making money from its computing centres that help build the next chatbots, but from the day-to-day running of those AI systems to run robots in factories, design drugs in laboratories, place bets in financial markets and automate legal and sales work at companies.\n\nIn other words, Ellison's surge in wealth Wednesday morning reflected investor expectations that computers will take over many jobs now done by humans — and Oracle will benefit.\n\nOr as the 81-year-old said on the call, “AI Changes Everything\".\n\nMusk is hoping the same for Tesla and his own net worth, but he's been struggling to convince investors.\n\nThe company had been promising a big turnaround in electric car sales after they fell sharply earlier this year, but the bounce back hasn't happened.\n\nREAD MORE: Woman charged with murder over death of man in Perth ﻿\n\nMusk has been downplaying the bad numbers by trying to shift investors' focus to Tesla's other business of making robots and advances in the artificial intelligence behind its cars and robotaxis.\n\nWhile he keeps talking up the Tesla future, though, the bad news keeps coming.\n\nTesla sales in the European Union plunged 40 per cent earlier this summer, the seventh month in row of drops, as customers balked at buying his cars after he took to X to support extreme right-wing politicians there.\n\nThe company has been losing market share in the US, too, as buyers angry with his embrace of Donald Trump have stayed away from Tesla showrooms.\n\nOracle stock closed Wednesday at $US328.33, a 36 per cent jump. Tesla was up less than one per cent at $US347.79.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-most-trusted-brands-bunnings/75aa04eb-f125-421d-9179-1362a0208ce1",
        "title": "Australia's most trusted brand revealed",
        "publish_date": "Thu, 11 Sep 2025 02:35:14 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Hardware giant Bunnings has been named the most trusted brand in Australia for the second year in a row.\n\nThe company, which has over 500 stores across Australia and New Zealand, was also crowned the most trusted retail brand for the seventh straight year in a row by Roy Morgan.\n\nAldi was the most trusted supermarket, whilst Commonwealth Bank won the most trusted bank award for the first time during a period of job losses at many major Australian banks.\n\nBunnings continues to rank well among Aussie consumers. (Supplied)\n\n\"Bunnings customers consistently mentioned the 'Price matching, good quality and range of products, and helpful staff' as key reasons for the high levels of trust in Australia's favourite retailer,\" Roy Morgan CEO Michele Levine said.\n\n\"Bunnings has been firmly within Australia's top three most trusted brands throughout the last seven years.\n\n\"As other well-known brands have had significant hits to their reputation, the ubiquitous hardware retailer has maintained its high standing.\"\n\nKmart is one of many Aussie big brands which also ranked well. (Getty)\n\nOther brands that consumers continue to back include Toyota, Kmart, Australia Post and NRMA.\n\nLevine said it has been a challenging year for brands in the midst of inflation problems and wider cost-of-living issues, but believes the brands named deserve credit for their work to maintain their standing among the Australian population.\n\n\"The key challenge for leading brands throughout Australia, over the last year, has been dealing with the high cost-of-living caused by the high inflation and interest rates\", she said.\n\n\"This year's Trusted Brand winners have successfully maintained and built their trust with their customers and clients better than any of their rivals.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/aussie-mum-and-dad-investors-are-turning-to-ai-for-financial-advice/b941faa7-75e6-4d53-a8a0-a36ec5d09c1f",
        "title": "Aussie 'mum and dad' investors turn to AI for financial advice",
        "publish_date": "Thu, 11 Sep 2025 00:57:38 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A new survey has revealed a dramatic shift in how Australians are managing their money, with almost half of all \"mum and dad\" investors now asking artificial intelligence platforms for investment tips.\n\nFindings from an Australian Retail Investor Confidence survey, conducted by Chartered Accountants ANZ, highlight a growing reliance on tools like ChatGPT and Co-Pilot to guide investment decisions.\n\nThe survey, which for the first time asked 1000 Australian investors about their use of AI, found that 48 per cent are now using these platforms.\n\nAussie investors are increasingly turning to AI for financial advice, a new survey has found. (iStock)\n\n\"We have seen adoption of AI grow rapidly for both personal and professional use, but it is interesting to see investors are using it to guide where their money goes,\" Chartered Accountants ANZ CEO Ainslie van Onselen said.\n\nThe trend is particularly strong among younger investors, with 78 per cent of those aged 18-29 using AI for their financial decisions.\n\nThe survey also found a gender gap, with 15 per cent of male investors using AI extensively, compared to just 9 per cent of women.\n\nWhile the adoption of AI is on the rise, trust remains a significant hurdle.\n\nAround 43 per cent of those surveyed said they don't use AI because they lack confidence in the information it provides, and 46 per cent prefer to stick with more traditional sources.\n\nThe findings underscore the importance of reliable, human-backed financial information.\n\n\"Investors regard auditors as the foremost protectors of their interests, demonstrating a high level of trust in qualified professionals who deliver audit and assurance services,\" Van Onselen said.\n\n\"After all, AI information is only as good as its source.\"\n\nThis is supported by the survey data, which showed a four-point jump in strong confidence in audited financial statements since last year, now at 54 per cent.\n\nDespite global uncertainty, investor confidence in the Australian market is on the rise.\n\nCA ANZ chief economist, Professor Richard Holden, attributes this to a strong domestic economy.\n\n\"Confidence in Australian capital markets and listed companies has risen significantly at a time of global uncertainty, along with confidence in auditors and financial statements,\" Holden said.\n\nThe increasing use of AI highlighted the need for high-quality data to train these models, Holden added.\n\nThe survey also revealed a six-point increase in the percentage of investors with high confidence in Australian companies, and 42 per cent cited the recent federal election as a factor that boosted their confidence to invest.\n\nHowever, global unrest is making investors more cautious about overseas investments, with confidence in these markets dropping from 78 per cent to 73 per cent.\n\nThe rise of AI in finance is not limited to retail investors.\n\nA separate global report from Chartered Accountants Worldwide and Ipsos UK found that 79 per cent of chartered accountants believe their role as \"data guardians\" will become increasingly important as AI is integrated more into business.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/wallaroos-team-world-cup-quarterfinal-vs-canada/105765618",
        "title": "Wallaroos targeting World Cup quarterfinal boilover",
        "publish_date": "Fri, 12 Sep 2025 01:38:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Wallaroos have recalled hooker Katalina Amosa and lock Ashley Fernandez for their Women's Rugby World Cup quarterfinal against Canada, with their coaching staff still adamant Australia can pull off the upset of the tournament.\n\n\"The quarterfinal is what we wanted, and once you get into the knockout stages, anything can happen. It's an incredibly exciting opportunity for us,\" said assistant coach Gill Bourke after the team announcement on Thursday, local time.\n\n\"We want to go as far as we can in this now, so we're approaching it like that, and we're not getting too bogged down on who we're playing.\"\n\nThe Wallaroos are outsiders to earn their first win over a Canada side ranked second in the world, but coach Jo Yapp feels she has a powerful outfit at her disposal capable of pulling off a boilover at Bristol's Ashton Gate stadium.\n\nShe has made two personnel changes, with Amosa and Fernandez returning to the bench.\n\nAmosa featured against Samoa and the USA earlier in the tournament, while Fernandez has not played since the Samoa opener.\n\nTania Naden and Annabelle Codey have been dropped from the squad, while Yapp has also reshuffled her back row and centre pairing from the side that went down 47-7 to tournament favourites England in the final group match.\n\nFlanker Emily Chancellor has replaced veteran Ashley Marsters, who reverts to the bench.\n\nCentre Cecilia Smith has also been promoted to the starting XV, pushing another experienced international, Trilleen Pomare, to the bench.\n\nThere was good news on the injury front, too, with Lydia Kavoa ready to start as prop despite having left the field against England at Brighton in the first half with an ankle injury.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nYapp said she wanted to see the team deliver the same effort as last weekend when it led the world's top-ranked side for half an hour, but that it would need to sustain that level for longer against the so far unbeaten Canadians.\n\n\"We started well against England with our game management and need to show that for longer periods of the game this week,\" she said.\n\n\"The focus in training is on us. Canada is a physical team and like to move the ball, so we are excited for the challenge.\"\n\nStar winger Desiree Miller echoed that theme, recognising the need for the team to be more consistent.\n\nDesiree Miller said the Wallaroos must be more consistent. (AP: Dave Shopland)\n\n\"It's our Achilles heel at the moment, being consistent,\" said Miller. \"We showed up in the first 20, 30 minutes, and we're all over England. We had the mentality that we had nothing to lose and they've got a 30-game winning streak to lose; we thought we could cause an upset, and we did do that for the first 30 minutes.\"\n\nThe Wallaroos have never beaten Canada in seven attempts, and lost their last meeting 45-7 in May.\n\nWALLAROOS TEAM TO PLAY CANADA\n\n1 Lydia Kavoa, 2 Adiana Talakai, 3 Asoiva Karpani, 4 Kaitlan Leaney, 5 Michaela Leonard, 6 Piper Duck, 7 Emily Chancellor, 8 Siokapesi Palu (capt), 9 Sam Wood, 10 Faitala Moleka, 11 Desiree Miller, 12 Cecilia Smith, 13 Georgina Friedrichs, 14 Maya Stewart, 15 Caitlyn Halse\n\nReplacements: 16 Katalina Amosa,17 Faliki Pohiva, 18 Bridie O'Gorman, 19 Ashley Fernandez, 20 Ashley Marsters, 21 Tabua Tuinakauvadra, 22 Tia Hinds, 23 Trilleen Pomare.\n\nAAP\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/netball-australia-players-strike-landmark-revenue-sharing-deal/105765526",
        "title": "Netball players to get share of Diamonds' revenue in landmark deal",
        "publish_date": "Fri, 12 Sep 2025 00:50:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Netball Australia and the players' association have agreed to a landmark revenue-sharing deal as part of a new three-year collective player agreement (CPA).\n\nThe new CPA marks the first such model in the sport's history, with players to receive a share of the sponsorship, broadcast and event revenue generated by the national team.\n\nNetball Australia chief executive Stacey West said the deal would allow the sport to continue to grow from record crowds, broadcast audiences and fan interest seen in recent years.\n\nDiamonds great Liz Ellis said the new deal set a \"benchmark for women's team sports in Australia\".\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\n\"We understand that without the players there is no game, and we are committed to continuing to work together to ensure the players benefit from the sport's ongoing success,\" the Netball Australia chair said in a statement.\n\n\"Especially as we head towards the 2026 Commonwealth Games, the 2027 Netball World Cup in Sydney and our ambitions for Olympic inclusion in 2032.\"\n\nDiamonds players are set for a pay rise of about 40 per cent over the course of the deal, which also includes investment in player programs and services — including wellbeing, transition and alumni support — as well as a new \"player ambassador pool\" aimed at developing commercial opportunities.\n\nThere are record levels of interest and audiences for Australian netball at the moment. (Getty Images: Graham Denholm)\n\nKathryn Harby-Williams, chief executive of the Australian Netball Players' Association (ANPA), said the platform is now laid for a more sustainable future for the sport.\n\n\"The new revenue share partnership model aligns netball with other major national and international sports, recognising that the world champion Australian Diamonds are more than just employees — they are the product,\" she said.\n\n\"This agreement ensures players are starting to be rewarded in a way that reflects their impact and success.\n\n\"ANPA is excited to enter a new era built on stability, mutual respect and a shared commitment to the growth of the sport. This agreement includes outperformance mechanisms, enabling both parties to share in netball's future success — a recognition that we are stronger together.\"\n\nANPA president and current Melbourne Vixens premiership winner Jo Weston hailed the new pay deal, but singled out the increased investment in programs and services to improve players' wellbeing.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/calls-for-fishing-ban-amid-toxic-algal-bloom/105763810",
        "title": "Calls for SA gulfs to be shut to protect 'near-non-existent' stocks amid algal bloom",
        "publish_date": "Thu, 11 Sep 2025 23:39:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Commercial fisherman Bart Butson first noticed signs of the harmful algal bloom near the head of the Gulf St Vincent in Port Wakefield back in early June, following a significant storm.\n\n\"We went out onto the sea, and it was a different colour — it was a horrible greeny, grey colour,\" Mr Butson said.\n\n\"There was hundreds and hundreds of dead cuttlefish floating on top of the water.\n\n\" It was from that moment that I thought to myself, 'Oh my goodness, we're all in a bit of trouble here.' \"\n\nMr Butson said within two weeks of the weather event, calamari had virtually disappeared from the waters.\n\n\"The catches dropped rapidly within a two-to-three-week period, and we haven't seen the calamari for 10 weeks,\" he said.\n\n\"It's like they never existed.\"\n\nMr Butson gave evidence to a Senate inquiry into the algal bloom in Ardrossan. (ABC News: Viki Ntafillis)\n\nMr Butson outlined his concerns at a public hearing to a federal Senate inquiry on Thursday, describing how the \"destructive algal bloom crisis\" had left him uncertain about his future.\n\nHe said he believed, in order to aid the recovery of fish stocks and ensure the viability of the sector, the commercial industry had to stop fishing in the Gulf St Vincent.\n\n\"We need to be supported until the fish stocks return, so we will need financial assistance,\" he said.\n\n\" It's my personal opinion that the fishermen stop fishing. \"\n\nAcross the other side of the gulf in Ardrossan, commercial fisher Michael Pennington wants authorities to go one step further, by banning fishing in both the state's Gulf St Vincent as well as the Spencer Gulf.\n\n\"I know in [the Gulf St Vincent], the crabs, the squid, the garfish are at near non-existent levels,\" Mr Pennington said.\n\n\"They could be the last stocks that we have for breeding.\n\n\"We've got the blueprint that's happening in Gulf St Vincent, we've seen everything that's happened now, and I feel we should have both gulfs shut to manage and look after our fish stocks.\"\n\nMr Pennington says he hasn't been able to work for three months. (ABC News: Viki Ntafillis)\n\nMr Pennington said the depleted fish stocks had now left him without work for three months, and that he believed there were roughly 40 other commercial fishers in a similar situation.\n\n\"The whole of Gulf St Vincent, for the commercial sector — there's no fish coming out now whatsoever, so there's no-one fishing,\" he said.\n\n\"This could be years or decades for sustainable fishing, it's pretty devastating.\n\n\"It's hard. I've got two kids and a wife. It puts a lot of pressure, a lot of strain.\"\n\nMr Pennington said although state government grants had now become available, the sector found accessing financial support difficult because of the \"hoops you've got to jump through\".\n\n\"There's a bit of support out there now — that comes and goes, as soon as you've got it, it's gone,\" he said.\n\n\"It's hard to have a lot of faith in it, we got told a lot of things.\"\n\nAuthorities assessing stocks\n\nDeputy Premier Susan Close said the Department of Primary Industries was undertaking work to understand fish stocks in South Australian waters, and would provide advice \"in due course\" should there be any changes.\n\n\"But currently none are contemplated, and the reason for that is that it's not clear that any of the fish that are regularly fished, either recreationally or commercially, have seen a diminution in their species count as opposed to in particular locations,\" she said.\n\nMs Close says work is being carried out to assess fish stocks. (ABC News)\n\nSouth Australian Research and Development Institute executive director Mike Steer said teams had been on the water over the past couple of weeks assessing stock levels, which would then be compared against the baseline.\n\n\"As those data come out and we can identify whether there have been changes or trends associated with the harmful algal bloom, then we'll provide that level of information to the managers to make an informed decision,\" Professor Steer said.\n\nAlgal bloom persists in SA Photo shows Aerial view of the bubble curtain showing an area of ocean with a white bubble ring A \"bubble curtain\" is set for activation as part of South Australia's fight against the ongoing algal bloom.\n\n\"At the moment, we don't have the maturity of the data enough to inform those decisions.\"\n\nAs catches continue to decline, Mr Butson said he and other fishers wanted to change their role by supporting the state government with its research and data collection.\n\n\"I think we would be really useful to go out on the water and assist with the government, and be instructed by the government, on what they need to get the best data for their research,\" he said.\n\n\"I want to contribute with the research, I want to have a purpose, I need a purpose.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/jay-vine-misses-vuelta-a-espana-time-trial-under-a-second/105765416",
        "title": "Jay Vine misses out on Vuelta hat-trick by less than a second",
        "publish_date": "Thu, 11 Sep 2025 23:00:07 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jay Vine has come agonisingly close to the greatest time trial win of his career and a hat-trick of stage wins at this year's Vuelta a España, with the Australian star missing out by less than a second in Valladolid.\n\nProducing a scintillating, lung-busting effort over the flat 12.2-kilometre course, Vine ended up losing out to Italian time trialling great Filippo Ganna by just 0.9 of a second.\n\n\"To come second to Ganna is incredible, just beaten by one of the best time triallists in the world. Nothing more that I could do,\" Vine said after covering the course in 13 minutes and 1.79 seconds at a staggering average of 56.179 kilometres per hour.\n\nA fraction quicker, he could even have been celebrating his third win of what has been a fantastic Vuelta for the 29-year-old Queenslander, who is set to win the King of the Mountains classification with just three stages left.\n\nVuelta time trial cut by half over safety reasons Photo shows Riders line up next to Palestinian protesters Organisers shortened the individual time trial over safety concerns as pro-Palestinian protesters have lined stages of this year's race.\n\nIt was not such a good day for fourth-placed Australian Jai Hindley, as he lost three more precious seconds to Briton Tom Pidcock in their battle for the last step on the podium.\n\nBritain's Olympic mountain bike champion Pidcock, who is enjoying a huge breakthrough Grand Tour, finished 22nd on the day, one place ahead of Hindley, to push his lead over the West Australian to 39 seconds.\n\nRealistically, there is only one big mountain test for Hindley to try to leapfrog Pidcock in the standings, a mountainous 20th stage that finishes atop the Bola del Mundo.\n\nThat should be the stage where Vine wraps up his King of the Mountains triumph in the blue polka dot jersey worn by the race's top climber, but he still has a big job to do to assist UAE Team Emirates-XRG leader Joao Almeida, who is only 40 seconds behind leader Jonas Vingegaard in the overall standings.\n\nAlmeida trimmed Vingegaard's lead by 10 seconds with a fine ride for third place in the time trial, seven seconds behind Vine.\n\nWhat made Vine's effort so impressive on Friday was that it came off the back of so many major efforts in the mountains over the past two-and-a-half weeks, but ultimately the 2023 Australian time trial champ just could not quite match Ganna's remarkable late burst.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I was looking down at the watts and not being able to go any faster,\" Vine said.\n\n\"I looked at the TV before I was setting off and he was doing 67 [kph] at one point. I don't think I even got close to that number. So yes, he was smooth.\"\n\nOne of the early starters, double world time trial champ Ganna, reckoned he struggled to find his rhythm early on a course that had been shortened by more than half from its originally scheduled 27.2km because of the threats of more possible pro-Palestinian protests.\n\nBut he was six seconds faster than Vine over the final 4 kilometres, and then had to wait for three hours to learn if his time would be bettered.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/jamal-fogarty-canberra-raiders-nrl-finals-broncos/105763708",
        "title": "Jamal Fogarty isn't the perfect halfback but he's the perfect halfback for Canberra",
        "publish_date": "Thu, 11 Sep 2025 22:44:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "In a manner of speaking, there are still moments when Jamal Fogarty doesn't feel like the best halfback in Canberra.\n\nIt's not that Fogarty is low on confidence ahead of Sunday's qualifying final against Brisbane.\n\nAfter his best season in first grade, where he's steered the Raiders to the minor premiership and has the big prize in his sights, self-belief has never been higher.\n\nIt's just that even now, at 58 and a quarter century after he retired, sometimes Ricky Stuart's still got it.\n\n\"Even at training now, he'll tell me 'grab the ball and kick it like this' and he'll do it perfect first go and I'll be out there doing 10 reps and I still can't get it right,\" Fogarty said.\n\n\"Sometimes he might tip me up if I don't do something well, but he's not trying to coach me to be like him.\n\n\"I've always respected that with Stick. I don't have the natural ability he did.\n\n\"He understands he's a bit more talented than I am. He knows my strengths and what I do well and he encourages those things.\"\n\nIn his playing days, Ricky Stuart was one of Canberra's very best. (ABC News: Callum Flinn)\n\nIt's just as well because the Raiders don't need their halfback to be Ricky Stuart, they just need him to be Jamal Fogarty and so far that's proven to be plenty.\n\nAfter not becoming a regular NRL player until he was 26 after spending more than half a decade in the Queensland Cup and only playing his 100th first grade game this year, eight seasons after his debut, Fogarty is having the kind of season that was worth the wait.\n\nHe's equal second among halfbacks for try assists and has the most assists of any finals halfback after becoming the fulcrum around which Canberra's attack turns.\n\nThe Raiders, who have never been afraid of being too weird to live and too rare to die, have always relied more than most on the unorthodox to score their points, which is why Fogarty says he's not surprised to see what break-out players like Ethan Strange and Kaeo Weekes have done this season.\n\n\"We saw bits of it last year, this year we're just seeing it more,\" Fogarty said.\n\nCanberra revel in their Strange new world Photo shows Ethan Strange of the Raiders celebrates scoring a try during the round 23 NRL match between Canberra Raiders and Manly Sea Eagles at GIO Stadium, on August 08, 2025, in Canberra, Australia. At 21 and on the back of a breakout season, Ethan Strange has the ball on a string, Canberra's finals fate in his hands and the rugby league world at his feet.\n\n\"When you're fit and healthy those moments are going to show up more often and in previous years we definitely weren't as fit as we are now.\"\n\nThe other major change has been Fogarty himself.\n\nHe's playing with a greater control, both of his team and his own game, than ever before but never with a heavy touch.\n\nFogarty gives Canberra just enough structure to back up the instinctive play without ever sanding down the jagged edges that make them hard to handle.\n\nThe balance they've found — which has helped them score the third-most points in the league — is a product of evolution rather than invention. It cannot be taught, only learned.\n\nCanberra might be the only place it could work and the Raiders might be the only team who could do it that way and even if Fogarty is not the perfect halfback he is the perfect halfback for this style, which is exactly why it's all come together the way it has.\n\nThe 31-year old is quick to heap praise elsewhere, especially on attacking coach Justin Giteau.\n\nFogarty is aiming to end his time with Canberra on the ultimate high. (Getty Images: Mark Nolan)\n\n\"He's always asking me how I want to play, which plays are going to be good for me and what style to play,\" Fogarty said.\n\n\"Having a coach give us that confidence and thinks so similar makes it easy for me to buy in.\n\n\"But the team has bought into that process as well, the coaches have put things in place that have made it easy for us to get our structure on and let the guys inside and outside me play their style within that structure.\"\n\nFor that system to work, every Raider has to be able to bring some manner of individual brilliance to the table and for Fogarty it's his kicking game.\n\nHe dominates that department for Canberra. It's not unusual for Strange, his halves partner, to only have one or two kicks a week and before he was rested for the final round of the regular season, Fogarty had more kicks, kick metres and attacking kicks than any other player in the competition.\n\nHis specialty is the knuckle-ball floating bombs that cut through the air at nightmare angles.\n\nCanterbury's Matt Burton can send them higher but Fogarty has a greater control, which means he utilises them far more regularly.\n\nWhen he hits them right they cannot be caught by friends or foes alike and a bouncing ball creates the kind of chaos on which Canberra thrives.\n\nFogarty's kicking game is his deadliest weapon. (AAP: Mick Tsikas)\n\n\"Ricky backs me and encourages me to practice them at training, not just at the end of training but in scrimmage as well,\" Fogarty said.\n\n\"Even if I shank it he goes 'don't worry about it, just get the next one', so it's good to not have that over your head.\n\n\"If you hit a sweet one at training and the outside backs drop it, I have a bit of a giggle and get into them, but that gives me confidence if we're in the right field position I can throw them up.\n\n\"I've been lucky to hit a couple of nice ones this year, but it's all from practice.\"\n\nRegardless of what happens against Brisbane or in the weeks to come, Fogarty's time as the ringmaster of Canberra's psycho circus is coming to an end.\n\nHe's off to Manly next year on a four-year deal that, given his later start in first grade, was impossible to refuse.\n\nBut there is much to be done before then, first against Brisbane and then with whatever lies beyond and this time of year pressure weighs heavy on any halfback.\n\nA lack of finals experience is often tipped as Canberra's weakness but this is Fogarty's fourth play-off campaign.\n\nHe knows what to expect and given he's been a leader for some time now — when he was at Gold Coast, he captained the first grade side in just his 16th NRL game — he knows how to transfer that knowledge to the Green Machine's prodigies.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe advice is simple and Fogarty follows it himself — back yourself and believe in yourself, no matter what, even if it took years for your first NRL game, even if your coach can do things you can't do, because all you need to be out there is you.\n\n\"I tell all the kids who come into grade for their first game, or when they come into the team, to just enjoy it, be yourself and have fun,\" Fogarty said.\n\n\"When you do those things, you're willing to do all the one-percenters better more often than that.\n\n\"When Jarrod [Croker] was still playing there were times when it'd be 18-all and he'd say 'alright, let's just have some fun out there, back ourselves and see how we go' and I'd be like 'that's pretty cool, that's Jarrod Croker saying that' and it put things in perspective.\n\n\"Don't worry about the pressure, just have fun with your footy, like you did when you were a kid. That's what it comes down to for me.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/outback-hairdresser-travels-1000kms-to-pamper-remote-residents/105636488",
        "title": "Outback hairdresser drives 1,000km just to 'spoil' her clients",
        "publish_date": "Thu, 11 Sep 2025 22:12:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "For Juliann Mutch, the journey from Mildura in north-west Victoria to Wilcannia in far west New South Wales is filled with memories.\n\nWhile she now lives in Mildura, she grew up not far from Wilcannia, on a station called Mona Vale.\n\nFor the past four years, she's been making the 1,000-kilometre round trip to Wilcannia every six weeks to cut locals' hair.\n\nMrs Mutch grew up in the far west on a station. (ABC Broken Hill: Coquohalla Connor)\n\nBut for Mrs Mutch, it's about more than styling hair. She says the stories and community the far west has to offer keep her coming back.\n\n\"These women work so hard in the outback,\" she said.\n\n\" I love to be able to spoil them a little bit and just spend time with them and I just admire them. I think they're amazing. \"\n\n'My day to look after me'\n\nThe makeover magic all happens in an op shop on Wilcannia's main street.\n\n\"I've come every six weeks to do a normal hairdressing service and also I'm contracted for Catholic Care. So that might be 'providing' pamper days or it could be job ready or like working with the school with some of the students,\" she said.\n\nIt's local schoolteacher Karen O'Donnell's day off and she's in the chair getting her hair done.\n\nAunty O'Donnell's days at the local central school are hectic and she finds being pampered a welcome break from a busy schedule.\n\nSince Aunty O'Donnell, a Barkindji elder, returned to Wilcannia about five years ago, she has been making appointments with the travelling hairdresser.\n\n\"I work four days a week, so Julie knows that my fifth day is my day off to look after me,\" she said.\n\n\"So she did offer for me to come in and have a little package and [I'm] loving the experience.\"\n\nBarkindji elder Karen O'Donnell settles in for a chat, a laugh and Juliann Mutch's hair care. (ABC Broken Hill: Katherine Spackman)\n\nAunty O'Donnell believes Mrs Mutch's history in the area makes it easier for her to connect with locals.\n\n\"You just can't get anyone to do her job that she does,\" she said.\n\n\"She does travel to other smaller towns like Bourke [but] she really relates well with my family here — Barkindji mob and also non-Barkindji.\"\n\nKaren O'Donnell enjoys extra treats from Juliann Mutch. (ABC Broken Hill: Katherine Spackman)\n\nIt was also an opportunity for locals to access a service that \"bigger towns\" had, Ms O'Donnell said.\n\n\"Wilcannia is a wonderful place to live. It's been bagged out for a long time and look, it's just a lovely place and there are some beautiful people in town,\" she said.\n\n'Our hero'\n\nThe salon chair also doubles as a safe space where nothing is off the table.\n\nNatalie Batson, a mother of three who works on a station near Wilcannia, travels 40km to see Mrs Mutch.\n\nShe said, like Aunty O'Donnell, her life was busy.\n\nThey spend the appointment talking about beauty tips and life, the good parts and the bad.\n\nNatalie Batson travels 40km for the laughs, talk and styling tips when Juliann Mutch is in town. (ABC Broken Hill: Katherine Spackman)\n\n\"Today I had my hair washed, which for station wives, that's a big thing,\" Ms Batson said.\n\n\"[I] have my hair washed, blow dried, straightened and styled and Juliann's always up for helping me with little styling tips to make my life easier, which is invaluable.\n\n\" It's so good for our mental health … we have the best laughs here and there's no topic that's off limits. We can talk about our sad days as well as our good days. \"\n\nShe said the service was invaluable to the community.\n\n\"She's one of our heroes, our travelling hairdresser, and it's a big ask for Juliann to be travelling these distances on the roads that sometimes get presented to her,\" Mrs Baton said.\n\nJuliann Mutch straightens Natalie Batson's hair — all part of the service she offers to make her clients \"feel special\". (ABC Broken Hill: Katherine Spackman)\n\n\"I already have to travel 40km just to get into town … If we didn't have this service [it] would be Broken Hill and for me that's 250km one way.\"\n\nGiving back\n\nMrs Mutch, who took up hairdressing 40 years ago after work experience in high school, likes the idea of giving back to her community via a service that is not often available.\n\nShe has been cutting hair and offering a safe space for a chat since starting with a salon in Broken Hill when she was 22.\n\nAfter having children and moving to Mildura, she felt a need to return to the region.\n\n\"I like to make people feel special,\" she said.\n\n\"I think you can change someone's day with a bit of kindness and looking sensational.\n\n\"If I've made someone else's day, that makes my day.\n\nIt's a five-hour trip to Wilcannia every six weeks for Juliann Mutch and something she looks forward to. (ABC Broken Hill: Coquohalla Connor)\n\n\"My family property is up near Wilcannia and I just wanted to look after them.\n\n\"They haven't got that service so I wanted to bring that to them.\n\n\"I've come every six weeks to do a normal hairdressing service and also I'm contracted for Catholic Care, so that might be providing pamper days or it could be job ready or like working with the school with some of the students.\"\n\nWhile the journey can be \"monotonous\" she finds the kilometres of empty highway give her time to think and reflect.\n\n\"It's thinking time,\" she said.\n\n\"I have a lot of audio books I listen to. It's a means to an end and I enjoy it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/asx-markets-business-live-news-sept-12/105765376",
        "title": "Live: Virgin reveals $50 million payday for ex-boss Jayne Hrdlicka",
        "publish_date": "Thu, 11 Sep 2025 22:02:14 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Rhiana Whitson"
        ],
        "text": "The European Central Bank left interest rates unchanged overnight as expected and maintained an upbeat view on growth and inflation, dampening expectations for any further cut in borrowing costs.\n\nThe ECB halved its key rate in the year to June but has been on hold at 2% since, arguing that the economy of the 20-country euro zone is in a \"good place\" even if all policy options, including additional easing, could not be ruled out.\n\n\"We continue to be in a good place,\" ECB President Christine Lagarde told a press conference, adding that inflation was where the ECB wanted it to be and the domestic economy solid.\n\nUncertainty about global trade had eased after a number of US tariff deals, she said, including the European Union's own agreement which set a 15% duty on most US imports of EU goods.\n\nSources with direct knowledge of the discussion said rate cut talk was not over but that it would still take months for the ECB to gain clarity, meaning the next proper debate on whether more support is needed is likely to be in December.\n\nMoney markets are now pricing in just a 40% chance of one last rate cut by next spring, less than before the overnight decision, even while they expect the Fed to ease US borrowing costs six times by the end of 2026.\n\nReporting with Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/melbourne-f1-grand-prix-extension-shelved/105765288",
        "title": "Plan to extend Melbourne F1 GP to three weeks shelved",
        "publish_date": "Thu, 11 Sep 2025 21:43:58 +0000",
        "category": "sports",
        "authors": [],
        "text": "A Victorian government plan to extend the Australian Formula One Grand Prix to a three-week event has hit the skids after failing to win the support of crossbenchers.\n\nNew legislation would have extended the race period from seven to 21 days, leaving joggers, walkers and sports teams locked out of the Albert Park precinct.\n\nThe government said the Australian Grand Prix Corporation has been setting up and dismantling the event outside of the seven-day race period, and construction workers and vehicles operating in public areas were \"potentially putting pedestrians and cyclists at risk\".\n\nIt said the change would also make the park \"safer and more secure\" during the race period.\n\nBut it failed to win support for the Grand Prix Amendment Bill from crossbenchers and now says the bill has been adjourned for a later date.\n\nAnimal Justice Party MP Georgie Purcell said she couldn't support the bill, leaving the government without the votes it needed to pass the legislation.\n\n\"Something that was really clear from me after talking to community groups, sporting groups, and environmental groups, is that three weeks is just too long without any community benefits,\" she said.\n\nAnimal Justice Party MP, Georgie Purcell, said the Australian Grand Prix Corporation was trying to \"steamroll\" communities. (ABC News: Tyrone Dalton)\n\n\"The community was receiving no benefit for this inconvenience. The people in this area utilise Albert Park year round. It's really important to them. It's one of their only green spaces.\n\n\" We can't just have organisations like the Grand Prix coming in and steamrolling entire communities. \"\n\nThe government had already failed to win support from the opposition and The Greens for the plan.\n\nThe Australian Grand Prix has attracted record crowds in recent years. (Reuters: Loren Elliott)\n\nA Victorian government spokesperson accused the opposition of not supporting the event.\n\n\"Victoria is the major events capital of the nation but if the Liberals had things their way that would not be the case — the Liberal National Party are against major events like the Formula 1 Grand Prix and the thousands of jobs and businesses they support,\" the spokesperson said.\n\n\"The Formula 1 Australian Grand Prix is one of the highest attended races on the Formula 1 calendar — pumping more than $320 million into the Victorian economy each year, supporting more than 1,600 jobs and keeping our hotels, restaurants and businesses busy.\n\n\"The Grand Prix Amendment Bill is ensuring we strike the right balance of maximising public access and safety at Albert Park.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/tarryn-aiken-injures-knee-roosters-win-nrlw-minor-premiership/105765274",
        "title": "Roosters star hobbles off with knee injury as minor premiership locked in",
        "publish_date": "Thu, 11 Sep 2025 21:15:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Sydney Roosters have beaten Cronulla to finish the regular season with a perfect 11 wins from 11 rounds and claim the NRLW minor premiership, closing out the season with a 40-10 win despite losing star halfback Tarryn Aiken to a knee injury.\n\nAll eyes will be on Aiken's injury, which was initially said to be a heavy knock to the kneecap in the 15th minute, and she was helped off Central Coast Stadium on Thursday night by two trainers.\n\nShe had missed the opening four games of the season with a shoulder injury but had been typically influential since her return, recording 12 try assists and five tries in six games leading up to Thursday's win.\n\nRoosters coach John Strange said medical staff did not think it was an ACL.\n\n\"But they'll scan it and see. Might be a meniscus tear, but they're just sort of guessing until we get scans,\" he said.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nKiwi prop Amber Hall also limped from the field with an apparent calf injury after scoring a try in the 31st minute, winger Jayme Fressard missed the last five minutes after injuring her ankle, and centre Jessica Sergis was struggling with back spasms.\n\nThe injuries did not slow down the Tricolours, who scored first-half tries through Jayme Fressard (two), Mia Wood, Isabelle Kelly and Hall to take a comfortable 24-0 lead into the sheds at half-time.\n\nIn the second half, the Sharks stemmed the flow a little with tries to winger Dominique du Toit and fullback Jada Taylor, but the Roosters added further tries to Olivia Kernick, Taina Naividi and Keeley Davis to re-assert their dominance, despite being down on troops.\n\nDavis set up Kelly's first-half try with a neat tap-on over du Toit, and the captain said coach Strange had prepared the team to play anywhere on the field when called on.\n\n\"[It's unfortunate] when people go down but we always know someone's going to be able to stand up and play in those positions,\" Kelly said.\n\n\"I was really proud of the girls that had to get moved around. Keeley did a lot of work, she was going back and forth to different sides as someone who genuinely doesn't play [five-eighth].\"\n\nKelleher had moved from five-eighth to halfback to cover for Aiken, and her four conversions saw her become the first player to pass 250 points in the eight years of the NRLW competition.\n\n\"I only found out this morning that no-one has ever done it and that I was close, so I'm stoked,\" she said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nStrange's players have earned themselves a week off before the preliminary finals on September 27-28, giving the Roosters extra time to help Aiken and Hall recover.\n\n\"The week off definitely won't be a break as coaches have told us we'll be getting smashed in training during the week,\" Kelleher said.\n\nCronulla coach Tony Herman has little time to turn things around as the Sharks back up next weekend in the elimination finals, the Knights their likely opponents.\n\nThe Sharks also have injury concerns, losing winger Georgia Ravics (knee) during the week.\n\nRavics is the side's top try-scorer, with 10 in 10 games.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-12/aboriginal-elders-visiting-nt-prisons-program-20th-anniversary/105762476",
        "title": "The senior citizens healing prisoners from inside jailhouse walls",
        "publish_date": "Thu, 11 Sep 2025 20:38:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Twenty years ago, a group of senior citizens took up a bold challenge to help heal prisoners from inside jailhouse walls.\n\nToday, the Northern Territory's Corrections Department says the Elders Visiting Program those citizens began is more important than ever before.\n\nThe NT is Australia's most incarcerated jurisdiction for Indigenous peoples, and among the highest in the world.\n\nAccording to its corrections department, a staggering 88 per cent of adult prisoners and 94 per cent of youth prisoners are Indigenous.\n\nHaving seen generations of their kin trapped in a cycle of reoffending, a pioneering group of Aboriginal elders stepped in to create the Elders Visiting Program in 2005, working with the corrections department.\n\nPirrawayingi (Marius) Puruntatameri has been working with Indigenous inmates in the NT for two decades through the Elders Visiting Program. (ABC News: Dane Hirst)\n\nTwo decades on, the program's co-founder, Tiwi elder Pirrawayingi (Marius) Puruntatameri, is still working to help prisoners turn their lives around.\n\n\"They inspire me,\" he said.\n\nHe has also inspired his fair share of Tiwi prisoners himself — some of whom now want to follow in his example as a leader.\n\n\"Of course that's a possibility, but I've always said 'No, you can be better than us,'\" he said.\n\nToday, the Elders Visiting Program plays a vital role in liaising between the NT's jails and communities, reconnecting inmates with culture and encouraging them to change their lives.\n\nAt a two-day forum in Darwin this week, NT Corrections honoured the dozens of elders who have helped to shape the program, including those who have passed away.\n\nAn appeal to elders to help alleviate prison pressure\n\nIn recent months, a law-and-order crackdown in the NT has led to the prison population soaring to record highs.\n\nIt has left many First Nations leaders concerned that their communities are being targeted and their voices are being ignored.\n\nGerard Maley says his government is committed to listening to Indigenous voices when it comes to making policy decisions. (ABC News: Anzaya Karim)\n\nAffirming his government's commitment to the Elders Visiting Program, Corrections Minister Gerard Maley promised to listen to Indigenous leaders' voices.\n\n\"That means listening to your advice — not just inside the prison but also using it to shape policy outside of it,\" he told the forum.\n\nThe Elders Visiting Program has already survived several changes of government and a global pandemic. In fact, it has expanded in recent years to also include the NT's youth detention centres.\n\nCorrections Commissioner Matthew Varley said the elders' input was more important now than ever before.\n\nNT prison lockdowns occurring 'all of the time' Photo shows a man wearing an official khaki uniform Corrections Commissioner Matthew Varley has detailed the pressure being applied to the NT's prison system.\n\n\"The system is under growing pressure more than ever before and our staff need your advice more than ever before,\" he told the forum.\n\nMr Puruntatameri agreed that the government more broadly needed to listen to First Nations voices.\n\n\"If government wants to genuinely and sincerely close the gap, they need to listen to us and seek our guidance — because for the last 100 years, they haven't changed much,\" he said.\n\nWave of new leaders emerging\n\nThe NT Corrections' director of Aboriginal engagement and strategy, Juanita Jones, has witnessed firsthand how the partnership has positively affected prisoners serving lengthy stints in jail.\n\nJuanita Jones says the Elders Visiting Program has a visible positive impact on inmates. (ABC News: Dane Hirst)\n\nShe said at the heart of the program was a commitment to Aboriginal leadership.\n\n\"There's not a one-size-fits-all approach to how the program's delivered — it's really led by elders and communities themselves,\" she said.\n\nSelina Ashley, a program participant hailing from Wugula (Beswick), agreed.\n\n\"You have white man law and you've got blackfella law — and with us working together as a team, it's helping them not go back to prison,\" she said.\n\nSelina Ashley's father is one of the founders of the Elders Visiting Program. (ABC News: Dane Hirst)\n\n\" We're there to support whitefella law, and whitefella law respects us. \"\n\nThe forum brought together leaders usually separated by thousands of kilometres of vast outback landscapes together in one room, to trade strategies designed to help strengthen their communities to turn the tide of incarceration.\n\nWith many of the program's fiercest leaders having passed away in recent years, empowering the next generation was front of mind for many — including Heather Mungul, who hails from the Kalano Community in Katherine.\n\n\"In the next 20 years, we'd like to see our young ones come and join us to work with us and to learn about what we're doing in this program,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/the-queensland-school-with-the-best-and-healthiest-tuckshop-meals-20250904-p5msfs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Queensland school with the best (and healthiest) tuckshop meals",
        "publish_date": "Fri, 12 Sep 2025 11:50:51 +1000",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt"
        ],
        "text": "A Gold Coast school’s taco roll has been crowned the best tuckshop meal in Queensland from a list of finalists with sneaky healthy twists on child-friendly favourites.\n\nNutrition was packed into each of the seven shortlisted finalists for the Queensland Association of School Tuckshops’ recipes of the year – which included the likes of mac and cheese and two-minute noodles – through various vegetables grated, blended and blitzed into the meals.\n\nThe association crowned Coombabah State School’s taco rolls as 2025’s tuckshop recipe of the year.\n\nCoombabah State School’s taco rolls were called an “obvious winner” by judges. Credit: Queensland Association of School Tuckshops\n\nThe judging panel, made from students and Queensland Association of School Tuckshops members, said the recipe was an “obvious winner”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/change-agent-meet-nuno-matos-the-no-nonsense-ceo-whipping-anz-into-shape-20250911-p5mue5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Change agent’: Meet Nuno Matos, the no nonsense CEO whipping ANZ into shape",
        "publish_date": "Fri, 12 Sep 2025 11:50:21 +1000",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "His wife Maria is Peruvian, they have two grown-up sons, and he has said that at home they speak three languages. “We are kind of a United Nations at home,” he said last year. He’s an ocean swimmer, a keen reader of history, and he and his wife are looking for a home in Melbourne (and living in the Park Hyatt while they search for a place, The Australian Financial Review reported). Matos has said that ambition is one of his most important leadership beliefs,. About a decade ago, he started aspiring to run an international organisation, or a big domestic bank in an important market. He got a chance to realise this ambition when ANZ’s board, chaired by Paul O’Sullivan, picked the banker as ANZ’s next chief executive late last year, soon after he had resigned from one of the biggest banks in the world, HSBC. Matos had risen to run HSBC’s personal and wealth arm, and was reportedly seen as a contender to run HSBC, but missed out on the top job and left the London-headquartered giant in August 2024. He is paid $2.5 million a year to run ANZ, with the potential to make more than $8 million including bonuses, depending on whether he hits performance targets.\n\nWhile ANZ is one of the biggest companies in Australia with 43,000 globally, at HSBC Matos was responsible for a business with twice as many employees. He also led the HSBC response to a massive money laundering scandal in Mexico – a high-stakes clean-up task that lasted years. Although he had not experienced Australia’s banking market firsthand before taking the job, he said this week he had observed it from Asia. One market participant who has met Matos says he appears keen to listen – in contrast to some offshore chief executives who have appeared to think they know what is best when they turned up in Australia. They say that in person, Matos comes across as low-key, serious and analytical. “He’s very different to other CEOs who have come from abroad to Australia. He was really interested in what people have to say,” they said. Loading While we don’t know all his plans for ANZ yet – key details are expected at a strategy day next month – Matos has flagged some key principles. Some of his top priorities are to get the bank moving faster and to make its culture more performance-driven. He has suggested ANZ staff keep presentations to no more than five pages, and staff were also told meetings should have a clear purpose and agenda. The bank has also recently reminded staff they needed to turn up to the office at least 50 per cent of the time to get a bonus. Like many other corporate bosses, he believes spending some time in the office is important for career development, as well as mental health.\n\n“It’s not easy to observe and to evolve if you are on Zooms and Teams … that face-to-face conversation is much more effective,” he said last month, according to The West Australian. Even before this week’s deep job cuts were announced, some ANZ staff had criticised or ridiculed Matos’ approach, with some hitting the chat platform Reddit to vent. Giving him nicknames such as “Papi” and “El Nuno”, some of these staff members anonymously made fun of the boss, while railing against the changes he is bringing. ANZ shares have lagged the bigger three rivals. Credit: Natalie Boog The Finance Sector Union has also been highly critical of the speed at which Matos is moving. The union said the pace of change pushed through by him caused last month’s infamous email chaos – staff found out they were being sacked through an automated email telling them to return their laptop. Banking analysts and investors are generally more supportive of Matos’ changes, though some say his plans are not without risk.\n\nThey believe change is needed mainly because ANZ is underperforming. Its shares have lagged the bigger three rivals and several bank-watchers think there is room to reduce costs. MST Marquee analyst Brian Johnson believes there is “a degree of over-staffing” in the bank, but he had thought cuts would involve about 2000 jobs, rather than the 3500 target Matos announced. Johnson says there is “execution risk” that comes with cutting as deeply as this, but overall, he says the status quo at ANZ was not acceptable to shareholders. Loading “I actually think he’s a change agent. I think that he is genuinely motivated about fixing it up,” Johnson says of Matos. There has been widespread speculation among analysts that with the job cuts announced this week, an October strategy will include details about more financial targets for the bank. Matos has also indicated that a big priority will be to deal with the expensive digital platform ANZ Plus, which has underwhelmed the market. Some think he could pull back on the ambitious tech project.\n\nImproving how the bank deals with non-financial risk is also high on Matos’ to-do list. The bank is still awaiting the results of a regulatory investigation into potential “conduct issues” in its markets business, and is holding $1 billion in extra capital due to the banking regulator’s long-standing concerns about weaknesses in ANZ’s risk management. Investors say there are plenty of areas where ANZ needs work, and some said this week that Matos could cut the bank’s dividend as part of a “clearing of the decks”. Importantly, Matos said this week that ANZ also had many strengths – such as being the most international of the Australian banks and having a flagship institutional bank – but he added that “we need to do some things better”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/swimming/ok-that-s-enough-for-me-why-thorpe-nearly-quit-after-sydney-olympics-glory-20250912-p5mui6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘OK, that’s enough for me’: Why Thorpe nearly quit after Sydney Olympics glory",
        "publish_date": "Fri, 12 Sep 2025 11:47:05 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size After 25 years, Ian Thorpe has lost count of how many strangers swear they were inside the Sydney International Aquatic Centre on the night of September 16, 2000. It was the night Thorpe, a 17-year-old with size-17 feet, touched the wall first in the 400-metre freestyle final to claim Australia’s first gold medal of the Sydney Olympics. Just over an hour later, Thorpe dived back in to anchor the men’s 4x100m freestyle relay, chasing down American superstar Gary Hall jnr to deliver a historic victory — capped by the famous air-guitar celebration that instantly entered folklore. When stopped on the street, Thorpe’s response is always the same. “I was there too!” Australia’s Ian Thorpe shows off his gold medal following the men’s 400-metre freestyle swimming event at the Sydney 2000 Olympic Games. Credit: Sygma via Getty Images The stories rarely stop there. Thorpe has heard them all.\n\nAdvertisement\n\nThere were the fans who refused to board their flight so they wouldn’t miss his race. An excited woman once told Thorpe she gave birth while cheering him on. “I was like, ‘why were you watching?’” he says, laughing. We are sitting in a quiet corner of the same arena which once served as Thorpe’s coliseum a quarter of a century ago, where millions around the world watched his brilliance. Next week marks 25 years since the Sydney 2000 Olympics. After a quick photoshoot beside his favourite lane four block, Thorpe, now 42, affords himself a moment to take it all in. Only a handful of public swimmers are using the pool, which allows Thorpe a rare hour away from the glare of being one of the world’s most recognisable athletes. A world champion at 15, Thorpe lost all anonymity with his three gold and two silver medals in Sydney. Ian Thorpe dives in at the Sydney Olympics. Credit: Dallas Kilponen\n\nAdvertisement\n\n“This pool is very familiar to me,” Thorpe says. “It doesn’t feel like it was a generation ago, but it doesn’t feel like it was yesterday either. It feels like just over a decade ago. “It’s not like I ever get to sit here and ponder my thoughts.” Now he is, and the memories rush back — though some are hazy after the whirlwind of those 16 glorious days in 2000. What Thorpe never revealed publicly is that, for a fleeting moment, he considered walking away from swimming altogether after Sydney. It is a stunning admission. As Thorpe carried the Australian flag at the closing ceremony, with fireworks flashing above the Olympic stadium after performances from Kylie Minogue, Midnight Oil and INXS, Thorpe imagined a life away from the pool, free from the suffocating pressure. “I actually thought, ‘okay, that’s enough for me. I’ve done everything I set out to do’,” Thorpe says. “My goal when I was young was to be an Olympian and my dream was to be an Olympic champion.\n\nAdvertisement\n\nMichael Klim, Ian Thorpe and Grant Hackett enjoying the closing ceremony. Credit: 2000 “It’s like saying, ‘I want to be an astronaut’. To be an Olympic champion is like going into space. Not many get to do it. I had accomplished that and considered for a very brief moment [walking away]. The closing ceremony was over and it was actually when the fighter jets were flying over the stadium. “I then had a break, which I was having anyway, and in a great way, my world expanded. It was the inspiration that I got outside the pool that got me back in.” The pressure to perform in Sydney was immense, especially in the 400m freestyle, where Thorpe was the overwhelming favourite. “It was tough,” Thorpe says. “It was assumed I would just win … but I’m 17 and there’s a human behind all of this. Yeah, I can do extraordinary things, but I’m as awkward and uncomfortable as any 17-year-old in the world. I broke my leg less than a year out from the Olympics. People don’t remember that. I was also accused of doping by the German head coach. It wasn’t smooth sailing. I had doubts in myself until I heard the crowd roar, which gave me a brief second out of my head. That was what I needed to flick into race mode. “I didn’t know this until really recently, but they put the 400m freestyle and the men’s 4x100m freestyle relay on the same night so the Sydney Olympics would go off with a bang. I’m glad they didn’t tell me that.” Australian teammates (from left) Ashley Callus, Chris Fydler, Michael Klim and Ian Thorpe celebrate after winning gold and setting a new world record in the men’s 4X100m freestyle relay event at the Sydney Olympics in 2000. Credit: Rod Taylor\n\nAdvertisement\n\nAfter breaking the 400m freestyle world record, despite being told by a senior coach to conserve energy - “that’s a really bad thing to say to an athlete” - Thorpe had just an hour to prepare for a relay. The USA had never been beaten in the event. A swimsuit malfunction almost cost Thorpe his place on the blocks, but his nerves eased when Australia’s lead-off man, Michael Klim, blitzed the first two laps. “You broke the world record,” Thorpe told Klim. “But what was my time?” Klim asked. “I can’t remember. Faster than anyone in history.” Thorpe adds: “I must have looked at Michael like, ‘do not ask me again’. He was banging my block. I looked up at him and said ‘f—k off, that is not going to help me’. It was distracting but I was ready to race.” After diving in almost level, Hall quickly surged ahead, silencing the Sydney crowd. But in the final 15 metres, ‘Thorpedo’ had other ideas.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/margot-robbie-s-risque-red-carpet-tribute-to-armani-20250912-p5muhp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Margot Robbie’s risque red-carpet tribute to Armani",
        "publish_date": "Fri, 12 Sep 2025 11:30:30 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "As far as tributes go, the risque Giorgio Armani dress worn by Margot Robbie to a London movie premiere trumps an eloquent eulogy or lace-trimmed bereavement card.\n\nDays after the Italian designer’s death at the age of 91, Robbie selected a see-through gown from the Armani Prive spring 2025 collection, embellished with floral and paisley motifs in crystals and gems, to wear alongside actor Colin Farrell for the premiere of A Big Bold Beautiful Journey.\n\nWhile the scant tapestry design was minimal at the front, there was even less at the back, with the spaghetti straps criss-crossing before descending dangerously low, with a matching thong offering a claim to modesty.\n\nMargot Robbie in Armani Prive for the London premiere of A Big Bold Beautiful Journey. Credit: Samir Hussein/WireImage",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/oxford-street-project-hit-by-92-million-legal-battle-20250910-p5mu2c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Oxford Street project hit by $92 million legal battle",
        "publish_date": "Fri, 12 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Carolyn Cummins"
        ],
        "text": "The $300 million Oxford & Foley development at the heart of Sydney Lord Mayor Clover Moore’s efforts to bring some razzle-dazzle back into Oxford Street is finally nearing completion. But there’s a catch.\n\nAfter facing earlier construction delays, the development welcomed its first retail tenant last week when US rapper Tyler, The Creator triggered a crowd frenzy on Oxford Street as he opened his streetwear brand Golf Wang’s fourth global store while touring Sydney.\n\nTyler, The Creator’s streetwear brand Golf Wang’s fourth global store has opened in Sydney. Credit: Amy Harris/Invision/AP\n\nSony Australia HQ is set to open its doors upstairs next month when the first of the three Oxford & Foley buildings are complete, at 60-120 Oxford Street.\n\nOther tenants preparing to move into the modernised heritage buildings include the cult late-night Italian eatery Big Poppa’s, artisan gelatery Mapo, Mecca Coffee, Bourke Street Bakery co-founder Paul Allam’s new venture Paulies Pizza and luxury cycling apparel brand MAAP.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/the-quiet-man-returns-with-australia-s-first-doubled-barrelled-guinness-tap-20250912-p5muiw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Quiet Man returns with Australia’s first doubled-barrelled Guinness tap",
        "publish_date": "Fri, 12 Sep 2025 11:16:18 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 7 Guinness can be poured even quicker thanks to its double-barrelled tap. Joe Armao 2 / 7 Outside the Kensington pub. Joe Armao 3 / 7 At Enbarr restaurant, pumpkin “porridge” is made with smoked barley. Joe Armao 4 / 7 The Quiet Man hotel in Kensington has been revamped as a modern Irish pub. Joe Armao 5 / 7 Chocolate-orange torte is spiked with Jameson whiskey. Joe Armao 6 / 7 Gin-cured salmon comes with confit fennel, creme fraiche and salmon roe. Joe Armao 7 / 7 Inside the new space. Joe Armao Previous Slide Next Slide\n\nIrish$$$$\n\nLess than six months since Kensington’s Irish pub The Quiet Man shut with a St Patrick’s Day send-off, the Guinness is flowing again – but now through Australia’s only double-barrelled Guinness taps. Able to pour two pints simultaneously, the taps are a freshly installed centrepiece at the pub, which has reopened as Auntie Annie’s Hotel.\n\nNow part of his and O’Neill’s Zengal Hospitality Group – which includes Irish pub Jimmy O’Neill’s in St Kilda and cocktail bar Naughty Nancy’s in Prahran – much of the pub’s former glory has been restored, all in the name of a genuine Irish experience, not a theme park.\n\nIf it were possible to make the pub any more Irish, they’ve done it by adding Enbarr – a 60-seat restaurant with a modern take on the food of Ireland – in The Quiet Man’s former front bar on the corner. Led by Irish chefs Declan McGovern and Aidan Gallagher, the restaurant offers elevated versions of dishes you’d find in Ireland, with a focus on pickling and preserving. That could mean soda bread baked to their grandmother’s specifications; salmon gravlax presented with accoutrements supposed to mimic the colours of the Irish flag; or a “porridge” made from smoked barley paired with pumpkin, goat’s cheese and walnuts.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/instead-of-pashing-my-husband-i-m-watching-jennifer-aniston-with-a-blowdryer-i-m-a-phubber-20250911-p5mueh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Instead of pashing my husband I’m watching Jennifer Aniston with a blowdryer. I’m a phubber",
        "publish_date": "Fri, 12 Sep 2025 11:16:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "Along with considering shoes an investment, trying to make everyone join my gym, narrating out loud whatever I’m doing — “get the porridge on then check Luxury Escapes” — and putting off seeing the doctor until the pneumonia has spread to both lungs, I have a new crap habit.\n\nNew to me at least. It’s more than a decade since phubbing was first named as a trend by an Australian ad agency but I’ve been too busy raising kids and getting on my knees praying that any Outlander seasons after the second would include red-hot sex to buy into it.\n\nIs watching a video of Jennifer Aniston doing Courteney Cox’s hair any excuse to be ignoring your family? Credit: YouTube\n\nYou probably know this already, but phubbing is phone snubbing. Ignoring someone by looking at your phone instead of paying attention to them during a conversation or social situation.\n\nYeah, spot on. The bad manners you upbraided your children about when they were slumped in the passenger seat, ignoring you and texting while you drove them millions of kilometres to sport and parties. Unmoved even by the opening bit of St. Elmo’s Fire (Man in Motion) on Smooth FM.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/zucchini-and-ricotta-tart-20250908-p5mt8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Zucchini and ricotta tart",
        "publish_date": "Fri, 12 Sep 2025 11:15:19 +1000",
        "category": "lifestyle",
        "authors": [
            "Julia Busuttil Nishimura"
        ],
        "text": "Top this simple tart with zucchini rounds (pictured) or asparagus spears. William Meppem\n\nNothing says spring like a simple tart topped with new-season zucchini. Asparagus can also be used instead, making it a versatile recipe for this time of year. I love pecorino with zucchini, but you can also use parmigiano reggiano or grana padano.\n\nThe tart takes only minutes to put together, thanks to good-quality, store-bought puff pastry and the easy assembly. It’s perfect for a light lunch, dinner or picnic. Serve with some dressed leaves for a simple, complete meal.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/sydney-eating-out/new-palm-beach-day-tripper-destination-kicks-off-wave-of-waterfront-openings-20250911-p5mu6h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New Palm Beach day-tripper destination kicks off wave of waterfront openings",
        "publish_date": "Fri, 12 Sep 2025 11:00:00 +1000",
        "category": "finance",
        "authors": [
            "Scott Bolles"
        ],
        "text": "Advertisement\n\nExclusive Eating outComing soon New Palm Beach day-tripper destination kicks off wave of waterfront openings Warm weather, water views: From the northern beaches to Kyle Bay in Sydney’s south, the city is stockpiling new waterside restaurant stock for summer. Scott Bolles September 12, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nNew wine bar and grocer The Corner is set to take over The Boathouse Palm Beach in late September, joining a spring wave of waterside pivots, reboots and launches across Sydney’s hospitality sector. From Palm Beach in the north to Kyle Bay in Sydney’s south, the city is stockpiling new waterside restaurant stock for summer. In November, British celebrity chef Rick Stein is expected to launch a 220-seat restaurant and bar overlooking Coogee Beach, while the team from northern beaches favourite Pilu at Freshwater plans to open Flaminia at Circular Quay. Head chef Sam Kane at upcoming venue The Corner, Palm Beach. Trent van der Jagt The Corner will bring a new concept to the peninsula, says head chef Sam Kane: “I call it a grocery store with a wine bar.” The Boathouse Group partnered with Kane to rebrand the parkside venue occupied by The Boathouse Palm Beach, which is now slated to close on Sunday, September 14.\n\nAdvertisement\n\n“It used to be a homewares store [with] a cafe, but didn’t have any [great] point of difference,” Kane says. “[Now], day-trippers will be able to pop in for supplies, some produce, a sandwich or some sunscreen.” The Corner will be led by seasonal produce. Trent van der Jagt Kane worked at high-profile venues such as Bistro Moncur in Woollahra before relocating north for a five-year stint as head chef at Merivale restaurant Bert’s Bar & Brasserie in Newport. When he left Bert’s to spend more time with his young family, the chef decided to stay on the northern beaches. Inspired by the chef’s relationships with food producers, The Corner plans to sell hard-to-find ingredients Kane himself would like to buy, while offering a strong eat-in program. As well as the daytime eat-in offering, on Friday and Saturday nights Kane will put his kitchen apron back on to pump out an $85 fixed-price dinner.\n\nAdvertisement\n\n“There’ll be some similarities to the way I built dishes at Bert’s, [including] elements of the crudo,” Kane says. “But [the menu] mostly [consists of] new stuff built around the produce and [seafood] out of the Hawkesbury.” Etheus opened at the former home of Promenade Bondi Beach. Steven Woodburn Going Greek One of the emerging trends on the Sydney waterfront is the number of restaurants pivoting to Greek food. Bondi Pavilion restaurant Promenade Bondi Beach recently joined the party, relaunching as Etheus in August. Now, diners plough through plates of spanakorizo or king prawn saganaki as they watch the waves roll in to Bondi Beach. It’s a similar story at Woolloomooloo, where seafood restaurant Manta was reborn as the Greek-leaning restaurant Akti in June, and at Kyle Bay, where Jaaks Restaurant and Bar reopened on Friday, September 12 with a new concept and design revamp.\n\nAdvertisement\n\nJaaks head chef Arman Uz, who drew on his Turkish heritage during his previous role as executive chef for the hospitality group behind Sydney restaurants such as Maydonoz and Baharat, hopes the waterside restaurant can bring Greek island vibes to Sydney’s southern suburbs. The new Jaaks dining room at Kyle Bay. Jaaks is ditching its upmarket, fine-dining pitch, and re-booting as a mezedopolio (tapas bar). “Times have changed,” Uz says. “To me, degustation is a bit boring. Special occasion places, people need to plan [ahead]. [But, within our new format], you can [choose to] come for a couple of dishes, or a set menu.” Greek food isn’t new turf for Uz, who worked at Jaaks when he arrived in Sydney in 2017. He’ll give the dishes his own twist: lakerda (preserved fish) with green tomato and papara, and salmon belly substituted for pork in a retooled version of Cyprus sausages known as sheftalies.\n\nAdvertisement\n\n“Food doesn’t have borders, Turkey and Greece share [many] common dishes,” he says. A selection of mezze at Jaaks. A fresh new fish market Sydney’s appetite for waterside restaurants will also be tested at the redeveloped Sydney Fish Market, where a flood of incoming venues is on the way. Good Food previously revealed Cammeray’s tiny, two-hatted omakase restaurant Sushi Oe has come on board with a new eight-seater. It will be joined by Ichie, a Japanese restaurant focusing on coastal-style hamayaki seafood barbecue, as well as a restaurant from celebrity chef Luke Nguyen, and a spin-off from the popular Malaysian venue Ho Jiak.\n\nAdvertisement\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/a-working-laundromat-is-now-home-to-a-pizza-shop-with-a-difference-20250911-p5mu9k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A working laundromat is now home to a pizza shop with a difference",
        "publish_date": "Fri, 12 Sep 2025 11:00:00 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Advertisement\n\nExclusive Eating outJust open A working laundromat is now home to a pizza shop with a difference While you wait for your washing, dig into a toasted pizza sandwich with wood-fired flavour. You’ll also find St Ali coffee, hybrid matcha-misu and Tarts Anon tarts. Tomas Telegramma September 12, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe only thing more unusual than the location of new eatery Sega is the pizza it serves. Inside a functioning laundromat on Elgin Street in Carlton, the team behind nearby Italian restaurant Al Dente Enoteca are putting their own spin on a style of stuffed pizza found across Italy. The pizza shop is housed inside a functioning laundromat in a glass-walled space that was about to be demolished. Chris Hopkins Chef and co-owner Andrea Vignali wasn’t on the hunt for another venue. But the idea came to him when he was at Soap Spot Laundrette doing washing for the restaurant and noticed a defunct glass-walled cafe space which was once briefly home to coffee shop Two Snakes. “I went back to have another look and saw it about to be demolished ... to put in vending machines,” says Vignali. “The next thing you know I’ve signed a lease on WhatsApp.”\n\nAdvertisement\n\n‘No one really does it like this [in Melbourne].’ Chef Andrea Vignali Structurally, little has changed. Sega has just freshened up the existing cafe space at the front of the laundromat, adding some new seating and splashes of pastel-green paint, which also colour the small but sunny courtyard beyond the washing machines. 1 / 8 Owner-chef Andrea Vignali preparing Sega’s prosciutto di carpegna pizza. Chris Hopkins 2 / 8 Scazzato: salame piccante, fior di latte, smoked provolone, rocket, onion cream and house chilli paste. Chris Hopkins 3 / 8 Outside Sega Pizza Chiusa in Carlton, located within a Soap Spot laundrette on Elgin Street. Chris Hopkins 4 / 8 Porcavacca: smoked beef and horseradish toastie. Chris Hopkins 5 / 8 Sega is the only place you can get Tarts Anon sweets – like pecan slices and tiny rhubarb tarts – outside the latter’s own outlets. Chris Hopkins 6 / 8 Prosciutto di carpegna, stracciatella and aceto balsamico di Modena. Chris Hopkins 7 / 8 “Matchamisu” dessert. Chris Hopkins 8 / 8 Order at the window inside the laundromat. Chris Hopkins Previous Slide Next Slide While cafes in laundromats – functioning or former – aren’t novel in Melbourne, what’s cooking in this one has already caught the attention of Soap Spot’s clientele, largely residents of the surrounding apartment buildings. Sega deals in what the team has dubbed pizza chiusa (“closed” in Italian), inspired by the stuffed pizza farcita found across Italy. Instead of topping the pizza, the good stuff goes inside, creating something like a circular sandwich. At Sega, they cut each pizza base like a bread roll, load it with your fillings of choice and toast it until golden and gooey.\n\nAdvertisement\n\nRelated Article ‘If you see hi-vis, keep going’: Melbourne’s most hidden restaurants and takeaway spots Vignali has collaborated with South Melbourne’s Focacceria Pugliese on a custom pizza dough that’s par-cooked in a wood-fired oven. It’s delivered daily, ready to be filled before it finishes cooking in the sandwich press. “When you eat it from the toaster, it has that wood-fired pizza taste,” says Vignali. “No one really does it like this [in Melbourne].” More classic options include ham and cheese, spicy salami with fior di latte and Vignali’s own chilli paste, and a four-cheese combo of provolone, mozzarella, stracciatella and brie. Others are more cheffy, like one with rare roast beef from Al Dente and horseradish.\n\nAdvertisement\n\nIt’s $22 for a full pizza, $15 for half, and $15 for toasties made with sourdough instead. The offering also includes drinks, such as matcha lattes and St Ali coffee, as well as a green-tinged hybrid tiramisu that combines both products for maximum caffeination. Plus, Sega is the only place you can get Tarts Anon sweets outside the latter’s own locations, so you might find the pastry cabinet lined with anything from pecan slices to tiny rhubarb tarts. Related Article We tried Melbourne’s new drive-through banh mi spot. This is our verdict “The first thing that came to mind when I saw this place was throwing a party in it,” says Vignali. That’s exactly what he’s doing for Sega’s official launch on Sunday, September 14, from 11am to 3pm. There’ll be DJ sets, free samples, and beers and spritzes.\n\nAdvertisement\n\nBreakfast, lunch and dinner daily 63 Elgin Street, Carlton, instagram.com/sega_pizza_chiusa_melbourne Three more venues in totally unexpected locations Drive-through banh mi The best banh mi shops often have queues out the door long before lunchtime. If that’s a turn-off, Banh Mi Vietnam – a drive-through in a wedding reception centre carpark – saves the day. Order through an intercom and wait in your car for ultra-crunchy tiger rolls full to the brim with lemongrass pork, barbecued chicken, cold cuts or ultra-crackly pork. Vietnamese iced coffee and smiley staff take the edge off any delays. 42 Hampstead Road, Maidstone, banhmivn.com Japanese in a service station The Japanese comfort dish of a soft omelette over seasoned rice is the star at Omurice House, a bright little eatery attached to a BP in the eastern suburbs. The style of omurice here is a thick omelette with ribbons of egg that collapse over rice when cut. Panko-crumbed chicken (or pork) and your choice of sauce complete the dish. Use the touch screen to select from classic Japanese curry, Malaysian or even Thai green curry sauce. 240a Mitcham Road, Mitcham, omuricehouse.bitebusiness.com Colombian hot dogs in a car wash A bright addition to busy Dandenong Road, street-food spot Costenisimo specialises in hot dogs, burgers and loaded fries given a Colombian spin. The burgers are meaty things with two smash patties, bacon and shredded chicken, while fries are showered in corn, cheese and garlicky mayo. Throw all preconceptions about hot dogs out the window: these are slathered in cheese and house sauce, with more meaty additions. 258 Dandenong Road, St Kilda East, costenisimo.com.au With Emma Breheny\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/one-of-melbourne-s-most-car-heavy-suburbs-faces-four-month-road-closure-20250910-p5mtyj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "One of Melbourne’s most car-heavy suburbs faces four-month road closure",
        "publish_date": "Fri, 12 Sep 2025 10:59:43 +1000",
        "category": "finance",
        "authors": [
            "Adam Carey"
        ],
        "text": "Getting out of Thornhill Park is never simple, even on the best run.\n\nTo get to the city from this fringe suburb in Melbourne’s west, you must first drive away from the city, merging into fast-moving traffic on the Western Freeway, then turn back the way you came at the Ferris Road overpass.\n\nThornhill Park resident Zak stands at the Alfred Road closure, which has added 45 minutes to his journey to collect his daughter from daycare. Credit: Jason South\n\nThose heading west towards Melton have a second option: Alfred Road. It’s a rural road, with gravel verges and no dividing lines for most of its length, but it’s the quickest way to Cobblebank train station, the closest public transport link for this suburb of 8000 people, which has no public transport of its own.\n\nBut Alfred Road has just been closed for roadworks – for four months.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-as-wall-street-s-run-continues-paramount-eyes-warner-bros-20250912-p5mug7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks, miners drive ASX higher after Wall Street rally",
        "publish_date": "Fri, 12 Sep 2025 10:56:03 +1000",
        "category": "finance",
        "authors": [
            "Stan Choe"
        ],
        "text": "Treasury yields eased in the bond market following the release of economic reports, which were some of the final data releases left that could sway the Federal Reserve’s thinking before its meeting next week. The unanimous expectation on Wall Street is that it will cut its main interest rate for the first time this year.\n\nOne of Thursday’s reports said more US workers applied for unemployment benefits last week, an indication that the number of layoffs could be rising. It’s the latest discouraging signal on the job market, where hiring has slowed substantially. The labour market had seemed to be settling into a low-hire, low-fire state, but an increase in layoffs could put it in an even tighter vise.\n\nThe hope on Wall Street has been for a slowdown, but only for a precisely measured one. The job market has to be worrying enough to get the Fed to cut interest rates, which can give a kickstart to the economy and to prices for investments, but not so weak that it causes a recession.\n\nThe Fed has been hesitant to cut interest rates throughout 2025 because of the threat that President Donald Trump’s tariffs could make inflation worse. That’s because lower interest rates can push inflation even higher.\n\nA report on inflation on Thursday showed prices are continuing to rise faster for US households than the Fed hopes, but only by the amount that economists expected. Consumers paid prices for food, petrol and other costs of living that were 2.9 per cent higher in August than a year earlier, a slight acceleration from July’s 2.7 per cent inflation rate.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/fitzroy-trattoria-alta-reopens-as-cantina-moro-with-a-pivot-to-sicilian-cuisine-20250912-p5mui5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fitzroy trattoria Alta reopens as Cantina Moro with a pivot to Sicilian cuisine",
        "publish_date": "Fri, 12 Sep 2025 10:36:18 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\n1 / 8 Roast chicken stuffed with rice. Simon Schluter 2 / 8 The restaurant is located off Brunswick Street in Fitzroy. Simon Schluter 3 / 8 Pasta di casa. Simon Schluter 4 / 8 Alta Trattoria is now Cantina Moro. Simon Schluter 5 / 8 Torta di paolo dessert. Simon Schluter 6 / 8 Blackened octopus. Simon Schluter 7 / 8 Tuna pastrami. Simon Schluter 8 / 8 Cantina Moro’s head chef Matteo Tine (right). Simon Schluter Previous Slide Next Slide\n\nItalian$$$$\n\nThe team behind Fitzroy trattoria Alta have reopened the space as Cantina Moro, homing in on the food of Sicily and Italy’s south – a pivot from its predecessor’s focus on the northern Italian region of Piedmont.\n\nThe jump from north to south makes sense when you consider new chef Matteo Tine’s Sicilian roots. As at Alta, handmade pasta reigns – from fusilli to potato and ricotta ravioli – but the headline dish builds on what Tine’s nonna would cook on Sundays: a slow-simmered ragu of pork sausage, jowl and ribs with angular shreds of pasta made from just flour and water.\n\nInspired by another of her beloved dishes, Tine is stuffing chicken with a herby, zesty rice mix and roasting it until golden-skinned. It’s served in an “unctuous” gravy that includes whey from stracchino cheese he’s making in-house. In fact, most of the day’s antipasti selection will be house-made, from even-fattier-than-usual mortadella to smoky bluefin tuna pastrami.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/inside-the-great-koala-national-park-20250912-p5muiq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside the Great Koala National Park",
        "publish_date": "Fri, 12 Sep 2025 10:33:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Inside the Great Koala National Park\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-indian-community-leaders-demand-price-apology/3t2yqrt2p",
        "title": "'Doesn't cut the mustard': Indian Australian community leaders demand Price apology",
        "publish_date": "Thu, 11 Sep 2025 22:59:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prominent Indian Australian community members have welcomed Opposition leader Sussan Ley's apology for Jacinta Nampijinpa Price's comments on Indian immigration, but said the Liberal Party still has work to do if it wants to repair the damage.\n\n\n\n\n\nThe lack of a direct apology from the Northern Territory senator for saying Labor was prioritising intake of Indian migrants to bolster its support base also continues to be a source of grievance.\n\n\n\n\n\nAt a press conference on Thursday morning, Ley apologised on behalf of the Liberal Party \"to all Indian Australians and indeed others who were hurt and distressed by the comments\".\n\n\n\n\n\n\"May I reaffirm my strong support for all our migrant communities for the values that they bring to this country, for the contribution they make and for choosing to come to Australia,\" she said.\n\n\n\n\n\nAmar Singh, the founder of Sikh-led food charity Turbans 4 Australia, welcomed the apology but noted the absence of a similar statement from Price.\n\n\n\n\"Sussan as a leader has apologised, which is great, but I think it doesn't cut the mustard,\" Singh told SBS News.\n\n\n\n\n\n\"A person has to be responsible for their own actions,\" Singh said.\n\n\n\n\n\n\"The Liberal Party has their work cut out to repair the damage that's been done.\"\n\n\n\n\n\nSingh said the last week has been difficult for the Australian Indian community.\n\n\n\n\n\n\"It's been really hurtful, un-Australian, and at best a low blow,\" Singh said.\n\n\n\nLISTEN TO 'I won't be silenced': Jacinta Price axed from Coalition frontbench in fallout over Indian migration remarks SBS News 05:34 English\n\nPrice last week falsely claimed the federal government was prioritising Indian migrants to bolster its vote.\n\n\n\n\n\nShe subsequently moved to clarify her remarks , saying she was highlighting general concern for Labor's \"mass migration agenda\".\n\n\n\n\n\nWhen pushed on this further on Wednesday, she said the remarks were \"clumsy\" but again did not apologise.\n\n\n\n\n\nHours later, Price was dumped from the Opposition frontbench , with Ley saying, in addition to Price's lack of apology, \"despite being given sufficient time and space to do so\", her refusal to endorse Ley's leadership had made her position untenable.\n\n\n\nGurmeet Tuli, president of non-profit community organisation Little India Australia, reiterated calls for Price to make a personal apology.\n\n\n\n\n\n\"I believe it was a racial slur,\" Tuli said.\n\n\n\n\n\n\"This is not acceptable; we demand that Jacinta should submit [an] apology as well.\"\n\n\n\n\n\nIn a statement announcing that she had accepted Ley's decision, Price again said she regretted not being clearer in her comments but continued to insist she'd been misunderstood.\n\n\n\n\n\nShe also said Coalition colleagues who had distanced themselves from her remarks had \"chose[n] to indulge agenda-driven media commentary on this matter\".\n\n\n\n\n\nSBS News has contacted Price's office for comment.\n\n\n\n'Unedifying week', Liberal senator says\n\nOn Friday, Liberal senator Jane Hume said there had been \"mishandling on all sides\" of the saga and that she hoped the Coalition learned from it and would move on from it.\n\n\n\n\n\n\"This has been an entirely unedifying week for the Coalition,\" Hume said while appearing on Seven's Sunrise program.\n\n\n\n\n\n\"Not something that we want to repeat. Something we should learn from.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/julie-bishop-vows-to-stay-on-as-anu-chancellor-after-vice-chancellor-quits-following-months-of-controversy/k2mna1162",
        "title": "Julie Bishop hits back at bullying claims and vows to stay at ANU after deputy quits",
        "publish_date": "Thu, 11 Sep 2025 11:21:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "This article contains references to suicide.\n\n\n\n\n\nANU Chancellor Julie Bishop has hit back at allegations by an academic who claimed she was driven close to suicide due to bullying.\n\n\n\n\n\nAt a town hall meeting on Thursday, Bishop said she rejected \"each and every allegation\" by demographer Liz Allen, who alleged she had been \"bullied into near suicide\" when she served on the university's council.\n\n\n\n\n\n\"I reject the allegations that I heard for the first time on the 12th of August that I have treated any staff at ANU with anything other than the greatest respect and civility and courtesy,\" Bishop said.\n\n\n\n\n\nAlllen made the claims at a Senate inquiry last month, alleging the former foreign minister berated her, blocked her from leaving a room and laughed when she became emotional.\n\n\n\nDemographer Liz Allen claimed she was bullied while she served on ANU's council. Source: Supplied Bishop said she only found out about the claims when Allen raised them at the inquiry, and she had since provided a written right of response to the Senate committee.\n\n\n\n\n\nIt came as Bishop announced vice-chancellor Genevieve Bell had tendered her resignation following months of controversy over a $250 million cost-cutting program.\n\n\n\n\n\nBell, whose tenure began in January last year, had been under increasing scrutiny after she spearheaded the measures, which included forced redundancies, to improve the university's dire financial situation.\n\n\n\nAsked if her own position was tenable, Bishop said she intended to remain as chancellor for the rest of her term, which expires at the end of 2026.\n\n\n\n\n\nShe told reporters after the town hall that forced redundancies should be a \"last option\".\n\n\n\n\n\nBell's interim replacement is former Provost Rebekah Brown, who is promising to review the cost-saving \"Renew ANU\" program.\n\n\n\n\n\nFederal Education Minister Jason Clare said \"significant governance concerns at ANU\" had been raised with him and he had referred them to the Tertiary Education Quality and Standards Agency for assessment.\n\n\n\n\n\n\"The resignation of the vice-chancellor and the appointment of her successor are matters for the ANU Council,\" he said.\n\n\n\n\n\nReaders seeking crisis support can ring Lifeline on 13 11 14 or text 0477 13 11 14, the Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged up to 25). More information and support with mental health is available at beyondblue.org.au and on 1300 22 4636.\n\n\n\n\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/us-stocks-benefit-from-oracle-surge-home-ownership-dream-slipping/lva29gz3x",
        "title": "US stocks benefit from Oracle surge; home ownership dream slipping",
        "publish_date": "Thu, 11 Sep 2025 08:19:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/israel-strikes-qatar-why-its-been-a-bad-week-to-be-a-pm-the-real-succession-finale/v3tnyfj2b",
        "title": "Israel strikes Qatar, why it's been a bad week to be a PM & the real 'Succession' finale",
        "publish_date": "Thu, 11 Sep 2025 07:09:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ley-apologises-to-indian-australians-says-price-remains-valued-party-member/li9efqs2v",
        "title": "Ley apologises to Indian Australians, says Price remains 'valued' party member after sacking",
        "publish_date": "Thu, 11 Sep 2025 01:45:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Opposition leader Sussan Ley has apologised to Indian Australians over Jacinta Nampijinpa Price's inflammatory remarks after sacking the senator from the Opposition frontbench.\n\n\n\n\n\n\"May I take this opportunity, as leader of the Liberal Party, to apologise to all Indian Australians and indeed others who were hurt and distressed by the comments that were made,\" Ley said at a press conference on Thursday.\n\n\n\n\n\n\"May I reaffirm my strong support for all our migrant communities for the values that they bring to this country, for the contribution they make and for choosing to come to Australia.\"\n\n\n\n\n\nPrice last week falsely claimed the federal government was prioritising Indian migrants to bolster its vote. She moved to clarify her remarks , saying she was highlighting general concern for Labor's \"mass migration agenda\" and when pushed on this further on Wednesday, said they were \"clumsy\" but again did not apologise. She also refused to endorse Ley's leadership.\n\n\n\nHours later, Price was dumped from the frontbench , with Ley saying the Northern Territory senator had failed to uphold the standards she had set as leader. The Opposition leader said Price had refused to apologise for her remarks that caused Indian Australians \"significant hurt\" , and refused to endorse her leadership, which had made her position untenable.\n\n\n\n\n\nPrice said she accepted the decision, adding she regretted not being clearer when making the comments initially and that she \"never intended to be disparaging towards our Indian community\".\n\n\n\n\n\n\"My concern is not migration itself — it’s the magnitude of migration,\" Price said.\n\n\n\nShe said she would \"continue to speak up on issues which are in the national interest\" from the backbench.\n\n\n\n\n\nLey on Thursday wouldn't divulge her \"private discussions\" with Price, but said she remained a \"valued member\" of the Liberal Party.\n\n\n\n\n\n\"[Price] has contributed much in public policy and debate in this country and will continue to do so,\" Ley said.\n\n\n\nLey said a decision on Price's replacement in the Opposition cabinet will be made in due course.\n\n\n\n\n\nPrice was Opposition spokesperson for defence industry until her demotion.\n\n\n\n\n\nOpposition finance spokesman James Paterson said the axing was disappointing, but was confident his Senate colleague would return to a prominent position within the Liberal party.\n\n\n\n\n\n\"It was self-evidently not an edifying week for the Liberal Party and we are concerned about the way in which Indian Australians heard that discussion and felt about that,\" he told Sky News on Thursday.\n\n\n\n\n\n\"Political careers are not linear any more, they have fits and starts, forward steps and back steps, and I'm confident that Jacinta will be back in a prominent role in the front bench.\"\n\n\n\n\n\nDeputy opposition leader Ted O'Brien said while Price had the freedom to speak out on issues, her comments had to be dealt with and Ley made the right decision.\n\n\n\n\n\n\"Words can sometimes be positive and help someone out, or words can hurt, and I think we all have to be mindful, no matter what we do in life, to try to choose our words as best as we can.\"\n\n\n\n\n\nPrice had defected from the Nationals to sit in the Liberal party room , shortly after the Coalition's election defeat in May.\n\n\n\n\n\n— With reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/the-queensland-school-with-the-best-and-healthiest-tuckshop-meals-20250904-p5msfs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Queensland school with the best (and healthiest) tuckshop meals",
        "publish_date": "Fri, 12 Sep 2025 11:50:51 +1000",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt"
        ],
        "text": "A Gold Coast school’s taco roll has been crowned the best tuckshop meal in Queensland from a list of finalists with sneaky healthy twists on child-friendly favourites.\n\nNutrition was packed into each of the seven shortlisted finalists for the Queensland Association of School Tuckshops’ recipes of the year – which included the likes of mac and cheese and two-minute noodles – through various vegetables grated, blended and blitzed into the meals.\n\nThe association crowned Coombabah State School’s taco rolls as 2025’s tuckshop recipe of the year.\n\nCoombabah State School’s taco rolls were called an “obvious winner” by judges. Credit: Queensland Association of School Tuckshops\n\nThe judging panel, made from students and Queensland Association of School Tuckshops members, said the recipe was an “obvious winner”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/change-agent-meet-nuno-matos-the-no-nonsense-ceo-whipping-anz-into-shape-20250911-p5mue5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Change agent’: Meet Nuno Matos, the no nonsense CEO whipping ANZ into shape",
        "publish_date": "Fri, 12 Sep 2025 11:50:21 +1000",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "His wife Maria is Peruvian, they have two grown-up sons, and he has said that at home they speak three languages. “We are kind of a United Nations at home,” he said last year. He’s an ocean swimmer, a keen reader of history, and he and his wife are looking for a home in Melbourne (and living in the Park Hyatt while they search for a place, The Australian Financial Review reported). Matos has said that ambition is one of his most important leadership beliefs,. About a decade ago, he started aspiring to run an international organisation, or a big domestic bank in an important market. He got a chance to realise this ambition when ANZ’s board, chaired by Paul O’Sullivan, picked the banker as ANZ’s next chief executive late last year, soon after he had resigned from one of the biggest banks in the world, HSBC. Matos had risen to run HSBC’s personal and wealth arm, and was reportedly seen as a contender to run HSBC, but missed out on the top job and left the London-headquartered giant in August 2024. He is paid $2.5 million a year to run ANZ, with the potential to make more than $8 million including bonuses, depending on whether he hits performance targets.\n\nWhile ANZ is one of the biggest companies in Australia with 43,000 globally, at HSBC Matos was responsible for a business with twice as many employees. He also led the HSBC response to a massive money laundering scandal in Mexico – a high-stakes clean-up task that lasted years. Although he had not experienced Australia’s banking market firsthand before taking the job, he said this week he had observed it from Asia. One market participant who has met Matos says he appears keen to listen – in contrast to some offshore chief executives who have appeared to think they know what is best when they turned up in Australia. They say that in person, Matos comes across as low-key, serious and analytical. “He’s very different to other CEOs who have come from abroad to Australia. He was really interested in what people have to say,” they said. Loading While we don’t know all his plans for ANZ yet – key details are expected at a strategy day next month – Matos has flagged some key principles. Some of his top priorities are to get the bank moving faster and to make its culture more performance-driven. He has suggested ANZ staff keep presentations to no more than five pages, and staff were also told meetings should have a clear purpose and agenda. The bank has also recently reminded staff they needed to turn up to the office at least 50 per cent of the time to get a bonus. Like many other corporate bosses, he believes spending some time in the office is important for career development, as well as mental health.\n\n“It’s not easy to observe and to evolve if you are on Zooms and Teams … that face-to-face conversation is much more effective,” he said last month, according to The West Australian. Even before this week’s deep job cuts were announced, some ANZ staff had criticised or ridiculed Matos’ approach, with some hitting the chat platform Reddit to vent. Giving him nicknames such as “Papi” and “El Nuno”, some of these staff members anonymously made fun of the boss, while railing against the changes he is bringing. ANZ shares have lagged the bigger three rivals. Credit: Natalie Boog The Finance Sector Union has also been highly critical of the speed at which Matos is moving. The union said the pace of change pushed through by him caused last month’s infamous email chaos – staff found out they were being sacked through an automated email telling them to return their laptop. Banking analysts and investors are generally more supportive of Matos’ changes, though some say his plans are not without risk.\n\nThey believe change is needed mainly because ANZ is underperforming. Its shares have lagged the bigger three rivals and several bank-watchers think there is room to reduce costs. MST Marquee analyst Brian Johnson believes there is “a degree of over-staffing” in the bank, but he had thought cuts would involve about 2000 jobs, rather than the 3500 target Matos announced. Johnson says there is “execution risk” that comes with cutting as deeply as this, but overall, he says the status quo at ANZ was not acceptable to shareholders. Loading “I actually think he’s a change agent. I think that he is genuinely motivated about fixing it up,” Johnson says of Matos. There has been widespread speculation among analysts that with the job cuts announced this week, an October strategy will include details about more financial targets for the bank. Matos has also indicated that a big priority will be to deal with the expensive digital platform ANZ Plus, which has underwhelmed the market. Some think he could pull back on the ambitious tech project.\n\nImproving how the bank deals with non-financial risk is also high on Matos’ to-do list. The bank is still awaiting the results of a regulatory investigation into potential “conduct issues” in its markets business, and is holding $1 billion in extra capital due to the banking regulator’s long-standing concerns about weaknesses in ANZ’s risk management. Investors say there are plenty of areas where ANZ needs work, and some said this week that Matos could cut the bank’s dividend as part of a “clearing of the decks”. Importantly, Matos said this week that ANZ also had many strengths – such as being the most international of the Australian banks and having a flagship institutional bank – but he added that “we need to do some things better”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/swimming/ok-that-s-enough-for-me-why-thorpe-nearly-quit-after-sydney-olympics-glory-20250912-p5mui6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘OK, that’s enough for me’: Why Thorpe nearly quit after Sydney Olympics glory",
        "publish_date": "Fri, 12 Sep 2025 11:47:05 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size After 25 years, Ian Thorpe has lost count of how many strangers swear they were inside the Sydney International Aquatic Centre on the night of September 16, 2000. It was the night Thorpe, a 17-year-old with size-17 feet, touched the wall first in the 400-metre freestyle final to claim Australia’s first gold medal of the Sydney Olympics. Just over an hour later, Thorpe dived back in to anchor the men’s 4x100m freestyle relay, chasing down American superstar Gary Hall jnr to deliver a historic victory — capped by the famous air-guitar celebration that instantly entered folklore. When stopped on the street, Thorpe’s response is always the same. “I was there too!” Australia’s Ian Thorpe shows off his gold medal following the men’s 400-metre freestyle swimming event at the Sydney 2000 Olympic Games. Credit: Sygma via Getty Images The stories rarely stop there. Thorpe has heard them all.\n\nAdvertisement\n\nThere were the fans who refused to board their flight so they wouldn’t miss his race. An excited woman once told Thorpe she gave birth while cheering him on. “I was like, ‘why were you watching?’” he says, laughing. We are sitting in a quiet corner of the same arena which once served as Thorpe’s coliseum a quarter of a century ago, where millions around the world watched his brilliance. Next week marks 25 years since the Sydney 2000 Olympics. After a quick photoshoot beside his favourite lane four block, Thorpe, now 42, affords himself a moment to take it all in. Only a handful of public swimmers are using the pool, which allows Thorpe a rare hour away from the glare of being one of the world’s most recognisable athletes. A world champion at 15, Thorpe lost all anonymity with his three gold and two silver medals in Sydney. Ian Thorpe dives in at the Sydney Olympics. Credit: Dallas Kilponen\n\nAdvertisement\n\n“This pool is very familiar to me,” Thorpe says. “It doesn’t feel like it was a generation ago, but it doesn’t feel like it was yesterday either. It feels like just over a decade ago. “It’s not like I ever get to sit here and ponder my thoughts.” Now he is, and the memories rush back — though some are hazy after the whirlwind of those 16 glorious days in 2000. What Thorpe never revealed publicly is that, for a fleeting moment, he considered walking away from swimming altogether after Sydney. It is a stunning admission. As Thorpe carried the Australian flag at the closing ceremony, with fireworks flashing above the Olympic stadium after performances from Kylie Minogue, Midnight Oil and INXS, Thorpe imagined a life away from the pool, free from the suffocating pressure. “I actually thought, ‘okay, that’s enough for me. I’ve done everything I set out to do’,” Thorpe says. “My goal when I was young was to be an Olympian and my dream was to be an Olympic champion.\n\nAdvertisement\n\nMichael Klim, Ian Thorpe and Grant Hackett enjoying the closing ceremony. Credit: 2000 “It’s like saying, ‘I want to be an astronaut’. To be an Olympic champion is like going into space. Not many get to do it. I had accomplished that and considered for a very brief moment [walking away]. The closing ceremony was over and it was actually when the fighter jets were flying over the stadium. “I then had a break, which I was having anyway, and in a great way, my world expanded. It was the inspiration that I got outside the pool that got me back in.” The pressure to perform in Sydney was immense, especially in the 400m freestyle, where Thorpe was the overwhelming favourite. “It was tough,” Thorpe says. “It was assumed I would just win … but I’m 17 and there’s a human behind all of this. Yeah, I can do extraordinary things, but I’m as awkward and uncomfortable as any 17-year-old in the world. I broke my leg less than a year out from the Olympics. People don’t remember that. I was also accused of doping by the German head coach. It wasn’t smooth sailing. I had doubts in myself until I heard the crowd roar, which gave me a brief second out of my head. That was what I needed to flick into race mode. “I didn’t know this until really recently, but they put the 400m freestyle and the men’s 4x100m freestyle relay on the same night so the Sydney Olympics would go off with a bang. I’m glad they didn’t tell me that.” Australian teammates (from left) Ashley Callus, Chris Fydler, Michael Klim and Ian Thorpe celebrate after winning gold and setting a new world record in the men’s 4X100m freestyle relay event at the Sydney Olympics in 2000. Credit: Rod Taylor\n\nAdvertisement\n\nAfter breaking the 400m freestyle world record, despite being told by a senior coach to conserve energy - “that’s a really bad thing to say to an athlete” - Thorpe had just an hour to prepare for a relay. The USA had never been beaten in the event. A swimsuit malfunction almost cost Thorpe his place on the blocks, but his nerves eased when Australia’s lead-off man, Michael Klim, blitzed the first two laps. “You broke the world record,” Thorpe told Klim. “But what was my time?” Klim asked. “I can’t remember. Faster than anyone in history.” Thorpe adds: “I must have looked at Michael like, ‘do not ask me again’. He was banging my block. I looked up at him and said ‘f—k off, that is not going to help me’. It was distracting but I was ready to race.” After diving in almost level, Hall quickly surged ahead, silencing the Sydney crowd. But in the final 15 metres, ‘Thorpedo’ had other ideas.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/margot-robbie-s-risque-red-carpet-tribute-to-armani-20250912-p5muhp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Margot Robbie’s risque red-carpet tribute to Armani",
        "publish_date": "Fri, 12 Sep 2025 11:30:30 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "As far as tributes go, the risque Giorgio Armani dress worn by Margot Robbie to a London movie premiere trumps an eloquent eulogy or lace-trimmed bereavement card.\n\nDays after the Italian designer’s death at the age of 91, Robbie selected a see-through gown from the Armani Prive spring 2025 collection, embellished with floral and paisley motifs in crystals and gems, to wear alongside actor Colin Farrell for the premiere of A Big Bold Beautiful Journey.\n\nWhile the scant tapestry design was minimal at the front, there was even less at the back, with the spaghetti straps criss-crossing before descending dangerously low, with a matching thong offering a claim to modesty.\n\nMargot Robbie in Armani Prive for the London premiere of A Big Bold Beautiful Journey. Credit: Samir Hussein/WireImage",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/oxford-street-project-hit-by-92-million-legal-battle-20250910-p5mu2c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Oxford Street project hit by $92 million legal battle",
        "publish_date": "Fri, 12 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Carolyn Cummins"
        ],
        "text": "The $300 million Oxford & Foley development at the heart of Sydney Lord Mayor Clover Moore’s efforts to bring some razzle-dazzle back into Oxford Street is finally nearing completion. But there’s a catch.\n\nAfter facing earlier construction delays, the development welcomed its first retail tenant last week when US rapper Tyler, The Creator triggered a crowd frenzy on Oxford Street as he opened his streetwear brand Golf Wang’s fourth global store while touring Sydney.\n\nTyler, The Creator’s streetwear brand Golf Wang’s fourth global store has opened in Sydney. Credit: Amy Harris/Invision/AP\n\nSony Australia HQ is set to open its doors upstairs next month when the first of the three Oxford & Foley buildings are complete, at 60-120 Oxford Street.\n\nOther tenants preparing to move into the modernised heritage buildings include the cult late-night Italian eatery Big Poppa’s, artisan gelatery Mapo, Mecca Coffee, Bourke Street Bakery co-founder Paul Allam’s new venture Paulies Pizza and luxury cycling apparel brand MAAP.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/the-quiet-man-returns-with-australia-s-first-doubled-barrelled-guinness-tap-20250912-p5muiw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Quiet Man returns with Australia’s first doubled-barrelled Guinness tap",
        "publish_date": "Fri, 12 Sep 2025 11:16:18 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 7 Guinness can be poured even quicker thanks to its double-barrelled tap. Joe Armao 2 / 7 Outside the Kensington pub. Joe Armao 3 / 7 At Enbarr restaurant, pumpkin “porridge” is made with smoked barley. Joe Armao 4 / 7 The Quiet Man hotel in Kensington has been revamped as a modern Irish pub. Joe Armao 5 / 7 Chocolate-orange torte is spiked with Jameson whiskey. Joe Armao 6 / 7 Gin-cured salmon comes with confit fennel, creme fraiche and salmon roe. Joe Armao 7 / 7 Inside the new space. Joe Armao Previous Slide Next Slide\n\nIrish$$$$\n\nLess than six months since Kensington’s Irish pub The Quiet Man shut with a St Patrick’s Day send-off, the Guinness is flowing again – but now through Australia’s only double-barrelled Guinness taps. Able to pour two pints simultaneously, the taps are a freshly installed centrepiece at the pub, which has reopened as Auntie Annie’s Hotel.\n\nNow part of his and O’Neill’s Zengal Hospitality Group – which includes Irish pub Jimmy O’Neill’s in St Kilda and cocktail bar Naughty Nancy’s in Prahran – much of the pub’s former glory has been restored, all in the name of a genuine Irish experience, not a theme park.\n\nIf it were possible to make the pub any more Irish, they’ve done it by adding Enbarr – a 60-seat restaurant with a modern take on the food of Ireland – in The Quiet Man’s former front bar on the corner. Led by Irish chefs Declan McGovern and Aidan Gallagher, the restaurant offers elevated versions of dishes you’d find in Ireland, with a focus on pickling and preserving. That could mean soda bread baked to their grandmother’s specifications; salmon gravlax presented with accoutrements supposed to mimic the colours of the Irish flag; or a “porridge” made from smoked barley paired with pumpkin, goat’s cheese and walnuts.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/instead-of-pashing-my-husband-i-m-watching-jennifer-aniston-with-a-blowdryer-i-m-a-phubber-20250911-p5mueh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Instead of pashing my husband I’m watching Jennifer Aniston with a blowdryer. I’m a phubber",
        "publish_date": "Fri, 12 Sep 2025 11:16:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "Along with considering shoes an investment, trying to make everyone join my gym, narrating out loud whatever I’m doing — “get the porridge on then check Luxury Escapes” — and putting off seeing the doctor until the pneumonia has spread to both lungs, I have a new crap habit.\n\nNew to me at least. It’s more than a decade since phubbing was first named as a trend by an Australian ad agency but I’ve been too busy raising kids and getting on my knees praying that any Outlander seasons after the second would include red-hot sex to buy into it.\n\nIs watching a video of Jennifer Aniston doing Courteney Cox’s hair any excuse to be ignoring your family? Credit: YouTube\n\nYou probably know this already, but phubbing is phone snubbing. Ignoring someone by looking at your phone instead of paying attention to them during a conversation or social situation.\n\nYeah, spot on. The bad manners you upbraided your children about when they were slumped in the passenger seat, ignoring you and texting while you drove them millions of kilometres to sport and parties. Unmoved even by the opening bit of St. Elmo’s Fire (Man in Motion) on Smooth FM.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/zucchini-and-ricotta-tart-20250908-p5mt8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Zucchini and ricotta tart",
        "publish_date": "Fri, 12 Sep 2025 11:15:19 +1000",
        "category": "lifestyle",
        "authors": [
            "Julia Busuttil Nishimura"
        ],
        "text": "Top this simple tart with zucchini rounds (pictured) or asparagus spears. William Meppem\n\nNothing says spring like a simple tart topped with new-season zucchini. Asparagus can also be used instead, making it a versatile recipe for this time of year. I love pecorino with zucchini, but you can also use parmigiano reggiano or grana padano.\n\nThe tart takes only minutes to put together, thanks to good-quality, store-bought puff pastry and the easy assembly. It’s perfect for a light lunch, dinner or picnic. Serve with some dressed leaves for a simple, complete meal.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/sydney-eating-out/new-palm-beach-day-tripper-destination-kicks-off-wave-of-waterfront-openings-20250911-p5mu6h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New Palm Beach day-tripper destination kicks off wave of waterfront openings",
        "publish_date": "Fri, 12 Sep 2025 11:00:00 +1000",
        "category": "finance",
        "authors": [
            "Scott Bolles"
        ],
        "text": "Advertisement\n\nExclusive Eating outComing soon New Palm Beach day-tripper destination kicks off wave of waterfront openings Warm weather, water views: From the northern beaches to Kyle Bay in Sydney’s south, the city is stockpiling new waterside restaurant stock for summer. Scott Bolles September 12, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nNew wine bar and grocer The Corner is set to take over The Boathouse Palm Beach in late September, joining a spring wave of waterside pivots, reboots and launches across Sydney’s hospitality sector. From Palm Beach in the north to Kyle Bay in Sydney’s south, the city is stockpiling new waterside restaurant stock for summer. In November, British celebrity chef Rick Stein is expected to launch a 220-seat restaurant and bar overlooking Coogee Beach, while the team from northern beaches favourite Pilu at Freshwater plans to open Flaminia at Circular Quay. Head chef Sam Kane at upcoming venue The Corner, Palm Beach. Trent van der Jagt The Corner will bring a new concept to the peninsula, says head chef Sam Kane: “I call it a grocery store with a wine bar.” The Boathouse Group partnered with Kane to rebrand the parkside venue occupied by The Boathouse Palm Beach, which is now slated to close on Sunday, September 14.\n\nAdvertisement\n\n“It used to be a homewares store [with] a cafe, but didn’t have any [great] point of difference,” Kane says. “[Now], day-trippers will be able to pop in for supplies, some produce, a sandwich or some sunscreen.” The Corner will be led by seasonal produce. Trent van der Jagt Kane worked at high-profile venues such as Bistro Moncur in Woollahra before relocating north for a five-year stint as head chef at Merivale restaurant Bert’s Bar & Brasserie in Newport. When he left Bert’s to spend more time with his young family, the chef decided to stay on the northern beaches. Inspired by the chef’s relationships with food producers, The Corner plans to sell hard-to-find ingredients Kane himself would like to buy, while offering a strong eat-in program. As well as the daytime eat-in offering, on Friday and Saturday nights Kane will put his kitchen apron back on to pump out an $85 fixed-price dinner.\n\nAdvertisement\n\n“There’ll be some similarities to the way I built dishes at Bert’s, [including] elements of the crudo,” Kane says. “But [the menu] mostly [consists of] new stuff built around the produce and [seafood] out of the Hawkesbury.” Etheus opened at the former home of Promenade Bondi Beach. Steven Woodburn Going Greek One of the emerging trends on the Sydney waterfront is the number of restaurants pivoting to Greek food. Bondi Pavilion restaurant Promenade Bondi Beach recently joined the party, relaunching as Etheus in August. Now, diners plough through plates of spanakorizo or king prawn saganaki as they watch the waves roll in to Bondi Beach. It’s a similar story at Woolloomooloo, where seafood restaurant Manta was reborn as the Greek-leaning restaurant Akti in June, and at Kyle Bay, where Jaaks Restaurant and Bar reopened on Friday, September 12 with a new concept and design revamp.\n\nAdvertisement\n\nJaaks head chef Arman Uz, who drew on his Turkish heritage during his previous role as executive chef for the hospitality group behind Sydney restaurants such as Maydonoz and Baharat, hopes the waterside restaurant can bring Greek island vibes to Sydney’s southern suburbs. The new Jaaks dining room at Kyle Bay. Jaaks is ditching its upmarket, fine-dining pitch, and re-booting as a mezedopolio (tapas bar). “Times have changed,” Uz says. “To me, degustation is a bit boring. Special occasion places, people need to plan [ahead]. [But, within our new format], you can [choose to] come for a couple of dishes, or a set menu.” Greek food isn’t new turf for Uz, who worked at Jaaks when he arrived in Sydney in 2017. He’ll give the dishes his own twist: lakerda (preserved fish) with green tomato and papara, and salmon belly substituted for pork in a retooled version of Cyprus sausages known as sheftalies.\n\nAdvertisement\n\n“Food doesn’t have borders, Turkey and Greece share [many] common dishes,” he says. A selection of mezze at Jaaks. A fresh new fish market Sydney’s appetite for waterside restaurants will also be tested at the redeveloped Sydney Fish Market, where a flood of incoming venues is on the way. Good Food previously revealed Cammeray’s tiny, two-hatted omakase restaurant Sushi Oe has come on board with a new eight-seater. It will be joined by Ichie, a Japanese restaurant focusing on coastal-style hamayaki seafood barbecue, as well as a restaurant from celebrity chef Luke Nguyen, and a spin-off from the popular Malaysian venue Ho Jiak.\n\nAdvertisement\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/a-working-laundromat-is-now-home-to-a-pizza-shop-with-a-difference-20250911-p5mu9k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A working laundromat is now home to a pizza shop with a difference",
        "publish_date": "Fri, 12 Sep 2025 11:00:00 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Advertisement\n\nExclusive Eating outJust open A working laundromat is now home to a pizza shop with a difference While you wait for your washing, dig into a toasted pizza sandwich with wood-fired flavour. You’ll also find St Ali coffee, hybrid matcha-misu and Tarts Anon tarts. Tomas Telegramma September 12, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe only thing more unusual than the location of new eatery Sega is the pizza it serves. Inside a functioning laundromat on Elgin Street in Carlton, the team behind nearby Italian restaurant Al Dente Enoteca are putting their own spin on a style of stuffed pizza found across Italy. The pizza shop is housed inside a functioning laundromat in a glass-walled space that was about to be demolished. Chris Hopkins Chef and co-owner Andrea Vignali wasn’t on the hunt for another venue. But the idea came to him when he was at Soap Spot Laundrette doing washing for the restaurant and noticed a defunct glass-walled cafe space which was once briefly home to coffee shop Two Snakes. “I went back to have another look and saw it about to be demolished ... to put in vending machines,” says Vignali. “The next thing you know I’ve signed a lease on WhatsApp.”\n\nAdvertisement\n\n‘No one really does it like this [in Melbourne].’ Chef Andrea Vignali Structurally, little has changed. Sega has just freshened up the existing cafe space at the front of the laundromat, adding some new seating and splashes of pastel-green paint, which also colour the small but sunny courtyard beyond the washing machines. 1 / 8 Owner-chef Andrea Vignali preparing Sega’s prosciutto di carpegna pizza. Chris Hopkins 2 / 8 Scazzato: salame piccante, fior di latte, smoked provolone, rocket, onion cream and house chilli paste. Chris Hopkins 3 / 8 Outside Sega Pizza Chiusa in Carlton, located within a Soap Spot laundrette on Elgin Street. Chris Hopkins 4 / 8 Porcavacca: smoked beef and horseradish toastie. Chris Hopkins 5 / 8 Sega is the only place you can get Tarts Anon sweets – like pecan slices and tiny rhubarb tarts – outside the latter’s own outlets. Chris Hopkins 6 / 8 Prosciutto di carpegna, stracciatella and aceto balsamico di Modena. Chris Hopkins 7 / 8 “Matchamisu” dessert. Chris Hopkins 8 / 8 Order at the window inside the laundromat. Chris Hopkins Previous Slide Next Slide While cafes in laundromats – functioning or former – aren’t novel in Melbourne, what’s cooking in this one has already caught the attention of Soap Spot’s clientele, largely residents of the surrounding apartment buildings. Sega deals in what the team has dubbed pizza chiusa (“closed” in Italian), inspired by the stuffed pizza farcita found across Italy. Instead of topping the pizza, the good stuff goes inside, creating something like a circular sandwich. At Sega, they cut each pizza base like a bread roll, load it with your fillings of choice and toast it until golden and gooey.\n\nAdvertisement\n\nRelated Article ‘If you see hi-vis, keep going’: Melbourne’s most hidden restaurants and takeaway spots Vignali has collaborated with South Melbourne’s Focacceria Pugliese on a custom pizza dough that’s par-cooked in a wood-fired oven. It’s delivered daily, ready to be filled before it finishes cooking in the sandwich press. “When you eat it from the toaster, it has that wood-fired pizza taste,” says Vignali. “No one really does it like this [in Melbourne].” More classic options include ham and cheese, spicy salami with fior di latte and Vignali’s own chilli paste, and a four-cheese combo of provolone, mozzarella, stracciatella and brie. Others are more cheffy, like one with rare roast beef from Al Dente and horseradish.\n\nAdvertisement\n\nIt’s $22 for a full pizza, $15 for half, and $15 for toasties made with sourdough instead. The offering also includes drinks, such as matcha lattes and St Ali coffee, as well as a green-tinged hybrid tiramisu that combines both products for maximum caffeination. Plus, Sega is the only place you can get Tarts Anon sweets outside the latter’s own locations, so you might find the pastry cabinet lined with anything from pecan slices to tiny rhubarb tarts. Related Article We tried Melbourne’s new drive-through banh mi spot. This is our verdict “The first thing that came to mind when I saw this place was throwing a party in it,” says Vignali. That’s exactly what he’s doing for Sega’s official launch on Sunday, September 14, from 11am to 3pm. There’ll be DJ sets, free samples, and beers and spritzes.\n\nAdvertisement\n\nBreakfast, lunch and dinner daily 63 Elgin Street, Carlton, instagram.com/sega_pizza_chiusa_melbourne Three more venues in totally unexpected locations Drive-through banh mi The best banh mi shops often have queues out the door long before lunchtime. If that’s a turn-off, Banh Mi Vietnam – a drive-through in a wedding reception centre carpark – saves the day. Order through an intercom and wait in your car for ultra-crunchy tiger rolls full to the brim with lemongrass pork, barbecued chicken, cold cuts or ultra-crackly pork. Vietnamese iced coffee and smiley staff take the edge off any delays. 42 Hampstead Road, Maidstone, banhmivn.com Japanese in a service station The Japanese comfort dish of a soft omelette over seasoned rice is the star at Omurice House, a bright little eatery attached to a BP in the eastern suburbs. The style of omurice here is a thick omelette with ribbons of egg that collapse over rice when cut. Panko-crumbed chicken (or pork) and your choice of sauce complete the dish. Use the touch screen to select from classic Japanese curry, Malaysian or even Thai green curry sauce. 240a Mitcham Road, Mitcham, omuricehouse.bitebusiness.com Colombian hot dogs in a car wash A bright addition to busy Dandenong Road, street-food spot Costenisimo specialises in hot dogs, burgers and loaded fries given a Colombian spin. The burgers are meaty things with two smash patties, bacon and shredded chicken, while fries are showered in corn, cheese and garlicky mayo. Throw all preconceptions about hot dogs out the window: these are slathered in cheese and house sauce, with more meaty additions. 258 Dandenong Road, St Kilda East, costenisimo.com.au With Emma Breheny\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/one-of-melbourne-s-most-car-heavy-suburbs-faces-four-month-road-closure-20250910-p5mtyj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "One of Melbourne’s most car-heavy suburbs faces four-month road closure",
        "publish_date": "Fri, 12 Sep 2025 10:59:43 +1000",
        "category": "finance",
        "authors": [
            "Adam Carey"
        ],
        "text": "Getting out of Thornhill Park is never simple, even on the best run.\n\nTo get to the city from this fringe suburb in Melbourne’s west, you must first drive away from the city, merging into fast-moving traffic on the Western Freeway, then turn back the way you came at the Ferris Road overpass.\n\nThornhill Park resident Zak stands at the Alfred Road closure, which has added 45 minutes to his journey to collect his daughter from daycare. Credit: Jason South\n\nThose heading west towards Melton have a second option: Alfred Road. It’s a rural road, with gravel verges and no dividing lines for most of its length, but it’s the quickest way to Cobblebank train station, the closest public transport link for this suburb of 8000 people, which has no public transport of its own.\n\nBut Alfred Road has just been closed for roadworks – for four months.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-as-wall-street-s-run-continues-paramount-eyes-warner-bros-20250912-p5mug7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks, miners drive ASX higher after Wall Street rally",
        "publish_date": "Fri, 12 Sep 2025 10:56:03 +1000",
        "category": "finance",
        "authors": [
            "Stan Choe"
        ],
        "text": "Treasury yields eased in the bond market following the release of economic reports, which were some of the final data releases left that could sway the Federal Reserve’s thinking before its meeting next week. The unanimous expectation on Wall Street is that it will cut its main interest rate for the first time this year.\n\nOne of Thursday’s reports said more US workers applied for unemployment benefits last week, an indication that the number of layoffs could be rising. It’s the latest discouraging signal on the job market, where hiring has slowed substantially. The labour market had seemed to be settling into a low-hire, low-fire state, but an increase in layoffs could put it in an even tighter vise.\n\nThe hope on Wall Street has been for a slowdown, but only for a precisely measured one. The job market has to be worrying enough to get the Fed to cut interest rates, which can give a kickstart to the economy and to prices for investments, but not so weak that it causes a recession.\n\nThe Fed has been hesitant to cut interest rates throughout 2025 because of the threat that President Donald Trump’s tariffs could make inflation worse. That’s because lower interest rates can push inflation even higher.\n\nA report on inflation on Thursday showed prices are continuing to rise faster for US households than the Fed hopes, but only by the amount that economists expected. Consumers paid prices for food, petrol and other costs of living that were 2.9 per cent higher in August than a year earlier, a slight acceleration from July’s 2.7 per cent inflation rate.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/fitzroy-trattoria-alta-reopens-as-cantina-moro-with-a-pivot-to-sicilian-cuisine-20250912-p5mui5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fitzroy trattoria Alta reopens as Cantina Moro with a pivot to Sicilian cuisine",
        "publish_date": "Fri, 12 Sep 2025 10:36:18 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\n1 / 8 Roast chicken stuffed with rice. Simon Schluter 2 / 8 The restaurant is located off Brunswick Street in Fitzroy. Simon Schluter 3 / 8 Pasta di casa. Simon Schluter 4 / 8 Alta Trattoria is now Cantina Moro. Simon Schluter 5 / 8 Torta di paolo dessert. Simon Schluter 6 / 8 Blackened octopus. Simon Schluter 7 / 8 Tuna pastrami. Simon Schluter 8 / 8 Cantina Moro’s head chef Matteo Tine (right). Simon Schluter Previous Slide Next Slide\n\nItalian$$$$\n\nThe team behind Fitzroy trattoria Alta have reopened the space as Cantina Moro, homing in on the food of Sicily and Italy’s south – a pivot from its predecessor’s focus on the northern Italian region of Piedmont.\n\nThe jump from north to south makes sense when you consider new chef Matteo Tine’s Sicilian roots. As at Alta, handmade pasta reigns – from fusilli to potato and ricotta ravioli – but the headline dish builds on what Tine’s nonna would cook on Sundays: a slow-simmered ragu of pork sausage, jowl and ribs with angular shreds of pasta made from just flour and water.\n\nInspired by another of her beloved dishes, Tine is stuffing chicken with a herby, zesty rice mix and roasting it until golden-skinned. It’s served in an “unctuous” gravy that includes whey from stracchino cheese he’s making in-house. In fact, most of the day’s antipasti selection will be house-made, from even-fattier-than-usual mortadella to smoky bluefin tuna pastrami.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/inside-the-great-koala-national-park-20250912-p5muiq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside the Great Koala National Park",
        "publish_date": "Fri, 12 Sep 2025 10:33:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Inside the Great Koala National Park\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/virgin-add-thousands-flights-afl-102820681.html",
        "title": "Virgin add extra seats for AFL finals",
        "publish_date": "2025-09-12T01:17:49Z",
        "category": "sports",
        "authors": [],
        "text": "Additional flights will be available for football fans heading to Melbourne for the 2025 AFL preliminary finals.\n\nFrom Monday, extra seats bound for Melbourne will be available on return services from Adelaide, Brisbane or the Gold Coast.\n\nThe airline is expected to confirm the extra flights after 5pm on Monday following the semi-final matches this weekend, which include three interstate sides from South Australia and Queensland.\n\nVirgin Australia will have additional flights for football tragics heading to Melbourne for the 2025 AFL Preliminary Finals. Picture: NewsWire / Nicholas Eagar\n\nVirgin Australia will release additional flights to Melbourne for the AFL Preliminary Finals after 5pm on Monday. Picture: NewsWire/Nadir Kinani\n\nA Virgin Australia spokesman said it would give interstate footy fans more travel options to see their teams play in Melbourne.\n\nAdditional return services from either Adelaide, Brisbane or the Gold Coast will be confirmed by the airline by 5pm on Monday.\n\nVirgin Australia is the official airline of the AFL.",
        "source": "Yahoo"
    }
]