[
    {
        "url": "https://www.9news.com.au/finance/inflation-australia-february-monthly-consumer-price-index-abs/d597836b-19fc-4736-9eb0-489dff826c07",
        "title": "Inflation slows again less than a week from RBA rates call",
        "publish_date": "Wed, 26 Mar 2025 00:59:27 +0000",
        "category": "finance",
        "authors": [
            "Mar"
        ],
        "text": "The monthly consumer price index (CPI) figures from the Australian Bureau of Statistics showed headline inflation slowed to 2.4 per cent over the 12 months to February, still well within the\n\nReserve Bank's\n\ntarget band and down from 2.5 per cent the month before.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-budget-2025-winners-and-losers-taxpayers-bill-payers-women-student-debt-renters/8a56cb66-1948-459d-9c64-edd3bb8fd4fa",
        "title": "WINNERS, LOSERS AND SURPRISE TAX CUT",
        "publish_date": "Tue, 25 Mar 2025 08:45:20 +0000",
        "category": "finance",
        "authors": [
            "Mar"
        ],
        "text": "Treasurer Jim Chalmers has handed down his fourth federal budget – the last before his government heads to the polls for this year's election.\n\nWhile once again the treasurer is promoting the policies as helping out all Australians, as always some groups will look at the budget with far more fondness than others.\n\nHere are all the winners and losers.\n\nAs always, there are winners and losers from the federal budget. (Polly Hanning/Nine)\n\nWinners\n\nTaxpayers\n\nEvery single person who pays tax on their income will be a winner in this year's budget.\n\nCombined with the stage 3 tax cuts implemented last year, the federal government will deliver more tax relief in 2026-27 and 2027-28: up to a $256 cut in the first year, which will be doubled the year after.\n\nPeople who buy medicine\n\nThe federal government has invested $784.6 million to reduce the cost of medicines listed on the Pharmaceutical Benefits Scheme (PBS) down to no more than $25 per prescription.\n\nThis could save a family filling four prescriptions per month around $316 per year, the budget states.\n\nThere's also $1.8 billion to list new medicines on the PBS.\n\nMedicines on the PBS will get cheaper thanks to funding contained in the budget. (Getty)\n\nBill-payers\n\nHouseholds and small businesses will receive $150 off their energy bill as the government allocates $1.8 billion to extend last budget's rebates to the end of this year.\n\nAustralians will receive the discount as two $75 rebates through to December 31, as last year's $300 rebate had been set to expire by July 1.\n\nHOUSING CRISIS: Budget doubles bonus for tradie apprentices in one industry\n\nEnergy rebates will be extended to the end of the year. (Louise Kennerley/AFR)\n\nWomen's healthcare\n\nHundreds of thousands of people are set to benefit from a $792.9 million boost to women's healthcare, which will target endometriosis and pelvic pain, contraception and menopause.\n\nNew items were listed under both the Medicare Benefit Scheme and the Pharmaceutical Benefits Scheme, making it cheaper and easier to access medicines and healthcare services.\n\nWomen will get a $793 million boost to healthcare funding in the 2025 federal budget (Graphic: Polly Hanning)\n\nAnyone with student debt\n\nThree million Australians will have a combined $16 billion cut from their student loan debt from June 1 as the government slashes the total amount owed by 20 per cent.\n\nREAD MORE: Budget reform could send three million workers into a better job\n\nAnyone with student debt will get a 20 per cent discount in a matter of months. (Getty)\n\nStuck workers looking to change jobs\n\nThree million workers are in jobs governed by non-compete clauses, meaning they can't go work for their employee's competitors, or set up shop in the same field themselves.\n\nThe government has announced that from 2027, these clauses will be banned for anybody earning less than $175,000 a year.\n\nTreasury claims the measure will add $5 billion to GDP and lift wages by an average of $2500, as well as boosting economic productivity – a measure governments have struggled to address.\n\nAged care nurses\n\nA total of $2.6 billion will go towards pay increases for aged care nurses.\n\nThis will roll out across the next five years, starting this month.\n\nFederal Budget 2025: Non compete clauses, pay boost for aged care workers and bonus for apprentice tradies. (Graphic: Polly Hanning)\n\nChildcare workers\n\nSimilarly, there's a big provision in the budget – some $3.6 billion – for childcare worker pay increases.\n\nApprentices\n\nAn apprentice tradie who trains up in the housing construction industry can expect a $10,000 incentive bonus - double the current amount.\n\nThe government is trying to increase its workforce for a big housing push.\n\nBeer drinkers\n\nAnyone who enjoys a pint will be quick to complain about how much the cost of a beer at the pub has risen by, which is in part due to how much the alcohol excise has risen by in recent years.\n\nHowever, the government has hit pause on the indexation for that excise on draught beer for the next two years, a measure that will cost the budget $165 million over five years\n\nWHAT'S IN IT FOR WOMEN: Critical $793 million health boost\n\nThe Albanese government has capped the excise on draught beer for the next two years. (Bianca De Marchi/The Sun Herald)\n\nGreen metal manufacturers\n\nWith plenty of uncertainty around Australian steel and aluminium manufacturing thanks to US President Donald Trump's trade war, the government is looking to boost the sector with a combined $3 billion to support locally made \"green\" aluminium and iron.\n\nLosers\n\nRenters\n\nWhile the government has thrown an extra $800 million into its Help To Buy shared equity housing scheme, there's little by way of new immediate help for renters still struggling – certainly nothing comparable to last year's Commonwealth Rent Assistance boost.\n\nREAD MORE: How tobacco is blowing a hole into the Federal Budget\n\nRenters have missed out in the budget. (Louie Douvis/AFR)\n\nThe budget bottom line\n\nAfter delivering back-to-back budget surpluses – Australia's first since the GFC – on the back of some very welcome revenue upgrades, the national accounts have fallen back into the red to the tune of a $27.6 billion deficit, and there are even larger ones forecast to come in the next few years.\n\nThat's in part due to far fewer revenue upgrades – budget papers state they are only one-sixth of what was averaged in the past five budgets – as well as the black hole that is tobacco excise; Treasury has downgraded the amount of tobacco excise it expects to collect until 2028-29 by almost $7 billion.\n\nThe budget is back in the red with no return to surplus forcast anytime soon. (Alex Ellinghausen)\n\nFarmers\n\nMany of the government's grocery-related measures were generally focused on consumers, and there was little directed specifically at farmers in this year's budget papers.\n\nThat's despite Chalmers' promise following the ACCC's report last week, to pursue a \"fair go\" at the \"farm gate\", as well as promoting a similar message in tonight's budget speech.\n\nBig supermarkets\n\nThat being said, the government is still promising to crack down on major supermarkets, by allocating $38.8 million for the Australian Competition and Consumer Commission (ACCC) to probe misleading and deceptive pricing practices and unconscionable conduct in the sector.\n\nTax cuts, energy relief and student debt figures from the 2025 Federal Budget. (Graphic: Polly Hanning)\n\nWelfare recipients\n\nWhile Australian welfare recipients had their payments rise thanks to indexation last week, advocates had been calling for biggest boosts, particularly to JobSeeker.\n\n\"This routine indexation is not enough. If the Federal Government is serious about addressing the cost of living crisis, it must lift income support payments to at least $82 a day, in line with the age pension,\" Australian Council of Social Services Cassandra Goldie said before the budget.\n\n\"An additional 22 cents a day does not address the inadequacy of JobSeeker and related payments. Ensuring people have a sufficient income to cover the basics would transform lives.\"\n\nThe government, though, opted against a boost for the welfare payments.\n\nWelfare recipients haven't received a new boost to their payments. (Kate Geraghty/SMH)\n\nSugar tax advocates\n\nThe Australian Medical Association last week called for a tax on sugar-sweetened drinks to combat Australia's obesity crisis, while at the same time adding $3.6 billion in revenue to the budget.\n\nThe federal government has ignored the suggestion.\n\nIn pictures: The federal budget newspaper front pages View Gallery\n\nRussia and Belarus\n\nThe federal budget confirmed a two-year extension to 35 per cent tariffs on goods from Russia and Belarus in response to the invasion of Ukraine.\n\nThe tariffs now extend to October 24, 2027.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-budget-2025-peter-dutton-quizzed-on-coalition-tax-plan-after-labor-budget/a7c8f011-7ef8-4efe-af0c-3753b879fa0d",
        "title": "Dutton says there's a 'cruel hoax' at the centre of the budget",
        "publish_date": "Tue, 25 Mar 2025 20:56:53 +0000",
        "category": "finance",
        "authors": [
            "Mar"
        ],
        "text": "O﻿pposition leader Peter Dutton has been asked about the Coalition's tax policy after Treasurer Jim Chalmers handed down his fourth federal budget last night.\n\nShadow Treasurer Angus Taylor has already labelled a newly-unveiled tax cut an election \"bribe\" that the Coalition would not follow.\n\n﻿Speaking on Today this morning, Dutton slammed the budget's tax cut as a \"cruel hoax\".\n\nPeter Dutton on Today. (9News)\n\nAsked by Nine Political Editor Charles Croucher if the Coalition would follow through on its claim of being the party of \"lower, simpler, fairer taxes\"﻿, Dutton was tight-lipped.\n\n\"We'll have the budget in reply response on Thursday, as you point out, and we'll save our detail for then,\" Dutton said.\n\nAsked directly if \"the party of Robert Menzies\" would be going to the election with a higher income tax ratio than Labor, Dutton again played it close to the chest.\n\nIn pictures: The federal budget newspaper front pages View Gallery\n\n\"Our party is always about making sure that we manage the economy and that we manage national security, that we keep Australians safe,\" he said.\n\n\"So we have to accept, firstly, that we live in a very uncertain world.﻿\"\n\nLater in the interview, Dutton did confirm that cost of living relief, home ownership, and national security were priorities for the Coalition.﻿\n\nShadow Treasurer Angus Taylor last night told 9News the opposition would refuse to support the fiscal relief.\n\n\"This is a budget for the next five weeks, not for the next five years and beyond,\" he said.\n\n\"And what was offered was a bribe, election bribe of 70 cents a day, starting in a year's time.\n\n\"And frankly, this is not even going to touch the sides of the economic pain that Australian households have felt over the last two and a half years.\"\n\nTreasurer Dr Jim Chalmers during the Budget speech. (Alex Ellinghausen)\n\nLabor's newly announced cuts would be on top of the stage three tax cuts that rolled out in 2024 and would deliver the average earner on $79,000 an extra $268 in their pockets next year – about $5 a week – and $536 in 2027.\n\nChalmers rejected any claims the tax relief amounted to a \"bribe\" for voters on the eve of the federal election.\n\n\"We're topping up a tax cut for every single Australian taxpayer, and we're doing that twice,\" he said.\n\n\"Now in isolation, these tax cuts are relatively modest, we acknowledge that.\n\n\"But in combination with the tax cuts which are rolling out right now and all of the other cost of living relief in this budget, the cost of living relief is meaningful and substantial, but also responsible in the context of these pretty serious budget constraints.\"\n\nWhen combined with the already implemented stage three tax cuts, the average Australian will be $2548 a year better off by 2027.\n\nDo you approve of the federal budget? Yes 2042 No 6333",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-budget-2025-newspaper-front-pages-in-pictures/8329477f-18e3-499b-ae06-c06ecb8682d2",
        "title": "In pictures: The federal budget newspaper front pages",
        "publish_date": "Tue, 25 Mar 2025 18:37:00 +0000",
        "category": "finance",
        "authors": [
            "March"
        ],
        "text": "1 of 11 Attribution: The Sydney Morning Herald\n\nT﻿he Sydney-Morning Herald is blunt in describing the budget's headline tax cut as a \"brazen pitch to voters\" ahead of a looming federal election campaign.\n\nTreasurer Jim Chalmers and ﻿Prime Minister Anthony Albanese with their big sack of cash appear well out in front of Opposition Leader Peter Dutton but something looms in their path: Trump 2.0 and all the tariff and other uncertainty he brings.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-budget-2025-breaking-down-the-budget-by-graphs/c51b7382-4338-4a18-b2f0-693f245c26d8",
        "title": "The graphs that explain the federal budget",
        "publish_date": "Tue, 25 Mar 2025 10:09:27 +0000",
        "category": "sports",
        "authors": [
            "Mar"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-budget-2025-two-minute-guide-everything-you-need-to-know-tax-cuts-pay-rises-student-debt-relief-health-boost/fedbe5ce-9aa2-4fce-8638-da3df3fccdb7",
        "title": "Surprise tax cuts for all, a pay rise for some, and a budget firmly in the red",
        "publish_date": "Tue, 25 Mar 2025 08:52:29 +0000",
        "category": "finance",
        "authors": [
            "Mar"
        ],
        "text": "Every taxpayer in the country will get an unlooked-for cut under a $17 billion promise at the centre of this year's federal budget, although will have to wait more than a year for it as the government attempts to balance the demand for cost-of-living relief with the need to manage a budget that is now firmly in deficit.\n\nToday's budget handed down by Treasurer Jim Chalmers shows the national accounts have, for the first time since 2022, fallen into the red.\n\nThe $27.6 billion deficit is worse by some $700 million than what was forecast just three months ago in the Mid-Year Economic and Fiscal Outlook (MYEFO), but an improvement on the last budget's prediction of $28.3 billion.\n\nWINNERS AND LOSERS: Taxpayers and students win as renters, JobSeeker recipients miss out\n\nTreasurer Jim Chalmers has handed down his fourth federal budget. (Polly Hanning/Nine)\n\nThere's no prospect of returning to surplus anytime soon, either, with deficits forecast throughout the entire forward estimates: $42.1 billion in 2025-26; $35.7 billion in 2026-27; $37.2 billion in 2027-28; and $36.9 billion in 2028-29.\n\nThat figure for the next financial year is actually slightly better than what was forecasted in 2024, although the subsequent years are worse as the government's main cost-of-living relief contained in this budget – $17 billion in surprise tax cuts for every Australian taxpayer – comes into effect.\n\nUnder the policy, the tax rate for the $18,201-$45,000 income bracket (the first bracket beyond the tax-free threshold) will be reduced from 16 to 15 per cent in 2026-27, and then again to 14 per cent in 2027-28.\n\nThat's a $268 tax cut for 2026-27, and $536 the year after.\n\nA surprise tax cut is the centrepiece of a budget that has fallen back into deficit. (Getty)\n\n\"This will take the first tax rate down to its lowest level in more than half a century,\" Chalmers said.\n\n\"These additional tax cuts are modest but will make a difference.\"\n\nThere's also a further $648 million in tax relief through the raising of the low-income thresholds for the Medicare levy.\n\nWhile Australians have been batting through the cost-of-living crisis, and no doubt would have preferred these new cuts to start in July rather than in 16 months, Treasury is painting a slightly rosier picture for everyone's hip pockets in the coming years.\n\nREAD MORE: Budget reform could send three million workers into a better job\n\nTax cuts, energy relief and student debt figures from the 2025 Federal Budget. (Graphic: Polly Hanning)\n\nReal wages are forecast to have grown by 0.5 per cent by the end of the current financial year – an improvement on what was set out in MYEFO – and GDP growth is set to hit 2.25 per cent in 2025-26, up from this year by a quarter of a percentage point.\n\nAt the same time, Treasury expects inflation to remain in the Reserve Bank's target range for the next three years, bouncing between 2.5 and 3 per cent, while wages rise by up to 3.25 per cent and unemployment caps out at 4.25 per cent – only a small rise from current levels and well below the ten-year average of just over 5 per cent.\n\nOn top of that, the government is promising in the budget to ban non-compete clauses for low- and middle-income workers, a measure it says could boost wages by 4 per cent for those affected, as well as improving productivity – a perennial thorn in the side of the national economy.\n\n\"Our economy is turning the corner,\" Chalmers said.\n\n\"Inflation is down, incomes are rising, unemployment is low, interest rates are coming down, debt is down, and growth is picking up momentum.\"\n\nREAD MORE: How tobacco is blowing a hole into the Federal Budget\n\nDonald Trump's tariff wars are causing uncertainty in the global economy. (AP Photo/Rebecca Blackwell)\n\nAt the same time, the budget acknowledges the current international uncertainty, due in no small part to Donald Trump's trade war, and the potential for more tariffs on April 2 – a date the US president has labelled \"liberation day\".\n\nWhile Treasury expects the direct impact from tariffs on Australia to be \"modest\" – the 25 per cent duties on steel and aluminium, for example, are predicted to only knock 0.1 per cent off GDP by 2030 – the indirect blowback could be far more severe.\n\n\"A slowdown in global growth stemming from these pressures would also adversely affect demand for key Australian exports, domestic business confidence, and investment,\" budget papers state.\n\n\"These risks compound the uncertainty in the global economy from conflict in the Middle East and Europe and challenges in the Chinese economy.\n\nTreasurer Jim Chalmers during the Budget speech. (Alex Ellinghausen)\n\nFederal Budget 2025: Non compete clauses, pay boost for aged care workers and bonus for apprentice tradies. (Graphic: Polly Hanning)\n\n\"Against this backdrop of greater uncertainty, the global economy is expected (to have)... the longest stretch of below-average growth since the early 1990s.\"\n\nThere are measures in the budget to combat this – a $20 million boost to encourage shoppers to buy local, and a $3 billion injection for Australian-made green aluminium and iron.\n\nBeyond that, there's the slew of policies, many of them already unveiled with the federal election looming.\n\nPay rises for aged care nurses and childcare workers\n\nBoth aged care nurses and childcare workers will get boosts to their pay under the budget.\n\nThe government will invest $2.6 billion to increase aged care nurse pay, effective from March 1, on the back of a Fair Work Commission decision, while there's $3.6 billion to increase childcare award rates by 10 per cent from December last year, plus an extra 5 per cent this year.\n\nWomen will get a $793 million boost to healthcare funding in the 2025 federal budget (Graphic: Polly Hanning)\n\nEnergy bill relief\n\nAn extension of the last budget's headline cost-of-living relief, every Australian household will get $150 in energy bill rebates in the second half of this year, at a cost of $1.8 billion to taxpayers.\n\nCheaper PBS medicines\n\nAnother measure announced in the lead-up to the budget, four out of every five medicines listed on the Pharmaceutical Benefits Scheme will have their cost slashed from $31.60 to $25﻿, saving Australians $200 million a year.\n\nMedicare bulk-billing boost\n\nWhile there's a new $1.8 billion in public hospital funding in the budget, there's also the government's February announcement of a $8.5 billion boost for Medicare that will significantly expand bulk billing, making nine out of every 10 GP visits free by 2030.\n\nThe government has promised a big boost to Medicare and health with the election looming. (Justin McManus)\n\nThree days of childcare for everyone\n\nAs announced in late 2024, all Australian families with a combined income of less than $530,000 a year will get access to three days a week of subsidised childcare, at a cost to the budget of $426.6 million.\n\nStudent debt discount\n\nAlso unveiled late last year was a one-off cash boost for anyone with outstanding student debt – roughly three million Australians – in the form of a 20 per cent discount, to be applied on June 1.\n\nThis will wipe a collective $16 billion of debt from former and current students' accounts.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-budget-2025-women-health-boost-793-million-dollars/0016aa56-a209-4af1-b49e-b32beafdcbeb",
        "title": "Women win critical $793 million health boost",
        "publish_date": "Tue, 25 Mar 2025 08:36:19 +0000",
        "category": "finance",
        "authors": [
            "Mar"
        ],
        "text": "A $792.9 million boost to women's healthcare, targeting endometriosis, contraception and pelvic pain, is the centrepiece of funding measures aimed towards women in this year's federal budget.\n\nTreasurer Jim Chalmers said the federal government was proud to invest in women's health.\n\n\"Because for our government, women's health is not a boutique issue or a question of special interest – it is a national priority,\" he said.\n\nBut there was more in the budget for women than just health. Here are all the other ways the government is supporting women.\n\nFederal budget 2025: What's in it for women. Women healthcare. (Polly Hanning)\n\nContraception\n\nAbout two-thirds of women between 18 and 44 use contraception, with the government citing the cost of medicines as a barrier to uptake.\n\nThe budget contains $134.3 million to create 150 per cent larger Medicare rebates and incentivise more bulk billing for insertion and removal of long-acting reversible contraceptives (LARC) by nurse practitioners.\n\nAbout 300,000 women will be estimated to save up to $400 a year in out-of-pocket expenses for LARCs.\n\nUnder a $1.8 billion Pharmaceutical Benefits Scheme (PBS) package, new oral contraceptives have been listed for the first time in more than 30 years and will become available from May 1.\n\nAnother $109.1 million will be allocated to fund two national trials that are hoped to make it cheaper and easier for women to access contraceptives and treatment for urinary tract infections.\n\nTreasurer Jim Chalmers hands down his fourth budget on March 25. (Alex Ellinghausen)\n\nFederal budget day 2025 in pictures: Pollies get their pitches in early View Gallery\n\nEndometriosis and pelvic pain relief\n\nThe government is investing $20.9 million over three years for endometriosis and pelvic pain clinics to support the one in nine Australian women suffering from endometriosis.\n\nThere will be 11 new clinics created with funding in this year's budget, building upon the 22 already established, and will also be available to those experiencing perimenopause and menopause.\n\nA new endometriosis treatment has also been listed under the PBS, which is expected to save about 8500 women thousands of dollars a year.\n\nWomen with severe endometriosis will also be able to receive a Medicare rebate for ultrasounds from November 1.\n\nHOUSING CRISIS: Budget doubles bonus for tradie apprentices in one industry\n\nFederal budget 2025: What's in it for women. Women healthcare. (Polly Hanning)\n\nMenopause support\n\nWomen of all ages experiencing perimenopause or menopause will be able to receive a new Medicare rebate for menopause health assessments under a $26.3 million package.\n\nNew types of menopausal hormonal therapies were listed under the PBS from March 1, which the government says will save about 150,000 women hundreds each year.\n\nUnder the budget, $4.4 million will help develop national clinical guidelines for treatment and train health professionals and $12.8 million will form a public awareness campaign.﻿\n\nREAD MORE: How tobacco is blowing a hole into the Federal Budget\n\nThe government is investing $20.9 million over three years for endometriosis and pelvic pain clinics. (iStock)\n\nWage increases\n\nWomen are set to see their wages rise as the government pours into female-dominated industries.\n\nThe budget has funded $2.6 billion in further pay rises for aged care nurses from March 1, bringing the total investment into the sector up to $17.7 billion.\n\n\"So the workers we trust to care for our parents and grandparents get paid properly for the work they do,\" Chalmers said.\n\nEarly childhood education and care workers will see a \"historic\" $3.6 billion wage hike from December when an extra five per cent is slapped onto a 10 per cent increase handed down in December 2024.\n\nREAD MORE: Budget reform could send three million workers into a better job\n\nFederal Budget 2025 (Graphic: Polly Hanning)\n\nTax cuts, energy relief and student debt figures from the 2025 Federal Budget. (Graphic: Polly Hanning)\n\nAnti-domestic violence measures\n\nLast year's federal budget included an almost $1 billion anti-domestic violence package.\n\nWhile there wasn't a headline announcement tackling what Prime Minister Anthony Albanese has previously dubbed a \"national crisis\", this year's budget included new multi-million-dollar investments to improve response measures and frameworks.\n\nAbout 500 new community sector and frontline worker jobs will be created across the country under a $277.7 million boost.\n\nThe government has also allocated $70 million to existing services and trialling new measures to support women and children experiencing violence.\n\nThere will be $21.4 million invested over three years from 2025-26 to improve victim and survivor engagement within the justice system and inform a broader response to the Australian Law Reform Commission's inquiry into the Justice System's Response to Sexual Violence.\n\nFirst Nations women, children and communities will receive $21.8 million for family, domestic and sexual violence services and $16.7 million will fund innovative approaches to address perpetrator behaviour.\n\nTreasurer Jim Chalmers delivers this year's federal budget. (Alex Ellinghausen)\n\nWorkforce and career support\n\nUnder efforts to support the country's health workforce, the government is using $606.3 million to deliver more doctors and nurses and $28 million to support the construction of the Nursing and Midwifery Academy in Victoria.\n\nAnother $10.5 million will expand the Primary Care Nursing and Midwifery Scholarship program and $1.3 million will extend the Obstetrics and Gynaecology Education and Training Program by 12 months.\n\nFirst Nations women in business will be able to access a $3.4 million mentoring and coaching program.\n\nAnd, the Australian Sports Commission will receive $3.2 million to help women and girls' participation in sports leadership through coaching, officiating and sports administration.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-budget-2025-apprentices-offering-double-incentive-payment-housing-construction/02b9966a-f19a-45cd-8504-6aad407e0b3e",
        "title": "Budget doubles bonus for tradie apprentices in one industry",
        "publish_date": "Tue, 25 Mar 2025 09:04:20 +0000",
        "category": "finance",
        "authors": [
            "Mar"
        ],
        "text": "Apprentices are being offered 10,000 reasons to join the construction industry as the government looks to boost the workforce for its big push on housing.\n\nEligible apprentices will be handed an incentive payment of $10,000 if they train in the housing construction sector.\n\nThat's double the previous maximum incentive payment.\n\nApprentice tradies who join the housing construction industry will receive a $10,000 incentive payment. (Graphic: Polly Hanning)\n\nThe increase will take place from July 1 this year.\n\n\"To build more, we need to train more builders,\" Treasurer Jim Chalmers said.\n\n\"That's why we're attracting more apprentices into the housing industry.\"\n\nIt's part of a $722.8 million funding package to support apprentices that will roll out in the coming four years.\n\nTax cuts, energy relief and student debt figures from the 2025 Federal Budget. (Graphic: Polly Hanning)\n\nWHAT'S IN IT FOR WOMEN: Critical $793 million health boost\n\nFederal Budget 2025: Non compete clauses, pay boost for aged care workers and bonus for apprentice tradies. (Graphic: Polly Hanning)\n\nFederal budget day 2025 in pictures: Pollies get their pitches in early View Gallery\n\nThe government has already introduced legislation to provide a permanent 100,000 free TAFE places a year from 2027.\n\nThe budget forecast that nine out of 10 new jobs in the next decade will require tertiary-level qualifications, with almost half from the vocational training sector.\n\nOf the nearly 600,000 free TAFE enrolments between January 2023 and September 2024, almost 40,000 were for construction courses.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/brisbane-olympics-2032--venues-pictures/e5ab6c8e-b99f-42b5-a0b9-6a6d1ec59823",
        "title": "New and upgraded venues announced for Brisbane Olympics",
        "publish_date": "Tue, 25 Mar 2025 05:27:03 +0000",
        "category": "sports",
        "authors": [
            "March"
        ],
        "text": "1 of 20 Attribution: Supplied\n\nAfter months of leaks, speculation and controversy, detailed plans for the Brisbane Olympics have been announced.\n\nThey include a major new stadium for the city, as well as plans for a new airport link﻿ and an upgrade to the notorious Bruce Highway.\n\nNew venues will also be created outside of the city, which aim to benefit locals once the Games are over.﻿\n\nRead on for the details.\n\n﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/artist-khaled-sabsabi-muma-exhibition-postponed/105096590",
        "title": "Dumped Venice Biennale artist's Melbourne show indefinitely postponed",
        "publish_date": "Wed, 26 Mar 2025 01:49:57 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "An exhibition at Monash University Museum of Art (MUMA) in Melbourne featuring Lebanese Australian artist Khaled Sabsabi's work has been postponed indefinitely.\n\nSabsabi, who is based in Western Sydney, was thrown into the national spotlight when he and curator Michael Dagostino were announced on February 7 as Australia's representatives at the 2026 Venice Biennale.\n\nListen to the podcast Photo shows The Art Show Visual artists tell you why and how they create! From studio visits, intimate interviews, and live issues, we take art out of the gallery and into your ears.\n\nHowever, Creative Australia controversially withdrew his commission less than a week later, after Coalition arts spokesperson Claire Chandler raised in parliament issues with works by Sabsabi from more than 15 years ago.\n\nSabsabi's gallerist, Josh Milani, says Creative Australia's decision to withdraw Sabsabi's Biennale commission has harmed the artist's career.\n\n\"From the moment he was sacked by Creative Australia for the Venice Biennale commission, the curators at MUMA started receiving pressure from their superiors,\" Milani says.\n\n\"This cancellation is a direct result of Creative Australia's complete abandonment of him as an artist and a human being.\n\n\"They have allowed the mischaracterisation of him as a terrorist sympathiser to go unchecked.\"\n\nThe show, Stolon Press: Flat Earth, was due to open on May 8 and had been planned 18 months in advance.\n\nIt featured the work of Stolon Press — a Sydney-based collective and Sabsabi's longtime collaborator — Elisa Taber, a writer and anthropologist who divides her time between Montreal and Buenos Aires, and Sabsabi.\n\nAccording to the MUMA website, Sabsabi was due to present \"large, coffee-infused calligraphic paintings rooted in tasawwuf (Sufism), alongside abstracted silhouette works that employ numerology and repetition to explore spirituality and our shared human condition\".\n\nIndustry upheaval over artist dropped from cultural event Photo shows Two man stand on street wearing black suits. One smiles and one has serious expression. Industry resignations and anger have followed the shock decision by Creative Australia to drop artist Khaled Sabsabi from one of the world's most prestigious cultural events.\n\nThe ABC understands it is the first time in the gallery's 50-year history that an exhibition has been pulled.\n\nMonash University, which owns the gallery, made the decision.\n\nA Monash University spokesperson told ABC Arts in a written statement:\n\n\"Through consultation with our communities we have identified there is a need for the Museum to deepen its collaboration and engagement on this exhibition. Postponing the event will allow this important work to be undertaken.\"\n\nThe university could not confirm when the exhibition would be rescheduled.\n\nIt is unclear what process the university followed to arrive at this decision.\n\nBacklash against Creative Australia\n\nThe Creative Australia board met on February 13 and unanimously decided to drop Sabsabi and Dagostino from the Venice Biennale. (Board member Larissa Behrendt was absent.)\n\nTwo Creative Australia employees — Mikala Tai, the head of Creative Australia's visual arts department, and program manager Tahmina Maskinyar — resigned in response.\n\nLindy Lee, a Creative Australia board member and celebrated artist, also resigned from her board position.\n\nCreative Australia CEO Adrian Collette and board chair Robert Morgan faced a grilling by Greens senator Sarah Hanson-Young in a late-night Senate estimates hearing on February 18, however, both refused calls to resign.\n\nWhile Sabsabi and Dagostino are seeking reinstatement, the Australia Pavilion — which housed Archie Moore's Golden-Lion-winning kith and kin at the 2024 Venice Biennale — could remain empty at the 2026 festival.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/nz-aus-t20-cricket-scores-results-scorecard-commentary/105097614",
        "title": "T20 live: Australia looks to wrap dominant NZ tour in third match",
        "publish_date": "Wed, 26 Mar 2025 01:41:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "After two utterly dominant outings in New Zealand, Australia will try to complete a clean sweep of the three-game T20 series in the final match in Wellington.\n\nCheck out the live scores and stats below.\n\nScorecard\n\nBall-by-ball\n\nManhattan",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/tom-jenkins-penrith-panthers-comeback-fullback/105097674",
        "title": "Inside the remarkable rise of Tom Jenkins, Penrith's most unlikely success story",
        "publish_date": "Wed, 26 Mar 2025 01:38:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "When news came through last week that Tom Jenkins would be playing fullback for Penrith in their grand final rematch with Melbourne, the reaction from outside the Panthers was literal disbelief.\n\nSurely, the scuttlebutt went, it was a smokescreen and coach Ivan Cleary would switch high-profile recruit Blaize Talagi to the back.\n\nJenkins, usually a winger or centre with limited first-grade experience who had just returned to Penrith after a year with Newcastle, could only be a decoy amid a horde of injuries to Penrith's fullbacks Dylan Edwards and Daine Laurie.\n\nIt's true that the 24-year-old Jenkins was light on experience as a custodian — apart from a few minutes there filling in for the club's NSW Cup side the week before, when the starter underwent an HIA, he hadn't played there in years.\n\nAnd, on the surface, he was an unlikely person for the Panthers to turn to in such a difficult time given he struggled to crack the Knights' back line last season and began the summer training with St Mary's in the Ron Massey Cup, the tier below reserve grade.\n\nBut once the whistle blew in Melbourne, it was indeed Jenkins at fullback and the first game of his second life with Penrith turned out to be the best of his young career.\n\nThe undermanned Panthers went down 30-24 but Jenkins was a shining light, playing a role in four tries against one of the few teams who could be in the mix to end Penrith's run of premierships.\n\nHe's retained his spot in first grade this week and will line up in the far more familiar role of centre on Thursday night against South Sydney — Laurie has been named to return from a quad injury but should he withdraw, Jenkins could play fullback again.\n\nIf so, the 24-year-old will jump at the chance. After the journey he's been on back to the club he calls home, there's nothing he won't do for them.\n\n\"Coming into Dyl's shoes is a hard one, he's the Australian fullback. But it's another role, another job, if I have to do it again or another role through the year, you never know — Nathan [Cleary] is out this week, so maybe halfback!\" Jenkins said.\n\n\"But I'm just keen, if Ivan puts me in there, it's because he believes in me.\"\n\nWhen it comes to Penrith, Jenkins has always fought hard to make the most of every opportunity.\n\nThat's how the Young Cherrypickers junior ended up with the Panthers in the first place. At 18, after failing to pick up a contract with Canberra, he played for a Group 9 rep side against a Panthers development squad and did well enough to land a deal with the club.\n\nJenkins left Penrith in search of consistent NRL football. (Getty Images: Ian Hitchcock)\n\nHe rose through the ranks, playing a handful of NRL matches in 2022-23 before signing a two-year deal with Newcastle in search of a regular first-grade spot.\n\n\"Penrith feels like home and they gave me my first opportunity. But I probably needed to leave, to go away and chase an opportunity, for my own development and my own career,\" Jenkins said.\n\n\"I don't regret it, I think it's exactly what I needed — to go away and experience different things, a different club.\n\n\"I knew it was probably coming. They had Bizza [Brian To'o], Taylan [May], Tito [Sunia Turuva], a lot of boys who were successful, so my path to NRL was blocked.\n\n\"Ivan [Cleary] is always open, no matter how hard the conversation is, he'll always have it with you directly, no matter what.\n\n\"He'll tell you exactly what you need to know, whether you like it or not. I didn't want to leave, and he knew I didn't want to leave, but he knew I had to leave to chase an opportunity.\"\n\nJenkins only played a handful of games in an unhappy year with Newcastle. (Getty Images: Mark Kolbe)\n\nBut the move to the Hunter didn't agree with Jenkins. He played five NRL matches, all at the beginning of the season, but couldn't find his best football.\n\nAt the end of the season, he and the Knights came to an agreement that he would leave a year early.\n\n\"I wasn't present when I was in Newcastle. I was promised things but I didn't live up to the expectations. That was on me, getting ahead of myself.\n\n\"It's a good bunch of boys up there. There wasn't any bad blood in the exit. It was purely based on what I needed as a person, to come back here and be around family and enjoy my footy.\n\n\"I didn't feel like myself, I always felt drawn back to here, I wanted to be around Sydney.\"\n\nSo Jenkins came back to Penrith — first the area, then the club, because both of them are home to him.\n\nHe signed with St Mary's Saints and had a few training sessions before Panthers reserve grade coach Ben Harden gave him a call. Would Jenkins be interested in training with the club's afternoon squad over the summer?\n\nNRL live Photo shows Four Penrith NRL players stand in a group after loss to Melbourne Storm. After playing much of the match without Nathan Cleary, the Panthers still find positives in their 30-24 loss to the Storm in Melbourne.\n\nThey didn't need to ask twice. Alongside part-timers, triallists and other players desperate for a chance at joining the great Penrith winning machine, Jenkins slogged it out in the heat, with no guarantees and no promises.\n\nIn the meantime, he linked up with Our Choice, a disability service owned by a mate of his, as a support worker — which gave him a new outlook on life and football.\n\n\"That's something I'm really passionate about, I love that, I still work there on my days off and when I leave footy it's definitely something I'll go do,\" said Jenkins.\n\n\"I'd take kids out, community access, teach them independent life skills — it puts some perspective on life.\n\n\"[With footy] I just tried to work my way back, there wasn't a promise.\n\n\"I do love how Penrith roll and how they do their thing. Coming back, that's something I slotted straight into. Their standards are very high and they don't budge.\"\n\nJenkins fought to live up to those standards and took the chances when they came. With Penrith's top squad in Las Vegas for the season opener, he played in their final trial against Manly and scored a try.\n\nThen he landed a coveted full-time deal. His goal for the year was to make it back to NSW Cup and he managed it by the season opener. After two strong games, coach Cleary didn't hesitate to turn to the prodigal Panther in a time of need.\n\nTaking on the Storm at AAMI Park is a place where some of the best fullbacks in the league have lost themselves but Jenkins trusted himself to do the job, even if he'd never done it before at the top level.\n\n\"I wouldn't be there if [Ivan[ didn't have confidence in me and that's what Ivan does, he gives you confidence,\" Jenkins said.\n\nCleary has shown that confidence in Jenkins again by naming him in the centres over 18-year-old phenom Casey McLean for Thursday night's clash with South Sydney.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe match shapes as a big one for the Panthers — they haven't dropped three games in a row since the end of 2019, well before their historic run began. Losing is not something they're familiar with anymore.\n\nThat's part of what drew Jenkins back here and why he's so grateful to be a part of it all again. All he wants is more first grade, wherever he's needed.\n\nIf you can make it at Penrith, you can probably make it anywhere — but if you make it at Penrith, why would you want to make it anywhere else?\n\n\"It didn't have to be Penrith, I wanted it to be Penrith. I know how they roll, I know how they do things, all my mates are here,\" Jenkins said.\n\n\"When I made the decision to leave [Newcastle], I didn't know what was next, but I knew Penrith was a hard system to crack and a hard squad to get into.\n\n\"It's exactly what I needed, a kick up the bum to show how good I have it and how lucky I really am. I'm really lucky, because I got to come back here.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/alcoa-fined-400k-work-experience-students-burned/105097526",
        "title": "Caustic burns to students, workers see Alcoa hit with $400k fine",
        "publish_date": "Wed, 26 Mar 2025 01:07:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "US aluminium giant Alcoa has been fined $400,000 after a caustic solution burned a group of school students on work experience at its Kwinana refinery.\n\nThe company pleaded guilty in the Rockingham Magistrates Court to failing to ensure the health and safety of workers over the September 2022 incident.\n\nIndustry watchdog WorkSafe said the incident started when a worker found a pump in the plant smoking and throwing out debris.\n\nThe incident occurred at the Alcoa Kwinana Refinery. (ABC News: Gian De Poloni)\n\nA Worksafe spokesperson said a shift supervisor, aware the pump could explode if pressure built up, went to open a discharge drain valve before telling the work experience group to leave the area.\n\nBut as he did, the watchdog said, another worker was replacing the damaged pump and pressed its start button, unaware the valve down the line was still open.\n\n'Uncontrolled discharge'\n\nWorkSafe said that pump starting caused an \"uncontrolled discharge of hot caustic solution\" which splashed workers and the students.\n\nThe watchdog said emergency response officers immediately attended to provide first aid.\n\nOn top of the $400,000 fine, Alcoa must also pay more than $5,500 in court costs. (ABC News: Cason Ho)\n\nWorkSafe Commissioner Sally North said it was down to luck that those nearby, including the students, were not more severely injured.\n\n\"Companies must ensure all people at a workplace, including work experience students, are kept safe,\" she said in a statement.\n\n\"Companies must also have robust controls in place and ensure these controls are monitored so they continue to be effective.\"\n\nAlcoa was also ordered to pay $5,536.70 in costs.\n\nThe company has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/whyalla-steelworks-administrator-wants-buyer-by-end-of-year/105096622",
        "title": "Whyalla's 'MacGyver-like' steelworkers praised as site on track for sale",
        "publish_date": "Wed, 26 Mar 2025 01:00:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Whyalla steelworks administrator KordaMentha has praised the \"MacGyver-like\" ingenuity of the local workforce, saying it wants to have secured a sale of the business by the end of the year and has identified up to a dozen \"interested parties\".\n\nKordaMentha met with Whyalla locals and creditors in the South Australian regional steelmaking city today to provide an update on the administration process.\n\nAdministrator Sebastian Hams said the workforce was being expanded in the short term because the site was \"understaffed\" and had fallen into such disrepair that workers had been forced to resort to ingenuity of the kind displayed by the lead character in the 1980s TV action series.\n\n\"We talk about a lot of our employees being almost MacGyver-like insofar as they're using their own skills and their own assets in some circumstances to create solutions to keep the business safe,\" he said.\n\n\"They're like the old character from the 80s, MacGyver, who'd use chewing gum and sticky tape to keep the business together. It's not quite that bad but they're the sort of examples — they're using their own intuition and capital to keep the business going.\n\n\"We have signed off on 63 new employees coming into the business — 18 in the mine and 45 in the steelworks, and seven of those employees have already started.\"\n\nSebastian Hams says workers have been forced to use their own ingenuity. (ABC News: Che Chorley)\n\nIn last night's budget, the federal government confirmed a commitment of $219 million over two years \"to provide immediate on the ground support and to stabilise\" the Whyalla steelworks during administration.\n\nThe bulk of that money was the federal government's \"co‑contribution to South Australia for the administration costs\" of the steelworks, with a smaller amount allocated to creditor assistance payments.\n\nMr Hams said the financial support had been \"invaluable\", and said he wanted to have the business stabilised and in a position to be sold by the end of the year.\n\n\"We've got a lot of interested parties — we believe we've got between 10 and 12 interested parties — [and] we'll be talking to them in more detail over the coming weeks to establish the actual bona fides of themselves and what they're interested in,\" he said.\n\n\"I would certainly hope BlueScope are one of the 10 to 12.\n\n\"We're hoping to have a sale of this business in this calendar year but there's a lot of moving parts we need to settle in order to achieve that goal.\"\n\nKordaMentha says the workforce has expanded by 63. (ABC News: Che Chorley)\n\nKordaMentha also revealed that 34 creditors had so far been paid under the rescue package announced by the federal and state government last month.\n\n\"I believe the value of that is about $6.8 million but that is moving on a daily basis. There would be more people, for example, paid today,\" he said.\n\n\"There was $50 million initially set aside for local creditors ... whether that number is enough, I'm not sure at this point.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/trump-tariffs-and-volatile-global-economy-threaten-budget/105095192",
        "title": "Budget forecasts may be blown away by Trump tariff war",
        "publish_date": "Wed, 26 Mar 2025 00:16:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Former Reserve Bank deputy governor Guy Debelle once quoted Doors frontman Jim Morrison in a speech when the fallout from the global financial crisis was still front of mind:\n\n\"The future's uncertain and the end is always near.\"\n\nIn his budget speech last night, Jim Chalmers was somewhat less dramatic, but the warning was very similar.\n\n\"The global economy is volatile and unpredictable,\" he cautioned.\n\n\" The 2020s have already seen a global pandemic, global inflation and the threat of a global trade war. \"\n\nTreasurer Jim Chalmers says global economic volatility is threatening Australia's economic and budget outlook.\n\nAlmost in the same breath as Mr Chalmers trumpeted the likelihood of a soft landing for Australia's economy in its descent from peak inflation, he warned that the global outlook could deal Australia blows on multiple fronts.\n\n\"Trade disruptions are rising, China's growth is slowing, war is still raging in Europe, and a ceasefire in the Middle East is breaking down,\" he observed.\n\nThose blows are already landing.\n\nTreasury says the global economy grew 3.3 per cent last year and is likely to growth by 3.25 per cent each year for the next three.\n\n\"If realised, this would represent the longest stretch of below-average growth since the early 1990s,\" Budget Paper 1 warned.\n\nBut things could get even worse — Treasury warned the risks to the global outlook are currently skewed to the downside.\n\n\"The global outlook remains clouded by uneven risks in the trajectory of growth, inflation and monetary policy,\" Treasury's number-crunchers noted.\n\nTrump tariffs create 'significant uncertainty and volatility'\n\nOne of the biggest risks in the short-term is US president Donald Trump's love of tariffs.\n\nIn the budget, Treasury did some modelling suggesting that a blanket 25 per cent tariff on manufactured goods coming into the US would likely take more than 0.1 of a percentage point off Australia's economic growth, while adding that much to inflation.\n\nIn Budget Paper 1, Treasury modelled the effects of 25 per cent US tariffs on manufactured goods. (Supplied: Treasury)\n\nThat's mostly because our key export destinations — such as China, Japan and Korea — would be hard hit on their exports to the US.\n\n\"The indirect effect of the tariffs is estimated to be nearly four times as large as the direct effect, reflecting the relative importance of affected trade flows between Australia, China, and the United States,\" Treasury forecast.\n\nHowever, that hit to GDP could nearly double if Australia responded with tariffs of our own.\n\nTreasury found that retaliatory tariffs could roughly double the negative effect of the US tariffs. (Supplied: Treasury)\n\nAnd Treasury warned that its modelling could significantly underestimate the economic impact from Trump's tariffs and the global reaction to them, with China, the EU, Canada and others having already announced retaliatory measures.\n\n\"Escalating trade tensions have created significant uncertainty and volatility in global financial markets,\" Budget Paper 1 noted with concern.\n\n\" These factors can compound the direct and indirect effects of tariffs on global growth captured in the scenarios above by discouraging investment and dampening consumer confidence. \"\n\nThe Grattan Institute's chief executive Aruna Sathanapally said, in a worst case scenario, an escalating trade war could rip the globalised economy apart.\n\n\"The first round effects of the tariffs isn't the main thing to worry about — that will be annoying and unwelcome and probably some bad economic policy,\" she told the ABC News budget special.\n\n\"But the effects on the global economy, and then the effects in terms of uncertainty and chaos, and what effect that has on people's investment decisions, those things we need to be really worried about.\n\n\"And even more worrying is the international order — if it breaks down, it becomes more troubling and expensive.\"\n\nIt feels like the end is nearer than usual\n\nWe're already seeing some of those effects.\n\nUS companies have been scrambling to import just about anything and everything — from cars to copper, building materials to gold bullion — in order to beat the imposition of the import taxes.\n\nThat is boosting economic activity ahead of the tariffs, but this is just bringing forward demand that will leave an even bigger hole once the import taxes come in.\n\nAustralia's leaders distracted at historic moment Photo shows Albanese and Dutton in a compositie image close up. While Australian politicians argue about power bill relief and non-existent nuclear power stations, pressing issues like the great US retreat, global warming and AI are being ignored.\n\nThen there's those knock on effects to business investment and activity.\n\nFinancial news outlet Bloomberg carried a story this week of a US project waiting on the importation of pipes from Germany, where threatened levies on Chinese shipping had indefinitely delayed delivery.\n\nThat project is now stuck in limbo and could remain so for months.\n\nSimilar stories are proliferating, and businesses are likely to defer many major investment plans until they have clarity about where global trade relationships and tariffs stand.\n\nDonald Trump is by no means the only global leader who has adopted increasingly protectionist policies in recent years.\n\n\"According to the IMF, restrictions on trade and investment have grown sixfold in the past 15 years,\" Budget Paper 1 noted.\n\nBut the sheer scale and immediacy of Trump's tariff plans threaten to dwarf even the Smoot-Hawley tariffs of Ferris Bueller fame, which infamously deepened and prolonged the Great Depression.\n\nLoading YouTube content\n\nJim Morrison and Guy Debelle both may have been a bit ahead of their time. Not only is the future uncertain, but the end feels increasingly near.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/cricket-south-australia-queensland-sheffield-shield-live-updates/105087822",
        "title": "Sheffield Shield final live: Khawaja, Labuschagne out as Qld collapses",
        "publish_date": "Tue, 25 Mar 2025 23:39:42 +0000",
        "category": "sports",
        "authors": [],
        "text": "Test stars Usman Khawaja and Marnus Labuschagne are back in the pavilion after a collapse of 5-7 wipes out Queensland's top order on the first morning of the Sheffield Shield final against South Australia.\n\nCheck out the live scores and stats in our ScoreCentre.\n\nScorecard\n\nManhattan\n\nBall-by-ball\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/max-coming-to-australia-streaming-warner-bros-discovery/105092804",
        "title": "HBO's streaming service is coming to Australia. It could change everything",
        "publish_date": "Tue, 25 Mar 2025 23:28:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "When a new streaming service launches in Australia on March 31, it will be a major disruptor in the Australian media market.\n\nMax, owned by Warner Bros Discovery, will be the last of the major international streaming services to launch in Australia.\n\nWhen presented with what Max has to offer, a lot of subscribers will think it's just more of the same movies and shows already available on streaming services in Australia.\n\nThis is what makes the launch of Max so interesting. Yes, it is the last to the party. And yes, it is YASS (yet another streaming service). But it also represents something that is uncomfortably different: Max isn't here to be another streaming service; many subscribers will use it to replace Australian service BINGE.\n\nFrom launch, BINGE has sold itself as the home of HBO in Australia, the upmarket, prestige TV channel owned by Warner Bros Discovery. HBO is synonymous with the best that TV has to offer, with titles like The Sopranos, Game of Thrones, Sex & The City, The White Lotus, and The Last of Us.\n\nThe Last of Us was the most-watched debut season of a show that HBO has ever had. (HBO)\n\nBut when Max launches, all of those shows will disappear from the BINGE streaming service and become exclusive to Max. Max is, effectively, the HBO streaming service. It will also have other beloved Warner Bros Television titles like The Big Bang Theory, Rick & Morty, and Friends, along with a huge number of Discovery reality shows.\n\nIt's a great library of shows and movies, but one that we've mostly had access to for some time now.\n\nYet another streaming service\n\nThe streaming game really started in Australia 10 years ago.\n\nIn an effort to get into the market ahead of the then-impending launch of Netflix, Nine kicked things off in a meaningful way with the launch of Stan. With a strong emphasis on original Australian shows and movies, Stan has proven resilient in a market where all of its well-funded international competitors have gobbled up a lot of the more buzzy new titles.\n\nJust two months after Stan launched, Netflix came along and made its impact known. It had already launched popular original shows like House of Cards (even if we don't really talk much about that one anymore thanks to the very public fall of series star Kevin Spacey) and Orange Is The New Black.\n\nEuphoria was almost HBO's most-watched show, second only to Game of Thrones. (Supplied: HBO)\n\nSince then we have seen other international companies like Disney launch locally with Disney+, Amazon with its member-benefit Prime Video, and Paramount with Paramount+.\n\nEach of these services have large libraries of older TV shows and movies, along with a seemingly never-ending supply of new things to watch. What hasn't changed with the launch of these streamers is that we still only have 24 hours in every day, so we already have more than we could conceivably watch.\n\nWhat will be on Max?\n\nAt launch, Max will offer most of the Warner Bros Discovery channels. That includes HBO, Warner Bros, Discovery, Cartoon Network (think Looney Tunes and Powerpuff Girls), TLC, IS, and HGTV. It also includes brands like Harry Potter, the DC Comics superheroes (that includes Superman, Batman, Wonder Woman, The Flash), and Game of Thrones.\n\nInterestingly, you'll notice that it doesn't seem to include anything from the Warner-Bros-Discovery-owned CNN. The US Max streaming service offers a live stream of CNN and some sports content, but that hasn't been added to any of the other international territories that Max has launched in. Whether that changes in time will depend on whether CNN is sold off, which is what most media analysts expect will happen in the coming year or two.\n\nThe internet loves to hate on Sex & the City reboot And Just Like That... but it's popular enough to have been renewed for a third season. (Supplied: HBO Max)\n\nThe big show at launch will be the second season of the hugely successful The Last of Us, which debuts in mid-April. New seasons of And Just Like That, House of The Dragon (the Game of Thrones spin-off), Euphoria, and Peacemaker are also promised to launch later this year (or 2026 in the case of Euphoria).\n\nMax also promises to launch with a library of old Hollywood classics from Turner Classic Movies (TCM). Expect titles like Casablanca, The Wizard of Oz, A Clockwork Orange, Full Metal Jacket, and Rebel Without a Cause. This won't be the first time Australia has received TCM, with a branded TCM channel formerly running on Foxtel. What we don't yet know is whether we will see a good mix of older titles, or whether it'll be like the old TCM channel with a static small library where viewers saw the same movies repeated ad nauseum.\n\nHow does the price compare to other streamers?\n\nThe price for Max is similar to the prices of the other major streamers. Some pricing tiers are a little more expensive than Disney+, but a bit cheaper than Netflix.\n\nThe pricing plans also give users similar access its competitors' offers. Max is offering an ad-supported cheaper tier with HD resolution, a standard tier which is also capped at HD, and a premium priced tier that streams at 4K resolution.\n\nA total of 1.25 million people in Australia tuned in to watch the first episode of House of the Dragon — that's roughly one in 20 people in the country. (Supplied: HBO)\n\nTo BINGE's credit, it has always offered 4K resolution streaming on its standard plans, while most competitors, including Max, restrict 4K streaming to the most expensive plans. With the average TV size at 50 inches in Australia and getting bigger, 4K streaming should be a default resolution and not an upsell if we want the picture on our screens to be clear with limited blur.\n\nThe question is whether Australians are willing to pay money for yet another streaming service. It is likely many subscribers will see the launch of Max as an opportunity to consider which services they are subscribing to and decide on what value they are getting from them.\n\nBut up until now, even with cost-of-living pressures mounting in everyday Australian households, the number of subscription services we pay for have been growing in number.\n\n(Supplied: Telsyte Australian Subscription Entertainment Study 2024)\n\nThe annual Telsyte survey into the local subscription video-on-demand market saw increases for all but one of the leading streaming services. While more people are opting for the cheaper, ad-supported plans, more than 70 per cent of subscribers now have more than one service.\n\nWith Max offering sought-after content, there's nothing to suggest it will be entering a market that doesn't have room for it.\n\nWhat is the future for BINGE?\n\nBINGE isn't shutting down. It continues on, but it isn't unreasonable to say there will be fewer well-known TV shows on the service and that could impact their subscriber numbers.\n\nMidway through the year, European sports company DAZN is expected to finalise its purchase of BINGE parent company Foxtel. Declining subscriber numbers will put incredible pressure on the viability of BINGE, which already sits adjacent to the sports focus of the new parent company.\n\nThe loss of HBO is happening at the worst time for BINGE. It follows the loss of a deal that gave it access to first-run BBC content midway through 2024. Its last big content deal is with NBCUniversal, which gives it access to well-known and beloved shows like Law & Order. All eyes in the industry are on that deal, which is believed to be up for renewal later this year.\n\nBINGE will likely lean into its original content, including the acclaimed Australian comedy Colin From Accounts. (Supplied: Joel Pratley)\n\nGoing forward, shows will be acquired on more of a show-by-show basis. This means viewers will likely see a lot more first-run drama from independent productions across North America and Europe. That's not entirely a bad thing and will broaden the types of shows available on streaming — but rarely are these the loud, buzzy titles that viewers are looking for.\n\nThe big show of the moment on BINGE is The White Lotus. Viewers watching the show on BINGE will continue to see the rest of the new episodes, with the final episode of that show streaming on April 7. The season will continue to be available on BINGE for 30 days after the final episode. But The White Lotus season 3 is non-exclusive and will be available to watch on Max as well.\n\nFans of Last Week Tonight with John Oliver will continue to find the show available on BINGE until the end of the season in November. Unlike The White Lotus, for the moment, that remains exclusive to BINGE.\n\nBINGE does still have original content to lean on — Colin From Accounts is a sparkling example of how great local comedies can be. This month saw the launch of a new Australian BINGE original, the limited series adaptation of Liane Moriarty's The Last Anniversary. There's also the upcoming UK co-production Mix Tape starring Teresa Palmer, and the ongoing Real Housewives of Sydney.\n\nHe may have won two Emmy Awards last year for his popular talk show, but is John Oliver enough to save Binge? (Supplied: Photo by Kevin Mazur/Getty Images)\n\nIf BINGE was to shut down, that would mean fewer Australian shows going into production and would contribute to the homogeneity of content on our screens. BINGE may not have had the highest volume of original shows, but if it was to go away, its absence would be felt.\n\nIt can't be overstated how great the loss of HBO content is to BINGE. Access to HBO titles has been the selling point BINGE has been defined by since launch. Whether BINGE can retain subscriber interest without it remains to be seen. As entertaining and informative as he is, just having John Oliver may not be enough.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/world-athletics-womens-track-and-field-chromosome-testing/105096728",
        "title": "World Athletics introduces chromosome testing in women's events",
        "publish_date": "Tue, 25 Mar 2025 22:44:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "World Athletics president Sebastian Coe has confirmed track and field's governing body has approved the introduction of cheek swabs and dry blood-spot tests for female athletes in order to maintain \"the integrity of competition\".\n\nThe planned changes include reinstating a version of chromosome testing that was discontinued in the 1990s, and require athletes who compete in the female category to submit to a cheek swab or dry blood-spot test for the presence of a gene that indicates whether the athlete has a Y chromosome present in males.\n\nCoe told a news conference that athletes would have to take the test just once during their career.\n\n\"It's important to do it because it maintains everything that we've been talking about, and particularly recently about not just talking about the integrity of female women's sport, but actually guaranteeing it,\" Coe said after a two-day meeting of the World Athletics Council in Nanjing.\n\n\" We feel this is a really important way of providing confidence and maintaining that absolute focus on the integrity of competition. \"\n\nIt is unclear whether the tests will be in place before the world championships in September. Coe said that the new regulations would be drafted and that a testing provider would be confirmed over the next few weeks.\n\nCoe, the two-time Olympic champion who was unsuccessful last week in his bid to become IOC president, has been vocal about \"protecting the female category\" in track and field. He has said the International Olympic Committee needs to take a leadership role in the transgender debate instead of letting each individual sport decide their own regulations.\n\nWorld Athletics president Sebastian Coe wants to maintain \"the integrity of the competition\" in women's events by implementing chromosome testing. (Getty Images: Fabrice Coffrini)\n\nWorld Athletics, which in 2023 banned transgender athletes who had transitioned male to female and gone through male puberty, announced in February proposed recommendations that would apply strict transgender rules to athletes who were born female but had what the organisation described as naturally occurring testosterone levels in the typical male range.\n\nThose recommendations came only days after US President Donald Trump signed an executive order barring transgender athletes from competing in girls sports in the US and pressured the Olympics to do the same. Los Angeles will host the 2028 Summer Games.\n\nAsked whether World Athletics felt the policy would withstand legal challenges, Coe said he was confident after an exhaustive review.\n\n\"I would never have set off down this path in 2016–2017 to protect the female category in sport without being prepared to take the challenge head on,\" Coe said.\n\nHe added: \"We've been to the Court of Arbitration on our DSD (differences in sex development) regulations. They have been upheld, and they have again been upheld after appeal. So we will doggedly protect the female category, and we'll do whatever is necessary to do it.\"\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/federal-budget-what-is-in-it-for-wa/105095238",
        "title": "What's in the federal budget for Western Australia?",
        "publish_date": "Tue, 25 Mar 2025 22:37:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's widely believed Western Australia is a crucial, potentially decisive battleground in the coming federal election as Labor seeks to retain government.\n\nSo it came as little surprise Prime Minister Anthony Albanese was on multiple Perth radio stations just hours before the government handed down its final budget before the federal election, pushing the message he has the state's best interests at the front of his mind.\n\n\"I'm pro-WA … and my next visit there will be my 30th as prime minister,\" Mr Albanese told Nine Radio.\n\n\"We support WA jobs, we support WA industry, and that's what we'll continue to do,\" he said.\n\nPromises of tax cuts for all Australians aside, it begs the question — what's in it for WA?\n\nSoftening live export blow\n\nPhasing out of live sheep exports has been a controversial issue in much of WA, despite the ban being a key Albanese promise.\n\nThe Keep the Sheep campaign was started in response to the federal governments ban on live sheep exports. (ABC Great Southern: Mark Bennett)\n\nThe budget papers show the government is committing $43.5 million over five years — including $16.3 million in the coming financial year — aimed at \"fostering wellbeing\" and strengthening community resilience in the sector as part of the support package.\n\nThe budget also includes funding for WA roads in both Perth and the regions.\n\nThe Commonwealth is contributing $350 million to a $700 million project to add a third lane to the Kwinana Freeway in Perth's south.\n\nThe Kwinana Freeway will be widened between Roe Highway and Mortimer Road. (ABC News: Gian De Poloni)\n\nIt will also contribute $90 million to building a grade-separated interchange at Manning Road and Leach Highway.\n\n$14.4 million will be spent this financial year and $37.3 million next year for road infrastructure in the state's north.\n\nIn education, there's an additional $1 million to support the operation of the new Manjali Studio School, a secondary boarding school for First Nations students in the Wunaamin Miliwundi Ranges area of the Kimberley region.\n\nAs part of its Supporting Social Cohesion initiative, the government will also invest $2 million for upgrades to the education centre of the Holocaust Institute of Western Australia, based in suburban Yokine.\n\nThere's a further $20 million this financial year towards the construction of the Aboriginal Cultural Centre on the banks of the Swan River near the Perth Concert Hall.\n\nThe government has also committed $19.6 million over three years to extend three specialist trauma-informed sexual assault legal services pilots in WA, Victoria and the ACT, and to expand the pilots nationally.\n\nIn WA the program is provided by the Women's Legal Service, Ruah Community Services and the Aboriginal Family Legal Service.\n\nThe Commonwealth will provide $20 million over the next two years towards the Swan Active Ellenbrook facility, being built adjacent to the new Ellenbrook train station.\n\nBudget 'a really cruel hoax'\n\nThe opposition was keen to tell WA voters what it thought of the government's budget, hitting the airwaves to lay into the document.\n\nJane Hume says the opposition's budget reply will have much more to offer struggling Australians. (ABC News: ian cutmore)\n\nShadow Finance Minister Jane Hume said the budget didn't address the real issues people across the country were facing.\n\n\"This budget was clearly aimed not at the next five years but the next five weeks, and the centrepiece of the budget is really a cruel hoax,\" she told ABC Radio Perth.\n\n\"Let's face it, 70 cents a day [in tax cuts] that doesn't kick in for another 15 months is not even going to touch the sides.\"\n\nThe local Chamber of Commerce and Industry's chief economist Aaron Morey also wasn't too impressed.\n\n\"It's not the budget our nation needs. Our nation needs a budget and an economic focus that enhances the incentives for companies to invest in this country,\" he said.\n\nBut he said there were some winners, such as WA electricians.\n\n\"Basically ... electricians can have mutual recognition of their qualifications and licenses across state borders,\" he said.\n\n\"That's a good thing for an economy like WA with skill shortages, it will make it easier for us to attract some of those important trades into WA.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/labor-to-bring-on-surprise-tax-cut-vote/105096806",
        "title": "Labor to push tax cuts through parliament today, forcing Coalition's hand",
        "publish_date": "Tue, 25 Mar 2025 22:35:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor has introduced its tax cuts to parliament this morning and is attempting to force a swift vote, in a last-minute bid to force the Coalition to promise to repeal the cuts if it wins the upcoming election.\n\nThe opposition went against expectations with its decision to go against the centrepiece of last night's federal budget, which will see the 16 per cent tax rate cut to 15 per cent next year and 14 per cent after that, costing the budget $17.1 billion over the four-year forecast period.\n\nOpposition Leader Peter Dutton has called it a \"hoax\" and signalled he will use his budget reply speech on Thursday night to present an alternative policy.\n\nLabor's proposal would cut the taxes of all taxpayers by up to $268 in the first year and $536 after that – tax relief Mr Dutton would now need to legislate to wind back should Labor's bill succeed this week.\n\nThat is likely, with the bill having already passed the House of Representatives, and a guillotine motion to force a final vote in the Senate slated for 10pm AEDT. Senator Jacqui Lambie told the ABC she would vote for the tax cuts, leaving the government within striking distance of passage, after Greens leader Adam Bandt said his party would not \"stand in the way\".\n\nThe Coalition voted against the cuts in the House.\n\nLoading...\n\nCoalition derides '70 cents a day' tax cut\n\nMr Dutton told ABC News Breakfast the tax cut was \"just not going to help families today who are really suffering.\"\n\n\"[It's] a 70 cent a day tax cut in 15 months' time... There are a lot of people across the country who are working harder than ever before, and they just know that this government's budget has made it even harder for them to pay their bills,\" he said.\n\nHe foreshadowed a response to come in his Thursday speech in what may be his last chance to address voters before an election is called.\n\n\"Thursday night will be a big night, because we'll make a very significant announcement, and it will be about how we can help Australian families deal with Labor's cost of living crisis,\" he said.\n\nShadow Treasurer Angus Taylor mocked the size of the tax cut on the floor of parliament after the bill was introduced, suggesting the daily amount could only by \"a lollipop... a bread roll if it's on sale... or an entry into a jelly bean guessing competition....\n\n\"Last night we saw handed down by this hopeless treasurer a budget for the next five weeks, not the next five years.\"\n\nTreasurer Jim Chalmers told News Breakfast the tax cuts were \"modest in isolation, but meaningful when you combine them with the other tax cuts we're providing.\"\n\n\"We're proud of the budget that we handed down last night,\" he said. \"These tax cut top-ups are all about helping people with the cost of living.\"\n\nMr Chalmers called the Coalition's decision to oppose the tax cuts \"a brain explosion\".\n\nLoading...\n\n\"The election is going to be a pretty clear choice, and that choice is crystallising between a Labor government which is cutting taxes to help people with the cost of living, or Peter Dutton who has secret cuts which will make people worse off, not better off...\n\n\"Peter Dutton wants to cut everything, except for people's taxes.\"\n\nBattle of the bottom lines\n\nThe grapple over tax cuts comes as each of the major parties seeks to position itself to voters as the most \"responsible\" steward of the budget.\n\nFiscal responsibility has been central to Labor's pitch in a term dominated by inflation, but which has seen the first two budget surpluses in 15 years, a reduction in gross debt, and a lower rate of cost growth in the spending categories of aged care and the NDIS.\n\nBudget tax cut calculator Photo shows moody image of 50- and 100-dollar notes laid out over bank statements The federal budget includes a \"modest\" tax cut for every taxpayer, starting from next year.\n\nBut its fourth and final budget confirmed budget deficits would return for a decade at least, with no sign that the persistent gap between tax and spending will be closed.\n\nMr Taylor promised last weekend that the Coalition would take a stronger budget bottom line to the election than whatever Labor proposed.\n\nCentral to that pledge will be the Opposition's plan to cut tens of thousands of public service jobs. But it has yet to disclose how much it expects this would save.\n\nLoading...\n\nMeanwhile, it will support most of Labor's largest spending proposals, including the $8.4 billion bulk billing subsidy and the $1.8 billion extension of energy bill relief, and has spending proposals of its own including a $5 billion housing fund.\n\nThat means the fiscal \"envelope\" for any alternative cost of living package is likely to be similar to the $17 billion cost of Labor's tax cuts.\n\nExperts say bigger problems not addressed\n\nBut economists and welfare advocates have bemoaned that this contest over rival tax cuts and pre-election spending neglects bigger-picture challenges facing the budget and the economy.\n\n\"This is a budget that is clearly a pre-election budget,\" Grattan Institute CEO Aruna Sathanapally told the ABC.\n\n\"We've got tax cuts but not tax reform. We've got a boost to primary healthcare spending which is good but not the system reform that we need to see on how we spend. And we've got energy rebates rather than energy efficiency.\"\n\nThe real problem at the heart of this budget isn't a tax cut Photo shows Jim Chalmers budget pic Another budget has come and gone without any real effort to put the nation's finances on a more sustainable footing.\n\nMs Sathanapally said the government had used changes in budget forecasts \"to pay for… primary care and aged care on the one hand, and on the other these tax cuts, which unfortunately are the easy part.\n\n\"I think a lot of people will welcome this type of reduction in personal income tax in Australia, we lean heavily on personal income tax in Australia relative to other countries similar to us.\n\n\"But what we don't have is the hard bit, which is how we raise tax that's sufficient to pay for the spending we want and that we know is going to happen over the coming years.\"\n\nBudget economist Chris Richardson said the looming tax debate was not \"the right stuff or even terribly sensible. It is not particularly tax reform…\n\n\"We have had a lot of luck as a nation, the tax take has been much bigger than expected but not because of the decisions of the politicians, basically. We've had war, inflation, migration, all things that added to the tax take.\n\nChris Richardson is a leading Australian economist. (ABC News: Daniel Irvine)\n\n\"The risk is that for a quarter of a century we haven't made our spending better, we haven't made our tax [better]… I doubt that we are match fit for an increasingly volatile world with a range of Trump-shaped risks on the rise.\"\n\nIndependent economist Saul Eslake said the budget failed to address \"the critical issue which has been apparent since before the last election, which is that federal government spending is almost certain to be [higher] over the next 10 years, and in all likelihood beyond then, than the average between 1975 and 2019.\"\n\n\"The Australian public clearly want more spending on health, aged, disability and child care, and any political party which says they can't have it will not get elected to government… It's difficult to see how spending can be cut sufficiently to offset the increase in spending…\n\nDutton flags details of election pitch to come in budget reply Photo shows Peter Dutton outside. The opposition leader has refused to rule out his own version of the surprise $17 billion tax cuts revealed in Labor's budget last night.\n\n\"Ideally, both sides of politics would, between now and the next election, be having an 'adult conversation' with the electorate as to what would be the least economically damaging, and fairest, ways of raising the additional revenue required to pay for the additional spending… But there's a greater probability of my spotting a thylacine on my front lawn of a morning than that happening.\"\n\nACOSS chief executive Cassandra Goldie said it was \"astounding\" that the debate focused on tax cuts since they would provide \"more dollars for everybody except people with the least… [It] would have cost about $4.6 billion to fix it properly and then we would have been able to move beyond the reality that [people on welfare] just do not have enough money, $56 a day.\"\n\nBran Black of the Business Council of Australia said the budget had not done enough \"to grow the size of the pie. Ultimately, if we can invest in productivity enhancing measure, that's how we gain the scope to make further investment.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/peter-dutton-flags-election-pitch-budget-reply/105096452",
        "title": "Dutton flags details of election pitch to come in budget reply",
        "publish_date": "Tue, 25 Mar 2025 22:33:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Peter Dutton has flagged he will set up his election pitch to voters when he delivers his budget reply speech on Thursday, refusing to rule out his own version of the surprise tax cuts revealed in Labor's budget.\n\nThe opposition leader gave a few hints to what that election platform would include in his post-budget interview with ABC Radio on Wednesday, outlining his key priorities but declining to give any specifics.\n\nThey included providing support for families struggling with the cost of living, fixing the energy system, cutting back on migration, freeing up housing, providing guarantees around health and education funding, and lastly ensuring Australia's security in a \"very uncertain world\".\n\nHe also branded Labor's tax cuts — which will be worth about $5 a week to the average worker — an \"election bribe\" and \"slap in the face\" to households, but would not be drawn on whether his rejection meant the Coalition was planning their own bigger tax package.\n\n\"We'll give our budget reply on Thursday night,\" he said.\n\nHe gave the same answer when questioned about when he would release the specific details of the Coalition's plan to cut waste in the public service.\n\nFederal budget winners and losers The Albanese government has delivered its final budget ahead of an election in May, with a fresh new round of tax cuts the major offer. Find out who else is set to benefit and who may miss out.\n\nThe budget papers revealed the number of public servants has now grown by about 41,000 since the Coalition was in power, with Shadow Treasurer Angus Taylor confirming on Tuesday night they would seek to slash those jobs if elected at the next election.\n\nUp until now the Coalition has refused to provide details of how they would get to that goal, but on Wednesday Mr Taylor seemed to give the first hint that it could be achieved through \"attrition\" — in other words, not through job losses.\n\n\"We know that the public service has got so big now that attrition rates are high and so, let's be clear, that would be what we are relying on,\" he said.\n\nAsked whether attrition alone would be enough to reach their target, Mr Taylor flagged they would have more to say over the coming weeks.\n\n\"We want a public service that delivers for Australians, where people are excited and empowered to work, where bureaucracy doesn't control everything, where people can get on with their jobs and that doesn't need to be a bigger public service,\" he said.\n\nLabor introduces tax cuts legislation\n\nThe $17.1 billion for an income tax cut for every Australian worker was the major surprise of Jim Chalmer's fourth budget as treasurer, which he handed down on Tuesday night.\n\nIn his post-budget media rounds, the treasurer was keen to focus on the measure which he described as \"modest in isolation\" but \"meaningful\" when combined with the other previously announced tax breaks.\n\nThe cuts will start in the middle of next year and would deliver the average wage earner about $268 in annual income tax cuts.\n\nLabor has spent the morning after budget spruiking their new \"modest\" income tax cuts. (ABC News: Matt Roberts)\n\n\"The election is going to be a pretty clear choice,\" Mr Chalmers said.\n\n\"And that choice is crystallising between a Labor government which is cutting taxes to help people with the cost of living, or Peter Dutton who has secret cuts which will make people worse off — not better off.\"\n\nThe government introduced legislation for the tax cuts to parliament early on Wednesday, in a bid to force the Coalition to promise to repeal the cuts if it wins the election — which is due on or before May 17.\n\nSpeaking in the House of Representatives, the treasurer declared that \"to stand in the way of this legislation is to vote for higher taxes\".\n\n\"To vote against this legislation would be to stand in the way of more hard-earned money staying in the pockets of every hard-working Australian,\" he said.\n\nAfter two back-to-back budget surpluses, the government has had to sell a $42.1 billion deficit and a bottom line that is expected to remain in the red for the next decade.\n\nBut Prime Minister Anthony Albanese focused instead on the drop in the deficit compared to what was forecast at the last election in 2022.\n\n\"We've already had some almost $100 billion of savings, we've been responsible in the way that we've managed the economy,\" he said.\n\n\"We inherited in that first year a $78 billion deficit that we turned into a $20 billion Labor surplus. We followed that up with another surplus. And in last night's budget we've halved the deficit.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/donald-trump-portrait-removed-from-colorado-state-capitol/105096442",
        "title": "Trump's portrait removed from Colorado's state capitol",
        "publish_date": "Tue, 25 Mar 2025 22:21:07 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A portrait of Donald Trump has been removed from the Colorado State Capitol, after the US president claimed it was \"purposefully distorted\" and \"truly the worst\".\n\nMr Trump took to Truth Social on Sunday night, US time, demanding the oil painting be taken down as it did not accurately depict him.\n\n\"Nobody likes a bad picture or painting of themselves,\" he wrote.\n\n\" But the one in Colorado ... was purposefully distorted to a level that even I, perhaps, have never seen before. \"\n\nMr Trump said the painting did not accurately depict him. (Truth Social: @realDonaldTrump)\n\nAt some point late Monday or early Tuesday, the portrait, by Colorado Springs artist Sarah Boardman, was removed and placed in storage.\n\nThe plaque that marked the placement of President Trump's portrait, alongside other presidents, is all that remains.\n\nLegislative leaders on both sides of the political divide will now decide how to replace the painting.\n\nBut Joshua Bly, a spokesperson for Colorado Senate Republicans, told the Associated Press it was unknown when this would happen.\n\n\"We have no idea when a new portrait is going to go up, how it’s going to be fundraised, who is going to pay for it, who is going to paint it,\" he said.\n\nHe said it was also unclear whether Mr Trump would be able to approve the replacement.\n\nColorado Republicans raised more than $US10,000 ($15,862) to commission the oil painting, which has hung in the state Capitol since 2019.\n\nLoading YouTube content\n\nMr Trump also criticised the artist, who has painted portraits of several US presidents, including Barack Obama and George W Bush.\n\n\"The artist also did President Obama, and he looks wonderful, but the one on me is truly the worst,\" he said on Truth Social. \"She must have lost her talent as she got older.\"\n\nSpeaking to the Denver Post in 2019, the artist said it was crucial her subjects looked apolitical.\n\n\"In today's environment it's all very up-front, but in another five, 10, 15 years he will be another president on the wall,\" Ms Boardman said.\n\n\"And he needs to look neutral.\"\n\nFollowing Mr Trump's complaint, Colorado Governor Jared Polis's office issued a statement to multiple outlets.\n\nThe statement said the governor was \"surprised\" the US president was an \"aficionado\" of the Colorado State Capitol and its artwork.\n\n\"We appreciate the president and everyone's interest in our capitol building,\" the statement said.\n\n\" [We] are always looking for any opportunity to improve our visitor experience. \"\n\nABC/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/basil-zempilas-what-to-expect-from-new-wa-liberal-leader/105094554",
        "title": "Basil Zempilas's plans to lift the WA Liberals out of the doldrums",
        "publish_date": "Tue, 25 Mar 2025 22:16:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"Work hard today and tomorrow will take care of itself.\"\n\nThat's the mantra new WA Liberal leader Basil Zempilas hopes will help him square up to one of the most unenviable jobs in politics.\n\nBeing opposition leader is hard enough.\n\nRebuilding a party with just six lower house colleagues is even harder.\n\nDoing it as the Liberal leader cranks the difficulty up even higher, for one key reason.\n\nBasil Zempilas and Libby Mettam, his deputy leader, have vowed to work together for the good of the party. (ABC News: Andrew O'Connor)\n\nOver the past two decades they've had 10 state leaders, compared to Labor's five.\n\n\"In opposition, we're not flash,\" retiring upper house MP Peter Collier admitted on his way into the party's caucus yesterday.\n\n\"That's one thing the Labor Party do actually do well, in terms of the fact that they do unify behind the leader.\n\nPeter Collier conceded his party had not been good at getting behind its leaders. (ABC News: Keane Bourke)\n\n\"That's something that we can learn from.\"\n\nZempilas will be hoping his colleagues do, lest he become just another discarded Liberal leader.\n\nWill Basil Zempilas be a lifeline or a liability for the WA Liberals? Photo shows Headshot of Basil Zempilas speaking. Is Basil Zempilas the silver bullet the WA Liberals so desperately need? Even within the party's own ranks, opinions are divided.\n\nWhen asked if he was confident he'd lead the party to the next election it was his \"work hard\" mantra he replied with.\n\nSo let's have a look at what hard work he has ahead over the next 1,445 days to make sure he lasts the distance.\n\nWhat will Zempilas do?\n\nThe first task he has is hashing out an agreement with the Nationals over how they'll work together in opposition.\n\nIn the previous parliament the pair were in an alliance — because it allowed more independence than a full-blown coalition — but Zempilas wasn't letting on what the next four years might look like.\n\nFirst, he says, he wants to hear from fellow Liberals about what the arrangement should look like.\n\nBasil Zempilas gave his first press conference as WA Liberal leader on Tuesday. (ABC News: Keane Bourke)\n\n\"My leadership style, for what it's worth, will always be collaborative,\" he said.\n\nNationals leader Shane Love has been similarly coy about how the parties should be partnered.\n\n\"I firmly believe a strong, unified approach is essential to holding the Labor government to account,\" was as far as he would go in a statement yesterday.\n\nOnce that partnership is worked out, Zempilas and Love can start dishing out shadow portfolios to really get their teams to work.\n\nNewly minted MP Basil Zempilas voted in unopposed as WA Liberal leader Photo shows A close-up of Basil Zempilas wearing a suit. After winning his seat by an extremely thin margin, newly minted Churchlands MP Basil Zempilas is voted in by his party colleagues as leader of the WA Liberals.\n\n\"That is a matter of urgency, but it is not such urgency that it needs to happen in the next couple of days,\" Zempilas said.\n\n'Raise the standards'\n\nThen comes the hard work of being a \"constructive opposition\", as Zempilas wants to be, including by improving the standard of parliamentary debate.\n\n\"Raise the standards, raise the tone,\" he said.\n\nHe also listed a number of \"hallmarks\" including: \"fairness\" especially for \"those who need a helping hand\"; \"integrity\"; \"excellence\" and \"common sense\".\n\nAll the while leading a \"reset\" of his party.\n\nSome policies taken to the election could be shelved: \"Many of those had great merit, but everything is now up for discussion.\"\n\nOne already ditched is Mettam's controversial pledge to not stand in front of the Aboriginal flag if elected Premier.\n\nBasil Zempilas says he will be happy to stand in front of the Aboriginal flag at press conferences, unlike his predecessor Libby Mettam. (ABC News: Keane Bourke)\n\n\"I'm happy to stand in front of the Aboriginal flag anywhere, anytime,\" was Zempilas's answer.\n\nBut opposing \"wasteful government spending\", particularly plans for a racetrack at Burswood Park, would likely survive.\n\nWhat are the Liberals saying?\n\nBeyond that though, \"listening\" will be the key — mentioned 11 times by Zempilas.\n\n\"Listening is what is going to give us the answers to those questions,\" he said.\n\nVeteran upper house MP Steve Thomas agreed that was the right approach.\n\n\"We need to reach out to the people differently, we need to develop policies in a more robust manner and we need to communicate what we're trying to do better,\" he said.\n\nSteve Thomas backed Basil Zempilas's call for a different approach for the Liberal Party. (ABC News: Keane Bourke)\n\nHis hope is Zempilas, as a recently anointed Liberal, is the right man for the job.\n\n\"Someone that doesn't come with all of the history of the Liberal Party and can look at it and go, we need to do it differently and we certainly need to do it better,\" Dr Thomas said.\n\n'People will see what I'm about'\n\nOn top of listening to key players across the state, Zempilas will also be learning how to listen to his electorate as a first-term MP alongside his other newbie colleagues.\n\n\"We're not all politicians, we're parliamentarians, and we have a responsibility to represent the places that elected us,\" Kalamunda MP Adam Hort acknowledged as he arrived after just scraping over the line.\n\nAdam Hort had to wait until Monday before being confirmed as the winner in Kalamunda. (ABC News: Keane Bourke)\n\nFor Zempilas, that responsibility is to the people of Churchlands — a seat he won by just 636 votes.\n\nThat narrow margin has raised concerns among some Liberals that he doesn't have wide appeal across the community the party had hoped for.\n\n\"I'm confident that as I get to work with my team, people will see what I'm about, what I plan to bring to this space,\" Zempilas said.\n\nMr Zempilas says his leadership ushers in a \"reset\" for the Liberal party. (ABC News: Herlyn Kaur )\n\n\"The vigour, the energy, the professionalism, the fight for the people every single day.\"\n\nHard work key for Zempilas\n\nAsked how he planned to counter the suggestion he wasn't popular among women, Zempilas had a similar answer.\n\n\"Work hard, be myself, do what I've come here for and that is to work hard every day for the people of Churchlands and work hard every day for the people of Western Australia,\" he said.\n\nZempilas's capacity for hard work is pretty well beyond question after years of juggling a busy media schedule across radio, TV and print as well as being Lord Mayor for a period.\n\nMr Zempilas says the Liberal Party will listen to the community more. (ABC News: Jake Sturmer)\n\nHis test will be uniting a notoriously difficult partyroom and keeping them focused on their next big test in 2029.\n\nIt's a mammoth one, made harder by a worse-than-expected result at this election.\n\nBut maybe 1,445 days of hard work will be enough for the result to take care of itself.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-03-26/afl-jamarra-ugle-hagan-bulldogs-future-luke-beveridge/105096440",
        "title": "Ugle-Hagan's future 'rubbery' says coach as Dogs hope for turnaround",
        "publish_date": "Tue, 25 Mar 2025 22:08:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Western Bulldogs are still holding out hope Jamarra Ugle-Hagan will remain at the club beyond this season, even as it remains unclear when he will play another game.\n\nUgle-Hagan is yet to play this season and has trained sparingly with the Bulldogs as he deals with off-field issues. He has found himself in the headlines this week after opting to not attend Bulldogs games.\n\nThe 22-year-old, who was the first overall pick in the 2020 draft, is contracted through the 2026 season and played 67 games for the Bulldogs through his first four seasons at the AFL level.\n\n\"There is a lot of unknowns and it only sort of crystallises at the end of the year,\" Bulldogs coach Luke Beveridge told Nine's Footy Classified.\n\n\"At this point in time obviously there's a lot of media conjecture and reports that clubs are interested, and that happens. Ultimately, no one is sure of that until 'Marra's management comes to you and says, 'Hey, this is what he'd like to happen'.\n\n\"We're passionate about him, we've cared for him for a long time. There is a bit of a frustration, but we're understanding what he's going through.\n\n\"We'd love for him to re-engage, we'd love him to be a part of our football club and we'd love to see more of those performances in the future and so we hold out a lot of hope.\"\n\nBeveridge described the expectation around Ugle-Hagan's movements as \"rubbery\" and admitted he often receives calls and texts from people who have spotted the Bulldogs forward out in public.\n\n\"It's a long series of events away from the club that people have become privy to,\" he said.\n\n\"The challenging thing in today's society, especially when you live a public life like Jamarra does, is everyone knows where you are. Whether it's on socials or it's (someone) texting me or ringing me after they've located him somewhere.\n\n\"The expectation around his movement into the future is a bit rubbery.\n\n\"He'll train at the club here and there. There will be times where he is absolutely not expected to be in different places and it'll be his choice. We're working with him on that and sometimes it's a tolerance to it.\"\n\nBeveridge hinted at immaturity being a factor behind Ugle-Hagan's absence from the team so far this season.\n\n\"We talk about the character and the integrity of the person and how they may be a little bit immature and it might take some time,\" he said.\n\nLoading...\n\n\"I reflect on how I was as an 18-year-old, I was very immature compared to some others my age, and 'Marra is no different and it may take him a little bit more time.\n\n\"I definitely won't be making any decisions. What will happen is it will be a group think and ultimately, similar to what's happened with one or two players in the past, it's what's best for the player and ultimately what's best for our football club as we move into the future.\"\n\nUgle-Hagan is considered to be one of the best young forward prospects in the AFL and has earned comparisons to legendary former Hawks and Swans forward, Lance Franklin.\n\nLance Franklin is no stranger to being in the spotlight as a youngster after the early part of his career with Hawthorn. (Getty Images: Lucas Dawson)\n\nFranklin, like Ugle-Hagan, found himself constantly in the headlines during his rise to stardom with Hawthorn in the mid-2000s, and urged the Bulldog to find himself a solid support network.\n\n\"You have got to have good people around you,\" he said.\n\n\"[Having] people that can pull you into line when you need to be, but also just being there for you when you are playing good, or playing poorly, or whatever is happening in your life – I think that is the biggest learning I have taken out of your career.\n\n\"It just comes back to that enjoyment factor. If you love what you do, and you are passionate about it, then obviously you want to stay in the game as long as possible.\n\n\"For any young kids, it’s just building those relationships and building trust within the club and the people that are there and having those conversations.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/lululemon-brand-ambassador-finance-advisers-13-content-creators-get-advance-budget-reading-20250325-p5lmdc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Can I get a signature?’ How influencers covered the budget and will join the campaign trail",
        "publish_date": "Wed, 26 Mar 2025 12:51:49 +1100",
        "category": "finance",
        "authors": [
            "Olivia Ireland"
        ],
        "text": "Money, Money, Money podcaster Glen James finished interviewing Finance Minister Katy Gallagher on Tuesday with an unusual question. “It’s a big one,” James said. “Can I get a signature?” he said.\n\n“Will you get Jim [Chalmers’] too?” Gallagher asked as she signed James’ copy of the 2025 federal budget in front of a room full of chuckling influencers who Labor had invited for the first time to get a preview of the document as the party seeks to win younger voters.\n\nA sportswear brand ambassador and charity founder, Instagram finance advisers and left-wing feminist influencers were part of the group who came to Canberra for the budget as part of a Labor strategy to court prominent online voices reported by this masthead earlier this month.\n\nSome of the influencers, including podcaster Hannah Ferguson from Cheek Media, posted videos championing their approach to coverage, saying it engaged young people, and trading off the appearance of a conflict with mainstream media.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/nick-reece-s-big-spend-agenda-in-doubt-as-melbourne-s-debt-reaches-historic-levels-20250307-p5lhqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nick Reece’s big-spend agenda in doubt as Melbourne’s debt reaches historic levels",
        "publish_date": "Wed, 26 Mar 2025 12:44:22 +1100",
        "category": "finance",
        "authors": [
            "Rachael Dexter"
        ],
        "text": "More of Lord Mayor Nick Reece’s election promises are under a cloud – including a rates freeze – as hostile councillors threaten to undermine his big-spend agenda, citing climbing debt.\n\nLast week, the City of Melbourne voted in a substantially watered-down version of Reece’s pledge to make public pools cheaper amid concerns of project delays and rising costs.\n\nMelbourne council’s debt is forecast to reach an unprecedented $216 million by the end of June and councillors are concerned the lord mayor is overspending. Credit: Justin McManus\n\nCapital works expenditure and debt have come in under budget for the last five years, due to major construction delays. But a number of councillors are getting anxious over forecast debt, which is set to reach an unprecedented $216 million by the end of June this year and peak at $275 million next June before trending down.\n\nReece has already abandoned an unpopular pledge to sell the council’s half of the Regent Theatre for $50 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-floods-forecast-for-queensland-as-rain-returns-to-south-east-20250325-p5lmat.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: New Olympic stadium will be named after the city; Floods forecast for Queensland as rain returns to south-east",
        "publish_date": "Wed, 26 Mar 2025 12:41:06 +1100",
        "category": "sports",
        "authors": [],
        "text": "The Gabba’s days are numbered. That’s not entirely new.\n\nBut this morning Premier David Crisafulli has revealed his vision for the historic, albeit doomed, oval.\n\nABC Radio host Steve Austin asked the premier: “What happens to the Gabba itself after the Olympics have finished?”\n\nCrisafulli replied: “It gets knocked down.”\n\nIn 2018, the Stadium Taskforce Report found the Gabba was a ‘tired’ venue that would come to the end of its useful life by 2030. Credit: Adobe Stock\n\nBut the premier said he hopes the Gabba will be farewelled by a gold-medal-winning Australian Olympic cricket team, before it is razed.\n\n“Now cricket’s been confirmed for LA, [it] hasn’t been confirmed yet for us, but we’re pretty confident it will be,” he said.\n\n“I would love the Gabba’s swan song to be Australia winning a gold medal there.”\n\nCrisafulli said he expected the Gabba would be bulldozed to make way for an urban renewal site with “quality” commercial and residential development that would compliment a new indoor arena to be built on the neighbouring, old GoPrint site and the new Cross River Rail station.\n\n“Because with Cross River rail, without the Gabba, you’ve got a really important piece of infrastructure that otherwise won’t get the use it needs,” he said.\n\nThe future of East Brisbane State School, which sits beside the stadium, is not clear in the event the Gabba is torn down.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/influencers-descend-on-canberra-as-part-of-a-labor-plan-to-spruik-the-budget-to-young-people-20250326-p5lmob.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Influencers descend on Canberra as part of a Labor plan to spruik the budget to young people.",
        "publish_date": "Wed, 26 Mar 2025 12:35:59 +1100",
        "category": "finance",
        "authors": [],
        "text": "Influencers descend on Canberra as part of a Labor plan to spruik the budget to young people.\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/gwyneth-paltrow-responds-to-rumoured-feud-with-meghan-markle-20250326-p5lmo7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gwyneth Paltrow responds to rumoured feud with Meghan Markle",
        "publish_date": "Wed, 26 Mar 2025 12:27:42 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Gwyneth Paltrow responds to rumoured feud with Meghan Markle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/comedy/how-famously-conflict-averse-luke-mcgregor-handles-curly-questions-20250320-p5ll48.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How famously conflict-averse Luke McGregor handles curly questions",
        "publish_date": "Wed, 26 Mar 2025 12:21:38 +1100",
        "category": "finance",
        "authors": [
            "Cassidy Knowlton"
        ],
        "text": "He generally has a rule that I think is eminently sensible – if there is a peanut butter dessert on a menu, you should order it – but since he’s going to be on stage in a few hours, we wistfully forgo dessert on this occasion. Although he performed at the Gala in 2023, McGregor hasn’t done a full-length show in eight years. In 2017, he was single, living in Melbourne and riddled with anxiety. For his new show, he’s married, living in Newcastle, and well, still anxious but better at covering it. Wagyu steak with fries and Parisian butter at Lucia Credit: Penny Stephens “It’s pretty much about everything that’s happened in the last eight years, but I used to do a show where I’d talk about how I’m anxious and nervous, and now I’m still that, but I’ve also got children, right? And so children are like, ‘how do you solve this issue?’ And I’m like, ‘I don’t know. I haven’t figured out myself yet’. So you have to fake it or make something up.” You might think someone with McGregor’s disposition might have chosen a career further from the spotlight, like an economist or something. He thought that, too, getting a degree in economics and planning a life as a policy wonk, until a drink too many at a comedy gig changed his life.\n\nThe lobster “taco” at Lucia. Credit: Penny Stephens “One of my friends was doing comedy, one of my housemates, and I went to the gig to watch him, and someone didn’t show up. I was a bit tipsy, so I got up as well. I loved it and just never stopped doing it,” he says. He had prepared nothing, so he was addressing a room full of strangers entirely off the cuff. Did it go well? He shakes his head, very sure on this point. “No.” “For the first minute and a half, I was just saying things like, you guys might want to put in your drinks because you are going to spill them all over yourself, I’m very funny, and the crowd went with it. Then I had no jokes and I bombed. But the little bit that went well was enough to get me hooked.” It took a long time to make it his full-time career, but he knew right then that this was what he wanted to do with his life. “In that moment, that was the first time where I felt like coming home or something. It felt like, ‘oh, this is me. This feels like unfiltered. This feels like 100 per cent me’.” The early years were hard, playing to tiny rooms and doing his own flyering. “I used to do a double act with a friend from Tassie, and we’d have, like, two people there. And then when I did Edinburgh, I had, like, four people, seven people, in an 80-seater venue,” he says. But those two, four or seven people liked what they saw. He won the coveted Best Newcomer Award for his first full-length show at MICF in 2013, and he started playing to bigger rooms. “I was moving to bigger venues, quicker than I was ready. At first, I was worried no one would show up, and then I was worried people would show up.”\n\nHe landed the role of Hugh on the first two seasons of Utopia, where he became close with Pacquola. Their show Rosehaven turned out to be a hit for the ABC and ran for five seasons, by which time “we had run out of real estate storylines”, McGregor says. “We always had enough ideas for one-and-a-half seasons, and by the time we got to the fifth, we were on the cusp of running out of ideas. And then we just didn’t have enough for a sixth. It would have been a strain and would have been the first time we went into writing without having a full idea in our heads.” That’s not to say McGregor’s collaboration with Pacquola is finished, with the pair working on a new project he’s cagey about telling me too much about. “We want to write something where more things can happen,” he says, somewhat mysteriously. “Rosehaven was very small stakes... I reckon we’ll work together on stuff forever, we’re always doing something. And plus, we’re besties, we’re hanging out anyway.” Luke McGregor on stage at the 2017 Melbourne International Comedy Festival Gala. Credit: Jim Lee He nominates Pacquola, of course, as one of his favourite comedians, alongside Ronny Chieng, Aaron Chen, Sam Campbell, Nazeem Hussain and Anne Edmonds. I had read an interview with McGregor a decade ago where he revealed his comedic hero was American Dave Chappelle, so I ask him: how does famously conflict-averse McGregor now feel about Chappelle, who came under fire for jokes about transgender people in his 2021 Netflix special The Closer, then doubled down in his 2023 special The Dreamer? McGregor’s wife is non-binary and uses they/them pronouns. It has been an extremely pleasant interview thus far, but it is clear McGregor does not like this question. He pauses to consider his answer. “I don’t gel as much with his new stuff, he says, slowly. “I haven’t kept up with him. So I don’t know. I know there was controversy around his last special, but I haven’t kept up to date.”\n\nI press the matter. Are there jokes or topics or subjects comics just shouldn’t touch? “I’m a straight, white man, so I have all the privilege, and I don’t like commenting on people who aren’t other straight, white men. I just don’t feel like it’s my place to say,” he says. But he goes on: “I think trans rights are really important. I think we have got to protect those, and I don’t like what’s happening in America right now. I think if comedy doesn’t elevate groups that need help or that are getting persecuted in some way, then what are we doing?” He says while he loves watching comedians like Jon Stewart and John Oliver overseas, and Tom Ballard here, that kind of comedy is not his chosen medium for standup. But he then quotes American YouTuber Philip DeFranco: “You may not F-word with politics, but politics F-words with you” (this is an exact transcript, McGregor is no foul-mouthed comedian). “We’ve all got skin in the game,” he says. Celia Pacquola and Luke McGregor write and star in Rosehaven. Credit: ABC For McGregor, that skin in the game has to result in a shared empathy and compassion. “I think part of our job as good citizens is that we have to think about issues that don’t affect us, like aged care, like trans rights, like childcare. You might not be affected by it, but without people thinking about it outside of their own experience, those issues don’t get fixed.” In full flow, he explains the duty a government has to its citizens, and that we have to each other. And even though we are talking politics, which can be tricky ground for a comedian or public figure of any kind, he does not seem nervous at all.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/beveridge-morris-come-face-to-face-after-infamous-2022-bust-up-20250326-p5lmmc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beveridge, Morris come face to face after infamous 2022 bust-up",
        "publish_date": "Wed, 26 Mar 2025 12:20:09 +1100",
        "category": "sports",
        "authors": [
            "Angus Delaney"
        ],
        "text": "Western Bulldogs coach Luke Beveridge has come face to face with football reporter Tom Morris for the first time since their infamous clash in 2022 – and appeared on Channel Nine for the first time since “antagonists” left for rival network Seven.\n\nOn Tuesday night, Beveridge joined Footy Classified on Nine (owner of this masthead), on which Morris is a panellist. He was asked about his clash with Morris but declined to go into detail.\n\nWestern Bulldogs coach Luke Beveridge. Credit: Getty Images\n\n“It’s the first time I’ve been on Channel Nine, probably since some antagonists have moved over to Channel Seven, to be honest. And so I’ve come here tonight to definitely interact and hopefully provide something of value. But the detail in what happened … I just don’t think we should go there,” Beveridge said.\n\nBeveridge did not specify which “antagonists” he was referring to, but former Footy Classified, Sunday Footy Show panellist and Age columnist Kane Cornes, who had been highly critical of the Bulldogs coach in 2024, recently left Nine to join Channel Seven.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-coalition-to-oppose-labor-s-17-billion-in-tax-cuts-as-angus-taylor-slams-chalmers-cash-splash-20250325-p5lmie.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Chalmers’ $17 billion tax cuts clear first hurdle as Dutton flags ‘significant announcement’ in budget reply speech",
        "publish_date": "Wed, 26 Mar 2025 12:09:33 +1100",
        "category": "finance",
        "authors": [
            "Cassandra Morgan"
        ],
        "text": "Shadow Treasurer Angus Taylor says the Coalition is yet to understand the details of a Labor proposal to ban non-compete agreements, which prevent staff defecting to other employers or starting their own business.\n\nSpeaking on ABC Radio National earlier this morning, Taylor said he supported free labour markets where people could move easily between jobs. But a lot of questions remained about how Labor’s proposal would work, he said.\n\n“Given it’s a very complex area of employment law, it’s unclear whether these changes would apply to non-disclosure agreements, for instance. So we need answers to those questions,” Taylor said.\n\nThe Council of Small Business Organisations Australia earlier told the ABC last night’s federal budget was one of the worst for small business, and the council was shocked and disappointed by the non-compete clause.\n\n“We don’t actually understand what’s being proposed here yet ... [the council] may or may not,” Taylor said.\n\nLoading\n\n“The thing about the Labor Party is they’re more likely to brief other people than us. That’s how they work. They don’t seem to believe in democracy the way I do. So we haven’t been briefed on the detail of it.\n\n“I’m someone who knows that the detail of these things really counts. We want people to have options in the labour market, but we also want small business to be strong.”\n\nUnder Labor’s proposal, Australian workers will be free to change jobs for a pay rise more easily.\n\nBusinesses will be barred from forcing non-compete clauses on staff earning less than $175,000, which represents about four in five workers, after the contracts spread from industries such as the law to low-paid jobs such as hairdressing, where they delay job switches by months or years.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/marnus-fails-after-astonishing-luck-20250326-p5lmnt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Marnus' fails after astonishing luck",
        "publish_date": "Wed, 26 Mar 2025 12:07:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Marnus' fails after astonishing luck\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/athletics-becomes-first-olympic-sport-to-introduce-dna-sex-testing-for-women-20250326-p5lmk5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Athletics becomes first Olympic sport to introduce DNA sex testing for women",
        "publish_date": "Wed, 26 Mar 2025 12:03:00 +1100",
        "category": "sports",
        "authors": [
            "Tariq Panja"
        ],
        "text": "Athletics will introduce mandatory DNA sex testing for athletes entering female competitions, its global leader said, making it the first Olympic sport to add the requirement.\n\nThe move comes amid an increasingly vexed debate over eligibility rules in female sports and comes less than a year after the issue erupted at the Paris Olympics when questions about the qualifications of two women who went on to secure gold medals in boxing led to tumultuous — and at times disturbing — scenes inside and outside of the ring.\n\nThe move is essential to protect female sports, said Lord Sebastian Coe of Britain, the head of track’s governing body, World Athletics, and a former double Olympic gold medallist. He said the new policy, which will subject competitors to what is described as a noninvasive cheek swab or dry blood DNA test, was part of his vow to “doggedly protect the female category and do whatever it takes to protect it.”\n\nWorld Athletics said the new tests could be in place in time for its next world championships, in Tokyo in September.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/coles-axes-vintage-cellars-first-choice-brands-20250325-p5lmg1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coles axes Vintage Cellars, First Choice brands",
        "publish_date": "Wed, 26 Mar 2025 12:02:00 +1100",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "The Vintage Cellars and First Choice Liquor Market store names will disappear across the country by the end of the year and will be absorbed into the better-known Liquorland umbrella brand as Coles fights to close the gap with rivals Dan Murphy’s and BWS.\n\nFor the first time, Coles customers will also be able to price match in any store, an offer that Dan Murphy’s has made itself synonymous with.\n\nColes’ Vintage Cellars and First Choice Liquor Market brands will disappear and be absorbed into the broader Liquorland banner. Credit: Domain\n\nColes Liquor chief executive Michael Courtney said a pilot that saw 14 Vintage Cellars and First Choice stores converted into “Liquorland Cellars” and “Liquorland Warehouse” was successful, resulting in a 16 per cent rise in brand awareness and a 30 per cent increase in customers likely to shop again.\n\n“They’re enjoying the experience in-store,” Courtney said. “All of those customer data points led to us seeing an increase in sales throughout the trial, which is really positive and gives us the opportunity to move forward.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/beveridge-and-morris-discuss-2022-clash-20250326-p5lmno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beveridge and Morris discuss 2022 clash",
        "publish_date": "Wed, 26 Mar 2025 11:59:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Beveridge and Morris discuss 2022 clash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/taller-than-an-a380-this-mammoth-sculpture-will-welcome-you-to-sydney-s-new-airport-20250318-p5lkhs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Taller than an A380, this mammoth sculpture will welcome you to Sydney’s new airport",
        "publish_date": "Wed, 26 Mar 2025 11:58:39 +1100",
        "category": "finance",
        "authors": [
            "Matt O'Sullivan"
        ],
        "text": "Rising out of what were once paddocks, a giant globe-like steel sculpture is quickly taking shape near the northern end of Sydney’s new international airport, no doubt leaving some people wondering what it is.\n\nUnder construction near crossroads for the new M12 motorway and a road link to Western Sydney Airport, the eye-catching structure will be 30 metres high, making it visible to passengers when the first flights start late next year.\n\nThe giant sculpture under construction near the northern end of the new Western Sydney Airport. Credit: Nick Moir\n\nDesigned by Indigenous design studio Balarinji, the steel is being crafted into an emu nest, inspired by the Great Emu in the Sky constellation. It will celebrate the local Dharug people’s dreaming story about Mariong – the emu and mother – and how she became the Milky Way.\n\nDuring the day, the sculpture will represent the emu nest, created by signature sticks that nod to the landscape and materials of the Dharug people.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/video/mixed-response-to-labors-modest-budget/95vasz55j",
        "title": "Mixed response to Labor's 'modest budget'",
        "publish_date": "Wed, 26 Mar 2025 01:51:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mixed response to Labor's 'modest budget'\n\nPublished 26 March 2025, 1:04 am\n\nEven with tens of billions in extra spending, and now, a tax cut for all, it's inevitable Labor's fourth Budget has left many unsatisfied. As stakeholder groups descend upon Parliament House political correspondent Sara Tomevska brings us the first takes of how the Budget has been received.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/government-defends-tax-cuts-for-every-australian-taxpayer/zs80m0vlw",
        "title": "Government defends tax cuts for every Australian taxpayer",
        "publish_date": "Wed, 26 Mar 2025 01:44:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-26-march-2025/dm028iqx4",
        "title": "Midday News Bulletin 26 March 2025",
        "publish_date": "Wed, 26 Mar 2025 01:25:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nThe Prime Minister spruiks Labor's budget\n\nUS President Donald Trump denies that security messages accidentally sent to a journalist contained classified information; and in football\n\nThe coach of the Socceroos says the task now is to maintain the momentum after a win against China\n\nThe Prime Minister says Australians on an average income will be two-and-half thousand dollars better off* due to tax cuts unveiled in last night's federal budget.\n\n\n\n\n\nLabor is set to deliver two more tax cuts in 2026 and 2027 - on top of the stage 3 measures that rolled out in 2024.\n\n\n\n\n\nA worker on an average income will receive $268 from July 2026, rising to $536 in the following year.\n\n\n\n\n\nThe measure is projected to cost $17 billion over the next three years.\n\n\n\n\n\nOther cost of living measures include a $150 energy bill rebate for every household, cheaper medications, and $8.5 billion to lift bulk-billing rates.\n\n\n\n\n\nPrime Minister Anthony Albanese says Australians would feel a positive impact from the budget.\n\n\n\n\n\n\"Every Australian will get a tax cut and it builds on the tax cuts that have begun this year so that average workers will get $2,500 dollars as a result of the measures we’ve put in place. Measures that were opposed by the Opposition. They want to cut everything: cut your education, cut your health. The only thing they don’t want to cut is your taxes.\"\n\n\n\n\n\n---\n\n\n\n\n\nOpposition Treasurer Angus Taylor says the Coalition will not support the government's tax cuts, labelling them an \"election night bribe\" that will do little to address Australians' falling standard of living.\n\n\n\n\n\nMr Taylor did not rule out the Coalition introducing tax cuts of its own, as Opposition leader Peter Dutton is expected to deliver his budget reply speech tomorrow.\n\n\n\n\n\nInstead he said his party's economic blueprint would focus on cost of living measures and national security.\n\n\n\n\n\nMr Taylor says the government's budget would fail to relieve prices pressures for struggling families.\n\n\n\n\n\n\"No pathway back to the stand of living we had. In fact what we saw was an election night bribe. Seventy cents a day in a year's time. That is the best this Treasurer can do for Australians who are suffering as never before.\"\n\n\n\n\n\n---\n\n\n\n\n\nAged care workers can expect a wage increase if the Labor government wins the upcoming election.\n\n\n\n\n\n$48.7 million over three years has been allocated in the federal budget to cover the cost of the increase in award wages.\n\n\n\n\n\nThis builds upon the $291.6 million over five years from 2024-25 to continue the delivery of aged care reforms and implementation of recommendations from the Royal commission into Aged Care Quality and Safety.\n\n\n\n\n\nNearly $50 million in additional funding is to go towards supporting First Nations organisations to deliver culturally appropriate aged care assessments.\n\n\n\n\n\nTom Symondson from Ageing Australia says they wanted to see more.\n\n\n\n\n\n\"We had called for investments in digital readiness, in making sure that our providers are ready to implement the new act on 1 July, and we'd also called for assistance to prepare themselves to take on huge numbers of new older people who are going to need care.\"\n\n\n\n\n\n---\n\n\n\n\n\nUS President Donald Trump says his administration will look into the use of social media app Signal by top White House officials.\n\n\n\n\n\nIt comes after revelations that Mr Trump's national security adviser, Mike Waltz, added a journalist to a Signal group chat discussing plans for military strikes against Houthi rebels in Yemen, earlier this month.\n\n\n\n\n\nDefence Secretary Pete Hegseth, Vice President JD Vance and other top security officials were also in the group.\n\n\n\n\n\nThe journalist, Atlantic editor-in-chief Jeffrey Goldberg, did not reveal details of the strike at the time.\n\n\n\n\n\nSpeaking to reporters at the White House, President Trump defended Mr Waltz, while appearing to insult Mr Goldberg.\n\n\n\n\n\n\"The attack was totally successful. It was, I guess, from what I understand, took place during that it wasn't classified information. So this was not less of a now it's classified information. It's probably a little bit different. But I always say you get you have to learn from every experience. I think it was very unfair the way they attacked Michael. He's a good person. The person that was on it just happens to be a sleazebag.\"\n\n\n\n\n\n---\n\n\n\n\n\nIn football, Australia is a step closer to qualification for 2026 World Cup, after a 2-nil win against China.\n\n\n\n\n\nGoals from Jackson Irvine and Nishan Velupillay helped to secure the result.\n\n\n\n\n\nThe win over China has meant Australia, retains the second automatic qualification spot in Group C.\n\n\n\n\n\nSocceroos coach Tony Popovic says attention now turns to the crucial final games remaining in Group C - against Japan and Saudi Arabia in June.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/budget-redirects-foreign-aid-to-pacific-islands-and-southeast-asia-after-trump-aid-cuts/nneoqzs8t",
        "title": "Australia redirects foreign aid to Pacific and Southeast Asia after US cuts",
        "publish_date": "Tue, 25 Mar 2025 20:54:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Australia to shift $119 million in foreign aid to the Pacific.\n\nThree-quarters of Australian aid will be put into the Indo-Pacific.\n\nAustralia is working to fill the gaps left by US aid cuts.\n\nPacific Island nations will get a larger chunk of Australia's foreign aid budget as spending is refocused after the United States slashed its overseas aid agency.\n\n\n\n\n\nForeign Minister Penny Wong asked her department to compile a list of aid programs across the Pacific and Southeast Asia that would be impacted by US President Donald Trump's slashing of foreign aid.\n\n\n\n\n\nAustralia will shift $119 million to prioritise immediate gaps created in essential health services and climate action, including an extra $5 million to maintain HIV programs in Papua New Guinea, Fiji, and the Philippines.\n\n\n\nThree-quarters of Australian aid will be put into the Indo-Pacific, including $1 billion over five years to boost economic resilience, $370 million over three years to address the humanitarian crisis in Myanmar and $355 million over four years to respond to climate disasters.\n\n\n\n\n\nAustralia will spend just under $5.1 billion in development assistance in 2025-26, an increase of $136 million from the previous financial year, according to the new federal budget handed down on Tuesday.\n\n\n\n\n\nThe Trump administration has slashed tens of billions of dollars from the United States Agency for International Development, which has impacted the Indo-Pacific, including a shortage of food for refugees who fled Myanmar.\n\n\n\nForeign Minister Penny Wong had been critical of the former Coalition government for cutting aid, saying it left a vacuum in the Pacific that China was able to exploit and reduced Australia's standing as a partner of choice for island nations. Source: AAP / EPA / Neil Hall The aid shift will come from three multilateral institutions, including reducing a payment to the Global Partnership for Education and deferring funds earmarked for a global fund to fight HIV, malaria, and tuberculosis.\n\n\n\n\n\nPlanned increases in other development programs will also be delayed.\n\n\n\n\n\nTim Costello from advocacy group Safer World for All welcomed the small increase in aid but called for a bigger boost, saying Australia needed to step up in the absence of the US.\n\n\n\n\n\nMillions of people would die as a result of the US aid cuts to pivotal measures like health programs, he said.\n\n\n\n\n\n\"Cutting aid leads to unrest, inequality, it leads to profound conflict,\" he said.\n\n\n\nAustralian Council for International Development interim chief executive Matthew Maury said Australia has sent a clear signal that \"we are not retreating from our region\".\n\n\n\n\n\nBut he said more could be done because \"the need for aid around the world is greater than ever\".\n\n\n\n\n\nAid is now 0.65 per cent of the federal budget, and Maury called on the major parties to provide a pathway to restore it to 1 per cent.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-26-march-2025/65mh3ibil",
        "title": "Budget targets cost of living relief | Morning News Bulletin 26 March 2025",
        "publish_date": "Tue, 25 Mar 2025 19:28:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin:\n\n\n\nThe Federal Budget focuses on cost of living relief, including a tax cut.\n\nThe government will continue its military support for Ukraine.\n\nAnd in football, Socceroos beat China 2-nil in a crucial World Cup qualifying win.\n\n\n\n\n\nTreasurer Jim Chalmers says the federal budget will improve living standards with broad cost of living measures, is the focus of Labor’s pre-election budget.\n\n\n\n\n\nThe biggest line item is a tax cut for every taxpayer, with Labor vowing to reduce the rate of the lowest tax bracket if re-elected.\n\n\n\n\n\nIt builds on already-announced cost of living relief, including a $150 energy bill relief for every household, cheaper medications and funding towards Medicare.\n\n\n\n\n\nThe handouts will put the budget in the red zone for the next decade, with a 27-billion-dollar deficit this financial year alone.\n\n\n\n\n\nDr Chalmers says the budget is focused on the pressures households are under.\n\n\n\n\n\n“So this budget is really a platform for prosperity in a new world of uncertainty. It recognises that cost of living pressures are front of mind for many Australians and that is why it's front and centre in the budget.\"\n\n\n\n—\n\n\n\nAnd the details on that promised tax cut.\n\n\n\n\n\nLabor would reduce the tax rate on earnings between $18,201 and $45,000 from 16 per cent to 15 per cent from July 1 next year, and further decreases to 14 per cent the year after.\n\n\n\n\n\nThe change will mean anyone earning more than $45,000 a year will get $268 more a year initially and then $536 the year after.\n\n\n\n\n\nBefore the changes to stage 3 tax cuts last year, the lowest tax bracket was 19 per cent.\n\n\n\n\n\nDr Chalmers says every Australian taxpayer will get a tax cut next year and the year after to top up the tax cuts that began in July.\n\n\n\n\n\n\"This will take the first tax rate down to its lowest level in half a century. These additional tax cuts are modest but they will make a difference. The average earner will have an extra $536 in their pocket each year when they're fully implemented.\"\n\n\n\n\n\nThe plan is expected to cost the government $17 billion over the next three years.\n\n\n\n—\n\n\n\nThe government is to continue its military support for Ukraine, with $17 million allocated in the Federal Budget over two years for military aid.\n\n\n\n\n\nThe money is to go towards communication systems, artillery components, and firearms to assist in Ukraine’s defence against the Russian invasion.\n\n\n\n\n\nAustralia has committed more than $1.5 billion to Ukraine since the Russian ground invasion in 2022.\n\n\n\n\n\nThe government has already committed to return an Australian Embassy to Kyiv.\n\n\n\n—\n\n\n\nDemocrats are calling on top officials to resign over an incident in which a magazine journalist was accidentally included in a secret group chat containing highly sensitive war plans.\n\n\n\n\n\nDirector of National Intelligence Tulsi Gabbard and C-I-A Director John Ratcliffe – both of whom were in the chat – on Tuesday [[25 March]] testified before a Senate committee that no classified material was shared through the encrypted messaging app.\n\n\n\n\n\nBut Democratic senators have rejected that claim, with the journalist reporting that Defense Secretary Pete Hegseth posted operational details about pending strikes against Yemen's Houthis.\n\n\n\n\n\nThe incident has triggered outrage among national security experts and prompted Democrats – and some of Trump's fellow Republicans – who are calling for an investigation into what appears to be a major security breach.\n\n\n\n\n\nAmong them is Democratic Senator from Virginia, Mark Warner.\n\n\n\n\n\n\"Putting aside for a moment that classified information should never be discussed over an unclassified system, it's also just mind-boggling to me that all these senior folks were on this line and nobody bothered to even check. Security hygiene 101, who are all the names? Who are they? Well, it apparently included a journalist. This was not only sloppy; it not only violated all procedures, but if this information had gotten out, American lives could have been lost.\"\n\n\n\n—\n\n\n\nAustralia has taken another step towards qualifying for the 2026 World Cup with a 2-nil victory over China in Hangzhou.\n\n\n\n\n\nTony Popovic's side made it six points out of six in the current window with victory over China.\n\n\n\n\n\nThis - as first-half goals from Jackson Irvine and Nishan Velupillay gave the Socceroos a lead, following their 5-1 win against Indonesia last week.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/tick-on-social-cohesion-could-do-better-elsewhere-budget-report-card-from-communities/mvib4s2yj",
        "title": "Tick on social cohesion; could do better elsewhere: budget report card from communities",
        "publish_date": "Tue, 25 Mar 2025 12:30:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe government has allocated a further $178 million over five years for what it calls social cohesion measures in its 2025 federal budget.\n\n\n\n\n\nThere's further support for security at both Jewish and Muslim places of worship, and African and Chinese communities will also receive some funding to restore museums and other programs.\n\n\n\n\n\nTen million dollars is to be provided for independent multicultural media outlets, and two million dollars for the Holocaust Institute of Western Australia.\n\n\n\n\n\nThe Federation of Ethnic Communities' Councils of Australia, or FECCA, welcomes the new funding.\n\n\n\n\n\nFECCA's Chair, Peter Doukas, says it's a timely reminder of how diverse our society is, and the need to work with that.\n\n\n\n\n\n\"Well, social cohesion and multiculturalism is central to our way of life in Australia. More than half the people in this country have at least one parent born overseas. And we think that it is becoming a more central part of governing Australia. So, much more investment in multiculturalism and social cohesion is what we would expect, more broadly. But we do welcome this announcement as part of this budget.\"\n\n\n\n\n\nMr Doukas says with the federal election so close, FECCA expects more policy announcements in this broad area soon.\n\n\n\n\n\nThe government is also allocating $3.5 million to embed the Community Refugee Integration and Settlement Program which aims to support refugees arriving in Australia.\n\n\n\n\n\nWith the election looming, FECCA does see some dark clouds on the horizon, though.\n\n\n\n\n\nMr Doukas says there's more room for further investment when it comes to things like reforming the overseas skills and qualifications recognition system.\n\n\n\n\n\nAnd he says he's worried about the politicisation of some aspects of immigration, particularly with the current state of the housing market.\n\n\n\n\n\n\"Well, I am concerned. And we have already made representations to both sides about it. We are hopeful that it doesn't occur. But we will continue to remind the major political players that Australia is the most successful multicultural society in the world. And we all have the stewardship of that in our hands as part of this campaign, and more broadly. So, I am hoping for the best.\"\n\n\n\n\n\nThe budget contains more than half a billion dollars in funding for better outcomes for First Nations people under the National Closing The Gap agreement.\n\n\n\n\n\nThere's boosted funding for First Nations businesses, easing cost of living pressure in remote communities, and improving health outcomes.\n\n\n\n\n\nSNAICC is the biggest national non-governmental body advocating for Indigenous children.\n\n\n\n\n\nChief Executive Catherine Liddle says the funding for early education and care in this budget is especially promising.\n\n\n\n\n\n\"If you are drilling the uglier side of things, you'll see that children who have had access to early education and care, and families who have had access to those services, are far less likely to come into contact with tertiary interventions, which are things like child protection and youth justice systems. And, again, that means, if we are investing at the right time, we are also seeing an improvement in community safety.\"\n\n\n\n\n\nBut Ms Liddle says the government has missed an opportunity by not committing more funding for the Safe and Supported program, designed to help children and families stay together.\n\n\n\n\n\n\"What we know is that one of the most horrific statistics in the Closing The Gap targets is that statistic that relates to the number of Aboriginal and Torres Strait Islander children in out-of-home care. That target is increasing at a rate that can only be called a national disgrace. And what we haven't seen is any commitment into the investment for that plan. Because that is the plan that works alongside communities to develop the programs and the responses that communities need to keep their families strong, to keep their children safe, and to ensure that no one is removed from their families.\"\n\n\n\n\n\nIt's also a crucial budget for Australians with a disability.\n\n\n\n\n\nCatherine McAlpine, from Inclusion Australia, says the best part of this budget is the reform of the Information, Linkages, and Capacity-Building program, which funds projects aimed at building connection between Australians with disability and their communities.\n\n\n\n\n\nShe also welcomes more funding for apprentices with disabilities.\n\n\n\n\n\nShe says the main downside of this budget comes in the decreased funding for the National Disability Insurance Scheme, or the NDIS, as a result of expected slowdown in its growth.\n\n\n\n\n\nMs McAlpine says politicians need to be wary of the downstream effects of reduced NDIS funding.\n\n\n\n\n\n\"I don't think it's that easy for politicians to cut the NDIS when they know how many people rely on it, and the marginalisation of the people who rely on it. I do think that there's a rush to bank the savings without making sure that the supports that people need in the community are in place. So, it feels like there is a really fast move towards: oh yes, we're down to the eight per cent growth... without saying: have people got the right supports in place? If there are people who are not getting on the scheme, are they able to get supports into the community as promised by national cabinet? Or, are we doing this whole process too fast?\"\n\n\n\n\n\nOne area set to benefit many disabled Australians is the nearly one billion dollars in additional money allocated to stop family violence.\n\n\n\n\n\nMs McAlpine welcomes the funding, but says special provision should be made so that disabled Australians are able to access these services.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/short-sighted-historic-on-childcare-wont-help-living-costs-invests-in-healthcare-a-mixed-budget-response/va7oqbefz",
        "title": "Short-sighted, historic on childcare, won't help living costs, invests in healthcare: a mixed Budget response",
        "publish_date": "Tue, 25 Mar 2025 12:20:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"What Labor is offering is an election bribe, as part of a big spending, big taxing, big election budget.\"\n\n\n\n\n\nThe Opposition's Treasury spokesman has slammed the government's economic outlook.\n\n\n\n\n\nAngus Taylor describes the government's $17 billion tax cuts for all Australians over the next three years as a 'cruel hoax for the Australian people'.\n\n\n\n\n\nIt's a sentiment shared by others, with Greens leader Adam Bandt describing the tax cuts - a key budget measure - as a 'tiny tax tweak'.\n\n\n\n\n\n\"An extra 73 cents a day in 15 months' time won't help much when your rent has already gone up by hundreds of dollars while everyday people are being made to wait over a year to get a very small amount of extra tax cuts. Billionaires and big corporations are rolling in it right now.\"\n\n\n\n\n\nOthers have been critical of the government's key budget pledge - particularly its failure to include any increase to JobSeeker payments which has remained at $56 a day.\n\n\n\n\n\nThe Australian Council of Social Service's Cassandra Goldie says people experiencing poverty have pleaded with the government for years to improve social security payments.\n\n\n\n\n\n\"The centrepiece of the budget tonight is a promise of more tax cuts, which will go right up the income scale to help people on the very highest incomes in the country, and at the same time, we have nothing to help people with the very least.\"\n\n\n\n\n\nCriticism of the government's economic measures also extend to its decision to scrap non-compete clauses for most Australian workers.\n\n\n\n\n\nThe measure means more than three million workers - including those in childcare, construction and hairdressing - will no longer be prevented from switching to better, higher-paying jobs.\n\n\n\n\n\nBut some are concerned about the effect of that on Australian businesses, as Australian Industry Group Chief Executive Innes Willox explains.\n\n\n\n\n\n\"Australian businesses, large and small, spend a tremendous amount of resources, hiring, engaging, training, and building up their staff, and to now risk having lost that and losing all the intellectual property that has been built up, is going to be a huge concern for Australian business. And we suspect that if this measure does go ahead, we will see an enormous amount of litigation, legal action, around around this measure.\"\n\n\n\n\n\nBut it isn't all bad news.\n\n\n\n\n\nWhile the budget didn't offer any additions when it comes to childcare reform, advocates in the sector welcome the government's progress towards a universal childcare system, including three days of subsidised early childhood education.\n\n\n\n\n\nGeorgie Dent from The Parenthood described it as an historic investment.\n\n\n\n\n\n\"We know that when children have access to high quality early education and care, they do much better over the course of their lives. We believe that every child should be entitled to this opportunity. The federal government has made a commitment to ultimately building out a universal, high quality, early education and care system that is simple and affordable for families.\"\n\n\n\n\n\nThose in the aged care sector also welcomed the $2.6 billion investment in further pay rises for aged care nurses - but are disappointed by an absence of investments to adapt to the new aged care act.\n\n\n\n\n\nTom Symondson is CEO of Ageing Australia.\n\n\n\n\n\n\"What we unfortunately did not see tonight is an investment in supporting the transition to our new Aged Care Act. We had called for investments in digital readiness, in making sure that our providers are ready to implement the new act on 1 July, and we'd also called for assistance to prepare themselves to take on huge numbers of new older people who are going to need care.\"\n\n\n\n\n\nYoung people also feel as though they are missing out - especially when it comes to less funding for youth allowance and a lack of cost of living relief.\n\n\n\n\n\nAshlyn Horden is the President of the National Union of Students.\n\n\n\n\n\n\"So if the government really wants to see 80 per cent of Australians have a tertiary qualification by 2050 they need to be thinking about the students who are currently having to think about their grumbling stomachs over their studies, the students who are lining up in what are essentially 21st century bread lines for food banks because they can't afford to feed themselves.\"\n\n\n\n\n\nOne thing that came as little surprise was the government's ongoing commitment to health investment, with $8.9 billion towards Medicare a key feature of the budget.\n\n\n\n\n\nDr Ramya Raman is Vice President of the Royal Australian College of General Practitioners.\n\n\n\n\n\nShe says while she welcomes the measures for training GPS and further investment in women's health, there are questions around the government's expectation for 90 per cent of appointments to be bulk-billed.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/special-bulletin-budget-2025/wh2p337l9",
        "title": "Special Bulletin: Budget 2025",
        "publish_date": "Tue, 25 Mar 2025 12:14:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Treasurer says his focus is on easing cost of living pressures\n\nAnother tax cut on the way if Labor is re-elected to government\n\nThe plan to help multicultural communities combat misinformation.\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nTreasurer Jim Chalmers says his plan will improve living standards with broad cost of living measures, is the focus of Labor’s pre-election budget.\n\n\n\n\n\nThe biggest line item is a tax cut for every taxpayer, with Labor vowing to reduce the rate of the lowest tax bracket if re-elected.\n\n\n\n\n\nIt builds on already-announced cost of living relief, including a $150 energy bill relief for every household, cheaper medications and funding towards Medicare.\n\n\n\n\n\nThe handouts will put the budget in the red zone for the next decade, with a 27-billion-dollar deficit this financial year alone.\n\n\n\n\n\nDr Chalmers says the budget is focused on the pressures households are under.\n\n\n\n\n\n“So, this budget is really a platform for prosperity in a new world of uncertainty. It recognises that cost of living pressures of front of mind for many Australians and that is why it's front and centre in the budget.”\n\n\n\n---\n\n\n\n\n\nAustralians are to get another tax cut if Labor is re-elected.\n\n\n\n\n\nLabor will reduce the tax rate on earnings between $18,201 and $45,000 from 16 per cent to 15 per cent from July 1 this year, and further decreases to 14 per cent the year after.\n\n\n\n\n\nThe change will mean anyone earning more than $45,000 a year will get $268 more a year initially and then $536 the year after.\n\n\n\n\n\nBefore the changes to stage 3 tax cuts last year, the lowest tax bracket was 19 per cent.\n\n\n\n\n\nIt's expected to cost the government $17 billion over the next three years.\n\n\n\n---\n\n\n\n\n\nLabor says it is committed to making healthcare cheaper in Australia.\n\n\n\n\n\nThe Federal Government has already committed a $7.9 billion investment to make 9 out of 10 G-P visits bulk billed by 2030.\n\n\n\n\n\nIt has also promised to reduce the cost of medications on the Pharmaceutical Benefits Scheme [[PBS]].\n\n\n\n\n\nIt will also invest in the primary health care workforce, with $10.5 million to expand the Primary Care Nursing and Midwifery Scholarship program by 400 places.\n\n\n\n---\n\n\n\n\n\nMore people will be eligible to access Labor’s Help to Buy scheme, with plans to increase the income and property price caps after the election.\n\n\n\n\n\nThe program will still be limited to 40,000 first home buyers, however the income caps will be raised from $90,000 to $100,000 for singles and from $120,000 to $160,000 for couples.\n\n\n\n\n\nThe scheme allows eligible buyers to access a shared equity loan of up to 40 per cent of their first home.\n\n\n\n\n\nThe extended eligibility will cost an additional $800 million dollars.\n\n\n\n---\n\n\n\n\n\nThe government intends to provide $2 billion to recapitalise the Clean Energy Finance Corporation to invest in renewable energy, energy efficiency and low emissions technologies.\n\n\n\n\n\nThere is also a $2 billion investment over 19 years in Australia's metals industry to provide grants to support a switch to renewable electricity before 2036.\n\n\n\n---\n\n\n\n\n\nThe government is to continue its military support for Ukraine, with $17 million allocated in the Federal Budget over two years for military aid.\n\n\n\n\n\nThe money is to go towards communication systems, artillery components, and firearms to assist in Ukraine’s defence against the Russian invasion.\n\n\n\n\n\nAustralia has committed more than $1.5 billion to Ukraine since the Russian ground invasion in 2022.\n\n\n\n\n\nThe government has already committed to return an Australian Embassy to Kyiv.\n\n\n\n---\n\n\n\n\n\nThe Albanese government has pledged to boost its spending on social cohesion.\n\n\n\n\n\nIt’s set to spend $178 million over the next five years on measures including support for Australia’s Jewish and other multicultural communities.\n\n\n\n\n\nLast year, the government announced a range of funding for those affected by the Hamas-Israel war, including improving security for Jewish communities and grants for Arab and Muslim bodies, as well as media companies to combat misinformation.\n\n\n\n\n\nThe budget contains new funding for security at Jewish and Muslim places of worship, as well as multicultural programs including $15 million for a new sports hub and $10 million for independent multicultural media outlets, and $2 million for the Holocaust Institute of Western Australia.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cost-of-living-relief-the-focus-of-federal-budget/2i48ti0mm",
        "title": "Cost of living relief the focus of Federal Budget",
        "publish_date": "Tue, 25 Mar 2025 11:20:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nJim Chalmers’ final first term budget - not a big one, but still some goodies.\n\n\n\n\n\n\"Every Australian taxpayer will get a tax cut next year and the year after, to top up the tax cuts which began in July. This will take the first tax rate down to its lowest level in more than half a century.\"\n\n\n\n\n\nLabor will reduce the tax rate on earnings between $18,201 and $45,000 from 16 per cent to 15 per cent this year, then to 14 per cent the year after.\n\n\n\n\n\nIt means anyone earning more than $45,000 a year will take home an extra $268 annually from July 1st, and $536 more each year after.\n\n\n\n\n\nIt builds on previously-announced cost of living measures, including:\n\n\n\n\n\nExtended energy bill relief for every household.\n\n\n\n\n\nAn $8.5 billion boost to bulk billing.\n\n\n\n\n\nAnd slashing the cost of medications on the Pharmaceutical Benefits Scheme [[P-B-S]].\n\n\n\n\n\n\"We’ve come a long way together, but there is more work to do. This Budget is our plan for a new generation of prosperity in a new world of uncertainty. It’s a plan to help finish the fight against inflation, rebuild living standards, and maximise our national advantages into the future.\"\n\n\n\n\n\nAnd a pitch to improve productivity - banning non-compete clauses that prevent employees from moving between competing businesses - a move that would apply to most workers.\n\n\n\n\n\n\"These are holding too many Australian workers back from going to better paid opportunities or setting up small businesses. They make no sense. They have millions of Australians tied up in this unnecessary red tape preventing them from earning more.\"\n\n\n\n\n\nThe economy is starting to settle.\n\n\n\n\n\nInflation is expected to fall to 2.5 per cent this year, with wages expected to grow by 3 per cent.\n\n\n\n\n\nBut spending will keep the budget in the red zone for the next decade, with a 27 billion-dollar deficit this financial year.\n\n\n\n\n\nDr Chalmers says it's not that bad.\n\n\n\n\n\n\"Our deficit this year has almost halved since we came to office. Next year’s deficit is $42 billion, lower than what was forecast at the last election, and lower than at the mid-year update. Gross debt will hit $940 billion this financial year, $177 billion less than what we inherited.\"\n\n\n\n\n\nThe Treasurer says it’s an uncertain economic time.\n\n\n\n\n\n\"We've got a war in Eastern Europe. We've got a collapsing cease fire in the Middle East. And so all of this is creating the sorts of global economic conditions which make it even more remarkable what the Australian people are achieving in our own economy here at home. Now this global economic uncertainty is not as episodic as we may have become accustomed to in earlier generations. Just in the 2020s we've already had the global pandemic, the global inflation spike which followed it, and now the threat of a global trade war.\"\n\n\n\n\n\nBut despite big talk, not much to Trump-proof the budget.\n\n\n\n\n\nJust $20 million to promote Australian made products.\n\n\n\n\n\nAnd no new money for aid, despite the cuts from the US.\n\n\n\n\n\nInstead, moving $120 million global aid programs to the Indo-Pacific region next year.\n\n\n\n\n\nJim Chalmers says the government is doing what it can.\n\n\n\n\n\n\"Well we're already stepping up, I guess is the point that I'm making, but we need to do that within the context of our other budget constraints and our other priorities.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/2032-brisbane-olympic-and-paralympic-games-venue-plan-unveiled-followed-by-heritage-concerns/xajz60zwo",
        "title": "2032 Brisbane Olympic and Paralympic Games venue plan unveiled followed by heritage concerns",
        "publish_date": "Tue, 25 Mar 2025 09:30:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "2032 Brisbane Olympic and Paralympic Games venue plan unveiled followed by heritage concerns\n\nPublished 25 March 2025, 7:30 am\n\nThe Queensland government has released its long-awaited 2032 Brisbane Olympic and Paralympic Games venue blue print following a 100-day infrastructure review. Under the plan, the city will have a $3.4 billion, 60-thousand seat stadium along with several other venues to be built in inner Brisbane's heritage-listed Victoria Park.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/lower-house-passes-tasmanian-salmon-farming-bill-amid-environmental-protests/pexnobnjg",
        "title": "Lower house passes Tasmanian salmon farming bill amid environmental protests",
        "publish_date": "Tue, 25 Mar 2025 09:23:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Lower house passes Tasmanian salmon farming bill amid environmental protests\n\nPublished 25 March 2025, 7:30 am\n\nA bill to assure the continuation of salmon farming on Tasmania's West Coast has passed the lower house of parliament with the support of the coalition. Tasmanian-based opponents of the industry in Canberra today to make a final pitch to politicians not to pass the changes to federal environment laws.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-the-2025-federal-budget-looks-like-if-it-were-100/y7whpxtoy",
        "title": "Here's what the 2025 federal budget would look like if it were $100",
        "publish_date": "Tue, 25 Mar 2025 08:59:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government has laid out $785.7 billion of spending in Tuesday's budget for the 2025-26 financial year, covering everything from tax cuts to cheaper healthcare.\n\n\n\n\n\nTreasurer Jim Chalmers on Tuesday unveiled a projected deficit of $42 billion for the next financial year, lower than was projected in the mid-year financial update — but the budget papers reveal more detail about where the money is coming from, and where it's going.\n\n\n\nIf the money the government planned to spend next financial year were $100, here's how it would break down.\n\n\n\nWhere the budget money is spent\n\nSource: SBS News If the budget were $100, social security and welfare would receive $37 — the largest chunk of government spending.\n\n\n\n\n\nSome $15.90 would be spent on health, $6.90 on education, and $6.60 on defence.\n\n\n\n\n\nGeneral public services would get $4, while $10.60 would go towards all other services, such as housing, transport, and energy.\n\n\n\n\n\nThe remaining $19.10 would be spent on other purposes.\n\n\n\nWhere the money comes from\n\nSource: SBS News If the money flowing into Treasury next financial year were $100, the majority would come directly from the pockets of taxpayers.\n\n\n\n\n\nAn estimated $47.56 would come from in from individual and other withholding taxes, while company taxes would account for just over $19.\n\n\n\n\n\nThe revenue from Goods and Services Tax would be $12.81, and $3.71 from petrol, diesel and other fuel.\n\n\n\n\n\nDuties on tobacco, and beer and spirits, account for less than $1 each, while just 57 cents is expected to come from visa application fees.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/winners-and-losers-of-the-2025-federal-budget/mb98yrzfm",
        "title": "Revealed: The winners and losers of the 2025 federal budget",
        "publish_date": "Tue, 25 Mar 2025 08:45:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Further tax cuts and power bill relief are on their way – if the Albanese government is returned to office in May.\n\n\n\n\n\nTreasurer Jim Chalmers has centred household budget relief in his fourth budget, mere weeks from voters heading to the polls.\n\n\n\n\n\nThe budget documents detail $785.7 billion of spending for 2025-26 financial year, delivering a projected deficit of $42 billion.\n\n\n\n\n\n\n\nHere are the key winners and losers.\n\n\n\nWINNERS\n\nTaxpayers\n\n\n\n\n\nAustralians will benefit from two additional tax cuts if Labor is re-elected.\n\n\n\n\n\nThe rate of tax paid on earnings between $18,201 and $45,000 will be reduced from 16 per cent to 15 per cent from 1 July 2026.\n\n\n\n\n\nThe following July, the rate will be cut further to 14 per cent.\n\n\n\n\n\nIt means anyone earning more than $45,000 will save $268 initially and $536 the following year.\n\n\n\n\n\nThe key pre-election promise will cost the government $17.1 billion.\n\n\n\n\n\n\n\nFirst home buyers\n\n\n\n\n\nMore first home buyers will have access to the government's Help to Buy scheme through an increase to both income and property price caps — costing the budget $800 million.\n\n\n\n\n\nThe scheme allows 40,000 eligible buyers to access up to a 40 per cent contribution towards their new home, with a deposit as small as 2 per cent.\n\n\n\n\n\nThe income cap will change from $90,000 to $100,000 for individuals and from $120,000 to $160,000 for couples or single parents.\n\n\n\nFirst-home buyers will get more support under the 2025 federal budget. Source: SBS News\n\n\n\nWomen's health\n\n\n\n\n\nWomen experiencing endometriosis, pelvic pain, perimenopause, and menopause will be able access support at one of 33 specialist clinics funded as part of an additional $240 million directed towards women's health.\n\n\n\n\n\nThe budget boost follows the $573 million already committed to women's health, with Labor adding several medications to the Pharmaceuticals Benefits Scheme.\n\n\n\n\n\nComing into effect on 1 May, the cheaper medicines include several oral contraceptive pills, endometriosis medication Ryeqo, and IVF medication Pergoveris.\n\n\n\n\n\nHouseholds\n\n\n\n\n\nLabor announced on Sunday that all Australian households and businesses will receive an extra $150 in energy bill relief if the government is re-elected.\n\n\n\n\n\nThe plan will see the rebates, paid in two $75 instalments over six months, extended until the end of 2025.\n\n\n\n\n\nThe federal funding follows last year's $3.5 billion power bill sweetener which offered $300 per household. The extension adds $1.8 billion to the budget over the forward estimates.\n\n\n\n\n\n\n\nLow and middle-income workers\n\n\n\n\n\nA ban on non-compete clauses will allow workers to move to a competing employer or start a competing business — for those earning under the $175,000 threshold.\n\n\n\n\n\nThe government said more than three million workers, including those in childcare, construction, and hairdressing are covered by such clauses.\n\n\n\n\n\nResearch suggests the changes could improve productivity and lift wages by up to 4 per cent.\n\n\n\n\n\nBeer drinkers\n\n\n\n\n\nIn a win for beer drinkers, the Albanese government has committed to freezing the draught beer excise for two years from August 2025.\n\n\n\n\n\nTuesday's budget has revealed the measure will cost the government $165 million over five years.\n\n\n\n\n\nIt means that two years from now, a pint will be around five cents less than otherwise expected.\n\n\n\nBeer drinkers are a winner in the 2025 federal budget. Source: Getty / Bec Hannaford\n\n\n\nRefugees\n\n\n\n\n\nThe government hopes to boost refugee employment figures with a $7.7 million extension to its Economic Pathways to Refugee Integration program.\n\n\n\n\n\nIt has also accounted $3.5 million over three years for refugee resettlement.\n\n\n\n\n\nMulticulturalism\n\n\n\n\n\nTo increase social cohesion, the government is committing $178 million towards measures including the restoration of Synagogues, community centre improvements and security upgrades.\n\n\n\n\n\nSome $300,000 has also been set aside to create a national database for hate crimes and incidents.\n\n\n\nLOSERS\n\nTax dodgers\n\n\n\n\n\nThe government will crack down on Australians fudging their tax returns, committing $999 million to the Australian Taxation Office on measures including the tax avoidance taskforce in a bid to strengthen tax compliance.\n\n\n\n\n\nThe investment will bring in an additional $1.8 billion in tax revenue over five years.\n\n\n\n\n\n\n\nRussia and Belarus\n\n\n\n\n\nThe government will extend its 35 per cent tariffs on goods from Russia and Belarus.\n\n\n\n\n\nThe tariff was introduced in April 2022 after Russia's invasion of Ukraine and will be extended until 24 October 2027.\n\n\n\n\n\nTobacco criminals\n\n\n\n\n\nThe government has directed $156.7 million towards disrupting the illicit tobacco trade which is partially affecting its revenue.\n\n\n\n\n\nRevenue from tobacco has taken a big hit in this budget, down $6.9 billion over the five years from 2024-2025 to 2028-2029.\n\n\n\n\n\nWelfare recipients\n\n\n\n\n\nThe government did not heed calls from social service groups for increases to Jobseeker and other welfare payments — with no new announcements made in this budget.\n\n\n\n\n\nBudget bottom line\n\n\n\n\n\nThe government's tax cut promise adds $17 billion to at least $40 billion in pre-election commitments.\n\n\n\n\n\nThere are several revenue losses including $6.9 billion from tobacco and $1.9 billion in company tax receipts over the five years from 2024-25 to 2028-29 – excluding new policy decisions.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/treasurer-jim-chalmers-hands-down-the-2025-federal-budget/3gyozzekg",
        "title": "Treasurer warns of 'storm clouds' as he unveils budget with tax cuts and $42bn deficit",
        "publish_date": "Tue, 25 Mar 2025 08:37:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "All Australian taxpayers will receive an extra tax cut of up to $268 next year — as well as the year after — if Labor is re-elected in May, in a move that the Coalition says it will not match if it wins government.\n\n\n\n\n\nHanding down the 2025-26 budget on Tuesday, Treasurer Jim Chalmers announced there would be a $42 billion budget deficit next financial year.\n\n\n\n\n\nCiting global trade disruptions, the economic cost of major weather events in Queensland, and the wars in Ukraine and the Middle East, he said \"storm clouds\" were gathering in the global economy.\n\n\n\n\n\n\"Australia is neither uniquely impacted nor immune from these pressures,\" he said.\n\n\n\n\n\n\"This budget is our plan for a new generation of prosperity in a new world of uncertainty.\"\n\n\n\nTax cuts for most workers\n\nFrom 1 July 2026, the 16 per cent tax rate for earnings between $18,201 and $45,000 will be cut to 15 per cent. A year later, that rate will drop again to 14 per cent.\n\n\n\n\n\nFor workers who earn above $45,000, this will mean a further tax cut of $268 in 2026-27 and $536 from 2027-28.\n\n\n\n\n\n\"Whether you're a truckie, a teacher or a tradie, whether you're in manufacturing, mining or the care economy, you will earn more and keep more of what you earn,\" Chalmers said in a joint statement with Prime Minister Anthony Albanese.\n\n\n\nTax cuts for all workers have been announced in the 2025 federal budget. Source: SBS News The treasurer said the tax cuts would provide cost of living relief and address bracket creep, and while they were \"modest\", the measure would \"make a difference\".\n\n\n\n\n\n\"This will take the first tax rate down to its lowest level in more than half a century,” he said.\n\n\n\n\n\nThe additional tax cuts are projected to cost $17.1 billion over forward estimates.\n\n\n\nREAD MORE Revealed: The winners and losers of the 2025 federal budget\n\nThe Coalition said it would not support the tax cuts, calling the measure a \"cruel hoax\".\n\n\n\n\n\n\"Seventy cents a day, in a year's time, is not going to help address the financial stress Australian families are currently under,\" the Opposition's treasury spokesperson Angus Taylor said.\n\n\n\n\n\n\"It will do nothing to restore your household budget now, at a time when the typical Australian household with a mortgage is $50,000 worse off.\"\n\n\n\n\n\nGreens leader Adam Bandt said the \"tiny tax tweak budget\" was a \"missed opportunity to deliver real cost of living relief\".\n\n\n\nMore money for health, disability, and aged care\n\nTuesday's budget included pre-announced measures such as the $150 energy bill relief, a $793 million women's health package, $8.5 billion to lift bulk billing rates, and cheaper medicines.\n\n\n\n\n\nCost of living measures also included an increase to the Medicare levy low‑income threshold to ensure some singles, families, and seniors and pensioners will be exempt from paying the levy.\n\n\n\n\n\nFor singles the new threshold will go from $26,000 to $27,222, for families it will go from $43,846 to $45,907.\n\n\n\n\n\nThere's also $423.8 million to support Australians with disability, and more funding for aged care reform.\n\n\n\n\n\nNo more non-complete clauses\n\nNon-compete clauses, which can stop Australians from switching to better, higher-paying jobs, will also be abolished for most workers.\n\n\n\n\n\nThe government said more than three million workers, including those in childcare, construction, and hairdressing are covered by such clauses.\n\n\n\n\n\n\"People shouldn't need to hire a lawyer to take the next step in their career,\" Chalmers said. \"Or permission from their old boss if they want to be their own boss, and turn an idea into a small business.”\n\n\n\n\n\nThe government will also change laws to amend 'no-poach' agreements that block staff from being hired by competitors.\n\n\n\nMore money for social cohesion\n\nThe Albanese government is set to spend $178.4 million over the next five years on social cohesion measures , including support for Australia's Jewish and other multicultural communities.\n\n\n\n\n\nLast year the government announced a range of funding for those impacted by the Hamas-Israel war, including improving security for Jewish communities and grants for Arab and Muslim bodies, as well as for media companies to combat misinformation.\n\n\n\n\n\nUnveiled in Tuesday's budget is new funding for security at Jewish and Muslim places of worship, as well as multicultural programs including $15 million for a new sports hub and $10 million for independent multicultural media outlets, and $2 million for the Holocaust Institute of Western Australia.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/delete-your-data-genetic-testing-firm-23andme-files-for-bankruptcy/8pzekw3io",
        "title": "'Delete your data': Genetic testing firm 23andMe files for bankruptcy",
        "publish_date": "Tue, 25 Mar 2025 07:18:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Pioneering US genetic testing company 23andMe has filed for bankruptcy and is looking for a buyer two years after hackers gained access to millions of profiles.\n\n\n\n\n\n23andMe, which sells a mail-back saliva test to determine ancestry or certain health-related genetic traits for less than $200, said it had \"filed a voluntary petition for reorganization\" with a state bankruptcy court in Missouri.\n\n\n\n\n\nThe announcement prompted warnings for 23andMe customers to ask the company to delete their data amid privacy fears.\n\n\n\n\n\nAt its height a few years ago, the DNA testing craze saw millions of consumers rushing to discover their ancestry and health information with tests from 23andMe becoming popular holiday gifts.\n\n\n\n\n\nThe Silicon Valley-based company, which went public in 2021, claims 15 million customers but its sales declined in recent months as the testing craze faded and the company suffered a data breach.\n\n\n\n23andMe said it rejected a takeover offer from its co-founder and CEO Anne Wojcicki, who has resigned from her position but will remain on the company's board of directors, according to the statement.\n\n\n\n\n\nOn X, Wojcicki posted: \"While I am disappointed that we have come to this conclusion and my bid was rejected, I am supportive of the company and I intend to be a bidder.\"\n\n\n\n\n\nShe explained that her resignation as CEO was strategic so as to \"be in the best position to pursue the company as an independent bidder.\"\n\n\n\n\n\nWojcicki, who co-founded 23andMe 19 years ago, acknowledged the company's challenges but emphasized her \"unwavering\" belief in its future.\n\n\n\n\n\nThe company announced the dismissal of 40 per cent of its staff in November, about 200 people. It also suspended its research programs.\n\n\n\n23andMe CEO Anne Wojcicki said she intends to be a bid on the company independently. Source: AAP / Jeff Chiu/AP In a regulatory filing, 23andMe also said that it has agreed to pay approximately US$37.5 million ($59.6 million) to settle claims related to the 2023 data breach.\n\n\n\n\n\nThe 2023 hacking incident affected 6.9 million accounts, with 5.5 million containing information on genetic matches.\n\n\n\n\n\nUsing customers' old passwords, the hackers compromised data that included names, sex, birth year, location, photos, health information, and genetic ancestry results.\n\n\n\n'Time to delete'\n\nWith the bankruptcy announcement, California's attorney general Rob Bonta advised customers who have submitted their DNA to delete their genetic information from the website.\n\n\n\n\n\n\"Given 23andMe's reported financial distress, I remind Californians to consider invoking their rights and directing 23andMe to delete their data and destroy any samples of genetic material held by the company,\" Bonta said in a statement.\n\n\n\nREAD MORE How much data do Australians give away and how much are we at risk?\n\nThere are few data privacy safeguards in the United States at a national level, but California has its own laws regulating the handling of user data.\n\n\n\n\n\nGeoffrey Fowler, a tech columnist for the Washington Post warned: \"If you're one of the 15 million people who shared your DNA with 23andMe, it's time to delete your data.\"\n\n\n\n\n\nHe cited the risk \"that your data could get sold or transferred to a new company, which might want to use it for new purposes\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/lululemon-brand-ambassador-finance-advisers-13-content-creators-get-advance-budget-reading-20250325-p5lmdc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Can I get a signature?’ How influencers covered the budget and will join the campaign trail",
        "publish_date": "Wed, 26 Mar 2025 12:51:49 +1100",
        "category": "finance",
        "authors": [
            "Olivia Ireland"
        ],
        "text": "Money, Money, Money podcaster Glen James finished interviewing Finance Minister Katy Gallagher on Tuesday with an unusual question. “It’s a big one,” James said. “Can I get a signature?” he said.\n\n“Will you get Jim [Chalmers’] too?” Gallagher asked as she signed James’ copy of the 2025 federal budget in front of a room full of chuckling influencers who Labor had invited for the first time to get a preview of the document as the party seeks to win younger voters.\n\nA sportswear brand ambassador and charity founder, Instagram finance advisers and left-wing feminist influencers were part of the group who came to Canberra for the budget as part of a Labor strategy to court prominent online voices reported by this masthead earlier this month.\n\nSome of the influencers, including podcaster Hannah Ferguson from Cheek Media, posted videos championing their approach to coverage, saying it engaged young people, and trading off the appearance of a conflict with mainstream media.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/nick-reece-s-big-spend-agenda-in-doubt-as-melbourne-s-debt-reaches-historic-levels-20250307-p5lhqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nick Reece’s big-spend agenda in doubt as Melbourne’s debt reaches historic levels",
        "publish_date": "Wed, 26 Mar 2025 12:44:22 +1100",
        "category": "finance",
        "authors": [
            "Rachael Dexter"
        ],
        "text": "More of Lord Mayor Nick Reece’s election promises are under a cloud – including a rates freeze – as hostile councillors threaten to undermine his big-spend agenda, citing climbing debt.\n\nLast week, the City of Melbourne voted in a substantially watered-down version of Reece’s pledge to make public pools cheaper amid concerns of project delays and rising costs.\n\nMelbourne council’s debt is forecast to reach an unprecedented $216 million by the end of June and councillors are concerned the lord mayor is overspending. Credit: Justin McManus\n\nCapital works expenditure and debt have come in under budget for the last five years, due to major construction delays. But a number of councillors are getting anxious over forecast debt, which is set to reach an unprecedented $216 million by the end of June this year and peak at $275 million next June before trending down.\n\nReece has already abandoned an unpopular pledge to sell the council’s half of the Regent Theatre for $50 million.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-floods-forecast-for-queensland-as-rain-returns-to-south-east-20250325-p5lmat.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: New Olympic stadium will be named after the city; Floods forecast for Queensland as rain returns to south-east",
        "publish_date": "Wed, 26 Mar 2025 12:41:06 +1100",
        "category": "sports",
        "authors": [],
        "text": "The Gabba’s days are numbered. That’s not entirely new.\n\nBut this morning Premier David Crisafulli has revealed his vision for the historic, albeit doomed, oval.\n\nABC Radio host Steve Austin asked the premier: “What happens to the Gabba itself after the Olympics have finished?”\n\nCrisafulli replied: “It gets knocked down.”\n\nIn 2018, the Stadium Taskforce Report found the Gabba was a ‘tired’ venue that would come to the end of its useful life by 2030. Credit: Adobe Stock\n\nBut the premier said he hopes the Gabba will be farewelled by a gold-medal-winning Australian Olympic cricket team, before it is razed.\n\n“Now cricket’s been confirmed for LA, [it] hasn’t been confirmed yet for us, but we’re pretty confident it will be,” he said.\n\n“I would love the Gabba’s swan song to be Australia winning a gold medal there.”\n\nCrisafulli said he expected the Gabba would be bulldozed to make way for an urban renewal site with “quality” commercial and residential development that would compliment a new indoor arena to be built on the neighbouring, old GoPrint site and the new Cross River Rail station.\n\n“Because with Cross River rail, without the Gabba, you’ve got a really important piece of infrastructure that otherwise won’t get the use it needs,” he said.\n\nThe future of East Brisbane State School, which sits beside the stadium, is not clear in the event the Gabba is torn down.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/influencers-descend-on-canberra-as-part-of-a-labor-plan-to-spruik-the-budget-to-young-people-20250326-p5lmob.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Influencers descend on Canberra as part of a Labor plan to spruik the budget to young people.",
        "publish_date": "Wed, 26 Mar 2025 12:35:59 +1100",
        "category": "finance",
        "authors": [],
        "text": "Influencers descend on Canberra as part of a Labor plan to spruik the budget to young people.\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/gwyneth-paltrow-responds-to-rumoured-feud-with-meghan-markle-20250326-p5lmo7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gwyneth Paltrow responds to rumoured feud with Meghan Markle",
        "publish_date": "Wed, 26 Mar 2025 12:27:42 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Gwyneth Paltrow responds to rumoured feud with Meghan Markle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/comedy/how-famously-conflict-averse-luke-mcgregor-handles-curly-questions-20250320-p5ll48.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How famously conflict-averse Luke McGregor handles curly questions",
        "publish_date": "Wed, 26 Mar 2025 12:21:38 +1100",
        "category": "finance",
        "authors": [
            "Cassidy Knowlton"
        ],
        "text": "He generally has a rule that I think is eminently sensible – if there is a peanut butter dessert on a menu, you should order it – but since he’s going to be on stage in a few hours, we wistfully forgo dessert on this occasion. Although he performed at the Gala in 2023, McGregor hasn’t done a full-length show in eight years. In 2017, he was single, living in Melbourne and riddled with anxiety. For his new show, he’s married, living in Newcastle, and well, still anxious but better at covering it. Wagyu steak with fries and Parisian butter at Lucia Credit: Penny Stephens “It’s pretty much about everything that’s happened in the last eight years, but I used to do a show where I’d talk about how I’m anxious and nervous, and now I’m still that, but I’ve also got children, right? And so children are like, ‘how do you solve this issue?’ And I’m like, ‘I don’t know. I haven’t figured out myself yet’. So you have to fake it or make something up.” You might think someone with McGregor’s disposition might have chosen a career further from the spotlight, like an economist or something. He thought that, too, getting a degree in economics and planning a life as a policy wonk, until a drink too many at a comedy gig changed his life.\n\nThe lobster “taco” at Lucia. Credit: Penny Stephens “One of my friends was doing comedy, one of my housemates, and I went to the gig to watch him, and someone didn’t show up. I was a bit tipsy, so I got up as well. I loved it and just never stopped doing it,” he says. He had prepared nothing, so he was addressing a room full of strangers entirely off the cuff. Did it go well? He shakes his head, very sure on this point. “No.” “For the first minute and a half, I was just saying things like, you guys might want to put in your drinks because you are going to spill them all over yourself, I’m very funny, and the crowd went with it. Then I had no jokes and I bombed. But the little bit that went well was enough to get me hooked.” It took a long time to make it his full-time career, but he knew right then that this was what he wanted to do with his life. “In that moment, that was the first time where I felt like coming home or something. It felt like, ‘oh, this is me. This feels like unfiltered. This feels like 100 per cent me’.” The early years were hard, playing to tiny rooms and doing his own flyering. “I used to do a double act with a friend from Tassie, and we’d have, like, two people there. And then when I did Edinburgh, I had, like, four people, seven people, in an 80-seater venue,” he says. But those two, four or seven people liked what they saw. He won the coveted Best Newcomer Award for his first full-length show at MICF in 2013, and he started playing to bigger rooms. “I was moving to bigger venues, quicker than I was ready. At first, I was worried no one would show up, and then I was worried people would show up.”\n\nHe landed the role of Hugh on the first two seasons of Utopia, where he became close with Pacquola. Their show Rosehaven turned out to be a hit for the ABC and ran for five seasons, by which time “we had run out of real estate storylines”, McGregor says. “We always had enough ideas for one-and-a-half seasons, and by the time we got to the fifth, we were on the cusp of running out of ideas. And then we just didn’t have enough for a sixth. It would have been a strain and would have been the first time we went into writing without having a full idea in our heads.” That’s not to say McGregor’s collaboration with Pacquola is finished, with the pair working on a new project he’s cagey about telling me too much about. “We want to write something where more things can happen,” he says, somewhat mysteriously. “Rosehaven was very small stakes... I reckon we’ll work together on stuff forever, we’re always doing something. And plus, we’re besties, we’re hanging out anyway.” Luke McGregor on stage at the 2017 Melbourne International Comedy Festival Gala. Credit: Jim Lee He nominates Pacquola, of course, as one of his favourite comedians, alongside Ronny Chieng, Aaron Chen, Sam Campbell, Nazeem Hussain and Anne Edmonds. I had read an interview with McGregor a decade ago where he revealed his comedic hero was American Dave Chappelle, so I ask him: how does famously conflict-averse McGregor now feel about Chappelle, who came under fire for jokes about transgender people in his 2021 Netflix special The Closer, then doubled down in his 2023 special The Dreamer? McGregor’s wife is non-binary and uses they/them pronouns. It has been an extremely pleasant interview thus far, but it is clear McGregor does not like this question. He pauses to consider his answer. “I don’t gel as much with his new stuff, he says, slowly. “I haven’t kept up with him. So I don’t know. I know there was controversy around his last special, but I haven’t kept up to date.”\n\nI press the matter. Are there jokes or topics or subjects comics just shouldn’t touch? “I’m a straight, white man, so I have all the privilege, and I don’t like commenting on people who aren’t other straight, white men. I just don’t feel like it’s my place to say,” he says. But he goes on: “I think trans rights are really important. I think we have got to protect those, and I don’t like what’s happening in America right now. I think if comedy doesn’t elevate groups that need help or that are getting persecuted in some way, then what are we doing?” He says while he loves watching comedians like Jon Stewart and John Oliver overseas, and Tom Ballard here, that kind of comedy is not his chosen medium for standup. But he then quotes American YouTuber Philip DeFranco: “You may not F-word with politics, but politics F-words with you” (this is an exact transcript, McGregor is no foul-mouthed comedian). “We’ve all got skin in the game,” he says. Celia Pacquola and Luke McGregor write and star in Rosehaven. Credit: ABC For McGregor, that skin in the game has to result in a shared empathy and compassion. “I think part of our job as good citizens is that we have to think about issues that don’t affect us, like aged care, like trans rights, like childcare. You might not be affected by it, but without people thinking about it outside of their own experience, those issues don’t get fixed.” In full flow, he explains the duty a government has to its citizens, and that we have to each other. And even though we are talking politics, which can be tricky ground for a comedian or public figure of any kind, he does not seem nervous at all.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/beveridge-morris-come-face-to-face-after-infamous-2022-bust-up-20250326-p5lmmc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beveridge, Morris come face to face after infamous 2022 bust-up",
        "publish_date": "Wed, 26 Mar 2025 12:20:09 +1100",
        "category": "sports",
        "authors": [
            "Angus Delaney"
        ],
        "text": "Western Bulldogs coach Luke Beveridge has come face to face with football reporter Tom Morris for the first time since their infamous clash in 2022 – and appeared on Channel Nine for the first time since “antagonists” left for rival network Seven.\n\nOn Tuesday night, Beveridge joined Footy Classified on Nine (owner of this masthead), on which Morris is a panellist. He was asked about his clash with Morris but declined to go into detail.\n\nWestern Bulldogs coach Luke Beveridge. Credit: Getty Images\n\n“It’s the first time I’ve been on Channel Nine, probably since some antagonists have moved over to Channel Seven, to be honest. And so I’ve come here tonight to definitely interact and hopefully provide something of value. But the detail in what happened … I just don’t think we should go there,” Beveridge said.\n\nBeveridge did not specify which “antagonists” he was referring to, but former Footy Classified, Sunday Footy Show panellist and Age columnist Kane Cornes, who had been highly critical of the Bulldogs coach in 2024, recently left Nine to join Channel Seven.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-coalition-to-oppose-labor-s-17-billion-in-tax-cuts-as-angus-taylor-slams-chalmers-cash-splash-20250325-p5lmie.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Chalmers’ $17 billion tax cuts clear first hurdle as Dutton flags ‘significant announcement’ in budget reply speech",
        "publish_date": "Wed, 26 Mar 2025 12:09:33 +1100",
        "category": "finance",
        "authors": [
            "Cassandra Morgan"
        ],
        "text": "Shadow Treasurer Angus Taylor says the Coalition is yet to understand the details of a Labor proposal to ban non-compete agreements, which prevent staff defecting to other employers or starting their own business.\n\nSpeaking on ABC Radio National earlier this morning, Taylor said he supported free labour markets where people could move easily between jobs. But a lot of questions remained about how Labor’s proposal would work, he said.\n\n“Given it’s a very complex area of employment law, it’s unclear whether these changes would apply to non-disclosure agreements, for instance. So we need answers to those questions,” Taylor said.\n\nThe Council of Small Business Organisations Australia earlier told the ABC last night’s federal budget was one of the worst for small business, and the council was shocked and disappointed by the non-compete clause.\n\n“We don’t actually understand what’s being proposed here yet ... [the council] may or may not,” Taylor said.\n\nLoading\n\n“The thing about the Labor Party is they’re more likely to brief other people than us. That’s how they work. They don’t seem to believe in democracy the way I do. So we haven’t been briefed on the detail of it.\n\n“I’m someone who knows that the detail of these things really counts. We want people to have options in the labour market, but we also want small business to be strong.”\n\nUnder Labor’s proposal, Australian workers will be free to change jobs for a pay rise more easily.\n\nBusinesses will be barred from forcing non-compete clauses on staff earning less than $175,000, which represents about four in five workers, after the contracts spread from industries such as the law to low-paid jobs such as hairdressing, where they delay job switches by months or years.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/marnus-fails-after-astonishing-luck-20250326-p5lmnt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Marnus' fails after astonishing luck",
        "publish_date": "Wed, 26 Mar 2025 12:07:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Marnus' fails after astonishing luck\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/athletics-becomes-first-olympic-sport-to-introduce-dna-sex-testing-for-women-20250326-p5lmk5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Athletics becomes first Olympic sport to introduce DNA sex testing for women",
        "publish_date": "Wed, 26 Mar 2025 12:03:00 +1100",
        "category": "sports",
        "authors": [
            "Tariq Panja"
        ],
        "text": "Athletics will introduce mandatory DNA sex testing for athletes entering female competitions, its global leader said, making it the first Olympic sport to add the requirement.\n\nThe move comes amid an increasingly vexed debate over eligibility rules in female sports and comes less than a year after the issue erupted at the Paris Olympics when questions about the qualifications of two women who went on to secure gold medals in boxing led to tumultuous — and at times disturbing — scenes inside and outside of the ring.\n\nThe move is essential to protect female sports, said Lord Sebastian Coe of Britain, the head of track’s governing body, World Athletics, and a former double Olympic gold medallist. He said the new policy, which will subject competitors to what is described as a noninvasive cheek swab or dry blood DNA test, was part of his vow to “doggedly protect the female category and do whatever it takes to protect it.”\n\nWorld Athletics said the new tests could be in place in time for its next world championships, in Tokyo in September.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/coles-axes-vintage-cellars-first-choice-brands-20250325-p5lmg1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coles axes Vintage Cellars, First Choice brands",
        "publish_date": "Wed, 26 Mar 2025 12:02:00 +1100",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "The Vintage Cellars and First Choice Liquor Market store names will disappear across the country by the end of the year and will be absorbed into the better-known Liquorland umbrella brand as Coles fights to close the gap with rivals Dan Murphy’s and BWS.\n\nFor the first time, Coles customers will also be able to price match in any store, an offer that Dan Murphy’s has made itself synonymous with.\n\nColes’ Vintage Cellars and First Choice Liquor Market brands will disappear and be absorbed into the broader Liquorland banner. Credit: Domain\n\nColes Liquor chief executive Michael Courtney said a pilot that saw 14 Vintage Cellars and First Choice stores converted into “Liquorland Cellars” and “Liquorland Warehouse” was successful, resulting in a 16 per cent rise in brand awareness and a 30 per cent increase in customers likely to shop again.\n\n“They’re enjoying the experience in-store,” Courtney said. “All of those customer data points led to us seeing an increase in sales throughout the trial, which is really positive and gives us the opportunity to move forward.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/beveridge-and-morris-discuss-2022-clash-20250326-p5lmno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beveridge and Morris discuss 2022 clash",
        "publish_date": "Wed, 26 Mar 2025 11:59:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Beveridge and Morris discuss 2022 clash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/taller-than-an-a380-this-mammoth-sculpture-will-welcome-you-to-sydney-s-new-airport-20250318-p5lkhs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Taller than an A380, this mammoth sculpture will welcome you to Sydney’s new airport",
        "publish_date": "Wed, 26 Mar 2025 11:58:39 +1100",
        "category": "finance",
        "authors": [
            "Matt O'Sullivan"
        ],
        "text": "Rising out of what were once paddocks, a giant globe-like steel sculpture is quickly taking shape near the northern end of Sydney’s new international airport, no doubt leaving some people wondering what it is.\n\nUnder construction near crossroads for the new M12 motorway and a road link to Western Sydney Airport, the eye-catching structure will be 30 metres high, making it visible to passengers when the first flights start late next year.\n\nThe giant sculpture under construction near the northern end of the new Western Sydney Airport. Credit: Nick Moir\n\nDesigned by Indigenous design studio Balarinji, the steel is being crafted into an emu nest, inspired by the Great Emu in the Sky constellation. It will celebrate the local Dharug people’s dreaming story about Mariong – the emu and mother – and how she became the Milky Way.\n\nDuring the day, the sculpture will represent the emu nest, created by signature sticks that nod to the landscape and materials of the Dharug people.",
        "source": "TheAge"
    }
]