[
  {
    "url": "https://www.9news.com.au/national/christian-college-geelong-bus-crash-school-mourns-year-7-student-milla-killeen-killed/fc8cbf1b-8144-4089-97b7-f0f3f96d9a8a",
    "title": "'Unimaginable': School mourns 'talented' year 7 student killed in bus crash",
    "publish_date": "Thu, 28 Aug 2025 01:05:00 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": "A Victorian school is mourning the \"unimaginable loss\" of a 12-year-old student ﻿who died in a bus rollover north-west of Geelong.\n\nA Christian College Geelong bus carrying 28 primary and high school students ﻿fell on its side when it was turning left onto the Hamilton Highway from Firiend in Hand Road in Stonehaven about 8.20am yesterday.\n\nThe ﻿incident triggered a multi-agency emergency response to free students trapped inside.\n\nREAD MORE: ﻿ Uber rolls out rideshare for teens across Australia\n\nYear 7 student Milla Killeen died at the scene. (Facebook)\n\nYear 7 student Milla Killeen died at the scene.\n\nChristian College Geelong executive principal Mathilda Joubert said the family and the school were mourning the \"unimaginable loss\" and \"tragedy\" together.\n\n\"Milla will be remembered for her beautiful personal qualities, her vibrancy and infectious personality,\" she said in a statement.\n\n\"Her kindness, warmth and joy impacted all who shared her company.\n\n\"Milla was a keen and talented basketballer, and an integral part of the Christian College representative team at the recent State Championships.﻿\n\n\"She was a treasured member of our college community, and her loss is deeply felt by all staff, students and our Christian College families.\"\n\nChristian College Geelong will provide ongoing support to her peers and family.\n\n\"﻿In our deep grief, we are also coming together as a community to support one another, drawing strength from God, and the care and compassion that Milla herself demonstrated to others,\" Joubert said.\n\nREAD MORE: ﻿ Great weather divide across Australia taking hold\n\nA total of 24 students were taken to hospital. (Supplied)\n\nA total of 24 students were taken to hospital.\n\nA 16-year-old boy suffered serious injuries, nine students had non-life-threatening injuries, and 14 students were taken for observation.\n\nYesterday's bus crash has come as a shock to both the school and the local community.\n\nAmbulance Victoria acting manager Dave Shearer said there were some \"incredibly distressed\" parents at the scene of the crash, which Detective Senior Sergeant Paul Lineham described as \"incredibly confronting\" for first responders.\n\nDeputy Prime Minister Richard Marles said his \"heart breaks\" to have learnt of the incident near his hometown of Geelong.\n\n\"My first thoughts are with the family, friends and the school at this time and those that are injured,\" he said.\n\n\"I am mindful the incident is still unfolding and further information is still coming to light, but I do know this will affect so many in Geelong as we are a tight-knit community.﻿\"\n\nREAD MORE: ﻿ Queensland pedestrian fighting for life after being hit by truck\n\nThe bus was on a routine school pickup route at the time. (Nine)\n\nThe bus driver, a ﻿76-year-old man, was discharged from hospital and interviewed at Geelong Police Station.\n\nHe has been released pending further investigation.\n\nPolice said the bus driver had ﻿passed preliminary blood and alcohol testing at the scene and will have further blood work done.\n\nThe exact circumstances of the crash remain unknown.\n\nAnyone who witnessed the incident, has vision or information that could help police is urged to contact Crime Stoppers. ﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/qantas-profits-jump-by-28-per-cent/60e624b4-df91-4c2e-99b0-f635eb4c0ea4",
    "title": "Huge profit jump for Qantas powered by surging travel demand",
    "publish_date": "Thu, 28 Aug 2025 00:44:48 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Q﻿antas has reported a 28 per cent hike in net profit, reaping total profit of $2.4 billion during the past financial year.\n\nThe carrier's revenue increased 8.6 per cent, while its underlying profit was marginally better than market forecasts.\n\n\"Ongoing strength in travel demand\" drove international and domestic earnings,\" Qantas said.\n\nQantas Group today recorded a $2.4 billion profit for the past financial year. (Getty images)\n\nQantas Group chief executive Vanessa Hudson said the results were pleasing but the airline was focused on improving performance.\n\n\"Continuing strong demand across all market segments, combined with our dual brand strategy, helped the Group grow earnings,\" she said.\n\n\"Qantas and Jetstar carried four million more customers during the year, while our Loyalty business grew as frequent flyers engaged with the program more than ever before.\n\n\"Our strong financial performance is enabling significant investment in new aircraft and customer initiatives, helping deliver better operational performance and customer satisfaction across both airlines.\"\n\nIn providing its annual results, Qantas said its Project Sunrise for direct flights from Australia's east coast to Europe and New York was a step closer.\n\nREAD MORE: Two dead in US after shooter opens fire on children celebrating Mass\n\nQantas chief executive Vanessa Hudson. (Rhett Wyman/SMH)\n\nThe long-range Airbus A350-1000ULR is on track to reach final assembly line in October before its scheduled delivery next October.﻿\n\nA final dividend of 16.5 cents a share will be paid to shareholders, in addition to a special dividend of 9.9 cents a share.\n\nLast week, Qantas was handed a $90 million penalty for its illegal sacking of ground workers during the pandemic, in addition to $120 million compensation for former staff.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/uber-rolls-out-rideshare-for-teens-across-australia/86c26d53-bb36-48c0-b5ca-e2bb1a82a54c",
    "title": "Uber rolls out rideshare for teens across Australia",
    "publish_date": "Thu, 28 Aug 2025 00:17:02 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Uber is shifting its rideshare service for teens into top gear from tomorrow, expanding nationwide, but the move has sparked concern from child safety advocates.\n\nUber for Teens allows children aged 13 and over to catch Ubers with drivers who have a Working With Children Check.\n\nOnly highly rated, experienced driver partners are eligible to receive trip requests from teens and parents are able to track their children's journeys.\n\nParents will be able to track their children on their journey. (9News)\n\nThe service is being launched in NSW, Victoria and Western Australia tomorrow.\n\nChildren were previously only allowed to travel in Ubers when accompanied by an adult.\n\nHowever, Uber for Teens has already been operating in Queensland, South Australia, Tasmania and the ACT since April last year, with Uber reporting no safety incidents have occurred in those states.\n\nExtra safety features implemented by Uber for its teen service include a three-way intercom feature for teen accounts, live trip tracking, and four-digit PIN verification.\n\nIn NSW, ACT, SA and TAS, teens are able to register for audio recording which will be automatically enabled for the entire teen trip.\n\nThe service will cost an extra $2 per trip, with the additional fee going towards the driver's cost of obtaining a Working With Children Check.\n\nUber for teens drivers in Queensland are not required to get the Working With Children Check as it is not legislated under state law.\n\nUber Australia & New Zealand Managing Director Emma Foley said: \"We know that modern family life is a constant balancing act, from early morning school runs to after-school activities and everything in between.\n\n\"That's why we are excited to be expanding Uber for teens to New South Wales, Victoria, the Northern Territory, and Western Australia, giving more families access to a safe and reliable way to help lighten the load.\"\n\nBut some parents and child safety advocates warn the measures are not enough to safeguard children.\n\nChild safety advocate Hetty Johnston told The Sydney Morning Herald she did not believe Uber's safeguards were enough to protect young people.\n\nWhile the driver having a Working With Children Check (WWCC) was better than nothing, the current system was \"a bit like having an ashtray on a motorbike\", Johnston said.\n\nShortcomings of the WWCC had been highlighted by the Melbourne childcare crisis, she said.\n\n\"I think you're throwing caution to the wind there, and you're just hoping that everything will be all right whenever you send your young people off into an Uber,\" she said.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/midwinter-ball-canberra-2025-august-gallery/05d966bd-0d79-443c-b7dd-af37796a82b2",
    "title": "Politicians and media figures glam up for Canberra's night of nights",
    "publish_date": "Wed, 27 Aug 2025 11:21:13 +0000",
    "category": "finance",
    "authors": [
      "August"
    ],
    "text": "1 of 22 Attribution: Composite\n\nIn the middle of the bitter Canberra winter, there's one event that's guaranteed to heat things up.\n\nIt's a chance for the nation's politicians and media figures ﻿to get their hair done up nice, then let it down.\n\nExpect glitz, glamour and smiles as senators and MPs ﻿lay aside their differences and pick up their glasses, for one night only.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/finance/asic-probing-offset-accounts/6b3b2d05-8cae-4301-8025-8fd304b38d65",
    "title": "Financial watchdog scrutinising banks over concerns mortgage holders are being ripped off",
    "publish_date": "Wed, 27 Aug 2025 09:20:47 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Australia's financial watchdog is probing whether bank customers are being ripped off because savings from mortgage offset accounts aren't being properly passed on.\n\nOf the more than 3 million Australian households that have a mortgage, more than half feature an offset account.\n\nUsed correctly, they can save borrowers thousands of dollars a year by ensuring extra savings offset the outstanding balance on a home loan, leading to less of an interest bill.\n\nREAD MORE: Officers killed in Porepunkah shooting named ﻿\n\nAustralia's financial watchdog is probing whether bank customers are being ripped off because savings from mortgage offset accounts aren't being properly passed on. (Jim Rice)\n\nThere is some $300 billion sitting in offset accounts across Australia.\n\nHowever, 9News can reveal the Australian Securities and Investments Commission (ASIC) is concerned customers might not be getting those proper savings due to bank errors.\n\n\"We've heard, in some instances, the banks have not connected the offset account to someone's mortgage account,\" commissioner Kate O'Rourke said.\n\n\"That's bad for the consumer, but we're not sure how widespread that problem is.\n\nASIC has now launched a surveillance program of eight banks, including some of the big four, and has hinted refunds could be on the cards if it finds customers have been missing out on their deserved savings.\n\n\"Our expectation is that when things have not been properly done, consumers are remediated,\" O'Rourke said.\n\nThe program could take a year to find out how many people have been impacted.\n\nIn the meantime, consumers have been advised to carefully check statements and ask their bank to confirm accounts are linked if they are in any doubt.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/social-media-critical-northern-australia-drowning-rate/105602462",
    "title": "Authorities work with social media influencers to curb drowning deaths",
    "publish_date": "Thu, 28 Aug 2025 01:43:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Authorities are being urged to work with influencers and develop gender-specific social media campaigns to encourage safer behaviour around waterfalls and curb drowning rates.\n\nA Royal Life Saving review of water safety found that while men accounted for about three-quarters of drowning deaths in Cairns, most social media photos of risky behaviour at dangerous heights and unsafe areas were shared by women.\n\n\"We are seeing the rise in people trying to take that perfect social media image or selfie and getting into trouble because they're not following the safety advice,\" Royal Life Saving Queensland state manager Nikki Thornhill said.\n\nUNSW PhD candidate Sam Cornell, who is researching the effectiveness of location-based social media safety messaging at aquatic locations, said it did not mean women were behaving more dangerously around water than men.\n\nBut he said \"copycat\" behaviour was an issue, and there was merit to considering gender-specific safety campaigns.\n\nThis photo taken at Crystal Cascades was among those identified in a review of water safety in Cairns. (Supplied: Cairns Regional Council)\n\n\"The way you might communicate to young males versus young females will likely be different if you want those safety messages to be effective, so it's probably a good idea to conduct more research in that area,\" Mr Cornell said.\n\n\"I think there's something to be said with potentially collaborating with influencers to try to convey messages to people [but] even that's probably not the gold standard, quite frankly.\n\nSafety signage at Crystal Cascades may get an update after a drowning review. (ABC News: Conor Byrne)\n\n\"It would be better if we could convey these messages via the platforms themselves.\"\n\nHowever, Mr Cornell said efforts to develop more innovative water safety messaging, such as through pop-up phone notifications, had been stymied by a lack of \"buy-in from social media companies\".\n\n\"I think, if anything, we're further away from that goal than we were a few years ago,\" Mr Cornell said.\n\n\"Safety just really isn't a priority for them.\"\n\nNorthern Australia's high drowning rates\n\nWaterfalls and inland swimming holes are a way of life for residents of northern Australia, where marine stingers and crocodiles can make swimming at beaches a potentially deadly prospect.\n\nBut six of the nation's top 10 regions with the highest drowning rates over the past decade are located across far north Queensland, the Northern Territory, and northern Western Australia.\n\nThe Torres Strait and Cape York in far north Queensland tops the nation, according to the latest Royal Life Saving's national drowning report, with its residents drowning at a rate of 4.95 per 100,000 people.\n\nDarwin, Palmerston and Litchfield in the Northern Territory had the highest drowning rate of any metropolitan area.\n\nThe Cairns region has had a drowning rate more than three times the national average over the past 20 years, according to Royal Life Saving figures.\n\nThe Torres and Cape region has the highest per capita drowning rate in Australia. (ABC News: Bridget Judd)\n\nMs Thornhill said high drowning rates in northern Australia were partly due to a lack of safe places to swim.\n\n\"They [also] don't have the same access to lessons, emergency equipment, and water safety education that we do in our more metropolitan and populated areas,\" she said.\n\n\"We really do need to make sure that we are targeting and supporting those communities as best we can.\"\n\nCouncils finding a balance\n\nMr Cornell said it was important for councils to monitor social media to identify any emerging trends in unsafe behaviour.\n\nIn response to a safety review, Cairns Regional Council planned to consult locals on a proposal to extend a no-go zone and remove a staircase at the popular Crystal Cascades.\n\nIsabella Falls, at Edmonton in the city's south, could be closed altogether.\n\n\"We've had two recent deaths there, including a young high school student who had just graduated,\" Cairns councillor Brett Moller said.\n\nYoung people have died at Isabella Falls in Edmonton in recent years. (Supplied: Olly Gaspar)\n\nCr Moller said the council was \"trying to find the balance\" so people could still access Isabella Creek recreationally without putting themselves at risk.\n\n\"We don't want to lock everything up, but we need to take whatever steps we can to highlight that danger and what can befall you if you don't act responsibly,\" he said.\n\nCr Moller said the council was working with peak body Tourism Tropical North Queensland on developing \"consistent\" social media content that encouraged safe behaviour.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/murchison-towns-urgently-call-for-mobile-dental-services/105700264",
    "title": "Outback kids suffer through two years with no local dentist",
    "publish_date": "Thu, 28 Aug 2025 01:33:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Out in the red dirt of Western Australia's Murchison region, a few small towns are united by their calls for a mobile dental service to be urgently reinstated.\n\nThe state government's Dental Health Service would normally visit the remote towns of Meekatharra, Mount Magnet, Cue, Sandstone, and Yalgoo each year.\n\nHowever, Yalgoo chief executive Ian Holland said the mobile dental service van had not visited since 2023.\n\n\"It's been almost a solid two years already, well into the third, that we haven't had any form of dental check-up for our children,\" he said.\n\nYalgoo locals have not had a visit from the Dental Health Service since 2023. (ABC News: Chris Lewis)\n\nMr Holland said Yalgoo locals were forced to make a 500-kilometre round trip to Geraldton, or 620 kilometres to Meekatharra, for preventative dental appointments.\n\n\"Unless someone's screaming and in pain … it's very, very onerous going for a 300 to 500-kilometre drive, and then potentially staying overnight, just for a check-up,\" he said.\n\nIan Holland has been advocating to get the service reinstated. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nMr Holland has written to health ministers asking why the service had stopped.\n\n\"We received a bunch of excuses that it was too hard to hire dental staff,\" he said.\n\nThe town of Cue, 195km north-east of Yalgoo, has also felt the impact of not having the mobile dental service.\n\nCue Primary School chair Richard Towell said children in the Murchison were already at a disadvantage as the water was not fluorinated.\n\n\"The kids are more susceptible to dental problems from that,\" he said.\n\nResidents face travelling hundreds of kilometres for a dentist. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nMr Towell said not only should the dental van be urgently reinstated, but considering the significant geographical barriers, it should visit more often.\n\n\"Even when it's happening, it's really only a once-a-year thing. It should probably be a quarterly visit,\" he said.\n\n\"Generally, when people are going to Geraldton, things like dentists are not high on the priority list.\n\n\"It's very hard to get appointments that match when people are travelling.\"\n\nDelays to van and staffing\n\nLast November, a health department spokesperson told the six affected local governments that a new, larger dental van was being built.\n\nThey were told it would be tested in Perth in early 2025 before being deployed to the region.\n\nA new, larger van has been built to service remote communities. (Supplied: WA Health Department)\n\nBut a recent letter to Mid West member Shane Love said the van, that was expected to be operating by now, was delayed by a manufacturing issue.\n\nThe letter also said the Dental Health Service was struggling to recruit staff.\n\nWA Health Minister Meredith Hammat said the fit-out of the new dental van was nearly finished.\n\n\"It will complement the fixed dental clinic at Meekatharra Hospital and, when it's completed and staffed, will ensure that residents in the Murchison region who can't travel have access to high quality dental care through the mobile service,\" she said.\n\nA manufacturing issue has been blamed for the van's late completion. (Supplied: WA Health Department)\n\nMr Love said local families were frustrated by the constant delays.\n\n\"They don't understand why their students, their communities, haven't been prioritised,\" he said.\n\n\"Why did the government allow the [previous van] to become so run down that it could no longer be provided and had to wait for a new van to be built?\n\n\" The government sat on its hands and did nothing. \"\n\nMr Love said the Murchison region had a large proportion of Aboriginal people, a demographic already vulnerable to dental issues.\n\nShane Love says the two-year gap of dental services is unacceptable. (ABC News: Kema Johnson)\n\nHe also said there was a lot of social disadvantage, and many people could not afford the travel costs to access the closest clinic.\n\nMr Love said the dental service needed to be urgently prioritised.\n\n\"We want the service reinstated right now, and certainly by the end of this year,\" he said.\n\n\" People need to be able to plan and to have some sureties that their children are going to be examined and treated in a way that every other kid in this state can. \"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/priscilla-hon-stuns-17th-seed-us-open-jordan-thompson/105706814",
    "title": "Aussie qualifier Priscilla Hon reaches US Open third round with stunning upset",
    "publish_date": "Thu, 28 Aug 2025 01:00:30 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian world number 126 Priscilla Hon has scored a stunning upset win over 17th seed Liudmila Samsonova to advance to the US Open third round.\n\nHon, who only reached the main singles draw after winning in qualifying, backed up her first-ever win at Flushing Meadows in the first round with a shock win over Russian Samsonova, who reached the quarterfinals of Wimbledon last month.\n\nIt was undoubtedly the biggest win of her career and sent her into a grand slam third round for the first time.\n\nHon fired 18 aces and 36 winners past Samsonova to win 4-6, 6-3, 6-2 to progress in New York, where she will face 16th-seeded Belinda Bencic or American world number 49 Ann Li for an improbable spot in the last 16.\n\nHon gleefully signed autographs and posed for selfies after securing a career pay day of at least US$237,000 ($363,000) and a likely rankings leap into the world's top 100 for the first time.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nSamsonova wiped out Australia's top two women's players, Daria Kasatkina and Maya Joint, en route to the last eight at the All England Club in July.\n\nOther big scalps on her CV this year include four-time grand slam champion Naomi Osaka, Wimbledon finalist Amanda Animisova, world number four Jessica Pegula, and Tokyo Olympics gold medallist Bencic.\n\nHon is the first Australian through to the third round, with Kasatkina and Joint still in the running to join her, while Jordan Thompson is one of the men trying to emulate her efforts.\n\nAlex de Minaur, Alexei Popyrin, Tristan Schoolkate and Adam Walton are all also still alive in the men's draw.\n\nJordan Thompson was locked in a battle with French veteran Adrian Mannarino on Court 11 as Hon wrapped up her victory with back-to-back aces.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/ato-whistleblower-richard-boyle-sentenced/105702198",
    "title": "Breaking: ATO whistleblower Richard Boyle spared convictions, jail sentence",
    "publish_date": "Thu, 28 Aug 2025 00:45:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian Taxation Office (ATO) whistleblower Richard Boyle has avoided convictions and a jail sentence, seven years after publicly exposing aggressive debt collection practices at the tax office.\n\nThe 49-year-old former debt collection officer previously pleaded guilty in South Australia's District Court to four charges, after striking a deal with prosecutors.\n\nAfter raising concerns about practices internally at the ATO, he went public with the allegations on the ABC's Four Corners program in 2018.\n\nThe allegations included that his area within the ATO was instructed to use heavy-handed tactics on taxpayers who owed the tax office money.\n\nIn May, he pleaded guilty to the offences of disclosing protected information to another entity, making a record of protected information, using a listening device to record a private conversation and recording another person's tax file number.\n\nThe sentencing judge imposed a 12-month good behaviour bond and described his offending as having occurred in \"extenuating circumstances\".\n\nRichard Boyle entered his guilty pleas in South Australia's District Court. (ABC News: Che Chorley)\n\nBoyle was initially charged with 66 offences, but over time, many were dropped.\n\nOver the years since he spoke out publicly, Boyle made several failed attempts to secure immunity from prosecution using whistleblower protections.\n\nHe had been scheduled to stand trial later this year, after losing his last chance to secure immunity from prosecution when the High Court refused his application for special leave to appeal.\n\nBoyle had earlier lost an appeal in South Australia's Court of Appeal.\n\nSupporters had also regularly called for the case against him to be thrown out.\n\nSupporters of Richard Boyle gathered outside court before his sentencing on Thursday. (ABC News: Jordanna Schriever)\n\nLast month, Boyle argued he should be spared a conviction because he was motivated by public interest, and his actions led to change within the federal agency.\n\nHis defence lawyer, Steven Milsteed KC, had argued the court should recognise that Boyle was not acting out of any nefarious motivation, self-interest or malice and instead was guided by a \"sincere belief that he was acting in the public interest\".",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/steve-malaxos-develops-afl-rising-star-nominees-scotch-college/105685970",
    "title": "How a former Eagles captain developed a new crop of rising stars",
    "publish_date": "Thu, 28 Aug 2025 00:30:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "When the AFL anoints this year's Rising Star, one man will be paying very close attention.\n\nSteve Malaxos, the former West Coast Eagles captain, had a direct hand in developing four of this year's nominees at the talent factory that is Perth's Scotch College.\n\n\"I keep tabs. I track their progress,\" Malaxos said of his former players performing in the AFL.\n\nMalaxos coached GWS defender Joe Fonti, Collingwood's Ed Allan, Adelaide's Dan Curtin and St Kilda's Hugh Boxshall at the school.\n\nSteve Malaxos coached four of this year's Rising Star nominees at Scotch College. (ABC News: Tom Wildie)\n\nFormer Rising Star nominee Elijah Hewett and his Eagles teammate Coen Livingstone are also Scotch products.\n\n\"Most of them have exceeded my expectations,\" Malaxos reflected.\n\n\"There's a lot of factors involved in a player performing well at that level, but we've had a part to play.\n\n\"Elijah and Dan were outstanding players for us. Ed gradually progressed, and I'm not surprised how he's going now.\"\n\nFonti's rise\n\nBut while Malaxos saw talent in several of his players from an early age, there is one who has surprised him more than others.\n\n\"Joe Fonti didn't even play in the first team in year 11, so he had one year with us,\" he said.\n\n\"He was a reluctant footballer to a certain extent.\"\n\nFonti was not drafted straight out of school, spending an extra year in the WAFL before the Giants selected him in the 2023 draft.\n\nJoe Fonti (left) is one of the AFL's next crop of stars to come out of the Scotch program under Steve Malaxos (AAP Image: Darren England)\n\n\"I think playing football at that stage in my life was never really on the cards,\" the defender said.\n\n\" I enjoyed playing high level football, it was just never really a priority of mine, so I just played socially. \"\n\nFonti found his way in football, and has now played 20 games for the Giants, including 15 in a row as GWS finished the 2025 season fifth on the ladder.\n\nFonti played in one of Scotch's four consecutive Alcock Cup triumphs under Malaxos, and said it was a time he would never forget.\n\n\"School footy is something that's very special, because you're never really playing in a side that's full of all your best mates in your life [after school],\" he said.\n\n\"It's something that's very special to reflect on.\"\n\nAn evolving coach\n\nMalaxos has spent virtually his entire life involved in football, from making his senior debut with Claremont in the WAFL in 1979, to captaining the Eagles, to winning three WAFL premierships before retiring in 1998.\n\n\"I've had some sort of coaching role non-stop since then,\" he said.\n\n\"Assistant at Sydney and Adelaide, and then East Fremantle colts and then league, and then a stint at Swans [Swan Districts] as an assistant, and now Scotch.\"\n\nMalaxos started his AFL coaching journey under former Hawthorn player Rodney Eade, and worked with Ken Judge and Tony Micale in the WAFL.\n\nMalaxos learnt his trade from the likes of Rodney Eade (pictured) and Ken Judge. (AAP Image: Mick Tsikas)\n\n\"They were pretty hard and demanding on assistants, which was good in a way,\" he said.\n\n\"It was probably a little bit more of an in-your-face style.\n\n\"Coaching Scotch is different. I'm not coaching 30-yea- olds, they're 15, 16, 17. So I had to adapt my style.\n\n\" I reckon if it was 20 years ago, it might not have been at the right time. It's just the right time for both parties or has been so far. \"\n\n'Very passionate'\n\nMalaxos is conscious of not overdoing the \"angry coach\" routine, especially with teenagers.\n\n\"It can only work a couple of times with young guys,\" he said.\n\n\"You pull the lever at the right time, but I'm usually quite instructional, usually quite positive.\"\n\nSteve Malaxos watches Scotch players in their recovery session on a Monday afternoon. (ABC News: Tom Wildie)\n\nCollingwood midfielder Ed Allan agrees Malaxos has got the balance right, and credits him for making footy fun.\n\n\"We had a great group of guys coming through, and Steve did a great job gelling us all together,\" Allan said.\n\n\"I think he was a bit calmer than he was in his WAFL days, but he was great for us.\n\n\"I think it’s a credit to Scotch and the program and the environment.\n\n\"The whole thing was just to have fun and play with your mates, which I think is the most important thing about footy.\n\nCollingwood's Ed Allan was coached by Steve Malaxos while he was at school. (AAP Image: Richard Wainwright)\n\n\"It’s cool to look at it now, and know we all came from the same place.\"\n\nFonti said having someone of Malaxos's credentials in the school system was invaluable.\n\n\"He was pretty methodical. Very passionate,\" he said.\n\n\"There were some good half-time and post-game speeches that he'd give.\n\n\"All in all, for the level of competition he was coaching, he was a very, very valuable coach.\"\n\nThe winner of this year's Rising Star award will be announced in Melbourne on the night of the Brownlow Medal count on September 22.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/ostapenko-townsend-clash-jack-draper-casper-ruud-out-of-us-open/105706372",
    "title": "'No class and no education': Ostapenko once again the villain at US Open",
    "publish_date": "Thu, 28 Aug 2025 00:21:18 +0000",
    "category": "sports",
    "authors": [],
    "text": "American Taylor Townsend has enjoyed an upset win over 25th seed Jeļena Ostapenko at the US Open, with the pair clashing at the net after the match.\n\nAfter taking down the former French Open winner 7-5, 6-1 on Court 11, Townsend let out a celebratory roar before approaching Ostapenko for the customary handshake.\n\nAs is often the case with the Latvian, she took issue with her opponent, telling Townsend, \"you have to say sorry\" when a shot hits the net cord and helps a player win a point.\n\nTownsend retorted, \"No, I don't have to,\" as the raucous home crowd jeered and the argument continued.\n\n\"You can learn how to take a loss better: 'Thank you so much, great job, great play,'\" Townsend told Ostapenko, who appeared to swear at the fans as she packed up her bags.\n\nTownsend then fired up the crowd while pointing back at her opponent, and explained what went down in her on-court interview.\n\n\"It's competition, people get upset when they lose. Some people say bad things,\" Townsend said.\n\n\"She told me I have no class and no education and to see what happens when we get outside the US.\n\n\"I'm looking forward to it. I beat her in Canada outside the US, I beat her in New York [inside] the US, so let's see what else she has to say.\"\n\nTownsend next meets fifth seed Mirra Andreeva in the third round, already equalling the American world number 139's deepest run at her home slam since 2019.\n\nTop men's seeds out\n\nJack Draper has struggled with an injury to his left hitting arm. (AP: Kirsty Wigglesworth)\n\nAndreeva's counterpart on the men's side, fifth seed Jack Draper, was forced to pull out before his second-round meeting, while 2022 finalist Casper Ruud was knocked out in five sets as his troubled season continues.\n\nDraper could not take the court against Zizou Bergs due to an arm injury after reaching the second round with a win over Argentine qualifier Federico Agustin Gomez.\n\nDuring his opener, he was dealing with a left-arm issue that had kept him out of action since he lost in the second round of Wimbledon last month.\n\n\"I'm sorry to say I'll be withdrawing from the US Open,\" Draper said on social media.\n\n\"I tried my very best to be here and give myself every chance to play, but the discomfort in my arm has become too much, and I have to do what is right and look after myself. Thank you for all the support.\"\n\nDraper wore a sleeve on his left arm during the singles, but did not sport one during his brief mixed doubles tilt with Jessica Pegula.\n\nThe 23-year-old reached the semifinals of last year's US Open, where he lost to eventual champion Jannik Sinner.\n\nMeanwhile, Ruud suffered his second loss to a player ranked outside the top 100 in as many months, going down 6-4, 3-6, 3-6, 6-4, 7-5 to 107th-ranked Raphael Collignon in three hours and 30 minutes.\n\nCasper Ruud lost to a player outside the top 100 for the second time in as many months. (Getty Images: Matthew Stockman)\n\nIt was just the third Tour-level win for Belgium's Collignon, who is playing in his second grand slam main draw.\n\nTwelfth-seeded Ruud arrived in New York on the back of losing matches to world number 70 Arthur Rinderknech at the Cincinnati Masters, and the 109th-ranked Juan Manuel Cerundolo in Gstaad last month.\n\nIt continued a mixed year for Ruud, who lost in the second round as the sixth seed at the Australian Open, dropped his opening match at Indian Wells, and battled during the claycourt swing despite winning a maiden Masters title in Madrid.\n\nIn addition to his defeat on clay in Gstaad, the two-time French Open runner-up was knocked out in the second round at Roland Garros by world number 41 Nuno Borges, before a knee injury forced him out of Wimbledon.\n\nDjokovic recovers from early wobble, American hopes continue\n\nNovak Djokovic tidied up early errors and recovered from a set down to get past American qualifier Zachary Svajda, as Briton Emma Raducanu had a far easier time advancing into the third round for the first time since her 2021 title run.\n\nDjokovic made 14 unforced errors in the first set compared to just 11 across the rest of the match as he eventually hit his stride on Arthur Ashe Stadium, beating Svajda 6-7(5/7), 6-3, 6-3, 6-1.\n\nSvajda put up a surprise early fight to the delight of the home fans but was let down by an apparent leg injury midway through the match, and 24-time grand slam winner Djokovic advanced to a third-round clash with Briton Cameron Norrie.\n\nNorrie's compatriot, Raducanu, needed only an hour to cruise past the Indonesian qualifier, Janice Tjen, 6-2, 6-1 in the first match of the day at Louis Armstrong Stadium, as she finds a way back to winning ways at the hardcourt tournament.\n\nRaducanu had not won a US Open match since lifting the trophy in her remarkable run four years ago, but appears in solid form this year as she made just eight unforced errors.\n\n\"I'm particularly happy, because on the court, I felt like my opponent was playing really good tennis. I thought that she was very dangerous,\" she told reporters.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"So I'm very pleased with how I kept dictating the points, I kept dictating the play.\"\n\nAfter Svajda's loss, American fourth seed Pegula got the home crowd at Ashe back up with a routine 6-1, 6-3 win over Anna Blinkova and will next play three-time finalist Victoria Azarenka.\n\nAmerican fourth seed Taylor Fritz got past South African Lloyd Harris 4-6, 7-6(3), 6-2, 6-4 in the second match of the day at Armstrong, with Swiss qualifier Jerome Kym waiting for him in the third round.\n\n2024 runner-up Fritz is among the top contenders hoping to break a 22-year American men's drought at the tournament, along with Frances Tiafoe, who beat qualifier Martin Damm 6-4, 7-5, 6-7(8/10), 7-5.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/newcastle-knights-coach-adam-obrien-depart-club/105706114",
    "title": "NRL bloodletting continues after Knights coach became 'a distraction'",
    "publish_date": "Wed, 27 Aug 2025 23:59:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "Newcastle Knights coach Adam O'Brien will depart the NRL club at the end of the 2025 regular season, despite having two years left to run on his contract.\n\nThe decision has been described as a \"mutual agreement\" in a statement released by the club today.\n\nThe coach confirmed the move at a press conference in Newcastle on Thursday morning, telling reporters he approached the club about leaving.\n\n\"The one thing that stood out for me: I'm a big distraction,\" O'Brien said.\n\n\"If there was one gift I could give the playing group [and] the supporters that pack that stadium every week, is remove that distraction.\n\n\"If I couldn't [give] them the ultimate prize to win a comp, then the way to help them now is to give them a new coach.\"\n\nSeven losses in a row\n\nPressure on O'Brien has been building this season, with the Knights currently second-last on the ladder with only six wins from 22 games.\n\nThe side was defeated by the Brisbane Broncos at Newcastle's Hunter Stadium last weekend, in what was its seventh consecutive loss.\n\nO'Brien joined the Knights in 2020, tasked with rejuvenating the club after it picked up three consecutive wooden spoons in 2015, 2016, and 2017 and poor results in 2018 and 2019.\n\nNewcastle made the NRL finals under his guidance in 2020, 2021, 2023 and 2024, but failed to progress past the first round of the playoffs.\n\nThe move comes only days after the last-placed Gold Coast Titans announced its coach Des Hasler would also depart at the end of the season, with Josh Hannay to take over in 2026.\n\nAdam O'Brien announces his decision at a media conference. (ABC Newcastle: Ben Clifford)\n\nThe Newcastle Knights are yet to confirm a replacement for O'Brien, who said coaching the club had been \"the greatest honour\" of his life.\n\n\"The decision is made easier because both parties are in agreement,\" he said.\n\n\"It's the right time to give someone else a go.\n\n\"We'd have to win 10 or 15 games straight next year for there to be no speculation.\"\n\nFond memories\n\nO'Brien said he would reflect on his time living in Newcastle and working at the Knights with overwhelming fondness.\n\nHe said the connections he made with players past and present have been special to him.\n\n\"I've loved everything … debuting young blokes … I got to see young men become fathers,\" he said.\n\nOutgoing Knights coach Adam O'Brien watches on at a field session in 2024. (ABC Newcastle: Bridget Murphy)\n\n\"It's not all about footy … but that stadium, and the people, and the joy that it brings on a Monday morning when you've won a game … that's really special.\"\n\nIncoming Knights CEO Peter Parr will now commence a recruitment process to select a new coach to be appointed by the Knights Board.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-08-28/coles-and-woolworths-release-beef-sustainability-2025-goal/105703130",
    "title": "Supermarket giants under pressure to boycott controversial beef",
    "publish_date": "Wed, 27 Aug 2025 23:36:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Supermarkets, green groups and Australia's cattle industry are at loggerheads over the sustainability of Australian beef and the land clearing associated with it.\n\nThe debate has emerged after Australia's two major supermarkets released their annual sustainability reports this week, revealing the retailers have very different beliefs about how land is managed by beef producers.\n\nThe reports outline environmental and social impacts of products and future environmental goals, and both focus on reducing their associations with deforestation, or land clearing.\n\nIn a first for the company, Coles said it was working to remove beef linked to deforestation.\n\nAt the same time, Woolworths has \"re-rated\" the deforestation risks posed by Australian beef as low.\n\nThe deforestation debate emerged after Coles and Woolworths released annual sustainability reports. (ABC News)\n\nChange of tack on 'green beef'\n\nThe Australian Conservation Foundation (ACF) has slammed the change by Woolworths while welcoming the move by Coles, saying farmers \"bulldoze hundreds of thousands of hectares of land\" annually.\n\nThe ACF wants supermarkets and fast food retailers to boycott beef associated with land clearing.\n\nACF business and nature lead Nathaniel Pelle said there was no bigger cause of deforestation in Australia than beef.\n\n\"A minority of Australian beef farmers are pushing over an enormous amount of trees — we're talking hundreds of thousands of hectares of trees every year,\" he said.\n\nAustralian Conservation Foundation says the beef industry is a major cause of deforestation in Australia. (ABC Mid West Wheatbelt: Jo Prendergast)\n\nBut Cattle Australia chief executive Will Evans said that claim was not supported by industry, science or Australian government standards, and was another attack on agriculture.\n\n\"Governments all around the world and every state and territory government in this country and the federal government all disagree with ACF's assertions,\" he said.\n\nMr Evans said some clearing did occur, but before any tree was removed, producers went through a \"considered and protracted\" process, including biodiversity assessments, to comply with environmental regulations and mitigate impacts.\n\n\"[On] any act of land management, land care or land development conducted by the beef industry, [ACF] seem to have a real issue with,\" he said.\n\nCattle Australia said the industry was heavily regulated, and producers took environmental management seriously.\n\nSupermarkets take a stance\n\nColes told the ABC it would stop sourcing beef linked to deforestation by the end of 2025.\n\nA spokesperson for the supermarket said it was in the early stages of building its approach to achieving the ambition, but was committed to working with stakeholders to implement the delivery.\n\nThe federal government has lifted import restrictions on US beef. (ABC News: Bec Whetham)\n\n\"In the lead up to setting this ambition, we have engaged with producers, suppliers, industry associations and NGOs [non-governmental organisations],\" the spokesperson said.\n\nIn its sustainability report, Woolworths said: \"In May 2025, following extensive engagement with the Australian government, the European Union Commission re-rated Australia to be a low-risk country, reflecting the changes in land management practices across the Australian beef industry over many years.\"\n\nWoolworths said it was committed to sourcing beef sustainably, but was focusing its efforts on other commodities such as cocoa, paper pulp timber, palm oil, and soy in stockfeed, as they represented a higher deforestation risk than Australian beef.\n\nFarmers' data requested\n\nMr Pelle said supermarkets should have access to data stored in the National Livestock Identifiation Scheme (NLIS), a record of animal movements based on information provided by farmers to ensure biosecurity and food safety.\n\n\"In most cases, the supermarkets and the fast-food joints we are buying our beef from have no way of knowing whether or not the beef they are selling you is linked to deforestation or not,\" he said.\n\nWhile Coles supported the idea, Cattle Australia said it was not an appropriate use of the data.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/manning-youth-think-tank-develops-new-flood-recovery-projects/105594910",
    "title": "Teenagers rally against mental 'numbness' after natural disasters",
    "publish_date": "Wed, 27 Aug 2025 23:12:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Evie Barton is negotiating the challenges of her final year of high school while recovering with her family after record-breaking floods tore through their home.\n\nEvie, a year 12 student at Taree High School on the NSW Mid North Coast, was forced to evacuate during the May weather event.\n\n\"The floods went about a metre through our house, we lost a lot of furniture, clothing, memories really,\" she said.\n\n\"Now it's just mud everywhere, it's suffocating. We have to find small wins for our life now, trying to get back to normal.\n\n\" It's definitely a battle … it just feels like a numbness. It's not even like the same place that it once was. \"\n\nEvie Barton says it was empowering to see flood-affected students work on practical solutions. (ABC Mid North Coast: Marina Trajkovich)\n\nEvie has teamed up with other flood-affected young people in the region to try and boost youth mental health in the wake of the disaster.\n\nThree local high schools — Wingham, Taree and Chatham — recently hosted a Manning Youth Recovery Think Tank event, which brought students together to find practical ways to help young people engage with each other and their communities.\n\n\"It's all about youth advocacy,\" Evie said.\n\n\"We've been able to come up with action plans and ideas to better our community after the floods and it's been really inspiring.\"\n\nFlooding in Taree in late May. (Supplied: PolAir)\n\nYouth-led recovery\n\nOrganisations including the NSW Reconstruction Authority, Indigenous elders, Mission Australia and Headspace helped the students come up with three initiatives.\n\nOne was the development of a MidCoast Youth Council to work closely with local government and advocate on issues that matter to young people.\n\nThe second was to establish a Youth Social Events Agency to lead inclusive social events, while the third was a youth-led environment volunteering project focused on regenerating flood-affected riverine areas.\n\nJenna Harborow (third from right) working with other students at the Manning Youth Recovery Think Tank event. (ABC Mid North Coast: Marina Trajkovich)\n\nWingham High School student Jenna Harborow said it felt empowering to be involved in youth-led solutions.\n\n\"Young people are often overlooked … we have a lot of energy,\" she said.\n\n\"We go to school … but there's nowhere to hang out, there's nowhere to communicate, there's nowhere to volunteer if we wanted to.\n\n\"So, we are working on making ways for the youth and the rest of the community to interact well and mesh a bit more.\"\n\nJenna and her family were isolated during the May floods when two bridges that connect their Mooral Creek cattle property to nearby Wingham were destroyed.\n\nWingham Riverside Reserve was partially buried under river silt after the May floods. (Supplied: MidCoast Council)\n\n\"Luckily, my family and animals were all safe, but I know some of the people around Mooral Creek in the gullies were flooded and lost a lot of cattle and a lot of money,\" she said.\n\n\" Lots of people think now that it's no longer raining, it's fine, but we are definitely still recovering. \"\n\nThe students are now working on 90-day action plans they formulated to make their projects a reality.\n\n\"I feel like this will actually affect our future rather than being [just] a chat session,\" Jenna said.\n\nImpact of repeated disasters\n\nTaree High School executive principal Nigel Reece said it was encouraging to see the solutions taking shape, and schools played an important role in student recovery.\n\nHe said some students had been affected by severe floods in 2021 before being flooded again this year.\n\nNigel Reece says the region's young people have shown incredible resilience in the face of several natural disasters. (ABC Mid North Coast: Marina Trajkovich)\n\n\"I just think that [student] resilience is amazing,\" he said.\n\n\"They've had COVID lockdowns, bushfires, two major floods … the impact there is probably their social and emotional wellbeing.\n\n\"We're slowly needing to rebuild that and give our young people that skill set again.\"\n\nDiscarded household items lined the streets of Taree in the wake of the May floods. (ABC News: Jack Fisher)\n\nNew research into the impact of natural disasters on young people by psychologist and Australian National University professor Ben Edwards found repeated hardships could affect teens' mental health, particularly those aged 14 to 19 years old.\n\n\"Our findings suggest there's quite a deal of resilience in the face of a single natural disaster,\" he said.\n\n\"But when there's repeated natural disasters, young people do start to struggle.\n\n\"What we found was the older group of children tends to be more vulnerable.\"\n\nProfessor Edwards said he would like to see more state and federal government funding to support student wellbeing as disasters became more frequent across Australia.\n\n\"There's an opportunity, a challenge for young people to develop coping mechanisms,\" he said.\n\n\"Children of the future are going to have to manage and deal with natural disasters.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/airline-qantas-profit-up-28-per-cent-strong-travel-demand/105705262",
    "title": "Qantas profit leaps 28 per cent to $1.6 billion",
    "publish_date": "Wed, 27 Aug 2025 23:05:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Qantas has reported a 28 per cent rise in net profit to $1.6 billion in the last financial year.\n\nThe airline's revenue rose 8.6 per cent, while its underlying profit came in just ahead of market expectations.\n\nQantas said \"ongoing strength in travel demand\" supported its domestic and international earnings.\n\nShareholders will receive a final dividend of 16.5 cents a share, as well as a special dividend of 9.9 cents a share.\n\nPenalties for unlawful conduct\n\nQantas has also paid significant penalties for various breaches of the law.\n\nLast week, it was ordered to pay a record $90 million penalty for its illegal outsourcing of ground handling work during the pandemic, on top of $120 million compensation to former employees that it had unlawfully sacked.\n\nWhile it will pay the Federal Court penalty in the current 2026 financial year, Qantas said it increased its provisions in financial year 2025 to account for the fine.\n\nQantas also agreed to pay a $100 million penalty last year in relation to its so-called \"ghost flights\" scandal.\n\nEssentially, the Australian Competition and Consumer Commission (ACCC) sued the airline for misleading consumers by selling tickets to flights that had already been cancelled.\n\nAging fleet\n\nThe airline also gave an update on its latest progress on renewing its aging fleet — an additional 20 Airbus A321XLRs were ordered, with passenger flights on that model to begin in mid-September on Qantas's domestic network.\n\nOverall, Qantas said it has 214 aircraft on firm order across the group, including Jetstar, with one arriving every three weeks, on average, across the next two years.\n\nThe aircraft that will be used for its \"Project Sunrise\" ultra-long haul flights are scheduled to reach the final assembly stage in October 2025, with first delivery scheduled for October 2026 to enable direct flights from Australia's east coast to New York and Europe.\n\nQantas's results were better than the market had expected.\n\nThis led to its share price jumping 11.4 per cent to $12.45, by 10:25am AEST.\n\nLooking further back, Qantas's shares have surged in value as the aviation industry bounced back from the COVID-19 pandemic.\n\nIts shares have risen 35 per cent since the year began, and have almost tripled over the past five years.",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/nicola-olyslagers-wins-high-jump-diamond-league-in-zurich/105706212",
    "title": "Olyslagers wins latest duel with high jump rival ahead of world champs",
    "publish_date": "Wed, 27 Aug 2025 22:53:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Nicola Olyslagers has enjoyed another triumph in a phenomenal season, winning the high jump gold at the Diamond League event in Zurich with an Australian and Oceanian record.\n\nThe two-time Olympic silver medallist's winning leap of 2.04 metres — the best in the world this year — added a centimetre to her national and continental record.\n\nIt also comes just a fortnight before she tries to add her first outdoor world title in Tokyo to the indoor crown she won in March.\n\n\"I've been trying to get that height for a few years now — and today I got the Diamond trophy on top — what a day,\" the Central Coast athlete said.\n\nHow world champ Olyslagers stays motivated Photo shows Nicola Olyslagers celebrates with the Australian flag at the Paris Olympics. Nicola Olyslagers reveals how she has avoided a dip in motivation, as she targets winning the high jump at this year's World Athletics Championships in Tokyo.\n\n\"It's very special. I didn't ever imagine when I was a child that I would get to this height. I had this peace inside my heart and I'm still discovering what's possible for me.\"\n\nThe 28-year-old was all smiles as she once again out-duelled Ukrainian world record holder and Olympic champion, Yaroslava Mahuchikh, who equalled her season's best with a 2.02m leap but still succumbed to Olyslagers for the fourth time in this campaign.\n\nOlyslagers is only the third Australian woman — after hurdler Sally Pearson (2017) and pole vaulter Nina Kennedy (2022, 2024) — and seventh Aussie athlete in all to win a Diamond League title, adding to wins in Stockholm, Paris and Lausanne.\n\nLike Kennedy last year, she found her best form in Zurich's main Sechselautenplatz square in the shadow of the city's opera house, on the first of two days of competition before the track action moves to the Letzigrund Stadium.\n\nShe seemed inspired from the start, clearing six heights without a failure, topped by her 2.04m leap, which bettered her previous best of 2.03, which she first set in Eugene in September 2023.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nMahuchikh had a chance to snatch victory after Olyslagers failed three times at 2.06m, but the Ukrainian could not get over either.\n\nIt is the eighth time they have faced off this season, sharing the podium all but once, when Mahuchikh failed to clear a height in pouring rain at the Lausanne Diamond League event, where Olyslagers claimed silver last week.\n\n\"It was so nice having Yaroslava jump with me the whole way,\" Olyslagers said.\n\n\"Jumping with her is one of my favourite things in the world, so having her and me really go for it was wonderful.\n\n\"I think I have some notes of what I need to change in order to go higher.\n\n\"The 2.04m was 10 out of 10, but I still need to work on my run in the last three steps.\"\n\nOlyslagers's Australian teammate Eleanor Patterson finished last of the six finalists, clearing 1.91m.\n\nLiam Adcock finished his debut Diamond League season with long jump bronze. (AP: Til Buergy/Keystone)\n\nLater, world indoor medallist Liam Adcock leapt to third place in the long jump, with a last-round best of 8.24m.\n\nThe 29-year-old Brisbane jumper finished just 8 centimetres behind local hero Simon Ehammer, who delighted the crowd with his third-round 8.32m winner, which just pipped Italian Mattia Furlani's 8.30m.\n\nArmand Duplantis, who took the pole vault crown as usual, was still smiling even though way off his best form.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nMondo prevailed on countback after clearing 6m, the same height as Greek Emmanouil Karalis.\n\nWhen told it was his 118th clearance at 6m and above, Duplantis beamed: \"118? Oh, that is really special. I shouldn't take it for granted.\n\n\"Today? Well, I'm a human being. I don't break world records every day. There are days when I feel decent and days when I feel bad. Today I felt somewhere in between.\"\n\nAustralian Kurtis Marschall had to settle for fourth with 5.65m.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/elective-surgery-waitlist-frustrates-wa-patients/105703036",
    "title": "'It can't go on like this': Couple frustrated over cancelled surgery",
    "publish_date": "Wed, 27 Aug 2025 22:32:32 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Debby Butler was about to board a flight to Perth for long-awaited surgery when she received a call from the hospital to say the operation had been indefinitely postponed.\n\nIt was a huge blow to the 62-year-old, who has been in a wheelchair for months waiting for a double hip replacement.\n\nIt was the second time in weeks that the surgery had been delayed.\n\nDeb Butler is awaiting a double hip replacement. (ABC Great Southern: Andrew Chounding)\n\nMs Butler had checked in on Tuesday with the help of staff at Albany airport for her flight to Perth that, fortunately, was delayed.\n\n\"Between checking in and the flight leaving, I received a phone call from Royal Perth saying my surgery was cancelled,\" she said.\n\nMs Butler called her husband, Andy Wood, who had left home 450 kilometres south-east of Perth before dawn to reach the airport with her wheelchair in time for the flight to arrive.\n\nHe had taken time off work, and the pair had planned their lives around the surgery.\n\nAndy Wood has cared for Debby Butler while she waits for her surgery. (ABC Great Southern: Andrew Chounding)\n\nThe first operation was booked for July but was postponed amid dozens of elective surgery cancellations across WA.\n\n\"No reason was given for the cancellation on Tuesday,\" Ms Butler said.\n\n\"I've heard about surgeries being cancelled because of people with flu [taking up beds].\"\n\nHealth deteriorates\n\nThe past year has been tough for Ms Butler, who has gone from easily walking five to 10 kilometres to relying on a wheelchair and walking frame.\n\n\"I've been waiting for a double hip replacement for about six months, and I suffer from arthritis,\" she said.\n\n\"It takes away from my quality of life.\n\nDebby Butler's surgery has been cancelled twice. (ABC Great Southern: Andrew Chounding)\n\n\" I've gone from being able to walk to being in a wheelchair or walker. I can no longer walk … now I'm struggling to even have a shower. \"\n\nMs Butler had to avoid catching the flu or COVID after her surgery in July was postponed because that would further push back the procedure.\n\nIt has been a similar story for others on Western Australia's elective surgery waitlist with 80 operations cancelled earlier this month due to what the government said was a surge in demand.\n\nMs Butler said it was not only frustrating for her but people who had helped the couple prepare for the surgery.\n\n\"You get to the stage of not believing you're going to have surgery,\" she said.\n\n\"They need to increase the number of beds in hospitals.\"\n\nAndy Wood says the government should spend more on the state's health system. (ABC Great Southern: Andrew Chounding)\n\nEarlier this month, WA Premier Roger Cook announced a $50 million Health Infrastructure Maintenance Fund amid mounting pressure on hospitals.\n\nMr Wood said that was too little, too late.\n\nHe said he was irate after his wife called to tell him the surgery was cancelled.\n\n\"We'd booked accommodation for two nights. I had to turn around and drive back home, $250 worth of diesel to drive back on a rainy day,\" he said.\n\nRoger Cook has faced criticism over the government's handling of health funding. (ABC News: Keane Bourke)\n\nMr Wood said that while the Patient Assisted Travel Scheme would cover some costs, it did not cover the stress or time lost for the couple and the friends who had helped them.\n\n\"It can't go on like this,\" he said.\n\nPressure easing\n\nA spokesperson for WA's Department of Health said fewer elective surgeries needed to be rescheduled due to reduced emergency department (ED) demand.\n\n\"We will continue to monitor ED demand and small numbers of non-urgent, category 2 and 3 elective surgeries may need to be rescheduled,\" they said in a statement.\n\n\"We understand waiting for surgeries to be rescheduled can be stressful, and thank the community for their patience.\"\n\nLoading...",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-28/asx-markets-business-news-live-updates/105706132",
    "title": "Live: US shares edge up as Nvidia profit meets expectations",
    "publish_date": "Wed, 27 Aug 2025 21:41:00 +0000",
    "category": "finance",
    "authors": [
      "Michael Janda",
      "Nassim Khadem",
      "Daniel Ziffer",
      "David Chau",
      "David Taylor"
    ],
    "text": "Shareholders of ASX-listed financial services company Sequoia — whose subsidiary advice firm InterPrac channelled clients into the now-collapsed First Guardian and Shield managed investment schemes — have been told the company is working closely with regulators and is trying to help victims with \"possible remedies\" that could help them recoup their retirement savings.\n\nCorporate watchdog ASIC is investigating the collapsed First Guardian Master Fund and Shield Master Fund, which impacted approximately 12,000 investors and led to an estimated $1 billion in losses.\n\nASIC is also suing Equity Trustees Superannuation for its alleged role in the loss of $160 million of retirement savings in the Shield Master Fund.\n\nSequoia's subsidiary InterPrac is currently under investigation by ASIC for the involvement of its authorised representatives, Venture Egg and Reilly Financial, in leading clients into the failed Shield and First Guardian products through lead generation services that involved high-pressure sales tactics.\n\nASIC is investigating several of Interprac's authorised representatives, including Ferras Merhi, who controlled Venture Egg Financial Services and pushed thousands of clients into the First Guardian and Shield funds.\n\nIn releasing its FY25 financial results, Sequoia said it was \"committed to upholding the highest standards of client advice and licensee conduct and continues to work closely with the regulators who are investigating the Shield Master Fund and First Guardian Master Fund\".\n\n\"We empathise with all clients that have been affected by the failure of these funds and urge them to contact InterPrac's salaried advice team, who will assist them regarding their personal situation,\" it said in a statement.\n\n\"We will continue to work closely with the regulators who are investigating this matter and possible remedies to assist affected customers.\"\n\nSequoia had previously disclosed $22 million in complaints against its subsidiary InterPrac had been lodged with the Australian Financial Complaints Authority (AFCA), while also moving to sever ties with advice firms caught up in the scandal.\n\nOn Thursday, the company reported revenue $124.1 million, in line with the previous year. Net profit before tax came in at $5.9 million, compared to a loss after tax of $1.5 million in FY24.\n\nThe group has $18 billion in total funds under advice up from $12.5 billion in FY24.\n\nDo you know more?\n\nIf you have more information about this story please contact Nassim Khadem at khadem.nassim@abc.net.au or nassimkhadem@protonmail.com",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/dennis-reveals-how-much-he-sold-banksys-mobile-lovers-for-20250828-p5mql5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dennis reveals how much he sold Banksy's 'Mobile Lovers' for",
    "publish_date": "Thu, 28 Aug 2025 11:49:08 +1000",
    "category": "finance",
    "authors": [],
    "text": "Dennis reveals how much he sold Banksy's 'Mobile Lovers' for\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/why-this-unlikely-80s-wall-colour-is-your-new-go-to-neutral-20250826-p5mq18.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why this unlikely ’80s wall colour is your new go-to neutral",
    "publish_date": "Thu, 28 Aug 2025 11:44:30 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "Like so many significant design movements, the arrival of soft pink as an interiors trend began with a murmur. Having shed its ’80s associations (who can forget all that pink and grey?), it had spent the rest of the century relegated to the bedrooms of the very young or the hopelessly romantic.\n\nSo when it began to gain traction in the early 2010s as “Millennial Pink”, even seasoned colour forecasters raised an eyebrow.\n\n“Around the millennium, I remember doing the [colour] forecast and it was quite a new entry,” says Dulux colour expert, Andrea Lucena-Orr. “We hadn’t seen pink since the 80s.”\n\nEarthier pink tones have become popular for walls and ceilings, including Different Pink and Savin, both from Dulux. Styling: Bree Leech Credit: Lisa Cohen\n\nEven Pantone, the international paint company and oracle of all things colour, seemed hesitant to give soft pink its moment in the sun, making the unusual decision to announce not one, but two colours, Quartz Pink and Serenity – a periwinkle blue – as the Colour of the Year in 2016.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/anz-email-error-tells-staff-of-exit-date-before-they-knew-they-were-losing-their-jobs-20250828-p5mqj6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ANZ email error tells staff of ‘exit date’ before they knew they were losing their jobs",
    "publish_date": "Thu, 28 Aug 2025 11:40:41 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "ANZ Bank has suffered an embarrassing email error, accidentally informing some staff members who were to be made redundant about the process for returning their laptops before the affected people had been told they were losing their jobs.\n\nThe acting group executive in charge of ANZ’s retail business, Bruce Rush, on Wednesday wrote to staff to apologise after automated emails were sent to some senior managers in the division “ahead of schedule.”\n\nANZ said it had apologised unconditionally for the email error. Credit: Will Willitts\n\nThe automated emails in question informed affected staff – who were running substantial teams within the retail bank – about what to do with bank-owned technology, such as laptops.\n\n“Unfortunately, these emails indicate an exit date for some of our colleagues before we’ve been able to share their outcome with them,” Rush wrote.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-round-26-20250824-p5mpdo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Josh Papalii signs extension to stay with Raiders",
    "publish_date": "Thu, 28 Aug 2025 11:40:29 +1000",
    "category": "sports",
    "authors": [
      "Michael Chammas",
      "Adrian Proszenko"
    ],
    "text": "The Cowboys and Eels are among the clubs that have expressed an interest in acquiring Moale’s services. The Cook Islands international has made 70 first-grade appearances since making his NRL debut in 2021, but a wrist injury suffered in July has prevented him from adding to the tally. Davvy Moale is poised to leave South Sydney. Credit: Getty Images Ironically, Moale could be on the move at a time when the Rabbitohs are already short on middle forwards. The decision to let him go could result in the “Pride of the League” freeing up the salary cap funds required to make an offer to enigmatic Titan David Fifita, although his availability may change now that Josh Hannay has been appointed as head coach. Souths are also trying to move unwanted halfback Lewis Dodd from the final two years of his deal. The club is prepared to tip in $500,000 in a bid to make him attractive to suitors, although there hasn’t been any interest at this stage. Former Sports Integrity boss appointed as general manager of Perth Bears\n\nMichael Chammas Former Sports Integrity boss David Sharpe has been appointed as the inaugural general manager of football for the Perth Bears. Sharpe will work alongside head coach Mal Meninga and chief executive Anthony De Ceglie as the club prepares to enter the NRL as the 18th team in 2027. David Sharpe has been appointed as the Perth Bears general manager of football. Credit: Alex Ellinghausen Sharpe has been a prominent figure in Australian sport for a long time, having formerly served as the CEO of Sport Integrity Australia (SIA) and the Australian Sports Anti-Doping Authority (ASADA).\n\nHe most recently helped spearhead a SIA review that found gymnasts were abused at the WA Institute of Sport. Sharpe said he was excited to begin his career in rugby league. “I’m honoured to be part of what Anthony and Mal are building because the Perth Bears will put fans and community at the heart of every decision - and that means integrity is a priority,” he said. “The game of rugby league has given me and my family so much and now it’s time to give back.” Head coach Mal Meninga said it was a crucial appointment for the new club.\n\n“I am excited to work alongside David and continue our long association within the sporting sector,” he said. “I know David is looking forward to this challenge, but I also know his values, integrity and experience will help us establish a best-in-class organisation.” Raiders star ruled out for finals after suffering fractured shoulder The Raiders have been dealt a blow ahead of their finals campaign, with winger Xavier Savage ruled out for the rest of the 2025 season. Scans have revealed Savage fractured his shoulder during the Raiders 20-16 victory against the Panthers on Friday which has been dubbed the ‘Miracle in Mudgee’ after Canberra scored an unbelievable 95th minute try to win in golden point.\n\nXavier Savage picks up an injury in the first half. Credit: Getty Images Savage will meet with a surgeon this week to find out the extent of the injury and assess whether he will need surgery; however, Canberra confirmed he was no chance of playing finals football. The 23-year-old speedster suffered the injury mid-way through the first half after being tackled by Luke Garner, Blaize Talagi and Isaiah Papali’i while bringing the ball back from a kick return. Savage played the final 16 minutes of the first half following the collision, but failed to return after half-time. The 23-year-old absence for the rest of the season is a massive blow for the club, who have all but wrapped up the 2025 minor premiership. He has scored 12 tries for the Raiders this season.\n\nThe Raiders face the Wests Tigers in Canberra this weekend, before closing out their season against the Dolphins in Redcliffe next week. ‘I’d love to prove people wrong’: Could Josh Addo-Carr make a shock Roos return? Christian Nicolussi Josh Addo-Carr had three goals at the start of the year: lose weight, return to the NSW Origin team and reclaim his Kangaroos jersey. He has dropped from 97kg to 90kg, missed out on playing for the Blues, but is now making a late-season push to get back on Kevin Walters’ Roos radar.\n\nThe 30-year-old is an outsider to be on the Kangaroo tour in October and November, but his past achievements in the green and gold (he has scored 13 tries for Australia), his on-field chemistry with potential left centre Latrell Mitchell and experience with likely five-eighth Cameron Munster mean he should be in the conversation. As he celebrates 200 NRL games on Friday when the Eels try to continue their nuisance value against the finals-bound New Zealand Warriors, Addo-Carr hopes he has not become the forgotten man for the Kangaroos. Eels teammate Mitchell Moses is also keen to be on the Ashes tour in a squad that will likely include Nathan Cleary, Munster and Tom Dearden. “I sat down at the start of the year and wrote down some goals, which was losing weight – I’ve done that – another one was to make Origin, and the third one was to make the Kangaroos squad,” Addo-Carr said.\n\nJosh Addo-Carr has been back to his brilliant best at times in 2025. Credit: Getty Images “You want to represent your family, and when you play for the Kangaroos, it’s the pinnacle. It means you’re one of the best players in the world in your position, and you’re playing with the best in the world. It’s such a great honour. “I played in England in the World Cup [in 2021], and I haven’t played since. I’d love to be a part of it, as long as I can bring value to the team, on and off the field. It is a long trip over there, so if Kevvie needs me, I’ll put my hand up. “I’ve got that chemistry with Munster – he’s probably the best player I’ve ever played with. Looking back at the combination we had on that left edge when I was back at the Storm, it’s something I still think about, and he’s a close friend of mine as well. To have an opportunity to play with ‘Trell’ [Mitchell] as well, it would be mad. “I’d love to prove people wrong. That’s what I want to do.”\n\nBrian To’o and Zac Lomax were the starting wingers for NSW during the State of Origin series, but To’o will play for Samoa. Queensland winger Valentine Holmes is out injured, while Hamiso Tabuai-Fidow and Xavier Coates – arguably the best finisher in the game – remain a chance of playing for Samoa and Papua New Guinea respectively. Canterbury’s Jacob Kiraz, Roosters flyer Mark Nawaqanitawase and even Manly’s Tom Trbojevic would all be in the mix for a place on the wing. Addo-Carr was thrown a lifeline by Parramatta after parting ways with Canterbury last year. The Bulldogs ripped up the final year of his $500,000-a-season contract after he returned a positive result to cocaine at a roadside police drugs test in September. Moses is also keen to book a ticket to England. The Eels skipper was at his attacking best in the shock win over the Roosters on the weekend.\n\n“I played last year; it’s the highest honour you can get – we took out the Pacific Champs – and to play with the best in the game, and rub shoulders with them, and take little things out of their game, it only helps my game,” Moses said. “Any time you get into those camps, it’s the best ever. To pull on the Australian jersey, there’s no better feeling.” Dark horses: Broncos blitz Knights to mount top-four push Brisbane coach Michael Maguire has refused to be drawn into the growing influence of Reece Walsh following the fullback’s starring role in the Broncos’ 46-12 win over Newcastle. A six-try second half performance led by Walsh confirmed Brisbane’s place in the NRL finals, as they distanced themselves from the logjam of teams in the middle of the competition ladder with Sunday’s victory at McDonald Jones Stadium.\n\nWalsh overcame several early errors to help Brisbane kick away late, finishing the game with two try assists, 12 tackle breaks and a silky 70-metre solo try to confirm the result. With Brisbane well and truly in the fight for a potential top-four berth heading into the final fortnight of the regular season, Maguire restricted his praise to the team as a whole. “Reece makes up a part of the team that builds up the success that we have, and I’d rather talk about how the team is performing,” Maguire said. “We’re really focused on building who we are. I’ve seen a shift in how the players have gone about what they’re doing and it’s a credit to them for stepping up to a level that I believe we need to get to. It was a bit clunky at times, but it was pleasing to get through the end of the game with the opportunities they did.” Reece Walsh makes a break for the Broncos. Credit: Getty Images\n\nWith the game in the balance at 20-12 into the final 20 minutes, a likely try to Newcastle five-eighth Jake Arthur was butchered and proved the impetus for a flood of Broncos points. Payne Haas had the ball rolling soon after, before Walsh’s long-range effort put the game beyond doubt. On a day that their opposition typically fear playing in, Newcastle’s Old Boys’ Day proved to be forgettable for the Knights with tries to Gehamat Shibasaki, Jordan Riki and a second for Deine Mariner coming in the final 10 minutes. Newcastle’s seventh straight loss – and their 10th defeat in their last 11 home games – has ensured they remain in the battle to avoid the dreaded wooden spoon. “The last couple of weeks has tested us, clearly. But they have pride in the jersey,” Newcastle coach Adam O’Brien said. “Nobody feels the losses more than the playing group. Losing weighs heavily on them. They love playing for their club and their teammates, and they’ll want to go out and perform.\n\n“Some people won’t see it that way given the scoreline … but these times won’t last so long as we maintain that desire to perform.” In his 350th NRL game – where he joined Canterbury legend Terry Lamb and long-time Queensland Origin teammate Daly Cherry-Evans as the fourth-most capped player in Australian rugby league history – veteran playmaker Ben Hunt orchestrated an early flurry for Brisbane. Loading Three minutes was all it took for them to score, with Hunt providing a timely offload for his centre Kotoni Staggs to crash over. The visitors doubled down five minutes later when Josiah Karapani iced a long range shift out wide that started from the hands of the milestone man yet again.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/victoria/afl-legend-nicky-winmar-fronts-court-on-assault-choking-charges-20250828-p5mqko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL legend Nicky Winmar fronts court on assault, choking charges",
    "publish_date": "Thu, 28 Aug 2025 11:39:41 +1000",
    "category": "sports",
    "authors": [
      "Tara Cosoleto"
    ],
    "text": "AFL great Nicky Winmar has appeared in court, a month after he was charged with intentionally choking a person.\n\nThe former St Kilda star only spoke briefly to say good morning and thank you to the magistrate as his case was adjourned on Thursday.\n\nFormer AFL player Nicky Winmar leaves the Melbourne Magistrates Court following a brief mention on Thursday. Credit: AAP\n\nWinmar, whose legal first name is Neil, was in July charged with committing two assaults and intentionally choking, strangling or suffocating a person.\n\nThe three incidents all allegedly happened on July 18, charge sheets state.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/dennis-receives-a-letter-from-banksy-20250828-p5mqkz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dennis receives a letter from Banksy",
    "publish_date": "Thu, 28 Aug 2025 11:39:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Dennis receives a letter from Banksy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/australian-qualifier-stuns-top-20-rival-to-reach-last-32-at-us-open-20250828-p5mqis.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian qualifier stuns top-20 rival to reach last 32 at US Open",
    "publish_date": "Thu, 28 Aug 2025 11:38:26 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "Priscilla Hon tried to tell us.\n\nSpeaking after qualifying at Wimbledon two months ago, Hon – who, at age 27, has never been ranked higher than No.118 in the world, and is eight places lower than that now – told this masthead that she believed she could be a top-30 player.\n\nThere wasn’t much evidence, as far as results, to suggest it was anything but fanciful thinking. Until now.\n\nPriscilla Hon is in uncharted territory at the US Open. Credit: Getty Images\n\nThe Australian qualifier is celebrating her greatest moment after bouncing powerful Russian top-20 star Liudmila Samsonova out of the US Open in a stunning 4-6, 6-3, 6-2 upset that advances her to the round of 32 at a grand slam for the first time.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-camila-cabello-20250827-p5mqe7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Too much bass and not enough spectacle make this a shaky reinvention",
    "publish_date": "Thu, 28 Aug 2025 11:37:17 +1000",
    "category": "entertainment",
    "authors": [
      "Nell Geraets"
    ],
    "text": "Some in the crowd are more easily convinced, however, with one fan continuously gushing that Cabello “knows what’s up” while sassily snapping their fingers. The energy in the arena only properly heats up once Cabello returns to the tracks most of her fans fell in love with her for – the upbeat Latin flare of Bam Bam and the sultry salsa-inspired sound of Havana. Here, the crowd heaves with excitement, everyone swaying their hips in almost perfect unison. Camila Cabello hasn’t performed in Australia since opening for Taylor Swift during the Reputation Tour. Credit: Richard Clifford It’s during these moments, when Cabello essentially has the crowd eating from her hand, that she herself appears to have the most fun. During the nu-disco pop track Quiet, she even implores the audience to go completely silent – a rare feat for an arena gig – before ramping their cheers up again at her own command. “I’ve stuffed my face with Tim Tams. I’ve even done a Tim Tam slam. I hope we return to Australia. We flew our butts all the way over here, and you’ve been the best crowd ever. You’ve been better than the best – you’ve been supersonic,” Cabello says, before seamlessly launching into I Luv It.\n\nCabello has said her new era is about embracing transformation and change. Yet, the best parts of her tour are when she reverts to the very sound that earned her multiple Grammy nominations back in 2019. Ultimately, Cabello has more sway than swagger, but perhaps we need to accept she’ll “never be the same” as before.\n\nReviewed by Nell Geraets DANCE\n\nScenarios and Copy of the Copy ★★★★\n\nDancehouse, Carlton, until August 30 Both works currently showing at Dancehouse circle around problems of replication and imitation. These are enduring fascinations for choreographers but what makes this evening interesting is the contrast: one work meditates on sameness, while the other insists on difference. Scenarios is playful but also intimate. Credit: Takeshi Kondo Scenarios, created and performed by Benjamin Hurley and Scott Elstermann, plays like a queer duet of self-fascination. Each performs as if the other were a mirror, a copy with no original, doubling gestures until resemblance tips into a kind of dreamy hallucination.\n\nTheir shared identity is really a shared sensibility. A kind of rococo dandyism in duplicate. Movements are upright, measured and immaculately shaped. It’s disciplined dancing, with obsessively worked symmetries, synchronicities and long phrases that develop with tricky vocalisations. They cycle through many images or scenarios. A well-chosen text hints at the thrill of seeing yourself as another, while a darker vignette evokes the doppelgänger bent on self-annihilation. Yet the mood remains playful – even a little screwy – throughout these transformations. Copy of the Copy is interested in the way dance passes from body to body, teacher to pupil. Credit: Tiffany Garvie It’s cute but also intimate. In the end, the audience itself becomes a reflective medium, placed before the twins like one of the mirrors that organise the space, as if their doubled identities require us to be the final surface in which their resemblance is registered. Priya Srinivasan, by contrast, in Copy of the Copy, is less concerned with uncanny reflections than with the way dance passes from body to body, teacher to pupil. In that transfer, copies are never exact: something is lost and something else is gained.\n\nHer work is resolutely theatrical, combining dance, video, audience interaction and even a little cooking. The registers are also multiple – comic, earnest, scholarly, confessional – and they continually shift. The effect is of a layered inquiry, staging transmission itself as a complex, unstable process. Loading Central to the performance is Srinivasan’s own dance lineage: her teachers and the teachers who taught them. As the work culminates, however, we get a more expansive mapping of connections, a deliberately overwhelming series of names stretching from the present to the late eighteenth century, crisscrossing continents, empires and colonies. As the names pile up, distinctions blur: which connections were fleeting encounters and which were nurtured over many years? Yes, we get a sense of the density of intercultural traffic, but the concept of the copy becomes a little vague and underdefined. Finally, while there’s plenty to think about in this production, its success as spectacle rests squarely with the musicians – Hari Sivanesan, Pirashanna Thevarajah, and Ranjitha Suresh – whose live presence alongside Srinivasan gives the work its special vitality.\n\nReviewed by Andrew Fuhrmann",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/manchester-united-humiliated-in-marathon-penalty-shootout-loss-to-grimsby-town-20250828-p5mqgx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This is the picture that spells the end for Ruben Amorim at Manchester United",
    "publish_date": "Thu, 28 Aug 2025 11:23:58 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "They say a picture says a thousand words. Sometimes, those words are the truth. Sometimes they’re lies. Sometimes they’re both, somehow, at the same time.\n\nIt might not be this result that does in Ruben Amorim. It might be the image of him fiddling around with magnets, desperately searching for an answer as Manchester United trailed 2-0 in Thursday morning’s (AEST) Carabao Cup clash against fourth-tier side Grimsby Town, with half an hour still to play.\n\nRuben Amorim was looking for solutions in the wrong place in the 62nd minute. Credit: X/Twitter\n\nThough United recovered to equalise at 2-2, they lost the subsequent penalty shootout 12-11 after new signing Bryan Mbuemo missed his second spot kick, sending them tumbling out of the tournament in the second round - the most embarrassing result in the club’s proud modern history.\n\nThe screengrab has gone viral. As has a photoshopped variation of it, replacing Amorim’s magnet board with a folio of Panini stickers. So, too, did another picture of him cowering in the dugout, staring at the ground, refusing to watch the penalty shootout, which has been compared to Steve McClaren’s infamous “Wally with a Brolly” moment - when the then-England manager was ridiculed in 2007 when a defeat to Croatia ended their hopes of qualifying for the next year’s Euros, watching the carnage unfold in pouring rain at Wembley Stadium beneath an umbrella. A picture of him in the Daily Mail, accompanied by the aforementioned headline, has stuck to his reputation ever since.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/2nd-round-highlights-mirra-andreeva-v-anastasia-potapova-20250828-p5mqkf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2nd Round Highlights | Mirra Andreeva v Anastasia Potapova",
    "publish_date": "Thu, 28 Aug 2025 11:23:09 +1000",
    "category": "finance",
    "authors": [],
    "text": "2nd Round Highlights | Mirra Andreeva v Anastasia Potapova\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/afl/blues-close-in-on-replacement-for-football-boss-lloyd-20250828-p5mqjy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blues close in on replacement for football boss Lloyd",
    "publish_date": "Thu, 28 Aug 2025 11:22:53 +1000",
    "category": "sports",
    "authors": [
      "Sam Mcclure"
    ],
    "text": "Carlton are closing in on Port Adelaide’s Chris Davies to be the club’s next football boss.\n\nTwo club sources confirmed to this masthead on Thursday that Carlton have held informal discussions with Davies and have made it clear he is their No.1 priority to replace outgoing head of football Brad Lloyd.\n\nPort Adelaide footy boss Chris Davies. Credit: David Mariuz\n\nDavies is understood to be considering his options after a disappointing year at Port. The Power slumped to a 13th-place finish in Ken Hinkley’s final year as coach following a preliminary final appearance in 2024.\n\nDavies, a close friend and ally of Hinkley, is viewed as one of the premier football bosses in the competition and would be a significant coup for the Blues, who are in the middle of significant change under new CEO Graham Wright.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/2nd-round-highlights-priscilla-hon-v-liudmila-samsonova-20250828-p5mqkg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2nd Round Highlights | Priscilla Hon v Liudmila Samsonova",
    "publish_date": "Thu, 28 Aug 2025 11:21:32 +1000",
    "category": "sports",
    "authors": [],
    "text": "2nd Round Highlights | Priscilla Hon v Liudmila Samsonova\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/bob-katter-threatens-to-punch-reporter-20250828-p5mqkj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bob Katter threatens to punch reporter",
    "publish_date": "Thu, 28 Aug 2025 11:20:06 +1000",
    "category": "finance",
    "authors": [],
    "text": "Bob Katter threatens to punch reporter\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Thu, 28 Aug 2025 11:17:40 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-inch-up-wall-street-advances-ahead-of-nvidia-results-20250828-p5mqg5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX edges lower on bumper results day; Qantas soars",
    "publish_date": "Thu, 28 Aug 2025 11:16:23 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket has made a flat start to the session on a busy day of results, even as Qantas shares soared after the airline posted its second-highest profit on record.\n\nThe S&P/ASX 200 was 3 points or less than 0.1 per cent, lower at 8957.50 as of 11.13am AEST, with five of its 11 industry sectors in the red, led by energy and tech stocks. Industrials and retailers rose, buoyed by the Qantas and Wesfarmers results.\n\nIt is a bumper day of results for investors to digest. Credit: Oscar Colman\n\nQantas rallied 12.7 per cent to $12.52, an all-time high, as net profits jumped 28 per cent to $1.61 billion in the year to June 30, the airline’s highest profit since its record result in 2023, helped by strong travel demand. Underlying earnings reached $2.39 billion, the carrier said on Thursday morning, largely in line with analyst forecasts.\n\nThe airline declared a final dividend of 16.5¢ a share and said it would also pay shareholders a special dividend of 9.9¢.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/new-possibilites-qantas-posts-1-6-billion-profit-as-ceo-touts-expanded-asia-routes/ep5uojau9",
    "title": "'New possibilities': Qantas posts $1.6 billion profit as CEO touts expanded Asia routes",
    "publish_date": "Thu, 28 Aug 2025 01:33:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Qantas has ordered another 20 Airbus A321XLR jets after making $1.6 billion in full-year profit, up 28 per cent from a year ago.\n\n\n\n\n\nThe airline posted a bottom-line net profit of $1.6 billion in the last financial year, up 28.3 per cent from a year ago.\n\n\n\n\n\nIts underlying pre-tax profit rose 15 per cent to $2.4 billion.\n\n\n\n\n\nRevenue grew 8.6 per cent to $23.8 billion, thanks to growth in its international operations and strong demand for domestic business and leisure travel.\n\n\n\nThe airline will order another 20 Airbus A321XLR aircraft which will start arriving in 2028, taking its total order for the next-generation planes to 48 aircraft.\n\n\n\n\n\nThe jets have a range of 8,700km, around 3,000km more than the Boeing 737 it replaces, and will allow Qantas to launch flights to destinations across Southeast Asia and the Pacific islands that aren't currently viable.\n\n\n\n\n\n\"Not only will the A321XLRs help us serve the corporate market travelling between Perth and the east coast of Australia, they will also allow us to expand flying on existing routes into South East Asia and open up new possibilities like Perth-India and Adelaide-Singapore,\" Qantas CEO Vanessa Hudson said.\n\n\n\nQantas' first two A321XLRs, configured for domestic and short-haul international trips, are expected to begin flying in mid-September on the Sydney-Melbourne and Sydney-Perth routes.\n\n\n\n\n\n\"Investing in new aircraft is one of the most significant ways that we can provide our customers with a better flying experience, and these billion-dollar investments are possible because of our continued strong financial performance,\" Hudson said.\n\n\n\n\n\nQantas will pay investors a final dividend of 16.5 cent per share as well as a special dividend of 9.9 cents per share.\n\n\n\n\n\nEarlier this month, Qantas was ordered to pay a $90 million penalty for what was has been dubbed the largest case of illegal sackings in the country's history.\n\n\n\n\n\nQantas outsourced more than 1,800 baggage handlers, cleaners and ground staff in 2020, in a move the Federal Court ruled was designed to curb union bargaining power in wage negotiations\n\n\n\n",
    "source": "SBS",
    "cluster_id": 1
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-the-latest-jump-in-inflation-figures-could-mean-for-borrowers/4avbrqyvs",
    "title": "'Hotter than expected': What the latest jump in inflation figures could mean for borrowers",
    "publish_date": "Wed, 27 Aug 2025 19:37:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Monthly inflation figures rose more than many economists had predicted, leading to mixed predictions over whether the Reserve Bank of Australia (RBA) will continue cutting the official cash rate at its next meeting, or keep it on hold at 3.6 per cent.\n\n\n\n\n\nThe monthly consumer price index (CPI) rose 2.8 per cent in the 12 months to July, up from 1.9 per cent in the year to June, the Australian Bureau of Statistics (ABS) reported on Wednesday.\n\n\n\n\n\nIt marks the highest annual inflation rate since July 2024, following several months of easing inflation, the ABS said.\n\n\n\n\n\nA Reuters poll of economists had predicted annualised inflation would only rise to 2.3 per cent.\n\n\n\n\n\nThe ABS attributed much of the jump to surging electricity prices, which rose 13.1 per cent in the 12 months to July, compared to a 6.3 per cent fall in the 12 months to June.\n\n\n\nInflation posted a resurgence in July, with consumer prices rising 2.8 per cent annually, according to figures from the Australian Bureau of Statistics. Source: SBS News \"The large annual rise in electricity costs was due to households using up the state government and Commonwealth energy bill relief fund rebates in some capital cities, as well as price increases following annual electricity price reviews in July,\" the ABS said in a statement.\n\n\n\n\n\nIn monthly terms, electricity prices rose 13 per cent in July, which the ABS said was down to the timing of when the extended relief fund rebates were applied in some capital cities, as well as price reviews that increased electricity prices across all capital cities.\n\n\n\n\n\nNAB senior markets economist Taylor Nugent said the inflation release would tell the RBA little about the underlying pulse of inflation.\n\n\n\n\n\n\"The surprise was strength in travel and timing of electricity subsidy payments and so [it] is not as material as it looks at face value,\" he said.\n\n\n\nREAD MORE What the RBA's interest rate decision means for your mortgage\n\nEven so, it raises the risk that the all-important trimmed mean — a measure of underlying inflation that removes the biggest price swings — for the September quarter comes in above the central bank's forecast, he said.\n\n\n\nWhat do inflation figures mean for borrowers?\n\nBetaShares chief economist David Bassanese said the figures were \"an absolute shocker\" and likely to \"remove any chance\" of an interest rate cut at the central bank's next meeting in September.\n\n\n\n\n\n\"The biggest disappointment is the fact that annual trimmed inflation has rebounded from an encouragingly low 2.1 per cent in June to an ugly 2.7 per cent in July,\" Bassanese wrote.\n\n\n\n\n\nHe also cast doubt on whether the RBA would even cut rates in November, saying it's not a \"done deal\", because a decline in underlying inflation may not be \"as great as we've been led to believe\".\n\n\n\n\n\nIG Market analyst Tony Sycamore told SBS News the inflation figures \"came in much hotter than expected\", but they are unlikely to change the RBA's long-term forecasts.\n\n\n\n\n\n\"They were looking for core CPI to be at 2.6 per cent for December 2025 and here we are now 2.7 per cent with about five months left to go for the year,\" he said.\n\n\n\nSycamore said borrowers should be looking at the market's prediction for interest rates.\n\n\n\n\n\n\"Before the inflation figures came out, the market was pricing at about a 40 to 43 per cent chance of a rate cut in September. Most of the economists out there would have been very surprised if the RBA were to cut rates in September, because we know they are cautious rate cutters,\" he said.\n\n\n\n\n\nHe said it's not surprising that the market is predicting the RBA will keep the cash rate on hold in September, but borrowers should take note that the market is \"100 per cent dialled in\" for a cut in November.\n\n\n\n\n\nSycamore said electricity prices should level out in the next month and inflation could steady. The RBA will be placing more emphasis on quarterly trimmed mean figures due in October.\n\n\n\nIn its latest meeting minutes released on Tuesday, the central bank's board expected the unwinding of energy rebates would boost the headline inflation rate over 2025 and 2026 .\n\n\n\n\n\nHowever, it was unclear what could further drive core inflation down, HSBC chief economist Paul Bloxham said.\n\n\n\n\n\nUnemployment was low and steady, capacity utilisation was above its historical average and the economy was still being hamstrung by weak productivity.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/former-afl-player-mitch-brown-reveals-he-is-bisexual/v0hbe7x0w",
    "title": "'Strong and comfortable': Mitch Brown becomes first AFL player to come out as bisexual",
    "publish_date": "Wed, 27 Aug 2025 11:50:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "Knowing exactly how hard it can be, Mitch Brown hopes his revelation that he is bisexual will make it easier for others.\n\n\n\n\n\nHe is \"strong and comfortable\" about becoming the first Australian Football League (AFL) player to publicly identify as bisexual, saying it's all about what happens next.\n\n\n\n\n\nBrown also spoke about the culture of \"hyper-masculinity\" in the AFL when he played, saying he heard one West Coast teammate say he'd rather be in a cage of lions than shower with a gay man.\n\n\n\n\n\n\"I played in the AFL for 10 years for the West Coast Eagles and I'm a bisexual man,\" Brown told The Daily Aus.\n\n\n\n\n\nThe declaration from the former Eagles player, whose AFL career finished in 2016, comes at a pivotal moment in the game, with the league determined to stamp out homophobia.\n\n\n\nA succession of AFL bans for homophobic slurs against opponents culminated last week, with Adelaide star Izak Rankine hit with a four-game suspension.\n\n\n\n\n\nThat potentially rules him out for all of the Crows' finals campaign.\n\n\n\n\n\nTwo years ago, then-league chief executive Gillon McLachlan said the first AFL player to reveal he is gay or bisexual would carry a \"burden\".\n\n\n\n\n\n\"I remember those comments, and the conversation in the locker room just exacerbated that fear even more if you're a gay man or a bisexual man sitting in that locker room,\" Brown said.\n\n\n\n\n\n\"I'm in this position strong and comfortable to, as Gil McLachlan says, take the burden. And if someone needed to do it, I'm in the space to do it.\"\n\n\n\n\"I don't believe that this is about me. It's not about Mitch Brown being the first at all. For me, it's about sharing my experience so others can feel seen,\" Brown said.\n\n\n\n\n\nHe said he never felt comfortable during his time at West Coast about revealing his sexuality.\n\n\n\n\n\n\"In the locker room and in the spas, the chats were all geared around 'who did everyone pick up on the weekend'? Or, you know, 'she's pretty hot',\" he said.\n\n\n\n\n\n\"It was never once an opportunity to speak openly or explore your feelings or questions in a safe way.\n\n\n\n\n\n\"I remember two [players] having a conversation around how they would feel having a shower next to a gay man, and one of the players said, 'I'd rather be in a cage full of lions than have a shower next to a gay man'.\"\n\n\n\n\"There's been so many times in my life that I've seen things or heard things and not said anything, in fear of people thinking that I was gay or bisexual,\" Brown said.\n\n\n\n\n\nThe Eagles were quick to praise Brown on Wednesday, posting: \"We love you, Mitch! We're proud of you and how you're living your values to make footy and our society a better place.\"\n\n\n\n\n\nBrown said in the end, his decision to go public was clear-cut.\n\n\n\n\n\n\"It wasn't so much hours (of contemplation). It was a moment in time for me, and it was seconds,\" he said.\n\n\n\n\n\n\"I had this feeling of peace, but more importantly, comfort and confidence.\"\n\n\n\n\"What matters to me most is a sense of change, a movement created where you can be anyone and feel like you can be anyone and be safe in any environment here in Australia,\" Brown said.\n\n\n\n\n\n\"Hopefully this now provides [that] for the second person.\"\n\n\n\n\n\nHe said his current and former partner, who are women, strongly back him and have praised his courage.\n\n\n\n\n\nBrown, 36, played 94 games for the Eagles between 2007 and 2016.\n\n\n\n\n\nHis comments contrast sharply with the AFL Women's, where sexuality has never been an issue and players speak openly about their same-sex relationships.\n\n\n\n\n\nIn 2020, former North Melbourne coach and premiership player Danielle Laidley was outed as transgender.\n\n\n\n\n\nLaidley has since spoken at length about what she has been through.\n\n\n\n\n\nAFL chief executive Andrew Dillon, AFL Players' Association president and Collingwood captain Darcy Moore, and AFLW great Emma Kearney were among the people who applauded Brown for his courage.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-flight-centres-graham-turner-on-airfares-ai-and-flights-to-the-us/f3heo0je5",
    "title": "CEO Series: Flight Centre's Graham Turner on airfares, AI and flights to the US",
    "publish_date": "Wed, 27 Aug 2025 07:57:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/dennis-reveals-how-much-he-sold-banksys-mobile-lovers-for-20250828-p5mql5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dennis reveals how much he sold Banksy's 'Mobile Lovers' for",
    "publish_date": "Thu, 28 Aug 2025 11:49:08 +1000",
    "category": "finance",
    "authors": [],
    "text": "Dennis reveals how much he sold Banksy's 'Mobile Lovers' for\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/why-this-unlikely-80s-wall-colour-is-your-new-go-to-neutral-20250826-p5mq18.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why this unlikely ’80s wall colour is your new go-to neutral",
    "publish_date": "Thu, 28 Aug 2025 11:44:30 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "Like so many significant design movements, the arrival of soft pink as an interiors trend began with a murmur. Having shed its ’80s associations (who can forget all that pink and grey?), it had spent the rest of the century relegated to the bedrooms of the very young or the hopelessly romantic.\n\nSo when it began to gain traction in the early 2010s as “Millennial Pink”, even seasoned colour forecasters raised an eyebrow.\n\n“Around the millennium, I remember doing the [colour] forecast and it was quite a new entry,” says Dulux colour expert, Andrea Lucena-Orr. “We hadn’t seen pink since the 80s.”\n\nEarthier pink tones have become popular for walls and ceilings, including Different Pink and Savin, both from Dulux. Styling: Bree Leech Credit: Lisa Cohen\n\nEven Pantone, the international paint company and oracle of all things colour, seemed hesitant to give soft pink its moment in the sun, making the unusual decision to announce not one, but two colours, Quartz Pink and Serenity – a periwinkle blue – as the Colour of the Year in 2016.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/business/banking-and-finance/anz-email-error-tells-staff-of-exit-date-before-they-knew-they-were-losing-their-jobs-20250828-p5mqj6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ANZ email error tells staff of ‘exit date’ before they knew they were losing their jobs",
    "publish_date": "Thu, 28 Aug 2025 11:40:41 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "ANZ Bank has suffered an embarrassing email error, accidentally informing some staff members who were to be made redundant about the process for returning their laptops before the affected people had been told they were losing their jobs.\n\nThe acting group executive in charge of ANZ’s retail business, Bruce Rush, on Wednesday wrote to staff to apologise after automated emails were sent to some senior managers in the division “ahead of schedule.”\n\nANZ said it had apologised unconditionally for the email error. Credit: Will Willitts\n\nThe automated emails in question informed affected staff – who were running substantial teams within the retail bank – about what to do with bank-owned technology, such as laptops.\n\n“Unfortunately, these emails indicate an exit date for some of our colleagues before we’ve been able to share their outcome with them,” Rush wrote.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-round-26-20250824-p5mpdo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Josh Papalii signs extension to stay with Raiders",
    "publish_date": "Thu, 28 Aug 2025 11:40:29 +1000",
    "category": "sports",
    "authors": [
      "Michael Chammas",
      "Adrian Proszenko"
    ],
    "text": "The Cowboys and Eels are among the clubs that have expressed an interest in acquiring Moale’s services. The Cook Islands international has made 70 first-grade appearances since making his NRL debut in 2021, but a wrist injury suffered in July has prevented him from adding to the tally. Davvy Moale is poised to leave South Sydney. Credit: Getty Images Ironically, Moale could be on the move at a time when the Rabbitohs are already short on middle forwards. The decision to let him go could result in the “Pride of the League” freeing up the salary cap funds required to make an offer to enigmatic Titan David Fifita, although his availability may change now that Josh Hannay has been appointed as head coach. Souths are also trying to move unwanted halfback Lewis Dodd from the final two years of his deal. The club is prepared to tip in $500,000 in a bid to make him attractive to suitors, although there hasn’t been any interest at this stage. Former Sports Integrity boss appointed as general manager of Perth Bears\n\nMichael Chammas Former Sports Integrity boss David Sharpe has been appointed as the inaugural general manager of football for the Perth Bears. Sharpe will work alongside head coach Mal Meninga and chief executive Anthony De Ceglie as the club prepares to enter the NRL as the 18th team in 2027. David Sharpe has been appointed as the Perth Bears general manager of football. Credit: Alex Ellinghausen Sharpe has been a prominent figure in Australian sport for a long time, having formerly served as the CEO of Sport Integrity Australia (SIA) and the Australian Sports Anti-Doping Authority (ASADA).\n\nHe most recently helped spearhead a SIA review that found gymnasts were abused at the WA Institute of Sport. Sharpe said he was excited to begin his career in rugby league. “I’m honoured to be part of what Anthony and Mal are building because the Perth Bears will put fans and community at the heart of every decision - and that means integrity is a priority,” he said. “The game of rugby league has given me and my family so much and now it’s time to give back.” Head coach Mal Meninga said it was a crucial appointment for the new club.\n\n“I am excited to work alongside David and continue our long association within the sporting sector,” he said. “I know David is looking forward to this challenge, but I also know his values, integrity and experience will help us establish a best-in-class organisation.” Raiders star ruled out for finals after suffering fractured shoulder The Raiders have been dealt a blow ahead of their finals campaign, with winger Xavier Savage ruled out for the rest of the 2025 season. Scans have revealed Savage fractured his shoulder during the Raiders 20-16 victory against the Panthers on Friday which has been dubbed the ‘Miracle in Mudgee’ after Canberra scored an unbelievable 95th minute try to win in golden point.\n\nXavier Savage picks up an injury in the first half. Credit: Getty Images Savage will meet with a surgeon this week to find out the extent of the injury and assess whether he will need surgery; however, Canberra confirmed he was no chance of playing finals football. The 23-year-old speedster suffered the injury mid-way through the first half after being tackled by Luke Garner, Blaize Talagi and Isaiah Papali’i while bringing the ball back from a kick return. Savage played the final 16 minutes of the first half following the collision, but failed to return after half-time. The 23-year-old absence for the rest of the season is a massive blow for the club, who have all but wrapped up the 2025 minor premiership. He has scored 12 tries for the Raiders this season.\n\nThe Raiders face the Wests Tigers in Canberra this weekend, before closing out their season against the Dolphins in Redcliffe next week. ‘I’d love to prove people wrong’: Could Josh Addo-Carr make a shock Roos return? Christian Nicolussi Josh Addo-Carr had three goals at the start of the year: lose weight, return to the NSW Origin team and reclaim his Kangaroos jersey. He has dropped from 97kg to 90kg, missed out on playing for the Blues, but is now making a late-season push to get back on Kevin Walters’ Roos radar.\n\nThe 30-year-old is an outsider to be on the Kangaroo tour in October and November, but his past achievements in the green and gold (he has scored 13 tries for Australia), his on-field chemistry with potential left centre Latrell Mitchell and experience with likely five-eighth Cameron Munster mean he should be in the conversation. As he celebrates 200 NRL games on Friday when the Eels try to continue their nuisance value against the finals-bound New Zealand Warriors, Addo-Carr hopes he has not become the forgotten man for the Kangaroos. Eels teammate Mitchell Moses is also keen to be on the Ashes tour in a squad that will likely include Nathan Cleary, Munster and Tom Dearden. “I sat down at the start of the year and wrote down some goals, which was losing weight – I’ve done that – another one was to make Origin, and the third one was to make the Kangaroos squad,” Addo-Carr said.\n\nJosh Addo-Carr has been back to his brilliant best at times in 2025. Credit: Getty Images “You want to represent your family, and when you play for the Kangaroos, it’s the pinnacle. It means you’re one of the best players in the world in your position, and you’re playing with the best in the world. It’s such a great honour. “I played in England in the World Cup [in 2021], and I haven’t played since. I’d love to be a part of it, as long as I can bring value to the team, on and off the field. It is a long trip over there, so if Kevvie needs me, I’ll put my hand up. “I’ve got that chemistry with Munster – he’s probably the best player I’ve ever played with. Looking back at the combination we had on that left edge when I was back at the Storm, it’s something I still think about, and he’s a close friend of mine as well. To have an opportunity to play with ‘Trell’ [Mitchell] as well, it would be mad. “I’d love to prove people wrong. That’s what I want to do.”\n\nBrian To’o and Zac Lomax were the starting wingers for NSW during the State of Origin series, but To’o will play for Samoa. Queensland winger Valentine Holmes is out injured, while Hamiso Tabuai-Fidow and Xavier Coates – arguably the best finisher in the game – remain a chance of playing for Samoa and Papua New Guinea respectively. Canterbury’s Jacob Kiraz, Roosters flyer Mark Nawaqanitawase and even Manly’s Tom Trbojevic would all be in the mix for a place on the wing. Addo-Carr was thrown a lifeline by Parramatta after parting ways with Canterbury last year. The Bulldogs ripped up the final year of his $500,000-a-season contract after he returned a positive result to cocaine at a roadside police drugs test in September. Moses is also keen to book a ticket to England. The Eels skipper was at his attacking best in the shock win over the Roosters on the weekend.\n\n“I played last year; it’s the highest honour you can get – we took out the Pacific Champs – and to play with the best in the game, and rub shoulders with them, and take little things out of their game, it only helps my game,” Moses said. “Any time you get into those camps, it’s the best ever. To pull on the Australian jersey, there’s no better feeling.” Dark horses: Broncos blitz Knights to mount top-four push Brisbane coach Michael Maguire has refused to be drawn into the growing influence of Reece Walsh following the fullback’s starring role in the Broncos’ 46-12 win over Newcastle. A six-try second half performance led by Walsh confirmed Brisbane’s place in the NRL finals, as they distanced themselves from the logjam of teams in the middle of the competition ladder with Sunday’s victory at McDonald Jones Stadium.\n\nWalsh overcame several early errors to help Brisbane kick away late, finishing the game with two try assists, 12 tackle breaks and a silky 70-metre solo try to confirm the result. With Brisbane well and truly in the fight for a potential top-four berth heading into the final fortnight of the regular season, Maguire restricted his praise to the team as a whole. “Reece makes up a part of the team that builds up the success that we have, and I’d rather talk about how the team is performing,” Maguire said. “We’re really focused on building who we are. I’ve seen a shift in how the players have gone about what they’re doing and it’s a credit to them for stepping up to a level that I believe we need to get to. It was a bit clunky at times, but it was pleasing to get through the end of the game with the opportunities they did.” Reece Walsh makes a break for the Broncos. Credit: Getty Images\n\nWith the game in the balance at 20-12 into the final 20 minutes, a likely try to Newcastle five-eighth Jake Arthur was butchered and proved the impetus for a flood of Broncos points. Payne Haas had the ball rolling soon after, before Walsh’s long-range effort put the game beyond doubt. On a day that their opposition typically fear playing in, Newcastle’s Old Boys’ Day proved to be forgettable for the Knights with tries to Gehamat Shibasaki, Jordan Riki and a second for Deine Mariner coming in the final 10 minutes. Newcastle’s seventh straight loss – and their 10th defeat in their last 11 home games – has ensured they remain in the battle to avoid the dreaded wooden spoon. “The last couple of weeks has tested us, clearly. But they have pride in the jersey,” Newcastle coach Adam O’Brien said. “Nobody feels the losses more than the playing group. Losing weighs heavily on them. They love playing for their club and their teammates, and they’ll want to go out and perform.\n\n“Some people won’t see it that way given the scoreline … but these times won’t last so long as we maintain that desire to perform.” In his 350th NRL game – where he joined Canterbury legend Terry Lamb and long-time Queensland Origin teammate Daly Cherry-Evans as the fourth-most capped player in Australian rugby league history – veteran playmaker Ben Hunt orchestrated an early flurry for Brisbane. Loading Three minutes was all it took for them to score, with Hunt providing a timely offload for his centre Kotoni Staggs to crash over. The visitors doubled down five minutes later when Josiah Karapani iced a long range shift out wide that started from the hands of the milestone man yet again.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/victoria/afl-legend-nicky-winmar-fronts-court-on-assault-choking-charges-20250828-p5mqko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL legend Nicky Winmar fronts court on assault, choking charges",
    "publish_date": "Thu, 28 Aug 2025 11:39:41 +1000",
    "category": "sports",
    "authors": [
      "Tara Cosoleto"
    ],
    "text": "AFL great Nicky Winmar has appeared in court, a month after he was charged with intentionally choking a person.\n\nThe former St Kilda star only spoke briefly to say good morning and thank you to the magistrate as his case was adjourned on Thursday.\n\nFormer AFL player Nicky Winmar leaves the Melbourne Magistrates Court following a brief mention on Thursday. Credit: AAP\n\nWinmar, whose legal first name is Neil, was in July charged with committing two assaults and intentionally choking, strangling or suffocating a person.\n\nThe three incidents all allegedly happened on July 18, charge sheets state.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/dennis-receives-a-letter-from-banksy-20250828-p5mqkz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dennis receives a letter from Banksy",
    "publish_date": "Thu, 28 Aug 2025 11:39:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Dennis receives a letter from Banksy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/australian-qualifier-stuns-top-20-rival-to-reach-last-32-at-us-open-20250828-p5mqis.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian qualifier stuns top-20 rival to reach last 32 at US Open",
    "publish_date": "Thu, 28 Aug 2025 11:38:26 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "Priscilla Hon tried to tell us.\n\nSpeaking after qualifying at Wimbledon two months ago, Hon – who, at age 27, has never been ranked higher than No.118 in the world, and is eight places lower than that now – told this masthead that she believed she could be a top-30 player.\n\nThere wasn’t much evidence, as far as results, to suggest it was anything but fanciful thinking. Until now.\n\nPriscilla Hon is in uncharted territory at the US Open. Credit: Getty Images\n\nThe Australian qualifier is celebrating her greatest moment after bouncing powerful Russian top-20 star Liudmila Samsonova out of the US Open in a stunning 4-6, 6-3, 6-2 upset that advances her to the round of 32 at a grand slam for the first time.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-camila-cabello-20250827-p5mqe7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Too much bass and not enough spectacle make this a shaky reinvention",
    "publish_date": "Thu, 28 Aug 2025 11:37:17 +1000",
    "category": "entertainment",
    "authors": [
      "Nell Geraets"
    ],
    "text": "Some in the crowd are more easily convinced, however, with one fan continuously gushing that Cabello “knows what’s up” while sassily snapping their fingers. The energy in the arena only properly heats up once Cabello returns to the tracks most of her fans fell in love with her for – the upbeat Latin flare of Bam Bam and the sultry salsa-inspired sound of Havana. Here, the crowd heaves with excitement, everyone swaying their hips in almost perfect unison. Camila Cabello hasn’t performed in Australia since opening for Taylor Swift during the Reputation Tour. Credit: Richard Clifford It’s during these moments, when Cabello essentially has the crowd eating from her hand, that she herself appears to have the most fun. During the nu-disco pop track Quiet, she even implores the audience to go completely silent – a rare feat for an arena gig – before ramping their cheers up again at her own command. “I’ve stuffed my face with Tim Tams. I’ve even done a Tim Tam slam. I hope we return to Australia. We flew our butts all the way over here, and you’ve been the best crowd ever. You’ve been better than the best – you’ve been supersonic,” Cabello says, before seamlessly launching into I Luv It.\n\nCabello has said her new era is about embracing transformation and change. Yet, the best parts of her tour are when she reverts to the very sound that earned her multiple Grammy nominations back in 2019. Ultimately, Cabello has more sway than swagger, but perhaps we need to accept she’ll “never be the same” as before.\n\nReviewed by Nell Geraets DANCE\n\nScenarios and Copy of the Copy ★★★★\n\nDancehouse, Carlton, until August 30 Both works currently showing at Dancehouse circle around problems of replication and imitation. These are enduring fascinations for choreographers but what makes this evening interesting is the contrast: one work meditates on sameness, while the other insists on difference. Scenarios is playful but also intimate. Credit: Takeshi Kondo Scenarios, created and performed by Benjamin Hurley and Scott Elstermann, plays like a queer duet of self-fascination. Each performs as if the other were a mirror, a copy with no original, doubling gestures until resemblance tips into a kind of dreamy hallucination.\n\nTheir shared identity is really a shared sensibility. A kind of rococo dandyism in duplicate. Movements are upright, measured and immaculately shaped. It’s disciplined dancing, with obsessively worked symmetries, synchronicities and long phrases that develop with tricky vocalisations. They cycle through many images or scenarios. A well-chosen text hints at the thrill of seeing yourself as another, while a darker vignette evokes the doppelgänger bent on self-annihilation. Yet the mood remains playful – even a little screwy – throughout these transformations. Copy of the Copy is interested in the way dance passes from body to body, teacher to pupil. Credit: Tiffany Garvie It’s cute but also intimate. In the end, the audience itself becomes a reflective medium, placed before the twins like one of the mirrors that organise the space, as if their doubled identities require us to be the final surface in which their resemblance is registered. Priya Srinivasan, by contrast, in Copy of the Copy, is less concerned with uncanny reflections than with the way dance passes from body to body, teacher to pupil. In that transfer, copies are never exact: something is lost and something else is gained.\n\nHer work is resolutely theatrical, combining dance, video, audience interaction and even a little cooking. The registers are also multiple – comic, earnest, scholarly, confessional – and they continually shift. The effect is of a layered inquiry, staging transmission itself as a complex, unstable process. Loading Central to the performance is Srinivasan’s own dance lineage: her teachers and the teachers who taught them. As the work culminates, however, we get a more expansive mapping of connections, a deliberately overwhelming series of names stretching from the present to the late eighteenth century, crisscrossing continents, empires and colonies. As the names pile up, distinctions blur: which connections were fleeting encounters and which were nurtured over many years? Yes, we get a sense of the density of intercultural traffic, but the concept of the copy becomes a little vague and underdefined. Finally, while there’s plenty to think about in this production, its success as spectacle rests squarely with the musicians – Hari Sivanesan, Pirashanna Thevarajah, and Ranjitha Suresh – whose live presence alongside Srinivasan gives the work its special vitality.\n\nReviewed by Andrew Fuhrmann",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/manchester-united-humiliated-in-marathon-penalty-shootout-loss-to-grimsby-town-20250828-p5mqgx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This is the picture that spells the end for Ruben Amorim at Manchester United",
    "publish_date": "Thu, 28 Aug 2025 11:23:58 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "They say a picture says a thousand words. Sometimes, those words are the truth. Sometimes they’re lies. Sometimes they’re both, somehow, at the same time.\n\nIt might not be this result that does in Ruben Amorim. It might be the image of him fiddling around with magnets, desperately searching for an answer as Manchester United trailed 2-0 in Thursday morning’s (AEST) Carabao Cup clash against fourth-tier side Grimsby Town, with half an hour still to play.\n\nRuben Amorim was looking for solutions in the wrong place in the 62nd minute. Credit: X/Twitter\n\nThough United recovered to equalise at 2-2, they lost the subsequent penalty shootout 12-11 after new signing Bryan Mbuemo missed his second spot kick, sending them tumbling out of the tournament in the second round - the most embarrassing result in the club’s proud modern history.\n\nThe screengrab has gone viral. As has a photoshopped variation of it, replacing Amorim’s magnet board with a folio of Panini stickers. So, too, did another picture of him cowering in the dugout, staring at the ground, refusing to watch the penalty shootout, which has been compared to Steve McClaren’s infamous “Wally with a Brolly” moment - when the then-England manager was ridiculed in 2007 when a defeat to Croatia ended their hopes of qualifying for the next year’s Euros, watching the carnage unfold in pouring rain at Wembley Stadium beneath an umbrella. A picture of him in the Daily Mail, accompanied by the aforementioned headline, has stuck to his reputation ever since.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/2nd-round-highlights-mirra-andreeva-v-anastasia-potapova-20250828-p5mqkf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2nd Round Highlights | Mirra Andreeva v Anastasia Potapova",
    "publish_date": "Thu, 28 Aug 2025 11:23:09 +1000",
    "category": "finance",
    "authors": [],
    "text": "2nd Round Highlights | Mirra Andreeva v Anastasia Potapova\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/afl/blues-close-in-on-replacement-for-football-boss-lloyd-20250828-p5mqjy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blues close in on replacement for football boss Lloyd",
    "publish_date": "Thu, 28 Aug 2025 11:22:53 +1000",
    "category": "sports",
    "authors": [
      "Sam Mcclure"
    ],
    "text": "Carlton are closing in on Port Adelaide’s Chris Davies to be the club’s next football boss.\n\nTwo club sources confirmed to this masthead on Thursday that Carlton have held informal discussions with Davies and have made it clear he is their No.1 priority to replace outgoing head of football Brad Lloyd.\n\nPort Adelaide footy boss Chris Davies. Credit: David Mariuz\n\nDavies is understood to be considering his options after a disappointing year at Port. The Power slumped to a 13th-place finish in Ken Hinkley’s final year as coach following a preliminary final appearance in 2024.\n\nDavies, a close friend and ally of Hinkley, is viewed as one of the premier football bosses in the competition and would be a significant coup for the Blues, who are in the middle of significant change under new CEO Graham Wright.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/2nd-round-highlights-priscilla-hon-v-liudmila-samsonova-20250828-p5mqkg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2nd Round Highlights | Priscilla Hon v Liudmila Samsonova",
    "publish_date": "Thu, 28 Aug 2025 11:21:32 +1000",
    "category": "sports",
    "authors": [],
    "text": "2nd Round Highlights | Priscilla Hon v Liudmila Samsonova\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/bob-katter-threatens-to-punch-reporter-20250828-p5mqkj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bob Katter threatens to punch reporter",
    "publish_date": "Thu, 28 Aug 2025 11:20:06 +1000",
    "category": "finance",
    "authors": [],
    "text": "Bob Katter threatens to punch reporter\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Matt Golding",
    "publish_date": "Thu, 28 Aug 2025 11:17:40 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-inch-up-wall-street-advances-ahead-of-nvidia-results-20250828-p5mqg5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX edges lower on bumper results day; Qantas soars",
    "publish_date": "Thu, 28 Aug 2025 11:16:23 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket has made a flat start to the session on a busy day of results, even as Qantas shares soared after the airline posted its second-highest profit on record.\n\nThe S&P/ASX 200 was 3 points or less than 0.1 per cent, lower at 8957.50 as of 11.13am AEST, with five of its 11 industry sectors in the red, led by energy and tech stocks. Industrials and retailers rose, buoyed by the Qantas and Wesfarmers results.\n\nIt is a bumper day of results for investors to digest. Credit: Oscar Colman\n\nQantas rallied 12.7 per cent to $12.52, an all-time high, as net profits jumped 28 per cent to $1.61 billion in the year to June 30, the airline’s highest profit since its record result in 2023, helped by strong travel demand. Underlying earnings reached $2.39 billion, the carrier said on Thursday morning, largely in line with analyst forecasts.\n\nThe airline declared a final dividend of 16.5¢ a share and said it would also pay shareholders a special dividend of 9.9¢.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/culture/art-and-design/it-s-probably-going-to-save-my-art-career-winner-of-100-000-prize-announced-20250821-p5mou4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s probably going to save my art career’: Winner of $100,000 prize announced",
    "publish_date": "Thu, 28 Aug 2025 11:00:00 +1000",
    "category": "sports",
    "authors": [
      "Elizabeth Flux"
    ],
    "text": "Sophie Cape does something I’ve never seen a person do in an exhibition – puts her hand directly on the canvas and sweeps it across to point out different features and textures.\n\nThis is her work, Thunder shifts the shivering sands, and it has just been named as the 2025 winner of the $100,000 Hadley’s Art Prize. Starting in 2017, the prize, run through Hadley’s Orient Hotel in Hobart, seeks “the best portrayal of the Australian landscape”.\n\nSophie Cape with her artwork, Thunder shifts the shivering sands. Credit: Jessica King\n\nHer fingertips run across the different shades of rust, charcoal and soil. Cape’s works are created both in and from the environment – she uses materials found in the places she creates in and travels through, leaving in-progress pieces outdoors and exposed to the elements for months at a time. After being hammered with rain and wind and dust, this work can handle being lightly touched.\n\nCape turned to art after her career as an elite athlete, on track to compete at the Olympics, was abruptly cut short due to injury. “As an athlete, it’s such a different world, and you commit so much – you really have no life. It’s just training 24 hours a day for one purpose,” she explains. “When you don’t have that any more, you sort of break down.”",
    "source": "TheAge",
    "cluster_id": 34
  }
]