[
    {
        "url": "https://www.9news.com.au/finance/donald-trump-trade-war-wall-street-and-us-dollar-tumble/c4c425be-e721-4aa9-bdb6-626dec02469b",
        "title": "Wall Street and US dollar tumble amid Trump anger at Federal Reserve chair",
        "publish_date": "Tue, 22 Apr 2025 00:24:49 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Wall Street weakened overnight as investors worldwide get more skeptical about US investments because of President Donald Trump 's trade war and his criticism of the US Federal Reserve, which are shaking the traditional order.\n\nThe S&P 500 sank 2.4 per cent in another wipeout on Monday. That yanked the index that's at the centre of many accounts 16 per cent below its record set two months ago.\n\nThe Dow Jones Industrial Average dropped 971 points, or 2.5 per cent, while losses for Tesla and Nvidia helped drag the Nasdaq composite down 2.6 per cent.\n\nLIVE UPDATES: Pope Francis dies aged 88\n\nCharts on the screen of a Wall Street trader are seen through his glasses as he works on the floor of the New York Stock Exchange, on Monday, April 21, 2025. (AP Photo/Richard Drew) (AP)\n\nPerhaps more worryingly, US government bonds and the value of the American dollar also sank as prices retreated across US markets.\n\nIt's an unusual move because Treasury bonds and the dollar have historically strengthened during episodes of nervousness.\n\nThis time around, though, it's policies directly from Washington that are causing the fear and potentially weakening their reputations as some of the world's safest investments.\n\nTrump continued his tough talk on global trade as economists and investors continue to say his stiff proposed tariffs could cause a recession if they're not rolled back.\n\nUS talks last week with Japan failed to reach a quick deal that could lower tariffs and protect the economy, and they're seen as a \"test case,\" according to Thierry Wizman, a strategist at Macquarie.\n\n\"The golden rule of negotiating and success: He who has the gold makes the rules,\" Trump said in all capitalised letters on his Truth Social Network.\n\nHe also said that \"the businessmen who criticise tariffs are bad at business, but really bad at politics,\" likewise in all caps.\n\nUS Federal Reserve chair Jerome Powell is being pushed by US President Donald Trump to slash interest rates. (AP)\n\nAlso hanging over the market are worries about Trump's anger at Federal Reserve chair Jerome Powell.\n\nTrump last week criticised Powell again for not cutting interest rates sooner to give the economy more juice.\n\nThe central bank has been resistant to lowering rates too quickly because it does not want to allow inflation to reaccelerate after slowing nearly all the way down to its two per cent goal from more than nine per cent three years ago.\n\nTrump talked on Monday about a slowdown for the US economy that could be coming unless \"Mr. Too Late, a major loser, lowers interest rates, NOW.\"\n\nA move by Trump to fire Powell would likely send a bolt of fear through financial markets. While Wall Street loves lower rates, largely because they boost stock prices, the bigger worry would be that a less independent Fed would be less effective at keeping inflation under control.\n\nSuch a move could further weaken, if not kill, the US' reputation as the world's safest place to keep cash.\n\nAll the uncertainty striking pillars at the centre of financial markets means some investors say they're having to rethink the fundamentals of how to invest.\n\nGold is now the premier safe-haven refuge for nervous investors. (Getty)\n\n\"We can no longer extrapolate from past trends or rely on long-term assumptions to anchor portfolios,\" strategists at BlackRock Investment Institute said in a report.\n\n\"The distinction between tactical and strategic asset allocation is blurred. Instead, we need to constantly reassess the long-term trajectory and be dynamic with asset allocation as we learn more about the future state of the global system.\"\n\nOn Wall Street, technology stocks helped lead indexes lower ahead of their latest earnings reports due later this week.\n\nThe full list of Trump's 'reciprocal' tariffs View Gallery\n\nAll told, the S&P 500 fell 124.50 points to 5158.20. The Dow Jones Industrial Average dropped 971.82 to 38,170.41, and the Nasdaq composite tumbled 415.55 to 15,870.90.\n\nGold also climbed to burnish its reputation as a safe-haven investment, unlike some others.\n\nIn the bond market, shorter-term US Treasury yields fell as investors expect the Fed to cut its main overnight interest rate later this year to support the economy.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/conclave-how-a-new-pope-is-selected/b91298be-f16d-4f04-bca6-f7e933cdd4cb",
        "title": "How is a new pope elected? Inside the Vatican's secret process",
        "publish_date": "Mon, 21 Apr 2025 10:38:04 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "The death of a pope starts a centuries-old ritual involving sacred oaths by the cardinals electing a successor, the piercing of ballots with a needle and thread after they're counted, and then burning them to produce either the white or black smoke to signal if there's a new leader for the world's 1.3 billion Catholics.\n\nThe election itself is shrouded in secrecy, with cardinals forbidden from communicating with the outside world what happened during the voting in the conclave behind the frescoed walls of the Sistine Chapel.\n\nSt. John Paul II rewrote the regulations on papal elections in a 1996 document that remains largely in force, though Pope Benedict XVI amended it twice before he resigned. Here is what happens when a pope dies, a period known as the \"sede vacante,\" or the \"vacant See.\"\n\nA file image of a giant monitor in St. Peter's Square at the Vatican, from 2013 that shows the heavy wooden door to the Sistine Chapel being closed and locked, signalling the start of the conclave to elect a new pope. (AP)\n\nWho's in charge?\n\nIf the pope has died, the camerlengo, or chamberlain, must certify the death and seal the papal apartment. He runs administrative and financial duties of the Holy See until a new pope takes over.\n\nThe largely ceremonial job of camerlengo is currently held by Cardinal Kevin Farrell, the Irish-born American head of the Vatican's laity office.\n\nNearly all prefects of Vatican offices lose their jobs when a pope dies, but a few stay on, including the foreign minister and the master of liturgical ceremonies, who plays a key role in assembling the conclave.\n\nThe dean of the College of Cardinals summons the cardinals for the funeral, presiding at the Mass before the conclave begins. That position is currently held by Cardinal Giovanni Battista Re, the retired head of the Vatican's office for bishops.\n\nIn November 2024, Francis reformed the rites to be used for his funeral, simplifying them to emphasise his role as a mere bishop and allowing for burial outside the Vatican. Francis has chosen to be buried in St. Mary Major Basilica, where his favorite icon of the Virgin Mary, the Salus Populi Romani, is located.\n\nWorldwide mourning, rites and rituals following death of Pope Francis View Gallery\n\nWhat's the timing?\n\nThe death of a pope begins a precise sequence of events that include the confirmation of death in the pontiff's home, the transfer of the coffin to St. Peter's Basilica for public viewing, a funeral Mass and burial. Interment must take place between the fourth and sixth day after his death.\n\nAfter the funeral, there are nine days of official mourning, known as the \"novendiali\".\n\nDuring this period, the cardinals arrive in Rome. To give everyone time to assemble, the conclave must begin 15-20 days after the \"sede vacante\" is declared, although it can start sooner if the cardinals agree.\n\nWho can elect a pope?\n\nOnly cardinals under age 80 are eligible, and current regulations limit the number of electors to 120. According to the most recently updated Vatican statistics, there were 136 cardinals under age 80 and eligible to vote, though that number may change before the conclave begins.\n\nThose over 80 can't vote but can participate in pre-conclave meetings, known as general congregations, in which church problems are discussed. It was in these meetings in 2013 that then-Cardinal Jorge Mario Bergoglio spoke about the need for the church to go to the \"existential peripheries\" to find those who suffer — an off-the-cuff speech that helped his election.\n\nA view of the Cardinals' tables in the Sistine Chapel in Vatican City. The conclave will celebrate Mass here for prayers for inspiration to elect the successor. (AP)\n\nWho are possible candidates?\n\nAny baptised Roman Catholic male is eligible to be pope, but since 1378, only cardinals have been selected. Some current leading candidates:\n\nCardinal Pietro Parolin of Italy, 70, Francis' secretary of state and a veteran Vatican diplomat.\n\nCardinal Marc Ouellet of Canada, 80, head of the Vatican's bishops office from 2010 to 2023.\n\nCardinal Christoph Schoenborn of Austria, 80, a student of Pope Benedict XVI, and thus ostensibly having appeal for conservatives.\n\nCardinal Luis Tagle of the Philippines, 67, brought by Francis to head the Vatican's massive missionary office.\n\nCardinal Matteo Zuppi of Italy, 69, a Francis protégé who headed the Italian bishops conference.\n\nWhite smoke is seen billowing out from the chimney of the Sistine Chapel and announcing that a new pope has been elected on March 13, 2013. (AP)\n\nHow are the votes taken?\n\nA first ballot is held in the Sistine Chapel on the afternoon after the initial Mass. If no pope is elected, over the ensuing days two ballots are held each morning and two each afternoon.\n\nThe ballots are rectangular pieces of paper with the words: \"Eligo in Summum Pontificem\" (\"I elect as supreme pontiff\") written on top, with a space for a name. Each cardinal makes his choice, folds the paper in half, walks to the front of the chapel and declares: \"I call as my witness Christ the Lord, who will be my judge, that my vote is given to the one who before God I think should be elected.\"\n\nHe then puts the ballot on a tray and tips it into a receptacle.\n\nThree designated cardinals, known as scrutineers, check each ballot to see if it is filled out correctly. Each name is read aloud and counted, with the results announced to the conclave after each round.\n\nIf no one gets the needed two-thirds of votes, the ballots are pierced with a needle and thread, which is then knotted and placed on a tray, and another round of voting is prepared.\n\nBenedict modified some of John Paul's 1996 conclave rules, most notably excluding his vision that a pope could be elected by a simple majority if voting was stalemated. Benedict decreed that a two-thirds majority is always needed, no matter how long it takes. He did so to prevent cardinals from holding out for the 12 days foreseen by John Paul and then pushing through a candidate with a slim majority.\n\nThe life of Pope Francis View Gallery\n\nWhat about secrecy?\n\nBenedict also tightened the oath of secrecy in the conclave, making clear that anyone who reveals what went on inside faces automatic excommunication.\n\nIn John Paul's rules, excommunication was always a possibility, but Benedict revised the oath that liturgical assistants and secretaries take to make it explicit, saying they must observe \"absolute and perpetual secrecy\" and explicitly refrain from using any audio or video recording devices.\n\nThey now declare: \"I take this oath fully aware that an infraction thereof will incur the penalty of automatic excommunication reserved to the Apostolic See. So help me God and these Holy Gospels, which I touch with my hand.\"\n\nCardinals also are bound by secrecy, although the threat of excommunication only hangs over them explicitly if they are found to have accepted payment for their vote, allowed secular powers to influence it, or entered into pacts with other cardinals to back a candidate.\n\nBlack smoke emerges from the chimney on the Sistine Chapel as cardinals voted on the second day of the conclave to elect a pope in St. Peter's Square at the Vatican, back in 2013. (AP)\n\nDo we have a pope?\n\nAfter the ballots are pierced, they are burned in a cylindrical stove at the end of the voting session. Black smoke from the Sistine Chapel chimney means no decision; white smoke signals the cardinals have chosen a pope and that he has accepted.\n\nChemical cartridges are added to ensure there is no confusion over the color. To produce black smoke, a cartridge containing potassium perchlorate, anthracene — the component of coal tar — and sulphur is burned with the ballots. For white smoke, a cartridge of potassium chlorate, lactose and chloroform resin is burned with the ballots.\n\nBells also are rung to signal the election of a pope for further clarity.\n\nThe new pope is introduced from the loggia overlooking St. Peter's Square with the words, \"Habemus Papam!\" (\"We have a pope!\") and his chosen papal name. The new pope then emerges and gives his first blessing.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/the-rites-and-rituals-following-the-death-of-a-pope-his-funeral-and-burial-explained/8843c06b-0abb-4aac-8f00-4cfeb8bdf78d",
        "title": "The rites and rituals following the death of a pope explained",
        "publish_date": "Mon, 21 Apr 2025 09:40:19 +0000",
        "category": "entertainment",
        "authors": [
            "Apr"
        ],
        "text": "The death of a pope sets in motion a series of carefully orchestrated rites and rituals well before the conclave to elect his successor begins.\n\nThey involve the certification of death and public display of his body for the faithful to pay their respects, followed by the funeral and burial.\n\nPope Francis revised various rites last year, simplifying the funeral rituals to emphasise his role as a mere bishop and allowing for burial outside the Vatican in keeping with his wishes.\n\nBut the core elements remain, including the three key moments that must be observed between the death of a pope and his burial.\n\nThe reforms are incorporated into the slim red volume Ordo Exsequiarum Romani Pontificis, Latin for Rite of Burial for Roman Pontiffs .\n\nROLLING COVERAGE: ﻿ Pope Francis dies aged 88\n\nWhy were changes to the funeral rites necessary?\n\nWhile popes often tinker with the rules regulating the conclave that elects their successor, a revision of the papal funeral rites hadn’t been undertaken since 2000.\n\nThe changes became necessary after Francis expressed his own wishes, and after Emeritus Pope Benedict XVI died on December 31, 2022.\n\nFor Benedict, the Vatican had to work out the novelty of a funeral for the first retired pope in 600 years.\n\nA few months later, Francis revealed he was working with the Vatican’s master of liturgical ceremonies, Archbishop Diego Ravelli, to overhaul the entire book of rites to simplify them.\n\nIn explaining the reforms, Ravelli said the changes aimed “to emphasise even more that the Roman Pontiff’s funeral is that of a pastor and disciple of Christ and not of a powerful man of this world\".\n\nThe life of Pope Francis View Gallery\n\nThe declaration of death\n\nThe three main stations, or moments, occur first in his home, then in St Peter’s Basilica, and then in the place of burial.\n\nThe reform allows for the formal confirmation of death to occur in Francis’ personal chapel rather than his bedroom.\n\nIt is unclear why, the change may be more practical than anything since Francis chose to live in a small suite in the Vatican’s Santa Marta hotel rather than the Apostolic Palace. He has a personal chapel at Santa Marta.\n\nUpon the pope’s death, the head of the Vatican health service examines the body, ascertains the cause of death and writes a report.\n\nThe body is dressed in white.\n\nThe body rests in the pope’s personal chapel for the ritual pronouncement of death, presided over by the camerlengo, the Vatican official who runs the Holy See administration between the death or resignation of one pope and the election of another.\n\nThe camerlengo is American Cardinal Kevin Farrell, one of Francis’ most trusted aides.\n\nCardinal Kevin Farrell, Camerlengo of the Apostolic Chamber. (Getty)\n\nIn a change from the past, the rite no longer requires the body to be placed in the traditional three coffins made of cypress, lead and oak.\n\nNow, the pope’s body is placed in a wooden coffin, with a zinc coffin inside.\n\nThe pope is dressed in red liturgical vestments, his mitre — the traditional headdress of bishops — and the pallium woollen stole, a kind of scarf.\n\nThe Pasqual candle, a large, decorated candle used at Easter, is placed nearby.\n\nThe camerlengo drafts the formal declaration of death, attaching the certificate that had been prepared by the health service chief.\n\nThe master of liturgical celebrations, Ravelli, then decides when other faithful can pay their respects before the coffin is moved to St Peter’s Basilica for public viewing.\n\nOnce in the basilica\n\nWhen the body is brought into the basilica, the Litany of Saints chant is sung.\n\nThe camerlengo leads the procession.\n\nIn another change, the pope’s body is no longer placed on an elevated bier.\n\nRather, the simplified wooden coffin is placed facing the pews, with the Pasqual candle nearby.\n\nA general view of St Peter's Basilica in Vatican City. (Getty)\n\nThe sealing of the coffin\n\nThe night before the funeral, the camerlengo presides over the closing and sealing of the coffin, in the presence of other senior cardinals.\n\nA white cloth is placed over the pope’s face.\n\nA bag containing coins minted during his papacy is placed in the coffin along with a one-page written account of his papacy — known in Italian as a \"rogito,\" a word indicating an official deed.\n\nIt is read aloud by the master of liturgical ceremonies and then rolled up and slipped inside a cylindrical tube that is placed inside the coffin.\n\nAnother copy is kept in the Vatican archives.\n\nThe covers of both the zinc coffin and the wooden one bear a cross and the papal coat of arms.\n\nFrancis’ coat of arms, which he kept from when he was bishop, features a shield and the monogram of his Jesuit order, with the words “Miserando atque eligendo,” Latin for “Having had mercy, he called him”.\n\nIt comes from an episode in the Gospel where Christ picks a seemingly unworthy person to follow him.\n\nThe funeral and burial\n\nThe funeral is presided over by the dean of the College of Cardinals or, if that is not possible, by the vice dean or another senior cardinal.\n\nThe current dean is Italian Cardinal Giovanni Battista Re, 91.\n\nThe vice dean is Argentine Cardinal Leonardo Sandri, 81.\n\nFrancis earlier this year extended both of their five-year terms rather than appoint new ones.\n\nFrancis’ reform allows for burial outside the Vatican, with the camerlengo presiding. Various seals are impressed on the coffin, and it is placed inside the tomb.\n\nFrancis has said he wants to be buried not in St Peter’s Basilica or its grottoes, where most popes are buried, but in the St Mary Major Basilica across town.\n\nHis choice reflects his veneration of an icon of the Virgin Mary that is located there, the Salus Populi Romani (Salvation of the people of Rome).\n\nAfter every foreign trip, Francis would go to the basilica to pray before the Byzantine-style painting that features an image of Mary, draped in a blue robe, holding the infant Jesus who in turn holds a jewelled golden book.\n\n“It’s my great devotion,” Francis told Mexico’s N+ in revealing his future burial plans. “The place is already prepared.”",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sydney-bar-italia-owner-only-accepting-cash-fighting-to-keep-institution-old-school/211f432a-bd68-490e-ac20-95e786f4625f",
        "title": "Restaurant owner only accepts cash in fight to keep institution 'old school'",
        "publish_date": "Tue, 22 Apr 2025 01:48:10 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A restaurant owner is fighting to keep his ﻿institution \"old school\" by only accepting cash payments and refusing to offer milk alternatives.\n\nBar Italia has only been accepting cash since it opened in Sydney's Leichhardt in ﻿1952.\n\nOwner Con Damouras said the decision came from his young children not knowing how to count money and the desire to keep circulating cash in a digital society .\n\nREAD MORE: Political leaders suspend campaigning out of respect for Pope\n\n\"There is people who get disappointed, we have a few that call us different names,\" he told 2GB Sydney.\n\n\"We just say, 'Look, this is part of the institution and we're keeping it that way. Cash only'.\"\n\nDamouras had an ATM installed near his restaurant to help accommodate customers, who were previously walking up the road to the nearest ATM.\n\n\"We contacted our bank, we said we're losing customers because most people ﻿are using credit cards,\" he told the radio show.\n\nDamouras ﻿also does not offer milk alternatives.\n\nBar Italia in Leichhardt. (Edwina Pickles)\n\nDespite the old-fashioned way he does business, Bar Italia is bustling with people queuing up outside to get a seat.\n\n\"It works for us, we don't lose many people,\" ﻿he told 2GB.\n\n\"We just want to keep it old school, the way it was, the way it is.\"\n\nDamouras is one of millions of Australians fighting to keep cash circulating. ﻿\n\nToday, about ﻿two million people are expected to participate in a cash-out protest against digital and card payments by withdrawing cash and using it at businesses.\n\nThe organisers, cash advocacy group Cash Welcome, said they hope to \"keep cash alive\".﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/pope-francis-death-worldwide-mourning-rites-and-rituals-begin-following-the-death-of-pope-francis/9ffbd6e8-682f-4983-9e48-aa49a6eca4ef",
        "title": "Worldwide mourning, rites and rituals following death of Pope Francis",
        "publish_date": "Tue, 22 Apr 2025 01:05:20 +0000",
        "category": "lifestyle",
        "authors": [
            "April"
        ],
        "text": "1 of 54 Attribution: Graphic: Polly Hanning\n\nThe world has reacted quickly to the news of the death of Pope Francis at age 88 on Easter Monday.\n\nWithin hours of hearing of his passing, mourners flocked to churches to pay their respects to the leader.\n\nThe death of a pope sets in motion a series of carefully orchestrated rites and rituals well before the conclave to elect his successor begins.﻿\n\nThey involve the certification of death and public display of his body for the faithful to pay their respects, followed by the funeral and burial.\n\nSee all the photos here.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/british-royal-family-photos-2025-latest-news-headlines-in-pictures/8bd0b980-73fc-4ecf-abd7-741ab3429c03",
        "title": "Prince Andrew makes rare appearance at Easter service",
        "publish_date": "Mon, 21 Apr 2025 06:13:47 +0000",
        "category": "entertainment",
        "authors": [
            "April"
        ],
        "text": "6 of 79 Attribution: AP\n\nActor, TV host and author Sir Stephen Fry was made a Knight Bachelor by King Charles III at Windsor Castle.\n\nThe honour was presented in recognition of his services to mental health awareness, the environment, and charity, Buckingham Palace, said.\n\nAccording to the UK Government, the title originates from the medieval period.\n\nRecipients have the title Sir but do not have post nominal letters﻿.\n\nHe joins an illustrious list of famous faces with a knighthood.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/australian-political-religious-leaders-tribute-pope-francis/105199686",
        "title": "Australians mourn 'huge loss' of Pope Francis",
        "publish_date": "Tue, 22 Apr 2025 01:07:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "At St Mary's Cathedral in Sydney on Tuesday morning, Joseph Gunawan was among those who came to lay flowers and pay respect to Pope Francis after the pontiff's death at the age of 88.\n\n\"It's really sad. I heard about the news last night. I think this pope was really special, more special than any other pope,\" he said.\n\nAustralian Catholics filed in to cathedrals across the country for mass the morning after news broke of the pope's passing.\n\nSome venues opened early on Tuesday to allow mourners more time to pay their respects.\n\nAn image of Pope Francis was displayed inside St Patrick's Cathedral in Melbourne. (AAP: Lukas Coch)\n\nAt Melbourne's St Patrick's Cathedral, Kathleen Pickering noted Pope Francis's connection with people.\n\n\"He did bring a sense of everyman, he wasn't the pope up there tucked away in the enclave, he was actually a man who was there for the people,\" she said.\n\nAnother mourner in Sydney described Francis's death as \"a huge loss for this world\".\n\n\"It's a troubled world and he was just such a peacemaker and a wonderful man,\" they said.\n\nMourners laid flowers at St Mary's Cathedral in Sydney following the death of Pope Francis. (ABC News: Berge Breiland)\n\nMaureen Milgate, who teaches at a Catholic school in NSW, was on holiday in Melbourne when she heard the pope had died.\n\n\"He's been such a wonderful pope, his humility has been amazing,\" she said.\n\n\"He's just been one of us.\"\n\nMembers of the congregation pray at St Mary's Cathedral in Sydney after the death of Pope Francis. (AAP: Bianca De Marchi)\n\nIn Adelaide, Karen de Sousa was among mourners who gathered at morning mass.\n\n\"Yesterday was just devastating and I was just crying,\" she said.\n\n\"Although it wasn't a shock as he's been ill but it was a surprise because he was still there for Easter Sunday.\"\n\nReligious, political leaders pay tribute\n\nPolitical and religious leaders have also paid tribute to the pope, while some advocates for abuse victims have questioned his commitment to righting the church's wrongs.\n\nAustralia's highest ranking Catholic, Cardinal Mykola Bychok, is travelling to the Vatican and will participate in the Conclave to elect a new pope.\n\nMelbourne-based Cardinal Bychok, who was born Ukraine, praised Pope Francis's attempts to bring an end to armed conflicts.\n\n\"Pope Francis was a pope of peace,\" he said.\n\n\"In a world devastated by war he called for peace and justice.\n\n\"I am grateful for the late Holy Father's frequent appeals for a just peace in Ukraine and for the efforts of the Holy See that he oversaw, known and secret, that in some way helped bring relief to the imprisoned and suffering.\n\nMykola Bychok will be part of the Conclave that elects the successor to Pope Francis. (ABC News: Adrian Wilson)\n\n\"Building on the work of his illustrious predecessor Benedict XVI of blessed memory, Pope Francis apologised to survivors of abuse and set in place simpler procedures to deal with perpetrators.\n\n\" He began to implement a culture of safeguarding for the most vulnerable. Work that must continue into the future. \"\n\nPolitical leaders in Australia paused election campaigning to pay their respects to Pope Francis.\n\nPrime Minister Anthony Albanese was in Melbourne on the election trail when news of the pope's death broke on Monday evening.\n\nHe visited St Patrick's Cathedral on Monday night and attended mass at the cathedral on Tuesday morning.\n\n\"Pope Francis's compassion embraced all humanity, and today he will be mourned by Catholics and non-Catholics alike,\" Mr Albanese said.\n\n\"He urged us to remember all we hold in common, and he asked the world to hear the cry of the earth, our common home.\n\n\"For Australian Catholics, he was a devoted champion and loving father. Pope Francis lived out his faith and vocation in word and deed.\"\n\nAnthony Albanese leaves St Patrick's Cathedral in Melbourne after morning mass on Tuesday. (AAP: Lukas Coch)\n\nOpposition Leader Peter Dutton also paid his respects, praising Pope Francis's \"utmost devotion\" to God.\n\n\"He lived frugally and simply. Above all else, he was driven by Christ's values of mercy and forgiveness,\" Mr Dutton said.\n\n\"He emphasised those values in his last Christmas address saying, and I quote, 'God's mercy can do all things. It unties every knot; it tears down every wall of division. God's mercy dispels hatred and the spirit of revenge'.\n\n\" With God, may Pope Francis rest in peace. \"\n\nState premiers have also shared their condolences and praised the work of Pope Francis.\n\nVictorian Premier Jacinta Allan described him as a tireless advocate for the poor and a relentless voice for the marginalised.\n\nNew South Wales Premier Chris Minns said Francis was a \"pope of the people\" and showed the power of the great Catholic teachings.\n\nSouth Australian Premier Peter Malinauskas extended his government's deepest condolences to the Catholic community and said his thoughts were with \"all those who found hope\" in Francis's teachings.\n\nAnd Queensland Premier David Crisafulli said the pope had impacted the lives of millions through the values of faith, kindness and equality.\n\nPraise for Francis\n\nThe Archbishop of Melbourne, Peter Comensoli, said his congregation stood united with the greater Catholic community in its grief.\n\n\"As the church enters this time of Easter filled with the light and hope of the world, it is with deep sadness that we have received the news of the death of His Holiness, Pope Francis,\" Archbishop Comensoli said.\n\n\"Pope Francis, who came from the peripheries of the world, has been a father of the poor, and a witness of joy and hope. May the Lord, he so faithfully trusted in, now welcome him into eternal life.\"\n\nPeter Comensoli was among those to pay tribute to Pope Francis. (Supplied: C31)\n\nSydney's Catholic Archbishop, Anthony Fisher, recounted his emotional meeting with the pope at the Vatican.\n\n\"When I went to shake his hand in the line of people meeting him, he immediately said to me, 'My condolences on the death of your mum',\" Archbishop Fisher said.\n\n\" That he knew that she had died, and that he cared, was really quite remarkable. He would have been meeting a thousand people a day and it was very moving for me. \"\n\nThe Imam of Australia's largest mosque has sent his condolences to the Catholic community on behalf of Australian Muslims.\n\nImam Kauser, National President and Missionary-in-Charge of the Ahmadiyya Muslim Community Australia, said Pope Francis had \"dedicated his life to helping the poor and those who were suffering from war, injustice, and persecution\".\n\n\"He was a kind and humble man who worked to bring people of different faiths together.\"\n\nPope 'could have done more' for abuse victims\n\nRichard Jabara urged the Conclave to elect a pope who would address abuse by clergy. (ABC News)\n\nDespite his record of meeting abuse survivors and offering apologies to victims, some advocates said Pope Francis could have done more to address the issue.\n\nAbuse survivor and head of the In Good Faith Foundation, Richard Jabara, said he felt Pope Francis missed an opportunity to address historic abuse by members of the clergy in Australia.\n\n\"My message obviously to the Conclave is hopefully that they pick a pope who will not forget us and probably do more,\" he said.\n\n\"I think there's always more that can be done.\n\n\"The Catholic Church did, in the end, come forward to help victims but they did it reluctantly and it took a royal commission to expose what they did.\"\n\nAnother advocacy group, Loud Fence, offered sympathy to those who were grieving, acknowledging that \"many face a painful tension between their spiritual beliefs and the Church's failures.\"\n\n\"During his papacy, Pope Francis spoke publicly about the devastating reality of child sexual abuse within the Catholic Church. He condemned abuse as a \"scourge\" that must be addressed by society as a whole, and he acknowledged the deep suffering of victim-survivors,\" Loud Fence said in a statement.\n\n\"While he took some steps toward confronting these injustices, much more is still needed.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/qld-nick-dametto-beer-palm-island-katters-australia-party/105200000",
        "title": "Queensland MP posts photo of himself drinking in restricted area",
        "publish_date": "Tue, 22 Apr 2025 00:34:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland MP Nick Dametto says he was \"unaware\" drinking full strength beer on one of Palm Island's northern islands was not permitted, after he posted photos of himself drinking there.\n\nThe Katter's Australia Party (KAP) member for Hinchinbrook shared photos of himself and friends on a boat trip to Curacao Island on Good Friday on Facebook.\n\nOne of them shows Mr Dametto drinking a full-strength beer with the island's location tagged.\n\nCuracao Island is roughly a kilometre from Great Palm Island.\n\nPalm Island can be seen in the background of this photo posted by Mr Dametto. (Supplied)\n\nUnder Palm Island's alcohol management plan it is prohibited to bring full-strength beer onto the 10 islands which are part of the Palm Island Aboriginal Shire.\n\n'Completely unaware'\n\nThe maximum amount of alcohol a person can carry in the restricted area is 11.25 litres of any liquor with an alcohol concentration of less than 4 per cent.\n\n\"I was completely unaware that some of the smaller outer islands that make up the Palm Islands group were also included in that alcohol management plan,\" Mr Dametto said.\n\nPalm Island has alcohol restrictions in place. (ABC News: Baz Ruddick)\n\nHe said it would be \"very beneficial\" if there were \"more signs\" at the boat ramp and popular beaches.\n\nBwgcolman woman and former councillor Andrea Kyle-Sailor said she was angry when she saw Mr Dametto's post.\n\n\"He's been the Member for Hinchinbrook since around 2017 and we've had our alcohol management plan in place since 2006 so we had it in place for 10 years before,\" Ms Kyle-Sailor said.\n\n\"His electorate butts up against our electorate, so he should know.\"\n\nPalm Island, off the coast of Townsville, has a transient population of about 4,000. (ABC News: Baz Ruddick)\n\nShe said it was obvious the beer Mr Dametto was drinking was full-strength as the Great Northern Original can he was holding has a white marlin on its branding, while the mid-strength variety has a black marlin.\n\n\"We know that the white marlin is for the white people and the black marlin is for the black people,\" she said.\n\n'That's the law'\n\nThe alcohol management plan in the Palm Island Aboriginal Shire applies to residents and visitors.\n\nAndrea Kyle Sailor says the law needs to be applied to everyone. (Supplied)\n\nMs Kyle-Sailor said even if Mr Dametto had made an \"honest mistake\" in bringing the alcohol to the island, she would like to him to be treated like any other person breaking the law.\n\n\"We've never tried to use that excuse that it was an honest mistake when breaking the law,\" she said.\n\n\"Nobody is exempt. People get searched all the time. It's not uncommon. Police were on the journey today at the ferry so they are constantly doing searches.\n\n\"We are humiliated when we get searched. It's really quite embarrassing being searched. They go through everything, and whether we like it or not that's the law.\"\n\nMs Kyle-Sailor said she did not support the alcohol management plan and requested it be reviewed when she was a councillor.\n\n'Double standard'\n\nMr Dametto said it needs to be asked how effective the plan is.\n\n\"The double standard is since 2008, some Australians have been treated differently to the rest of Australians when it comes to consuming alcohol,\" he said.\n\n\"Members of the KAP like Robbie Katter, our leader, and Bob Katter have been quite vocal about management plans in the past saying they have inadvertent consequences.\"\n\nMr Dametto said he did not believe his mistake warranted an apology.\n\n\"I think an apology should be reserved when someone is doing something intentionally wrong,\" he said.\n\nPalm Island is the largest discreet Indigenous community in the country. (ABC News: Baz Ruddick)\n\nA police spokesperson said the service was investigating the incident.\n\nMr Dametto said he had not been contacted by the police.\n\nFifteen local government areas across Queensland have alcohol restrictions with varying rules co-designed between the state government and the communities.\n\nAlcohol management plans are designed to target illicit alcohol and promote \"a healthy culture and attitude\" towards alcohol.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/simone-biles-wins-record-fourth-laureus-award/105199960",
        "title": "Biles wins record-fourth Laureus award while Mondo receives first",
        "publish_date": "Mon, 21 Apr 2025 23:58:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "Paris Olympics superstars Simone Biles and Armand Duplantis have won the top honours at the annual Laureus awards ceremony.\n\nBiles, the world's most decorated gymnast, was named the Sportswoman of the Year, while Swedish pole-vaulter Duplantis became the first track and field athlete to win the men's award since Usain Bolt claimed his fourth in 2017.\n\nBiles won gold medals in the team, all-around and vault competitions, as well as a silver on the floor exercise at the 2024 Paris Games to complete a triumphant comeback three years after withdrawing from events at the Tokyo Olympics.\n\nThe 28-year-old won the Laureus award for the fourth time, equalling the women's record held by tennis great and US compatriot Serena Williams.\n\nSimone Biles (left) was reunited with Rebeca Andrade (right), who beat her to floor gold in Paris. (Getty Images: Burak Akbulut/Anadolu)\n\n\"I'm so happy to be here in Madrid and to receive my fourth Laureus award,\" the 2017, 2019 and 2020 winner said.\n\n\"I won this award for the first time in 2017 and Laureus has been a part of my story since then. There might be a little girl watching someone like me on television and deciding she can do it too.\"\n\nBrazilian gymnast Rebeca Andrade won the Comeback of the Year award after completing her inspirational return from career-threatening injuries at the Paris Games to win the gold medal in the floor competition.\n\nAndrade kept Biles from winning back her Olympic title in the floor routine, leading to an iconic podium moment as Biles and American teammate Jordan Chiles bowed to the Brazilian, although Chiles's fight to be recognised as the bronze medallist continues.\n\nLast year's five-time winner Novak Djokovic handed Duplantis his first Laureus award after he was nominated in each of the last three years.\n\nMondo Duplantis accepted his award from five-time winner Novak Djokovic. (Getty Images: Pablo Cuadra)\n\nWidely regarded as one of the greatest pole vaulters of all time, Duplantis won a second-straight Olympic gold medal in Paris, breaking his own world record for the ninth time, before shattering it once again in the Silesia Diamond League meeting the following month.\n\n\"I am incredibly honoured to have won my first Laureus,\" Duplantis said.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\n\"This is the ultimate award that we athletes want to win. I know because this is the fourth time I have been nominated and that proves it's harder to win a Laureus than an Olympic gold medal.\"\n\nTeenage soccer sensation Lamine Yamal, who helped Spain win the European Championship last year, won the Breakthrough of the Year, the sixth footballer to win that award.\n\nThe Laureus World Sports Awards nominees are selected by the global media, while the winners are determined by the 69 members of the Laureus World Sports Academy.\n\nThe awards have been presented annually since 2000.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/irresponsible-vaccine-scepticism-in-south-australian-councils/105173698",
        "title": "Councils under fire for promoting vaccine scepticism",
        "publish_date": "Mon, 21 Apr 2025 23:56:07 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Medical experts say motions passed by local councils in South Australia promoting vaccine scepticism are putting the community at risk.\n\nSince the start of this year, three local councils in South Australia's Limestone Coast region — the District Council of Grant, the District Council of Robe, and the Naracoorte-Lucindale Council — have passed motions promoting scepticism about the safety of vaccines.\n\nIn addition, the Limestone Coast Local Government Association (LCLGA), made up of all the councils in the region, voted in favour of such a motion.\n\nCOVID-19 vaccines were first approved for use in Australia in February 2021. (Reuters: Hannah Beier)\n\nThe motions passed by the LCLGA, Robe, and Naracoorte-Lucindale councils call on staff to write to state and federal health ministers to \"ensure all vaccinations, both present and future, are tested to ensure they are free from contaminants and safe for human vaccination\".\n\nUniversity of Queensland infectious disease physician and clinical microbiologist Professor Paul Griffin has worked on the development of 125 vaccines and malaria human challenge studies.\n\nHe said the motions imply that past vaccines had not gone through a rigorous testing process.\n\nProfessor Paul Griffin has worked on developing a range of vaccines, including eight for COVID-19. (Supplied)\n\n\"We have one of the strictest regulatory environments in the world,\" Professor Griffin said.\n\n\"We make sure we have tested vaccines thoroughly, that they have to be safe and effective to be approved, and that they have to remain so to be continued to be used.\n\n\"We carefully assess the ingredients as well as the safety in recipients on a continual basis to make sure that remains the case.\"\n\n'Scientific rigour'\n\nA trend of local governments passing motions regarding vaccinations began in October 2024 with the Port Hedland council in Western Australia.\n\nThe motion and subsequent motions passed by other councils are based on a debunked claim mRNA COVID-19 vaccinations were contaminated with excessive DNA.\n\nThe Pfizer mRNA COVID-19 vaccine was a key part of Australia's vaccine rollout. (ABC News: Che Chorley)\n\nA Canadian study claimed to confirm earlier findings by US molecular biologist Dr Philip Buckhaultz, but those findings have been debunked by fact-checking organisation AAP FactCheck.\n\nThe Therapeutic Goods Administration said it was aware of \"misinformation\" in media and online reports regarding COVID-19 vaccines.\n\n\"These reports are based on studies conducted by a small number of laboratories that have attempted to investigate the amount of DNA in COVID-19 vaccines,\" the TGA website stated.\n\n\" While the TGA welcomes and constantly reviews the latest scientific evidence about the safety of vaccines and other biotechnology products, these recent studies fail to apply the required scientific rigour expected in pharmaceutical testing. \"\n\nCouncils deny being anti-vaccination\n\nThe District Council of Grant was the first to move a motion directly referencing vaccines, in which it called the COVID-19 vaccine \"experimentally approved\" — a claim that has also been debunked by medical experts.\n\nWhen sent questions about her council's motion, Mayor Kylie Boston said the council supported \"the role of SA Health in keeping our community safe\".\n\nThe Limestone Coast Local Government Association, made up of the seven councils in the region, also voted to write to state and federal health ministers about vaccines.\n\n\"The discussion on the floor at the meeting was that none of those present had any expertise in medical matters and can make no judgement on the efficacy or otherwise of vaccines,\" LCLGA president and Mount Gambier Mayor Lynette Martin said.\n\n\" However, as this matter is of concern to some members of the community, the board determined therefore to bring it to the attention of the relevant ministers. \"\n\nLynette Martin said the LCLGA raised the matter as it was of concern \"to some members of the community\". (ABC News: Isadora Bogle)\n\nNaracoorte-Lucindale Council passed a motion after being presented with a petition signed by 25 residents.\n\nMayor Patrick Ross said the council was seeking \"assurances\" about vaccine safety, but denied his council was questioning official health bodies and was anti-vaccination.\n\nNaracoorte-Lucindale Council Mayor Patrick Ross denied his council was questioning official health bodies. (Facebook: Naracoorte-Lucindale Council)\n\n\"It has been said certainly by some of our councillors that we aren't medical experts, and have we gone and sought independent verifiable information? No, we haven't,\" he said.\n\n\"We just wish to ensure, by asking our politicians and people responsible for the health of the nation, that if there was some erring or if there was some doubt, then that doubt should be removed.\"\n\nSevere flu season expected\n\nMedical experts are concerned this year's flu season could be severe as flu vaccination rates fall.\n\nA global outbreak of measles is also being blamed on falling childhood vaccination rates.\n\nProfessor Griffin said it was irresponsible for elected officials to promote vaccine misinformation in council chambers.\n\nProfessor Griffin said vaccine misinformation is leading to real consequences in the community. (Supplied)\n\n\"To be elected, there are certain skills and expertise those people must possess to do that and we should respect their ability to fulfil that role,\" he said.\n\n\"When it comes to health matters, we should exercise that same respect and get our advice from people with sufficient expertise to make comment.\n\n\"Australia is very lucky. We have an excellent healthcare system, a magnificent academic and university infrastructure where there are a lot of experts, and I think that's where we should try to get our information.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/ratepayers-angry-fogo-organics-waste-south-west-wa/105188062",
        "title": "Ratepayers 'grumpy' and 'disgusted' as FOGO efforts go to waste",
        "publish_date": "Mon, 21 Apr 2025 23:01:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents in Western Australia's South West are disappointed to learn their efforts to sort food scraps and garden trimmings from general rubbish are going to waste.\n\nBunbury Harvey Regional Council (BHRC) has been turning food and garden organic (FOGO) waste from homes and businesses into sellable compost and mulch for over a decade.\n\nUntil recently, it processed FOGO for more than half of the region's 12 local governments.\n\nAmid ongoing contamination concerns, the state government awarded BHRC more than $80,000 for a FOGO decontamination project in October 2024.\n\nCity of Bunbury FOGO mascot Freddy celebrates the 10-year anniversary of green bins in 2023. (ABC South West: Kate Stephens)\n\nHowever, two months later, BHRC told local governments it would start diverting all FOGO to landfill due to high levels of contamination in kerbside collections.\n\nEarlier this month, it stopped accepting FOGO altogether.\n\nVanessa Bennett, who lives in Capel, said she always made an effort to sort her FOGO properly and was \"disgusted\" to hear it was now going to landfill.\n\n\"We're paying council rates for that extra bin,\" she said.\n\nBunbury resident Jill Thompson, who has a large garden, said she filled her green bin to the brim every week.\n\nShe said the situation was \"an absolute disaster\".\n\nJill Thompson (left) and Vanessa Bennett are disappointed to hear their FOGO will go to landfill. (ABC South West: Pip Waller)\n\nThe City of Bunbury, which is one of the local governments BHRC processes FOGO for, recently introduced an average waste charge of $50 per property to \"help cover kerbside collection of domestic refuse, recyclables and organic waste\".\n\nIt came on top of an average 4.1 per cent increase to existing waste management charges.\n\nThe ABC has contacted the City of Bunbury and BHRC for comment.\n\nContamination and capacity issues plague tip\n\nCollie Shire president Ian Miffling said BHRC enforced a contamination limit of 1 per cent for organic waste, which he believed was unrealistic.\n\n\"That's ruled out just about everybody's FOGO because nobody can comply with that sort of ruling,\" he told ABC Radio South West.\n\nCollie Shire president Ian Miffling says BHRC's 1 per cent contamination limit for FOGO waste is unachievable for local shires. (ABC News: Ruby Littler)\n\nDardanup Shire president Tyrrell Gardiner said contamination was certainly a challenge, with residents sometimes \"aspirational\" about what they threw in.\n\nIn 2023, Dardanup Shire considered scrapping the FOGO bin altogether.\n\nAccording to Waste Authority WA, common contaminants include glass, metal, treated timber, plastics, and non-biodegradable lawn care products.\n\nBut Mr Gardiner said a 1 per cent contamination rate was not impossible to achieve with the right technology.\n\nHe said he believed BHRC's decision to pause FOGO processing was about more than contamination, with capacity issues at the facility also at play.\n\nWaste Authority WA's guide to what should go in the green FOGO bin. (Supplied: Waste Authority WA)\n\nThe state government said it was investigating alternative solutions for the area and trying to help BHRC improve its FOGO decontamination processes.\n\nWA's Local Government Association (WALGA) said a dedicated regional strategy was urgently needed, with the state's waste management strategy largely focused on Perth and Peel.\n\nIn 2023, the federal and WA governments announced a co-investment of $11.25 million for three organic waste processing infrastructure projects, all based in Perth.\n\nResidents stick with three-bin system\n\nDespite red and green bin rubbish being destined for the same tip, South West shires have asked residents to continue separating their organic waste.\n\nIn a statement, the Shire of Donnybrook-Balingup said that, despite seeming unnecessary, \"maintaining positive waste habits\" was crucial.\n\nGreen bins in the City of Bunbury and nearby shires are being tipped into general landfill. (ABC South West: Bridget McArthur)\n\nSeveral local governments said they were working together to find alternative FOGO processing solutions as soon as possible.\n\n\"Throwing everything into landfill, it's not sustainable … we've got to get [FOGO] to work,\" Mr Gardiner said.\n\nDardanup resident Billie Pollock said she was grumpy about the pause on FOGO when she felt there was a clear answer to the high contamination rates.\n\n\"The red bin should be emptied every week instead of the green one,\" Ms Pollock said.\n\n\"I feel like a lot of people I've seen are just putting their red bin rubbish into the green bin … because there's just not enough space.\"\n\nBillie Pollock says people are putting general waste into green bins when their red bins are full. (ABC South West: Pip Waller)\n\nMs Thompson said more education would also help reduce contamination, saying many people were still confused about what could and could not go in the green bin.\n\nBut she said if the green bins were just going to be tipped into landfill, residents should instead be provided with their own compost bins and mulchers.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/torndirrup-national-park-hiker-injured-rescue-albany/105198508",
        "title": "Helicopter rescue for woman injured in southern WA",
        "publish_date": "Mon, 21 Apr 2025 22:00:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "A woman has been winched to safety and taken to hospital after suffering serious injuries at a national park on Western Australia's south coast.\n\nThe woman was walking with her children when she fell down a gully at Torndirrup National Park, about 10 kilometres from Albany, on Monday morning.\n\nPaul Barwick was with the group and said they had been walking to a popular fishing spot.\n\n\"She lost her balance and fell backwards, she probably rolled 5 to 7 metres down the gully,\" he said.\n\n\"She injured her ankle and leg, and has a mild contusion on the side of her head.\n\n\" She was in extreme pain initially, but was quite aware of what was going on. \"\n\nPaul Barwick was with the woman and her children when she fell at Torndirrup National Park. (ABC Great Southern: Rosemary Murphy)\n\nMr Barwick said a decision was made to get the children to safety before guiding emergency service workers to the scene.\n\nA rescue helicopter was eventually deployed, along with State Emergency Service volunteers and firefighters from Albany.\n\nMr Barwick described the track where the woman had fallen as \"moderate to severe\".\n\nSES personnel were deployed during the rescue operation. (ABC Great Southern: Samantha Goerling)\n\n\"If you had six to eight people with ropes you could probably winch her up the cliff,\" he said.\n\n\" But we thought the helicopter would be the best option. \"\n\nThe woman was eventually flown to Albany airport and taken to hospital on Monday evening.\n\nIt was the first of two call-outs in the region that day. A man in his 50s was also rescued from a remote beach at West Cape Howe, near Denmark, and taken to hospital in Albany.\n\nNo further details of that incident have been released.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/why-kids-need-to-practise-music-and-how-to-get-them-motivated/105177836",
        "title": "Getting your kids to practise their musical instrument might be easier than you think",
        "publish_date": "Mon, 21 Apr 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "If your child has recently started learning a musical instrument, you might be familiar with the struggle to get them to practise.\n\nFor many kids, spending time with their chosen musical instrument can be frustrating.\n\nPractising often involves learning unfamiliar music, working on techniques as well as correcting mistakes. Some kids can find the process repetitive and boring.\n\nAll your music questions answered Photo shows A red apple is carved with music symbols. A rubab sits on one side of the apple and a hard on the other. Text reads Music Class Music Class is a weekly deep dive into all things music, including musical terms, notation, theory and much more.\n\nForming the habit to practise is an important life lesson children need to learn, according to longtime music educator and researcher Anita Collins.\n\n\"The understanding that when we work at something, we will get better at it is a transferable skill,\" Dr Collins says.\n\nBut this is easier said than done.\n\nDr Collins and ABC Classic's Music Class co-host Genevieve Lang, who is also a professional harpist, share tips to make practising more manageable.\n\nWhy do you need to practise music?\n\nPractising is about developing skills, familiarity and confidence, Dr Collins says.\n\nEven people who are musically talented still need to practise, including the things they find repetitive and boring.\n\n\"What the brain does [while learning through repetition] is problem solving,\" Dr Collins says.\n\nPractising allows the brain to process the huge amount of musical information needed to develop the skill required to play the instrument or sing. It also allows the player to build the muscle coordination to perform more virtuosic or technical pieces of music.\n\nThat's really important for an instrumentalist like Lang.\n\nHow to set children up for success when they start learning music Photo shows A young girl in pigtails and denim overalls sits at a piano with sheet music. Her hands are on the keys as she reads the music. Learning music has many benefits including persistance and resilience.\n\n\"We have a phrase in Music Class: musicians are tiny muscle athletes,\" Lang says.\n\nLang says practising the music slowly at first can help with the learning process.\n\nShe uses \"slow practise\" to map out the movement of her hand on her harp, allowing her to concentrate on tempo and volume when she increases the speed.\n\n\"The other thing that slow practise allows you to do is relax in between every note,\" she says.\n\nRelaxing is important to keep musicians safe from injury through repetitive strain, especially for instruments like the harp which require players to hold a certain posture for a long period of time.\n\nBut if kids make mistakes while learning notes, it's important to pause and correct it before doing too many repetitions.\n\nOtherwise, \"they're just practising their mistake,\" Lang says.\n\nHow do you get kids motivated to practise?\n\nDr Collins compares practising music to building an exercise habit.\n\nKids need a goal or a reason to work towards, such as a performance or an exam.\n\nParents could start with having a designated space that's set up with a music stand, such as a corner of the room, and a nominated time to practise.\n\n\"The most important part is actually developing the habit,\" Dr Collins says.\n\nFor the first two to four weeks, \"what we're actually doing is not developing them musically,\" Dr Collins says.\n\n\" We're developing the habit that at a given time, I go to my space and I pick my instrument up and I do my practise. \"\n\nDr Collins and Lang have also role modelled practising music themselves.\n\nBoth incorporate music practise as part of their day, especially showing their kids how to be accountable to get better.\n\n\"I'm very honest with my kids when I need to practise,\" Lang says.\n\nLang's kids know when she needs to do more practise for upcoming performances.\n\n\"They will tell me 'mum, that doesn't sound too good yet'.\"\n\nBut conversely, Lang isn't averse to \"a good old bribe\" when it comes to motivating kids to practise.\n\n\"My son can earn screen time minute by minute when he practises his drums,\" she says.\n\nOn social media, parent Matthew Lorenzon employs a similar tactic. He uses low-cost computer technology to track how long his son practises, and activates a reward when he has finished.\n\nLoading Instagram content\n\n\"After ten minutes of practise, the internet turns on,\" Mr Lorenzon says.\n\nHow long do children need to practise?\n\nDr Collins says during the initial habit-forming stage, the practise session might take as little as two minutes.\n\n\"All they have to do is walk to that space, get their musical instrument out, play one thing and put their instrument down,\" she says.\n\n\"Without saying you must practise for a set amount of time, it will naturally happen because we've set them up with a habit to start with,\" she says.\n\nDr Collins emphasises there's no one-size-fits-all approach to determine how long kids should practise.\n\n\"It should be something that is talked through and monitored by both parents and their instrumental teacher,\" she says.\n\nThis should take into account the child's age, how long they've been playing the instrument, their learning style and the expectations of their parents and teachers.\n\n\"It should change regularly as the student improves as a player, strengthens their attention span and needs greater challenge,\" Dr Collins says.\n\nAs a harpist, Lang uses something called the Pomodoro Technique for her own practise routine.\n\nMany might already be familiar with the method from the workplace or studying.\n\n\"I would put on a timer for about 20 minutes to sit and play,\" she says.\n\nIf she's in flow when the timer goes off, Lang will carry on. But if the practise isn't going well, Lang will get up and do something else before continuing.\n\nEven though Lang plays the harp professionally, she doesn't believe in practising for hours. The limit of her attention span is about 45 minutes.\n\n\"That's the maximum sustained time that I can practise before I'm not able to place my attention on what I'm doing.\"\n\nShould kids still practise on a bad day?\n\nBoth Lang and Dr Collins emphasise that practise is about the daily process of learning music instead of tallying accomplishments.\n\n\"Sometimes it goes up, sometimes it goes down, but ultimately, it's always going generally up,\" Dr Collins says.\n\nLang explains why it's not a straightforward process.\n\n\"[Just like adults], kids are not the same every day, and you can't set the same expectations from day to day,\" she says.\n\nShe describes how at the end of school terms when kids are tired, they're not able to learn new things.\n\nAfter the holiday, \"they come back and they are like sponges for instructions,\" Lang says.\n\n\"The important thing is that they just consistently persist,\" Lang says.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/asx-markets-business-news-live-updates-april-22/105199102",
        "title": "Live: Threats to sack US Fed chair send Wall Street crashing",
        "publish_date": "Mon, 21 Apr 2025 21:50:44 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Stephanie Chalmers"
        ],
        "text": "The White House's intensified attacks on US Federal Reserve chair Jerome Powell have sent Wall Street plummeting again.\n\nThe Dow (-2.4%), the S & P 500 (-2.5%) and the Nasdaq (-2.5%) all crumbled as the Trump administration switched its battleground from offshore targets to local enemies, in this case the US Federal Reserve just down the road.\n\nPresident Donald Trump followed up White House economics advisor Kevin Hassett's Good Friday musings that the administration was looking at ways of sacking Mr Powell with another stream of invective overnight.\n\nMr Trump tapped out a social media post saying the US was heading for an economic slowdown thanks to Mr Powell and the Fed not cutting rates.\n\n\"Unless Mr. Too Late, a major loser, lowers interest rates NOW,\" Mr Trump posted on his Truth Social platform.\n\nThe fresh assault on the Fed's independence is likely to set the tone for global markets this week.\n\n\"Countries that have an independent central bank grow faster, have lower inflation; they have better economic outcomes for their people,\" Argent Capital's Jed Ellerbroek noted after today's rout. \"Politicians trying to influence the Fed is a really bad idea, and it's very scary for the market.\"\n\nASX 200 futures (+0.6%) last traded on Thursday and are unlikely to be a good guide for today's action.\n\nThe US dollar continued its decline with the Aussie dollar now back above 64 US cents.\n\nGold predicably galloped ahead in Monday trade, up almost 3% to yet another record, punching through $US3,400/ounce.\n\nOil traders were also back at the desk on Monday and viewed positive progress in US/Iran talks as a signal to sell.\n\nThat, and increasingly gloomy takes on where the global economy is heading saw Brent crude fall to 2% to $US66.51 a barrel.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/wildlife-carers-funding-needed-increasing-injured-animals/104881812",
        "title": "Wildlife carer spending $10k a year says cost is driving out volunteers",
        "publish_date": "Mon, 21 Apr 2025 21:41:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "In a shed at the back of Nikki Shanahan's Ballarat home, two bandaged koalas are curled up in enclosures while an injured wedge-tailed eagle moves around its cage restlessly.\n\nInside the comfort of her living room, a baby wombat joey sits quietly, swaddled in a blanket.\n\nThis is Shanhaven Wildlife: a shelter for native animals that doubles as a veterinary hospital where Ms Shanahan treats and rehabilitates critically sick and injured wildlife.\n\nBut like many wildlife carers she is not only donating her time, expertise and property to the cause.\n\nShe is also spending her own money.\n\n\"I would spend roughly $10,000 a year on wildlife care, not including specialised equipment and shelter upgrades or repairs,\" she said.\n\nMs Shanahan, who has a long career as a veterinarian nurse, said while grants were available for wildlife carers through the state environment department (DEECA), more direct funding was needed.\n\n\"Yes, we can apply for grants, but the application process is longwinded,\" she said.\n\n\"I haven't got time to sit down and write pages and pages of essays of information for funding.\"\n\nCarers down, injured animals up\n\nAccording Conservation Regulator data, the number of wildlife carers in Victoria has plummeted from 449 in 2019/20 to 172 last financial year.\n\nWildlife Victoria reports having more than 1,300 registered volunteers.\n\nMs Shanahan said out-of-pocket costs and a lack of government funding would dissuade many from joining the ranks.\n\nThe number of wildlife injured in Victoria is on the rise. (ABC Ballarat: Claudia Forsberg)\n\nAt the same time, Ms Shanahan said more native animals were being brought into vet clinics and wildlife shelters than ever before.\n\nWildlife Victoria data backs this up — in 2020, its emergency response service received about 100,000 calls.\n\nLast year, it received more than 160,000, with over 97,000 native animals getting assistance.\n\nBroken Hill wildlife carer group closes Photo shows a woman holds a lizard and smiles at the camera. Having a house filled with joeys or a backyard of native birds might sound wonderful, but there can be a darker side to caring for animals.\n\nWildlife Victoria was not available for comment.\n\nMs Shanahan said not all injured or sick animals could be looked at by professionals and that some were falling through the gaps due to a lack of available carers.\n\n\"Very often [they] get left to die,\" she said.\n\nTrying to find a solution\n\nIn Victoria, all wildlife shelters must be registered with DEECA.\n\nIndividual carers are then registered to a shelter and work on a volunteer basis, with the option to register on Wildlife Victoria's database.\n\nDEECA did not respond to direct questions, but a spokesperson said its wildlife carers and volunteers \"do incredible work in helping to respond, rehabilitate and care for our sick, injured and orphaned wildlife\".\n\nThe spokesperson also said the Victorian government was investing $7.2 million over the next four years to bolster wildlife welfare, including $4.7 million for a new wildlife hospital in Victoria's south-west run by Zoos Victoria.\n\nAn orphaned brushtail possum is cared for by rescuers. (ABC News: Sean Warren)\n\nVets under the pump\n\nMichelle Campbell-Ward is an Australian Veterinary Conservation Biology executive committee member and Wildlife Health Australia board member.\n\nShe said wildlife care was not funded or resourced to the level society expected and that animal welfare needs were not being met.\n\n\"This sector has been volunteer led for decades and veterinary hospitals are generally providing care to injured wildlife on a pro bono basis,\" Dr Campbell-Ward said.\n\nMichelle Campbell-Ward says carers need funding to meet expectations. (Supplied: Taronga Western Plains Zoo)\n\n\"For wildlife carers it can be an expensive undertaking, particularly to do it well and to adhere to appropriate standards.\n\n\"There's a need for increased funding and facilities and to recognise the importance of this work.\"\n\nHome base\n\nSnow season casualties spike Photo shows A wombat joey sleeps surrounded by a pink blanket. Wildlife rescuers are calling on snow-goers to take extra care when driving to Victoria's alpine resorts amid a spike in wildlife casualties.\n\nMs Shanahan and other wildlife rescuers and veterinary workers in Ballarat have created a not-for-profit organisation to raise funds and build a wildlife hospital in the regional centre.\n\nNo hospital like this exists in regional Victoria and the project remains a way off completion.\n\n\"It's a lot and also out of our own pocket, but we're hoping one day that changes,\" Ms Shanahan said.\n\nIn the meantime, wildlife carers in Ballarat will continue to help with the care and rescue of animals in Ballarat and surrounding regional areas.\n\n\"We are all trying our best to do what we're doing,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/guineas-simandou-mine-formidible-competitor-wa-iron-ore-sector/105197588",
        "title": "Could WA's golden goose be under threat from a giant iron ore deposit?",
        "publish_date": "Mon, 21 Apr 2025 21:29:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Iron ore is the economic lifeblood of Western Australia.\n\nLast year alone, a quarter of the state government's entire revenue came from iron ore royalties, flowing directly into state coffers from the red dirt of the Pilbara.\n\nThe government’s iron ore royalty receipts increased by 8 per cent to $9.4 billion in 2023.\n\nBut the WA sector is about to face a new competitor in the form of the Simandou mine in the African nation of Guinea.\n\nSimandou holds one of the largest untapped high-grade iron ore deposits in the world.\n\nWhen is export slated to begin?\n\nAfter setbacks and delays, the massive mine is finally on track to deliver a fresh wave of high-grade iron ore to the market.\n\nSimandou in Guinea holds one of the world's largest untapped high-grade iron ore deposits. (Instagram: Rio Tinto)\n\nExport is slated to start by the end of the year, according to Rio Tinto, the principal investor in the region.\n\nIt expects production to ramp up over 30 months to a capacity of 60 million tonnes per year.\n\nAnd the iron ore from the Simandou deposit is expected to fetch a high price too.\n\nResources analyst Tim Treadgold said this was due to the grading process.\n\nTim Treadgold says the iron ore desposit at Simandou is very high grade. ( ABC News: Angela Ho )\n\nThe percentage of iron in the ore at Simandou is \"very high and very good\" at 65 per cent compared with the Pilbara's iron ore, which has \"dropped\" to an average of 61 per cent.\n\nWhile a few percentage points may not seem like much, a higher grade can indicate fewer impurities, meaning the commodity will fetch a higher price.\n\nCould Simandou be the 'Pilbara killer'?\n\nNot likely.\n\nThe project has been dubbed the 'Pilbara killer' for its potential to dethrone Australia's economic crown jewel.\n\nBut some economists and mining analysts believe the title is nothing more than a snappy headline.\n\nIron ore royalties account for a significant part of WA's income. (ABC Pilbara: Laura Birch)\n\nWA exported nearly 950 million tonnes of iron ore according to the state government's 2024 iron ore profile, making WA the largest iron ore supplier in the world and accounting for 38 per cent of global supply in 2023.\n\n\"Put it in perspective — 60 million tonnes against [around] 900 million tonnes. Well, it's not even 10 per cent. It's not going to put WA out of business,\" Mr Treadgold said.\n\nHe also pointed out that mines start closing the moment they open because resources are finite.\n\n\"Mines are closing every day, and you need new mines to come online to fill the gap. It's a perfectly natural process,\" he said.\n\nEnd of an era with last train from WA iron ore mine Photo shows Empty iron ore wagons on train tracks in bushland near Kalgoorlie. WA's Yilgarn region has been home to iron ore mining on and off since the 1950s, but the final trainload of the steel-making ingredient has arrived at Esperance Port.\n\nChina is the largest market for WA's iron ore exports, followed by Japan and South Korea.\n\nIron ore production rose rapidly from the 2000s to the mid-2010s, in large part due to demand from China.\n\nBut Chinese steel production appears to be peaking, as the country shifts towards recycling its own scrap steel like the US and Europe.\n\nMr Treadgold said this \"natural progression\" meant less reliance on raw iron ore, with recycled steel becoming a main source.\n\n\"All the iron ore that's been turned into steel over the last couple of hundred years is still out there somewhere,\" he said.\n\n\" You can call it an above ground mine. There's an enormous industry involved in collecting scrap and reproducing it. \"\n\nBut Mr Treadgold believed this did not pose a real threat to the local iron ore sector, as WA could provide high-grade supplementary \"top-ups\" to production, finding a \"new place in the pecking order\".\n\nMatt Grudnoff, a senior economist at the Australia Institute, agreed the impact from Simandou was going to be far from dramatic.\n\nMatt Grundoff doesn't expect to see any dramatic effect from the output of the Simandou mine. (Supplied)\n\n\"If it has an impact, it will be over the longer term, and we will see the WA economy adjust over time,\" he said.\n\n\"I don't think it would necessarily spell the doom of the WA economy. It's likely just to see a slowdown in growth.\"\n\nSo what is the risk?\n\nWhile short-term effects aren't imminent, the WA economy's dependence on the resources sector has long raised eyebrows among leading national economists.\n\nIron ore production in WA rose rapidly from the 2000s to the mid-2010s. ( ABC News: Rachel Pupazzoni )\n\n\"Financial planners will tell you to not put all your eggs in one basket. Absolutely, the WA economy has too many eggs in the iron or the resource basket,\" Mr Grudnoff said.\n\n\"Economic history is littered with examples of economies that were overly specialised, and then something came along and disrupted that market … and so those economies have withered and died.\"\n\nReducing WA's reliance on iron ore easier said than done Photo shows A dump truck emptying a pile of red dirt into a very large mine - there are hills in the background. Whether WA can ever develop industries to replace iron ore is a pressing question that appears to have few answers in Treasurer Rita Saffioti's inaugural budget.\n\nThe best economies are diversified but Mr Grudnoff conceded this was \"easier said than done\".\n\nIt's difficult to predict ahead of time what areas are beneficial to diversity into, according to Mr Grudnoff.\n\n\"It's the government's job, not necessarily to pick winners, but to allow the economy to be able to grow into areas that it is particularly good at and expand in those areas,\" he said.\n\nBut what if demand did dry up?\n\nHouse prices and unemployment rates in WA would be affected.\n\nWith mining workers typically earning high wages, the sudden loss of employment would have an \"immediate downward impact on house prices\", as unemployed workers rush to sell, unable to service a mortgage.\n\nConfidence WA well-placed to weather iron ore price slump Photo shows Iron ore stockpiles line up on a coastline China's cooling property market has seen iron ore prices tumble faster than expected this year, and the decline could see $3 billion wiped from the federal budget. How concerned should WA be?\n\n\"Yes, we would definitely see perhaps an uptick in unemployment. Yes, house prices in particular would be impacted by a slowdown,\" Mr Grudnoff said.\n\n\"We've seen this over decades, where the boom and bust in the mining industry has caused these ups and downs in the housing market.\n\n\"But more broadly, I think the economy would continue on, just perhaps at a slower rate.\"\n\nThe state budget forecasts WA's iron ore royalty income will drop to $5.7 billion in 2027-28, but that’s based on the assumption the iron ore price will return to its long-term average.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/mollie-ocallaghan-australian-open-swimming-championships/105199018",
        "title": "Mollie O'Callaghan faces down 'most difficult period' to win gold",
        "publish_date": "Mon, 21 Apr 2025 20:26:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Olympic champion Mollie O'Callaghan says she has just come through one of the toughest periods of her swimming career, but still overcame a packed field to win 100m freestyle gold on night one of the Australian Open Swimming Championships.\n\nO'Callaghan won the blue-riband event in 53.12 ahead of fellow Olympian Meg Harris (54.03) and Alexandra Perkins (54.21).\n\nBut after a disrupted return to the pool following a hard-earned rest to recover from her stunning Paris Olympics, O'Callaghan can be positive about how she backed up.\n\n\"It feels weird to be back racing,\" O'Callaghan told ABC Sport on pool deck at the Sleeman Sports Centre on Brisbane's south side.\n\n\"For myself, I'm at a different stage compared to everyone else, I've had a different type of break and a different lead-in to this comp.\n\n\"I've just been focusing on myself.\"\n\nMollie O'Callaghan claimed gold by almost a second. (Getty Images: Chris Hyde)\n\nO'Callaghan, who is a two-time Olympian at just 21 years old, went into the Paris Games under extraordinary pressure after a series of stunning performances as a teenager, including three individual world titles in the 100m (2022 and 2023) and 200m freestyle (2023).\n\nShe is the first to acknowledge she puts a lot of the pressure on herself, but it's hard to argue she didn't perform.\n\nFive medals, three of them gold, including the much-anticipated 200m freestyle against teammate Ariarne Titmus — who is not competing in Brisbane this week — put O'Callaghan in rarefied air as one of the top performers of last year's Games.\n\nThe effort of that took its toll though, leading to a well-earned break.\n\n\"I had about five months off post-Olympics,\" O'Calaghan said.\n\n\"I had the rest of 2024 off where I was, like, gonna live life.\n\n\"Forget about swimming, flying around, travelling. I was enjoying it, just being able to do stuff for once.\n\n\"I think swimmers, we're so enclosed, it's all about swimming.\n\n\"Personally for myself, I didn't feel like I had a social outlet or a life outside of swimming, especially being 20 years old.\"\n\nAfter any lengthy lay-off, returning to full action can be tough, and O'Callaghan admitted she struggled.\n\n\"It's been a long process, it's a bit of a chain reaction, like your body is under panic because I'm trying to play catch up to everyone else,\" she said.\n\n\"I haven't really had a full week where I feel like I've done the proper training or have done the full set of training without modifications because my body's just been on constant shut down.\n\nMollie O'Callaghan said she puts herself under pressure to perform. (Getty Images: Chris Hyde)\n\n\"I felt like I've been knocked back quite a few times heading into this comp, so I've been having a lot of support from my team around me to try and set my mental space up because I know that I don't think I'm going to be on par with what I did last year and I've just got to accept that this is going to take time.\n\n\"At the end of the day, LA [2028 Olympics] is four years away and you've got to make sure you're in the right headspace for them.\"\n\nO'Callaghan has a busy program of events this week despite her lack of training, but by letting go a little of the enormously high expectations she has of herself, she was able to relax and win gold.\n\n\"I kind of told myself there's no pressure to perform here because of my circumstances,\" she said.\n\n\"It's myself that puts pressure on me and I've looked back and reflected and I'm like, 'oh, I gotta give myself a little bit of a break'.\n\n\"I'm still tough on myself, I still, through the sessions, get a bit frustrated, a bit angry, because I'm not physically capable of doing things like I'm used to.\n\n\"I have been working with my psychologist and we've been thinking about different processes and perspectives on racing and I felt like today I could think about executing the race properly rather than the outcome.\n\nMollie O'Callaghan would have been pretty happy with the outcome on Monday night. (Supplied: Swimming Australia/Delly Carr)\n\n\"Leading up to this I've been really nervous and doubting myself in a way, being like 'I'm not gonna be where I wanna be', because I'm always hungry for more and I wanna be the best, and that's the part of sport.\n\n\"But I was also quite excited to see what I'm capable of doing after such a long, difficult period.\n\n\" It's probably been one of the most difficult periods in my career so far. \"\n\nDespite the challenges, O'Callaghan has still come away with another piece of gold to add to her burgeoning collection.\n\nFeaturing two of the Paris Olympic finalists and three of the gold medal-winning 4x100m relay team, the 100m field was stacked.\n\nShayna Jack (54.56) was only fast enough for fifth behind 18-year-old Bond swimmer Hannah Casey (54.52).\n\n\"It's a stacked field and it's a privilege to race against a stacked field,\" O'Callaghan said.\n\n\"At the end of the day, those girls are the ones pushing me to be better and I'm pushing them to be better and that's what makes us such a dominant and strong country.\n\n\"We take from each other and we learn and we grow as athletes and I think that's the important part.\n\n\"We all lean on each other; I know I can turn to any of these girls and run and tell them whatever I want and they're always there for me.\n\n\"We don't view each other as competitors, more as a family in a way. So it's kind of nice to know that outside of a competition, we're together.\n\n\"In the water, it's a competition and we're gonna fight over it, but we can leave it behind at the end of the day.\"\n\nMcEvoy claims 50m fly\n\nCameron McEvoy won the 50m butterfly at the National Championships. (Getty Images: Chris Hyde)\n\nIn the other events, Cam McEvoy won 50m butterfly gold with an impressive 23.18, having swum within 0.02 of his personal best (23.09) in qualifying that morning.\n\nHe did not set the fastest time of the day though, with Italian guest swimmer Thomas Ceccon setting an all-comers record of 23.00 in the heats before withdrawing from the final.\n\n\"I gave it a crack, I almost got it back, I was, what, 0.09 behind him?\" McEvoy told ABC Sport.\n\n\"But he's 2023 world champ in this event and like ninth best ever in history in terms of top 10 rankings.\n\n\"So he's a good guy to compare myself to with this event, especially with LA coming up.\"\n\nCeccon, who has been training with St Peter's Western for the last couple of months, won the 200m backstroke in 1:55.71 to meet the qualifying standard for the World Championships.\n\nOlympic silver medallist Elijah Winnington claimed gold in the 400m free, but was unimpressed with his time of 3:45.97, just ahead of St Peter's Western teammate Ben Goedemans (3:47.03).\n\nElijah Winnington said there was a lot of work still to do. (Getty Images: Chris Hyde)\n\nA challenging return to the pool has meant he is not exactly where he wants to be, telling ABC Sport he needed to go \"back to the drawing board\".\n\n\"I've gotta keep working,\" he told ABC Sport.\n\n\"Internationally there are guys going 3:39 so, as much as a 3:45 in season isn't too bad, there's guys going six second faster that I'm trying to chase down.\"\n\nHarrison Vig (S9) won the multi-class men's 400m freestyle with an impressive 4:25.53, while Hannah Price (S10) claimed the women's title.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIn the men's 100m breaststroke, Paris Olympian Sam Williamson tore down the opening 50 metres and hold on to claim the title in a time of 1:00.46.\n\nHe edged out a fast-finishing Bailey Lello (1:00:66) and Olympic semi-finalist Josh Yong (1:01.15) for the podium spots.\n\nIn the 200m individual medley, Olympic finalist Ella Ramsay cruised home in 2:10.05 to claim gold ahead of Tara Kinder (2:11.29) and Isabella Boyd (2:13.13).\n\nMultiple Olympic champion and Paris bronze medallist in the 200m medley Kaylee McKeown cooly swam a 2:08.58 in qualifying on Monday morning — the second-fastest time in the world this year — but opted not to swim the final.\n\nParis Olympian Lani Pallister claimed gold in the 800m freestyle ahead of New Zealand's Erika Fairweather and open water specialist Moesha Johnson.\n\nJack Ireland (S14) won the 200m freestyle multi-class event, with Dylan Logan (S15) winning the 50m multi-class race.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-22/queensland-government-spends-162k-recruiting-four-bureaucrats/105196574",
        "title": "Queensland government spends $162k recruiting four bureaucrats",
        "publish_date": "Mon, 21 Apr 2025 19:43:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland taxpayers have footed a $162,500 recruitment bill for the government to hire four top bureaucrats.\n\nAfter coming to power in October, the LNP government kept 12 directors-general or agency heads who served under Labor but also made ten new appointments.\n\nThe government has confirmed four of the appointees were identified after it used executive recruitment services that cost tens of thousands of dollars.\n\nAmong them was the new director-general of the Department of Education, Sharon Schimming, who had already been acting in the role for several months.\n\nThe external recruitment services the government paid for to identify her came in at $37,950.\n\nAnother $45,033 was spent on executive recruitment services to hire the new boss of the Department of Justice, Sarah Cruikshank.\n\nThe services to employ the director-general for the Department of Women, Aboriginal and Torres Strait Islander Partnerships, and Multiculturalism, Natalie Wilde, was $44,550.\n\nPremier David Crisafulli's government has been in power since October last year. (AAP Image: Russell Freeman)\n\nAlmost $35,000 in recruitment costs were also incurred to employ Department of Families, Seniors, Disability Services, and Child Safety director-general Belinda Drew.\n\nThe total recruitment bill for all four appointments came in at about $162,500.\n\nThe government would not say why it was necessary to spend money on recruitment services, and it also would not explain the services that were provided to them.\n\nIn a one-line statement, a Crisafulli government spokeswoman said: \"Queensland's director-general appointments deliver a mix of experience and new energy and allow the government to deliver on its commitment of a fresh start.\"\n\nLabor also used recruitment services\n\nContract disclosures from the Public Sector Commission show the former Labor government also used external recruitment searches to hire department heads.\n\nThis included five recruitment services in their last year in power that collectively cost more than $207,000.\n\nCorporate job growth outstrips rise in frontline roles Photo shows Top of 1 William Street building in Brisbane CBD, taken from South Bank with bougainvillea flowers in the foreground. New data to be released today with Queensland's state budget reveals the state's public service has added about 11,700 full time equivalent employees in the past year.\n\nThe LNP government has confirmed five new directors-general were recently recruited through non-advertised processes.\n\nUnder treasurer Paul Williams was also identified following a recruitment search for a new chief executive officer for Queensland Treasury Corporation.\n\nDirectors-general are the most senior public servants in the Queensland government and can earn bigger salaries than the ministers they serve.\n\nThe most senior director-general under former premier Steven Miles was Mike Kaiser, who headed up Department of Premier and Cabinet.\n\nMr Kaiser was among the ten directors-general who left their roles when the LNP took office — most through mutual separation or termination.\n\nWhile in opposition, the LNP was critical of Mr Kaiser's appointment to the top job. He had previously served briefly as a state Labor MP in the earlier 2000s.\n\nPremier David Crisafulli appointed Damien Walker to succeed Mr Kaiser as director-general of the department.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-leaders-pay-tribute-to-pope-francis-early-voting-opens-20250421-p5lt9n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Leaders pay tribute to Pope Francis; early voting opens",
        "publish_date": "Tue, 22 Apr 2025 11:55:32 +1000",
        "category": "finance",
        "authors": [
            "Angus Thomson"
        ],
        "text": "Tax is a substantial issue in this election campaign, with the government promising a small tax cut over coming years that’s been opposed by the Coalition which is offering its own one-off tax reduction.\n\nNew figures from the Australian Bureau of Statistics, released this morning, shows why tax is still front and centre for the major parties.\n\nLoading\n\nIt reported that total tax revenue collected by all levels of government grew by 6.1 per cent in 2023-24 to a record $801.7 billion. As a share of the economy, it reached 30 per cent after slipping to 27.8 per cent during the depths of the COVID pandemic.\n\nThe federal government is by far the biggest tax collector, bringing in $649 billion, an increase of 5.1 per cent.\n\nBut most states lifted their tax collections by far more. Victoria had the biggest increase, by a substantial 14.2 per cent, followed by NSW (11.8 per cent), South Australia (11.3 per cent) and Queensland (10 per cent).\n\nOn a per capita basis, federal taxation collections lifted by 2.6 per cent to $24,097 per person. This includes personal, company, superannuation and fringe benefits taxes.\n\nThe Victorian government lifted its tax hit per person by a nation-leading 9.5 per cent to a record $6348. In NSW, it grew by 8.8 per cent to $6016 while in Queensland, it increased by 6.6 per cent to $5051.\n\nDefying the trend was the ACT government where tax per person actually fell by one per cent to $5551.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/that-was-real-class-why-mitchell-moses-reminds-eddie-jones-of-an-english-rugby-legend-20250422-p5ltbk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘That was real class’: Why Mitchell Moses reminds Eddie Jones of an English rugby legend",
        "publish_date": "Tue, 22 Apr 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Moses gathered the Eels playing group into a huddle and urged them to stay composed. The Tigers players were scattered across the field, with nobody looking or talking to each other.\n\nBut Moses’ defining moment came in the 54th minute, when Tigers winger Sunia Turuva and Eels forward Luca Moretti were binned for their part in a melee that had spilled over the sideline at CommBank Stadium.\n\nHe finished with four try assists, including the kick for Simonsson, and a cutout ball for Josh Addo-Carr’s first four-pointer.\n\nMoses returned from a foot injury to play his first game of the season, and was sensational in the 38-22 win over the Wests Tigers on Easter Monday.\n\nJones said of Moses’ leadership at that crucial stage of the game: “It was going to be [interesting] how both teams responded to what had just happened … which team could get their focus the quickest. And that was Parramatta under Mitch. He gave them the drive and direction.\n\n“Mitch’s ability to get the players together and work together, they kept fighting for each other.\n\n“With Mitchell coming back, you could also see the quality of Rylsey’s coaching coming through. You need someone on the field who coaches and runs the team how you want them to be coached, and Mitchell does that. If you don’t have that, it’s really difficult.”\n\nFive-eighth Dylan Brown was arguably the biggest winner from Moses return, and relished being able to return to his running game rather than steer the team around the park. Seeing Brown run for more than 160m and relishing the freedom, however, must have Newcastle scratching their head when you consider they paid him $13m over the next ten years to run the show like Moses.\n\nJones said of Brown: “He ran the ball more, he was noticed because he was such a great runner of the ball, and people tried to make him into something he’s not. Unfortunately, like anything, we get influenced by outside views.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/how-400-000km-in-an-old-toyota-a-single-mum-and-a-brush-with-death-shaped-matt-hill-s-career-20250321-p5lldz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How 400,000km in an old Toyota, a single mum and a brush with death shaped Matt Hill’s career",
        "publish_date": "Tue, 22 Apr 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "It has just gone midday and the warm and genial commentator orders a large cappuccino. When pressed again about his ability, or inability, to retain quiz-winning volumes of general knowledge, he has a logical explanation: race callers, he says, train their brains to forget. “We are learning and sieving, learning and sieving, learning and sieving,” he says. Hill says that he can memorise a field of 15 horses in under five minutes, call them in a race and then forget them three minutes later. “I don’t retain stuff, I don’t recall stuff,” Hill says. “I listen to the news a lot. I like listening to the news, and I will forget two days later what was in the news.”\n\nHill chose this cafe because it is central to his story. Hill was eight when his father, Trevor, left the family. His brother, Timothy, was six. For the rest of their schooling life they were raised by their single mum, Susan, in her Altona Meadows house, which is just around the corner from Little Rosebery. Hill now lives in his mother’s home, having agreed to buy his brother out when Susan died in August last year. Matt Hill in his favourite local haunt. Credit: PENNY STEPHENS “She worked so hard to own that home, you know,” Hill says of his emotional attachment to the family house.\n\n“This area has been my whole life. I played basketball as a kid up the road, and we are literally 20 metres from where I caught the school bus for six years [to St Paul’s College in North Altona].” Hill’s career is intrinsically linked to his mother. As a 15-year-old, she would drive him across the state to pursue his passion – calling races at Sale, Shepparton, Stawell and even as far afield as Mildura on Melbourne Cup Day. Matt Hill has called eight Melbourne Cups. Credit: Michael Rayner “Her little yellow Toyota probably did about 400,000 clicks,” he says. “I’d get on the phone and ring race clubs, and I’d say, ‘Would you like a race caller for your non-TAB meeting?’ They’d say, ‘Yeah, can you get here?’, and Mum would drive me. “Then what would happen is my grandfather, who loved racing, and so did my grandmother, they would come along, too. So it ended up being a family expedition.”\n\nDespite his tender age and experience, Hill was always welcomed on course, especially at picnic race meetings where they had often relied on untrained members of the public to call their races. During one meeting at Pooncarie in NSW, the publican had a go and was so bad he was booed off the stand. The next year they agreed to give 16-year-old Hill a chance. When he wasn’t crisscrossing the state, teenage Hill and his family would head to Flemington or Moonee Valley. There, he would find a spare seat or hunt out an empty broadcasting box in the grandstand, and call the races on his own. “I should have been out chasing girls or with my mates, but I was honing what I was doing, you know, calling into a tape recorder,” he says. “That was my life, and I loved it. I would never have changed it, you know. I couldn’t wait to get to Flemington and practise calling.”\n\nHill says his mother never passed judgment on his work unless he mentioned it first. Loading “There’d be times when I’d come home, it might have been the Cox Plate or a big name, and I’d say, ‘Mum, I stumbled over a name there’, or something, and she’d go, ‘Oh yeah, I noticed that.’ “She would listen to everything. Even in her days in the nursing home, she was listening to me call the football on the radio. Half the time, it was a good way of knowing where I was.” Hill still speaks to his father, who lives in Queensland, but says they are not close.\n\n“Mum worked at the National Bank, she was a PA, and then Dad was an engineer,” he says. “So there’s really no radio broadcasting, not even a racing background. I am self-made in a way.” Hill, 44, says he comes to Little Rosebery three days a week. He spreads the newspaper across its wooden tables, studies the formguide and usually opts for something simple, like Vegemite on toast or a BLT, which the cafe has added to its menu especially for its regular guest. But today he is going to venture into uncharted waters. “I’m gonna hedge my bets,” he says in his signature mellifluous tone. “Gonna have a smashed avo, and get some bacon on the side.”\n\nI opt for one of their bestsellers – Thai chilli eggs. Hill is still working through his coffee, but I order a large glass of pear and apple juice to accompany my meal. Hill lives on his own, with his dog, and describes his profession as “the love of my life”. “It’s very cliche to say I am married to the job, but I am because it is my hobby as well. It really is,” he says. “I sort of live to work. I just love it.” The multi-talented sport commentator is lucky to be alive. After he finished year 12, he started running errands at a Melbourne radio station, won a racing industry scholarship at 19 and became Sydney’s main race caller. But it was on assignment in Beijing, calling at the 2008 Olympics for the Macquarie Radio Network, that he fell seriously ill. He was flattened by double pneumonia and his body started shutting down. There were fears he wouldn’t survive.\n\nHill was flown to Hong Kong, where a medical professor, who had worked through the 2002-2004 SARS outbreak, “slammed” him with a concoction of antibiotics. It was later discovered he had melioidosis, a bacterial disease spread through soil, air and water that had a 90 per cent death rate. “It is actually very similar to COVID,” Hill says. “I just happened to be unlucky – lucky and unlucky at the same time because to be brutally honest, if I were a smoker, if I had an unhealthy lifestyle, I wouldn’t be here. I was young enough to fight it.” Rather than slow him down, the near-death experience pushed Hill to work harder. “All I ever wanted to do was call at the Olympics,” he says. “So it just made me so determined after that. It just made me want it more. It made me want to almost kind of prove myself, actually. Like, I felt like I just needed to prove myself again.\n\n“I don’t know why ... I saw the illness almost as a weakness, which was a silly thing to do because anyone can get sick, but I wanted to achieve even more then. “So, in a way you do realise, and I realise it now with the death of my mum some 16 years later, that we are not here for a long time.” Hill called the Olympic rowing for Nine in Paris, as well as the athletics for Nine radio. But he is about to make a bigger splash in AFL. Fox Footy’s Thursday night AFL callers Matt Hill (left) and Mark Howard. This year he is locked in to call 45 games for Fox Footy, alongside Mark Howard on Thursday nights and Dwayne Russell on Sundays, as well as 25 games for SEN radio on Friday nights.\n\nHe will also cover Melbourne’s major race meetings every Wednesday and Saturday afternoon. “This year is going to be the hardest year I’ve ever worked,” he says. “My biggest challenge, I’ve found, is I naturally have a quick, quick flow because of calling horse races. So I don’t want to sound like it’s a race caller at the football – that’s my challenge. “But it is a fast game. You know, you can be saying something, and the ball might go through four pairs of hands. I try and say as many players’ names as I can, and I try to be as accurate as I can.” Hill, who grew up watching and supporting the Western Bulldogs, says it is difficult to pick up footballers’ numbers during a game, so he concentrates on their faces. Or their unique markings. “I’ve got a pretty old-fashioned approach in that I get Google Images up, and I just look at their faces as if I’m meeting them for the first time,” he says of his AFL preparation.\n\n“You just put a name to the face. Then I’ll watch their game from the week before, so I’ll study both of the teams from the week before. “And then for me, the most important, this is where the race caller comes out in me. I don’t know how many people do this, I have to be there an hour before the game because I want to see them physically in the flesh when they’re warming up. The receipt for our lunch at Little Rosebery cafe. “Then what I tend to do is look for their coloured boots, anything that’s different – coloured boots, tattoos, strapping is important. “If there are a couple of players that look the same, and it might be something really simple, like, you know, a little tatt on the left knee or left shin, or just something that – if the ball’s being given to a player quickly – I can pick up on who it is quickly.”\n\nOur discussion returns to Hill’s mother and his first Melbourne Cup call without her. “Two days after Mum died, my brother and I were driving to Tobin Brothers, to the funeral home, and Tim said to me, ‘What do you reckon Mum would like played at her funeral?’” Hill says. “He said, ‘She loved Life Is a Rollercoaster, by Ronan Keating’. Within seconds, it came on the radio. So that was a bit sort of, ‘Wow, she’s still here.’ “Then on the day of her funeral, the week later, it was announced in the paper that Ronan Keating would sing on Melbourne Cup Day. He sang 30 minutes before the Melbourne Cup. “So I took that as a little bit of a ‘she’s still with me’. And, thank Christ, he didn’t sing Life Is a Rollercoaster before the Cup because that would have made me a wreck.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/dadfluencer-ben-tate-opens-up-about-his-sobriety-journey-20250422-p5ltdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Dadfluencer’ Ben Tate opens up about his sobriety journey",
        "publish_date": "Tue, 22 Apr 2025 11:44:15 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "‘Dadfluencer’ Ben Tate opens up about his sobriety journey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-early-voting-opens-today-20250421-p5lt5j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Early voting opens today | Meteor lights up skies over Qld | PM affected by Pope’s death",
        "publish_date": "Tue, 22 Apr 2025 11:36:09 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Premier David Crisafulli has used the start of term two to announce what he describes as a nation-leading plan to address bullying in Queensland schools.\n\nLoading\n\nUnder a $33 million package, the government will establish Rapid Support Squads to target bullying hotspots and provide staff training, family support and mental health assistance.\n\nEach of Queensland’s eight education regions will be assigned a three-person squad, and Crisafulli said they would “fly in” to rural and remote schools as required.\n\nThe package also includes funding for additional chaplains and student wellbeing staff, a new hotline, and the formation of an Anti-Bullying Stakeholder Reference Group.\n\n“We’ve lost too many young lives to bullying, which is why we’re delivering a plan to put the spotlight on this serious issue,” he said.\n\n“This is about turning the tables on bullying and bolstering support for kids, parents and schools.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/passengers-evacuate-on-tarmac-after-engine-fire-20250422-p5ltdr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Passengers evacuate on tarmac after engine fire",
        "publish_date": "Tue, 22 Apr 2025 11:33:53 +1000",
        "category": "finance",
        "authors": [],
        "text": "Passengers evacuate on tarmac after engine fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-record-sale-ends-perth-family-s-40-year-land-holdout-20250421-p5lt79.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Record sale ends Perth family’s 40-year land holdout",
        "publish_date": "Tue, 22 Apr 2025 11:32:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "A tightly held block of land in Perth’s southern suburbs, which had an entire suburb built around it, has sold to an overseas developer for a staggering $4 million.\n\nAfter four decades of holding out selling to developers, the family listed the six-acre Wattleup Road property in Hammond Park for sale last September.\n\nThe cash sale price is believed to be a record for the area.\n\nThis large property stands out among a sea of new builds in Hammond Park. Credit: Effective Property Solutions\n\nEffective Property Solutions head of property investment Ollie Salimi said the sale received eight offers from established developers.\n\n“The successful buyer is an overseas-based vertically integrated building and development company,” he said.\n\n“The plan is to use the site for residential development to meet strong demand for homes in this flourishing southern Perth suburb that’s a major growth corridor.”\n\nSalimi said the family was thrilled to finally secure a sale of the prime urban infill site after a number of unsuccessful efforts.\n\n“This family had fielded many approaches by developers over a decade and had listed the land on this prominent road twice before, however, it was only on this third attempt that the sale got over the line with all parties,” he said.\n\n“It proved worth the wait with the price exceeding the sellers’ expectations by 20 per cent.”\n\nThe property includes a double-brick home with four bedrooms, two bathrooms and a semi-detached two-bedroom granny flat.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-nsw-coastal-village-that-could-be-the-next-gold-coast-20250408-p5lq8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The NSW coastal village that could be the ‘next Gold Coast’",
        "publish_date": "Tue, 22 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "Councillors fear a coastal NSW town favoured by holidaymakers could become the next Gold Coast as draft housing plans to lure developers propose accommodation blocks of up to 100 metres tall.\n\nEurobodalla Shire Council – which covers the villages of Batemans Bay, Narooma and Moruya on the far South Coast – is grappling with the desires of locals and tourists to preserve coastal views and a relaxed character, while providing much-needed housing for low-income families.\n\nAn artist’s impression of how Batemans Bay would look by 2100 under a draft master plan. Credit: Eurobodalla Shire Council\n\nMayor Mathew Hatcher wants to turn Batemans Bay into a “bustling town centre” with a mixture of housing types to allow residents to live within walking distance of amenities.\n\nBut some councillors have criticised the plans as “overambitious” and say they will turn the laid-back coastal village into a “developers’ delight” that’s “more Gold Coast than Noosa”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/aussie-tennis-star-surprised-by-fiancee-mid-interview-20250422-p5ltdk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie tennis star surprised by fiancée mid-interview",
        "publish_date": "Tue, 22 Apr 2025 11:28:51 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Aussie tennis star surprised by fiancée mid-interview\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/viral-tiktok-miracle-tree-draws-hundreds-seeking-healing-and-hope-20250422-p5ltdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Viral TikTok \"Miracle Tree\" draws hundreds seeking healing and hope",
        "publish_date": "Tue, 22 Apr 2025 11:28:51 +1000",
        "category": "finance",
        "authors": [],
        "text": "Viral TikTok \"Miracle Tree\" draws hundreds seeking healing and hope\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/opera/win-an-exclusive-opening-night-experience-at-the-fairy-queen-20250331-p5lnxp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Win an exclusive opening night experience at The Fairy Queen*",
        "publish_date": "Tue, 22 Apr 2025 11:23:40 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "To celebrate Pinchgut Opera’s debut at the Roslyn Packer Theatre, Walsh Bay, you have the chance to experience Purcell’s The Fairy Queen in true VIP style.\n\nRenowned for its signature fusion of Baroque music and theatrical innovation, Pinchgut brings this spellbinding masterpiece to Sydney’s premier theatrical stage, led by acclaimed UK director Netia Jones in her Australian debut. Known for her cutting-edge use of technology and projection, Jones will transform The Fairy Queen into a visually dynamic and immersive experience like no other.\n\nThe Fairy Queen, Pinchgut Opera Credit: Pinchgut Opera\n\nEnter now to win 1 of 3 exclusive opening night packages, valued at over $500, including:",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/kooyong-mp-rebuffs-sky-news-20250422-p5ltd8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kooyong MP rebuffs Sky news",
        "publish_date": "Tue, 22 Apr 2025 11:09:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Kooyong MP rebuffs Sky news\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/20-minute-hat-trick-confirms-leeds-promotion-20250422-p5ltcv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "20-minute hat-trick confirms Leeds' promotion",
        "publish_date": "Tue, 22 Apr 2025 10:49:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "20-minute hat-trick confirms Leeds' promotion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/video/coalition-pledges-355-million-extra-to-fight-crime/w1iw4vi8g",
        "title": "Coalition pledges $355 million extra to fight crime",
        "publish_date": "Tue, 22 Apr 2025 01:27:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/perth-doctor-returns-from-gaza-urges-albanese-to-hear-first-hand-accounts-from-aid-workers/kp1mtb9zd",
        "title": "Perth doctor returns from Gaza, urges Albanese to hear first hand accounts from aid workers",
        "publish_date": "Tue, 22 Apr 2025 01:16:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-world-mourns-pope-francis/rag8jnj6g",
        "title": "The world mourns Pope Francis",
        "publish_date": "Mon, 21 Apr 2025 21:22:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nEvening mass held at Notre Dame Cathedral in Paris paid tribute to Pope Francis - one of thousands of services around the world remembering the man who led the Roman Catholic church since 2012.\n\n\n\n\n\nHis death was announced on Monday night by Cardinal Kevin Farrell.\n\n\n\n\n\n\"Dearest brothers and sisters, with deep sorrow I must announce the death of our Holy Father Francis. At 7.35 this morning, the Bishop of Rome, Francis, returned to the house of the Father. His entire life was dedicated to the service of the Lord and of His Church. He taught us to live the values of the Gospel with fidelity, courage, and universal love, especially in favor of the poorest and most marginalised. With immense gratitude for his example as a true disciple of the Lord Jesus, we commend the soul of Pope Francis to the infinite merciful love of the one, triune God. Thankyou.\"\n\n\n\n\n\nThe 266th pope has been praised for his outreach to the poor and the vulnerable; his concern for the environment; and his efforts to call for peace and seek an end to conflicts - like those in the Middle East, Ukraine and Africa.\n\n\n\n\n\nThe first Latin American pontiff charmed the world with his humble style and concern for the poor, but alienated many conservatives with his critiques of capitalism and climate change.\n\n\n\n\n\nFrom Argentina, where Pope Francis was born, President Javier Milei released a statement on the Catholic leaders passing.\n\n\n\n\n\n\"The Argentine Republic, a country with a long Catholic tradition and the homeland of Pope Francis, deeply mourns the departure of His Holiness and sends its condolences to the Bergoglio family. The President of the Nation accompanies in this sad moment all those who profess the Catholic faith and who found in the Supreme Pontiff a spiritual leader.\"\n\n\n\n\n\nIn a statement on social media platform X, French President Emmanuel Macron said this:\n\n\n\n\n\n\"From Buenos Aires to Rome, Pope Francis wanted the Church to bring joy and hope to the poorest. To unite people with one another and with nature. May this hope be reborn endlessly beyond him. To all Catholics, to a grieving world.\"\n\n\n\n\n\nPope Francis suffered from chronic lung disease and had part of one lung removed as a young man.\n\n\n\n\n\nHe was admitted to a hospital on February 14th, for a respiratory crisis that developed into double pneumonia.\n\n\n\n\n\nHe spent 38 days there, the longest hospitalisation of his 12-year papacy.\n\n\n\n\n\nPope Francis said he wished to be buried not in St Peter’s Basilica or its grottoes, where most popes are buried, but in the St Mary Major Basilica across town.\n\n\n\n\n\nIt's the church where his favourite icon of the Virgin Mary, the Salus Populi Romani, is located.\n\n\n\n\n\nIn November 2024, Francis reformed the rites to be used for his funeral, simplifying them to emphasise his role as a mere bishop and allowing for burial outside the Vatican.\n\n\n\n\n\nPrime Minister Anthony Albanese says Pope Francis was never afraid of change.\n\n\n\n\n\n\"This was a papacy of firsts. The first Pope to hail from the Americas, the first Jesuit Pope, and the first to take the name of that great champion of the poor St Francis of Assisi. Pope Francis' compassion embraced all humanity and today he will be mourned by Catholics and non Catholics alike.”\n\n\n\n\n\nOpposition leader Peter Dutton praised the Pope's lifestyle and vision for what was possible.\n\n\n\n\n\n\"He lived frugally and simply, above all else, he was driven by Christ's values of mercy and forgiveness. He emphasized those values in his last Christmas address, saying, and I quote 'God's mercy can do all things. It unties every knot. It tears down every wall of division. God's mercy dispels hatred and the spirit of revenge.' With God, may Pope Francis, rest in peace.\"\n\n\n\n\n\nIn St Peter's Square in Rome, thousands of mourners stood beneath the balcony where Pope Francis had blessed the crowd just the day before his death.\n\n\n\n\n\nMany held rosaries and prayed for the pontiff.\n\n\n\n\n\nSome cried.\n\n\n\n\n\nOne person was seen wrapped in the flag of Argentina, the pope’s homeland.\n\n\n\n\n\nAustralian Johann Xavier says he has come to Rome to grieve and pay his respects.\n\n\n\n\n\n\"We are really sad about it. We come from Australia, we are hoping that there was some chance to see him but then we heard about it when we came in here. It pretty much devastated all of us.\"\n\n\n\n\n\nGathering for morning prayers outside Westminster Cathedral in London, priest Jonathan Beswick says he's deeply saddened.\n\n\n\n\n\n\"It's one of those things you always know where you were when you heard the news. And I had a message from my wife just saying that the Holy Father had died. And I'd actually called her just a few minutes beforehand to come and pray. But the doors were closed. Obviously, the news hadn't got out until that moment. And so I turned around and came back again and just came here for morning prayer. \"\n\n\n\n\n\nIn Cape Town, South Africa, Nazir Reddy is among those gathering at St Mary's Catholic Cathedral.\n\n\n\n\n\n\"It's a bit sad especially for all the Catholics around the world, it's a sad day. Many good people have come and passed on and we hope that the next Pope can be as good as the next and leave a good example.\"\n\n\n\n\n\nUnited Nations Secretary General Antonio Guterres spoke for many in his tribute.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/early-voting-begins-today-heres-a-cheat-sheet-of-what-australians-are-being-promised/5jiwzgq5a",
        "title": "Early voting begins today. Here's a cheat sheet of what Australians are being promised",
        "publish_date": "Mon, 21 Apr 2025 19:41:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Early voting has begun for the federal election and millions of Australians are expected to submit their ballot ahead of election day on 3 May.\n\n\n\n\n\nPrime Minister Anthony Albanese and Opposition leader Peter Dutton have spent the last few weeks pledging billions of dollars in commitments as they try to sell voters their vision for Australia's future.\n\n\n\n\n\nHere's an overview of the major national pledges so far. Scroll down as we've covered topics including Health , Small Business and Industrial Relations , Housing , the Cost of Living , Defence , Indigenous Affairs , Young People , Energy , and Migration .\n\n\n\nHEALTH\n\nLabor\n\n\n\n\n\nLabor hopes to incentivise more doctors to bulk bill patients as part of an $8.5 billion boost to Medicare , which also includes $400 million to train more nurses and doctors.\n\n\n\n\n\nThe government will also open an extra 50 urgent care clinics — on top of the 87 already operating — by June 2026, at a cost of $644 million.\n\n\n\n\n\nWomen suffering from endometriosis, pelvic pain or menopause will have access to more specialised clinics as well as cheaper medicines, with Labor pledging a $573 million boost to women’s health.\n\n\n\nThis includes adding certain oral contraceptives, endometriosis medication and IVF medication to the Pharmaceutical Benefits Scheme (PBS).\n\n\n\n\n\nThe government has promised to cap the cost of most prescriptions to $25 (currently $31.60) — and $7.70 for concession card holders — by January 2026.\n\n\n\n\n\nLabor will expand access to free mental health support as part of a $1 billion investment in mental health services, which will include upgrading or establishing more than 100 mental health clinics with varying specialities. These will be supported by training an extra 1,200 mental health professionals.\n\n\n\n\n\nCoalition\n\n\n\n\n\nThe Coalition has matched Labor's Medicare promise, with a $9 billion commitment including $400 million in financial incentives for junior doctors who enter general practice.\n\n\n\nREAD MORE Billions pledged: What the parties are promising for your health this election\n\nDutton has also pledged $400 million towards youth mental health.\n\n\n\n\n\nThis includes raising the number of subsidised psychology sessions from 10 to 20, restoring them to levels set by the Morrison government during the COVID-19 pandemic.\n\n\n\n\n\nThe Coalition has also promised to go ahead with cuts to the price of medicines on the PBS as well as boost funding to women’s health care.\n\n\n\n\n\nGreens\n\n\n\n\n\nThe Greens want to expand Medicare to include dental care and mental health.\n\n\n\nSMALL BUSINESS / INDUSTRIAL RELATIONS\n\nCoalition\n\n\n\n\n\nThe Coalition has pledged to make the small business instant asset write-off a permanent tax deduction, boosting it to $30,000 for businesses with a turnover of up to $10 million.\n\n\n\n\n\nDutton also wants to increase the number of small businesses in Australia by 350,000 over four years by offering tax incentives that encourage reinvestment.\n\n\n\nUnder the entrepreneurship accelerator scheme, businesses would pay tax on 75 per cent of their first $100,000 of taxable income, and on 50 per cent of the second $100,000. The ratio of tax paid will increase in the subsequent two years of operation.\n\n\n\n\n\nSmall and medium size businesses will also be able claim up to $20,000 in staff meals each year.\n\n\n\n\n\nDutton has also walked away from plans to stop public servants from working from home , although he still plans to cut 41,000 Canberra-based jobs.\n\n\n\n\n\nLabor\n\n\n\n\n\nLabor has vowed to protect penalty rates for workers , and said it would enshrine them into law if it is re-elected.\n\n\n\n\n\nIt will also ban non-compete clauses, enabling workers earning under $175,000 to more easily switch jobs to a competing employer or to start a competing business.\n\n\n\n\n\nIn March , the government legislated an extension to the $20,000 instant asset write-off for small businesses but has not committed to making it permanent.\n\n\n\nHOUSING\n\nBoth major parties have their sights set on making housing more affordable, although critics say their policies could drive up prices .\n\n\n\n\n\nLabor\n\n\n\n\n\nLabor will expand its 5 per cent deposit scheme so that every first home buyer is eligible. The government will act as a guarantor for buyers to purchase with a smaller deposit (instead of the usual 20 per cent) saving them from having to pay lenders mortgage insurance. There will be no income limits or caps on places.\n\n\n\n\n\nIt will also build 100,000 new affordable homes exclusively for first home buyers, with construction to start in 2026/27.\n\n\n\n\n\nMore first home buyers will be able to access the Help to Buy shared equity loan scheme , which allows them to buy with a deposit of 2 per cent if they are willing to give the government a 30-40 per cent stake. Income caps will be increased from $90,000 to $100,000 for individuals, and property caps will also be increased.\n\n\n\nFirst-home buyers will get more support under the 2025 federal budget. Source: SBS News In addition to these measures, the government has committed $100 million to refurbish and build more crisis and transitional housing for women leaving domestic violence or at risk of homelessness.\n\n\n\n\n\nLabor hopes to speed up the construction of homes as part of its existing target to build 1.2 million homes by 2029, pledging $626 million towards apprenticeship incentives for construction workers.\n\n\n\n\n\nApprentices in housing construction will receive an extra $10,000 at intervals, with the first payment at six months and the last when they complete their training.\n\n\n\n\n\nCoalition\n\n\n\n\n\nFor Australians struggling to put together a deposit, a Dutton-led government would allow Australians to access $50,000 of their superannuation to buy a first home.\n\n\n\n\n\nIt has also pledged $5 billion for building infrastructure such as sewerage and water to support the construction of 500,000 new homes.\n\n\n\n\n\nFirst home buyers will also be allowed to claim tax deductions on interest payments against the first $650,000 of their mortgage. The scheme will be available for the first five years for those who purchase a newly built home.\n\n\n\nBusinesses employing apprentices in areas where there's a skills shortage can get $12,000 a year for the first two years.\n\n\n\n\n\nDutton says the housing crisis has been exacerbated by record levels of migration, peaking at 536,000 in 2022-23.\n\n\n\n\n\nThe Coalition has pledged to cut net migration levels by 100,000 place s, which will include lowering the permanent migration program by 25 per cent and a 30,000 reduction in the number of foreign students starting higher education each year.\n\n\n\n\n\nBoth major parties support a two-year ban on foreign investors from buying established homes, a policy that came into effect on 1 April 2025.\n\n\n\n\n\nThe Coalition will also scrap the government's $10 billion Housing Australia Future Fund, which aims to deliver 55,000 social and affordable homes over five years.\n\n\n\nGreens\n\n\n\n\n\nThe Greens will make housing a priority in the event of a hung parliament, calling for reforms to negative gearing and the 50 per cent capital gains tax (CGT) discount.\n\n\n\n\n\nUnder its proposal, existing investors that negatively gear properties will be allowed to continue doing so but new investors will only be allowed to negatively gear one property in the future. CGT would be phased out.\n\n\n\n\n\nThe minor party is also pledging to cap rent increases to 2 per cent across two years.\n\n\n\nCOST OF LIVING\n\nLabor\n\n\n\n\n\nAustralian households and businesses will receive an extra $150 in energy bill relief if Labor is re-elected . The money will appear as a credit on people's power bills in two $75 instalments over the last six months of 2025.\n\n\n\n\n\nIn addition, the government legislated two tax cuts for all Australian taxpayers. This means anyone earning more than $45,000 will save $268 in 2026/27 and $536 the year after. The Coalition has vowed to repeal the measure.\n\n\n\n\n\nEvery taxpayer would also be eligible to claim an instant $1,000 tax deduction for work expenses, without filling out paperwork or receipts.\n\n\n\nLabor has pledged to provide three days of subsidised childcare per week for every family and scrap the activity test for families earning less than $530,000.\n\n\n\n\n\nThe government will also make medicines more affordable by capping most PBS prescriptions to $25 by January 2026 and $7.70 for concession card holders.\n\n\n\n\n\nCoalition\n\n\n\n\n\nThe Coalition has matched Labor's promise for cheaper medicines.\n\n\n\n\n\nIt will also provide a one-off $1,200 tax offset to everyone earning between $48,000 and $104,000 when they lodge their 2025-26 tax return.\n\n\n\n\n\nMotorists can also expect to save money at the bowser, with a temporary fuel excise cut for the next 12 months.\n\n\n\n\n\nThe $6 billion pledge will see fuel excise cut from 50 cents to 25 cents a litre, and is estimated to save a one-car household an average of $14 a week or roughly $700 over one year.\n\n\n\n\n\nAustralians who want to buy a new ute will also benefit from the Coalition's plan to scrap penalties for high polluting vehicles due to take effect on 1 July.\n\n\n\n\n\nDutton says he also has an aspiration to tackle bracket creep — so that personal income tax brackets rise regularly in line with measures like inflation — which would mean people keep more of their income. But this would only be looked at after the budget is in order and he has not provided a timeframe for this.\n\n\n\nGreens\n\n\n\n\n\nThe Greens are pushing for a $29 billion early childhood package, which would give families access to 50 hours of free childcare a week and extend pre-school to 30 hours a week for all three and four-year-olds.\n\n\n\n\n\nIts policy platform includes capping rental increases and making unlimited rent rises illegal, wiping student debt, and heavily subsidising public transport so that buses, trains, ferries and tram trips only cost 50 cents.\n\n\n\n\n\nIt plans to raise $514 billion to fund these commitments by introducing a 10 per cent tax for 150 of Australia's billionaires, and 40 per cent tax on excess profits for corporations with over $100 million in turnover.\n\n\n\n\n\nThe party has also flagged changes to negative gearing and the capital gains tax discount , which it says would lower housing costs.\n\n\n\nDEFENCE\n\nLabor\n\n\n\n\n\nLabor has vowed to bolster defence spending by $50.3 billion over the next decade , growing it from 2 per cent of GDP to 2.33 per cent by 2033-34.\n\n\n\n\n\nBoth Labor and the Coalition have pledged to seek an alternate buyer for the Port of Darwin and return it to Australian hands. It was leased in 2015 to Beijing-controlled Landbridge Group for 99 years.\n\n\n\n\n\nCoalition\n\n\n\n\n\nDutton is yet to pledge a defence spending target but is expected to make an announcement ahead of Anzac Day.\n\n\n\n\n\nThe Coalition has already promised to spend $3 billion on 28 extra fighter jets, increasing Australia's fleet of F-35s from 72 to 100.\n\n\n\nREAD MORE The billion-dollar problem that neither Albanese nor Dutton wants to become a big issue\n\nGreens\n\n\n\n\n\nThe Greens want to save $77 billion by cancelling AUKUS and severing what the party says is a \"reliance on US, UK and Israeli weapons supplies\". It plans to reallocate $4 billion towards the domestic production capabilities of defence weapons.\n\n\n\nINDIGENOUS AFFAIRS\n\nBoth major parties have remained largely quiet about policies affecting Aboriginal and Torres Strait Islander peoples throughout the campaign.\n\n\n\n\n\nCoalition\n\n\n\n\n\nThe Coalition has promised a royal commission into sexual abuse in Indigenous communities and an audit into government spending on Indigenous affairs, according to a document detailing its party’s policies.\n\n\n\n\n\nIt has also pledged to reintroduce compulsory income management via the cashless debit card and an inquiry into land councils.\n\n\n\n\n\nDutton, who opposed the Voice to Parliament, had promised to hold a referendum on symbolic constitutional recognition, such as mentioning Indigenous history in the preamble of Australia's constitution, but later backed away from the idea.\n\n\n\nLabor\n\n\n\n\n\nIn the March budget, Labor set aside $1.3 billion for Closing the Gap initiatives.\n\n\n\n\n\nThis included $70.9 million on boosting the number of first nations homeowners, $23.9 million on creating employment opportunities and growth for first nations businesses, and $21.8 million for family, domestic and sexual violence services.\n\n\n\n\n\nDuring the second leader's debate, the prime minister argued schemes like Labor's free TAFE had real jobs and training outcomes — benefiting over 40,000 Indigenous people.\n\n\n\n\n\nAs part of Labor's Medicare boost, two new Headspace centres will be built in remote communities.\n\n\n\nREAD MORE Closing the Gap success stories are being written by Aboriginal and Torres Strait Islander peoples: PM\n\nThere is no mention of further reforms pushed for as part of the Uluru Statement of the Heart — including a treaty or truth-telling process — following the failure of the Voice to Parliament referendum, which was rejected by Australians in 2023.\n\n\n\n\n\n\"We accept the decision of the Australian people in that referendum,\" the prime minister said during the second leaders debate.\n\n\n\n\n\nGreens\n\n\n\n\n\nThe Greens want to establish a National Truth and Juice Commission to acknowledge the ongoing injustices experienced by First Nations people.\n\n\n\n\n\nIts policy platform includes a plan to revive First Nations languages, pledging $14 million to schools and First Nations teachers.\n\n\n\nYOUNG PEOPLE\n\nLabor\n\n\n\n\n\nRoughly three million Australians will have 20 per cent of their student debt loans wiped by 1 June 2025 , under a $16 billion pledge from Labor.\n\n\n\n\n\nThe government will also establish 100,000 fee-free TAFE places from 2027, and increase the income threshold at which students are required to start paying back their loans.\n\n\n\n\n\nApprentices in housing construction will receive an extra $10,000 paid in $2,000 instalments at regular intervals, starting at six months and finishing when they complete their training.\n\n\n\nThe government has upped it's mental health investment by $1 billion, but will not increase the number of psychology sessions.\n\n\n\n\n\nThey plan to establish 21 new youth specialist centres for more complex issues, on top of a pledge to expand, upgrade or build 58 Headspace centres.\n\n\n\n\n\nCoalition\n\n\n\n\n\nDutton has pledged $400 million towards mental health, particularly youth mental health and expanding services such as Headspace which assists 12 to 25-year-olds.\n\n\n\n\n\nThe Coalition's plan includes reinstating 20 free Medicare-subsidised psychology sessions per year.\n\n\n\n\n\nIt plans to cap new international student enrolments to 240,000 a year, a reduction of roughly 80,000 from 2023 levels. It's a bid to ease housing pressures impacting young people.\n\n\n\n\n\nGreens\n\n\n\n\n\nThe Greens have vowed to make education free and wipe all student debt.\n\n\n\n\n\nThe minor party is pushing for all psychology sessions to be subsidised as part of their bid to make mental health part of Medicare.\n\n\n\nENERGY\n\nLabor\n\n\n\n\n\nAll Australian households and businesses will receive an extra $150 in energy bill relief if the Albanese government is re-elected.\n\n\n\n\n\nLabor will also offer households a 30 per cent discount on solar power batteries as part of a $2.3 billion pledge.\n\n\n\n\n\nIt has a target for renewables — like solar and wind — to make up 82 per cent of the energy grid by 2030. More transmission lines to transport electricity across the country will also be built.\n\n\n\nLISTEN TO Climate Wars (Revisited): Party Time Ep 3 SBS News 17/04/2025 26:41 Play\n\nCoalition\n\n\n\n\n\nThe Coalition has promised to build seven nuclear power plants at an estimated cost of $331 billion on the sites of old coal-fired power plants.\n\n\n\n\n\nIt has also pledged to flood the energy market with more gas to drive down power bills.\n\n\n\n\n\nThis includes fast-tracking new gas projects (including a decision within 30 days on Western Australia’s North West Shelf project), halving approval times and imposing a levy on gas companies who prioritise exports ahead of supplying the domestic market.\n\n\n\n\n\nIt estimates that forcing exporters to set aside gas for use in Australia will drive down household bills by 7 per cent and for industrial users by 15 per cent, according to modelling by Frontier Economics.\n\n\n\nGreens\n\n\n\n\n\nThe Greens oppose new coal and gas projects as well as nuclear power. They support the electrification of households and businesses to drive down power bills and reduce emissions.\n\n\n\n\n\nThe minor party proposes grants of up to $1,000 and low-interest loans of up to $20,000 to install technologies such as induction cooktops, as well as similar grants for installing solar in households.\n\n\n\nMIGRATION\n\nCoalition\n\n\n\n\n\nDutton has confirmed a Coalition government will cut net overseas migration levels (the difference between the number of people entering and leaving Australia) by 100,000 places.\n\n\n\n\n\nIt plans to cut permanent migration by 25 per cent, shrinking the intake from 180,000 per year to 135,000 — a reduction of 45,000 visas.\n\n\n\n\n\nA cap on public university enrolments by 25 per cent from 2026 would also apply. The changes will result in 30,000 fewer new students every year than under Labor's plan.\n\n\n\n\n\nDutton has previously said he could not provide details about which programs would be cut before election day but has confirmed the Coalition would not cut the annual parent visa intake, which Labor increased from 4,500 to 8,500 when it came to government.\n\n\n\nLabor\n\n\n\n\n\nLabor will continue its current plans to reduce migration as per Treasury forecasts, with no new announcements throughout the campaign.\n\n\n\n\n\nIt attempted to introduce international student caps late last year, hurrying through legislation which would set the target to 270,000 a year. However, this was blocked by both the Coalition and Greens.\n\n\n\n\n\nThis forced the government to pass ministerial direction 111 , which has enabled it to reduce numbers by slowing visa processing and assigning quotas for international students to each university.\n\n\n\n\n\nEducation Minister Jason Clare told SBS Malayalam executive producer Deeju Sivadas there is no official cap but the ministerial direction would be used to get international student numbers back to where they were pre-pandemic.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-these-australians-want-you-to-withdraw-some-cash-today/rjwqwfs4w",
        "title": "Why these Australians want you to withdraw some cash today",
        "publish_date": "Mon, 21 Apr 2025 19:37:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Jason Bryce noticed it during the height of the COVID-19 pandemic.\n\n\n\n\n\nHis local bank branch closed, as did three ATMs. Then the local supermarket temporarily went cashless.\n\n\n\n\n\n\"Card companies were talking about the dirtiness of cash, and people were saying, 'We've got to go cashless',\" Bryce told SBS News.\n\n\n\n\n\n\"That led to a big decline in the use of cash, and it looked like the cashless society was inevitable.\"\n\n\n\nREAD MORE A surcharge for cash payments? What could happen as Australians ditch notes and coins\n\nThe loss of the ability to pay in cash spurred Bryce to launch an advocacy group Cash Welcome, which encourages the use of cash to ensure it remains an option for consumers.\n\n\n\n\n\nThe group is calling for a nationwide campaign on Tuesday to get people to withdraw some cash and \"remind the banks and the government that cash is important to Australians\".\n\n\n\n\n\n\"Have money in your pocket so you can pay with stuff if you need to, but [Tuesday], particularly, it's like a vote against their cashless Australia,\" Bryce said.\n\n\n\nIs a cashless society inevitable?\n\nAround 1.5 million Australians mostly use coins and paper notes to make purchases every day.\n\n\n\n\n\nBut there's been a steady decline in the use of cash — and it took a new turn during COVID-19.\n\n\n\n\n\nFrom 2019 to 2022, the share of in-person transactions made with cash halved, from 32 per cent to 16 per cent, according to the latest data from the Reserve Bank of Australia (RBA).\n\n\n\n\n\nRBA's next report is due this year, but in the meantime, reports from other groups indicate the outlook for the prevalence of cash looks grim.\n\n\n\n\n\nCash will make up only 7 per cent of in-person transaction value by 2030, a drop from the current 10 per cent.\n\n\n\nAustralians' most preferred payment method is prepaid or debit cards, according to a report from payments provider Worldpay. Source: SBS News That figure, from a new report from global payments provider Worldpay, also shows Australians' most preferred payment method is prepaid or debit cards.\n\n\n\n\n\nBut the group expects digital wallets will soon be the preferred option, capturing just over half of online and 38 per cent of in-person transaction value.\n\n\n\n\n\n\"Cash's share of in-person shopping value dropped by more than two-thirds from 2014 to 2024. Yet the story of cash in Australia is one of a staunch defence,\" the report said.\n\n\n\nAustralians mostly use debit cards or prepaid methods for online purchases, with credit cards a close second, according to a report by payments provider Worldpay. Source: SBS News The closure of ATMs is also another factor attributed to the decline in the use of cash.\n\n\n\n\n\nAngel Zhong, associate professor of finance at RMIT University, believes Australia will be a functionally cashless society by 2030.\n\n\n\n\n\n\"That means the majority of payments will be in digital method. But it doesn't mean that you can't use cash,\" she told SBS News.\n\n\n\n\n\n\"So I don't think people need to panic when it comes to the movement towards a cashless society, because we're talking about a functionally cashless society, not a fully cashless society.\"\n\n\n\n\n\nEarlier this year, RBA governor Michele Bullock said cash would \"be around probably for another 10 years\".\n\n\n\nLISTEN TO Cash used to be king; but more people are saying no to coins and notes SBS News 12/04/2024 07:10 Play\n\nWhat are countries doing about cash's viability?\n\nIn the United Kingdom, 99.3 per cent of people in urban areas are within 1.6km of a free-to-use cash access point offering withdrawals, while this drops slightly to 98.7 per cent in rural areas.\n\n\n\n\n\nSome countries, such as Spain, France, Norway, and Denmark, as well as some states in the United States, have implemented mandates that require businesses to accept cash.\n\n\n\n\n\nLast year, the federal government announced Australia would join the ranks from 1 January 2026. This mandate would require businesses supplying essential goods and services to accept cash, though details about which specific businesses have not yet been outlined.\n\n\n\nWhile Australia is moving towards a cashless society, cash usage remains relatively higher than in some Asian markets where the shift to digital payments is more pronounced, according to the Worldpay Global Payments report. Source: SBS News \"Because of the government mandate, I think we are on the right balance ... to ensure financial inclusion. That means those who want to use cash will get their cash,\" Zhong said.\n\n\n\n\n\nThe mandate will also phase out cheques — they will stop being issued by 30 June 2028 and will no longer be accepted from 30 September 2029.\n\n\n\nWhy do people prefer cash?\n\nExorbitant transaction surcharges and fees, security of your personal information, and reliability during tech outages are just some of the reasons why people prefer to stick to cash.\n\n\n\n\n\nLast year, shoppers at Coles and Woolworths reported being unable to make purchases during the CrowdStrike outage .\n\n\n\n\n\n\"That incident, along with the others like the Optus incident, they highlighted some of the vulnerability of digital payments,\" Zhong said.\n\n\n\n\n\nFor Bryce, the Optus outage underscored the importance of carrying cash.\n\n\n\nA graph showing how the number of bank branches and ATMs has fallen in Australia. Source: SBS News \"I couldn't catch the train, couldn't make a payment because I was caught without cash,\" Bryce said.\n\n\n\n\n\n\"And I think there's been a big realisation in Australia that you don't want to get caught out without a $50 note or a $20 note in your pocket, because you don't know what's going to happen.\"\n\n\n\n\n\nInterestingly, amid the gradual decline in cash use for transactions, demand for banknotes spiked during the COVID-19 pandemic.\n\n\n\n\n\nThe value of banknotes in circulation increased by 22 per cent, or $19 billion, between March 2020 and its peak in December 2022, according to the RBA.\n\n\n\n\n\nThis, the central bank said, suggested banknotes were being hoarded to store wealth or for precautionary savings.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/waiting-for-decades-how-a-processing-backlog-for-parent-visas-could-sway-votes/a6ab2ewtr",
        "title": "Waiting for decades: How a processing backlog for parent visas could sway votes",
        "publish_date": "Mon, 21 Apr 2025 10:00:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn Melbourne’s north, 10 year old Shreyas Mayur is spending some rare face to face time with his grandma, Viji.\n\n\n\n\n\n\"When my mum is in India, my son, he has a tendency to spend hours on the phone just talking to her and trying to play games with her. It's really tricky to play a board game through Zoom, honestly, but he'll try! So he'll actually roll the dice for her and he will try to move the coins and try to... but I can tell that the bonding is really hard through the screen.\"\n\n\n\n\n\nViji's here on a tourist visa as the family wait for her parent visa application to be processed.\n\n\n\n\n\nHer daughter, Supriya, says it's not easy knowing her mother is alone in India.\n\n\n\n\n\n\"So it's been almost five years for her, because it's 2025 now. So the reason is because at that time, actually, my dad passed away towards the end of 2020, so I'm an only child, so she's basically there all alone because her brothers and sisters, don't live in the same city. So she's living all by herself in that house there and it is getting pretty lonely because of that.\"\n\n\n\n\n\nViji is not alone.\n\n\n\n\n\nSince Labor came to power the backlog of parent visa applications has ballooned from 120- to 150 thousand.\n\n\n\n\n\nDespite doubling the annual intake and issuing nearly 26-thousand parents visas, the average wait time remains 31 years.\n\n\n\n\n\nThe wait time can be about half that, but only if you can pay 48,000 dollars.\n\n\n\n\n\nFor Supriya's husband Mayur, the cost is difficult to justify for a 14 year wait.\n\n\n\n\n\n\"If this was just a normal visa where it wasn't a contributory type, I understand, a 14 year wait, okay, fair enough. But this is contributory where we're playing a lot of money to bring her over here. So, certainly a 14 year wait, when you're paying so much. I don't think is reasonable.\"\n\n\n\n\n\nA Migration Review commissioned by Labor in 2022 described the parent visa system as cruel and unnecessary.\n\n\n\n\n\nSuggesting changes like a visa lottery or increasing temporary visas, the review also pointed out that the backlog could cause skilled migrants to look elsewhere.\n\n\n\n\n\nSpeaking to a Western Sydney forum during the campaign, the Prime Minister says he is aware of the issue.\n\n\n\n\n\n\"We need to bear in mind for many of the residents in Western Sydney, too. They don't want, people who are migrants, Mum and Dad to have no access here either.\"\n\n\n\n\n\nBut when asked by SBS ...\n\n\n\n\n\n\"Migrants don't want Mum and Dad to be locked out of the country. Will Labor increase the cap on parent visas?\n\n\n\n\n\n\"What we'll do is we'll work through an orderly migration program.\"\n\n\n\n\n\nMeanwhile, the coalition has pledged to slash permanent migration by 25 per cent in an effort to free up housing.\n\n\n\n\n\nPeter Dutton has maintained he’d reveal which visa categories he’d cut after the election.\n\n\n\n\n\nThat is until today.\n\n\n\n\n\n\"Is the coalition planning to cut parent visas?\"\n\n\n\n\n\n\"We've said in relation to migration, and again this is a big difference between the two parties. We're going to cut migration by 25\"\n\n\n\n\n\n\"Will you cut parent visas? \"\n\n\n\n\n\n\"There's a significant contributor to young Australians locked out of housing.\"\n\n\n\n\n\n\"Will you reduce parent visas?\"\n\n\n\n\n\n\"In relation to parents, I've been clear about this - it's an important part - an important part of the migration program. And we're not going to reduce those.\"\n\n\n\n\n\nUnder pressure over high migration, Labor has had little appetite to address the growing parent visa backlog, even as demand for skilled migrants grows.\n\n\n\n\n\nAs the Coalition pledges to slash permanent migration to free up housing - the question remains - which visas would be cut?\n\n\n\n\n\nAbul Rizvi is the former Immigration Department Deputy Secretary, he says it will likely be parent visas.\n\n\n\n\n\n\"Mr Dutton's announcement that he will reduce the migration program from 185,000 to 140,000. Undoubtedly the first category he will cut is parents.\"\n\n\n\n\n\nWhile cost of living reigns supreme in the suburbs, it's not the only issue that will sway voters.\n\n\n\n\n\n\"I'm not going to be casting a vote based on a major economic policy because that actually wouldn't be something I'm looking into that much, but this is something that actually cuts close to home.\"\n\n\n\n\n\nWith this message for both major parties in an election that could be won or lost in the outer suburbs of Sydney and Melbourne.\n\n\n\n\n\n\"Thousands of people similar to us. Who are also waiting. So our request to the government, whoever that is, is to consider and not slash the parents visa, the contributory visa so that we can bring our family back here.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-to-know-about-pope-francis-death-what-happens-next/wkb8hipky",
        "title": "Pope Francis has died. Here's what happens next",
        "publish_date": "Mon, 21 Apr 2025 09:56:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Pope Francis, the first Latin American leader of the Roman Church, has died, the Vatican has announced.\n\n\n\n\n\nFrancis died at his residence in the Vatican's Casa Santa Marta on Easter Monday, the Vatican's news service said, after suffering a stroke and irreversible heart failure. He was 88.\n\n\n\n\n\n\"Dearest brothers and sisters, with deep sorrow, I must announce the death of our Holy Father Francis. At 7:35 this morning, the Bishop of Rome, Francis, returned to the house of the Father,\" Cardinal Kevin Farrell said, announcing Francis' death on the Vatican's TV channel.\n\n\n\n\n\n\"His entire life was dedicated to the service of the Lord and of His Church. He taught us to live the values of the Gospel with fidelity, courage, and universal love, especially in favour of the poorest and most marginalised.\"\n\n\n\nThe Vatican has a set of succession protocols that follow the announcement of a pope's death, marking the end of one papacy and the start of the next.\n\n\n\n\n\nThese have been practised over centuries and some date back to ancient Rome.\n\n\n\nConfirmation and funeral preparations\n\nFarrell, the pope's camerlengo or chamberlain, officially confirms the death. He then seals the pope's private apartment and prepares the funeral.\n\n\n\n\n\nThe camerlengo and three assistants decide when the pope's coffin will be taken into St Peter's Basilica for public viewing.\n\n\n\n\n\nThey also ensure that the pope's so-called 'Fisherman's Ring' — a signet ring traditionally given to the pope during his papal inauguration, used to sign and seal documents — and his lead seal are broken, so they cannot be used by anyone else. No autopsy is performed.\n\n\n\n\n\nThe death triggers a nine-day mourning period called the Novendiale.\n\n\n\nThe date of the funeral and burial will be decided by the cardinal. It will likely be held in St Peter's Square four to six days after the death. Cardinals will meet on Tuesday to start planning the funeral.\n\n\n\n\n\nThe pope approved funeral protocols for himself last year, opting to cut some papal funeral traditions and simplify certain rituals.\n\n\n\n\n\nFrancis's body was to be laid on Tuesday AEST in a single coffin of wood and zinc in the Santa Marta chapel, ahead of the transfer to St Peter's Basilica to lie in state, likely on Wednesday.\n\n\n\n\n\nFrancis said in 2023 he would like to be buried at the Santa Maria Maggiore basilica in Rome, departing from the tradition of almost 100 popes who chose to be buried in the Vatican Grottoes.\n\n\n\nPast popes have been buried in three-layered coffins, but Francis has chosen a single coffin made of zinc and wood.\n\n\n\n\n\nThe College of Cardinals oversees day-to-day business during what is called the interregnum — the period between the death or resignation of a pope and the election of his successor. They have limited power, and much of the central Church administration grinds to a halt.\n\n\n\nElecting a new pope\n\nThe conclave — a secretive voting ritual to elect a new pope — starts in the Vatican's Sistine Chapel between 15 and 20 days after the death. The cardinals, who are confined to the Vatican for the duration of the conclave, decide the exact day.\n\n\n\n\n\nAll cardinals under the age of 80 can take part in the secret ballot. They need a majority of at least two-thirds plus one to elect the new pope, so the voting can take several rounds spread over numerous days.\n\n\n\nWhen the conclave is concluded, the new pope is asked if he accepts and what name he wishes to take.\n\n\n\n\n\nThe world learns a pope has been elected when an official burns the paper ballots with special chemicals to make white smoke pour from the chapel's chimney. They use other chemicals to make black smoke, which indicates an inconclusive vote.\n\n\n\n\n\nThe dean of the College of Cardinals steps onto the central balcony of St Peter's Basilica to announce the new pope, who then appears and gives the crowd his blessing.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/dutton-wont-cut-australias-important-annual-parent-visa-intake/yf6uzhkex",
        "title": "Dutton says Coalition wouldn't cut Australia's 'important' annual parent visa intake",
        "publish_date": "Mon, 21 Apr 2025 06:43:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Opposition leader Peter Dutton has vowed a Coalition government would not cut Australia's annual intake of parent visas, after sustained pressure to reveal where his planned cuts to permanent migration would come from.\n\n\n\n\n\nThe Coaliton has vowed to reduce the annual intake of permanent migrants from 180,000 to 135,000 — but has until now reserved detail regarding which programs would be cut until after the election.\n\n\n\n\n\nDespite Labor nearly doubling the annual cap of parent visas to 8,500 places, the backlog has continued to balloon.\n\n\n\n\n\nWhen asked on Saturday if he would reduce those numbers to the previous Coalition government's setting of 4,500 places per year, Dutton said: \"We'll take that advice when we get into government in relation to where the economic settings are and where the demands might be.\"\n\n\n\n\n\nOn Monday, SBS again asked the Opposition leader if he would reduce parent visas.\n\n\n\n\n\n\"We're going to cut migration by 25 per cent,\" Dutton said.\n\n\n\n\n\nAsked a second time he said: \"[Record high migration] is a significant contributor to young Australians being locked out of housing.\"\n\n\n\n\n\nFinally, after a third attempt, he said: \"In relation to parents, I've been clear about this — it's an important part of the migration program.\n\n\n\n\n\n\"We're not going to reduce those.\"\n\n\n\nLISTEN TO 'Insane' wait times deter migrants from applying for parent visas as delays worsen SBS Hindi 21/08/2024 09:46 Play\n\n'This cuts close to home'\n\nThis commitment will be heard by the families of more than 150,000 prospective parent migrants currently on the waitlist — with average wait times of 31 years.\n\n\n\n\n\nFor the Mayur family, who live in Melbourne's east, in the marginal seat of Deakin — held by Opposition housing spokesperson Minister Michael Sukkar — it's an issue that will sway their vote.\n\n\n\n\n\n\"I'm not going to be casting a vote based on a major economic policy,\" Supriya Narayanan told SBS.\n\n\n\n\n\n\"But this is something that actually cuts close to home.\"\n\n\n\n\n\nSupriya's mother, Viji, has been on the wait list for five years already. She lives in India alone. The family have applied for a contributory parent visa for her — at a cost of $48,000, with an average wait time of 14 years.\n\n\n\n\n\n\"I would very much like to live with my daughter,\" Viji said.\n\n\n\n\n\n\"The long wait is having an emotional toll also.\"\n\n\n\nLISTEN TO Lives on hold, contributions unrecognised: people awaiting residency petition parliament SBS News 25/02/2025 05:07 Play\n\nViji's son-in-law, Mayur Deivasigamani, says the wait times are unfair.\n\n\n\n\n\n\"We're paying a lot of money to bring her over here. So, a 14-years wait, when you're paying so much, I don't think is reasonable.\"\n\n\n\n\n\n\"There are thousands of people in our position, so my sincere request to whoever forms government after the election is to increase the numbers of parent visas so the wait time isn't so long.\"\n\n\n\n'The offset would be in the billions'\n\nDespite the increasing demand for parent visas, political pressure over Labor's handling of immigration — which hit record levels in the post-COVID-19 bounce back — has left little appetite to reform this complex system.\n\n\n\n\n\nThe Parkinson Migration Review commissioned by Labor in 2022 found the parent visa system was \"cruel and unnecessary\" and forced families to wait for a visa \"that would never come\".\n\n\n\n\n\nIt has recommended changes such as increasing the number and length of temporary visas issued for parents, as well as potentially introducing a visa lottery.\n\n\n\n\n\nFormer deputy secretary of the Immigration Department Abul Rizvi said a lottery would be \"unfair to those who are already in the list and have been waiting for years\".\n\n\n\n\n\nRizvi said that, while it's important for the government to offer skilled migrants the chance of family reunion, bringing aging migrants into the country is costly to the already stretched health and aged care system.\n\n\n\n\n\n\"As someone who advocated for parent visas to be increased, the trade off is Treasury will say to you: 'Okay, then you find the offsets in the budget to pay for this.'\"\n\n\n\n\n\n\"And the offsets would be in the billions.\"\n\n\n\nLISTEN TO Nige has waited 16 years to reunite with his wife. Now, he fears they never will SBS News 18/04/2025 07:18 Play\n\nThe Parkinson Review also found the average cost of a single parent migrant to Australia was $400,000 over their lifetime, even though all families are required to pay for their parent's private health insurance.\n\n\n\n\n\nDeivasigamani said there are other intangible costs to the community by not offering parent visas.\n\n\n\n\n\n\"For us, it's also about culture. Our son can hardly speak Tamil now … so to have family here would help him with the language and impart the Indian culture, which is important,\" he said.\n\n\n\n\n\n\"We've worked in Australia for two decades, we pay our taxes, so I feel like we're being treated a bit unfairly compared to other Australians.\"\n\n\n\nMajor-party migration agendas\n\nSpeaking at a Western Sydney Forum a fortnight ago, the prime minister said he was well aware that this issue was one faced by some members of his audience.\n\n\n\n\n\n\"What we have to bear in mind for many residents in Western Sydney who are migrants … they don’t want Mum and Dad to have no access here either forever.\"\n\n\n\n\n\nBut when asked if he would commit to increasing the cap, he only said: \"What we’ll do is run an orderly migration program.\"\n\n\n\n\n\nLabor has said it will continue its current plans to reduce migration as per Treasury forecasts, with no new immigration-policy announcements throughout the campaign.\n\n\n\n\n\nTreasury forecasts net migration to return to 260,000 by 2024-25, and 225,000 the following year, although it previously underestimated net migration numbers.\n\n\n\n\n\nMeanwhile, the Coalition has said it would reveal details of its planned 25 per cent reduction to the permanent migration program after the election, which would shrink the intake from 180,000 per year to 135,000 — a reduction of 45,000 visas.\n\n\n\nREAD MORE Coalition to cut international student numbers by 80,000, raise visa application fees\n\nDutton has also said a Coalition government will cut net overseas migration — i.e. the difference between the number of people entering and leaving Australia — by 100,000 places.\n\n\n\n\n\nImmigration minister Tony Burke told SBS the Coalition’s proposed cuts to permanent migration were \"reckless\" and the pledge to not cut parent visas would mean deeper cuts would be made to the skilled visa category.\n\n\n\n\n\n\"I don’t see how Peter Dutton hits his targets without us having fewer of the people we need to work in aged care, pick fruit and build houses. It’s pretty reckless,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-21-april-2025/zf1z1idty",
        "title": "Evening News Bulletin 21 April 2025",
        "publish_date": "Mon, 21 Apr 2025 06:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nVoters preparing to cast ballots at early voting centres from tomorrow;\n\nA second Signal chat scandal emerges for US Defence Secretary Pete Hegseth;\n\nGout Gout eliminated from the Stawell Gift event in regional Victoria.\n\nEarly voting centres will open across Australia from tomorrow morning, a fortnight before the main election day on Saturday, May 3rd.\n\n\n\n\n\nEarly voting will also be available for Australians voting overseas at embassies, consulates and high commissions.\n\n\n\n\n\nMillions of people are expected to vote this way, with data showing more than 5.6 million voters pre-polled at the last election.\n\n\n\n\n\n.\n\n\n\n\n\nMembers of the crossbench have criticised Prime Minister Anthony Albanese over reports he overrode his cabinet to scupper reform around gambling ads late last year.\n\n\n\n\n\nA landmark gambling harm inquiry chaired by late-Labor MP Peta Murphy suggested a total advertising phase-out, but almost two years later, the government has not acted on this key recommendation.\n\n\n\n\n\nNine newspapers have said Mr Albanese intervened to forestall the reforms which had been developed by communications minister, Michelle Rowland.\n\n\n\n\n\nGreens Senator Sarah Hanson-Young says that was the wrong choice.\n\n\n\n\n\n\"That's just despicable and hugely disappointing that the Labor party does not have the guts to stand up to the gambling lobby and do what needs to be done. Well, with the Greens in the balance of power, we will force Labor to do what is needed. We know that it's time to end those insidious, dangerous gambling ads that are wrecking families and destroying people's lives.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe Prime Minister says the Labor party is considering changes to parent visas to tackle a backlog that has seen wait times for visa applicants extend up to 50 years.\n\n\n\n\n\nMr Albanese says the government's inquiry has found that between 2010 and 2022, the applications backlog more than doubled to 120,000 from around 35,000.\n\n\n\n\n\n\"The Parkinson review was one of the three reviews that took place that showed the mess that we had to clean up. The Department simply didn't have enough staff. We are working on these issues, but we inherited an absolute mess, when we came to office.\"\n\n\n\n\n\nMeanwhile Peter Dutton has pledged a Coalition government would not cut Australia's annual parent visa intake.\n\n\n\n\n\nLabor increased the intake from 4,500 to 8,500 when it came to government.\n\n\n\n\n\n.\n\n\n\n\n\nWork is underway to establish Tasmania's first Sea Country Indigenous Protected Area.\n\n\n\n\n\nThe listing will support conservation, protection and management of the area, which includes ecologically important seagrass beds.\n\n\n\n\n\nThe proposal for the Protected Area will focus around the Furneaux Islands in Bass Strait also known as Tayaritja.\n\n\n\n\n\nDr Beth Strain from the University of Tasmania says a management plan is being developed in a collaboration between her campus, the Tasmanian Aboriginal Centre, and Deakin University in Victoria.\n\n\n\n\n\n\"What we're aiming to do is basically to primarily map the seagrass beds around the Furneaux Group, because basically they're large and extensive, probably thought to be the largest around Southern Australia, but they haven't been extensively mapped before this.”\n\n\n\n\n\n.\n\n\n\n\n\nIn the United States, the Defence Secretary has become embroiled in a second scandal over his use of the Signal app.\n\n\n\n\n\nIt's been reported that Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer.\n\n\n\n\n\nPentagon spokesperson Sean Parnell has dismissed the reports, saying in a post on X that he believes it's a witch-hunt by the media to destroy anyone committed to Trump's agenda.\n\n\n\n\n\nBut Democrat lawmakers have called for Mr Hegseth to be sacked, saying his actions have put lives at risk.\n\n\n\n\n\n.\n\n\n\n\n\nThe Notre-Dame Cathedral in Paris has held its first Easter celebration since reopening to the public in December 2024, following years of reconstruction.\n\n\n\n\n\nThe gathering has brought together leaders and faithful from various Christian denominations for a shared moment of prayer, unity, and reflection beneath the newly restored Gothic vaults of the centuries-old cathedral.\n\n\n\n\n\nArchbishop Laurent Ulrich has delivered an address to worshippers.\n\n\n\n\n\n\"Brothers and sisters, welcome to this renovated cathedral that some of you are of course discovering today, I mean discovering it by being inside it, because I imagine that many of you saw it on the 7th and 8th of December. It’s a great joy. A great celebration, a great time of peace in our hearts and, we hope, a great peace that rises in the hearts of all people to fight against the spirit of division.\"\n\n\n\n\n\n.\n\n\n\n\n\nIn sport,\n\n\n\n\n\nBig guns Lachlan Kennedy and Gout Gout have both been knocked out of the $40,000 Stawell Gift foot race.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/olo-new-lab-made-colour-or-science-fiction-olo-could-this-be-the-answer-to-colour-blindness/su52fq5m5",
        "title": "Olo: It's the colour you've never seen before",
        "publish_date": "Mon, 21 Apr 2025 05:18:32 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Key Points Five people from two universities in the US were able to see a colour not usually visible to humans.\n\nScientists made this possible by using lasers to optically stimulate individual photoreceptor cells on the retina.\n\nThe previously unseen hue colour has been named 'olo'.\n\nA new colour has been discovered, but so far, just five people in the world have been able to see it.\n\n\n\n\n\nThe colour was identified as part of research done at the University of California (UC), Berkeley in the United States and has been called 'olo'.\n\n\n\n\n\nThose who viewed the colour described it as a blueish-green of unprecedented saturation.\n\n\n\nHow was olo discovered?\n\nThey were all participants who had laser pulses shot into their eyes as part of a scientific experiment.\n\n\n\n\n\nThis was done by \"optically stimulating individual photoreceptor cells on the retina\" through a system the researchers dubbed 'Oz'.\n\n\n\nWhile the human eye has three types of cone cells — S, L, and M, with each one sensitive to different wavelengths of blue, red, and green, respectively — their spectral sensitivities overlap.\n\n\n\n\n\nCones convert light energy into electrical signals and specialise in sensing light that is responsible for colour vision and sharp, daytime vision.\n\n\n\n\n\nAccording to the research paper, in normal vision, \"any light that stimulates an M cone cell must also stimulate its neighbouring L and/or S cones\", because its function overlaps with them.\n\n\n\n\n\nHowever, through the use of the Oz system, the cones can be stimulated separately, \"which in principle would send a colour signal to the brain that never occurs in natural vision\".\n\n\n\n\n\n\"Theoretically, Oz expands the natural human colour gamut to any (L, M, and S) colour coordinate,\" the paper stated.\n\n\n\n\n\n\"Colour matching confirms that our attempt at stimulating only M cones displays a colour that lies beyond the natural human gamut.\"\n\n\n\n\n\nThe truest version of olo would therefore be defined as \"pure M activation\".\n\n\n\nLISTEN TO Stem cells from sac could be breakthrough for stroke victims SBS News 20/02/2018 02:54 Play\n\nAdvancing research around colour blindness\n\nThe research paper suggests the Oz system, which discovered olo, may provide insight into the possibility of enabling a wider array of colour vision in people who are colourblind.\n\n\n\n\n\n\"Oz can be programmed to probe the plasticity of human colour vision,\" the paper said.\n\n\n\nSeeing olo\n\nWhile olo may become the most talked about colour this week, it is unlikely to become the Pantone colour of the year any time soon, due to the fact it is inaccessible to the human eye without retinal stimulation.\n\n\n\n\n\nThose who took part in the visual experiment and viewed olo were scientists, three from UC Berkeley who are co-authors on the paper and two from the University of Washington, who participated in the research.\n\n\n\n\n\nIt has been reported that the name 'olo' was chosen as it denotes the binary 010, indicating that of the L, M, and S cones, only the M cones are switched on.\n\n\n\n'Open to argument'\n\nProfessor John Barbur, a vision scientist at the University of London in the United Kingdom, is reported to have said that while the research was a \"technological feat\" in stimulating selective cone cells, the discovery of a new colour was \"open to argument\".\n\n\n\n\n\nBarbur, who was not involved in the experiment that identified olo, has said the perceived brightness of a colour may change depending on changes to cone sensitivity.\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-leaders-pay-tribute-to-pope-francis-early-voting-opens-20250421-p5lt9n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Leaders pay tribute to Pope Francis; early voting opens",
        "publish_date": "Tue, 22 Apr 2025 11:55:32 +1000",
        "category": "finance",
        "authors": [
            "Angus Thomson"
        ],
        "text": "Tax is a substantial issue in this election campaign, with the government promising a small tax cut over coming years that’s been opposed by the Coalition which is offering its own one-off tax reduction.\n\nNew figures from the Australian Bureau of Statistics, released this morning, shows why tax is still front and centre for the major parties.\n\nLoading\n\nIt reported that total tax revenue collected by all levels of government grew by 6.1 per cent in 2023-24 to a record $801.7 billion. As a share of the economy, it reached 30 per cent after slipping to 27.8 per cent during the depths of the COVID pandemic.\n\nThe federal government is by far the biggest tax collector, bringing in $649 billion, an increase of 5.1 per cent.\n\nBut most states lifted their tax collections by far more. Victoria had the biggest increase, by a substantial 14.2 per cent, followed by NSW (11.8 per cent), South Australia (11.3 per cent) and Queensland (10 per cent).\n\nOn a per capita basis, federal taxation collections lifted by 2.6 per cent to $24,097 per person. This includes personal, company, superannuation and fringe benefits taxes.\n\nThe Victorian government lifted its tax hit per person by a nation-leading 9.5 per cent to a record $6348. In NSW, it grew by 8.8 per cent to $6016 while in Queensland, it increased by 6.6 per cent to $5051.\n\nDefying the trend was the ACT government where tax per person actually fell by one per cent to $5551.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/that-was-real-class-why-mitchell-moses-reminds-eddie-jones-of-an-english-rugby-legend-20250422-p5ltbk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘That was real class’: Why Mitchell Moses reminds Eddie Jones of an English rugby legend",
        "publish_date": "Tue, 22 Apr 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Moses gathered the Eels playing group into a huddle and urged them to stay composed. The Tigers players were scattered across the field, with nobody looking or talking to each other.\n\nBut Moses’ defining moment came in the 54th minute, when Tigers winger Sunia Turuva and Eels forward Luca Moretti were binned for their part in a melee that had spilled over the sideline at CommBank Stadium.\n\nHe finished with four try assists, including the kick for Simonsson, and a cutout ball for Josh Addo-Carr’s first four-pointer.\n\nMoses returned from a foot injury to play his first game of the season, and was sensational in the 38-22 win over the Wests Tigers on Easter Monday.\n\nJones said of Moses’ leadership at that crucial stage of the game: “It was going to be [interesting] how both teams responded to what had just happened … which team could get their focus the quickest. And that was Parramatta under Mitch. He gave them the drive and direction.\n\n“Mitch’s ability to get the players together and work together, they kept fighting for each other.\n\n“With Mitchell coming back, you could also see the quality of Rylsey’s coaching coming through. You need someone on the field who coaches and runs the team how you want them to be coached, and Mitchell does that. If you don’t have that, it’s really difficult.”\n\nFive-eighth Dylan Brown was arguably the biggest winner from Moses return, and relished being able to return to his running game rather than steer the team around the park. Seeing Brown run for more than 160m and relishing the freedom, however, must have Newcastle scratching their head when you consider they paid him $13m over the next ten years to run the show like Moses.\n\nJones said of Brown: “He ran the ball more, he was noticed because he was such a great runner of the ball, and people tried to make him into something he’s not. Unfortunately, like anything, we get influenced by outside views.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/how-400-000km-in-an-old-toyota-a-single-mum-and-a-brush-with-death-shaped-matt-hill-s-career-20250321-p5lldz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How 400,000km in an old Toyota, a single mum and a brush with death shaped Matt Hill’s career",
        "publish_date": "Tue, 22 Apr 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "It has just gone midday and the warm and genial commentator orders a large cappuccino. When pressed again about his ability, or inability, to retain quiz-winning volumes of general knowledge, he has a logical explanation: race callers, he says, train their brains to forget. “We are learning and sieving, learning and sieving, learning and sieving,” he says. Hill says that he can memorise a field of 15 horses in under five minutes, call them in a race and then forget them three minutes later. “I don’t retain stuff, I don’t recall stuff,” Hill says. “I listen to the news a lot. I like listening to the news, and I will forget two days later what was in the news.”\n\nHill chose this cafe because it is central to his story. Hill was eight when his father, Trevor, left the family. His brother, Timothy, was six. For the rest of their schooling life they were raised by their single mum, Susan, in her Altona Meadows house, which is just around the corner from Little Rosebery. Hill now lives in his mother’s home, having agreed to buy his brother out when Susan died in August last year. Matt Hill in his favourite local haunt. Credit: PENNY STEPHENS “She worked so hard to own that home, you know,” Hill says of his emotional attachment to the family house.\n\n“This area has been my whole life. I played basketball as a kid up the road, and we are literally 20 metres from where I caught the school bus for six years [to St Paul’s College in North Altona].” Hill’s career is intrinsically linked to his mother. As a 15-year-old, she would drive him across the state to pursue his passion – calling races at Sale, Shepparton, Stawell and even as far afield as Mildura on Melbourne Cup Day. Matt Hill has called eight Melbourne Cups. Credit: Michael Rayner “Her little yellow Toyota probably did about 400,000 clicks,” he says. “I’d get on the phone and ring race clubs, and I’d say, ‘Would you like a race caller for your non-TAB meeting?’ They’d say, ‘Yeah, can you get here?’, and Mum would drive me. “Then what would happen is my grandfather, who loved racing, and so did my grandmother, they would come along, too. So it ended up being a family expedition.”\n\nDespite his tender age and experience, Hill was always welcomed on course, especially at picnic race meetings where they had often relied on untrained members of the public to call their races. During one meeting at Pooncarie in NSW, the publican had a go and was so bad he was booed off the stand. The next year they agreed to give 16-year-old Hill a chance. When he wasn’t crisscrossing the state, teenage Hill and his family would head to Flemington or Moonee Valley. There, he would find a spare seat or hunt out an empty broadcasting box in the grandstand, and call the races on his own. “I should have been out chasing girls or with my mates, but I was honing what I was doing, you know, calling into a tape recorder,” he says. “That was my life, and I loved it. I would never have changed it, you know. I couldn’t wait to get to Flemington and practise calling.”\n\nHill says his mother never passed judgment on his work unless he mentioned it first. Loading “There’d be times when I’d come home, it might have been the Cox Plate or a big name, and I’d say, ‘Mum, I stumbled over a name there’, or something, and she’d go, ‘Oh yeah, I noticed that.’ “She would listen to everything. Even in her days in the nursing home, she was listening to me call the football on the radio. Half the time, it was a good way of knowing where I was.” Hill still speaks to his father, who lives in Queensland, but says they are not close.\n\n“Mum worked at the National Bank, she was a PA, and then Dad was an engineer,” he says. “So there’s really no radio broadcasting, not even a racing background. I am self-made in a way.” Hill, 44, says he comes to Little Rosebery three days a week. He spreads the newspaper across its wooden tables, studies the formguide and usually opts for something simple, like Vegemite on toast or a BLT, which the cafe has added to its menu especially for its regular guest. But today he is going to venture into uncharted waters. “I’m gonna hedge my bets,” he says in his signature mellifluous tone. “Gonna have a smashed avo, and get some bacon on the side.”\n\nI opt for one of their bestsellers – Thai chilli eggs. Hill is still working through his coffee, but I order a large glass of pear and apple juice to accompany my meal. Hill lives on his own, with his dog, and describes his profession as “the love of my life”. “It’s very cliche to say I am married to the job, but I am because it is my hobby as well. It really is,” he says. “I sort of live to work. I just love it.” The multi-talented sport commentator is lucky to be alive. After he finished year 12, he started running errands at a Melbourne radio station, won a racing industry scholarship at 19 and became Sydney’s main race caller. But it was on assignment in Beijing, calling at the 2008 Olympics for the Macquarie Radio Network, that he fell seriously ill. He was flattened by double pneumonia and his body started shutting down. There were fears he wouldn’t survive.\n\nHill was flown to Hong Kong, where a medical professor, who had worked through the 2002-2004 SARS outbreak, “slammed” him with a concoction of antibiotics. It was later discovered he had melioidosis, a bacterial disease spread through soil, air and water that had a 90 per cent death rate. “It is actually very similar to COVID,” Hill says. “I just happened to be unlucky – lucky and unlucky at the same time because to be brutally honest, if I were a smoker, if I had an unhealthy lifestyle, I wouldn’t be here. I was young enough to fight it.” Rather than slow him down, the near-death experience pushed Hill to work harder. “All I ever wanted to do was call at the Olympics,” he says. “So it just made me so determined after that. It just made me want it more. It made me want to almost kind of prove myself, actually. Like, I felt like I just needed to prove myself again.\n\n“I don’t know why ... I saw the illness almost as a weakness, which was a silly thing to do because anyone can get sick, but I wanted to achieve even more then. “So, in a way you do realise, and I realise it now with the death of my mum some 16 years later, that we are not here for a long time.” Hill called the Olympic rowing for Nine in Paris, as well as the athletics for Nine radio. But he is about to make a bigger splash in AFL. Fox Footy’s Thursday night AFL callers Matt Hill (left) and Mark Howard. This year he is locked in to call 45 games for Fox Footy, alongside Mark Howard on Thursday nights and Dwayne Russell on Sundays, as well as 25 games for SEN radio on Friday nights.\n\nHe will also cover Melbourne’s major race meetings every Wednesday and Saturday afternoon. “This year is going to be the hardest year I’ve ever worked,” he says. “My biggest challenge, I’ve found, is I naturally have a quick, quick flow because of calling horse races. So I don’t want to sound like it’s a race caller at the football – that’s my challenge. “But it is a fast game. You know, you can be saying something, and the ball might go through four pairs of hands. I try and say as many players’ names as I can, and I try to be as accurate as I can.” Hill, who grew up watching and supporting the Western Bulldogs, says it is difficult to pick up footballers’ numbers during a game, so he concentrates on their faces. Or their unique markings. “I’ve got a pretty old-fashioned approach in that I get Google Images up, and I just look at their faces as if I’m meeting them for the first time,” he says of his AFL preparation.\n\n“You just put a name to the face. Then I’ll watch their game from the week before, so I’ll study both of the teams from the week before. “And then for me, the most important, this is where the race caller comes out in me. I don’t know how many people do this, I have to be there an hour before the game because I want to see them physically in the flesh when they’re warming up. The receipt for our lunch at Little Rosebery cafe. “Then what I tend to do is look for their coloured boots, anything that’s different – coloured boots, tattoos, strapping is important. “If there are a couple of players that look the same, and it might be something really simple, like, you know, a little tatt on the left knee or left shin, or just something that – if the ball’s being given to a player quickly – I can pick up on who it is quickly.”\n\nOur discussion returns to Hill’s mother and his first Melbourne Cup call without her. “Two days after Mum died, my brother and I were driving to Tobin Brothers, to the funeral home, and Tim said to me, ‘What do you reckon Mum would like played at her funeral?’” Hill says. “He said, ‘She loved Life Is a Rollercoaster, by Ronan Keating’. Within seconds, it came on the radio. So that was a bit sort of, ‘Wow, she’s still here.’ “Then on the day of her funeral, the week later, it was announced in the paper that Ronan Keating would sing on Melbourne Cup Day. He sang 30 minutes before the Melbourne Cup. “So I took that as a little bit of a ‘she’s still with me’. And, thank Christ, he didn’t sing Life Is a Rollercoaster before the Cup because that would have made me a wreck.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/dadfluencer-ben-tate-opens-up-about-his-sobriety-journey-20250422-p5ltdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Dadfluencer’ Ben Tate opens up about his sobriety journey",
        "publish_date": "Tue, 22 Apr 2025 11:44:15 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "‘Dadfluencer’ Ben Tate opens up about his sobriety journey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-early-voting-opens-today-20250421-p5lt5j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Early voting opens today | Meteor lights up skies over Qld | PM affected by Pope’s death",
        "publish_date": "Tue, 22 Apr 2025 11:36:09 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Premier David Crisafulli has used the start of term two to announce what he describes as a nation-leading plan to address bullying in Queensland schools.\n\nLoading\n\nUnder a $33 million package, the government will establish Rapid Support Squads to target bullying hotspots and provide staff training, family support and mental health assistance.\n\nEach of Queensland’s eight education regions will be assigned a three-person squad, and Crisafulli said they would “fly in” to rural and remote schools as required.\n\nThe package also includes funding for additional chaplains and student wellbeing staff, a new hotline, and the formation of an Anti-Bullying Stakeholder Reference Group.\n\n“We’ve lost too many young lives to bullying, which is why we’re delivering a plan to put the spotlight on this serious issue,” he said.\n\n“This is about turning the tables on bullying and bolstering support for kids, parents and schools.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/passengers-evacuate-on-tarmac-after-engine-fire-20250422-p5ltdr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Passengers evacuate on tarmac after engine fire",
        "publish_date": "Tue, 22 Apr 2025 11:33:53 +1000",
        "category": "finance",
        "authors": [],
        "text": "Passengers evacuate on tarmac after engine fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-record-sale-ends-perth-family-s-40-year-land-holdout-20250421-p5lt79.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Record sale ends Perth family’s 40-year land holdout",
        "publish_date": "Tue, 22 Apr 2025 11:32:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "A tightly held block of land in Perth’s southern suburbs, which had an entire suburb built around it, has sold to an overseas developer for a staggering $4 million.\n\nAfter four decades of holding out selling to developers, the family listed the six-acre Wattleup Road property in Hammond Park for sale last September.\n\nThe cash sale price is believed to be a record for the area.\n\nThis large property stands out among a sea of new builds in Hammond Park. Credit: Effective Property Solutions\n\nEffective Property Solutions head of property investment Ollie Salimi said the sale received eight offers from established developers.\n\n“The successful buyer is an overseas-based vertically integrated building and development company,” he said.\n\n“The plan is to use the site for residential development to meet strong demand for homes in this flourishing southern Perth suburb that’s a major growth corridor.”\n\nSalimi said the family was thrilled to finally secure a sale of the prime urban infill site after a number of unsuccessful efforts.\n\n“This family had fielded many approaches by developers over a decade and had listed the land on this prominent road twice before, however, it was only on this third attempt that the sale got over the line with all parties,” he said.\n\n“It proved worth the wait with the price exceeding the sellers’ expectations by 20 per cent.”\n\nThe property includes a double-brick home with four bedrooms, two bathrooms and a semi-detached two-bedroom granny flat.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-nsw-coastal-village-that-could-be-the-next-gold-coast-20250408-p5lq8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The NSW coastal village that could be the ‘next Gold Coast’",
        "publish_date": "Tue, 22 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "Councillors fear a coastal NSW town favoured by holidaymakers could become the next Gold Coast as draft housing plans to lure developers propose accommodation blocks of up to 100 metres tall.\n\nEurobodalla Shire Council – which covers the villages of Batemans Bay, Narooma and Moruya on the far South Coast – is grappling with the desires of locals and tourists to preserve coastal views and a relaxed character, while providing much-needed housing for low-income families.\n\nAn artist’s impression of how Batemans Bay would look by 2100 under a draft master plan. Credit: Eurobodalla Shire Council\n\nMayor Mathew Hatcher wants to turn Batemans Bay into a “bustling town centre” with a mixture of housing types to allow residents to live within walking distance of amenities.\n\nBut some councillors have criticised the plans as “overambitious” and say they will turn the laid-back coastal village into a “developers’ delight” that’s “more Gold Coast than Noosa”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/aussie-tennis-star-surprised-by-fiancee-mid-interview-20250422-p5ltdk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie tennis star surprised by fiancée mid-interview",
        "publish_date": "Tue, 22 Apr 2025 11:28:51 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Aussie tennis star surprised by fiancée mid-interview\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/viral-tiktok-miracle-tree-draws-hundreds-seeking-healing-and-hope-20250422-p5ltdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Viral TikTok \"Miracle Tree\" draws hundreds seeking healing and hope",
        "publish_date": "Tue, 22 Apr 2025 11:28:51 +1000",
        "category": "finance",
        "authors": [],
        "text": "Viral TikTok \"Miracle Tree\" draws hundreds seeking healing and hope\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/kooyong-mp-rebuffs-sky-news-20250422-p5ltd8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kooyong MP rebuffs Sky news",
        "publish_date": "Tue, 22 Apr 2025 11:09:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Kooyong MP rebuffs Sky news\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/20-minute-hat-trick-confirms-leeds-promotion-20250422-p5ltcv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "20-minute hat-trick confirms Leeds' promotion",
        "publish_date": "Tue, 22 Apr 2025 10:49:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "20-minute hat-trick confirms Leeds' promotion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/the-big-change-coming-to-oscars-voting-for-next-year-s-awards-20250422-p5ltb0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The big change coming to Oscars voting for next year’s awards",
        "publish_date": "Tue, 22 Apr 2025 10:46:43 +1000",
        "category": "entertainment",
        "authors": [
            "Jake Coyle"
        ],
        "text": "NEW YORK (AP) – Oscar voters will no longer be able to skip watching some of the nominated films.\n\nThe Academy of Motion Pictures Arts and Sciences on Monday announced that members will be required to watch all nominated films in each category to be eligible to vote in the final round of Oscar voting. Until now, Oscar voters had only been encouraged to watch the nominees, and vote in categories in which they felt qualified.\n\nQueen Latifah performs at the 2025 Oscars. The rules around voting are changing. Credit: Chris Pizzello/Invision/AP\n\nIn recent years, the films academy members watch have been increasingly seen as a significant factor in what wins. At the same time, the publication of anonymous Oscar ballots has often featured members confessing that they didn’t get around to watching some notable films or not finishing lengthier nominees.\n\nOn Monday, the academy also posted new regulations on issues including AI, refugee filmmakers and the newly launched category, casting.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/caravan-drivers-scary-act-exposes-major-problem-on-aussie-roads-004337840.html",
        "title": "Caravan driver’s 'scary' act exposes major problem on Aussie roads",
        "publish_date": "2025-04-22T00:43:37Z",
        "category": "finance",
        "authors": [],
        "text": "Swaying caravans on Aussie roads are putting their drivers and other motorists at risk.\n\nThe caravan was swaying while travelling along the Kwinana Freeway in Western Australia on Monday. Source: TikTok/misshannahjayneeee\n\nFootage of a swaying caravan travelling along a busy highway was captured during the last-minute dash home at the end of the Easter weekend on Monday, and it highlights a growing safety concern on Aussie roads.\n\nHannah Jones told Yahoo News she had enjoyed her long weekend camping in the rural town of Pemberton, in Western Australia's southwest, and was travelling along the Kwinana Freeway when she spotted the towed caravan whipping side to side ahead of her.\n\n\"The swaying was scary! We thought there was going to be an accident,\" she told Yahoo News. \"All of the cars behind and to the side of him were avoiding him.\"\n\nUnclear whether caravan driver was aware of safety risk\n\nIn a bid to get out of harm's way, Hannah overtook the swaying caravan but second guessed whether he was even aware of the risk — saying he appeared to have \"no care in the world\" as she passed him.\n\nADVERTISEMENT\n\n\"[He had the] window down smiling. I'm sure he would have known from his side mirrors or even felt it. He seemed very confident,\" she said.\n\nIncorrect caravan loading can be fatal on Aussie roads\n\nThere has been many incidents of swaying caravans recently reported by Yahoo News and many experts are concerned there is a lack of understanding on how to correctly and safely load caravans as more and more appear on Aussie roads. The swaying van above appeared to have extra features added to the rear and roof which may have affected its towing weight.\n\nIncorrect loading means the weight distribution between a car and towed caravan is off, posing a heightened chance of the driver being unable to control the vehicle. A swaying caravan almost caused a driver to collide with a 57-tonne truck last October and there has been many incidents where authorities have been forced to respond to overturned caravans on the road after drivers lost control.\n\nADVERTISEMENT\n\nSimply put — caravan loading can be the difference between life and death, RAC claims manager Glen Walker previously told Yahoo News.\n\n\"It is crucial caravan owners prioritise learning how to safely maintain, load and tow their vans,\" Glen said. \"It's also critical to keep the caravan balanced, with the correct weight on the tow-hitch, by distributing weight evenly when packing.\"\n\nWhat to keep in mind:\n\nWeight of vehicle\n\nWeight of caravan\n\nThe weight of the vehicle and towed caravan combined\n\nOverall weight distribution of the vehicle and towed caravan combined\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/campers-call-for-help-after-deadly-intruder-spotted-right-next-to-young-girl-064218932.html",
        "title": "Campers call for help after deadly intruder spotted 'right next' to young girl",
        "publish_date": "2025-04-21T06:42:18Z",
        "category": "finance",
        "authors": [],
        "text": "Two families camping in a 'little' Aussie town over the Easter long weekend got quite a fright on Saturday.\n\nA deadly intruder slithered 'right next' to Sylwia and Marcus Logan's young daughter at a campsite in South Australia on Saturday. Source: Sylwia and Marcus Logan/The Logans Down Under\n\nTwo families camping in a “little” Aussie town over the Easter long weekend got quite a fright on Saturday when they awoke to find that a much less fluffy animal had decided to pay them a visit this year.\n\nAfter heading off in their caravan to enjoy the school holidays, Sylwia and Marcus Logan, and their two young children, decided to stop off in Williamstown, about an hour northeast of Adelaide, before making their way back home to Melbourne.\n\nThe family, who documents their travels online, was joined by another who had set up a trailer and tent nearby. However, neither expected the next visitor that rocked up.\n\n“I was doing the dishes and my daughter yelled ‘snake, snake!’,” Sylwia told Yahoo News Australia on Monday, referring to her six-year-old Maia. “It was less than a metre away. It was literally right next to her.\n\nADVERTISEMENT\n\n“I was so proud of her. It’s the first time she’s seen a snake in real life and she did the right thing.”\n\nMaia later told Sylwia she initially thought the animal was a stick until she saw its “cute” face. The owner of the tent immediately started to “move things around” to prevent the red-bellied black snake from entering, but it didn’t deter it at all.\n\n“There was nothing we could do to stop it,” the mum said. “I always thought that snakes, as long as you make noise and you move around, they keep away.”\n\nWithout hesitation the creature made a beeline for the tent and slipped inside.\n\n“The thing that was kind of odd is the fact that we were all standing around, and it just cruised under the car, straight to the tent, just between us all. It didn’t seem to care at all,” Marcus explained. Concerned, the group contacted a local snake catcher who was then captured on video removing the determined animal.\n\nSnakes out and about over Easter holidays, catcher warns\n\nIn the footage, the licensed expert can be seen walking up to the tent as the campers direct him “straight inside”. After he emerges moments later holding the red-belly’s tail, the group of young children that had gathered to watch gasped in awe.\n\nADVERTISEMENT\n\n“It’s so pretty,” Maia exclaims as a woman in the background asks if the creature is “a baby”.\n\n“It’s not a baby but not as big as they can get — still a mature adult,” the catcher responds, adding that it is a “little late in the season” for snakes to be roaming around.\n\n“It should be cooling off by now so with the lingering warm weather, they’re still out and about,” he tells the crowd, assuring them it was likely the only snake in the area as this time of year they’re typically “solo”.\n\nThe deadly snake was relocated further up the road. Source: Sylwia and Marcus Logan/The Logans Down Under\n\nHowever, he did admit that last week and the Easter holidays had been “surprisingly busy”.\n\nAs the temperature climbed over 30 degrees on Wednesday, tradies on a construction site just north of Adelaide’s CBD were stopped in their tracks by two eastern brown snakes tightly coiled around one another. Workers initially thought the pair were mating but quickly realised it was actually an incredible fight for dominance just before they retreat to hibernate over the winter.\n\nADVERTISEMENT\n\nCouple relieved young daughter spotted deadly snake\n\nSylwia and Marcus said they were relieved Maia had spotted the red-belly so she could alert everyone.\n\n“Imagine if no one noticed and then someone went into the tent,” the mum told Yahoo, admitting it “freaks her out” to think about the number of times a deadly creature has been in their presence without them knowing.\n\nGiven the variety of iconic wildlife in Australia, and their love of adventure, the couple said all they can do is educate their children.\n\n“Don’t be scared. Don’t be paranoid. Don’t harm the snake, keep your distance and respect the nature around you,” Sylwia said, noting the close encounter brought up a “few important lessons” people should keep in mind when travelling — always keep your tent zipped, double check first aid kits for snake bite supplies, and undergo a first aid course.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]