[
  {
    "url": "https://www.9news.com.au/national/banks-warned-on-rejecting-work-from-home-arrangements/e93ca327-68a0-453d-b244-1d582e8b6186",
    "title": "Push on big banks could change work-from-home rules for everyone",
    "publish_date": "Thu, 06 Nov 2025 01:28:28 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "T﻿he bosses of Australia's big banks have been warned they face a flood of cases unless they reassess rejected work-from-home requests.\n\nThe Finance Sector Union (FSU) said today it has written to senior executives in the sector calling for them to review their flexible work policies following a landmark decision against Westpac.\n\nThe ruling found the bank acted unlawfully when it denied a workers' request to work from home.\n\nThe Finance Sector Union has urged Australia's 'big four' banks to review rejected applications by employees for working from home arrangements.. (AAP Image/Joel Carrett)\n\nIn a letter, the FSU warns that employers could be breaching workplace law if they continue to reject flexible work requests without proper consideration, consultation or justification.\n\nThe Fair Work Commission ruled Karlene Chandler had the right to work from home full time after Westpac failed in its obligations under the Fair Work Act.\n\nShe sought to work remotely from her home south of Sydney to enable her to carry out school drop-offs and pick-ups for her two young children.﻿\n\nThe bank's failures included not responding within 21 days, not engaging genuinely with Chandler's request and not providing her specific reasons for refusing it, the commission found.\n\nThe FSU says the ruling sets a precedent that will have far-reaching consequences across the finance sector.\n\nWorking from home has become increasingly popular since the pandemic. (Getty)\n\nIt claims many employers have sought to impose blanket return-to-office mandates without consideration for workers' personal circumstances.\n\nThe FSU has identified other examples of work-from-home arrangement by finance workers that have ﻿been rejected by managers.\n\n\"Our members have proven they can deliver from home,\" said National Assistant Secretary Nicole McPherson.\n\n\"Flexibility is not a perk, it's a legal right and we'll keep fighting to make sure every worker in finance can exercise it.\"\n\nWestpac has been contacted for comment by 9news.com.au.\n\nHighest-paying jobs in Australia that don't need a degree View Gallery\n\nAustralian Bankers Association Simon Birmingham said working from home arrangements were best left to individual banks and their staff.\n\n\"Australian banks employ around 180,000 people in a wide variety of roles.\n\n\"Work from home has become a valued part of employment arrangements for banks and many of their employees but isn't possible in all circumstances all of the time.\n\n\"Flexible workplace arrangements are ideally matters for individual banks and their employees, who are best placed to together achieve outcomes that deliver the best for all parties.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/microsoft-issues-apology-misleading-subscription-prices/d3398d09-47b4-4641-b735-208d45ba3c5a",
    "title": "Microsoft apologises to millions of Australians",
    "publish_date": "Wed, 05 Nov 2025 23:47:32 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Just over a week ago, the Australian Competition and Consumer Commission (ACCC) launched proceedings in the federal court against Microsoft over allegedly false or misleading communication regarding the renewal of their Office 365 subscriptions.\n\nThe chair of the ACCC, Gina Cass-Gottlieb, alleged that Microsoft \"deliberately\" failed to mention the classic plan and \"concealed\" its existence to increase the number of users on the more expensive Copilot-integrated plans.\n\nAt the time, Cass-Gottlieb said: \"The Microsoft Office apps included in 365 subscriptions are essential in many people's lives, and given there are limited substitutes to the bundled package, cancelling the subscription is a decision many would not make lightly.\n\nREAD MORE: WA dad wearing nothing but SpongeBob undies takes down alleged carjacker\n\nMicrosoft has issued an apology to millions of Australians. (Getty)\n\n\"We're concerned that Microsoft's communications denied its customers the opportunity to make informed decisions about their subscription options, which included the possibility of retaining all the features of their existing plan without Copilot and at the lower price,\" she said.\n\n\"We believe many Microsoft 365 customers would have opted for the classic plan had they been aware of all the available options.\"\n\nWhile the ACCC heads to court seeking penalties and consumer redress, and Microsoft faces a maximum penalty of $50 million, Microsoft has today announced it is contacting affected customers via email from today.\n\nREAD MORE: Death toll rises to at least nine in Kentucky cargo plane crash\n\nMicrosoft Australia is facing court action for allegedly misleading 2.7 million Australians into buying a more expensive subscription plan that includes its AI bot Copilot. (Supplied)\n\nIn a statement to 9News, a Microsoft spokesperson said: \"Today we began reaching out to our Microsoft 365 Personal and Family subscribers in Australia regarding a subscription alternative that we could have communicated more clearly when we changed our pricing in October 2024.\n\n\"In response to the demand for advanced AI tools, we introduced AI capabilities into the Microsoft 365 Personal and Family subscriptions that we offer in Australia.\n\n\"In hindsight, we could have been clearer about the availability of a non-AI enabled offering with subscribers, not just to those who opted to cancel their subscription.\n\n\"In our email to subscribers, we expressed our regret for not being clearer about our subscription options, shared details about lower-priced alternatives that come without AI and offered a refund to eligible subscribers who wish to switch.\n\n\"We have been present in Australia for more than 40 years, operating on the principles of trust and transparency.\n\n\"We fell short of our standards here, and we apologise. We will learn from this and improve.\"\n\nREAD MORE: Why thousands of Australians are buying and selling snack vending machines\n\nThe ACCC claims Microsoft misled customers. (Supplied)\n\nAnyone with a Microsoft Office 365 subscription should keep an eye out for that email to ensure they are on the correct plan and take steps to receive any refund they may be entitled to.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/australian-cdc-to-be-established-laws-passed/65c12bca-2e15-4eaa-9dcb-1fd059813822",
    "title": "Australia's finally getting this key health service years after pandemic",
    "publish_date": "Thu, 06 Nov 2025 00:09:24 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "Almost 40 years after the first calls for Australia to establish a ﻿permanent Centre for Disease Control (CDC), legislation has passed in the Senate that will make it so.\n\nThe Public Health Association of Australia (PHAA) called it \"most important piece of public health infrastructure in generations\"; Health Minister Mark Butler said the CDC \"will help protect Australia from diseases and public health threats\".\n\nBut some are asking why it took so long.\n\nREAD MORE: WA dad wearing nothing but SpongeBob undies takes down alleged carjacker\n\nAustralia will establish a ﻿permanent Centre for Disease Control (CDC) after legislation passed in the Senate yesterday. (Getty)\n\n﻿The Australian Medical Association (AMA) first called for the establishment of an Australian CDC in 2017, before the COVID-19 pandemic.﻿\n\nAMA President Dr Danielle McMullen said the pandemic then ﻿\"highlighted exactly how ill-prepared Australia was to respond to such events\".\n\n\"We are dealing with many complex issues right now including communicable diseases between people and animals, antimicrobial resistance and other emerging threats that require surveillance and monitoring,\" she said.\n\nThe AMA was hardly the first to advocate for the establishment of a permanent CDC.\n\nREAD MORE: Death toll rises to at least nine in Kentucky cargo plane crash\n\nBack in 1987, ﻿Professor Bob Douglas raised questions about Australia's lack of such an agency.\n\nDouglas, who later became foundation director of the National Centre for Epidemiology and Population Health at the Australian National University, described ﻿Australian disease-control activities as \"fragmented, inadequate and poorly coordinated\".\n\nBut Australia didn't even establish an interim CDC until January 2024, almost four years after the COVID-19 pandemic began.﻿\n\nPrior to that, Australia was the only OECD country without a CDC or equivalent body.﻿\n\nAustralia didn't even establish an interim CDC until almost four years after the COVID-19 pandemic began.﻿ (Getty)\n\nThe permanent CDC is scheduled to ﻿start operations on January 1, 2026, and﻿ will replace the interim CDC.\n\nIt will initially focus on preparing for public health emergencies and improving ﻿the national public health surveillance systems.\n\nIt will later expand into priority areas including chronic diseases﻿, which account for nine out of 10 deaths in Australia.\n\n﻿The Albanese ﻿government has already committed $251 million to establish the CDC over the next four years.\n\nThe commitment comes off the back of an almost 700-page report ﻿following an inquiry into Australia's response to COVID-19, which recommended Australia establish a permanent CDC as a priority.\n\nREAD MORE: Why thousands of Australians are buying and selling snack vending machines\n\nLegislation passed yesterday outlined the agency's key functions and established its independence.\n\nNow ﻿the focus is on who will run it: an as yet unnamed director-general appointed by the health minister.\n\nAMA President McMullen called for the appointment of a \"politically neutral\" leader.\n\n\"The AMA is looking forward to continuing to work with the government and the new Director-General to ensure the CDC relies on strong, clinical and scientific expert leadership,\" she said.\n\n\"The appointment of a politically neutral, highly qualified Director-General is vital to ensure the CDC becomes Australia's most trusted.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/more-than-one-million-australians-looking-for-a-job/119790d0-5485-4c25-be0c-67fb8add7096",
    "title": "More than a million Australians looking for a job, new data shows",
    "publish_date": "Wed, 05 Nov 2025 22:49:02 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "More than a million Australians were looking for a job in 2024-2025, with work flexibility a key factor for many.\n\nNew data from the Australian Bureau of Statistics found that 1.2 million people were looking for a paid job in that financial year.﻿\n\n\"Almost half of the 1.2 million people who wanted a paid job in 2024-25 were unemployed. The rest were either not actively looking for work or not immediately available for work,\" ABS head of labour statistics Sean Crick said.\n\nThere were 1.2 million people looking for a job in Australia last year. (Louie Douvis)\n\n\"Almost 1.1 million of this group were available to start work immediately or within the next four weeks, with a further 130,000 not available to start work within the next four weeks.\"\n\nThe difficulties with finding a suitable job differed in some ways between women and men.\n\nThe most important factors for women were being able to work part-time hours, and finding a job that matches skills and experience, with 33 per cent of women stating these factors as very important.\n\nAlmost a third of men (32 per cent) reported that the most important factor to get them to work was finding a job that matches skills and experience, followed by support for training or study to improve skills (24 per cent) and ability to work part-time hours (23 per cent).\n\n﻿Women made up the majority of those people not available for work within four weeks, at 65 per cent.\n\nAlmost half (43 per cent) of women who wanted to work but were not available within four weeks reported caring for children as the main reason they were unavailable.\n\nThe 10 most in-demand jobs for 2025 View Gallery\n\nThere were also 800,000 people who worked part time and wanted more hours, with 89 per cent of these people available to start working more hours within four weeks.\n\nOf the 5.1 million parents in the past financial year with children under 15, almost 700,000 didn't have a job, of which 16 per cent were looking.\n\nThere were about 700,000 people who had a long-term health condition and wanted a job.\n\nWhile long-term health conditions were a common reason people were unavailable to start work, not all people with a long-term health condition were unable to work.\n\nLong-term health condition or disability was the main reason for 39 per cent of men who were not available for work.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/louisville-ups-plane-crash-update-death-toll-rises-to-nine/fde6a27a-6160-488f-9bf5-77fdb5d2418a",
    "title": "Death toll rises to 11 in cargo plane crash, investigators say engine fell off",
    "publish_date": "Wed, 05 Nov 2025 22:49:00 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A giant cargo plane's left wing caught fire and an engine fell off just before it crashed and exploded after take-off in the south-eastern US, as the death toll from the disaster jumped to 11 people, including a child.\n\nEmergency workers, meanwhile, searched for more victims on Wednesday, (Thursday AEST), a day after the crash at UPS Worldport, the company's global aviation hub in Louisville, though Kentucky Governor Andy Beshear said finding survivors seemed unlikely.\n\nThe inferno consumed the enormous UPS aircraft and spread to nearby businesses.\n\nREAD MORE: WA dad wearing nothing but SpongeBob undies takes down alleged carjacker\n\nThe death toll from the UPS cargo plane crash in Kentucky has risen to nine, authorities say. (WLKY via CNN Newsource)\n\nA UPS Boeing 737 is seen parked while a plume of smoke from the nearby UPS cargo plane crash is seen at Louisville Muhammad Ali International Airport on Tuesday, Nov. 4, 2025, in Louisville, Ky. (AP Photo/Jon Cherry) (AP)\n\nAfter being cleared for take-off, a large fire developed in the left wing, said Todd Inman, a member of the National Transportation Safety Board, which is leading the investigation.\n\nThe plane gained enough altitude to clear the fence at the end of the runway before crashing just outside Louisville Muhammad Ali International Airport, Inman said.\n\nAirport security video \"shows the left engine detaching from the wing during the take-off roll,\" he said.\n\nThe cockpit voice recorder and data recorder were recovered, and the engine was discovered on the airfield, Inman said.\n\n\"There are a lot of different parts of this airplane in a lot of different places,\" he said, describing a debris field that stretched for about one kilometre.\n\nREAD MORE: Why thousands of Australians are buying and selling snack vending machines\n\nNational Transportation Safety Board official Todd Inman, during a press conference at the Louisville Regional Airport Authority in Louisville Muhammad Ali International Airport on Wednesday, November 5, 2025. (AP Photo/Jon Cherry) (AP)\n\nEarlier, Kentucky Governor Andy Beshear﻿ predicted the death toll would grow, noting that 16 families had gathered at a reunification centre for news of loved ones.\n\n\"Our fatality count is now up to 11, expected to reach 12, possibly by the end of the day, and there are a handful of other people that we're still searching for, that we hope weren't on site and that we hope were somewhere else,\" Beshear said.\n\nAmong those killed, at least one person is believed to be a child, \"and a young child at that, which makes it all the harder,\" Beshear said.\n\nThe crash was captured in horrifying video taken from a truck parked about one kilometre from the impact site.\n\nIt showed the driver sitting calmly in the vehicle's cab moments before he's startled as the plane smashes into the ground.\n\nA stunned truck driver watched the plane UPS cargo plane crash into the ground. (Supplied Nine)\n\nThe stunned man then jumps out and runs, shouting \"oh, my God\".\n\nThe plane with three people aboard crashed about 5.15pm on Tuesday (US Eastern Standard Time) as it was departing for Honolulu from Louisville Muhammad Ali International Airport. Video showed flames on the plane's left wing and a trail of smoke.\n\nThe crash had a ripple effect, striking and causing smaller explosions at Kentucky Petroleum Recycling and hitting Grade A Auto Parts, though it could have been worse, Beshear said.\n\n\"Thankfully, a local restaurant that is right there ... was missed and now is helping the search and rescue,\" Beshear said.\n\n\"Another blessing is this plane could have potentially hit the major Ford factory or the convention centre, those are all close by, and did not.\"\n\nLocal residents described the crash site as resembling a war zone after the plane hit. (AP)\n\nUniversity of Louisville Hospital said two people were in critical condition in the burn unit Wednesday and that 13 others had been treated and discharged. Five people were treated at other hospitals.\n\nBeshear declared a state of emergency and mobilised the National Guard in an effort to quickly free up resources.\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/vending-machine-business-why-australians-are-buying-selling-snack-machines-for-extra-income/1999b07f-1822-400d-a5bb-e249b5728d6c",
    "title": "'$250 by 8am': Unusual idea earning Aussies like Jeff and Andre big money",
    "publish_date": "Wed, 05 Nov 2025 18:22:59 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "E﻿xclusive : Hidden in a cosy corner of the internet is a growing Facebook group dedicated to helping people build an unusual side hustle.\n\nThousands of Australians have joined the industrious trend of buying and selling snack vending machines for extra income, which can be a lucrative game for a lucky few.\n\nThe only problem? You might need more than a few machines to actually turn a profit.\n\nJeff Constable now owns IsaVend after starting with one machine at a mining site. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nFormer ﻿Queensland mining worker Jeff Constable told nine.com.au he bought his first machine after becoming irritated by one at his old worksite in Mount Isa.\n\nIn just three years, his bright idea snowballed into a fleet of 63 vending machines.\n\n\"﻿That vending machine was not getting filled up enough, it wasn't really clean, and the note acceptor didn't accept any new notes,\" Constable said.\n\n\"I thought I could do more with it. I was deciding to leave the mines and put in a proposal and said, 'Hey, look, I can't be the only one annoyed by this. How about I buy a machine?'\"\n\nAfter some back-and-forth﻿, Constable found himself the proud owner of a new vending machine.\n\nIt quickly became profitable because of its golden location.\n\n\"﻿I then figured out the real value wasn't in the machines themselves, it was in the sites,\" he said.\n\nAn ideal location can turn around ﻿between $3000 to $4000 a week.\n\nBut one with limited foot traffic – which Constable tries to avoid – might only generate about $40 in sales.﻿\n\n\"I've essentially got 60 cash registers out there making money,\" Constable said.\n\nSydney business owner Andre-Christian Collett owns nearly 50 vending machines across the NSW capital. (Instagram/@drecollects)\n\nConstable is now the owner of ﻿IsaVend, providing machines to worksites across the Mt Isa region.\n\nIt's not his full-time job – but it can sometimes feel like it.﻿\n\nHe is a member of the 30,000-strong Vending Machines Australia﻿ group, where he's noticed lots of entrepreneurial Aussies finding it difficult to make money.\n\n\"It's definitely an economy of scale game,\" Constable added.\n\n\"On these Facebook pages, you'll see how many people are trying to sell their one, two, three or five machine fleets.\n\n\"It can be a good little side-hustle, but if you've got just one to 10 machines, you're probably not quitting your job.\"\n\nSydney business owner Andre-Christian Collett also began his own vending machine business in 2021 after spotting a video on TikTok.\n\nAfter using his savings to buy a few units, he now operates a one-man business with 47 machines all over the city.\n\n\"When I first bought a machine, I was making around $250 every fortnight and that's just total sales,\" he told nine.com.au.\n\n\"Now I make $250 by 8am on Monday morning.\"\n\nCollett said his vending machine business began with him making just $250 a fortnight. (Supplied)\n\nConstable and ﻿Collett have transformed their vending machine side-hustle into profitable companies with warehouses and, in Constable's case, his own staff.\n\nGold Coast vending machine operator﻿ Karl warns Aussies wanting to make \"easy money\" from one or two machines might want to re-think their business plan.\n\n\"I've got a range of sites and machines around the Gold Coast, and I get calls, someone will call you and say, 'My drink's stuck at 11 in the morning,\" he told nine.com.au.\n\n\"You've got to be able to react to that and go and fix it.\"\n\nKarl said he has noticed online sellers trying to offload machines generating a little over $100 a week in sales.\n\nIf you did the math, he explained, that wouldn't be very lucrative.\n\n\"A machine that's doing $120 a week, once you take the GST off, you're down to roughly $110,\" he said.\n\n\"Then you minus probably $56, $57 in [stock costs] and then what you've got left is your gross profit.\"\n\nCollett agreed – he also discovered the vending machine industry was all about volume.\n\n\"If you buy one or two and the sites are only doing like a hundred bucks a week, then it's going to be way more headache than it's worth,\" he added.\n\n\"And you're probably going to end up selling them anyways.\"\n\nConstable said many people bought a machine with the thought that it was \"free money\" but ended up being disappointed or out of pocket.﻿\n\n\"There is so much that goes into it,\" he explained.\n\n\"I started with $15,000 - IsaVend is now in the seven figures.\n\n\"But that takes work.\"\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/baby-priyas-bill-passes-federal-parliament/04a85206-f640-4071-ace0-2fdd2e6e2c65",
    "title": "'Her name is law': Priya's parents win major change so no family suffers how they did",
    "publish_date": "Wed, 05 Nov 2025 04:12:42 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Priya's parents ﻿wanted to prevent what happened to them from happening to any other family going through an unimaginable.\n\nPriya ﻿was born prematurely at not even 25 weeks old in June 2024, and died just 42 days later.\n\nHer grieving parents' situation was made worse when the company Priya's mum* had worked at for 11 years cancelled her ﻿three months of pre-approved paid parental leave.\n\nBaby Priya was born prematurely at not even 25 weeks old on June 3, 2024. (Supplied)\n\nShe was offered a month of personal leave while her husband, Chris Breen, was able to take his ﻿full parental leave entitlement. ﻿\n\nSadly, what her company did was technically legal. ﻿\n\nWhat started as an online petition became legislation﻿ this week after Baby Priya's Bill passed federal parliament, preventing workplaces from cancelling paid parental leave if an employee experiences stillbirth or infant loss.\n\nPriya's mum said she felt a vast range of emotions, from being relieved parliament had voted in support, to being sad because her advocacy had been a way to love and demonstrate her love to Priya.\n\n\"Her name is law,\" she told 9news.com.au.\n\n\"There were moments in my life where I felt her life was not validated by others, and to have her name as law and her light shine on forever is something I am so grateful for.\n\n\"She lived on earth for only 42 days, but her love, light, and essence will live on forever through Baby Priya's Bill.\"\n\nEmployment and Workplace Relations Minister Amanda Rishworth and Prime Minister Anthony Albanese meet with the parents of baby Priya. (Dominic Lorrimer)\n\nPriya's mum said a part of her knew her situation would \"hit a nerve\" with Australians, while Breen said the support they received had \"overwhelmed\" them. ﻿\n\n\"It's not just about grieving parents, it's a woman's issue as well,\" Priya's mum said. ﻿\n\n﻿More than 17 months on from Priya's death, the pair continue to make time to remember her every Sunday at the time she passed away.\n\n\"Priya has left a lasting impact on me. She is a part of me, and I may not be able to carry her in my arms, but I carry her in my heart and always will. She made me a mother, and for that I will forever be grateful to her﻿,\" Priya's mum said.\n\n\"Memory is a strange thing, and sometimes the strongest memories of Priya come when I am not intentionally thinking about her at all,\" Breen said. ﻿\n\nNow that their fight is over, Priya's parents ﻿are looking forward to some much-needed rest.\n\n\"I started my advocacy work about eight months into her passing, and so now I am going to take this time to think of her, love her, grieve her, and just be,\" Priya's mum said.\n\n\"We are looking forward to the summer holidays, relaxing, spending time with family and doing the things we enjoy,\" Breen said. ﻿\n\nNow that their fight is over, Priya's parents ﻿are looking forward to some much-needed rest. (Anthony Albanese/X)\n\nPriya's mum hurt by 'derogatory' comments\n\nEmployment and Workplace Relations Minister Amanda Rishworth welcomed the bill, saying it filled an \"inconsistency\" in the previous legislation.\n\n\"This is a good day for parents, and I hope not only gives people rights in this circumstance but brings out of the shadows a conversation about stillbirth and early death,\" she said at a press conference.\n\nWhile the ﻿bill was largely supported by all sides of parliament, a small minority of the opposition, including Andrew Hastie, Barnaby Joyce, and Henry Pike, argued the law could be used by those who have had a late-term abortion.\n\nPriya's mum said she was hurt by the \"derogatory\" comments.\n\n\"﻿I am deeply disappointed by some over the past few days who have tried to turn Priya's Bill into something it is not,\" she said.\n\n\"Their words were hurtful, and it was shocking to see the discussion take such an absurd direction.\"\n\nREAD MORE: ﻿ Why the upcoming cyclone season could be more severe than usual\n\nAndrew Hastie was among those critical of the bill in parliament. (Alex Ellinghausen)\n\nOpposition Leader Sussan Ley today criticised the comments from members within the Coalition, labelling them as \"insensitive\".\n\n\"﻿Losing a baby is one of the most difficult things that can ever happen to a mother and to a family. And as a mother and a grandmother, this is very personal,\" she told ABC.\n\nPriya's mum said: \"Politicians like this should not be in parliament.\"\n\n*Priya's mum has asked not to be named. ﻿",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/perth-osborne-park-football-club-suspended-after-player-dressed-up-as-stephen-hawking/a4c98a3c-e08c-4de0-8279-ce588d0e8022",
    "title": "Football club banned for two years over Stephen Hawking costume controversy",
    "publish_date": "Wed, 05 Nov 2025 03:02:25 +0000",
    "category": "sports",
    "authors": [
      "Nov"
    ],
    "text": "A Perth football club has been suspended from its league for two years after a player dressed up as late physicist Stephen Hawking viewing fake child abuse material.\n\nThe player was in a wheelchair with a mock-up of a communication system that had doctored images of a fake pornographic website on it as part of the Osborne Park Football Club's \"Silly Sunday\" end-of-season celebrations at Robinson Reserve in August.\n\nStirling Mayor Mark Irwin said council staff were \"very distressed\" to find the discarded costume during a routine inspection of the headquarters a couple of days later and reported the matter.\n\nA player dressed up as late physicist Stephen Hawking viewing fake child abuse material. ﻿ (Nine)\n\nThe Perth Football League has now announced that the club will be unable to compete for two seasons after ruling the incident a severe breach of its integrity standards.\n\n\"At a club-sanctioned event, offensive material was displayed depicting a doctored image of a child in a pornographic context,\" Perth Football League boss Andrew Dawe said.\n\n\"Senior club officials were present but failed to act.\n\n\"A two-year suspension reflects the severity of the breach, and gives the club time to rebuild governance capability, re-engage with the City of Stirling to see if they can find a home for the club and time to demonstrate considerable reform before the possibility of returning to the competition.\"﻿\n\nThe suspension will begin in two weeks, but the club has that time to appeal the decision.\n\nWA Police ﻿investigated the costume and found \"no criminality\".\n\nThe City of Stirling has, however, chosen to evict the club from its headquarters, arguing that it breached the behaviour clause in the lease agreement.﻿\n\n\"Survivors of child abuse talking to us about the impact it has on them, I don't ﻿think any of them would find this a joke, or find it funny, or find that there is a level of this that is acceptable in our community,\" Irwin told reporters.\n\n\"I don't believe there is any way of explaining how this is okay.\"\n\nThe City of Stirling has chosen to evict Osborne Park Football Club from its headquarters. (Nine)\n\nLate physicist Stephen Hawking lived for decades with motor neurone disease. (Supplied)\n\nOsborne Park Football Club president Jeremy LaBianca issued a statement in early October saying the player had only used photos of himself and nobody else in the fake material.\n\n\"﻿It was an offensive and incredibly distasteful costume, I am in no way trying to dispute that or defend the decision,\" he said.\n\n\"The allegation of child pornography hits me really hard - as it does for many members of our community who are parents, own businesses and/or have public-facing roles﻿.\"﻿﻿\n\nLaBianca had earlier said he was \"really embarrassed that we allowed this to happen and that we didn't intervene on the day\".\n\n9News understands that the player involved is also embarrassed by his behaviour and apologises for any distress caused.\n\nHe is also upset with the impact of his actions on the club. ﻿\n\nSupport is available from the National Sexual Assault, Domestic and Family Violence Counselling Service at 1800RESPECT (1800 737 732) .",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/guewel-lamine-sonko-theatre-senegal-cosmology/105923684",
    "title": "Lamine Sonko is theatre royalty in Senegal. Now he's making his Australian directorial debut",
    "publish_date": "Thu, 06 Nov 2025 01:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "When theatre-maker and artist Lamine Sonko moved to Australia 20 years ago, he carried more than a suitcase — he carried a rite.\n\nBorn into a lineage where the guewel is a custodian of sacred knowledge, Sonko's initiation into the role became the starting point for his latest work, which invites audiences to witness how culture is kept, shared and felt.\n\nGuewel is not just a show; it's a living transmission of West African cosmology, anchored in rhythm, song and ritual, now unfolding on the Australian stage.\n\n\"I hold on to the parts of my culture that I said goodbye to in West Africa; that's what I brought here with me,\" Sonko tells ABC Arts.\n\nLamine Sonko says his form of artwork was not understood in Australia when he arrived. (Supplied: Damien Vincenzi)\n\nThis highly anticipated offering, which took seven years to develop, holds the audience's hand while walking them through a theatrical experience that demonstrates why African storytelling invites an embodied audience experience.\n\n\"Sacred knowledge is embedded in rhythm, songs we sing and movements we untie to activate interconnectedness between each other and the nature we inhabit\" Sonko says.\n\nA cultural convergence\n\nGuewel is Sonko's directorial debut.\n\nAt just 19, he was already a seasoned theatre practitioner having toured France and Switzerland for five years with the National Theatre of Senegal.\n\n\"When I arrived in Australia 20 years ago, I quickly learned that there were virtually no opportunities for African theatre-makers,\" he says.\n\nLoading...\n\nDespite his experience, Sonko says his types of artistic skills were not broadly recognised by the Australian creative industry.\n\n\" I had to make sad adjustments. \"\n\nAt one point he says he was forced to make a temporary shift to teaching drumming to sustain himself financially.\n\nSonko says he faced the challenge of navigating a new cultural landscape while remaining true to his roots, with Guewel creating connections between the traditional arts of Senegal and contemporary practices in Australia.\n\nFrom backstage to on stage\n\nSonko grew up wandering the National Theatre of Senegal's corridors and stages.\n\nThere, his mother, Oumy Sene, was a celebrated dancer and cultural leader, while his father, Bouly Sonko, directed the theatre for more than two decades.\n\nChildhood memories are inseparable from significant works within the theatre's lineage; for example, his father's Pangols — lauded by The New York Times as an exploration of \"the spiritual nature of all living things\" — left an imprint that would echo in Sonko's own explorations of cosmology and ritual form.\n\nLamine Sonko's family is theatre royalty in Senegal. (Supplied: Olive Moynihan)\n\nBefore Sonko's artistic interest was sparked by his involvement with the National Ballet of Senegal, where he learned the intricate dance forms and storytelling techniques that characterise Senegalese culture, he was ushered into this space at the tender age of seven as a guewel.\n\nHe underwent a cultural initiation to become a custodian of sacred knowledge who is responsible for preserving and sharing the narratives of his people through songs, dance and stories.\n\nHe says they will forever inform his work and the way he reads the world.\n\n\"Those songs, dances and stories become a narrative that follows me until the end of my time in this universe,\" he says.\n\nEverything is connected\n\nIn Guewel, Sonko activates the audience's curiosity by asking them to relearn their place among trees, stars,and deities through rhythm, performance and ancestral dialogue.\n\nSonko reframes cosmology — a branch of physics and metaphysics dealing with the nature of the universe, the cosmos — as Senegalese cosmovision: a holistic system teaching the interconnectedness of everything from the soil to the stars.\n\nIn Guewel, this cosmology materialises as a multi-sensory encounter: masks invoke the unseen world, rhythms carry sacred patterns and choreography dramatises the interdependence of humans, nature and ancestors.\n\nAwa Coulibaly brings Senegalese cosmology to life in Guewel. (Supplied: Olive Moynihan)\n\nThe show presents Africa's story beyond entertainment spanning music, drumming and dancing.\n\nIt invites audiences to witness a culture that threads the cosmos through daily life and performance, expanding the Australian stage with a future-forward vision that is at once rooted, communal and star-bound.\n\nThe show features ceremonial costumes and masks of intricate shapes paired with both traditional and contemporary music, dance, projection and animation.\n\nLive musicians weave ancestral rhythms with progressive elements, while dancers move through ritual gestures and contemporary steps.\n\nProjections and animation enhance the stage, creating shifting landscapes that interact with the performers and amplify the storytelling.\n\nThe result is an immersive, embodied experience where breath, weight and momentum are visible, inviting spectators to feel the narrative as it unfolds.\n\nGuewel performs at the Arts House in Melbourne from November 12-16.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/wa-government-scrap-convention-centre-plan-buys-private-hospital/105977696",
    "title": "WA government to buy private Perth hospital, scraps $1.6b convention centre facelift",
    "publish_date": "Thu, 06 Nov 2025 00:49:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "A $1.6 billion upgrade of Perth's Convention and Exhibition Centre has been scrapped to free up cash for three major hospital projects, including the purchase of a private hospital in Perth's inner suburbs.\n\nThe WA government committed to the convention centre revamp last year, but on Thursday morning it announced the project would be cancelled to create a $1.5 billion hospital building fund, which includes the takeover of St John of God Mount Lawley Hospital.\n\nPremier Roger Cook said the state government could not justify the cost to taxpayers if it proceeded with the convention centre plan.\n\nThe WA government won't proceed with its plans to revitalise the Perth Convention and Exhibition Centre. (Supplied)\n\n\"I refuse to compromise on major projects that will deliver better health outcomes for Western Australians,\" he said in a statement.\n\nMr Cook said the acquisition of the private facility would add up to 100 beds and eight operating theatres to the public system.\n\nIt's hoped the plan will add about 100 public beds to the WA hospital system (Facebook: St John of God Mount Lawley Hospital )\n\nThe government will also build a new six-story block at Royal Perth Hospital, following a review of the hospital's redevelopment project.\n\nTwo floors will be dedicated to the emergency department.\n\nThirdly, a new hospital will be built on the Peel Health Campus site, with new beds and expanded clinical service to cater for the growing population in the area.\n\nFive-point plan to tackle ambulance ramping More aged care beds, a bolstered workforce and streamlined patient care are needed to tackle ambulance ramping in Western Australia, the health sector’s unions say.\n\nThe project replaces an original plan for the redevelopment of the health campus, following a review by the Office of Major Infrastructure Delivery.\n\nMr Cook said this would allow construction to progress faster and minimise disruption to clinical services at the hospital.\n\n\"We are buying a hospital, building a hospital and upgrading a hospital,\" he said.\n\n'A good deal'\n\nAustralian Medical Association of WA president Kyle Hoath said while the public sector already used some beds at St John of God's Mount Lawley campus, it was still a \"huge addition\" to the sector.\n\n\"This is almost exactly what we've been asking for, so it is a good deal,\" Dr Hoath told ABC Radio Perth.\n\n\" A new hospital was never just going to appear out of nowhere ... this is the solution that we needed. \"\n\nTreasurer and Deputy Premier Rita Saffioti said aside from the price tag, the convention centre redevelopment would have significantly impacted road and rail infrastructure around the CBD site.\n\nWA Premier Roger Cook and Treasurer Rita Saffioti say the state government is prioritising investment in health infrastructure. (ABC News: Luke Stephenson)\n\n\"It would just be too disruptive and cost too much at this point in time,\" she said.\n\n\"By choosing not to undertake that development it has given us the capacity to deliver excellent health infrastructure projects.\"\n\nTourism sector disappointed\n\nTourism Council WA chief executive Evan Hall said the tourism body supported the \"much-needed\" investment for hospitals and health.\n\nBut he said the decision to abandon the convention centre revamp was disappointing.\n\n\"We are already at capacity [at the convention centre], we are losing tens of thousands of tourism and business delegates to other states every year,\" he said.\n\n\"Every other state has expanded their capacity in this area, because it is so lucrative for the state economy.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/bridge-collapses-after-truck-crash-lithgow-nsw/105977736",
    "title": "Passenger trapped after bridge collapses in truck crash",
    "publish_date": "Thu, 06 Nov 2025 00:41:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "A truck has crashed into a bridge, causing it to collapse, and trapping a person inside the vehicle in the New South Wales central west.\n\nEmergency services were called to Inch Street, Lithgow, at 8:55am on Thursday after a cherry picker vehicle hit a disused railway bridge.\n\nA man, believed to be the driver, managed to free himself, but a passenger remained trapped inside.\n\nThere was no indication on the condition of the trapped person.\n\nNSW Ambulance said the driver was treated for minor injuries before being taken to Lithgow Hospital.\n\nThe road has since been closed as crews worked to remove the vehicle.\n\nIn a post on social media, the Lithgow City Council said it did not have an indication of when access to the road would be restored.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/conscious-consumers-drive-goat-meat-demand/105969236",
    "title": "US 'conscious consumers' love Aussie goat meat but there's a problem",
    "publish_date": "Thu, 06 Nov 2025 00:30:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian goat meat has become the first choice for America's \"conscious consumers\", who see it as more environmentally sustainable and healthy than other proteins.\n\nThe surge in international demand for wild-caught rangeland goats comes as producers seek to improve quality through dedicated breeding programs.\n\nRangeland goats are in high demand from overseas consumers. (ABC Open contributor: Chris Ferguson)\n\nIf they can balance consistent supply with ethical expectations, new markets may open, according to experts.\n\nBut it means an industry largely still in its infancy will have to decide how it wants to grow up — and fast.\n\nGoing for goat\n\nJanine Teese is a senior analyst with Greenleaf Enterprises, a consultancy that partnered with research and development organisation Meat and Livestock Australia (MLA) to assess consumer trends and the goat meat supply chain.\n\nShe interviewed \"conscious consumers\" in the United States who prioritise buying food consistent with their social, environmental or ethical values.\n\n\"[Goat] wasn't going to be substituted with any other red meat,\" Dr Teese said.\n\n\" It's like: 'We're buying goat as our first preference on meat or we'll go vegetarian.' \"\n\nThe bulk of Australian goat meat comes from rangeland goats — wild-born animals that are captured and taken to meatworks for processing.\n\nJanine Teese says goat meat is a natural fit for the conscious consumer. (Supplied: Janine Teese)\n\nDr Teese said that \"natural\" production was a key part of the appeal.\n\n\"It's about environmental sustainability — how it was raised and different management activities involved,\" she said.\n\n\"Also, [no] use of hormones, growth promotants or antibiotics fits that conscious consumer perfectly, which is why we've seen massive demand in California and the US.\"\n\nThe US is the largest market for exports, followed by South Korea, China and the Caribbean.\n\nBut even though Australia's production of goat meat soared to 54,017 tonnes in 2024 — the highest volume ever recorded, according to MLA — establishing consistent supply has remained a challenge.\n\nThe bulk of Australian goat meat comes from rangeland goats, but some producers are choosing to breed the goats they capture. (ABC News: Lucy Cooper)\n\nWild or bred?\n\nThe Goat Industry Council of Australia (GICA) is the peak body representing producers.\n\nPresident John Falkenhagen said while rangeland goats made up the bulk of supply, some producers were exploring managed breeding programs using their genetics.\n\n\"When we saw really high prices a few years ago, there was certainly a bigger move that way,\" he said.\n\nAnita Dennis of Coolah, at Blackall, with some of her rangeland goats. (ABC Western Qld: Hilary Cassell)\n\nWestern Queensland producer Anita Dennis is among those adopting an intentional breeding system.\n\n\"When we first started off, we were harvesting rangeland goats,\" she said.\n\n\"We've started putting better genetics in … and we're growing a meatier animal.\"\n\nMs Dennis said that had allowed her to produce animals that were consistent in size and quality more regularly.\n\n\"There's some really exciting things that are happening within the goat space,\" she said.\n\n\"I think for producers, it's really important to understand what the consumers are wanting.\"\n\nAustralian goat meat is popular overseas. (ABC News: Lucy Cooper)\n\nCall for grading system\n\nFor Glenda Henry, a breeder from Central Queensland who is also the chair of Queensland Goat Producers, a key part of that picture is a quality grading system.\n\n\"Until you've actually got grading, there's no guarantee when you go to buy goat meat what you're going to actually get,\" she said.\n\n\"If they [consumers] have a bad experience, you're never going to get them to go back again.\"\n\nThe beef and lamb sectors use Meat Standards Australia (MSA), a national voluntary eating-quality system.\n\nMeatworks can use the grading system to give feedback to producers, but nothing has been developed for goat meat.\n\nMs Henry hoped the introduction of mandatory individual electronic identification (eID) tags in goats would lead to a system being developed.\n\n\"The only advantage for us in eID tagging them — because there's a lot of expense in that — would be getting proper kill sheets,\" she said.\n\nBut not all goat producers think that should be the priority — Ms Dennis preferred to focus on consistent supply.\n\n\"I think there's so many other things that the goat industry needs before MSA grading,\" she said.\n\nMr Falkenhagen said whatever system was developed, it needed to be fit for purpose.\n\n\"MSA may not work for the goat industry because of the way that it's cooked and how its supply chains work,\" he said.\n\n\"But we may have something else that's unique and I can't define that — that will happen over time.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/sydney-swans-inaugural-aflw-coach-scott-gowans-leaves-club/105977414",
    "title": "Sydney Swans part ways with inaugural AFLW coach after missing finals",
    "publish_date": "Thu, 06 Nov 2025 00:30:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Sydney Swans are in need of a new AFLW head coach after parting ways with Scott Gowans.\n\nGowans was the Swans' inaugural AFLW coach and has led the club through the previous four campaigns.\n\nHis exit comes after the Swans lost six of their last eight games in 2025 to miss out on the finals on percentage.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nSydney started the season with four consecutive wins and still could have made the finals with a win in the final round.\n\nBut an upset three-point loss to lowly Essendon ended their season, and was ultimately Gowans's last match in charge of the club.\n\nIn a statement released by the Swans, Gowans said he was proud of what has been built since its first AFLW season.\n\n\"Watching our athletes grow and develop has been truly rewarding — they have come such a long way over the past four seasons, and I believe the group is capable of achieving great things,\" Gowans said.\n\n\"Building our list from scratch and guiding the team to where it is today is something I am incredibly proud of. While the decision to step away has been a difficult one, the time feels right for new leadership to take the team forward.\"\n\nGowans was the inaugural AFLW coach for North Melbourne when the club entered the competition in 2019, then was an assistant at Collingwood before taking the head job at the Swans.\n\nSydney was winless in their first season in 2022, but improved in 2023 to a 6-4 record and a maiden finals appearance.\n\nThe Swans defeated the Gold Coast Suns in the elimination final, before falling to Adelaide the following week.\n\nThe Swans would not make the finals in the following two seasons.\n\nSwans chief executive Matthew Pavlich praised the departing Gowans as \"a passionate advocate for women's sport\"\n\n\"Scott can be incredibly proud of his distinguished career as the senior coach of our AFLW team. Building a team from scratch is no small feat and we have seen that team grow and improve over the journey so far,\" Pavlich said.\n\n\"His tenure has been marked by vision, resilience, and a commitment to empowering his players.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/us-star-singer-jelly-roll-largest-australian-concert-townsville/105969286",
    "title": "Tatts, street art and baked goods — how the north rolls for Jelly Roll",
    "publish_date": "Thu, 06 Nov 2025 00:21:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Townsville is welcoming US country-rap artist Jelly Roll with street and body art ahead of his largest Australian stadium concert.\n\nThe North Queensland city of Townsville will tonight host the star singer.\n\nJelly Roll and his redemption story have captivated the regional community, which is celebrating his concert with street art, baked sweets and even tattoos.\n\nArtists Lavinia Letheby and Amanda Sadler worked through three nights from Halloween to create a mural in honour of Jelly Roll.\n\n\"We're super excited to welcome him here to Townsville,\" Ms Letheby said.\n\nAmerican singer Jelly Roll is featured on a Townsville mural. (ABC News: Chloe Chomicki)\n\nThe muralist also painted pop singer P!nk to celebrate her 2024 concert in Townsville.\n\nInternational artists have increasingly visited the city since the 2020 opening of the new North Queensland Cowboys home stadium.\n\n\"Doing these murals celebrates these big-name artists coming to Townsville,\" Ms Letheby said.\n\n\" The flow-on effect for the whole town is just incredible. \"\n\nTownsville bakeries are selling Jelly Roll themed donuts ahead of the singer's concert. (ABC News: Susan Graham-Ryan)\n\nSmall businesses are making the most of the excitement with local bakeries selling jelly rolls and other themed sweets.\n\nMusic lovers who are fans of the singer himself are also getting inked by Townsville tattoo artist Alex Aguilera.\n\nThe tattooist and fan has created a series of Jelly Roll themed designs.\n\nA Townsville tattoo artist has seen demand for Jelly Roll-themed ink. (ABC News: Chloe Chomicki)\n\n\"I've already tattooed minimum 50 people [and] I have quite a few people booked in,\" Ms Aguilera said.\n\n\"It is cool to see people excited here — the excitement is contagious.\n\n\"It has given me the opportunity to meet new clients.\"\n\nStadium venue manager Cameron Jones said the Thursday night concert, which would feature other country artists including Shaboozy, would be Jelly Roll's largest headline stadium show in Australia.\n\nCameron Jones says the Townsville Jelly Roll concert may draw 20,000 patrons. (ABC News: Chloe Chomicki)\n\n\"We couldn't be more excited, tickets sales are strong and we're trending towards at least 20,000 [people],\" Mr Jones said.\n\n\"Sent up from the south, we have a 48-metre top secret stage, we're dressing the venue like we've never seen before.\n\n\" Jelly Roll will be taking the stage later [in the] evening and he's excited: it's his biggest headline stadium show in Australia. \"\n\nMr Jones said it was crucial concert goers stayed hydrated with 33-degree heat expected in Townsville on Thursday.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/norway-controls-avert-potential-hacking-of-transport/105977160",
    "title": "Norway steps up measures against potential remote control of buses",
    "publish_date": "Thu, 06 Nov 2025 00:03:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "A leading Norwegian public transport operator has said it will introduce stricter security requirements and step up anti-hacking measures after a test on Chinese-made electric buses showed the manufacturer could remotely turn them off.\n\nTransport operator Ruter said test results published last week showed that bus-maker Yutong Group had access to bus control systems for software updates and diagnostics.\n\n\"In theory, this could be exploited to affect the bus,\" it said.\n\nUS government banning Chinese-made cars The federal government says it is in contact with the US about its moves to effectively ban Chinese car companies.\n\nThe tests — with buses driven in underground mines to strip away external signals — were conducted both on brand-new Yutong buses and on three-year old vehicles from Dutch bus manufacturer VDL, the company said.\n\nIt said the tests showed the Dutch buses did not have the ability to conduct over-the-air software updates, while the Chinese-made buses did.\n\nYutong did not immediately respond to requests from The Associated Press on Wednesday seeking comment.\n\nThe Guardian, which reported on the issue, cited a statement from the Chinese company that said it \"strictly complies\" with the laws and rules of places where its vehicles operate.\n\nThe statement said data about its buses was stored in Germany.\n\nThe newspaper cited an unidentified Yutong spokesperson saying the data was encrypted and \"used solely for vehicle-related maintenance, optimisation and improvement to meet customers' after-sales service needs\".\n\nAccording to Yutong's website, the company has sold tens of thousands of vehicles across Europe, Africa, Latin America and the Asia-Pacific region in recent decades.\n\nThe study was initiated in part over concerns about surveillance at a time when many countries in Europe, North America and beyond have been taking steps to protect data about consumers and remote operations.\n\nBroader worries about remote control of EVs\n\nThe findings showed that \"the manufacturer has direct digital access to each individual bus for software updates and diagnostics,\" said Ruter, which said it ran half of Norway's public transport and operated in Oslo and the eastern Akershus region.\n\nInvestigation launched into Tesla's 'full self-driving' system The US government's road safety agency has launched an investigation into Tesla's \"Full Self-Driving\" system\n\nConcerns about remote control of electric vehicles are not new.\n\nUS regulators in January opened a probe into Teslas after reports of crashes involving the use of company technology that allowed drivers to remotely command their vehicle to return to them, or move to another location, using a phone app.\n\nThe Yutong buses are operated by people — they are not driverless vehicles like taxis and shuttles in places like California and China.\n\n\"Following this testing, Ruter moves from concern to concrete knowledge about how we can implement security systems that protect us against unwanted activity or hacking of the bus' data systems,\" Ruter CEO Bernt Reitan Jenssen said in a statement.\n\n'All types of vehicles' of this type at risk\n\nIn nearby Denmark, transport company Movia said it was reviewing risk assessments when it came to cybersecurity and espionage on scheduled buses, and possible measures to prevent hacking, misuse of data and the risk of disabling its buses.\n\nMovia said Danish authorities had not signalled any cases of buses being deactivated, but it was looking for ways to eliminate vulnerabilities.\n\nThe new findings, it said, were presented at the InformNorden traffic conference by advisers from the University of South-Eastern Norway and showed that neither a hacker nor the supplier could take control of the bus.\n\n\"It is also important to emphasise that the Norwegian senior advisers stated that this is not a Chinese bus concern, it is a problem for all types of vehicles and devices with these kind of electronics built in,\" Movia told AP in an email.\n\nTougher security rules\n\nCameras in the buses are not connected to the internet so \"there is no risk of image or video transmission from the buses,\" said Ruter, which has more than 100 Yutong buses in its fleet.\n\nThe buses cannot be operated remotely, it said.\n\nStill, Ruters said the manufacturer could access the control system for battery and power supply via a mobile network.\n\nIt said that means, in theory, buses \"can be stopped or rendered inoperable by the manufacturer\".\n\nThe Norwegian company said it was responding by imposing tougher security rules in future procurement, developing firewalls that ensure local control and prevent hacking, and working with authorities on \"clear cybersecurity requirements\".\n\nIt was also taking steps to delay inbound signals \"so that we can gain insight into the updates being sent before they reach the bus\".\n\nAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/pat-cummins-feeling-good-for-gabba-test-but-rest-may-be-needed/105977454",
    "title": "Pat Cummins feeling good for Gabba Test, but rest may be needed",
    "publish_date": "Thu, 06 Nov 2025 00:00:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "Pat Cummins remains on track to return for the second Ashes Test in Brisbane, but has conceded playing through the rest of the series unchanged could be difficult.\n\nCummins has progressed to bowling off a three-quarter run-up as he plots a meticulous return from a back injury that has sidelined the Test captain since July.\n\nThe 32-year-old was able to get through close to eight overs in the nets on Wednesday, and expects to be bowling at full pace by the start of the first Test.\n\nCummins has not felt any significant pain since his managed return to bowling, with no signs of any recurrence of the stress injury in his lower back.\n\nCummins back in the swing Australia's Test captain Pat Cummins completes a brief return to bowling as he steps up his bid to play in the Ashes series against England.\n\nOfficials have been coy on whether Cummins would return for the second Test in Brisbane starting in four weeks, but the quick remains a genuine chance.\n\n\"That's the aim and we're building our plan to the second Test,\" Cummins said at the Seven Network's cricket launch on Thursday.\n\n\"It's probably not until you get a bit closer that you can really know where you're at.\n\n\"The good thing is that I'm pulling up well and the body is great.\n\n\"We're trying to keep that second Test as a live option. I'll have a really good bowl in Perth, and by then I'll know where I'm at.\"\n\nWhat will not be so easy, Cummins concedes, is playing every remaining Test this summer once he does return.\n\nThere is an eight-day gap built in between the second and third Tests, but only four-day gaps between the third, fourth and fifth Tests.\n\nAustralian officials have already identified that as a pressure point of the summer for bowlers, particularly if Tests go the distance and the hosts spend long periods in the field.\n\n\"I'm pretty keen to play as much as I can,\" Cummins said.\n\n\"But realistically, if we have a big game and bowl 40 or 50 overs and then there's a game that starts a few days later, it might be a bridge too far.\n\n\"I'm trying to get right, and if I get right, then hopefully I'll try to play most of it as I can.\"\n\nCummins said he did not feel he would need a warm-up match during a tour game or grade-cricket fixture to have his body right for Test cricket.\n\nInstead, Australia's pace leader will fly to Perth with the rest of the team next week and spend the Test with coaching staff.\n\n\"Before the 2023 ODI World Cup, I flew over to South Africa and watched the last couple of ODIs there,\" Cummins said.\n\n\"It was actually a really different view from the coach's box. It's a different perspective.\n\n\"So hopefully I gather some information from being in that position through the Test that later on in the series I can use.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Or maybe Steve Smith needs something and I have seen something differently from up there.\n\n\"But being close to the game and the conversations, I think I will need that going into the second or third Test.\"\n\nMitchell Starc and Josh Hazlewood will lead the pace attack in Cummins's absence, with Scott Boland to keep his spot after taking a hat-trick in Australia's previous Test in the West Indies.\n\nAustralia is hoping all-rounder Cameron Green can bowl up to 20 overs in his next Sheffield Shield match, with Beau Webster a chance to stay on as a second all-rounder.\n\nAAP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/nick-kyrgios-aims-to-play-australian-open-after-knee-recovery/105977346",
    "title": "Kyrgios targets Australian Open after 'miracle' knee recovery",
    "publish_date": "Wed, 05 Nov 2025 23:33:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "From the depths of despair, Nick Kyrgios is feeling buoyant again and eyeing a shock Australian Open comeback.\n\nIn his first interview since announcing a Battle of Sexes showdown with Aryna Sabalenka next month, Kyrgios conceded he was feeling the pressure to beat the women's world number one.\n\nMore tellingly, the mercurial former Wimbledon finalist also revealed he had made a \"miracle\" recovery from a career-threatening knee injury and was hoping to be fit for the Melbourne Park major in January.\n\n\"Honestly, this has been the first person I've told, I guess, to the media, but the last month for me has been, I don't know what's changed with my knee,\" Kyrgios said.\n\n\"Like around that Washington period [in late July], I really didn't have hope to be able to play AO [Australian Open] or just ever get back to that point of where I felt comfortable and competing and really letting my body go.\n\n\"But something in the last month, I don't know what it is. I was with my masseuse and physio last night and something really has changed with my knee.\n\n\"Like it's not swelling. It's not feeling bad after a session.\"\n\nNick Kyrgios has struggled with knee and wrist injuries in the past three years. (Getty Images: TPN/Frey)\n\nBuilding momentum\n\nRestricted to just six matches in the past three years after four rounds of knee and wrist surgery, Kyrgios is ranked number 652 in the world having spiralled outside the top 1,000 at one point.\n\nBut the one-time world number 13 will play a series of exhibition matches next month against Ben Shelton in Atlanta, Tommy Paul at Madison Square Garden, the World Team Tennis in India and Sabalenka in Dubai on December 28 to gauge his fitness.\n\n\"Then if I get through all of that, I'm ready to go,\" Kyrgios said.\n\n\"I don't know whether to call it a miracle or anything, but my knee feels like it's gotten younger by a couple of years.\"\n\nKyrgios had no idea why his knee had suddenly come good, but said he was finally free in his movement again.\n\n\"I felt like something was almost like stuck or something was just a bit odd and then now, especially the last week and a half or two weeks, I'm back moving and sliding the way I was moving in 2022,\" he said.\n\n\"So something in my knee is just, you know I don't want to to jinx it, but something in it has gone, kind of allowed me to put three, four days of training together on court for an hour and a half, two hours and be able to actually recover and then build on that.\n\n\"So that's it's been really exciting and I haven't really told anyone. I have a new lease on life on court.\n\n\"Honestly, I'm in a really good space at the moment and, physically, I've been putting in the work.\"\n\nNick Kyrgios will be hoping for a smooth run of results. (Getty Images: Anychance/Simon Bruty)\n\nAustralian Open ambition\n\nThe 30-year-old would require a wildcard from Tennis Australia to gain entry to his home grand slam, but that would seem a given.\n\n\"Look, it's all very raw at the moment, but I literally told my agents yesterday there's a chance that I would love to play Brisbane again in singles [too],\" he said.\n\nIf he did return, Kyrgios would do so with modest expectations.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\n\"There's no f***ing like, 'Oh, I'm gonna win this tournament'. Because after the last couple of months, I lost complete hope,\" he said.\n\n\"I thought my tennis career was literally coming to doubles, whatever, but I thought that that chapter was closing, where now I'm just optimistic again.\"\n\nAlso reporting that his serving \"wrist is amazing now\" too, Kyrgios said it was too early to say if he would ever go deep at another grand slam.\n\n\"I mean, I'm optimistic with the way the way I'm feeling,\" he said.\n\n\"I genuinely feel like I could at least give myself the chance to get there because of the training.\n\n\"That was the issue. I wasn't even able to train and build and even stack days together.\n\n\"It was like knee swelling, ice, rest, let's get back on court, let's do the basics.\n\n\"Where now it's like, 'OK, I can work on my forehand, I can work on match play, I can work on my returns'.\n\n\"I'm actually working on my game rather than my body. I'm training how I was in 2022.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/ultramarathon-push-limits-in-90-hour-king-of-the-hill-running/105974046",
    "title": "Athlete wins $25k after running up and down same hill for four days",
    "publish_date": "Wed, 05 Nov 2025 22:31:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Blaine Bourke began to question what he was doing as darkness fell across the 89th hour of an ultramarathon in central Victoria.\n\n\"Towards that last night I started going a little bit loopy,\" Mr Bourke said.\n\nBlaine Burke says he was becoming delirious while racing due to sleep deprivation. (Supplied: Alex Cleary)\n\n\"My dad did a checklist, like 'Do you have your tracker, timing chip, do you have your head torch?' and I said, 'Yeah, but what am I doing here?'\n\n\"He said, 'You're racing!'\"\n\nMr Bourke said he did not last long after that.\n\n\"The biggest thing is the mental confusion of what you have to do,\" he said.\n\nContestants complete a 4.2-kilometre circuit up and down a hill every hour until just one runner remains. (Supplied: Emily Black)\n\nThe event — Harry's King of the Hill, held at Pyalong in central Victoria, is a gruelling endurance test.\n\nRunners complete a 4.2-kilometre circuit with a 266-metre elevation gain every hour, continuing until only one person remains.\n\nRunners who fail to finish a lap within the hour are eliminated.\n\nThe race began at 9am on Saturday and ended just after 2am on Wednesday.\n\nAbout 150 competitors took part, with some lasting hours and others lasting days.\n\nMr Bourke ran nearly 400 kilometres over 90 hours, finishing second behind this year's winner, Piotr Barbis.\n\nAthletes from around Australia took their chances tackling the circuit. (Supplied: Alex Cleary)\n\nHe said he was proud of his efforts and was happy the event had put ultra running on the map.\n\n\"They had amazing coverage and amazing payouts for the winner,\" he said.\n\n\"It's going in a direction that ultramarathon running has never been before.\"\n\n'A beautiful thing'\n\nOne of the event directors, Alex Cleary, said the competition was designed to showcase the mental toughness of its participants.\n\n\"It's the most crazy things watching people push themselves to the limit,\" he said.\n\nPiotr Barbis won after competing for 90 hours. (Supplied: Alex Cleary)\n\n\" That moment where you go one more [lap], that is the essence of what we are trying to showcase. \"\n\n\"[We see people] wanting to quit, wanting to give up, and it's such a good moment, it such a beautiful thing.\n\n\"We would literally make no money on this every year just so we could give athletes the recognition they deserve, because if you look at Australian ultra, there's no recognisable names, there's no one who's making good money from it, and right here today we got to give some $25,000,\" he said.\n\nLast year was the first King of the Hill competition. Organisers said the event had already grown significantly.\n\nWith 150 athletes already signed up for next year's event, the climb to the top looks set to get even tougher.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/microsoft-to-refund-customers-for-365-subscription-price-hike/105977094",
    "title": "Microsoft to refund customers for subscription price hike",
    "publish_date": "Wed, 05 Nov 2025 22:23:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Microsoft has apologised to customers and said it will refund them, after the consumer watchdog alleged the tech giant misled about 2.7 million Australians over subscription costs so they would remain on more expensive plans.\n\nThe company wrote to customers on Thursday to apologise to those affected, saying it \"fell short of our standards\" and could have \"communicated more clearly when we changed our pricing in October 2024\".\n\nLast week, the Australian Competition and Consumer Commission (ACCC) sued the tech giant for allegedly misleading Australians over its Microsoft 365 subscriptions.\n\n\"In response to the demand for advanced AI tools, we introduced AI capabilities into the Microsoft 365 Personal and Family subscriptions that we offer in Australia,\" the company said on Thursday.\n\n\"In hindsight, we could have been clearer about the availability of a non-AI enabled offering with subscribers, not just to those who opted to cancel their subscription.\n\n\"In our email to subscribers, we expressed our regret for not being clearer about our subscription options, shared details about lower-priced alternatives that come without AI and offered a refund to eligible subscribers who wish to switch.\"\n\nAnnouncing the court action last week, the consumer watchdog slammed Microsoft for the conduct, alleging it \"deliberately hid\" a subscription option from Australian customers and said it would be seeking a penalty that would deter similar behaviour from other firms.\n\nThe tech giant faced backlash from customers who did not want to pay for Copilot. (Reuters: Dado Ruvic/Illustration)\n\nCustomers have two options: to stay on the Microsoft plan with Copilot features at the increased price, or to switch back to the \"Classic\" plan, which the company says \"does not include our AI assistant Copilot and may not receive new feature updates\".\n\nMicrosoft said subscribers who opted to switch back to the cheaper plans before the end of 2025 would, within 30 days, receive refunds dating back to payments made after November 30, 2024.\n\nLoading...\n\nHow the ACCC alleges Microsoft misled customers\n\nFollowing the integration of Microsoft's AI feature, Copilot, the company increased the annual subscription price of its Microsoft 365 personal plan by 45 per cent from $109 to $159.\n\nThe annual subscription price for the Microsoft 365 family plan increased by 29 per cent from $139 to $179.\n\nThe ACCC alleged that since October 31, 2024, Microsoft had told these subscribers with auto-renewal enabled that to maintain their subscription, they \"must accept the integration of Copilot and pay higher prices for their plan, or, alternatively, cancel their subscription\".\n\nThis information was false or misleading, the ACCC alleges, because there was \"an undisclosed third option\" — the Microsoft 365 Personal or Family Classic plans — which allowed subscribers to retain the features of their existing plan, without Copilot, at the previous lower price.\n\nMicrosoft has come under fire for hiking its subscription prices. (AP)\n\nMicrosoft sent two emails and published a blog post to inform auto-renewing subscribers — as of October 31, 2024 — about the Copilot integration and the impending price increase that would apply at their next renewal.\n\nThe ACCC's case against Microsoft centres around those three pieces of communication the company had with its customers.\n\n\"We allege that Microsoft's two emails to existing subscribers and the blog post were false or misleading as they conveyed that consumers had to accept the more expensive Copilot-integrated plans, and that the only other option was to cancel,\" ACCC chair Gina Cass-Gottlieb said when announcing the legal action on October 27.\n\n\"All businesses need to provide accurate information about their services and prices. Failure to do so risks breaching the Australian consumer law.\"\n\nIn its message to customers on Thursday, Microsoft said it did not act in a trustworthy and transparent manner.\n\n\"We have been present in Australia for more than 40 years, operating on the principles of trust and transparency. We fell short of our standards here, and we apologise. We will learn from this and improve,\" the company said.\n\nThe US-based tech giant could face multi-million-dollar penalties if the court finds in the ACCC's favour.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/tony-galati-group-buys-apple-avacado-orchards/105973692",
    "title": "Spud King expands empire with $14m orchard deal",
    "publish_date": "Wed, 05 Nov 2025 21:51:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's \"Spud King\" Tony Galati has made a $14 million deal to buy two major orchards in the South West.\n\nThe Galati Group, best known for its Spudshed supermarkets and low-cost produce, has purchased Redland farm and Guadagnino Orchards, both in Manjimup.\n\nThe two orchards produce a wide range of fruit including Bravo, Pink Lady, Granny Smith, Gala and Golden Delicious apples, as well as pears, cherries, stone fruit and avocados.\n\nMr Galati said settlement was due next month.\n\n\"We've taken ownership of one of the farms and will settle the second next month,\" he said.\n\n\"It's about ensuring we can offer top-quality apples and avocados at fair prices, all year round.\"\n\nRay Guadagnino's family owns one of the orchards the Galatis plan to buy. (ABC Rural: Jessica Hayes)\n\nA spokesperson for the Guadagnino family, which has owned one of the orchards for decades, said the sale was being negotiated.\n\nBut they were pleased their property would be taken over by the Galatis.\n\n\"We're very happy it's going to a good family,\" the spokesperson said.\n\n\"They have the same values as us — that's important to us.\"\n\nVegetables WA chief executive Peter Spackman said the acquisition was unlikely to negatively impact smaller producers and could strengthen WA's food security.\n\n\"We shouldn't see too much of a difference,\" he said.\n\n\"We'd always like to see small family businesses stay in the industry, but we also understand there's a bit of pressure on in the market.\n\n\"If they've got the opportunity to exit while we're continuing to supply food to WA and continue on food security, that's a good thing.\"\n\nThe South West orchards produce a wide range of fruit. (ABC Rural: Jessica Hayes)\n\nGalati Group chief executive Frankie Galati said the investment reflected the company's commitment to regional WA.\n\n\"Initially we wanted to ensure that we had a good supply of apples for our shops and retailers,\" he said.\n\n\"We've got a large customer base and we've found that the apple supply over the last few years has been very tight.\n\n\"We wanted to ensure that we got a consistent supply, and that's part of the investment.\"\n\nThe family is also expanding its retail footprint, with a new Spudshed store opening in Kalgoorlie later this month.\n\nOther outlets are planned in Albany and Geraldton next year.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/solar-sharer-scheme-free-power-electricity-who-benefits/105973232",
    "title": "Who could benefit most from Labor's proposed Solar Sharer scheme?",
    "publish_date": "Wed, 05 Nov 2025 21:24:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal government wants to introduce a new electricity offer that gives people in certain areas free power for at least three hours in the middle of the day.\n\nLabor's proposed Solar Sharer scheme aims to tap into the high levels of electricity generated by solar panels.\n\nBut who would most benefit?\n\nWho would get free power?\n\nIf the plan is introduced in July — and Climate Change and Energy Minister Chris Bowen said it would in a press release this week — it would only apply to people in the areas covered by the Australian Energy Regulator's Default Market Offer.\n\nYou might assume something called the Australian Energy Regulator would cover the whole country, but it only covers three areas:\n\nNew South Wales\n\nSouth Australia\n\nSouth-east Queensland\n\nMr Bowen said the government would consult with other states to potentially extend the offer by 2027.\n\nThe federal government's proposed scheme will allow some Australians to move to electricity plans that give them free power during the day. (ABC News: Lucas Hill)\n\nHow would it work?\n\nMr Bowen said the plan would require retailers to offer free electricity to households for at least three hours in the middle of the day.\n\nBut don't expect it to be an automatic discount — consumers would need to actively sign up to that offer.\n\nThey must also have a smart meter.\n\n\"The Australian Energy Regulator will regulate the Solar Sharer Offer to ensure customers also get a fair deal outside of the free power period,\" Mr Bowen said.\n\nWho gets free power — and who misses out — under proposed scheme The federal government says its new Solar Sharer scheme will also benefit Australians who aren't able to access it, but some experts are hesitant to agree.\n\nBut Finn Peacock, who formerly worked in the CSIRO's energy divisions and now runs comparison website Solarquotes, is sceptical.\n\n\"[Consumers] should only switch to that plan if they think they're going to be better off on that plan,\" he said.\n\n\"And most consumers, I think, won't be better off on that plan.\"\n\nMr Peacock is concerned that forcing retailers to offer free power during the day will see companies compensate for that by pushing up other costs.\n\nHowever, Grattan Institute's Energy and Climate Change Director Tony Wood told 4BC Brisbane that, while there were some kinks to work out, the scheme could have \"a very significant benefit\".\n\n\"If you can also move that demand for electricity towards the middle of the day, that would actually reduce the pressure on the system later in the day … and that'd be good,\" Mr Wood told the radio station.\n\nThat is a point Mr Bowen is also pushing.\n\n\"[The plan] helps us with the grid at night too, because it means transferring the use of power from night-time — when power is more expensive because it's being run by coal and gas — to the middle of the day when it's being run by renewable energy,\" he said in a social media video.\n\nWho could benefit from the scheme?\n\nLet's have a look at some of the groups of people who are best placed to take advantage of the scheme.\n\nHowever, keep in mind that we don't know how much more expensive these plans could be, so this is pretty speculative.\n\nPeople with smart appliances\n\nThe idea of the scheme is for people to change their energy use so it aligns with the free period during the day.\n\nThat might mean setting a washing machine, dryer or dishwasher to turn on at midday.\n\nIt could also mean programming your hot water system to heat water during the free electricity hours.\n\nIf you have a \"delay start\" button on your washing machine, you can set the wash cycle to begin hours in advance. (ABC News: Dannielle Maguire)\n\nPeople with EVs and solar batteries\n\nMr Peacock reckons people with solar batteries and electric vehicles (EVs) will be best suited to take advantage of the scheme.\n\n\"If you don't have a [house] battery on an electric car, you can charge for free during the day, [then] you're probably going to be paying a lot more for your peak electricity during the evening when you're forced to use electricity,\" he said.\n\nMr Peacock said that it makes sense for people with solar panels who either already have a battery or can afford to buy one.\n\nHe said people could take advantage of the plan by \"getting a big enough battery so they can fill it for free during the day, and then not touch the grid from about four to about nine in the evening, when electricity prices are really expensive.\"\n\nPeople with solar batteries will be well-placed to take advantage of the scheme. (ABC News: Courtney Withers)\n\nPeople who work from home\n\nIf you work from home, you're likely burning through energy to keep your computer running throughout the day.\n\nThis might also mean running the air conditioner in the heat of the day.\n\nIf you opt for a new Solar Sharer plan, you won't have to change your behaviour to see some benefits — you just won't be charged for that power usage during those three hours.\n\nIt also wouldn't matter if you had a washing machine with a timer setting or not.\n\nIf you're at home, you could just turn the appliance on during the free power hours rather than when you pay for electricity, thus saving you money on your power bill.\n\nHigher-income households\n\nMany older washing machines, for example, don't have settings that allow people to set the machine to start at certain times.\n\nSo if people want to be able to take advantage of the free electricity hours by pre-setting their appliances, they'll need to buy newer appliances that have those features.\n\nAnd that obviously costs money.\n\n\"Lower income households face barriers to investing in automation technologies for their homes, either because of lack of disposable income, or because they rent,\" a report from Energy Consumers Australia in January said.\n\nThe same goes for the batteries and solar vehicles.\n\nElectric vehicles can be expensive. (ABC News: Brendan Esposito)\n\n\"It's only really going to make sense for people who either have a home battery or an electric car that they have at home,\" Mr Peacock says.\n\n\"The problem there is that's generally the most affluent households.\"\n\nAnd let's not forget the mental load of having to keep track of when to use appliances to be better at saving energy.\n\n\"Higher income households showed a strong interest in purchasing home automation and battery systems,\" the Energy Consumer Australia report said.\n\n\"These systems make it easier and more efficient to respond to price signals by automatically optimising energy usage to save the owner money.\n\n\"These systems also allow households not to have to think about when they use energy.\"\n\nWill it be better for renters?\n\nThe idea of the scheme is to share the benefits that people with solar panels receive with other people on the grid.\n\nGenerally speaking, people who own their homes are more likely to have solar panels than renters, so renters tend to miss out on the cost-cutting benefits solar panels can provide.\n\nMr Bowen said the scheme would benefit people who did not have solar panels — including renters.\n\nSolar panels can be costly to install. (ABC News: Josh Bavas)\n\nMr Peacock disagrees.\n\n\"I don't see how this does anything for renters,\" he said.\n\n\"Renters are less likely to be at home during the day.\n\n\"They're still going to be forced to pay higher peak prices in the evening.\n\n\"And unless the regulations change and you get cheap portable batteries, they can't get a battery installed either.\"",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/ups-cargo-plane-crash-investigations-data-recorders-recovered/105976950",
    "title": "UPS plane death toll rises, authorities say engine fell off before crash",
    "publish_date": "Wed, 05 Nov 2025 21:14:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "The left wing of a UPS cargo plane caught fire and its engine fell off before the aircraft crashed and exploded after take-off in Kentucky, according to US aviation authorities who say they have recovered the flight data and cockpit voice recorders from the wreckage.\n\nThe death toll from the crash has risen to at least 12, according to Louisville Mayor Craig Greenberg.\n\nKentucky Governor Andy Beshear said that authorities also believed one of the victims was a young child.\n\nThe incident on Tuesday, local time, destroyed the plane and sparked smaller explosions at Kentucky Petroleum Recycling and an auto salvage yard in Louisville, authorities say.\n\nThree people were aboard when the plane, a McDonnell Douglas MD-11 made in 1991, crashed as it took off for Honolulu from UPS Worldport at Louisville's Muhammad Ali International Airport about 5:15pm.\n\nA giant, black smoke cloud rose above Louisville, Kentucky, after the plane went down. (Reuters: Supplied / Jeff Faughender / USA Today Network)\n\nAbout 200 firefighters and emergency personnel and 50 trucks were called to battle the blaze, which filled the evening sky with thick, black smoke.\n\nThe University of Louisville Hospital initially said two people were in critical condition in the burns unit on Wednesday and that 13 others had been treated and discharged. Five people were treated at other hospitals.\n\nThe National Transportation Safety Board has launched an investigation, while Kentucky Governor Andy Beshear has predicted that the death toll from the crash would grow.\n\nLoading...\n\nMr Beshear says that 16 families have gathered at a reunification centre for news of loved ones who remain missing.\n\n“I don't know how many victims we're actually looking for,” Mark Little, chief of the Okolona Fire District in Louisville, said.\n\n\"Most of the things are gone, including some of the vehicles, the semis and the plane.\n\n\" That's one of the issues, and the debris zone is so large. Some of that debris is going to have to be moved and searched underneath. It will take us quite a while. \"\n\nThe airport is located about 11 kilometres from downtown Louisville, close to the Indiana state line, residential areas, a water park and museums. People in the immediate area were told not to drink tap water in the wake of the crash.\n\nUPS said it was “terribly saddened\" by the incident. The Louisville package handling facility is the company's largest, employs thousands of workers, handles 300 flights daily and sorts more than 400,000 packages an hour.\n\n“We all know somebody who works at UPS,” Louisville Metro Council member Betsy Ruhe said.\n\n\" They're all texting their friends, their family, trying to make sure everyone is safe. Sadly, some of those texts are probably going to go unanswered. \"\n\nHundreds of firefighters and other emergency personnel fought the fires after the crash. (AP: Jon Cherry)\n\nState of emergency declared\n\nGovernor Beshear declared a state of emergency in Kentucky, saying it would help with the state's massive response to the crash site, allowing \"us to move resources more quickly\".\n\nThe international airport reopened to air traffic early on Wednesday, although the runway where the accident happened is expected to remain closed for another 10 days, officials said.\n\nSatellite imagery of the crash site in Louisville shows cargo containers and parked cars located in a large, black burn trail caused by the plane wreckage. (AFP: Supplied / Satellite image Vantor)\n\nUPS also said it halted package-sorting operations at its airport facility, and then cancelled a parcel-sorting shift on Wednesday that usually began mid-morning.\n\nProduction of the MD-11 plane ended in 2000, and passenger services officially ended in 2014. For cargo operations, there are about 50 MD-11 planes being operated by FedEx and UPS worldwide, with two other planes of that type still operating.\n\nGE Aerospace, which produced the engines for the plane, said it offered its support to UPS and to the NTSB.\n\nUPS operations in the United States have been significantly disrupted and some of the company's other aircraft halted in the wake of the crash. (AFP: Brendan Smialowski)\n\nUS aviation safety expert Anthony Brickhouse said investigators were expected to focus on the number-one engine, which was seen on video to be ignited, and appeared to have separated from the aircraft.\n\n\"It is designed to fly if you lose one engine, but we need to see the effect of losing that engine on the rest of the aircraft,” he said.\n\nThe triple-engine plane was fuelled for an eight-and-a-half-hour flight.\n\nIt was the first UPS cargo plane to crash since August 2013, when an Airbus aircraft went down on a landing approach to the international airport in Birmingham, Alabama, killing both crew.\n\nAP/Reuters",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/f1-brazil-sao-paulo-grand-prix-start-time-how-to-watch-piastri/105973476",
    "title": "How to follow Oscar Piastri during the F1 grand prix this weekend",
    "publish_date": "Wed, 05 Nov 2025 20:55:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "For the first time in 16 Formula 1 weekends, Oscar Piastri enters an F1 round not as the drivers' championship leader.\n\nThe Australian enters this weekend's racing in Brazil one point behind his McLaren teammate, Lando Norris.\n\nMeanwhile, Red Bull's Max Verstappen continues to lurk, 36 points behind Norris in a comeback that has been worthy of any champion.\n\nThere are four rounds left of this epic championship season, with a genuine three-way battle for the drivers' championship.\n\nHere is how to follow this weekend's F1 action through ABC Sport, including the Formula 1 São Paulo Grand Prix live blog on Monday, November 9.\n\n'Proud' Piastri is now the hunter as Norris leads the championship\n\nPiastri was the leader of the drivers' championship from the end of round five in Saudi Arabia until round 20's grand prix in Mexico.\n\nBut now, the Australian is second in the championship, one point behind his McLaren teammate Norris.\n\nNorris has 357 points, Piastri has 356, and Verstappen remains in the hunt with 321 points.\n\nPiastri's loses lead, but there is hope in his title bid Oscar Piastri has lost his lead in the Formula 1 drivers' championship. Despite momentum working against the Australian, there are still plenty of reasons to believe he can win the world title.\n\nPiastri won seven of the first 15 grands prix this season, but has not been on the top step in the previous five rounds.\n\nThe Australian finished on the podium in 14 of the opening 16 grands prix, but has failed to place in the top three in the next four.\n\nThe dip in form has eradicated what was a 34-point lead to Norris after round 15 in the Netherlands, Piastri's last win.\n\nHowever, Piastri's fifth-place effort at the Mexican Grand Prix was arguably one of his better drives this season.\n\nPiastri had not looked comfortable in his McLaren that weekend, compared to Norris, who was a class above the field and took victory.\n\nBut the Australian improved throughout the race, and on a track that can be difficult to overtake on, climbed from ninth after the first lap to finish in the top five.\n\nCircuits with low grip, like in Mexico, appear not to suit Piastri's style of driving. But McLaren's team principal Andrea Stella said after the race two weeks ago that Piastri was able to adapt in those conditions and improve as the weekend went on.\n\nF1 driver says he 'could have killed' marshals after shocking near miss A camera captures the terrifying moment two track marshals run in front of Liam Lawson's car during Formula 1's Mexico City Grand Prix.\n\nWhile acknowledging it was a tough weekend for the Australian, Stella said it was an important learning experience as Piastri enters the final four rounds of the championship.\n\n\"It's important for Oscar that we go through this kind of experience in which we learn new tools to add to the toolbox, because that's how you become the most complete version of a Formula 1 driver,\" Stella said after the Mexico City Grand Prix.\n\n\"And this is also important for the next four races in which we're going to find, again, different conditions.\n\n\"So, we need to be ready for all of them. But I think Oscar should be very proud and happy with this race.\"\n\nThe São Paulo track is traditionally high-grip, requiring a car to have plenty of downforce. In theory, this should be better for Piastri, who won in the Netherlands on a track that also requires high downforce.\n\nWhen does the F1 São Paulo Grand Prix begin?\n\nIn Australia, the Formula 1 São Paulo Grand Prix will be held on Monday, November 10.\n\nHere is when the race will begin in each of Australia's states and territories:\n\n4am AEDT: NSW, ACT, Vic, Tas\n\n3:30am ACDT: South Australia\n\n3am AEST: Queensland\n\n2:30am ACST: Northern Territory\n\n1am AWST: Western Australia\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThere is also a sprint race this weekend in Austin.\n\nThe sprint race, which is one-third of a grand prix distance, will run overnight on Saturday, November 8 and Sunday, November 9.\n\nHere is when the sprint race will begin in each of Australia's states and territories:\n\n1am AEDT, Sunday, November 9: NSW, ACT, Vic, Tas\n\n12:30am ACDT, Sunday, November 9: South Australia\n\n12am AEST, Sunday, November 9: Queensland\n\n11:30pm ACST, Saturday, November 8: Northern Territory\n\n10pm AWST, Saturday, November 8: Western Australia\n\nHow can I watch and follow the F1 São Paulo Grand Prix?\n\nFox Sports and its streaming platform Kayo will be broadcasting the São Paulo Grand Prix.\n\nThose watching on Foxtel can watch the race on Fox Sports, channel 506.\n\nYou can also follow all the action with the ABC Sport live blog, from pre-race drama to the post-race synopsis.\n\nABC Sport's live blog of the Formula 1 São Paulo Grand Prix, in Brazil, will begin at 2am AEDT on Monday, November 10.\n\nWhat do I need to know about the Autódromo José Carlos Pace?\n\nIllustration of the Autódromo José Carlos Pace, hosting the F1 Sao Paulo Grand Prix. (F1)\n\nA lap around the Autódromo José Carlos Pace is completed in quick time and features plenty of challenges for drivers.\n\nThe Senna S — turns one and two, named after legendary champion Ayrton Senna, is sharp and downhill and comes at the end of the start-finish straight.\n\nThis is often the best place to overtake on the racetrack.\n\nTurn four, a sharp left-hander at the end of the circuit's other straight, is another opportunity for overtaking.\n\nThe rest of the lap is full of sweeping turns and hard braking zones, providing a test for the driver and machine.\n\nFast facts about the Autódromo José Carlos Pace\n\nFirst race: 1973\n\nNumber of laps: 71\n\nLap distance: 4.309km\n\nRace distance: 305.939km\n\nFastest grand prix lap: 1:10.540 — Valtteri Bottas (2018)",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-06/isaah-yeo-returns-as-kangaroos-rugby-league-ashes-third-test/105976876",
    "title": "Yeo returns as Kangaroos look for Ashes sweep",
    "publish_date": "Wed, 05 Nov 2025 20:35:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "Kangaroos coach Kevin Walters has resisted the temptation to blood his unused squad members by naming a strong side for the third and final Ashes Test in Leeds.\n\nSkipper Isaah Yeo returns to lead the side as Australia looks to complete a clean sweep over England.\n\nAfter Australia opened up their unassailable 2-0 lead with the 14-4 win at Everton last weekend, Walters had mused aloud about the prospect of giving a \"reward\" to fringe members of the squad by throwing them into the final Test at Headingley on Saturday (Sunday AEDT).\n\nAustralia team for third Ashes Test 1. Reece Walsh, 2. Mark Nawaqanitawase, 3. Kotoni Staggs, 4. Gehamat Shibasaki, 5. Josh Addo-Carr, 6. Cameron Munster, 7. Nathan Cleary, 8. Patrick Carrigan, 9. Harry Grant, 10. Tino Fa'asuamaleaui, 11. Angus Crichton, 12. Hudson Young, 13. Isaah Yeo (c). 14. Tom Dearden, 15. Lindsay Collins, 16. Reuben Cotter, 17. Keaon Koloamatangi. 18. Bradman Best.\n\nInstead, despite plenty of calls for him to use the \"dead rubber\" as a chance to field new Kangaroos with an eye on next year's World Cup, he has put out what he considers Australia's best 17 to go and finish the job ruthlessly.\n\n\"We've had to work exceptionally hard in challenging conditions to win the opening two Tests, and while we'd like to reward the extended squad for their outstanding efforts on tour, we just feel that the players who have got the job done deserve to play in Leeds,\" Walters said.\n\n\"The playing group has had a few days off to freshen up and now it's back to work — we've trained well today and we've still got the captain's run to get ourselves where we need to be for what is a very important Test match for both sides.\"\n\nHarry Grant led Australia in the second Test in the absence of Isaah Yeo. (Getty Images: Michael Steele)\n\nPanthers lock Yeo is the only change to the second-Test team that had to slog hard to overcome England in Liverpool.\n\nThe 30-year-old Panthers star got just a few minutes of action in the first-Test 26-6 win at Wembley before a head-knock with Dom Young sidelined him.\n\nBut Yeo has been welcomed back to lead the side after undergoing all the necessary NRL concussion protocols, with second-Test stand-in Harry Grant handing back the armband.\n\nYeo comes in for his clubmate Lindsay Smith, who will now move back to the extended squad for the final Test.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nWalters's choice may not have gone down too well with those pundits who felt this would have been the perfect chance to experiment with the Ashes wrapped up for the 14th consecutive time.\n\nInstead, the tour stands to be completed without six of the 24-strong touring squad seeing a minute's action — Bradman, Ethan Strange, Blayke Brailey and Jacob Preston, who remain uncapped, as well as the more experienced Dylan Edwards and Mitch Moses.\n\nGehamat Shibasaki, who had not had the most impactful series, had seemed vulnerable to being replaced by Best, but the Newcastle centre remains as 18th man.\n\nAnother inaugural accolade to be settled on Saturday will be the player-of-the-series award, which has been re-named the Fulton-Reilly award, after two Ashes icons, the Kangaroos' Bob Fulton and England's Malcolm Reilly.\n\nFavourites for the honour include Reece Walsh and Cameron Munster, who won the man-of-the-match awards in the first two Tests, as well as the exceptional Angus Crichton and Harry Grant.\n\nAAP",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/movies/meghan-duchess-of-sussex-to-return-to-acting-in-new-film-20251106-p5n88v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Meghan, Duchess of Sussex, ‘to return to acting’ in new film",
    "publish_date": "Thu, 06 Nov 2025 12:54:12 +1100",
    "category": "entertainment",
    "authors": [
      "Gwyn Wright"
    ],
    "text": "The Duchess of Sussex has reportedly returned to acting after an eight-year hiatus.\n\nMeghan appeared on the set of Close Personal Friends, where she will play herself, alongside Lily Collins, Brie Larson, Jack Quaid and Henry Golding.\n\nThe main cast of US TV show Suits, featuring Meghan Markle (centre). Credit: AF archive / Alamy Stock Photo\n\nThe Amazon MGM Studios production is about two couples, one of them famous and the other not.\n\nThe Duchess, who played Rachel Zane in Suits, quit acting in 2017, a year after she began dating Prince Harry.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/mike-bush-faces-scrutiny-over-second-helicopter-ride-20251106-p5n897.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mike Bush faces scrutiny over second helicopter ride",
    "publish_date": "Thu, 06 Nov 2025 12:41:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "Mike Bush faces scrutiny over second helicopter ride\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/racing/oaks-day-2025-live-getta-good-feeling-the-favourite-as-sun-shines-over-flemington-fashions-on-the-field-in-focus-20251105-p5n7yf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Oaks Day 2025 LIVE: Getta Good Feeling the favourite as crowds flock to sunny Flemington; US reality TV star to hit the Birdcage",
    "publish_date": "Thu, 06 Nov 2025 12:40:42 +1100",
    "category": "lifestyle",
    "authors": [
      "Danny Russell",
      "Cara Waters",
      "Stephen Brook",
      "Nell Geraets"
    ],
    "text": "Everyone knows Oaks Day is reserved for ultra-feminine looks – think lacey numbers, baby blues and pastel pinks.\n\nBut content creator and podcaster Rozalia Russian doesn’t want to do what everyone expects.\n\n“I knew I wanted to steer away from pink or lilac, as I feel that can sometimes feel a little bit predictable,” Russian says.\n\nRozalia Russian’s refreshing look. Credit: Justin McManus\n\nSo, she teamed up with J’Aton Couture to create her “refreshing” mint green ensemble.\n\nThe form-fitting lace dress has the structure and formality expected of most racewear, but is paired with a matching headscarf – from Melissa Jackson Millinery – that pulls on an edgier vibe.\n\nLoading\n\n“I always like to push the boundaries and choose something that people maybe don’t expect. This mint green dress – I don’t think anyone would have expected me to rock this colour,” she says.\n\nShe’ll probably be back in her gym clothes tomorrow, Russian says, but for now, she’s luxuriating in the opportunity to dress up to the nines so many times in one week.\n\n“I would love to be able to dress up all the time, like they used to in the ’50s and ’60s,” she says.\n\n“I wish we would wear outfits like this every day.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/victoria/derrimut-gym-empire-enters-administration-20251106-p5n87a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Derrimut gym empire enters administration",
    "publish_date": "Thu, 06 Nov 2025 12:40:42 +1100",
    "category": "finance",
    "authors": [
      "Carla Jaeger",
      "Sophie Aubrey",
      "Sarah Danckert"
    ],
    "text": "Derrimut 24:7 Gym founder Nick Solomos has appointed administrators to the largest company within his floundering fitness empire, just days after billionaire businessman Adrian Portelli backed out of a lifeline deal.\n\nEmployees were informed on Thursday in an all-staff missive, seen by The Age, that stressed that it was business as usual for the gym chain, which is estimated to have racked up a near $30 million debt pile.\n\nNick Solomos placed a key company within his Derrimut 24:7 gym empire into administration on Thursday. Credit: Eddie Jim\n\n“This decision was not made lightly, but it represents a proactive step to give us the best possible opportunity to restructure, protect jobs, and position the business for a stronger future,” Solomos wrote.\n\nAll staff will continue to be paid weekly, and members will still have access to all of its 26 gym locations, he said.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-hanson-to-address-us-conservative-forum-as-she-closes-in-on-ley-in-polls-at-least-85-dead-75-missing-in-philippines-as-typhoon-kalmaegi-heads-for-vietnam-20251106-p5n83v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Microsoft apologises, offers refunds to 2.7 million Australians; Left engine fell off plane during take-off before fatal Kentucky crash, investigators find",
    "publish_date": "Thu, 06 Nov 2025 12:40:13 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Some of the lustre may have come off gold prices, but the precious metal is still adding extraordinary value to Australia’s trade performance.\n\nFigures out this morning from the Australian Bureau of Statistics showed gold exports jumped by 71.5 per cent in September to $5.3 billion.\n\nGold exports have soared since the start of Donald Trump’s second term as US president. Credit: Getty\n\nGold exports have soared since Donald Trump took up residence in the White House.\n\nThrough the first nine months of the year, Australian gold exports reached a record $43 billion, a 67 per cent increase over the same period in 2024.\n\nBy contrast, exports of iron ore – Australia’s most valuable export – fell by 6.7 per cent (to $88.5 billion). Exports of LNG have eased by 8.8 per cent to $45.5 billion while coal exports have tumbled by 27.5 per cent to $47 billion.\n\nMost of the surge in gold exports is due to high prices which peaked early last month at more than $US4300 an ounce. This morning, gold was just shy of the $US4000 mark.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/queensland/crisafulli-government-dumps-child-mental-health-hub-20251106-p5n85u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crisafulli government dumps child mental health hub",
    "publish_date": "Thu, 06 Nov 2025 12:32:16 +1100",
    "category": "finance",
    "authors": [
      "Felicity Caldwell"
    ],
    "text": "The Queensland LNP government has scrapped a new purpose-built clinic for children’s mental health in Yeronga, despite months ago putting aside more than $3 million for it to go ahead.\n\nThe Labor government announced in 2020 that an $8.5 million Child and Youth Community Health Hub would be built to house the Child and Youth Mental Health Service and a service to address eating disorders.\n\nThe clinics moved temporarily from their old sites in Yeronga and Greenslopes to Mount Gravatt while the new Yeronga hub was built – a project that suffered delays during the COVID period.\n\nThe old Child and Youth Mental Health Service at Yeronga.\n\nBut this week staff were informed the purpose-built hub would be scrapped, and the mental health clinic could not move back to its original location in an old Queenslander on Park Road at Yeronga.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/perth-convention-and-exhibition-centre-revamp-likely-canned-over-cost-concerns-20251106-p5n877.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "$1.6 billion Perth convention centre upgrade scrapped to buy and build hospitals",
    "publish_date": "Thu, 06 Nov 2025 12:27:28 +1100",
    "category": "finance",
    "authors": [
      "Holly Thompson",
      "Hamish Hastie"
    ],
    "text": "The WA government will divert funding from the abandoned Perth Convention and Exhibition Centre upgrade to expand the state’s under-pressure hospital system at a cost of $1.5 billion which will include the purchase of St John of God’s Mount Lawley Hospital.\n\nPremier Roger Cook made the funding announcement on Thursday, confirming the state would no longer proceed with plans to upgrade the ageing ‘shed on the Swan’ convention centre over concerns its cost would blow out.\n\nPerth Convention and Exhibition Centre concept images from Wyllie and Brookfield.\n\nUnder the new fund, Cook said negotiations were underway to buy the Mount Lawley Hospital from private operator St John of God, which would immediately add 197 beds into the public system.\n\nMore than half the beds at that hospital are already filled with public patients.",
    "source": "SMH",
    "cluster_id": 9
  },
  {
    "url": "https://www.smh.com.au/national/victoria/real-estate-agents-forced-to-follow-stricter-price-guidelines-in-underquoting-crackdown-20251106-p5n842.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Real estate agents forced to follow stricter price guidelines in underquoting crackdown",
    "publish_date": "Thu, 06 Nov 2025 12:11:09 +1100",
    "category": "finance",
    "authors": [
      "Angus Delaney",
      "Aisha Dow"
    ],
    "text": "Real estate agents who underquote property listings will be forced to follow stricter guidelines to justify their price guides after an investigation found agents have been deliberately using bogus “comparable” properties to justify the illegal practice.\n\nAgents who set a property’s estimated sales price on comparable sales must now consider a home’s age and renovation status, as set out in statement of information requirements. It adds to existing guidelines, which instructs agents to consider a home’s architectural style, floor and land size, zoning, distance from key infrastructure and whether it has special features, such as a swimming pool or tennis court.\n\nThe government has introduced new laws to try to clamp down on underquoting. Credit: Mark Stehle\n\nAgents are also being instructed not to overlook substantially similar properties when picking comparable homes, after complaints that some were deliberately excluding sales of similar properties in the same street, apartment building or even duplex.\n\nBy choosing inferior properties, the agents have been attempting to sidestep laws designed to combat underquoting, an illegal practice where agents deliberately list properties for lower than they’re worth to attract more buyers.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/a-report-card-on-the-trump-presidency-20251106-p5n851.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A report card on the Trump presidency",
    "publish_date": "Thu, 06 Nov 2025 12:00:34 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "US oil production has increased, from the record average of 13.3 million barrels a day last year under the Biden administration to what the International Energy Agency predicts will be an average of 13.5 million barrels a day this year, but the slump in oil prices is likely to result in a sharp fall in drilling activity next year. Is the US experiencing “the most successful economy in the history of our country,” as Trump claimed? If the sharemarket were any guide, the answer would be an unequivocal “yes”. It’s up 17.5 per cent since last year’s election, albeit that it is being driven by the boom in artificial intelligence rather than the economy’s wider settings. Those with an exposure to the market, which tends to be the wealthier households, certainly see the Trump presidency as a success. They were also the major beneficiaries of the big tax cuts in Trump’s “One Big Beautiful Bill Act” that has since been rebranded, for obvious political reasons, as the “Working Families Tax Cut Bill”.\n\nThe wealthy (the Trump family in particular) have also benefited from the massive surge in the value of crypto assets that has occurred since Trump embraced an asset class he once derided and which the Biden administration viewed with suspicion and cynicism. In the real economy, and for the less wealthy and poor US households, things aren’t quite as buoyant. The US economy grew at 2.4 per cent last year. Trump’s “greatest economy”, one he repeatedly claims is the envy of the world, and which he said on Wednesday is seeing “the American Dream surging back to life”, will grow, according to the International Monetary Fund, 2 per cent this year and 2.1 per cent in 2026. US consumers don’t appear to believe that Trump is making America affordable again, with his approval rating dropping from 47 per cent early this year to 37 per cent in recent polling. Credit: Getty Images The now-record government shutdown will shave up to a percentage point off the December quarter GDP, although much of that should be recovered once the government re-opens and its furloughed employees are paid again.\n\nUS government debt was $US36.1 trillion at the end of last year. It’s now above $US38 trillion and rising. Despite Elon Musk and DOGE taking a chainsaw to the US bureaucracy and more than 100,000 federal government employees sacked, the budget deficit forecast by the Congressional Budget Office of $US1.8 trillion this year will only be marginally smaller than last year’s $US1.83 trillion, despite Trump hacking into the massive spending Biden was making in green energy and advanced manufacturing. Loading There’s been a lot of talk this year about the “debasement trade”, or investors selling US dollar-denominated assets because they are worried that, to escape its debt trap, the US will allow inflation and money-printing or more extreme measures that will erode the value of the dollar and the real value of their investments. The US dollar, while it has bounced back from its September lows, has fallen about 5 per cent against the basket of America’s major trading partners’ currencies. It had fallen more than 10 per cent before the US Federal Reserve Board’s first rate cut this year in September.\n\nDuring last year’s campaign, Trump said that, if he were elected, the dollar would be “so secure”. “Your reserve currency will be the strongest it’ll ever be,” he said. Hmm. US interest rates have, of course, fallen, with the yield on the 10-year bond rate down from 4.27 per cent at the end of last year to about 4.15 per cent and the yields on shorter-duration Treasuries by even more. He’s now got less than a year to turn his claims of overseeing the greatest economy ever into something real. That’s a function, however, of the weakening of economic growth, reflected in an unemployment rate that has begun edging up from 4.1 per cent in the December quarter last year to 4.3 per cent in the most recent available data.\n\nIf Trump’s beloved tariff regime holds up against legal challenges – the arguments before the Supreme Court justices who’ve previously been very supportive of Trump’s agenda on Wednesday don’t appear to have gone well for the administration – it will continue to undermine growth and fuel inflation. According to Goldman Sachs, about 55 per cent of the costs of the tariffs will, by the end of the year, be borne by US consumers and 22 per cent by US companies, with foreign exports absorbing 18 per cent. Goldman expects consumers could pay up to 70 per cent of their cost by the end of next year, underscoring that – contrary to what Trump and his advisers constantly claim – it is US consumers, and US companies, that pay the overwhelming majority of the tariffs’ cost. Trump promised to “tariff the hell out of countries that have been taking advantage of us”. He’s kept that promise, but he failed to tell voters (or perhaps he didn’t understand) that it meant introducing a big new and highly regressive domestic tax on consumption. In those trade deals, and from some arm-twisting of US companies, Trump has obtained promises of massive investments in the US. The White House claims they total $US8.9 trillion, although that would include previously planned expenditures and probably some that will never be made once (if?) Trump departs the White House.\n\nEven a decent slice of those commitments would, however, help build manufacturing investment and jobs in the US, which, given that the US manufacturing sector has, according to the ISM Manufacturing PMI, been shrinking for eight months straight, is much needed. Manufacturing investment and jobs grew strongly during Biden’s term. Loading Trump has over-delivered on his promises to deal with illegal immigration, even if the brutal measures taken by ICE to execute the policies appear increasingly unpopular. He’s also had some foreign policy wins. However, it’s the domestic economy and policies that impact Americans’ costs-of-living that produced the election outcomes this week and that will decide the shape of Congress – and the effectiveness of the last two years of Trump’s presidency – at next year’s mid-terms. He’s now got less than a year to turn his claims of overseeing the greatest economy ever into something real.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-will-zohran-mamdani-affect-us-politics/nwxpbg5cj",
    "title": "Behind Zohran Mamdani's historic win, and what it means for the Democratic Party's future",
    "publish_date": "Thu, 6 Nov 2025 00:44:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Zohran Mamdani's victory to become the next mayor of New York City could invigorate the national Democratic movement, experts say.\n\nThe Democrats also saw victories in other elections this week in left-leaning states.\n\nThe winning streak could be the momentum the Democrats need as they prepare for next November's midterm election.\n\nZohran Mamdani, the 34-year-old mayor-elect of New York City, has received a groundswell of support in the United States and overseas for his socialist-democratic platform and energising personality.\n\n\n\n\n\nMamdani has made history as the first Muslim and person of South Asian descent to be elected as the city's mayor.\n\n\n\n\n\nHis victory follows a series of political wins for the Democratic Party, with key elections in the United States just one year away.\n\n\n\n\n\nBut experts have told SBS News that while his popularity could help boost the polls in the Democrats' favour, they have work to do to repair their image on a national level.\n\n\n\nWhy is Zohran Mamdani so popular?\n\nMark Rolfe, a lecturer in the school of social sciences at the University of NSW, told SBS News that Mamdani's election has been unusually popular around the world.\n\n\n\n\n\n\"I don't think the election of the mayor of Sydney would evoke such international interest,\" he said.\n\n\n\n\n\n\"But looking around America, Australia and Britain, you've got this constant theme of what is going to happen to our young generations, and we've got all these old farts in charge who seem out of touch.\n\n\n\n\n\n\"It's understandable that Mamdani's youth and focus on affordability evoke such interest.\"\n\n\n\nRolfe said that Mamdani's policies, such as freezing rents on certain properties and free childcare, would put him as a mainstream left candidate in other political spectrums, including Australia.\n\n\n\n\n\nAmeisha Cross, a Democratic Party strategist and former adviser to Barack Obama, told ABC Radio National that Mamdani's focus on affordability won him his landslide victory.\n\n\n\n\n\n\"Now York has one of the largest economies in the world, and it's also a city where people have been crying out about affordability, not being able to pay rent, not being able to afford groceries,\" she said on Thursday morning.\n\n\n\n\n\n\"He spoke to those issues and made that the central point of his campaign.\"\n\n\n\n\n\nShe likened his campaign to that of US President Donald Trump's run to victory in 2016, saying that despite being on different sides of the political spectrum, they appealed to voters for similar reasons.\n\n\n\n\n\n\"They wanted somebody who was seen as an outsider, somebody who didn't have any elongated political past. They wanted somebody who spoke about change and brought about something different,\" she said.\n\n\n\nDemocrats win in other states\n\nBesides Mamdani's win, in Virginia and New Jersey, moderate Democrats Abigail Spanberger, and Mikie Sherrill, won the elections for governor with commanding leads.\n\n\n\n\n\nBoth candidates had sought to tie their opponents to Trump in an effort to harness frustration among Democratic and independent voters over his chaotic tenure.\n\n\n\nLISTEN TO INTERVIEW: Can Zohran Mamdani deliver on his election promises? SBS News 05:14 English\n\nMore than one-third of voters in those states said opposing Trump was a factor in their vote, according to exit polls conducted for a consortium of US networks and the Associated Press. Those voters overwhelmingly cast ballots for the Democrats.\n\n\n\n\n\nPerhaps the biggest practical boost to Democrats on Tuesday came out of California, where voters gave Democratic politicians the power to redraw the state's congressional map, expanding a national battle over redistricting that will shape the race for the US House of Representatives.\n\n\n\nDonald Trump reacts to Mamdani win\n\nTrump said that Mamdani's victory was expected and he did not think it was good for Republicans.\n\n\n\n\n\n\"I'm not sure it was good for anybody, but we had an interesting evening, and we learned a lot,\" he told officials in the White House on Wednesday.\n\n\n\n\n\nIn a post on his Truth Social network, he cited anonymous \"pollsters\" suggesting the Republican defeats were due to the government shutdown and the fact that his own name wasn't on the ballots.\n\n\n\nUS vice president JD Vance said on Wednesday it was \"idiotic to overreact to a couple of elections\" in states that lean Democratic. He nonetheless suggested Republicans laser in on the economy.\n\n\n\n\n\n\"We need to focus on the home front,\" he wrote on X. \"We're going to keep on working to make a decent life affordable in this country, and that's the metric by which we'll ultimately be judged in 2026 and beyond.\"\n\n\n\nDemocrats seen as 'out of touch'\n\nRolfe said these victories were to be expected, and that the Democrats have to \"sort out what they stand for\" if they want to keep the momentum going ahead of next year's midterm elections, and the 2028 presidential election.\n\n\n\n\n\nThe 2026 midterm election will primarily take place next November, when all the seats in the US House of Representatives will be contested.\n\n\n\n\n\nWhile the parties of the current president tend to lose seats at these elections, Rolfe said an \"anti-Trump\" protest vote is not a sure thing.\n\n\n\n\n\nHe flagged that opinion polling in the US shows that people see the Democrats as more \"out of touch\" than Trump.\n\n\n\n\n\n\"You've got the problem for the Democrats as a whole of trying to knit together a message for the midterms next year, where they have to appeal to constituencies across America,\" he said.\n\n\n\nHe said the Democrats have \"compounded their problems of what they stand for\" during and since Trump's first presidency, saying they will need a unifying platform if they want to keep winning elections.\n\n\n\n\n\n\"The Democrats have a real problem if they're just relying on next year as an anti-Trump protest,\" he said.\n\n\n\n\n\nCross said that the Democratic Party needs to listen to voter concerns about affordability and the cost of living and prioritise elevating people to the middle class.\n\n\n\n\n\n\"You don't have to have multimillion-dollar consultants to tell you what the people are saying,\" she said.\n\n\n\n\n\n\"Right now, far too many Americans are feeling as though this country has left them behind.\"\n\n\n\nCross said that both the Democrats and Republicans have to focus on appealing to their core supporters.\n\n\n\n\n\nRepublican strategist John Feehery said Trump needs to be more concerned with his domestic presence.\n\n\n\n\n\n\"The problem with Trump is he's trying to save the world, but he's forgetting about the people who brought him here, and they're not doing that great\", Reuters reported on Thursday.\n\n\n\n\n\n\"He needs less running around and more focus on what the political problems are at home.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-can-zohran-mamdani-deliver-on-his-election-promises/afo89blkp",
    "title": "INTERVIEW: Can Zohran Mamdani deliver on his election promises?",
    "publish_date": "Wed, 5 Nov 2025 21:59:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-last-straw-that-led-to-rachel-quitting-her-perfect-career/u2xtr0ec7",
    "title": "The last straw that led to Rachel quitting her 'perfect' career",
    "publish_date": "Wed, 5 Nov 2025 18:45:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "This story contains language that may be offensive.\n\n\n\n\n\nRachel Bos loved being a teacher — she said it was the \"perfect career\" for her.\n\n\n\n\n\nShe tells SBS that during her 20-years as a primary school and high school teacher in Australia and New Zealand, there were a lot of good times.\n\n\n\n\n\nBut, the Kaurna woman felt that she experienced \"death by a thousand cuts\" from racism in schools, leading her to quit in 2019.\n\n\n\n\n\nShe says she was passed over for promotional positions, as an Aboriginal woman, because senior colleagues wanted to keep her in the classroom \"because I was doing such a great job with Aboriginal kids.\"\n\n\n\n\"I've been given classes in subject areas I don't teach, because that's where the Aboriginal kids are\", she says.\n\n\n\n\n\nShe says racist attitudes and \"micro-aggressions\" were continual, hard to pin-point, and came from both students and teachers.\n\n\n\n\n\nBut over time they took a toll on her well-being and after an incident in 2019, where a colleague made an off-hand remark, Rachel never went back into the classroom to teach.\n\n\n\n\n\n\"I was at the photocopier, and I was down on all fours trying to look at it because it was clogged and it wasn't working. And a colleague walked past and said, Rachel, the photocopy is not working today. It must be black.'\"\n\n\n\n\n\nShe said the incident \"Just broke me\". Other colleagues saw the incident and didn't stand up for her.\n\n\n\nREAD MORE Maria is struggling to get ahead at work. She wonders if her accent is to blame\n\n\"Ordinarily it would just be water off the duck's back. But the thing about racism that I think it's really important for people to understand is that it's like death by a thousand cuts. The small little microaggressions add up over time, and the big things and everything — until you just can't cope anymore.\"\n\n\n\n\n\nShe says there weren't proper reporting mechanisms for her to report racism at work, and she felt \"gaslit\" into thinking she had a bad sense of humour when she tried to call out racism.\n\n\n\n\n\n\"People are looking for these really big events or these big targeted, racist things that happen. But sometimes racism can be as simple as just having to deal with these things over and over and over again in our careers.\"\n\n\n\nLISTEN TO Call for action after report details racism faced by nurses, midwives SBS News 04:30 English\n\nBos has now joined a roundtable in Canberra as a representative from the Australian Council of Trade Unions, joining community leaders and workplace advocates to call for a national inquiry into racism in workplaces.\n\n\n\n\n\nThe roundtable has heard that there has been a surge in racism over the past five years, driven by COVID-19, the Indigenous Voice referendum, the October 7 attacks and anti-Indian political messaging.\n\n\n\n\n\nAustralia's race discrimination commissioner Giridharan Sivaraman says while people are aware of the negative impacts, there's no full picture as to how much workplace racism has cost society.\n\n\n\n\n\nWorkplace racism could take the form of a lack of recognition of skills for some migrants or forcing some groups to undertake English proficiency tests, Sivaraman said.\n\n\n\nREAD MORE Racism is forcing more Indigenous people to leave the workforce\n\n\"But we don't know the full extent of it. We don't know how it's impacting people's lives,\" he said.\n\n\n\n\n\n\"We know that it diminishes people and it damages our economy and our society as a whole, but we need to learn more.\"\n\n\n\n\n\nThe 2018 Respect at Work inquiry into sex discrimination , which had all 45 recommendations implemented in policy, is the model touted to deliver results on racism.\n\n\n\n\n\n\"An inquiry into racism at work has the potential to ... change workers' lives and workplaces for the better,\" Australian Council of Trade Unions president Michele O'Neil said.\n\n\n\nLISTEN TO Australia's 'systemic racism' prompts calls for anti-racism framework SBS News 03:51 English\n\nUnions received complaints in every industry and sector but migrant workers in regional areas were particularly at risk of racist exploitation, O'Neil said.\n\n\n\n\n\n\"In the agricultural sector, we have large numbers of workers coming in on visas, who often are hidden away,\" she said.\n\n\n\n\n\n\"They're more vulnerable because they don't have permanency here, but they often experience racism and, in fact, violence in the workplace.\"\n\n\n\n\n\nLabor is yet to commit to the national anti-racism framework , which was handed down by the Australian Human Rights Commission last November.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/new-report-reveals-rising-rate-of-food-insecurity-among-australian-households/sqzab4r7y",
    "title": "New report reveals rising rate of food insecurity among Australian households",
    "publish_date": "Wed, 5 Nov 2025 08:46:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "New report reveals rising rate of food insecurity among Australian households\n\nPublished 5 November 2025, 5:36 am\n\nA new report by Foodbank has revealed up to 20 per cent of households in Australia are skipping meals or going days without eating. The 2025 Hunger Report suggests overall one in three households faced food insecurity over the last year largely due to rising costs. A group of independent MP's say a tax incentive for farmers to donate excess goods could help solve the problem.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/new-south-wales-government-enforces-crackdown-on-illegal-tobacco/weha36ws1",
    "title": "New South Wales Government enforces crackdown on illegal tobacco",
    "publish_date": "Wed, 5 Nov 2025 08:28:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "New South Wales Government enforces crackdown on illegal tobacco\n\nPublished 5 November 2025, 5:35 am\n\nTwo tobacco stores in Sydney have become the first to be shut down for allegedly selling tobacco illegally, under new State laws. Its part of a New South Wales Government crackdown to regain control of the illegal trade, which it says has gotten out of hand.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/asio-director-mike-burgess-warns-of-realistic-possibility-of-foreign-assassination-attempts-in-australia/satunvzmu",
    "title": "ASIO director warns of \"realistic possibility\" of foreign assassination attempts in Australia",
    "publish_date": "Wed, 5 Nov 2025 08:10:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/reddit-and-kick-added-to-the-under-16s-social-media-ban/igufqox1k",
    "title": "Reddit and Kick added to the under 16s social media ban",
    "publish_date": "Wed, 5 Nov 2025 08:09:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Reddit and Kick added to the under 16s social media ban\n\nPublished 5 November 2025, 5:35 am\n\nAnother two apps have been added to Australia's social media ban for children. The eSafety commissioner admitting today, the platforms aren't being reviewed based on the danger they pose to minors, expecting further changes - as the law comes into force.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/we-have-to-act-now-stubborn-workplace-racism-sparks-call-for-major-inquiry/uxihgtcdy",
    "title": "\"We have to act now\": 'Stubborn' workplace racism sparks call for major inquiry",
    "publish_date": "Wed, 5 Nov 2025 07:24:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nFor 20 years, Rachel Bos was a school teacher, describing herself as passionate about Aboriginal education.\n\n\n\n\n\nBut the Kaurna woman says her teaching carrier had always been marred by racism.\n\n\n\n\n\n\"I've been passed over for promotional positions because they want to keep me in the classroom, because I was doing such a great job with Aboriginal kids. I've been given classes in subject areas I don't teach, because that's where the Aboriginal kids are - and somehow, playground duties.\"\n\n\n\n\n\nShe says it was hard to pinpoint racism in workplaces, because they were often small acts of micro-aggression.\n\n\n\n\n\nStill, as these acts added up, Ms Bos eventually broke down in 2019, after a colleague of her made what they thought a joke about her.\n\n\n\n\n\n\"I was at the photocopier photocopying the poetry, I was down on all fours, trying to get a - it was clogged and wasn't working. And a colleague walked past and said, Rachel, the photocopying is not working today, it must be black.\"\n\n\n\n\n\nMs Bos finished that week.\n\n\n\n\n\nShe hasn't returned to a classroom since.\n\n\n\n\n\n\"Ordinarily it would just be water off the duck's back. But the thing about racism that I think it's really important for people to understand is that it's like death by a thousand cuts. The small little microaggressions add up over time, and the big things and everything - until you just can't cope anymore.\"\n\n\n\n\n\nMs Bos has now joined a roundtable in Canberra as a representative from the Australian Council of Trade Unions, joining community leaders and workplace advocates to call for a national inquiry into racism in workplaces.\n\n\n\n\n\nThe roundtable has heard that there has been a surge in racism over the past five years, driven by COVID-19, the Indigenous voice referendum, the October 7 attacks and anti-Indian political messaging.\n\n\n\n\n\nAustralia's race discrimination commissioner Giridharan Sivaraman says while people are aware of the negative impacts, there's no full picture as to how much workplace racism has cost society.\n\n\n\n\n\n\"Racism at work is a scourge. It's an issue that affects people at every step of the employment journey. It affects someone when they come from overseas and their qualifications aren't recognised. It affects them if their names aren't English sounding, then they can't get job interviews. It affects them when they're not culturally safe at work. But we don't know the full extent of it. We don't know how it's impacting people's lives. We know that it diminishes people, and it damages our economy, and our society as a whole, but we need to learn more.\"\n\n\n\n\n\nWhile people can make complaints under the Race Discrimination Act, the commissioner says it’s a microcosm on what's actually happening.\n\n\n\n\n\nHe says systemic racism is stopping people progressing in their jobs but data is often incomplete because people are afraid to come forward or don't know where to make a complaint.\n\n\n\n\n\n\"We don't have sufficient data to know where racism is really targeting people. We know in a general sense where people are vulnerable, but we want to do an inquiry in parts that we can hear people's stories. We can identify which industry needs to move in and work with as a matter of priority.\"\n\n\n\n\n\nMichele O'Neil is the president of the Australian Council of Trade Unions.\n\n\n\n\n\nShe says the 2018 Respect at Work inquiry into sex discrimination, which had all 45 recommendations implemented in policy, is the model that could deliver results on racism.\n\n\n\n\n\n\"And I'm pleased to see that now five years on, from when it was released, all of those 45 recommendations have been implemented, and it's making a difference in workers' life who have been harassed in the workplace. It's actually preventing harassment. More to do, but a big difference being made.\"\n\n\n\n\n\n\n\nMs O'Neil says unions have received complaints in every industry and sector, but that migrant workers in regional areas are particularly at risk of racist exploitation.\n\n\n\n\n\nShe expects a national inquiry into racism at work will have a positive impact on these areas of Australian society.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-cdc-passes-senate/iewdbc758",
    "title": "'In a precarious situation': Why experts say Australia needed a centre for disease control",
    "publish_date": "Wed, 5 Nov 2025 07:11:06 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Experts have welcomed a permanent Australian Centre for Disease Control (CDC) after legislation passed the Senate on Wednesday but there are concerns about key health issues missed by the agency's current remit .\n\n\n\n\n\nWhile an interim Centre for Disease Control has been operating within the federal health department since January 2024, and the government has already committed $251 million over four years to establish the agency, the legislation outlines the centre's functions and establishes its independence.\n\n\n\n\n\nThe centre will be led by a director-general appointed by the health minister and start operations on 1 January 2026.\n\n\n\nREAD MORE Australia to open permanent centre for disease control, health minister says\n\nNational Disability Insurance Scheme Minister Jenny McAllister said in the Senate on Wednesday the centre was designed to \"strengthen our public health capability, improve pandemic preparedness and safeguard the health and wellbeing of all Australians — not just in times of crisis but every day\".\n\n\n\n\n\nHealth Minister Mark Butler said the agency delivered on the Albanese government's commitment to \"create an independent agency that will help protect Australia from diseases and public health threats\".\n\n\n\n\n\n\"We know there will be another pandemic and the Australian CDC will make sure we are better prepared,\" he said.\n\n\n\n\n\nThe Public Health Association of Australia (PHAA), Australia's peak body on public health, said the legislation to create an Australian CDC is the \"most important piece of public health infrastructure in generations\".\n\n\n\nLISTEN TO Health professionals say Australia needs a centre for disease control SBS News 07:05 English\n\nAssociate professor Paul Griffin, from the University of Queensland Medical School, told SBS News the establishment of a CDC will help Australia's response to infectious diseases.\n\n\n\n\n\n\"We are in a very precarious situation right now, both in how we're currently responding to existing threats and vaccine rates is a huge issue,\" he said.\n\n\n\n\n\n\"So, we need to do more for what we're already dealing with, but we also need to be really well-prepared to be on the front foot for new and emerging threats as well.\"\n\n\n\n\n\nGriffin also said the CDC will ensure components of public health responses like the surveillance of infectious diseases, data collection and communication, and recommendations around vaccination are standardised across Australia.\n\n\n\n\"We have a lot of confusion between different states, a lot of differences and so hopefully having an organisation to coordinate those responses will ensure there's some consistency as well as clarity,\" he said.\n\n\n\nA long time coming\n\nThere have been calls to establish an Australian CDC for nearly 40 years and before the interim centre was established, Australia was the only OECD country without an equivalent body.\n\n\n\n\n\nIn 1987 Professor Bob Douglas, who became foundation director of the National Centre for Epidemiology and Population Health at the Australian National University, asked whether Australia needed such an agency.\n\n\n\n\n\nDouglas described a consensus among epidemiologists from the Australasian Epidemiological Association that \"although Australian therapeutic health services are highly developed, disease-control activities are fragmented, inadequate and poorly coordinated\".\n\n\n\nLISTEN TO Former CDC staffers ring alarm bells over decisions of new US vaccine panel SBS News 09:01 English\n\nIn 2011, the PHAA and the Australasian Faculty of Public Health Medicine released a paper about the need for an Australian CDC that described the benefit of \"strong central, expert driven leadership and coordination of national communicable disease control\".\n\n\n\n\n\nHowever, the establishment of the Australian CDC was ultimately a response from the Albanese government to the 670-page report published following an inquiry into Australia's response to COVID-19. The report recommended Australia should establish a permanent CDC as a priority.\n\n\n\n\n\nWhile Australia fared better than other countries in terms of mortality rate from COVID-19 and its economic recovery, the pandemic response took a severe toll on the nation.\n\n\n\n\"People worked beyond normal limits, and many of the public health professionals, frontline community service and health staff, political leaders, health experts and public servants we relied on to get through the pandemic are no longer in their positions,\" the report said.\n\n\n\n\n\n\"This poses risks to our resilience to face another crisis.\"\n\n\n\nWhat will the CDC do?\n\nThe Australian CDC said it is growing in a \"phased approach\" and has been initially focusing on preparing for public health emergencies, improving the national public health surveillance system, as well as building capability across health security and the links between the health of human health, animal health and the environment.\n\n\n\n\n\nThe first priorities for the agency from January will be \"communicable diseases, pandemic preparedness and capabilities in environmental health and occupational health and respiratory diseases\", McAllister said. However, she said the centre could expand into areas such as chronic diseases following an independent review in 2028.\n\n\n\nREAD MORE Infant peanut feeding prevented thousands of children from developing allergies\n\nWhile she said the agency is essential, independent MP Dr Monique Ryan has criticised the bill establishing the centre for failing to immediately address chronic illnesses.\n\n\n\n\n\n\"Nine out of 10 deaths in Australia are related to chronic illnesses like cancer, diabetes, cardiovascular disease but the CDC that we're proposing to set up right now won't deal with those until after 2028 at best,\" she said.\n\n\n\n\n\nGriffin said that while the agency is in its earliest days, it is reasonable that chronic illnesses may not be included from the outset but said they will need to be incorporated into the agency's operations.\n\n\n\n\n\n\"I think integrating the management of chronic disease given its role in risk for infectious diseases and its impact on the population more broadly would be really important.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 2
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-fuel-prices-turning-point/zlp3yj79y",
    "title": "Could new sanctions on Russia affect cost of living in Australia?",
    "publish_date": "Wed, 5 Nov 2025 06:22:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Recently-tightened sanctions on Russian oil could drive prices up and continue to shake global markets, experts say, which could lead to Australian drivers paying more for fuel and have a flow-on effect of increasing goods prices.\n\n\n\n\n\nAustralia's inflation has risen again , up 1.3 per cent in the September quarter and 3.2 per cent over the year — the first increase in underlying inflation since late 2022, when Russia's full-scale invasion of Ukraine sent global fuel prices soaring.\n\n\n\n\n\nNow, three-and-a-half years later, a new round of US and EU-led sanctions aims to further limit Russia's ability to finance its war in Ukraine, which has killed over 14,000 Ukrainian civilians and injured more than 37,000, according to the UN Human Rights Monitoring Mission in Ukraine.\n\n\n\n\n\nSince February 2022, at least 621 Russian civilians, including 38 children, have been killed and 3,217 wounded in Ukrainian attacks on Russian territory, according to Russia's Investigative Committee chief Alexander Bastrykin, as quoted in a May 2025 Moscow Times report.\n\n\n\nLISTEN TO New US, EU sanctions aim to pressure Russia towards ceasefire SBS News 05:04 English\n\nDespite diplomatic efforts to forge a ceasefire, the war continues . In response, the EU, UK and US have progressively expanded sanctions since 2022, tightening controls on Russian transport, insurance and refinery products.\n\n\n\n\n\nThe recent sanctions specifically target Russian oil giants Rosneft and Lukoil, which together account for more than 5 per cent of global oil output.\n\n\n\n\n\nAccording to UK government estimates, global sanctions have cost the Russian state at least $687.8 billion since February 2022 — roughly a quarter of Russia's annual GDP.\n\n\n\n\n\nHowever, given Russia's position in the global oil market, such measures may also come at a cost to the West.\n\n\n\nREAD MORE Vladimir Putin says Russia will not bow to the pressure of US sanctions on oil giants\n\nAlthough sanctions on Russia are only one factor shaping global oil prices, higher power and transport costs remain key drivers of inflation in Australia, and rising oil prices can amplify both.\n\n\n\n\n\nEach new round of sanctions influences supply dynamics and trade flows, often in a disruptive way.\n\n\n\n\n\nOil market analysts differ on how these measures could ripple through to Australia — some argue the impact will be minimal, while others caution it could be more pronounced. The design and scope of any future Australian sanctions policies may also add another layer of influence.\n\n\n\nRipple effects travel fast\n\nAustralia doesn't buy oil directly from Russia, and has imposed sanctions on the import of Russian crude since February 2022.\n\n\n\n\n\nThis year, the Australian government also moved to sanction a fleet of 150 Russian oil tankers — dubbed the 'shadow fleet' — which had been enabling the import of oil products refined from Russian crude to Australia via third countries.\n\n\n\n\n\nAn SBS News investigation last month revealed how these sanctioned tankers are still infiltrating the supply chains of Australian companies.\n\n\n\nHowever, given Russia's position as the world's second-largest oil exporter, sanctions can also affect quick-moving global benchmarks — and those shifts often reach local pumps within weeks.\n\n\n\n\n\nTony Sycamore, market analyst at IG Australia, says the new sanctions have already started reshaping trade flows in Asia.\n\n\n\n\n\n\"China's state oil companies have reportedly suspended seaborne purchases of Russian oil, and Indian refiners are reassessing their imports,\" he says.\n\n\n\n\n\n\"We may now be at a turning point, where higher oil prices could begin to flow through to Australian motorists over the next few weeks.\"\n\n\n\n\n\nBrent crude, the global oil benchmark that sets the price for most fuel imported into the Asia-Pacific, rose from about US $55 a barrel in September to around US $65.\n\n\n\n\n\n\"Generally, a $1 change in crude translates to about a 1-cent change at the pump,\" Sycamore says.\n\n\n\nIn a statement to SBS Russian, the Australian Competition and Consumer Commission (ACCC) confirmed that retail fuel prices are \"largely determined by movements in international benchmark refined-fuel prices (which are driven by international crude-oil prices) and the AUD-USD exchange rate\".\n\n\n\n\n\nChanges in these benchmarks, the ACCC adds, usually take about two weeks to filter through to major cities, and longer in regional areas.\n\n\n\n\n\nOil prices often rise and fall in response to geopolitical flare-ups, and Sycamore says recent events have shown how quickly those swings can reverse.\n\n\n\n\n\n\"Back in June, there were concerns that the 12-day conflict between Israel and Iran would push oil above US$100. It peaked around $78, then dropped again once that conflict ended.\"\n\n\n\nSome observers expect any price increases of recently tightened sanctions to be short-lived.\n\n\n\n\n\nSpeaking with reporters on the sidelines of Singapore International Energy Week, International Energy Agency executive director Fatih Birol said that while sanctions could temporarily lift oil prices, the effect would likely be limited due to surplus capacity.\n\n\n\n\n\n\"The oil and gas markets will enter a very distinct period, which is in the absence of major geopolitical tensions, we are going to see lower oil and gas prices,\" Birol told Reuters.\n\n\n\nPotential impacts on diesel\n\nHowever, not all shocks fade as fast.\n\n\n\n\n\nAccording to the Australian Institute of Petroleum, average retail diesel prices in Australia hit record highs after Russia's full-scale invasion of Ukraine — surging to $2.34 a litre in June 2022, up from lows of around $1.20 in 2020.\n\n\n\n\n\nPrices have remained elevated since, hovering between $1.80 and $2 a litre through 2023 to 2025.\n\n\n\n\n\nDiesel powers Australia's trucks, farms and freight — forming the backbone of transport, mining and agriculture.\n\n\n\n\n\nWhen its price rises, it pushes up the cost of moving goods, growing food and running equipment, meaning consumers often feel impacts far beyond the pump.\n\n\n\n\n\nIt's also where global oil shocks are most sharply felt in Australia.\n\n\n\n\n\nWith recent sanctions and attacks targeting Russian oil refining infrastructure — and which have prompted retaliatory attacks on Ukrainian energy production sites and distribution facilities — analysts warn that market volatility could intensify.\n\n\n\n\n\n\"The scope for Ukraine to ratchet up its attacks on Russian energy infrastructure, or stricter sanctions on Russian crude exports, could lead to a more significant market disruption and higher prices at the pump,\" says Saul Kavonic, Head of Energy Research at MST Marquee.\n\n\n\nSanctions models matter\n\nAlthough Australia's direct exposure to Russian oil is limited, some experts say the new sanctions model could impact supply and push prices slightly higher if it follows the EU's policy of banning imports from countries that are 'net importers' of crude oil.\n\n\n\n\n\nVaibhav Raghunandan is an EU-Russia analyst with the Centre for Research on Energy and Clean Air (CREA) and says: \"If Australia's policy follows this route, it will probably lead to a rise in prices mainly because it will constrict imports from many 'net importer' countries sourcing Russian crude in Asia — and which supply Australia.\"\n\n\n\n\n\n\"Our analysis is based on Australia's relatively low reliance on refineries processing Russian crude — around 12 per cent of diesel imports in 2024,\" he says, adding that the impact of sanctions will depend largely on policy design.\n\n\n\nRaghunandan says if Australian sanctions were to focus on refineries in third countries, instead of targeting net importers as the EU has done, that may be a more effective strategy and is likely to have \"little to no inflationary effect\".\n\n\n\n\n\n\"Even within net importer countries, there remain refineries which do not process Russian crude and supply to Australia,\" he says.\n\n\n\n\n\nHowever, Australia has so far made no announcements signalling an intention to adopt an EU-style ban on imports of products refined from Russian crude via third countries.\n\n\n\nHow global prices flow to Australian pumps\n\nAccording to the Australia Institute, about 91 per cent of Australia's fuel consumption is met by imports.\n\n\n\n\n\nThat reliance is compounded by limited domestic storage.\n\n\n\n\n\nAs The Australian Financial Review reported this month, referring to the government data, the country had oil stores equivalent to 49 days' worth of net imports, which is far below the 90-day requirement under the International Energy Agency treaty.\n\n\n\n\n\nThe Department of Climate Change, Energy, the Environment and Water (DCCEEW) reported that in July, Australia held just 20 days of jet fuel, 24 days of diesel and 28 days of petrol.\n\n\n\nMost of Australia's refined fuel imports come from Singapore, South Korea and Japan, with smaller volumes from India and Malaysia, according to DCCEEW statistics.\n\n\n\n\n\nAs a result, Australian fuel prices are largely driven by the Singapore benchmark — a daily regional price guide published by S&P Global Commodity Insights, also known as Platts.\n\n\n\n\n\nWhen oil prices, refinery costs, or shipping rates rise in Singapore, those increases flow directly through to Australian wholesalers and, within about two weeks, to drivers at the pump.\n\n\n\n\n\nS&P Global's head of oil markets and downstream research Premasish Das says sanctions on Russian oil usually redirect trade rather than reduce it, but notes that rerouting drives up freight and insurance costs.\n\n\n\n\n\n\"The EU sanctions on fuels produced from Russian oil could potentially displace more than 300,000 barrels a day of diesel shipments to the EU from India and Türkiye,\" he says.\n\n\n\n\n\n\"This shift could fragment the diesel trade and clean-tanker markets, making them more expensive … Given Australia's reliance on imports, this will likely lead to increased fuel prices as well.\"\n\n\n\nLISTEN TO Trump touts Asia triumph - and a third term, Russia's oil sanctions & 'et tu' Queensland? SBS News 32:14 English\n\nRefiners and traders also use similar data from Argus Media to monitor price trends across the region.\n\n\n\n\n\nCara Wong, Asia-Pacific associate editor at Argus Media, says those shifts are already visible in Russia's export data.\n\n\n\n\n\n\"We're seeing more damage to Russian refining infrastructure, and loading data is already showing a drop in diesel exports,\" she says.\n\n\n\n\n\n\"Although Australia doesn't buy directly from Russia, it affects the entire diesel market because it tightens supplies a little bit more … Further restrictions on fuels made from Russian crude would have an outsized impact on Singapore benchmarks.\"\n\n\n\nDisruptions to Russian oil refining\n\nBeyond sanctions, Russia's own refining sector has come under sustained attack. Ukrainian drone strikes have disabled a significant share of its capacity.\n\n\n\n\n\nBy late September, up to 38 per cent of refining infrastructure was temporarily offline, according to analysts cited by Reuters and Lenta. Tatiana Mitrova, Global Fellow at Columbia University's Center on Global Energy Policy, told SBS Russian that the cumulative impact of these strikes is proving difficult to reverse.\n\n\n\n\n\n\"Equipment shortages, sanctions on repairs and a new wave of attacks are prolonging Russia's recovery,\" she says.\n\n\n\n\n\n\"As a result, export volumes are shrinking just as demand rises into the Northern Hemisphere winter.\"\n\n\n\nAnalysts say these disruptions add to the broader mix of geopolitical and market pressures already shaping global prices.\n\n\n\n\n\nSycamore says that, as well as sanctions on Russia, other global shifts are also feeding volatility; namely, trade tensions affecting global demand for crude oil.\n\n\n\n\n\nHowever, recent signs of progress in US–China trade talks have lifted market confidence and pushed the Australian dollar higher against the US dollar, with some analysts predicting it could trade as high as 70 US cents.\n\n\n\n\n\nA stronger dollar can take some pressure off local fuel prices, Sycamore says.\n\n\n\n\n\n\"And, importantly, OPEC has been increasing production — partly to offset the impact of Russian embargoes, but also to regain market share.\"\n\n\n\nMitrova adds that the global market has so far proven resilient.\n\n\n\n\n\n\"When the EU restricted imports, it narrowed Russia's export niche, mainly for diesel. But the global oil products market is highly flexible.\"\n\n\n\n\n\nShe says these measures create logistical difficulties rather than a genuine shortage.\n\n\n\n\n\n\"Finding new buyers, rearranging shipments, and processing transactions under sanctions takes time and money, but the trade continues.\"\n\n\n\n\n\nWhile a similar pattern was seen in 2022 — when sanctions disrupted trade routes and drove up freight and refining costs, pushing Australian fuel prices above $2.30 a litre — this time the market appears more adaptive.\n\n\n\n\n\nAccording to the Australian Institute of Petroleum, the national average retail diesel price currently sits around $1.85 a litre.\n\n\n\n\n\nThis story was produced in collaboration with SBS Russian. It has been updated to include various perspectives on the impact of sanctions.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/bitcoin-bear-market-ai-valuation-fears/i26uo5hfr",
    "title": "Bitcoin bear market & AI valuation fears",
    "publish_date": "Wed, 5 Nov 2025 06:16:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/coalition-mp-denies-rumours-of-leadership-challenge-evening-news-bulletin-5-november-2025/4yb7evt5b",
    "title": "Coalition MP denies rumours of leadership challenge |Evening News Bulletin 5 November 2025",
    "publish_date": "Wed, 5 Nov 2025 04:57:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nCoalition's Jonno Duniam denies rumours he'll challenge Sussan\n\nLey'sleadership, New York City elects first Muslim mayor,\n\nTottenham Hotspurs coast to 4-0 home win over F-C Copenhagen\n\nThe Coalition's Opposition Home Affairs spokesman, Jonno Duniam, has dismissed rumours he'll challenge Sussan Ley's leadership.\n\n\n\n\n\nHer position is under pressure amid internal Liberal Party debates over climate policy and net zero targets.\n\n\n\n\n\nMr Duniam says he is firmly backing Ms Ley's handling of the contentious energy debate, characterising her involvement as \"constructive and conciliatory\".\n\n\n\n\n\nHe says she allows all factions within the party to have their say in a robust manner.\n\n\n\n\n\nOpposition Communications Spokesperson Melissa McIntosh is voicing strong concerns about the enforceability of the upcoming social media ban for under-16s.\n\n\n\n\n\nThe ban, which takes effect on December 10th, will bar users under 16 from accessing eight major platforms including Facebook, TikTok, and X.\n\n\n\n\n\nMs Mcintosh says that there is nothing more important than protecting kids from the harms of social media.\n\n\n\n\n\nShe says as a parent, she's experienced it herself - but argues there are potential risks associated with the age verification technology used.\n\n\n\n\n\n\"I've become really concerned that this social media ban is going to work, and I've been expressing my concerns over weeks and weeks now.... Now, we don't know which age verification technology is going to be used, and so many Australians contact me, concerned about the potential use of digital identification.\"\n\n\n\n\n\nNew York City voters have chosen Zohran Mamdani to be the city's new mayor.\n\n\n\n\n\nThe 34-year-old state politician is set to become the city's most liberal mayor in generations, defeating former governor Andrew Cuomo and Republican Curtis Sliwa in a victory for the Democratic party's progressive wing.\n\n\n\n\n\nThe democratic socialist will make history as the city's first Muslim mayor, the first of South Asian heritage and the first born in Africa.\n\n\n\n\n\nHe will also be the city's youngest mayor in more than a century when he takes office on January the 1st.\n\n\n\n\n\nThe nation's race discrimination commissioner has backed trade unions in calls for a national inquiry into racism in Australian workplaces.\n\n\n\n\n\nSurges in racism over the past five years have been driven by COVID-19, the Indigenous voice referendum, the October 7 attacks and anti-Indian political messaging.\n\n\n\n\n\nAdvocates say systemic racism is stopping people progressing in their jobs but data is often incomplete because people are afraid to come forward or don't know where to make a complaint.\n\n\n\n\n\nRace Discrimination Commissioner Giridharan Sivaraman says that the ever-changing face of its victims shows racism is not improving and remains a structural defect in Australia.\n\n\n\n\n\n\"We have to act now. This isn't getting better and racism is diminishing people at work, it is impacting businesses, it's costing our economy and our society.\"\n\n\n\n\n\nA First Nations innovator has been recognised for emerging science and Indigenous Sea Country knowledge at the 26th Prime Minister's Prizes for Science.\n\n\n\n\n\nProfessor Michael Ware is leading a world-first sea grass restoration project that employs Aboriginal divers, creates sustainable livelihoods and is reviving cultural connections to the ocean.\n\n\n\n\n\nProfessor Wear is a Malgana [[Mahl-gah-nah]] Traditional Custodian of Shark Bay in Western Australia.\n\n\n\n\n\nThe founder of Tidal Moon, Australia's first Indigenous-owned sea cucumber fishery and marine restoration enterprise, Professor Ware says he's grateful for the acknowledgement.\n\n\n\n\n\n\"It's amazing, I think, it's a humble feeling I got and I want to always make sure I do my best and I'm the first but I don't want to be the last so it's a big task ahead for me.\"\n\n\n\n\n\nIn football,\n\n\n\n\n\nTottenham Hotspur central defender Micky van de Ven has scored a sensational solo goal in his side's 4-0 home win over F-C Copenhagen which has lifted the London club into the top eight in the Champions League.\n\n\n\n\n\nThe flying Dutchman took possession of the ball on the edge of his own penalty area in the 64th minute and sped the length of the pitch through a flimsy Copenhagen defence to smash home a shot and make it 3-0.\n\n\n\n\n\nSpurs coach Thomas Frank says he was amazed by the goal.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/questions-linger-over-which-platforms-to-ban-as-reddit-and-kick-included-in-esafety-list/0ali0sxt7",
    "title": "Questions linger over which platforms to ban as Reddit and Kick included in eSafety list",
    "publish_date": "Wed, 5 Nov 2025 04:54:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Questions linger over which platforms to ban as Reddit and Kick included in eSafety list\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nEight major social media platforms will soon be subject to a strict under-16s social media ban in Australia.\n\n\n\n\n\nFrom the December of 10th, users under the age of 16 will be barred from accessing Reddit, Kick, Facebook, Instagram, Snapchat, TikTok, YouTube, and X, platforms that Communications Minister Anika Wells says were identified after assessments by the eSafety Commissioner.\n\n\n\n\n\nWhile critics argue the list is a drip-fed and late addition, Minister Wells says it's the Commissioner’s ongoing job to assess companies against legislative requirements.\n\n\n\n\n\n\"E safety platform assessments will be ongoing and respond to technological change, but we understand that families need certainty now and now regarding the major platform platforms, captured under the social media minimum age laws.\"\n\n\n\n\n\nReddit and live-streaming platform Kick are the two latest additions to the list of platforms.\n\n\n\n\n\neSafety Commissioner, Julie Inman Grant, says it's the result of how the legislation distinguishes between online gaming and social messaging.\n\n\n\n\n\n\"The other key consideration for us is whether the platform meets the criteria of a class of services where there is an exception, such as for messaging, online gaming or educational content. A few important points I want to make about this list. Technology is fast changing and ever evolving, which means this will never be a static list.\"\n\n\n\n\n\nMs Grant has reiterated this distinction when asked why platforms like twitch or steam weren't included.\n\n\n\n\n\n\"We assessed steam and steam chat separately... We assessed steam as having four current purposes... They did fall more into the online gaming platform, and they fell within the class of service specifies in the rules as exempted because their primary purpose is enabling users to play online games with other users, even though there's still online social interaction as part of their features. So it's - Twitch is still being evaluated.\"\n\n\n\n\n\nA disturbing global phenomenon where Australian girls are being targeted by sadistic men is happening on platforms like Roblox.\n\n\n\n\n\nMs Grant has been asked why Roblox wasn't therefore included in the legislation even if was technically a gaming platform.\n\n\n\n\n\nMinister Wells and Ms Grant say that financial and sexual extortion are of a great concern to them, and in negotiations with Roblox they have ensured age assurance technologies will be implemented to stop adults from using the service.\n\n\n\n\n\nThe Commissioner says the government has put an extensive onus back on the platforms themselves to prevent circumvention.\n\n\n\n\n\n\"There are so many signals that they can and are picking up now device IDs. You know who their ISP account is, where they've downloaded with from which app store, and in most cases, you know, if you brought a phone to the United States and you download it from an app store, they will look at a six month period to see whether or not you're actually resident in Australia, we've had deep conversations with companies about this.\"\n\n\n\n\n\n\n\nA disturbing global phenomenon where Australian girls are being targeted by sadistic men is happening on platforms like Roblox.\n\n\n\n\n\nThe E-safety commissioner Julie Inman Grant and Communications Minister Anika Wells and Ms Grant say that financial and sexual extortion are of a great concern to them.\n\n\n\n\n\nThey have confirmed they are currently in negotiotions with Roblox, and have ensured age assurance technologies will be implemented to stop adults from using the service.\n\n\n\n\n\nThe Commissioner says the government has put an extensive onus back on the platforms themselves to prevent circumvention.\n\n\n\n\n\n\"There are so many signals that they can and are picking up now device IDs. You know who their ISP account is, where they've downloaded with from which app store, and in most cases, you know, if you brought a phone to the United States and you download it from an app store, they will look at a six month period to see whether or not you're actually resident in Australia, we've had deep conversations with companies about this.\"\n\n\n\n\n\nOpposition communications spokesperson Melissa Mcintosh says that there is nothing more important than protecting kids from the harms of social media.\n\n\n\n\n\nShe says as a mum, she's experienced it herself.\n\n\n\n\n\nBut she is concerned that the legislation won't be enforceable, and that biometric data could be compromised if the Digital ID system is used.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/food-insecurity-worsening-in-australia-according-to-foodbank/w2sediuu0",
    "title": "The 'insidious problem' leaving Australians like Jessica 'lucky' to eat twice a day",
    "publish_date": "Wed, 5 Nov 2025 04:25:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "One in three Australian households went whole days without eating or compromised on meal choices in the last 12 months, according to a report released on Wednesday.\n\n\n\n\n\nData from food relief charity Foodbank suggests that food insecurity has worsened when compared to 2024, leaving 3.5 million families facing hardship that \"is not getting better\".\n\n\n\n\n\nFoodbank Australia CEO Kylea Tink said that the \"reality for families\" is worsening, despite targeted government assistance such as one-off energy rebates.\n\n\n\n\n\n\"Families are skipping meals, or they're only feeding certain members of the family at certain meals, or in the worst-case scenario, they're going whole days without eating at all,\" she told SBS News.\n\n\n\n\n\n\"The real concern for us here is that with this data cumulatively now what we're seeing is this is a systemic endemic issue that is not getting better, and it's why we're really calling on the federal government to come to the table and work with us to help fix it.\"\n\n\n\nMore renters skipping meals\n\nOne of the most likely groups to experience food insecurity is renters, according to the report, with one in two renting households affected in the past year.\n\n\n\nLISTEN TO INTERVIEW: Foodbank Australia CEO Kylea Tink SBS News 08:27 English\n\nJessica Menace has been a renter for five years, and told SBS News that \"costs are getting worse\".\n\n\n\n\n\n\"I left home at 17 when I ran away from home due to safety issues. Part of me wishes now that I could go back and stay at home as long as possible,\" she said.\n\n\n\n\n\n\"I would tell my past self 'stick around, it's going to be really expensive. We're going to have a rental crisis'. The rental system is just not working properly\".\n\n\n\n\n\nThe 22-year-old is a full-time student in Canberra and is on Youth Allowance, a government scheme supporting full-time students aged 18 to 24. She receives just under $900 a fortnight.\n\n\n\n\n\nShe pays $1,000 per fortnight in rent and works to make up the gap.\n\n\n\nSource: SBS News When she can't meet the difference, she does her shopping at Foodbank, but even its heavily subsidised food can be out of reach.\n\n\n\n\n\n\"It's just a normal thing now to be cutting meals,\" she said.\n\n\n\n\n\n\"I usually have maybe two meals a day if I'm lucky or one.\"\n\n\n\nJessica Menace says \"costs are getting worse\". Source: SBS News / Supplied In a good week, Jessica said she goes to a discount supermarket to buy beef mince and make meals for the week. But often she cannot afford meat or fresh fruit and groceries, opting for cheap microwave meals.\n\n\n\n\n\n\"You need variety in your diet and I'm not getting that,\" she said.\n\n\n\n\n\n\"And I don't really see that happening any time in the near future unless they drastically increase youth allowance and all the other payments as well. I just can't afford that sort of food.\"\n\n\n\nHarms of poor nutrition\n\nEmeritus professor Amanda Lee from the University of Queensland's School of Public Health told SBS News that poor nutrition has detrimental health outcomes.\n\n\n\n\n\nShe explained that junk food is typically more affordable than groceries, leaving financially stressed households to buy more processed and unhealthy food.\n\n\n\n\n\n\"Often in households that are struggling to make ends meet, you've got mothers in particular who go without food to try and improve the diet of their children, and that means that their future children can be compromised in terms of their nutrient intakes during pregnancy,\" she said.\n\n\n\n\n\n\"It's really a very insidious and surprisingly common problem in a country like Australia.\"\n\n\n\n\n\nLee said that lower socio-economic households and single-parent households tend to experience some of the poorest health outcomes.\n\n\n\nThis decline in nutrition quality can lead to or exacerbate chronic illness.\n\n\n\n\n\n\"People that can't afford basic healthy foods then often rely on the cheaper options that are very dense in energy so that obesity becomes a problem,\" Lee said.\n\n\n\n\n\n\"But it's a really horrible form of malnutrition because there's a double whammy of the chronic diseases associated with excess weight gain and poor health.\"\n\n\n\n\n\nShe said that advertising also plays a role in the overconsumption of unhealthy food.\n\n\n\n\n\n\"In our society, the foods that are most available and advertised and affordable tend to be those that have got very limited nutrient gain,\" she said.\n\n\n\n\n\n\"It really encourages people to spend more on the least healthy items as well.\"\n\n\n\nOther vulnerable groups\n\nThe report from Foodbank also identified other groups that are vulnerable to food insecurity.\n\n\n\n\n\nIt found 67 per cent of households that include someone living with a disability or health issue experienced food insecurity in the past 12 months.\n\n\n\n\n\nMeanwhile, 68 per cent of single-parent households are now food insecure.\n\n\n\nSource: SBS News Overall, one in five households earning $91,000 or more experiences food insecurity.\n\n\n\n\n\nTink said that there can be intersections between these more at-risk groups, which can further put households at a disadvantage.\n\n\n\n\n\nAt the same time, an estimated 7.6 million tonnes of food is wasted each year, according to Foodbank, costing the economy over $36.6 billion annually.\n\n\n\nIs a new tax the solution?\n\nFoodbank is supporting a National Food Donation Tax Incentive, which would change tax laws to incentivise small and medium-sized food producers to donate surplus food.\n\n\n\n\n\nTink explained that the proposed tax incentive would provide a cashback or tax credit for businesses, such as farmers or growers, based on the costs incurred in donating food.\n\n\n\nSimilar models are in place in the United States, Canada and France.\n\n\n\n\n\n\"For many food producers, it is cheaper to bury the excess or send it to the tip than to ship it to charities and donate,\" she said.\n\n\n\n\n\n\"We're asking the government to provide those sorts of businesses with a tax incentive that would let them claim a small tax deduction at the end of the year to help offset that additional expense.\"\n\n\n\n\n\nAustralian Food and Grocery Council CEO Colm Maguire told SBS News the incentive is a practical step to increase food donations.\n\n\n\n\n\n\" Food and grocery manufacturers are committed to addressing food insecurity, but the associated costs can be a barrier. A targeted tax incentive would help offset these costs, making it easier for companies of all sizes to participate in food relief efforts,\" he said in a statement.\n\n\n\n\n\n\"This reform has the potential to transform the food relief sector to increase reliable supply chains that deliver real social and environmental benefits.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/culture/movies/meghan-duchess-of-sussex-to-return-to-acting-in-new-film-20251106-p5n88v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Meghan, Duchess of Sussex, ‘to return to acting’ in new film",
    "publish_date": "Thu, 06 Nov 2025 12:54:12 +1100",
    "category": "entertainment",
    "authors": [
      "Gwyn Wright"
    ],
    "text": "The Duchess of Sussex has reportedly returned to acting after an eight-year hiatus.\n\nMeghan appeared on the set of Close Personal Friends, where she will play herself, alongside Lily Collins, Brie Larson, Jack Quaid and Henry Golding.\n\nThe main cast of US TV show Suits, featuring Meghan Markle (centre). Credit: AF archive / Alamy Stock Photo\n\nThe Amazon MGM Studios production is about two couples, one of them famous and the other not.\n\nThe Duchess, who played Rachel Zane in Suits, quit acting in 2017, a year after she began dating Prince Harry.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/mike-bush-faces-scrutiny-over-second-helicopter-ride-20251106-p5n897.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mike Bush faces scrutiny over second helicopter ride",
    "publish_date": "Thu, 06 Nov 2025 12:41:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "Mike Bush faces scrutiny over second helicopter ride\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/racing/oaks-day-2025-live-getta-good-feeling-the-favourite-as-sun-shines-over-flemington-fashions-on-the-field-in-focus-20251105-p5n7yf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Oaks Day 2025 LIVE: Getta Good Feeling the favourite as crowds flock to sunny Flemington; US reality TV star to hit the Birdcage",
    "publish_date": "Thu, 06 Nov 2025 12:40:42 +1100",
    "category": "lifestyle",
    "authors": [
      "Danny Russell",
      "Cara Waters",
      "Stephen Brook",
      "Nell Geraets"
    ],
    "text": "Everyone knows Oaks Day is reserved for ultra-feminine looks – think lacey numbers, baby blues and pastel pinks.\n\nBut content creator and podcaster Rozalia Russian doesn’t want to do what everyone expects.\n\n“I knew I wanted to steer away from pink or lilac, as I feel that can sometimes feel a little bit predictable,” Russian says.\n\nRozalia Russian’s refreshing look. Credit: Justin McManus\n\nSo, she teamed up with J’Aton Couture to create her “refreshing” mint green ensemble.\n\nThe form-fitting lace dress has the structure and formality expected of most racewear, but is paired with a matching headscarf – from Melissa Jackson Millinery – that pulls on an edgier vibe.\n\nLoading\n\n“I always like to push the boundaries and choose something that people maybe don’t expect. This mint green dress – I don’t think anyone would have expected me to rock this colour,” she says.\n\nShe’ll probably be back in her gym clothes tomorrow, Russian says, but for now, she’s luxuriating in the opportunity to dress up to the nines so many times in one week.\n\n“I would love to be able to dress up all the time, like they used to in the ’50s and ’60s,” she says.\n\n“I wish we would wear outfits like this every day.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/victoria/derrimut-gym-empire-enters-administration-20251106-p5n87a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Derrimut gym empire enters administration",
    "publish_date": "Thu, 06 Nov 2025 12:40:42 +1100",
    "category": "finance",
    "authors": [
      "Carla Jaeger",
      "Sophie Aubrey",
      "Sarah Danckert"
    ],
    "text": "Derrimut 24:7 Gym founder Nick Solomos has appointed administrators to the largest company within his floundering fitness empire, just days after billionaire businessman Adrian Portelli backed out of a lifeline deal.\n\nEmployees were informed on Thursday in an all-staff missive, seen by The Age, that stressed that it was business as usual for the gym chain, which is estimated to have racked up a near $30 million debt pile.\n\nNick Solomos placed a key company within his Derrimut 24:7 gym empire into administration on Thursday. Credit: Eddie Jim\n\n“This decision was not made lightly, but it represents a proactive step to give us the best possible opportunity to restructure, protect jobs, and position the business for a stronger future,” Solomos wrote.\n\nAll staff will continue to be paid weekly, and members will still have access to all of its 26 gym locations, he said.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-hanson-to-address-us-conservative-forum-as-she-closes-in-on-ley-in-polls-at-least-85-dead-75-missing-in-philippines-as-typhoon-kalmaegi-heads-for-vietnam-20251106-p5n83v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Microsoft apologises, offers refunds to 2.7 million Australians; Left engine fell off plane during take-off before fatal Kentucky crash, investigators find",
    "publish_date": "Thu, 06 Nov 2025 12:40:13 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Some of the lustre may have come off gold prices, but the precious metal is still adding extraordinary value to Australia’s trade performance.\n\nFigures out this morning from the Australian Bureau of Statistics showed gold exports jumped by 71.5 per cent in September to $5.3 billion.\n\nGold exports have soared since the start of Donald Trump’s second term as US president. Credit: Getty\n\nGold exports have soared since Donald Trump took up residence in the White House.\n\nThrough the first nine months of the year, Australian gold exports reached a record $43 billion, a 67 per cent increase over the same period in 2024.\n\nBy contrast, exports of iron ore – Australia’s most valuable export – fell by 6.7 per cent (to $88.5 billion). Exports of LNG have eased by 8.8 per cent to $45.5 billion while coal exports have tumbled by 27.5 per cent to $47 billion.\n\nMost of the surge in gold exports is due to high prices which peaked early last month at more than $US4300 an ounce. This morning, gold was just shy of the $US4000 mark.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/queensland/crisafulli-government-dumps-child-mental-health-hub-20251106-p5n85u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crisafulli government dumps child mental health hub",
    "publish_date": "Thu, 06 Nov 2025 12:32:16 +1100",
    "category": "finance",
    "authors": [
      "Felicity Caldwell"
    ],
    "text": "The Queensland LNP government has scrapped a new purpose-built clinic for children’s mental health in Yeronga, despite months ago putting aside more than $3 million for it to go ahead.\n\nThe Labor government announced in 2020 that an $8.5 million Child and Youth Community Health Hub would be built to house the Child and Youth Mental Health Service and a service to address eating disorders.\n\nThe clinics moved temporarily from their old sites in Yeronga and Greenslopes to Mount Gravatt while the new Yeronga hub was built – a project that suffered delays during the COVID period.\n\nThe old Child and Youth Mental Health Service at Yeronga.\n\nBut this week staff were informed the purpose-built hub would be scrapped, and the mental health clinic could not move back to its original location in an old Queenslander on Park Road at Yeronga.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/perth-convention-and-exhibition-centre-revamp-likely-canned-over-cost-concerns-20251106-p5n877.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "$1.6 billion Perth convention centre upgrade scrapped to buy and build hospitals",
    "publish_date": "Thu, 06 Nov 2025 12:27:28 +1100",
    "category": "finance",
    "authors": [
      "Holly Thompson",
      "Hamish Hastie"
    ],
    "text": "The WA government will divert funding from the abandoned Perth Convention and Exhibition Centre upgrade to expand the state’s under-pressure hospital system at a cost of $1.5 billion which will include the purchase of St John of God’s Mount Lawley Hospital.\n\nPremier Roger Cook made the funding announcement on Thursday, confirming the state would no longer proceed with plans to upgrade the ageing ‘shed on the Swan’ convention centre over concerns its cost would blow out.\n\nPerth Convention and Exhibition Centre concept images from Wyllie and Brookfield.\n\nUnder the new fund, Cook said negotiations were underway to buy the Mount Lawley Hospital from private operator St John of God, which would immediately add 197 beds into the public system.\n\nMore than half the beds at that hospital are already filled with public patients.",
    "source": "TheAge",
    "cluster_id": 9
  },
  {
    "url": "https://www.theage.com.au/national/victoria/real-estate-agents-forced-to-follow-stricter-price-guidelines-in-underquoting-crackdown-20251106-p5n842.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Real estate agents forced to follow stricter price guidelines in underquoting crackdown",
    "publish_date": "Thu, 06 Nov 2025 12:11:09 +1100",
    "category": "finance",
    "authors": [
      "Angus Delaney",
      "Aisha Dow"
    ],
    "text": "Real estate agents who underquote property listings will be forced to follow stricter guidelines to justify their price guides after an investigation found agents have been deliberately using bogus “comparable” properties to justify the illegal practice.\n\nAgents who set a property’s estimated sales price on comparable sales must now consider a home’s age and renovation status, as set out in statement of information requirements. It adds to existing guidelines, which instructs agents to consider a home’s architectural style, floor and land size, zoning, distance from key infrastructure and whether it has special features, such as a swimming pool or tennis court.\n\nThe government has introduced new laws to try to clamp down on underquoting. Credit: Mark Stehle\n\nAgents are also being instructed not to overlook substantially similar properties when picking comparable homes, after complaints that some were deliberately excluding sales of similar properties in the same street, apartment building or even duplex.\n\nBy choosing inferior properties, the agents have been attempting to sidestep laws designed to combat underquoting, an illegal practice where agents deliberately list properties for lower than they’re worth to attract more buyers.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/a-report-card-on-the-trump-presidency-20251106-p5n851.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A report card on the Trump presidency",
    "publish_date": "Thu, 06 Nov 2025 12:00:34 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "US oil production has increased, from the record average of 13.3 million barrels a day last year under the Biden administration to what the International Energy Agency predicts will be an average of 13.5 million barrels a day this year, but the slump in oil prices is likely to result in a sharp fall in drilling activity next year. Is the US experiencing “the most successful economy in the history of our country,” as Trump claimed? If the sharemarket were any guide, the answer would be an unequivocal “yes”. It’s up 17.5 per cent since last year’s election, albeit that it is being driven by the boom in artificial intelligence rather than the economy’s wider settings. Those with an exposure to the market, which tends to be the wealthier households, certainly see the Trump presidency as a success. They were also the major beneficiaries of the big tax cuts in Trump’s “One Big Beautiful Bill Act” that has since been rebranded, for obvious political reasons, as the “Working Families Tax Cut Bill”.\n\nThe wealthy (the Trump family in particular) have also benefited from the massive surge in the value of crypto assets that has occurred since Trump embraced an asset class he once derided and which the Biden administration viewed with suspicion and cynicism. In the real economy, and for the less wealthy and poor US households, things aren’t quite as buoyant. The US economy grew at 2.4 per cent last year. Trump’s “greatest economy”, one he repeatedly claims is the envy of the world, and which he said on Wednesday is seeing “the American Dream surging back to life”, will grow, according to the International Monetary Fund, 2 per cent this year and 2.1 per cent in 2026. US consumers don’t appear to believe that Trump is making America affordable again, with his approval rating dropping from 47 per cent early this year to 37 per cent in recent polling. Credit: Getty Images The now-record government shutdown will shave up to a percentage point off the December quarter GDP, although much of that should be recovered once the government re-opens and its furloughed employees are paid again.\n\nUS government debt was $US36.1 trillion at the end of last year. It’s now above $US38 trillion and rising. Despite Elon Musk and DOGE taking a chainsaw to the US bureaucracy and more than 100,000 federal government employees sacked, the budget deficit forecast by the Congressional Budget Office of $US1.8 trillion this year will only be marginally smaller than last year’s $US1.83 trillion, despite Trump hacking into the massive spending Biden was making in green energy and advanced manufacturing. Loading There’s been a lot of talk this year about the “debasement trade”, or investors selling US dollar-denominated assets because they are worried that, to escape its debt trap, the US will allow inflation and money-printing or more extreme measures that will erode the value of the dollar and the real value of their investments. The US dollar, while it has bounced back from its September lows, has fallen about 5 per cent against the basket of America’s major trading partners’ currencies. It had fallen more than 10 per cent before the US Federal Reserve Board’s first rate cut this year in September.\n\nDuring last year’s campaign, Trump said that, if he were elected, the dollar would be “so secure”. “Your reserve currency will be the strongest it’ll ever be,” he said. Hmm. US interest rates have, of course, fallen, with the yield on the 10-year bond rate down from 4.27 per cent at the end of last year to about 4.15 per cent and the yields on shorter-duration Treasuries by even more. He’s now got less than a year to turn his claims of overseeing the greatest economy ever into something real. That’s a function, however, of the weakening of economic growth, reflected in an unemployment rate that has begun edging up from 4.1 per cent in the December quarter last year to 4.3 per cent in the most recent available data.\n\nIf Trump’s beloved tariff regime holds up against legal challenges – the arguments before the Supreme Court justices who’ve previously been very supportive of Trump’s agenda on Wednesday don’t appear to have gone well for the administration – it will continue to undermine growth and fuel inflation. According to Goldman Sachs, about 55 per cent of the costs of the tariffs will, by the end of the year, be borne by US consumers and 22 per cent by US companies, with foreign exports absorbing 18 per cent. Goldman expects consumers could pay up to 70 per cent of their cost by the end of next year, underscoring that – contrary to what Trump and his advisers constantly claim – it is US consumers, and US companies, that pay the overwhelming majority of the tariffs’ cost. Trump promised to “tariff the hell out of countries that have been taking advantage of us”. He’s kept that promise, but he failed to tell voters (or perhaps he didn’t understand) that it meant introducing a big new and highly regressive domestic tax on consumption. In those trade deals, and from some arm-twisting of US companies, Trump has obtained promises of massive investments in the US. The White House claims they total $US8.9 trillion, although that would include previously planned expenditures and probably some that will never be made once (if?) Trump departs the White House.\n\nEven a decent slice of those commitments would, however, help build manufacturing investment and jobs in the US, which, given that the US manufacturing sector has, according to the ISM Manufacturing PMI, been shrinking for eight months straight, is much needed. Manufacturing investment and jobs grew strongly during Biden’s term. Loading Trump has over-delivered on his promises to deal with illegal immigration, even if the brutal measures taken by ICE to execute the policies appear increasingly unpopular. He’s also had some foreign policy wins. However, it’s the domestic economy and policies that impact Americans’ costs-of-living that produced the election outcomes this week and that will decide the shape of Congress – and the effectiveness of the last two years of Trump’s presidency – at next year’s mid-terms. He’s now got less than a year to turn his claims of overseeing the greatest economy ever into something real.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/schoolgirl-floats-alternatives-doomscrolling-pm-015019492.html",
    "title": "Schoolgirl floats alternatives to doomscrolling with PM",
    "publish_date": "2025-11-06T01:50:19Z",
    "category": "finance",
    "authors": [],
    "text": "A year 6 student has laid out her findings into the negative impacts of social media to the prime minister a month out from the ban that will boot kids off platforms.\n\nPrime Minister Anthony Albanese praised Hobart schoolgirl Flossie Brodribb's research, which she took all the way to Parliament House on Thursday.\n\n\"Good on you, we're going to put you on a national tour about this,\" Mr Albanese said.\n\nThe prime minister praised Flossie Brodribb's research during their meeting in Canberra. (Lukas Coch/AAP PHOTOS)\n\nFlossie compiled a list of hobbies her peers could pick up instead of doomscrolling on a mobile phone.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Eat roast chickens, learn to play piano, surfing, jump on the trampoline, practice guitar,\" she told the prime minister.\n\nShe also floated skipping, drawing, reading and getting outdoors.\n\nThe student also interviewed child psychologists to understand the neuroscience of addictive algorithms, as well as other negative mental health impacts like body dysmorphia and anxiety.\n\nFlossie detailed the neuroscience of addictive algorithms used for social media. (Dean Lewins/AAP PHOTOS)\n\n\"I learnt about the dopamine loop, which is when you're on social media and your brain's constantly getting hits to dopamine,\" Flossie said.\n\n\"They use the same algorithms in social media as gambling does which can make it more addictive.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nShe encouraged her classmates to sign a pledge to delay their use of social media until they were 16.\n\nFrom December 10, children aged 16 and under will be kicked off platforms including Facebook, Instagram, Snapchat, TikTok, YouTube, Threads and X.\n\nThe Albanese government on Wednesday announced the list had expanded to also capture the forum website Reddit and live-streaming platform Kick.\n\nDiscord, Twitch and popular gaming platform Roblox won't be affected by the ban, but Communications Minister Anika Wells said the list would be fluid, meaning more could be added.\n\nThe onus for complying with the ban rests with tech giants to \"detect and deactivate or remove\" accounts from underage users.\n\nCompanies that fail to comply could be fined up to $49.5 million.\n\nLifeline 13 11 14\n\nbeyondblue 1300 22 4636",
    "source": "Yahoo",
    "cluster_id": 39
  }
]