[
  {
    "url": "https://www.9news.com.au/world/pam-bondi-jeffrey-epstein-victims-congressional-hearing-jamie-raskin-pramila-jayapal/74f21ec7-5c01-4c70-bc3c-0a31327ce022",
    "title": "Trump's attorney-general refuses to face Epstein victims, apologise",
    "publish_date": "Thu, 12 Feb 2026 01:05:34 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "\"Please raise your hands if you have still not been able to meet with this Department of Justice,\" Jayapal said.\n\nPam Bondi refused to turn around to face victims of Jeffrey Epstein. (AP)\n\nAll of the survivors raised their hands.\n\n\"Will you turn to them now and apologise for what your Department of Justice has put them through with the absolutely unacceptable release of the Epstein files and their information?\" Jayapal asked Bondi.\n\nBondi did not turn around to face the victims and refused to apologise.\n\n\"Why didn't she ask Merrick Garland this twice when he sat in my chair?\" Bondi said, referring to her predecessor in the Biden administration.\n\n\"I'm not gonna get in the gutter for her theatrics.\"\n\nBut she did express her sympathies for victims of sexual assault.\n\n\"I am deeply sorry for what any victim has been through, especially as a result of that monster,\" she said.\n\nThe tense congressional testimony was marked by combative answers directed at Democrats on the panel.\n\nPam Bondi was combative in an adversial congressional hearing. (AP)\n\nAt one point, she described Congressman Jamie Raskin as a \"washed-up, loser lawyer\".\n\n\"Have you apologised to President Trump?\" Bondi asked of Democrats.\n\n\"You sit here and you attack the president, and I am not going to have it.\"\n\nShe criticised the committee for not talking about the stock market.\n\n\"The Dow is over 50,000 right now, the S&P at almost 7000, and the NASDAQ smashing records, Americans' 401(k)s and retirement savings are booming,\" she said.\n\n\"That's what we should be talking about.\"\n\nDemocrats were highly critical of Bondi's testimony.\n\n\"Pam Bondi's place in history is going to be as the attorney-general who is one of the greatest defenders of paedophiles and sexual abusers in American history,\" Jason Crow said.\n\n\"Her place in history will also be as the person that turned America's Justice Department into a political hatchet operation for Donald Trump's opponents.\"\n\nDonald Trump and Jeffrey Epstein together. (House Oversight Committee)\n\nIt also appears Bondi and the Department of Justice have been surveilling representatives as they conduct their own investigation into Jeffrey Epstein.\n\nA photographer during the hearing snapped a picture of a piece of paper in a folder in Bondi's hands.\n\nThe document is titled: \"Jayapal Pramila Search History\".\n\nThe file appears to include details from the Epstein files.\n\nThis week, members of Congress were allowed to view unredacted documents in the Epstein files.\n\n\"It is totally inappropriate and against the separations of powers for the DOJ to surveil us as we search the Epstein files,\" Jayapal later said.\n\n\"Bondi showed up today with a burn book that held a printed search history of exactly what emails I searched.\"\n\nDonald Trump with sex offender Jeffrey Epstein in 2000, with their respective partners Melania Knauss (now Trump) and Ghislaine Maxwell at the president's Mar-a-Lago club in Florida. (Getty)\n\nThe Department of Justice has released millions of files related to the Jeffrey Epstein investigation , many of which are heavily redacted.\n\nEpstein used his wealth and power to sexually abuse many underage girls.﻿\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.\n\nSign up to our breaking newsletter here",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/james-van-der-beek-actor-dies-age-48/0e69f5eb-5943-4fc1-86d3-2f7eed253726",
    "title": "Actor James Van Der Beek dies aged 48",
    "publish_date": "Wed, 11 Feb 2026 20:10:16 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "A﻿ctor James Van Der Beek has died at age 48, according to a post by his wife Kimberley on Instagram.\n\n\"He met his final days with courage, faith, and grace,\" she wrote.\n\n\"There is much to share regarding his wishes, love for humanity and the sacredness of time. Those days will come.\n\n\"Our beloved James David Van Der Beek passed peacefully this morning. He met his final days with courage, faith, and grace. There is much to share regarding his wishes, love for humanity and the sacredness of time. Those days will come. For now we ask for peaceful privacy as we grieve our loving husband, father, son, brother, and friend.\" (Instagram)\n\n\"For now we ask for peaceful privacy as we grieve our loving husband, father, son, brother, and friend.﻿\"\n\nNo cause of death has been given but Van Der Beek was diagnosed with colorectal cancer in 2023.\n\nVan Der Beek shot to fame as the titular Dawson Leery in teen drama Dawson's Creek in the late 1990s and early 2000s, winning the role at just 20.\n\nJames Van Der Beek with his son Jeremiah (Instagram @vanderjames)\n\nActor James Van Der Beek has died aged 48. (Variety via Getty Images)\n\nThe show propelled Van Der Beek and the cast, which included Katie Holmes, Michelle Williams and Joshua Jackson, into superstardom, and remained one of his best-known roles along with his 31-episode run on CSI: Cyber .\n\n﻿He wed his wife Kimberley Brook in 2010, and they had six children together.\n\nThe family relocated from LA to a ranch near Austin, Texas, in 2020. It was while living there that he received a diagnosis of colorectal cancer in 2023, but he only made the news public a year later to raise attention to the disease.\n\nHe became an advocate for earlier detection of colorectal cancer but kept his own battle private, choosing not to share details of his treatment.\n\nVan Der Beek with co-stars Mary-Margaret Humes and John Wesley Shipp on Dawson's Creek. (Sony Pictures Television)\n\nHe seemed to be doing well up until the middle of 2025, even appearing on red carpets.\n\nBut it was his video appearance at a Dawson's Creek reunion and cancer fundraiser he was forced to pull out of in September 2024 that worried fans due to his gaunt appearance.\n\nVan Der Beek is survived by his wife and their six children.﻿\n\nEarly life and career breakthrough\n\nVan Der Beek was born on March 8, 1977, in the US state of Connecticut. His mother was a dancer and gymnastics teacher while his father was a mobile phone company executive and former minor league baseball player.\n\nAfter a high school performance in Joseph and the Amazing Technicolor Dreamcoat, he asked his mother to take him into New York City to get an agent when he was 15.\n\nHe made his professional debut in an off-Broadway production at 16 then appeared in a 1993 episode of the TV show Clarissa Explains it All .\n\nREAD MORE: ﻿ Piece of paper could have saved OJ Simpson tens of millions of dollars\n\nThe cast of \"Dawson's Creek\" included a number of future stars. (Hulton Archive/Getty Images via CNN Newsource)\n\nIn 1995, he made his feature film debut in Angus then appeared in three episodes of soap opera As The World Turns , before winning his best known role in the hit TV show Dawson's Creek .\n\nThe teen drama was an instant hit when it first aired in 1998, and made huge stars out of its cast, although Van Der Beek admitted in 2013 he struggled at first with the level of stardom it brought.\n\n\"I went from signing my first autograph in 1998 to, literally two weeks later, being rushed by an angry, screaming mob of teenage girls [and] girls getting crushed against barricades and [me] being shoved in the back of a cop car to escape the melee,\" he told Vulture in 2013.\n\nVan Der Beek admitted he struggled with sudden fame. (WireImage)\n\nThe show went on to run for six seasons, before ending in 2003.\n\nIt was credited with starting a trend of teenage-centered shows, which continued well into the 2000s and was once included in the Entertainment Weekly list of top 100 of classic TV shows.\n\nWhile the character put him on the map, Van der Beek once admitted during an interview with Paper Magazine that Dawson's famously mopey character – his crying face later became a well-known meme – would probably make him want to avoid him in real life.\n\n\"Dawson was sweet, but would probably get on my nerves and end up as one of those people I found myself making excuses to not hang out with,\" he said.\n\nLife after Dawson's Creek\n\nVan Der Beek capitalised on his Dawson's Creek fame while the show was still on the air, starring in several films during its production breaks, including the 1999 film Varsity Blues , which clinched him the MTV Movie Award for Best Breakthrough Male Performance.\n\nNext he starred in 2001's Texas Rangers , and the 2002 comedy, The Laws of Attraction .\n\nBut after the show that made him a household name ended, he initially found it hard to top that success, although he did work consistently in the early 2000s, with guest roles in TV shows Criminal Minds, Ugly Betty, One Tree Hill and Medium .\n\nREAD MORE: ﻿ Taylor quits frontbench to set up Liberal leadership battle with Ley\n\nVan Der Beek with his wife Kimberley. (Instagram/@vanderjames)\n\nIn 2010, he appeared in 10 episodes of the medical drama Mercy , then won a role in the sitcom Don't Trust the B---- In Apartment 23 , where he played an over-the-top version of himself.\n\nNext came the sitcom, Friends With Better Lives , which ran for one season.\n\nHe won a starring role in TV drama CSI: Cyber , alongside Ted Danson and Patricia Arquette, as FBI Agent Elijah Mundo, which ended its two-season run in 2016.\n\nHe continued to work regularly, making a guest appearance as Bo Johnson in Modern Family and later in five episodes of Pose .\n\nHe also voiced the character of Boris in the animated TV series Vampirina , which ran from 2017 to 2021.\n\nMarriage and children\n\nShortly after finding fame on Dawson's Creek , Van Der Beek started dating Heather McComb, who was best known for her roles in the crime drama Profiler and another teen family drama, Party of Five .\n\nThey reportedly first met in 1998 through McComb's sister, Jennifer, who made a guest appearance on Dawson's Creek .\n\nThe couple became engaged in 2003 and wed in Malibu a few months later.\n\nVan Der Beek (right) later appeared on other shows such as One Tree Hill. (Warner Bros. Television)\n\nThey were married for six years before Van Der Beek filed for divorce in June 2009, citing irreconcilable differences.\n\nShortly after their separation, Van Der Beek found himself in Israel in 2009, where he met former actress and producer turned podcaster Kimberly Brook.\n\nIn a 2020 Instagram post, Van Der Beek reflected on their first meeting.\n\n\"I'd been famous, been wealthy, been married, been divorced, been less-than-wealthy, been single... and I was in Israel, on a trip with an organised group, when it hit me: I was done being single,\" he wrote.\n\nFans were alarmed at James Van Der Beek's gaunt appearance appearing via video message at a Dawson's Creek reunion last year.. (Instagram/@mightythescamp)\n\n\"I wanted a real relationship. A soul mate. Someone with whom I could build a family.\n\n\"I was mid-revelation, rattling all this off to a friend of mine when a voice interrupted us, wanting to ask him a question. I was annoyed. Who the hell was stepping all over my moment? I turned around... it was @vanderkimberly.\n\n\"Three days later, I asked her what she was looking for in a relationship. Her answer: 'I'm not looking for a relationship.'\n\n\"Six months later we were living together. Two weeks after that we were pregnant, and almost exactly one year to the date after she'd first interrupted me... we were married.\"\n\nVan Der Beek sold memorabilia to pay for his cancer treatment. (Instagram/@vanderjames)\n\nThe couple returned to Israel for their wedding on August 1, 2010.\n\nTheir first child, daughter Olivia, arrived just over a month later. They welcomed son, Joshua, just 18 months after that, then daughter Annabel Leah in January 2014.\n\nJust two years later, Emilia was born in 2016, followed by another girl, Gwendolyn in 2018, and son Jeremiah in 2021.\n\nMove to Texas\n\nIn 2020, the couple decided to take their kids to Austin, Texas, where he had shot Varsity Blues when he was 21, to celebrate their 10th wedding anniversary, and found themselves wanting to move there permanently.\n\nHe told Austin Lifestyle, \"We wanted to get the kids out of Los Angeles. We wanted to give them space and we wanted them to live in nature.\"\n\nThe family moved to a 14.6 hectare ranch near Austin that same year.\n\nREAD MORE: ﻿ Shark spotted swimming inside ocean pool at popular Sydney beach\n\nVan Der Beek on holiday in Egypt with his family. (Instagram/James Van Der Beek)\n\nCancer diagnosis\n\nIn November 2024, Van Der Beek, revealed he was diagnosed with stage three colorectal cancer the previous August, when he was 46, which he had been dealing with and treating privately with the support of his family.\n\n\"What do you do when you are staring down a stage three diagnosis?\" he said in an emotional interview with People.\n\n\"This is either going to take me out of the body or teach me how to truly live in it.\"\n\nAt the time, he revealed he had decided to undergo a colonoscopy after experiencing some symptoms, and was still coming out of the anaesthetic when the gastroenterologist told him \"it is cancer\".\n\nREAD MORE: ﻿ Two arrested in Italy over armed robbery on security truck\n\nVan Der Beek later parodied himself in Don't Trust the B---- in Apartment 23.\n\n\"And I think I went into shock a little bit.\"\n\nHe said that at the time he knew very little about cancer, his type of cancer or what stage it was.\n\nHe resisted the urge to break down but said that when he woke up the following morning he knew his life had been \"uprooted\".\n\nThe Van Der Beeks has six children together. (Instagram)\n\n\"And thus began the full time job of having cancer,\" he said.\n\nHe later learned that while the cancer was localised, it was stage three, adding \"it's not what you want to hear\".\n\nHowever, he said \"I really didn't feel like this was going to end me\".\n\nWhile he stayed positive 90 per cent of the time, he admitted that \"10 per cent of the time I was a sobbing, terrified mess\".\n\nHe admitted at the time his children were 'scared' and praised his 'extraordinary' wife for being by his side during treatment, which at times left him 'laid low' and 'scraping the bottom of despair'.\n\n\"One of the trickiest things about cancer for me are the unknowns,\" he said, adding he was \"feeling great and cautiously optimistic\".\n\nHe returned to work in 2024, appearing in an episode of the TV series Walker , the film Sidelined: The QB and Me and in two episodes of the TV series Overcompensating .\n\nHe appeared on the red carpet at the latter's premiere in May 2025 sporting a moustache and looking well.\n\nTwo months earlier, he marked his 48th birthday by sharing a video to Instagram explaining how his diagnosis had affected every aspect of his life.\n\nHe also suggested his battle with cancer had taken a bad turn.\n\n\"This year, I had to look my own mortality in the eye. I had to come nose to nose with death. And all of those definitions that I cared so deeply about were stripped from me,\" he said.\n\nIn July 2025, he gave an update during an interview on the US Today show, which seemed to suggest his cancer was incurable.\n\n\"It's a process,\" he said. \"I'll probably be on a process for the rest of my life.\"\n\nHe also started working to raise awareness of colorectal cancer and the use of noninvasive blood tests available in the US that offer early detection.\n\n\"I really want to impress upon people that you don't need symptoms to get screened,\" he told Healthline.\n\n\"If you are 45 or older or have a family history, talk to your doctor about your screening options.\"\n\nBut it was his appearance via video link at a live script reading that reunited the cast of Dawson's Creek while raising funds for the charity F Cancer that first raised fears about his health.\n\nHe had been scheduled to attend the September 22 event but pulled out at the last moment, with his wife and children attending in his place.\n\nVan Der Beek said he was battling two stomach viruses but his thin and frail appearance alarmed fans.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/instagram-ceo-adam-mosseri-social-media-addiction-california-usa-lawsuit/8b9e5ffc-c2c9-4384-9d88-6079f1352b73",
    "title": "Instagram CEO says he does not believe people can be 'clinically addicted' to the platform",
    "publish_date": "Thu, 12 Feb 2026 00:45:34 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "Adam Mosseri is the first social media executive to speak at the\n\ntrial\n\nin\n\nCalifornia\n\non the issue of social media addiction, where YouTube and Instagram's parent company\n\nMeta\n\nis being sued.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/tradie-shortage-chippies-like-caitlyn-could-be-the-key-to-solving-our-housing-crisis/27a85e67-c1f6-43c0-80c7-5647e120f81e",
    "title": "Chippies like Caitlyn could be the key to solving our housing crisis",
    "publish_date": "Thu, 12 Feb 2026 02:37:42 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "When Caitlyn Goodman was growing up as one of four girls in her family, she never dreamed she would one day be building houses as a carpenter.\n\nThe prospect of becoming a female tradie just never occurred to her, she said.\n\nBut the signs were there, even from a young age.\n\n\"My dad was a fencer, and growing up, he taught me how to use power tools. I was always very drawn to it.\" Goodman, 22, said.\n\nCaitlyn Goodman is a third-year carpentry apprentice in Victoria. (Supplied Nine)\n\nDuring her final year of high school, Goodman worked at Bunnings in the timber yard.\n\n\"I was becoming very familiar with all the types of timbers and power tools. I was learning a lot,\" she said.\n\nAfter finishing her higher school certificate, Goodman briefly toyed with the idea of becoming a nurse, having also worked as a ward clerk, before deciding to follow her heart and become a carpenter.\n\n\"One day, I just said, Screw it. I'm just going do it, why not? Why can't I do it?\" Goodman said.\n\nWith the construction industry facing a critical shortage of workers, particularly in carpentry, getting apprentice job proved to be easy, especially after her dad put a call out to builders he knew, Goodman said.\n\n\"We got in contact with Chris, who is my boss now. He had an interview with me. He was really happy, and said, 'When can you start?'\" Goodman said.\n\nGoodman is now a third-year apprentice, helping build residential homes in the Greater Melbourne area.\n\nThe Housing Industry Association (HIA) says Australia desperately needs more people like her to have any hope of meeting Australia's ambitious construction targets.\n\nChippies top list of workers in demand\n\nAt the top of the \"short supply\" list are carpenters - the very trade Goodman is mastering.\n\nAccording to the HIA, the math of the National Housing Accord simply doesn't add up without a massive influx of new boots on the ground.\n\nUnder the Accord, the Federal Government has set a target to build 1.2 million homes over five years. But according to Mike Hermon, HIA Executive Director for Future Workforce, the industry is currently missing a vital piece of the puzzle.\n\n\"Workforce shortages remain one of the biggest constraints on increasing home building activity, with the nation needing an estimated 83,000 additional skilled workers across our key trades,\" Hermon said.\n\n\"Shortages across key residential construction trades, particularly carpentry, are limiting building capacity across the states. Builders across the country are telling us the same thing - demand for housing is there, but access to skilled labour is holding projects back.\"\n\nRecent HIA data reveals a sobering reality for the sector. A survey of small business members found that 67 percent of respondents are having trouble recruiting or retaining staff.\n\n\"If we do not train more apprentices now, the homes Australia needs simply will not be built,\" Hermon said.\n\n\"Every new home starts with an apprentice on site.\"\n\nFor Goodman, the reasons behind the shortage aren't a mystery. While she loves the reward of \"building someone's dream,\" she said the financial barriers for young people were steep.\n\n\"People start their apprenticeship, and then it's just not everything they want - like the pay,\" Goodman said. \"They don't want to stick around and bend over backwards for $16 an hour. Carpenters are one of the lowest-paying trades.\"\n\nWhile the government has introduced incentives like a $10,000 apprentice grant, Goodman said the fine print often excluded those who needed it most.\n\n\"You have to be living out of home [to get the full grant], but I can't afford to move out of home,\" she said. \"Rather than giving out grants and all that, I think, honestly, just increase the pay.\"\n\nNo looking back\n\nGoodman admits that stepping on site for the first time as an apprentice was daunting.\n\n\"I was really scared, honestly, starting out,\" she said.\n\n\"I'd heard quite a few stories of apprentices not being treated the greatest on site, which is really disheartening to even hear now.\"\n\nCaitlyn Goodman, 22, was named HIA's Victorian Apprentice of the year in 2025. (Supplied)\n\nHowever, those fears were quickly dispelled.\n\nGoodman said she found herself in a small, supportive team and was even working alongside a female chippie.\n\n\"She's made me feel a lot more comfortable working in the industry,\" Goodman said. \"I don't get treated differently, and I don't get treated with disrespect.\"\n\nGoodman is a staunch advocate for the trades, especially for other women.\n\n\"Every single time I tell people what I do, they go, 'Oh, really?' or they think I'm lying,\" she said.\n\n\"I tell other girls - why not? Just do it.\n\n\"I'm going to graduate and be able to actually save up to buy a house, rather than paying off student debt.\"\n\nTradie salaries by occupation\n\n﻿Electrician $95,000 – $115,000\n\nPlumber $85,000 – $100,000\n\nCarpenter $80,000 – $95,000\n\nPainter $80,000 – $90,000\n\nBricklayer$75,000 – $85,000\n\n(Source: Seek.com.au)\n\nDo you have a story? Contact reporter Emily McPherson at EMcPherson@nine.com.au",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/australia-first-home-buyer-loans/1fd19b39-e67f-42c2-b7d6-791c3e91e614",
    "title": "One state driving the biggest spike in first home buyer loans in years",
    "publish_date": "Thu, 12 Feb 2026 00:42:23 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "First home buyer loans in New South Wales grew by nearly 11 per cent, with\n\nWestern Australia\n\nand\n\nQueensland\n\nalso having rises of 9.8 per cent and 6.4 per cent respectively.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/the-50year-medicare-myth-how-an-exprisoner-is-turning-healthcare-in-aussie-jails-on-its-head/5d248daf-7b4a-49c8-bcb7-43140d1e1c58",
    "title": "The undisputed Aussie prison 'law' that may be a myth",
    "publish_date": "Wed, 11 Feb 2026 21:14:20 +0000",
    "category": "lifestyle",
    "authors": [
      "Feb"
    ],
    "text": "Having spent 10 months in jail, Damien Linnane knows all too well the dangerous gaps that exist in the healthcare that's provided to Australian prisoners behind bars.\n\nAfter his release from custody, Linnane - a PhD law student - spent the better part of a decade campaigning for the laws to be changed to allow prisoner access to Medicare, alongside doctors and other high-profile advocates.\n\nThen, with the help of Australia's foremost legal expert in Medicare, solicitor Margaret Faux, Linnane made a discovery that turned everything on its head.\n\nREAD MORE: ﻿ Angelic face of Italian PM wiped from controversial church fresco\n\nLibrarian and PhD student Damien Linnane spent a decade trying to fix the prison healthcare system, only to find out he - and everyone else - was going about it the wrong way. (Dylan Coker)\n\nWhat if everyone had been going about this all wrong? What if the seemingly uncontrovertible fact that prisoners can't claim Medicare rebates never had any basis in Australian law to begin with?\n\nThat's what the pair have argued, and Linnane says they have now proven it with a test case.\n\nLast April, Linanne helped a prisoner claim a Medicare rebate for a GP consultation - in what is believed to be the first time in 50 years.\n\nDo you have a story? Contact reporter Emily McPherson at EMcPherson@nine.com.au\n\nWhat does the law say?\n\nThe long-held belief that prisoners are excluded from Medicare stems from the Health Insurance Act 1973.\n\nThe legislation, designed to prevent \"double-dipping\", states that Medicare benefits are not payable for services already funded by a government authority, such as a state.\n\nHowever, the law doesn't mention prisoners specifically.\n\n\"The legislation basically says Medicare benefits won't be paid for [services] that are provided by the state, and it was just kind of accepted at face value that this applied to prisoners for the last 49 years,\" Linnane says.\n\nIn 2024, Linnane, Faux and NSW human rights lawyer Anthony Levin wrote a paper in the Journal of Law and Medicine, arguing that while the state is responsible for public health in prisons, nothing in the law prevents a prisoner from acting as a \"private patient\".\n\nJust as patients in a public hospital bed could elect to be a private patient and have their services billed to Medicare, prisoners could also enter into a private contract with a practitioner to claim a rebate, they argued.\n\nNobody bothered to check?\n\nLinnane believes the 50-year \"Medicare myth\" has persisted for so long because \"nobody cares enough about prison health care\".\n\nHe says that prisoners are typically poor self-advocates and policies that seek to improve their conditions are rarely a vote-winning issue for politicians.\n\nWhile prisoners in NSW, Queensland and Victoria can technically apply to see a private doctor, they must bear the cost of transport and security escorts. Documents provided under Freedom of Information to Linnane, and seen by nine.com.au, show the average cost of a trip runs to about $1000 just for transport.\n\nSome states, like Queensland, even advise practitioners on their corrective services website that prisoners are ineligible for Medicare - a claim Linnane and Faux argue is \"practically rather than legally imposed\".\n\nLinnane's personal experience\n\nLinnane's mission is fueled by the 308 days he spent in prison in 2015.\n\nHis path to custody began when, in a state of mental crisis, he burnt down a man's house, reacting to a claim made about an alleged crime.\n\nBefore he went into prison, Linnane was seeing a psychologist under a mental health plan and said he had made real progress.\n\nWhen he entered custody and asked a psychologist if the plan could continue, the response changed his life.\n\n\"She smiled sadly and said... 'Damien, everyone in prison would benefit from mental health treatment, but there is no funding for that,'\" Linnane said.\n\nWithout access to his plan, Linnane's mental health deteriorated and he began having suicidal thoughts. However, Linnane claims no mental health treatment was made available except for placement in a \"safe cell\" - an experience he likened to solitary confinement.\n\nDamien Linnane says a test case shows prisoners do have active Medicare accounts that can be used to claim rebates. (Supplied)\n\nThe epiphany\n\nLinnane said exclusion of prisoners from Medicare was built on a foundation of systemic misinformation.\n\nHe was even told by prison staff that his Medicare card had been \"deactivated\" the moment he was processed - a claim he later discovered was incorrect.\n\nThe \"aha!\" moment occurred when Linnane invited Faux to speak at a conference, and Faux, in her speech, questioned why prisoners could enter into contracts with private lawyers but not doctors.\n\nThe pair then realised that the denial of Medicare was a technical barrier rather than a legal one.\n\nWondering if they were \"missing something obvious\", they ran their theory by Levin, who confirmed their legal logic.\n\nThe test case\n\nTo prove it could work, Linnane organised a test case last April, setting up a telehealth appointment with a prisoner who had been behind bars for more than 10 years and a GP who agreed to bulk bill him.\n\nWhen the Medicare rebate was successfully processed, the team celebrated.\n\n\"Now we know this works, this gives us the information we need to go forward,\" Linnane said.\n\nWhen nine.com.au contacted NSW Justice Health, a spokesperson said the department could not comment as the Commonwealth Department of Health was the responsible agency for legislation around prisoners and Medicare.\n\nA spokesperson for the Department of Health, Disability and Ageing said: \" State and territory governments are responsible through their own legislation for the delivery of corrective services, which includes delivery of healthcare to persons in prisons\".\n\nWhat is next?\n\nLinnane and a pro-bono law firm are now seeking declaratory relief in the Federal Court to have a judge formally confirm that this access is legal.\n\n\"We just want the court to tell us whether this was possible or not, because no-one has ever asked,\" Linnane said.\n\nLinnane makes sure to clarify that he doesn't want to replace the whole prison healthcare system, but to supplement it where gaps exist.\n\nAnd the stakes can be life and death.\n\nLinnane points to the case of Douglas \"Mootijah\" Shillingsworth, who died of a preventable ear infection.\n\nA coroner found that a Medicare-funded Indigenous health assessment could have picked up the condition, but no non-Medicare equivalent was available.\n\n\"The Shillingsworth case is not isolated,\" Linnane said.\n\n\"There have been several coronial inquests into deaths in custody that have connected a death to a lack of Medicare.\n\n\"There will be a lot fewer deaths in custody and, in particular Indigenous deaths, if prisons can start billing some services that they aren't able to provide.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/robodebt-class-action-deadline-looms-march/de7c07ce-a00f-4299-b62d-359a0aee651d",
    "title": "Urgent deadline looms for thousands like Justin owed share in $475m",
    "publish_date": "Wed, 11 Feb 2026 19:07:13 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "Hundreds of thousands of Robodebt victims could miss out on thousands in compensation if they fail to register for a fresh class action settlement before a looming deadline.\n\nThe federal government agreed to pay $475 million in compensation to victims of the Coalition's \"illegal and immoral\" Robodebt scandal – the largest class action settlement in Australian history.\n\n﻿Gordon Legal – which launched the class action lawsuit – said that while 100,000 impacted Australians have signed up for the compensation, hundreds of thousands more could miss out.\n\nNSW man Justin is among the 443,000 Australians who were delivered a crushing Robodebt notice.\n\nJustin was a victim of the unlawful Robodebt scheme in 2016. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nThe surprise $5500 debt in 2016 \"knocked the wind out of [his] sails\".\n\nJustin told nine.com.au he was forced to live on food scraps and move out of his sharehouse to pay it back before the tight deadline.\n\n\"I just went into panic mode,\" Justin said.\n\n\"I thought, 'Where am I going to get this money?' Life as it was... I was living week to week.\"\n\nJustin paid back his debt in full over several months of living on a shoestring budget.\n\nDuring that time, his financial situation became so dire ﻿that some nights he could only afford bread and some gravy for dinner.\n\n\"Because I was scared. I was scared of that letter,\" he added.\n\nCentrelink was found to have unlawfully pursued debts from Australians between 2015 and 2019. (AAP)\n\nThe 2023 Royal Commission found that Centrelink unlawfully pursued $1.7 billion in welfare debts that people didn't owe using an automated scheme between 2015 and 2019.\n\nFederal Court Justice Bernard Murphy said in his ruling Robodebt was a \"shameful chapter\" in Australia's history, as well as a \"failure\" in public administration.\n\nIt has been blamed for causing significant harm and multiple deaths, including suicides.\n\nJustin said he was only offered a meagre $350 in compensation following the first $112 million class action lawsuit in 2022.\n\nGordon Legal appealed this settlement in 2024.\n\nJustin described the initial payout as a \"massive cop-out\"﻿.\n\nAnd while there was some validation from knowing his debt was found to be illegal following a royal commission, the mental and financial toll is hard to erase.﻿\n\n\"I had the rug pulled out from under﻿neath my feet. I thought, 'How could the government do this to me?''' Justin said.\n\n\"They knew that this was wrong. And that's the part that really hurts.\"\n\nThis time, he hopes the financial outcome will be better.﻿\n\n\"Because that first round was a slap in the face,\" Justin said.\n\nJustin was contacted by Gordon Legal regarding the initial class action settlement and has signed up for the second one.﻿\n\nGordon Legal partner Andrew Grech. (AFR)\n\nThere are hundreds of thousands of people who risk missing the deadline.\n\nIt may be that they don't have the correct contact details for Gordon Legal to alert them to the second settlement.﻿\n\nRobodebt victims have until March 6 to register.﻿\n\nGordon Legal partner Andrew Grech said victims deserve this impending compensation.\n\n\"Payments can range from a thousand dollars to tens of thousands of dollars, so it's well worth people registering for compensation under the scheme,\" Grech told nine.com.au.\n\n\"4pm on the 6th of March is a hard deadline and if they haven't registered to participate they won't be able to participate.\n\n\"It's critical that they do register if they wish to do so.\"\n\nThe Federal Court will be asked to approve the settlement in mid-2026.\n\nReaders seeking support can contact Lifeline on 13 11 14 or beyond blue on 1300 22 4636.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/parking-fine-south-maroubra-beach-car-park-exclusive/4419ab40-a5b5-42c0-9253-aaf08e201eec",
    "title": "Phil parked between two white lines but still copped a $140 fine",
    "publish_date": "Wed, 11 Feb 2026 19:20:44 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "E﻿xclusive: Another Australian has been stung by 'confusing' parking rules at a popular Sydney beach.\n\nPhil* parked in what he thought was a marked space at the carpark near South Maroubra Surf Lifesaving Club in November.\n\nAfter a day at the beach, he returned to a $140 parking fine for not parking \"wholly within a parking bay\".\n\nA Sydney local thought this was a parking spot but copped a fine when he left his car here. (Supplied)\n\nPhil was baffled by the fine.\n\nHe snapped photos showing he had parked between two white lines which he believed marked a parking space and requested a review through Revenue NSW.\n\n\"It's very frustrating,\" he told nine.com.au.\n\n\"To receive $140 fine over an honest mistake in a cost of living crisis is unspeakable - all for a couple of hours at the beach.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nThe spot where Phil parked is located in a carpark near Maroubra beach. (Supplied)\n\nIn a ﻿letter sighted by nine.com.au, Revenue NSW acknowledged Phil's claim that he was parked within two white lines.\n\nHowever it was unable to cancel the fine.﻿\n\n\"Vehicles must be parked in marked bays where displayed,\" the letter read.\n\n\"The issuing officer has noted the vehicle was not parked within a marked parking bay.﻿\"\n\nPhil was disappointed with the response.\n\nHe said he couldn't have been expected to know the spot where he parked wasn't considered a marked bay.\n\n﻿\"If this isn't a parking space, which I'd argue it definitely is, there are no signs to show it,\" he said.\n\n\"It clearly has a white line to show it's a bay.\"﻿\n\nREAD MORE: More than a million Aussies in line for major superannuation boost\n\nPhil argued that the two while lines bordering the no parking zone and the pedestrian crossing marked a bay. (Supplied)\n\nPhil must now pay the $140 or take the matter to court.\n\nRandwick City Council did not respond to nine.com.au's request for comment.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/national/roblox-what-is-it-how-to-keep-children-safe-online-gaming-platform/7a0c62a6-08bb-4ca5-b665-9429b644a3fe",
    "title": "What is Roblox and should you let your kids use it?",
    "publish_date": "Wed, 11 Feb 2026 18:52:19 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "It's one of the world's biggest phenomena among school-age children, and the online safety watchdog has just put it on notice . So what do parents need to know about Roblox?\n\nThe online gaming platform was released in 2006 and has become a huge hit among under-16s in particular, comparable to global fads like Fortnite.\n\nOn Roblox, people can create and share their own games, and play them with friends - or total strangers.\n\nThere are fears children are being endangered on the online platform Roblox. (AdobeStock)\n\nThere is also a social media aspect to the platform, ﻿including a chat feature.\n\nWhile Roblox is yet to be caught up in Australia's social media ban, it has put in place safety measures that are meant to prevent contact between adults on the platform and under-16s.\n\nHowever, the eSafety Commissioner has now said those measures will be tested, amid growing concerns of child exploitation on the platform.﻿\n\nCommunications Minister Anika Wells is also seeking a meeting with Roblox representatives, with her office confirming the company had agreed.﻿\n\nCommunications Minister Anika Wells is arranging a meeting with Roblox representatives. (Alex Ellinghausen)\n\nWhat's the danger?﻿\n\nThere are fears that adult predators may be turning to sites like Roblox to target victims.﻿\n\nLeading digital researcher and futurist Dr Jo Orlando said parents needed to understand the gargantuan scale of the Roblox phenomenon.\n\n\"﻿Millions of kids around the world are on this every day,\" she said.\n\nRoblox allows users to create their own games and interact with one another. (AP)\n\nRoblox is hugely popular with children around the world. (Getty)\n\nShe said there did appear to be an increase in the attention being paid to grooming and exploitation online, but that it had been an \"ongoing problem\"﻿ in the community.\n\nThe social media ban has had its own impact, concentrating young users onto fewer sites.\n\n\"Groomers approach as friends. You know, they'll send a message saying 'hi, you seem cool',\" she said.\n\n\"It doesn't seem like a threat to a kid﻿, and that's step one for the groomers.\"\n\nREAD MORE: Grisly discovery in search for missing backpacker in Tasmanian bush\n\nParents need to be hands-on when it comes to monitoring online safety. (Getty)\n\nShe said Roblox's chat barricades between adults and children had been a good idea, but \"on the ground\" it simply wasn't working as intended.\n\nOrlando said parents needed to be aware of what their children were doing and who they were speaking with online, especially on Roblox, due to the huge and sprawling nature of the concept.\n\n\"Roblox is a bit of a free-for-all,\" she said.\n\n\"You need to know what's going on, you need to be more hands-on as a parent. You can't keep it in the background.\"\n\nThe simplest way for parents to check their children's safety was to read their messages after logging off, if they suspected something was wrong, Orlando said.\n\nChanges in behaviour, increased time on their device, secretive behaviour, and even risque talk could all indicate﻿ potential danger.\n\nPredators will approach children as friends before escalating. (Getty)\n\nOrlando said the next step for any parent was simple - report the matter to police.﻿\n\n\"They are on it very quickly, they are great,\" she said.﻿\n\nShe said that even if any messaging or behaviour had only changed recently, there may have been weeks or months of prior grooming leading up to it.﻿\n\nLeading expert Professor Nicola Henry from RMIT University said image-based abuse facilitated by AI followed a recognisable pattern.\n\n\"First, they make you feel special - like you can trust them,\" Henry said.\n\n\"Then they make you feel like you don't want to tell anyone about them.\n\n\"The conversations often become sexual or deeply personal very quickly.\n\n\"Then things change - fast.\"\n\nWhat's being done?\n\nWells said Roblox was being \"put on notice\" by the government ahead of their meeting.\n\n\"The reports we've been hearing about children being exposed to graphic content on Roblox and predators actively using the platform to groom young people are horrendous,\" she said.\n\n\"Something must be done – now.\n\n\"Australian parents and children expect more from Roblox. They can and must do more to protect kids, and when we meet I'll be asking how they propose to do that.﻿\"﻿\n\nMeanwhile﻿, The Daniel Morcombe Foundation yesterday launched two new resources to support schools, families and young people to recognise, react and report abuse.\n\nDenise Morcombe said she was not a fan of Roblox. (9News)\n\nThe films and accompanying guides were designed to be delivered in the classroom.\n\nVictim-survivors and young people were consulted in scripting and production, as well as educators and experts, to ensure the films were realistic and respectful.\n\nBruce and Denise Morcombe addressed the fears around Roblox when they spoke at the launch.\n\n\"If anybody's children are using it, just please watch what your children are doing, and just make sure they're not talking to different people that they don't know,\" Denise Morcombe said.\n\nRoblox has defended its child safety measures, saying the protection of users was a major priority.﻿\n\n\"Roblox has robust safety policies and processes to help protect users that go beyond many other platforms, and advanced safeguards that monitor for harmful content and communications,\" a spokesperson said.\n\n\"We have filters designed to block the sharing of personal information, our chat features don't allow user-to-user image or video sharing, and we recently rolled out age checks globally to limit kids and teens to only chatting with others of similar age by default.\n\n\"We also work closely with Australian law enforcement to support their investigations. While no system is perfect, our commitment to safety never ends, and we continue to strengthen protections to help keep users safe.\"\n\nTech expert Trevor Long said Roblox had gone a lot further than many other platforms, putting in place \"industry-leading\" protections.﻿\n\nBut, he said, \"they're not doing enough to stop kids seeing content they shouldn't see\".﻿\n\n\"The most important thing is educating parents that Roblox is not a kid's game. It's not. It looks like a cartoon,\" he told Today .\n\n\"When you see all the vision that we're showing of Roblox, you think it's a fun, cartoony game. It can be. But there's also other things that happen within Roblox that are not really kid-friendly gaming.﻿\"",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.9news.com.au/national/federal-politics-superannuation-tax-changes/65f1d495-0758-4105-b2bb-4d4e11cee28f",
    "title": "More than a million Aussies on verge of major superannuation boost",
    "publish_date": "Wed, 11 Feb 2026 01:55:17 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "The federal government is taking a second crack at reforming superannuation in a move that would give more than a million low earners a retirement boost while hitting the nation's wealthiest with a higher tax rate.\n\nTreasurer Jim Chalmers this morning introduced the Better Targeted Superannuation Concessions bill to parliament.\n\nIf passed, the new laws would change how superannuation is taxed for two groups of Australians at opposite ends of the wealth spectrum: about 90,000 people with the highest super balances, and roughly 1.3 million of the nation's lowest-paid workers.\n\nThe government is attempting to pass major changes to the superannuation system for the second time. (Louie Douvis/AFR)\n\nFor the latter, the government is hoping to expand the threshold for the low-income superannuation tax offset (LISTO).\n\nIn its current form, the LISTO offsets the tax paid on superannuation for anyone earning less than $37,000 a year, effectively ensuring super is still tax-effective for Australians on low incomes.\n\nUnder the proposed new law, the threshold for the offset will be raised to the top of the second income tax bracket – which currently sits at $45,000 – covering an additional 1.3 million workers.\n\nAccording to the Association of Superannuation Funds of Australia (ASFA), that change will deliver someone on $44,000 a year close to an extra $50,000 in their super balance by the time they retire.\n\nTreasurer Jim Chalmers introduced the new laws to parliament this morning. (Alex Ellinghausen)\n\n\"Our reforms to the low-income superannuation tax offset will help deliver a more secure retirement for more than a million Australians, mainly young people and women,\" Chalmers said.\n\n\"These changes will help make the super system fairer from top to bottom.\"\n\nAlongside the higher LISTO offset, the bill also increases the tax rate on superannuation earnings for accounts with more than $3 million.\n\nThis will impact the top 0.3 per cent of super account holders – a total of about 90,000 people.\n\nInstead of the current flat concessional tax rate of 15 per cent, the bill proposes raising the tax rate on earnings for super accounts with a balance of between $3 million and $10 million to 30 per cent, and to 40 per cent for accounts worth more than $10 million.\n\nThe increased tax rates won't apply to an account's entire earnings – only to the proportion of the balance over each of the new thresholds.\n\nThe government says about 14 times as many people will benefit from the higher LISTO threshold than those who will pay a higher tax rate on their superannuation earnings. (Glenn Hunt/Fairfax Media)\n\nCombined, the changes will generate about $1.6 billion in extra tax revenue for the federal budget per year.\n\nThe introduction of today's bill comes after an aborted attempt to pass similar legislation during the last parliament and following May's federal election, when the government faced significant criticism , particularly on the proposal to tax unrealised gains and a refusal to index the thresholds for the higher tax rates.\n\nBoth of those elements of the laws have since been scrapped – the current bill only includes a higher tax for realised earnings, and the $3 million and $10 million thresholds will be indexed.\n\nDespite the changes, the passage of the current bill is uncertain. The Coalition opposes the changes, meaning the government will require support from the Greens to get the laws through the Senate.\n\nMORE TAX CHANGES: $23 billion break could be overhauled in matter of months ﻿\n\nAccording to the Australian Financial Review , the minor party could demand more stringent measures targeting wealthy accounts in exchange for its backing.\n\nHowever, ASFA has encouraged the Greens and opposition to back the legislation.\n\n\"Together, these changes make super tax settings fairer and more sustainable,\" chief executive Mary Delahunty said.\n\n\"I encourage the parliament to pass the legislation without delay.\n\n\"Aussie workers on low incomes cannot wait another day for the fairness that this package delivers to them.\"\n\nIf passed, the higher tax rates on wealthy accounts will come into effect on July 1, while the LISTO boost will follow a year later.",
    "source": "9News",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-12/warrnambool-pub-fined-150000-for-gambling-regulation-breaches/106334576",
    "title": "Victorian pub fined $150k for gambling licence breaches",
    "publish_date": "Thu, 12 Feb 2026 02:33:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "A south-west Victorian pub has been fined $150,000 for multiple breaches of gambling regulations, which included failing to assist patrons in distress and staff members playing poker machines while on the clock.\n\nThe Victorian Gambling and Casino Control Commission said inspectors visited the Flying Horse Bar and Brewery in Warrnambool twice in February 2024 and found four different types of breaches of the Gambling Regulation Act.\n\nThese included failing to have a licensed gambling industry employee rostered on at the venue on 12 occasions, and failing to keep an unclaimed winnings register with a record of unclaimed money.\n\nThe bar breached multiple gambling regulations in Feburary 2024. (ABC News: Giulio Saggin)\n\nThe commission said the venue failed to keep CCTV footage of the gaming area for 28 days and failed to maintain a CCTV system that recorded the gaming area continuously, as required by law.\n\nThe inspectors also discovered the bar had numerous breaches of its own code of conduct.\n\nThis included three instances of failing to interact with a patron showing signs of distress that may have related to gambling harm.\n\nThe commission said inspectors found a venue staff member playing two poker machines using residual credits while working, and the bar did not have a responsible gambling officer in the poker machine area while the machines were open to the public on 22 occasions.\n\nLargest fine\n\nCommission chief executive Suzy Neilan said the fine was the largest issued to a club or hotel for these types of offences.\n\n\"The severity of this fine reflects the seriousness of the venue's shortcomings,\" she said.\n\n\"Venue staff play an important role in protecting people from potentially experiencing gambling harm and all employees must take this responsibility seriously.\"\n\nIn August 2025, the venue pleaded guilty to four charges of allowing minors to enter the gaming room and was fined $6,000 by the Warrnambool Magistrates Court.\n\nThe Flying Horse Bar and Brewery has been approached for comment.\n\nThe commission said it acknowledged the business had co-operated with the investigation and had since made changes, including training of staff, installation of continuous CCTV in the gaming machine area, and introducing an unclaimed winnings register.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-12/winter-olympics-2026-daily-guide-matt-graham/106330602",
    "title": "Winter Olympics 2026 quick guide: What to watch",
    "publish_date": "Thu, 12 Feb 2026 02:00:41 +0000",
    "category": "sports",
    "authors": [],
    "text": "What's on?\n\nAussie freestyle skier Matt Graham will compete for a gold medal at 10:15pm AEDT in the men's moguls finals .\n\nwill compete for a gold medal at in the . Then at 11pm AEDT there's gold up for grabs in the 10km women's cross-country skiing event, including Phoebe Cridland, Ellen Søhol Lie, Rosie Fordham and Maddie Hooker .\n\nthere's gold up for grabs in the event, including . At 11:45pm AEDT, there's men's snowboard cross, featuring Australians Jarryd Hughes, Adam Lambert and James Johnstone. If they can progress, there are quarterfinals at 12:18am AEDT, followed by semis at 12:39am AEDT, and the finals from 12:56am AEDT.\n\nStay across the action\n\nGet the latest: Winter Olympics day five: James and Guseli progress, Anthony crashes out in final Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nOtherwise, you can stream the games live on 9 Now or Stan Sport.\n\nGive me more",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-12/scotty-james-valentino-guseli-snowboard-halfpipe-qualification/106333268",
    "title": "Qualifying started 'like a final' — the actual final will be 'the biggest show ever'",
    "publish_date": "Thu, 12 Feb 2026 01:30:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "The crowd at the Livigno snow park could barely believe what they were seeing.\n\nA sport in which the extraordinary is made to look ordinary was being taken to an even more ridiculous level.\n\nThe athleticism and acrobatics unfolding above them in the cavernous Livigno halfpipe — positively glowing under the floodlights and sparkling light snowfall — were blowing their minds.\n\nGet the latest: Winter Olympics day five: James and Guseli progress, Anthony crashes out in final Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nRider after rider was dropping in and pulling off some of the most staggering snowboarding ever seen at an Olympic Games.\n\nAnd it was only the first round of qualifying.\n\n\"Those qualies were like a final,\" a beaming Valentino Guseli said.\n\n\"Finals are just going to be insane. It's going to be the biggest show ever.\"\n\nValentino Guseli is flying the flag for Australia with Scotty James. (Getty Images: Anadolu/Mine Kasapoglu)\n\nSituated on a snowy plateau above the snow park, the halfpipe has loomed over everything at these Games.\n\nThe striking, luminous tube that dominates the view up the mountain when entering this multi-discipline venue is set to be the scene of one of the most anticipated events of the competition.\n\nGetting up to the halfpipe was an ordeal in itself, with spectators traipsing up powdery snow as soft as sand dunes, many breathing the frigid air in increasingly ragged gasps.\n\nBut my goodness, was it worth the adventure when they got there!\n\nRuka Hirano laid down a marker, and the big favourites were only happy to oblige. (Getty Images: PA Images/David Davies)\n\nRuka Hirano dropped in first and delivered a phenomenal first run to score 80.50.\n\nBut that was the first of a series of simply astonishing runs that just got better and bigger and more technical over the next nine competitors.\n\nRemarkably, the 2020 Winter Youth Olympic champion ended the first run in ninth spot, such was the level.\n\nThe scores kept rolling in.\n\nWorld number one Yuto Totsuka delivered 85.50. American Alessandro Barbieri, an 88.50. Defending champion Ayumu Hirano 83.00.\n\nThen it was Guseli's turn.\n\nValentino Guseli says the final is going to be incredible. (Getty Images: David Ramos)\n\n\"I did the triple tonight, which is good to kind of get it out of the way,\" he said, pointing out that he hadn't attempted a triple in almost two years in competition, such was the level of this qualifying round.\n\nBut he also showed some of his trademark amplitude with a massive backside alley-oop 360 nose grab off his first hit that drew praise from a significant admirer in snowboard legend Shaun White.\n\n\"He complimented me on my first hit in my run,\" Guseli said.\n\n\"Which is like, if you get a compliment regarding amplitude from Shaun White, then you're doing something right, I guess.\n\n\"So I was pretty happy about that.\"\n\nThe level barely dropped.\n\nCampbell Melville Ives — the precocious New Zealand talent who some are tipping to challenge Scotty James and Guseli for Southern Hemisphere, and world supremacy — put down an outrageously flamboyant run of 84.75, an all-or-nothing effort that will either win him a medal or require him to be placed on ice.\n\nScotty James wows the crowd in the halfpipe. (Getty Images: Adam Pretty)\n\nThen it was James' turn.\n\nHe told media afterwards that he was aware that something was going down in the pipe while he was waiting.\n\n\"Honestly, I was listening to it,\" James said.\n\n\"I was in the back, so I could hear it, but yeah, unbelievable riding from everyone.\n\n\"The Japanese, of course, Valentino amazing, Cam from New Zealand rode well.\n\n\"The whole field was pushing it, so I kind of was staying there thinking, 'If I want to go where I want to go position-wise, I need to turn the dial up a bit.'\"\n\nScotty James could hear the roar of the crowd and knew there was something special happening. (Getty Images: David Ramos)\n\nSay no more.\n\nJames comes into this, his fifth Olympic Games, as the favourite for gold. A slim favourite for sure, but someone that the vast majority in the sport would love to see win the one thing that has eluded him for his career so far.\n\nAnd, wanting to qualify in as good a place as possible to ensure he starts last in Saturday's AEDT final, he dropped a magnificent run.\n\n\"I put my best foot forward to try and qualify first,\" James said.\n\n\"I feel like being in that position in the finals is a really good place to be; you can be a little bit more mindful and strategic in the approach when it comes to the competition on Friday.\n\n\"So, that was our plan as a team and a group, and I was able to do that.\n\n\"I've pushed it a little bit more in qualis than I usually would with the switchback 14.\n\n\"I was really happy to execute it all and put it together.\n\n\"It's going to be exciting on Friday,\" he added with a grin.\n\nScotty James is in good form, and ready to roll in the halfpipe final. (Getty Images: David Ramos)\n\nIf the qualifiers showed anything it was exactly that.\n\nJames believes that any of the top six could end up winning gold, saying that, in his opinion, halfpipe riding is at its most competitive level ever.\n\nHe acknowledged that if he is to claim that elusive gold medal, he is going to need to bring it all to the table and, although he was charmingly evasive about whether he had too much more up his \"wizard sleeve\" to show, he knows that others will, and whatever happens, he'll need to be at his best.\n\n\"It's the finals. We've got to bring something special, and that's what I plan to do,\" he said.\n\nSo, to the final. The hottest ticket at these Games.\n\nRumours are that chief Olympic cheerleader Snoop Dogg himself will be making an appearance at the pipe in what is sure to be an absolutely jam-packed Livigno snow park for the Games' blue riband event.\n\nRegardless of who is there, there is no question that James' date with destiny will stir emotions among those watching like no other event at these Olympics.\n\nGuseli said James is the favourite for gold and the man to beat, but the Japanese quartet will no doubt be bringing their A game too.\n\n\"Yeah, pretty much,\" the 20-year-old said.\n\n\"I think for the first time in quite a long time in halfpipe it almost could be anyone's day.\n\n\"But Scotty's got some stuff that's pretty insane and pretty hard to beat.\n\nWorld number one Yuto Totsuka possibly has more in his locker. (Getty Images: Cameron Spencer)\n\n\"I know if I do my best stuff, then I could potentially be up there, but yeah, I'll have to do some pretty good riding, I think.\n\n\"The Japanese guys have way more… I don't know.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's going to be crazy, and it's hard to speculate on.\n\n\"But I think all you can do is watch and see what happens and enjoy the show.\"\n\nAs for James. He knows exactly what it's going to take.\n\n\"Look, Friday, I'm going to try and pull off the best run of my life,\" he said.\n\n\"And I think that's what it's going to take to win.\n\n\"So let's see how we go.\"\n\nThe men's snowboard halfpipe final gets underway on Saturday at 5:15am AEDT.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-12/albemarle-kemerton-lithium-refinery-shut-down/106334822",
    "title": "Hundreds of jobs set to be lost as WA lithium refinery shuts down",
    "publish_date": "Thu, 12 Feb 2026 01:27:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "About 275 jobs look set to be lost following US chemicals giant Albemarle's announcement of the immediate closure of its lithium refinery at Kemerton, in Western Australia's South West region.\n\nThe company said recent lithium price rises had not been enough to offset operating costs amid an extended period of \"price volatility\".\n\n\"Idling operations at Kemerton was a difficult decision,\" Albemarle chair and chief executive Kent Masters said.\n\n\" It follows significant actions we have taken over the past two and a half years to reduce operating costs during an extended period of price volatility in the market. \"\n\nAlbemarle left this office in Bunbury in 2024 when it axed its Kemerton expansion project. (ABC South West WA: Bridget McArthur)\n\nThe multi-billion-dollar Kemerton refinery, 160 kilometres south, of Perth opened in 2022.\n\nIt processes spodumene from the world's biggest hard-rock lithium mine at the nearby town of Greenbushes.\n\nOvernight Albemarle told the New York Stock Exchange its Train 1 processing line would be shut down immediately, which followed a 2024 decision to mothball Train 2 and halt the construction of additional processing lines.\n\nThe company said the decision would not impact its projected production volumes for 2026 and that customer demand would be met through alternative operations.\n\nEnergy costs blamed\n\nMining commentator Tim Treadgold said the shutdown was widely anticipated.\n\n\"Sadly, it was predictable because the projects, any processing projects we have in Australia, have become uncompetitive,\" he said.\n\n\" We've got a very high-cost energy system in Australia and we simply can't process the minerals at a price competing, say, with China, which has very low-cost energy. \"\n\nMr Treadgold said Australia's mining sector remained strong but rising power prices were making it increasingly difficult to support downstream processing.\n\n\"We can still export the ore, but we can't do the processing,\" he said.\n\nMr Treadgold warned that Albemarle's decision could signal broader challenges for the state's lithium-refining ambitions unless energy costs fell.\n\n\"Until we can get energy costs down, I think that might be the case,\" he said.\n\n\"It's just such a basic issue that we've gone down the road of driving energy prices higher in the belief that eventually renewables will be able to compete with coal and uranium and nuclear power and things like that.\"\n\nHundreds of positions look set to be lost due to the shutdown. (ABC South West WA: Bridget McArthur)\n\nOriginally designed as a four-train facility capable of producing about 100,000 tonnes of lithium hydroxide each year, the refinery was expected to play a key role in developing a downstream battery materials industry in WA.\n\nWA Shadow Minister for Energy Steve Thomas said the closure would be a blow for the South West and the workers employed.\n\n\"It comes as no surprise that operations at the Kemerton refinery are stopping, but I want to express my sympathies to the workers and their families who are affected by this closure,\" he said.\n\n\"The lithium industry has been suffering from low prices, which have dropped dramatically since 2022 thanks to oversupply in the market and a slower-than-expected take-up of electric vehicles.\n\n\"This has made the viability of all lithium projects problematic.\"\n\nDr Thomas said he hoped improved market conditions would eventually support a restart.\n\n\"I hope that a correction to the lithium market and stable energy prices will one day see lithium hydroxide being produced in Kemerton in the future,\" he said.\n\nWA cabinet minister John Carey said the news was disappointing, and the government was committed to supporting the critical minerals industry.\n\nJohn Carey says the news about Albemarle closing its South West refinery is \"disappointing\". (ABC News: Kennith Png)\n\n\"I think we need to assess why this particular scenario occurred … the first instance is to ensure that we provide the critical support for workers that have been given this news,\" he said.\n\n\"We know there are still market fluctuations, including in this sector, so we don't underestimate the current challenging times.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-12/winter-olympics-2026-day-five-quick-hits-vonn-helmet/106334002",
    "title": "Quick hits: Banned helmets, successful surgery and maple syrup power",
    "publish_date": "Wed, 11 Feb 2026 23:37:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "A Ukrainian athlete is refusing to back down over a controversial helmet featuring the dead, Lindsey Vonn has a third surgery, and maple syrup has powered Ryan Cochran-Siegle to another medal.\n\nHere are the quick hits from the Winter Olympics.\n\n1. Banned helmet featuring dead Ukrainians worn again\n\nA stand-off between the International Olympic Committee and Ukrainian skeleton athlete Vladyslav Heraskevych over the wearing of a banned helmet has not ended.\n\nVladyslav Heraskevych continues to wear a helmet with the faces of people killed in the Ukraine-Russia war. (AP: Steve Moore)\n\nEarlier this week, Heraskevych wore a customised helmet featuring the faces of Ukrainian athletes and coaches who have been killed during his country's war with Russia.\n\nThe IOC banned the wearing of that helmet on Monday, but on Wednesday, one day out from the start of his competition, Heraskevych again wore the helmet during a training run.\n\nOn Wednesday, IOC spokesperson Mark Adams said Heraskevych had \"many opportunities\" to express himself, but the field of play at the Olympics was not one of them.\n\n\"It's not the message, it's the place that counts,' Adams said.\n\n\"There are 130 conflicts going on in the world. We cannot have 130 different conflicts feature, no matter how terrible they are.\"\n\nLoading Instagram content\n\nHowever, Heraskevych does not appear to be backing down.\n\nA video of Adams's Wednesday press conference was uploaded to social media by BBC Sport, and Heraskevych was in the comments.\n\n\"It's becoming obvious from looking at the last few days that we're being treated completely differently, and for some reason what's allowed for other athletes isn't allowed for us,' the Ukrainian wrote.\n\n\"This helmet doesn't violate IOC rules — unlike, for example, the Russian flag on the helmet of the Italian athlete.\"\n\nThe Italian athlete Heraskevych is referring to is Roland Fischnaller, who wore a helmet with the flags of each country that has hosted the seven Olympic Games he has competed in.\n\nThat includes Russia, which hosted the Games in 2014. Russia is banned from the Olympic Games, and any Russian athletes competing do so under a neutral flag.\n\nWhether Heraskevych is allowed to compete or not will be one of the main focuses on day six of the Games.\n\n2. Lindsey Vonn says 'I know I'll be ok' after third surgery\n\nAmerican ski legend Lindsey Vonn says her third surgery since a horrific fall ended her Olympic campaign \"was successful\".\n\nVonn set for multiple surgeries, denies torn ACL contributed to crash American ski great Lindsey Vonn will \"require multiple surgeries\" after sustaining a tibia fracture, but denies that her previously ruptured ACL was the cause of the crash that ended her Winter Olympic Games.\n\nVonn took to social media on Thursday morning, AEDT, to announce the successful surgery and that her recovery is progressing well.\n\nShe posted two photographs of herself lying in hospital, along with a tremendous set of flowers.\n\nThe 41-year-old was airlifted to hospital on the second day of the Games, when she crashed just 13 seconds into her downhill run.\n\nShe suffered a \"complex tibia fracture\" and has now gone under the knife three times.\n\n\"Success today has a completely different meaning than it did a few days ago,\" Vonn wrote.\n\n\"I'm making progress and while it is slow, I know I'll be ok.\n\n\"Thankful for all of the incredible medical staff, friends, family, who have been by my side and the beautiful outpouring of love and support from people around the world.\"\n\nVonn's participation in these Games was one of the most keenly anticipated.\n\nAfter coming out of retirement in 2024, following a six-year hiatus, Vonn had claimed victories and podiums in downhill and Super G World Cup events.\n\nRanked number one in the world in downhill, the American ruptured her ACL just nine days before the start of the Games, but decided to compete.\n\n3. Italy enjoys one of its greatest luge days\n\nItalian lugers enjoyed the greatest day of their long Olympic history on Wednesday, winning gold in both men's and women's doubles hugely against the odds as the time they had put in to learn every inch of their new Cortina track paid off spectacularly.\n\nItaly's gold medallists Andrea Voetter and Marion Oberhofer celebrate as they arrive at the finish. (AP: Aijaz Rahi)\n\nAndrea Voetter and Marion Oberhofer got things going with two silky runs to become the inaugural women's doubles champions.\n\nThings got even better when Emanuel Rieder and Simon Kainzwaldner, not even the country's top pair, surged through to win the men's doubles after a late mistake robbed the United States of what had looked to be a certain first gold in the sport.\n\nVoetter and Oberhofer's victory ended Germany's iron grip on women's luge that had seen them win the last eight singles and three mixed team golds. They are the first Italian women to medal in the sport since Gerda Weissensteiner won the singles in 1994 — the last time any non-German woman took an Olympic luge gold.\n\nThere is more of a pedigree on the men's side, but it was the first men's doubles gold since 1984 and first Italian luge gold since current head coach Armin Zoeggler won his second singles title in 2006.\n\n\"It's crazy. I can't believe it, it's incredible,\" Rieder said. \"We had a good flow and a good feeling in training, but I have no words, I've lost my voice, I've been screaming too much.\"\n\nVoetter and Oberhofer came into the Games on the back of an underwhelming World Cup season but were right at home on the familiar ice with a fastest first run of 53.102 seconds.\n\nGerman pair Dajana Eitberger and Magdalena Matschina and Austria's World Cup leaders Selina Egle and Lara Kipp, piled on the pressure but had to settle for silver and bronze respectively as Voetter and Oberhofer held their nerve.\n\n\"Winning on a home track in my first Olympic Games, it's so amazing,\" Oberhofer said.\n\n\"I'm overwhelmed with emotions and we're so grateful to everyone who supported us to reach this possibility. To race here in Cortina, that's amazing.\"\n\n4. Maple syrup powering Olympic medals\n\nAmerican skier Ryan Cochran-Siegle could not hold anything down last weekend.\n\nRyan Cochran-Siegle claimed a terrific silver medal in the men's super-G, just days after suffering a stomach bug. (AP: Julia Demaree Nikhinson)\n\nThe 33-year-old was reportedly ill on the gondola before his downhill run at the Milan Cortina Games, where he placed 18th.\n\nBut with a settled tummy, his Olympic mother in the stands, and reportedly the best maple syrup around, Cochran-Siegle produced a mighty performance to claim silver in the men's super-G.\n\nCochran-Siegle's efforts on Wednesday replicated the same feat he achieved four years earlier, when he also won silver in the men's super-G in China.\n\nWednesday's silver was a mighty comeback for Cochran-Siegle, who not only added to his personal medal tally but added to his family's.\n\nHis mother, Barbara, won slalom gold in 1972.\n\nBut it is another family business which has also powered Cochran-Siegle throughout his career — maple syrup.\n\nCochran-Siegle's family runs a maple syrup business, and at least one of his teammates is convinced the syrup has led to Olympic success.\n\n\"He'll actually show up in the summer and that's what he uses as a sports drink,\" American teammate Kyle Negomir said.\n\n\"A lot of water and then a splash of syrup from his farm back home.\n\n\"That's what powers Olympic medals.\"\n\nCochran-Siegle, nor his syrup, could stop Swiss star Franjo von Allmen from making history in the super-G.\n\nVon Allmen claimed his third gold medal of these Games, after also triumphing in the men's downhill and men's team combined alpine skiing.\n\nThe Swiss athlete becomes just the third men's alpine skier to win three gold medals at a single Olympic Games, after Jean-Claude Killy of France (1968) and Austrian Anton Sailer (1956)\n\n5. Unfaithful biathlete apologises after stunning interview\n\nNorway biathlete Sturla Holm Laegreid has apologised to his teammates and his ex-girlfriend following his sensational interview after his bronze medal-winning efforts in Tuesday's Olympic men's 20km individual race, in which he revealed he had been unfaithful, saying he wanted to put the matter behind him.\n\nSturla Holm Laegreid drew plenty of attention after opening up about his infidelity at the Games. (Reuters: Matthew Childs)\n\nNews of Laegreid's cheating on his girlfriend swiftly eclipsed teammate Johan-Olav Botn's gold-medal performance in that race, with the tearful 28-year-old admitting to Norwegian state broadcaster NRK that he had told his ex-girlfriend about what he called his \"mistake\" a week ago, and that she had swiftly ended the relationship.\n\nThe story quickly made its way around the world and Laegreid was heavily criticised in Norwegian media for both his revelation and for stealing the limelight from Botn, as well as for casting his ex-girlfriend, who has asked to remain anonymous, into the media spotlight.\n\n\"I deeply regret that I brought up this personal story on what was a day of celebration for Norwegian biathlon. I am not quite myself today, and I am not thinking clearly. My apologies go to Johan-Olav, who deserved all the attention after the gold,\" Lagreid said in a statement released by the Norwegian Olympic Committee.\n\n\"It also goes to my ex-girlfriend, who involuntarily ended up in the media spotlight. I hope she is doing well. I cannot change this but I will now put this behind me and focus on the Olympics. I will not answer any further questions about this.\"\n\nABC/wires",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-12/south-africa-afghanistan-t20-world-cup-double-super-over/106334290",
    "title": "South Africa beats Afghanistan after chaotic World Cup double super over",
    "publish_date": "Wed, 11 Feb 2026 23:12:38 +0000",
    "category": "sports",
    "authors": [],
    "text": "South Africa has survived Kagiso Rabada's final-over meltdown against Afghanistan and double super over drama before prevailing in a heart-stopping Twenty20 World Cup group clash.\n\nIn a remarkable match of fluctuating fortunes, the African team appeared to be in the box seat after half-centuries from Ryan Rickelton (61) and Quinton de Kock (59) powered them to a commanding 6-187.\n\nOpener Rahmanullah Gurbaz ‌smashed 84 off 42 balls in Afghanistan's spirited reply before his side were all out for 187 with two deliveries left in their innings.\n\nAfghanistan milked 17 runs from the first super over sent down by Proteas seamer Lungi Ngidi.\n\nThis time, South Africa ‌tied the score with Tristan Stubbs hitting the final delivery from Azmatullah Omarzai for a six.\n\nIn the second ⁠super over, Afghanistan scored 19 before losing both wickets in reply to South ‌Africa's 23, thanks to David Miller and Stubbs.\n\n\"I've lost so much weight today. Never been that stressed in my life ‌in a cricket game,\" player of the match Ngidi said afterwards.\n\nNew Zealand and South Africa remain on course to advance to the Super Eight from this group after winning two in two. Afghanistan, having lost to both of them, is staring at elimination from the tournament.\n\nAustralia cruises to victory over Ireland Australia beats Ireland by 67 runs to win its first game at the T20 World Cup, after captain Mitch Marsh was a late out due to testicular bleeding.\n\nOn a day of relentless drama, South Africa appeared to be in control ‌heading into the final over of the chase with Afghanistan needing 13 runs with just one wicket in hand.\n\nBut Rabada bowled two no-balls and a wide before managing to run out Fazalhaq Farooqi, ⁠with the scores level.\n\nThere was no dearth of drama even ‌in the second super over.\n\nChasing 24 for ‌victory, Afghanistan lost Mohammad Nabi to the second ball without a run being scored.\n\nGurbaz walked in and smacked spinner Keshav Maharaj ‌for three sixes in a row to inject fresh excitement into a contest that already had the crowd at the Narendra Modi Stadium on the edge of their seats.\n\nRahmanullah Gurbaz top-scored for the match but could not get his team over the line in the second super over. (Getty Images: Surjeet Yadav/ICC)\n\nThe fourth sixth did ‌not materialise, though, and Gurbaz was caught ⁠at point to end a lion-hearted display in a must-win contest.\n\n\"So, so unlucky to end on the losing side,\" Afghanistan captain Rashid Khan said.\n\n\"We gave everything on the ground, but we did not get the right result.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"We had our opportunity, even in the last super over as well, but I ⁠think there are a lot of things to learn from here, and we'll only get better.\"\n\nSouth Africa captain Aiden Markram was visibly drained after a drama-filled day.\n\n\"It's ‌quite hard to sum ‌all that up,\" he said.\n\n\"It's a tough competition, and teams put you under immense pressure.\n\n\"A couple of lessons that we can learn. We were not at our best in a few areas; there's room for improvement.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-12/temporary-migrant-worker-threat-workplace-harrassment/106310972",
    "title": "Case of rapist Broome publican highlights dangers facing town's vulnerable workforce",
    "publish_date": "Wed, 11 Feb 2026 23:00:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "The case of a Broome pub manager who raped and sexually assaulted multiple members of his staff highlights the vulnerable position migrant workers often find themselves in, advocates say.\n\nFormer Roebuck Bay Hotel manager Stewart Burchell was jailed for six years last month, after being found guilty of raping a female staff member and indecently assaulting several other women who worked at the pub.\n\n\"Women are still fearful of speaking up against unwanted harassment in the workplace, even when the conduct amounts to criminal conduct,\" Judge Belinda Lonsdale said while sentencing Burchell.\n\nThe woman the 52-year-old former manager raped was a temporary migrant, reliant on a workplace visa to legally remain in Australia.\n\nIt is a common arrangement across Broome, where the town's tourism and hospitality sectors are underpinned by a largely migrant workforce.\n\nBut what happens when an employer takes advantage of this?\n\nMigrant workers are able to remain in Australia to fight an active workplace claim for up to 12 months. (ABC Kimberley: Andrew Seabourne/File photo)\n\n\"Your conduct amounted to persistent sexual harassment of women in your employment, which included you indecently assaulting them,\" Judge Lonsdale said during sentencing.\n\n\" They were vulnerable as you were able to determine whether or not they remained in employment. \"\n\nMigrant advocates said this was far from an isolated incident.\n\nTreated as 'disposable'\n\nMigrant Justice Institute director Laurie Berg said temporary migrants were scared to come forward because they could lose their employment.\n\nShe said they were vulnerable and felt they must \"accept unacceptable conduct\".\n\n\"They're not familiar with the local context, may not have a lot of support and be on a visa where they might need work in order to stay,\" Ms Berg said.\n\n\"I think a lot of employers take advantage of that and push the envelope when it comes to mistreatment.\n\n\"In some cases, there's really severe criminal misconduct because they feel confident the backpacker is not going to complain or take any action.\"\n\nLaurie Berg says employers need to be held accountable. (ABC News: John Gunn)\n\nMs Berg said only one in 10 migrant workers took action when discovering they were underpaid, with even fewer progressing to the Fair Work Ombudsman or any formal legal complaint.\n\nShe said this figure could be lower in matters of sexual harassment.\n\n\"We need to truly hold employers to account and dispel this notion that temporary visa holders are disposable and going to leave, and this will never see the light of day,\" Ms Berg said.\n\nPilot program ending\n\nMigrant workers are able to remain in Australia and fight an active workplace claim for up to 12 months, under the Workplace Justice Visa (WJV).\n\nHowever, this visa was only a pilot program, rolled out two years ago and set to end in July.\n\nA Workplace Justice Visa temporarily allows people to extend their stay in Australia to pursue a workplace exploitation claim. (ABC News: Keira Proust)\n\nAccording to Ms Berg, the program is limited in scope and more accessible for people in Melbourne and Sydney.\n\nA Department of Home Affairs spokesperson said the department \"regularly engage and receive feedback from accredited third parties and other interested stakeholders\" about the WJV.\n\n\"This information, together with an assessment of immigration integrity risks, informs advice to government,\" they said.\n\n\"Migrant workers are entitled to protections of the Fair Work Act 2009, regardless of their migration status.\"\n\nThere are currently 18 accredited third parties to certify migrants requesting a WJV.\n\nThese include community legal centres, a migrant worker centre, unions and the Fair Work Ombudsman, and of these nine have a national footprint, according to the Department of Home Affairs.\n\nKnow your rights\n\nFair Work Ombudsman Anna Booth said it was crucial visa holders knew they had the same workplace rights and protections as other employees.\n\n\"We know workplace breaches that involve migrant workers can be particularly serious, as these workers can be vulnerable to exploitation,\" she said.\n\n\"We find they are often unaware of their workplace rights or unwilling to speak up if something seems wrong.\"\n\nAnna Booth says migrant workers are vulnerable to exploitation. (ABC News: Billy Cooper)\n\nMs Booth said Fair Work had the power to start court proceedings for \"alleged breached of law prohibiting sexual harassment\".\n\nDetails about where to get support and how to make a complaint are available on the Fair Work website.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/israeli-president-isaac-herzog-arrives-in-melbourne-20260212-p5o1sc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Israeli President Isaac Herzog arrives in Melbourne",
    "publish_date": "Thu, 12 Feb 2026 13:40:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/politics/federal/don-t-accuse-me-of-gaslighting-australians-bullock-to-canavan-20260212-p5o1qi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Don’t accuse me of gaslighting Australians: Bullock to Canavan",
    "publish_date": "Thu, 12 Feb 2026 13:39:34 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Advertisement\n\nPoliticsFederalRBA Don’t accuse me of gaslighting Australians: Bullock to Canavan Shane Wright February 12, 2026 — 1:39pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nReserve Bank governor Michele Bullock has angrily pushed back at accusations from a Coalition senator that she is gaslighting Australians. Bullock, usually calm and reserved during parliamentary hearings, responded sharply after Nationals’ senator Matt Canavan – a trained economist – used different measures of wage growth to suggest the governor was at odds with the experience of most Australians. Loading “I think people are only going to get angrier in this country if they’re gaslit into thinking the economy is okay when their lived experience is absolutely terrible right now,” he said. Bullock, who often discusses the amount of correspondence she receives from people about their living conditions and impact of the bank on their cost of living, pushed back strongly during a Senate estimates hearing into the Reserve.\n\nAdvertisement\n\n“I take exception to that comment. I am not gaslighting anyone,” she said. “I have said that there are certain aspects of the economy which are doing well, and one of them is the labour marke,t which is positive for people.” Reserve Bank governor Michele Bullock appearing before the House economics committee on Friday. Alex Ellinghausen Bullock had earlier noted that while there were a lot of complaints about the economy, she said it was doing “okay” with the jobs market a particular strong point. “But that is not to say that you can’t recognise that are some parts of the economy that are doing well, and the labour market, I think, has been a really positive thing for his country,” she said.\n\nAdvertisement\n\nThe Reserve Bank has a dual mandate, to hold inflation between 2 and 3 per cent and to have as many Australians in work as possible. Related Article Federal budget Hey big spenders: Where the budget is blowing out The jobless rate is at 4.1 per cent, among the lowest in the developed world, with 165,000 jobs created over the past year. But Canavan said he did not believe the labour market was “doing that well”, and claimed Australians’ incomes were falling. He said the economy should support “peoples’ basic ability to provide for themselves and that has gone backwards at a rate that we’ve never seen”.\n\nAdvertisement\n\nBullock, however, noted that a measure of incomes that takes into account wages, tax, interest and inflation showed incomes had grown since the pandemic. “We’re looking at a measure of what people are actually being paid. It’s not shooting the lights out either, but it is above where it was pre-COVID,” she said. The argument with Canavan followed questions from Liberal senator Jane Hume about whether government spending had contributed to the Reserve Bank’s decision to lift interest rates earlier this month. Noting she had answered questions on the issue many times, Bullock said it was spending by households and businesses that had been the key factor in the nation’s changing inflation outlook. The governor said demand across the economy was running faster than its ability to supply goods and services, which was contributing to inflation.\n\nAdvertisement\n\nPublic and private demand were both contributing, but public spending over recent months was in line with what the bank had been expecting. Related Article Interest rates One rate rise not enough to tame inflation as most home buyers well ahead on mortgages “If you look at the difference between our forecast in November and where we have inflation back into the band and you look at our forecasts now where it isn’t, the key difference is not fiscal policy. It is pretty much the same as it was in November,” she said. “The key difference is private demand.” Bullock pushed back on suggestions that the Reserve should wade into the political debate over government spending contributions to inflation.\n\nAdvertisement\n\n“We don’t believe that our job is to tell the government or the parliament what to do with fiscal policy,” she said. Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/world/brawl-erupts-in-turkish-parliament-20260212-p5o1qf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brawl erupts in Turkish parliament",
    "publish_date": "Thu, 12 Feb 2026 13:34:56 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/politics/i-am-not-gaslighting-anyone-bullocks-heated-exchange-with-canavan-20260212-p5o1qq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'I am not gaslighting anyone': Bullock's heated exchange with Canavan",
    "publish_date": "Thu, 12 Feb 2026 13:31:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "'I am not gaslighting anyone': Bullock's heated exchange with Canavan\n\nA frustrated Michele Bullock has fired back at Nationals senator Matt Canavan after his suggestion she is gaslighting Australians over the state of the economy.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/my-father-was-dying-why-didn-t-i-speak-up-20260205-p5nzv6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "My father was dying. Why didn’t I speak up?",
    "publish_date": "Thu, 12 Feb 2026 13:31:03 +1100",
    "category": "lifestyle",
    "authors": [
      "Anson Cameron"
    ],
    "text": "Advertisement\n\nLifestyleLife & relationshipsDeath Opinion My father was dying. Why didn’t I speak up? We prepare speeches for weddings, birthdays and funerals but are strangely silent as our loved ones slip away. Anson Cameron Spectrum columnist, The Age February 12, 2026 — 1:31pm\n\nFebruary 12, 2026 — 1:31pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe night Dad died is fading on me now. It happened in a bright room in a sister’s house where we rode the rollercoaster of his laboured breathing until nearly dawn. An internal tide rose, fluids seeping into each exhausted lung, bringing the death rattle on. Early in the night there was a doctor who had seen this show too many times. He gave us instructions, a nod and a wink as to what could be done. That’s the morphine, there in the fridge. That’s the suffering man. This is what might be done by loving people with morphine for a suffering man. Then he left. Photo: Robin Cowcher My elder brother was in another country, which made things harder because he’s what used to be known as “a man of action”, and I’m more a ditherer. My easy entanglement in contemplations of the possibilities usually results in what’s known as “ditherer’s stasis”. As Dad’s disease advanced, making his life progressively less endurable, he’d often say, with vague wonder: “You wouldn’t let your dog die like this, would you?” It was truly surprising to him to have to endure, stoically, even, dammit, good-naturedly, what amounted to a daily zoological demotion towards an existence as limited as a newt’s – with buckets of pain thrown in.\n\nAdvertisement\n\nAs his lungs flooded that night, his breathing became sporadically becalmed. We thought he was dead several times, and we stilled our own breathing to listen to his fresh nothingness, gripping each other’s hands and facing, for the first time, a world without him. But each time his heart started up again, and we cursed him gently for his stubbornness. Related Article Opinion\n\nSeptember 11 attacks My frequently flying friend had a gripe. If only he’d seen the news Anson Cameron Spectrum columnist, The Age About dawn his body drew the last of half-a-billion breaths, and I remember wondering what thoughts it might have fed, that ragged inhalation. Did its smattering of oxygen molecules power a fading reverie through to completion? A happy thought, I hoped. A cheering thought. A bright note on which to leave. A vision of his mum and dad, his brothers, or his kids, or of him as a limitless 17-year-old leaping on a fullback’s shoulders to mark a Sherrin, or kissing a girl for the first time, or leaning towards the Bakelite radio to hear of the Second World War’s end. Since that night I’ve regretted that I didn’t speak to him. Two sisters and I sat quietly grieving, listening to his tenuous breath. I’m now sorry I didn’t supply a monologue of happy memories, didn’t landscape his unconsciousness with the stuff that made life worthwhile – even, sporadically, wonderful. I should have talked to him.\n\nAdvertisement\n\nBut death was in the room, and death is intimidating company. Death threw me off my game. Why should something so natural, inevitable and ubiquitous be such a scold? The enormity of death stops you speaking of it in its presence – even stops you speaking in its presence. But this timidity must be overcome because the last encounter with a loved one these days is so often while they’re comatose. Why are we not prepared? It somehow didn’t occur to me that he might still be able to hear me in his coma ... and anyway, if I talked, how would I navigate the fact that this talk was the last talk? It seems rude to acknowledge to someone that they’re dying – that they’re failing you by committing this irreversible breach in your relations. We’re all reluctant to mention our friends’ failures, and death feels like abandonment, and we don’t want to accuse our friends of that. So he died in silence, though I’ve talked to him plenty since. Did he even know we were sitting there at his bedside? What a strange reaction, to let him go quietly into that good night when our voices might have sung like choirs through the chapels of his fading mind. We prepare toasts for birthdays, write heartfelt speeches for weddings, and anguish over eulogies. Why do we not think to prepare a monologue to be spoken to the dying soul we have loved? Make it part memoir, part poem, sprinkle it with ad lib fondness ... then throw in some jokes and some Shelley. Honour your moribund mate by assuming they’re as cognitively acute as ever they were – and have a natter. “Ha. You remember when we ...” Of course, had I done that, he may have thought: “God, I wish that bloody Anson would shut up so I can concentrate on what I’m doing.”\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Death\n\nOpinion\n\nFor subscribers\n\nSpectrum Anson Cameron is a columnist for Spectrum in The Age and the author of several books, including Boyhoodlum and Neil Balme: A Tale of Two Men.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/fair-work-commission-chief-says-cfmeu-behaviour-cost-30-per-cent-warrants-inquiry-20260212-p5o1s3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fair Work Commission chief says CFMEU behaviour cost 30 per cent, warrants inquiry",
    "publish_date": "Thu, 12 Feb 2026 13:28:35 +1100",
    "category": "finance",
    "authors": [],
    "text": "Fair Work Commission chief says CFMEU behaviour cost 30 per cent, warrants inquiry\n\nMurray Furlong said Victorians had a right to know what had gone wrong with their state's infrastructure projects.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-for-flat-start-wall-street-wobbles-on-jobs-report-a-jumps-20260212-p5o1kf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Banks, utilities drive ASX to record high; AMP, Temple & Webster tumble",
    "publish_date": "Thu, 12 Feb 2026 12:49:14 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Banks, utilities drive ASX to record high; AMP, Temple & Webster tumble Staff reporter Updated February 12, 2026 — 12:49pm ,first published February 12, 2026 — 5:19am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has hit a record high as investors digest a raft of results, with ANZ Bank soaring on the back of its trading update while wealth giant AMP and online retailer Temple & Webster suffered heavy falls. The S&P/ASX 200 was up 73.3 points or 0.8 per cent, to 9088.1 in early afternoon trade, with six of 11 industry sectors in positive territory, led by utilities. The ASX hit a record high in early trade. Louie Douvis ANZ Bank soared 8 per cent after it revealed in a trading update it made $1.9 billion in profits in the December quarter, with its expenses falling as a result of deep cost-cutting under new chief executive Nuno Matos, while its profit margins also moved higher. Compared with the same quarter last year, ANZ’s profits rose 6 per cent. Financial stocks have jumped in early trade, with big four rivals Commonwealth Bank jumped 4.6 per cent, Westpac rose 2.8 per cent and National Australia Bank advanced 2.4 per cent. AMP shares plunged 26.4 per cent after its results disappointed the market, with wealth manager’s full-year statutory profits falling to $133 million, from $150 million a year earlier.\n\nAdvertisement\n\nBarrenjoey analyst Andrew Adams said the company’s outlook for revenue margins was below expectations and likely to drive downgrades in analysts’ forecasts for the company’s future performance. “Capital was not as strong as expected, so it is difficult to see what supports the share price today,” Adams said. Shares in Origin Energy soared 5.2 per cent on Thursday after the electricity and gas giant lifted its profit target for one of its key divisions despite a 45 per cent plunge in first-half profit. Although Origin’s net profit sank from $1.01 billion to $557 million for the six months to December, its underlying earnings of $593 million came in higher than analysts had been forecasting amid a stronger-than-expected contributions from the company’s domestic retailing and generation division and its jointly-owned liquefied gas venture in Queensland. Energy stocks are mixed, with Woodside Energy up 1.4 per cent and Santos sliding 0.7 per cent. Spiking gold and silver prices are driving up earnings among Australia’s precious metal miners. Northern Star reported a 19 per cent rise in earnings for the half-year to December because of a 31 per cent increase in the average realised gold price. Costs increased 9 per cent but the group nonetheless recorded a 41 per cent increase in net profit after tax to $714 million. Its shares are up 5.2 per cent. South32, a major silver producer, said its earnings increased 3 per cent over the half-year, but it reported a substantial 29 per cent jump in after tax profit to $651 million. Its shares added 1.1 per cent. Iron ore miners bounced higher, with BHP up 2.5 per cent, Rio Tinto rising 2.3 per cent and Fortescue 0.5 per cent higher.\n\nAdvertisement\n\nHealthcare giant CSL tumbled 7 per cent to continue a tumultuous week marked by the sudden resignation of chief Dr Paul McKenzie on Tuesday followed by half-year results on Wednesday that fell short of market estimates and announcing $1.5 billion in writedowns. Tech shares plunged with WiseTech losing 6 per cent and Xero 7.1 per cent lower. Lendlease CEO Tony Lombardo will step down in August after the company releases its full-year results to relocate to South-East Asia for a new job. He’s worked at the company for 18 years, including the last five years in the top job. Lendlease has engaged an executive search firm to find a replacement. Its shares rose 0.4 per cent. Related Article Opinion\n\nBitcoin Fool’s gold: Trump’s bitcoin dream is turning into a nightmare Stephen Bartholomeusz Senior business columnist Market operator ASX Limited reported an 8.3 per cent rise in net profit to $263.6 million, while revenue rose 11.2 per cent, helped by growth across its four business units. The company has faced intense scrutiny and criticism from regulators lately over a series of technical bungles, with the Australian Securities and Investments Commission slapped the company with a $150 million capital charge in December. Its chief executive Helen Lofthouse this week said she would step down in May. Its shares dropped 1.5 per cent in early trade.\n\nAdvertisement\n\nTemple and Webster plunged by 28 per cent after disappointing investors with its half-year results that undershot expectations. The company reported EBITDA margins of 3.6 per cent, which fell short of market forecasts of 3.9 per cent, according to a note from Jarden analyst Aryan Norozi. Net profits of $5.8 million fell below expectations of $8 million, and were lower than net profits recorded this time last year ($9 million). Wall Street has swung between gains and losses on Wednesday. AP The share price fall came despite a 19.8 per cent revenue lift to $375.9 million and a 12.8 per cent improvement on delivered margins. The Australian dollar was trading at US71.44¢ at 12.42pm AEDT.\n\nAdvertisement\n\nOn Wall Street, US stocks felt both the upside and downside of a surprisingly strong report that said the nation’s unemployment rate improved last month. After initially rising toward an all-time high, the S&P 500 flipped between gains and losses before finishing with a minuscule dip of less than 0.1 per cent. The Dow Jones dropped 66 points, or 0.1 per cent, and the Nasdaq composite fell 0.2 per cent. Both also erased early gains. Related Article Opinion\n\nEarnings season The good, the bad and the very ugly of profit season Elizabeth Knight Business columnist Elsewhere, Treasury yields remained higher in the bond market after the Labor Department said US employers added 130,000 jobs to their payrolls last month, more than economists expected. That helped calm worries from a day earlier, when a discouraging report suggested spending by US households, the main engine of the economy, may be stalling. On one hand, the strong data on jobs raises hopes that the US economy can remain solid and keep driving big profits for companies. Stocks in the energy and raw-material industries jumped to some of the bigger gains in the S&P 500, for example, and their profits tend to be closely tied to the health of the economy.\n\nAdvertisement\n\nBut on the other hand for the broad stock market, the stronger-than-expected jobs data could also keep the Federal Reserve on hold when it comes to cuts to interest rates. And higher rates can drag on prices for stocks and all kinds of other investments. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/politics/nsw/these-community-soccer-clubs-received-funding-after-donating-to-labor-mps-campaigns-20260211-p5o1ei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "These community soccer clubs received funding after donating to Labor MPs’ campaigns",
    "publish_date": "Thu, 12 Feb 2026 12:47:54 +1100",
    "category": "sports",
    "authors": [
      "Max Maddison"
    ],
    "text": "Advertisement\n\nExclusive PoliticsNSWNSW State Parliament These community soccer clubs received funding after donating to Labor MPs’ campaigns Max Maddison Updated February 12, 2026 — 12:47pm ,first published February 12, 2026 — 5:00am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTwo NSW Labor MPs collectively allocated $100,000 in funding to organisations that donated thousands of dollars to their campaigns before the last state election. Industrial Relations Minister Sophie Cotsis and Liverpool MP Charishma Kaliyanda received $1600 and $1100 contributions, respectively, from two community sporting clubs – the first election either organisation had made a reportable political donation. The Local Small Commitment Allocation has faced considerable scrutiny since being announced before the 2023 state election. The scheme provided each of the 93 Labor MPs and candidates across NSW with $400,000 to nominate community groups for funding. NSW Industrial Relations Minister Sophie Cotsis nominated Earlwood Wanderers Football Club for $15,000 in funding. NewsWire The Coalition, Greens and public accountability experts have criticised the $37.2 million scheme’s equity, efficacy and probity processes. MPs’ allocation of funding to organisations they had received donations from has not previously been publicly reported.\n\nAdvertisement\n\nThree weeks before the March 2023 election, Cotsis congratulated Earlwood Wanderers Football Club, in the inner west, on being nominated for $15,000 under the LSCA – money that went toward building a cage to store equipment and funding a female football program. Related Article Exclusive\n\nNSW State Parliament Grants scheme used to ‘prop up’ NSW government Ten days later, NSW Electoral Commission disclosures reveal the club donated $1600 to Cotsis. The March 14 donation appears as the only reportable contribution the club has made to any political organisation or MP. The club did not respond to requests for comment. Cotsis’ office on Wednesday referred questions about the timing of the donation and the funding announcement to the Premier’s Office. In comments provided on Thursday, Cotsis said she would not apologise for ensuring local organisations can access funding they are eligible for.\n\nAdvertisement\n\n“Earlwood Wanderers’ application was considered on its merits, like any other local club that plays an important role in supporting young people and the broader community,” she said. Liverpool Olympic Sports and Social Club similarly donated $1100 to Kaliyanda in late February 2023. A similar donation of $1280 was made to the party’s Leppington candidate, Nathan Hagarty, two days earlier. They are the club’s only two reportable political donations. Related Article Exclusive\n\nNSW State Parliament ‘Source of truth’: The mystery of who drew up a $37m list of promises for every NSW electorate Kaliyanda then nominated the club for $85,000 in funding for upgrading Hoxton Park Reserve. It was the second-largest funding allocation the then-candidate made under the scheme. The date of the funding allocation is unclear. The allocation is absent from the original list of projects nominated for grants that was to be delivered by council rather than the football club.\n\nAdvertisement\n\nThe club received $85,000 as part of Kaliyanda’s allocations through the LSCA for upgrades to the Hoxton Park Reserve, including new canteen facilities and field lighting upgrades. Kaliyanda said she had raised the conflict of interest before the election but did not respond to questions about the genesis of the donation, or how she determined the club should receive funding rather than other community organisations. Instead, she provided a near-identical statement to one from the office of Special Minister of State John Graham. “Projects were assessed by an independent panel for merit, value for money, and deliverability, and MPs played no role in that decision-making,” Kaliyanda’s statement said. “Who organisations donate to is a matter for them. Many organisations and business donate to both sides of politics. “Liverpool Olympic FC has served families in my community for over 40 years. Anyone who believes local sports clubs don’t deserve modest grants to upgrade local facilities should say so – there were a broad range of projects of vital importance to our community that were funded.”\n\nAdvertisement\n\nChris Rath, a Liberal frontbencher who sits on the parliamentary inquiry examining the LSCA scheme, said the matter “doesn’t pass the pub test”. “It is highly unusual and irregular for MPs to be soliciting donations from the local community groups they are meant to serve. It is questionable what would motivate someone to hand over money that mums and dads give to their kids’ soccer club to a Labor political campaign,” he said. Neither Kaliyanda or Cotsis’ funding nominations were subject to a ministerial-commissioned review of projects funded under the LSCA scheme in October 2023. A NSW government spokesperson said: “Small local projects are being funded to a total of $400,000 in every electorate around NSW. This is in stark contrast to the fire hose of pork-barrel funds the Coalition funnelled into Liberal and National Party electorates under John Barilaro.” Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.\n\nCLARIFICATION A previous version said, “The allocation is absent from the original list of projects nominated for grants.”",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/afl/williams-sparks-ugly-brawl-in-1988-origin-clash-20260212-p5o1r5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Williams sparks ugly brawl in 1988 Origin clash",
    "publish_date": "Thu, 12 Feb 2026 12:40:14 +1100",
    "category": "sports",
    "authors": [],
    "text": "Williams sparks ugly brawl in 1988 Origin clash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/some-timing-anges-interview-after-frank-sacking-20260212-p5o1o6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Some timing': Ange's interview after Frank sacking",
    "publish_date": "Thu, 12 Feb 2026 12:30:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "'Some timing': Ange's interview after Frank sacking\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/spurs-sack-ange-s-replacement-after-eight-disastrous-months-20260211-p5o1jp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Spurs, Forest sack Ange’s replacements after disastrous seasons",
    "publish_date": "Thu, 12 Feb 2026 12:21:36 +1100",
    "category": "sports",
    "authors": [
      "Martyn Herman",
      "Rohith Nair",
      "Pearl Josephine Nazare"
    ],
    "text": "Tottenham Hotspur and Nottingham Forest have both sacked the managers they hired to replace Australian Ange Postecoglou, in a day of managerial carnage in the English game.\n\nSpurs announced on Wednesday that they had sacked manager Thomas Frank after eight months in charge, after a woeful run of results left the north London club hovering five points above the relegation zone.\n\nAnge Postecoglou and Thomas Frank before a Tottenham-Brentford clash in 2024. Credit: Getty Images\n\nLater on Wednesday, Nottingham Forest said in a statement that Sean Dyche, who succeeded Postecoglou after his short tenure there, had been relieved of his duties. Dyche was appointed after Forest owner Evangelos Marinakis sacked the Australian in October after just 39 days in charge, having taken the club to eight winless games.\n\n“Nottingham Forest Football Club can confirm that Sean Dyche has been relieved of his duties as head coach,” the statement said.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/hailey-bieber-s-beauty-brand-rhode-pops-up-at-a-p-bakery-in-surry-hills-20260212-p5o1py.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hailey Bieber’s beauty brand Rhode pops up at A.P Bakery in Surry Hills",
    "publish_date": "Thu, 12 Feb 2026 12:20:24 +1100",
    "category": "finance",
    "authors": [
      "Erina Starkey"
    ],
    "text": "Advertisement\n\nEating outHot & new Hailey Bieber’s beauty brand Rhode pops up at A.P Bakery in Surry Hills Get panna cotta-soaked lamingtons and buttermilk waffles with blueberry ricotta chantilly – a deliberate inclusion to tie in with a new product. Erina Starkey February 12, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nStay up to date with all the latest food news, recipes and reviews on the Good Food app, now available from the Apple App Store or the Google Play Store now. Baked goods at A.P Supply in Surry Hills. Hugh Davison If the line at A.P Bakery looks longer than usual, there’s a reason. Hailey Bieber’s beauty brand, Rhode, has taken over A.P. Supply in Surry Hills to mark its launch into Australia. Running from February 12 to 15, from 7.30am to 3pm, the pop-up is serving exclusive Rhode-inspired specials. There’s a buttermilk waffle brushed with caramelised honey and topped with blueberry ricotta chantilly, blueberry compote and thyme, alongside a panna cotta-soaked lamington filled with Moonacre’s Matsuyama blood and Davidson’s plums, coated in tempered chocolate.\n\nAdvertisement\n\nThe blueberry flavour is intentional – a nod to the brand’s new limited edition Peptide Lip Treatment in Sugarberry. Customers will receive a stamp card redeemable for a Rhode sample at Mecca with any Rhode purchase, while stocks last. If you’re more interested in the pocket blush than the pastries, a curated selection of Rhode products is currently available at Mecca’s Bourke Street (Melbourne) and George Street (Sydney) flagship stores, as well as online. The full range is available via the Rhode website. Restaurant reviews, news and the hottest openings served to your inbox. Sign up You can use marinara mix, adding extra prawns or shellfish to make it feel more luxe. Steve Brown; STYLING Emma Knowles Adam Liaw on how to master marinara Seafood pasta strikes the perfect balance for a romantic night in: it’s decadent, impressive, and – best of all – deceptively simple. Every Valentine’s Day, it becomes a viral favourite for couples who want to spend more time at the table and less time at the stove. However, as with most simple dishes, the difference between a good and a bad version lies in the details. Here’s how to make a great pasta marinara.\n\nAdvertisement\n\nOat and fruit cookies are rich in fibre. Sarah Pound What is fibre-maxxing, and should you be doing it? Protein might have been the biggest nutritional buzzword to make headlines in recent years, but there’s a new contender on the horizon, with fibre likely to overtake it as the nutrient holding the most power when it comes to health, wellbeing and longevity. Dietitian Susie Burrell explains how much fibre you need, the most fibre-rich foods to prioritise, and the easiest ways to work them to your diet. Stitch Coffee’s Year of the Horse blend. Stitch Coffee’s Lunar New Year blend Brands have begun trotting out their Lunar New Year specials, from pony-shaped pralines to leather-scented soaps and candles. Our pick is Stitch Coffee’s Year of the Horse blend, made from geisha coffee beans grown in Yunnan, China. The mountainous, high-altitude region is also known for its short, sturdy Tibetan ponies, which were once traded for tea on the ancient Tea Horse Road. The blend carries distinct hints of oolong tea and persimmon, with subtropical notes of raspberry and mango. $33 for 100g from stitch.coffee.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Hot & new\n\nThe download Erina Starkey – Erina is the Good Food App Editor for The Sydney Morning Herald and The Age. Previously, Erina held a number of editing roles at delicious.com.au and writing roles at Broadsheet and Concrete Playground.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/another-bride-claims-shes-had-issues-with-melbourne-store-20260212-p5o1qp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Another bride claims she's had issues with Melbourne store",
    "publish_date": "Thu, 12 Feb 2026 12:14:52 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-s-golden-age-is-a-bit-of-a-fairytale-20260212-p5o1mn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s ‘Golden Age’ is still a fairytale",
    "publish_date": "Thu, 12 Feb 2026 11:59:15 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Advertisement\n\nFebruary 12, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe rate of jobs creation in the US made an unexpected U-turn last month after a dismal 2025. Donald Trump was excited by the numbers, but may have misinterpreted and overstated their implications. “Just in: GREAT JOBS NUMBERS, FAR GREATER THAN EXPECTED!,” he trumpeted on Truth Social. Trump has a unique way of interpreting economic data. Aresna Villanueva “THE UNITED STATES OF AMERICA SHOULD BE PAYING MUCH LESS on its Borrowings (BONDS!) We are again the strongest country in the World, and should therefore be paying the LOWEST INTEREST RATE, by far. This would be an INTEREST COST SAVINGS OF AT LEAST ONE TRILLION DOLLARS PER YEAR - BALANCED BUDGET, PLUS. WOW! The Golden Age of America is upon us!!!” There’s a lot to unpack there, but the jobs numbers are a starting point.\n\nAdvertisement\n\nWhere Wall Street forecasters expected a weak job market in January, the Bureau of Labor Statistics figures showed 130,000 jobs were added, while simultaneously revising down the number of new jobs created over the past two years by almost 900,000. Last year, instead of its previous estimate of 584,000 new jobs, it said the market added only 181,000. Related Article Opinion\n\nJapan The ‘Iron Lady’ looking to shake up the world order Stephen Bartholomeusz Senior business columnist That’s an annual “benchmark” revision, which underscores that the BLS models tend to over-estimate employment growth, largely because of the difficulty in estimating the net effect on employment of business closures and openings. Whether that’s the case again won’t be known until this time next year, although the data is at odds with private sector employment surveys and a recent surge in business bankruptcies. It’s also worth noting that most of the growth in jobs – 124,000 of the 130,000 net jobs added – came from the healthcare and social assistance sectors, with some (presumably data centre-driven) growth in construction jobs. The dominance of growth in jobs reliant on the unhealthy, aged and impoverished isn’t an indicator of a booming private sector.\n\nAdvertisement\n\nAt face value, however, the data showed a surprising turnaround in jobs creation, one that tends to conform to the view expressed by the Federal Reserve Board chairman, Jerome Powell, last month when he said the labour market was showing “evidence of stabilisation”. The overall state of the labour market is being increasingly described by private sector economists as one of “low hire, low fire”, with the weak rate of new employment opportunities offset by a shrinking pool of potential employees, thanks to Trump’s controversial wave of round-ups and deportations of undocumented immigrants (and more than a handful of US citizens). The latest data will make it more difficult for incoming Federal Reserve chief Kevin Warsh to deliver the interest rate cuts that Trump is expecting. Bloomberg While Trump sees that as evidence of economic strength, it conflicts with his desire for lower interest rates and will make it more difficult for his nominee for Powell’s replacement, Kevin Warsh, to deliver the sizeable rate cuts he presumably promised Trump to win the role. With the jobs market stable, but inflation of about 3 per cent still running well above the Fed’s target of 2 per cent, there is no pressing rationale for the Fed to act. Where, before the employment report, markets were pricing in a rate cut in June, after the report, the first cut this year was pushed back to July.\n\nAdvertisement\n\nTrump said earlier this week that, if Warsh delivers what he (Trump) wants, US GDP could grow at a rate of 15 per cent a year. Related Article Opinion\n\nBitcoin Fool’s gold: Trump’s bitcoin dream is turning into a nightmare Stephen Bartholomeusz Senior business columnist That is absurd but, even if US growth were to accelerate relatively modestly, it would create pressure on the Fed to raise rates, not cut them, to avoid an inflation breakout. While Warsh believes the US can grow more strongly without generating inflation because of the productivity gains from artificial intelligence, that’s a thesis that his fellow voting members at the Fed are only likely to respond to when there is clear evidence of non-inflationary growth. Trump doesn’t appear to understand the relationships between an accelerated growth rate, inflation and interest rates – or the extent to which the Fed can control the interest rates that matter. He’s also not good at maths.\n\nAdvertisement\n\nThe US government’s debt when Joe Biden handed over the presidency was just over $US36 trillion ($50 trillion). Today, after only a year of the Trump administration, it is $US38.6 trillion and rising rapidly. The annual net interest cost of that debt is about $US1 trillion, and also rising rapidly. The US Congressional Budget Office (CBO) said this week that Trump’s policies would add $US1.4 trillion to budget deficits over the next decade, with this year’s deficit of $US1.9 trillion rising to $US3.1 trillion by 2036, despite the inclusion of $US3 trillion of revenue from Trump’s tariffs. Unlike Trump’s tax cuts, which are baked in indefinitely and unlikely to be unwound, the tariff revenues might not be there through the decade if the Supreme Court rules against the legitimacy of the tariffs or there is a change of administration after the next election. The latest jobs numbers surprised markets. Getty Images In any event, where Trump has said, in another Truth Social post this week, that a one percentage point cut in interest rates would save the government $US600 billion in interest costs and that a cut of two percentage points would wipe out the deficit, his maths is nonsense.\n\nAdvertisement\n\nTo wipe out budget deficits with interest cost savings would require solidly negative interest rates on the debt. Not only would that deter anyone from lending to the US, but the Fed, even if it completely surrendered to Trump’s will, can’t deliver anything close to what Trump wants – unless the US economy tanks and a depression threatens. Trump has never understood the limits to the Fed’s influence over the bond market. Donald Trump was excited by the numbers, but may have misinterpreted and overstated their implications. The Fed can only influence the shorter duration securities in the US bond market via the federal funds rate, which currently targets a rate of between 3.5 and 3.75 per cent. The rates on the longer-term bonds that matter – the yields on 10-year bonds particularly – are set by the market. They rose in response to the jobs data, with the yield on 10-year securities edging up 3 basis points to 4.18 per cent. If the Fed were to significantly lower rates today, in the absence of a steep recession (and no signs of stagflation), the yields on the securities that dictate the interest costs of US companies and households would soar.\n\nAdvertisement\n\nTrump might believe the US is the strongest country in the world – presumably he’s referring to the US economy and America’s economic clout – but its government’s finances are poor, deteriorating and, as the CBO concluded, unsustainable. Its net debt-to-GDP ratio is already above 100 per cent and, according to the CBO, will, on current policy settings, hit 120 per cent within a decade. Related Article Opinion\n\nFederal Reserve Trump’s new man could spark a financial meltdown Stephen Bartholomeusz Senior business columnist The jobs data, if it holds up, is a tentative sign that last year’s threats to employment – the savage cuts to the government workforce and the impact of Trump’s tariffs on companies’ willingness to hire – might have peaked, at least for the moment. They are, however, only one month’s numbers and aren’t strong enough to depict the booming economy, with declining inflation, that Trump and his economic advisers keep claiming they’ve created. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/angus-taylor-challenges-sussan-ley-for-leadership-of-liberal-party-midday-news-bulletin-12-february-2026/v8mfp7mg6",
    "title": "Angus Taylor challenges Sussan Ley for leadership of Liberal Party | Midday News Bulletin 12 February 2026",
    "publish_date": "Thu, 12 Feb 2026 00:57:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nAngus Taylor challenges Sussan Ley for leadership of the Liberal Party\n\nA special envoy appointed to progress investigations into the methanol poisoning deaths of two Australians in Laos\n\nAustralians Scotty James and Valentino Guseli reach the snowboard halfpipe final at the Milano Cortina Games\n\nLiberal MP Angus Taylor has officially launched his challenge for the Liberal leadership, ending months of speculation over Sussan Ley’s position.\n\nIn a coordinated blow to the current leadership, a wave of frontbenchers have resigned in support of Mr Taylor - including Claire Chandler, Matt O’Sullivan, and Phillip Thompson.\n\nWith a leadership ballot expected within the next 48 hours, Mr Taylor posted a video on social media to pitch his vision for a decisive alternative to the Labor government.\n\n\"The Labor government has failed and the Liberal Party has lost its way. I'm running to be the leader of the Liberal Party because I believe that Australia is worth fighting for. I believe we need strong and decisive leadership that gives Australians clarity, courage and confidence in providing a vision for the future. We must start by holding this failing Labor government to account for their total mismanagement of our country and advocate for solutions to the problems that Australians are facing.\"\n\nMs Ley posted a photo of herself smiling on social media, with a statement vowing to \"take the pressure off families, fix the budget, and keep Australia safe\".\n\n---\n\nAnthony Albanese says he is \"not contemplating failure\" on Closing the Gap between Indigenous and non-Indigenous Australians.\n\nSet to give his annual Close the Gap speech today, Mr Albanese will also hand down his annual report card on progress under the National Agreement on Closing the Gap.\n\nThe latest data shows just four out of 19 targets are on track to be met by 2031.\n\nThe Minister for Indigenous Australians, Malarndirri McCarthy, says there is a lot of work to be done.\n\n\"We're certainly determined to Close the Gap. We've got five more years as part of the national agreement that was signed under Ken Wyatt. We know there's incredible challenges, especially in the justice space and also the out of home care with the removal of Aboriginal and Torres Strait Islander children, but we are determined to keep working with the states and territories to ensure we do close the gap, but also with Aboriginal and Torres Strait Islander communities.\"\n\n---\n\nForeign Minister Penny Wong has appointed a special envoy over the methanol poisoning of two Australian teenagers in Laos .\n\nA lack of transparency from overseas authorities prompted the appointment of seasoned diplomat Pablo Kang, who has been asked explore all avenues to progress the 2024 case.\n\nThe families of Holly Morton-Bowles and Bianca Jones were outraged this week after revelations that 10 people connected to the poisonings faced court in January and were fined just $185 for destroying evidence.\n\nNo charges were laid.\n\nMs Wong has announced Mr Kang's appointment in a statement, after the Department of Foreign Affairs and Trade apologised for not providing more information to the victims' families.\n\n---\n\nThe Triple Zero phone call made by 13-year-old Austin Appelbee to get help for his family who were swept out to sea has been released by Western Australia police.\n\nThe teenager swam four hours to shore last month after he, his mother and two sisters - aged 12 and 8 years old - had drifted out to sea south of Perth on paddleboards and a kayak.\n\nThe family were rescued after an estimated 10 hours at sea, after Austin then ran two kilometres from the shore to find his mother's phone so he could make the emergency call.\n\nIn the now-released audio of the call, he calmly tells an operator that his family likely need a helicopter and says he may need an ambulance for hypothermia.\n\n\"Hello, my name is Austin and I'm outside Quindalup beach. I have two siblings: Beau and Grace. We went out on a kayak trip and we got lost out there. We couldn't get back to shore and Mum told me to go back to get help. I think we need a helicopter to go find them. I'm sitting on the beach right now and I think I need an ambulance because I think I have hypothermia.\"\n\n---\n\nTo sport,\n\nAustralians Scotty James and Valentino Guseli have both secured places in the Men’s Snowboard Halfpipe finals at Milano Cortina Games.\n\nThe top-ranked qualifier for the finals, James scored 94.00 in his opening run in the pipe; delivering a switch backside double cork 1440, which he performed for the first time in a competition Switzerland last month.\n\nFellow Australian, Valentino Guseli has also secured a spot in the finals, delivering two strong and consistent runs to comfortably qualify in sixth place.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/instagram-ceo-defends-platform-against-addiction-claims-in-social-media-trial/tz3gq9tad",
    "title": "Instagram CEO defends platform against addiction claims in social media trial",
    "publish_date": "Wed, 11 Feb 2026 19:45:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "This article references suicide.\n\nInstagram CEO Adam Mosseri has rejected the notion that users could be clinically addicted to social media, as he testified in a landmark California trial over whether his company knowingly hooked children onto its platform for profit.\n\nMeta — the parent company of Instagram and Facebook — and Google-owned YouTube are defendants in the blockbuster trial, which could set a legal precedent regarding whether social media giants deliberately designed their platforms to be addictive to children.\n\n\"I think it's important to differentiate between clinical addiction and problematic use,\" Mosseri said as he was grilled by plaintiff attorney Mark Lanier on Thursday.\n\n\"I'm sure I said that I've been addicted to a Netflix show when I binged it really late one night, but I don't think it's the same thing as clinical addiction,\" he added.\n\nAddiction is at the heart of the civil trial, which centres on allegations that a 20-year-old woman, identified as Kaley GM, suffered severe mental harm after becoming addicted to social media as a young child.\n\nShe started using YouTube at six and joined Instagram at 11, before moving on to Snapchat and TikTok two or three years later.\n\nMosseri was the first major Silicon Valley figure to appear before the jury to defend himself against accusations that Instagram functions as little more than a dopamine \"slot machine\" for vulnerable young people.\n\nProtecting minors is 'good for the business', CEO says\n\nIn front of the jury of six men and women, Mosseri also pushed back against the idea that Meta was motivated by a \"move fast and break things\" ethos that valued profit over safety.\n\n\"Protecting minors over the long run is even good for the business and for profit,\" he said.\n\nMosseri's testimony precedes the highly anticipated appearance of his boss, Mark Zuckerberg, currently scheduled for 18 February, with YouTube CEO Neil Mohan the following day.\n\nIn opening remarks this week, plaintiffs' attorney Lanier told the jury that YouTube and Meta both engineer addiction in young people's brains to gain users and profits.\n\nMeta and Google \"don't only build apps; they build traps,\" Lanier said.\n\nMeta's attorney said the suffering encountered by the plaintiff was due to her family context and could not be attributed to her use of Instagram or other social media.\n\nThe attorney for YouTube insisted that the video platform was neither intentionally addictive nor technically social media.\n\nYouTube is selling \"the ability to watch something essentially for free on your computer, on your phone, on your iPad\", the attorney insisted, comparing the service to Netflix or traditional TV.\n\n'Gateway drug'\n\nStanford University School of Medicine professor Anna Lembke, the first witness called by the plaintiffs, testified Tuesday that she views social media, broadly speaking, as a drug.\n\nShe also said young people's brains were underdeveloped, which is why they \"often take risks that they shouldn't\", comparing YouTube to a gateway drug for kids.\n\nThe trial is currently scheduled to run until 20 March.\n\nSocial media firms face more than a thousand lawsuits accusing them of leading young users to become addicted to content and suffer from depression, eating disorders, psychiatric hospitalisation, and suicidality.\n\nKaley GM's case is being treated as a bellwether proceeding, where the outcome could set the tone for a wave of similar litigation across the US.\n\nTwo further test trials are planned in Los Angeles, while a nationwide lawsuit will be heard by a federal judge in Oakland, California.\n\nIn New Mexico, a separate lawsuit accusing Meta of prioritising profit over protecting minors from sexual predators began on Monday.\n\nReaders seeking crisis support can ring Lifeline on 13 11 14 or text 0477 13 11 14, the Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged up to 25). More information and support with mental health is available at beyondblue.org.au and on 1300 22 4636.\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 2
  },
  {
    "url": "https://www.sbs.com.au/news/article/angus-taylor-steps-down-ahead-of-sussan-ley-leadership-spill/vxzco24d8",
    "title": "Angus Taylor steps down ahead of expected Liberal leadership spill",
    "publish_date": "Wed, 11 Feb 2026 08:19:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Angus Taylor has quit the Liberal frontbench, indicating a leadership challenge against leader Sussan Ley is imminent.\n\nWith press gallery journalists parked outside his office for five hours, Taylor finally emerged just after 7pm and walked the hallway to Ley's office.\n\nHe was inside for mere minutes before declaring to journalists he had tendered his resignation as he no longer had faith in the party leader.\n\n\"I don't believe Sussan Ley is in a position to lead the party as it needs to be led from here,\" Taylor said to reporters in Canberra on Wednesday.\n\nHe said he had attempted to be a \"constructive member\" of Ley's team, but thinks the party needs \"strong leadership\" if it's to rebuild following its historic May 2025 election loss.\n\n\"That means we need strong leadership, clear direction, and a relentless and courageous focus on our values as a first priority,\" he said.\n\nTaylor is expected to challenge Ley for the leadership role, following weeks of speculation about the party's future. It remains unclear whether more resignations from the frontbench will follow.\n\nThe Opposition leader's critics have been advocating for change, following a series of dire poll results.\n\nLey, who has been in the top job for less than 12 months, has spent most of her tenure surrounded by rumours of a spill, but they reached fever pitch after a second break-up with the Nationals in late January. The parties reunited on the weekend.\n\nLast May, Ley beat Taylor narrowly — 29 to 25 — when the party room voted on who would replace Peter Dutton as Liberal Party leader following the Coalition's heavy federal election defeat.\n\nHowever, the retirement of two senators and the removal of Gisele Kapterian from the party room after she lost a recount in Bradfield means, in reality, the numbers are even tighter.\n\nTaylor has long been the frontrunner due to his factional position in the party's right, a prospect strengthened when Andrew Hastie ruled himself out.\n\nThe persistent rumours prompted Liberal frontbencher Andrew Bragg, a key Ley ally, to bait Taylor's supporters to prove they have the numbers with a list or \"move on\".\n\n\"If people want to do these things, they should put their names to it,\" Bragg told ABC News earlier on Wednesday.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/cbas-matt-comyn-on-why-the-disruptive-potential-of-ai-should-not-be-underestimated/uijydybwb",
    "title": "CBA's Matt Comyn on why the disruptive potential of AI should not be underestimated",
    "publish_date": "Wed, 11 Feb 2026 08:06:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/review-launched-into-the-plan-for-australias-largest-river-ecosystem/vjp4kwsra",
    "title": "Review launched into the plan for Australia's largest river ecosystem",
    "publish_date": "Wed, 11 Feb 2026 06:23:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nThe Murray Darling Basin is one of Australia's biggest ecosystems.\n\nMurray Darling Basin Authority chief executive Andrew McConville says the basin features 24 rivers, in an area that's the size of France and Germany combined.\n\n“It's a million square kilometres. You're talking about 35 billion dollars worth of agriculture production, 15 billion dollars worth of tourism. 2.3 million people live in the basin - but actually 3.2 million people, because Adelaide depend on it for drinking water. So it really is what I would call one of the agricultural and environmental engines of the nation.”\n\nA plan to manage the Basin was introduced 14 years ago in response to the Millennium Drought - but it's not met all of its targets.\n\nThat was the finding of a 2024 report from a collective called the Wentworth Group of Concerned Scientists.\n\nSpokesperson Matt Colloff said the report showed little improvement had been achieved since the launch of the plan - while there some areas that had actually gotten worse.\n\n“We've seen waterbird populations decline overall in the Murray Darling Basin by about 60 per cent. We've also seen an increase in the frequency of fishkills.”\n\nCraig Wilkins is the National Director of the Murray Darling Conservation Alliance.\n\nTwo years on, he says there are some regions that are still clearly more in need of help than others.\n\n“The ones that seem to be struggling the most are the ones at the end of the major river channels... When we look at particularly in the northern Basin in New South Wales there are areas which are really doing it tough. So we're talking about around the Gwydir, around the Barwon... A lot of it is because climate change is biting, there is less consistent rainfall, and there is too much water being taken out for irrigation, and the landscape is essentially being sucked dry of the water it needs for its long-term health.”\n\nEnvironment groups have blamed decades of engineering, over-allocation of water, and the drying effect of climate change for a significant reduction in runoff to rivers, creeks and wetlands within the basin.\n\nIndeed, the Environment Minister Murray Watt has just reinstated protection provisions for a part of the Basin that many worried had been hard hit by these issues.\n\n“I'm announcing that I have accepted a recommendation from Australia's Threatened Species Committee to list the lower Murray River as critically endangered under national environmental law.”\n\nAndrew McConville doesn't dispute problems still exist.\n\nHe's just led a review of the Basin plan - the first in its almost 14 year history - that he says highlights what a massive task it is, and how far they have already come.\n\n“It's both impressive, it's fragile, it's complex... We get a bit hard on ourselves here in Australia in terms of what we do. We are leading the world really in terms of managing a basin of this size and scale in the manner that we do.”\n\nStill, concerns remain.\n\nCraig Wilkins says conservationists worry that the review won't produce any meaningful improvements or change.\n\nBut he says it doesn't have to be that way.\n\n“We are hopeful that this big moment in the life of the Murray Darling Basin is going to be embraced, and the review will do the hard work required.”\n\nOne area that many are hoping to see significant reform in relates to the involvement of Indigenous communities.\n\nThe review's discussion paper says they have been largely excluded from the management of the Basin to this point, despite their cultural connections and deep knowledge.\n\nIt's something that First Nations water science researcher Brad Moggridge has previously flagged to SBS.\n\n“It's quite upsetting when you think about it. We've got done over. Again. And as indigenous people, there's 46 odd nations in the Murray Darling Basin and we don't really have a say into where water flows, and we don't really have access.”\n\nBut tackling all of these issues means wading into a political battleground.\n\nShadow environment minister Angie Bell says the government has been badly mishandling the needs of the Murray Darling Basin.\n\n“What the Basin needs is infrastructure; it needs management of invasive species; it needs efficient water practices; it needs to improve the water quality. What it doesn't need is more regulatory uncertainty and burden, which could hinder that sort of investment that we would like to see.”\n\nMurray Watt however argues the Labor federal government is simply trying to catch up, accusing the previous Coalition government of failing to act on the Basin's problems for years.\n\nHe says the government has implemented an aggressive scheme to buy water entitlements back from licence holders.\n\n“They had 10 years to recover 450 gigalitres of environment. They recovered two gigalitres. Now in the couple of years since we've been in office we've already recovered something like 170 gigalitres towards that 450, and you would have seen towards the end of last year I announced we'd be acquiring another 130 to get us to 300 ((gigalitres)).”\n\nSouth Australian Greens Senator Sarah Hanson-Young has her own agenda.\n\nShe has flagged her intention to push hard against the Basin falling deeper into crisis, especially in her state.\n\n“Other states, of course - those with vested interests, the big corporate irrigators upstream, in upstream states - will be wanting to get more and more water for themselves at the cost of and the expense of our river system, our environment, and our state... And we'll be making sure we fight tooth and nail for our river, for our Murray, and for our Coorong.”\n\nAs that battle is waged, Andrew McConville says difficult decisions may need to be made at some point that are beyond the Basin Authority's scope.\n\nThose decisions could address concerns that some crops are too water intensive for the environment - like almond farms in Victoria.\n\n“Governments are often reluctant to intervene in a market to say well you can grow this and you can't grow this. That's not the way Australia works. They do it in other parts of the world. But I think there's a range of decisions that need to be made. And what we're trying to do in the context of the Basin plan is to make sure the Basin plan itself has a range of tools that can be called upon to achieve certain environmental outcomes.”\n\nBut Craig Wilkins says the Murray Darling Basin Authority still has a crucial role to play.\n\n“We are really calling on the Basin Authority to make sure that they are not second guessing the Minister, and not assuming that the Albanese government will be afraid to do the hard things everyone knows is required and to make those tough choices. The community needs the unvarnished truth.”",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/hundreds-of-jobs-to-go-as-lithium-giant-pulls-pin-on-wa-processing-plant-20260212-p5o1s1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hundreds of jobs to go as lithium giant pulls pin on WA processing plant",
    "publish_date": "Thu, 12 Feb 2026 13:55:35 +1100",
    "category": "finance",
    "authors": [
      "Michael Philipps"
    ],
    "text": "Advertisement\n\nNationalWALithium Hundreds of jobs to go as lithium giant pulls pin on WA processing plant Michael Philipps February 12, 2026 — 1:55pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nUS lithium giant Albemarle has shut down its Kemerton lithium hydroxide processing plant in Western Australia, in a move expected to impact about 250 workers at the site. The company announced overnight it would idle its last operating train at the plant and place it into care and maintenance immediately. The Albemarle lithium hydroxide plant at Kemerton in WA has has been placed into care and maintenance. The Kemerton processing plant, located near Bunbury, produced lithium hydroxide using spodumene from the nearby Greenbushes mine. A statement from Albemarle said the company would aim to meet customer demand for lithium hydroxide through other production channels.\n\nAdvertisement\n\nAlbemarle chairman and chief executive Kent Masters said idling operations at Kemerton was a difficult decision. “It follows significant actions we have taken over the past two and a half years to reduce operating costs during an extended period of price volatility in the market,” he said. “Unfortunately, recent lithium price improvements alone are not enough to offset the challenges facing Western hard-rock lithium conversion operations. “This decision improves our financial flexibility and preserves optionality.” The market for lithium hydroxide has rallied in recent months, due to a stronger demand for energy storage and a shortening of supply.\n\nAdvertisement\n\nHowever, in releasing Albemarle’s December quarter results, Masters said the company was focused on driving down costs. “The steps we have taken to optimise our asset portfolio, reduce costs and strengthen our financial flexibility have improved our competitive position,” he said. Albemarle has announced it will close its final train at its lithium refinery in Kemerton. AFR “Even as market conditions improve, we continue to drive cost reduction and productivity actions to enable long-term growth, powered by our world-class resources.” The latest announcement follows a move by the company in July 2024 to idle production on Train 2 and place it into care and maintenance.\n\nAdvertisement\n\nAt the same time, Albemarle announced plans to stop construction activities on Train 3 to focus its manufacturing efforts on the continued qualification on the remaining Train 1 in a decision that cost around 300 jobs at the site. In January 2024, Albemarle shelved plans to build a fourth train at the plant in a bid to complete commissioning activities on the first two trains. Each Kemerton train had the capacity to produce about 25,000 tonnes of lithium hydroxide per year. Chamber of Minerals and Energy WA chief executive Aaron Morey said the company’s decision was a reflection of the current lithium market. “Albermarle has made a significant contribution to Western Australia’s ambitions to capture value and create jobs through downstream processing of our world-class lithium reserves,” he said.\n\nAdvertisement\n\n“Resources are traded on global markets and today’s decision illustrates how competitive those markets are. Related Article Lithium Lithium crash to cost 300 jobs at miner in WA “The outcome is a timely reminder of the hard realities of competing internationally to build and sustain downstream industries in Australia.” Albemarle holds a 49 per cent share in the Talison joint venture, which operates the Greenbushes mine in WA’s South West that is considered the world’s largest and highest-grade hard-rock lithium mine. The remaining 51 per cent is held by a joint venture between Tianqi Lithium Corporation and IGO Limited.\n\nAdvertisement\n\nIn a statement, Albemarle added that its mining interests in Australia, including its holdings in Greenbushes and Wodgina and its exploration interests in Western Australia, were not impacted by the Kemerton decision as they remain core components of the company’s strategy. WA opposition energy spokesman Dr Steve Thomas said it came as no surprise that operations at the Kemerton refinery were stopping. “The lithium industry has been suffering from low prices, which have dropped dramatically since 2022 thanks to oversupply in the market and a slower-than-expected take-up of electric vehicles,” he said. “This has made the viability of all lithium projects problematic.” Thomas said Albemarle faced difficult issues with the cost and reliable supply of energy, which made the situation more unstable.\n\nAdvertisement\n\n“This combination of factors has delivered the sad result we see today,” he said. “I hope that a correction to the lithium market and stable energy prices will one day see lithium hydroxide being produced in Kemerton in the future. “In the meantime, I wish the best to the workers in this time of trial and uncertainty.” Get the day’s breaking news, entertainment ideas and a long read to enjoy. Sign up to receive our Evening Edition newsletter.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Lithium\n\nJobs Michael Philipps is a producer and reporter with WAtoday.",
    "source": "TheAge",
    "cluster_id": 13
  },
  {
    "url": "https://www.theage.com.au/national/israeli-president-isaac-herzog-arrives-in-melbourne-20260212-p5o1sc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Israeli President Isaac Herzog arrives in Melbourne",
    "publish_date": "Thu, 12 Feb 2026 13:40:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/politics/federal/don-t-accuse-me-of-gaslighting-australians-bullock-to-canavan-20260212-p5o1qi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Don’t accuse me of gaslighting Australians: Bullock to Canavan",
    "publish_date": "Thu, 12 Feb 2026 13:39:34 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Advertisement\n\nPoliticsFederalRBA Don’t accuse me of gaslighting Australians: Bullock to Canavan Shane Wright February 12, 2026 — 1:39pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nReserve Bank governor Michele Bullock has angrily pushed back at accusations from a Coalition senator that she is gaslighting Australians. Bullock, usually calm and reserved during parliamentary hearings, responded sharply after Nationals’ senator Matt Canavan – a trained economist – used different measures of wage growth to suggest the governor was at odds with the experience of most Australians. Loading “I think people are only going to get angrier in this country if they’re gaslit into thinking the economy is okay when their lived experience is absolutely terrible right now,” he said. Bullock, who often discusses the amount of correspondence she receives from people about their living conditions and impact of the bank on their cost of living, pushed back strongly during a Senate estimates hearing into the Reserve.\n\nAdvertisement\n\n“I take exception to that comment. I am not gaslighting anyone,” she said. “I have said that there are certain aspects of the economy which are doing well, and one of them is the labour marke,t which is positive for people.” Reserve Bank governor Michele Bullock appearing before the House economics committee on Friday. Alex Ellinghausen Bullock had earlier noted that while there were a lot of complaints about the economy, she said it was doing “okay” with the jobs market a particular strong point. “But that is not to say that you can’t recognise that are some parts of the economy that are doing well, and the labour market, I think, has been a really positive thing for his country,” she said.\n\nAdvertisement\n\nThe Reserve Bank has a dual mandate, to hold inflation between 2 and 3 per cent and to have as many Australians in work as possible. Related Article Federal budget Hey big spenders: Where the budget is blowing out The jobless rate is at 4.1 per cent, among the lowest in the developed world, with 165,000 jobs created over the past year. But Canavan said he did not believe the labour market was “doing that well”, and claimed Australians’ incomes were falling. He said the economy should support “peoples’ basic ability to provide for themselves and that has gone backwards at a rate that we’ve never seen”.\n\nAdvertisement\n\nBullock, however, noted that a measure of incomes that takes into account wages, tax, interest and inflation showed incomes had grown since the pandemic. “We’re looking at a measure of what people are actually being paid. It’s not shooting the lights out either, but it is above where it was pre-COVID,” she said. The argument with Canavan followed questions from Liberal senator Jane Hume about whether government spending had contributed to the Reserve Bank’s decision to lift interest rates earlier this month. Noting she had answered questions on the issue many times, Bullock said it was spending by households and businesses that had been the key factor in the nation’s changing inflation outlook. The governor said demand across the economy was running faster than its ability to supply goods and services, which was contributing to inflation.\n\nAdvertisement\n\nPublic and private demand were both contributing, but public spending over recent months was in line with what the bank had been expecting. Related Article Interest rates One rate rise not enough to tame inflation as most home buyers well ahead on mortgages “If you look at the difference between our forecast in November and where we have inflation back into the band and you look at our forecasts now where it isn’t, the key difference is not fiscal policy. It is pretty much the same as it was in November,” she said. “The key difference is private demand.” Bullock pushed back on suggestions that the Reserve should wade into the political debate over government spending contributions to inflation.\n\nAdvertisement\n\n“We don’t believe that our job is to tell the government or the parliament what to do with fiscal policy,” she said. Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/world/brawl-erupts-in-turkish-parliament-20260212-p5o1qf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brawl erupts in Turkish parliament",
    "publish_date": "Thu, 12 Feb 2026 13:34:56 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/politics/i-am-not-gaslighting-anyone-bullocks-heated-exchange-with-canavan-20260212-p5o1qq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'I am not gaslighting anyone': Bullock's heated exchange with Canavan",
    "publish_date": "Thu, 12 Feb 2026 13:31:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "'I am not gaslighting anyone': Bullock's heated exchange with Canavan\n\nA frustrated Michele Bullock has fired back at Nationals senator Matt Canavan after his suggestion she is gaslighting Australians over the state of the economy.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/my-father-was-dying-why-didn-t-i-speak-up-20260205-p5nzv6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "My father was dying. Why didn’t I speak up?",
    "publish_date": "Thu, 12 Feb 2026 13:31:03 +1100",
    "category": "lifestyle",
    "authors": [
      "Anson Cameron"
    ],
    "text": "Advertisement\n\nLifestyleLife & relationshipsDeath Opinion My father was dying. Why didn’t I speak up? We prepare speeches for weddings, birthdays and funerals but are strangely silent as our loved ones slip away. Anson Cameron Spectrum columnist, The Age February 12, 2026 — 1:31pm\n\nFebruary 12, 2026 — 1:31pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe night Dad died is fading on me now. It happened in a bright room in a sister’s house where we rode the rollercoaster of his laboured breathing until nearly dawn. An internal tide rose, fluids seeping into each exhausted lung, bringing the death rattle on. Early in the night there was a doctor who had seen this show too many times. He gave us instructions, a nod and a wink as to what could be done. That’s the morphine, there in the fridge. That’s the suffering man. This is what might be done by loving people with morphine for a suffering man. Then he left. Photo: Robin Cowcher My elder brother was in another country, which made things harder because he’s what used to be known as “a man of action”, and I’m more a ditherer. My easy entanglement in contemplations of the possibilities usually results in what’s known as “ditherer’s stasis”. As Dad’s disease advanced, making his life progressively less endurable, he’d often say, with vague wonder: “You wouldn’t let your dog die like this, would you?” It was truly surprising to him to have to endure, stoically, even, dammit, good-naturedly, what amounted to a daily zoological demotion towards an existence as limited as a newt’s – with buckets of pain thrown in.\n\nAdvertisement\n\nAs his lungs flooded that night, his breathing became sporadically becalmed. We thought he was dead several times, and we stilled our own breathing to listen to his fresh nothingness, gripping each other’s hands and facing, for the first time, a world without him. But each time his heart started up again, and we cursed him gently for his stubbornness. Related Article Opinion\n\nSeptember 11 attacks My frequently flying friend had a gripe. If only he’d seen the news Anson Cameron Spectrum columnist, The Age About dawn his body drew the last of half-a-billion breaths, and I remember wondering what thoughts it might have fed, that ragged inhalation. Did its smattering of oxygen molecules power a fading reverie through to completion? A happy thought, I hoped. A cheering thought. A bright note on which to leave. A vision of his mum and dad, his brothers, or his kids, or of him as a limitless 17-year-old leaping on a fullback’s shoulders to mark a Sherrin, or kissing a girl for the first time, or leaning towards the Bakelite radio to hear of the Second World War’s end. Since that night I’ve regretted that I didn’t speak to him. Two sisters and I sat quietly grieving, listening to his tenuous breath. I’m now sorry I didn’t supply a monologue of happy memories, didn’t landscape his unconsciousness with the stuff that made life worthwhile – even, sporadically, wonderful. I should have talked to him.\n\nAdvertisement\n\nBut death was in the room, and death is intimidating company. Death threw me off my game. Why should something so natural, inevitable and ubiquitous be such a scold? The enormity of death stops you speaking of it in its presence – even stops you speaking in its presence. But this timidity must be overcome because the last encounter with a loved one these days is so often while they’re comatose. Why are we not prepared? It somehow didn’t occur to me that he might still be able to hear me in his coma ... and anyway, if I talked, how would I navigate the fact that this talk was the last talk? It seems rude to acknowledge to someone that they’re dying – that they’re failing you by committing this irreversible breach in your relations. We’re all reluctant to mention our friends’ failures, and death feels like abandonment, and we don’t want to accuse our friends of that. So he died in silence, though I’ve talked to him plenty since. Did he even know we were sitting there at his bedside? What a strange reaction, to let him go quietly into that good night when our voices might have sung like choirs through the chapels of his fading mind. We prepare toasts for birthdays, write heartfelt speeches for weddings, and anguish over eulogies. Why do we not think to prepare a monologue to be spoken to the dying soul we have loved? Make it part memoir, part poem, sprinkle it with ad lib fondness ... then throw in some jokes and some Shelley. Honour your moribund mate by assuming they’re as cognitively acute as ever they were – and have a natter. “Ha. You remember when we ...” Of course, had I done that, he may have thought: “God, I wish that bloody Anson would shut up so I can concentrate on what I’m doing.”\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Death\n\nOpinion\n\nFor subscribers\n\nSpectrum Anson Cameron is a columnist for Spectrum in The Age and the author of several books, including Boyhoodlum and Neil Balme: A Tale of Two Men.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/fair-work-commission-chief-says-cfmeu-behaviour-cost-30-per-cent-warrants-inquiry-20260212-p5o1s3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fair Work Commission chief says CFMEU behaviour cost 30 per cent, warrants inquiry",
    "publish_date": "Thu, 12 Feb 2026 13:28:35 +1100",
    "category": "finance",
    "authors": [],
    "text": "Fair Work Commission chief says CFMEU behaviour cost 30 per cent, warrants inquiry\n\nMurray Furlong said Victorians had a right to know what had gone wrong with their state's infrastructure projects.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-for-flat-start-wall-street-wobbles-on-jobs-report-a-jumps-20260212-p5o1kf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Banks, utilities drive ASX to record high; AMP, Temple & Webster tumble",
    "publish_date": "Thu, 12 Feb 2026 12:49:14 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Banks, utilities drive ASX to record high; AMP, Temple & Webster tumble Staff reporter Updated February 12, 2026 — 12:49pm ,first published February 12, 2026 — 5:19am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has hit a record high as investors digest a raft of results, with ANZ Bank soaring on the back of its trading update while wealth giant AMP and online retailer Temple & Webster suffered heavy falls. The S&P/ASX 200 was up 73.3 points or 0.8 per cent, to 9088.1 in early afternoon trade, with six of 11 industry sectors in positive territory, led by utilities. The ASX hit a record high in early trade. Louie Douvis ANZ Bank soared 8 per cent after it revealed in a trading update it made $1.9 billion in profits in the December quarter, with its expenses falling as a result of deep cost-cutting under new chief executive Nuno Matos, while its profit margins also moved higher. Compared with the same quarter last year, ANZ’s profits rose 6 per cent. Financial stocks have jumped in early trade, with big four rivals Commonwealth Bank jumped 4.6 per cent, Westpac rose 2.8 per cent and National Australia Bank advanced 2.4 per cent. AMP shares plunged 26.4 per cent after its results disappointed the market, with wealth manager’s full-year statutory profits falling to $133 million, from $150 million a year earlier.\n\nAdvertisement\n\nBarrenjoey analyst Andrew Adams said the company’s outlook for revenue margins was below expectations and likely to drive downgrades in analysts’ forecasts for the company’s future performance. “Capital was not as strong as expected, so it is difficult to see what supports the share price today,” Adams said. Shares in Origin Energy soared 5.2 per cent on Thursday after the electricity and gas giant lifted its profit target for one of its key divisions despite a 45 per cent plunge in first-half profit. Although Origin’s net profit sank from $1.01 billion to $557 million for the six months to December, its underlying earnings of $593 million came in higher than analysts had been forecasting amid a stronger-than-expected contributions from the company’s domestic retailing and generation division and its jointly-owned liquefied gas venture in Queensland. Energy stocks are mixed, with Woodside Energy up 1.4 per cent and Santos sliding 0.7 per cent. Spiking gold and silver prices are driving up earnings among Australia’s precious metal miners. Northern Star reported a 19 per cent rise in earnings for the half-year to December because of a 31 per cent increase in the average realised gold price. Costs increased 9 per cent but the group nonetheless recorded a 41 per cent increase in net profit after tax to $714 million. Its shares are up 5.2 per cent. South32, a major silver producer, said its earnings increased 3 per cent over the half-year, but it reported a substantial 29 per cent jump in after tax profit to $651 million. Its shares added 1.1 per cent. Iron ore miners bounced higher, with BHP up 2.5 per cent, Rio Tinto rising 2.3 per cent and Fortescue 0.5 per cent higher.\n\nAdvertisement\n\nHealthcare giant CSL tumbled 7 per cent to continue a tumultuous week marked by the sudden resignation of chief Dr Paul McKenzie on Tuesday followed by half-year results on Wednesday that fell short of market estimates and announcing $1.5 billion in writedowns. Tech shares plunged with WiseTech losing 6 per cent and Xero 7.1 per cent lower. Lendlease CEO Tony Lombardo will step down in August after the company releases its full-year results to relocate to South-East Asia for a new job. He’s worked at the company for 18 years, including the last five years in the top job. Lendlease has engaged an executive search firm to find a replacement. Its shares rose 0.4 per cent. Related Article Opinion\n\nBitcoin Fool’s gold: Trump’s bitcoin dream is turning into a nightmare Stephen Bartholomeusz Senior business columnist Market operator ASX Limited reported an 8.3 per cent rise in net profit to $263.6 million, while revenue rose 11.2 per cent, helped by growth across its four business units. The company has faced intense scrutiny and criticism from regulators lately over a series of technical bungles, with the Australian Securities and Investments Commission slapped the company with a $150 million capital charge in December. Its chief executive Helen Lofthouse this week said she would step down in May. Its shares dropped 1.5 per cent in early trade.\n\nAdvertisement\n\nTemple and Webster plunged by 28 per cent after disappointing investors with its half-year results that undershot expectations. The company reported EBITDA margins of 3.6 per cent, which fell short of market forecasts of 3.9 per cent, according to a note from Jarden analyst Aryan Norozi. Net profits of $5.8 million fell below expectations of $8 million, and were lower than net profits recorded this time last year ($9 million). Wall Street has swung between gains and losses on Wednesday. AP The share price fall came despite a 19.8 per cent revenue lift to $375.9 million and a 12.8 per cent improvement on delivered margins. The Australian dollar was trading at US71.44¢ at 12.42pm AEDT.\n\nAdvertisement\n\nOn Wall Street, US stocks felt both the upside and downside of a surprisingly strong report that said the nation’s unemployment rate improved last month. After initially rising toward an all-time high, the S&P 500 flipped between gains and losses before finishing with a minuscule dip of less than 0.1 per cent. The Dow Jones dropped 66 points, or 0.1 per cent, and the Nasdaq composite fell 0.2 per cent. Both also erased early gains. Related Article Opinion\n\nEarnings season The good, the bad and the very ugly of profit season Elizabeth Knight Business columnist Elsewhere, Treasury yields remained higher in the bond market after the Labor Department said US employers added 130,000 jobs to their payrolls last month, more than economists expected. That helped calm worries from a day earlier, when a discouraging report suggested spending by US households, the main engine of the economy, may be stalling. On one hand, the strong data on jobs raises hopes that the US economy can remain solid and keep driving big profits for companies. Stocks in the energy and raw-material industries jumped to some of the bigger gains in the S&P 500, for example, and their profits tend to be closely tied to the health of the economy.\n\nAdvertisement\n\nBut on the other hand for the broad stock market, the stronger-than-expected jobs data could also keep the Federal Reserve on hold when it comes to cuts to interest rates. And higher rates can drag on prices for stocks and all kinds of other investments. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/politics/nsw/these-community-soccer-clubs-received-funding-after-donating-to-labor-mps-campaigns-20260211-p5o1ei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "These community soccer clubs received funding after donating to Labor MPs’ campaigns",
    "publish_date": "Thu, 12 Feb 2026 12:47:54 +1100",
    "category": "sports",
    "authors": [
      "Max Maddison"
    ],
    "text": "Advertisement\n\nExclusive PoliticsNSWNSW State Parliament These community soccer clubs received funding after donating to Labor MPs’ campaigns Max Maddison Updated February 12, 2026 — 12:47pm ,first published February 12, 2026 — 5:00am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTwo NSW Labor MPs collectively allocated $100,000 in funding to organisations that donated thousands of dollars to their campaigns before the last state election. Industrial Relations Minister Sophie Cotsis and Liverpool MP Charishma Kaliyanda received $1600 and $1100 contributions, respectively, from two community sporting clubs – the first election either organisation had made a reportable political donation. The Local Small Commitment Allocation has faced considerable scrutiny since being announced before the 2023 state election. The scheme provided each of the 93 Labor MPs and candidates across NSW with $400,000 to nominate community groups for funding. NSW Industrial Relations Minister Sophie Cotsis nominated Earlwood Wanderers Football Club for $15,000 in funding. NewsWire The Coalition, Greens and public accountability experts have criticised the $37.2 million scheme’s equity, efficacy and probity processes. MPs’ allocation of funding to organisations they had received donations from has not previously been publicly reported.\n\nAdvertisement\n\nThree weeks before the March 2023 election, Cotsis congratulated Earlwood Wanderers Football Club, in the inner west, on being nominated for $15,000 under the LSCA – money that went toward building a cage to store equipment and funding a female football program. Related Article Exclusive\n\nNSW State Parliament Grants scheme used to ‘prop up’ NSW government Ten days later, NSW Electoral Commission disclosures reveal the club donated $1600 to Cotsis. The March 14 donation appears as the only reportable contribution the club has made to any political organisation or MP. The club did not respond to requests for comment. Cotsis’ office on Wednesday referred questions about the timing of the donation and the funding announcement to the Premier’s Office. In comments provided on Thursday, Cotsis said she would not apologise for ensuring local organisations can access funding they are eligible for.\n\nAdvertisement\n\n“Earlwood Wanderers’ application was considered on its merits, like any other local club that plays an important role in supporting young people and the broader community,” she said. Liverpool Olympic Sports and Social Club similarly donated $1100 to Kaliyanda in late February 2023. A similar donation of $1280 was made to the party’s Leppington candidate, Nathan Hagarty, two days earlier. They are the club’s only two reportable political donations. Related Article Exclusive\n\nNSW State Parliament ‘Source of truth’: The mystery of who drew up a $37m list of promises for every NSW electorate Kaliyanda then nominated the club for $85,000 in funding for upgrading Hoxton Park Reserve. It was the second-largest funding allocation the then-candidate made under the scheme. The date of the funding allocation is unclear. The allocation is absent from the original list of projects nominated for grants that was to be delivered by council rather than the football club.\n\nAdvertisement\n\nThe club received $85,000 as part of Kaliyanda’s allocations through the LSCA for upgrades to the Hoxton Park Reserve, including new canteen facilities and field lighting upgrades. Kaliyanda said she had raised the conflict of interest before the election but did not respond to questions about the genesis of the donation, or how she determined the club should receive funding rather than other community organisations. Instead, she provided a near-identical statement to one from the office of Special Minister of State John Graham. “Projects were assessed by an independent panel for merit, value for money, and deliverability, and MPs played no role in that decision-making,” Kaliyanda’s statement said. “Who organisations donate to is a matter for them. Many organisations and business donate to both sides of politics. “Liverpool Olympic FC has served families in my community for over 40 years. Anyone who believes local sports clubs don’t deserve modest grants to upgrade local facilities should say so – there were a broad range of projects of vital importance to our community that were funded.”\n\nAdvertisement\n\nChris Rath, a Liberal frontbencher who sits on the parliamentary inquiry examining the LSCA scheme, said the matter “doesn’t pass the pub test”. “It is highly unusual and irregular for MPs to be soliciting donations from the local community groups they are meant to serve. It is questionable what would motivate someone to hand over money that mums and dads give to their kids’ soccer club to a Labor political campaign,” he said. Neither Kaliyanda or Cotsis’ funding nominations were subject to a ministerial-commissioned review of projects funded under the LSCA scheme in October 2023. A NSW government spokesperson said: “Small local projects are being funded to a total of $400,000 in every electorate around NSW. This is in stark contrast to the fire hose of pork-barrel funds the Coalition funnelled into Liberal and National Party electorates under John Barilaro.” Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.\n\nCLARIFICATION A previous version said, “The allocation is absent from the original list of projects nominated for grants.”",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/afl/williams-sparks-ugly-brawl-in-1988-origin-clash-20260212-p5o1r5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Williams sparks ugly brawl in 1988 Origin clash",
    "publish_date": "Thu, 12 Feb 2026 12:40:14 +1100",
    "category": "sports",
    "authors": [],
    "text": "Williams sparks ugly brawl in 1988 Origin clash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/some-timing-anges-interview-after-frank-sacking-20260212-p5o1o6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Some timing': Ange's interview after Frank sacking",
    "publish_date": "Thu, 12 Feb 2026 12:30:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "'Some timing': Ange's interview after Frank sacking\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/spurs-sack-ange-s-replacement-after-eight-disastrous-months-20260211-p5o1jp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Spurs, Forest sack Ange’s replacements after disastrous seasons",
    "publish_date": "Thu, 12 Feb 2026 12:21:36 +1100",
    "category": "sports",
    "authors": [
      "Martyn Herman",
      "Rohith Nair",
      "Pearl Josephine Nazare"
    ],
    "text": "Tottenham Hotspur and Nottingham Forest have both sacked the managers they hired to replace Australian Ange Postecoglou, in a day of managerial carnage in the English game.\n\nSpurs announced on Wednesday that they had sacked manager Thomas Frank after eight months in charge, after a woeful run of results left the north London club hovering five points above the relegation zone.\n\nAnge Postecoglou and Thomas Frank before a Tottenham-Brentford clash in 2024. Credit: Getty Images\n\nLater on Wednesday, Nottingham Forest said in a statement that Sean Dyche, who succeeded Postecoglou after his short tenure there, had been relieved of his duties. Dyche was appointed after Forest owner Evangelos Marinakis sacked the Australian in October after just 39 days in charge, having taken the club to eight winless games.\n\n“Nottingham Forest Football Club can confirm that Sean Dyche has been relieved of his duties as head coach,” the statement said.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/hailey-bieber-s-beauty-brand-rhode-pops-up-at-a-p-bakery-in-surry-hills-20260212-p5o1py.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hailey Bieber’s beauty brand Rhode pops up at A.P Bakery in Surry Hills",
    "publish_date": "Thu, 12 Feb 2026 12:20:24 +1100",
    "category": "finance",
    "authors": [
      "Erina Starkey"
    ],
    "text": "Advertisement\n\nEating outHot & new Hailey Bieber’s beauty brand Rhode pops up at A.P Bakery in Surry Hills Get panna cotta-soaked lamingtons and buttermilk waffles with blueberry ricotta chantilly – a deliberate inclusion to tie in with a new product. Erina Starkey February 12, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nStay up to date with all the latest food news, recipes and reviews on the Good Food app, now available from the Apple App Store or the Google Play Store now. Baked goods at A.P Supply in Surry Hills. Hugh Davison If the line at A.P Bakery looks longer than usual, there’s a reason. Hailey Bieber’s beauty brand, Rhode, has taken over A.P. Supply in Surry Hills to mark its launch into Australia. Running from February 12 to 15, from 7.30am to 3pm, the pop-up is serving exclusive Rhode-inspired specials. There’s a buttermilk waffle brushed with caramelised honey and topped with blueberry ricotta chantilly, blueberry compote and thyme, alongside a panna cotta-soaked lamington filled with Moonacre’s Matsuyama blood and Davidson’s plums, coated in tempered chocolate.\n\nAdvertisement\n\nThe blueberry flavour is intentional – a nod to the brand’s new limited edition Peptide Lip Treatment in Sugarberry. Customers will receive a stamp card redeemable for a Rhode sample at Mecca with any Rhode purchase, while stocks last. If you’re more interested in the pocket blush than the pastries, a curated selection of Rhode products is currently available at Mecca’s Bourke Street (Melbourne) and George Street (Sydney) flagship stores, as well as online. The full range is available via the Rhode website. Restaurant reviews, news and the hottest openings served to your inbox. Sign up You can use marinara mix, adding extra prawns or shellfish to make it feel more luxe. Steve Brown; STYLING Emma Knowles Adam Liaw on how to master marinara Seafood pasta strikes the perfect balance for a romantic night in: it’s decadent, impressive, and – best of all – deceptively simple. Every Valentine’s Day, it becomes a viral favourite for couples who want to spend more time at the table and less time at the stove. However, as with most simple dishes, the difference between a good and a bad version lies in the details. Here’s how to make a great pasta marinara.\n\nAdvertisement\n\nOat and fruit cookies are rich in fibre. Sarah Pound What is fibre-maxxing, and should you be doing it? Protein might have been the biggest nutritional buzzword to make headlines in recent years, but there’s a new contender on the horizon, with fibre likely to overtake it as the nutrient holding the most power when it comes to health, wellbeing and longevity. Dietitian Susie Burrell explains how much fibre you need, the most fibre-rich foods to prioritise, and the easiest ways to work them to your diet. Stitch Coffee’s Year of the Horse blend. Stitch Coffee’s Lunar New Year blend Brands have begun trotting out their Lunar New Year specials, from pony-shaped pralines to leather-scented soaps and candles. Our pick is Stitch Coffee’s Year of the Horse blend, made from geisha coffee beans grown in Yunnan, China. The mountainous, high-altitude region is also known for its short, sturdy Tibetan ponies, which were once traded for tea on the ancient Tea Horse Road. The blend carries distinct hints of oolong tea and persimmon, with subtropical notes of raspberry and mango. $33 for 100g from stitch.coffee.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Hot & new\n\nThe download Erina Starkey – Erina is the Good Food App Editor for The Sydney Morning Herald and The Age. Previously, Erina held a number of editing roles at delicious.com.au and writing roles at Broadsheet and Concrete Playground.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/another-bride-claims-shes-had-issues-with-melbourne-store-20260212-p5o1qp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Another bride claims she's had issues with Melbourne store",
    "publish_date": "Thu, 12 Feb 2026 12:14:52 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://au.news.yahoo.com/e-bike-bought-teen-might-021813032.html",
    "title": "That e-bike you bought your teen might be an illegal electric motorbike – and the risks are real",
    "publish_date": "2026-02-12T02:18:13Z",
    "category": "finance",
    "authors": [],
    "text": "A “health emergency”. A “total menace”. “Take them away and crush them”.\n\nE-bikes are in the news for all the wrong reasons. A spate of deaths and injuries linked to e-bike crashes have led to widespread concern. Hundreds of serious injuries have been recorded over the past two years in New South Wales, Victoria and Queensland. High-speed rideouts across Sydney Harbour Bridge and through golf courses have infuriated authorities.\n\nThe vehicles authorities are concerned about aren’t really e-bikes at all. They’re effectively illegal electric motorbikes, able to accelerate rapidly — some to more than 100 kilometres per hour — and often without the safety standards of a legal motorbike. For years, these vehicles were imported through a loophole allowing them to be used on private land. But once in Australia, most end up on roads, bike paths and public space.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe thrill of these vehicles can be a potent cocktail for young people. Their range and speed gives teens more independence before they can legally get a car. That’s great. But teens are also generally more likely to take risks and test boundaries, and less likely to comply with rules. Unsurprisingly, injury and death rates among younger e-bike riders are rising given widespread access to cheap, fast, unlicensed vehicles – often by their well-meaning parents.\n\nHow did we get here?\n\nMany people associate e-bikes with parents ferrying kids around on electric cargo bikes, or commuters in business attire zipping to work without raising a sweat. These types of legal vehicles are pedal-assisted and limited to 25km/h.\n\nBut the term “e-bike” covers a huge range of vehicles in a booming sector. In 2017, around 9,000 e-bikes were sold across Australia. This year, sales are tipped to be close to 300,000, worth A$1.3 billion.\n\nOne reason for the boom: national import standards on high-powered models were loosened in 2021 to reduce red tape at the border.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn late 2025, a more stringent import standard was reintroduced. But because thousands of overpowered vehicles are already here, this won’t be an overnight fix.\n\nIf we think of non-compliant e-bikes as illegal electric motorcycles, the risks make more sense. Legal motorbikes, whether electric or petrol, are notoriously dangerous. In 2024, 278 riders died, representing 21% of Australia’s road fatalities despite being just 4.5% of registered vehicles. This is one reason the licence test and safety requirements for motorbikes are rigorous. By contrast, riders of these electric motorbikes don’t sit any test and don’t have to register their vehicle.\n\nAustralia doesn’t collect national statistics on e-bike injuries and deaths. What we do know suggests young, usually male e-bike riders are more likely to be injured. Data from the Netherlands and China indicates e-bike riders are more likely to be injured or die than riders of unpowered bikes.\n\nIn the United States, e-bike injuries tend to be much more severe, more like motorbike rider injuries than pedal bikes: pelvic fractures, brain injuries, concussion. When pedal bike riders are injured, just 0.3% die. When e-bike riders are injured, the US figure is 11%.\n\nHow are young people getting access?\n\nOne way young people have been getting these bikes is as gifts from parents.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhy? Reasons include a lack of knowledge about how fast the bikes can go and the risks they present. E-bikes broadly promise more independence for teens and less driving for parents, a benefit many “chauffeur” parents appreciate. The blanket term “e-bike” can make parents think of the overpowered models as just bicycles with a boost.\n\nThe spike in popularity means peer pressure is reportedly a factor. “Rideouts” organised and popularised through social media can draw many riders. On TikTok, these vehicles have become status symbols – “tools of identity and rebellion”.\n\nClosing Pandora’s box?\n\nCoverage in recent months has verged on moral panic. But it’s not helpful to think of e-bikes as a threat. The challenge is protecting the excellent uses of e-bikes while weeding out unsafe models.\n\nAs we have argued, the word “bike” in “e-bike” is misleading. E‑bikes should be treated as a separate category to pushbikes.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nTo help parents and other buyers, we should distinguish between street-legal pedal-assisted e-bikes capped at 25km/h, and illegal electric motorcycles with a throttle and much higher top speeds.\n\nWhat should authorities do?\n\nTo get illegal electric motorbikes off the roads, police would benefit from the ability to test the voltage or top speed of e-bikes, as their UK counterparts do.\n\nOn the legal front, enforcing the newly adopted standard will be essential – not only at the border, but also at points of sale.\n\nBut this won’t be enough, given riders can overclock legal e-bikes by removing built‑in speed restrictions.\n\nHere, authorities could require importers to ensure e-bike software can’t be altered without manufacturer authentication. We already have models for this, such as Queensland’s anti-tampering laws for regulated vehicles such as heavy freight trucks.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nE-bike sellers should be required to display prominent, standardised labels and advise buyers that tampering with speed limiters will void their warranty, insurance and legal road access. It must be clear responsibility falls on the owner and rider.\n\nNew laws could be useful to restrict higher-powered e-bikes to adults, while teens aged 13-17 could access lower-powered pedal-assist models, ideally with mandatory training or licensing.\n\nReal safety requires infrastructure\n\nE-bikes are here to stay. Even if authorities successfully clamp down on the illegal electric motorbikes, there’s much to be done to use these vehicles safely and effectively.\n\nIt might make sense for slower e-bikes to be able to access shared paths and bike lanes, while legal higher-powered e-bikes can use roads.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut in most parts of most Australian cities, bike infrastructure is poor. Bike lanes peter out into traffic and gaps are common. Cycling infrastructure has long been grossly underfunded.\n\nIf we are to keep everyone safe on roads, trails and bike lanes, it won’t be enough just to ban overpowered e-bikes. Safety requires careful laws – and real infrastructure.\n\nThis article is republished from The Conversation. It was written by: Dorina Pojani, The University of Queensland and Richard J. Buning, The University of Queensland\n\nRead more:\n\n\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDorina Pojani has received funding from the Australian Research Council, the Australian Urban Research Infrastructure Network (AURIN), the Queensland Department of Transport and Main Roads (TMR), and iMOVE Australia Cooperative Research Centre.\n\nRichard J. Buning has received research funding from the the Australian Urban Research Infrastructure Network (AURIN), the Queensland Department of Transport and Main Roads (TMR), Brisbane City Coouncil, and iMOVE Australia Cooperative Research Centre.",
    "source": "Yahoo",
    "cluster_id": 32
  }
]