[
    {
        "url": "https://www.9news.com.au/national/rio-tinto-glencore-in-talks-to-merge-mining-company-market-takeover-news/fb8402bb-d483-486b-bb20-f88b42738e8b",
        "title": "Rio Tinto, Glencore in talks to merge, form $300 billion mining behemoth",
        "publish_date": "Fri, 09 Jan 2026 00:30:41 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "One of Australia's biggest companies is in talks to merge with another mining giant .\n\nRio Tinto and Glencore are considering an all-share merger , a move which would turn the two mining companies into a $300 billion behemoth.\n\nRio Tinto is a British-Australian company headquartered in both London and Melbourne and publicly listed in both companies.\n\nMuch of Rio Tinto's Australian operations are in iron ore. (Krystle Wright)\n\nGlencore is an Anglo-Swiss company.\n\nBoth have substantial mining operations in Australia.\n\nThe two companies had been in talks last year, but those discussions ended without an agreement.\n\nIn a market statement this morning, Rio Tinto confirmed new talks were underway.\n\n\"There can be no certainty that an offer will be made or as to the terms of any such offer, should one be made,\" the statement read.\n\nUnder the merger agreement, Rio Tinto would engage in a formal takeover of Glencore.\n\nRio Tinto has until February 5 to announce a \"firm intention to make an offer for Glencore\" or to announce it won't make a deal.\n\n\"A further announcement will be made in due course as appropriate,\" the statement read.\n\nMuch of Glencore's business is tied around coal mining. (Kerrie Smith)\n\nThe merger would create the largest copper mining business in the world.\n\nRio Tinto's shares on the ASX dropped more than five per cent after the announcement.\n\nGlencore is Australia's largest coal producer , operating in NSW and Queensland.\n\nIt also has copper interests in north Queensland, zinc and lead mines in North Queensland and the Northern Territory, and nickel and cobalt in Western Australia.\n\nRio Tinto's Australian operations span across every state but South Australia.\n\nRio Tinto operates massive mines in the Pilbara region. (Rio Tinto)\n\nBoth companies also own embattled smelters in Australia, with Glencore's Mount Isa copper smelter receiving a bailout from the federal and Queensland governments last year.\n\nRio Tinto's aluminium smelter in Tomago was given a support package late last year.\n\nTomago Aluminium was founded in 1983 and produces up to 590,000 tonnes of aluminium per year, making it the country's largest smelter.\n\nBoth Rio Tinto and Glencore have major operations elsewhere around the world.\n\nThe larger of the two businesses, Rio Tinto has a market capitalisation of $202 billion.\n\nGlencore's market capitalisation is about $98 billion.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/teen-charged-with-attempted-murder-following-alleged-stabbing/c43ef877-c7d0-453a-8e85-282f08e89599",
        "title": "Teen charged with attempted murder following alleged stabbing in Sydney's west",
        "publish_date": "Fri, 09 Jan 2026 00:52:31 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "It is understood that the gathering blew up after the short-term rental location was posted on\n\nFacebook\n\n, claiming it was an open house party.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/powerball-victorian-lotto-syndicate-share-in-win-of-more-than-10-million/aade3e41-91ea-40e5-b238-0969681a52d1",
        "title": "Victorian lottery syndicate share in Powerball win of more than $10 million",
        "publish_date": "Thu, 08 Jan 2026 19:02:08 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "There are dozens of Victorians waking up $255,521.65 richer today - but some of them might not know it.\n\nA lottery syndicate of 40 people won more than $10 million, after having one of two division one-winning Powerball entries in Thursday night's draw.\n\nBut that wasn't ﻿all.\n\nThe group, which calls itself 100 PowerHits, also managed to score division two 19 times, division eight 14 times and division nine 29 times, taking their total prize pool to $10,220,866.\n\nA lottery syndicate of 40 people won more than $10 million, after having one of two division one-winning Powerball entries in Thursday night's draw. (Supplied)\n\nHowever, it won't be a party for a group of friends or co-workers after the large haul, with the entry comprising of members unknown to each other.\n\nThey've purchased their syndicate share from 25 different Tatts outlets across Melbourne and Victoria.\n\nSome of these players are registered with The Lott but a number of them aren't, meaning lottery officials need those holding unregistered entries to go and claim their prize.\n\n“If you purchased a share into a group syndicate for the recent Powerball draw, today’s the day to check it,\" The Lott spokesperson Matt Hart said.\n\nPeople who think they may have a winning share can check their ticket in-store, online or via the app.\n\nThe winning numbers in last night's Powerball draw were 16, 25, 17, 15, 27, 7 and 26. The all-important Powerball number was 9.\n\nThe other division one winner was from Western Australia.\n\nThere are many different ways to get help and information about gambling. You can visit the National Gambling Helpline or call on 1800 858 858.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/non-alcoholic-beer-sales-surge-in-australia-heaps-normal/3ab5c033-cd8a-45f4-a0ca-fca9bb6d7f32",
        "title": "Major beer change brewing in Australia after zero per cent sales explode",
        "publish_date": "Thu, 08 Jan 2026 18:18:57 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Head of sales Johnny Tostevin told nine.com.au ﻿he expects the bumper festive sales period won't quite be matched in January even as\n\nalcohol\n\n-free New Year's resolutions kick in or during Dry July.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/trevor-long-tech-review-australian-companies-on-world-stage/8e675316-5be0-46f0-a8dd-52d3b9419922",
        "title": "Australian technology companies making it big on the world stage",
        "publish_date": "Thu, 08 Jan 2026 21:03:28 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "CES is easily the biggest technology trade show in the world, with more than 140,000 industry experts and retail buyers flocking to Las Vegas to see what's new, what's innovative and what might make big sales across the world in the year ahead.\n\nAlongside the biggest brands, such as Samsung, LG, Hisense and Sony, you'll also find small companies trying to make the big time, as well as some successful businesses trying to expand their market share across the world.\n\nHere at the Las Vegas Convention Centre in 2026, 9News has found at least four Aussie companies doing just that.\n\nAustralian tech firm Espresso makes portable ultra thin monitors. (Supplied)\n\nEspresso might sound like a shot of coffee, but in the tech world it's an Aussie business making ultra thin and portable monitors.\n\nOperating out of Sydney and now with offices in Austin, Texas, Espresso's screens have become popular with content creators and other workers who do a lot of work on the go, either out and about or travelling.\n\nThey offer something light and genuinely portable that can fit in a backpack with your laptop, but also has a simple, slim stand to set up when you're working remotely. It's a game changer for many people.\n\nDuring the CES, the company announced a new 15-inch model which is also its first model to come in multiple colours. It is launching first in the US, with an Australian launch expected in the coming months.\n\nFrom selling online direct to consumers, to clinching a deal to showcase their products in JB Hi-Fi and now in Costco across the US, the company has a strong growth trajectory. A show such as CES exposes them to even more buyers from around the world.\n\nAustralian company RØDE is displaying its range of clip-on microphones. (Supplied)\n\nRØDE started out as a premium microphone brand, manufacturing products in Sydney, it became the go-to brand for on-camera microphones in the YouTube boom.\n\nNow in the social media generation, it has expanded its range to include small clip-on microphones used by content creators among many others.\n\nThe company has also expanded into audio and video podcast production, and at CES has been showcasing upcoming products in this space to content creators at the main convention hall.\n\nThat a company the size and scale of RØDE could come out of Australia in the first place is an achievement to be proud of, but even more so they still manufacture in Sydney is a \"Made in Australia\" badge of honour on show to the world at CES.\n\nREAD MORE: Boom in technology jobs across Australia ﻿\n\nSome of the smartphone accessories made by Australian tech company STM Goods. (Supplied)\n\nSTM Goods started in the Sydney suburb of Bondi by a couple looking to make stylish and durable smartphone accessories. Today, it makes a huge range of accessories and backpacks among much more.\n\nIts showcase stand at CES is the largest of all these Aussie companies, showing off its large range and colourful offerings, and using a well-worn conference trick of gifts at the stand to attract huge numbers and queues of people to the STM booth.\n\nA show like CES and other global trade shows allows STM to find more retail companies across the world to sell its range and expand their global footprint and market share.\n\nAt the other end of the spectrum is Aussie start-up Strapsicle. Attending CES to showcase its new iPad mini case, Strapsicle makes a silicone case for iPads and Kindle e-readers that allows you to hold the device in the palm of your hand, making reading, drawing or interacting even easier.\n\nCo-founder and chief executive Louise Rice said: \"What started as an unfortunate incident in a moment of post-partum sleep deprivation, which led me to dropping my Kindle e-reader on my newborn son's head, has turned out to be one of the greatest accidents of all time.\"\n\nAustralian start-up Strapsicle makes accessories for e-readers and Kindles. (Supplied)\n\n\"We're a small, scrappy start-up who is delivering a series of products for the most popular mobile devices in the world, as customers find not only tremendous convenience when using them to hold their device, but more importantly they're also finding overwhelming health benefits while using our straps, which is very rewarding to my partner and I.\"\n\nWho knows, Strapsicle might be noticed at CES by a major retail brand from around the world and take the company to all new levels.\n\nTrevor Long travelled to Las Vegas with support from Hisense, LG, Reolink, LEGO and Samsung.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/kyrgios-says-he-will-not-be-seeking-an-aus-open-wildcard/106213610",
        "title": "Kyrgios says he will not be seeking an Aus Open wildcard",
        "publish_date": "Fri, 09 Jan 2026 01:33:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "Nick Kyrgios has conceded he is not up to playing singles at the Australian Open, ruling himself out of a likely wildcard.\n\nThe local crowd-puller was tipped to receive one of the three remaining wildcards from Tennis Australia.\n\nBut he announced on social media on Friday he would only play doubles with great mate Thanasi Kokkinakis at Melbourne Park, with the tournament getting underway on January 18.\n\nMultiple wrist and knee surgeries have limited Kyrgios to just seven singles tour matches over the past three years, with his ranking plummeting to 670.\n\nThe 30-year-old's most recent singles match lasted just 66 minutes — a 6-3, 6-4 loss to American Aleksandar Kovacevic at the Brisbane International earlier this week.\n\nKyrgios, who reached the 2022 Wimbledon final, said his body was not yet ready for five-set tennis and wanted the wildcard to go to someone who could \"make their moment count\".\n\nNick Kyrgios will still team up with Thanasi Kokkinakis for doubles at Melbourne Park. (AAP: Zain Mohammed)\n\n\"After some good conversations with TA, I've made the call to focus on doubles for this year's AO,\" he wrote in an Instagram story.\n\n\"I'm fit and back on court, but five-setters are a different beast, and I'm not quite ready to go the distance yet.\n\n\"This tournament means everything to me, but I'd rather give my spot to someone who's ready to make their moment count.\n\n\"It's all building blocks, and I'll be back next year and pumped to compete.\"\n\nFormer champion Stan Wawrinka, aged 40, appears a near certainty to get one of the wildcards.\n\nWawrinka had already announced this year would be his final season on tour, giving fans in Melbourne a chance to farewell the 2014 Australian Open winner.\n\nWawrinka showed he has plenty of fight left in him with a gutsy three-set win over world number 27 Arthur Rinderknech at the United Cup last weekend.\n\nJordan Thompson, whose injury-plagued 2025 campaign saw him drop to 113th in the world, and fellow Australian Chris O'Connell (114th) would also be deserved recipients.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/rio-tinto-in-talks-to-take-over-glencore-mega-miner-merger/106213252",
        "title": "Rio Tinto in merger talks with Glencore but total takeover not the only option",
        "publish_date": "Fri, 09 Jan 2026 01:00:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mining giant Rio Tinto is in talks to take over Swiss group Glencore, in a move that could create the world's largest resources company.\n\nIf a deal eventuates, the combination of Rio, which owns mines worldwide including extensive iron ore operations in WA's Pilbara, and miner and trader Glencore would potentially be worth more than $US200 billion ($298 billion).\n\nThe companies said options under discussion included a complete takeover through a scheme of arrangement in which Rio would buy all the shares in Glencore.\n\nShares in Rio fell more than 5.5 per cent on Friday morning on news of the merger talks, which were first reported by the UK-based Financial Times.\n\nA merged company would be especially strong in copper, which is booming amid soaring demand for the metal.\n\nGlencore is among the world's 10 biggest copper producers, with mines including operations at Mt Isa in Queensland.\n\nRio owns 30 per cent of the world's biggest copper mine, Escondita in Chile, and controls what will be — when fully operational — the world's fourth-biggest copper mine, Oyu Tolgoi in Mongolia.\n\nGlencore is one of Australia's largest coal producers, with 13 operational mines across NSW and Queensland. (Reuters: Arnd Wiegmann)\n\nIn a complete takeover, the merged company would be the biggest resources group in the world, eclipsing current number one BHP.\n\nBut a smaller deal is also possible, as it is not clear that Rio would want to take on Glencore's coal assets or its substantial commodities trading business.\n\nRio dumped the last of its coal mines in 2018.\n\nGlencore is the world's largest producer of the fossil fuel but has previously considered spinning its coal mines, which include 13 in Australia, out into a standalone company.\n\nFebruary 5 deadline for Rio to make offer\n\nRio faces a race against time to put together any formal bid — it is listed on both the ASX and the London Stock Exchange, and strict UK takeover rules mean it has until February 5 to make an offer to shareholders or walk away.\n\n\"A Glencore-Rio Tinto merger can spur a mining behemoth with market capitalization exceeding $US200 billion, yet the ultimate size might be smaller, as a clean, all-asset combination appears improbable,\" Bloomberg analysts Alon Olsha and Grant Sporre said.\n\n\"Agreement on terms and structuring won't be straightforward.\n\n\"Rio wants Glencore's copper assets but not its coal portfolio, we believe, though such assets could be carved out.\n\n\"Glencore's trading arm would sit uneasily within Rio's operating model, given cultural differences. Yet the chance to actively trade Rio's vast iron-ore volume might be too hard to ignore.\"\n\nGlencore grew from a commodity trading business founded in the 1970s by Marc Rich, an American who fled the country after being charged with tax fraud and was pardoned by Bill Clinton on his last day in office.\n\nRio Tinto was founded in 1873 and is named after the river in Spain that was the site of the company's first mine — a copper operation that at the time was the world's largest.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/martinelli-disgraceful-act-towards-injured-liverpool-player/106213400",
        "title": "Martinelli apologises for 'disgraceful' act towards injured Liverpool player",
        "publish_date": "Fri, 09 Jan 2026 00:59:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Arsenal forward Gabriel Martinelli was branded \"disgraceful\" after trying to push injured Liverpool player Conor Bradley off the pitch near the end of their 0-0 Premier League draw.\n\nBradley fell awkwardly near the touchline in stoppage time and Martinelli clearly thought he was time-wasting, throwing the ball at him before manhandling him.\n\nLiverpool's players reacted angrily and after the ensuing melee, Martinelli and Liverpool's Ibrahima Konate were booked.\n\nNorthern Ireland full-back Bradley was eventually taken off the field on a stretcher in obvious distress. There are fears he has injured his ACL, with scans to come.\n\nSky Sports pundit Gary Neville said Martinelli's actions had left him fuming.\n\n\"You cannot do that. That is so poor. I think an apology is needed,\" the former Manchester United defender said.\n\n\"Bradley is being stretchered off. I'm fuming with Martinelli, to be honest. Disgraceful. I'm surprised a Liverpool player hasn't gone over and whacked Martinelli there!\"\n\nFellow pundit Roy Keane also criticised the Brazilian forward.\n\n\"I didn't like it. It's happened to me when I was badly injured and a player stood over me, and it's not good … I'm surprised the Liverpool players didn't react to Martinelli more. I think that behaviour is an absolute disgrace. Not good scenes,\" Keane said.\n\nMartinelli said on social media he had apologised to Bradley and was not aware of the extent of his injury at the time.\n\nLiverpool manager Arne Slot said he \"feared the worst\" for Bradley, although he was measured in his criticism of Martinelli.\n\n\"I am 100 per cent sure that if he knew what the injury might be, he wouldn't do that,\" the Dutchman said.\n\n\"But it doesn't look great if Bradley has the injury we think he has.\n\n\"You don't like to see a player being moved if he might have an injury.\"\n\nArsenal manager Mikel Arteta said Martinelli would never have tried to move Bradley if he thought he was injured.\n\n\"Probably he doesn't know because knowing Gabi, there is zero intention,\" the Spaniard said.\n\n\"I don't know what happened to Conor, but hopefully it's not bad. But, obviously, there is no intention from Gabi to do anything bad to him.\"\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/angela-jones-journey-to-becoming-number-one-jockey-in-queensland/106158424",
        "title": "How a horse-mad girl from the outback became queen of racing in Queensland",
        "publish_date": "Thu, 08 Jan 2026 23:05:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Angela Jones can still remember being bucked off her pony onto a prickle bush as a kid on the family farm.\n\nThen there's her first horse that her father, Jason, bought for a carton of beer.\n\nNot to mention taking an equine companion along with her to boarding school in the outback.\n\nThose childhood experiences helped Jones, now 24, on her history-making journey to becoming the new queen of horse racing in Queensland.\n\nAngela Jones was introduced to horses at a young age growing up in central Queensland. (Supplied: Angela Jones)\n\n\"I was thrown on a horse when I was probably two years old and led around following Dad,\" Jones said.\n\n\" I learned to ride probably before I could remember so it always came very natural to me. \"\n\nGrowing up on a cattle and grain station an hour from the central Queensland town of Clermont, about 10 hours north-west of Brisbane, Jones was always destined for a life around horses.\n\n\"My first horse was a little Welsh mountain pony called Starlight that Dad bought for a carton of beer,\" Jones said.\n\n\" She knew every trick in the book and where all the prickle bushes were. \"\n\nThe Jones family: Angela (centre, front) with her sisters, father Jason and mother Julie. (Supplied: Angela Jones)\n\nLearning the ropes\n\nThe second youngest of five daughters, Jones and her siblings, Megan, Emily, Katie and Louisa, were homeschooled by their mother, Julie.\n\n\"We did a lot more outside than we did inside and I remember we used to get our schoolwork done really quick,\" Jones said.\n\n\"The rest of the day would be poking around, doing whatever Dad was doing, whether that was cattle work or mustering.\"\n\nAngela Jones picked up the horse-racing bug on the bush tracks at Charters Towers in western Queensland. (ABC News)\n\nThose flexible school hours were reluctantly replaced by boarding school in Charters Towers when Jones was \"15 or 16\".\n\nJones wasn't going easily … or alone.\n\n\"I said, 'I'm not going to boarding school unless I can take a horse' and, lucky enough, Mum found a school for us where we could take a horse,\" she said.\n\nAfter completing her schooling in the Northern Goldfields, the local sand racetrack became her new classroom, where Jones began to learn the craft of \"race\" riding.\n\nAngela Jones back home mustering cattle on the family farm. (Supplied: Angela Jones)\n\nAfter meeting outback horse trainer Robert Kirkwood, Jones's sliding-doors moment came in her gap year after finishing school.\n\n\"They have yearly amateur races at Charters Towers, and Racing Queensland [RQ] had a little booth there,\" she said.\n\n\"I met [former jockey and RQ apprentice coach] Shane Scriven and walked up to him and said, 'I want to be an apprentice jockey, can you point me in the right direction of a good trainer?'\"\n\nThese days, Angela Jones is riding a wave of success in the fiercely competitive Brisbane riding ranks. (Supplied: Michael McInally/Racing Queensland)\n\nBush to the big smoke\n\nJones's long road from the bush to the big smoke would take her to the stables of leading Toowoomba horseman Lindsay Hatch and eventually to Queensland's premier trainer Tony Gollan.\n\nA naturally gifted rider, her path towards becoming a professional jockey was fully in motion.\n\n\"I had been watching [Angela] for a little while and she had the potential to be a metropolitan-standard apprentice,\" Brisbane-based Gollan recalled.\n\n\" She's got exceptional balance on horses, and horses really run and travel for her, and that's what you look for when kids first start off. \"\n\nTony Gollan has helped mentor Angela Jones and fellow rising star Emily Lang, an apprentice jockey. (Supplied: Michael McInally/Racing Queensland)\n\nAfter riding winner after winner and breaking records during her apprenticeship, Jones created history last season when she became the first female rider to win the Queensland metropolitan jockeys' premiership.\n\n\"I remember when Angela won the apprentices' title, she looked across and said, 'I want to win [the jockeys' premiership] one day' and now she's done that,\" Gollan said.\n\n\"She's not going to rest on her laurels, and she's obviously put herself in a position [where] she can win it more than once.\"\n\nAngela Jones is quickly making a name for herself with her cool and calm nature with horses. (Supplied: Michael McInally/Racing Queensland)\n\nGollan, who also claimed his 12th straight Queensland metropolitan trainers' premiership, said there was a sense of pride for what Jones had achieved.\n\n\"She's a lovely kid and comes from a nice family,\" he said.\n\n\" What you see is what you get, and you don't ask much more in people than that. \"\n\nRide like a girl\n\nJones is just one of a growing number of jockeys when it comes to the female revolution in the riding ranks.\n\nFemale jockeys make history in Toowoomba Five female jockeys have made history by winning all seven races on the card at a single meet in Toowoomba.\n\n\"Our female participants continue to play a crucial role in Queensland's industry and are changing the face of racing in the Sunshine State,\" RQ acting chief executive officer Lachlan Murray said.\n\n\"More broadly, there continues to be a strong female presence amongst Queensland apprentice jockeys, with 51 of the 64 being female.\"\n\nThe shift in numbers is even more evident when the 42 trackwork riders currently enrolled in a Certificate III in Racing (trackwork rider) are included.\n\nAngela Jones hitting the front on a racehorse is a regular sight on Queensland racetracks. (Supplied: Michael McInally/Racing Queensland)\n\nThere are 35 females and seven males in the program, and in recent times, female riders won every race at meetings at Atherton and Gayndah.\n\nAs Jones prepares to chalk up more winners ahead of Queensland's richest race day, the Gold Coast Magic Millions on January 17, she has also set her sights on breaking more new ground in the industry.\n\n\"I'd really like to win a Group 1 [race],\" she said.\n\n\"I've got a Group 3 and a Group 2 now and I think that's the thing missing for me.\"\n\nAngela Jones is hunting for Group 1 glory at the Gold Coast Magic Millions. (Supplied: Michael McInally/Racing Queensland)\n\nIt's been a whirlwind ride for Jones, but the determined young woman from a cattle farm in central Queensland always remembers her roots.\n\n\"I was lucky enough to get a win on my very first day I went to the races and it was such an unreal feeling … I remember thinking, 'I'm actually a jockey,'\" she said.\n\n\" It has been quite the journey and how far I have come, but I'll never forget my upbringing and that's been a big part of the success I've had. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/selfless-act-saves-man-anaphylactic-shock-on-wa-virgin-flight/106209770",
        "title": "Man 'saved' by selfless act during anaphylactic shock on WA flight",
        "publish_date": "Thu, 08 Jan 2026 21:59:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "A routine flight to a mining hub in Western Australia has narrowly avoided an emergency landing amid a life-or-death scenario on board.\n\nAndrew Rawle, a resident of Newman, 1,170 kilometres north-east of Perth in the Pilbara region, found himself suffering anaphylactic shock minutes into a Virgin Australia flight to the remote mining town on Sunday, January 4.\n\n\"I was offered some food by the cabin crew — a little plate of cheese and crackers,\" Mr Rawle said.\n\nMr Rawle, who has allergies to nuts and some medications, said he felt his throat closing.\n\n\"I just immediately jumped up, knowing that in my hand luggage I had an EpiPen,\" he said.\n\n\"Very clearly, the cabin crew could see there was something wrong … I'd gone incredibly tomato red and I asked the cabin crew through a very strained voice: 'Can I just quickly swing behind the curtain and jab myself in the leg?'\"\n\nOrdeal was not over\n\nAfter the injection, he began to breathe again — but it wasn't over yet.\n\n\"About 20 minutes after, it seemed like a wave or another episode was coming along, and my throat started to tense up again,\" Mr Rawle said.\n\nHe said the cabin crew leapt into action, providing him with oxygen, and called for a doctor.\n\nThe incident occurred on a Virgin Australia flight from Perth to Newman. (ABC News: Cody Fenner)\n\nWhen none were available, they asked if anyone had an EpiPen.\n\n\"Then a lovely young lady, a stranger to me, pressed the call button and delivered me an EpiPen, which I then jabbed into my other leg,\" Mr Rawle said.\n\nBut still the drama wasn't over, and he knew another wave was likely.\n\nSo, in Mr Rawle's words, the pilots \"absolutely punched it\" to Newman.\n\n\" I think one of the other passengers said that her children were screaming with delight because it felt like a roller coaster ride. \"\n\nHe was met by a waiting ambulance and received adrenaline before he was rushed to Newman Hospital.\n\nMr Rawle said it was the most extreme reaction he had ever had.\n\nVirgin Australia declined to comment on the incident.\n\nIt is understood that cabin crew are taught to manage anaphylaxis as part of their aviation medicine training.\n\nEpiPens are carried on the majority of Virgin Australia services, but an emergency medical kit was not available on Mr Rawle's particular flight.\n\nAn ambulance was waiting for Mr Rawle at Newman Airport. (Supplied: East Pilbara Shire)\n\nThanks given, but not necessary\n\nMr Rawle said without the quick actions of the flight crew and the woman who gave him the EpiPen, he could have died.\n\n\"I don't think we'd have made it anywhere, either to Newman or an alternate airport, had that passenger not put their hand up,\" he said.\n\nUpon his recovery, he emailed Virgin Australia to compliment the staff.\n\nWithout a second EpiPen, the flight may have had to deviate for an emergency landing. (ABC News: Emily Anderson)\n\n\"I'm very happy with the service that they provided outside of the normal scope of their jobs,\" he said.\n\nHe also contacted his saviour on social media — when he found her, he offered to thank her in multiple ways, ranging from a carton of beer to a donation in her name.\n\n\" She declined — she's just a wonderful, wonderful person. \"\n\nTheories abound\n\nHaving only had food that contained no allergens, Mr Rawle was perplexed as to what caused the extreme reaction.\n\nBut he had a theory.\n\nIt being a new Embraer E190-E2 plane, Mr Rawle picked up the provided safety card for the first time.\n\n\"The only theory that I can come up with is that on a previous flight, perhaps a passenger had been served some fruit and nuts, or something in their food that has found its way onto that safety information card,\" he said.\n\n\"Or perhaps some cheeky passengers stuffed a little bit of rubbish into the seat pocket, and I've touched it.\"\n\nFrom there, it would have been a simple transfer from his fingers to his mouth to set off the reaction.\n\nMr Rawle said he would definitely be taking some lessons away and would \"relive the COVID days\".\n\n\"Gloves, masks, seven EpiPens in the bag,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/airport-lost-luggage-auctions/106078890",
        "title": "'Airport brain': The weird things Aussie travellers leave behind every year",
        "publish_date": "Thu, 08 Jan 2026 21:47:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "As Australians hit the skies for the summer holidays, airports are preparing for more than just long queues and crowded terminals.\n\nThey are also gearing up for a surge in lost and forgotten luggage.\n\nEvery year, tens of thousands of items are abandoned at airports — from laptops and surfboards to jewellery and even prosthetic legs.\n\nBrisbane, Sydney and Melbourne airports regularly auction off unclaimed property, with hundreds of items going under the hammer each year and thousands of dollars raised for charity.\n\nBrisbane airport spokesperson Peter Doherty says travellers fall victim to \"airport brain\". (ABC News: Mary Lloyd)\n\n\"Even the most organised travellers fall victim to what we call 'airport brain,'\" Brisbane Airport spokesperson Peter Doherty said.\n\n\"When you're juggling passports, boarding passes, and family plans, it's easy to leave something behind or decide to leave a bag that is too heavy for carry-on.\"\n\nBrisbane Airport recently held one of its biggest lost property auctions, with hundreds of items up for bidding online, including a Bulgari 18-carat gold diamond necklace valued at $11,000 that started with a reserve of just $1.\n\nThe bidding for this Bulgari necklace started at just $1. (Supplied: Brisbane Airport)\n\nOther items included laptops, tablets, drones, cameras, boogie boards, surfboards, scooters, musical instruments, fitness equipment, prams, sewing machines and vacuum cleaners.\n\nSydney Airport's annual lost property auction raised more than $250,000 for charity in 2025.\n\nMelbourne Airport auctions about 1,000 items each month, generating tens of thousands of dollars a year for local community groups.\n\nA lone blender at the Sydney Airport is just one of 7,000 items left behind at the airport each year. (ABC News: Mary Lloyd)\n\nMr Doherty said luggage and size restrictions played a big role in abandoned items.\n\n\"Travellers often realise their bags are overweight, so they leave behind that set of golf clubs, computer monitor or surfboard,\" he said.\n\nHow Australia's busiest airport handles lost and forgotten Items\n\nSydney Airport sees more than 40 million passengers each year, with about 120,000 people passing through daily.\n\nHundreds of items are handed to the airport's dedicated team of five lost property workers every day, ranging from wedding dresses and air fryers to vacuum cleaners, CPAP machines and adult toys.\n\nSydney Airport spokeswoman Liz Seatter said more than 7,000 items were returned to their owners last year.\n\nAll goods are catalogued, entered into a database, and stored securely. (ABC News: Mary Lloyd)\n\nShe said the airport only managed items left in the terminal, not on planes. All goods are catalogued, entered into a database, and stored securely, she said.\n\n\"The team takes so much care. A woman lost a necklace that belonged to her daughter — she wanted to take a piece of her daughter with her overseas. The team searched, and a few days later it was handed in and returned to her,\" Ms Seatter said.\n\n\"Another woman lost a single costume-jewellery earring that was important to her, and the team managed to find that too.\"\n\nLynee Truong and Maree Foley are one of five Sydney Airport employees that work to reunite travellers with their lost goods. (ABC News: Mary Lloyd)\n\nTravellers feel the cost\n\nLast year, Leigh Richards left his iPad on a plane after landing at Sydney Airport.\n\n\"It was one of the first times I was travelling alone with my daughter, who was about five at the time, and we were on a red-eye flight. Everything happened in a bit of a blur — we got off the plane, packed up, and gathered all of Nora's things that she'd scattered around the seats,\" Mr Richards said.\n\nLeigh Richards left his iPad on a plane, and wasn't able to recover it. (ABC News: Mary Lloyd)\n\nIt was several days later before he realised his iPad was missing. Using the Find My app, he tracked it to Sydney Airport's domestic terminal.\n\n\"I showed them the map, and they told me it was in one of the airport hangars. I couldn't get airside to check it myself, and they couldn't send anyone to retrieve it, so I was stuck,\" he said.\n\n\"It was frustrating. It was a valuable piece of equipment, and there should have been a better system to track it. I checked back occasionally to see if it had been found or auctioned, but as far as I know, it never turned up.\"\n\nA pile of multiple Airpods at the Brisbane Airport auction. (Supplied: Lloyds)\n\nThe global cost of lost luggage\n\nMishandled baggage is more than just a quirky holiday problem — it costs airlines billions each year.\n\nGlobal IT provider SITA estimates mishandled luggage costs carriers about $5 billion annually.\n\nWhile two-thirds of bags are returned within 48 hours, millions of items remain unclaimed worldwide.\n\nIn the United States, retail store Unclaimed Baggage has turned abandoned airline luggage into a business. Items left unclaimed after a 90-day search are cleaned, repaired, and sold.\n\nSome of these items include a toilet seat, a freeze-dried chicken foot, and a diamond ring valued at about $60,000.\n\nUnclaimed Baggage is the United States' only retail shop for lost goods. (Supplied: Unclaimed Baggage)\n\n\"Left-behind luggage gives us a snapshot of passengers' lives,\" Unclaimed Baggage spokeswoman Sonni Hood said.\n\n\"It connects those snapshots into a bigger picture, capturing unique insights into how we move, what we value most, and how packing habits evolve over time.\"\n\nHow to recover lost luggage\n\nIf you leave something behind in a terminal, car park or express pick-up area, contact the airport's lost property office as soon as possible.\n\nItems left on board a plane are usually handled by the airline.\n\nProviding clear details — including a description, when and where it was lost, and photos — can speed up recovery.\n\nA table full of gold and silver rings left behind at the Brisbane Airport. (Supplied: Lloyds)\n\nTips to avoid losing your luggage: Use baggage tracking technology, such as RFID tags or personal trackers like AirTags\n\nClearly label your luggage inside and out with contact details\n\nPhotograph your bag and valuables\n\nRemove old airline stickers to prevent confusion\n\nArrive early to reduce stress and avoid \"airport brain\"\n\nKeep valuables in your carry-on\n\nConsumer advocacy group Choice also recommends checking travel insurance carefully and never leaving items unattended, as insurers may not cover unattended losses.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/top-tips-for-learning-a-musical-instrument-or-taking-up-singing/106206612",
        "title": "It's never too late to learn a musical instrument (or how to sing)",
        "publish_date": "Thu, 08 Jan 2026 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "For many of us, the new year brings a jolt of motivation.\n\nThis might include learning a new musical instrument, taking up singing, or returning to music after a break.\n\nThe good news is that learning music doesn't have an age limit.\n\n\"Just make a start! It's never too late,\" Susan told us, when we asked ABC Classic social media audiences about their journey.\n\nLearning music has many benefits including the chance to make new friends and improved physical fitness (especially when breathing is involved). It can also be a highway to feeling good.\n\nWe round up the collective wisdom from ABC Classic audiences, and some experts, to help you make your musical goals into a reality.\n\nBe kind to yourself\n\nLet's start with self-compassion.\n\nLike any skill, learning music can be hard, especially if you're new, or haven't played or sung for a long time.\n\n\"Be kind to yourself. Give yourself credit for making progress. Watch [that] your inner voice isn't too critical,\" says Rachel on social media.\n\nHarpist and ABC Classic presenter Genevieve Lang has first-hand experience. In 2025 she started learning piano again after a long break.\n\nWhy some of us quit playing music and how to restart after a long break Older adults can still reap the benefit of learning new instruments or singing later in life.\n\nEven as a professional musician, Lang isn't immune to the voice of her \"harsh inner critic.\"\n\nShe says acknowledging when self-criticism isn't helpful is one way to encourage self-compassion.\n\nThis is really important to remember, especially when you compare yourself to musicians you see on TV or listen to on the radio.\n\nAudience member Phil puts it beautifully: \"At whatever level you're at, you can still make music. More experience is simply that.\"\n\n\"It's not a race,\" Amanda echoes.\n\n\"You may not reach concert pianist or star [of the stage status], but you will get great joy,\" Rosie says.\n\nInvest in a good instrument\n\nABC Classic presenter, music teacher and author, Ed Le Brocq, advises people to \"play the instrument that makes the sound that you really love.\"\n\nYou can be more motivated to practise if you like the sound of your instrument. (Unsplash: Johanna Jordan)\n\nGina says that's because \"practice is easier if you enjoy the timbre, and practise you must.\"\n\nFor singers, Dawn adds: \"Find your voice range and just do it.\"\n\nOur experts and audiences also stress the importance of finding a good quality instrument.\n\nIf buying a new instrument is out of your budget, Le Brocq and Lang say you can hire one for a more affordable option.\n\nBoth have also picked up new instruments as adults, even though they are already professional musicians.\n\n\"Playing the harp is a joy, but it's also a job for me,\" Lang shares.\n\n\"[On the other hand], playing the piano was just intended for pleasure.\"\n\nPractise consistently and often\n\nLearning an instrument or singing requires consistent practice. That means daily commitment and effort.\n\nBut the good news is that you can practise in increments.\n\nJocelyn shares: \"Short practises for a few minutes at a time every day achieve more than a block of time once a week.\"\n\nOr in Le Brocq's words: \"Practise on the days you clean your teeth.\"\n\nGetting your kids to practise their musical instrument might be easier than you think Experts share some top tips to establish a routine to practise music, even for busy families.\n\nOut of sight can be out of mind, so Veronica has a strategy: \"Keep your instrument assembled and in view.\"\n\nLang made progress with learning the piano by putting \"a little digital weighted keyboard right in the middle of the living room.\"\n\nAs a single mum with two kids, the setup makes it easy for Lang to practise whenever she has a spare few minutes.\n\n\"Tiny moments of practice can add up and change begins,\" shares Kathleen on social media.\n\nLang also stresses that progress might not be linear.\n\n\" Although consistent practice builds your ability at the instrument, some days are going to be harder and you're going to make more mistakes. \"\n\nConsider taking music lessons\n\nWhether you want to play the bongo or sing, starting with a good teacher and learning some music theory can make your goals easier to maintain.\n\n\"Put time into learning the basics of music theory, including reading music and clapping rhythms,\" suggests audience member Tony.\n\n\"This knowledge is transferable to any instrument.\"\n\nMargaret says: \"Find a good teacher, even if just for a few lessons.\"\n\nAsking your social network might be a good place to start, according to Le Brocq.\n\n\"Talk to people, find recommendations, follow your gut about whether you like them or not,\" he says.\n\nMany teachers offer trial sessions before you commit to something more long-term.\n\nLearning to read music and clap rhythms can help you master any number of instruments or sing. (Unsplash: Gruescu Ovidiu)\n\n\"If you find attending lessons is a stressful and nerve-racking experience, no matter how much practice you've done, change your teacher,\" Margo says.\n\nFind a supportive community\n\nLearning music can open opportunities to meet new people and make new friends.\n\n\"Whether you're self-taught, or have formal lessons, look for a community music group or choir where you can enjoy making music in a supportive social setting,\" Jill says.\n\n\"It's so much more fun than practising in isolation.\"\n\nAudience members point out that playing with others can give you a reason to practise.\n\n\"It's the best way to improve and you'll have lots of support along the way,\" Katie says.\n\nLang attributes having an accountability buddy as one reason for her success in learning the piano.\n\nShe and fellow ABC Classic presenter Russell Torrance regularly post their progress on social media.\n\nLoading Instagram content\n\nRemember that music is enjoyable and rewarding.\n\nWe know that learning music can be fun as well as challenging.\n\nSome affirmations from audiences and experts might help you along the way.\n\nYour music questions answered Music Class is a weekly deep dive with Ed Le Brocq and Genevieve Lang into all things music, including musical terms, notation, theory and much more.\n\n\"Don't let perfection be the enemy of the good. Take joy wherever you are in your musical journey,\" Janet says.\n\nFor the shy singers among us, Nic says: \"You have to sing in order to learn to sing.\"\n\nWhen you find things hard, Bronwyn says: \"Remember that it's good for you, even if you're not good at it.\"\n\nAnd if you keep making mistakes, Elisa says: \"Don't practise until you get it right — practise until you can't get it wrong.\"\n\nLe Brocq suggests treating the sound of performers you admire as inspiration, rather than a bludgeoning tool.\n\n\"Don't feel bad that your sound isn't there yet,\" he says.\n\n\" Trust the process. Do your practice, do it regularly and you'll get there. \"\n\nSign up to the ABC Classic Newsletter",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/asx-markets-business-live-news-jan-2025-9/106212732",
        "title": "Live: Rio Tinto stock tumbles on mega merger talks, dragging down ASX",
        "publish_date": "Thu, 08 Jan 2026 20:44:17 +0000",
        "category": "finance",
        "authors": [
            "Yiying Li",
            "Ben Butler",
            "David Chau",
            "Emilia Terzon"
        ],
        "text": "The two companies locked in talks to potentially create the world's biggest resources companies both mine iron ore and copper.\n\nA merger would bring together two very different players with one key thing in common: an interest in beefing up production of copper, which is booming amid increasing demand and a supply shortage.\n\nRio Tinto is listed on the ASX and the London exchange. It was founded by British businessmen in 1873 to buy a copper mine on the Spanish river of the same name.\n\nThey got it cheap and the company's now the second biggest miner in the world behind BHP.\n\nLike BHP it enjoys a steady flow of cash from its iron ore mines in WA's Pilbara, which produce high quality ore primarily for the Chinese market.\n\nIn 2020, Rio caused global outcry when it blew up 46,000-year-old rock shelters at Juukan Gorge in the Pilbara as part of a mine expansion.\n\nThe scandal led to the resignation of chief executive Jean-Sebastian Jacques and an overhaul of Rio's Australian operations.\n\nRio owns 30 per cent of the world's biggest copper mine, Escondita in Chile (BHP is the majority owner) and is developing the vast underground Oyu Tolgoi deposit in Mongolia, which is set to be the world's fourth-largest copper mine when fully operational.\n\nMeanwhile, Glencore is listed in London but based in Switzerland. Its roots lie in trading house Marc Rich & Co, founded by American Marc Rich in 1974.\n\nIn 1983, Rich was indicted by the US authorities for tax evasion, wire fraud and racketeering. Rather than face the charges he fled until he was pardoned by Bill Clinton on his last day in office in 2001 — a controversial move as Rich's wife was a big donor to the Democratic party.\n\nGlencore was formed in 1994 and merged with another Swiss resources group, Xstrata, in 2013, turning it from mostly a trader into a serious miner that now has interests in coal, iron ore and copper.\n\nIt is a top 10 copper producer from mines including at Mt Isa in Queensland.\n\nRich died in 2013.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/nt-pokies-community-contributions-member-perks-renovations-foi/106084120",
        "title": "NT pokies clubs claiming members' perks as giving back to the community",
        "publish_date": "Thu, 08 Jan 2026 20:42:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Free ice and WiFi for members, lavish renovations and free venue hire for members' birthday bashes are among the causes the Northern Territory's pokies clubs are claiming as \"community contributions\".\n\nPubs and casinos in the NT are charged a 10 per cent levy on poker machine losses, which goes into the government's Community Benefit Fund before being paid out through grants to community and sporting organisations, and for gambling research and harm minimisation.\n\nNightcliff Sports Club reported more than $600,000 in in-house renovations and furniture as part of its contribution to the wider community. (ABC News: Pete Garnish)\n\nMeanwhile, not-for-profit clubs that rake in millions in pokies revenue each year are required to publicly report their total Community Support Contributions (CSC) under a separate, voluntary scheme designed to redistribute gambling losses to the wider community.\n\nThe most recently published figures show the NT's 20 clubs contributed almost $4 million in \"cash\" and another $1.6 million \"in kind\" from a total gaming machine revenue of more than $41 million in 2023-24.\n\nBut documents obtained by the ABC under Freedom of Information laws have revealed the majority of the clubs' so-called \"cash\" contributions are actually being spent on themselves and their affiliated sports teams.\n\nMore than half of Silks Darwin's \"community contributions\" came in the form of money collected from members of the public through raffles and meat trays rather than from pokies revenue. (ABC News: Pete Garnish)\n\nRaffle takings, meat trays, big screen TV among so-called contributions\n\nDespite a requirement at the top of each reporting statement that contributions \"must be for the benefit of the general public or community\", clubs chalked up thousands in members' perks, venue renovations and a \"big screen digital TV\" in the second half of 2024.\n\nThe Nightcliff Sports Club reported a $585,000 \"cash\" contribution in the form of an \"upgrade of club infrastructure\" and another $28,000 for \"furniture\" for the benefit of \"members, affiliates, guests and community\".\n\nCazalys Palmerston's community contributions included a $115,000 sponsorship deal with AFLNT alongside a $214 donation to Dolly's Dream and a $263 donation to the Make-A-Wish Foundation.\n\nIn Alice Springs, the Gillen Club reported a new patio and outdoor furniture to the value of $48,535 for the benefit of \"patrons of the club\" as contributions to the wider community.\n\nThe documents also show in the last six months of 2024, multiple clubs reported donations to charity by members of the public as CSCs, boosting their totals without costing a cent in pokies revenue.\n\nThe Gillen Club in Alice Springs reported a new patio and outdoor furniture to the value of $48,535 for the benefit of \"patrons of the club\". (ABC News: Xavier Martin)\n\nSilks Racing Darwin reported $22,877 in donations that were actually made by club patrons through \"raffle takings\" and \"meat trays\", in more than half the club's total \"cash\" contribution.\n\nNT clubs 'whitewashing' pokies revenue through 'opaque' benefit scheme Pokies clubs in the Northern Territory are contributing as little as 0.01 per cent of their millions in pokies revenue to a scheme meant to return gambling losses to the community.\n\nDuring the same period, the Nightcliff Sports Club reported $10,000 in donations to the RSPCA and CareFlight via money raised through \"collection tins on the club bars\".\n\nOther clubs reported $1,500 in expenditure on six months' worth of complimentary ice for members and $200 for free venue hire for a member's 50th as \"in-kind\" community contributions.\n\nThose CSCs all appear to breach ministerial guidelines for what can be legitimately reported as a contribution.\n\nIndependent statistician and gambling researcher Matt Stevens said clubs spending pokies profits on maintaining their own sporting facilities could be considered a legitimate benefit for those who use them.\n\nBut he said the benefit to the community as a whole was \"debatable given a lot of the community will not go to a club and will not play sport\".\n\nMatt Stevens says pokies clubs should be required to contribute to the Community Benefit Fund. (ABC News: Pete Garnish)\n\n\"It's not really costing them any money, so I wouldn't call that a community contribution, but it gets counted as an in-kind community contribution when they're filling out their audits … so I think it's very questionable,\" he said.\n\n\"Certainly the current model of clubs not paying that 10 per cent is problematic and there should be some more checks and balances for sure.\n\n\"The Community Benefit Fund itself does fund some really important things in the NT, but I think the question's more about should clubs be contributing towards it?\n\n\"My answer is yes, I think they should be.\"\n\nProblem gambling, tax revenue soars\n\nLate last year, the territory government quietly released its 2023 Gambling Prevalence and Wellbeing Survey Report after sitting on the findings since June 2024.\n\nThe study found the territory had double the national average rate of problem gamblers, with almost one in every 10 punters classified as either problem or moderate risk.\n\nOf the 44,982 NT pokies players who pumped $222 million into the machines in 2023, just 4,324 problem gamblers accounted for more than half that figure, at almost $122 million.\n\nWhile the community clubs pay none of their poker machine revenue into the Community Benefit Fund, the NT government relies on them for millions in general revenue through the Community Gaming Machine Tax.\n\nThe survey report shows that in the 2024-25 financial year, pokies gamblers poured more than $51 million into territory coffers via the tax — making up 44 per cent of the NT's total gambling tax revenue and more than 6 per cent of its total taxation revenue.\n\nDr Stevens, the survey report's lead author, said the cost to society of the harms associated with gambling was up to $400 million a year in the NT, dwarfing the $115 million the territory generates across all forms of gambling tax.\n\nMatt Stevens says up to 80 per cent of pokies profits come from problem gamblers. (ABC News: Pete Garnish)\n\n\"People with problems with their gambling are contributing anywhere from 50 to 80 per cent of the profits that the industry makes, so if you actually want to reduce harm, they've got to be prepared to reduce the revenue as well,\" he said.\n\nThe report also concluded the burden was even greater on Indigenous Territorians, who lost more than three times as much as the average non-Indigenous pokies gambler, forking out $8,473 each per year.\n\n\"Certainly if you've got overcrowded households and the head of the household loses the money, then that's affecting more people, so I think that contributes to more people being harmed,\" Dr Stevens said.\n\n'A silent crisis'\n\nThe absence of a requirement for community clubs to pay into the Community Benefit Fund also means they contribute nothing to gambling research or harm mitigation.\n\nDarwin psychologist Nicola Coalter said for every Territorian directly affected by gambling harm, up to 15 others were caught in its \"ripple effect\".\n\n\"I work with people across addictions, whether that be gambling, porn, doomscrolling, but when it comes to gambling there's a real silence in our community about it, it's like a silent crisis,\" she said.\n\nNicola Coalter says gambling addiction is \"like a silent crisis\". (ABC News: Michael Donnelly)\n\n\"It's the mum who's trying to make do and feed the kids and explain why they can't go on that school trip, it's the young apprentice who's not getting smoko at morning tea because his pay's already been spent.\n\n\" It's the veteran who's trying to just quiet those noises in their head and escape into the club but spending way more than they plan to, so that ripples out and we feel it in our families and our communities. \"\n\nMs Coalter said research had shown that the closer poker machines were to people's homes, the more likely they were to experience harm.\n\n\"Our clubs are in our suburbs, they're down the street from where we live,\" she said.\n\n\"So when you go to the club — a place meant for community and connection, but actually driven on the losses of gambling harm — that doesn't sound like community benefit to me.\"\n\nLevy 'could force clubs to close'\n\nA spokesperson for NT Hospitality Minister Marie-Clare Boothby said clubs' community contributions were \"assessed against clear ministerial guidelines by the independent Director of Gaming Control\".\n\nThe minister did not answer questions about how many claims, if any, had been rejected for breaching those guidelines.\n\nDespite NT clubs operating without pokies until the government funded their rollout in 1997, Ms Boothby's spokesperson claimed requiring them to pay the 10 per cent levy would force some to close.\n\nMarie-Clare Boothby claims some community clubs would be forced to close if they had to share 10 per cent of their pokies profits with the wider community. (ABC News: Pete Garnish)\n\n\"Clubs are not-for-profit, community organisations that reinvest surplus revenue into improving community outcomes,\" the spokesperson said.\n\n\" A levy would remove a significant share of their operating surplus while fixed costs remain unchanged, making some clubs financially unviable. \"\n\nA spokesperson for the Nightcliff Sports Club said the venue was under new management and \"has been working with the department since the middle of the year to correct previous reporting errors, and ensure our compliance with community benefit reporting obligations meets the department's expectations\".\n\nNone of the other clubs named in this article responded to the ABC's enquiries.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/matildas-star-cooney-cross-returns-home-to-face-family-tragedy/106212710",
        "title": "'Our world changed': Matildas star returns home to face family tragedy",
        "publish_date": "Thu, 08 Jan 2026 20:24:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matildas midfield star Kyra Cooney-Cross has rushed home from England to Australia to be with her mother, who has been diagnosed with a rare, incurable cancer.\n\nCooney-Cross had been due to play for European champions Arsenal in the Women's Super League against Manchester United on Saturday as the English competition resumed after its Christmas break.\n\nBut the 23-year-old has revealed in an emotional social media post that she has raced back home to be with her mother, Jess.\n\nKyra Cooney-Cross flew home to be with her mum and her family. (Supplied: GoFundMe)\n\nSharing a photo of the two of them together in hospital, Cooney-Cross explained her mum had been diagnosed with a \"rare and aggressive\" form of bile duct cancer.\n\n\"A few days ago, our world changed forever,\" she said.\n\n\"My amazing mum, Jess, has been diagnosed with stage four cholangiocarcinoma [bile duct cancer].\n\n\"It's a rare and aggressive cancer, and there is no cure.\n\n\"'My mum is my hero, my best friend, my everything and the person who has shaped every part of who I am.\n\n\"She is the reason I am where I am today, her strength, love, and belief in me has carried me through everything.\n\n\"Trying to put into words what she means to me feels impossible.\n\n\"I'm now back in Australia to be with my mum, my sisters, and our family as we navigate what comes next. We are all still in shock and learning how to sit with the weight of this news.\"\n\nKyra Cooney-Cross has been supported by her Matildas teammates. (Getty Images: Darrian Traynor)\n\nThe midfielder's Arsenal and Australia teammates, including club colleagues Steph Catley and Caitlin Foord and national skipper Sam Kerr, have rallied around Cooney-Cross with messages of love and support.\n\nThe Matildas official Instagram account posted in the comments: \"We're with you every step of the way.\"\n\nCooney-Cross has been enjoying her best spell with Arsenal since she signed from Swedish side Hammarby in 2023, a fact recognised by her award earlier in the week as the European champions' player of the month.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/rba-deputy-governor-andrew-hauser-interest-rates-inflation-janda/106210128",
        "title": "'How rude can I be?' RBA deputy gets candid on inflation and rates",
        "publish_date": "Thu, 08 Jan 2026 20:04:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Unlike his Bazballing compatriots, Reserve Bank deputy governor Andrew Hauser doesn't strike me as hasty, at least not when it comes to moving interest rates.\n\nWhile analysts responded to this week's November inflation release with a flurry of notes, many of which talked up the odds of a February rate hike, the RBA's second-in-charge was keen to emphasise the longer term.\n\n\"We're trying to target inflation in a year or two years' time,\" he told me in a rare one-on-one interview.\n\n\"And, in judging the outlook for inflation, we don't just take account of current inflation.\"\n\nEven looking at the current price trends, Hauser was not exactly ringing the alarm.\n\n\"I think our current view is that inflation in the December quarter of 2025 is probably likely to come out just a tiny bit higher in an underlying sense than that number that we had in November.\"\n\nRBA deputy downplays significance of easing inflation The deputy governor of the Reserve Bank has confirms the news mortgage borrowers would not have wanted to hear.\n\nThe RBA deputy was keen to emphasise that the November forecast he was referring to already had pencilled in inflation above 3 per cent for a period of 2025 and into 2026 before coming eventually back down into the bank's 2–3 per cent target range.\n\nHe also pointedly noted that those forecasts had been based on the then-prevailing market assumption that the RBA cash rate would fall further from 3.6 per cent.\n\nIf current market pricing holds, then the bank's next set of forecasts will instead be based on an assumption that the cash rate will rise to near 4 per cent by the end of this year.\n\nAll other things being equal, that higher rate assumption should more than compensate for a \"tiny\" miss in the bank's guess about where inflation was at the end of last year, keeping its inflation forecasts more or less on track.\n\nThe key question will be whether that fall in inflation can happen without the one or two rate rises the market is pricing for.\n\nRBA trying to look one to two years ahead\n\nIf the market missed that message, then Hauser was blunt in his dismissal of any suggestion that the bank might have a specific, pre-determined rate hike trigger from that key December quarter inflation data — due out on January 28, less than a week before the bank's next interest rate decision.\n\nAndrew Hauser joined Australia's central bank after a long career with the Bank of England. (ABC News: Adam Wyatt)\n\n\"How rude can I be on the ABC?\" he asked, before launching into a distinctly civil answer.\n\n\"We are not targeting Q4 2025 inflation — it's actually impossible to do that because it's already in the past.\n\n\"But you can't even target inflation a quarter out, you're targeting the whole time inflation out a year to two years, and that informs making a judgement.\n\n\"Of course, it's the case if that number in Q4 were spectacularly high or spectacularly low, we'd have to ask ourselves what was driving that and that might be an important part of our overall judgement.\n\n\" But we don't have a rule that says, if it's 0.9 we hold, and if it's 1 we raise, or 0.7 we cut — we take a view of the whole economy. \"\n\nWhat the ABC's economics experts are watching in 2026 What are you watching in 2026 when it comes to the economy or markets? That's the question we put to the ABC's experts.\n\nElsewhere in the interview, the RBA's deputy governor presented an open mind to scenarios where inflation might come back to the middle of the bank's target without the need for rate increases, and perhaps even with scope for further rate cuts (however unlikely they are in the short term).\n\nThis could be because the economy, especially the jobs market, weakens more than the Reserve expects; or because a global financial shock hits Australia; or, positively, because productivity picks up by more than the bank is expecting, meaning that Australia isn't butting against capacity constraints and can meet robust demand without high inflation.\n\nNone of these are what he describes as the bank's \"central case\", but one gets the distinct feeling from Hauser, and his boss Michele Bullock in her most recent December press conference, that the RBA feels it is in a good position with the cash rate at a fairly neutral 3.6 per cent to wait and assess where the economy is heading before making its next move.\n\nAlthough it must be noted that the board makes the rate decisions, not the governor and her deputy, who are just two votes on that board — a point repeatedly emphasised by Bullock at her press conferences.\n\nThe RBA will come under pressure in 2026 to raise interest rates if inflation tracks higher. (ABC News: Daniel Irvine)\n\nRBA tends to avoid flip-flopping on rates\n\nA wait-and-see approach would also sit more comfortably with the Reserve Bank's recent history when it comes to the end of rate-cutting or hiking cycles.\n\nIf the bank were to raise rates in February, that would be less than six months after it last cut them on August 13.\n\nYou have to go back to the aftermath of the global financial crisis to find such a short period on hold at the top or bottom of any rate cycle.\n\nWhat to expect with interest rates in 2026 Mortgage borrowers and savers may have used the new year to get their financial affairs in order, but things may be set to change.\n\nThe cash rate stayed at a low of 3 per cent for just six months between April and October of 2009, before the RBA started lifting it as the stimulus that kept Australia out of recession also began boosting inflation beyond the bank's comfort zone.\n\nThere was also a mere six months of rates at peak levels of 7.25 per cent in 2008 before they were slashed in response to the GFC, starting in September 2008.\n\nThe RBA has instead tended towards considerable periods of rate stability — the longest of which famously stretched to 30 meetings and the better part of three years between 2016 and 2019 when the cash rate sat at 1.5 per cent, even as the economy stagnated and both inflation and wages flatlined.\n\nThat's not to say the Reserve Bank isn't prepared to raise rates next month if it needs to. Andrew Hauser was forthright about his concern over current levels of inflation.\n\n\"Inflation above 3 per cent, let's be clear, is too high,\" he told me.\n\n\" We're charged to keep inflation between 2 and 3 per cent, and it's currently above that. \"\n\nBut it feels like the threshold is high to convince the RBA it needs to move quickly rather than wait and see how the economy is travelling over the first few months of this year.\n\nAs the English cricket team learnt to its cost in the Ashes, it's often better to leave a few and take a while to assess the speed and bounce of the pitch rather than trying to play every ball.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/joint-gets-barty-s-backing-ahead-of-aus-open-seeding/106212664",
        "title": "Joint gets Barty's backing with teenager's Aus Open milestone confirmed",
        "publish_date": "Thu, 08 Jan 2026 20:02:42 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian tennis's next generation has officially arrived, with teenage ace Maya Joint sealing her place as the first home women's seed at Melbourne Park since retired great Ash Barty.\n\nJoint will be the Australian Open's 31st or 32nd seed after defeats for two of her chasing rivals on Thursday left it mathematically impossible for the 19-year-old to drop out of the world's top 32 before next week's draw.\n\nProvisionally slated to rise to a career-high number 31 on Monday, or remain 32nd if American Iva Jovic continues her run in Auckland, Joint's elevated status ensures Australia's top-rated female player won't face a higher-ranked opponent until at least the third round at the year's first major.\n\nJoint will follow Barty, who topped the AO draw for three straight years before famously winning the Open in 2022, former US Open champion Samantha Stosur, Daria Saville, Casey Dellacqua and Alicia Molik as only the sixth Australian women's Open seed in 36 years.\n\nMaya Joint will lead the Australian women's charge at this year's Australian Open. (Getty Images: Andy Cheung)\n\nThe classy Barty, typically, was the first to salute the emerging star.\n\n\"Exciting for Maya to be seeded at a slam for the first time, particularly at home in Australia,\" the triple grand slam champ and former world number one said.\n\n\"A testament to her hard work, professionalism and consistency over the past 12 months.\n\n\"I love watching her play and can't wait to see her in Melbourne.\"\n\nHad Anna Kalinskaya not blown a handy third-set lead against world number four Jessica Pegula in Brisbane and dual grand slam winner Barbora Krejcikova not suffered a United Cup loss to Elise Mertens on Thursday night, Joint would have been under siege.\n\nThe US-born talent would have needed to upset reigning Wimbledon champion and world number two Iga Swiatek in Australia's United Cup quarter-final against Poland on Friday night to secure a prized Open seeding.\n\nBut now the home favourite can play with added freedom against the six-time grand slam winner under the bright lights of Sydney's Ken Rosewall Arena.\n\nMaya Joint won the Eastbourne Open last year. (Getty Images: Adam Davey)\n\nDespite trouncing Joint 6-0, 6-2 in Seoul in September, Swiatek is wary of what the exciting young Australian can bring to the court.\n\n\"Every match is a different story,\" Swiatek said.\n\n\"I kind of know what her ball feels like, but I'm pretty sure she also learned by knowing how my ball feels.\n\n\"I will need to prepare tactically by watching these last matches that she played, and I'll be ready.\"\n\nNow a six-time grand slam winner, Swiatek suspects Joint will relish playing her, just as she did when first coming up against Barty as a teenager.\n\n\"I remember actually playing against Ash. I could feel how good she is when she was number one and so solid and and she really inspired me, actually,\" Swiatek said.\n\n\"So, being an underdog and being this up-and-coming player with this freshness that you have, I think it's great and it's a moment where you improve your game the most.\n\n\"I just tried to play my best as an underdog and, honestly, it was pretty fun. I miss those days.\"\n\nJoint's Cup teammate and men's world number six Alex de Minaur will be the only other Australian singles seed in next Thursday's Open draw at Melbourne Park.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-09/sa-riverland-heatwave-hot-weather-peak-tourist-season/106205990",
        "title": "Murray River visitors hit with sweltering heatwave during peak season",
        "publish_date": "Thu, 08 Jan 2026 19:34:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hot summer days do not come as a surprise for those living in South Australia's Riverland.\n\nBut when three consecutive days in excess of 45 degrees Celsius were forecast as part of an extreme heatwave sweeping across the country, people took note.\n\nAt Renmark, temperatures hit 38C on Tuesday, 44C on Wednesday, and 47C on Thursday, with a top of 47 forecast today.\n\nAustralia heatwave live updates: Read our blog for the latest news as out-of-control bushfires burn and temperatures soar for a third day.\n\nFor many, it was a case of simply getting through, while for others it was about making the most of existing holiday plans in the popular tourist region.\n\nGeoff and Barb Calvert have owned and operated the Kingston on Murray Caravan Park for almost 10 years.\n\nGeoff and Barb Calvert run the Kingston on Murray Caravan Park in the Riverland. (ABC Riverland: Jackson Byrne)\n\nMr Calvert said the sweltering weather was just part and parcel of living in the region.\n\n\"I mean, it's summer in the Riverland. You've got to expect a few hot days,\" he said.\n\n\" There's a river at one end and a pool at the other. \"\n\nThe caravan park was forced to rebuild after the devastating 2022–23 River Murray floods.\n\nThis year's hot weather shows a stark contrast at the campsite's popular pool compared to this time three years ago.\n\nBefore: The Kingston on Murray Caravan Park pool was part of the trail of destruction left by the 2022 floods in South Australia's Riverland. . . After: It's now back in action and as popular as ever with campers. . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE The Kingston on Murray Caravan Park pool was part of the trail of destruction left by the 2022 floods in South Australia's Riverland. / It's now back in action and as popular as ever with campers.\n\n\"It's just a lot of hard work from everyone, a lot of support from the local community, the staff we've got are fantastic,\" Mr Calvert said.\n\n\"It's been a little bit quieter than normal through the Christmas and New Year period, but as long as we keep the wheels turning, that's enough.\"\n\nVisitors from all over took advantage of the typically cooler conditions of the early morning.\n\nLevi and Matilda are from Mount Gambier in the state's south-east.\n\nTheir families were staying through to the weekend, when the weather was set to become more manageable.\n\nLevi (left) and Matilda are visiting the caravan park in the Riverland with their families for the first time. (ABC Riverland: Jackson Byrne)\n\n\"We've been to the pool every day,\" Levi said.\n\n\"It's a once-off thing; we never usually go to the river.\"\n\nMariah Taylor and her family from Trafalgar in regional Victoria were also bearing the brunt of the heat not too far away at the Berri Riverside Holiday Park.\n\n\"We were pretty much too far in to turn around and make any other choices,\" she said.\n\n\"We've done a lot of swimming, water, the kids are loving the pool, a lot of eating out in cool restaurants, so we're managing perfectly fine.\"\n\nMariah Taylor and her family are taking advantage of cooler morning conditions to survive the extreme heat. (ABC Riverland: Jackson Byrne)\n\nCouncil doing its bit to help\n\nThe Loxton Waikerie Council has also taken steps to keep its residents cool.\n\nIt has extended the opening hours for both the Loxton and Waikerie swimming pools.\n\nThe Loxton pool's hours have been extended, with residents afforded free entry for the summer. (ABC Riverland: Jackson Byrne)\n\nLast year, it made entry free for all residents in the council areas.\n\nMayor Trevor Norton said the initiatives have brought the pools back to life.\n\n\"It was to try and bring the community together, address a bit of cost-of-living pressure, so our residents could come down, exercise, get cool or just connect with other people,\" he said.\n\n\"It gives people a chance to come down and cool off after work or get out of the house and refresh.\"\n\nTrevor Norton has extended opening hours and made pool access free for residents. (ABC Riverland: Jackson Byrne)\n\nMr Norton said the council's swimming pools were the \"number one priority\" when they surveyed the community last year.\n\nHe said free entry at the public pools had already proven immensely popular.\n\n\"In Loxton, season tickets were previously [sold to] around 180 [people], they're now about 1,000,\" Mr Norton said.\n\n\"In Waikerie, where they were really dragging along at about 50 for the last two or three years, they've now reached almost 500.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/will-towers-rise-above-the-new-woollahra-station-we-re-about-to-find-out-20260108-p5nskb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Will towers rise above the new Woollahra station? We’re about to find out",
        "publish_date": "Fri, 09 Jan 2026 13:06:26 +1100",
        "category": "finance",
        "authors": [
            "Matt O'Sullivan",
            "Alexandra Smith"
        ],
        "text": "Investigations to start this weekend into ground conditions at the site of a planned station at Woollahra in Sydney’s east will determine the scale of the project and whether towers can be built above the railway like those at Bondi Junction, Waterloo or in the central city.\n\nMore than four months after Premier Chris Minns revived plans for a station at Woollahra, the state’s transport department will carry out geotechnical investigations of the ground conditions, as well as assessments of existing structures at the site. The work will take place during a scheduled shutdown of the T4 eastern suburbs line for track repairs this weekend.\n\nThe site on the eastern suburbs line at Woollahra will undergo geotechnical assessments this weekend. Credit: Wolter Peeters\n\nIt signals the ramping up of an extensive list of work that will be required to meet an ambitious timeframe for construction to start on the station next year and be completed in 2029. The government has estimated the station will cost $200 million to build.\n\nThe assessment of ground conditions will give planners a greater sense of the extent of design options for the station, and whether they could include towers above the railway. Apartment towers above the station would help the government more easily meet its target for up to 10,000 homes to be built in Woollahra and nearby Edgecliff.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/ex-nrl-star-s-gyms-cop-175k-bill-for-playing-music-during-classes-20260109-p5nssj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ex-NRL star’s gyms cop $175k bill for playing music during classes",
        "publish_date": "Fri, 09 Jan 2026 13:05:58 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "A gym chain part-owned by ex-NRL player and media personality Beau Ryan has been ordered to pay $175,000 for copyright infringement after it played songs by artists such as Avicii and Vengaboys in classes without paying licensing fees.\n\nIn December, the federal court found that the companies operating S1 Training gyms – a business that first opened in Sydney’s Coogee before expanding with franchises across New South Wales and Victoria – had infringed copyright on various occasions when playing music during guided workouts between 2020 and 2024.\n\nThe legal action was brought by the Australasian Performing Right Association (APRA), which grants and administers licences to businesses to the vast majority of the world’s commercially available music.\n\nAny business that plays copyright protected music, whether it be radio or from a streaming platform, is required to pay APRA for a “OneMusic” licence. The fees are distributed as royalties to rights holders through record companies after a process that includes researching and tracking radio air play, box office reports, streaming data as well as sound recognition devices placed in businesses.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/leadership-shake-up-thrusts-wallabies-star-into-world-cup-captaincy-frame-20260109-p5nsu0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Leadership shake-up thrusts Wallabies star into World Cup captaincy frame",
        "publish_date": "Fri, 09 Jan 2026 12:57:01 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Fraser McReight has been confirmed as the Queensland Reds skipper for the 2026 Super Rugby Pacific campaign, replacing halfback Tate McDermott and the departing Liam Wright in what will be coach Les Kiss’ final season before he takes the national reins.\n\nStandout flanker McReight has been lauded as a long-term captaincy candidate in Wallabies colours.\n\nFraser McReight became the 91st Wallabies captain. Credit: Getty Images\n\n“This role is a huge honour and even more so because I follow some great mates and leaders into the role, having watched Tate and Liam do a terrific job,” said McReight, who became the Wallabies’ 91st captain during a Rugby Championship clash with South Africa.\n\n“They showed me the path over the past four seasons, and hopefully I’ll now land on my path as a captain with all I’ve learnt about myself as a person and as a player.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/art-and-design/a-film-about-a-house-fed-my-crazy-dream-three-weeks-later-i-was-there-20251128-p5njac.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A film about a house fed my crazy dream. Three weeks later, I was there",
        "publish_date": "Fri, 09 Jan 2026 12:55:22 +1100",
        "category": "finance",
        "authors": [
            "Simmone Howell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size I have come to Roquebrune-Cap-Martin to see a house. When I say it in my head I roll the R’s extravagantly but when I say it aloud whoever I’m talking to says, “Where?” “The South of France,” I reply. “The Riviera. Near Monaco. Grace Kelly. Cannes. Le midi, mais oui?” I left Paris at 6am and caught the train from Gare de Lyon. I had imagined an empty carriage, a forward-facing seat with a table, the French countryside unfurling outside my window. I would write for the whole five hours. But there are no tables and I am facing backwards. The man next to me is eating some kind of meaty sandwich, then shifting, sleeping, snoring. A woman keeps getting up to do pilates in the aisle with a resistance band. She’s wearing a floppy hat. She keeps it on the whole time. When I made the booking I guessed the wrong side of the train, but after a mass exodus at Monaco I swap to the right for unadulterated views of craggy hills and the forever blue Mediterranean. The next 10 minutes make up for the last four hours. There is nothing like mountains and sea and sky. And houses! Grand and humble houses on hillsides, wedding-cake white with red tiled rooftops and sea-slung patios and terraced gardens, they come at me faster than I can hold them in my mind’s eye. The house I have travelled to see, E-1027 (the name a code for its creator’s initials) is the modernist seaside villa of my dreams. Built between 1926 and ’29, it commands a corner of this dramatic coastline, but I don’t know exactly where. As the train approaches Roquebrune-Cap-Martin station, I get my first glimpse, and even though I am feeling tired and hungry and sweaty and ancient, excitement ripples through me. Soon I’ll get to see it up close. Three weeks earlier, I was escaping Melbourne’s almost-winter at the movies. The film was E-1027: Eileen Gray and the House by the Sea (2024). I’d never heard of Eileen Gray – Irish, bisexual, furniture designer – or Jean Badovici – Romanian, architect, journalist, editor, social animal – and the house they built together. I didn’t know anything about the “feud” with Le Corbusier, or that in 1938, the big daddy of the International Style painted eight murals on the walls of Gray’s villa without her consent. Architect Eileen Gray accused Le Corbusier of vandalism after he painted murals inside the house she designed. Credit: Getty Images “This is a story of patriarchy,” director Beatrice Minger stated, “of a man who cancelled Eileen’s vision of architecture.” The murals were Cubist in style, vivid, lairy. In a photograph of Corbu painting them he is naked and not ashamed. Gray called it vandalism. Badovici liked the murals, initially. After he objected, Corbu sent him a bill for the paint. “Like all colonists, Le Corbusier does not think of it as an invasion but as a gift,” historian Beatriz Colomina wrote in 1993.\n\nAdvertisement\n\nLe Corbusier would effectively spread himself all over the site at Roquebrune, building holiday shacks on the plot behind the villa and his monkish La Cabanon – “More a watchhouse than a cabin,” according to Colomina – directly next door. For days after the movie, E-1027 was all I could think about. What if I could see it in real life? The more I thought, the bigger the dream billowed. Fortuitously, I was about to go to Paris. I pro-and-conned myself. I checked routes and accommodation. I worried about being a solo woman traveller – what about voleurs? Loading Then I calmed down, told myself it would be the French equivalent to getting the train to Albury-Wodonga. I bought a ticket for the English-speaking tour then I sat on it, because it seemed suddenly ridiculous to go all that way for a house. But – I don’t know – the jazz hands of fate were waving me forward. I got my debit card out, and ran riot. The tour was led by a tanned young man. I got the sense he was Team Corbu. He told us that Gray and Badovici were not lovers and that it was hard to pinpoint how their collaboration worked. It was Badovici’s land but Gray’s design. It was Gray’s money but Badovici’s cheerleading. Gray camped onsite, tracing the sun’s path, copping the title “mad Englishwoman” from locals. Architect and artist Le Corbusier “cancelled Eileen Gray’s vision of architecture”, says director Beatrice Minger. Credit: Wolfgang Kuhn/United Archives via Getty Images Her design applied modernist techniques: pilotis, open plan, horizontal windows, and flat roof. Gray brought her experimental best to the project, furnishing the villa with a coffee table with adjustable height (no crumbs on the bed!), drawers that opened like Kali’s arms so the viewer could see all its contents at once, a cylindrical lemon server next to the bar, shutters on a sliding rail to manage privacy and ventilation. E-1027 was compact, complete as a shell: a synthesis of light, space and efficiency, fulfilling Gray’s stated aim: “House envisaged from a social point of view: minimum of space, maximum of comfort.”\n\nAdvertisement\n\nLoading “Entrez lentement” (enter slowly), the sign stencilled at the front door reads. There are similar signs throughout (citrons, oriellers, moustiquaire, papier a lettres). Our guide allowed that if you were a European modernist in possession of a villa, it was de rigeur to pass the key among friends. Although, he noted, Badovici was extra-friendly; he had an excess of joie de vivre and this was why he and Gray had parted company. It was also a class thing. Gray travelled with a maid. Badovici was “of the people”. Fortunately, Gray was adept at moving on. After a couple of summers she was ready to build a place of her own, on another hillside, somewhere she could be alone and work. Dreamhouse as dreamspace: this is how it felt, even though I was there with strangers, being careful not to step on the rugs, under the eye of the house manager who waited wary on the balcony. I thought that if I had her job, or that of our droll docent then I could see E-1027 every day. I wondered if they lived locally, if it ever felt like a chore to repeat the same stories, and anticipate the same questions. Despite its idyllic setting, E-1027’s history includes accusations of architectural vandalism, German occupation, and murder. Credit: Andia/Universal Images Group via Getty Images Loading When the guide showed us through Le Cabanon, pointing out the toilet right next to where Madame Le Corbusier would have laid her head (Corbu slept on the floor) and someone joked about number twos, he tolerated it with good humour, but how many times had he heard it before? I never learned his name, the guide. Was he an architecture student? How did he get the job? Why didn’t I study architecture back when I was young and tanned and droll? From the daybed in the main room when you look out the windows all you can see is sea. The effect is as if you are on an ocean liner. Gray had stencilled the title of Baudelaire’s poem “Invitation au voyage” in a mural on the wall. Architect Caroline Constant highlights the following lines as emblematic of Gray’s architectural achievement: “It is there we must go to breathe, to dream, and to prolong the hours in an infinity of sensations.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/so-you-ve-got-20-000-and-want-to-meet-roger-federer-there-s-still-a-problem-20260108-p5nsme.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "So you’ve got $20,000 and want to meet Roger Federer? There’s still a problem",
        "publish_date": "Fri, 09 Jan 2026 12:28:21 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe",
            "Billie Eder"
        ],
        "text": "Got a spare $20,000 and want to meet tennis legend Roger Federer in Melbourne next weekend? It looks like it still won’t be enough.\n\nThat’s the eye-popping price tag for a chat and a handshake with the 20-time grand slam singles champion at this year’s Australian Open, but anyone still wanting to buy VIP tickets for next Saturday night’s Federer experience on Ticketmaster was left disappointed on Friday morning, with a message telling prospective customers: “We’ll contact you if new tickets are released. Join waiting list.”\n\nHe’ll wave for free, but to meet Roger Federer will cost you $20,000. Credit: AP\n\nThe meet-and-greet with Federer was one of two VIP options put on sale by Tennis Australia in December. The cheaper option ($2500 a person) offers seats to a Q&A with the tennis great, paired with cocktails and “premium” beverages.\n\nBut guests willing to fork out $20,000 each will get what has been sold as a “once-in-a-lifetime opportunity” to meet Federer in his dressing room. The meeting, which you’d assume would involve at least a selfie with the 44-year-old, will take place before he plays in a match with Andre Agassi, Pat Rafter, and Lleyton Hewitt, in what is billed as the “battle of the World No.1s” during the Australian Open’s first-ever opening ceremony.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victorias-emergency-management-commissioner-confirms-property-loss-in-fires-20260109-p5nsu4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victoria's emergency management commissioner confirms property loss in fires",
        "publish_date": "Fri, 09 Jan 2026 12:24:16 +1100",
        "category": "finance",
        "authors": [],
        "text": "Victoria's emergency management commissioner confirms property loss in fires\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/kyrgios-rules-himself-out-of-an-australian-open-singles-wildcard-20260109-p5nstd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kyrgios rules himself out of playing Australian Open singles",
        "publish_date": "Fri, 09 Jan 2026 12:10:41 +1100",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Nick Kyrgios has ruled himself out of playing singles at the Australian Open, after deciding to focus on doubles with his partner Thanasi Kokkinakis in Melbourne.\n\nKyrgios will not take a potential wildcard spot after battling with significant wrist and knee surgeries over the last three years and slipping to No.670 in the world rankings.\n\nThe former Wimbledon finalist said via Instagram on Friday morning he wanted the wildcard spot to instead go to a player ready for the rigours of five-set tennis.\n\n“After some good conversations with TA [Tennis Australia], I’ve made the call to focus on doubles for this year’s AO,” Kyrgios posted.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/three-missing-including-child-as-fire-rips-through-victorian-town-20260109-p5nssi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three missing, including child, as fire rips through Victorian town",
        "publish_date": "Fri, 09 Jan 2026 12:07:48 +1100",
        "category": "finance",
        "authors": [
            "Isabel Mcmillan",
            "Liam Mannix"
        ],
        "text": "Firefighters are urgently searching for three people, including a child, missing after the Longwood bushfire ripped through a tiny town in central Victoria, destroying homes.\n\nThe Longwood blaze is one of two major bushfires burning out of control as the state’s firefighters confront the most widespread hazardous bushfire conditions since Black Summer in 2019-2020.\n\nAt least 10 homes have been destroyed in Ruffy, a tiny town south of Longwood.\n\nA property destroyed in Ruffy. Credit: Nine\n\n“It looks like an atomic bomb has gone off,” local CFA captain George Noye told ABC Radio on Friday morning. “[I’m] just down the main street at the moment, we’ve lost the old school, the old Ruffy produce store is gone, three houses on the main street. We’ve lost countless homes across the area. Ten of my firefighters that I know of have lost homes.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/arctic-storm-grips-britain-and-europe-20260109-p5nstt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Arctic storm grips Britain and Europe",
        "publish_date": "Fri, 09 Jan 2026 11:55:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Arctic storm grips Britain and Europe\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/dry-thunderbolts-in-the-night-set-the-hair-on-end-20260109-p5nsrc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dry thunderbolts in the night set the hair on end",
        "publish_date": "Fri, 09 Jan 2026 11:54:51 +1100",
        "category": "finance",
        "authors": [
            "Tony Wright"
        ],
        "text": "Follow our live bushfire blog for the latest updates\n\nA fusillade of lightning and the detonation of thunder arrived in Portland at precisely midnight. We hoped it was not the presage to a day of catastrophe for Victoria, but it set the hair on end and felt like the coming of a day of judgment.\n\nA bolt of lightning over Portland, south-west Victoria, during a massive dry electrical storm just after midnight Friday. Credit: Anne McCurdy\n\nThe dry storm lasted more than an hour-and-a-half in this far south-west corner of Victoria.\n\nWe stood on the verandah, scanning the dark for a sign that one of those hundreds of lightning strikes had ignited the forest beyond the horizon or grassland nearby.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victorian-bushfires-three-unaccounted-for-homes-lost-20260109-p5nstq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victorian bushfires: Three unaccounted for, homes lost",
        "publish_date": "Fri, 09 Jan 2026 11:53:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "Victorian bushfires: Three unaccounted for, homes lost\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/veg-loaded-recipes-to-kick-start-your-health-goals-20251222-p5npls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A week of veg-loaded recipes to kick-start your health goals",
        "publish_date": "Fri, 09 Jan 2026 11:53:13 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Recipe collection\n\nA week of veg-loaded recipes to kick-start your health goals\n\nBoost your vegetable intake this week with a healthy spin on mac 𝄒n𝄒 cheese, a speedy rice dish that has all the flavours of spanakopita, and more.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/the-new-world-disorder-where-might-is-right-20260109-p5nspn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The new world disorder where might is right",
        "publish_date": "Fri, 09 Jan 2026 11:50:00 +1100",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The security of the old world order is being blasted away with every airstrike to enforce the will of Donald Trump so he can assure his followers he is making America great again. The US president who ridiculed regime change is now vowing to run Venezuela, turn a profit from its oil, and demanding control of Greenland in the hope of painting the world map with the US stars and stripes. The Trump vision comes with proof of his willingness to deploy hard power, rather than merely posting “truths” on social media, to get his way. It includes bombing Caracas, capturing Venezuelan leader Nicolás Maduro and seizing oil tankers on the high seas. And it shakes old alliances because it comes with a signal that he could use force against others – even NATO members – if they do not submit to his plans. It feels like a new world disorder. The sense of balance in world politics is shifting and a new era of great power competition is under way. In this world, might is right. Chinese President Xi Jinping and Russian President Vladimir Putin believed it already. Trump has signed up as well. US President Donald Trump can turn on allies in an instant, even when seeming to work with them. Credit: Bloomberg “It’s not about the rules-based order any more. That’s gone,” says Michael Clarke, a visiting professor at King’s College London, a former director-general of the Royal United Services Institute and a former defence adviser to British governments. Clarke sees an era of major rivals seeking to impose their will across their spheres of influence. American allies, he says, must adapt because they have no choice but to survive in this new dispensation. He quotes an adage: If you’re not running a sphere of influence, you’re in one. There are four major powers in this world view: the United States, China, Russia and India. This seems generous to Putin, given the weakness of the Russian economy, but Russia is a nuclear state that is aggressive in using its military.\n\nAdvertisement\n\n“The reason those big powers are important is that they create the political weather for everybody else,” Clarke says. “And three of those four powers are revisionist. The US, China and Russia are all trying to change the old system that we’ve lived with now for the last 80-odd years. “And two of those four powers are rogue states. Russia, and America now under Trump, are behaving like rogue states in that they’re undermining very directly the politics of countries around them.” Loading Trump’s intervention in Venezuela is not a seismic shift in itself, given that US presidents have used force in Latin America for decades. George H.W. Bush sent troops into Panama in 1989 to replace its leader, Manuel Noriega, and put him on trial for drug trafficking. Trump merely does the same, albeit with newer technology so he can watch it live from his Florida estate. What has changed is the context. Trump can turn on allies in an instant, even when seeming to work with them. The alarming factor over the past week has been the way the White House picked fights with NATO allies over Greenland immediately after displaying its military might against Venezuela. Trump and his team had the opportunity to rule out using force in a dispute with European allies; they never did. The new ethos for using power Trump has the power. He will use it as he wants. One of the president’s most dedicated acolytes, Stephen Miller, the White House deputy chief of staff, said as much this week.\n\nAdvertisement\n\n“We live in a world in which you can talk all you want about international niceties and everything else,” he told CNN on Tuesday. “But we live in a world, in the real world, that is governed by strength, that is governed by force, that is governed by power. These are the iron laws of the world.” Miller was direct about the rationale for intervening in Venezuela. “The US is using its military to secure our interests unapologetically in our hemisphere,” he said. “We’re a superpower, and under President Trump, we are going to conduct ourselves as a superpower.” Nicolas Maduro and Cilia Flores surrounded by security en route to a federal courthouse in Manhattan on Tuesday (AEDT). Credit: GC Images Miller’s remark highlighted the fact that this is not about Trump alone. There is a movement of MAGA believers who are backing his “America First” message about turning away migrants, building up the military and putting other countries in their place. Their pivotal test this year comes at the mid-term elections in November. Trump admitted to Republicans on Tuesday (in an address at the Trump Kennedy Centre, which he has just renamed in his own honour) that he could be impeached if the Democrats won control of the House and Senate. The MAGA movement needs to cement its power. Trump has an incentive to engineer a victory on Greenland before election day. Alarm over Greenland\n\nAdvertisement\n\nFrench President Emmanuel Macron is slicing through the usual pretence that America remains a reliable ally. He spoke on Thursday in Paris about the danger of the US “turning away from some of its allies” and “freeing itself” from international rules. “It’s the greatest disorder, the law of the strongest, and everyday people wonder whether Greenland will be invaded, whether Canada will be under the threat of becoming the 51st state or whether Taiwan is to be further circled,” Macron told French diplomats, in remarks reported by the Associated Press. He warned of a “dysfunctional” era in which major powers such as the US and China were tempted to divide the world among themselves. This is a future of competing spheres of influence – and German President Frank-Walter Steinmeier is also ringing the alarm. He argued this week that the Russian invasion of Ukraine had threatened the world order and that US policy was now making a second rupture. Steinmeier, who was Germany’s minister for foreign affairs for eight years, said nations had to push back at the breakdown in values by the US, which helped build the world order. “It is about preventing the world from turning into a den of robbers, where the most unscrupulous take whatever they want, where regions or entire countries are treated as the property of a few great powers,” he said, in remarks reported by Reuters.\n\nAdvertisement\n\nTrump has heightened these concerns with his demand for Greenland. But what is his rationale? Danish Prime Minister Mette Frederiksen has predicted that any US move to take the territory by force would be a conflict within NATO and therefore the end of NATO. There is no logical analysis of the importance of Greenland to justify that cost. The US has a treaty with Denmark from 1951 that allows it to build military facilities in Greenland, which means there is nothing to stop Trump from expanding operations if his security advisers are worried that climate change will alter the military dynamics in the Arctic. At the same time, there is no barrier to minerals exploration: there is an operating gold mine in southern Greenland, for instance, despite challenging conditions. US companies are not being blocked from searching for critical minerals. This leads to the obvious theory that Trump is chasing a legacy. He wants to be the president who adds a vast land mass to the US. One MAGA influencer, Katie Miller, who is married to Stephen Miller, posted a map of the Arctic with Greenland covered in the American flag. At heart, the push for US ownership seems a personal and populist move, more than a strategic imperative. Venezuela: a precedent for China? How China responds is now a key factor in the aftermath of the US operation in Venezuela, but there are flaws to the theory that Xi will be emboldened to copy Trump and send Chinese special forces into Taiwan. “The Chinese would not regard Taiwan as any easier to attack now than they did before Venezuela,” says Kerry Brown, professor of Chinese studies at King’s College London, and a past professor of Chinese politics at the University of Sydney.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/egregiously-racist-writers-pull-out-of-adelaide-festival-over-dropped-palestinian-author/5pq8ui8zq",
        "title": "Writers pull out of Adelaide festival as dropped Palestinian author claims 'racist' treatment",
        "publish_date": "Thu, 8 Jan 2026 23:39:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Adelaide Writers' Week has removed prominent Palestinian Australian author and academic Randa Abdel-Fattah from its line-up, citing national grief following the Bondi tragedy — a decision that has prompted a wave of withdrawals from prominent writers in protest.\n\n\n\n\n\nOn Thursday, the Adelaide Festival board confirmed it had informed Abdel-Fattah that she would no longer appear at the event.\n\n\n\n\n\nAbdel-Fattah was the only author of Palestinian descent scheduled for Writers' Week.\n\n\n\n\n\nIn a statement the board said: \"Whilst we do not suggest in any way that Dr Randa Abdel-Fattah’s or her writings have any connection with the tragedy at Bondi, given her past statements we have formed the view that it would not be culturally sensitive to continue to program her at this unprecedented time so soon after Bondi.\"\n\n\n\n\n\nSpeaking to Australian Associated Press, Abdel-Fattah criticised the festival's leadership, saying: \"In the end, the Adelaide Writers' Festival will be left with panellists who demonise a Palestinian out of one side of their mouths while waxing lyrical about freedom of speech from the other.\"\n\n\n\nREAD MORE Albanese announces Bondi terror royal commission as Ley says he was 'forced' into it\n\nThe activist condemned her cancellation and called the board \"egregiously racist\" and said it had attempted to strip her of her humanity.\n\n\n\n\n\n\"The board's reasoning suggests that my mere presence is ''culturally insensitive'; that I, a Palestinian who had nothing to do with the Bondi atrocity, am somehow a trigger for those in mourning and that I should therefore be persona non grata in cultural circles because my very presence as a Palestinian is threatening and 'unsafe',\" Abdel-Fattah said.\n\n\n\n\n\nThe decision sparked immediate backlash, with several writers and academics withdrawing from the festival in solidarity.\n\n\n\n\n\nThe festival said it was anticipating its decision would cause \"discomfort\".\n\n\n\n\n\n\"Consideration of the appropriate response to such a tragedy is a human exercise that we understand is subjective in nature. We also understand others will undoubtedly form different judgments. These judgments may likely even change as the landscape and context evolves.\"\n\n\n\nThose who have pulled out include former Greek finance minister Yanis Varoufakis, Stella Prize winner Evelyn Araluen, former political prisoner and foreign correspondent Peter Greste, and two-time Miles Franklin winner Michelle de Kretser.\n\n\n\n\n\nAraluen, one of the writers who dropped out, said: \"Erasing Palestinians from public life in Australia won't prevent antisemitism. Removing Palestinians from writers festivals won't prevent antisemitism.\"\n\n\n\n\n\nFollowing the axing, the Australia Palestine Advocacy Network (APAN) released a statement, rejecting the board's claim that it removed Abdel-Fattah due to \"cultural sensitivity\".\n\n\n\n\n\nAPAN president Nasser Mashni said: \"What we are seeing is not caution — it is discrimination ... Apparently, it's culturally insensitive to be Palestinian at this time.\"\n\n\n\n\n\nThe Australia Institute has also withdrawn its support and sponsorship from this year's events.\n\n\n\n\n\nIn 2025, at the Bendigo Writers Festival, more than 50 writers and moderators boycotted the event over concerns its code of conduct would suppress discussion of Israel's actions in Gaza.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/live-blog/bushfires-australia-victoria-heatwave/1twq18j8p",
        "title": "Victoria fires live: Premier warns of 'extremely dangerous' conditions; Ruffy looks like 'bomb has gone off'",
        "publish_date": "Thu, 8 Jan 2026 22:57:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "Mitchell Shire mayor,\n\nJohn Dougall\n\n, has told ABC News he expects more damage to be discovered when roads reopen in the towns affected by the Longwood fire.\n\nHe said residents streaming into the Seymour Sports and Aquatics Centre, set up as a disaster relief spot, has brought stories of devastation.\n\n\"People were told to evacuate and they really had no time to act. They made that decision and they did,\" he said.\n\n\"The primary school at Ruffy has been burnt to the ground, the general store at Ruffy, again burnt to the ground.\"\n\nHe said the fire had covered a large area and many communities remained under threat.\n\nDougall said the area was particularly vulnerable because of below-average rainfall last year.\n\n\"Now we have this fire that is underway, that vulnerability is turning into a real danger and real threat.\"\n\n— Miles Proust",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/a-message-to-putin-as-the-us-seizes-russian-flagged-shadow-tanker/09mpdm23v",
        "title": "'Enough is enough': Trump's warning for the world with Russia-linked tanker seizure",
        "publish_date": "Thu, 8 Jan 2026 18:38:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "A crude oil tanker flying the Russian flag was seized by United States forces in the North Atlantic, raising questions around a potential crackdown on the global 'shadow fleet', at the same time as the US seeks to control Venezuela's oil industry.\n\n\n\n\n\nThe US said the tanker, which was being escorted by the Russian navy, is part of a shadow fleet that carries oil for Venezuela, Russia and Iran in violation of US sanctions .\n\n\n\n\n\nRussia's shadow fleet, which SBS News has previously reported on , consists of numerous vessels of all kinds that operate outside of the rules set by the International Maritime Organization.\n\n\n\n\n\nThe 300-metre-long ship, the Marinera, previously named the Bella-1, was empty of oil but has been under US sanctions since June 2024 due to allegations of smuggling illegal cargo for Hezbollah, an Iranian-regime-supported militant group in Lebanon.\n\n\n\n\n\nThe US has been pursuing the Marinera since last month, after it tried to evade the US blockade on sanctioned oil vessels near Venezuela. The tanker was travelling from Iran to Venezuela, according to US officials.\n\n\n\nLISTEN TO 'Shadow fleet' still appearing in Australian supply chains despite sanctions, research finds SBS News 03:49 English\n\nUS European Command, which oversees American forces in the region, said in a statement on X that the seizure took place \"pursuant to a warrant issued by a US federal court\".\n\n\n\n\n\nAccording to the United Kingdom defence secretary John Healey, the vessel moved about 7.3 million barrels of Iranian crude oil over a four-year period, \"the proceeds of which have been used to finance terrorism, threat and instability across the world\".\n\n\n\n\n\nIt's not the first shadow fleet ship to be seized by the US, and experts say it might not be the last.\n\n\n\n\n\nIn December, US special forces seized the Skipper, a crude oil tanker that had been sanctioned by the US treasury in 2022 and was off Venezuela's coast.\n\n\n\n\n\nEarlier on Wednesday, the US coast guard also intercepted a tanker carrying Venezuelan oil, the Panama-flagged M Sophia, near the north-east coast of South America, US officials said, in the fourth seizure in recent weeks.\n\n\n\nA 'message' to Russia, Iran and Venezuela\n\nExperts say the recent crackdown on alleged shadow fleet vessels was designed to send a message.\n\n\n\n\n\nAnton Moiseienko, a senior lecturer in law at the Australian National University, said the US was prepared to risk escalation with Russia, which has previously retaliated against countries such as Greece after they seized shadow-fleet vessels.\n\n\n\n\n\n\"I think the primary message is 'we're really serious', the US is very serious about Venezuela and Iran and sanctions against them.\n\n\n\n\n\n\"That's how I would read it.\"\n\n\n\nMick Ryan, a retired Australian Army major general and senior fellow for military studies at the Lowy Institute, said US President Donald Trump's message may be specifically directed at Russian President Vladimir Putin.\n\n\n\n\n\nHe said that the seizure of the Russian-flagged ship was \"not an accident. It was very deliberate.\"\n\n\n\n\n\n\"The US had intelligence about this ... The Americans are sending a very deliberate message to the Russians that they're not happy with their conduct in Ukraine. They're not happy with them for stalling peace in Ukraine,\" he told SBS News.\n\n\n\n\n\n\"This is all part of the strategic messaging towards Putin to say, 'Enough's enough. It's time to negotiate in good faith.'\"\n\n\n\nREAD MORE Zelenskyy praises European, US moves towards legally binding security guarantees for Ukraine\n\nIn an interview with SBS World News, former Australian ambassador to Russia Peter Tesch echoed those sentiments, saying: \"I think there is a sense that perhaps this is one of those backdoor ways that America may be able to pressure Russia.\"\n\n\n\n\n\n\"Russia is very keen to shore up whatever revenues it can attract from its illegal circumvention of sanctions because for it, of course, oil exports remain one of the primary sources of revenue that help fuel its war of choice in Ukraine,\" said Tesch, who also previously served as deputy secretary at the Department of Defence.\n\n\n\n\n\nUkraine's foreign minister, Andrii Sybiha, also linked the seizure to the Russia-Ukraine war, saying it was \"relevant to the peace process and bringing a lasting peace closer\".\n\n\n\nBoth Tesch and Ryan said similar moves against shadow fleet vessels could become more common.\n\n\n\n\n\n\"I don't think we've seen the end of it yet,\" Tesch said.\n\n\n\n'Not lawfully Russian-registered'\n\nAnother notable detail about the seizure is the country with which the Marinera was — or claimed to be — registered.\n\n\n\n\n\nMoiseienko said: \"What is remarkable about this seizure is that it took place on the high seas, and it also took place after the vessel put on the display of a Russian flag, claiming that it was registered to Russia.\"\n\n\n\n\n\n\"The legal significance is that you can enforce your laws even on the high seas against stateless vessels, but not vessels that are registered to another state,\" he told SBS News.\n\n\n\n\n\nRussia's transport ministry has called the seizure a violation of maritime law.\n\n\n\nThe US European Command announced the seizure of the Bella-1 for \"violations of US sanctions\". Credit: US European Command However, despite displaying a Russian flag, the Marinera may not be subject to the country's legal protection.\n\n\n\n\n\nThe UK Ministry of Defence, which assisted in the seizure of the tanker, said the ship was \"initially flying a false flag\" and later \"turned off its transponders while at sea and sought to reflag while being pursued\".\n\n\n\n\n\nJennifer Parker, a non-resident fellow at the Lowy Institute and an expert in naval studies, told SBS News that even if the ship was displaying a Russian flag, the seizure was legal — because \"vessels can't just change their registry at sea during a voyage\".\n\n\n\n\n\n\"It's not lawfully a Russian-registered vessel because it went through the process of trying to change its flag by painting the flag on the side whilst it's at sea,\" she said.\n\n\n\nMore tankers flying Russian flag\n\nAn increasing number of alleged shadow-fleet tankers have been changing their registrations to Russian ones in recent months.\n\n\n\n\n\nRichard Meade, editor-in-chief of Lloyd's List — an international news and analysis service on shipping — told CNBC there's been \"an accelerated shift of vessels changing to the Russian flag over the past month\".\n\n\n\n\n\n\"Seventeen shadow fleet tankers changed fraudulent flags to join the Russian flag in the past few weeks alone,\" he said.\n\n\n\n\n\nSome experts have said the tankers are re-flagging as Russian in an attempt to gain Russia's protection.\n\n\n\nParker said that, except in rare circumstances, ships can't be boarded if they're flagged to another country, unless that country agrees to it.\n\n\n\n\n\n\"Russia's not going to agree to that. So it does make it difficult, if they are going to be flagged to Russia to get the jurisdictional access,\" she said.\n\n\n\n\n\nHowever, she said this only applies if a ship has \"reflagged lawfully\", adding: \"I don't think this Bella-1 was [re-flagged lawfully] in any way.\"\n\n\n\nAustralia 'monitoring' the situation\n\nFollowing Russia's full-scale invasion of Ukraine in February 2022, Australia imposed sanctions on the direct import of crude oil and refined oil products from Russia.\n\n\n\n\n\nIt's also taken action against Russia's shadow fleet by imposing sanctions on 200 Russian shadow-fleet oil tankers, according to the Department of Foreign Affairs and Trade in December.\n\n\n\n\n\nSBS News revealed in October that at least 25 of the tankers were supplying Australian companies, based on data compiled by the Centre for Research on Energy and Clean Air (CREA) in June.\n\n\n\n\n\nAccording to CREA data, Australia was at the time the largest importer of oil products refined from Russian crude in third countries.\n\n\n\nEnvironment Minister Murray Watt has said the government was \"monitoring\" the US seizure of vessels such as the Marinero.\n\n\n\n\n\n\"What I can say is that there has been a pattern of countries like Russia and Iran using shadow fleets to try to get around sanctions.\n\n\n\n\n\n\"This would not be the first time that we've seen these kinds of vessels undertaking these kinds of voyages. But as I say, we're still at the stage of monitoring this and trying to establish the facts.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/2026-australian-property-market-predictions/7zupc0y3o",
        "title": "Where will prices grow the most? This year's property market predictions",
        "publish_date": "Thu, 8 Jan 2026 18:35:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Record-high house prices, lower interest rates, and increased policy support are among the predictions for the Australian property market this year.\n\n\n\n\n\nAt the end of 2025, property research firm Cotality's Home Value Index surged 8.6 per cent in 2025, adding roughly $71,400 to the national median dwelling value.\n\n\n\n\n\nTim Lawless, Cotality's research director, told SBS News: \"It was pretty clear by the end of the year, most regions were losing some momentum or losing some speed in the rate of growth.\"\n\n\n\n\n\n\"So more of a levelling out in many ways, but it might be setting the scene for a softer outcome coming into 2026,\" he said.\n\n\n\nREAD MORE Why Australian property prices have dropped for the first time in two years\n\nHowever, Lawless said the year's outlook remains uncertain and dependent on interest rates.\n\n\n\nWhich capital city's house prices will grow the most?\n\nSydney and Melbourne are forecast to have the strongest price growth, according to Domain's 2026 property forecast, while Brisbane and Perth are expected to lead unit price growth.\n\n\n\n\n\nUnit prices are expected to outpace house prices in Brisbane, Adelaide and Perth as more buyers shift to affordable homes.\n\n\n\nDomain's most recent forecasts predict the median combined capital city house price is on track to rise by 6 per cent in 2026. House and unit prices across the country's combined capitals are predicted to rise by 6 per cent and 5 per cent respectively, reaching a record high by the end of 2026, according to Domain.\n\n\n\n\n\nAs for the regions, Lawless from Cotality said the market is diverse, with values up 9.7 per cent compared to the capital cities' 8.2 per cent.\n\n\n\n\n\n\"Even though we did see a stronger growth outcome across regional Australia in 2025 ... it does seem that the strongest regional markets are very much skewed towards the very affordable areas that typically are very different to what we're seeing as the strongest regional markets through the pandemic,\" he said.\n\n\n\nWhat will the rental market look like this year?\n\nAccording to Domain, rents will rise in Sydney, Melbourne and Canberra, reflecting rising household incomes and tight rental supply.\n\n\n\n\n\nFollowing years of rises, Perth's rental market is showing signs of moderation this year.\n\n\n\nRent prices for units are expected to increase more than houses this year. In most capital cities, unit rent prices are expected to rise slightly faster than house rents, reflecting affordability pressures and stronger demand for smaller, more affordable dwellings.\n\n\n\n\n\nBut Lawless said with vacancy rates nationally at 1.7 per cent, there won't be much of a rise.\n\n\n\nHow will policies impact the market?\n\nLawless said first home buyer incentives are \"distorting the market to some extent\".\n\n\n\n\n\nThe lower quartile of home values is rising the fastest, particularly after the announcement of the 5 per cent home deposit scheme.\n\n\n\n\n\n\"Even when we simply split out properties that are above or below the expanded deposit guarantee price caps, it's really clear there's been a divergence in growth trends even a month prior to the scheme going live,\" Lawless said.\n\n\n\nFirst-home buyers and investors actively buying these types of homes are creating a funnel of demand.\n\n\n\n\n\nDomain's forecast report stated that, by enabling purchases with a 5 per cent deposit and no mortgage insurance, house prices could rise by up to 6.6 per cent in the first year.\n\n\n\n\n\nFor some jurisdictions, the introduction of policies — such as Victoria's ban on rental bidding — that protect renters may impact investors seeking to buy.\n\n\n\nWhat are banks predicting?\n\nThe Reserve Bank of Australia (RBA)'s first policy meeting of the year is scheduled for early February. Back in December, RBA governor Michele Bullock flagged a possible rate increase if inflation could not be contained.\n\n\n\n\n\nOn 2 January, the Australian Securities Exchange 30 Day Interbank Cash Rate Futures February 2026 contract was trading at 96.32, indicating a 36 per cent expectation of an interest rate increase to 3.85 per cent at the RBA meeting.\n\n\n\n\n\n\"Well, clearly, a higher interest rate environment is a net negative for housing markets and housing demand. It probably also sends a bit of a shudder through sentiment, which is really important for housing markets or any sort of purchasing decision that's on a high financial commitment,\" Lawless said.\n\n\n\nAny good news for Australians looking to enter the market?\n\nApprovals and commencements for dwellings rose through 2025, according to Domain — indicating an increase in supply for 2026.\n\n\n\n\n\nOn top of this, population growth is slowing, which means fewer additional people per new dwelling, prompting a rebalance of the market.\n\n\n\n\n\nVacancy rates are expected to slightly increase from record lows to more sustainable levels.\n\n\n\n\n\nA slow but steady recovery in household incomes is underway, which may provide some relief to both buyers and renters in 2026.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-annual-sydney-festival-kicks-off-marking-its-50th-anniversary/iik588eyw",
        "title": "The annual Sydney Festival kicks off, marking its 50th anniversary",
        "publish_date": "Thu, 8 Jan 2026 09:18:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trumps-crude-move-on-venezuela-unrest-in-iran-chinas-condom-conundrum/05juodi4g",
        "title": "Trump's crude move on Venezuela, unrest in Iran & China's condom conundrum",
        "publish_date": "Thu, 8 Jan 2026 06:32:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-sharemarket-up-100-in-just-3-days-bluescope-rejects-takeover-bid/s4z6x4x4d",
        "title": "The sharemarket up 100% in just 3 days & Bluescope rejects takeover bid",
        "publish_date": "Thu, 8 Jan 2026 06:24:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/anthony-albanese-backflips-on-bondi-attack-royal-commission-after-ongoing-pressure/3s5z8bjx4",
        "title": "Albanese announces Bondi terror royal commission as Ley says he was 'forced' into it",
        "publish_date": "Thu, 8 Jan 2026 06:04:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese has bowed to pressure and announced a royal commission into the Bondi terror attack.\n\n\n\n\n\nAfter weeks of rebuffing growing calls for a federal inquiry, Albanese announced a Commonwealth royal commission on Thursday afternoon following a cabinet meeting. It will be focused on antisemitism and social cohesion.\n\n\n\n\n\nFormer High Court Justice Virginia Bell will lead the inquiry, with Albanese confident she will examine the \"complex issues ahead with impartiality and precision\", amid criticism from some members of the Jewish community over her appointment.\n\n\n\n\n\nOpposition leader Sussan Ley said the announcement \"finally\" heeds the pleas of \"the families of victims, the Jewish community and the wider community\", as she accused Albanese of acting only out of political self-interest.\n\n\n\n\n\nStanding beside Home Affairs Minister Tony Burke, antisemitism envoy Jillian Segal and Attorney-General Michelle Rowland, Albanese said that, following a period of reflection, he had decided a royal commission was \"essential\".\n\n\n\n\n\nAlbanese told reporters: \"I've repeatedly said that our government's priority is to promote unity and social cohesion, and this is what Australia needs to heal, to learn, to come together in a spirit of national unity.\"\n\n\n\nLey said the decision was \"not an act of leadership, it is an admission that his litany of excuses have collapsed\".\n\n\n\n\n\n\"Anthony Albanese relented, not because he believed a Commonwealth royal commission was the right thing to do, but because he was forced to do so by the Australian people,\" she said in a statement.\n\n\n\n\n\n\"The pleas of the families of victims, the Jewish community and the wider community have finally been heeded, but as always, Anthony Albanese has only acted when he judged it was in his political interest. His political interest is the only thing that guides him, never the national interest.\n\n\n\n\n\n\"Leadership requires action, and this prime minister refused to act until resistance became impossible.\"\n\n\n\nCommission will focus on four areas\n\nAlbanese said the commission would focus on four key areas: tackling antisemitism, including its key drivers; assisting agencies to respond to antisemitism; examining the circumstances of the Bondi terror attack; and strengthening social cohesion.\n\n\n\n\n\n\"A royal commission is not the beginning or the end of what Australia must do to eradicate antisemitism or protect ourselves from terrorism or strengthen our social cohesion,\" he said.\n\n\n\n\n\n\"That's an ongoing national effort for all of us as individuals, but also institutions, because an attack on Jewish Australians is an attack on all Australians.\"\n\n\n\n\n\nThe commission wouldn't be a \"drawn-out process\", Albanese said, adding that Bell would be asked to report back by 14 December 2026, exactly one year after the Bondi attack.\n\n\n\nREAD MORE Hate preacher laws top of agenda as parliament likely to return in coming weeks\n\nAlbanese clarified that the timeline of the commission had been \"curtailed\" by rolling in the Richardson review, which is set to report in April and will examine Australia's intelligence agencies and their response to the attack.\n\n\n\n\n\nNSW Premier Chris Minns has since announced that, given the establishment of a Commonwealth royal commission, a previously announced state-level royal commission would not proceed.\n\n\n\n\n\nMinns added that NSW would \"fully cooperate\" with the federal inquiry.\n\n\n\n\n\nWhen asked about the cost of the inquiry, Albanese said it would be revealed in the May budget.\n\n\n\nJustice Virginia Bell investigated former prime minister Scott Morrison over his appointment to multiple ministries during the COVID-19 pandemic. Source: AAP / . He said the inquiry would build on immediate actions, including fast-tracking tougher gun laws, additional resources for law enforcement agencies to help prevent further attacks and anticipated new laws to criminalise hate speech.\n\n\n\n\n\nThe massacre on Bondi Beach is the worst terror attack in Australian history, with 15 people killed and over 40 injured.\n\n\n\n\n\nThe attack prompted calls for a national response from the Opposition, independents, former federal ministers, business leaders, public figures and more than 60 Australian sports stars, as well as victims' families and sections of the broader Jewish community.\n\n\n\n\n\nHowever, on Tuesday, he noticeably softened his language, opening the door to the possibility of a royal commission.\n\n\n\nAntisemitism envoy Jillian Segal praised the prime minister for listening to community calls, saying it \"does reflect the seriousness of the growth in antisemitism and its impact on our country\".\n\n\n\n\n\n\"The focus will remain on prevention, education, institutional accountability and community, and I think Australians expect truth about what happened at Bondi and the root causes,\" she said.\n\n\n\n\n\n\"They expect sustained action to address the conditions that allowed such hatred to take root, and both must proceed together. So I will work very closely, where appropriate, with the commissioner.\"\n\n\n\nAlbanese, Burke push back on Ley's proposal\n\nLey has been calling for a federal royal commission for weeks, releasing a draft terms of reference a week after the Bondi attack.\n\n\n\n\n\nIt included having three commissioners, with at least one member of the Jewish community, alongside a senior judicial member and an expert in national security.\n\n\n\n\n\nBurke said the dozens of recommendations would have delayed an outcome, with Labor's terms of reference allowing the government to \"act quickly on national security\".\n\n\n\n\n\n\"Some of the terms of reference that had been floated around, in particular from the Opposition in recent weeks, would have left something that gave us no answers for a very long time,\" Burke said.\n\n\n\nREAD MORE Pressure increases on PM to establish post-Bondi Royal Commission\n\n\"And also would have failed to have the priority of social cohesion in the structure that's been given here.\"\n\n\n\n\n\n\"If we had adopted the 73-point proposal that was put forward by the opposition, we would have been many years down the track before we received any practical outcomes,\" Albanese added.\n\n\n\n\n\nLey said the Opposition would review Labor's announced terms of reference \"in consultation with the Jewish community and national security experts, to ensure no stone is left unturned and that every issue that must be addressed can be addressed\".\n\n\n\n\n\nShe also criticised the decision to appoint a single commissioner, saying it was \"inadequate for an inquiry of this scale, complexity and importance\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/us-seizes-two-venezuela-linked-oil-tankers/t5n59aqz7",
        "title": "US seizes two Venezuela-linked oil tankers",
        "publish_date": "Thu, 8 Jan 2026 03:03:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe United States has seized two oil tankers from the Atlantic Ocean and Caribbean Sea.\n\n\n\n\n\nOne of the tankers, a merchant vessel named Marinera operating under the Russian flag, has been seized in the North Atlantic.\n\n\n\n\n\nFormerly known as the Bella-1, the Marinera was empty of oil, but the Trump administration says the tanker is part of a shadow fleet that carries oil for Venezuela, Russia and Iran in violation of US sanctions.\n\n\n\n\n\nWhite House Press Secretary Karoline Leavitt says the Trump administration shows no tolerance for the transportation of US-sanctioned oil, and the tanker's crew may face prosecution.\n\n\n\n\n\n\"The vessel had a judicial seizure order and the crew, so that means the crew is now subject to prosecution for any applicable violation of federal law, and they will be brought to the United States for such prosecution if necessary.\"\n\n\n\n\n\nThe US had been pursuing the Marinera since last month, after it tried to evade the U-S blockade on sanctioned oil vessels around Venezuela.\n\n\n\n\n\nThe US military announced it had also secured a second sanctioned tanker in the Caribbean Sea, a Panama-flagged vessel called the Sophia.\n\n\n\n\n\nAccording to records of Venezuela's state oil company, this second vessel was fully loaded, and Ms Leavitt says US plans are underway for the seized oil to be sold on the global market.\n\n\n\n\n\n\"This was the sanctioned oil that was basically just sitting in barrels, sitting on ships because of the effective quarantine of the United States of America. And the interim authorities have agreed to release that oil to the United States, so it will be arriving here at home very soon.\"\n\n\n\n\n\nThe seizure of the two tankers takes place just days after the US captured Venezuelan President Nicolas Maduro and his wife in a military raid on Caracas, an operation legal experts say was a clear violation of international law.\n\n\n\n\n\nPresident Donald Trump has since openly spoken of controlling Venezuela's vast oil reserves, in conjunction with US oil companies.\n\n\n\n\n\nUS secretary of state Marco Rubio has confirmed the US has plans for long-term control of Venezuela’s oil industry.\n\n\n\n\n\n\"We are going to take between 30 and 50 million barrels of oil we're going to sell it in the marketplace at market rates not at the discounts Venezuelans getting that money will then be may handled in such a way that we will control how it is disbursed in a way that benefits the Venezuelan people. Not corruption, not the regime so we have a lot of leverage to move on the stabilisation front. The second phase will be a phase that we call recovery, and that is ensuring that American, Western and other companies have access to the Venezuelan market in a way that's fair.\"\n\n\n\n\n\nPresident Trump says the US has already reached a deal with Caracas to import US$2 billion worth of Venezuelan crude oil to the US, the world's largest oil consumer.\n\n\n\n\n\nThe deal could initially require cargoes that were originally bound for China, Venezuela's top oil buyer, to be rerouted.\n\n\n\n\n\nChinese foreign ministry spokesperson Mao Ning says the US continues to violate international law and must not be allowed to disrupt trade between sovereign nations.\n\n\n\n\n\n\"The United States has long imposed illegal, unilateral sanctions on Venezuela’s oil sector, and has recently brazenly used force against Venezuela, dealing a severe blow to the country’s economic and social order and also threatening the stability of global production and supply chains. China has already issued strong condemnation in this regard. I would like to reiterate that cooperation between China and Venezuela is a cooperation between sovereign states, and is protected by international law and the laws of both countries.\"\n\n\n\n\n\nResponding to the US's seizure of the two oil tankers, the United Nations Secretary-General's spokesperson Stéphane Dujarric has urged de-escalation and compliance with international law.\n\n\n\n\n\n\"Enforcement actions on the oceans and seas are to be taken in accordance with applicable international law in order to ensure maritime safety and security on the high seas. And we would want to see avoidance of any further escalation.\"\n\n\n\n\n\nMr Dujarric says a state's sovereignty over its natural resources must be respected as a cornerstone of International human rights law.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/will-towers-rise-above-the-new-woollahra-station-we-re-about-to-find-out-20260108-p5nskb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Will towers rise above the new Woollahra station? We’re about to find out",
        "publish_date": "Fri, 09 Jan 2026 13:06:26 +1100",
        "category": "finance",
        "authors": [
            "Matt O'Sullivan",
            "Alexandra Smith"
        ],
        "text": "Advertisement\n\nPoliticsNSWPlanning Will towers rise above the new Woollahra station? We’re about to find out Matt O'Sullivan and Alexandra Smith January 9, 2026 — 1:06pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nInvestigations to start this weekend into ground conditions at the site of a planned station at Woollahra in Sydney’s east will determine the scale of the project and whether towers can be built above the railway like those at Bondi Junction, Waterloo or in the central city. More than four months after Premier Chris Minns revived plans for a station at Woollahra, the state’s transport department will carry out geotechnical investigations of the ground conditions, as well as assessments of existing structures at the site. The work will take place during a scheduled shutdown of the T4 eastern suburbs line for track repairs this weekend. The site on the eastern suburbs line at Woollahra will undergo geotechnical assessments this weekend. Wolter Peeters It signals the ramping up of an extensive list of work that will be required to meet an ambitious timeframe for construction to start on the station next year and be completed in 2029. The government has estimated the station will cost $200 million to build. The assessment of ground conditions will give planners a greater sense of the extent of design options for the station, and whether they could include towers above the railway. Apartment towers above the station would help the government more easily meet its target for up to 10,000 homes to be built in Woollahra and nearby Edgecliff.\n\nAdvertisement\n\nSo-called over-station developments comprising office or apartment towers have or are being built atop some stations on Sydney’s expanding metro rail network, including Waterloo, Crows Nest and Martin Place. A number of stations on the city’s heavy rail network including Bondi Junction, Edgecliff and Chatswood also feature developments above the railway. The site at Woollahra has sat idle since the 1970s when a station was proposed there for the eastern suburbs rail line but did not progress due to cost blowouts and strong opposition from the local community. NSW ministers John Graham, Paul Scully and Rose Jackson with Premier Chris Minns at the Woollahra station site in August. Sitthixay Ditthavong The government plans a rezoning of Woollahra and Edgecliff stations, similar to those at Burwood North and along Parramatta Road, to clear the way for up to 10,000 homes to be built. The rezoning is expected to take about two years, and plans are due to be put on public exhibition in the second half of this year. Transport Minister John Graham said the government was in the early stages of the rezoning of Woollahra and Edgecliff stations, and any decisions on an over-station development would come once it was further progressed.\n\nAdvertisement\n\nRelated Article Development Revealed: How long it will take to turn Woollahra into a train station housing hub Graham said it was a “back to the future moment” in which work to connect the Woollahra ghost station into the rail system would begin this weekend. “This station just makes sense when you consider the young families that are being forced to move out of Sydney because they can’t afford a home,” he said. “About 10,000 new homes in this area are part of the solution to that problem and a rebalance from all housing growth happening in Sydney’s west.” Earlier this week, Opposition Leader Kellie Sloane said there would be no change to the Coalition’s pro-housing policy or its position on supporting the opening of the Woollahra station.\n\nAdvertisement\n\nSloane announced her new-look shadow cabinet, which included vocal YIMBY Chris Rath taking on the planning and housing portfolio. She said the Coalition would continue the stance it took under former leader Mark Speakman and pursue a YIMBY (yes in my backyard) agenda. Related Article NSW State Parliament ‘No-brainer’: Architects, developers ready to pounce on Woollahra ghost station “Chris Rath has experience and an interest in housing and development and I thought he was the best person for the role, and he reflects that consistent position on housing,” she said. “We need to be pro-housing, we need to make sure young people have an opportunity to fulfil their dreams of home ownership.” Transport for NSW secretary Josh Murray said the geotechnical work at Woollahra would be critical to inform plans for the design of the station, and he reiterated that construction was expected to start next year and be completed in 2029. “These works are an important step toward delivering a station that meets the needs of the community for decades to come,” he said. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/ex-nrl-star-s-gyms-cop-175k-bill-for-playing-music-during-classes-20260109-p5nssj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ex-NRL star’s gyms cop $175k bill for playing music during classes",
        "publish_date": "Fri, 09 Jan 2026 13:05:58 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Advertisement\n\nBusinessCompaniesCopyright Ex-NRL star’s gyms cop $175k bill for playing music during classes Elias Visontay January 9, 2026 — 1:05pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nA gym chain part-owned by ex-NRL player and media personality Beau Ryan has been ordered to pay $175,000 for copyright infringement after it played songs by artists such as Avicii and Vengaboys in classes without paying licensing fees. In December, the federal court found that the companies operating S1 Training gyms – a business that first opened in Sydney’s Coogee before expanding with franchises across New South Wales and Victoria – had infringed copyright on various occasions when playing music during guided workouts between 2020 and 2024. The legal action was brought by the Australasian Performing Right Association (APRA), which grants and administers licences to businesses to the vast majority of the world’s commercially available music. Any business that plays copyright protected music, whether it be radio or from a streaming platform, is required to pay APRA for a “OneMusic” licence. The fees are distributed as royalties to rights holders through record companies after a process that includes researching and tracking radio air play, box office reports, streaming data as well as sound recognition devices placed in businesses.\n\nAdvertisement\n\nThe claim was filed against five companies and director Kieran Turner. There was no claim against Ryan, and Ryan was not involved in or aware of the copyright infringement. Editor's pick Exclusive\n\nFitness Rich lister revealed as likely buyer for Derrimut 24:7 Gym chain Undercover officers attended a range of S1 classes at Sydney branches in Coogee, Bondi Junction and Caringbah, as well as in Melbourne’s Prahran, and made recordings of the entire sessions, which were later provided as evidence. Additionally, videos posted to social media of activities recorded at various branches in which music is playing formed evidence. The judgment states that the music recognition app Shazam was used to identify the music played during fitness classes. The court found that tracks played at the gyms included Horny 98′ Radio Edit by Mousse T., We Like to Party by Vengaboys, Booty Bounce by Tujamo and Taio Cruz, Wake Me Up by Avicii and Don’t You Worry Child by Swedish House Mafia.\n\nAdvertisement\n\nAPRA alleged that after becoming concerned about a potential copyright infringement in May 2022, it contacted franchises and Turner explaining the requirement and offering the businesses a licence. It claimed that Turner did not accept this offer, nor further offers, and that he didn’t take action to stop unlawful music performances once becoming aware of legal requirements. Beau Ryan as host of Channel Ten’s Amazing Race. Ten Turner claimed that APRA could not establish it owned the copyright to any musical works performed at the gyms, and that undercover officers’ covert recordings were made illegally. He also said that if songs had been played at S1 gyms, he did not personally authorise the fitness trainers to do so, and that they had the discretion to conduct classes with or without music. He claimed organising licensing was the responsibility of each trainer contractor.\n\nAdvertisement\n\nHowever, judge Nicholas Manousaridis found that “the performance of music was an essential element” of S1 classes, and that Turner would have been aware because he arranged for sound equipment to be installed in S1 studios. Manousaridis also noted a requirement in S1’s contractor agreement for trainers to “turn up five minutes before class and check set-up and cleanliness of studio and turn on music and screens”. The court ordered various S1 branches to pay damages amounting to the cost of unpaid licence fees for their premises, interest on those amounts, as well as additional damages of $3000 for each of the 25 tracks found as infringements. This amounted to $175,398 which the court found Turner was personally liable for, a liability which would be reduced if any of the gym franchises paid their own specific fees and damages. S1 noted that all of its gyms except for the Coogee branch were now “insolvent and have been wound up”. It is unclear if this is related to the legal proceedings and payment orders.\n\nAdvertisement\n\nAdvertisement\n\nRyan is host of Channel 10’s Amazing Race and a radio presenter on Triple M. He has been contacted for comment. Karen Holmes, the director of APRA’s OneMusic licensing organisation, said it regularly contacts businesses such as bars and gyms which they believe are playing music in breach of copyright and gives them an opportunity to pay for a licence. “It is typically an action of last resort to seek redress via the courts,” Holmes said. S1 did not respond to multiple requests for comment. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Copyright\n\nFitness Elias Visontay is a National Consumer Affairs Reporter at The Sydney Morning Herald and The Age. Connect via email",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/leadership-shake-up-thrusts-wallabies-star-into-world-cup-captaincy-frame-20260109-p5nsu0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Leadership shake-up thrusts Wallabies star into World Cup captaincy frame",
        "publish_date": "Fri, 09 Jan 2026 12:57:01 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Fraser McReight has been confirmed as the Queensland Reds skipper for the 2026 Super Rugby Pacific campaign, replacing halfback Tate McDermott and the departing Liam Wright in what will be coach Les Kiss’ final season before he takes the national reins.\n\nStandout flanker McReight has been lauded as a long-term captaincy candidate in Wallabies colours.\n\nFraser McReight became the 91st Wallabies captain. Credit: Getty Images\n\n“This role is a huge honour and even more so because I follow some great mates and leaders into the role, having watched Tate and Liam do a terrific job,” said McReight, who became the Wallabies’ 91st captain during a Rugby Championship clash with South Africa.\n\n“They showed me the path over the past four seasons, and hopefully I’ll now land on my path as a captain with all I’ve learnt about myself as a person and as a player.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/so-you-ve-got-20-000-and-want-to-meet-roger-federer-there-s-still-a-problem-20260108-p5nsme.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "So you’ve got $20,000 and want to meet Roger Federer? There’s still a problem",
        "publish_date": "Fri, 09 Jan 2026 12:28:21 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe",
            "Billie Eder"
        ],
        "text": "Got a spare $20,000 and want to meet tennis legend Roger Federer in Melbourne next weekend? It looks like it still won’t be enough.\n\nThat’s the eye-popping price tag for a chat and a handshake with the 20-time grand slam singles champion at this year’s Australian Open, but anyone still wanting to buy VIP tickets for next Saturday night’s Federer experience on Ticketmaster was left disappointed on Friday morning, with a message telling prospective customers: “We’ll contact you if new tickets are released. Join waiting list.”\n\nHe’ll wave for free, but to meet Roger Federer will cost you $20,000. Credit: AP\n\nThe meet-and-greet with Federer was one of two VIP options put on sale by Tennis Australia in December. The cheaper option ($2500 a person) offers seats to a Q&A with the tennis great, paired with cocktails and “premium” beverages.\n\nBut guests willing to fork out $20,000 each will get what has been sold as a “once-in-a-lifetime opportunity” to meet Federer in his dressing room. The meeting, which you’d assume would involve at least a selfie with the 44-year-old, will take place before he plays in a match with Andre Agassi, Pat Rafter, and Lleyton Hewitt, in what is billed as the “battle of the World No.1s” during the Australian Open’s first-ever opening ceremony.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victorias-emergency-management-commissioner-confirms-property-loss-in-fires-20260109-p5nsu4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victoria's emergency management commissioner confirms property loss in fires",
        "publish_date": "Fri, 09 Jan 2026 12:24:16 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/kyrgios-rules-himself-out-of-an-australian-open-singles-wildcard-20260109-p5nstd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kyrgios rules himself out of playing Australian Open singles",
        "publish_date": "Fri, 09 Jan 2026 12:10:41 +1100",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Nick Kyrgios has ruled himself out of playing singles at the Australian Open, after deciding to focus on doubles with his partner Thanasi Kokkinakis in Melbourne.\n\nKyrgios will not take a potential wildcard spot after battling with significant wrist and knee surgeries over the last three years and slipping to No.670 in the world rankings.\n\nThe former Wimbledon finalist said via Instagram on Friday morning he wanted the wildcard spot to instead go to a player ready for the rigours of five-set tennis.\n\n“After some good conversations with TA [Tennis Australia], I’ve made the call to focus on doubles for this year’s AO,” Kyrgios posted.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/arctic-storm-grips-britain-and-europe-20260109-p5nstt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Arctic storm grips Britain and Europe",
        "publish_date": "Fri, 09 Jan 2026 11:55:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/dry-thunderbolts-in-the-night-set-the-hair-on-end-20260109-p5nsrc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dry thunderbolts in the night set the hair on end",
        "publish_date": "Fri, 09 Jan 2026 11:54:51 +1100",
        "category": "finance",
        "authors": [
            "Tony Wright"
        ],
        "text": "Advertisement\n\nNationalVictoriaBushfires Dry thunderbolts in the night set the hair on end Tony Wright January 9, 2026 — 11:54am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nFollow our live bushfire blog for the latest updates A fusillade of lightning and the detonation of thunder arrived in Portland at precisely midnight. We hoped it was not the presage to a day of catastrophe for Victoria, but it set the hair on end and felt like the coming of a day of judgment. A bolt of lightning over Portland, south-west Victoria, during a massive dry electrical storm just after midnight Friday. Anne McCurdy The dry storm lasted more than an hour-and-a-half in this far south-west corner of Victoria. We stood on the verandah, scanning the dark for a sign that one of those hundreds of lightning strikes had ignited the forest beyond the horizon or grassland nearby.\n\nAdvertisement\n\nRelated Article Breaking\n\nVictoria bushfires Three missing, including child, as fire rips through Victorian town We were lucky. No flame rose into the night. Not here. Not yet. We were a long way from the active disasters and impending catastrophe in Victoria’s Strathbogie Ranges and beyond, and in the north-east near Walwa. But friends at Mansfield were siphoning water from their dam and priming their generator to defend their home if the worst were to happen, and they’d taken in friends who had been evacuated from the spreading area of the Longwood fire, a restless night ahead of them. We were in touch by text message, hoping for the best, fearing worse. It seemed almost surreal these friends had been with us on holiday in our safe pocket by the sea only a couple of days ago.\n\nAdvertisement\n\nTongues of dry lightning light up the beach at Portland soon after midnight Friday. Kevin Taplin The explosions of thunder and the bolts of lightning – some of them almost simultaneous, known with perfect accuracy as thunderbolts – brought home the reality that the worst fear of Victorians, uncontrollable bushfire, was only a flash away on a hot night. We sat out by the coast near Portland, about half an hour from the South Australian border. The midnight storm came in a long line of thunderbolts from across the border, lighting up the sky in south-east South Australia, itself a dangerous fire zone when the conditions turn malicious. North of us, at Dunkeld, Strathdownie, Apsley and Horsham, paddocks ignited at the touch of lightning flashes. Local firefighting volunteers, on anxious alert all night, were on to all these small outbreaks within minutes and had the flames extinguished before they could race off across the landscape.\n\nAdvertisement\n\nThe thunder grumbled off across our bay soon after 1.30am, though the lightning, dry and dangerous, could be seen for another half hour. Victoria’s day of trepidation was on the way. Get alerts on breaking news as it happens. Sign up for our Breaking News Alert.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victorian-bushfires-three-unaccounted-for-homes-lost-20260109-p5nstq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victorian bushfires: Three unaccounted for, homes lost",
        "publish_date": "Fri, 09 Jan 2026 11:53:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/veg-loaded-recipes-to-kick-start-your-health-goals-20251222-p5npls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A week of veg-loaded recipes to kick-start your health goals",
        "publish_date": "Fri, 09 Jan 2026 11:53:13 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Recipe collection\n\nA week of veg-loaded recipes to kick-start your health goals\n\nBoost your vegetable intake this week with a healthy spin on mac 𝄒n𝄒 cheese, a speedy rice dish that has all the flavours of spanakopita, and more.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/the-new-world-disorder-where-might-is-right-20260109-p5nspn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The new world disorder where might is right",
        "publish_date": "Fri, 09 Jan 2026 11:50:00 +1100",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "The security of the old world order is being blasted away with every airstrike to enforce the will of US President Donald Trump.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share\n\nThe security of the old world order is being blasted away with every airstrike to enforce the will of Donald Trump so he can assure his followers he is making America great again. The US president who ridiculed regime change is now vowing to run Venezuela, turn a profit from its oil, and demanding control of Greenland in the hope of painting the world map with the US stars and stripes. The Trump vision comes with proof of his willingness to deploy hard power, rather than merely posting “truths” on social media, to get his way. It includes bombing Caracas, capturing Venezuelan leader Nicolás Maduro and seizing oil tankers on the high seas. And it shakes old alliances because it comes with a signal that he could use force against others – even NATO members – if they do not submit to his plans. US President Donald Trump can turn on allies in an instant, even when seeming to work with them. Bloomberg It feels like a new world disorder. The sense of balance in world politics is shifting and a new era of great power competition is under way. In this world, might is right. Chinese President Xi Jinping and Russian President Vladimir Putin believed it already. Trump has signed up as well. “It’s not about the rules-based order any more. That’s gone,” says Michael Clarke, a visiting professor at King’s College London, a former director-general of the Royal United Services Institute and a former defence adviser to British governments. Clarke sees an era of major rivals seeking to impose their will across their spheres of influence. American allies, he says, must adapt because they have no choice but to survive in this new dispensation. He quotes an adage: If you’re not running a sphere of influence, you’re in one. There are four major powers in this world view: the United States, China, Russia and India. This seems generous to Putin, given the weakness of the Russian economy, but Russia is a nuclear state that is aggressive in using its military.\n\nAdvertisement\n\nRelated Article Analysis\n\nVenezuela crisis In claiming American strength, Trump also highlights weakness “The reason those big powers are important is that they create the political weather for everybody else,” Clarke says. “And three of those four powers are revisionist. The US, China and Russia are all trying to change the old system that we’ve lived with now for the last 80-odd years. “And two of those four powers are rogue states. Russia, and America now under Trump, are behaving like rogue states in that they’re undermining very directly the politics of countries around them.” Trump’s intervention in Venezuela is not a seismic shift in itself, given that US presidents have used force in Latin America for decades. George H.W. Bush sent troops into Panama in 1989 to replace its leader, Manuel Noriega, and put him on trial for drug trafficking. Trump merely does the same, albeit with newer technology so he can watch it live from his Florida estate. What has changed is the context. Trump can turn on allies in an instant, even when seeming to work with them. The alarming factor over the past week has been the way the White House picked fights with NATO allies over Greenland immediately after displaying its military might against Venezuela. Trump and his team had the opportunity to rule out using force in a dispute with European allies; they never did. The new ethos for using power Trump has the power. He will use it as he wants. One of the president’s most dedicated acolytes, Stephen Miller, the White House deputy chief of staff, said as much this week.\n\nAdvertisement\n\n“We live in a world in which you can talk all you want about international niceties and everything else,” he told CNN on Tuesday. “But we live in a world, in the real world, that is governed by strength, that is governed by force, that is governed by power. These are the iron laws of the world.” Miller was direct about the rationale for intervening in Venezuela. “The US is using its military to secure our interests unapologetically in our hemisphere,” he said. “We’re a superpower, and under President Trump, we are going to conduct ourselves as a superpower.” Nicolas Maduro and Cilia Flores surrounded by security en route to a federal courthouse in Manhattan on Tuesday (AEDT). GC Images Miller’s remark highlighted the fact that this is not about Trump alone. There is a movement of MAGA believers who are backing his “America First” message about turning away migrants, building up the military and putting other countries in their place. Their pivotal test this year comes at the mid-term elections in November. Trump admitted to Republicans on Tuesday (in an address at the Trump Kennedy Centre, which he has just renamed in his own honour) that he could be impeached if the Democrats won control of the House and Senate. The MAGA movement needs to cement its power. Trump has an incentive to engineer a victory on Greenland before election day. Alarm over Greenland\n\nAdvertisement\n\nFrench President Emmanuel Macron is slicing through the usual pretence that America remains a reliable ally. He spoke on Thursday in Paris about the danger of the US “turning away from some of its allies” and “freeing itself” from international rules. “It’s the greatest disorder, the law of the strongest, and everyday people wonder whether Greenland will be invaded, whether Canada will be under the threat of becoming the 51st state or whether Taiwan is to be further circled,” Macron told French diplomats, in remarks reported by the Associated Press. He warned of a “dysfunctional” era in which major powers such as the US and China were tempted to divide the world among themselves. This is a future of competing spheres of influence – and German President Frank-Walter Steinmeier is also ringing the alarm. He argued this week that the Russian invasion of Ukraine had threatened the world order and that US policy was now making a second rupture. Steinmeier, who was Germany’s minister for foreign affairs for eight years, said nations had to push back at the breakdown in values by the US, which helped build the world order. “It is about preventing the world from turning into a den of robbers, where the most unscrupulous take whatever they want, where regions or entire countries are treated as the property of a few great powers,” he said, in remarks reported by Reuters.\n\nAdvertisement\n\nTrump has heightened these concerns with his demand for Greenland. But what is his rationale? Danish Prime Minister Mette Frederiksen has predicted that any US move to take the territory by force would be a conflict within NATO and therefore the end of NATO. There is no logical analysis of the importance of Greenland to justify that cost. The US has a treaty with Denmark from 1951 that allows it to build military facilities in Greenland, which means there is nothing to stop Trump from expanding operations if his security advisers are worried that climate change will alter the military dynamics in the Arctic. At the same time, there is no barrier to minerals exploration: there is an operating gold mine in southern Greenland, for instance, despite challenging conditions. US companies are not being blocked from searching for critical minerals. This leads to the obvious theory that Trump is chasing a legacy. He wants to be the president who adds a vast land mass to the US. One MAGA influencer, Katie Miller, who is married to Stephen Miller, posted a map of the Arctic with Greenland covered in the American flag. At heart, the push for US ownership seems a personal and populist move, more than a strategic imperative. View post on X Venezuela: a precedent for China? How China responds is now a key factor in the aftermath of the US operation in Venezuela, but there are flaws to the theory that Xi will be emboldened to copy Trump and send Chinese special forces into Taiwan. “The Chinese would not regard Taiwan as any easier to attack now than they did before Venezuela,” says Kerry Brown, professor of Chinese studies at King’s College London, and a past professor of Chinese politics at the University of Sydney.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-caravan-park-inundated-after-making-controversial-change-blew-up-020603451.html",
        "title": "Aussie caravan park inundated after making controversial change: 'Blew up'",
        "publish_date": "2026-01-09T02:06:03Z",
        "category": "finance",
        "authors": [],
        "text": "Australians are hitting the roads to travel around the country in droves. However, not everyone's idea of paradise looks the same.\n\nMost families relish the chaos of caravan parks with kids allowed freedom not ordinarily offered to them at home, while others prefer a destination offering peace and quiet.\n\nWith that in mind, Murray Bridge Tourist Park owners Kylie and Wayne Scholz recently decided to buck tradition by turning their caravan park into a sanctuary for adults only.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhile adults-only accommodation is growing in popularity overseas, it's not as common at home.\n\nApart from a few high-end resorts, South Australian man Wayne believes there \"isn't much out there\" for adults in Australia.\n\n\"We were hesitant to do it,\" Wayne said of the risk. But after making the announcement this week, it \"blew up\" with thousands of likes and hundreds of comments.\n\nPets are allowed, but only people over the age of 18 are allowed to stay at Murray Bridge Tourist Park, as of this January.\n\nMurray Bridge Tourist Park's swimming pool is an idyllic place to while away hours on holiday. Source: Supplied\n\nThe accommodation at the caravan park is designed with adults in mind. Source: Supplied\n\n'No point competing' with family caravan parks\n\nThe couple explain that caravan parks have traditionally been \"family places\", with two other caravan parks in the Murray River region, which already cater to the family crowd.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"There was no point competing,\" he admitted.\n\nThe couple, who do not have children of their own, told Yahoo News the decision didn't simply happen overnight, and has been 13 years in the making.\n\n\"We bought the park in 2013, and we’ve always maintained that it’s actively managed as a quiet park and promoted it to grey nomads,\" Kylie said.\n\n\"And in the last couple of years, we changed our powered sights to adult-only.\"\n\nAfter seven months exploring South East Asia last year, the pair discovered adults-only hotels and resorts were all the rage.\n\n\"We thought 'this is really good',\" and decided to come home to make it official.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe couple say their caravan park has more of a \"resort feel\" than the average caravan park.\n\n\"To be able to sit with a book at the pool without all the noise and activity that goes on with families, it's a much more relaxed environment,\" Wayne said.\n\n\"I do hope into the future, this is not something that is scary or unusual, it's different for Australia,\" he said.\n\nAussies flock to adults-only concept for camping and caravanning\n\nKylie and Wayne aren't the first to transform their caravan park into an adults-only destination.\n\nLast year, Debbie and her husband George told Yahoo News they sold their kid-friendly caravan park in the Whitsundays — which they ran for 25 years — and opened the adult-only Gum Tree Lodge and Bush Camp in Howard, near Hervey Bay and K’gari.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAnd the niche idea appears to have paid off, with visitors reportedly \"just loving\" the concept.\n\n\"We get lots and lots of return visitors and lots of interest from people who want to come and stay. You know, they might be down south and on the way sort of thing, or it’s earmarked for a stay in the future.\"\n\nData shows more Aussies than ever before are looking for child-free flights.\n\n\"We’re seeing a huge demand in people wanting to travel without kids,\" James Kavanagh, Flight Centre Travel Group Managing Director, told Yahoo.\n\n\"Travel operators are responding to the interest by launching… experiences across airlines, cruising and touring.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]