[
  {
    "url": "https://www.9news.com.au/national/coalition-split-sussan-ley-liberal-leadership-pressure-nationals-david-littleproud-analysis/639f7d38-b0ed-48c9-9cda-69fb66b7f0fc",
    "title": "'Death knell' looms for Ley after second Coalition split in a year",
    "publish_date": "Thu, 22 Jan 2026 00:56:14 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "Less than a year into her reign, the federal Liberal Party's first-ever female leader is sitting on death row.\n\nFor the second time in mere months, Opposition Leader Sussan Ley is commanding only a tattered, single-party Coalition.\n\nSussan Ley is once again under enormous pressure as Liberal leader. (Alex Ellinghausen)\n\n\"She was aware of the consequences if she (accepted the resignations of three senators), that the National Party were being forced into an untenable position,\" he said.\n\n\"She still made that decision.\"\n\nLittleproud and his senators who voted against the government's hate speech legislation also knew the consequences – cabinet solidarity is a fundamental principle within the Coalition agreement.\n\nMake 9News your preferred source of breaking news and exclusives on Google by clicking the image above. (Nine)\n\nBut you won't hear that retort coming from Ley anytime soon, as the opposition leader opts to avoid speaking on the national day of mourning for the Bondi terror attack .\n\n\"That is honourable and noble and in the right spirit of a day of mourning,\" 9News political editor Charles Croucher said.\n\n\"But it's also leaving a lot of airtime to be filled by others, and they will be those who are against her.\n\n\"That could be the final death knell for her in that leadership position.\"\n\nLey's stint as Liberal leader began with a similar schism, but that was repaired in relatively quick time .\n\nThis one appears far less salvageable – the only cure that could bring the two parties back together is Ley's removal.\n\nDavid Littleproud has walked the Nationals away from the Coalition - again. (Alex Ellinghausen)\n\n\"We cannot be part of a shadow ministry under Sussan Ley,\" Littleproud said.\n\nIt leaves the Liberal Party with two options: find a new leader, or continue as the opposition on its own, with fewer than 40 lower house MPs to counter the government's 94.\n\n\"It is a mess. That is the only word for it,\" Croucher said.\n\n\"It's a mess that's going claim at least one scalp at some point in the coming weeks, because clearly David Littleproud and Sussan Ley can't work together.\"\n\nIt's those numbers in parliament that made Ley's decision to accept the resignations of the three Nationals senators who broke shadow cabinet solidarity so risky.\n\n\"You're flexing muscles you don't have,\" Croucher said.\n\n\"There is no room to be this boisterous and stand up to the Nationals, because this is the consequence: the Coalition is split, the opposition looks feeble, and the government's getting a free ride to start 2026.\"\n\nLey won't hold a press conference today due to the national day of mourning for the Bondi terror attack victims. (Alex Ellinghausen)\n\nMaking matters worse for the now-extinct Coalition is the fact this asteroid was entirely self-inflicted.\n\nThe opposition insisted parliament be urgently recalled to pass legislation following the Bondi shooting, only to rupture over the lack of time they had to examine those laws.\n\n\"The Coalition demanded parliament comes back – parliament comes back,\" Croucher said\n\n\"The Coalition demands that parliament splits the bill – the government splits the bill.\n\n\"And still, they've split Coalition on this…",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/piper-james-found-dead-and-mauled-by-dingoes-kgari-queensland-father-pays-tribute/e3a973d0-5479-4554-a266-9a5a800b90f0",
    "title": "Piper found dead on beach where she'd always call mum",
    "publish_date": "Wed, 21 Jan 2026 08:48:01 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "The mother of a backpacker found dead and mauled by dingoes on the Queensland island of K'gari wants her daughter to be remembered as a free-spirited girl who spent two summers fighting bushfires in her native Canada.\n\nPiper James, 19, had gone for an early-morning swim before her body was found surrounded by a pack of about 10 dingoes on a beach on the tourist island on Monday. ﻿\n\nSpeaking to 9News from their family home on Vancouver Island, Piper's mum Angela James said her daughter was \"having the time of her life\" in Australia.\n\nPiper spent two summers fighting bushfires in British Columbia before travelling to Australia. (Nine)\n\n\"She loved it there. She just loved it. She thought it was beautiful,\" Angela said.\n\nPiper would often phone her parents early in the morning from the beach on K'gari.﻿\n\n﻿\"She quite often would set her alarm to get up, catch the sunrise, which is what she did that day,\" Angela said.\n\n\"I think that's what she probably got up to do. But she never got the opportunity to.\"\n\nPiper James' parents have paid tribute to their teenage daughter after her shock death. (Nine)\n\nAngela wants her daughter to be remembered as the girl who rode dirt bikes and spent two summers fighting wildfires in British Columbia to save money to see the world.\n\n\"They had done an adventure tour in K'gari and just thought it was just amazing, and fell in love with the people there that worked there, and they just clicked. And they offered the girls a job,\" Angela said.\n\nPiper had spent the last six weeks working as a housekeeper at a backpacker campsite with her hometown friend Taylor Stricker.﻿\n\nThe campsite was merely a few hundred metres from the beach where her body was found.﻿\n\n\"It's just a tragic accident, it's tragic. I don't know, maybe something needs to be done to keep people a little safer, that's all,\" Angela said.\n\nPiper's body was found surrounded by dingoes on a K'gari beach. (Nine)\n\nPiper travelled to K'gari with her best friend Taylor Stricker. (Nine)\n\n﻿Piper's father, Todd James, said the family was shattered and in pain over her death.\n\n\"We will always remember her infectious laugh and her kind spirit,\" he wrote in a post on social media this morning.\n\n\"So many are going to miss you, my precious little baby girl.\n\n\"May be gone, but how can we ever forget you?\"﻿\n\nJames added that he had supported her to travel to Australia and loved hearing about the bonds and friendships she was developing.\n\n\"I admired her strength and determination to go after her dreams,\" he said.\n\n\"She was glad I was on board for her trip to Australia. Lol, she said, 'Because I'm 18, and you can't stop me!'﻿\n\n\"Piper would work hard so she could play hard.\"﻿﻿\n\nPiper James and her dad Todd James. (Facebook)\n\nPiper James had been working on K'gari for the past six weeks. (Facebook)\n\nHer body, found covered in bites and scratches, was due to undergo an autopsy on mainland Queensland today.\n\n\"There's going to be an autopsy, and it's important that that be made public, and there's a considered response to that,\" Premier David Crisafulli said.\n\nThe examination is hoped to provide answers as to whether she died from drowning or being mauled by dingoes.\n\nThe potential that dingoes could be responsible has stunned locals and tourists alike.\n\nThe last fatal dingo attack on K'gari was ﻿25 years ago, when a nine-year-old boy was killed in 2001.\n\nSince then, Indigenous elders claim they've repeatedly warned the state government that dingoes, known as \"wongaris\" to the Aboriginal community, are growing more dangerous as tourism takes over.\n\n\"We asked them to close camping grounds down, they don't do anything. So yes I do believe we could've made a difference,\" Butchulla Aboriginal Corporation's Christine Royan said.\n\nK'gari has a permanent population of about 150 people, and about 400,000 tourists visit every year.\n\nButchulla Aboriginal Corporation's Christine Royan said more could have been done to prevent the tragedy. (Nine)\n\nEach car needs a paid permit and there is limited accommodation in towns and camping zones, but there is no official cap on visitor numbers.\n\n\"We're going to fight anybody that wants to actually remove the wongaris from K'gari. What we need to do is look at better management of K'gari,\" Royan said.\n\n\"The premier, I don't even think you've had a visit on K'gari. About time you come over and listen to the real issues.\"\n\nCrisafulli said he had been to K'gari \"many times\", but has not visited since he became premier.﻿\n\nPolice said the incident has been traumatising to Piper's friend, the two men who found her, officers and the wider community.\n\nPeople have been warned to stay away from dingoes.\n\n\"Dingoes are wild animals, and whilst they are very culturally, and significant to the local First Nations people and to the people that live on the island, they are still wild animals and need to be treated as such,\" Wide Bay District Inspector Paul Algie said on Monday. ﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/application-to-change-qvb-coloured-glass-windows-withdrawn/106256546",
    "title": "Push to change QVB coloured windows withdrawn after public backlash",
    "publish_date": "Thu, 22 Jan 2026 01:52:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "The owners of Sydney's Queen Victoria Building (QVB) have withdrawn a proposal to change coloured windows on its shopfronts into clear glass after community backlash.\n\nVicinity Centres lodged a development application with the City of Sydney, arguing some of the colourful windows were not \"fit for purpose\" and ultra-clear glass would make the stores more \"visually attractive and effective spaces for prospective tenancies\".\n\nMembers of the public wrote to council to reject the proposal, with some calling it \"short-sighted\" and \"disloyal to the heritage of the building\".\n\nIn a statement, a spokesperson for Vicinity said they had listened to the community's concerns about the potential impacts to the building's heritage.\n\nVicinity Centres said they had listened to community concern about the building's heritage. (ABC News: Abubakr Sajid)\n\n\"We have listened carefully to community sentiment and recognise the strong connection many people have to this treasured icon and the importance placed on its historic character,\" the spokesperson said.\n\n\"As responsible custodians, we take that feedback seriously and remain committed to preserving the QVB’s heritage.\n\n\"We have withdrawn the application to ensure the QVB continues to be celebrated, protected and enjoyed for generations to come.\"\n\nCity of Sydney Lord Mayor Clover Moore welcomed the withdrawal, saying the QVB was one of the city's most important \"treasured heritage buildings\".\n\n\"I'm glad its operators have listened to the community and will maintain and honour this important aspect of the original vision for the building and its superb craftwork,\" Cr Moore wrote in a social media post.\n\n\"It remains a bold and significant piece of public infrastructure and an important layer of both our architectural history and cultural fabric.\"\n\nWithdrawn application focused on economic impact\n\nThe coloured panels of glass were reconstructed in the 1980s, with glazing based on the original stained-glass windows in the 128-year-old QVB.\n\nConsultants cited in the application said the corner stores were victim to \"poor visualisation on retail performance\".\n\nBefore: A mock-up of visibility looking into a store with coloured glass. . . After: Versus the proposed clear glass. (Cracknell and Lonergan Architects via City of Sydney) . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE A mock-up of visibility looking into a store with coloured glass. / Versus the proposed clear glass. (Cracknell and Lonergan Architects via City of Sydney)\n\n\"QVB's corner tenancy is increasingly viewed as not being fit for purpose in the eyes of global retail brands seeking a flagship tenancy outside of Pitt Street Malls.\"\n\nThey pointed to a global flagship lifestyle brand that ended talks to set up shop after being denied permission to change the glass, leading to more than $1 million in lost rent.\n\nThe application would have required approval under special legislation as a state-listed heritage building.",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/somerville-house-principal-resigns/106256792",
    "title": "Brisbane girls' school principal resigns following leaking scandal",
    "publish_date": "Thu, 22 Jan 2026 01:48:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "A prestigious Brisbane girls' school principal will resign, following a scandal where teachers uploaded personal comments about students to an unsecured internet server.\n\nOn Thursday Somerville House sent letters to parents informing them that Dr Sandra Hastie would be stepping down in April due to \"family reasons\".\n\nThe letter, sent by chief executive officer Alan Swanson, did not explain what those \"reasons\" were.\n\nSandra Hastie's last day at the school will be on August 3. (Supplied: LinkedIn)\n\n\"After much consideration, Dr Hastie has made the decision to step down from her role at the end of Term 1, 2026,\" the letter said.\n\n\"The Somerville House staff, School Advisory Council and all of us at the Presbyterian and Methodist Schools Association respect and support her decision.\"\n\nSomerville House teachers wrote notes about incoming year 7 students in 2021. (Supplied: Somerville House)\n\nThe letter told parents Dr Hastie was moving to New Zealand to become the executive principal for the Diocesan School for Girls in Auckland.\n\nThe letter said the school would start recruiting for a new principal, and an interim principal would be appointed in the meantime.\n\nThe announcement comes after students discovered a \"dirt file\" document that teachers had uploaded to a publicly accessible Microsoft Teams server.\n\nThe document contained comments from teachers, judging the physical appearance and personalities of students and parents.\n\n612 ABC Radio Brisbane reached out to the school to ask the reason for the resignation, and whether it was related to the leaks.",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/verify-neo-nazi-group-linked-to-political-party/106254196",
    "title": "March for Australia admins encouraged people to join White Australia Party",
    "publish_date": "Thu, 22 Jan 2026 01:00:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "An ABC NEWS Verify investigation has revealed that some of those involved behind the scenes of the March for Australia (MFA) anti-immigration protests previously tried to recruit people to the now disbanded Neo-Nazi White Australia Party.\n\nMarch for Australia is planning a fresh round of mass demonstrations across the country on January 26.\n\nWhite Australia had been the political arm of the Neo-Nazi group National Socialist Network (NSN) but shut down earlier this week due to the federal government's new hate speech laws.\n\nJordan McSwiney, who researches the far-right at the University of Canberra's Centre for Deliberative Democracy, told ABC NEWS Verify that less overt activism would likely become more commonplace among NSN white supremacists following the public disbandment of the group.\n\n\"They'll go back to wearing the swastika on their heart rather than on their sleeve,\" he said.\n\nRecruiting for the NSN\n\nPerth MFA event organiser Baylie Bergroth, who ABC NEWS Verify unmasked in August last year after he shared pro-Hitler and antisemitic posts on social media, has since publicly encouraged people to join White Australia.\n\n\"If you are committed to preserving the Australia we know, Then you need to register your political support for White Australia,\" he posted on X on November 13.\n\nThat day, MFA national organiser Bec Walker — also known online as Bec Freedom — posted on X that Mr Bergroth's post was not an official statement from the MFA.\n\n\"We've always stated in official statements from the MFA page that organisers [sic] personal beliefs do not reflect MFA as a whole,\" she said.\n\n\"[Baylie] is an individual person who has his own beliefs outside of MFA.\"\n\nMr Bergroth has denied links to the NSN in the past.\n\nAn administrator for the official March for Australia Facebook group, who goes by the name Dylan D'Villain, posted a link to the now-defunct White Australia website to the group on December 15 in response to the Bondi attack.\n\n\"There is only one organisation that directly tackles this issue head-on, with the only sane and workable solution there is,\" he said.\n\n\"Deportations. Remigration. White Australia policy.\n\n\"Stand up White man. Your time is now!\" the account posted above the URL.\n\nThe \"Dylan D'Villain\" account posted photos of a White Australia event in Queensland, and encouraged MFA group members to sign up for the next event. (Supplied)\n\nABC NEWS Verify has not been able to confirm the identity of the individual behind the Dylan D'Villain account, but the account is listed as the first in the list of Facebook administrators on the page, which has more than 21,000 members.\n\nThe next day the \"Dylan D'Villain\" account posted photos of a White Australia event in Queensland, which it claimed was \"deftly run by a security team and a phenomenal amount of catering making sure 100 people were well fed and taken care of\" and encouraged MFA group members to \"Sign up for the next supporter event and find out the truth for yourself.\"\n\nIn one of the photos, a group of people with faces blurred stood around a banner which reads \"Hail Matthew Gruter\", in reference to a South African man who was deported from Australia after attending an NSN rally.\n\nThe group held the banner following an NSN event. (Supplied)\n\nA spokesperson for March for Australia said the person behind the \"Dylan D'Villain\" account did not want to speak to the media but that \"he is not part of the organisation team at MFA\".\n\n\"He is just someone who supports what we are doing and offered to help moderate the group as we needed help [22k members].\"\n\nThe spokesperson said MFA \"had an ongoing policy of not being involved in recruiting efforts for any group or political party\", and the Facebook group administrators and monitors had now been directed not to do so.\n\nNational organiser shares Neo-Nazi defence\n\nAfter the NSN announced it would disband, MFA's national organiser Bec Walker reposted a video of convicted racist Blair Cottrell on X.\n\nIn the video, Mr Cottrell, who has regularly been photographed and filmed with Neo-Nazis, accused the government of \"moving the goalposts\" when the NSN was \"about to win\".\n\nIn her caption of the repost, Ms Walker called it an \"interesting analogy\", and criticised the federal government's hate speech laws.\n\nDo you know more? Email Michael Workman at workman00 @protonmail.com or Matt Martino at mattmartino@protonmail.com\n\nat or at If you require more secure communication, please choose an option on the confidential tips page\n\nHer post was later deleted from X, but a version with a shorter caption is still live in the MFA Telegram account, where Ms Walker forwarded it from Mr Cottrell.\n\nABC NEWS Verify asked Ms Walker whether she supported Mr Cottrell or the NSN, and why she deleted her post.\n\nShe denied sharing content supporting Neo-Nazis, and said she simply advocated for freedom of political expression.\n\nAttending NSN events\n\nABC NEWS Verify has uncovered that Matt Trihey, who organised MFA's October 19 event in Melbourne last year, attended and gave a speech at the NSN's national conference in August last year.\n\nAgainst the backdrop of an Australian flag, Mr Trihey railed against the presence in Australia of immigrants from a raft of regions in Asia, Africa and the Middle East.\n\n\"We are being dishonoured. We are being humiliated. And it's being tolerated,\" he said.\n\nExcerpts of his speech were posted to the Facebook account of the National Workers Alliance, an ethno-nationalist organisation that Mr Trihey leads.\n\nThe social media posts do not say where he was speaking.\n\nNeo-Nazis Thomas Sewell and Joel Davis made speeches from the same location — matched by the flag backdrop.\n\nBefore: Thomas Sewell at the NSN national conference. . . After: Matt Trihey at the same event. . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE Thomas Sewell at the NSN national conference. / Matt Trihey at the same event.\n\nThough the podium is cropped out of Mr Trihey's video, the wrinkles in the flag behind him and the Neo-Nazis line up perfectly, and the same microphone is used.\n\nMr Trihey was also pictured in the audience during a speech made by NSW Neo-Nazi Jack Eltis at the same location.\n\nMr Trihey told ABC NEWS Verify he had never been a member of the NSN or any other Neo-Nazi group.\n\n\"I was asked to give a speech at an event organised by the White Australia group as they prepared for the launch of their political party,\" he said.\n\nWhite Australia is the name of the political party the NSN was in the process of establishing.\n\nNational MFA organiser Bec Walker previously vouched for Mr Trihey.\n\nMarshals unmasked\n\nABC NEWS Verify can reveal another marshal at a previous MFA event took part in a Neo-Nazi protest outside NSW parliament in November.\n\nZachery Hook was a marshal at the MFA Canberra event on August 31.\n\nAlongside Oscar Tuckfield, he is the second marshal to be positively identified in photographs taken from the NSW parliament protest.\n\nMarch for Australia organiser appears to confer with Neo-Nazi A previously unreported video has emerged appearing to show a key March for Australia organiser coordinating with a Neo-Nazi at the first rally in Sydney in August, ABC NEWS Verify has found.\n\nMr Hook was recently charged with six offences in the ACT, including making an offensive gesture in the Nazi salute, damaging the Islamic Studies Centre at the Australian National University (ANU), and repeatedly placing stickers with Nazi symbols in public spaces, including shopping centres.\n\nMr Hook confirmed to ABC NEWS Verify that he attended the NSW parliament NSN rally, that he had been a member of the organisation for two years and that he attended the march wearing a marshal's vest.\n\nHe has also spread white supremacist messaging extensively online.\n\nMr Hook said he was behind an Instagram account that amassed close to 20,000 followers with posts attacking non-Europeans and promoting the NSN.\n\nOne of his videos, which recorded 2.6 million views, showed AI-generated CCTV footage of a \"Muslim teaching British children how to pray in Islam\".\n\nThe account was removed after ABC NEWS Verify made enquiries to Meta about whether it breached its policies.\n\nIn the weeks before MFA's first rallies in August, organisers sought to distance themselves from allegations that the NSN was involved.\n\n\"We wish to make it clear: the organisers are not members of, nor acting on behalf of, any other group,\" a Facebook post read.\n\n\"In particular, recent claims by [the NSN] are not reflective of the organisers nor the politics of March for Australia.\"\n\nIn October, ABC NEWS Verify also revealed footage that appeared to show the rally's national organiser, Bec Walker, coordinating with the NSN over who should hold the Sydney event's main banner.\n\nA spokesperson for MFA told ABC NEWS Verify that organisers had no prior knowledge of Zachery Hook and Oscar Tuckfield's associations with NSN, but praised them as \"fine young men in service of their broader community\".\n\nDr McSwiney said that some members of the NSN had a more covert presence at the first marches in August, alongside its members marching in uniform and giving speeches.\n\n\"Many of them attended in plain clothes … the idea was to sort of blend in and connect with people,\" he said.\n\n\" That was really important for them to make new connections, to try and bring new people into their movement and radicalise them to Neo-Nazism. \"\n\nDr McSwiney said that while the NSN was gone, we had not seen the back of its leaders or its members.\n\n\"There's still plenty of spaces for these people to involve themselves in organised racist activism outside of their own formal organisation. So their attendance at past and future March for Australia rallies would be one of those,\" he said.\n\n\"I'm sure at some point in the future they will launch a new organisation, and they'll tone down the national socialism of it and focus on something that is perhaps more palatable or certainly less likely to fall foul of various hate legislation.\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/new-zealand-landslide-search-for-missing-people/106256570",
    "title": "Live: Several people missing after landslide hits New Zealand campsite",
    "publish_date": "Thu, 22 Jan 2026 00:55:31 +0000",
    "category": "sports",
    "authors": [
      "Elissa Steedman",
      "Rudi Maxwell",
      "Emily Clark"
    ],
    "text": "We have some more details from Sonny Worrall, an Australian who was holidaying at the park ahead of the landslide.\n\nHe described wanting to go for a morning swim in the hot pools at the facility and the moment he saw the landslide approaching.\n\n\"People were in the pools, they were jumping out, running, they were screaming. It was insane, I couldn't believe it,\" he said. \"It all happened in a flash, I was definitely fearing for my life.\"\n\nHe described the few seconds a caravan was being pushed towards him.\n\n\"I was the one closest to the landslide as it happened, it was right behind me as I was diving, it was like a movie,\" he said. \"There was a tree coming down and a caravan smashing towards me.\"\n\nHe described the scene in the moments before the slip and the damage to the pools on site.\n\n\"There was a middle pool, a front pool and I was at the back of the middle pool and there was a kids pool at the very back next to the wall, where it's all covered up by dirt now,\" he said. \"I didn't see anyone in the back pools luckily because it was only in the morning, it wasn't very busy.\n\n\"I just wanted to go for a swim in the morning, I was the only one in my family that wanted to go for a swim.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/abs-jobs-unemployment-december-2025-figures/106256288",
    "title": "Rate hike expectations jump after jobs data comes in 'stronger' than expected",
    "publish_date": "Thu, 22 Jan 2026 00:42:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's unemployment rate fell from 4.3 to 4.1 per cent in December, according to seasonally adjusted figures from the Australian Bureau of Statistics (ABS).\n\nThe figure comes less than two weeks before the Reserve Bank of Australia's next interest rates meeting, where the board will factor in economic indicators, including the jobs market.\n\nMost economists have been predicting no increase to interest rates, but some inflation hawks say the bank should jack up rates because the economy is running at or near its capacity — an argument bolstered by the stronger-than-expected jobs data.\n\nThe chief economist at KPMG, Brendan Rynne, said the figures were \"quite significantly stronger\" than expected.\n\n\"[This latest jobs data] does show a much stronger labour market than any of us had anticipated,\" Dr Rynne said.\n\nEmployed people were up 65,000 in December, with both full-time (55,000 people) and part-time (10,000 people) employment contributing to this rise.\n\nThe participation rate, which measures the share of people either working or actively looking for work, rose to 66.7 per cent.\n\nYounger workers moving into the workforce helped push down Australia's unemployment rate to 4.1 per cent annually in December. (AAP: Bianca De Marchi)\n\nThe ABS's head of labour statistics, Sean Crick, said the unemployment rate was pushed down in part by a rise in younger people entering the workforce.\n\n\"This month we saw more 15 to 24-year-olds moving into employment, contributing to the rise in overall employment and the fall in the unemployment rate,\" he said.\n\nThe growth in employment was driven by male employment, which rose by 49,000 people, while female employment recorded a smaller increase of 17,000 people, he added.\n\n'Jobs market digging in its heels'\n\nOxford Economics Australia's head of economic research, Harry Murphy Cruise, said he had expected unemployment to rise, but \"the jobs market is digging in its heels\".\n\n\"Absent our forecast rise in unemployment, an interest rate hike may be needed to tame the resurgence of inflation,\" he said.\n\n\" We won't jump on one data point, but the odds of a rate hike are rising. Next week's inflation data will be the deciding factor. \"\n\nBloomberg data shows that before the jobs data was released, most economists forecast no change to interest rates when the Reserve Bank monetary policy board meets on February 3, with futures markets putting the chance of a hike to 3.85 per cent at just a 25 per cent chance.\n\nHowever, some economists — and the market — expect rates to rise later in the year, with the futures market pricing in an increase to 4 per cent by November.\n\nThe chance of a hike at the next meeting jumped to 53.8 per cent after the jobs figures were released, Reuters data shows.\n\nThe RBA's next rates call is on February 3. (AAP: James Ross and Joel Carrett)\n\nOnly a handful of economists expect rates to be cut.\n\nIn a report released on Thursday morning before the jobs result, Deloitte Access Economics partner Stephen Smith said the economy was too weak to handle a rate increase and predicted the next move in rates would be downward.\n\nHowever, he said it would be a \"line ball\" decision for the RBA in February, with the monetary policy board on high alert after declines in inflation reversed in figures released in September and October.\n\n\"In Deloitte Access Economics' view, an increase in the cash rate in February would be premature for several reasons,\" he said.\n\nHe said it was not possible to be confident that the Australian economy was growing as fast as it could, which was \"the current fashion among some forecasters to justify a rate hike\".\n\n\"Add in recent changes to the way trimmed mean inflation is calculated, the complex effect of electricity rebates, and the messiness of the post-pandemic economic recovery, and the causes of the recent lift in inflation become even less clear,\" he said.\n\n\"Deloitte Access Economics remains of the view that a dispassionate and considered RBA will stay on hold in February, though the December inflation data — which will be released after this document goes to press — will be an important piece of the puzzle.\"\n\nJob ads down\n\nJob ad data released by Seek also pointed towards economic weakness, with positions on offer falling 3.5 per cent over 2025.\n\nNational job ads fell 1.2 per cent in December, which Seek's senior economist, Blair Chapman, said was slightly steeper than the usual seasonal drop before the Christmas and New Year break.\n\n\"January traditionally brings renewed momentum into the employment market, as businesses re-emerge from holiday mode,\" Dr Chapman said.\n\n\"Whether the rebound in January is enough to see job ads trending up again will soon be seen.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/australian-open-alex-de-minaur-frances-tiafoe-third-round/106256130",
    "title": "De Minaur's next opponent psyched up for battle of the 'older guys'",
    "publish_date": "Thu, 22 Jan 2026 00:14:01 +0000",
    "category": "sports",
    "authors": [],
    "text": "It says a lot about the presence of youth in professional tennis that two players in their mid to late-20s can already be considered veterans on the tour.\n\nBut that is how Alex de Minaur and Frances Tiafoe described each other ahead of Friday's enticing third-round clash at the Australian Open.\n\nAustralian Open: day five blog The second round of the Australian Open singles continues with Novak Djokovic hunting his 101st win at Melbourne Park.\n\nDe Minaur, the world number six, overcame a shaky start and rain delay on Rod Laver Arena to defeat Serbian Hamad Medjedovic 6-7, (5-7), 6-2, 6-2, 6-1 on Wednesday evening.\n\nWhile de Minaur was wrapping up victory, 29th seed Tiafoe was putting the finishing touches to his 6-4, 6-3, 4-6, 6-2 defeat of Argentina's Francisco Comesaña on Margaret Court Arena.\n\nDe Minaur, who at 26 is one year younger than Tiafoe, holds a 3-1 advantage over the American in their career head-to-head meetings.\n\nThe last time they faced each other, the Australian enjoyed a three-set victory in a round-of-16 match at the Toronto Masters 1000 event in August.\n\nFrances Tiafoe (left) lost to Alex de Minaur in Toronto last year. (Getty Images: Matthew Stockman)\n\nTiafoe, who reached a career-high ranking of 10 in 2023, has enormous respect for de Minaur, noting they are both among the most experienced players in the men's draw at Melbourne Park.\n\n\"I've known him [de Minaur] for a while, known him for a long time,\" Tiafoe told reporters.\n\n\"Him and me, we've played since we came on the scene. Got in the top 100, kind of around the same time.\n\n\"I've seen him around for years, and now we're the older guys on the tour, and now we're playing big matches against each other.\"\n\nAlex de Minaur needed four sets to get past Hamad Medjedovic. (Getty Images: Cameron Spencer)\n\nSpeaking just prior to Tiafoe clinching his win over Comesaña, de Minaur was full of praise for the world number 34.\n\n\"Frances, he's super dangerous. He's playing well, got a lot of firepower,\" de Minaur said.\n\n\"He's a veteran. We've had some battles in the past. I wouldn't expect anything other than an absolute battle against him.\n\n\"He seems to be locked in.\"\n\n'I'm going to come for him'\n\nTiafoe will be a tricky opponent for de Minaur, who made the quarterfinals at Melbourne Park last year.\n\nNicknamed \"Big Foe\", the US Davis Cup player has appeared in the second week of a major on several occasions, so he is accustomed to playing on the big stage.\n\nFrances Tiafoe has previously reached the quarterfinals in Melbourne. (Getty Images: Darrian Traynor)\n\nTiafoe reached the quarterfinals at the Australian and French Opens — in 2019 and 2025 respectively — while he has twice got as far as the semis (2022 and 2024) at his home major.\n\n\"It's earlier for both of us than we would like, but I'm happy to play against him,\" Tiafoe said.\n\n\"It's going to be fun, against all these fans. I love playing on the big courts, and now is where the event really gets going.\"\n\nTiafoe appears quietly confident of his chances on Friday, with the match expected to be scheduled for the blockbuster evening session on Rod Laver Arena.\n\nAnd while Tiafoe stopped short of making a prediction about the result, he was sure it would be a must-watch encounter.\n\n\"He's going to come for me, I'm going to come for him,\" Tiafoe said.\n\n\"Tennis fans are going to get their money's worth.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/australian-open-2026-live-novak-djokovic-kyrgios-kokkinakis/106256036",
    "title": "Live: Novak Djokovic trying to teach Australian Open 101 on day five",
    "publish_date": "Wed, 21 Jan 2026 23:30:27 +0000",
    "category": "finance",
    "authors": [
      "Jon Healy",
      "Luke Pentony"
    ],
    "text": "(Getty)\n\nAs we all know, Melbourne folks are very proud of their coffee culture, and so too is Madison Keys.\n\nYou know someone's serious about coffee when they not only have a pricey espresso machine, but a white one, which requires constant cleaning to avoid looking like a disaster zone.\n\nLoading Instagram content\n\nShe's been asked about it on court after beating Ashlyn Krueger and says she doesn't need any tips, tricks or extra bits.\n\n\"(Husband/coach) Bjorn and I are pretty good with our coffee game. We actually roast our own coffee beans at this point, so we're like elite snobs,\" she says.\n\n\"We're always open to some tips but we kind of have every single piece of equipment in our house so I don't think I want any more things in our house, I think we've officially reached capacity.\n\n\"But it is amazing [that] every single time you turn a corner there's a coffee shop and you always know you're gonna get a good cup of coffee, which doesn't happen very often in the world. So very happy to be here and very happy to always have a good cup of coffee.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/aj-ogilvy-former-nbl-comes-out-gay-pride-round/106255856",
    "title": "Former NBL player AJ Ogilvy comes out as gay ahead of league's Pride Round",
    "publish_date": "Wed, 21 Jan 2026 22:39:39 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former NBL player AJ Ogilvy has publicly revealed he is gay in a one-on-one conversation with fellow basketball trailblazer Isaac Humphries.\n\nOgilvy, who played for the Sydney Kings and Illawarra Hawks in a 218-game NBL career, said he felt like he had to keep parts of himself hidden to maintain a life in professional basketball.\n\nLoading YouTube content\n\n\"I've been married for nearly 18 months now. I met my husband when I was playing in Sydney, so I was with him for all my time in Wollongong and part of the time in Sydney,\" Ogilvy said.\n\n\"While I was in Sydney, I kept [my two lives] pretty separate, but I also wasn't super discreet about it.\n\n\"Some of the guys probably knew, but nothing was ever explicitly said.\n\n\"I was very lucky with my career, I got to travel the world and get paid to play basketball, which is such a privilege.\n\nLGBTQI+ community support services ABCQueer has compiled this list of national and state-based support services relevant to LGBTQI+ people, their families and friends.\n\n\"But I probably didn't live my life as authentically as I probably could have during my time, especially in the NBL.\"\n\nOgilvy said he has used two separate social media accounts to reflect different parts of his life.\n\n\"For a long time, I believed that to be a basketballer, I had to present as straight and not show this side of my personality,\" he said.\n\n“So I had two social media accounts, one I'd use for my basketball stuff and one I just had tight friends on, where I would be more open.\n\n“Growing up, there weren't positive portrayals of gay relationships in basketball or media as a whole. It was more that it was going to be a sad, lonely life.\n\n\"That definitely weighed on me pretty heavily.\"\n\nHumphries, who plays for the Adelaide 36ers and came out in 2022, said Ogilvy's decision was another big step forward for the LGBTQA+ community in Australian sport.\n\nIsaac Humphries of the Adelaide 36ers came out in 2022. (Supplied: Adelaide 36ers/Cameron Suridge)\n\n\"We've got a player who plays every weekend, who is openly gay and an ex-player now, who's openly gay and married, who's prepared to talk about this life and these situations.\n\n\"That visibility and acceptance are really important, and it continues to move our great league forward.\"\n\nThe NBL is preparing to celebrate Pride Round this weekend, something which Ogilvy and Humphries agree has helped them become more comfortable with their identities within the sphere of professional sport.\n\n\"There's now a place for us to have this conversation, for us to be able to talk as openly as this,\" Ogilvy said.\n\n\"If people want to talk to someone, people want to be able to ask opinions, ask questions, it gives them someone else to reach.\n\n\"Pride Round is for everyone. There's people in the stands, people at home watching. It's about making sure everyone feels included.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/tahmoor-coal-sale-gupta-administrators/106254968",
    "title": "Buyers sought for controversial billionaire's mothballed coal mine",
    "publish_date": "Wed, 21 Jan 2026 22:31:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Administrators are seeking buyers for Tahmoor Coal as Sanjeev Gupta's GFG Alliance grapples with financial turmoil, with the hope of restarting the mine and maximising returns for creditors.\n\nThe Tahmoor coking coal mine, south-west of Sydney, has been non-operational since February last year after exhausting its cash reserves amid financial turmoil at Sanjeev Gupta's GFG Alliance.\n\nAround 500 workers, including contractors, were placed on minimum pay. By November, roughly half were informed they would no longer receive wages.\n\nIts holding company, Liberty Primary Metals Australia (LPMA), was placed in administration in November.\n\nThe administrator says selling Tahmoor is central to unlocking value for creditors.\n\n\"Now the DOCA [Deed of Company Agreement] has been approved, one of the main questions we have at the moment is realising assets within the group,\" joint administrator Michael Brereton of William Buck said.\n\n\"One of those is the holding company that owns 100 per cent of the shares in Tahmoor Coal.\"\n\nExpressions of interest are open as administrators seek a path to restart the Tahmoor Colliery. (ABC Illawarra: Tim Fernandez)\n\nMr Brereton said administrators had seen strong and sustained interest in the mine, even before the formal process began.\n\n\"Even at the point we were initially appointed, we were getting significant interest from parties in Tahmoor Coal itself,\" he said.\n\n\"We previously disclosed we received six expressions of interest before Christmas, and since then we've been approached by additional parties.\"\n\nThree-week process\n\nThe process for expressions of interest opened this week and runs until 11 February.\n\nMr Brereton said the aim was both to maximise value and to restart the mine as quickly as possible.\n\n\"The purpose of the expressions-of-interest process is to maximise value,\" he said.\n\n\"In addition to that, we are hopeful of seeing the mine restarted — that is in the interests of all parties.\"\n\nThe mine is understood to be valued in the hundreds of millions of dollars.\n\nThe process to attract investors for Tahmoor Coal is now officially underway. (Supplied: SIMEC)\n\nHe said interest was coming from established coal industry players with the financial capacity to take over and reopen the operation.\n\n\"From parties within the coal industry, they know the market, they know what they are doing,\" he said.\n\nAsked how offers from a local consortium would be weighed, Mr Brereton said all bids would be assessed carefully.\n\n\"We will consider all of the offers we get,\" he said.\n\nMany factors\n\n\"There are a number of factors: the value, the cost to get the mine started as soon as possible, and the financial capacity to take on the mine,\" Mr Brereton said.\n\nShort-listed bidders will enter a four-to-six-week due-diligence process, with administrators aiming to complete a transaction by March or early April.\n\n\"I certainly feel for the community,\" Mr Brereton said.\n\n\"We are doing everything we can to make sure the mine can be fully funded and restarted as soon as possible.\"\n\nIn a media statement, LPMA chief executive Theuns Victor said Tahmoor was an established underground longwall mine that \"benefits from substantial installed infrastructure and a skilled workforce\".\n\n\"We want Tahmoor Colliery to be restarted as soon as possible and we are open to all reasonable options, which includes a sale of the company.\n\n\"One option is a sale where the true value of Tahmoor Colliery can be realised. Other alternatives include joint venture structures or a standalone financing solution.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/ai-images-of-tasmania-on-tour-website/106253448",
    "title": "'Our AI has messed up': Tour operator offers non-existent destinations",
    "publish_date": "Wed, 21 Jan 2026 22:26:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "According to the Tasmania Tours website, Weldborough Hot Springs offers a \"peaceful escape\" and an \"authentic connection to nature\".\n\nThe \"secluded forest retreat\" even features in the \"7 Best Hot Springs Tasmania Experiences for 2026\".\n\nThe website says walkers are greeted by pools \"rich in therapeutic minerals\".\n\n\"This makes it a popular destination for those looking to immerse themselves in Tasmania's raw beauty,\" the site reads. \"Its reputation as a tranquil haven has made it a favourite among local hiking groups, wellness retreat organisers, and anyone wanting to experience one of the more untouched hot springs Tasmania has to offer.\"\n\nWhat visitors can actually expect if they drive out to Weldborough in north-east Tasmania: the local pub. (Facebook: Weldborough Hotel)\n\nAnd with the webpage lacking directions, excited travellers have descended on the area's other famous landmark — the Weldborough Hotel, about two hours' drive north-east of Launceston — to ask how they can find the idyllic pools.\n\nThe problem is, the hot springs, as depicted in the imagery, do not exist.\n\nA confused publican and confused guests\n\nIt is a problem that publican Kristy Probert encountered regularly.\n\n\"The Weld River, which runs through Weldborough, is freezing cold, it's definitely, definitely not a hot spring,\" she said.\n\n\" They're more likely to find a sapphire than … to find a hot spring, to be honest. \"\n\nMs Probert said she was getting daily phone calls and in-person visitors asking about the hot springs, some even wanting to book accommodation.\n\n\"I actually had a group of 24 drivers turn up there two days ago that were on a trip from the mainland, and they'd actually taken a detour to come to the hot springs,\" Ms Probert said.\n\n\" I said, 'If you find the hot springs, come back and let me know and I'll shout you beers all night' — they didn't come back. \"\n\nThe location is listed on the website alongside the very real Hastings Caves and Thermal Springs in southern Tasmania, along with some more questionable inclusions, such as freezing Liaweenee and remote Savage River.\n\nVisitors will not find a scene like this at Savage River. (Tasmania Tours)\n\nThe Tasmania Tours website had several articles and blog posts on must-see destinations on the Apple Isle, including \"12 unmissable things to do in Hobart for 2026\".\n\nAs with the hot springs article, many appear to be written by AI, and include generated pictures purporting to be Tasmanian locations.\n\nAn AI-generated image on the Tasmania Tours website purports to show Salamanca Market. (Tasmania Tours)\n\nCompany relies on AI to 'compete with the big boys'\n\nTasmania Tours is operated by Australian Tours and Cruises, a New South Wales business that runs several other websites for booking tours in other states.\n\nOwner Scott Hennessy said: \"Our AI has messed up completely.\"\n\nAn image purporting to be from Kunanyi/Mt Wellington overlooking Hobart looks more like a Brazilian landscape. (Tasmania Tours)\n\nHe said the company had outsourced marketing material to a third party, which used AI to create some of its content.\n\nMr Hennessy said that while all posts were normally reviewed before being posted, some had been made public by mistake while he was out of the country.\n\nThe hot springs article was posted in July 2025.\n\n\"We're trying to compete with the big boys, and part of that is you've got to keep your content refreshed and new all of the time,\" Mr Hennessy said.\n\nThe Museum of Old and New Art, also known as MONA, features a range of rock faces, but none like this. (Tasmania Tours)\n\n'Three-legged wombat, crocodile-looking things'\n\nMr Hennessy said the use of AI content was necessary in order to compete for prominence in online searches and win over customers.\n\n\"We don't have enough horsepower to write enough content on our own, and that's why we outsource part of this function,\" he said.\n\n\"Sometimes it's perfect and really good and does what you hope it would do, and sometimes it gets it completely wrong.\n\n\"I've seen it create animals I've never seen before — three-legged wombat, crocodile-looking things.\"\n\nThis image is clearly not Launceston, despite the city having multiple bridge crossings of the Tamar River. (Tasmania Tours)\n\nMr Hennessy said all the AI-generated blog posts had been taken down and were being checked thoroughly.\n\nHe assured anyone looking to book through Tasmania Tours that it was, in fact, a real website, selling real tours.\n\n\"We're not a scam, we're a married couple trying to do the right thing by people … we are legit, we are real people, we employ sales staff,\" Mr Hennessy said.\n\nAI resulting in traveller mistakes\n\nDestination Southern Tasmania's Anne Hardy said serious attention needed to be paid to \"AI hallucinations\", with use of the technology becoming more prevalent.\n\nLoading...\n\n\"What we know is that now about 90 per cent of itineraries that are generated by ChatGPT actually have at least one error in them, and we also know that 37 per cent of people rely on AI to generate their itineraries,\" Professor Hardy said.\n\nCommon mistakes can include opening times, inaccurate descriptions of what is offered at a location, how long a walk may be, or what equipment is needed.\n\nShe said the phony hot springs website was a \"very good lesson in terms of quality control\".\n\n\"That's the problem with the internet and selling online … now businesses need to always keep ahead of the curve and they need to be easily found when people put in searches and that type of thing,\" Professor Hardy said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/townsville-reef-hq-aquarium-great-barrier-reef-australia-rebuild/106233472",
    "title": "Inside the delayed rebuild of world's largest living coral reef aquarium",
    "publish_date": "Wed, 21 Jan 2026 22:16:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's mothballed Great Barrier Reef education centre is yet to be rebuilt five years after it closed to the public.\n\nWhat was once the world's largest living coral reef exhibit, adjacent to the world heritage-listed Great Barrier Reef, is now an empty aquarium in Townsville, north Queensland.\n\nVisitors and marine life will return to the site in 2029 — if a complex rebuild goes to plan.\n\nThe Reef HQ aquarium will be demolished before a new aquarium is built. (Supplied: Great Barrier Reef Marine Park Authority)\n\nSmaller refurbishments at the facility, due to be completed by 2023, were scrapped due to concrete corrosion and leaking acrylic at the site.\n\nThe federal government's Reef Authority, which owns Reef HQ, said it would have designs and seek government approval for the rebuild this year.\n\n\"We intend to have potential for demolition and construction by the end of 2026 or early 2027,\" project manager Fred Nucifora said.\n\n\"That gives us a two-year runway for the complete build.\n\nAn artist's impression of the Great Barrier Reef Aquarium, which is still in the preliminary design stage. (Supplied)\n\n\"What preliminary designs show is a footprint for the aquarium, which is similar to what we have there now, but with more space within that footprint for the visitor.\"\n\nIn preparation for demolition, coral collections and marine life have been rehomed to purpose-built facilities and aquariums throughout Queensland.\n\nDesign details\n\nReef HQ will be rebranded as the Great Barrier Reef Aquarium.\n\nIt is expected to feature bigger and better aquarium acrylic displays.\n\nThe Reef Authority said sourcing those materials required quick action.\n\n\"The big viewing windows had a centre bracing and that interrupted the view; [with] the new acrylic of today there is not a requirement for that additional bracing, and you can get larger spans of window,\" Mr Nucifora said.\n\n\"That acrylic isn't manufactured here in Australia, [it] can't come to us on an aircraft because [it is] too big, that has to be shipped to us from overseas.\n\n\"There is a 12-month lead time for some of those windows alone.\"\n\nThe Reef HQ facade has been demolished but the aquarium remains. (ABC News: Rosie King)\n\nThe authority confirmed it was committed to delivering the project in 2029 after delays disappointed the Townsville community, which had expected the re-scoped aquarium tank rebuild to be finished by 2026.\n\nMr Nucifora said the project was expected to be delivered on budget, after the Reef Authority successfully lobbied for a $100 million taxpayer-funded budget increase in 2024, bringing the total cost to $180 million.\n\n\"We are very confident that we will build a world-class reef education facility in the heart of Townsville with the money that we have,\" he said.\n\nReef HQ provided care for marine life, as well as education for students. (Supplied: Reef HQ)\n\nTourism timelines\n\nBeyond the education benefits of the Townsville aquarium, the facility was a tourism drawcard.\n\nBefore it closed to the public in 2021, Reef HQ welcomed tens of thousands of visitors each year.\n\nLobby group Townsville Enterprise (TEL) said the aquarium reopening was highly anticipated by tourists and was already being advertised to cruise lines planning to bring passengers to Townsville in 2029.\n\nTownsville's cruise market is booming after a major channel widening project at the port. (Supplied: The Port of Townsville)\n\n\"We are already the fastest-growing cruise market in the country, and the Great Barrier Reef Aquarium is the major drawcard long term for those cruise ships to come here,\" TEL chief executive Claudia Brumme said.\n\n\"It will mean we are going from 22 ships a year to 30 to 40 ships a year.\n\n\"It will be the world's largest living coral reef aquarium, and it gives us a competitive edge.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-22/keppel-data-centre-latrobe-valley/106123748",
    "title": "Victoria's coal country set to become home of $10 billion data centre",
    "publish_date": "Wed, 21 Jan 2026 21:45:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victoria's Gippsland region will soon be home to one of the largest pieces of artificial intelligence infrastructure in Australia.\n\nSingaporean asset manager and operator Keppel Ltd plans to build a 720-megawatt data centre worth $10 billion at a 123-hectare site near Morwell.\n\nSituated in the heart of coal country, the site at Hazelwood has unique appeal for the data centre industry given its proximity to one of the state's largest electricity nodes.\n\nLocated within the proposed Gippsland Renewable Energy Zone, the company said it would have the required resources, in terms of transmission and water, to run the centre.\n\n\"We are in active discussions with hyperscalers and neoclouds regarding the future capacity provided by the site, many of whom have expressed keen interest in Melbourne — one of Australia's fastest growing data centre markets,\" said Keppel CEO of connectivity, Manjot Singh Mann.\n\n\"The site near Morwell offers significant scalability with clear pathways to securing competitively priced green power, non-potable water for cooling, and low-latency fibre connectivity, making it a compelling location to site next-generation AI campuses.\"\n\nThe Yallourn Power Station is set to be turned into a renewable energy hub. (ABC TV)\n\nThe deal comes after EnergyAustralia announced its proposal in November to convert the Yallourn coal power site into a $5 billion low-carbon emissions hub to support similar data centres.\n\nA booming industry\n\nData centre demand is booming.\n\nAn estimated 4,000 data centres are currently in operation around the globe, with Australia ranking in the top-five locations.\n\nSimon Wilson says the the race is on to get data centres built. (Supplied: Simon Wilson)\n\nAccording to Fortune Business Insights, the global data centre market is projected to grow from $US269 billion ($398.7 billion) in 2025 to $US584 billion by 2032.\n\nGippsland-based AI consultant Simon Wilson said data centres were critical to the operation of Australia's technology infrastructure.\n\n\"When we do a query into Googles, or chat with AI … it is done by a data centre,\" he said.\n\n\" So it's really just a massive factory full of computers that are doing the work that your local computers can't do. \"\n\nAustralia is considered a key regional hub for data centres. (Supplied: Google)\n\nMr Wilson said the site at Morwell was uniquely placed to attract the data centre industry.\n\n\"Providers are really looking for locations with power, which is the primary one for Gippsland,\" he said.\n\n\"We've got the most available transmission power in the grid in the country … so a lot of the big tech providers are eager to take advantage of that and plug their data centres in here.\"\n\nThe growing use of internet-connected devices, along with AI services, is putting an increased demand on data centre capacity in Australia and around the world.\n\nAccording to a 2024 report compiled by Mandala Partners, additional investment in Australia's data centre capacity is forecast to top $26 billion by 2030 to meet the demand.\n\nA 'catalyst' for change\n\nIf realised, the centre would mark a turning point for the Latrobe Valley, which has struggled with high unemployment since the old Hazelwood mine's closure and the transition away from coal-fired power stations.\n\nSharon Gibson says data centres could bring a new industry to the Latrobe Valley. (Supplied: Latrobe City)\n\nLatrobe City Council Mayor Sharon Gibson said the council welcomed the opportunity for new investment.\n\n\"We've been doing a lot of work to try and transform our economy … with the situation with the power stations, we have to look at, 'How are we going to have employment down here?'\" she said.\n\n\" So we see this as the catalyst for transforming our economy. \"\n\nCr Gibson said the local government would work through the planning approval process with Keppel.\n\nEnvironmental groups have raised concerns about the impact data centres would have on the region's water supplies, should they go ahead.\n\nTracey Anton says the community needs more detail. (ABC News: Jarrod Whittaker)\n\nFriends of Latrobe Valley Water organiser Tracey Anton said while the group was not opposed to data centres, more detail was needed about how the project would source its water and manage that with other competing interests, including planned mine rehabilitation.\n\n\"Everyone's wondering, where's this water coming from? What are they going to do? How does this intersect with the mine rehabilitation?\" she said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/australian-open-2026-live-updates-duckworth-faces-champ-sinner-djokovic-osaka-in-title-chase-special-ks-in-all-aussie-showdown-20260121-p5nvto.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open 2026 LIVE updates: Keys chases second title; Duckworth faces champ Sinner; Special Ks in all-Aussie showdown; Djokovic, Osaka in action",
    "publish_date": "Thu, 22 Jan 2026 13:25:22 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell",
      "Roy Ward"
    ],
    "text": "The David v Goliath battle of day five is about to unfold on John Cain Arena.\n\nAussie battler Dane Sweeny is preparing to tackle American Ben Shelton in their second-round clash, and on paper, it looks a mismatch.\n\nDane Sweeny steps out on court. Credit: Getty Images\n\nSweeny squeezed his way into the main draw via qualifying, while Shelton is the No.8 seed.\n\nSweeny, 25 next month, stands 170 centimetres tall, is the world No.182 and is playing his first grand slam event.\n\nShelton towers over his opponent at 193 centimetres and boasts a semi-final appearance at last year’s Australian Open.\n\nThere is no doubt Sweeny, who defeated tennis legend Gael Monfils two days ago, has a battle ahead of him.\n\nShelton gets ready for the match. Credit: Getty Images\n\nThe 23-year-old big-hitting American belts down serves around the 210km/h mark, but has recorded serves up to 241 km/h ... yikes.\n\nIn the fair dinkum department, Sweeny will be lucky to take a game off Shelton – the American should win this match in straight sets – but we saw Sweeny’s resilience the other day, and even after dropping the first set to Monfils, he fought back to win the match. Come on, Dane.",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/national/nsw/pilot-praised-for-quick-thinking-before-sydney-golf-course-crash-20260122-p5nw63.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pilot praised for quick thinking before Sydney golf course crash",
    "publish_date": "Thu, 22 Jan 2026 13:24:02 +1100",
    "category": "finance",
    "authors": [
      "Jack Gramenz"
    ],
    "text": "Advertisement\n\nNationalNSWAviation Pilot praised for quick thinking before Sydney golf course crash Jack Gramenz January 22, 2026 — 1:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA quick-thinking pilot instructor’s decision to use a golf course as an emergency runway after a light plane’s engine failed about 1600 feet above Sydney’s northern beaches helped avoid a worse crash, an investigation has found. The Australian Transport Safety Bureau’s (ATSB) probe of the light plane crash on a Mona Vale golf club fairway on August 17, 2025, when a student pilot sustained minor injuries, found that an exhaust valve caused an engine failure. Loading The valve broke away from its stem in the third cylinder of the 1967 Piper Cherokee’s engine, causing extensive damage, the investigation concluded. The cause of the exhaust valve failure could not be determined, but the engine’s manufacturer had previously provided advice about the risks of engine oil contamination causing valves to stick.\n\nAdvertisement\n\nThe plane took off for a navigation training flight from Wollongong with the student pilot and instructor on board. But during the flight, the engine’s RPM began to drop rapidly as unusual noises began to be heard. A plane made an emergency landing on Mona Vale Golf Course in August. Nine News About six minutes later, while trying to reach Long Reef golf course and with the engine progressively decreasing in power, the instructor decided to land at Mona Vale golf course instead. Long Reef had fewer trees, but Mona Vale was closer, and the engine RPM was progressively decreasing, according to the ATSB report. “This investigation highlights the importance of effective decision-making skills in emergency situations,” ATSB chief commissioner Angus Mitchell said.\n\nAdvertisement\n\nPrevious ATSB investigations had highlighted how delaying a decision to land after an engine malfunction can lead to more challenging landings. The bureau said the instructor’s timely decision to land sooner probably minimised the adverse consequences of the forced landing. The aircraft was substantially damaged while those on board sustained minor injuries. Nine News But during the final stages of the approach, the pilot realised the plane would not be able to safely land straight ahead and made a right turn to avoid facilities, dropping the right wing and causing the plane to land heavily. It came to a stop before the clubhouse on the 15th hole.\n\nAdvertisement\n\nThe landing caused substantial damage to the plane, while the student pilot sustained minor injuries. The leased plane’s operator, Airspeed Aviation, has reviewed its processes and is consulting with other industry participants to create guidance on using aircraft with older engines in response to the crash, the ATSB reported. Be the first to know when major news happens. Sign up for breaking news alerts on email or turn on notifications in the app.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/australian-open-highlights-jessica-pegula-v-mccartney-kessler-20260122-p5nw7i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open Highlights: Jessica Pegula v McCartney Kessler",
    "publish_date": "Thu, 22 Jan 2026 13:17:54 +1100",
    "category": "finance",
    "authors": [],
    "text": "Australian Open Highlights: Jessica Pegula v McCartney Kessler\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/australian-open-highlights-ashlyn-krueger-v-madison-keys-20260122-p5nw7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open Highlights: Ashlyn Krueger v Madison Keys",
    "publish_date": "Thu, 22 Jan 2026 13:17:35 +1100",
    "category": "sports",
    "authors": [],
    "text": "Australian Open Highlights: Ashlyn Krueger v Madison Keys\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/babar-fumes-at-smith-before-record-over-20260117-p5nupv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Babar fumes at Smith before record over",
    "publish_date": "Thu, 22 Jan 2026 13:16:49 +1100",
    "category": "sports",
    "authors": [],
    "text": "Babar fumes at Smith before record over\n\nBarbar Azam is left seething after Steve Smith turns down a single, before the latter hammers a record 32 runs in an over.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/technology/testing-the-claude-ai-coworker-20260122-p5nw7g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Testing the Claude AI coworker",
    "publish_date": "Thu, 22 Jan 2026 13:15:03 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/not-quite-flawless-but-loveliness-abounds-at-david-byrne-show-20260122-p5nw3y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Not quite flawless, but loveliness abounds at David Byrne show",
    "publish_date": "Thu, 22 Jan 2026 13:07:11 +1100",
    "category": "entertainment",
    "authors": [
      "George Palathingal"
    ],
    "text": "In a nutshell, he’s still seeking connection, and seeing him perform remains among the most life-affirming ways to find it.\n\nWe learn on this night, to some extent, how the pandemic affected the former frontman of Talking Heads, the band that all but defined NYC art rock from the late ’70s to the mid-’80s. Byrne clearly tried to process some of those feelings on last year’s Who Is the Sky? album, so here he continues the exercise, with some of those songs joining the tried-and-true favourites from his brilliant career.\n\nLoveliness abounds at a David Byrne show. We know this from our extraordinary shared experience in this same room in 2018 but, you know, some stuff has happened since then.\n\nThanks to his exquisite use of screens and lights, we spend time on the moon, looking down at Earth (for the maudlin but warm Heaven); in neon-hued streets to a seamy funk soundtrack of Houses in Motion; at the (hardly hellish, unsurprisingly stylish) abode where Byrne was stuck during lockdown (the jaunty folly of My Apartment Is My Friend); and more cleverly realised locales.\n\nDavid Byrne with a few members of the 12-strong band. Pete Dovgan\n\nThere’s other visual trickery, and sometimes the gimmicks supersede the songs (and distract you from the lesser ones; hello, Independence Day) – but more often than not the aesthetics emphatically enhance them.\n\nThis includes the band, a riveting, dozen-strong collective roaming the stage along with Byrne in perfectly choreographed harmony, variously playing their assigned instruments and/or dancing with infectious joy. We join them on our feet, of course, especially for the Talking Heads classics: the meticulously, blissfully building This Must Be the Place; the ever-dizzying perfection of Once in a Lifetime; the cathartic euphoria of Burning Down the House.\n\nAt the risk of being That Guy, this tour is not quite as spectacular as the flawless 2018 show – a version of which you can see in Spike Lee’s 2020 concert film American Utopia – though that’s an opinion largely based on my feelings on the likeable but merely fine songs of Who Is the Sky? ousting others I’d rather see and hear. But a David Byrne performance is still quite like nothing else out there, in most of the very best ways.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/hijikata-stuns-opponent-with-epic-shot-20260122-p5nw6z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hijikata stuns opponent with epic shot",
    "publish_date": "Thu, 22 Jan 2026 12:51:22 +1100",
    "category": "sports",
    "authors": [],
    "text": "Hijikata stuns opponent with epic shot\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/millmans-advice-to-take-down-sinner-20260122-p5nw6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Millman's advice to take down Sinner",
    "publish_date": "Thu, 22 Jan 2026 12:47:14 +1100",
    "category": "finance",
    "authors": [],
    "text": "Millman's advice to take down Sinner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/nsw/owner-abandons-plans-to-scrap-the-qvb-s-stained-glass-windows-20260121-p5nvrl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Owner abandons plans to scrap the QVB’s stained-glass windows",
    "publish_date": "Thu, 22 Jan 2026 12:44:19 +1100",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "Advertisement\n\nExclusive NationalNSWHeritage Owner abandons plans to scrap the QVB’s stained-glass windows Cindy Yin Updated January 22, 2026 — 12:44pm ,first published 11:01am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe owners of the Queen Victoria Building have scrapped a controversial plan to replace the building’s multicoloured glass windows with clear panes after a public backlash. In December, Vicinity Centres – the country’s second-largest retail landlord and co-owner of the QVB – lodged a development application with the City of Sydney seeking to replace the multicoloured glass on the Market Street ground-floor shopfronts with clear glass. The application to replace these stained-glass windows outside Market Street with clear glass has been abandoned. Louie Douvis The move sparked anger in the community over concerns it would damage the heritage character of the iconic building if the application was approved by the council’s planning panel. However, on Wednesday night, the retail giant quietly withdrew its development application before the exhibition period, accepting public submissions were slated to end on February 6.\n\nAdvertisement\n\n“We have listened carefully to community sentiment and recognise the strong connection many people have to this treasured icon and the importance placed on its historic character,” a Vicinity spokesperson told the Herald. “As responsible custodians, we take that feedback seriously and remain committed to preserving the QVB’s heritage. This decision reflects Vicinity’s commitment to act proactively, decisively, and respectfully in the best interests of the QVB and the broader community. “We have withdrawn the application to ensure the QVB continues to be celebrated, protected and enjoyed for generations to come.” The stained-glass windows Vicinity sought to replace in its application were refurbished in the 1980s, a reconstruction of the original neo-romanesque sandstone building that was erected in 1898.\n\nAdvertisement\n\nArtists who, decades ago, cut by hand thousands of pieces of glass for the refurbishment said the push to alter the building greatly saddened them. Related Article Exclusive\n\nCity life Rozlyn hand-cut 73,000 pieces of glass for the QVB. Now the landlord wants some removed Before backflipping, Vicinity Centres said in its proposal that the coloured glass created a “significant economic burden” to landlords and reduced the attractiveness and value of the space to prospective retailers, pointing to millions of dollars in lost revenue. It also argued that the coloured glass obscured views from the street, and that installing clear glass would provide clearer views into shops and highlight their double-height spaces. The City of Sydney’s planning portal has since been updated, and progress timelines on their website show the development application has been withdrawn.\n\nAdvertisement\n\nLord Mayor Clover Moore welcomed the reversal, and said she was glad the owners had listened: “This is one of our most important, treasured heritage buildings. As the city around it changes, it remains as a bold and significant piece of public infrastructure and an important layer of both our architectural history and cultural fabric.” Deputy Lord Mayor Jess Miller said it was a “real win for the planning process” and for the community. “It’s so important that we take good care of these gorgeous heritage buildings, and this is a really exciting outcome,” Miller said. Vicinity Centres acquired the QVB in 2018 and co-owns the building with Link REIT. They also own a raft of other shopping centres across the country, from Chatswood Chase and The Strand Arcade in Sydney, to Chadstone and the Emporium in Melbourne. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/culture/celebrity/doofus-director-text-messages-between-taylor-swift-and-blake-lively-revealed-20260122-p5nw30.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Felt like a bad friend’: Taylor Swift-Blake Lively text messages reveal friendship fallout",
    "publish_date": "Thu, 22 Jan 2026 12:39:37 +1100",
    "category": "finance",
    "authors": [
      "Nell Geraets"
    ],
    "text": "Advertisement\n\nCultureCelebrityTaylor Swift ‘Felt like a bad friend’: Taylor Swift-Blake Lively text messages reveal friendship fallout Nell Geraets Updated January 22, 2026 — 12:39pm ,first published January 22, 2026 — 10:15am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPop juggernaut Taylor Swift has once again been pulled into the legal battle between It Ends With Us co-stars Blake Lively and Justin Baldoni. Text messages between long-time friends Swift and Lively were unsealed on Tuesday (US time) amid the ongoing legal drama, which began in December 2024 when Lively filed a complaint against her co-star and director, accusing him of sexual harassment and running a smear campaign against her. Baldoni categorically denied all accusations against him. The trial is set for May. Private text messages between friends Taylor Swift and Blake Lively have been revealed amid Lively’s legal battle with Justin Baldoni. PA Wire/Getty In May 2025, Swift was subpoenaed as a witness in Baldoni’s $US400 million defamation countersuit – which has since been dropped – against Lively. A spokesperson for Swift said at the time this was designed to generate public interest by “creating tabloid clickbait instead of focusing on the facts of the case”. Though the subpoena was dropped later that month, Swift’s name has emerged again amid the legal mayhem. According to the unsealed messages, seen by this masthead, Lively spoke openly about the concerns she had while on set for the film adaptation of Colleen Hoover’s It Ends With Us. At one point, the actress referred to Baldoni as her “doofus director”. In December 2024, the close friends texted again shortly before the publication of a New York Times expose regarding Lively’s accusations against Baldoni and the film’s production company Wayfarer Studios.\n\nAdvertisement\n\nRelated Article Taylor Swift Why is Taylor Swift caught up in the Baldoni-Lively legal battle? “I think this bitch knows something is coming because he’s gotten out his tiny violin,” Swift texted Lively alongside a screenshot of a People article about Baldoni saying he’d been “sexually traumatised”. Swift later described the situation as “a horror film no one knows is taking place” and said Baldoni “needs to be beaten by his OWN words”. In the same conversation, Lively wrote to Swift: “Can you imagine feeling as confident as these predators that you’re going to always get away with it. Him accepting an award as an ally for women ... And Scooter going about [the] world with his head held high as he co-owns and funds a crisis PR company that silences women.” Scooter Braun, who was subpoenaed by Lively, was in a long-running feud with Swift over the ownership of her music. An earlier exchange in April 2023 appeared to show Lively asking Swift to praise Lively’s revised version of the script for It Ends With Us in front of Baldoni. Swift was allegedly on her way to meet the director at Lively’s New York apartment.\n\nAdvertisement\n\n“He’s a clown and thinks he’s a writer now,” Lively wrote. “So having the greatest living storyteller unknowingly echo to him how much you love what we’re doing (giving him credit as if he wrote them with me) will go such a long way.” According to the filing, Swift responded, “I’ll do anything for you!!” Taylor Swift and Blake Lively have been close friends since 2015. Getty The unsealed correspondence also revealed the impact the legal feud had on Swift and Lively’s decade-long friendship. “I have no reason to ask, but I donno, I’ve been feeling like I should … is everything OK?” Lively wrote to Swift in early December 2024. “I felt like a bad friend lately because I was such a sad sack who only talked about my own shit for months. You were generous to not only be the key person there for me during all of it, but also to let me off the hook for being so in it. But I still have a feeling something may not be right.” In response, Swift said her friend wasn’t wrong, but that it wasn’t “a big deal”.\n\nAdvertisement\n\nBlake Lively and Justin Baldoni starred alongside each other in It Ends With Us in 2024. AP “I think I’m just exhausted in every avenue of my life and in recent months had been feeling a little bit of a shift in the way you talk to me … I feel really bad saying anything about this because your texts have been so nice in their intent but your last few… it’s felt like I was reading a mass corporate email sent to 200 employees,” Swift wrote. “It feels awful to be in any way critical of any way you process what you’ve been going through but I just kinda miss my funny, dark, normal-speaking friend who talks to me as herself, not like. A plural unit.” Related Article Pop culture A bestselling author, a new novel, a cancer diagnosis … then, the disclaimers The pop star said Lively didn’t need to apologise, but implored her to “come back”. Sigrid McCawley, a member of Lively’s legal team, told CNN the unsealed evidence “shows the concerns of Ms Lively and others were documented in real-time as early as Spring 2023, and Wayfarer understood them as ‘sexual harassment’ concerns”.\n\nAdvertisement\n\n“The evidence also documents how Wayfarer refused to investigate, but instead attempted to ‘bury’ Ms Lively and others who spoke up through retaliation,” she said. In response, Baldoni’s lawyer Bryan Feldman said the evidence did not support the claims as a matter of law. “A simple read of the newly released message exchanges make the truth abundantly clear. We remain confident in the legal process and clearing the names of all of the Justin Baldoni parties,” he said, per CNN. Swift’s representative has been contacted for comment. Must-see movies, interviews and all the latest from the world of film delivered to your inbox. Sign up for our Screening Room newsletter.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-dip-wall-street-steadies-after-trump-says-he-won-t-use-force-to-take-greenland-20260122-p5nw10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Banks drive ASX higher; strong jobs figures boost rate hike chances",
    "publish_date": "Thu, 22 Jan 2026 12:37:08 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Banks drive ASX higher; strong jobs figures boost rate hike chances Staff reporter Updated January 22, 2026 — 12:37pm ,first published January 22, 2026 — 5:18am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has shed some of its early gains after unexpectedly strong jobs figures increased the chances of an interest rate hike next month, while investors responded favourably to an easing in tensions over President Donald Trump’s push to take control of Greenland. The S&P/ASX 200 was 65 points, or 0.7 per cent, higher to 8847.9, with nine of 11 industry sectors in positive territory. The increase followed a rally on Wall Street overnight, after Trump dumped his threat to impose tariffs on several European countries because of their opposition to the US taking control of Greenland, saying he had a “framework for a future deal” on arctic security. Wall Street rallied on the latest developments in the stoush over Greenland. Bloomberg Labour force figures were released at 11.30am AEDT, showing that the economy added 65,200 jobs in December, pushing the jobless rate to 4.1 per cent, down from 4.3 per cent in November. AMP deputy chief economist Diana Mousina said the implied odds of a rise in official interest rates in February had lifted from 26 per cent to 56 per cent after the figures were published.\n\nAdvertisement\n\nFinancial stocks rose at the open then received a further boost from the jobs figures, with Commonwealth Bank (up 1.6 per cent), Westpac (up 1.1 per cent), National Australia Bank (up 2.6 per cent) and ANZ Bank (up 0.6 per cent) sharply higher in early afternoon trade. Among the miners, Rio Tinto added 1.1 per cent and BHP shed 0.5 per cent. Fortescue fell 4.4 per cent after it announced it shipped a record volume of iron ore in the six months to December 31. Gold miners retreated, with Northern Star falling 2.1 per cent and Evolution Mining 0.8 per cent lower. Energy stocks are higher as oil prices strengthened as traders assessed US President Donald Trump’s statement that the US had reached a “framework” for a deal on Greenland. Woodside Energy rose 2.7 per cent, while Santos added 4.1 per cent as it lifted fourth-quarter production by 5 per cent. Related Article Opinion\n\nWorld markets Melting down: Trump sent a warning by markets Stephen Bartholomeusz Senior business columnist On Wall Street, the S&P 500 rallied 1.2 per cent after Trump said the deal, “if consummated, will be a great one for the United States of America” and its allies in the North Atlantic region. The announcement triggered an immediate move higher in the stock market, which found solace earlier in the day after Trump ratcheted down his rhetoric and told business and government leaders in Europe that he would not use force to take “the piece of ice.”\n\nAdvertisement\n\nThe de-escalation in tensions helped the S&P 500 recover just over half of its 2.1 per cent drop from the day before and pull closer to its all-time high set earlier this month. The Dow Jones Industrial Average jumped 588 points, or 1.2 per cent, and the Nasdaq composite climbed 1.2 per cent. The Australian sharemarket is set to advance, with futures pointing to a gain of 47 points, or 0.5 per cent, at the open. The ASX shed 0.4 per cent on Wednesday. The Australian dollar is trading at US67.64¢ at 8.45am AEDT. Treasury yields also eased in the bond market in another signal of reduced worries among investors. Besides the progress on Greenland, they also got help from a calming of yields in Japan’s jumpy bond market. The value of the US dollar, meanwhile, clawed back some of its declines against other currencies after sliding the day before. Trump himself acknowledged how the US stock market sold off on Tuesday because of his desire for Greenland, but he called it “peanuts compared to what it’s gone up” in the first year of his second term and said it would go up further in the future. Trump has a history of making big threats that send financial markets sliding, only to pull back later and reach deals that are seen as less bad for the economy or for inflation than his initial suggestion.\n\nAdvertisement\n\nOn one hand, the pattern has given rise to the “TACO” acronym suggesting “Trump Always Chickens Out” if financial markets react strongly enough. On the other, Trump has ultimately struck deals that outsiders may have earlier considered unlikely, ones that he’s crowed about later. The most obvious example is Trump’s announcement of high tariffs on “Liberation Day,” which eventually led to trade deals with many of the world’s major economies. Helping to lead the US stock market Wednesday was Halliburton. The oil field services company rose 4.1 per cent after reporting a stronger profit for the latest quarter than analysts expected. United Airlines climbed 2.2 per cent after likewise reporting a better profit for the final three months of 2025 than analysts expected. CEO Scott Kirby said that the airline’s strong momentum in revenue is continuing into 2026. They helped offset a 2.2 per cent drop for Netflix. The streamer sank even though it reported a stronger profit than expected. Investors focused instead on its slowing subscriber growth and its lower-than-expected forecast for profit in the current quarter. Kraft Heinz sank 5.7 per cent after Berkshire Hathaway warned investors that it may be interested in selling its 325 million shares in the food giant that former CEO Warren Buffett helped create in 2015.\n\nAdvertisement\n\nBerkshire took a $US3.76 billion ($5.6 billion) write-down on its Kraft-Heinz stake last summer. Buffett said last fall that he was disappointed in Kraft Heinz’ plan to split the company in two, and Berkshire’s two representatives resigned from the Kraft board last spring. All told, the S&P 500 rose 78.76 points to 6,875.62. The Dow Jones Industrial Average climbed 588.64 to 49,077.23, and the Nasdaq composite gained 270.50 to 23,224.82. In the bond market, the yield on the 10-year Treasury eased to 4.25 per cent from 4.30 per cent late Tuesday. That’s almost all the way back to the 4.24 per cent level where it was at on Friday. Related Article Updated\n\nTrump diplomacy Trump retreats on Greenland threats, dropping tariffs and ruling out force as future deal agreed That was before Trump threatened to impose 10 per cent tariffs on Denmark, Norway, Sweden, Germany, France, the United Kingdom, the Netherlands and Finland for opposing US control of Greenland. That would have been on top of a 15 per cent tariff specified by a trade agreement with the European Union that has yet to be ratified.\n\nAdvertisement\n\nIn stock markets abroad, indexes were mixed in mostly modest movements across Europe and Asia. Japan’s Nikkei 225 slipped 0.4 per cent. The country’s prime minister, Sanae Takaichi, has called a snap election for Feb. 8, which had sent yields of long-term government bonds to record levels and raised worries across global financial markets. The expectation is that Takaichi, who is capitalizing on strong public support ratings, will cut taxes and boost spending and increase the government’s already heavy load of debt. After surging as high as 4.22 per cent on Tuesday, the yield on the 40-year Japanese government bond pulled back to 4.05 per cent Wednesday. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nShares\n\nWall Street",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/australian-open-2026-every-aussie-tennis-player-who-s-won-in-week-one-so-far-20260119-p5nv8b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After a brutal first week for Aussies at the AO, six remain. One is about to face Sinner",
    "publish_date": "Thu, 22 Jan 2026 12:26:11 +1100",
    "category": "sports",
    "authors": [
      "Staff Reporters"
    ],
    "text": "Follow our live coverage of day five of the 2026 Australian Open here.\n\nThe first week of the 2026 Australian Open is underway and some of our best home-grown athletes have already advanced into the later rounds. Here’s a list of every Australian tennis player in the men’s and women’s singles who won their matches in week one.\n\nThis story will be updated every morning with the previous night’s results.\n\n\n\nAre there any Australian players in action today?\n\nIn the women’s singles, Taylah Preston has her second round match against 13th seed Linda Noskova on the Show Court Arena, scheduled for around lunchtime.\n\nMaddison Inglis will face Germany’s Laura Siegemund at around 1pm on Stadium Australia.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/environment/helicopter-retrieves-cars-swept-out-to-sea-20260122-p5nw6d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Helicopter retrieves cars swept out to sea",
    "publish_date": "Thu, 22 Jan 2026 12:06:37 +1100",
    "category": "sports",
    "authors": [],
    "text": "Helicopter retrieves cars swept out to sea\n\nMore than a dozen cars were extricated from pounding surf after flash floods swept them out to sea on the Cumberland and Wye Rivers last week.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/europes-not-heading-in-the-right-direction-trump/88pwqfftu",
    "title": "Europe's not heading in the right direction: Trump",
    "publish_date": "Thu, 22 Jan 2026 02:12:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nAs the United States President flew into the Switzerland city of Davos for the World Economic Forum, the words 'Trump Go Home' were written in the snow and clearly visible from the air.\n\nBut Donald Trump was going nowhere until he got his message across - and in his sights for his 70 minute speech was Europe.\n\n\"I love Europe and I want to see Europe go good, but it's not heading in the right direction.\"\n\nThe US President spent considerable time ahead of the forum threatening to levy tariffs on Denmark and seven other allies - unless they negotiated a transfer of the semi-autonomous territory of Greenland.\n\nHis speech has made it clear that he believes they have been unreasonable in saying no to a US takeover, despite America already having a large military base there.\n\n\"It's the United States alone that can protect this giant mass of land - this giant piece of ice. Develop it and improve it and make it so that it's good for Europe and safe for Europe and good for us. And that's the reason I'm seeking immediate negotiations to once again discuss the acquisition of Greenland by the United States.\"\n\nThe President has long said the US will get control of Greenland, no matter what it takes.\n\nAt Davos, Mr Trump has taken the same tone.\n\n\"They have a choice. You can say yes. And we will be very appreciative. Or you can say no. And we will remember.\"\n\nBut the President says he has ruled out the use of force in order to get his way.\n\n\"We probably won't get anything unless I decide to use excessive strength and force where we would be, frankly, unstoppable. But I won't do that. Okay? Now everyone's saying, oh, good. That's probably the biggest statement I made because people thought I would use force. But I don't have to use force. I don't want to use force. I won't use force.\"\n\nMr Trump also took a wider hectoring tone in his remarks.\n\nHe's chastised the US' European allies for what he has called their insolence, disloyalty and policy missteps in areas ranging from immigration and geopolitics, to the environment and wind power.\n\n\"There are windmills all over Europe. There are windmills all over the place, and they are losers. One thing I've noticed is that the more windmills a country has, the more money that country loses and the worse that country is doing.”\n\nOn several occasions during his speech, President Trump also mistakenly referred to Greenland as Iceland.\n\n\"I don't know that they'd NATO be there for us. They're not there for us on Iceland. That I can tell you. The stock market took the first dip yesterday because of Iceland. So Iceland's already cost us a lot of money.\"\n\nReactions to Trump's complaints about Greenland - and the wider European continent - have been swift.\n\nCroatian Prime Minister Andrej Plenković says he's relieved military action appears to have been ruled out.\n\n\"What was clear, that if the offer is not accepted, he will not be happy, but he will not use force. So, in a way, this calms down the whole tension that was a little bit visible over the past few days.\"\n\nBut Donald Trump's increasing bluster towards Europe over Greenland has continued to fray transatlantic ties and worry Europeans.\n\nDonald Trump had earlier threatened tariffs on Denmark and any other close European allies that sent troops to Greenland in solidarity, including Britain, France and Germany.\n\nThe European Parliament Chair of the International Trade Committee, Bernd Lange says this would have been a breach of a crucial trade deal.\n\n\"It's totally clear that there was a breaking of the Scotland deal by President Trump, announcing 10 per cent tariff for European goods starting at the 1st of February and 25 per cent if Greenland is not going to the United States in June.\"\n\nSome European allies, like Swedish Deputy Prime Minister Ebba Busch, believe Mr Trump has been trying to bully them into doing what the U-S wanted.\n\n\"Let's just say in many ways I'm not surprised at all. This follows the line of both a mix of irrational and rational arguments at the same time.\"\n\nDonald Trump's threats at Davos have even appeared on the verge of rupturing NATO, which was founded by leading European nations, the US and Canada in the aftermath of World War Two.\n\nAmid these concerns, British Defence Secretary John Healey has said Europe must play a key role going forward.\n\n\"Recognising the growing threats from Russia, recognising the growing interest from China, and recognising the way that the High North will open up increasingly with climate change and increasingly become an area of competition in which we, through NATO, with the U.S. playing a part, will reinforce the security and the deterrents for the future.\"\n\nUltimately, President Trump cancelled the planned Greenland-related tariff.\n\nHe says this is because an agreement has been reached with NATO on a framework for a future Arctic deal, though what that looks like remains to be seen.\n\n\"The deal is going to be put out pretty soon. We'll see. It's right now a little bit in practice, but pretty far along. It gets us everything we needed to get.\"\n\nEven so, the concern amongst some European allies isn't going away.\n\nBernd Lange says Trump's speech made it clear his Greenland ambitions remained unchanged.\n\n\"Some of you listened also to the speech of President Trump in Davos, and I guess he didn't revise his position. No, he wants to have Greenland as part of the United States as quick as possible, and he wants to have a table where we could discuss about the price.\"\n\nSerbian President, Aleksandar Vucic, is among those who suggest more conflict is ahead, no matter what happens with Greenland.\n\n\"I am not as smart as all the other politicians in the world to assess it immediately after he delivered his speech, but obviously, we'll be facing bigger tensions between Europe and United States in the time to come, and we'll have to get ready for that.\"",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/who-is-richest-australia-generations/65wvuil0l",
    "title": "Who's richest? Australia's 'great wealth transfer' is reshaping the ladder",
    "publish_date": "Wed, 21 Jan 2026 18:49:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Gen X households hold more wealth in property and shares than other generations, but baby boomers still have the highest net worth overall, according to a new analysis.\n\nBaby boomers (born 1946-1964) had the highest average net worth at $2.375 million, with gen X (born 1965-1980) close behind at nearly $2.2 million, according to the report by consultancy firm KPMG, which analysed Australian Bureau of Statistics income and wealth data.\n\nThe net worth gap between these generations has kept narrowing, according to KPMG, which a year ago said gen X had overtaken boomers for the first time on property wealth and shares.\n\nBoth cohorts were significantly wealthier than millennials (born 1981 to 1996), whose average net worth was $905,000, according to the latest analysis.\n\nYoung homeowners who could get a foothold during the years of ultra-low interest rates have seen their wealth surge, while those who couldn't are at risk of being permanently priced out of the market.\n\nThe average household wealth for Australians aged 25 to 34 rose from $340,000 in 2019–20 to $550,000 in 2024–25 — an increase of 63 per cent.\n\nKPMG urban economist Terry Rawnsley said the increased wealth of younger Australians was largely driven by those who purchased property when interest rates were \"ultra-low\" in 2020 and 2021.\n\n\"For young Australians able to get into the market they are starting to see strong growth, but for those aged under 30, many of whom have been locked out of housing, wealth accumulation will be a much tougher task,\" Rawnsley said.\n\n\"With interest rates now at much higher levels, that home ownership window is now firmly closed.\"\n\nSource: SBS News / KPMG\n\nHowever, younger Australians will likely retire with far more superannuation than those exiting the workforce today, according to the analysis.\n\nThe 55 to 64 age group had super balances averaging $756,000, compared to $151,000 for 25 to 34-year-olds and $289,000 for 35 to 44-year-olds.\n\nWith decades left of their working lives, younger generations will benefit from higher mandatory employer contributions, which will be invested for longer.\n\n\"Their superannuation will be coming off a far higher base than their parents. This means the wealth they will eventually accumulate from super will be far higher than today’s retirees,\" Rawnsley said.\n\nThe amount you need for a comfortable retirement can vary widely, however, depending on whether you own your home, according to some models.\n\n'The great wealth transfer is in full swing'\n\nThe report — which also analysed household wealth by generation — found baby boomers had the highest net worth overall, while gen X had the most property wealth.\n\nGen X households had an average property wealth of $1.445 million, compared to $1.360 million for baby boomers.\n\nSource: SBS News / KPMG\n\nRawnsley attributed the shift to an inter-generational wealth transfer.\n\nIn 2024, analysts estimated Australia's over-60s are expected to transfer $3.5 trillion to younger generations in the next 20 years, dubbing this the 'great wealth transfer'.\n\n\"The great wealth transfer is in full swing, as baby boomers start downsizing properties and moving that wealth into cash. They are also beefing up their super accounts as they begin to spend in retirement or hand down wealth to their children,\" he said.\n\n\"This has meant gen X is atop the mantel as the wealthiest property owners.\"\n\nMillenials had larger debts than other generations, likely owing to property loans.\n\n\"For the average millennial household, the property they own is still largely a liability, which explains why their net worth is less than the average value of their property,\" Rawnsley said.\n\nLucas Walsh, professor of youth studies at Monash University, told SBS News the wealth transfer came at the expense of Australians who did not expect an inheritance.\n\n\"More goes to wealthier families and less goes to others,\" he said.\n\n\"This divide is striking ... and I think will present problems to social cohesion, as people become less happy with their lives under these conditions.\"\n\nWalsh said the wealth transfer would continue, but he expected it to narrow.\n\n\"We can expect the wealth accumulated by previous generations to have less and less relative value if property prices keep going up and the cost of living keeps increasing,\" he said.\n\nProperty remains primary driver of wealth\n\nThe report shows home ownership remains the cornerstone of wealth accumulation, which includes property, superannuation, shares and other assets minus debts.\n\nHouseholds aged 55 to 64 had the highest average property wealth at $1.529 million, while those aged 25 to 34 averaged $575,000.\n\n\"This wealth profile is reflecting a lifetime of super contributions and exposure to the share market and purchasing homes when they were more affordable,\" the report states.\n\nSource: SBS News / KPMG\n\n\"Many young people in this group are just entering the housing market, which leaves them with large mortgages,\" Rawnsley said.\n\n\"Combined with HECS debts, this makes them the most leveraged generation with an average loan size of $346,000, offsetting total assets of $899,000.\"\n\nWith many young people priced out of the housing market, Rawnsley said he expected many would focus on building their share portfolios as a way of accumulating wealth.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/global-markets-slide-on-trumps-europe-tariff-concerns/s97kc4k1x",
    "title": "Global markets slide on Trump's Europe tariff concerns",
    "publish_date": "Wed, 21 Jan 2026 06:53:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/three-nationals-senators-resign-from-opposition-frontbench-evening-news-bulletin-21-january-2026/7pmsekcr5",
    "title": "Three Nationals senators resign from opposition frontbench | Evening News Bulletin 21 January 2026",
    "publish_date": "Wed, 21 Jan 2026 05:10:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/marie-bashir-a-tremendous-role-model/5c5cd32yh",
    "title": "Marie Bashir - 'a tremendous role model'",
    "publish_date": "Wed, 21 Jan 2026 03:47:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\n“Well, Marie Bashir was just a unique human being incredibly compassionate. She was able to project her warmth and compassion and wisdom out into the world. She certainly was able to focus it on people that she was with, but she was able to project it out into into the wider world and that was a gift and she was a tremendous role model.”\n\nThis is professor Patrick McGorry, former Australian of the year, and CEO of Orygen Youth Mental Health, speaking about New South Wales' first female governor Dame Marie ((mah-ree)) Bashir, who has died aged 95.\n\nNew South Wales Premier Chris Minns announced Dame Marie's passing in a statement over night, which in part reads:\n\n“Dame Marie was an extraordinary Australian and one of New South Wales’ most respected public servants. On behalf of the people of New South Wales, I extend my deepest condolences to Dame Marie’s family, friends and all those who were inspired by her remarkable life. Dame Marie Bashir served our state with distinction as the first female Governor of NSW from 2001 to 2014, bringing to the role immense dignity and compassion.”\n\nDame Marie was married to former lord mayor of Sydney, Sir Nicholas Shehadie for 61 years, and had three children and six grandchildren.\n\nPrior to her appointment as governor in 2001, she had became known for her pioneering work and passionate advocacy across areas such as suicide prevention, youth mental health and Indigenous health.\n\nShe was appointed an officer of the Order of Australia in 1988 for her services to child and adolescent health.\n\nPrime Minister Anthony Albanese has joined others in paying tribute to her life and legacy, writing on social media:\n\n“Her lifetime of service to the medical profession, her community and her fellow Australians was defined by her powerful sense of duty and her abiding passion for helping others. As the first woman to serve as Governor of New South Wales she was both a pioneer and an inspiration. In all she did, Dame Marie blended dignity with warmth and intellect with empathy. “\n\nDame Marie was born in the Riverina town of Narrandera to a Lebanese father and a mother of Lebanese descent.\n\nShe graduated from the University of Sydney in 1956 with a Bachelor of Medicine and Bachelor of Surgery, and worked in hospitals and as a general practitioner, before completing post-graduate studies in Psychiatry.\n\nIn 2010 in an interview for NITV's Living Black program, she reflected on her time working as nurses aide during the holidays at Prince Alfred Hospital.\n\n“So I got the feel of patients in bed, very ill. My job was to clean pans and to feed those who'd had strokes and nothing to do with being a medical student or a future doctor. It was a wonderful experience because close up I was able to see suffering when people were alone.”\n\nProfessor McGorry, who later knew Dame Marie personally as a fellow psychiatrist, says a commitment to equality was an undercurrent through all her work.\n\n“She was someone who just treated every human being and so every human being is as equal and a vehicle value and obviously she worked with multicultural youth. She worked with indigenous use marginalise use and she was an incredibly inclusive. You know almost like a spiritual person I would say.”\n\nAmong other roles, Dame Marie worked as a senior consultant at the Aboriginal Medical Service in both Redfern and Kempsey.\n\nIn a partnership with the Redfern Aboriginal Medical Service, she established the Aboriginal Mental Health Unit, which provides regular clinics and counselling at both the Aboriginal Medical Service in Sydney and mainstream centres.\n\nShe was a vocal advocate for Indigenous rights more broadly, too.\n\nHere's Dame Marie speaking to NITV in 2013 about the significance of the National Apology to Aboriginal and Torres Strait Islander people.\n\n“As on that wonderful day when the prime minister annunciated those unforgettable words on behalf of the nation of sorry, the whole nation rose, I believe, in stature. And I think when Aboriginal people are formerly recognized in the Constitution, that will be another landmark occasion.”\n\nDame Marie is also being honoured today for her support for the LGBTQI+ community, which included her and her husband being named chiefs at the 2015 Sydney Gay and Lesbian Mardi Gras for their work to combat homophobia.\n\nShe retired as Governor in 2014, after holding the office for over 13 years, making her the second-longest serving Governor of New South Wales\n\nProfessor McGorry says she leaves behind a powerful legacy built on unity and compassion.\n\n“Unfortunately we're getting with seeing more more division along these sorts of fault lines in our society emerging right now and so someone like Marie was the antidote. She was the absolute opposite of what we're seeing at the moment with within society, trends that are emerging so she was a unifier, she was an integrator and she was a spiritual leader really.”\n\nA state funeral will be held for Dame Marie at a later date.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/lifestyle/aussie-high-school-bans-mullets-in-haircut-crackdown-20260122-p5nw7r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie high school bans mullets in haircut crackdown",
    "publish_date": "Thu, 22 Jan 2026 13:26:42 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/australian-open-2026-live-updates-duckworth-faces-champ-sinner-djokovic-osaka-in-title-chase-special-ks-in-all-aussie-showdown-20260121-p5nvto.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open 2026 LIVE updates: Keys chases second title; Duckworth faces champ Sinner; Special Ks in all-Aussie showdown; Djokovic, Osaka in action",
    "publish_date": "Thu, 22 Jan 2026 13:25:22 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell",
      "Roy Ward"
    ],
    "text": "The David v Goliath battle of day five is about to unfold on John Cain Arena.\n\nAussie battler Dane Sweeny is preparing to tackle American Ben Shelton in their second-round clash, and on paper, it looks a mismatch.\n\nDane Sweeny steps out on court. Credit: Getty Images\n\nSweeny squeezed his way into the main draw via qualifying, while Shelton is the No.8 seed.\n\nSweeny, 25 next month, stands 170 centimetres tall, is the world No.182 and is playing his first grand slam event.\n\nShelton towers over his opponent at 193 centimetres and boasts a semi-final appearance at last year’s Australian Open.\n\nThere is no doubt Sweeny, who defeated tennis legend Gael Monfils two days ago, has a battle ahead of him.\n\nShelton gets ready for the match. Credit: Getty Images\n\nThe 23-year-old big-hitting American belts down serves around the 210km/h mark, but has recorded serves up to 241 km/h ... yikes.\n\nIn the fair dinkum department, Sweeny will be lucky to take a game off Shelton – the American should win this match in straight sets – but we saw Sweeny’s resilience the other day, and even after dropping the first set to Monfils, he fought back to win the match. Come on, Dane.",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/national/nsw/pilot-praised-for-quick-thinking-before-sydney-golf-course-crash-20260122-p5nw63.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pilot praised for quick thinking before Sydney golf course crash",
    "publish_date": "Thu, 22 Jan 2026 13:24:02 +1100",
    "category": "finance",
    "authors": [
      "Jack Gramenz"
    ],
    "text": "Advertisement\n\nNationalNSWAviation Pilot praised for quick thinking before Sydney golf course crash Jack Gramenz January 22, 2026 — 1:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA quick-thinking pilot instructor’s decision to use a golf course as an emergency runway after a light plane’s engine failed about 1600 feet above Sydney’s northern beaches helped avoid a worse crash, an investigation has found. The Australian Transport Safety Bureau’s (ATSB) probe of the light plane crash on a Mona Vale golf club fairway on August 17, 2025, when a student pilot sustained minor injuries, found that an exhaust valve caused an engine failure. Loading The valve broke away from its stem in the third cylinder of the 1967 Piper Cherokee’s engine, causing extensive damage, the investigation concluded. The cause of the exhaust valve failure could not be determined, but the engine’s manufacturer had previously provided advice about the risks of engine oil contamination causing valves to stick.\n\nAdvertisement\n\nThe plane took off for a navigation training flight from Wollongong with the student pilot and instructor on board. But during the flight, the engine’s RPM began to drop rapidly as unusual noises began to be heard. A plane made an emergency landing on Mona Vale Golf Course in August. Nine News About six minutes later, while trying to reach Long Reef golf course and with the engine progressively decreasing in power, the instructor decided to land at Mona Vale golf course instead. Long Reef had fewer trees, but Mona Vale was closer, and the engine RPM was progressively decreasing, according to the ATSB report. “This investigation highlights the importance of effective decision-making skills in emergency situations,” ATSB chief commissioner Angus Mitchell said.\n\nAdvertisement\n\nPrevious ATSB investigations had highlighted how delaying a decision to land after an engine malfunction can lead to more challenging landings. The bureau said the instructor’s timely decision to land sooner probably minimised the adverse consequences of the forced landing. The aircraft was substantially damaged while those on board sustained minor injuries. Nine News But during the final stages of the approach, the pilot realised the plane would not be able to safely land straight ahead and made a right turn to avoid facilities, dropping the right wing and causing the plane to land heavily. It came to a stop before the clubhouse on the 15th hole.\n\nAdvertisement\n\nThe landing caused substantial damage to the plane, while the student pilot sustained minor injuries. The leased plane’s operator, Airspeed Aviation, has reviewed its processes and is consulting with other industry participants to create guidance on using aircraft with older engines in response to the crash, the ATSB reported. Be the first to know when major news happens. Sign up for breaking news alerts on email or turn on notifications in the app.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/australian-open-highlights-jessica-pegula-v-mccartney-kessler-20260122-p5nw7i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open Highlights: Jessica Pegula v McCartney Kessler",
    "publish_date": "Thu, 22 Jan 2026 13:17:54 +1100",
    "category": "finance",
    "authors": [],
    "text": "Australian Open Highlights: Jessica Pegula v McCartney Kessler\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/australian-open-highlights-ashlyn-krueger-v-madison-keys-20260122-p5nw7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open Highlights: Ashlyn Krueger v Madison Keys",
    "publish_date": "Thu, 22 Jan 2026 13:17:35 +1100",
    "category": "sports",
    "authors": [],
    "text": "Australian Open Highlights: Ashlyn Krueger v Madison Keys\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/babar-fumes-at-smith-before-record-over-20260117-p5nupv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Babar fumes at Smith before record over",
    "publish_date": "Thu, 22 Jan 2026 13:16:49 +1100",
    "category": "sports",
    "authors": [],
    "text": "Babar fumes at Smith before record over\n\nBarbar Azam is left seething after Steve Smith turns down a single, before the latter hammers a record 32 runs in an over.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/technology/testing-the-claude-ai-coworker-20260122-p5nw7g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Testing the Claude AI coworker",
    "publish_date": "Thu, 22 Jan 2026 13:15:03 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/not-quite-flawless-but-loveliness-abounds-at-david-byrne-show-20260122-p5nw3y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Not quite flawless, but loveliness abounds at David Byrne show",
    "publish_date": "Thu, 22 Jan 2026 13:07:11 +1100",
    "category": "entertainment",
    "authors": [
      "George Palathingal"
    ],
    "text": "In a nutshell, he’s still seeking connection, and seeing him perform remains among the most life-affirming ways to find it.\n\nWe learn on this night, to some extent, how the pandemic affected the former frontman of Talking Heads, the band that all but defined NYC art rock from the late ’70s to the mid-’80s. Byrne clearly tried to process some of those feelings on last year’s Who Is the Sky? album, so here he continues the exercise, with some of those songs joining the tried-and-true favourites from his brilliant career.\n\nLoveliness abounds at a David Byrne show. We know this from our extraordinary shared experience in this same room in 2018 but, you know, some stuff has happened since then.\n\nThanks to his exquisite use of screens and lights, we spend time on the moon, looking down at Earth (for the maudlin but warm Heaven); in neon-hued streets to a seamy funk soundtrack of Houses in Motion; at the (hardly hellish, unsurprisingly stylish) abode where Byrne was stuck during lockdown (the jaunty folly of My Apartment Is My Friend); and more cleverly realised locales.\n\nDavid Byrne with a few members of the 12-strong band. Pete Dovgan\n\nThere’s other visual trickery, and sometimes the gimmicks supersede the songs (and distract you from the lesser ones; hello, Independence Day) – but more often than not the aesthetics emphatically enhance them.\n\nThis includes the band, a riveting, dozen-strong collective roaming the stage along with Byrne in perfectly choreographed harmony, variously playing their assigned instruments and/or dancing with infectious joy. We join them on our feet, of course, especially for the Talking Heads classics: the meticulously, blissfully building This Must Be the Place; the ever-dizzying perfection of Once in a Lifetime; the cathartic euphoria of Burning Down the House.\n\nAt the risk of being That Guy, this tour is not quite as spectacular as the flawless 2018 show – a version of which you can see in Spike Lee’s 2020 concert film American Utopia – though that’s an opinion largely based on my feelings on the likeable but merely fine songs of Who Is the Sky? ousting others I’d rather see and hear. But a David Byrne performance is still quite like nothing else out there, in most of the very best ways.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/hijikata-stuns-opponent-with-epic-shot-20260122-p5nw6z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hijikata stuns opponent with epic shot",
    "publish_date": "Thu, 22 Jan 2026 12:51:22 +1100",
    "category": "sports",
    "authors": [],
    "text": "Hijikata stuns opponent with epic shot\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/millmans-advice-to-take-down-sinner-20260122-p5nw6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Millman's advice to take down Sinner",
    "publish_date": "Thu, 22 Jan 2026 12:47:14 +1100",
    "category": "finance",
    "authors": [],
    "text": "Millman's advice to take down Sinner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/nsw/owner-abandons-plans-to-scrap-the-qvb-s-stained-glass-windows-20260121-p5nvrl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Owner abandons plans to scrap the QVB’s stained-glass windows",
    "publish_date": "Thu, 22 Jan 2026 12:44:19 +1100",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "Advertisement\n\nExclusive NationalNSWHeritage Owner abandons plans to scrap the QVB’s stained-glass windows Cindy Yin Updated January 22, 2026 — 12:44pm ,first published 11:01am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe owners of the Queen Victoria Building have scrapped a controversial plan to replace the building’s multicoloured glass windows with clear panes after a public backlash. In December, Vicinity Centres – the country’s second-largest retail landlord and co-owner of the QVB – lodged a development application with the City of Sydney seeking to replace the multicoloured glass on the Market Street ground-floor shopfronts with clear glass. The application to replace these stained-glass windows outside Market Street with clear glass has been abandoned. Louie Douvis The move sparked anger in the community over concerns it would damage the heritage character of the iconic building if the application was approved by the council’s planning panel. However, on Wednesday night, the retail giant quietly withdrew its development application before the exhibition period, accepting public submissions were slated to end on February 6.\n\nAdvertisement\n\n“We have listened carefully to community sentiment and recognise the strong connection many people have to this treasured icon and the importance placed on its historic character,” a Vicinity spokesperson told the Herald. “As responsible custodians, we take that feedback seriously and remain committed to preserving the QVB’s heritage. This decision reflects Vicinity’s commitment to act proactively, decisively, and respectfully in the best interests of the QVB and the broader community. “We have withdrawn the application to ensure the QVB continues to be celebrated, protected and enjoyed for generations to come.” The stained-glass windows Vicinity sought to replace in its application were refurbished in the 1980s, a reconstruction of the original neo-romanesque sandstone building that was erected in 1898.\n\nAdvertisement\n\nArtists who, decades ago, cut by hand thousands of pieces of glass for the refurbishment said the push to alter the building greatly saddened them. Related Article Exclusive\n\nCity life Rozlyn hand-cut 73,000 pieces of glass for the QVB. Now the landlord wants some removed Before backflipping, Vicinity Centres said in its proposal that the coloured glass created a “significant economic burden” to landlords and reduced the attractiveness and value of the space to prospective retailers, pointing to millions of dollars in lost revenue. It also argued that the coloured glass obscured views from the street, and that installing clear glass would provide clearer views into shops and highlight their double-height spaces. The City of Sydney’s planning portal has since been updated, and progress timelines on their website show the development application has been withdrawn.\n\nAdvertisement\n\nLord Mayor Clover Moore welcomed the reversal, and said she was glad the owners had listened: “This is one of our most important, treasured heritage buildings. As the city around it changes, it remains as a bold and significant piece of public infrastructure and an important layer of both our architectural history and cultural fabric.” Deputy Lord Mayor Jess Miller said it was a “real win for the planning process” and for the community. “It’s so important that we take good care of these gorgeous heritage buildings, and this is a really exciting outcome,” Miller said. Vicinity Centres acquired the QVB in 2018 and co-owns the building with Link REIT. They also own a raft of other shopping centres across the country, from Chatswood Chase and The Strand Arcade in Sydney, to Chadstone and the Emporium in Melbourne. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/culture/celebrity/doofus-director-text-messages-between-taylor-swift-and-blake-lively-revealed-20260122-p5nw30.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Felt like a bad friend’: Taylor Swift-Blake Lively text messages reveal friendship fallout",
    "publish_date": "Thu, 22 Jan 2026 12:39:37 +1100",
    "category": "finance",
    "authors": [
      "Nell Geraets"
    ],
    "text": "Advertisement\n\nCultureCelebrityTaylor Swift ‘Felt like a bad friend’: Taylor Swift-Blake Lively text messages reveal friendship fallout Nell Geraets Updated January 22, 2026 — 12:39pm ,first published January 22, 2026 — 10:15am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPop juggernaut Taylor Swift has once again been pulled into the legal battle between It Ends With Us co-stars Blake Lively and Justin Baldoni. Text messages between long-time friends Swift and Lively were unsealed on Tuesday (US time) amid the ongoing legal drama, which began in December 2024 when Lively filed a complaint against her co-star and director, accusing him of sexual harassment and running a smear campaign against her. Baldoni categorically denied all accusations against him. The trial is set for May. Private text messages between friends Taylor Swift and Blake Lively have been revealed amid Lively’s legal battle with Justin Baldoni. PA Wire/Getty In May 2025, Swift was subpoenaed as a witness in Baldoni’s $US400 million defamation countersuit – which has since been dropped – against Lively. A spokesperson for Swift said at the time this was designed to generate public interest by “creating tabloid clickbait instead of focusing on the facts of the case”. Though the subpoena was dropped later that month, Swift’s name has emerged again amid the legal mayhem. According to the unsealed messages, seen by this masthead, Lively spoke openly about the concerns she had while on set for the film adaptation of Colleen Hoover’s It Ends With Us. At one point, the actress referred to Baldoni as her “doofus director”. In December 2024, the close friends texted again shortly before the publication of a New York Times expose regarding Lively’s accusations against Baldoni and the film’s production company Wayfarer Studios.\n\nAdvertisement\n\nRelated Article Taylor Swift Why is Taylor Swift caught up in the Baldoni-Lively legal battle? “I think this bitch knows something is coming because he’s gotten out his tiny violin,” Swift texted Lively alongside a screenshot of a People article about Baldoni saying he’d been “sexually traumatised”. Swift later described the situation as “a horror film no one knows is taking place” and said Baldoni “needs to be beaten by his OWN words”. In the same conversation, Lively wrote to Swift: “Can you imagine feeling as confident as these predators that you’re going to always get away with it. Him accepting an award as an ally for women ... And Scooter going about [the] world with his head held high as he co-owns and funds a crisis PR company that silences women.” Scooter Braun, who was subpoenaed by Lively, was in a long-running feud with Swift over the ownership of her music. An earlier exchange in April 2023 appeared to show Lively asking Swift to praise Lively’s revised version of the script for It Ends With Us in front of Baldoni. Swift was allegedly on her way to meet the director at Lively’s New York apartment.\n\nAdvertisement\n\n“He’s a clown and thinks he’s a writer now,” Lively wrote. “So having the greatest living storyteller unknowingly echo to him how much you love what we’re doing (giving him credit as if he wrote them with me) will go such a long way.” According to the filing, Swift responded, “I’ll do anything for you!!” Taylor Swift and Blake Lively have been close friends since 2015. Getty The unsealed correspondence also revealed the impact the legal feud had on Swift and Lively’s decade-long friendship. “I have no reason to ask, but I donno, I’ve been feeling like I should … is everything OK?” Lively wrote to Swift in early December 2024. “I felt like a bad friend lately because I was such a sad sack who only talked about my own shit for months. You were generous to not only be the key person there for me during all of it, but also to let me off the hook for being so in it. But I still have a feeling something may not be right.” In response, Swift said her friend wasn’t wrong, but that it wasn’t “a big deal”.\n\nAdvertisement\n\nBlake Lively and Justin Baldoni starred alongside each other in It Ends With Us in 2024. AP “I think I’m just exhausted in every avenue of my life and in recent months had been feeling a little bit of a shift in the way you talk to me … I feel really bad saying anything about this because your texts have been so nice in their intent but your last few… it’s felt like I was reading a mass corporate email sent to 200 employees,” Swift wrote. “It feels awful to be in any way critical of any way you process what you’ve been going through but I just kinda miss my funny, dark, normal-speaking friend who talks to me as herself, not like. A plural unit.” Related Article Pop culture A bestselling author, a new novel, a cancer diagnosis … then, the disclaimers The pop star said Lively didn’t need to apologise, but implored her to “come back”. Sigrid McCawley, a member of Lively’s legal team, told CNN the unsealed evidence “shows the concerns of Ms Lively and others were documented in real-time as early as Spring 2023, and Wayfarer understood them as ‘sexual harassment’ concerns”.\n\nAdvertisement\n\n“The evidence also documents how Wayfarer refused to investigate, but instead attempted to ‘bury’ Ms Lively and others who spoke up through retaliation,” she said. In response, Baldoni’s lawyer Bryan Feldman said the evidence did not support the claims as a matter of law. “A simple read of the newly released message exchanges make the truth abundantly clear. We remain confident in the legal process and clearing the names of all of the Justin Baldoni parties,” he said, per CNN. Swift’s representative has been contacted for comment. Must-see movies, interviews and all the latest from the world of film delivered to your inbox. Sign up for our Screening Room newsletter.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-dip-wall-street-steadies-after-trump-says-he-won-t-use-force-to-take-greenland-20260122-p5nw10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Banks drive ASX higher; strong jobs figures boost rate hike chances",
    "publish_date": "Thu, 22 Jan 2026 12:37:08 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets Banks drive ASX higher; strong jobs figures boost rate hike chances Staff reporter Updated January 22, 2026 — 12:37pm ,first published January 22, 2026 — 5:18am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has shed some of its early gains after unexpectedly strong jobs figures increased the chances of an interest rate hike next month, while investors responded favourably to an easing in tensions over President Donald Trump’s push to take control of Greenland. The S&P/ASX 200 was 65 points, or 0.7 per cent, higher to 8847.9, with nine of 11 industry sectors in positive territory. The increase followed a rally on Wall Street overnight, after Trump dumped his threat to impose tariffs on several European countries because of their opposition to the US taking control of Greenland, saying he had a “framework for a future deal” on arctic security. Wall Street rallied on the latest developments in the stoush over Greenland. Bloomberg Labour force figures were released at 11.30am AEDT, showing that the economy added 65,200 jobs in December, pushing the jobless rate to 4.1 per cent, down from 4.3 per cent in November. AMP deputy chief economist Diana Mousina said the implied odds of a rise in official interest rates in February had lifted from 26 per cent to 56 per cent after the figures were published.\n\nAdvertisement\n\nFinancial stocks rose at the open then received a further boost from the jobs figures, with Commonwealth Bank (up 1.6 per cent), Westpac (up 1.1 per cent), National Australia Bank (up 2.6 per cent) and ANZ Bank (up 0.6 per cent) sharply higher in early afternoon trade. Among the miners, Rio Tinto added 1.1 per cent and BHP shed 0.5 per cent. Fortescue fell 4.4 per cent after it announced it shipped a record volume of iron ore in the six months to December 31. Gold miners retreated, with Northern Star falling 2.1 per cent and Evolution Mining 0.8 per cent lower. Energy stocks are higher as oil prices strengthened as traders assessed US President Donald Trump’s statement that the US had reached a “framework” for a deal on Greenland. Woodside Energy rose 2.7 per cent, while Santos added 4.1 per cent as it lifted fourth-quarter production by 5 per cent. Related Article Opinion\n\nWorld markets Melting down: Trump sent a warning by markets Stephen Bartholomeusz Senior business columnist On Wall Street, the S&P 500 rallied 1.2 per cent after Trump said the deal, “if consummated, will be a great one for the United States of America” and its allies in the North Atlantic region. The announcement triggered an immediate move higher in the stock market, which found solace earlier in the day after Trump ratcheted down his rhetoric and told business and government leaders in Europe that he would not use force to take “the piece of ice.”\n\nAdvertisement\n\nThe de-escalation in tensions helped the S&P 500 recover just over half of its 2.1 per cent drop from the day before and pull closer to its all-time high set earlier this month. The Dow Jones Industrial Average jumped 588 points, or 1.2 per cent, and the Nasdaq composite climbed 1.2 per cent. The Australian sharemarket is set to advance, with futures pointing to a gain of 47 points, or 0.5 per cent, at the open. The ASX shed 0.4 per cent on Wednesday. The Australian dollar is trading at US67.64¢ at 8.45am AEDT. Treasury yields also eased in the bond market in another signal of reduced worries among investors. Besides the progress on Greenland, they also got help from a calming of yields in Japan’s jumpy bond market. The value of the US dollar, meanwhile, clawed back some of its declines against other currencies after sliding the day before. Trump himself acknowledged how the US stock market sold off on Tuesday because of his desire for Greenland, but he called it “peanuts compared to what it’s gone up” in the first year of his second term and said it would go up further in the future. Trump has a history of making big threats that send financial markets sliding, only to pull back later and reach deals that are seen as less bad for the economy or for inflation than his initial suggestion.\n\nAdvertisement\n\nOn one hand, the pattern has given rise to the “TACO” acronym suggesting “Trump Always Chickens Out” if financial markets react strongly enough. On the other, Trump has ultimately struck deals that outsiders may have earlier considered unlikely, ones that he’s crowed about later. The most obvious example is Trump’s announcement of high tariffs on “Liberation Day,” which eventually led to trade deals with many of the world’s major economies. Helping to lead the US stock market Wednesday was Halliburton. The oil field services company rose 4.1 per cent after reporting a stronger profit for the latest quarter than analysts expected. United Airlines climbed 2.2 per cent after likewise reporting a better profit for the final three months of 2025 than analysts expected. CEO Scott Kirby said that the airline’s strong momentum in revenue is continuing into 2026. They helped offset a 2.2 per cent drop for Netflix. The streamer sank even though it reported a stronger profit than expected. Investors focused instead on its slowing subscriber growth and its lower-than-expected forecast for profit in the current quarter. Kraft Heinz sank 5.7 per cent after Berkshire Hathaway warned investors that it may be interested in selling its 325 million shares in the food giant that former CEO Warren Buffett helped create in 2015.\n\nAdvertisement\n\nBerkshire took a $US3.76 billion ($5.6 billion) write-down on its Kraft-Heinz stake last summer. Buffett said last fall that he was disappointed in Kraft Heinz’ plan to split the company in two, and Berkshire’s two representatives resigned from the Kraft board last spring. All told, the S&P 500 rose 78.76 points to 6,875.62. The Dow Jones Industrial Average climbed 588.64 to 49,077.23, and the Nasdaq composite gained 270.50 to 23,224.82. In the bond market, the yield on the 10-year Treasury eased to 4.25 per cent from 4.30 per cent late Tuesday. That’s almost all the way back to the 4.24 per cent level where it was at on Friday. Related Article Updated\n\nTrump diplomacy Trump retreats on Greenland threats, dropping tariffs and ruling out force as future deal agreed That was before Trump threatened to impose 10 per cent tariffs on Denmark, Norway, Sweden, Germany, France, the United Kingdom, the Netherlands and Finland for opposing US control of Greenland. That would have been on top of a 15 per cent tariff specified by a trade agreement with the European Union that has yet to be ratified.\n\nAdvertisement\n\nIn stock markets abroad, indexes were mixed in mostly modest movements across Europe and Asia. Japan’s Nikkei 225 slipped 0.4 per cent. The country’s prime minister, Sanae Takaichi, has called a snap election for Feb. 8, which had sent yields of long-term government bonds to record levels and raised worries across global financial markets. The expectation is that Takaichi, who is capitalizing on strong public support ratings, will cut taxes and boost spending and increase the government’s already heavy load of debt. After surging as high as 4.22 per cent on Tuesday, the yield on the 40-year Japanese government bond pulled back to 4.05 per cent Wednesday. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nShares\n\nWall Street",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/australian-open-2026-every-aussie-tennis-player-who-s-won-in-week-one-so-far-20260119-p5nv8b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After a brutal first week for Aussies at the AO, six remain. One is about to face Sinner",
    "publish_date": "Thu, 22 Jan 2026 12:26:11 +1100",
    "category": "sports",
    "authors": [
      "Staff Reporters"
    ],
    "text": "Follow our live coverage of day five of the 2026 Australian Open here.\n\nThe first week of the 2026 Australian Open is underway and some of our best home-grown athletes have already advanced into the later rounds. Here’s a list of every Australian tennis player in the men’s and women’s singles who won their matches in week one.\n\nThis story will be updated every morning with the previous night’s results.\n\n\n\nAre there any Australian players in action today?\n\nIn the women’s singles, Taylah Preston has her second round match against 13th seed Linda Noskova on the Show Court Arena, scheduled for around lunchtime.\n\nMaddison Inglis will face Germany’s Laura Siegemund at around 1pm on Stadium Australia.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/environment/helicopter-retrieves-cars-swept-out-to-sea-20260122-p5nw6d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Helicopter retrieves cars swept out to sea",
    "publish_date": "Thu, 22 Jan 2026 12:06:37 +1100",
    "category": "sports",
    "authors": [],
    "text": "Helicopter retrieves cars swept out to sea\n\nMore than a dozen cars were extricated from pounding surf after flash floods swept them out to sea on the Cumberland and Wye Rivers last week.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://au.news.yahoo.com/aph-evacuated-first-responders-arrive-233938135.html",
    "title": "Reason for parliament evacuation revealed",
    "publish_date": "2026-01-22T02:00:56Z",
    "category": "finance",
    "authors": [],
    "text": "Australia’s federal parliament house was evacuated and all visitors and staff barred from entering the premises.\n\nParliamentary and emergency services shuttered the building’s Senate wing in Canberra on Thursday morning after reports of smoke.\n\nJust after 10am, alarms began blaring inside the building with staff ordered to prepare to evacuate.\n\nA small number of staff and reporters were ordered to wait outside the entrance before being directed to an evacuation area.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nEmergency tape reading “danger do not enter” was placed at the entrance.\n\nParliament House in Canberra has been evacuated due to an emergency situation. Picture: NewsWire\n\nACT Emergency Services Agency responded to the incident.\n\nA spokesperson said emergency services were called at 9.40am after reports of “smoke at Parliament House”.\n\n“Upon investigation, crews believe there was an electrical fault,” the spokesperson said.\n\nEmergency service had since left the scene.\n\nNo injuries were reported and the incident last about one hour.",
    "source": "Yahoo",
    "cluster_id": 31
  }
]