[
  {
    "url": "https://www.9news.com.au/national/australia-science-neuroblastoma-treatment-cancer/478ddfef-1770-44e7-9ad9-c872716a6326",
    "title": "Drug that could be a potential breakthrough in deadly childhood cancer",
    "publish_date": "Fri, 28 Nov 2025 20:00:03 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "A drug already approved for cancer treatment could now help treat a deadly childhood cancer, Australian research has revealed.\n\nNeuroblastoma is a tumour that develops from nerve cells glands above the kidneys, or along the spine, chest and abdomen; it occurs commonly in children, and is deadly in nine out of 10 cases when children relapse.\n\nThis is most common in high-risk neuroblastoma, where 15 per cent of children do not respond to treatment, and half of those who do respond initially will see their cancer return.\n\nNeuroblastoma is a deadly cancer that can affect children as young as two-years-old. (Garvan Institute)\n\nThis is because standard drugs used in chemotherapy rely on the same cellular switch, called the JNK pathway, to kill the cancer cells.\n\nIn relapsed tumours, the JNK cells can stop working, making treatments ineffective and causing the tumours to spread with deadly consequences.\n\n\"The statistics once patients get to that point are devastating for families,\" Associate Professor David Croucher said.\n\nHowever, researchers at the Garvan Institute have found a drug called romidepsin can help reduce tumour growth and the chances of the deadly cancer returning, helping more children survive.\n\nREAD MORE: Australia Post reveals deadline for mailing Christmas parcels\n\nThe drug is already approved to treat other cancers like lymphomas, and the result of the study published in Science Advances is promising, according to researchers.\n\n\"This represents a big step forward,\" Croucher said.\n\n\"By finding drugs that don't depend on the JNK pathway, we can still trigger cancer cell death even when this usual route is blocked.\"\n\nThe trials were conducted on animal models, and the next step is to use clinical trials.\n\nCrocuher insists the benefits will be of the families who could be helped fight the devastating disease.\n\n\"Behind every statistic is someone's loved one,\" Croucher said. \"Understanding these molecular mechanisms gives us hope we can develop more effective treatments for patients and their families who currently face limited options – and that's what drives us every day.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/sydney-station-has-mural-removed-over-ai-slop-calls/46ef6f6f-e97a-4975-a4f4-94c19a07ce49",
    "title": "Sydney train station removes 'AI slop' mural after backlash",
    "publish_date": "Fri, 28 Nov 2025 04:41:13 +0000",
    "category": "entertainment",
    "authors": [
      "Nov"
    ],
    "text": "A﻿ mural at a Sydney train station has been removed after being labelled \"AI slop\".\n\nAt first glance, the scene at Redfern train station depicting an Aussie Christmas appears to be done by an artist, speckled with icons of Australia, such as thongs, Santa and beach umbrellas.\n\nHowever, upon closer inspection, people noticed the art appeared to have been created by artificial intelligence,﻿ with telltale signs including a kangaroo with the head of a koala and an Australian flag floating mid-air.\n\nThe train station art was labelled \"AI slop\". (Nine)\n\nA bandicoot-type rodent with its limbs disconnected from its body was also spotted on the mural﻿.\n\nThe mural garnered attention online after being slammed as \"AI slop\" on Reddit's r/sydney﻿ board.\n\nThe term refers to low-quality content created by generative AI, which often contains errors.﻿\n\n\"Sydney Trains' Redfern Station staff have displayed artwork for several years to help create a positive end-of-year atmosphere for our customers,\" a Transport for NSW spokesperson said in a statement.\n\n\"We received feedback about this year's display and, in response, have decided to remove the artwork,\" the spokesperson said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/community-shark-bite-kit-first-aid-life-saving-device-rolled-out-on-beaches-emergency-news/945f2ef2-a9d5-4a96-91d2-bd63263a5415",
    "title": "Surfers and survivors call for life-saving Shark Bite Kits on all Aussie beaches",
    "publish_date": "Fri, 28 Nov 2025 03:30:15 +0000",
    "category": "sports",
    "authors": [
      "Nov"
    ],
    "text": "Surfers and shark attack survivors are calling for government or corporate funding to roll out life-saving emergency response kits across all Australian beaches.\n\nThe Community Shark Bite Kits, designed to help control life-threatening bleeding, were designed by Danny Schouten, after his friend Kai McKenzie almost died from being bitten by a shark while surfing in Port Macquarie in 2024.\n\n\"It was by the grace of a man... walking his dog on the beach that day, who was trained in trauma control and used his dog lead to save Kai's life,\" Schouten said.\n\nREAD MORE: Couple filmed dolphins on GoPro before deadly shark attack\n\nA Shark Bite Kit, bolted to a tree on a beach in northern New South Wales. (Supplied)\n\n\"And I thought, we need to have one of these kits on every one of our beaches so it's not left up to chance next time.\"\n\nTen kits were initially rolled out in northern NSW last year and now there's 150 on beaches across NSW, Queensland, South Australia and Western Australia.\n\nThe inexpensive kits contain ﻿a tourniquet, two conforming bandages, two large dressings, an emergency thermal blanket, gloves, a whistle and step-by-step instructions on how to treat a shark bite.\n\nThe kits contain ﻿a tourniquet, two conforming bandages, two large dressings, an emergency thermal blanket, gloves, a whistle, and step-by-step instructions on how to treat a shark bite. (Supplied)\n\nSchouten said his local community, which has seen multiple shark attacks, immediately jumped behind the project but interest was now also coming from further afield.\n\n\"The wider community, the surfing community is right behind this,\" he said.\n\n\"We know we're entering the unknown.﻿\n\n\"There's a lot of people who will say 'we don't want to cull', 'we don't want nets'.\n\n\"There's no right mitigation ﻿strategy, only preparation.\"\n\nHe said a tourniquet applied within seconds could be the difference ﻿between someone surviving or succumbing to a shark attack.\n\n\"We live in a community where our mums, our dads, our friends, our brothers, they surf and if it's your friend, it's your brother, I pray that the place that they're surfing has one of these kits.\n\n\"﻿Someone's life, after being attacked by a shark, has minutes... at most before you bleed out.\"\n\nREAD MORE: Hong Kong fire death toll rises as firefighters continue to fight burning buildings\n\nShark attack survivors Kai McKenzie and Toby Begg (front) with GoFundMe CEO Tim Cadogan and Shark Bite Kit founder Danny Schouten (back). (Supplied)\n\nMcKenzie said he was fortunate to have had someone on the beach with trauma experience on the day he was bitten - but not everyone would be so lucky.\n\n\"﻿I was lucky to have someone with such experience to save me, but there will come a day where that won't be the case and a Shark Bite Kit would help the chances of surviving dramatically,\" he said.\n\nSchouten is currently fundraising on GoFundMe to expand the project, with the goal to see a kit on every single beach across the country.\n\n\"Ideally, we'd have the government's support... funding from businesses or other ventures to be able to get behind it and put one everywhere,\" Schouten said.\n\n\"﻿It's about Australian beaches being well prepared for when these attacks happen and making our coastline a safer place for everyone.\n\n\"We're not going to stop doing what we love, so we just have to be better prepared.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/black-friday-sales-australians-opting-out-reader-poll-exclusive/efe64c24-0c7f-43ae-bba2-f2d6d2b45e45",
    "title": "No one could escape these two words for weeks. Now Aussies are opting out",
    "publish_date": "Fri, 28 Nov 2025 03:21:59 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Exclusive: They're the two words that have been clogging up email inboxes and plastered across storefronts for weeks: Black Friday.\n\nBut a nine.com.au reader poll has now revealed that almost half of Australians are opting out of the massive Black Friday sales.\n\nOf the 416* respondents, nearly 50 per cent said that they didn't plan to spend a single cent in the sales.\n\nREAD MORE: Couple filmed dolphins on GoPro before deadly shark attack\n\n﻿\"If you have enough disposable income then yes, you could get bargains,\" one said.\n\n\"But it's easy to get caught and buy things you don't really need.\"\n\nAbout 47 per cent of readers had already bought something or planned to buy something in the Black Friday sales.\n\nFewer than 10 per cent were on the fence.\n\nMany said they would only shop in the Black Friday sales if the discount was high and the item was something they actually needed.\n\n\"If I am after something specific and I have tracked the prices for it during the year, and there is a definite discount, then maybe,\" one said.﻿\n\nThey're the two words that have been clogging up email inboxes for weeks: Black Friday. (Getty)\n\nSome respondents voiced distrust in Black Friday sales, stating that it's hard to tell if you're actually getting a bargain or not.\n\nOthers admitted they were wary of retailers that may have inflated prices before the Black Friday sales﻿ to make discounts seem better than they are.\n\nThat isn't surprising, given Australian retailers' track record with Black Friday sales.\n\nThe ACCC put retailers on notice for misleading or deceptive sales advertising last week and companies caught breaking the rules can face investigations and fines.\n\nMichael Hill, My House and Hairhouse online paid penalties earlier this year for allegedly making false and misleading representations about their Black Friday sales in 2024.\n\nExamples of the type of advertising the ACCC has warned retailers against using. (ACCC)\n\n\"Retailers and marketers want people to buy more than they need,\" University of Melbourne law professor Jeannie Marie Paterson previously told nine.com.au.\n\n\"People who run marketing campaigns have studied psychology [and] we need to realise that they know more about us than we know about ourselves, so just beware.\"\n\nBut the warnings haven't deterred everyone.﻿\n\nOf those planning to shop the sales, just one in 10 planned to keep their spending under $100.\n\nAlmost one in five planned to spend between $101 and $250﻿.\n\n﻿About 12 per cent were budgeting $251 to $500 for their Black Friday purchases, and 16 per cent were planning to spend over $500.\n\nBut is all the spending really worth it?﻿\n\nJust over two in five readers said the Black Friday sales are worth the money, while just under two in five said they're not.\n\nThat left about one in five undecided, at least this year.﻿\n\n\"﻿If you really need the item or it's a gift for Christmas, you can save some money, but I don't buy things just for the sake of it,\" one person wrote.\n\n*The nine.com.au poll, which runs once a fortnight, canvases the views of the Nine audience on 9Nation, which is an online community of our readers and viewers.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/australia-public-holidays-2026-how-to-maximise-your-annual-leave-state-by-state-guide/84a48e89-bc6f-4799-a502-95e39eb9a890",
    "title": "Turn 20 days off into 53 with this simple annual leave trick",
    "publish_date": "Fri, 28 Nov 2025 00:51:13 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "﻿Planning holidays in advance can help Australians transform the typical 20-day annual leave entitlement into more than 50 days off in 2026.\n\nBy carefully choosing dates around Christmas and New Year, Australia Day, Easter, the King's Birthday, and Labour Day (or equivalent state/territory holiday), Aussie workers who typically work Monday to Friday can clock up 53 days off.\n\nAnd that's before you factor in specific regional public holidays.﻿\n\nHere are all the public holidays for 2026, plus tips to make the most of your annual leave next year.﻿\n\nAustralia's public holidays by state and territory for 2026\n\nJanuary\n\nBook four days of leave from January 27 to 30 and get nine days off between Saturday, January 24 and Sunday, February 1 (all states and territories).\n\nPublic holidays for the month fall on: ﻿\n\nThursday, January 1: New Year's Day\n\nMonday, January 26﻿: Australia Day\n\nFebruary\n\nBook four days of leave from February 10 to 13 for nine days off between Saturday, February 7 and Sunday February 15 (parts of Tasmania only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, February 9: Royal Hobart Regatta (parts of Tasmania)\n\nMarch\n\nBook four days of leave from March 3 to 6 for nine days off between Saturday, February 28 and Sunday, February 8 (WA only).\n\nBook ﻿four days of leave from March 10 to 13 for nine days off between Saturday, March 8 and Sunday, March 15 (ACT, SA, Tasmania and Victoria only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, March 2: Labour Day (WA)\n\nMonday, March 9: Canberra Day (ACT), Adelaide Cup Day (SA), Eight Hours Day (Tasmania), Labour Day (Victoria)\n\nMake the most of the last of the warm weather with some extra time off before winter. (Getty)\n\nApril\n\nBook eight days of leave from March 30 to April 2 and from April 7 to 10 for 16 days off between Saturday, March 28 and Sunday, April 12 (all states and territories).\n\nBook another four days of leave from April 28 to May 1 for nine days off between ﻿Saturday, April 25 and Sunday, May 3 (WA only).\n\nPublic holidays for the month fall on: ﻿\n\nFriday, April 3: Good Friday\n\nSaturday, April 4: Easter Saturday\n\nSunday, April 5: Easter Sunday\n\nMonday, April 6: Easter Monday\n\nSaturday, April 25: ANZAC Day\n\n﻿Monday, April 27: ANZAC Day day in lieu (WA)\n\nMay\n\nBook four days of leave from May 5 to 8 for nine days off between Saturday, May 2 and Sunday, May 10﻿ (NT and Queensland only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, May 4: May Day (NT, Queensland)\n\nJune\n\nBook four days of leave from June 2 to June 5 for nine days off between Saturday, May 30 and Sunday, June 7﻿ (ACT and WA only).\n\nBook four days of leave from June 9 to June 12 for nine days off between Saturday, June 6 and Sunday, June 14﻿ (ACT, NSW, NT, SA, Tasmania and Victoria).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, June 1: Reconciliation Day (ACT), Western Australia Day (WA)\n\nMonday, June 8: King's Birthday (ACT, NSW, NT, SA, Tasmania, Victoria)\n\nThe June long weekend is the perfect opportunity to stretch your annual leave. (Getty)\n\nJuly\n\nThere are no public holidays in July.﻿\n\nAugust\n\nBook four days of leave from August 4 to 7 for nine days off between Saturday, August 1 and ﻿Sunday, August 9 (NT only).\n\nBook four days of leave from August 10 to 11 and 13 to 14 for nine days off between Saturday, August 8 and ﻿Sunday, August 16 (Brisbane area of Queensland only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, August 3: Picnic Day (NT)\n\nWednesday, August 12: Royal Queensland Show (Brisbane area only)\n\nSeptember\n\nBook four days of leave from September 29 to October 2 for nine days off between Saturday, September 26 and ﻿Sunday, October 4 (WA only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, September 28: King's Birthday (WA)\n\nOctober\n\nBook four days of leave from October 6 to 9 for nine days off between Saturday, October 3 and Sunday, October 11 (ACT, NSW, SA and Queensland only).\n\n﻿Book four days of leave from October 23 to 26 for nine days off between Saturday, October 20 and Sunday, October 28 (Tasmania only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, October 5: Labour Day﻿ (ACT, NSW, SA), King's Birthday (Queensland)\n\nThursday, October 22: Royal Hobart Show (parts of Tasmania)\n\nQueenslanders take the King's Birthday long weekend in October. (Getty Images/iStockphoto)\n\nNovember\n\nBook ﻿four days of leave from November 3 to 6 for nine days off between Saturday, October 31 and Sunday, November 8 (parts of Tasmania only).\n\nBook ﻿four days of leave on November 2 and November 4 to 6 for nine days off between Saturday, October 31 and Sunday, November 8 (Victoria only).\n\nPublic holidays for the month fall on: ﻿\n\nMonday, November 2: Recreation Day (parts of Tasmania)\n\nTuesday, November 3: Melbourne Cup (Victoria)\n\nDecember\n\nBook ﻿eight days off from December 21 to 24 and December 28 to 31 for 16 days off between Saturday, December 19 and Sunday, January 3, 2026 (all states and territories).\n\nPublic holidays for the month fall on: ﻿\n\nThursday, December 24: Christmas Eve - 6pm to midnight (Queensland), 7pm to midnight (NT, SA)\n\nFriday, December 25: Christmas Day\n\nSaturday, December 26: Boxing Day (all states and territories except Tasmania)\n\nMonday, December 28: Boxing Day (day in lieu)\n\nThursday, December 31: New Year's Eve - 7pm to midnight (NT, SA)\n\nFriday, January 1, 2027: New Year's Day﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/girl-guides-western-australia-celebrating-110-years/106001684",
    "title": "Celebrating 110 years of Girl Guides in WA",
    "publish_date": "Sat, 29 Nov 2025 01:40:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Girl Guides has been running in Western Australia for 110 years, and it is still going strong with 1,200 youth members across the state, aged from five to 17.\n\nOver that time, some things have changed, including its promise and its uniform, and it is no longer selling biscuits as a fundraiser.\n\nHowever, Great Southern region Girl Guide leader Tammy Flett said some elements, like camps, remained a key part of the program.\n\nTwo new Girl Guides at their promise ceremony. (ABC Great Southern: Rosemary Murphy)\n\n\"For my unit, we drag out the old-fashioned canvas tents that I had as a guide, and probably generations of guides before us had,\" she said.\n\nSienna Smith, 11, from Albany's Weerlara Girl Guides, said there had been some adventures at camp.\n\n\"In my tent, in my section, towards the very end of the night, right in the corners, my tent decided to have these massive puddles, and half my clothes were full-on drenched,\" she said.\n\n\"Luckily, I still had some dry stuff.\"\n\nA group of Girl Guides making slime at their meeting. (ABC Great Southern: Rosemary Murphy)\n\nEarlier this year, members of Albany's Weerlara Girl Guides joined thousands of others at a jamboree in Queensland.\n\nAmong them was 11-year-old Emily Gilpin, who said the guides really enjoyed the \"boogie\" tent and getting to know Girl Guides from other areas.\n\nTammy Flett says being part of Girl Guides has led to great opportunities. (ABC Great Southern: Rosemary Murphy)\n\n\"We had this really cool quokka surfing badge to represent WA, and we could swap those for other badges from different places,\" she said.\n\n\"It was a really fun time.\"\n\n'Girl-led' organisation\n\nMs Flett said a major reason for the longevity of Girl Guides was that it was a \"girl-led\" organisation, allowing the interests in each branch to shape the activities and events.\n\n\"If the girls are really into the outdoors, our program is outdoor-based,\" she said.\n\nA Girl Guides camping trip in Albany 1929. (Supplied: WA Girl Guides)\n\n\"We still cover eight fundamentals, but it's done with an outdoor slant to it.\"\n\nMembers also have a say in broader changes in the organisation.\n\n\"No change is done without extensive engagement with all the members, ranging from the five-year-olds right up to the older adults we have,\" Ms Flett said.\n\nDifferent Girl Guides uniforms on display during a celebration of 110 years of Girl Guides in Bunbury. (ABC South West: Anna Cox)\n\n\"When we had a massive uniform change leading up to our centenary, parents and the members got the opportunity to say what was important to them.\"\n\nLasting connection\n\nThe Bunbury branch was one of the first to open in November 1915, and held a celebration earlier this month to mark the anniversary.\n\nAmong those attending was Margaret Short, who joined the Bunbury Girl Guides as a Brownie when she was six and is still involved 80 years later.\n\nGirl Guides attending an event in Busselton in 1930. (Supplied: Girl Guides WA)\n\n\"It's just a wonderful movement, and I think any child who wants to join is very happy,\" Ms Short said.\n\n\"I have friends I met here when I was 15.\"\n\nShe is not alone in having a lasting connection to the Girl Guides — there are nine Trefoil Guilds across WA, made up of women over the age of 18.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/max-mckenzie-nut-allergy-coronial-inquest/106022338",
    "title": "'He deserved to live': Was Max's death from allergies preventable?",
    "publish_date": "Sat, 29 Nov 2025 01:32:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Max McKenzie was the kind of teenager who wanted to be part of everything.\n\nHe loved kayaking, swimming and skiing. He threw himself into performing arts, played in the orchestra and sang in a choir.\n\nHe joined cadets and once even built his own computer.\n\n\"He was such a vibrant, big character,\" his mother Tamara McKenzie said.\n\nAt 15, Max lived life to the fullest.\n\nBut he was also surrounded by a constant, invisible danger.\n\nThe Melbourne teenager had a severe allergy to nuts and carried an adrenaline injector, or EpiPen.\n\nMax McKenzie has been described as a vibrant, active teenager who lived life to the fullest. (Supplied: AMAX4)\n\nOn August 6, 2021, he was forced to use it after accidentally ingesting walnuts at a relative's house.\n\nMax began displaying signs of anaphylaxis and was given further adrenaline when paramedics arrived. He suffered a seizure and, once at the Box Hill Hospital, staff performed emergency surgery to intubate him.\n\nBy the afternoon, he had suffered a severe brain injury from oxygen deprivation.\n\nHe was transferred to the Alfred Hospital and died 13 days later after going into cardiac arrest.\n\nFamily feels 'completely let down'\n\nFour years on, a Victorian coroner is examining if Max's death was preventable and whether paramedics and doctors at the Box Hill Hospital provided appropriate care.\n\nOn the final day of the inquest, Max's devastated parents stepped into the witness box.\n\nHis mother said she felt \"completely let down by our health care system\".\n\nMs McKenzie told the court that as Max was loaded into the ambulance, he said he was going to die.\n\n\"I naively told him he wasn't,\" she said.\n\n\" I now must live with knowing I got that so wrong. \"\n\nMax McKenzie's parents, Ben and Tamara McKenzie, say their family has been let down by the health care system. (Supplied: AMAX4)\n\nShe described \"complete chaos\" in the hospital cubicle as staff decided on the best way to treat him.\n\nMax's father, Ben McKenzie, an emergency doctor, rushed from South Melbourne and found himself helping to resuscitate his own son.\n\n\"I should never have had an opportunity to treat Max in any way because it should have been done before I got there,\" he said.\n\nAllergies on the rise\n\nNearly one in three Australians — about eight million people — now have some form of allergic disease, according to research published in August.\n\nAllergies can be mild or life-changing, and can appear in many forms, including asthma, hayfever, eczema or reactions to food, medication and insect bites.\n\nIn a report, the Australasian Society of Clinical Immunology and Allergy and the National Allergy Council found the diseases cost the Australian health system and economy $18.9 billion in 2024.\n\n\"We are known as the global capital of allergic disease,\" said Sarah Emery, the head of support group Allergy & Anaphylaxis Australia.\n\n\"I don't think that there's one specific factor that can be pointed to … they're all really speculatory.\"\n\nDeadly cases like Max's are rare but not isolated.\n\nJames Tsindos coronial inquest James Tsindos, 17, was unaware the food he ordered from an online app contained nuts before he died from anaphylaxis, a Victorian coroner has heard.\n\nThe Murdoch Children's Research Institute estimates about 20 Australians die from anaphylaxis each year and more than 12,000 are hospitalised.\n\nTwo months before Max's death, Melbourne teenager James Tsindos died after eating a takeaway burrito bowl containing cashews.\n\nHis case remains under investigation, with the coroner considering whether restaurants and food delivery apps need stronger warnings.\n\nMs Emery says awareness and food labelling have improved in recent years, but more progress is needed. Consumers also need confidence to ask questions.\n\n\"We have a saying to our consumers, 'Always ask, always tell',\" she said.\n\nShe believes the health system is generally well prepared to treat severe reactions, crediting the Acute Anaphylaxis Clinical Care Standard introduced in 2021.\n\nThe guidelines call for anaphylaxis to be detected quickly, adrenaline to be injected without delay and to be kept on hand for further use, patients to be laid flat on their backs, constant clinical observation, and a comprehensive discharge plan.\n\nCould Max's death have been prevented?\n\nThe inquest heard that in some instances, allergic reactions were simply overwhelming even with rapid medical intervention.\n\nWhether Max's case falls into that category is up to the coroner to decide.\n\nLawyers for the McKenzie family argued Max was \"robbed\" due to \"substandard care\" from paramedics and delays at the Box Hill Hospital.\n\nBut others do not see it in such black and white terms.\n\nAn expert panel was divided on whether Max's death was preventable after the walnuts were ingested.\n\nTamara McKenzie told the inquest the response at the hospital was chaotic, while Ben McKenzie gave evidence about having to help resuscitate his own son. (ABC News: Kristian Silva)\n\nLawyers representing Eastern Health, which oversees the Box Hill Hospital, backed their staff and called criticism \"unfair\".\n\n\"The chance of death was high, irrespective of his treatment course,\" Eastern Health barrister Sebastian Reid said.\n\nDr David Armstrong and Dr Stephen Rashford believed Max could not have been saved.\n\nDr Andrew Numa said the death was \"potentially preventable\".\n\nParamedic Tony Hucker did not give an opinion but agreed the \"best care\" wasn't provided.\n\nOnce Max reached Box Hill Hospital, the experts agreed that intubation was crucial — and that it took too long.\n\nProfessor Armstrong argued that treatment was \"always trying to catch up\".\n\nProfessor Numa said a 10-minute delay \"sealed\" Max's fate.\n\n\"I think he was denied the best opportunity for survival. He arrived at Box Hill Hospital with a pulse,\" he said.\n\n\"He had a compromised airway, and the delay in addressing that made his situation irretrievable.\"\n\nThe inquest heard there were delays intubating Max McKenzie at Box Hill Hospital. (ABC News: Patrick Rocca)\n\nA barrister assisting the coroner, Rachel Ellyard, also said there was an \"unreasonable delay\" in intubating Max, but noted that his condition was so severe that a different response was unlikely to have saved him.\n\nThe McKenzie family's barrister, Stanley Wallace, criticised Ambulance Victoria because one of the first paramedics on scene was a graduate who needed extra guidance and was not qualified to drive under \"Code One\" conditions.\n\nBut Ambulance Victoria's barrister, Naomi Hodgson, said paramedics' decisions were appropriate in a \"rapidly evolving situation\". She did acknowledge, however, that adrenaline was not administered in line with clinical practice guidelines.\n\n'He deserved to live'\n\nCoroner David Ryan is expected to hand down recommendations next year.\n\nOn Friday, Max's parents described their son as the most incredible child, brother and friend anyone could have asked for.\n\n\"He was going to be an asset to our society, and he deserved to live. He was talented, charismatic, and 15 years old,\" Dr McKenzie said.\n\nThe McKenzies have set up Live to the Max to improve allergy education and awareness. (ABC News: Kristian Silva)\n\nSince his death, the family has dedicated itself to preventing similar tragedies.\n\nTheir organisation, Live to the Max, runs allergy education programs in schools.\n\nDr McKenzie is also completing a PhD on anaphylaxis and asthma resuscitation and has trained thousands of health professionals globally.\n\n\"I feel a special and heavy burden that I must use the knowledge I have to advocate for positive change,\" he said.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/oscar-piastri-pole-position-for-qatar-f1-sprint/106081654",
    "title": "'Nice to be back' on top, Piastri says as he claims Qatar sprint pole",
    "publish_date": "Sat, 29 Nov 2025 00:43:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "Oscar Piastri is perfectly placed to cut into McLaren teammate Lando Norris's 24-point Formula 1 championship lead after qualifying in pole position for the Qatar sprint race.\n\nNorris is third on the grid behind Piastri and Mercedes's George Russell, while Red Bull four-time world champion Max Verstappen, level with Piastri in the standings, will start Saturday's race in sixth position.\n\n\"Nice to be back. Thanks everybody,\" a happy Piastri said over the team radio as he returned to form after a steady decline.\n\nThere are 58 points remaining to be won, eight of them in the 100km sprint, from the final two rounds in Qatar and Abu Dhabi.\n\nThe sprint race starts at 1am AEDT on Sunday.\n\nIf the three championship contenders remain in their qualifying positions, the Australian will move two points closer to Norris in the standings and pull five points clear of Verstappen.\n\nPiastri — who has won the last two sprints in Qatar — set a best time of one minute and 20.055 seconds, 0.032 quicker than Russell, who knocked Norris down to third.\n\n\"I'm pretty happy. It has been a while since I've been on P1,\" the Australian said.\n\n\"It almost went horribly wrong at turn four. Turning left in a right-hand corner is never a good thing. I lost two-tenths. At that point I thought that lap was over, but I kept pushing and was able to find some more time.\"\n\nNorris said he made a mistake in the final corner and was more or less resigned to his fate in the sprint.\n\n\"I would be stupid not to try and win but it's impossible to overtake so I think I will probably finish P3,\" he said.\n\n\"Getting past George Russell on the line is probably the best I can hope for.\"\n\nQatar is the penultimate race weekend of the season, which ends in Abu Dhabi. (Getty Images: Mark Sutton/Formula 1)\n\nVerstappen complained his car was \"bouncing like crazy\", an observation that echoes of the previous race in Las Vegas where both McLarens suffered the 'porpoising' phenomenon and were disqualified for excessive skid wear.\n\n\"Just really bad bouncing and very aggressive understeer that would shift into oversteer at high-speed,\" the Dutch driver said.\n\n\"We tried to change a few things on the wheel but it never really worked, so it made it quite tricky. With this balance, it will not be a lot of fun. It will be more about trying to survive I guess and make some changes going into qualifying.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/claims-standards-slipping-at-ameb-as-regions-revolt/106074654",
    "title": "Parents fear music exam 'gold standard' slipping in parts of Australia",
    "publish_date": "Sat, 29 Nov 2025 00:08:25 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Pianist Sarah Milnes thinks there are good reasons why kids should learn how to play an instrument.\n\nMost obviously, she says, it helps them unlock the joys of music.\n\nThere are proven links between music education and cognitive development — from language and memory to reading and maths.\n\nThe standards applied by Australia's top music exams body are coming into focus. ( )\n\nBut, simply, Ms Milnes believes learning how to play an instrument makes children better people.\n\n\"Music gives you a lot of grounding,\" Ms Milnes says.\n\n\" I think it's a skill that you can carry through your life. \"\n\nA golden crown slipping?\n\nIt's for those reasons Ms Milnes enrolled her daughter, Evelyn, in violin classes a few years ago.\n\nThe family lives in the farming town of Mount Barker, about 360 kilometres south of Perth, and travels to the port city of Albany, 50km away, for Evelyn's lessons.\n\n\"There is a bit of a finger in the back in terms of getting her to practise for now,\" Ms Milnes jokes.\n\nSarah Milnes has enrolled her daughter into violin lessons in Albany. ( )\n\nThey live in a region with a nationally recognised string instrument program, with more than 350 students learning the violin, viola or cello.\n\nEvelyn, Ms Milnes says, is \"learning very well\".\n\nSo well that she is being assessed by a body called the Australian Music Examination Board (AMEB), considered to be the gold standard of music testing across the country.\n\nBut Ms Milnes worries its standards are eroding.\n\n\"The standard that the AMEB has always upheld itself to be, and I've always had faith in … is slipping,\" she says.\n\n\"I think that if those standards are not upheld, then what's the point of doing these big exams that involve preparing for hours and hours?\"\n\nMike Hyder has been teaching students the violin for 30 years in Albany. ( )\n\nLearning to play an instrument is linked with better neurological development. ( )\n\nAt the heart of such concerns are what parents like Ms Milnes and some music teachers say is a growing divide between city and regional students.\n\nMike Hyder is a music tutor in Albany, where he has specialised in teaching students string instruments such as the violin for three decades.\n\nMike Hyder says it's not unusual for the AMEB to send generalist examiners to assess students sitting its exams, but he argues it's typically only been done for beginner and lower grades. ( )\n\nMr Hyder claims the AMEB has been sending general examiners from Perth to assess high-level students who require a very specialised treatment.\n\nMr Hyder says it's not unusual for the AMEB to send generalist examiners to assess students sitting its exams, but he argues it's typically only been done for beginner and lower grades.\n\nA music education involves more than merely learning how to play an instrument. ( )\n\nSome regional parents and teachers say the testing of late has hit discordant notes. ( )\n\nThere are chamber orchestras right across Australia. ( )\n\nA generalist examiner, he notes, may not even be able to play the instrument they are supposed to be assessing.\n\n\"We all say our instrument is the hardest instrument,\" Mr Hyder says.\n\n\" But unless you are a player, you really cannot understand what it takes to play at a high level on the violin. \"\n\nMr Hyder is particularly aggrieved at the use of a generalist to examine some of his own students, something which he says has rocked their confidence.\n\nHe now wants a reassessment of their marks.\n\nMr Hyder says regional students still have to pay the full cost of an exam even though they might not get a specialist assessor.\n\nAnd he says those costs are not immaterial to many families — amounting to almost $200 for a seventh-grade exam.\n\n\"It concerns me that there may be a double standard here,\" he says.\n\nMusic board defiant\n\nGaby Gunders, the chief examiner for the AMEB in Western Australia, disputes any suggestion that generalist examiners are not up to the task of assessing students at higher levels.\n\nGaby Gunders says the AMEB strives to give the best and fairest exams. ( )\n\nShe argues generalist examiners are often among the board's most capable operators who have had more extensive training.\n\n\"[Being] a generalist doesn't make them lesser,\" Dr Gunders says.\n\nAccording to Dr Gunders, the board conducts about 5,000 exams in WA every year, and is the only branch of the organisation to send examiners to regional areas.\n\nShe says the AMEB has to weigh various factors, such as the number of students in each instrumental category, when deciding which examiner to send to a regional town.\n\n\"The only people that we would choose for that pool of regional exams are people who have got a cross-instrument experience,\" she explains.\n\n\"Then they go through our cross-instrument training beyond that.\"\n\nSome say the AMEB can make or break an aspiring musician's chances depending on its scores. ( )\n\nEisteddfods are an important stepping stone for many aspiring musicians. ( )\n\nUltimately, however, Dr Gunders says the AMEB is limited in the services it can provide because sending multiple specialists to a regional town would cost too much money.\n\n\"If we had to send three examiners, that would regrettably be the end of our examining in that region, because we couldn't do it,\" she says.\n\n\" There's no way that we could afford, as an organisation, to run and afford to send three examiners for a session because there are those higher grades. \"\n\nA question of faith\n\nMr Hyder acknowledges the board faces practical constraints but argues it could do more to support higher-grade students in the regions.\n\nHe says the AMEB process is rightly held to be one of the most rigorous in the world.\n\nMr Hyder says good marks in the AMEB exams can be the difference between a student gaining entry into tertiary music education — and a possible career in the field — or not.\n\nFor many talented musicians, the AMEB is a path they follow to succeed in the field. ( )\n\nStudents spend years preparing for upper grade AMEB tests. ( )\n\nEach year, about 5,000 music exams are run by the AMEB in Western Australia. ( )\n\n\"It's a very hard exam, but the kids really prosper if they do well in an AMEB exam,\" Mr Hyder says.\n\nMs Milnes, whose daughter Evelyn recently sat the AMEB's second-grade exam, agrees.\n\nShe wants her daughter to follow the path laid out by the board to achieve excellence in her instrument and all of the benefits of a lifetime of music.\n\nIn order for that goal to endure, however, Ms Milnes says their faith in the AMEB cannot be broken.\n\n\"I think that is the most important part,\" Ms Milnes says.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/vic-jetstar-travel-chaos/106081606",
    "title": "Chaos for Jetstar passengers amid nationwide flight delays",
    "publish_date": "Fri, 28 Nov 2025 23:55:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Thousands of Jetstar passengers across Australia have been affected by a global issue that has seen Airbus A320 planes around the world grounded.\n\nLive Moment The latest on Jetstar disruptions due to the global Airbus A320 recall. Thanks for being with us The press conference has wrapped up so that's where we'll leave our live coverage. We'll continue to keep you updated at abc.net.au/news East coast flights the most impacted Mr Symes said most of Jetstar's impacted aircraft are on Australia's east coast. \"Geographically we're in a pretty good position,\" he said, referring to the engineering support near the impacted planes. Most repairs to be fixed today, Jetstar chief says Mr Symes says it's \"difficult\" to say how long the Jetstar disruptions would last but said most repairs could be completed today. \"We're hoping to get it all done today and expecting the potential for some minor disruption tomorrow,\" he said. \"We're trying to rectify the situation as quickly as we possibly can as all airlines are across the globe.\" Show more\n\nPassengers flying with Jetstar have been told to expect major delays, and a number of flights were cancelled after the issue with A320 planes was identified.\n\nJetstar has about 50 of the A320 aircraft in its fleet, while Qantas also uses the planes but said its services were not affected.\n\nThe flight disruptions in Australia were affecting all major domestic airports on Saturday morning, with multiple flight cancellations at all airports handling Jetstar flights.\n\nThe Jetstar flight cancellations led to delays for many passengers in Melbourne. (ABC News: Natasha MacFarlane)\n\nJetstar's chief pilot and head of flying operations, Tyrone Simes, said the disruptions were affecting thousands of passengers across Australia and could continue into Sunday.\n\n\"We've got about 90 flights affected, and that's just Jetstar, but it's important to note it is a worldwide issue, so there are many thousands of customers right across the world with different airlines affected,\" he said.\n\nThe issue requires engineers to reverse a software upgrade that was carried out on Airbus A320 aircraft. This process could take up to three hours for each plane.\n\n\"We're hoping to get it all done today and expecting the potential for some minor disruption tomorrow,\" Mr Simes said.\n\n\"We're trying to rectify the situation as quickly as we possibly can, as all airlines are across the globe.\"\n\nExtra chaos at Melbourne Airport after Friday fire\n\nIn Melbourne, the flight chaos was compounded by a backlog of passengers who had flights cancelled last night due to a fire at the Qantas domestic terminal at Melbourne Airport.\n\nMelbourne Airport chief of aviation Jim Parashos said many people's travel plans had been disrupted.\n\n\"Being a weekend, with schoolies, I've spoken to a lot of travellers going up to Byron [Bay] and the Gold Coast,\" he said.\n\n\"We appreciate their frustration but they're being very understanding.\n\n\"From our perspective and Jetstar's, it's been all hands on deck this morning to try and assist where we can.\"\n\nSchool-leavers Alexandra, Ruby, Ella and Alice were all smiles despite having their initial flight to Byron Bay cancelled on Saturday morning. (ABC News: Natasha MacFarlane)\n\nMelbourne friends Alexandra, Ruby, Ella and Alice were travelling to Byron Bay today for schoolies' week but had to put their plans on hold.\n\nAfter their initial early flight was cancelled, they secured seats on a later flight.\n\n\"We worked really hard during year 12, so we're really looking forward to a well-deserved break with friends, so I'm glad we'll still be able to get there tonight,\" Ruby said.\n\n\"We're getting there one way or another.\"\n\nTraveller Lucy Bohan arrived at Melbourne Airport on Saturday morning for her Jetstar flight out of Melbourne only to find it had been cancelled.\n\n\"We were meant to go to Sydney, but a lovely announcement told us otherwise, so we're just trying to game plan how we're going to get there,\" she said.\n\n\" We're willing to put in the work because we have no other plans. It's raining in Melbourne and it's sunny in Sydney. \"\n\nAugustin Matteoda, waiting at Melbourne Airport after his flight to the Gold Coast was cancelled. (ABC News)\n\nAugustin Matteoda arrived in Melbourne on a 6am flight from Chile but was told his connecting flight to the Gold Coast was cancelled, delaying the start of his three-month holiday in Australia.\n\n\"It's so bad because I'm very confused. I think this is ridiculous. It's so bad,\" he said.\n\n\"I'm trying to change my flight, but the line is very long.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/central-qld-coastal-rowing-gold-amid-olympic-push/106056042",
    "title": "Teen's journey from inland mining town to Barbados coastal rowing gold",
    "publish_date": "Fri, 28 Nov 2025 23:03:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "There is not much coast or rowing where Calli McRae spent her formative years.\n\nBut that did not stop the 18-year-old, originally from Blackwater in central Queensland, from winning gold in an international meet for coastal rowing ahead of its inclusion in the Los Angeles 2028 Olympics.\n\nAnd it is a sport she took up for the first time only a few months ago.\n\nA month after taking part in a \"come and try\" session for coastal rowing in Brisbane earlier this year, she was competing at the nationals in Sydney.\n\n\"I had no expectations, just wanted to give it a go … and I exceeded those expectations,” the nursing student said.\n\nShe has her parents to thank for her love of beach sports, after driving her the almost-500km round trip to Emu Park every weekend to compete in nippers as a child.\n\nCalli McRae and Samuel Forbes won gold in the under-21 mixed doubles in Barbados. (Supplied: Commonwealth Rowing Association/Swift Racing Boats/CJ Taylor Photos)\n\nAfter moving to the Capricorn Coast town permanently in 2018, she not only continued with nippers but spent countless early mornings rowing on the Rockhampton Fitzroy River.\n\nThose skills, combined with her surf boat rowing experience, led her to try coastal rowing.\n\n\"It's a shorter distance to still water [rowing] … the finishes are much faster and exciting,\" she said.\n\nAfter the nationals in Sydney in September, she travelled to Barbados this month for the 2025 Commonwealth Rowing Association Beach Sprint Championships.\n\nTeaming up with Samuel Forbes, she won gold in the under-21 mixed doubles and progressed through the semifinals in the under-21 Women's Solo to finish fourth.\n\n\"Both races were a really good experience. I learned so much because I'm still new to the sport,\" McRae said.\n\nWhat is coastal rowing?\n\nRowing Australia's interim lead coach for the sport, Michael Russell, described the sport as an \"extreme version\" of rowing.\n\n\"It's sort of the three-by-three basketball equivalent in rowing, taking the 2,000-metre course and putting it on a beach and making it more exciting for spectators,\" he said.\n\n\"The athletes need rowing and running ability … they can be rowing in seas up to half a metre, so they need to be able to steer the boat in those conditions as well.\"\n\nCalli McRae, alongside Samuel Forbes, won their race in a time of 2:32:63. (Supplied: Commonwealth Rowing Association/Swift Racing Boats/CJ Taylor Photos)\n\nThough the sport has two events, an endurance race and a sprint, the sprint was the focus in Barbados, with the Australian team managing to take home six gold medals out of the seven events they competed in.\n\nIt includes a sprint down the beach to the water, with athletes then hopping in a boat to row a short distance on a slalom course, before running the boat back up the beach and sprinting to the finish line.\n\nThe sport has solo categories, as well as mixed doubles and quads.\n\n\"It's currently the only international event for rowing that has mixed crews,\" Mr Russell said.\n\nIn Barbados, the Australian team took home six gold medals out of the seven events they competed in. (Supplied: Michelle McRae)\n\nOlympic push\n\nWith the sport set to make its Olympic debut at the 2028 Los Angeles games, Mr Russell had seen its popularity surge.\n\n\"Participation from around the world has just skyrocketed now that it is an Olympic discipline,\" he said.\n\nHe hoped Australia would be represented in the sport at the LA games and that it would be included in the 2032 Brisbane games.\n\nCalli McRae says Barbados was a beautiful location to visit. (Supplied: Michelle McRae)\n\nWith nearby Rockhampton slated to host rowing and sprint canoeing events at the games, state Keppel MP Nigel Hutton, said Emu Park was a good spot for it, and discussions were underway.\n\n\"We've had conversations with ministers of the government, as well as socialising the idea with the community,\" he said.\n\n\"So that if it should get up, we've got a foot in the door.\"\n\nFor McRae, competing in the Olympics on home soil would be a dream come true.\n\n\"2028 is probably a bit too close for my experience [level] … but 2032 is definitely something to look forward to and aim for.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/nt-cyclone-fina-damage-royal-darwin-hospital-need-rdh-analysis/106074054",
    "title": "Damage from Cyclone Fina exposes NT's need for new Darwin hospital",
    "publish_date": "Fri, 28 Nov 2025 22:52:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Last weekend, as Severe Tropical Cyclone Fina rumbled past Darwin as a category three system, the Northern Territory's biggest hospital suffered significant damage.\n\nPart of an external wall collapsed, dropping dozens of bricks outwards, through the roof of a lower level of the hospital and into an internal passageway frequented by both staff and patients, just metres from a vending machine.\n\nAs NT Health Minister Steve Edgington remarked in parliament this week: \"It's incredible, Madam Speaker, the area is a well-travelled area at the hospital, but nobody was injured\".\n\nEngineers are now assessing the rest of the building amid concerns raised post-cyclone. (ABC News: Dane Hirst)\n\nBut what happens when the next decently-sized cyclone hits the Top End?\n\nRoyal Darwin Hospital (RDH) was built in the aftermath of Cyclone Tracy, which devastated Darwin in 1974, and it's becoming clear the ageing facility is now approaching its 50-year life-span.\n\nAs NT Health chief executive Chris Hosking put it this week: \"The old hospital's just about had its day\".\n\n\"I wouldn't like to be battening down for a [category] three cyclone here in 10 years time,\" he said on Monday.\n\nChris Hosking is calling for a replacement facility as Royal Darwin Hospital approaches the end of its life. (ABC News: Michael Franchi)\n\nNT calls for federal support\n\nMr Edgington strongly agreed, and said RDH was \"getting beyond its useful life\".\n\nIn a statement to the ABC on Wednesday, the NT's Department of Logistics and Infrastructure said \"further safety checks and inspections were undertaken\" after the brick facade's collapse, which \"found another section of wall that requires further investigation\".\n\nEngineers are assessing the entire building amid concerns for another section of the wall, and Mr Edgington said he was not aware of any structural issues at RDH prior to the cyclone.\n\nNT Health Minister Steve Edgington says RDH needs to be replaced. (ABC News: Marcus Kennedy)\n\nBut he's putting the onus on the Commonwealth to stump up and fund the facility's replacement, claiming the NT is being \"short-changed $400 million\" on health funding.\n\n\"Literally, the hospital is falling apart around us,\" he said.\n\n\"What we are asking is for the federal government to think about what's needed here in the Northern Territory when it comes to health.\n\n\"We have some of the worst cases of disease here in the Northern Territory.\"\n\nHe's right — the NT has some of the worst health outcomes in Australia, and its health system is consistently stretched to breaking point.\n\nRoyal Darwin Hospital in a constant state of emergency Health insiders say Royal Darwin Hospital is operating in emergency management conditions daily.\n\nAn ageing RDH also doesn't help the morale of workers inside the building — decades-old facilities, in an architectural design suited to southern climates, which staff working around the clock will tell you feels like a 1970s time warp.\n\nOf course, federal government buy-in on a project the scale of a new RDH would be pivotal if the NT wants to afford it.\n\nAlready, more than 70 per cent of the territory's annual budget revenue comes from Commonwealth funding.\n\nBut couldn't a new Darwin hospital be helped along if the NT government took the lead in committing to such a project?\n\nCouldn't the NT government drive forward plans to build a new RDH and give Territorians confidence there is a plan to help pull its health system out of the mire?\n\nWon't it be too much for taxpayers?\n\nYes, it's a project that is likely going to cost billions of dollars.\n\nBut that infrastructure price-tag is not without recent precedent in the jurisdiction.\n\nThe NT government is already committed to building a ship lift with a construction budget of more than $800 million, that government sources say could eventually blowout to $1 billion.\n\nShip lift should proceed despite cost blowout, report finds The NT government will gain no direct revenue from the project, despite spending $820 million on its construction.\n\nA ship lift that is going to be used solely by private industry for private industry revenue.\n\nThe government's also continuing with a $100 million State Square centrepiece building in Darwin CBD (just don't call it an art gallery — at least, not yet).\n\nSo why not commit to a project that will have long-term benefits for all Territorians, and throw some of those hundreds of millions of dollars towards a new major hospital?\n\nThe NT government has a decades-long track record of blaming the federal government for funding shortfalls in the jurisdiction — it's basically a territory tradition to blame Canberra.\n\nBut, with Prime Minister Anthony Albanese already calling on the states and territories to reign in their health budgets and spending, rallying the feds for cash may be a tough bargain.\n\nPrime Minister Anthony Albanese has asked health spending be reigned in by each state and territory. (ABC News: Andrew O'Connor)\n\nStatements to the ABC from the federal government about whether they would commit to funding a new RDH have so far been vague and noncommittal.\n\nMaybe it's time for some political bravery in the Northern Territory government.\n\nProjects such as the ship lift and the State Square building (projects, it must be said, that were signed off on under the previous Labor government) remain publicly divisive and will only benefit certain portions of the territory population.\n\nA new RDH would benefit all NT residents for generations to come.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-11-29/lamb-prices-rising-after-year-of-saleyards-records/106034772",
    "title": "Lamb prices in Aussie supermarkets on the rise ahead of Christmas",
    "publish_date": "Fri, 28 Nov 2025 22:41:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians planning to serve lamb on their Christmas lunch table may be paying more this year.\n\nAnalysts are expecting retail prices to rise over December, as record lamb and sheep results in saleyards are passed on to consumers.\n\nWhile not a welcome change for shoppers, strong saleyard prices have been a lifeline for producers following drought conditions in Southern Australia.\n\nMatt Dalgleish expects lamb and sheep prices to remain high in 2026. (ABC Rural: Arlie Felton-Taylor)\n\nAgricultural market analyst Matt Dalgleish said there had been a large turnaround in the market over the past 18 months.\n\n\"It's been quite a spectacular year, really, for the producer,\" he said.\n\n\"It is a great result for those producers that are able to carry that stock through, particularly when the times are so difficult season-wise.\"\n\nPrices expected to rise\n\nSaleyard records started falling in July amid high demand for lambs following a contraction of flock levels.\n\nLoading...\n\nMr Dalgleish said these record prices were now beginning to hit regular consumers.\n\n\"After about three to six months, it does flow through to higher pricing at the retail level,\" he said.\n\n\"As we head towards the end of the year, we will see those really strong saleyard results we saw through winter that will carry through to a more expensive lamb at the retail level by the time we hit Christmas.\"\n\nA pen of Suffolk lambs sold for a Tasmanian record of $422 per head in Powranna earlier this year. (ABC Rural: Laurissa Smith)\n\nFor consumers, lamb prices cooling off at the saleyards may not mean a reduction in retail prices.\n\n\"At the retail level, you tend to see the prices just sit and go sideways,\" he said.\n\n\"You might get a very small marginal drop in pricing … but it's not going to make a significant difference.\"\n\nPayday for SA farmers\n\nOne of Australia's most recent sheep records to fall was first-cross ewes, which, in mid-November at the Naracoorte Saleyards, reached highs of $540 per head.\n\nThe record price came as a surprise for the owners of the ewes, the Eckert family, who farm in South Australia's Coorong region.\n\nDavid Eckert at the saleyards where his merino and Deepwater border Leicester stock set a new national first-cross ewe record. (Supplied: David Eckert)\n\nThe family had nearly decided to offload the ewes earlier in the year due to a lack of feed, eventually choosing to instead hang on in hopes of an eventual return.\n\nDavid Eckert said he was \"very surprised\" their ewes set a new national record.\n\n\"It was totally unexpected and obviously something I've never done before. In a tough year, I thought we'd never even come close,\" he said.\n\nMLA market information analyst Emily Tan was not surprised that recent results had been strong.\n\n\"Every month we've been seeing records being broken,\" she said.\n\n\"This is kind of a year of records in some ways.\"\n\nBattle with dry conditions\n\nThe lack of rain this season in South Australia and Victoria limited the amount of feed available on many rural properties.\n\nSouth Australian farmers facing long drought recovery Some South Australian farmers say they are still feeling the strain of drought after inconsistent winter rains left little room for recovery before the coming summer.\n\nThe Eckert family had to resort to handfeeding livestock for the first time on their farm.\n\n\"Our passion is always in these sheep and growing them out,\" he said.\n\n\"We've been doing it for many years now, and we decided that we had to really pen feed them to bring them up to any sort of standard because we never had the paddock feed.\n\n\"It was a tough year, and in the end, they just bloomed exceptionally well in the pen, and they've come up to be spot on.\"\n\nThe sale had been a bright spot in an otherwise difficult year.\n\n\"I've never farmed through a tougher season than this one just gone,\" Mr Eckert said.\n\n\"It was a great feeling, it was a great reward, and backed up our decision we made earlier in the season.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/mother-comes-to-terms-with-terrifying-postpartum-rage/106072456",
    "title": "Mother urges others to reach out after terrifying postpartum 'blackout rage'",
    "publish_date": "Fri, 28 Nov 2025 22:33:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "In the months after giving birth to her second baby, Ali Gossage felt an all-consuming anger that came out of nowhere.\n\nShe did not know it at the time, but was suffering a condition many mothers go through, but few talk about.\n\n\"I developed postpartum rage. It was something that I'd never experienced before and never heard of before,\" she said.\n\n\"I would blackout [with] rage, throw things, and it would literally be over the most minute, tiny thing.\n\n\"My son would ask me for a drink, and I would just absolutely go off the rocker.\"\n\nAli Gossage says she was nervous to talk to her husband about how she was feeling after having their second baby. (Supplied: Ali Gossage)\n\nMrs Gossage said she had no idea what was happening to her as she had not experienced any mental health struggles after having her first baby the year before.\n\nThe now 28-year-old said she did not feel comfortable talking to anyone about how she was feeling because she did not want people to think she could not handle being a mother.\n\n\"I was really hesitant to speak out about it because I didn't know what I was going to be met with on the other side,\" she said.\n\n\"How do you talk to someone [about how] ... you just don't know what you're going to do in that moment? You're just not the person you really are, when you snap.\n\n\"It was really terrifying.\"\n\nStigma remains\n\nGidget Foundation clinical psychologist Katie Peterson said, unfortunately, a lot of new mothers struggled with their mental health, and those suffering postpartum rage often felt like they could not talk about the reality of their situation.\n\nClinical psychologist Katie Peterson says being able to hear people's stories and feeling validated is important. (Supplied: Katie Peterson)\n\n\"Often they feel like they're failing as a mum, or it might not be the experience they'd hoped for in becoming a new parent,\" she said.\n\n\"So reaching out for support or knowing where to get support can be really hard.\"\n\nMrs Gossage said opening up about postpartum rage was still heavily stigmatised, despite the condition's prevalence.\n\n\"Everyone just talks about how great motherhood is and 'this is all I've ever wanted' and 'I love my babies' and everything is hunky dory,\" she said.\n\n\"I have three older sisters and two of them have kids, and when I was going through it, I asked them, 'Was it hard for you? Did you experience anything like the isolation, the identity shift of becoming a mother?'\"\n\n\"And they were like, 'Oh yeah, we did, but no-one spoke about it, so we just got on with it.'\"\n\nAli Gossage and her firstborn son, Harrison. (Supplied: Ali Gossage)\n\nOpen conversations crucial\n\nMs Peterson said telehealth appointments and speaking to healthcare professionals were always an option for struggling parents.\n\nBut having open, honest conversations was crucial too.\n\n\"Peer support is becoming a lot more common and is a really important part of breaking down the stigma around accessing mental health,\" she said.\n\n\"We know that isolation and loneliness with these types of challenges is one of the things that makes them worse, so being able to hear people's stories and feel validated is really important.\"\n\nAli Gossage hopes to use her story to show other mums they are not alone. (Supplied: Ali Gossage)\n\nFor Mrs Gossage, sharing her story with an online mothers' support group called Motherland and eventually getting regular counselling through the Gidget Foundation had turned her life around.\n\nNow the young mother wanted to show other mothers that they did not have to struggle through the traumas of postpartum mental health alone.\n\n\"I know that it's scary and [you are] vulnerable and you do feel like a failure when you ask for help,\" Mrs Gossage said.\n\n\" But it's so common, and you just need to, because it really does take a village to raise a child. \"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/usman-khawaja-pillories-perth-ashes-test-pitch/106081416",
    "title": "Usman Khawaja hammers Perth pitch after another bowling bloodbath",
    "publish_date": "Fri, 28 Nov 2025 21:59:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "Usman Khawaja has labelled the Perth pitch for the first Ashes Test a \"piece of shit\" in a diatribe that could attract attention from Cricket Australia.\n\nJust a day after the ICC gave the Perth Stadium wicket full marks with its highest possible rating of \"very good\", Khawaja pulled no punches on the state of the pitch for the two-day Ashes opener.\n\nNineteen wickets fell on the first day in the England match, after 17 were also taken between Australia and India on day one of the Perth Test last year.\n\nSpeaking at a fundraising lunch for his foundation in Brisbane, Khawaja sarcastically said: '\"Nineteen wickets on the first day and about 20 people got hit. That's a great wicket, that seems real fair.\n\n\"The same thing happened last year in the India Test. It's just that day-one wicket, the ball just does not react.\n\n\"Steve Smith's by far the best cricketer I've ever played with, and he's missing the middle of his bat by a long way.\n\n\"He does not miss the middle of his bat, [but] he's getting hit in the elbow.\n\n\" So, day-one wicket at Perth is a piece of shit, I'm happy to say that. Has been last year, it was this year. \"\n\nLast week's Ashes series opener lasted just 847 balls, with only a 1932-33 Test against South Africa at the MCG lasting less time for a result in Australia.\n\nEngland's batting has been labelled reckless and \"brainless\" by former England opener Geoffrey Boycott, with the all-out aggressive approach at threat of losing its appeal, although Australia's first innings of 132 was the lowest total in the game and was saved in its chase by the uber-aggressive Travis Head.\n\nBack spasms forced Khawaja from the field for long periods of the first Test. (Getty Images: Darrian Traynor)\n\nBut Khawaja was adamant the Perth pitch was still not good enough, with the 38-year-old's main issue being variable bounce.\n\n\"You can't really predict up and down. Up and down is the hardest. Sideways is a little bit easier,\" Khawaja said.\n\n\"But up and down, your hands can't catch up.\n\n\"They do get better. Day two, day three, and then day four, they start to crack up and cure again.\n\n\"So whenever we play at Perth, it's one of the few places we win the toss, bat first, hoping that we can bat again maybe at the end of day two and into day three.\"\n\nCricket Australia defended the pitch, adamant during the week that the \"very good\" rating justified their belief the wicket created a \"fair balance between bat and ball\".\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nKhawaja's comments came after player of the match Mitchell Starc and former opening partner David Warner said last week that Australia's players wanted the Test summer to start at the Gabba in Brisbane.\n\nPerth is locked in to host Australia's first Test of next summer as well when New Zealand tour, before Adelaide is expected to take on the role in 2027-28. The opener is set to return to Brisbane after the Olympics in 2032.\n\nKhawaja's back spasms meant he was unable to open for Australia in either innings in Perth, allowing for Head to score a match-winning century in the fourth-innings chase.\n\nKhawaja is confident he will be fit to play in Brisbane with his back having improved, while also insisting he had paid no attention to calls for him to be dropped from the side and Head moved to open full time.\n\nKhawaja has only passed 50 twice and averages under 30 in 27 innings since January 2024, which includes a record 232 in the opening Test in Sri Lanka earlier this year.\n\nThe Queenslander has retained his spot in the 14-player squad for the day-night Gabba Test, but there is still the potential for Head to stay up the order with Jake Weatherald and Josh Inglis or Beau Webster to move into the middle order.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/the-up-front-and-ongoing-costs-of-home-ownership/105984188",
    "title": "Think you're ready to own a home? Here are the costs to consider",
    "publish_date": "Fri, 28 Nov 2025 21:50:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Buying a home is the biggest financial investment most people will make, and is seen by many as a major milestone on the road to adulthood.\n\nBut it's a decision that requires extensive research and preparation before making a purchase.\n\n\"Buying a first home is exciting but can also be emotionally charged, and there are many important details both before and after the purchase that deserve attention,\" financial advisor Stephanie Yeung says.\n\nSo how do you know if you're ready to take on the big commitment?\n\nFriends combine finances to buy dream home together Friends Gem and Renata have saved money buying a home together with their respective families in Wollongong, and say the pay-off goes much further.\n\nWe asked three financial experts — Nicola Beswick, Natallia Smith and Stephanie Yeung — about the up-front and ongoing costs of buying a home and their top tips to prepare for home ownership.\n\nLet's get to it.\n\nWhat are the up-front costs of buying?\n\nThe biggest hurdle to saving will be the deposit, which is often 20 per cent of the purchase price.\n\nListed house prices may not tell you the full story, though. In a competitive market, you may end up paying well above the advertised price, so that could blow out your budget from the get-go, Ms Smith says.\n\nAnd if you haven't accounted for added fees and charges, then you may want to read on.\n\nLenders Mortgage Insurance (if applicable) Lenders Mortgage Insurance (LMI) is a one-off fee the bank charges when your deposit is less than 20 per cent of your home. It's designed to protect the bank when you fail to meet repayments. You'll pay between 1 and 5 per cent of your loan amount, depending on how much deposit you have. It can often be added to your mortgage amount, rather than being paid up-front, but you will then pay interest on that amount too. Stamp duty Stamp duty, also known as transfer duty or land transfer duty, is the tax you pay on a property purchase. The costs vary from state to state, ranging between 3 and 5 per cent of the value of the home. Depending on where you live, you may be able to receive a concession or exemption when you buy your first home. Conveyancing fees You will usually need to hire a solicitor or conveyancer to walk you through the legal process, conduct title searches, and draft up documents such as a contract of sale and memorandum of transfer. Costs range between $800 and $2,500, but can increase with the complexity of the sale. Building and pest inspection If you want to be confident in the quality and safety of the home you're buying, you will need to pay for a building inspection. The location and size of the space, as well as whether it's a house or apartment, will determine how much you will pay. Costs range anywhere between $250 and $1,000. It's important to note that a building inspection report generally does not include a cost estimate of any repairs required. You can make your offer conditional on a building inspection being completed. Keep in mind that if you're buying at auction, your purchase is usually unconditional, so you may need to pay for an inspection before buying.\n\nLastly, you may also want to set aside some money for the fun stuff.\n\n\"Don't forget other things like the new furniture, white ware, or other items you may want to add to your home,\" Ms Beswick says.\n\n\"They are the best part of buying a place, especially when you want to make it your own!\"\n\nNicola Beswick says budgeting is key in managing the costs of home ownership. ( )\n\nWhat grants are available to home owners?\n\n\"Grants can make a world of difference if you are eligible for them,\" Ms Beswick says.\n\nHere are some schemes available on the market.\n\nFirst Home Owner Grant (FHOG)\n\nAustralian Government 5% Deposit Scheme\n\nFirst Home Super Saver Scheme (FHSS)\n\nSweeping changes to the first home buyer scheme explained The revamped scheme has come into effect, with first home buyers of all income levels now able to purchase a property with only a 5 per cent deposit. Here are the changes explained.\n\nThe FHOG provides a one-time payment to those buying a new or extensively renovated home.\n\nHowever, the grant amount varies from state to state, and the value of the property must not exceed the stipulated cap.\n\n\"The Australian Government 5% Deposit Scheme allows first home buyers to, as the name suggests, pay only a 5 per cent deposit on their first home while avoiding LMI,\" Ms Beswick explains.\n\nThe First Home Super Saver Scheme allows you to save for a home deposit through superannuation, where tax rates are generally capped.\n\nStates may also offer other schemes where the government can own a percentage of your home, so it helps to check local sites.\n\n\"That way you can get into the market and buy your own place with a bit of help from the government,\" Ms Smith says.\n\nWhat are some ongoing costs to consider?\n\nLoan repayments on your mortgage may be the biggest line item in your budget.\n\nWhether they are taken out at a variable or fixed interest rate can affect how much you pay, though both have pros and cons.\n\n\"Locking a fixed rate gives you certainty where you'll know [for example] for five years you'll be paying the same amount of money,\" Ms Smith says.\n\nBut the challenge sets in when you come off a fixed-rate term and experience a hike.\n\n\"It's really good to fix the rates when they are low but there's no real advantage to fix them when they are high,\" Ms Smith says.\n\nNatallia Smith says the ultimate goal of home ownership should be paying off your home loan as fast as possible. ( )\n\nVariable rates are subject to fluctuations in the cash rate in Australia.\n\nFor borrowers on a variable rate, Ms Smith advises: \"Always check what your rate is because sometimes the banks are not very good at passing [cuts] on to consumers.\"\n\nWhen that happens, she says to call the bank to ask for a reduction.\n\nBut there are also plenty of costs that go beyond mortgages, Ms Beswick says.\n\nHere's what you should account for.\n\nHome and contents insurance Home and contents insurance protects your property and belongings against unfortunate events like theft and wild weather. What is covered will depend on your policy. While various factors determine how much you pay, premiums may be higher if your area is at a greater risk of natural disasters or crime. A higher excess will lower your premiums but increase your out-of-pocket expenses. Council rates Council rates are a type of tax that pays for local government services and infrastructure projects. This includes the building and maintenance of public spaces, such as libraries and parks, roads and waste management. The value of your property, which gets reviewed every two years, is a key factor in determining how much you pay. Strata fees (if applicable) Strata fees, also known as body corporate fees, only apply to apartment owners. These fees are paid into a joint fund to finance repairs and maintenance on the entire property. According to Ms Smith, payments can go as high as $10,000 to $15,000 a year. This amount also increases every year, in line with inflation. Utilities This includes all household running costs such as water, gas, power and internet. However, some states offer concessions and rebates for energy bills, so it's worth researching options in your area. Maintenance and repairs Maintenance is a cost that Ms Beswick says people often account for the least and can be difficult to predict. \"Preparing for breakdown of appliances and upkeep of your garden and building is necessary to consider,\" she says. You may find there are more repairs in the first year, Ms Smith says. \"Sometimes when you buy something you don't really know what the place looks like and what needs to be fixed until you start living in it,\" she says. Personal insurance Having personal cover, like life insurance, can help you and your family pay the mortgage in tragic circumstances. \"People often insure their belongings but forget their most important asset, the ability to earn an income,\" Ms Yeung says. \"Personal insurance options, such as income protection, total and permanent disability cover, trauma or critical illness cover, and life insurance, can work separately and/or together to provide financial support if unexpected illness, injury, or accidents occur.\"\n\nHow to know if you are financially ready to own a home\n\nWhile experts have slightly different answers, they all echo the same idea.\n\nUnderstanding your cash flow and how much savings you have are important factors.\n\n\"You're on the right track if you can cover a deposit and initial costs without depleting your non-home deposit savings,\" Ms Beswick says.\n\n\" Always expect the unexpected … as a slight mishap, such as a broken air conditioner or a leaking pipe, can throw your budget out for the month. \"\n\nShe recommends spending no more than 35 per cent of your income on mortgage repayments, insurance, rates and fees.\n\nThat should give you enough leeway to build on your emergency savings buffer while paying for other living expenses comfortably.\n\nStephanie Yeung is a big believer in having a first home that is sustainable and affordable in the long run. ( )\n\nMs Yeung notes that some people check affordability by stress testing, for example, adding 2 to 3 per cent to the current interest rate to see how higher repayments would impact the budget.\n\n\"You need to have a savings buffer that goes beyond living from pay cheque to pay cheque,\" she says.\n\nHaving at least six months' worth of income in savings is ideal, adds Ms Smith.\n\n\"It's important not to spend more than you earn,\" she says, and the same goes when purchasing your own home, as she warns home owners not to overextend their budget.\n\nMs Yeung agrees and sees this as a potential financial pitfall.\n\n\"Banks might, based on current circumstances, give people a much higher loan than what they need,\" she says.\n\n\" So people are borrowing to the limit of what they can borrow rather than what they can afford — and those are two very different things. \"\n\nHouse-sitting saved me enough to buy my own home At 42, Amna did not want to join a share house or spend all her money on rent. She turned to house-sitting to save a deposit.\n\nWhile being clear on home ownership costs can help, it's also important to understand how life plans can impact the budget.\n\n\"If a working couple plans to have a family and one of them decides to take time off [for caretaking duties], then there is actually a change in your income circumstance,\" Ms Yeung says.\n\nLastly, she warns not to cave in to emotions when making a purchase, such as the fear of missing out.\n\nHere is her advice for first home owners.\n\n\"There's no need to rush. Understanding the numbers before making a major financial commitment is important because managing repayments over time is critical,\" Ms Yeung says.\n\nYour first home doesn't have to be a dream home. Financial security often comes from reducing debt and eventually paying off your mortgage.\"\n\nNote: This information is of a general nature and does not consider your personal circumstances. Please seek professional advice before acting.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/jetstar-flights-grounded-delayed-due-to-airbus-a320-recall/106081408",
    "title": "Some Jetstar flights grounded due to global recall of A320 planes",
    "publish_date": "Fri, 28 Nov 2025 21:50:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Some Jetstar planes have been grounded due to a global recall of thousands of A320 aircraft, which are also used by Australian carriers Qantas and Virgin.\n\nThis morning, Airbus ordered immediate repairs to 6,000 of its A320 family of jets, more than half the global fleet.\n\nAbout two-thirds of the affected aircraft will be briefly grounded as airlines revert to a previous software version, industry sources have told Reuters.\n\nMore than 1,000 of the affected aircraft may be grounded longer due to hardware changes, the sources said.\n\nChaos for Jetstar passengers amid nationwide flight delays The cancellation of Jetstar flights due to an issue with Airbus A320 planes has left passengers stranded across Australia.\n\nThe repairs must be carried out before the next routine flight, according to a separate bulletin to airlines seen by Reuters, which could lead to cancellations or delays.\n\nAccording to Jetstar's website, the carrier has 56 A320s in its main fleet and another 25 operating under Jetstar Japan.\n\nIt also has five A320neo planes in its main fleet.\n\nA Jetstar spokesperson did not say how many of its planes are impacted, but said some had been immediately grounded and flights cancelled.\n\n\"Due to an issue affecting Airbus A320 operators globally, some of Jetstar's Airbus-operated flights are unable to depart at this stage,\" they said.\n\n\"Safety is our number one priority. To respond to a precautionary action from Airbus, we have cancelled some Jetstar Airways flights.\n\n\"Our teams are working on options to get customers on their way as quickly as possible, and are contacting affected customers directly.\n\n\"We will continue to provide updates.\"\n\nA Qantas spokesperson said none of its fleet had been impacted.\n\nQantas's fleet of A320 planes has not been impacted. (AAP: Paul Miller)\n\nVirgin Australia operates four A320s in Western Australia, but a spokesperson said its customers would not be affected.\n\nIn a statement, Sydney Airport said the global software outage was causing delays for some domestic Jetstar services operating from Sydney.\n\n\"We're supporting Jetstar as they work to resolve the issue, and strongly advise all Jetstar customers to check their flight status with the airline before travelling to the airport,\" it said.\n\n\"All other airlines and flights at Sydney Airport are operating as normal and are unaffected.\"\n\nThere was chaos at Melbourne Airport on Saturday morning with many travellers arriving to find their flights cancelled.\n\nTravellers at Melbourne Airport have been impacted with several Jetstar flights grounded due to urgent repairs to A320 planes. (ABC News: Natasha MacFarlane)\n\nThree Jetstar flights scheduled from Adelaide to the Gold Coast, Sydney and Cairns have also been cancelled.\n\nSidney Dekker, a Griffith University professor and former pilot, said the software fix would be \"fairly simple\" and required impacted planes to be grounded for about two hours.\n\n\"But then you also need the right expertise when the airplane is in the hangar to do the software update, and that's a little bit of a crunch,\" Dr Dekker told ABC News Breakfast.\n\n\"We've had this problem in Australia for a while — not enough aviation maintenance engineers to go around.\n\n\" Worldwide, it will reverberate for a couple of weeks before it settles. It will cause a lot of disruptions. \"\n\nThe recall could see thousands of flights delayed or cancelled across the globe. (AAP: Paul Miller)\n\nThe Civil Aviation Safety Authority told the ABC it was aware of the issue \"affecting the A320 family of aircraft globally\".\n\n\"All aircraft that are affected will need to be checked in accordance with advice issued by Airbus and the European Union Aviation Safety Agency,\" a spokesperson said.\n\n\"We are in contact with major airlines and confident they are acting quickly to minimise disruptions and ensure aircraft can be returned to service safely.\"\n\nRecall linked to flight-control software issue\n\nAirbus said a recent incident involving an A320-family aircraft had revealed that solar flares may corrupt data critical to the functioning of flight controls.\n\nIndustry sources have told Reuters that the incident that triggered the unexpected repairs involved a JetBlue flight from Cancun, Mexico, to Newark, New Jersey, on October 30.\n\nSeveral passengers were hurt following a sharp loss of altitude, and the flight had to make an emergency landing at Tampa, Florida.\n\nThe setback appears to be among the largest recalls affecting Airbus in its 55-year history and comes weeks after the A320 overtook the Boeing 737 as the most-delivered model.\n\nSome 3,000 A320-family jets were in the air worldwide shortly after Airbus's announcement on Saturday morning.\n\nThe world's largest A320 operator, American Airlines, said some 340 of its 480 A320 aircraft would need the fix.\n\nIt said it mostly expected repairs to be completed within a day, with about two hours required for each plane.\n\nOther airlines said they would take planes briefly out of service to do the repairs, including Germany's Lufthansa, India's IndiGo, and UK-based easyJet.\n\nIndiGo says it will take its A320 planes briefly out of service to do the repairs. (Reuters: Vivek Prakash)\n\nColombian carrier Avianca said the recall affected more than 70 per cent of its fleet, around 100 jets, causing significant disruption over the next 10 days and prompting the airline to close ticket sales for travel dates through December 8.\n\nThere are around 11,300 A320-family jets in operation, including 6,440 of the core A320 model, which first flew in 1987.\n\nFour of the world's 10 biggest A320-family operators are major US airlines: American Airlines, Delta Air Lines, JetBlue and United Airlines.\n\nLaunched in 1984, the A320 was the first mainstream jetliner to introduce fly-by-wire computer controls.\n\nIt competes with the Boeing 737 MAX, which suffered a lengthy worldwide grounding after fatal crashes in 2018 and 2019, when faulty flight-control software pushed the planes' noses down.\n\nThe Airbus bulletin seen by Reuters traced the problem to a flight system called ELAC (Elevator and Aileron Computer), which sends commands from the pilot's side-stick to elevators at the rear. These, in turn, control the aircraft's pitch or nose angle.\n\nThe computer's manufacturer, France's Thales, said in response to a Reuters query that the computer complies with Airbus specifications and the functionality in question is supported by software that is not under Thales' responsibility.\n\nABC/Reuters",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/hobart-stadium-design-macquarie-point-spectator-experience/106054654",
    "title": "What would it be like to visit the proposed Hobart stadium?",
    "publish_date": "Fri, 28 Nov 2025 21:47:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "With a final decision now on the horizon, the debate over the proposed Macquarie Point stadium has grown louder and more familiar.\n\nArguments tend to focus on the $1.13 billion price tag, the \"monolithic\" scale, its place on Hobart's waterfront and whether politicians should bend to the will of a stubborn sporting body.\n\nAt the centre of all that noise is a striking, dome-shaped arena capable of hosting more than 20,000 people at elite-level sporting games and large concerts.\n\nSo, setting all the politics aside — just for a moment — what would it actually be like to visit the stadium that is being proposed for Hobart?\n\nEntering the stadium\n\nIf it gets built, the stadium would sit on a large plot of land between the River Derwent, Hobart's CBD and the Queen's Domain.\n\nIt would be plopped beside a working port, a picturesque row of heritage buildings and one of the city's busiest intersections.\n\nThe stadium would sit between the River Derwent, the Hobart CBD and the Queen's Domain. (Supplied: MPDC)\n\nA wide public concourse would encircle the building, offering space for crowds to gather before attendees begin to filter through the four main entrances.\n\nThis area would be generally exposed to the elements, though wind tunnel tests suggest the comfort levels would be \"suitable\".\n\nThe most popular entrance is expected to be Gate 1, which is closest to the port and would feature an \"active event plaza\".\n\nMore than 8,800 people are expected to enter through there for sold-out AFL games — which is roughly a third of the total attendees.\n\nThe building would feature four main gates, each funnelling thousands into the stadium on game days. (Supplied: MPDC)\n\nTravelling clockwise around the stadium, Gate 2 sits right by the major intersection and would serve members and \"premium\" ticket holders.\n\nThose walking to the stadium from the Queen's Domain are expected to use Gate 3, which would feature sunken cricket practice nets and the relocated Goods Shed — which has been re-imagined as a trendy bar.\n\nThe final entrance, Gate 4, would be positioned alongside the proposed bus plaza and cater to those travelling via public transport, with access for wheelchair users.\n\nGate 1 would be expected to handle more than 8,000 people during sold-out AFL games. (Supplied: MPDC)\n\nWhen major events are taking place, security checkpoints would be established up to 30 metres out from each gate.\n\nPlanners estimate about 116 people a minute would flow through the security lanes at Gate 1.\n\nThe spectator experience\n\nVisitors would then move through an atrium that opens into a circular concourse lined with food outlets, bars and bathrooms.\n\nSome wind would be able to blow into this internal concourse through some open sections, but modelling suggests there won't be any significant comfort issues.\n\nThe internal concourse wraps around the stadium and would provide access to food stalls, toilets and the seating bowl. (Supplied: MPDC)\n\nFrom there, people would be able to access the seating bowl, which would have capacity for 23,000 people.\n\nThe seats would be angled and tiered to provide each spectator with \"clear, unrestricted views\" of the oval, which stretches about 160 metres from one end to the other.\n\nThe roof would shield the crowds from wind and rain — and the stadium would feature large video boards and lighting rings designed to add to the \"immersive experience\".\n\nDesigns suggest the seats would be angled and tiered to give each spectator an \"unrestricted\" view of the oval. (Supplied: MPDC)\n\nThe field itself would be multi-purpose, able to be configured for AFL, cricket, soccer and rugby, as well as one-off events such as boxing or basketball.\n\nFor major concerts, seating in the lower bowl would be retracted to allow crowds to flood onto the field and a stage would be set up on the northern end of the oval.\n\nCapacity for these events would rise to 31,000 people, with more than 15,000 allowed on the field.\n\nA render of the proposed Macquarie Point stadium in Hobart, Tasmania while in concert-mode. (Supplied: MPDC)\n\nMajor events taking place at night would generally need to wrap up by 10:30pm, as a curfew would require the stadium lights to be switched off by 11pm.\n\nShould an emergency take place during a major event, the stadium has been designed to allow everyone to evacuate within eight minutes.\n\nWhat about conferences?\n\nAlongside footy and live music, the stadium is also being pitched as a year-round events hub — supposedly hosting up to 40 major conferences annually.\n\nThose events would take place in a large function space in the western grandstand, which would also feature hospitality areas and premium seating.\n\nConference attendees would enter through Gate 2 and move through a triple-height lobby via lifts, escalators and stairs.\n\nThe proposed stadium features a function room for conferences and cocktail events. (Supplied: Macquarie Point Development Corporation)\n\nOn the top level, the main function room would have views of both the playing surface and Kunanyi/Mt Wellington.\n\nIt could be set up for seated dinners, presentations and cocktail events with capacities ranging between 1,500 to 2,000 people.\n\nMovable partitions would allow multiple smaller events to run at once, while kitchen and service areas would sit nearby to cater for guests.\n\nWhat about the players?\n\nThe bowels of the stadium would be inaccessible for the majority of spectators and used primarily by athletes, officials and stadium staff.\n\nAn internal service road would wrap around the internal section, giving teams secure access to operational areas.\n\nThe lowest level of the building would be off-limits for most spectators and used primarily by stadium staff and teams. (Supplied: MPDC)\n\nDesigns suggest players would have access to warm-up areas, medical rooms and recovery facilities such as ice baths. (Supplied: MPDC)\n\nPlayers would arrive via this tunnel and head to dedicated locked rooms, warm-up areas, medical spaces and recovery facilities like ice baths.\n\nNearby, the designs also include a \"field club\" — a premium hospitality area with views into an indoor training zone.\n\nThe players would enter the field through the field club, meaning spectators enjoying a drink could offer encouragement — or the occasional sledge — directly to players.\n\nThe proposed \"field club\" on the stadium's lowest level is being billed as a premium hospitality venue, with views into an indoor training room. (Supplied: MPDC)\n\nGetting to and from the stadium\n\nThe concept designs paint a glossy picture, but the journey to and from the stadium is expected to have a major impact on how much people enjoy their day out.\n\nThe key transport study, conducted by consultancy firm WSP, found the location does \"complicate\" the city's already busy road network.\n\nDuring peak events, modelling suggests a noticeable rise in congestion along the Tasman Bridge, the Brooker Highway and key CBD roads.\n\nThe transport study suggests congestion will occur on the Tasman and Brooker highways during major events, unless specators use a mix of transport modes. (ABC News: Paul Yeomans)\n\nIn one scenario, a four-minute trip from Rosny Park to the CBD would become a 14-minute journey on the day of a major concert.\n\nThe study also found that in some cases, events at the stadium could result in overcrowding on public transport and uncomfortably large crowds of pedestrians.\n\nTo avoid gridlock, the consultants said there needed to be a \"coordinated, multi-agency\" campaign to get people out of their cars.\n\nIn its study, WSP found that for traffic to flow smoothly on the day of a sold-out Tasmania Devils game in the AFL, specific targets needed to be met in terms of the transport mix:\n\n7,500 people catching buses — 31 per cent of attendees\n\n7,300 people driving and parking nearby — 30 per cent\n\n5,400 people walking — 22 per cent\n\n2,450 people using ride share or taxis — 10 per cent\n\n735 people cycling — 3 per cent\n\n490 people on the ferry — 2 per cent\n\n490 people on private coaches — 2 per cent\n\nTo avoid gridlock during a sold-out AFL game, the transport study suggests about 7,500 people will need to catch buses to the game. (ABC News: Ebony ten Broeke)\n\nAs well as hitting that mix, the consultants said more buses would need to be added to Hobart's network and pedestrian infrastructure would need to be improved — including a pedestrian bridge over Collins Street.\n\nSo whether that journey feels smooth and efficient or slow and frustrating may depend largely on how well those targets are met.\n\nSo what happens now?\n\nIt is worth noting that the design of the stadium is only 70 per cent complete, with the final stages set to be designed by the contractor if the stadium goes ahead.\n\nThat decision will be made by Tasmania's upper house, which will debate the order to approve it on Thursday, December 4.\n\nThe vote to approve or reject the proposed Hobart AFL stadium is expected to take place in Tasmania's upper house on December 4. (ABC News: Kate Nickels)\n\nThe same order passed easily through the lower house in early November, but this time the vote is expected to be far tighter.\n\nWhatever the outcome, it will mark the end of years of argument, speculation and sharply drawn opinions.\n\nIf the project is approved, perhaps the next round of debates will instead be about finding a seat or a way home.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-29/former-premier-peter-gutwein-hobart-afl-stadium-poorly-sold/106079926",
    "title": "Former premier says Tasmania's stadium proposal has been 'poorly' sold",
    "publish_date": "Fri, 28 Nov 2025 21:31:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "It has seen thousands take to the streets in opposition or support, MPs defect from the Liberal government, and a premier put it all on the line.\n\nHobart's proposed waterfront stadium has dominated the political landscape for years, and now it is about to come to a head with Legislative Councillors days away from the crucial vote.\n\nBut little about the events of the past four years has surprised former premier Peter Gutwein, who always expected a new stadium was going to be \"a challenging fight\".\n\n\"Every stadium that's been built in the world has had bitter fights,\" Mr Gutwein told the ABC.\n\n\"The arguments that went on for a decade in Perth, the challenges with the Adelaide Oval.\n\n\"It was always going to be an easy target for people because it's very easy for those who oppose the stadium to point to the cost of it as opposed to other uses for that money.\"\n\nThe fate of the proposed Macquarie Point stadium will finally be decided on December 4. (Supplied: MPC)\n\nThe 23,000-seat stadium at Macquarie Point may be firmly associated with Premier Jeremy Rockliff, but it was Mr Gutwein who kicked it all off.\n\nHe was in the midst of negotiating with the AFL to secure the 19th licence — arguably the most serious push in a decades-long crusade for Tasmania to have its own AFL team.\n\nBut the 18 club presidents still had reservations.\n\n\"They were all well aware of what happened with the Gold Coast when it first came in 20 years ago,\" Mr Gutwein said.\n\n\"That attraction and retention of players and personnel was very difficult, and they had a revolving door simply because they didn't have the necessary infrastructure.\n\n\"That came at a cost to the entire league and to the clubs as a result.\"\n\nLoading...\n\nOn top of that, two reports had already recommended that Tasmania consider building a new stadium.\n\nIt was with this in mind that Mr Gutwein decided to announce plans to build a 27,000-seat stadium at Regatta Point.\n\nMr Gutwein resigned before the deal was finalised, and back then, the team was not contingent on a stadium.\n\n\"As negotiations progressed, it didn't surprise me that the two were linked together, but it certainly wasn't something that I had contemplated at the time,\" he said.\n\nA 2019 Tasmanian AFL taskforce report outlined the state's need for a new inner-city stadium. (ABC News: Matthew Growcott)\n\nThe former premier has mostly stayed out of the limelight since he left politics.\n\nHe has watched on as his good friend and successor, Mr Rockliff, has waged his way through stadium drama, but Mr Gutwein has not weighed in — until now.\n\n\"At times, the AFL have sold this very poorly,\" Mr Gutwein said.\n\n\"I think that they did need to stand up early in the piece and make the point that when looking at what had happened in recent history with clubs like the Gold Coast, a lack of appropriate infrastructure was detrimental to the club and to its growth and to its success.\n\n\"And that, importantly, the reason that the stadium was linked to the deal now was to ensure that Tasmania had the best opportunity for success from day one. That's never been clearly articulated.\"\n\nAsked if the Tasmanian government had also sold the project poorly, Mr Gutwein simply said Mr Rockliff had had a \"difficult road\" and not a lot of clear air.\n\nJeremy Rockliff has become the driving force behind the proposed Macquarie Point stadium. (ABC News: Jessica Moran)\n\nStadium proposal led to Liberal defections\n\nWhile Mr Gutwein said he always knew the stadium issue would be \"brutal\", there was one thing that surprised him — that it was turned into a Project of State Significance.\n\nThat was because of two former Liberal MPs: John Tucker and Lara Alexander.\n\nWhen Mr Rockliff assumed the premiership in April 2022, negotiations were still underway, and the Liberals were in the majority.\n\nThe AFL at this point had become very keen on the idea of a stadium. It just wanted it in a different location — at Macquarie Point.\n\nLara Alexander says there was a significant lack of detail surrounding the Macquarie Point proposal when it was initially brought forward. (ABC News: Maren Preuss)\n\nFor Ms Alexander, it was the change of location and lack of detail around the eventual AFL agreement that started to raise concerns.\n\n\"You think, 'OK, well it's a capital development project, information will be made available,'\" she said.\n\n\"So, I was seeking information, and there was no information.\n\n\"I didn't receive anything, and when I asked for it, it was basically just the one page of talking points.\"\n\nIn May 2023, Ms Alexander and Mr Tucker announced they would be quitting the Liberal Party and moving to the crossbench due to concerns about a lack of transparency around the stadium deal and Marinus Link.\n\n\"We tried to be honest, we tried to get information because this is a move that you cannot do lightly,\" Ms Alexander said.\n\n\"I mean, we were both very aware of the consequences.\"\n\nJohn Tucker, along with Ms Alexander, ultimately resigned from the Liberal party over the stadium debacle. (ABC News: Maren Preuss)\n\nIn return for confidence and supply, the premier agreed to make the AFL deal public and put the stadium through the Project of State Significance process.\n\nAll the while debate around the stadium continued to intensify.\n\n\"Because of the AFL as an organisation's unwillingness to compromise, we were put in this sort of take it or leave it situation,\" political analyst Richard Eccleston said.\n\n\"I think that makes the politics more divisive and really difficult for both sides.\n\n\"It is a bit of a distraction in terms of the other issues that we perhaps should be discussing and grappling with.\"\n\nRichard Eccleston says the AFL's unwillingness to compromise over the stadium has made the issue more divisive. (ABC News: Ebony ten Broeke)\n\nEconomist questions 'intangible' benefits\n\nIn September this year, after years of debates and protests, the Tasmanian Planning Commission (TPC) handed down its assessment of the stadium. It recommended the project not proceed.\n\nThat did not deter Mr Rockliff, who said he wanted to prove to the rest of the country that \"projects such as this can go ahead\".\n\n\"What the report has massively underestimated, though, is the economic and social value of such a precinct redevelopment,\" he said at the time.\n\nThe TPC recommended the stadium be rejected, due to its size and poor economic case. (Supplied: MPDC)\n\nEconomist John Madden is sceptical about that argument.\n\n\"Did they underestimate those intangible benefits? It's possible, but gee, they would've had to underestimate by a long way to turn the story around on the stadium,\" he said.\n\n\" I couldn't envisage intangible benefits big enough to make the stadium benefits greater than its costs or anywhere near its costs. \"\n\nMeanwhile, the estimated cost of the stadium has blown out from $715 million to $1.13 billion.\n\nThe government maintains it will put in no more than $375 million in capital; however, the Macquarie Point Development Corporation will take on almost $500 million in borrowings.\n\n\"Government debt is government debt, and that's a cost that Tasmanians will have to wear in the future,\" Mr Madden said.\n\n\"They've got a lot of debt to consider. This will just add a bit more to it.\"\n\nThe $1.13 billion stadium is slated to be built on Macquarie Point in Hobart. (Supplied: Macquarie Point Development Corporation)\n\nThe TPC report estimated the stadium will add $1.8 billion in debt over the decade. The state is already predicted to hit $10 billion of net debt by 2028.\n\n\"If you go on with the project, the state debt position will be a bit worse,\" Mr Madden said.\n\n\"It's not the major story, but it's not going to help.\n\n\" Of course, Tasmania can do it. They can achieve it. But it's not what you should be doing if you can possibly avoid it. \"\n\n'It's not just today's generation that will benefit'\n\nBut for Mr Gutwein, the cost of the stadium and the plan to fund it through borrowings is justifiable.\n\n\"I've never had an issue with intergenerational assets being funded by intergenerational debt,\" he said.\n\n\"We do that with bridges, we do it with hospitals. In terms of the stadium, it's not just today's generation that will benefit.\"\n\nPeter Gutwein says young people would continue to flood out of Tasmania if the stadium is rejected. (ABC News: Kate Nickels)\n\nWatching from the bench for the past few years has been \"excruciating at times\" for Mr Gutwein, who is now the president of the Northern Tasmanian Football Association.\n\nBut that stress does not compare to how he will feel during the upcoming vote in the Legislative Council, which will seal the stadium's fate.\n\n\"[If it fails] it'll be the biggest lost opportunity that Tasmania has ever had,\" he said.\n\n\"We're on the cusp of changing the state, I think, for the better.\n\n\"If the vote is no, I think that will crush confidence.\n\n\"We will see significant challenges in Tasmania moving forward, and I think that we'll continue to see an exodus of young people looking for opportunities elsewhere out of the state.\"\n\nLara Alexander says she is a little \"sad\" about how the stadium debate has unfolded across Tasmania. (ABC News: Maren Preuss)\n\nMs Alexander is a little \"sad\" when she reflects on how the stadium saga has unfolded.\n\n\"It's caused a lot of ruptures and frictions in Tasmanian society, in the community, and it shouldn't have been like that,\" she said.\n\n\"Projects like this should be about unifying people.\"\n\nNo longer in politics, she is well aware of the importance of Thursday's vote.\n\n\"Whatever decision they make is going to have such huge ramifications in the future,\" she said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/world/asia/floods-in-southern-thailand-20251129-p5njfr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Floods in southern Thailand",
    "publish_date": "Sat, 29 Nov 2025 12:43:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Floods in southern Thailand\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/nice-to-be-back-oscar-piastri-lands-early-blow-at-decisive-qatar-grand-prix-20251129-p5njfe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Nice to be back’: Piastri lands early blow at decisive Qatar Grand Prix",
    "publish_date": "Sat, 29 Nov 2025 12:30:25 +1100",
    "category": "sports",
    "authors": [
      "Ian Chadband"
    ],
    "text": "Oscar Piastri has grabbed a crucial pole for the sprint at the Qatar Grand Prix – the race where he must thrive or give up any hope of winning the world title – and declared: “Nice to be back!”\n\nThe Australian ace, who’s had a wretched run over the last month-and-a-half, looked back in harmony with his McLaren as he celebrated “a day when things clicked” again.\n\nWhile he enthused about his much-needed change of fortunes on Friday, his McLaren teammate and championship leader Lando Norris settled for third on the grid behind second-placed George Russell’s Mercedes.\n\nTop sprint qualifier Oscar Piastri Credit: Getty Images\n\nIt sounded as if Norris was already resigned to his 24-point lead over Piastri shrinking after Saturday’s shoot-out as he shrugged: “I’d be stupid not to try and win, but it’s impossible to overtake so I will probably finish P3. Getting past George Russell on the line is probably the best I can hope for.”",
    "source": "SMH",
    "cluster_id": 7
  },
  {
    "url": "https://www.smh.com.au/culture/music/skyhooks-guitarist-bob-starkie-dies-aged-73-20251129-p5njfq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Skyhooks guitarist Bob Starkie dies aged 73",
    "publish_date": "Sat, 29 Nov 2025 12:27:33 +1100",
    "category": "entertainment",
    "authors": [
      "Alexander Darling"
    ],
    "text": "One of Australia’s most culturally significant rock bands, The Skyhooks, is mourning the death of their rhythm guitarist.\n\nThe band has announced Bob “Bongo” Starkie died earlier on Saturday at the age of 73, after a battle with leukaemia.\n\nBob “Bongo” Starkie (right) at the height of the Skyhooks era.\n\n“It’s with sadness in our hearts that we have to send out this news,” the band wrote on its Facebook page.\n\n“For the past year, he has fought the brave fight against [leukaemia] hoping to get back on the road to perform more shows. Music was in his blood till the very end.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/global-software-outage-triggers-australian-flight-delays-20251129-p5njew.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chaos, cancellations at Australian airports as A320 Airbus planes recalled worldwide",
    "publish_date": "Sat, 29 Nov 2025 11:56:28 +1100",
    "category": "finance",
    "authors": [
      "Chris Zappone",
      "Alexander Darling"
    ],
    "text": "He said this was a result of a recent software upgrade, which now had to be reversed on each aircraft before they could fly again. The updates take two to three hours. “We have 85 [A320] aircraft [in our fleet]. However, only 34 of the aeroplanes have this anomaly identified.” Long check-in lines at Sydney’s domestic airport. Credit: Sitthixay Ditthavong He added: “I think the authorities in Europe and the manufacturer have done a great job in identifying this issue very promptly. “The engineering team are able to change the software status of that computer onboard the airplane, so they need to physically get on board and do that process and then carry out sort of like control checks.”\n\nMelbourne Airport’s Chief of Aviation Jim Parashos said all hands were on deck to help Jetstar. “We have engineers taking a look at the aircraft on the ground, and we will get them on their way as soon as we can,” he said. Thousands of people have had their plans upended by the nearly 100 flight cancellations on Saturday morning. Credit: Sitthixay Ditthavong “I’ve spoken to a lot of travellers that are heading up to Byron and the Gold Coast [for schoolies]. We appreciate their frustration, but they’ve been very understanding.” Sydney Airport said it was “supporting Jetstar as they work to resolve the issue and strongly advise all Jetstar customers to check their flight status with the airline before travelling to the airport”.\n\nFootage from Melbourne Airport on Saturday morning shows crowds and chaos as passengers try to figure out what is happening with their flights. Saturday morning’s delays in Australia also come after a fire forced the evacuation of Melbourne Airport’s Terminal 1 on Friday night. Travellers trying to get to schoolies on the NSW-Queensland border are among those affected by Saturday’s disruptions. Credit: Sitthixay Ditthavong At Sydney Airport, domestic terminal 2 was extremely crowded by 10.30am. Virgin Australia operates only four A320s, all of them in its regional Western Australia business. The Brisbane-based airline expects to cover any disruptions with its existing capacity in its Boeing 737 fleet.\n\n“We do not anticipate any impact to either Virgin Australia or our Regional Airline operations,” a spokesperson said. A Qantas source said while it had some A320s in WA, the issue was not affecting its aircraft. A sobering sight for travellers. Credit: Sitthixay Ditthavong Air New Zealand says it has cancelled 12 flights in response to the Airbus order. Chief Safety and Risk Officer Nathan McGraw said aircraft affected by the software recall were issued a fresh directive on Saturday, allowing affected aircraft to continue operating until 10.59am AEDT.\n\n“This means that, where possible, we can operate A320 services today before commencing the required updates,” he said. “Air New Zealand will begin rolling through the updates to its A320 fleet as quickly as possible to minimise ongoing disruptions.” There are 2274 Airbus A320s in service in the Asia-Pacific region, more than any other single region globally, according to Cirium aviation analytics company. Europe’s Airbus said it was ordering immediate repairs to 6000 of its widely used A320 family of jets.\n\nThe setback appears to be among the largest recalls affecting Airbus in its 55-year history and comes weeks after the A320 overtook the Boeing 737 as the most-delivered model. There are about 11,300 A320-family jets in operation, including 6440 of the core A320 model, which first flew in 1987. About 3000 A320-family jets were in the air when Airbus issued its bulletin to more than 350 of the plane’s operators. Earlier, Airbus released a statement saying “a recent event involving an A320 Family aircraft has revealed that intense solar radiation may corrupt data critical to the functioning of flight controls”.\n\nAirbus said it subsequently identified “a significant number” of its aircraft which may be affected. Reports say the incident in question involved a JetBlue flight from Cancun, Mexico, to Newark, New Jersey, on October 30, during which several passengers were injured after a sharp loss of altitude. Inside an Airbus A320-200 aircraft cabin. Credit: Getty Images The flight made an emergency landing in Florida and prompted an FAA investigation. Cebu Pacific, which flies from Sydney and Melbourne to the Philippines, also took to X to confirm it is affected.\n\nLoading It urged passengers travelling within the next two days to check their flight’s status on the website “before heading to the airport”. Overseas, the world’s largest A320 operator, American Airlines, said some 340 aircraft – 70 per cent of its A320 fleet – would need the fix. In Colombia, the recall is also affecting 70 per cent of the airline Avianca’s fleet. The airline has closed ticket sales until December 8. Other airlines said they would take planes briefly out of service to do the repairs, including Germany’s Lufthansa, India’s IndiGo, and UK-based easyJet.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/politics/western-australia/turmoil-embroils-city-of-perth-as-acting-ceo-accuses-lord-mayor-of-unlawful-motion-20251128-p5nje7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Turmoil embroils City of Perth as acting CEO accuses lord mayor of ‘unlawful’ motion",
    "publish_date": "Sat, 29 Nov 2025 11:46:56 +1100",
    "category": "finance",
    "authors": [
      "Carla Hildebrandt"
    ],
    "text": "The City of Perth is facing fresh internal turmoil after acting chief executive officer Peta Mabbs alleged Lord Mayor Bruce Reynolds acted unlawfully by pushing through an urgent workplace culture motion shortly before she quit.\n\nAt the November 18 council meeting, Reynolds introduced an urgent motion to appoint law firm Mills Oakley to carry out a workplace culture review with a budget of up to $125,000.\n\nThe City of Perth Council. Credit: City of Perth\n\nHowever, in a brief prepared for an agenda briefing session on December 2, Mabbs, standing in for chief executive Michelle Reynolds who is on leave, claimed the decision was “not a lawful decision and therefore can not be implemented”.\n\nIn the item, Mabbs claimed councillors were given just six minutes to read the motion before voting, with no reason was provided for the urgency, questions were not allowed, and the lord mayor moved straight to a vote, depriving council of the information required to make an “informed decision”.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/victoria/melbourne-airport-terminal-evacuated-travel-chaos-after-suspected-fire-20251128-p5njdx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cause of Melbourne Airport fire still unknown after mass evacuation",
    "publish_date": "Sat, 29 Nov 2025 11:27:12 +1100",
    "category": "finance",
    "authors": [
      "Isabel Mcmillan",
      "Alexander Darling"
    ],
    "text": "Melbourne Airport says it’s too early to speculate on what caused a fire at Terminal 1 on Friday night, forcing passengers to evacuate and their flights to be rescheduled.\n\nIt took an hour to extinguish the fire, which broke out at 7pm and forced the evacuation of hundreds from the Qantas terminal.\n\nThe airport’s chief of aviation, Jim Parashos, spoke on Saturday morning, saying the terminal was operating as normal while investigations continued. Officers said it was not believed to be suspicious.\n\n“There were naturally a lot of delays last night with disruptions due to the delays of outbound aircraft. Naturally, aircraft that had arrived safely into Melbourne needed to hold off until those departures vacated those gates. So we had anywhere between 60 to 180 minutes,” he said.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/brilliant-finish-extends-matildas-lead-20251129-p5njfm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brilliant finish extends Matildas' lead",
    "publish_date": "Sat, 29 Nov 2025 10:40:59 +1100",
    "category": "sports",
    "authors": [],
    "text": "Brilliant finish extends Matildas' lead\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/wbbl-match-called-in-bizarre-scenes-20251129-p5njfg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WBBL match called in bizarre scenes",
    "publish_date": "Sat, 29 Nov 2025 09:55:32 +1100",
    "category": "finance",
    "authors": [],
    "text": "WBBL match called in bizarre scenes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/wini-heatley-hid-brother-s-death-from-matildas-teammates-for-a-week-20251129-p5njex.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wini Heatley hid brother’s death from Matildas teammates for a week",
    "publish_date": "Sat, 29 Nov 2025 09:30:03 +1100",
    "category": "lifestyle",
    "authors": [
      "Emma Kemp"
    ],
    "text": "Until the big screen silently briefed the Gosford crowd, the public had no idea who the black armbands were for.\n\n“Tonight, the CommBank Matildas are wearing black armbands, as we acknowledge and stand with Winonah Heatley and her family during a time of loss,” the message read just before the warm-up.\n\nWini Heatley gets a hug from Ellie Carpenter at full-time in Gosford. Credit: Getty Images\n\n“If you or someone close to you is struggling with mental health, please know support is available … Nearly 1 in 5 people experience a diagnosable mental disorder each year, and over two in five will experience one in their lifetime. You’re not alone - our community stands with you.”\n\nIt was only after Heatley’s assured central defensive display had helped Australia to Friday’s 5-0 romp over New Zealand that it became clear the 24-year-old had kept her brother’s death from teammates for almost an entire week.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/the-good-the-bad-and-the-ugly-looking-under-the-hood-of-a-bizarre-wallabies-season-20251126-p5nioj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The good, the bad and the ugly: Looking under the hood of a bizarre Wallabies season",
    "publish_date": "Sat, 29 Nov 2025 09:30:00 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "So let’s look under the hood of Australia’s year. The good Two-thirds of the Lions series: Defying all the condescending predictions, the Wallabies turned up against the British and Irish Lions. They lost the series 2-1 against the star-studded Lions, but with the Wallabies getting better with each game, it could have easily swung the other way if a contentious call at the end of the second Test in Melbourne had gone the other way. In three Tests, the cumulative score was 68-67 to the Lions. It didn’t add up to victory, but it was an enthralling series, and showed Australia could beat the world’s best. South Africa success: That was evident again when the Wallabies knocked off the world No.1 Springboks in Johannesburg next up. The critics, again, had mocked Australia. But after conceding 20 points in 18 minutes, the Wallabies then routed the hosts, scoring 38 unanswered points. It was a win for the ages and the true believers, and the Wallabies almost repeated the dose a week later in Cape Town. Australia, at this point, were back, baby.\n\nWill Skelton: He was only on the field for 227 minutes of the Wallabies’ total of 1200 minutes in 2025, but the giant lock was still their most influential player. Skelton almost single-handedly took on the Lions in the second and third Tests, physically and mentally. That continued in South Africa. In four massive Tests with Skelton on deck the Wallabies’ cumulative score was 108-103 with a 50 per cent win rate. Guns blazing in Townsville: The hairy-chested belief of the new Wallabies was never more apparent than in Townsville against Argentina when they turned down a draw to go for a win after the siren. And got it. Harry Wilson pointed to the corner with a “let’s f---ing go”, and the Australian public agreed. Max aura: Of many good candidates for Australia’s best in 2025 – Fraser McReight, Wilson, Skelton, Tom Hooper and Len Ikitau – the star who shone brightest was 21-year-old Max Jorgensen. Time and again, the young flyer delivered on the big stage with solo tries he had no place scoring. A special talent. The bad\n\nOne-third of the Lions series: Forget being happy with a competitive effort, the Wallabies could have (should have?) won the Lions series. But they were physically insipid (not picking Skelton was an all-time bad call) for the first 50 minutes in Brisbane, and the killer blow was the second half hour in Melbourne, when the Wallabies gave up most of their 23-5 lead. The decision on Jac Morgan’s cleanout was a howler, but it wasn’t why Australia lost the game, and thus the series. Will Skelton’s physicality was vital against the British and Irish Lions. Credit: Getty Images\n\nBotched Bledisloe: The Wallabies had a genuine chance to beat New Zealand in Auckland and end the 39-year Eden Park curse. But they botched it by falling behind early, as they’d done all year: 19 points down against the Lions, 22 against the Boks and 21 against Argentina. Wallabies fightbacks – and some wins – showed character and resilience but, unsurprisingly, giving up big leads is not a path to sustained success. And so it proved in another losing Bledisloe Cup series. Passive defence: Most teams are aggressive with their line speed in defence, but the Wallabies persist with a passive, connected strategy – essentially conceding the gain line but not offering gaps in most parts of the field. It routinely allows rivals to make worryingly easy ground and set up camp in Australia’s half. The Wallabies conceded an average of 27.4 points during the year, and most of the world’s top five sides average fewer than 20. There is time for a rethink. The ugly\n\nWinless European tour: Enough said. Four losses in Europe, two record scores conceded and a get-out-of-jail result against Japan. The calm confidence, resilience and hard-won self-belief washed away in real time. Australia come to terms with the shock loss to Italy in Udine. Credit: Getty Images Prioritising tomorrow over today: The loss to Italy was a prime example of the self-destructive thinking in Australian rugby for many years: using Tests as opportunities to provide “experience”. Australian rugby needs better depth, for sure. But rightly or wrongly, it cannot survive, let alone thrive, without Test wins. Picking anything other than the strongest team each week has led to a string of humbling and confidence-sapping losses. Forget prepping for the future and focus on building belief in the present. Australia’s James O’Connor takes on the All Blacks’ defence. Credit: AP Ten lotto and JOC handling: Schmidt is a first-rate coach, but his handling of the No.10 position – and particularly James O’Connor – this year has been perplexing. The No.10 jersey changed hands often, and while some of that was injury-related, the cohesion and game management clearly suffered. Schmidt’s recalling of O’Connor to the starting side after a trip to England (for a game against New Zealand) and a holiday (to play Ireland) also seemed unnecessarily messy. So too letting him leave the squad before the France game. Meanwhile, we are all a year older and still have no idea who is Australia’s preferred No.10.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/jetstar-flights-grounded-after-global-plane-recall-20251129-p5njfa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jetstar flights grounded after global plane recall",
    "publish_date": "Sat, 29 Nov 2025 09:17:34 +1100",
    "category": "finance",
    "authors": [],
    "text": "Jetstar flights grounded after global plane recall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/beach-safety-concerns-rise-after-another-fatal-shark-attack-20251129-p5njf8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beach safety concerns rise after another fatal shark attack",
    "publish_date": "Sat, 29 Nov 2025 09:13:56 +1100",
    "category": "finance",
    "authors": [],
    "text": "Beach safety concerns rise after another fatal shark attack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/movies/ariana-grande-has-worked-for-this-moment-her-whole-life-but-will-it-be-enough-to-win-her-an-oscar-20251121-p5nhd2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ariana Grande has worked for this moment her whole life. But will it be enough to win her an Oscar?",
    "publish_date": "Sat, 29 Nov 2025 09:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Advertisement\n\nAdvertisement\n\nGrande’s approach to her five Wicked auditions made Chu feel like he had met “the real Glinda” for the first time. Loading On the surface, training started six months beforehand, with daily acting and voice lessons between The Voice (US) commitments. (Although Grande, who was a coach on the show in 2021, has a four-octave vocal range that extends to a whistle register, she needed to master an operatic style for Glinda, particularly for No One Mourns the Wicked.) Chu may have been worried Grande’s fans wouldn’t be able to see Glinda past the pop superstar - but some would argue they can’t see Grande without glimpsing Glinda. The Wizard of Oz has been Grande’s favourite film since she was four. In 2003, Grande played Dorothy Gale in a community theatre show in Florida, and met Kristin Chenoweth backstage after watching the original Wicked Broadway production. Grande with her late grandmother, Marjorie Grande, and Kristin Chenoweth, who originated the role of Glinda on Broadway. Here, they are pictured backstage at Wicked in 2003. Credit: Instagram/Kristin Chenoweth When her grandfather died 11 years later, Grande sang Somewhere Over The Rainbow at his funeral. She sang it again in 2017 to close the One Love Manchester benefit concert, held two weeks after 22 people died in a bombing at her concert. And again to open the 2025 Oscars.\n\nAdvertisement\n\nUniversal Pictures first announced a Wicked film adaptation was in the works in 2012. Grande – who, a year prior, tweeted Glinda was her “#DreamRole” – spent the nine years it was stuck in development hell “hunting” power producer Marc Platt for the chance to audition. Loading “I have never wanted something as badly as I did this,” Grande told Zach Sang in February 2024. “I had no expectations, I was just thankful to go in at all, I was so excited to have the opportunity to audition.” It was the “best day of [her] life” when she found out she would be playing Glinda, and she bleached her hair (and eyebrows) for the role – a huge commitment after Grande’s catastrophic hair damage from four years of bleaching and dyeing it red for Nickelodeon’s Victorious. For three years, Grande was visibly Glinda-fied. But it was only in November that she revealed the extent of her internal metamorphosis, helped by using the Stella Adler technique to scrupulously devise the character’s childhood, inner life and traumas. Elphaba Thropp (portrayed by Cynthia Erivo in the films) was also a dream role for Grande, who is pictured here in glitter-green lipstick performing The Wizard and I for a 2018 televised Wicked Halloween special. Credit: NBCU Photo Bank/NBCUniversal via Getty Images Grande, pictured here performing Defying Gravity with Erivo at the 2025 Oscars, spent three years with bleach-blonde hair and eyebrows. (If you look closely, you can see an actual ruby red slipper, like Dorothy Gale’s, on the back of her shiny Schiaparelli Haute Couture gown). Credit: Chris Pizzello/Invision/AP\n\nAdvertisement\n\nUniversal Pictures’ Wicked: For Good Oscars campaign has been going for almost two years, kicking off with Erivo and Grande’s appearance at the 2024 ceremony. They dressed in green and pink, and presented the Best Original Song and Best Original Score awards. Credit: Chris Pizzello “I just wanted to design this person inside and out, even if none of it was necessary for a scene, so that I could reference it for myself and leave my own stuff at home,” Grande told the New York Times. “So every time something had to trigger Glinda, it was a Glinda trigger that I used, not an Ariana one.” Early on, according to the publication, she told Chu: “I feel closer to Galinda [Glinda’s original name] than maybe even Ariana Grande. I understand that struggle between trying to give people light and trying to understand where my light comes from myself.” But it wasn’t enough to earn her a Best Supporting Actress Oscar, BAFTA, Golden Globe, Actor Award (formerly Screen Actors Guild), nor a Critics Choice Award, all of which she was nominated for, last awards season. It’s not as if the critics – who lauded Grande’s comedic timing and emotional depth in Part One and For Good – don’t like movie-musicals. Actresses who have won Oscars for supporting roles in movie-musicals Rita Moreno, West Side Story (1961) Catherine Zeta-Jones, Chicago (2002) Jennifer Hudson, Dreamgirls (2006) Anne Hathaway, Les Misérables (2012) Ariana DeBose, West Side Story (2021) Zoe Saldaña, Emilia Pérez (2024) Grande lost all of those gongs to Zoe Saldaña’s performance in cursed crime musical Emilia Pérez. Other recent Oscar winners in the category include Ariana DeBose for West Side Story, and Anne Hathaway for Les Misérables (another notable physical transformation).\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/style-scorecard-the-aussie-brands-making-golf-fashion-cool-20251126-p5nikn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Style scorecard: the Aussie brands making golf fashion cool",
    "publish_date": "Sat, 29 Nov 2025 09:00:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "When it comes to fashion, golf has a significant handicap.\n\nTennis has Carlos Alcaraz modelling for French luxury label Louis Vuitton; F1 driver Lando Norris appeared in the October issue of British Vogue wearing Saint Laurent; and horse racing has more hats than a royal wedding.\n\nAt its best, golf has Rory McIlroy in water-repellant pants and polo shirts from Nike and Adam Scott in functional Uniqlo items that will fail to turn the fairway into a runway at the Australian Open at Royal Melbourne on Thursday.\n\nHappy Gilmore (Adam Sandler) takes on big-money corporate golf in Happy Gilmore 2. Credit:\n\nAt its worst there’s Adam Sandler in Happy Gilmore 2 wearing oversized hockey jerseys.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-australian-youth-identify-cost-of-living-as-top-concern-in-survey/0iqytymby",
    "title": "INTERVIEW: Australian youth identify cost of living as top concern in survey",
    "publish_date": "Fri, 28 Nov 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nMission Australia's annual youth survey has revealed the most important issue to young Australians.\n\n\n\n\n\nMore 17,000 people aged 14 to 19 took part in the survey's 24th edition.\n\n\n\n\n\nFor the second year in a row, cost of living was the top issue, with more than two thirds of respondents identifying it as a key concern.\n\n\n\n\n\nClimate change, mental health and housing were also listed as key challenges.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/how-olympias-maggot-farms-are-helping-to-tackle-a-36-billion-problem/slatxh81t",
    "title": "How Olympia’s 'maggot farms' are helping to tackle a $36 billion problem",
    "publish_date": "Fri, 28 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhen it comes to cleaning up food waste, startup founder Olympia Yarger is proud to have developed a technical system to convert waste into useable products – with insects.\n\n\n\n\n\n\"We're using black soldier fly larvae so they technically are maggots, which makes everyone a little bit squeamish. But these are a really great insects because they consume food waste as their job and they're a non vector, non pest species. So they're very easy to farm without risk.\"\n\n\n\n\n\nAt the GOTERRA factory in Sydney’s west, insects are growing fat on left over food. And while farming fly larvae isn’t for everyone – Ms Yarger says she’s found her niche!\n\n\n\n\n\n\"When it comes to maggots in a box, managing food waste and delivering a protein in the world, we’re number one.\"\n\n\n\n\n\nIt’s a win-win for GOTERRA, the insects pump out fertiliser for farms.\n\n\n\n\n\nAs chief sustainability officer Justin Frank explains, at the end of their life cycle the larvae are sold as chicken feed.\n\n\n\n\n\n\"The chickens love it. They're designed to eat larvae and bugs, so they love it. It's really good for their gut health, but it's also full of amino acids that helps them produce eggs.\"\n\n\n\n\n\nAnd there’s no shortage of food waste to process, with more than 7.6 million tonnes dumped every year.\n\n\n\n\n\nDr Lisa Bai is a research fellow at the University of Queensland's School of Chemical Engineering – and a food waste expert.\n\n\n\n\n\n\"(It's) costing the Australian economy around 36 billion every year. to each household it's probably causing us to waste about $2,500 every year. That's really a shocking number!\"\n\n\n\n\n\nState governments are taking action around household waste. In several states, including NSW, businesses will soon be asked to step up, too!\n\n\n\n\n\nAlexandra Geddes is executive Director Programs and Innovation at the New South Wales Environment Protection Authority or EPA.\n\n\n\n\n\n\"Next year there are new rules coming in for food recycling and for reducing the amount of food waste that ends up in our landfills. From the 1st of July, 2026, large food generating businesses such as hospitality venues, educational institutions, correctional centres, and supermarkets will need to separate their food waste from their general waste. By 2030 all households across New South Wales will need to separate their waste.\"\n\n\n\n\n\nWhy the new rules? Well, Ms Geddes says we’re simply running out of room.\n\n\n\n\n\n\"There is a landfill crisis. We will be running out of landfill capacity by 2030. We know that between a quarter and a third of the waste generated is food waste. We need to keep this out of landfills.\"\n\n\n\n\n\nAdvocates say halving food waste by 2030 could deliver a $58 billion net benefit to the economy – but there are challenges, too as Dr Bai explains.\n\n\n\n\n\n\"The biggest growing problem for food waste treatment and management is contamination. Contamination levels are rising. We're not just finding metals and glass in the waste, we're also seeing in PFAS and microplastics accumulating in this waste. And this is introducing a real risk.\"\n\n\n\n\n\nWhich is why we all need to clean up our act, according to the EPA’s Ms Geddes:\n\n\n\n\n\n\"The rules are incredibly clear. It's only food waste and food scraps that goes into source separation for food, no plastics, no metals, nothing else. And we know that our communities are adopting this at the household level. And we know that this is what businesses are going to do when mandates come in from next year because it's so important to keep a clean stream of organic material to be used in items like compost.\"\n\n\n\n\n\nSorting plastic from food is a slow process, but Ms Geddes says every repurposed kilogram helps the environment.\n\n\n\n\n\n\"When food waste degrades in a landfill, it releases methane. Methane is a greenhouse gas 24 times stronger than carbon dioxide. So there are real benefits to reducing emissions by separating our food and allowing it to be turned into compost.\"\n\n\n\n\n\nSheep farmer turned entrepreneur Olympia Yarger says extracting value from food waste is also good business.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-australian-suburbs-where-home-values-have-more-than-doubled-in-five-years/3hfye21xy",
    "title": "See the list: The Aussie suburbs where home prices more than doubled in five years",
    "publish_date": "Fri, 28 Nov 2025 19:31:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Nearly 200 Australian suburbs have more than doubled in value over the past five years, with Queensland suburbs leading the list, counting 93 areas with value increases of 100 per cent.\n\n\n\n\n\nThe figures from Domain's latest house price report reveal an uptick in desirability for regional suburbs far from the CBD.\n\n\n\n\n\nSouth Australia's Davoren Park, once known as one of Adelaide's most disadvantaged suburbs, saw property values increase by nearly 200 per cent in five years.\n\n\n\n\n\nWhile Queensland has the highest number of suburbs that doubled in value, South Australia's prices have increased significantly over the past five years — six of the nine suburbs with growth of more than 150 per cent were situated in suburban South Australia.\n\n\n\n\n\nJoel Bowman, senior economist at Domain, said the shift was \"remarkable\".\n\n\n\n\"I think it'd be hard to characterise South Australia as affordable,\" he told SBS News.\n\n\n\n\n\n\"I would say it's now more expensive to buy a home in Adelaide than in Melbourne.\"\n\n\n\nThe suburbs with the highest growth\n\nThe local government area of City of Playford in Adelaide's north saw ten of its suburbs more than doubling in value over the last five years.\n\n\n\n\n\nThe starkest increase is in Davoren Park, with a median property value increase of 192.5 per cent over five years.\n\n\n\n\n\nIt's followed by neighbouring Elizabeth East with an increase of 175.3 per cent, Elizabeth Park with 167 per cent, Elizabeth Downs with 165.2 per cent and Elizabeth Vale with 157.1 per cent.\n\n\n\n\n\nFinally, Hackham West in Adelaide's Onkaparinga locality saw a property value increase of 152.8 per cent.\n\n\n\nWestern Australia has also emerged as a major contributor to the rise in house medians , with the value of 45 suburbs doubling over five years.\n\n\n\n\n\nSwan, north-east of Perth, and Rockingham on the south-west coast had the most number of suburbs double in value.\n\n\n\n\n\nJacobs Well in Queensland saw an annual increase of 39.6 per cent, leading to a 141.4 per cent growth in property value over five years. Nearly 100 suburbs in the state doubled in price over the same period.\n\n\n\n\n\nAcross Australia, suburbs with the highest growth were concentrated in once-affordable areas.\n\n\n\nBowman said that relative affordability was a key driver of increased migration to suburbs from the \"bottom end\" of town.\n\n\n\n\n\n\"Particularly in Queensland, Western Australia and South Australia, the areas with the biggest growth are those where prices are well below the state's typical median prices,\" he said.\n\n\n\n\n\nBowman pointed to Colebee in Blacktown North, 33 kilometres from Sydney's city centre.\n\n\n\n\n\n\"Property values there have increased more than 180 per cent over five years.\"\n\n\n\n\n\nFor property owners in these suburbs, the report signals a boon for their assets. But for renters and aspiring home buyers, it's a different story.\n\n\n\nHousing affordability crisis\n\nA recent report from global property information and analytics company Cotality (formerly CoreLogic), found housing affordability was getting worse \"across the board\" .\n\n\n\n\n\nEliza Owen, head of research at Cotality, said, \"For first home buyers, the metrics are pretty disappointing.\n\n\n\n\n\n\"There's this real disparity between where incomes are and where property prices are that shows a kind of structural shift in who can access the market.\"\n\n\n\n\n\nDomain's figures also reveal an affordability issue: the median house price in Davoren Park is now $555,000, while the median weekly household income at the latest census was just $1,161.\n\n\n\n\n\nA similar affordability gap is playing out in suburbs across Australia.\n\n\n\n\n\n\"There's been this extraordinary separation between property prices and income,\" Owen said.\n\n\n\n\n\n\"It definitely speaks to a widening in the divide of the haves and have nots when it comes to the property market.\"\n\n\n\nBowman said while the value increases in some suburbs were \"promising\", renters or people looking to move would unfortunately be facing much higher prices.\n\n\n\n\n\n\"There are winners and losers,\" he said.\n\n\n\n\n\nHe noted that Melbourne was shaping up to be an option for those seeking affordability.\n\n\n\n\n\n\"There are early signs of people coming to Melbourne,\" Bowman said.\n\n\n\n\n\n\"During the pandemic, we had a lot of people leaving Melbourne, but we have started to see this trend reverse as the city has become a lot cheaper, comparatively.\"\n\n\n\nWhat's driving skyrocketing house prices?\n\nBowman pointed to an increased interest in \"lifestyle migration\" , which began during the widespread adoption of remote work during the COVID-19 pandemic.\n\n\n\n\n\nPeople had begun to desire affordable houses in coastal or regional areas, rather than being tied to pricey city lifestyles.\n\n\n\n\n\n\"The shift towards remote working really benefited regional pockets,\" he said.\n\n\n\n\n\n\"More than eighty of the suburbs with the largest growth were in regional areas, rather than inner rings of capital cities.\n\n\n\n\n\n\"The other thing we're seeing is the tight rental markets. A surge in population in these areas resulted in record-low vacancy rates across Australia. Low vacancy rates are pushing up these property prices.\"\n\n\n\nREAD MORE Younger Australians the new seachangers moving out of the big cities\n\nBowman anticipated property prices would only rise.\n\n\n\n\n\n\"Broadly we are expecting some price growth, house prices will increase 6 per cent,\" he said.\n\n\n\n\n\nUnderpinning this projected growth are the low interest rates seen this year, coupled with the expanded First Home Buyer scheme, which Bowen said would result in more buyers getting their foot in the door.\n\n\n\n\n\nHe expected property prices to experience an uplift, especially in typically \"cheaper pockets\" as a result of the scheme.\n\n\n\n\n\n\"All in all, we've seen remarkable growth due to lifestyle migration, remote work, affordability shift and increased competition,\" Bowen said.\n\n\n\n\n\n\"Looking ahead, given the impact of the guarantee scheme, I think it will continue to improve.\"\n\n\n\n\n\n— With additional reporting from the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-australia-can-learn-from-japan-south-korea-global-content-success/kihj9n86r",
    "title": "'Time to step forward': Australia could be making billions with this untapped export",
    "publish_date": "Fri, 28 Nov 2025 19:30:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Eleanor Gray borrowed a Hello Kitty DVD from her local library in Melbourne at the age of five, a door to a foreign world opened to her.\n\n\n\n\n\nThat was the day she discovered the Japanese series Sailor Moon — via a preview trailer on the DVD — and fell in love with Japanese animation (anime).\n\n\n\n\n\nShe began studying Japanese and cosplaying at anime conventions. Later, after watching an anime series set in a Japanese high school, she went on a university exchange to see the country herself.\n\n\n\n\n\nNow, the 28-year-old lives and works in Fukuoka, in southern Japan.\n\n\n\n\n\n\"I like to consider myself as an 'ex' otaku now,\" she tells SBS News.\n\n\n\nREAD MORE As Hello Kitty turns 50, meet the Aussie superfan who spent a house deposit on her collection\n\nOtaku is a Japanese term for people who are obsessed with a particular subject — typically computers, video games, anime and Japanese comics (manga).\n\n\n\n\n\n\"After moving and working here full-time, it's definitely less rosy; however, I still frequently find myself admiring the culture and country itself, the more I learn about it and live here.\"\n\n\n\n\n\nJapan is one of Australia's key strategic partners and the third most popular overseas travel destination among Australians.\n\n\n\n\n\nIt's developed a multi-billion-dollar content industry, capitalising on the global appeal of homegrown anime, manga and video game products, which have become central to the nation's economic and soft power.\n\n\n\n\n\nIn 2024, one year after overseas earnings from anime production exceeded its domestic revenues for the second time in history, the Japanese government launched its New Cool Japan Strategy, aiming to boost international content-related businesses to $198 billion by 2033.\n\n\n\nAustralian fans regularly flock to attend conventions like Oz Comic Con, many of which feature anime and manga. Source: AAP / SOPA Images / Sipa USA / Michael Currie With Australia launching a review of its National Cultural Policy next year, there have been calls for the government to follow allies such as Japan and South Korea to boost the export of Australian-made content.\n\n\n\n\n\nWhile experts say it may not be possible to directly replicate the success of allies in this space, there are some lessons that Australia could consider.\n\n\n\nAustralia records 'worst' trade deficit in content\n\nDespite a handful of Australian creative exports that have achieved global success over the years — such as kids series Bluey, pop star Kylie Minogue, or actress Margot Robbie — Australia has had \"one of the worst creative goods trade deficits in the world\", according to Kate Fielding, the CEO of arts and culture think tank A New Approach (ANA).\n\n\n\n\n\nIn a submission to the federal government's 2022 cultural policy review, ANA presented analysis that showed that for every $1 Australia exports in creative goods, $8 is imported from other countries.\n\n\n\nIn 2023, Arts Minister Tony Burke launched Creative Australia as part of Labor's National Cultural Policy, Revive. Source: AAP / Jane Dempster Fielding says the National Cultural Policy launched in response in 2023 still had \"limited focus on international [exports] within that\".\n\n\n\n\n\n\"There are many examples of Australian success in cultural and creative industries, and we should celebrate those, but we should also go as we do with other areas of global export,\" she says.\n\n\n\n\n\n\"I think that probably Australia has had a long journey to really developing and appreciating our own cultural and creative industries, and ... part of the lag for us as a nation has been maturing and understanding that we have excellent cultural and creative contributions to make to the world.\n\n\n\nI think it is time for us to really step forward as a mature nation and take those steps.\n\nBut producing creative work overseas can be financially prohibitive for artists.\n\n\n\n\n\nUnder the National Cultural Policy, the government has invested $69.5 million to establish Music Australia and $19.3 million for Writers Australia — both organisations provide direct support for creators to grow international audiences.\n\n\n\n\n\nA spokesperson for the Department of Infrastructure, Transport, Communications and the Arts says artists can also access funding to explore international collaboration and development via Creative Australia and Screen Australia.\n\n\n\nDespite these funding avenues, Fielding says Australia's support for arts and culture has been fragmented, and there's a lack of clarity about how Australia's cultural exports are tracking.\n\n\n\n\n\n\"I think probably the first step there would be for the Department of Foreign Affairs and Trade to do … a piece of scoping work to see what activities are currently happening, where, within different levels of government and across different agencies,\" she says.\n\n\n\n\n\n\"That doesn't need to be a comprehensive mapping.\"\n\n\n\nAustralia's soft power problem\n\nIn a speech on Australia's foreign policy earlier this month, Foreign Minister Penny Wong described Australia as the \"architect\" of the Asia-Pacific region, citing achievements in securing several geopolitical and diplomatic deals within the region.\n\n\n\n\n\nBut according to the Lowy Institute's 2025 Southeast Asia Index, while Australia ranks second in terms of its influence on defence networks in the region, it ranks ninth in terms of cultural and economic influence.\n\n\n\n\n\nAustralia's creative and cultural exports were identified in a 2017 foreign policy white paper as potential avenues for the nation to exert soft power — which is the ability to attract and influence other countries through non-military measures — along with international education, tourism and migration.\n\n\n\nFollowing the paper's release, the then-Coalition government vowed to develop new approaches to soft power and launched the first-ever Soft Power Review in 2018.\n\n\n\n\n\nHowever, the review was discontinued in October 2020, with the Department of Foreign Affairs and Trade citing impacts from the COVID-19 pandemic.\n\n\n\n\n\nMelissa Conley Tyler, an honorary fellow at the Asia Institute at the University of Melbourne, says it's time to revisit the 2017 paper, and for Australia to consider other tools of diplomatic influence beyond its security and defence assets, including arts and culture.\n\n\n\n\n\n\"We can do so much in the cultural and creative realm for really very little money compared to the amount of money that, say, defence equipment costs,\" says Conley Tyler.\n\n\n\n\n\nA spokesperson for the Department of Foreign Affairs and Trade told SBS News the department \"works closely with Australia's world-class cultural sector to showcase our creativity, values and diversity internationally\".\n\n\n\nDespite its global fame, Australia has little involvement with Bluey's international distribution and its success, as it's operated by BBC Studios. Source: AAP / Bianca De Marchi \"Our cultural exports — from film and television to literature, music, design and art — are among the best in the world. They tell the story of who we are and play an important role in strengthening Australia's voice and relationships,\" the spokesperson said.\n\n\n\nWhat can Australia learn from its Asian allies?\n\nFrom Japanese manga One Piece to the viral Korean TV series Squid Game, the cultural products of Japan and South Korea have been loved by Australians. While the two countries adopt different strategies to boost their cultural exports, they both enjoy similar levels of government support.\n\n\n\n\n\nTets Kimura, an adjunct lecturer in creative arts at Flinders University, says the Japanese government initially had very little to do with the surge of interest in anime, which began attracting international fame in the 1980s.\n\n\n\n\n\n\"[The rise of anime] happened organically, picked up by the Japanese consumers first, then picked up by the foreign consumers,\" he tells SBS News.\n\n\n\nThe whole movement happened outside of government control.\n\nAs demand for anime grew, so did its profitability.\n\n\n\n\n\nIn 2024, the anime industry contributed a record JPY3.84 trillion ($37.8 billion) to Japan's economy, according to the Association of Japanese Animations. Of that, JPY$2.17 trillion ($21.4 billion) was generated from overseas anime content.\n\n\n\n\n\nBut the anime boom has also come hand in hand with a surge in piracy, which reportedly costs the country billions each year. A 2023 study commissioned by a Tokyo-based anti-piracy group and conducted by accounting firm PwC estimated losses totalling JPY$1.95 trillion ($19.2 billion).\n\n\n\n\n\nAccording to Kimura, the growing revenue from international consumers, coupled with the huge economic losses from piracy, has pushed the Japanese government to consider a new economic strategy to maximise profits from the industry.\n\n\n\nREAD MORE Why Australians are getting hooked on Korean TV\n\nIn 2019, after a decade of various government initiatives, Japan formally launched the first iteration of the Cool Japan strategy, which promotes Japan through multilateral collaboration between the government and private sector in culture, tourism, trade, education and other intellectual property.\n\n\n\n\n\n\"With major changes taking place in the environment surrounding [Cool Japan], the soft power of [Cool Japan] is an extremely potent means of ensuring Japan can maintain its presence and influence on the global stage,\" the 2019 Cool Japan Strategy paper reads.\n\n\n\n'A tool of global influence'\n\nIn contrast with Japan, the South Korean government took a more proactive approach to promoting its cultural content in the 1990s, when Korean pop music (K-pop) and South Korean cinema began to grow.\n\n\n\n\n\nDr Sung-Ae Lee from Macquarie University recalls a well-cited anecdote during Kim Young-sam's presidency between 1993 and 1998: a government adviser pointed out that the global box-office revenue of Hollywood blockbuster Jurassic Park was roughly equivalent to the foreign sales of 1.5 million Hyundai cars.\n\n\n\n\n\nSince then, successive South Korean governments — whether conservative or progressive — have launched initiatives to support the creative sector's development.\n\n\n\nREAD MORE The hit Korean show that's infiltrated schools and stereos around Australia\n\nThis includes mandating that state and local governments fund cultural sector initiatives, offering tax incentives and establishing the Korea Creative Content Agency (KOCCA), which oversees global marketing, talent development and cultural export, explains Lee.\n\n\n\n\n\nConsecutive governments have also sought to reframe political language around the impacts of South Korea's cultural exports, shifting it from the realm of economic policy to \"a tool of global influence\".\n\n\n\n\n\nLee says Australia can learn from South Korea's \"coordinated, export-driven cultural strategy\", adding that while South Korea has a one-stop agency to manage funding for cultural projects (KOCCA), Australia's support remains fragmented across several organisations.\n\n\n\n\n\n\"Australia could adopt a similar whole-of-government framework linking creative funding with trade, diplomacy and education, turning its artistic strengths into a cohesive and globally recognisable cultural brand,\" she says.\n\n\n\nTo amplify soft power, treat artists well first\n\nBut simply having a strong cultural sector doesn't necessarily elevate soft power, says Roald Maliangkay, a professor of culture, history and language at the Australian National University's College of Asia and the Pacific.\n\n\n\nDuring his Golden Globe Award speech, South Korean director Bong Joon Ho (middle in the second row) famously claimed that once audiences \"overcome the one-inch-tall barrier of subtitles\", they would be introduced to a new world. Source: AAP / EPA / Kim Hee-chul He says international consumers often view a country's cultural products through the lens of their impression of the nation.\n\n\n\n\n\nOther nations, including Saudi Arabia and China, have studied the success of South Korea's cultural sector but face challenges in attracting similar international attention, despite their unique cultural products, Maliangkay says.\n\n\n\n\n\nHe says that, although Australia has a rich history of First Nations culture and storytelling, and is viewed positively by the rest of the world, it can struggle selling its content to international audiences due to a lack of a defined modern Australian culture.\n\n\n\n\n\n\"We do not have a more modern culture that people would fondly associate with. [Also,] South Korea and Japan both have a very unique language,\" he says.\n\n\n\nOne of the things that people have really enjoyed when they listen to K-pop or watch Korean TV dramas is the idea that by learning a little bit, you gain some cultural capital.\n\nMaliangkay says Australia could look to define its uniqueness by embracing First Nations cultures: \"Because that's truly unique, and I think that's an important element.\"\n\n\n\n\n\nAt the same time, the cultural strategies of both Japan and South Korea have some limitations.\n\n\n\n\n\nKimura says the Japanese government offers little support for individual anime creators.\n\n\n\nIndividual artists and creators have played key roles in the huge success of Japan's anime sector, creating cultural icons that resonate with overseas audiences. Source: AAP / ABACA / PA / Blondet Eliot \"A lot of those people ... are really, really low paid, and a lot [of them] do not see a promised future unless there's a sacrifice made by the Japanese creators,\" he says.\n\n\n\n\n\nIn 2024, the Japanese government launched a revised policy, the New Cool Japan Strategy, to adapt to post-COVID digitisation, and acknowledged there's an \"insufficient environment for creators to engage in activities\".\n\n\n\n\n\nIn South Korea, Lee says gender imbalance in creative leadership, labour exploitation and burnout have been persistent issues affecting the cultural sector.\n\n\n\n\n\nShe also says South Korea's heavy dependence on global streaming platforms has limited its control over revenue and cultural representation —- an issue that Australia's music industry has long identified with platforms like Spotify.\n\n\n\nFor Australia to boost its cultural exports, not only should it look to proactively address some of these issues, but it has a further hurdle to overcome.\n\n\n\n\n\nConley Tyler says to make cultural exports an effective tool of soft power, they need to be \"organic\".\n\n\n\n\n\n\"They have to organically come from artists themselves, and then be sort of supported and amplified by the government,\" she says.\n\n\n\n\n\n\"I don't think the Australian government should be deciding what our creative industries are doing, but I think we should understand that they are important and that they deserve to be funded and supported, and that that's in our national interest, just as much as some of the security investments that we make.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/parliament-wraps-final-sitting-week-of-2025-with-passage-of-environmental-law-overhaul/4sc5p61mv",
    "title": "Parliament wraps final sitting week of 2025 with passage of environmental law overhaul",
    "publish_date": "Fri, 28 Nov 2025 09:10:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/nsw-parliament-repeals-so-called-brumby-bill-revoking-the-horsess-protected-status/0qbupw99c",
    "title": "NSW parliament repeals so-called 'Brumby Bill', revoking the horses's protected status",
    "publish_date": "Fri, 28 Nov 2025 09:06:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "NSW parliament repeals so-called 'Brumby Bill', revoking the horses's protected status\n\nPublished 28 November 2025, 5:49 am\n\nIt's an issue that's caused much controversy - save the wild horses, or save the ecosystem. A late-night parliamentary sitting in New South Wales has repealed laws introduced more than seven years ago reversing the so-called 'Brumby Bill'",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-billion-dollar-deportation-deal-australia-doesnt-want-to-talk-about-ft-david-shoebridge/nno1im9x4",
    "title": "The billion dollar deportation deal Australia doesn't want to talk about ft. David Shoebridge",
    "publish_date": "Fri, 28 Nov 2025 08:18:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/exclusive-el-jannah-ceo-speaks-with-sbs-as-company-goes-global-asx-rises/nd4hkjyer",
    "title": "Exclusive: El Jannah CEO speaks with SBS as company goes global & ASX rises",
    "publish_date": "Fri, 28 Nov 2025 07:28:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/chinese-noodle-house-closure-confusion/9a3q4lsxf",
    "title": "Why these near-identical Chinese restaurants have caused mass confusion",
    "publish_date": "Fri, 28 Nov 2025 04:05:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "There's nothing Australians love more than a succulent Chinese meal , as witnessed this week by the outpouring of grief following the announcement that beloved Sydney staple Chinese Noodle House will be closing in December.\n\n\n\n\n\n\"I was really sad, it's all over Instagram,\" Hope, a Sydney University student, told SBS News.\n\n\n\n\n\n\"Sydney won't be the same.\"\n\n\n\n\n\nBut news of the end of the Haymarket casual dining staple, famed for its cheap and delicious dumplings and hand-pulled noodles, has also sparked confusion.\n\n\n\n\n\nAt its location on the ground floor of a drab building on Thomas Street, there are no fewer than four similarly titled restaurants, and more can be found across greater Sydney.\n\n\n\n\n\nAll share near-identical menus, and at least two have plastic grapes dangling over the heads of diners.\n\n\n\n\n\nSo which restaurant is closing? Will another take its place? And what's the deal with the grapes on the ceiling anyway?\n\n\n\n\n\nIt turns out that underneath the surface of the Chinese Noodle House saga is what appears to be a Succession-like struggle of intertwined restaurants and one ageing patriarch.\n\n\n\nWhich restaurant is closing?\n\nIf you're facing the strip mall from the street, Chinese Noodle House is the restaurant on the right, closest to Thomas Street.\n\n\n\n\n\nTo your left, you'll find Chinese Noodle Restaurant, which also has grapes on the ceiling and a similar menu.\n\n\n\n\n\nThese restaurants share the popular outdoor dining area in the courtyard.\n\n\n\nCurrent owner Eric Zhang spoke to SBS News outside his family's restaurant. Source: SBS News Current owner, Eric Zhang, told SBS News his family had been running Chinese Noodle House since 2016.\n\n\n\n\n\n\"Our landlord sold the business to us 10 years ago,\" he said.\n\n\n\nWhy is it shutting down?\n\nA post on Chinese Noodle House's Instagram page said the restaurant was closing \"due to the landlord's unilateral decision not to renew our lease\".\n\n\n\n\n\nThis is where things get tricky, because the tenant for the past 10 years has been Zhang's mother-in-law, a former employee of the eatery across the way, Chinese Noodle Restaurant.\n\n\n\nBoth Chinese Noodle Restaurant and Chinese Noodle House were founded by now-retired patriarch Xiao Tang Qin, better known to patrons as the violinist of Thomas Street.\n\n\n\n\n\nOver three decades as a restaurateur in Sydney, Qin started 12 Chinese Noodle outlets, according to the ABC.\n\n\n\n\n\nThe current landlord at Chinese Noodle House is reportedly Qin's nephew, Xin Jiang Sun.\n\n\n\n\n\nZhang's mother-in-law, the former Chinese Noodle Restaurant employee, bought the lease from Sun to operate Chinese Noodle House.\n\n\n\nWhat's with the grapes?\n\nThe connection between the restaurants explains the similarities. But it doesn't explain how the iconic plastic grapes got there in the first place.\n\n\n\n\n\n\n\nBack in 2017, SBS investigated why dumplings might taste better when there are plastic grapes on the ceiling.\n\n\n\nREAD MORE The curious case of grapes on the restaurant roof\n\nThe answer lies in the Xinjiang Uyghur Autonomous Region, where real grapes dangle from the trellises above many eateries in the north-western province.\n\n\n\n\n\nXiaotang Qin, the original owner of Chinese Noodle Restaurant and famous for his violin, migrated from Xinjiang to Australia in 1991.\n\n\n\n\n\nSBS reported that many north-western Chinese eateries added the plastic grapes as a tribute to home.\n\n\n\nWhen will it close?\n\nThe current Chinese Noodle House will shut in mid-December.\n\n\n\n\n\nZhang did not comment on the rumour that the landlord was considering opening their own restaurant in the same spot, one that would presumably share a similar name, menu, and decorations.\n\n\n\n\n\nAs for the current owners, Zhang told SBS News they hope to open a new shop in a different location.\n\n\n\n\n\n\"We've been here for 10 years and I haven't had much time with my family or my kids. So we've decided to take a break for now.\"\n\n\n\n\n\n\"If there's a new shop, we'll let everyone know.\"\n\n\n\n\n\nThis story was produced in collaboration with SBS Chinese.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/world/asia/floods-in-southern-thailand-20251129-p5njfr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Floods in southern Thailand",
    "publish_date": "Sat, 29 Nov 2025 12:43:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Floods in southern Thailand\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/nice-to-be-back-oscar-piastri-lands-early-blow-at-decisive-qatar-grand-prix-20251129-p5njfe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Nice to be back’: Piastri lands early blow at decisive Qatar Grand Prix",
    "publish_date": "Sat, 29 Nov 2025 12:30:25 +1100",
    "category": "sports",
    "authors": [
      "Ian Chadband"
    ],
    "text": "Oscar Piastri has grabbed a crucial pole for the sprint at the Qatar Grand Prix – the race where he must thrive or give up any hope of winning the world title – and declared: “Nice to be back!”\n\nThe Australian ace, who’s had a wretched run over the last month-and-a-half, looked back in harmony with his McLaren as he celebrated “a day when things clicked” again.\n\nWhile he enthused about his much-needed change of fortunes on Friday, his McLaren teammate and championship leader Lando Norris settled for third on the grid behind second-placed George Russell’s Mercedes.\n\nTop sprint qualifier Oscar Piastri Credit: Getty Images\n\nIt sounded as if Norris was already resigned to his 24-point lead over Piastri shrinking after Saturday’s shoot-out as he shrugged: “I’d be stupid not to try and win, but it’s impossible to overtake so I will probably finish P3. Getting past George Russell on the line is probably the best I can hope for.”",
    "source": "TheAge",
    "cluster_id": 7
  },
  {
    "url": "https://www.theage.com.au/culture/music/skyhooks-guitarist-bob-starkie-dies-aged-73-20251129-p5njfq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Skyhooks guitarist Bob Starkie dies aged 73",
    "publish_date": "Sat, 29 Nov 2025 12:27:33 +1100",
    "category": "entertainment",
    "authors": [
      "Alexander Darling"
    ],
    "text": "One of Australia’s most culturally significant rock bands, The Skyhooks, is mourning the death of their rhythm guitarist.\n\nThe band has announced Bob “Bongo” Starkie died earlier on Saturday at the age of 73, after a battle with leukaemia.\n\nBob “Bongo” Starkie (right) at the height of the Skyhooks era.\n\n“It’s with sadness in our hearts that we have to send out this news,” the band wrote on its Facebook page.\n\n“For the past year, he has fought the brave fight against [leukaemia] hoping to get back on the road to perform more shows. Music was in his blood till the very end.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/global-software-outage-triggers-australian-flight-delays-20251129-p5njew.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chaos, cancellations at Australian airports as A320 Airbus planes recalled worldwide",
    "publish_date": "Sat, 29 Nov 2025 11:56:28 +1100",
    "category": "finance",
    "authors": [
      "Chris Zappone",
      "Alexander Darling"
    ],
    "text": "He said this was a result of a recent software upgrade, which now had to be reversed on each aircraft before they could fly again. The updates take two to three hours. “We have 85 [A320] aircraft [in our fleet]. However, only 34 of the aeroplanes have this anomaly identified.” Long check-in lines at Sydney’s domestic airport. Credit: Sitthixay Ditthavong He added: “I think the authorities in Europe and the manufacturer have done a great job in identifying this issue very promptly. “The engineering team are able to change the software status of that computer onboard the airplane, so they need to physically get on board and do that process and then carry out sort of like control checks.”\n\nMelbourne Airport’s Chief of Aviation Jim Parashos said all hands were on deck to help Jetstar. “We have engineers taking a look at the aircraft on the ground, and we will get them on their way as soon as we can,” he said. Thousands of people have had their plans upended by the nearly 100 flight cancellations on Saturday morning. Credit: Sitthixay Ditthavong “I’ve spoken to a lot of travellers that are heading up to Byron and the Gold Coast [for schoolies]. We appreciate their frustration, but they’ve been very understanding.” Sydney Airport said it was “supporting Jetstar as they work to resolve the issue and strongly advise all Jetstar customers to check their flight status with the airline before travelling to the airport”.\n\nFootage from Melbourne Airport on Saturday morning shows crowds and chaos as passengers try to figure out what is happening with their flights. Saturday morning’s delays in Australia also come after a fire forced the evacuation of Melbourne Airport’s Terminal 1 on Friday night. Travellers trying to get to schoolies on the NSW-Queensland border are among those affected by Saturday’s disruptions. Credit: Sitthixay Ditthavong At Sydney Airport, domestic terminal 2 was extremely crowded by 10.30am. Virgin Australia operates only four A320s, all of them in its regional Western Australia business. The Brisbane-based airline expects to cover any disruptions with its existing capacity in its Boeing 737 fleet.\n\n“We do not anticipate any impact to either Virgin Australia or our Regional Airline operations,” a spokesperson said. A Qantas source said while it had some A320s in WA, the issue was not affecting its aircraft. A sobering sight for travellers. Credit: Sitthixay Ditthavong Air New Zealand says it has cancelled 12 flights in response to the Airbus order. Chief Safety and Risk Officer Nathan McGraw said aircraft affected by the software recall were issued a fresh directive on Saturday, allowing affected aircraft to continue operating until 10.59am AEDT.\n\n“This means that, where possible, we can operate A320 services today before commencing the required updates,” he said. “Air New Zealand will begin rolling through the updates to its A320 fleet as quickly as possible to minimise ongoing disruptions.” There are 2274 Airbus A320s in service in the Asia-Pacific region, more than any other single region globally, according to Cirium aviation analytics company. Europe’s Airbus said it was ordering immediate repairs to 6000 of its widely used A320 family of jets.\n\nThe setback appears to be among the largest recalls affecting Airbus in its 55-year history and comes weeks after the A320 overtook the Boeing 737 as the most-delivered model. There are about 11,300 A320-family jets in operation, including 6440 of the core A320 model, which first flew in 1987. About 3000 A320-family jets were in the air when Airbus issued its bulletin to more than 350 of the plane’s operators. Earlier, Airbus released a statement saying “a recent event involving an A320 Family aircraft has revealed that intense solar radiation may corrupt data critical to the functioning of flight controls”.\n\nAirbus said it subsequently identified “a significant number” of its aircraft which may be affected. Reports say the incident in question involved a JetBlue flight from Cancun, Mexico, to Newark, New Jersey, on October 30, during which several passengers were injured after a sharp loss of altitude. Inside an Airbus A320-200 aircraft cabin. Credit: Getty Images The flight made an emergency landing in Florida and prompted an FAA investigation. Cebu Pacific, which flies from Sydney and Melbourne to the Philippines, also took to X to confirm it is affected.\n\nLoading It urged passengers travelling within the next two days to check their flight’s status on the website “before heading to the airport”. Overseas, the world’s largest A320 operator, American Airlines, said some 340 aircraft – 70 per cent of its A320 fleet – would need the fix. In Colombia, the recall is also affecting 70 per cent of the airline Avianca’s fleet. The airline has closed ticket sales until December 8. Other airlines said they would take planes briefly out of service to do the repairs, including Germany’s Lufthansa, India’s IndiGo, and UK-based easyJet.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/politics/western-australia/turmoil-embroils-city-of-perth-as-acting-ceo-accuses-lord-mayor-of-unlawful-motion-20251128-p5nje7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Turmoil embroils City of Perth as acting CEO accuses lord mayor of ‘unlawful’ motion",
    "publish_date": "Sat, 29 Nov 2025 11:46:56 +1100",
    "category": "finance",
    "authors": [
      "Carla Hildebrandt"
    ],
    "text": "The City of Perth is facing fresh internal turmoil after acting chief executive officer Peta Mabbs alleged Lord Mayor Bruce Reynolds acted unlawfully by pushing through an urgent workplace culture motion shortly before she quit.\n\nAt the November 18 council meeting, Reynolds introduced an urgent motion to appoint law firm Mills Oakley to carry out a workplace culture review with a budget of up to $125,000.\n\nThe City of Perth Council. Credit: City of Perth\n\nHowever, in a brief prepared for an agenda briefing session on December 2, Mabbs, standing in for chief executive Michelle Reynolds who is on leave, claimed the decision was “not a lawful decision and therefore can not be implemented”.\n\nIn the item, Mabbs claimed councillors were given just six minutes to read the motion before voting, with no reason was provided for the urgency, questions were not allowed, and the lord mayor moved straight to a vote, depriving council of the information required to make an “informed decision”.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/victoria/melbourne-airport-terminal-evacuated-travel-chaos-after-suspected-fire-20251128-p5njdx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cause of Melbourne Airport fire still unknown after mass evacuation",
    "publish_date": "Sat, 29 Nov 2025 11:27:12 +1100",
    "category": "finance",
    "authors": [
      "Isabel Mcmillan",
      "Alexander Darling"
    ],
    "text": "Melbourne Airport says it’s too early to speculate on what caused a fire at Terminal 1 on Friday night, forcing passengers to evacuate and their flights to be rescheduled.\n\nIt took an hour to extinguish the fire, which broke out at 7pm and forced the evacuation of hundreds from the Qantas terminal.\n\nThe airport’s chief of aviation, Jim Parashos, spoke on Saturday morning, saying the terminal was operating as normal while investigations continued. Officers said it was not believed to be suspicious.\n\n“There were naturally a lot of delays last night with disruptions due to the delays of outbound aircraft. Naturally, aircraft that had arrived safely into Melbourne needed to hold off until those departures vacated those gates. So we had anywhere between 60 to 180 minutes,” he said.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/brilliant-finish-extends-matildas-lead-20251129-p5njfm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brilliant finish extends Matildas' lead",
    "publish_date": "Sat, 29 Nov 2025 10:40:59 +1100",
    "category": "sports",
    "authors": [],
    "text": "Brilliant finish extends Matildas' lead\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/wbbl-match-called-in-bizarre-scenes-20251129-p5njfg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WBBL match called in bizarre scenes",
    "publish_date": "Sat, 29 Nov 2025 09:55:32 +1100",
    "category": "finance",
    "authors": [],
    "text": "WBBL match called in bizarre scenes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/wini-heatley-hid-brother-s-death-from-matildas-teammates-for-a-week-20251129-p5njex.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wini Heatley hid brother’s death from Matildas teammates for a week",
    "publish_date": "Sat, 29 Nov 2025 09:30:03 +1100",
    "category": "lifestyle",
    "authors": [
      "Emma Kemp"
    ],
    "text": "Until the big screen silently briefed the Gosford crowd, the public had no idea who the black armbands were for.\n\n“Tonight, the CommBank Matildas are wearing black armbands, as we acknowledge and stand with Winonah Heatley and her family during a time of loss,” the message read just before the warm-up.\n\nWini Heatley gets a hug from Ellie Carpenter at full-time in Gosford. Credit: Getty Images\n\n“If you or someone close to you is struggling with mental health, please know support is available … Nearly 1 in 5 people experience a diagnosable mental disorder each year, and over two in five will experience one in their lifetime. You’re not alone - our community stands with you.”\n\nIt was only after Heatley’s assured central defensive display had helped Australia to Friday’s 5-0 romp over New Zealand that it became clear the 24-year-old had kept her brother’s death from teammates for almost an entire week.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/the-good-the-bad-and-the-ugly-looking-under-the-hood-of-a-bizarre-wallabies-season-20251126-p5nioj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The good, the bad and the ugly: Looking under the hood of a bizarre Wallabies season",
    "publish_date": "Sat, 29 Nov 2025 09:30:00 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "So let’s look under the hood of Australia’s year. The good Two-thirds of the Lions series: Defying all the condescending predictions, the Wallabies turned up against the British and Irish Lions. They lost the series 2-1 against the star-studded Lions, but with the Wallabies getting better with each game, it could have easily swung the other way if a contentious call at the end of the second Test in Melbourne had gone the other way. In three Tests, the cumulative score was 68-67 to the Lions. It didn’t add up to victory, but it was an enthralling series, and showed Australia could beat the world’s best. South Africa success: That was evident again when the Wallabies knocked off the world No.1 Springboks in Johannesburg next up. The critics, again, had mocked Australia. But after conceding 20 points in 18 minutes, the Wallabies then routed the hosts, scoring 38 unanswered points. It was a win for the ages and the true believers, and the Wallabies almost repeated the dose a week later in Cape Town. Australia, at this point, were back, baby.\n\nWill Skelton: He was only on the field for 227 minutes of the Wallabies’ total of 1200 minutes in 2025, but the giant lock was still their most influential player. Skelton almost single-handedly took on the Lions in the second and third Tests, physically and mentally. That continued in South Africa. In four massive Tests with Skelton on deck the Wallabies’ cumulative score was 108-103 with a 50 per cent win rate. Guns blazing in Townsville: The hairy-chested belief of the new Wallabies was never more apparent than in Townsville against Argentina when they turned down a draw to go for a win after the siren. And got it. Harry Wilson pointed to the corner with a “let’s f---ing go”, and the Australian public agreed. Max aura: Of many good candidates for Australia’s best in 2025 – Fraser McReight, Wilson, Skelton, Tom Hooper and Len Ikitau – the star who shone brightest was 21-year-old Max Jorgensen. Time and again, the young flyer delivered on the big stage with solo tries he had no place scoring. A special talent. The bad\n\nOne-third of the Lions series: Forget being happy with a competitive effort, the Wallabies could have (should have?) won the Lions series. But they were physically insipid (not picking Skelton was an all-time bad call) for the first 50 minutes in Brisbane, and the killer blow was the second half hour in Melbourne, when the Wallabies gave up most of their 23-5 lead. The decision on Jac Morgan’s cleanout was a howler, but it wasn’t why Australia lost the game, and thus the series. Will Skelton’s physicality was vital against the British and Irish Lions. Credit: Getty Images\n\nBotched Bledisloe: The Wallabies had a genuine chance to beat New Zealand in Auckland and end the 39-year Eden Park curse. But they botched it by falling behind early, as they’d done all year: 19 points down against the Lions, 22 against the Boks and 21 against Argentina. Wallabies fightbacks – and some wins – showed character and resilience but, unsurprisingly, giving up big leads is not a path to sustained success. And so it proved in another losing Bledisloe Cup series. Passive defence: Most teams are aggressive with their line speed in defence, but the Wallabies persist with a passive, connected strategy – essentially conceding the gain line but not offering gaps in most parts of the field. It routinely allows rivals to make worryingly easy ground and set up camp in Australia’s half. The Wallabies conceded an average of 27.4 points during the year, and most of the world’s top five sides average fewer than 20. There is time for a rethink. The ugly\n\nWinless European tour: Enough said. Four losses in Europe, two record scores conceded and a get-out-of-jail result against Japan. The calm confidence, resilience and hard-won self-belief washed away in real time. Australia come to terms with the shock loss to Italy in Udine. Credit: Getty Images Prioritising tomorrow over today: The loss to Italy was a prime example of the self-destructive thinking in Australian rugby for many years: using Tests as opportunities to provide “experience”. Australian rugby needs better depth, for sure. But rightly or wrongly, it cannot survive, let alone thrive, without Test wins. Picking anything other than the strongest team each week has led to a string of humbling and confidence-sapping losses. Forget prepping for the future and focus on building belief in the present. Australia’s James O’Connor takes on the All Blacks’ defence. Credit: AP Ten lotto and JOC handling: Schmidt is a first-rate coach, but his handling of the No.10 position – and particularly James O’Connor – this year has been perplexing. The No.10 jersey changed hands often, and while some of that was injury-related, the cohesion and game management clearly suffered. Schmidt’s recalling of O’Connor to the starting side after a trip to England (for a game against New Zealand) and a holiday (to play Ireland) also seemed unnecessarily messy. So too letting him leave the squad before the France game. Meanwhile, we are all a year older and still have no idea who is Australia’s preferred No.10.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/jetstar-flights-grounded-after-global-plane-recall-20251129-p5njfa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jetstar flights grounded after global plane recall",
    "publish_date": "Sat, 29 Nov 2025 09:17:34 +1100",
    "category": "finance",
    "authors": [],
    "text": "Jetstar flights grounded after global plane recall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/beach-safety-concerns-rise-after-another-fatal-shark-attack-20251129-p5njf8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beach safety concerns rise after another fatal shark attack",
    "publish_date": "Sat, 29 Nov 2025 09:13:56 +1100",
    "category": "finance",
    "authors": [],
    "text": "Beach safety concerns rise after another fatal shark attack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/movies/ariana-grande-has-worked-for-this-moment-her-whole-life-but-will-it-be-enough-to-win-her-an-oscar-20251121-p5nhd2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ariana Grande has worked for this moment her whole life. But will it be enough to win her an Oscar?",
    "publish_date": "Sat, 29 Nov 2025 09:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Advertisement\n\nAdvertisement\n\nGrande’s approach to her five Wicked auditions made Chu feel like he had met “the real Glinda” for the first time. Loading On the surface, training started six months beforehand, with daily acting and voice lessons between The Voice (US) commitments. (Although Grande, who was a coach on the show in 2021, has a four-octave vocal range that extends to a whistle register, she needed to master an operatic style for Glinda, particularly for No One Mourns the Wicked.) Chu may have been worried Grande’s fans wouldn’t be able to see Glinda past the pop superstar - but some would argue they can’t see Grande without glimpsing Glinda. The Wizard of Oz has been Grande’s favourite film since she was four. In 2003, Grande played Dorothy Gale in a community theatre show in Florida, and met Kristin Chenoweth backstage after watching the original Wicked Broadway production. Grande with her late grandmother, Marjorie Grande, and Kristin Chenoweth, who originated the role of Glinda on Broadway. Here, they are pictured backstage at Wicked in 2003. Credit: Instagram/Kristin Chenoweth When her grandfather died 11 years later, Grande sang Somewhere Over The Rainbow at his funeral. She sang it again in 2017 to close the One Love Manchester benefit concert, held two weeks after 22 people died in a bombing at her concert. And again to open the 2025 Oscars.\n\nAdvertisement\n\nUniversal Pictures first announced a Wicked film adaptation was in the works in 2012. Grande – who, a year prior, tweeted Glinda was her “#DreamRole” – spent the nine years it was stuck in development hell “hunting” power producer Marc Platt for the chance to audition. Loading “I have never wanted something as badly as I did this,” Grande told Zach Sang in February 2024. “I had no expectations, I was just thankful to go in at all, I was so excited to have the opportunity to audition.” It was the “best day of [her] life” when she found out she would be playing Glinda, and she bleached her hair (and eyebrows) for the role – a huge commitment after Grande’s catastrophic hair damage from four years of bleaching and dyeing it red for Nickelodeon’s Victorious. For three years, Grande was visibly Glinda-fied. But it was only in November that she revealed the extent of her internal metamorphosis, helped by using the Stella Adler technique to scrupulously devise the character’s childhood, inner life and traumas. Elphaba Thropp (portrayed by Cynthia Erivo in the films) was also a dream role for Grande, who is pictured here in glitter-green lipstick performing The Wizard and I for a 2018 televised Wicked Halloween special. Credit: NBCU Photo Bank/NBCUniversal via Getty Images Grande, pictured here performing Defying Gravity with Erivo at the 2025 Oscars, spent three years with bleach-blonde hair and eyebrows. (If you look closely, you can see an actual ruby red slipper, like Dorothy Gale’s, on the back of her shiny Schiaparelli Haute Couture gown). Credit: Chris Pizzello/Invision/AP\n\nAdvertisement\n\nUniversal Pictures’ Wicked: For Good Oscars campaign has been going for almost two years, kicking off with Erivo and Grande’s appearance at the 2024 ceremony. They dressed in green and pink, and presented the Best Original Song and Best Original Score awards. Credit: Chris Pizzello “I just wanted to design this person inside and out, even if none of it was necessary for a scene, so that I could reference it for myself and leave my own stuff at home,” Grande told the New York Times. “So every time something had to trigger Glinda, it was a Glinda trigger that I used, not an Ariana one.” Early on, according to the publication, she told Chu: “I feel closer to Galinda [Glinda’s original name] than maybe even Ariana Grande. I understand that struggle between trying to give people light and trying to understand where my light comes from myself.” But it wasn’t enough to earn her a Best Supporting Actress Oscar, BAFTA, Golden Globe, Actor Award (formerly Screen Actors Guild), nor a Critics Choice Award, all of which she was nominated for, last awards season. It’s not as if the critics – who lauded Grande’s comedic timing and emotional depth in Part One and For Good – don’t like movie-musicals. Actresses who have won Oscars for supporting roles in movie-musicals Rita Moreno, West Side Story (1961) Catherine Zeta-Jones, Chicago (2002) Jennifer Hudson, Dreamgirls (2006) Anne Hathaway, Les Misérables (2012) Ariana DeBose, West Side Story (2021) Zoe Saldaña, Emilia Pérez (2024) Grande lost all of those gongs to Zoe Saldaña’s performance in cursed crime musical Emilia Pérez. Other recent Oscar winners in the category include Ariana DeBose for West Side Story, and Anne Hathaway for Les Misérables (another notable physical transformation).\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/style-scorecard-the-aussie-brands-making-golf-fashion-cool-20251126-p5nikn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Style scorecard: the Aussie brands making golf fashion cool",
    "publish_date": "Sat, 29 Nov 2025 09:00:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "When it comes to fashion, golf has a significant handicap.\n\nTennis has Carlos Alcaraz modelling for French luxury label Louis Vuitton; F1 driver Lando Norris appeared in the October issue of British Vogue wearing Saint Laurent; and horse racing has more hats than a royal wedding.\n\nAt its best, golf has Rory McIlroy in water-repellant pants and polo shirts from Nike and Adam Scott in functional Uniqlo items that will fail to turn the fairway into a runway at the Australian Open at Royal Melbourne on Thursday.\n\nHappy Gilmore (Adam Sandler) takes on big-money corporate golf in Happy Gilmore 2. Credit:\n\nAt its worst there’s Adam Sandler in Happy Gilmore 2 wearing oversized hockey jerseys.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/wild-scenes-fire-sparks-airport-004130750.html",
    "title": "Wild scenes as fire sparks airport evacuation",
    "publish_date": "2025-11-29T00:41:30Z",
    "category": "finance",
    "authors": [],
    "text": "Melbourne Airport was thrown into chaos on Friday night after a fire broke out in Terminal 1, forcing the evacuation of more than 1500 passengers and leaving planes stranded on the tarmac.\n\nThe blaze was reported just after 7pm, prompting an immediate response from Fire Rescue Victoria (FRV) and the airport’s Aviation Firefighting and Rescue Services.\n\nThe fire was brought under control within about 25 minutes.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAn FRV spokesperson confirmed the small fire was located and contained quickly.\n\nA Melbourne Airport spokesperson said the blaze did not spread to other terminals.\n\nMore than 1500 passengers were evacuated from Melbourne Airport’s Terminal 1 on Friday night. Picture: Facebook\n\n“Emergency services completed a full assessment of the terminal and, when it was deemed safe, we worked to support passengers to return to the terminal and recommence operations,” the spokesperson said.\n\n“The safety of passengers and staff was our top priority throughout this incident, and we appreciate the patience and cooperation shown by travellers.\n\n“Passengers travelling on Qantas domestic services are advised to check directly with the airline for the latest updates on their flight.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPassengers faced significant disruptions, with some waiting up to five hours to secure replacement flights or accommodation.\n\nOne man told the ABC it was the culmination of a day of travel chaos.\n\n“I was booked on a flight with Virgin and they cancelled, so they very kindly re-booked me with Qantas for this evening, and now it’s been cancelled,” he said.\n\n“Apparently, I finally have a flight with Jetstar back to Launceston tomorrow morning at 7.20am.”\n\nFlights were severely disrupted. Picture : NewsWire / Ian Currie\n\nAnother passenger described being stuck on a plane on the tarmac for two-and-a-half hours due to the fire.\n\n“It’s very frustrating when no-one knows what’s happening, and obviously it’s very hard with a baby,” she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We actually had a flight to catch, and we missed it because of the incident.”\n\nBy 9pm, 11 planes were queued up on the tarmac, with Qantas passengers recently landed in Melbourne stranded while the scene was secured.\n\nAuthorities said no one was injured and the cause of the fire remains under investigation.\n\nMeanwhile, Australian airports are facing further chaos after Airbus issued a global warning affecting around 6000 A320 aircraft.\n\nJetstar has confirmed some flights out of Sydney and Melbourne were cancelled on Saturday morning as the planes undergo precautionary software updates.\n\n“Jetstar is impacted by an Airbus fleet software issue that’s affecting all A320 family operators globally,” a Jetstar spokesperson said, adding the airline is working to get affected passengers on their way as quickly as possible.",
    "source": "Yahoo",
    "cluster_id": 22
  },
  {
    "url": "https://au.news.yahoo.com/aussie-travel-chaos-global-safety-212623473.html",
    "title": "Travel chaos for Aussies, Jetstar flights axed",
    "publish_date": "2025-11-29T00:21:37Z",
    "category": "finance",
    "authors": [],
    "text": "Jetstar flights have been cancelled at several major Australian airports after global aircraft giant Airbus ordered an emergency upgrade to some of its fleet, due to fears solar radiation could corrupt flight controls.\n\nAirbus said it was ordering a software patch for a significant number of its A320 family of aircraft.\n\n“Analysis of a recent event involving an A320 Family aircraft has revealed that intense solar radiation may corrupt data critical to the functioning of flight controls,” Airbus said in a statement.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Airbus has consequently identified a significant number of A320 Family aircraft currently in-service which may be impacted.”\n\nSome of Jetstar’s fleet of Airbus A320’s have been ordered to undergo a software upgrade.\n\nOn Saturday morning, Jetstar said some of its flights would be delayed or cancelled and that a portion of its fleet was affected by the software issue.\n\n“Due to an issue affecting Airbus A320 operators globally, some of Jetstar’s Airbus-operated flights are unable to depart at this stage,” the company said in a statement.\n\n“We’re working through the impacts on our fleet and to our customers. We’ll have more information shortly.\n\n“We apologise to customers for the inconvenience caused.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt is understood no Qantas flights have been impacted.\n\nOn Saturday morning, 10 Jetstar flights out of Sydney and three out of Melbourne Airport had been cancelled.\n\nJetstar said some of its flights had been cancelled as a security precaution.\n\n“Safety is our number one priority,” the company said in a statement.\n\n“Our teams are working on options to get customers on their way as quickly as possible and are contacting affected customers directly.\n\nWe thank customers for their understanding and patience.”\n\nThe issue is affecting the A320 globally. Photo: Adek Berry/AFP.\n\nA Virgin Australia spokesperson said the airline did not anticipate that it would be impacted by the software issue.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe airline has four A320s in its regional fleet based in Western Australia.\n\nIt is understood the airline has the capacity in the rest of its fleet for any flights the A320 were scheduled to have flown.\n\nThe recall is expected to affect more than half of Airbus’ global fleet.\n\nThe affected aircraft must revert to earlier software before being allowed to take off.\n\nThe changes were triggered by an incident on a JetBlue flight from Cancun to New Jersey on October 30.\n\nThe flight was forced to make an emergency landing in Tampa, Florida after a drop in altitude.",
    "source": "Yahoo",
    "cluster_id": 38
  },
  {
    "url": "https://au.news.yahoo.com/tradie-lands-dream-job-to-be-paid-to-live-alone-on-remote-aussie-island-very-lucky-000038279.html",
    "title": "Tradie lands dream job to be paid to live alone on remote Aussie island: 'Very lucky'",
    "publish_date": "2025-11-29T00:00:38Z",
    "category": "finance",
    "authors": [],
    "text": "Sitting on the verandah with a cup of coffee cusped in his hands, Sandy Duthie scans the stunning ocean scenery in front of him. As a couple of whales pass by, the 43-year-old leans back in his chair, inhales and ponders about the people that graced the same spot before him.\n\n“How many hundreds of people have sat there and had their coffee with that same view?” Gabo Island’s newest caretaker told Yahoo News Australia.\n\n“We’re one of many, many people in that line. I feel very lucky and very privileged to have this opportunity.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nA year-and-a-half after he scored the job, which requires him to live alone on the remote Victorian island for six months of the year, Sandy said he’s still “pinching himself”.\n\n“It’s such a magical place,” he said. Gabo Island is home to one of Australia’s oldest still functioning lighthouses, as well as resident penguins and seals. At 47-metres tall, and 163 years old, its pink granite walls are filled with history.\n\nMuch to his delight, Sandy will now forever be etched into its story. And it will forever be etched in his heart.\n\nGabo Island is home to one of Australia’s oldest still functioning lighthouses. Source: Sandy Duthie.\n\nExpat falls in love with 'familiar' remote Aussie island\n\nSandy first learned of Gabo Island in 2019 after he moved to Australia from Scotland.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhat was supposed to be a holiday to visit his partner’s family in Mallacoota — the closest town to the tourist destination — quickly came unravelled due to bushfires and Covid-19.\n\n“I changed my holiday visa to a permanent residency,” he told Yahoo. “The universe decided to keep me here.”\n\nFollowing the Black Summer fires, the long-time arborist was quickly able to find work.\n\n“My first experience on Gabo was as a contractor. I came out to do weed control and spent two weeks out here,” Sandy recalled, noting there was something about the place that seemed strangely familiar.\n\n“Gabo has a really unusual granite formation for Australia, but it’s very similar to the granite from the northeast of Scotland where I was born and grew up. So immediately, there was a familiarity.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I was just amazed by the place and got chatting with the caretaker at the time, Leo, about how he got his job.”\n\nLittle did he know that conversation would leave a lasting impression.\n\nDolphins, seals, whales and penguins can be seen in the waters off Gabo Island. Source: Sandy Duthie.\n\nHow Sandy spends his time on Gabo Island\n\nAfter 25 years in the role, Leo decided to hang up his hat last year and return to the mainland full-time, paving the way for Sandy to step in.\n\nHe and his counterpart Jeff now work month-on, month-off shifts, keeping a watchful eye on the island, recording weather observations every six hours, and hosting guests at the Assistant Light Keepers Quarters.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe pair also take turns tending to the vegetable garden and maintaining the salt-weathered structures.\n\n“There’s always painting to do, there’s always grass mowing to do. There’s always something you can fix or research.”\n\nWhen the weather gets too wild, bringing “howling” winds, he sometimes cracks open a book, or heads to the workshop to make his own cutlery.\n\nThe summers can be quite busy on Gabo Island, with people from the mainland stopping by on their boats to go for a wander.\n\nCamping is not allowed, and guests can only stay in the assigned quarters, which sleeps eight and is often booked out months in advance.\n\nIsland caretaker doesn't see another person for weeks\n\nSandy said that during some of the quieter months, he won’t see another person for weeks at a time.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Sometimes they’ll really scare you. I’ve had cases where I haven’t seen another face for two or three weeks, and somebody’s just appeared while I’ve been busy whipper snippering a track or something. It can take you by surprise.”\n\nWhile the isolation isn’t for everyone, Sandy said the job has “exceeded all expectations”. And it's never far from his mind.\n\n“Do I miss the mainland? Yes, but at the same time, when I’m on the mainland, I miss Gabo.”\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 39
  }
]