[
  {
    "url": "https://www.9news.com.au/national/mortdale-sydney-warning-nsw-health-safuan-hasic/90440d80-d4df-4ca4-bf95-faed73711a1a",
    "title": "Virus warning for patients of a Sydney dentist amid 'infection control breaches'",
    "publish_date": "Mon, 13 Oct 2025 01:34:09 +0000",
    "category": "lifestyle",
    "authors": [
      "Oct"
    ],
    "text": "Patients of a dentist in Sydney's south are being urged to get tested for ﻿blood-borne viruses due to infection control breaches identified at the practice.\n\nThe Chief Health Officer has advised current and former patients of Safuan Hasic, also known as Steven Hasic, who worked from a practice at 70 Victoria Avenue, Mortdale, to get tested for blood-borne viruses due to infection control breaches identified at his practice.\n\nPatients could have been exposed to ﻿hepatitis B, hepatitis C and HIV, due to poor cleaning and inadequate sterilisation of dental equipment.\n\nPatients of a dentist in Sydney's south are being urged to get tested for ﻿blood borne viruses due to infection control breaches identified at the practice. (Google Maps)\n\nHowever health bosses said it's \"low risk\".\n\nHasic's registration as a dental practitioner has been suspended by the Dental Council of NSW.\n\nNSW Health has also issued a closure order for the dental surgery in Mortdale.\n\nIt said it has tracked down some patients and is contacting them.\n\nBut it has issued a plea for others to take note.﻿\n\nDirector of South Eastern Sydney Local Health District's Public Health Unit, Dr Vicky Sheppeard, said while the potential risk of infection is low, blood-borne viruses can have serious health impacts.\n\n\"Any current or former patients of Mr Hasic should see their GP as soon as possible and ask to be tested for blood-borne viruses as a precautionary measure,\" Sheppeard said.\n\n\"Blood-borne viruses can be spread between clients on dental instruments where there isn't stringent infection control.\n\n\"People infected with blood-borne viruses may not show symptoms for many years, so it is important to be tested to see if there is silent infection.\n\n\"There are effective treatments for hepatitis B, hepatitis C and HIV.\"\n\nPatients who have had tests after their last visit with Hasic should check with their GP if more tests are needed, even if results were negative.\n\nNSW Health is working with the Dental Council of NSW and Health Care Complaints Commission to investigate.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/argentina-usa-united-states-donald-trump-bailout-finance/7019ae75-1bb6-4e26-b718-2a566e428546",
    "title": "Why America just bailed out Argentina with a $20 billion lifeline",
    "publish_date": "Sun, 12 Oct 2025 23:51:24 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "The Trump administration is bailing out Argentina in a move critics are saying has more to do with politics than economics or American interests.\n\nThat means $20 billion (AU$30.5 billion) US taxpayer dollars will be used to bail out a country led by a close ally of President Donald Trump: chainsaw-wielding, libertarian Javier Milei.\n\n\"Argentina faces a moment of acute illiquidity,\" Treasury Secretary Scott Bessent wrote on X on Thursday. \"The US Treasury is prepared, immediately, to take whatever exceptional measures are warranted to provide stability to markets.\"\n\nPresident Donald Trump meets with Argentine President Javier Milei during the United Nations General Assembly. (AP)\n\nMeanwhile, the US federal government is nearing two weeks of being shut down and US businesses and industries continue to reel from Trump's ongoing trade war.\n\nHere are some key details about the administration's extraordinary financial rescue of Argentina.\n\nWhat's the problem?\n\nArgentina is at risk of a financial collapse.\n\nThe country's currency fell sharply after President Milei's party suffered a significant defeat in elections last month. The losses shook investors' confidence in Milei's ability to see through his economic reforms.\n\nMilei has slashed government spending, cut regulations and fired tens of thousands of public-sector workers since taking office in 2023. His administration has seen some success; inflation in Argentina eased this year to the slowest monthly pace in more than four years.\n\nREAD MORE: Israeli hostages on cusp of freedom as Trump heads to Middle East\n\nJavier Milei's government is struggling. (Tomas Cuesta/Getty Images)\n\nThe Trump administration has argued that Argentina's financial strife could spill over into other economies if it isn't contained swiftly.\n\nAdministration officials say they also see a risk of Argentina, a major economy in South America, strengthening its ties with China.\n\nThe next legislative elections in Argentina take place on October 26.\n\nWhat is the US doing?\n\nOn Thursday, Bessent confirmed on social media that Argentina's bailout is moving forward in two keys ways.\n\nBessent said the administration has finalised a $20 billion currency swap agreement with Argentina's central bank, allowing it to exchange its local currency for the US dollar.\n\nIt's essentially a $20 billion loan, experts say.\n\nTrump's top economic official also said the administration \"directly\" purchased an undisclosed amount of Argentine pesos. It's only the fourth time since 1996 that the United States has bought another country's currency, according to the Federal Reserve Bank of New York.\n\nThese measures are aimed at stabilising Argentina's financial markets.\n\nREAD MORE: ﻿ Qantas to face scrutiny after data leak exposes millions\n\nA customer pays for food with Argentine peso banknotes in the financial district of Buenos Aires, Argentina, on September 8. (Tomas Cuesta/Bloomberg/Getty Images)\n\nWhy is it controversial?\n\nThe United States has provided foreign countries with financial lifelines before, usually when the stability of the global economy is at risk or when a close geopolitical ally, such as Mexico, finds itself underwater and could damage to US creditors and investors.\n\nBut this bailout isn't urgent, it's happening at an awkward time, and critics are accusing Trump of using billions of American dollars just to prop up one of his own personal allies.\n\n\"The Treasury's decision to offer a 'swap' in Argentina is really a signal that Washington is willing to wield its financial tools for political purposes in ways that depart from past norms,\" wrote Heidi Crebo-Rediker, a former chief economist at the State Department, and Douglas Rediker, a former US representative on the International Monetary Fund's executive board, in a Financial Times column published on October 2.\n\nThis is all while the US government is shut down, which has resulted in more than a million federal workers being furloughed or working without pay.\n\nTreasury Secretary Scott Bessent appears in the in the Oval Office of the White House on September 25, in Washington, DC. (Andrew Harnik/Getty Images via CNN Newsource)\n\n\"It is inexplicable that President Trump is propping up a foreign government, while he shuts down our own,\" Democratic Senator Elizabeth Warren of Massachusetts said in a statement on Thursday.\n\nMeanwhile, the result has been a one-two punch against American farmers from Trump's own policies. American farmers are having a tough year, in no small part because of Trump's bid to reshape global trade. And Argentina's bailout inadvertently worsened their plight.\n\nChina, a major buyer of US soybeans, halted purchases of the commodity in May in response to Trump's trade war. Then, after Argentina temporarily scrapped export taxes on grains, China swooped in and bought tens of thousands of pounds of Argentine soybeans instead.\n\n\"Why would USA help bail out Argentina while they take American soybean producers' biggest market??? We shld use leverage at every turn to help hurting farm economy Family farmers shld be top of mind in negotiations by representatives of USA,\" Republican Senator Chuck Grassley of Iowa wrote on X on September 25.\n\nWho benefits?\n\nBeyond Millei, China, and the Argentine treasury, critics say the bailout also stands to greatly benefit wealthy fund managers who are major holders of Argentine debts and assets.\n\nThe bailout would deliver a major windfall to Rob Citrone, a billionaire hedge fund manager with significant investments in Argentina. \"Bessent's personal and professional relationship with Citrone has spanned decades,\" according to independent journalist Judd Legum.\n\nArgentina's President Javier Milei (R) speaks next to legislative candidate Manuel Adorni (C) and Argentina's Secretary General of the Presidency Karina Milei during an open-air political rally at Parque Sarmiento in Cordoba, Argentina on September 19. (Diego Lima/AFP/Getty Images via CNN Newsource)\n\n\"Trump promised 'America First,' but he's putting himself and his billionaire buddies first and sticking Americans with the bill,\" Warren said in a statement on Thursday. Eight Democrats, including Warren, have introduced a bill in Congress to prevent Argentina's bailout.\n\nBut Bessent told CNBC recently that \"this trope that we're helping out wealthy Americans with interest down there couldn't be more false.\"\n\n\"What we're doing is maintaining a US strategic interest in the Western Hemisphere,\" he added.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/australia-health-hand-washing-survery/e6016bdf-70d2-4b02-828b-c8a19f792de3",
    "title": "Aussies admit to disgusting habit after going to the bathroom",
    "publish_date": "Mon, 13 Oct 2025 01:45:45 +0000",
    "category": "lifestyle",
    "authors": [
      "Oct"
    ],
    "text": "Millions of Aussies have admitted they don't always wash their hands after going to the bathroom, including 13 per cent of men and 11 per cent of women after defecating.\n\nThe concerning data also revealed 28 per cent of men surveyed and 18 per cent of women also said they did not wash their hands after urinating, the study from the Food Safety Information Council revealed.\n\nLydia Butchmann, CEO of the Council, said the results were worrying, highlighting the consequences such habits and actions can cause to everyone.\n\nREAD MORE: ﻿ Qantas to face scrutiny after data leak exposes millions\n\nMillions of Aussies have admitted they don't always wash their hands after going to the bathroom, including 13 per cent of men and 11 per cent of women after defecating. (Getty)\n\n\"The survey came up with some interesting (and disturbing) results,\" she said.\n\n\"28 per cent of men and 18 per cent of women surveyed said they didn't always wash their hands after a pee.\n\n\"But this is essential as toilets and bathrooms are also one of the favourite locations for harmful bacteria to hang out.\n\n\"Of even more concern, 13 per cent of men and 11 per cent of women said they didn't always wash their hands after a poo.\"\n\nButchmann said the risk of these habits was compounded given almost half of all Aussies also admitted to another startling habit that also poses a huge health risk.\n\n\"If you don't wash your hands after going to the toilet you will be spreading the risk of diseases, especially as 43 per cent of men and 49 per cent of women surveyed also admitted that they didn't always wash their hands before handling food,\" she said.\n\nThe Food Safety Information Council's advice is to always wash and dry your hands:\n\nBefore handling, preparing and eating food\n\nAfter touching raw meat, fish, seafood, shell eggs or poultry\n\nAfter using the toilet, attending to children's (or others') toileting, and changing nappies\n\nAfter blowing your nose\n\nAfter touching a pet, cleaning up animal pee, poo or vomit or cleaning cat litter trays\n\nAfter gardening",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/frequent-flyer-programs-australia-steve-hui-points-whisperer/f65c9eef-ff8c-4193-86ce-da95cc5bacde",
    "title": "Betting on using frequent flyer points for a holiday? Think again",
    "publish_date": "Sat, 11 Oct 2025 21:05:18 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Steve Hui is known as the \"Points Whisperer\", one of the Australia's foremost authorities on maximising return from frequent flyer points, and he has a warning for Aussies.\n\nThere's a huge change coming ﻿for the rewards landscape, and it's not looking good.\n\nHui predicts that ﻿the Reserve Bank of Australia's (RBA) proposed reforms banning surcharges on eftpos, Mastercard and Visa cards could slash the number of points everyday Aussies earn with each purchase.\n\nSteve Hui warned Aussies there are big changes coming to the way we earn frequent flyer points. (Instagram/@iflyflat)\n\nSo if you're a Qantas Frequent Flyer, Virgin Velocity Frequent Flyer, or other points collector who earns through card purchases, you might soon be a lot worse off.\n\n\"Your ability to earn points will drop in a number of areas,\" Hui, founder of points travel advisory iFLYflat, told 9news.com.au.\n\n\"A lot of credit cards will have to change their reward system because the revenue won't be there to pay for these rewards at the current level.\"\n\nFor example, credit cards that currently offer one frequent flyer point ﻿per dollar spent may drop to one point per $2 spent, or more.\n\nIn short, ﻿earning frequent flyer points will get more expensive.\n\nHui said the RBA's proposed ﻿surcharge and interchange reforms will significantly impact how Aussies earn points and how many they can earn in a single transaction.\n\n\"I believe it will change the whole rewards landscape in Australia, and probably be the biggest change in 15 years,\" he said.\n\n\"What we don't know is when the changes are going to be implemented.\"\n\nBut as it becomes harder to earn points and the number of points required to access rewards﻿ keeps going up, is it even worth it for everyday Aussies to be part of frequent flyer loyalty programs anymore?\n\nA growing number of consumers don't seem to think so.﻿\n\nNew research from Finder revealed 57 per cent of Aussies – equivalent to more than 12 million people – no longer see the value in Qantas or Virgin's programs.\n\nOnly one in three think Qantas Frequent Flyer points are worth the chase, and just one in four believe Virgin Velocity points are worth it.\n\nThese attitudes should come as no surprise, given that Velocity recently slashed the number of points non-Velocity credit card holders earned per dollar while Qantas﻿ hiked up the points needed to redeem fares.\n\nHui understands why some Aussies have been turned off frequent flyer programs but said they still have plenty of value for those who play it smart.\n\n﻿\"It really all comes down to people working out what's the cost versus benefit of the points,\" he said.\n\n\"If benefit exceeds cost, then it's always worthwhile.\"﻿\n\nThe cost is the fee paid to collect the points, like annual credit card fees or surcharges, while benefit can be rewards like flights and seat upgrades.\n\nREAD MORE: Paedophile allowed to have photo of his victims at his bedside as he died\n\n\"If benefit exceeds cost, then it's always worthwhile.\"﻿ (Getty)\n\nBut making the most of your points isn't as simple as accruing a bunch and spending them on anything.\n\nThe biggest mistake Aussies make with frequent flyer programs is not knowing how many points they actually need to get the rewards they want.\n\n﻿Hui said the best tactic is to decide where you want to go and what class of fare you want, find out how many points it costs, and work backwards.\n\nWork out which retailers offer the points you're collecting and prioritise them whenever you can, from the supermarket (Qantas Points with Everyday Rewards at Woolworths) to the petrol station (Velocity Points at 7-Eleven stores.\n\nHui also encourages everyday consumers to pick one program and stick with it to hit their points goals and earn rewards faster.\n\nSpreading points around usually only works for business travellers who fly constantly, who can learn how to optimise their points with a membership program Hui is set to launch next week.\n\nREAD MORE: Man arrested over fire that destroyed 6000 LA homes\n\nHui is the founder and chief executive of iFLYflat, which claims to be Australia's top points travel experts. (Instagram/@iflyflat)\n\nIf you're tossing up ﻿which frequent flyer program to focus on, Hui's favourites in 2025 have been Virgin, Qatar and Cathay Pacific.\n\nQantas didn't make the cut, but don't jump ship if you're already collecting Qantas points.\n\nInstead, Hui said to focus on accruing as many points as possible in the program you're already with before the RBA's proposed surcharge reforms kick in and potentially slash your earning power.\n\n\"Make hay when the sun shines because the system's always changing and if you wait, then you may miss out.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/video-games-could-fall-under-social-media-ban-researchers-say/105859842",
    "title": "Video games could fall under social media ban, researchers say",
    "publish_date": "Mon, 13 Oct 2025 01:57:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Digital media researchers say online video games could yet be included under the federal government's social media ban for under-16s.\n\nThe ban currently excludes online services \"that have the sole or primary purpose of enabling end-users to play online games with other end-users\".\n\nBut associate professor Brendan Keogh, from the Queensland University of Technology's Digital Media Research Centre, said the definitions under the ban were \"incredibly vague\".\n\nBrendan Keogh says online video games like Roblox are important for socialising young people. (Supplied: Queensland University of Technology)\n\n\"I still have questions about how much any minister of the day can change what is or isn't excluded from those central definitions,\" Dr Keogh said.\n\n\"I think there's concern in the video game industry about just how reliable or permanent that exclusion of [online] games is.\"\n\nBanning games 'whack-a-mole'\n\nLast month, eSafety Commissioner Julie Inman Grant confirmed she had written to online game platforms, including Roblox and Lego Play, advising the ban could apply to their services.\n\nAccording to Marcus Carter, professor in human computer interaction at the University of Sydney, Roblox is \"rightfully critiqued\" for a lack of effective moderation of \"fringe, far-right material\" uploaded by users.\n\nMarcus Carter says Roblox attracts 360 million players per month, who can upload content to the platform. (Supplied: Roblox Corporation)\n\nHe said although this was a risk factor for young people, any ban would simply push them on to other games.\n\n\"When I ran studies in 2021, everybody was playing Fortnite. Now, the kids are all playing Roblox and in three years, they'll be playing a different game,\" he said.\n\n\"Is the commissioner going to play whack-a-mole with every game that children start playing? Once children are banned from creating an account on one game, they're just going to move to another game.\"\n\nIncluding games in ban an 'overreaction'\n\nProfessor Carter said the risk factors did not justify the social media ban being expanded to include online video games.\n\n\"The risks are overwhelmingly outweighed by the positive social, creative and intellectual benefits of playing games for young people,\" he said.\n\n\"Parents should engage with their children and the [video] games they play, but banning children from those spaces would be a ridiculous overreaction.\"\n\nMarcus Carter says play, digital or otherwise, is a human right for all children. (Supplied: University of Sydney)\n\nAccording to a statement released by the Interactive Games and Entertainment Association, video games are regulated by the National Classification Scheme, which provides clear guidelines on age-appropriateness and content.\n\nDevelopers building safer games\n\nAshley Ringrose, founder of Australian video game developer SMG Studios, said he was not worried about losing business over the ban.\n\n\"Only about 2 per cent of our market is in Australia, so even if we lose 50 per cent of our [Australian] users, it's 1 per cent of our market,\" he said.\n\nMr Ringrose, a father of two, said SMG Studios' games, some of which allowed young people to interact online, were designed with safety in mind.\n\nAshley Ringrose says SMG Studios restricted online players to 13 years plus when developing Risk: Global Domination. (Supplied: SMG Studios)\n\n\"Children could describe something innocuous, like where they live, their school or their favourite restaurants, that identifies them. We try to restrict that,\" he said.\n\n\" We purposely don't have live [text or voice] chat in our games because of the potential for exploitation of people giving basic personal information. \"\n\nMr Ringrose said SMG Studios had also used \"canned chat\", where players send pre-defined messages and restricted online play to players' digital friends or teenaged players only.\n\n'Not the right way to go'\n\nProfessor Carter would like to see more safeguards in online video games, but he said a ban was not the answer.\n\n\"A ban is going to eradicate the opportunity to create 'safety by design' features that make children's online play worlds better,\" he said.\n\n\"That's not the right way to go about building a safer children's internet.\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/summer-algal-vouchers-south-australia/105883636",
    "title": "$50 meal refunds, $500 travel vouchers in SA's algal bloom summer plan",
    "publish_date": "Mon, 13 Oct 2025 01:43:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Some customers at South Australian coastal dining venues will be able to access $50 cashback on their meal over summer under a $15 million state and federal government program to support algal bloom-affected businesses.\n\nAs part of a rolling series of announcements about the state government's algal bloom summer plan, Premier Peter Malinauskas on Monday revealed 300,000 dining vouchers — each worth up to $50 — would be made available to support coastal hospitality businesses.\n\nA public ballot for the scheme will open on November 3 with 60,000 vouchers on offer, followed by subsequent ballots in December, January, February and March.\n\nAlgal bloom relief scheme A dolphin tour operator is backing the state government's new algal bloom tourism relief scheme, but says he will not benefit because the mammals have disappeared from his usual visiting sites.\n\nThe program will allow a customer with a voucher to upload their meal receipt from a participating business along with their unique voucher code to receive 50 per cent off their meal, up to $50.\n\nThe program is open to hospitality businesses — including restaurants, cafes, pubs, clubs and takeaway venues — which register and are in eligible postcodes.\n\nThe premier said the dining cashback program was \"unlike any other one we've seen in the state before\".\n\n\"When you do the numbers, that means that there is $30 million set to be expended in coastal communities where $15 million will be given as a cashback to patrons who take up the opportunity to visit a coastal community,\" he said.\n\n\"We anticipate that it will stimulate a huge amount of demand in coastal communities.\"\n\nNew round of travel vouchers\n\nThe $15 million dining program, funded 50/50 by the state and federal governments, is on top of a second round of the \"Coast is Calling\" travel voucher scheme.\n\nThis will see another 30,000 travel vouchers — some worth up to $500 — made available over summer to encourage tourism along the state's algal bloom-affected coast.\n\nThe expanded scheme includes accommodation vouchers worth $500 for a five-night minimum stay, $200 for a two-night minimum stay, and $100 for a one-night minimum stay, as well as $100 vouchers for tourism experiences.\n\nUnlike the first round announced in August, holiday rentals — including Airbnbs — are eligible to participate.\n\nA public ballot for the pool of 30,000 vouchers will be open from December 1 to 3 and drawn on December 4.\n\nThe vouchers can be used for travel from December 5 to April 26 and a booking must be made by January 19.\n\nThe expanded scheme is one element of the state government's algal bloom summer plan.\n\nIt follows the announcement on Sunday that Surf Life Saving patrols would be inspecting for foam and discoloured water seven days a week at six metropolitan and two regional beaches over summer.\n\nMeanwhile, the Beachsafe app and website will be updated to include algal bloom information, with updates to be initially provided for 23 locations across the state.\n\nFoam at Henley Beach in August 2025. (ABC News: Che Chorley)\n\nThis will include whether the beach is clear of abnormal foam, if the water is discoloured, and what time the beach was last cleaned, with a fresh picture also supplied.\n\nMr Malinauskas said the summer plan announcements so far were \"just the beginning\".\n\n\"By the end of the week, you will see the total package of the summer plan and how its broken down into its parts,\" he told ABC Radio Adelaide.\n\nThe premier said all parts of the summer plan were funded 50/50 with the federal government.\n\n\"We're talking serious money here to tackle a really difficult problem,\" he said.\n\n\"This is a big effort to make sure that people are enjoying the beach and we don't have adverse economic outcomes.\"\n\nThe voucher scheme does not, for the most part, apply to hospitality and dining businesses.\n\nShadow Environment Minister David Basham welcomed the voucher program and surf life saving patrols, but criticised the government's messaging.\n\nSA life savers to battle bloom with extra summer patrols A record number of SA beaches will have Surf Life Saving patrols seven days a week, as the state grapples with its toxic algal bloom.\n\n\"These are great initiatives and things that we've been calling for all the way along and really disappointed it's taken this long for these things to turn up,\" he told ABC Radio Adelaide.\n\n\"There are so many questions that still need to be answered, sadly the messaging from the government has been poor all the way along.\n\n\"It's not about the opposition attacking them, it's actually the government actually haven't been telling people what they need to know.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/treasurer-announces-rework-of-stalled-super-tax-increase/105884568",
    "title": "Breaking: Treasurer announces rework of stalled superannuation tax increase plan",
    "publish_date": "Mon, 13 Oct 2025 01:18:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "The government has bowed to pressure on its superannuation tax policy, one of the few revenue-raising measures it had promised, two years on from when it was first announced.\n\nTreasurer Jim Chalmers confirmed he had worked with the prime minister to overhaul the proposal to increase taxes on the largest superannuation balances, which was signed off by cabinet this morning.\n\nThe government has made two key concessions that were criticisms of the bill: first, the threshold at which higher tax rates will kick in will now be indexed to inflation, and the proposal will no longer apply to unrealised capital gains.\n\nAlongside the $3-million threshold at which the tax rate on earnings had been doubled, a new threshold of $10m will also be created at which a 40 per cent tax rate will be applied.\n\nBut those thresholds will now be indexed, meaning it will no longer capture more people over time due to bracket creep.\n\nThe government expects the $3m threshold to apply to roughly 90,000 balances and the $10m threshold to apply to about 8,000 balances.\n\nThe treasurer said the government was prepared to rework the bill to see it through parliament.\n\n\"We have always had in our back pocket indexation, or an indexation like this, in order to get it through parliament,\" Mr Chalmers said.\n\nA tax offset for low-income earners would also be increased from $310 to $810, and would be offered to workers earning up to $45,000, which Mr Chalmers said would give those people about an extra $15,000 at retirement on average.\n\nMr Chalmers said the new plan would raise slightly less than the government's original proposal in the short-term.\n\nBut now that the tax increases will be indexed significantly less is expected to be raised in the longer-term.\n\nThe government has always argued that those thresholds could have been adjusted over time to account for inflation.\n\nGreens leader briefed\n\nThe treasurer confirmed he also met with Greens leader Larissa Waters shortly after the rework was agreed to by cabinet, with the minor party shaping as the most likely option for the bill to be passed.\n\nThe proposed tax increase on some of the nation's wealthiest income earners was announced more than two years ago, and was meant to be in effect from July.\n\nBut it was met with criticism, including from within Labor, and the bill was never introduced to parliament.\n\nLate last week it emerged that the prime minister's office, alongside the treasurer's, had sought advice from the Treasury Department on how to address some of the \"concerns\" with the bill.\n\nThe treasurer played down questions about the government's appetite for reform, given the difficulty it has had with one of the few revenue-raising measures committed to by the government.\n\n\"This is difficult tax reform … I don't accept the characterisation this is simple, or easy or uncontested,\" Mr Chalmers said.\n\n\"This is a difficult change which will mean we raise billions of dollars.\"\n\nIt will begin from July next year.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/biggest-light-installation-ever-on-earth-planned-for-albany/105866412",
    "title": "Light show visible from space set to illuminate WA's south coast",
    "publish_date": "Mon, 13 Oct 2025 01:04:40 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "A monumental light installation so vast and bright it will be visible from space is set to illuminate Western Australia's south coast.\n\nThe installation, to be projected onto Albany's King George Sound, will be the largest lightscape artwork ever created, spanning a massive 15 kilometres of the surrounding hills.\n\nFinnish artist Kari Kola, who has illuminated famous sites including Stonehenge, the Eiffel Tower and the rugged Irish Connemara mountains, said his Albany installation, titled Lighting the Sound, would be his largest work yet.\n\n\"Creating the largest light installation on Earth is no small feat — this installation will be so monumental that we will be having it filmed from space via a satellite,\" he said.\n\nThe project is part of celebrations for Albany's bicentennial and will be on display for three weekends in March.\n\nIt is expected to bring 50,000 people to the region.\n\nKari Kola says the work will be his largest yet. (Supplied: Christopher Lund)\n\nRed beams of light represent bloodroot\n\nKola said the inspiration for his first Australian display was equal parts culture and location.\n\n\"The idea of the project started actually from the Menang people and the Menang plant … the bloodroot,\" he said.\n\nTasting the plant inspired the installation.\n\n\"It was incredibly spicy, a powerful medicinal herb with a flavour that left a lasting impression,\" he said.\n\n\"Taste became the beginning of the story.\n\n\" The red beams of light will represent the roots, connecting the land to the cosmos. \"\n\nKari Kola has illuminated famous sites including Stonehenge and the Eiffel Tower. (Supplied: Christopher Lund)\n\nThe 47-year-old's passion for creating massive lightscapes was born in 2006, after an accident in which he broke his back while working as a lighting tech in a concert hall.\n\nHe was paralysed from the waist down, but as he learnt to walk again, Kola said he was gifted a new perspective on life.\n\n\"I remember those slow walks and the light and how it touched things … it changed my perspective,\" he said.\n\nKola said the accident was the best thing that could have happened to him.\n\n\"I want to be uncomfortable so that I can push myself to learn more … to achieve an installation of this immense scale, you have to have cooperation, teamwork and be open to knowledge,\" he said.\n\nDisplay to illuminate culture\n\nThe display was developed in consultation with the Albany community and local elders to make it more than a light show.\n\n\"This red light has a significance — it's related to a special plant that used to, and still does, grow here,\" said Menang elder Lester Coyne.\n\nLester Coyne hopes people gain a new appreciation for the local culture. (ABC Great Southern: Andrew Collins)\n\n\" It was used as a food source for our people and to have it featured in that way is quite spectacular. \"\n\nMr Coyne said he hoped people would gain a new appreciation for local culture through the display.\n\n\"I'd like to think this isn't just about looking at coloured lights — it's about remembering why they're there, what they represent and the story behind them.\n\n\" It reminds people that we shared this country and some paid a very heavy price for that. \"\n\nKing George Sound will be illuminated with 750 LED lights and a dozen red pencil beams. (Supplied: Christopher Lund)\n\nMore than 750 high-powered LED floodlights and a dozen red lasers, dotted along the sound, will project a special hue designed to have a minimal impact on the environment.\n\nWhile the artwork is temporary, Kola said he hoped its fleeting nature would live on in people's memories.\n\n\"I hope that the project will leave residents and visitors to Albany with a positive and permanent memory that will be forever etched in their mind, without leaving anything visible behind,\" he said.\n\n\"I hope that 50 years after the project, there will still be people talking about 'something special that happened' in Albany.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/diane-keaton-cause-of-death-private-health-decline/105883902",
    "title": "Diane Keaton's family kept 'sudden' health decline private",
    "publish_date": "Sun, 12 Oct 2025 23:49:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "News of actor Diane Keaton's death prompted emotional responses from her fans and peers, with many shocked by the 79-year-old's death.\n\nUS entertainment website TMZ has published audio it claims to be from an emergency services worker dispatching a crew to the actor's home.\n\nBut the clip gives little insight into the circumstances around Keaton's death.\n\nHere's what we know.\n\nWhat was Diane Keaton's cause of death?\n\nDiane Keaton's cause of death hasn't been made public.\n\nKeaton's death was first reported by US entertainment outlet People, which confirmed her death with an unnamed spokesperson for the actor.\n\nDiane Keaton's best films With a career beginning in the late 1970s, Diane Keaton would star in more than 100 films and earn several Oscar nods.\n\nThey gave no details about the circumstances surrounding her death.\n\n\"There are no further details available at this time, and her family has asked for privacy in this moment of great sadness,\" the spokesperson told the publication.\n\nA family member told The Associated Press that Keaton died in California with loved ones.\n\nWas Diane Keaton sick?\n\nDetails about her health aren't clear.\n\nIn a second story about her death, People reported Keaton's health had \"declined suddenly\".\n\nThe outlet quoted an unnamed spokesperson who spoke vaguely about Keaton's condition, only saying the actor's family kept her condition out of the public sphere.\n\n\"In her final months, she was surrounded only by her closest family, who chose to keep things very private,\" the spokesperson told People.\n\n\"Even longtime friends weren’t fully aware of what was happening.\"\n\nKeaton, right, starred alongside Bette Midler and Goldie Hawn in First Wives Club. (Getty Images)\n\nFew details in 911 audio\n\nThe audio published by TMZ is quite brief and gives little detail.\n\nTMZ said it obtained \"dispatch audio\" directed to the local fire department.\n\nThe website features a 20-second clip of a person saying \"rescue 19, person down\" before giving her address, which the outlet bleeped out.\n\nFans flock to last social media post\n\nThe most recent photo posted to Keaton's Instagram account featured her dog Reggie as part of a collaboration with a homewares brand.\n\nThe post was back in April, but fans of the actor took to the comments section over the weekend to pay tribute to Keaton.\n\nDiane Keaton's last Instagram post was in April. (Instagram: diane_keaton)\n\n\"A couple of years ago @diane_keaton saw me trying to help a stray dog who was running down Sunset Boulevard,\" one Instagram user said.\n\n\"She pulled over, grabbed a bag of treats from her car, and spent the next 2.5 hours on foot with me.\n\n\"Sadly we never got the pup, but I walked away knowing that I had just spent the afternoon with the very best of humans.\"\n\n\"Dianne stopped in the middle of the mall to take a photo of me and my husband carrying our Labrador on the escalators because she loved dogs so much. What an angel! Rest in peace xxx,\" another added.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/pat-cummins-unlikely-to-play-first-ashes-test/105883832",
    "title": "Cummins 'probably unlikely' to play in first Ashes Test",
    "publish_date": "Sun, 12 Oct 2025 23:43:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Pat Cummins says he is \"probably unlikely\" to play in the first Ashes Test in Perth as he continues to recover from a back injury.\n\nSpeaking in Sydney, the Australian skipper Cummins was asked about the chances of him being ready for the opening of the series on November 21.\n\nThe Ashes First Test: November 21-25 (Perth Stadium)\n\nSecond Test: December 4-8 (Gabba, D/N)\n\nThird Test: December 17-21 (Adelaide Oval)\n\nFourth Test: December 26-30 (MCG)\n\nFifth Test: January 4-8 (SCG) D/N = day/night Test\n\n\"We'll see how we go with the first Test, still got a bit of time — I'd say probably unlikely at this stage [to be fit for Perth], but doing everything we can to be right,\" Cummins told ABC Sport.\n\n\"Initially for a while it was quite awkward, really, I wouldn't say an acute pain, but it gets stiff and even holding a little baby after five minutes, you feel like you need to stretch your back a bit.\n\n\"The first step's re-introducing running, then some bowling prep work, so with net balls, then short run-up, full run-up, and then when you want high intensity, you want lots of overs.\n\n\"Our timeline's pretty tight so we're trying to condense what would normally take a few months into a little bit shorter than that, but we've got a pretty clear path. It's quite a common bowling injury so we know how to deal with them.\"\n\nCummins has not bowled since Australia's tour of the West Indies in July.\n\nRecent scans showed a stress injury in the Australian captain's back had not healed.\n\nCummins was non-committal when asked if there was a chance he could miss more than just one Test.\n\n\"Look, I hope not, but it's probably a bit too far out [timewise] to say,\" he said.\n\n\"I've got a session today, hopefully I'll tick that off, then you progress to the next one and the next one.\n\n\"Unfortunately, you can't forecast too far out, but at the moment I'm feeling good, there hasn't been any major hiccups so far.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHe admitted the uncertainty about when he could play again was frustrating.\n\n\"As a cricketer and a captain, you've got enough to think about with playing well, captaining — to add that extra layer of having to wonder about your preparation, your body as well, is frustrating,\" Cummins said.\n\n\"It's a little bit of a different prep, but I'll still be there even if I'm not playing and excited to cheer on the boys — obviously it [the Ashes] is going to be the biggest thing in cricket for the next few months and I want to be in the middle of it.\n\n\"I think after a really tightly fought 2022-23 away Ashes, [it] seems like this one's been building for a few years. So there's going to be a lot of conjecture and noise, I'm sure, but it's going to be great fun.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/nt-government-voluntary-assisted-dying-report-recommendation/105515296",
    "title": "Judy's husband was the first person in the world to die under VAD laws",
    "publish_date": "Sun, 12 Oct 2025 22:24:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Judy Dent remembers the day her terminally ill husband Bob told her he had enough.\n\nBob Dent had been suffering from incurable prostate cancer for nearly five years, and by that stage Judy said Bob was only half living.\n\n\"It got to the stage where managing the pain meant that he couldn't see, he couldn't hear, he couldn't do anything,\" she said.\n\nJudy Dent's husband was the first person to die from a legal, voluntary lethal injection, and she has remained a VAD advocate since his death. (ABC News: Peter Garnish)\n\nIn September 1996, Bob Dent became the first person in the world to die through legally accessible voluntary assisted dying (VAD).\n\nHe was able to access the health service after the Northern Territory — under then-chief minister Marshall Perron — passed the Rights of the Terminally Ill Act in 1995.\n\nIn 1995, then-chief minister Marshall Perron's successful private members bill made the Northern Territory the first jurisdiction in the world to allow access to voluntary assisted dying.\n\nIt was a piece of legislation that made the territory the first place in the world to allow terminally ill patients to have control over when and how they died.\n\nSo, after a Sunday lunch with doctor Philip Nitschke, in a bed set up on the verandah of Bob and Judy's Darwin home, Dr Nitschke asked Bob a series of three questions.\n\n\"Bob said 'yes … yes … yes' and then the fluid started going into his arm,\" Judy said.\n\n\"Almost instantly the pain signs disappeared from his face and he just looked peaceful.\"\n\nJudy held Bob's hand all the while.\n\nJudy Dent believes there is community support for the introduction of VAD in the NT. (ABC News: Michael Franchi)\n\nA year after Bob died, the federal government intervened and overturned the Perron government's law, stripping the Northern Territory of its power to allow voluntary assisted dying.\n\nThat remained the case for 25 years, until the federal government repealed the ban in 2022, giving the NT and ACT the ability to pass VAD legislation.\n\nWith all other Australian states and territories having now legalised VAD, the NT remains the only jurisdiction in the country that has not.\n\nIn May, the NT government tasked a parliamentary committee with consulting communities across the territory on the issue and, if recommended, providing drafting instructions for a new law.\n\nThe committee has now tabled its report, recommending \"VAD legislation be adopted in the NT\".\n\nThe drafting instructions, aimed at shaping an NT-specific framework, included not requiring there to be a timeframe on a person's prognosis — or no fixed \"months to live\" requirement.\n\nThe NT has the nation's highest proportion of Indigenous Australians, and many people live in remote areas.\n\nThe committee's view was VAD should be provided across the territory with a decentralised — or community-based — delivery model.\n\nIt recommended potential NT VAD legislation expand the parameters of institutional conscientious objection — the ability to refuse to provide an aspect of VAD due to moral or ethical conflicts — to promote cultural safety.\n\nA report tabled to the NT government recommended adopting voluntary assisted dying laws. (Supplied: Unsplash/Manny Becerra)\n\nThe committee also recommended the government develop a territory-wide palliative care strategy, after hearing evidence and testimonies during the VAD consultation process.\n\nJudy said she welcomed the prospect of VAD becoming once again accessible in the NT.\n\n\"We have been waiting for this a long time,\" she said.\n\nCultural and religious concerns remain\n\nDespite the parliamentary report and community support, there is still some opposition.\n\nLoading...\n\nAlice Springs-based Pentecostal Christian pastor Sherry Lowah, an Arrernte, Luritja, Pitjantjatjara and Torres Strait Islander woman, said VAD legislation was a community decision, not just an individual's decision.\n\n\"Indigenous people see life as sacred. We have to fight to the end and you don't give up on people,\" Pastor Lowah said.\n\nKenneth Devereux, a retired minister for the Uniting Church of Australia in Alice Springs, weighs the issue differently.\n\n\"I'm aware of orthodox tradition that says life is sacred, but I also see the Christian tradition of offering compassion for people who are suffering as being an equally important part of respecting the sanctity of life,\" he said.\n\nThe Catholic Church has long been against VAD in all its forms, but Father Prakash Menezes, the parish priest of Santa Teresa, believes the argument is not \"just a religious thing\".\n\n\"It is a natural law to protect life. The debate has changed from where it once was,\" he said.\n\nFather Menezes said he was concerned VAD laws would gradually expand beyond the proposed legislation.\n\nHe believes that instead of VAD, Australia should improve its palliative care.\n\n\"Australia has got the means to do this\", he said.\n\nPhilip Nitschke wants the Northern Territory to pass laws allowing voluntary assisted dying. (ABC News: Tristan Hooft)\n\nNearly 30 years since Dr Nitschke treated Bob Dent on that Darwin verandah, he maintains his view that VAD is a human right.\n\n\"It is not for us to decide if people want to die, that is their choice,\" he said.\n\nAfter years of campaigning for VAD to be legalised, Judy said it was anybody's guess when the NT government would act on the parliamentary report's recommendations.\n\nShe believes there is wide support for VAD legislation in the territory.\n\n\"I don't think we should be deprived of the legislation because one or two members of parliament don't think it's a good idea,\" she said.\n\n\"Have they had a mass destruction of population in every state? No, they have not.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/minjee-lee-finishes-third-in-epic-lpga-shanghai/105883722",
    "title": "Minjee Lee finishes third in epic LPGA Shanghai finale",
    "publish_date": "Sun, 12 Oct 2025 22:02:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian golf superstar Minjee Lee remains upbeat despite her player-of-the-year hopes suffering a significant blow in a thrilling climax to the LPGA Shanghai tournament.\n\nLee's expected final-round charge failed to materialise as world number one Jeeno Thitikul denied Miname Katsu a maiden LPGA Tour victory in an epic play-off on Sunday.\n\nThitikul drained a metre-long birdie on the fifth extra hole at Qizhong Garden Golf Club to become the tour's first two-time winner in 2025.\n\nThe victory also extended the Thai's slender lead over Lee in the race for player-of-the-year honours.\n\nThere are six events remaining, including next month's $US11-million ($16.78m) season-ending Tour Championship in Florida.\n\nAfter starting the final round two shots behind Katsu in a tie for second with Thitikul, Lee fired a four-under-par 68 on Sunday to finish five shots behind the play-off pair in third place.\n\nLee had pulled to within one stroke of the lead with a birdie at the second hole on championship on Sunday.\n\nBut that was as close as Australia's triple major champion would get — Lee was unable to keep pace with her two final-round playing partners, who produced a titanic battle down the stretch.\n\nKatsu enjoyed a four-shot lead with five holes to play, but Thitikul closed the gap with three birdies and a steely eagle on the par-5 17th, moments after needing to settle herself after watching Katsu chip in for birdie.\n\nThitikul looked beaten twice more in the play-off, especially after driving into water on the second extra hole.\n\nBut the world number one knocked a spectacular approach to inside a metre and saved par to force a third extra hole after Katsu left her second putt to win hanging over the lip of the hole.\n\nWith a closing nine-under 63, Thitikul and Katsu (65) produced 14 birdies and an eagle between them in regulation play to both finish at 24 under par for the championship.\n\nBut neither could conjure another birdie until Thitikul's winning play on the 77th hole to finally atone for two gut-wrenching runner-up finishes in her previous two starts.\n\n\"What happened on the last event definitely was still in my mind, but to be able to prove myself again this tournament is just such … a dream come true,\" Thitikul said after atoning for a shocking four-putt that gave Charley Hull victory at her last start.\n\n\" I've had so many dramas in my golf career, for sure. \"\n\nAt 19-under, Lee's outright third was her seventh top-five result, eighth top-10 and 15th top-20 finish from 20 events in 2025.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBut with Thitikul prevailing, the world number four will almost certainly need to win for a second time, adding to her Women's PGA Championship triumph in June, to crown her stellar season with the player-of-the-year award.\n\n\"I feel like I did a lot of things well these past four days, despite being really over heated every single day,\" Lee said.\n\n\"I would like to get my driving a little bit cleaner for the next few weeks, but I've been striking it pretty well with my irons and doing pretty well with the putter as well.\n\n\"So going into next week and and CME [the Tour Championship], I think I could bring everything together and hopefully contend in all these weeks as well.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/mount-magnet-shire-deputy-suspended-after-defamatory-notice/105880958",
    "title": "Councillor suspended after no apology for defamatory notice",
    "publish_date": "Sun, 12 Oct 2025 22:00:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's highest administrative authority has suspended a Mid West shire deputy president for failing to apologise for a defamatory statement he posted about two council staff members.\n\nOn Friday, the State Administrative Tribunal (SAT) suspended Mount Magnet councillor Ian Black from council activities for three months.\n\n'Small man syndrome'\n\nLast May, Cr Black was recorded on CCTV stapling a printed document to a noticeboard that made defamatory comments about two shire employees.\n\nCCTV captured Cr Black stapling the document to a noticeboard. (Supplied: Shire of Mount Magnet)\n\nAddressed to Mount Magnet \"ratepayers and residents,\" it named an employee that Cr Black said suffered from \"small man syndrome\" and \"manages to cause grief wherever he goes\".\n\nIt called another employee a liar multiple times.\n\nCr Black has been suspended by the SAT. (Supplied: Shire of Mount Magnet)\n\nShire president Jim McGorman said Cr Black was clearly captured on video posting the document, which said \"pretty horrible stuff\".\n\n\"The camera can actually see him doing it,\" he said.\n\n\" He pushed 11 staples into the actual sign, [then] took a photograph of it. \"\n\nThe incident was brought to the Local Government Standards Panel, which found Mr Black had breached the local government moral code of conduct.\n\nHe was ordered by the panel to make a public apology to the two people involved, but he did not comply.\n\nThe matter was escalated, this time to the SAT, where Senior Member Stephen Willey imposed an immediate three-month suspension on Cr Black.\n\nNo plan to appeal\n\nCr Black told the ABC he put the notice up on behalf of someone else.\n\n\"I wasn't too sure that it was a good idea, but in any event I did put it on the noticeboard,\" he said.\n\nCr Black said he was not aware that the panel had ordered him to make an apology, and by the time he found out, it was too late to do so within the specified time frame.\n\nCr Black has been on council for six years. (ABCMidwest & Wheatbelt: Chloe Henville)\n\nHe said he did not tell the council he intended to make an apology until the matter was brought up in the SAT.\n\n\"I told the tribunal that I hadn't been given the opportunity to make a public apology,\" Mr Black said.\n\nCr Black said the situation was \"grossly unfair,\" but it was not \"worth\" appealing.\n\nCouncil integrity 'compromised'\n\nCr McGorman said the SAT decision was the end of an 18-month saga.\n\n\"It's been a huge relief for us as a council to have this finally resolved,\" he said.\n\nCr McGorman said while Cr Black's actions were \"an individual thing\", it reflected poorly on the whole council.\n\n\"Our integrity has sort of been compromised in that sense,\" he said.\n\n\"I'm hoping that Cr Black takes this suspension seriously and, again, he changes his conduct.\"\n\nCr McGorman hopes the suspension will be an end to the matter. (ABC Midwest & Wheatbelt: Chloe Henville )\n\nCr Black has served on the shire for six years and is not due to stand for re-election until 2027.\n\nLast year, he was prosecuted by the Mount Magnet Shire for illegally transporting and dumping asbestos.\n\nCr Black pleaded guilty to three charges, but eventually entered into negotiations with the shire, and the charges were dropped.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/afl-trade-period-day-six-live-updates-merrett-curnow-petracca/105883736",
    "title": "Live: Crunch time arrives for big AFL trades as Tigers defender heads west",
    "publish_date": "Sun, 12 Oct 2025 21:29:11 +0000",
    "category": "sports",
    "authors": [
      "Chris De Silva",
      "Dean Bilton"
    ],
    "text": "Hi team - If Gold Coast trade out picks 7 and 8 and get back 24 (as is being reported), what would happen if West Coast bid on Uwland and then Patterson with pick 1? Would they be able to match both? - Simon\n\nIf the Petracca deal goes through for picks seven and eight, and if West Coast was to bid on Zeke Uwland and Dylan Patterson with the first two picks in the draft, the Suns would be right on the cusp of being able to match bids.\n\n(Getty Images)\n\nThe Suns are in the process of picking up some points from other avenues, hoping to get a little something back from Melbourne and looking to get some deals done for outgoing players to make up that deficit. Without that, it would be mighty tight.\n\nThere's also Beau Addinsall, who is also a first round prospect and will attract a bid the Suns will want to match. Is he the one that slips through to the keeper if they spend their points at the top of the draft?\n\nDoes a third club get involved in the Trac deal to help the Suns split one of those top-10 picks, loading up on points while still satisfying Melbourne? They are treading a very, very fine line and it's one of the most interesting stories to follow late in this trade period because the implications it has on the draft are massive.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/wa-tree-canopy-election-promise-walked-back/105865416",
    "title": "Fresh doubts over plans to boost Perth’s tree canopy",
    "publish_date": "Sun, 12 Oct 2025 21:16:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "The WA government is facing fresh questions over its plans to boost Perth's tree cover, with experts saying current funding will not come close to delivering on Labor’s election promises.\n\nPrior to the state election, WA Labor promised to almost double Perth's tree canopy from 16 to 30 per cent by 2040.\n\nA pre-election Facebook post from Roger Cook, spruiking a commitment to plant a million trees. (Facebook: Roger Cook)\n\nBut in May it adopted a new approach to calculating canopy which now includes some rural areas, and this saw Perth's canopy figure jump to 22 per cent – meaning the new goal is an 8 per cent increase, rather than a 14 per cent jump.\n\nThe Western Australian Local Government Association (WALGA) was surprised by the sharp rise in urban canopy, given the city has lost nearly 5,000 trees to the polyphagous shot-hole borer in recent years.\n\n\"It doesn't matter what figure we announce or come up with, we are living in a city that's urban canopy is a disgrace,\" WALGA president Karen Chappel said.\n\nWALGA state president Karen Chappel. (ABC News: Rhiannon Shine)\n\nSarah Allchurch, co-founder of the Western Australian Tree Canopy Advocates (WATCA), was even more scathing.\n\n\"When you start counting paddocks as urban canopy, you're not measuring progress you're actually hiding the problem,\" she said.\n\nMaps showing Perth's urban tree canopy area in 2020 and 2024. (Supplied: WA government )\n\nBut Minister for Planning and Lands John Carey said the previous methodology was flawed because it wasn't capturing rural areas that might be subject to future development.\n\nHe said 30 per cent remained the state government's \"big, bold and ambitious\" target.\n\nHow these tiny forests could be the solution to our dwindling tree canopy problem These pocket forests are grown using the Miyawaki method, created by Japanese botanist Akira Miyawaki in the 1970s, and their rapid maturation could be the solution to Perth's shadeless suburbs.\n\nLabor also promised $16.9 million on programs and incentives that it said would help deliver one million new trees planted in metropolitan Perth by 2035.\n\nThis included a new household 'tree-bate' scheme which pays up to 10,000 people a year to plant a tree at home — so far 3,500 have taken it up.\n\nThe ABC understands the government has since been advised that the money may only result in around 130,000 new trees.\n\n'Rolling program'\n\nMr Carey said there would be further policy announcements to come.\n\n\"I suspect you will see this is a rolling program,\" he said.\n\nLoading...\n\nOf all the Australian capital cities, Perth has the lowest tree canopy — shade that can lower temperatures by several degrees Celsius on days of extreme heat.\n\nIt can also improve people's health and property prices, reduce energy costs and support biodiversity.\n\nTrees can boost health, increase property prices and reduce energy costs. (ABC News: Rhiannon Shine)\n\nLast year Mr Carey intervened to scrap a scheme that would have enforced the protection of mature trees on some private properties.\n\nHe has previously argued the tree protection laws were controversial because they impacted home owners who wanted to build or renovate on their property.\n\nLoading...\n\n\"We've got to take the community with us because we can put in any or all these [punitive] policies, but nothing stops a person just ripping out a tree any time — and then it's done,\" he said.\n\nBut some experts said the government was not going to shift the needle with an all-carrot-no-stick approach, when nearly 80 per cent of tree loss happened on private property.\n\n\"We'll never be able to get to the 30 per cent target by 2040 just by planting trees,\" said Paul Barber, the managing director of environmental consultancy ArborCarbon and adjunct professor at Murdoch University.\n\nPaul Barber says the 30 per cent target can't be reached by planting alone. (ABC News: Rhiannon Shine)\n\n\" If we continue to do what we are doing, plan the way we are planning, have the lack of protections for trees, and have the budgets that are available for planting trees, we just won't get there. \"\n\nMr Barber works with local and state governments to help boost their green space using satellite imaging to map tree canopy.\n\nHe said poor planning was a key issue in parts of Perth.\n\n\"What happens is we come in, we knock all the trees over, and we create a landscape that's devoid of any vegetation,\" he said.\n\nMr Carey argued the state government had already taken steps like mandating deep soil zones and incentivising tree retention, but faced a \"quagmire\" due to the housing crisis.\n\nJohn Carey says more will be done to boost Perth's tree canopy. (ABC News: Courtney Withers)\n\n\"We need more housing development, and so we're trying to cut red tape around that, but also we need more canopy,\" he said.\n\nWA Greens leader Brad Pettitt said protecting trees and building houses did not need to be mutually exclusive.\n\n\"There is a real risk that this government's legacy is going to be a bunch of unliveable, tree-less, hot housing in the wrong locations,\" he said.\n\nThis aerial shot shows the tree canopy in the northern Perth suburb of Darch. (ABC News: West Matteeussen)\n\nWALGA has developed a local planning policy for protecting mature trees on private land which has so far been adopted by seven local councils.\n\nAustralia on alert as shot-hole borer wipes out thousands of trees It's barely the size of a sesame seed, but the shot-hole borer has quickly devastated Western Australia's tree canopy. Experts are warning other states and territories to take action now to avoid a similar fate.\n\n\"With the state government missing in action on this, local governments have to step in,\" Ms Chappel said.\n\nLike Labor, the WA Liberals do not support blanket tree protection laws.\n\nThe party's planning spokesman Neil Thomson said the 30 per cent canopy goal should be replaced with more \"realistic\" individual local government targets.\n\nMr Carey said he hoped to release the Perth and Peel Urban Greening Strategy, which has been under development since early 2024, by the end of this year.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/climate-integrity-accc-to-investigate-gas-lobby-ey-modelling/105866988",
    "title": "ACCC urged to probe 'distorted research' behind government gas policy",
    "publish_date": "Sun, 12 Oct 2025 21:16:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Advocacy group Climate Integrity has accused the gas industry of using \"distorted research\", produced by the accounting firm EY, to influence the Australian government's Future Gas Strategy.\n\nFederal government releases its Future Gas Strategy Resources Minister Madeleine King has released the federal government's Future Gas Strategy, saying more natural gas is needed for Australia's energy transition.\n\nIt has asked the competition regulator to investigate whether the Australian Energy Producers (AEP), and by extension EY, made misleading or deceptive claims in its 2023 submission to the government's Future Gas Strategy and in related promotional material.\n\nThe AEP is the peak lobby group for gas and oil producers in Australia.\n\nThe Albanese government's Future Gas Strategy was released in May 2024. It supported a gas expansion in Australia and continued use of gas well beyond 2050.\n\nClimate Integrity says AEP used EY's alleged \"flawed modelling\" in its submission to claim that \"independent analysis confirms new gas supply is needed in all net zero pathways.\"\n\nIt says the AEP's claim contradicts the views of authoritative scientific bodies, internationally and in Australia, including the Intergovernmental Panel on Climate Change (IPCC), the International Energy Agency (IEA), the International Renewable Energy Agency (IRENA), and CSIRO.\n\nIt says AEP has also used that EY modelling to push for new gas fields, pipelines and long-term LNG export contracts.\n\n\"AEP, with the support of EY, produced sophisticated disinformation that misled policymakers and influenced the national climate strategy to expand gas production, and delay the energy transition under the guise of credible analysis,\" said Claire Synder, the director of Climate Integrity.\n\n\"This kind of disinformation is called data washing, and is particularly harmful because it's so hard to spot.\n\n\"It positions itself as an independent technical assessment and uses the language of expertise and the aesthetics of research to embed fossil fuel-friendly narratives deep within the policy making process.\n\n\"The so-called 'independent research' gives vested interests a veil of credibility, which they exploit to lobby parliamentarians and the broader public, distorting the framing of policy debates,\" she said.\n\nAn EY spokesperson told the ABC:\n\n\"Scenario modelling is an assessment of potential future pathways, not a prediction. It incorporates assumptions and judgements that are transparently disclosed for the purposes of debate and discussion. \"EY's modelling in the report referenced clearly discloses our assumptions, scenarios and parameters underpinning the modelling.\"\n\nThe AEP was contacted for comment.\n\nEDO's letter to the regulator\n\nWhen the Albanese government released its Future Gas Strategy in May 2024, some Labor backbenchers said they were \"blindsided\" by the policy's promotion of the gas industry.\n\nLabor backbench 'blindsided' by Albanese gas strategy Labor backbenchers say they were caught off guard by the government's new gas policy, which the resources minister says will keep the fossil fuel in Australia's energy mix until 2050 \"and beyond\".\n\nClimate Integrity says since the Future Gas Strategy was released, the Albanese government has approved 12 major coal and gas projects, and issued nine offshore exploration permits for gas supply, with project lifetime emissions reaching billions of tonnes of C02 equivalent.\n\nIt says that gas expansion directly contradicts the International Energy Agency's Net Zero by 2050 pathway.\n\nClimate Integrity is a not-for-profit advocacy group. It was founded in 2024 to \"increase the ambition, integrity and accountability of the climate commitments of Australian companies.\"\n\nIts team is made up of analysts and climate advocates, supported by a network of experts comprising academics, researchers, lawyers, and civil society leaders.\n\nLast month, the Environmental Defenders Office (EDO), acting on behalf of Climate Integrity, formally asked the Australian Competition and Consumer Commission (ACCC) to investigate some of the claims made by AEP in its submission to the government's Future Gas Strategy, and associated promotional material referencing EY's modelling.\n\nIn its letter to the regulator, the EDO said:\n\nOur client requests that the Australian Competition and Consumer Commission (ACCC) investigate whether certain representations made by Australian Energy Producers (AEP) in relation to future East Coast gas demand and the deployment, cost and scalability of Carbon Capture Utilisation and Storage (CCUS) and its capacity to reduce emissions are misleading or deceptive, or likely to mislead or deceive, in contravention of s 18 of the Australian Consumer Law (ACL). In the event that the ACCC finds that AEP contravened s18, our client further requests that the ACCC investigate whether Ernst & Young (EY) was an accessory to AEP's contravention. We note that the ACCC's compliance and enforcement priorities for 2025-2026 includes \"Consumer, fair trading and competition concerns in relation to environmental claims and sustainability with a focus on greenwashing\" and misleading claims in relation to energy.\n\nFuture gas policy must ensure domestic supply In unveiling its Future Gas Strategy, the federal government delivered a political sideshow away from the real conflict that has plagued Australia's economy for years: can we keep enough of the natural gas we already produce on home soil?\n\nThe EY modelling, which is the subject of Climate Integrity's concerns, can be found in the EY report: The future role of natural gas in Australia and the region (November 2023).\n\nThe AEP commissioned EY to produce the report to support the AEP's submission to the government's Future Gas Strategy.\n\nClimate Integrity commissioned the Institute for Sustainable Futures at UTS Sydney to analyse EY's modelling. It also conducted its own analysis of EY's modelling.\n\nThe Environmental Defenders Office, in its letter to the competition regulator, explains Climate Integrity's concerns with EY's modelling.\n\nQuestions about EY's modelling\n\nThe EDO says the AEP also used EY's modelling to make the claim, in a press release in November 2023, that: \"New gas supply needed in all net zero pathways: EY report.\"\n\nThe EDO told the ACCC that was not what the EY modelling said:\n\nEY's report does not conclude that \"new gas supply is needed\" in all net zero pathways. On the contrary, many of the net zero scenarios referenced by EY, including the IEA's Net Zero by 2050 scenario and IPCC Category C1 pathways, project steep declines in gas demand and explicitly state that no new gas fields are required beyond those already approved. Our client is concerned that AEP's statement creates the impression that continued gas expansion is both inevitable and required to meet net zero targets, in circumstances where this is inconsistent with authoritative international modelling. This may mislead policymakers, investors and the public, which may, in turn, undermine the integrity of Australia's public debate on energy and climate policy.\n\nThe EDO told the ACCC that Climate Integrity thinks AEP may be the \"primary contravener\" of Section 18 of the Australian Consumer Law, and EY may be an accessory.\n\nIn relation to the relevant representations being made \"in trade or commerce\", we note that the EY Gas Report was published with the intention of protecting the commercial interests of the natural gas industry. In that regard AEP's media campaign in relation to the Future Gas Strategy promotes that Australia will require substantial gas production to ensure reliable and affordable energy as part of the net zero transition.\n\nClimate Integrity says in EY's modelling, scenarios promoting a significant role for gas through to 2050 are not consistent with limiting global warming to 1.5 degrees Celsius.\n\nIt says in 1.5C-aligned models, gas production and use decline substantially, requiring either a complete phase-out or reliance on unproven levels of carbon capture and storage.\n\nAustralia's oil and gas lobby\n\nAEP is the peak body for oil and gas producers in Australia.\n\nOn its website, it says it has about 60 full members who account for 95 per cent of national petroleum production.\n\nGas lobby 'playbook' Analysis by international think tank InfluenceMap has looked at how the gas industry has pushed back against efforts in Victoria to transition away from gas as part of a global campaign to keep households hooked on the fuel.\n\nIt says it also represents about 140 associate members that provide \"a wide range of goods and services to the upstream oil and gas industry\" — including major consultancies EY, PwC, and KPMG.\n\nClimate Integrity has raised concerns about that relationship between EY with the AEP, wondering about the suitability of EY, as an associate member of the AEP, producing modelling and research for the AEP, on commission, to be used to promote the AEP's interests.\n\nClimate Integrity says it has been talking to EY's leadership about its concerns since June, and it has requested that EY publicly acknowledge the inaccuracies in its modelling.\n\nIt has also asked EY to commit to no longer providing advisory services that support the expansion of fossil fuels, and to drop its AEP membership.\n\nIt says EY has acknowledged Climate Integrity's concerns but has not taken any action.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/rebecca-melbourne-theatre-company-hitchcock/105863212",
    "title": "Rebecca was a novel, a Hitchcock classic, and now a thriller on stage",
    "publish_date": "Sun, 12 Oct 2025 20:25:29 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Pamela Rabe is accustomed to being cast as a \"tight, repressive woman with secrets\".\n\nThe statuesque, Canadian-born actor has carved an impressive place for herself in the Australian theatre and television industries, playing everything from one of the \"great theatre monsters\" to Joan \"The Freak\" Ferguson in Wentworth.\n\n\"I think that other people see that in me because of the way I look, the way I sound,\" Rabe says.\n\n\"And I've kind of resisted that for a time. But later in life, as some of these roles started coming at me in more rapid succession, there's a point where I go, 'oh, f*** it, I'm not going to turn that one down'. They're too much fun.\"\n\nHer latest role, in Melbourne Theatre Company's production of Rebecca, is as the haunting, black-clad housekeeper Mrs Danvers. The character is the source of many of the psychological thrills in the novel written by Daphne du Maurier in 1938, adapted by Alfred Hitchcock in 1940.\n\nPamela Rabe plays three roles in Rebecca — Danvers, Mrs Van Hopper and Beatrice: \"There was some magic to be had in having a very limited number of bodies in the space who were bringing the past to life.\" (Supplied: Photo by Charlie Kinross)\n\nThe film won the Oscar for Best Picture that year, and Judith Anderson was nominated for Best Supporting Actress for her eerie depiction of Mrs Danvers.\n\nRabe has long been fascinated with making Gothic theatre, and had been talking for years with director Anne-Louise Sarks about adapting one of du Maurier's books (the Cornwall author also penned The Birds, adapted by Hitchcock in 1963).\n\nSo Rebecca and the formidable Mrs Danvers were things Rabe relished diving into.\n\n\"There is a kind of iconic nature to the character: she's very still and apparently quite contained and enigmatic,\" she says.\n\n\"They're all characters with secrets. And those are always great things to play.\"\n\nWhat is Rebecca about?\n\nThe titular Rebecca looms large in this story, but the audience never meets her.\n\nShe instead exists as the spectral presence of the former mistress of Manderley estate, after dying in a boating accident the year before.\n\nNow her husband, Maxim de Winter, has brought a new bride back to his grand home. As the unnamed, naive young woman tries to create her place at Manderley, she reckons with the ringing presence of her predecessor.\n\nThis is relentlessly amplified by a cast of characters who all have their own ideas about who Rebecca was — particularly Mrs Danvers, who used to dote on the former Mrs de Winter.\n\nJudith Anderson's portrayal of Mrs Danvers was nominated for an Academy Award for Best Supporting Actress. (Wikimedia Commons)\n\n\"We all have different versions of [Rebecca], or a pretty clear idea of who we think she is,\" says Rabe.\n\n\"And as the woman is trying to put together the pieces of the jigsaw, she becomes more and more obsessed, really, fascinated and then obsessed, with her new husband's first wife.\"\n\nWhile a fan of the Hitchcock interpretation, director Anne-Louise Sarks (who is also director of the MTC) says it was the du Maurier book from which they most drew.\n\n\"I knew the Hitchcock film. It's a fabulous film, but there are things it doesn't satisfy for me,\" she said in an audience forum after a performance of the show.\n\n\"I was far more interested in getting inside the minds of the women in this story.\"\n\n\"It's a bit on the gloomy side,\" Daphne du Maurier wrote to her publisher, Victor Gollancz, about Rebecca. (Supplied: Hachette)\n\nShe was also determined for more people to understand the genius of the writer, who she says was ahead of her time.\n\n\"I feel like there's a wit and an intelligence to du Maurier that isn't always acknowledged immediately. You know, she was celebrated as a romance writer in the early days of Rebecca being in the world.\"\n\nCast-member Toby Truslove (The Cherry Orchard; Utopia) — who plays a rotation of three characters: Jack, Frank and Gran — says reading the book opened the story up for him in a totally different way.\n\n\"The book is so interesting, because you are left with your own choices about who Rebecca is. And who is the woman? You know, are you rooting for her? And what is she complicit in?\"\n\n'A brand new little thing'\n\n\"I brought what I believed on day one was a full draft of the script, and basically from then we started questioning absolutely every line,\" Sarks says.\n\nThe cast of four — rounded out by an incandescent Nikki Shiels as the unnamed woman and a brooding Steve Phillips as Maxim — pulled apart, reworked and interrogated each moment of the production. It's something Sarks admitted was \"a slightly mad thing to do on a traditional five-week rehearsal process\".\n\nToby Truslove (right) describes Anne-Louise Sarks (centre) as \"the most honestly, genuinely collaborative director I've ever worked with, who loves the thrill of creating together\". (Supplied: Charlie Kinross)\n\n\"A lot of plays that you get to see have really found their feet in front of an audience — and obviously the classics have been running many, many times,\" she said.\n\n\"This is a brand new little thing that's just in some ways really came together on opening night.\"\n\nSarks also drew on the monumental talents of set and costume designer Marg Howell, who recently won a Tony Award for her work on The Picture of Dorian Gray.\n\nCounteracting the elaborate, overbearing setting of Manderley in the film, the play set is stripped right back, the cast moving through a kind of black void of the woman's memory, with a brightly lit telephone, dressing table or bed emerging from the gloom.\n\nRabe describes the set — which also includes an enormous mirror on the ceiling, vines that seem to be alive, and terrifying mannequins — as \"extraordinary\".\n\n\"It's a psychological world where strange things and wonderful things can happen. What Marg's given us is really magic.\"\n\nMarg Howell (left) and Sarah Snook both won Tony Awards for their work on The Picture of Dorian Gray. (Photo by Jade Greene/WWD via Getty Images)\n\nRebecca in the modern age\n\nThe Hitchcock version of Rebecca was forced to tweak some crucial details at the end of the story, stripping away a particularly dark twist of the novel to satisfy censors at the time.\n\nAnd while the book did not have to adhere to such strict rules, it was still very much influenced by attitudes of the time, particularly towards the behaviour of women.\n\nLoading...\n\nRabe says they are all fascinated with \"embracing the enigma\" of that.\n\n\"This character is a 1930s female, written in the 1930s, and there are certain things Daphne du Maurier perhaps couldn't say or had to be kind of coded,\" she says.\n\n\"So, what happens if you give yourself permission to really open up some questions about that for an audience, about what kind of a woman Rebecca was, and how do you read that behaviour through a 21st-century filter?\"\n\nThe story is also tangled with du Maurier's life at the time, following widespread speculation that Rebecca was based on Jan Ricardo, the ex-fiancee of the writer's husband, Frederick Browning.\n\n\"It's a story about control and power and repression, and an idea about how women are supposed to behave,\" Truslove says. (Supplied: Photo by Charlie Kinross)\n\nIn Tatiana de Rosnay's biography, Manderley Forever, it is said that du Maurier was jealous and fixated on Ricardo, hiding any pictures of her.\n\nTruslove says he watched back interviews with du Maurier, trying to glean what she really thought of Rebecca.\n\n\"She speaks in one way about her and you're like, 'I don't even know if that's true — the author's lying',\" he says.\n\nRabe gives a half smile.\n\n\"I mean, you do get the feeling that Daphne du Maurier was the second Mrs de Winter … but she was also Rebecca.\"\n\nRebecca is showing at Melbourne Theatre Company until November 5.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/asx-markets-business-news-live-updates/105883026",
    "title": "Live: ASX slips on renewed trade war fears",
    "publish_date": "Sun, 12 Oct 2025 20:16:06 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts"
    ],
    "text": "And just like that, the tariff war exploded into the collective consciousness of just about every market as traders dumped risky assets and ran for the exits ahead of the weekend.\n\nUS President Donald Trump made his official announcement that he would impose an additional 100% tariff on imports from China, as well as export controls on critical US-made software, late in the day after the markets closed.\n\nHowever, he gave traders a heads-up in a social media post that he was weighing up a \"massive\" tariff increase on Chinese imports and said there was no reason to meet with China's President Xi Jinping in two weeks as planned.\n\nMr Trump was reacting to a new package of export controls on rare earths and critical minerals China released on Thursday.\n\nHaving tracked sideways for a bit over an hour in early trade on Friday, Wall Street suddenly headed south at warp speed at 10:57am, US eastern time. Fear and algorithms did the rest, with the key indices falling through to the close.\n\nIn a collapse not seen since early April, the S & P 500 dropped 2.7% and the Dow shed 1.9%.\n\nThe tech-centric Nasdaq was the hardest hit, down 3.6% — Nvidia, Tesla, Amazon and Advanced Micro Devices all fell more than 2% after the bell.\n\nEuropean stocks tanked in a last-minute slide, the broad Eurostoxx600 closed down 1.2%, having hit record highs earlier in the week.\n\nThe global equities index, the MSCI fell more than 2%.\n\nThe ASX 200 looks likely to follow suit with futures trading pointing to a 0.9% decline on opening.\n\nBrent and US crude oil futures fell around 3% to their lowest levels in six months.\n\nUS copper futures fell more than 5%, while soft commodities like US wheat and US soybeans dropped 1.5%.\n\nGold was the exception, with some panicky money sending it back above the $US4,000/ounce level again.\n\n\"The second-largest economy and the first-largest economy are arguing again, and we're seeing a sell first, ask questions later mentality to end the week,\" Carson Group chief market strategist Ryan Detrick told Reuters at the end of a torrid session. \"President Trump's post did truly come out of nowhere, which opened the door for some extreme volatility.\" \"And it's important to remember we haven't had this level of volatility in a long time,\" Mr Detrick added. \"One could argue we were due for some spookiness this October.\"\n\nThe US dollar index fell as did US treasury bond yields, although that didn't support the Aussie dollar, which dropped in the general \"risk-off\" trade.\n\nPerhaps the biggest losers of the session were cryptocurrencies, with Bitcoin down more than 8% on Friday and Ethereum down almost 6%.\n\nThe cryptos have since recovered a bit this morning as the temperature in what so far has been just a war of words between the US and China seems to have cooled over the weekend.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/federal-politics-live-blog-oct-13/105877648",
    "title": "Live: Labor's super tax changes will raise less revenue: Chalmers",
    "publish_date": "Sun, 12 Oct 2025 19:59:13 +0000",
    "category": "finance",
    "authors": [
      "Courtney Gould",
      "Tom Crowley",
      "Joshua Boscaini",
      "Keane Bourke"
    ],
    "text": "This is a substantial backdown.\n\nThe two major criticisms of this super tax — that its threshold wasn't indexed, and that it applied to \"unrealised\" gains — weren't just technicalities.\n\nThey were key to the amount of revenue this was to raise over time. Both are now gone, an admission after several years that the campaign against the tax was working.\n\nTo save a little of the revenue, a handful of people with extremely large balances will get an even higher earnings tax.\n\nBut even for those people, the fact that assets won't be taxed on their gains until they are sold gives them significant wriggle room.\n\nGiven the number of times Jim Chalmers suggested he wasn't for turning on this, the fingerprints of the PM are hard to miss, even if Chalmers maintains the decision was a team decision.\n\nThe treasurer has gone out on a limb since the election hinting that he wants to pursue even bolder reforms. Losing nerve on a change that affects a fairly small number of people may not bode well.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/tasmania-saltmarsh-wetland-restoration-on-merino-sheep-farm/105883488",
    "title": "Sheep farmer forgoes extra grazing land for 'beneficial' wetland restoration",
    "publish_date": "Sun, 12 Oct 2025 19:52:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "At Richmond Park Estate in the heart of Tasmania's Coal River Valley wine region, Will Eddington runs about 4,000 merino ewes and is starting to tap into viticulture.\n\nBeyond the merino pastures, his property also hosts an internationally significant wetland, which after extensive work is quietly bursting with new life.\n\nThe Ramsar-listed wetland's system spans across Will Eddington's property, around 20 minutes from Hobart city on the outskirts of Richmond town. (ABC News: Madeleine Rojahn)\n\nWetlands have been described as \"the Earth's kidneys\" by scientists, or \"blue carbon sinks\", as they filter pollutants from the oceans and air.\n\nThey also act as buffer zones during floods and are biodiversity sanctuaries.\n\nMr Eddington said he had enjoyed the interactions with different people through the project. (ABC News: Madeleine Rojahn)\n\nThe Pitt Water-Orielton lagoon on farmer Will Eddington's property is a declared shark refuge and home to various migratory birds and endemic species.\n\nPrior to colonisation, the abundant site was enjoyed by Tasmanian Aboriginal people, who gathered there to hunt.\n\n\"Wetlands are really like an Aboriginal supermarket. These spaces where we know we can get plants, birds eggs, fish,\" Trawlwoolway woman Emma Lee said.\n\n\"But they're also a place of beautiful contemplation of our understanding of connection to Country.\"\n\nThe site holds remnants of Aboriginal people who gathered at the site in the past. (ABC News: Madeleine Rojahn)\n\nThe restoration project, coordinated by not-for-profit Natural Resource Management South (NRM South), encouraged the return of the landscape's natural system through livestock exclusion fencing, planting and weeding over 65 hectares.\n\nColonisation, which brought European farming practices, is recognised as the catalyst for the broader demise of wetlands worldwide.\n\nAustralia has lost an estimated half of its wetlands, and achieving recompense relies on the concerted efforts of many — including conservationists, First Nations people, scientists, governments and landowners.\n\nRichmond Park Estate was bought by Will Eddington's family in 1986. (ABC News: Madeleine Rojahn)\n\nMr Eddington was approached by NRM two decades ago about accessing the Ramsar-listed wetland system stretching across his private property and a number of others.\n\nThe international Ramsar Convention recognises wetlands' importance to humans, animals and plants.\n\nAt first Mr Eddington said he was uncertain the project was a good idea, but on reflection, he changed his mind.\n\n\"Why be involved? I've got a real affiliation with coastal birdlife, and I'm also partial to a bit of fishing,\" he said.\n\nMr Eddington was initially unsure about taking part, but then an interest in fishing helped him change his mind. (ABC News: Madeleine Rojahn)\n\n\"As the project kept going over the years, it's become more and more obvious to me that it was really the right thing to do.\n\n\"I've enjoyed being part of it all the way through and enjoyed the interaction with people.\"\n\nAbundance returns with levee removal\n\nA decades-old levee had suppressed the wetland's natural tide in order to convert the marshy land into grazing pastures.\n\nIts removal about two years ago brought signs the wetland was beginning to function as nature intended it.\n\nVarious plant and animal species have been recorded returning to the site. (Supplied: NRM South)\n\n\"If you'd have been here five years ago, it was basically covered in algae, flies and really quite smelly,\" said Vishnu Prahalad, a geographer in wetland ecology.\n\n\"Since the removal of the levee, the tides have been able to access the site … and flush the site and remove the algae and — over time — improve the condition of the soil, the water quality.\n\n\" That's brought back the snails, the crabs, and the fish and life back into this flood plain. \"\n\nJuvenile fish show the area is being used as a nursery, which Mr Prahalad says means it could help sustain wild fisheries. (Supplied: G. Isdale)\n\nMr Prahalad said those involved in the project were excited to see baby flounders \"as big as your fingernail\". (Supplied: K. Montanaro)\n\nAs for Mr Eddington's penchant for fishing, tiny baby flounder, mullets, eels and other fish have been recorded at the site — signs it was being used as a nursery.\n\n\"These little fish need nooks and crannies like this to escape predation from the open sea and to hang out until they get a bit bigger,\" Mr Prahalad said.\n\n\" Then we effectively catch them as part of our recreational commercial fisheries. \"\n\nMr Prahalad said about 100 fish of more than 20 different species were recorded per 100 square metres, which was typically expected for saltmarshes.\n\n'Take the economical side out of it', farmer says\n\nNRM South chief executive Nepelle Crane said the restoration was occurring \"quite rapidly\", and while it did not necessarily provide economic return for landowners, she hoped that could change.\n\n\"We're trying to demonstrate what might be possible through emerging markets — so nature, carbon, biodiversity markets — and maybe other ways to diversify a farm, so looking at agri and ecotourism opportunities,\" Ms Crane said.\n\nSnails and other critters were not seen before the levee's removal, Mr Prahalad said. (ABC: Madeleine Rojahn)\n\nBut Mr Eddington has noticed a difference at Richmond Park Estate.\n\nFencing off riverbanks had stopped the spread of weeds, outcompeted by grasses and pasture, while lambing or grazing livestock could now have more trees to shelter under, he said.\n\n\"And then trees are coming back just naturally themselves — although we are doing some planting — but once they start and start dropping a few seeds, it's been really good,\" he said.\n\nMany different groups and people have helped bring the wetland back. (Supplied: NRM South)\n\n\"So we're achieving what we want to achieve without really needing to do too much once it's fenced off, and the ecosystem starts to do its thing, it's been beneficial to the farm.\"\n\nMr Eddington said it was nice to \"take the economical side of it out\".\n\n\"We could have grazed a few more sheep there, and there's a little bit of an economic downturn because of that.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-13/sunset-clause-laws-explainer-states-and-territories/105869886",
    "title": "Here's what a sunset clause is and when it can be enacted",
    "publish_date": "Sun, 12 Oct 2025 19:43:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "In recent years, stories about developers enacting sunset clauses and cancelling property contracts — taking the dreams of would-be buyers with them — have become increasingly common.\n\nOn the Gold Coast, a group of buyers have claimed — as others have in the past — that the developer did so to resell the units at a higher price. The developer has denied the allegations.\n\nThe buyers are in the process of preparing legal action, and want stronger laws introduced.\n\nSamuel Amey lodged a petition with the state government, calling for it to bring its sunset clause legislation in line with other states. ( )\n\nAround the country, state and territories are trying to tighten the rules around when sunset clauses can be used.\n\nWhat are sunset clauses?\n\nSunset clauses are most commonly spoken about in relation to off-the-plan contracts.\n\nA developer tried to cancel dream home contracts, but buyers are fighting it Buyers who bought off-the-plan at a Gold Coast housing development years ago weren't just purchasing a home — they were purchasing a dream. Now, the developer is trying to cancel their contracts, but they don't want to accept that lying down.\n\nThey set a deadline for when certain conditions, like construction and settlement, needs to be met.\n\nFor buyers, it means they can walk away from a project if it is delayed significantly and their plans change.\n\nAnd developers can cancel if labour shortages bite, construction costs increase or there are other delays, like periods of bad weather.\n\nHousing Industry Association (HIA) Queensland executive director Michael Roberts said in the past few years, construction and labour costs had meant it was taking \"significantly longer\" to get projects out of the ground.\n\nHe said there were also benefits for buyers when getting into an off-the-plan contract.\n\n\"There's definitely a speculative element too for purchasers buying off-the-plan,\" he said.\n\n\"They're buying something at today's price with a fairly high level of confidence that by the time the product is delivered it'll be worth substantially more.\"\n\nThe Housing Industry Association says construction costs have increased in the past few years. ( )\n\nWhy do sunset clauses exist?\n\nThey are intended to protect both buyer and seller, letting either cancel a contract if construction isn't completed and settled before a certain date.\n\nBut, in some cases, they can be misused –allegedly by developers who want to make a larger profit when property values increase.\n\nThat's come to the attention of policy makers.\n\nWhat are the laws like around the country?\n\nSome states have come under more pressure than others to tighten sunset clause laws, meaning the rules differ across jurisdictions.\n\nQueensland The Queensland government is reviewing its sunset clause legislation. ( ) The last significant reform to sunset clause legislation happened in 2023 under the former Labor government. Those changes — which only applied to contracts for the sale of land — meant developers could only invoke the sunset clause if they had either the written consent of the buyer or a Supreme Court order. A third situation \"prescribed by regulation\" was also set out. But earlier this year, the LNP government announced it would review sunset clause rules. Public consultation on that review closed on Friday, and the government has faced pressure to extend protections offered to land buyers to all property buyers, including apartment and unit purchasers. New South Wales NSW law sets out limited circumstances for using sunset clauses. ( ) Stricter rules on when sunset clauses can be used were introduced in 2015. They apply to all off-the-plan contracts, including apartments and units. Developers are required to obtain the written consent of every buyer or apply to the New South Wales Supreme Court before enacting the sunset clause. Since 2019, developers have also been required to provide buyers with mandatory disclosure documents. Victoria Victoria has strict sunset clause laws in place. ( ) Under amendments to the law passed in 2019, developers need written consent of the buyer or permission from the Supreme Court. The government said at the time the laws were intended to protect buyers, and in response to concerns about \"developers deliberately postponing the completion of construction work\". ACT The ACT reformed its laws in 2021. ( ) In 2021 the government introduced new laws modelled on those in both Victoria and New South Wales. Under their model, developers have to give buyers 28 days' notice in writing and buyers have to consent to the contract being terminated. If there's no agreement, the matter goes to the Supreme Court, where the developer bears the legal costs. A further review of the laws recommended further changes including a requirement for developers to withhold a percentage of the purchase price to deal with disputes or defects. South Australia The South Australian government is considering reform to its sunset clause laws. ( ) The government has considered strengthening its regulation around sunset clauses in off-the-plan contracts. Consultation closed in January this year and changes are being considered. Western Australia Sunset clauses can be used under Western Australian law by both buyers and sellers. ( ) Sunset clauses can be used under Western Australian law by both buyers and sellers. There's little additional regulation. Tasmania Tasmania has minimal regulation on sunset clauses. ( ) Tasmania has minimal regulation on sunset clauses. Northern Territory The NT has minimal regulation on sunset clauses. ( ) The Northern Territory currently has minimal regulation on sunset clauses. Buyers can cancel contracts if they aren't settled before a specified date without paying a penalty.\n\nWhat else can buyers do?\n\nIn any case, buyers are encouraged to seek independent legal advice.\n\nThat's because sometimes — even in jurisdictions with tight laws — there are extra provisions built into contracts which can allow developers to terminate them.\n\nQueensland's Office of Fair Trading recommends buyers seek \"specialist legal advice\" and urges them to beware of the risks associated with buying off-the-plan.\n\nThose risks include not being able to see the final result, unexpected delays in the building process, market price changes and \"contract clauses allowing it to be cancelled\".\n\nBuyers are also urged to maintain \"an open dialogue\" with the developer throughout the process.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-israel-preparing-for-hostage-release-as-trump-visits-middle-east-opposition-leader-s-approval-ratings-tank-new-polling-finds-20251013-p5n1xo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Treasurer announces major changes to super taxes; Israel preparing for hostage release as Trump visits Middle East",
    "publish_date": "Mon, 13 Oct 2025 13:02:09 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Treasurer Jim Chalmers calls a complete overhaul of his planned changes to superannuation tax concessions a “tweak”. Even Shane Warne would have struggled to spin a ball that far.\n\nIn the face of a big pushback to his plans to impose an additional 15 per cent tax on income generated on super funds with balances of more than $3 million, Chalmers has been forced into an embarrassing retreat.\n\nFirst announced in 2023, Chalmers was not only going to increase the tax paid by 0.5 per cent of people who also happened to be among the nation’s wealthiest and most well-off.\n\nHe was going to tax unrealised gains, effectively the lift in the paper value of assets before the owner was able to sell them, in what would be a huge departure from the way income in this nation is taxed.\n\nTreasurer Jim Chalmers announcing changes to the superannuation tax system at Parliament House. Credit: Alex Ellinghausen\n\nHe was also not going to index the $3 million threshold, effectively ensuring young people today would eventually get caught up in his planned tax net.\n\nBoth key elements are now gone. That’s not a tweak – that’s a wholescale renovation.\n\nHe is sticking his higher tax to real gains while the thresholds will be indexed. And to help cover the cost of his retreats, people with more than $10 million – about 8000 individuals – will actually face a 40 per cent tax rate on their holdings.\n\nThe treasurer is also tidying up an issue around the low-income superannuation tax offset and the way it interacts with the revamped stage 3 tax cuts, that would have hurt people earning less than $45,000.\n\nChalmers says the combination of his changes will mean that in 2028-29, instead of earning about $2.5 billion in extra revenue, the government will collect about $2 billion. Further out, by indexing the thresholds, the repair to the long-term budget bottom line is reduced, although he maintains it will still raise a “substantial” amount of cash.\n\nHow “substantial” that tweak is, only future taxpayers will find out.",
    "source": "SMH",
    "cluster_id": 6
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-wa-family-heartbroken-after-dog-stabbed-to-death-at-park-20251013-p5n1xg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: ‘We need more workers’: Cook wants WA exempt from skilled migration reduction",
    "publish_date": "Mon, 13 Oct 2025 12:52:51 +1100",
    "category": "finance",
    "authors": [],
    "text": "Premier Roger Cook has defended his request to Prime Minister Anthony Albanese for WA to be exempt from a reduction in the national skilled migrant intake, saying the state needed the workers to feed into its construction and defence sectors.\n\nWA’s allocation of skilled migrants under the state nominated migration program will drop from 5000 to 3400 places from next year as debate over the number of people entering the country heats up.\n\nWA Premier Roger Cook has written to the prime minister to request the state be exempt from a reduction in the national skilled migration intake. Credit: Matt Jelonek/Rio Tinto\n\nThe state nominated migration program allows each state to target certain occupations it needs, allowing easier to access visas for migrants that meet those skill requirements.\n\nCook wrote to Albanese earlier this month urging the Commonwealth to reverse the reduction in the program, arguing the state needed it to bring in more worker to meet the demands of the housing and construction sector.\n\nHe said WA had specific needs.\n\n“We need more workers. We need more skilled migrants coming to Western Australia, either from the East Coast or from overseas,” he said.\n\n“Western Australia’s economy is the strongest in the nation, and we join the federal government in our ambitions to host the largest shipbuilding and maintenance hub in the southern hemisphere.\n\n“So we need more workers, and that’s why we need the government to stand by us and continue to make sure that we’ve got a strong Skilled Migration Program.”\n\nCook was at North Metro TAFE in East Perth this morning announcing the new You Can Make It Here advertising campaign to drive people to enrol in low and no-fee TAFE courses.\n\nThe campaign will be accompanied by a rebranded TAFE WA website.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/politics/federal/chalmers-backs-down-on-super-indexing-in-bid-to-get-changes-through-parliament-20251013-p5n21t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chalmers backs down on super indexing, puts in higher tax rate for accounts with $10m",
    "publish_date": "Mon, 13 Oct 2025 12:48:58 +1100",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "Treasurer Jim Chalmers has backed down on plans to tax unrealised gains on superannuation and has introduced indexing for balances above $3 million – changes business and economists have been pushing for since before the May election.\n\nThe government will establish a 40 per cent tax rate for earnings on balances above $10 million, while earnings on balances above $3 million will still be taxed at 30 per cent.\n\nTreasurer Jim Chalmers. Credit: Alex Ellinghausen\n\nThe low-income super tax offset payment will also be raised from $500 to $810. Currently, those earning under $37,000 a year receive $500 from the government, directly deposited into their super account. From 2027, the threshold will be raised to an income of $45,000, and the deposit will be $810.\n\nThe announcement followed the news that Prime Minister Anthony Albanese had sought a briefing from Treasury on objections to the original super tax changes.",
    "source": "SMH",
    "cluster_id": 6
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/after-one-nrl-season-the-wallabies-re-sign-a-world-cup-hopeful-20251013-p5n1zq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After one NRL season, the Wallabies re-sign a World Cup hopeful",
    "publish_date": "Mon, 13 Oct 2025 12:48:19 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Carter Gordon has re-signed with Australian rugby after a stint in the NRL and will be fast-tracked back into the Wallabies, with the former Gold Coast Titan set to be included in the spring tour squad named on Monday afternoon.\n\nRugby Australia confirmed on Monday that Gordon had been signed on a three-year deal, which will see the eight-Test playmaker return to the Queensland Reds.\n\nAnd, in a clear sign Gordon has been recruited as a potential solution to the troublesome Wallabies No.10 slot for the 2027 World Cup, informed sources say the 24-year-old is set to be named by Joe Schmidt later today in the Wallabies’ squad for a five-Test tour of Japan, Britain and Europe, which starts next week.\n\nThis masthead revealed last week that the Titans, under new coach Josh Hannay, had granted Gordon permission to negotiate with Rugby Australia about an early release from his two-year NRL contract.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/scandalous-revelations-and-sudden-twists-await-in-this-gothic-thriller-20251005-p5n06m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "It’s a classic, but this lumbering brute of a ballet remains a hard work",
    "publish_date": "Mon, 13 Oct 2025 12:42:45 +1100",
    "category": "entertainment",
    "authors": [
      "Andrew Fuhrmann",
      "Jessica Nicholas"
    ],
    "text": "The secondary schemers are more fun. Maxim Zenin’s Lescaut is a lovable rogue – quick, witty and impish in attack. And Isobelle Dashwood is eye-catching as his mistress: tall and graceful but also funny, especially in the drunken duet with Zenin. Isobelle Dashwood is eye-catching as Lescaut’s mistress. Credit: Kate Longley It feels every bit of its more than 2½-hour length. There are group dances galore and variations, as well as many heavy touches of verismo. Is that child working in the brothel? Well, it’s all part of Manon’s operatic largeness. Conductor Charles Barker gets a ravishing sound from Orchestra Victoria. Those intimate but faintly menacing pieces such as the Nocturne from La Navarraise, used in the second act, are particularly effective – perhaps the most delicately human things in the whole ballet. Reviewed by Andrew Fuhrmann\n\nJAZZ\n\nChristopher Hale Ensemble ★★★★★\n\nThe JazzLab, October 12 For well over a decade now, Melbourne musician Christopher Hale has immersed himself in the study of traditional Korean drumming. Hale is not a drummer – he’s a bass guitarist – but he has found ways to adapt and incorporate these rhythmic traditions into his own playing and compositional practice. Musician Chris Hale Credit: Cesar Rodriguez Hale’s latest project is based on his own personal interpretation of hohŭp, a Korean rhythmic concept based on breath and body movement. But while his study of this elaborate system has academic leanings – he’s written an entire thesis on it – the compositions that have emerged from his study are far from abstruse. At JazzLab on Sunday, Hale spoke briefly about his interest in ritual music from Korea, but didn’t mention hohŭp or the related methodology he’d developed for his own music. Instead, he embodied it – quite literally. We may not have understood or even registered the rhythmic intricacy at play, but we could see and feel the pulsing undulations in Hale’s bass lines and torso. Drummer Simon Barker (also a master of Korean drumming) was equally expressive, resembling a languid cowboy leaning back in his saddle while his arms flew around the kit with explosive power and immaculate control.\n\nMeanwhile, saxophonist Jamie Oehlers and pianist Brett Williams fashioned clear melodic lines and beguiling harmonies to counter the music’s rhythmic complexity. Both could shift from introspective lyricism to muscular vigour with ease, enhancing the music’s emotional impact. Loading Several tunes moved through multiple moods, building from graceful solo or duo introductions to propulsive groove-based themes, dropping into hushed interludes or creating sweeping extended codas that became more soulful, more majestic and more impassioned with every repetition. With Oehlers based in Perth and Barker in Sydney, this is an ensemble that will require considerable commitment to keep together. But this project (like so many of Hale’s creative endeavours) is unique and compelling enough to be worth the effort. Reviewed by Jessica Nicholas\n\nDANCE\n\nDanceX Festival Week 1 ★★★★\n\nPlayhouse, until October 11 The DanceX Festival is a curious beast. The Australian Ballet – that bastion of a prestige art form – has built a festival for the whole sector. Everyone – or nearly everyone – has a place at the table. Seeing Through Darkness. Credit: Matt Byrne And yet, it doesn’t feel like a festival. There’s not a lot of buzz and the Playhouse was far from full at Wednesday’s opening. The timing doesn’t help because DanceX is wedged between the Australian Ballet seasons of Prism and Manon. So it doesn’t have much oxygen. It also overlaps with the Melbourne Fringe Festival, with its own diverse program of dance offerings.\n\nAudiences should come anyway. There’s a generous selection of shorter works. The standard is very high – these are works that have toured repeatedly – and the contrasts are instructive. It amounts to a welcome digest of where Australian dance is now. A notable international guest, the Royal New Zealand Ballet, offers an excerpt from Te Ao Marama, created for the company’s 70th anniversary by Moss Te Ururangi Patterson. It’s an intriguing experiment in which the haka form is combined with more lyrical material. An excerpt from Te Ao Marama is presented as part of of the first week of DanceX. Credit: Stephen A’Court Restless Dance Theatre’s Seeing Through Darkness is welcome programming. The company’s inclusive ensemble is accompanied by live violin and cello. It’s the most polished work I’ve seen from them, but it still left me wishing the company would take a few more risks. Balanchine’s Allegro Brillante is performed by artists from the Australian Ballet and the Australian Ballet School. Charming, yes, and a bit schmaltzy. It’s performed with speed and some feel for the music; nonetheless, it looks a little stale on these dancers.\n\nThe standout piece is Lucy Guerin’s Ground Control. If Samara Merrick is plausible but not dazzling in Allegro, here she is a galvanic phenomenon: focused, precise and attractively strange. She proves an ideal interpreter of Guerin’s art of the uncanny. The four dancers first work themselves into the floor, sinking their feet as the arms flicker. Then there’s shift when Merrick puts on her pointe shoes. Now we see structures melt away as she wafts into the darkness. Lucy Guerin’s Ground Control is a highlight. Credit: Kate Longley The evening closes with an excerpt from Dancenorth’s Wayfinder – that effervescent rainbow fantasy from Townsville. Honestly, every evening of dance should finish with something from Wayfinder: it’s the surest way to send the audience off with a smile.\n\nReviewed by Andrew Fuhrmann THEATRE\n\nRebecca ★★★★\n\nMelbourne Theatre Company, Sumner Theatre, until November 5 Rebecca is the second gothic fiction from Daphne du Maurier to be adapted for Melbourne’s main stage this year, after The Birds at the Malthouse in May. Both were popular bestsellers made into Hitchcock films, so it’s fair to ask: what can theatre bring to their retelling that film can’t?\n\nIn Matthew Lutton’s no-frills adaptation of The Birds, the intimacy of sound predominated. Paula Arundell’s almost conspiratorial storytelling coaxed audiences into the claustrophobic monodrama; audio tech immersed us in the horror of unexplained avian attacks individually, creating a private, and deeply unnerving, soundscape for each spectator. Nikki Shiels in a scene from Rebecca Credit: Pia Johnson Anne-Louise Sarks’ Rebecca has frills. This is commercial theatre with elegant production values, poised and atmospheric design, a formidable cast, and a script that allows the seeds of this iconic romantic thriller to bloom into morbid flower. An unnamed young woman (Nikki Shiels) meets grieving aristocrat Maxim de Winter (Stephen Phillips) by chance in Monte Carlo. A whirlwind romance leads to marriage, and she moves with him to Manderley – a stately manor home by the sea in Cornwall – where she quickly falls under the shadow of Maxim’s recently deceased first wife, Rebecca. As the severe housekeeper Mrs Danvers (Pamela Rabe) begins to manipulate the new lady of the house, Maxim becomes remote and emotionally withdrawn. All roads point to Rebecca as the cause. Is Maxim still in love with her? How could anyone ever live up to Rebecca’s reputation for feminine perfection? And how, exactly, did Rebecca die?\n\nScandalous revelations and sudden twists await as she probes the secrets her haunted husband is hiding from her. Design elements fuse into a triumph of Gothic sensibility: the brooding insistence of the sound design (Grace Ferguson and Joe Paradise Lui); Paul Jackson’s nimbus-smeared lighting; Marg Horwell’s astute eye for period fashion; and the visual precision behind each scene change, every mist and mirror. Pamela Rabe as Mrs Danvers is ideal casting. Credit: Pia Johnson Shiels inhabits the insecurities of the heroine, her vulnerability, and her descent into domestic horror with compelling presence. There’s a jolting character transformation that might be more credible had it been achieved in a more graduated way, but the romance opposite Phillips holds your attention, and I particularly enjoyed Shiels going toe-to-toe with Rabe. Long before her award-winning role in Wentworth, I’ve wanted to see Rabe as Mrs Danvers. It’s ideal casting, and Rabe’s husky apparition turns into a creature of flesh and blood as it builds a sapphic subtext (disallowed by censors in the Hitchcock movie) to the character’s deranged obsession. The fetishisation of the feminine, and the power play between the two women, has a transfixing, performative quality that reminded me a little of the murderous sisters in Jean Genet’s The Maids.\n\nLoading And it’s Mrs Danvers, interestingly, who gives the staunchest rallying cry regarding social freedom for women. Sarks appears to deny no perspective on the sources of psychological horror in Rebecca, tantalising us with possibilities. It’s thought-provoking, even if they don’t all coalesce into effective drama. Newcomers to Rebecca might strain, too, to make sense of plot twists hastily telegraphed toward the end. It’s a bumpy climax after such a smooth ride to get there, though a small flaw in an otherwise slick, solidly crafted entertainment.\n\nReviewed by Cameron Woodhead MUSIC\n\nTrio Isimsiz ★★★★\n\nMusica Viva Australia, Melbourne Recital Centre, October 7 Blending youthful verve and bonhomie with seasoned intuition, Trio Isimsiz (Turkish for “trio without a name”) made this concert deeply pleasurable. Bookended by two great masterpieces (Brahms’ Piano Trio in C minor, Op. 101 and Schubert’s Piano Trio No. 1 in B-flat major, D. 898), the program centred on the Melbourne premiere of a new trio by contemporary Spanish composer Francisco Coll.\n\nBrahms’ third and final essay in the piano trio form is highly compact; its four movements last just over 20 minutes. From the start, the trio fanned the music’s smouldering embers of passion into flame, confirming a solid collective commitment to their endeavours. Beautifully hushed playing in the inner movements caught the ear, along with some wonderfully resonant pizzicato before the fiery finale. Commissioned for Trio Isimsiz, Coll describes his 2020 Piano Trio as kaleidoscopic. Moving from textural fragmentation to cohesion and back to fragmentation across its four movements constitutes a form of musical cubism. While an engaging and highly imaginative work, with allusions to Richard Strauss and flamenco, there is perhaps too much reliance on the piano to glue the texture together, apart from one spotlit moment for cello. Nevertheless, the dedicatees convincingly rose to the work’s considerable technical and expressive challenges. Trio Isimiz. Credit: Verena Chen Schubert’s evergreen trio sent the audience out on a high. After revelling in the buoyant optimism of the opening, the players revealed the poignant slow movement as the beating heart of the work, inhaling tenderness and exhaling a gentle melancholy. Deft, delicate touches in the scherzo led to a final rondo full of playful energy. Pianist Erdem Misirlioglu, an astute chamber musician with technique to burn, violinist Pablo Hernan Benedi with his sweet, well-projected tone and cellist Edvard Pogossian’s musical handling of his gloriously rich-sounding instrument have certainly made a name for this “nameless” trio.\n\nReviewed by Tony Way\n\nMUSIC\n\nThe Tallis Scholars ★★★★★\n\nMelbourne Recital Centre, October 5 and 6 Melbourne turned on a rock star welcome for The Tallis Scholars, who, over half a century, have come to epitomise the classic English choral sound. Possibly because of the Elisabeth Murdoch Hall’s warm acoustics, the city is the only stop on this Australian tour, favoured with two concerts by the revered ensemble. The Tallis Scholars. Credit: Hugo Glendinning Such bounty enabled capacity audiences to savour the group’s stylistic versatility with music from 12th-century abbess and mystic Hildegard von Bingen, through to contemporary American composer Nico Muhly. While some fans may have considered the absence of English music from the Tudor period conspicuous, there was much other fine music from the 15th and 16th centuries to enjoy.\n\nEmma Walshe expertly spun out the glorious high Cs in Gregorio Allegri’s crowd-pleasing Miserere, supported by the group’s customary razor-sharp intonation and limpid diction. Another Tallis Scholars speciality, Tomas Luis de Victoria’s six-part Requiem of 1605, also plumbed great emotional depths. Director Peter Phillips unleashed plenty of Latin fervour in an evocative reading that cut to the heart of this powerful pondering of life and death. Loading Classics such as Clemens non Papa’s Ego flos campi and Josquin’s Praeter rerum seriem rubbed shoulders with lesser-known gems, including Crecquillon’s Andreas Christi famulus, Obrecht’s Salve Regina and an eight-part Credo by Gombert. A sprightly Deus in adiutorium by Spanish Mexican priest Juan de Padilla added further delight. Sung by an angelic quartet of female voices, four short chants by Hildegard provided interludes in the second program. By contrast, works by living composers included Muhly’s 2023 commission A Glorious Creature, full of engaging brightness, while the quiet intensity of Arvo Part’s Triodion and Da pacem Domine were set against the insightful strength of his Magnificat.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/lifestyle/australias-oldest-dad-reveales-he-wants-another-kid-20251013-p5n22l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia's oldest dad reveales he wants another kid",
    "publish_date": "Mon, 13 Oct 2025 12:24:16 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Australia's oldest dad reveales he wants another kid\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/culture/theatre/help-country-how-a-tiny-endangered-possum-inspired-this-new-children-s-show-20251012-p5n1u9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s tricky’: Why this jazz legend compares his art to table tennis",
    "publish_date": "Mon, 13 Oct 2025 12:23:43 +1100",
    "category": "entertainment",
    "authors": [
      "Lenny Ann Low",
      "John Shand"
    ],
    "text": "The song You Only Live Twice (from the James Bond film of the same name) would have more kitsch quotient than improvising potential to most ears. Not Bill Frisell.\n\nThe one constant in the work of the jazz guitarist – a peer of John McLaughlin, Pat Metheny and John Scofield – has been eclecticism, reflecting both his diverse childhood tastes and ever-expanding horizons as a player and composer.\n\nBill Frisell maintains a connection to a child-like sense of wonder. Credit: Carole D’Inverno\n\n“Part of it is just being more open to whatever it is that I’ve heard at any moment in my life,” he says via Zoom. “When I was younger, I was much more worried about what people would think was cool or fashionable or whatever, and as I’ve gotten older, I couldn’t care less about that. It’s more about what touches me, and just putting it out there.”\n\nNot only can Frisell still harness the remembered impact of the Bond film on his young self, he also appreciates the song’s inherent craft. “The closer you look at some of these things,” he observes, “the deeper it gets. Because it was popular doesn’t mean it was bad.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/queensland/lost-and-luxe-11k-bvlgari-necklace-black-box-and-plane-seats-in-brisbane-airport-auction-20251013-p5n219.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lost and luxe: $11k Bvlgari necklace, black box and plane seats in Brisbane Airport auction",
    "publish_date": "Mon, 13 Oct 2025 12:10:00 +1100",
    "category": "finance",
    "authors": [
      "Marissa Calligeros"
    ],
    "text": "Laptops, phones, speakers, cameras, gaming consoles and sunglasses are among the most common items left behind in airports.\n\nNot so common is a Bvlgari 18k gold diamond necklace valued at $11,000.\n\nThe star item at this year’s Brisbane Airport auction: a Bvlgari 18k gold diamond necklace valued at $11,000. Credit: Brisbane Airport\n\nYet, the rare necklace and more than 800 other items are now up for grabs at Brisbane Airport’s lost property auction.\n\nBrisbane Airport holds an auction of lost items once a year, with the proceeds going to children’s charities in Queensland.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/is-the-taco-trade-still-alive-after-trump-s-latest-tariff-tirade-20251013-p5n1yy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "As tensions rise, is the TACO trade still alive?",
    "publish_date": "Mon, 13 Oct 2025 12:01:26 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Perhaps of more significance than the detail of either side’s complaints of the other’s recent actions, however, is a looming meeting of Trump and China’s Xi Jinping in South Korea later this month. That meeting, at the Asia Pacific Economic Cooperation summit, is planned for November 1. It is instructive that Trump’s threatened tariff increase – on top of the existing effective rate of close to 40 per cent – wouldn’t occur until November 1, which is the scheduled finishing date for the summit. The core of Beijing’s barrage of new trade restrictions also wouldn’t be implemented until after the summit. ‘Don’t worry about China, it will all be fine! Highly respected President Xi just had a bad moment.’ Donald Trump on Truth Social That could suggest that China is seeking leverage for those discussions, deploying its most powerful trade weapon -- its stranglehold on the critical rare earths sector -- to demonstrate that Xi will be negotiating from a position of strength, rather than one of vulnerability.\n\nIt was China’s imposition of restrictions on rare earths and rare earth magnets to the US earlier this year that caused the Trump administration to walk back their 145 per cent tariff rate on imports from China in April (which China had responded to with a 125 per cent tariff of its own) at the Geneva negotiations. Within days of those restrictions being imposed, US auto companies were shutting down plants. Loading Rare earths and magnets are vital to many industries, most notably defence manufacturers, aircraft manufacturers, chipmakers and auto companies. With China supplying about 70 per cent of the world’s rare earths mining, about 90 per cent of their separation and processing, more than 90 per cent of magnet manufacturing and about 80 per cent of the world’s battery cell production, it has an extraordinary powerful hand to play in response to Trump’s tariffs.\n\nTrump announced, on social media as usual, his response to China’s actions, after writing that “some very strange things are happening in China! They are becoming very hostile.” Interestingly, though, his response was surprisingly temperate. Asked later what would happen if China unwound the new export controls, he said: “We’re going to have to see what happens. That’s why I made it November 1 (after the scheduled meeting).” Trump, who said he would go to South Korea regardless of what China did, also posted another comment that lacked his usual aggression and, indeed, was placatory. “Don’t worry about China, it will all be fine! Highly respected President Xi just had a bad moment. He doesn’t want Depression for his country, and neither do I. The USA wants to help China, not hurt it!!!.” When Trump announced his “Liberation Day” tariffs on everyone in April, financial markets revolted and Trump was coerced into deferring their introduction. It took until August before they were in place.\n\nInvestors saw that as an example of the “TACO” trade (short for Trump Always Chickens Out). On Friday, they revolted again, with the US sharemarket down 2.7 per cent (the tech-heavy Nasdaq market was down 3.6 per cent) and shares in tech leaders like Nvidia and AMD hammered. Nvidia was down 5 per cent and AMD 8 per cent. Loading Oil prices fell heavily, the US dollar weakened, US bond yields tumbled and the cryptocurrency market tumbled 11.6 per cent – initially wiping out nearly $US500 billion of value – before recovering some of those losses over the weekend. Bitcoin tumbled about 9.5 per cent before recovering nearly half its losses. While Trump thinks China’s economy is vulnerable to US trade sanctions, as it is, China’s exports have held up surprisingly well despite a big slump in exports to America, which were down about 15 per cent in the first eight months of this year. Overall, its exports were up 5.9 per cent, as it exported more to South-East Asia, South America and to Europe.\n\nBeijing also has the ability, which it has so far not exploited, to boost domestic economic activity. Conversely, China knows that the Trump economy is faltering under the weight of the tariffs, with America’s inflation rate rising in tandem with higher unemployment. The US government has been shut down, Trump has threatened (more) mass sackings of government employees and some of the administration’s most high-profile policies are increasingly unpopular. Unlike Xi, Trump has to worry about politics, with next year’s midterm elections creating the prospect that the Democrats could seize control of the House. Trump can threaten higher tariffs (and China can respond with higher tariffs of its own), or more bans on exports of things like semiconductors or aircraft parts, but Xi is insulated from their impacts on his economy.\n\nTrump doesn’t (yet?) have the ability to ignore the repercussions of his policies for Americans or the US economy. The reactions of US financial markets are also far more significant for Trump than anything China’s markets might do for Xi. Loading That’s probably why US markets’ response this week could be important. If they bounce back, it will be because investors believe the TACO trade is alive. If they were to continue to slump, the pressure on Trump to revive that trade would mount. In the lead-up to the first face-to-face meeting of Trump and Xi in six years, both sides were manoeuvring for leverage. Trump was (misleadingly) boasting of the strength of the US economy, the power of his tariffs and America’s ability to harm China’s economy.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/300km-h-in-near-darkness-bathurst-1000-drivers-detail-scary-final-stages-20251013-p5n1xz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "300km/h in near darkness: Bathurst 1000 drivers detail ‘scary’ final stages",
    "publish_date": "Mon, 13 Oct 2025 11:59:06 +1100",
    "category": "sports",
    "authors": [
      "Robert Dillon"
    ],
    "text": "New Zealand young gun Matt Payne has set his sights on the Supercars championship after winning what has been described as the greatest Bathurst 1000 of all time on Sunday.\n\nPayne and veteran co-driver Garth Tander prevailed in an epic finish on a day of carnage, after persistent rain transformed the Mt Panorama circuit into an ice rink mid-race.\n\nAfter almost seven hours of racing, four seconds separated the first three placegetters. Six of the 27 starters were unable to finish, either crashing out or suffering mechanical failure.\n\nPayne emerged with his first Peter Brock Trophy, while for Tander it was a sixth victory at the Australian motorsport mecca. Both agreed it was a wild ride but were thrilled to win a race that will be remembered for decades.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/property/news/melbourne-family-splash-millions-for-harry-triguboff-s-holiday-high-rise-20251013-p5n1yb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Melbourne family splash millions for Harry Triguboff’s holiday high-rise",
    "publish_date": "Mon, 13 Oct 2025 11:56:50 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Melbourne family has splashed $11 million on the two-level Main Beach penthouse of Australia’s second-richest man – outmuscling two local bidders and paying well above reserve in a fast and furious auction on Saturday.\n\nPerched atop the iconic Silverton building at 51/3510 Main Beach Parade, the 918-square-metre apartment is among the largest on the Gold Coast.\n\nThe penthouse boasts one of Queensland’s largest private rooftop pools, three en suite bedrooms, wraparound balconies and a private lift.\n\nIt has long been the Gold Coast base of Harry “High-Rise” Triguboff – who paid just $2.6 million for it 35 years ago.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/brisbane-airports-annual-lost-property-auction-20251013-p5n21y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane Airport's annual lost property auction",
    "publish_date": "Mon, 13 Oct 2025 11:55:31 +1100",
    "category": "finance",
    "authors": [],
    "text": "Brisbane Airport's annual lost property auction\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/goodfood/nsw-good-food-guide/good-food-guide-2026-sydney-s-top-10-bars-20251007-p5n0rw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Good Food Guide 2026: Sydney’s top 10 bars",
    "publish_date": "Mon, 13 Oct 2025 11:54:11 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Collection\n\nGood Food Guide 2026: Sydney’s top 10 bars\n\nOur annual list of the best spots for a night out with cocktails, from deathly cold martinis to Ice Magic Old Fashioneds.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/national/hawthorn-man-takes-law-into-his-own-hands-after-break-in-20251013-p5n1z3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hawthorn man takes law into his own hands after break in",
    "publish_date": "Mon, 13 Oct 2025 11:54:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "Hawthorn man takes law into his own hands after break in\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/palestinians-return-to-gaza-as-ceasefire-holds-and-israel-prepares-for-returning-hostages/umghw6ry5",
    "title": "Palestinians return to Gaza as ceasefire holds, and Israel prepares for returning hostages",
    "publish_date": "Mon, 13 Oct 2025 00:58:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe ceasefire in Gaza has held for a third day, allowing hundreds of thousands of exhausted Palestinians to make the long journey back north to Gaza City.\n\n\n\n\n\nReturning to what's left of their homes, people in Gaza say the scale of Israel's destruction is even worse than imagined.\n\n\n\n\n\nAccompanied by the familiar sound of drones overhead, Ismail al-Jamal returned to his home in the Sheikh Radwan neighbourhood of Gaza City.\n\n\n\n\n\nRelieved initially by the ceasefire, he now says he feels like he's walked into yet another crisis.\n\n\n\n\n\n\"We didn't expect it to be to this degree, I mean not one home in the whole street is standing, or is even hollowed out (from the damage but standing). They are all levelled to the ground, it is all destruction. I mean I am one of the people who could not get a shirt out of the house. It is destruction that is indescribable, honestly.\"\n\n\n\n\n\nWith aid now able to enter Gaza, reporters on the ground say they've seen over 200 aid trucks unload at the Kerem Shalom crossing.\n\n\n\n\n\nThe director of al-Shifa hospital in northern Gaza City, Dr Muhammad Abu Salmiya, told Al Jazeera medical facilities have not yet received desperately-needed supplies.\n\n\n\n\n\nUnited Nations Humanitarian Chief Tom Fletcher says the next few days will be critical.\n\n\n\n\n\n\"There are so many things that could go wrong in the coming days and weeks, but all of us working on this want to get hostages home, and we want to get masses and masses of aid, a massive influx of aid, into Gaza to save as many lives as possible.\"\n\n\n\n\n\nUnder the ceasefire agreement, Hamas is due to release the remaining Israeli hostages in the coming hours.\n\n\n\n\n\nIsraeli officials say not all deceased hostages are expected to be returned on Monday, adding that an 'international body' will be established to locate the remains of those not returned.\n\n\n\n\n\nHowever, it's expected that all 20 living Israeli hostages will be released together.\n\n\n\n\n\nAlana Zeitchik is the relative of living Israeli hostage David Cunio.\n\n\n\n\n\n\"Really excited. Like I haven't smiled like this in, I mean probably over two years at this point. And I'm also a little nervous, of course. I'm sort of bracing for what will come with it. How he will look, what condition he will be in, we don't really know. So I'm sort of, you know, bracing for that while still remaining really optimistic and hopeful and excited and I can't wait to see him reunited with my cousin and with their children.\"\n\n\n\n\n\nUnder US President Donald Trump's proposed plan, once Hamas has handed over the hostages, Israel will begin releasing around 2,000 Palestinian detainees in exchange.\n\n\n\n\n\nAround 1,700 of the Palestinians being released by Israel were captured by Israeli forces in the last two years but have not been charged with any crime.\n\n\n\n\n\nFollowing the exchange, President Trump is expected to address the Israeli Knesset before heading to Egypt where he will co-host a Gaza peace summit with his Egyptian counterpart, President Abdel Fattah al-Sisi.\n\n\n\n\n\nBoarding Air Force One, Mr Trump said this deal has made everyone happy.\n\n\n\n\n\n\"Everybody is cheering at one time. That's never happened before. Usually if you have one cheering, the other isn't. The other is the opposite. This is the first time everybody is amazed and they're thrilled, and it's an honour to be involved. And we're going to have an amazing time, and it’s going to be something that's never happened before.\"\n\n\n\n\n\nIn Tel Aviv, hundreds gathered to fly both US and Israeli flags, cheering in hopeful anticipation of the hostage release.\n\n\n\n\n\nAhead of the return, hospitals have prepared long-term rehabilitation capsules.\n\n\n\n\n\nProfessor Noa Eliakim-Riz is the head of returning hostages unit at Rabin Medical Centre.\n\n\n\n\n\n\"Every returnee has a capsule of caregivers, a doctor, a nurse, a psychosocial worker, a dietician, and they all take care of one returnee and that's the same team that will follow him in the rehabilitation, also. So continuation of care is something very important here.\"\n\n\n\n\n\nFor Palestinians in Gaza and abroad however, the news of a ceasefire is bittersweet.\n\n\n\n\n\nWith the UN Satellite Centre estimating at least 83 per cent of buildings in Gaza are destroyed or damaged, and dozens of bodies already discovered under the rubble in recent days, fears linger about the extent of damage and death in Gaza.\n\n\n\n\n\nIn the US, Palestinian American Mohammad Enayah says the guilt of surviving will stay with him.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/donald-trump-softens-tone-as-china-us-trade-tensions-flare/3mxy3fa5w",
    "title": "Donald Trump softens tone on China after tariff tensions flare",
    "publish_date": "Sun, 12 Oct 2025 20:59:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "After a bout of trade tensions between the United States and China escalated in recent days, US President Donald Trump has unexpectedly adopted a more conciliatory tone.\n\n\n\n\n\nIn a post on the Truth Social platform, Trump wrote: \"Don't worry about China, it will all be fine! Highly respected President Xi [Jinping] just had a bad moment. He doesn't want Depression for his country, and neither do I. The U.S.A. wants to help China, not hurt it!!!\"\n\n\n\n\n\nTrump on Friday said he would impose an additional 100 per cent tariff on Chinese goods from 1 November in response to what he called \"extraordinarily aggressive\" new export curbs on China's rare-earth industry.\n\n\n\n\n\nHe had also questioned whether his planned meeting with Chinese President Xi Jinping in South Korea would take place, citing the ongoing trade conflict.\n\n\n\nWhy is Trump softening his approach?\n\nIt remains unclear what prompted Trump to take this softer approach.\n\n\n\nREAD MORE Trump hikes tariffs on China by extra 100 per cent, threatens to cancel talks with Xi Jinping\n\nTrump may have had an eye toward to US financial markets on the eve of the new business week.\n\n\n\n\n\nThe US stock market will be open on Monday local time, although bond markets will close for the Columbus Day holiday.\n\n\n\n\n\nOn Friday, the broad S&P 500 stock market index plunged 2.7 per cent, its worst day in about six months after Trump's tariff threat.\n\n\n\nChina accuses Trump of 'double standards'\n\nTrump defended his earlier moves by saying China had sent \"letters to countries all over the world\" announcing export restrictions on rare earths and other materials.\n\n\n\n\n\nHe described the move as sudden, warning it could paralyse global trade and harm many countries.\n\n\n\n\n\nChina, in turn, accused the US of acting unfairly, with its commerce ministry calling Trump's tariff threat a \"typical example of 'double standards'\".\n\n\n\nREAD MORE Trump overcomes 'resistance' from China to transfer TikTok to US investors\n\nThe ministry said the US had ratcheted up economic measures against China since September.\n\n\n\n\n\n\"Threatening high tariffs at every turn is not the right approach to engaging with China,\" it said in an online statement.\n\n\n\n\n\nChinese goods face US tariffs of 30 per cent under the levies Trump imposed while accusing China of aiding in the fentanyl trade as well as unfair trade practices.\n\n\n\n\n\nChina's retaliatory tariffs are currently at 10 per cent.\n\n\n\nWhy are rare earths the focal point in China-US trade war?\n\nRare earths have been a major sticking point in recent trade negotiations between the two superpowers.\n\n\n\n\n\nThey are critical to manufacturing everything from smartphones and electric vehicles to military hardware and renewable energy technology.\n\n\n\n\n\nChina produces over 90 per cent of the world's processed rare earths and rare earth magnets.\n\n\n\n\n\nThe 17 rare earths are vital materials in products ranging from electric vehicles to aircraft engines and military radars.\n\n\n\nExports of 12 of them are restricted after China's commerce ministry on Thursday added five — holmium, erbium, thulium, europium and ytterbium — along with related materials.\n\n\n\n\n\nThe commerce ministry statement sought to reassure foreign companies spooked by the latest export curbs, promising to promote compliant trade by granting general-purpose licenses and license exemptions.\n\n\n\n\n\n\"China's export controls are not export bans,\" it said. \"Any export applications for civilian use that comply with regulations will be approved, and relevant enterprises need not worry.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-miscarriage-data-gap-and-invisible-loss-leaving-australian-women-behind/y56quko28",
    "title": "The miscarriage data gap and 'invisible loss' leaving Australian women behind",
    "publish_date": "Sun, 12 Oct 2025 19:42:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSarah Peters experienced a miscarriage in February 2024.\n\n\n\n\n\nShe found out at 11 weeks that the baby, hoped to be a late Christmas present for Sarah and her husband, had no heartbeat and had stopped growing.\n\n\n\n\n\nThe 27 year-old received the news at a routine check-up before receiving confirmation at her local Sydney hospital.\n\n\n\n\n\n“I definitely feel as though the news could have been approached much differently. I believe I was given more of a clinical way of having received that information. They were using medical terms, they weren't really... it didn't feel very nurturing or caring.”\n\n\n\n\n\nDespite receiving care at a private Sydney hospital and experiencing complications in a surgery to remove her foetus, Sarah says she wasn't directed to any support services.\n\n\n\n\n\nAs a First Nations woman, Sarah says she also wasn't directed to any Aboriginal health workers or community.\n\n\n\n\n\nIt wasn't until she had her son this year, that Sarah was connected with an Aboriginal community health nurse, who directed her to mental health support.\n\n\n\n\n\n“I actually never received any follow-up from the hospital. I was never offered any guidance in terms of who I could turn to. The only reason that I was able to reach out to whoever I did in this instance, the pink elephants, was because of my boss at work who had gone through a similar situation a couple years before me. I was never guided in any sort of First Nations practice or connected with any of my community. I wasn't directed in any sort of way in relation to First Nations matters, especially relating to grief. It was quite hard. Again, I felt really alone.”\n\n\n\n\n\nSarah's not alone in her experience - in fact according to the Royal Australian New Zealand College of Obstetricians and Gynaecologists, or RANZCOG, around 1 in 4 pregnancies result in miscarriage.\n\n\n\n\n\nBut a new report by miscarriage support organisation Pink Elephants highlights ongoing gaps in national data on miscarriage.\n\n\n\n\n\nIt also found that 75% of women report feeling unsupported following a miscarriage.\n\n\n\n\n\nThere are discrepancies in identifying overall how many women experience miscarriage, with women's health organisation Jean Hailes suggesting the figure could actually be as high as 37%.\n\n\n\n\n\nPink Elephants' Chief Executive Samantha Payne says a lack of data leads to gaps in quality care.\n\n\n\n\n\n“We know that for too long our miscarriages have not been seen because they are not counted anywhere nationally, that it's a fragmented health system, and because miscarriage can be managed by a GP which comes under a public health network and national support, or it can be managed by a hospital which comes under state and local health districts and state governments. And then there has been no overarching collection of the data, of the number of losses, the type of early pregnancy losses - because there are different types - the call, the intersectionality data, the geographic locations. And when we don't measure, we don't count, we don't resource and we don't support.”\n\n\n\n\n\nThis is particularly acute for women in regional and rural parts of Australia.\n\n\n\n\n\nKatrina Ward, or Treen, is a Ngiyampaa woman and Chief operations manager for the Brewarrina and Walgett Aboriginal Medical Services in Far Northwest New South Wales.\n\n\n\n\n\nShe says there simply aren't enough health workers to provide a continuity of care for women in regional Australia.\n\n\n\n\n\n“We have drive in, drive out services, fly in, fly out for the allied health. Even our midwife who comes across from Burke, it's a hundred kilometers away. She comes over every two or three weeks. So a lot, all that education and awareness coming into pregnancy, it's all lost. So then people aren't aware of what to expect and then they've also reliant on family members and other significant people in their life to help them through that process.”\n\n\n\n\n\nTreen says women in regional areas are forced to travel hours to their nearest hospital where they're treated as a number, and often discharged prematurely due to a lack of staffing.\n\n\n\n\n\nMedical practices around pregnancy loss can trigger intergenerational trauma connected to the Stolen Generations, as Treen describes, with many First Nations women reporting experiences of racism at hospitals.\n\n\n\n\n\nShe says the government needs to invest in rural and regional health services if they want to close the gap by 2030.\n\n\n\n\n\n“Yeah government's starting to change attitude slightly, but it's a long-term process. And until they're very committed to investing into rural and remote health. At the end of the day these are people's lives. This is their wellbeing. And if you're going to represent the communities within government, we'll do it. Fair income, we're all individuals. We all deserve equality. It doesn't matter where we live. We all deserve the choice to have a good life. So start investing into the people who are the grassroots of Australia, and that's our First Nations people.”\n\n\n\n\n\nMs Payne says her organisation and other stakeholders have been working with the government to address a data gap, following their $1 million investment in the Australian Institute of Health and Welfare to improve data on miscarriage in May last year.\n\n\n\n\n\nThis was part of the government's $9.5 million funding package towards miscarriage support, which also included investment in bereavement support services, education and awareness, and an audit of Early Pregnancy Assessment Service clinics.\n\n\n\n\n\nMs Payne hopes to see a national database by mid next year.\n\n\n\n\n\n“So commissioned by the Albanese government, the Australian Institute of Health and Welfare have actually just published their first review of the sexual and reproductive health framework, which is inclusive of a national pregnancy loss register. And Pink Elephants wholeheartedly supports this initiative. So that will be data that's entered by health professionals.”\n\n\n\n\n\nThe Assistant Minister for Women Rebecca White told SBS that the Australian Institute of Health and Welfare has been funded to undertake a miscarriage data scoping study to establish existing and potential data sources and options for national collection of miscarriage data, with public consultation open till November 2.\n\n\n\n\n\nThe Minister added that where possible the AIHW publishes data disaggregated for First Nations, and culturally and linguistically diverse people, and by geographic areas, and will be further considered during the development of the dataset.\n\n\n\n\n\nBut the government has not committed to including miscarriage or early pregnancy loss in the census.\n\n\n\n\n\nMs Payne says the Australian Bureau of Statistics rejected Pink Elephants' request in September 2023 for this data to be included in the 2026 census.\n\n\n\n\n\n“The gap still for us is the census because there is so much validation in being able to acknowledge your own baby as part of your family within the census. And when we don't give women that option, we're basically saying that your baby doesn't matter. Your loss wasn't real and that's not okay.”\n\n\n\n\n\nA spokesperson for the Australian Bureau of Statistics told SBS that during the topic review process for the 2026 Census, the topic of 'pregnancy loss' did not progress.\n\n\n\n\n\nThe statement said that while the area was initially considered, it did not meet the criteria to progress as it was deemed the data need is partially met by alternative data sources, such as the Australian Longitudinal Study on Women's Health.\n\n\n\n\n\nSarah says she would also like to see miscarriage documented in the Census, as there is currently nothing to recognise the loss with the exception of a commemorative certificate.\n\n\n\n\n\nShe would also like to see a specialised bereavement liaison attached to hospitals to connect women with the appropriate services.\n\n\n\n\n\n“I would just like to see there be an offer for that first Nations bereavement process, the way that it's sort of ignored at the moment or just forgotten about. I think it's quite important to definitely nurture women during that really vulnerable time, but also to nurture their culture as well. I think you can't have one without the other. You definitely need to nurture their culture but also nurture their mental wellbeing.”\n\n\n\n\n\nDr Nisha Khot is president of the Royal Australian New Zealand College of Obstetricians, and contributed as an expert to the Pink Elephants report.\n\n\n\n\n\nShe believes national data is also important for informing prevention of miscarriages.\n\n\n\n\n\n“Miscarriage has traditionally been one of those conditions that hasn't had as much attention paid to it. And also for many years there has been this kind of narrative that miscarriage is something we can't prevent. We can't do anything about it. So is there any point in capturing the data perhaps? But now we know that there are things that we can do and that there are certain conditions that we should look into to prevent miscarriages. And so that is also driving this need to capture the data so we can actually do something about it.”\n\n\n\n\n\nShe supports the report's recommendations, but notes that midwifery continuity of care could be expanded to include a more holistic range of health workers best suited to the individual.\n\n\n\n\n\n“It's important to recognise that actually if somebody who is having a miscarriage needs to have, for example, a surgical procedure, then they do need to have a medical person involved in their care. And so having continuity of care, which is team-based, where there are midwives as well as doctors, providing that continuity within the team makes a lot of sense because ultimately women who need, for example, testing if they're having recurrent miscarriages, women who need surgical procedures that will need a medical person. So it makes sense to have a team continuity.”\n\n\n\n\n\nAlongside prevention, Treen explains how comprehensive data is required to resource regional areas and upskill Aboriginal health workers.\n\n\n\n\n\n“Often when people are away, they're faced with racism as well. You're already tarred with a negative brush and that plays into it. So that's more likely for people to remain silent. But I just feel if we've got someone who they feel, if we can build those relationships early and whether it's Aboriginal health workers or just someone with compassionate and they're able to go through the whole journey with them, then they've got someone they can turn to and then we can rely more on allied health services. But then if we can try and upskill our people on the ground as well, to be able to just have those yarns with people and feel comfortable in talking to 'em about it and then identifying who might be the best appropriate service, what that person could access some more support.”\n\n\n\n\n\nSarah wishes she had experienced continuity of care.\n\n\n\n\n\n“Yeah, so I had a different midwife every, I believe, maybe eight hours. I was in hospital for three days, so I was constantly repeating my story, constantly having to explain why I was there, constantly having to meet new people and retell my story. It was like reliving the worst day of my life over and over and over again.”\n\n\n\n\n\nShe would like to see more care and support extended to women after experiencing a miscarriage.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/i-felt-alone-inside-the-invisible-loss-one-in-three-australian-women-endure/d97d2me8d",
    "title": "'I felt alone': Inside the 'invisible' loss one in three Australian women endure",
    "publish_date": "Sun, 12 Oct 2025 19:03:29 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "This article contains references to early pregnancy loss.\n\n\n\n\n\nSarah Peters hoped her baby would be a late Christmas present for her and her husband. But at 11 weeks, she found out that the baby had no heartbeat and stopped growing.\n\n\n\n\n\nThe 27-year-old was told she had a miscarriage at a routine check-up before receiving confirmation at her local Sydney hospital. In an already difficult time, she says a lack of support from the hospital made her feel \"alone\".\n\n\n\n\n\nDespite receiving care at a private Sydney hospital and experiencing complications in a surgery to remove her foetus, Peters says she wasn't directed to any support services, mental health support, or grief counselling.\n\n\n\n\n\nAs a First Nations woman, she says she also wasn't connected with any Aboriginal health workers or community.\n\n\n\n\n\n\"I never received any follow-up from the hospital. I was never offered any guidance in terms of who I could turn to,\" Sarah told SBS.\n\n\n\n\n\n\"I was never guided in any sort of First Nations practice or connected with any of my community. I wasn't directed in any sort of way in relation to First Nations matters, especially relating to grief.\"\n\n\n\nLISTEN TO Hysterical: the shocking findings from government inquiries into women's healthcare SBS News 23:45 English\n\nShe also said the news was delivered to her in a \"clinical\" way that \"didn't feel very nurturing or caring\".\n\n\n\n\n\n\"It was quite hard. I felt really alone,\" she said.\n\n\n\n\n\nSarah wishes she had experienced continuity of care, saying inadequate resourcing meant she experienced ongoing trauma.\n\n\n\n\n\n\"I had a different midwife every eight hours. I was in the hospital for three days, so I was constantly repeating my story, constantly having to explain why I was there, constantly having to meet new people and retell my story,\" she said.\n\n\n\n\n\n\"It was like reliving the worst day of my life over and over and over again.\"\n\n\n\nHow many Australians have had a miscarriage?\n\nA new whitepaper from miscarriage support organisation Pink Elephants Support Network found 75 per cent of women reported feeling unsupported through their miscarriage experience. Sixty-eight per cent received no support when told their pregnancy had ended.\n\n\n\n\n\nThe report said one in four pregnancies end in miscarriage, but noted research from Jean Hailes and the National Women's Health Survey which suggests that rate might be as high as 37 per cent.\n\n\n\n\n\nPink Elephants' chief executive, Samantha Payne, estimates the real numbers to be much higher — but says it's difficult to capture the true scope of miscarriage as there's no national data collection on it.\n\n\n\n\n\n\"For too long, our miscarriages have not been seen because they are not counted anywhere nationally,\" she told SBS. \"It's a fragmented health system.\"\n\n\n\nLISTEN TO New data sheds light on the mental health impacts of losing a pregnancy SBS News 03:33 English\n\nThe absence of national data means it's difficult to understand exactly who's affected most by it — how many losses there have been, what type of miscarriages they were, what intersectional groups are affected, and where they're located.\n\n\n\n\n\nChange advocates argue this means resources might not be getting to where they're needed most.\n\n\n\n\n\n\"When we don't measure, we don't count, we don't resource, and we don't support,\" Payne said.\n\n\n\n\n\nThe report offers five recommendations — including the establishment of national data collection systems, early pregnancy loss care standards, continuity of care, and culturally-safe care.\n\n\n\nFirst Nations women 'left behind'\n\nThe sting is particularly acute for women in regional and rural parts of Australia, where pain is compounded by both geographical and financial barriers.\n\n\n\n\n\nKatrina Ward, or Treen, is a Ngiyampaa woman and chief operations manager for the Brewarrina and Walgett Aboriginal Medical Services in far northwest New South Wales.\n\n\n\n\n\nTreen says women in regional areas are forced to travel hours to their nearest hospital, where they're treated as a number, and often discharged prematurely due to a lack of staffing.\n\n\n\n\n\n\"Often after a miscarriage, they may have to go to a larger regional centre to have a D&C [surgery to remove the foetus], so that's another layer of trauma on the individual,\" she said.\n\n\n\nREAD MORE Hysterical\n\nTreen says that in regional areas, continuity of care is particularly significant and it's especially so for First Nations communities.\n\n\n\n\n\n\"Cultural protocols come into play as well — they need to feel culturally safe and listened to … so that if the mother says something's not quite right, it's not dismissed.\"\n\n\n\n\n\nBut she says there simply isn't enough resourcing allocated in regional Australia.\n\n\n\n\n\nShe says some of her staff — who live as far as 100 kilometres away — operate on a \"fly-in, fly-out\" basis, which makes continuity of care and education difficult. Because of this, people are often \"left to their own devices\" and need to turn to family members for support, rather than health workers.\n\n\n\nLISTEN TO INTERVIEW: Could a First Nations voice help tackle stubborn public health challenges? SBS News 07:52 English\n\nMedical practices around pregnancy loss can also trigger intergenerational trauma connected to the Stolen Generations, as Treen described, with many First Nations women reporting experiences of racism at hospitals. \"That makes it more likely for people to remain silent,\" she said.\n\n\n\n\n\n\"When people come back, they get left behind … particularly young girls. There are too many who will just go along with their normal day. They'll suffer in silence with their grief and put up that brave front.\n\n\n\n\n\n\"Shame comes into it as well — it still plays a very prominent role.\"\n\n\n\nTreen says women in regional areas are forced to travel hours to their nearest hospital, where they're treated as a number, and often discharged prematurely due to a lack of staffing. Source: Getty / Thomas Barwick\n\n'Nothing is given without adequate data'\n\nDr Nisha Khot is the president of the Royal Australian New Zealand College of Obstetricians (RANZCOG), and contributed as an expert to the Pink Elephants report. She believes national data is also important for informing the prevention of miscarriages.\n\n\n\n\n\n\"For many years, there has been this kind of narrative that miscarriage is something we can't prevent. We can't do anything about it. So is there any point in capturing the data?\" Khot said.\n\n\n\n\n\n\"But now we know that there are things that we can do and that there are certain conditions that we should look into to prevent miscarriages — and so that is also driving this need to capture the data so we can actually do something about it.\"\n\n\n\n\n\nShe says the data gap also affects how services are allocated.\n\n\n\n\n\n\"We can't have services if we don't know what the need for services is,\" she said.\n\n\n\n\n\n\"Without the data, it's really difficult to know what sort of early pregnancy services we should set up, what we should expect in terms of numbers, and how we should resource it.\"\n\n\n\n\n\nThose in rural, migrant and First Nations communities are the most vulnerable to this funding gap, she says.\n\n\n\nLISTEN TO \"I found it to be really lonely': Data show parents often silent after miscarriage or stillbirth SBS News 04:38 English\n\nOn the ground, a lack of data means fewer resources for regional and First Nations women, says Treen.\n\n\n\n\n\n\"Nothing is given in the way of funding unless they've got adequate data to prove that there's a need for this particular service,\" she said. \"Unless you've got that data there to say there's a deficit, they're not even going to look at it.\"\n\n\n\n\n\n\"It's one way that we can get more services out in the bush and have people on the ground in these small areas.\"\n\n\n\n\n\nShe says that while the government has started to \"change its attitude slightly\", more investment in rural and remote health needs to be done if it wants to close the gap by 2030.\n\n\n\n\n\n\"We're all individuals. We all deserve equality. It doesn't matter where we live. We all deserve the choice to have a good life,\" she said. \"So start investing in the people who are the grassroots of Australia — and that's our First Nations people.\"\n\n\n\nFunding welcomed, but key 'gaps' remain\n\nGovernment funding towards miscarriage support has increased, but Payne says there are still gaps.\n\n\n\n\n\nThe 2024-25 Budget invested $9.5 million in funding towards miscarriage support, including investment in bereavement support services, education and awareness, and an audit of early pregnancy assessment service clinics.\n\n\n\n\n\nThe Pink Elephant's Support Network received $4 million while $1 million was allocated to the Australian Institute of Health and Welfare (AIHW) to scope the establishment of a national collection of miscarriage data.\n\n\n\nLISTEN TO Who's left behind in the government's multi-million dollar women's health investment? SBS News 11:26 English\n\nThe work is part of the draft sexual and reproductive health monitoring framework and is open for public consultation until 2 November.\n\n\n\n\n\n\"Where possible, the AIHW publishes data disaggregated for First Nations, and culturally and linguistically diverse people, and by geographic areas. This will be further considered during the development of the dataset,\" Assistant Minister for Women, Rebecca White, told SBS News.\n\n\n\n\n\nPayne commends the funding and the plans for a national pregnancy loss register, but says it will \"take time\", though she hopes to see a national database by mid-next year.\n\n\n\n\n\n\"We're excited to see that after years of calling for more data to understand it better, so we can support women better and address false narratives that exist … we're grateful to see that,\" Payne said.\n\n\n\n\n\n\"That will be data that's entered by health professionals, but we still see another gap — the census.\"\n\n\n\nCalls for 'validation' in the census\n\nThe 2026 Census will not include a question on miscarriage or early pregnancy loss.\n\n\n\n\n\nA spokesperson for the Australian Bureau of Statistics told SBS that during the \"topic of 'pregnancy loss' did not progress\".\n\n\n\n\n\n\"The topic was considered initially in the first phase of the 2026 Census topic consultation process, but it did not meet the criteria to progress to the second phase of consultation as it was deemed the data need is partially met by alternative data sources, such as the Australian Longitudinal Study on Women's Health,\" an ABS spokesperson said.\n\n\n\n\n\nPayne says the Australian Bureau of Statistics rejected Pink Elephants' request in September 2023 for this data to be included in the 2026 census. She plans on requesting it again for the next census.\n\n\n\n\n\nPink Elephants say the rejection \"exemplifies how institutional decisions render [early pregnancy loss] statistically invisible\".\n\n\n\nREAD MORE The questions that will change in Australia's 2026 Census\n\nFor her, the Census is less about data collection and more about validating the pain that comes with early pregnancy loss.\n\n\n\n\n\n\"The gap still for us is the census because there is so much validation in being able to acknowledge your own baby as part of your family within the census,\" she said.\n\n\n\n\n\n\"When we don't give women that option, we're basically saying that, 'your baby doesn't matter, your loss wasn't real', and that's not okay.\"\n\n\n\n\n\nPeters believes a question around early pregnancy loss should be included in the census.\n\n\n\n\n\n\"At the present time, there is nothing to recognise that our babies have been lost, with the exception of a commemorative certificate,\" she said.\n\n\n\n\n\nReaders seeking support can ring Lifeline crisis support on 13 11 14 or text 0477 13 11 14, visit lifeline.org.au or find an Aboriginal Medical Service here . Resources for young Aboriginal and Torres Strait Islanders can be found at Headspace: Yarn Safe .\n\n\n\n\n\nThe Pink Elephants Pregnancy Loss Helpline can be reached by calling 1300 726 306. It operates Monday to Friday from 9am to 7:30pm and Saturdays and public holidays from 9am to 4pm.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-theres-concern-over-iconic-crocodile-old-faithful-detention/b36fd948z",
    "title": "Made famous by Steve Irwin, this croc's now been 'wrongfully accused', advocates say",
    "publish_date": "Sun, 12 Oct 2025 04:20:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Traditional owners are demanding the return of an iconic crocodile that has been captured and removed from its home in Far North Queensland.\n\n\n\n\n\nThe croc, named \"Old Faithful\", is famous for being featured in the Crocodile Hunter series alongside the late Steve Irwin in the 1990s.\n\n\n\n\n\nBack in the 90s, the conservationist Irwin was filmed \"hazing\" the croc, which was an attempt to deter it from approaching humans in future.\n\n\n\n\n\nOld Faithful is also culturally significant to First Nations peoples in Far North Queensland.\n\n\n\n\n\nAlwyn Lyall from the Rinyirru (Lakefield) Aboriginal Corporation Chairperson says Old Faithful is like a family member to the community.\n\n\n\n\n\n\"That animal — and animals like him — they play a significant role in our society as totem animals,\" Lyall told SBS News.\n\n\n\n'Crocodiles always pay the price'\n\nThe four-and-a-half metre crocodile is now a long way from home.\n\n\n\n\n\nWildlife officers removed Old Faithful from the Normanby River in Rinyirru (Lakefield) National Park last month, after reports that visitors were using food to lure him from the water to take photos.\n\n\n\n\n\nHe's now at a facility in Cairns, more than 300 kilometres away.\n\n\n\nREAD MORE Crocodile-grabbing US influencer posts second video amid Queensland investigation\n\nAmanda French, from crocodile conservation advocacy group, Croc QLD says crocodiles learn very quickly to associate food with people.\n\n\n\n\n\n\"It's a shame when it happens because the crocodile is always the one that pays the price,\" French said.\n\n\n\n\n\nThe Queensland Environment Department spokesperson said public safety was its top priority, and that it was working to find it a suitable home.\n\n\n\n\n\n\"The department extensively monitored the crocodile after reports from the public raising safety concerns,\" a spokesperson told SBS News.\n\n\n\n\n\n\"We understand people were using food to lure the animal from the water to take photos. Habituating crocodiles is detrimental to the animal and dangerous for people.\n\n\n\n\n\n\"The crocodile was displaying repeated and concerning behaviour that was escalating. It was ultimately removed to keep people safe.\"\n\n\n\nOld Faithful is culturally significant to First Nations peoples in Far North Queensland. Source: Supplied\n\n\n\nCroc QLD says there've been over 300 letters from members of the community, scientists, tourism operators, and First Nations people call for Old Faithful to be returned to his waterhole.\n\n\n\n\n\nThere are also concerns Old Faithful is in \"unsuitable captivity\", while advocates say there's expert advice confirming he can safely return to the wild.\n\n\n\n\n\n\"I felt very sorry for that animal because, he's been taken out of his natural habitat, been wrongly accused of harassing people for their fish,\" Alwyn said.\n\n\n\nTesting method questioned\n\nEnvironmental advocates also say wildlife officers also used a \"flawed\" method to test the crocodile's behaviour.\n\n\n\n\n\nFrench said the method \"essentially lured the crocodile to respond with bait\".\n\n\n\n\n\n\"Any crocodile is going to respond that way so it's not a true test of an apex predator's behaviour,\" French said.\n\n\n\nAdvocates say key information was withheld during consultation with traditional owners to gain their approval to remove the crocodile.\n\n\n\n\n\nIn recent years, the state government has come under increasing pressure to balance community safety concerns with protecting the species listed as \"vulnerable\".\n\n\n\n\n\nWarren Martens, Kunggandji traditional owner is calling on the state government to consult with groups.\n\n\n\n\n\n\"I think what needs to happen now is government needs to sit down with crocodile traditional owner groups and come up with a better management plan for the removal of crocs from country.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/oscar-winning-actress-diane-keaton-dies-at-79/c5xrom26x",
    "title": "Diane Keaton, star of Annie Hall and The Godfather, dies at 79",
    "publish_date": "Sat, 11 Oct 2025 20:47:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Diane Keaton, the Oscar-winning star of Annie Hall, The Godfather films and Father of the Bride, whose quirky, vibrant manner and depth made her one of the most singular actors of a generation, has died. She was 79.\n\n\n\n\n\nPeople Magazine reported on Sunday AEDT that she died in California with loved ones, citing a family spokesperson. No other details were immediately available, and representatives for Keaton did not immediately respond to inquiries from The Associated Press.\n\n\n\n\n\nThe unexpected news was met with shock around the world.\n\n\n\n\n\n\"She was hilarious, a complete original, and completely without guile, or any of the competitiveness one would have expected from such a star. What you saw was who she was…oh, la, lala!,\" Bette Midler said in a post on Instagram. She and Keaton co-starred in The First Wives Club.\n\n\n\n\n\nKeaton was the kind of actor who helped make films iconic and timeless, from her \"La-dee-da, la-dee-da\" phrasing as Annie Hall, bedecked in that necktie, bowler hat, vest and khakis, to her heartbreaking turn as Kay Adams, the woman unfortunate enough to join the Corleone family.\n\n\n\nGoldie Hawn (left), Diane Keaton (centre) and Bette Midler co-starred in the revenge comedy, The First Wives Club. Source: AP / Frank Wiese Her star-making performances in the 1970s, many of which were in Woody Allen films, were not a flash in the pan either, and she would continue to charm new generations for decades.\n\n\n\n\n\nShe played a businessperson who unexpectedly inherits an infant in Baby Boom, the mother of the bride in the beloved remake of Father of the Bride, a newly single woman in The First Wives Club, and a divorced playwright who gets involved with Jack Nicholson's music executive in Something's Gotta Give.\n\n\n\n\n\nKeaton won an Oscar for Annie Hall in 1978 and would go on to be nominated three more times, for Reds, Marvin's Room and Something's Gotta Give.\n\n\n\nDiane Keaton partnered with Jack Nicholson (centre) in Something's Gotta Give - her favourite film. Source: AP / Jan Bauer Keaton was born Diane Hall in January 1946 in Los Angeles and was drawn to theatre and singing while in school.\n\n\n\n\n\nShe dropped out of college after a year to make a go of it in Manhattan. Actors' Equity already had a Diane Hall in their ranks, and she took Keaton, her mother's maiden name, as her own.\n\n\n\n\n\nShe started on the stage as an understudy in the Broadway production for Hair, and in Allen' s Play It Again, Sam in 1968, for which she would receive a Tony nomination.\n\n\n\n\n\nKeaton made her film debut in the 1970 romantic comedy Lovers and Other Strangers, but her big breakthrough would come a few years later when she was cast in Francis Ford Coppola's The Godfather, which won best picture and become one of the most beloved films of all time.\n\n\n\nShe won a best actress Oscar for playing the title role in the Woody Allen comedy Annie Hall. Source: AP / Chris Pizzello The 1970s were an incredibly fruitful time for Keaton thanks in part to her ongoing collaboration with Allen in both comedic and dramatic roles. She appeared in Sleeper, Love and Death, Interiors, Manhattan, Manhattan Murder Mystery and the film version of Play it Again, Sam.\n\n\n\n\n\nAllen gave Keaton one of her most iconic roles in Annie Hall, the infectious woman from Chippewa Falls whom Allen's Alvy Singer cannot get over. The film is considered one of the great romantic comedies of all time, with Keaton's eccentric, self-deprecating Annie at its heart.\n\n\n\n\n\nIn the New York Times, critic Vincent Canby wrote, \"As Annie Hall, Miss Keaton emerges as Woody Allen's Liv Ullman. His camera finds beauty and emotional resources that somehow escape the notice of other directors. Her Annie Hall is a marvellous nut\".\n\n\n\n\n\nKeaton and Allen were also in a romantic relationship, from about 1968, when she met him while auditioning for his play, until about 1974. Afterward they remained collaborators and friends.\n\n\n\n\"He was so hip, with his thick glasses and cool suits,\" Keaton wrote in her memoir.\n\n\n\n\n\n\"But it was his manner that got me, his way of gesturing, his hands, his coughing and looking down in a self-deprecating way while he told jokes.\"\n\n\n\n\n\nShe was also romantically linked to Al Pacino, who played her husband in The Godfather, and Warren Beatty who directed her and whom she co-starred with in Reds. She never married but did adopt two children when she was in her 50s: a daughter, Dexter, and a son, Duke.\n\n\n\n\n\n\"I figured the only way to realise my number-one dream of becoming an actual Broadway musical comedy star was to remain an adoring daughter. Loving a man, a man, and becoming a wife, would have to be put aside,\" she wrote in the memoir.\n\n\n\n\n\n\"The names changed, from Dave to Woody, then Warren, and finally Al. Could I have made a lasting commitment to them? Hard to say. Subconsciously I must have known it could never work, and because of this they'd never get in the way of achieving my dreams.\"\n\n\n\n\n\nIn the remake of Father of the Bride, Keaton and Steve Martin played the flustered parents to the bride which would become a big hit and spawn a sequel.\n\n\n\n\n\nIn Something's Gotta Give in 2003 she begins a relationship with a playboy womaniser, played by Jack Nicholson, while also being pursued by a younger doctor, played by Keanu Reeves.\n\n\n\n\n\nHer character Erica Barry, with her beautiful Hamptons home and ivory outfits was a key inspiration for the recent costal grandmother fashion trend. It earned her what would be her last Oscar nomination and, later, she'd call it her favourite film.\n\n\n\n\n\nKeaton continued working steadily throughout the 2000s, with notable roles in The Family Stone, as a dying matriarch reluctant to give her ring to her son, in Morning Glory, as a morning news anchor, and the Book Club films.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-israel-preparing-for-hostage-release-as-trump-visits-middle-east-opposition-leader-s-approval-ratings-tank-new-polling-finds-20251013-p5n1xo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Treasurer announces major changes to super taxes; Israel preparing for hostage release as Trump visits Middle East",
    "publish_date": "Mon, 13 Oct 2025 13:01:55 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Treasurer Jim Chalmers calls a complete overhaul of his planned changes to superannuation tax concessions a “tweak”. Even Shane Warne would have struggled to spin a ball that far.\n\nIn the face of a big pushback to his plans to impose an additional 15 per cent tax on income generated on super funds with balances of more than $3 million, Chalmers has been forced into an embarrassing retreat.\n\nFirst announced in 2023, Chalmers was not only going to increase the tax paid by 0.5 per cent of people who also happened to be among the nation’s wealthiest and most well-off.\n\nHe was going to tax unrealised gains, effectively the lift in the paper value of assets before the owner was able to sell them, in what would be a huge departure from the way income in this nation is taxed.\n\nTreasurer Jim Chalmers announcing changes to the superannuation tax system at Parliament House. Credit: Alex Ellinghausen\n\nHe was also not going to index the $3 million threshold, effectively ensuring young people today would eventually get caught up in his planned tax net.\n\nBoth key elements are now gone. That’s not a tweak – that’s a wholescale renovation.\n\nHe is sticking his higher tax to real gains while the thresholds will be indexed. And to help cover the cost of his retreats, people with more than $10 million – about 8000 individuals – will actually face a 40 per cent tax rate on their holdings.\n\nThe treasurer is also tidying up an issue around the low-income superannuation tax offset and the way it interacts with the revamped stage 3 tax cuts, that would have hurt people earning less than $45,000.\n\nChalmers says the combination of his changes will mean that in 2028-29, instead of earning about $2.5 billion in extra revenue, the government will collect about $2 billion. Further out, by indexing the thresholds, the repair to the long-term budget bottom line is reduced, although he maintains it will still raise a “substantial” amount of cash.\n\nHow “substantial” that tweak is, only future taxpayers will find out.",
    "source": "TheAge",
    "cluster_id": 6
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-wa-family-heartbroken-after-dog-stabbed-to-death-at-park-20251013-p5n1xg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: ‘We need more workers’: Cook wants WA exempt from skilled migration reduction",
    "publish_date": "Mon, 13 Oct 2025 12:52:51 +1100",
    "category": "finance",
    "authors": [],
    "text": "Premier Roger Cook has defended his request to Prime Minister Anthony Albanese for WA to be exempt from a reduction in the national skilled migrant intake, saying the state needed the workers to feed into its construction and defence sectors.\n\nWA’s allocation of skilled migrants under the state nominated migration program will drop from 5000 to 3400 places from next year as debate over the number of people entering the country heats up.\n\nWA Premier Roger Cook has written to the prime minister to request the state be exempt from a reduction in the national skilled migration intake. Credit: Matt Jelonek/Rio Tinto\n\nThe state nominated migration program allows each state to target certain occupations it needs, allowing easier to access visas for migrants that meet those skill requirements.\n\nCook wrote to Albanese earlier this month urging the Commonwealth to reverse the reduction in the program, arguing the state needed it to bring in more worker to meet the demands of the housing and construction sector.\n\nHe said WA had specific needs.\n\n“We need more workers. We need more skilled migrants coming to Western Australia, either from the East Coast or from overseas,” he said.\n\n“Western Australia’s economy is the strongest in the nation, and we join the federal government in our ambitions to host the largest shipbuilding and maintenance hub in the southern hemisphere.\n\n“So we need more workers, and that’s why we need the government to stand by us and continue to make sure that we’ve got a strong Skilled Migration Program.”\n\nCook was at North Metro TAFE in East Perth this morning announcing the new You Can Make It Here advertising campaign to drive people to enrol in low and no-fee TAFE courses.\n\nThe campaign will be accompanied by a rebranded TAFE WA website.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/politics/federal/chalmers-backs-down-on-super-indexing-in-bid-to-get-changes-through-parliament-20251013-p5n21t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chalmers backs down on super indexing, puts in higher tax rate for accounts with $10m",
    "publish_date": "Mon, 13 Oct 2025 12:48:58 +1100",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "Treasurer Jim Chalmers has backed down on plans to tax unrealised gains on superannuation and has introduced indexing for balances above $3 million – changes business and economists have been pushing for since before the May election.\n\nThe government will establish a 40 per cent tax rate for earnings on balances above $10 million, while earnings on balances above $3 million will still be taxed at 30 per cent.\n\nTreasurer Jim Chalmers. Credit: Alex Ellinghausen\n\nThe low-income super tax offset payment will also be raised from $500 to $810. Currently, those earning under $37,000 a year receive $500 from the government, directly deposited into their super account. From 2027, the threshold will be raised to an income of $45,000, and the deposit will be $810.\n\nThe announcement followed the news that Prime Minister Anthony Albanese had sought a briefing from Treasury on objections to the original super tax changes.",
    "source": "TheAge",
    "cluster_id": 6
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/after-one-nrl-season-the-wallabies-re-sign-a-world-cup-hopeful-20251013-p5n1zq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After one NRL season, the Wallabies re-sign a World Cup hopeful",
    "publish_date": "Mon, 13 Oct 2025 12:48:19 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Carter Gordon has re-signed with Australian rugby after a stint in the NRL and will be fast-tracked back into the Wallabies, with the former Gold Coast Titan set to be included in the spring tour squad named on Monday afternoon.\n\nRugby Australia confirmed on Monday that Gordon had been signed on a three-year deal, which will see the eight-Test playmaker return to the Queensland Reds.\n\nAnd, in a clear sign Gordon has been recruited as a potential solution to the troublesome Wallabies No.10 slot for the 2027 World Cup, informed sources say the 24-year-old is set to be named by Joe Schmidt later today in the Wallabies’ squad for a five-Test tour of Japan, Britain and Europe, which starts next week.\n\nThis masthead revealed last week that the Titans, under new coach Josh Hannay, had granted Gordon permission to negotiate with Rugby Australia about an early release from his two-year NRL contract.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/scandalous-revelations-and-sudden-twists-await-in-this-gothic-thriller-20251005-p5n06m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "It’s a classic, but this lumbering brute of a ballet remains a hard work",
    "publish_date": "Mon, 13 Oct 2025 12:42:45 +1100",
    "category": "entertainment",
    "authors": [
      "Andrew Fuhrmann",
      "Jessica Nicholas"
    ],
    "text": "The secondary schemers are more fun. Maxim Zenin’s Lescaut is a lovable rogue – quick, witty and impish in attack. And Isobelle Dashwood is eye-catching as his mistress: tall and graceful but also funny, especially in the drunken duet with Zenin. Isobelle Dashwood is eye-catching as Lescaut’s mistress. Credit: Kate Longley It feels every bit of its more than 2½-hour length. There are group dances galore and variations, as well as many heavy touches of verismo. Is that child working in the brothel? Well, it’s all part of Manon’s operatic largeness. Conductor Charles Barker gets a ravishing sound from Orchestra Victoria. Those intimate but faintly menacing pieces such as the Nocturne from La Navarraise, used in the second act, are particularly effective – perhaps the most delicately human things in the whole ballet. Reviewed by Andrew Fuhrmann\n\nJAZZ\n\nChristopher Hale Ensemble ★★★★★\n\nThe JazzLab, October 12 For well over a decade now, Melbourne musician Christopher Hale has immersed himself in the study of traditional Korean drumming. Hale is not a drummer – he’s a bass guitarist – but he has found ways to adapt and incorporate these rhythmic traditions into his own playing and compositional practice. Musician Chris Hale Credit: Cesar Rodriguez Hale’s latest project is based on his own personal interpretation of hohŭp, a Korean rhythmic concept based on breath and body movement. But while his study of this elaborate system has academic leanings – he’s written an entire thesis on it – the compositions that have emerged from his study are far from abstruse. At JazzLab on Sunday, Hale spoke briefly about his interest in ritual music from Korea, but didn’t mention hohŭp or the related methodology he’d developed for his own music. Instead, he embodied it – quite literally. We may not have understood or even registered the rhythmic intricacy at play, but we could see and feel the pulsing undulations in Hale’s bass lines and torso. Drummer Simon Barker (also a master of Korean drumming) was equally expressive, resembling a languid cowboy leaning back in his saddle while his arms flew around the kit with explosive power and immaculate control.\n\nMeanwhile, saxophonist Jamie Oehlers and pianist Brett Williams fashioned clear melodic lines and beguiling harmonies to counter the music’s rhythmic complexity. Both could shift from introspective lyricism to muscular vigour with ease, enhancing the music’s emotional impact. Loading Several tunes moved through multiple moods, building from graceful solo or duo introductions to propulsive groove-based themes, dropping into hushed interludes or creating sweeping extended codas that became more soulful, more majestic and more impassioned with every repetition. With Oehlers based in Perth and Barker in Sydney, this is an ensemble that will require considerable commitment to keep together. But this project (like so many of Hale’s creative endeavours) is unique and compelling enough to be worth the effort. Reviewed by Jessica Nicholas\n\nDANCE\n\nDanceX Festival Week 1 ★★★★\n\nPlayhouse, until October 11 The DanceX Festival is a curious beast. The Australian Ballet – that bastion of a prestige art form – has built a festival for the whole sector. Everyone – or nearly everyone – has a place at the table. Seeing Through Darkness. Credit: Matt Byrne And yet, it doesn’t feel like a festival. There’s not a lot of buzz and the Playhouse was far from full at Wednesday’s opening. The timing doesn’t help because DanceX is wedged between the Australian Ballet seasons of Prism and Manon. So it doesn’t have much oxygen. It also overlaps with the Melbourne Fringe Festival, with its own diverse program of dance offerings.\n\nAudiences should come anyway. There’s a generous selection of shorter works. The standard is very high – these are works that have toured repeatedly – and the contrasts are instructive. It amounts to a welcome digest of where Australian dance is now. A notable international guest, the Royal New Zealand Ballet, offers an excerpt from Te Ao Marama, created for the company’s 70th anniversary by Moss Te Ururangi Patterson. It’s an intriguing experiment in which the haka form is combined with more lyrical material. An excerpt from Te Ao Marama is presented as part of of the first week of DanceX. Credit: Stephen A’Court Restless Dance Theatre’s Seeing Through Darkness is welcome programming. The company’s inclusive ensemble is accompanied by live violin and cello. It’s the most polished work I’ve seen from them, but it still left me wishing the company would take a few more risks. Balanchine’s Allegro Brillante is performed by artists from the Australian Ballet and the Australian Ballet School. Charming, yes, and a bit schmaltzy. It’s performed with speed and some feel for the music; nonetheless, it looks a little stale on these dancers.\n\nThe standout piece is Lucy Guerin’s Ground Control. If Samara Merrick is plausible but not dazzling in Allegro, here she is a galvanic phenomenon: focused, precise and attractively strange. She proves an ideal interpreter of Guerin’s art of the uncanny. The four dancers first work themselves into the floor, sinking their feet as the arms flicker. Then there’s shift when Merrick puts on her pointe shoes. Now we see structures melt away as she wafts into the darkness. Lucy Guerin’s Ground Control is a highlight. Credit: Kate Longley The evening closes with an excerpt from Dancenorth’s Wayfinder – that effervescent rainbow fantasy from Townsville. Honestly, every evening of dance should finish with something from Wayfinder: it’s the surest way to send the audience off with a smile.\n\nReviewed by Andrew Fuhrmann THEATRE\n\nRebecca ★★★★\n\nMelbourne Theatre Company, Sumner Theatre, until November 5 Rebecca is the second gothic fiction from Daphne du Maurier to be adapted for Melbourne’s main stage this year, after The Birds at the Malthouse in May. Both were popular bestsellers made into Hitchcock films, so it’s fair to ask: what can theatre bring to their retelling that film can’t?\n\nIn Matthew Lutton’s no-frills adaptation of The Birds, the intimacy of sound predominated. Paula Arundell’s almost conspiratorial storytelling coaxed audiences into the claustrophobic monodrama; audio tech immersed us in the horror of unexplained avian attacks individually, creating a private, and deeply unnerving, soundscape for each spectator. Nikki Shiels in a scene from Rebecca Credit: Pia Johnson Anne-Louise Sarks’ Rebecca has frills. This is commercial theatre with elegant production values, poised and atmospheric design, a formidable cast, and a script that allows the seeds of this iconic romantic thriller to bloom into morbid flower. An unnamed young woman (Nikki Shiels) meets grieving aristocrat Maxim de Winter (Stephen Phillips) by chance in Monte Carlo. A whirlwind romance leads to marriage, and she moves with him to Manderley – a stately manor home by the sea in Cornwall – where she quickly falls under the shadow of Maxim’s recently deceased first wife, Rebecca. As the severe housekeeper Mrs Danvers (Pamela Rabe) begins to manipulate the new lady of the house, Maxim becomes remote and emotionally withdrawn. All roads point to Rebecca as the cause. Is Maxim still in love with her? How could anyone ever live up to Rebecca’s reputation for feminine perfection? And how, exactly, did Rebecca die?\n\nScandalous revelations and sudden twists await as she probes the secrets her haunted husband is hiding from her. Design elements fuse into a triumph of Gothic sensibility: the brooding insistence of the sound design (Grace Ferguson and Joe Paradise Lui); Paul Jackson’s nimbus-smeared lighting; Marg Horwell’s astute eye for period fashion; and the visual precision behind each scene change, every mist and mirror. Pamela Rabe as Mrs Danvers is ideal casting. Credit: Pia Johnson Shiels inhabits the insecurities of the heroine, her vulnerability, and her descent into domestic horror with compelling presence. There’s a jolting character transformation that might be more credible had it been achieved in a more graduated way, but the romance opposite Phillips holds your attention, and I particularly enjoyed Shiels going toe-to-toe with Rabe. Long before her award-winning role in Wentworth, I’ve wanted to see Rabe as Mrs Danvers. It’s ideal casting, and Rabe’s husky apparition turns into a creature of flesh and blood as it builds a sapphic subtext (disallowed by censors in the Hitchcock movie) to the character’s deranged obsession. The fetishisation of the feminine, and the power play between the two women, has a transfixing, performative quality that reminded me a little of the murderous sisters in Jean Genet’s The Maids.\n\nLoading And it’s Mrs Danvers, interestingly, who gives the staunchest rallying cry regarding social freedom for women. Sarks appears to deny no perspective on the sources of psychological horror in Rebecca, tantalising us with possibilities. It’s thought-provoking, even if they don’t all coalesce into effective drama. Newcomers to Rebecca might strain, too, to make sense of plot twists hastily telegraphed toward the end. It’s a bumpy climax after such a smooth ride to get there, though a small flaw in an otherwise slick, solidly crafted entertainment.\n\nReviewed by Cameron Woodhead MUSIC\n\nTrio Isimsiz ★★★★\n\nMusica Viva Australia, Melbourne Recital Centre, October 7 Blending youthful verve and bonhomie with seasoned intuition, Trio Isimsiz (Turkish for “trio without a name”) made this concert deeply pleasurable. Bookended by two great masterpieces (Brahms’ Piano Trio in C minor, Op. 101 and Schubert’s Piano Trio No. 1 in B-flat major, D. 898), the program centred on the Melbourne premiere of a new trio by contemporary Spanish composer Francisco Coll.\n\nBrahms’ third and final essay in the piano trio form is highly compact; its four movements last just over 20 minutes. From the start, the trio fanned the music’s smouldering embers of passion into flame, confirming a solid collective commitment to their endeavours. Beautifully hushed playing in the inner movements caught the ear, along with some wonderfully resonant pizzicato before the fiery finale. Commissioned for Trio Isimsiz, Coll describes his 2020 Piano Trio as kaleidoscopic. Moving from textural fragmentation to cohesion and back to fragmentation across its four movements constitutes a form of musical cubism. While an engaging and highly imaginative work, with allusions to Richard Strauss and flamenco, there is perhaps too much reliance on the piano to glue the texture together, apart from one spotlit moment for cello. Nevertheless, the dedicatees convincingly rose to the work’s considerable technical and expressive challenges. Trio Isimiz. Credit: Verena Chen Schubert’s evergreen trio sent the audience out on a high. After revelling in the buoyant optimism of the opening, the players revealed the poignant slow movement as the beating heart of the work, inhaling tenderness and exhaling a gentle melancholy. Deft, delicate touches in the scherzo led to a final rondo full of playful energy. Pianist Erdem Misirlioglu, an astute chamber musician with technique to burn, violinist Pablo Hernan Benedi with his sweet, well-projected tone and cellist Edvard Pogossian’s musical handling of his gloriously rich-sounding instrument have certainly made a name for this “nameless” trio.\n\nReviewed by Tony Way\n\nMUSIC\n\nThe Tallis Scholars ★★★★★\n\nMelbourne Recital Centre, October 5 and 6 Melbourne turned on a rock star welcome for The Tallis Scholars, who, over half a century, have come to epitomise the classic English choral sound. Possibly because of the Elisabeth Murdoch Hall’s warm acoustics, the city is the only stop on this Australian tour, favoured with two concerts by the revered ensemble. The Tallis Scholars. Credit: Hugo Glendinning Such bounty enabled capacity audiences to savour the group’s stylistic versatility with music from 12th-century abbess and mystic Hildegard von Bingen, through to contemporary American composer Nico Muhly. While some fans may have considered the absence of English music from the Tudor period conspicuous, there was much other fine music from the 15th and 16th centuries to enjoy.\n\nEmma Walshe expertly spun out the glorious high Cs in Gregorio Allegri’s crowd-pleasing Miserere, supported by the group’s customary razor-sharp intonation and limpid diction. Another Tallis Scholars speciality, Tomas Luis de Victoria’s six-part Requiem of 1605, also plumbed great emotional depths. Director Peter Phillips unleashed plenty of Latin fervour in an evocative reading that cut to the heart of this powerful pondering of life and death. Loading Classics such as Clemens non Papa’s Ego flos campi and Josquin’s Praeter rerum seriem rubbed shoulders with lesser-known gems, including Crecquillon’s Andreas Christi famulus, Obrecht’s Salve Regina and an eight-part Credo by Gombert. A sprightly Deus in adiutorium by Spanish Mexican priest Juan de Padilla added further delight. Sung by an angelic quartet of female voices, four short chants by Hildegard provided interludes in the second program. By contrast, works by living composers included Muhly’s 2023 commission A Glorious Creature, full of engaging brightness, while the quiet intensity of Arvo Part’s Triodion and Da pacem Domine were set against the insightful strength of his Magnificat.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/lifestyle/australias-oldest-dad-reveales-he-wants-another-kid-20251013-p5n22l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia's oldest dad reveales he wants another kid",
    "publish_date": "Mon, 13 Oct 2025 12:24:16 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Australia's oldest dad reveales he wants another kid\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/culture/theatre/help-country-how-a-tiny-endangered-possum-inspired-this-new-children-s-show-20251012-p5n1u9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s tricky’: Why this jazz legend compares his art to table tennis",
    "publish_date": "Mon, 13 Oct 2025 12:23:43 +1100",
    "category": "entertainment",
    "authors": [
      "Lenny Ann Low",
      "John Shand"
    ],
    "text": "The song You Only Live Twice (from the James Bond film of the same name) would have more kitsch quotient than improvising potential to most ears. Not Bill Frisell.\n\nThe one constant in the work of the jazz guitarist – a peer of John McLaughlin, Pat Metheny and John Scofield – has been eclecticism, reflecting both his diverse childhood tastes and ever-expanding horizons as a player and composer.\n\nBill Frisell maintains a connection to a child-like sense of wonder. Credit: Carole D’Inverno\n\n“Part of it is just being more open to whatever it is that I’ve heard at any moment in my life,” he says via Zoom. “When I was younger, I was much more worried about what people would think was cool or fashionable or whatever, and as I’ve gotten older, I couldn’t care less about that. It’s more about what touches me, and just putting it out there.”\n\nNot only can Frisell still harness the remembered impact of the Bond film on his young self, he also appreciates the song’s inherent craft. “The closer you look at some of these things,” he observes, “the deeper it gets. Because it was popular doesn’t mean it was bad.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/queensland/lost-and-luxe-11k-bvlgari-necklace-black-box-and-plane-seats-in-brisbane-airport-auction-20251013-p5n219.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lost and luxe: $11k Bvlgari necklace, black box and plane seats in Brisbane Airport auction",
    "publish_date": "Mon, 13 Oct 2025 12:10:00 +1100",
    "category": "finance",
    "authors": [
      "Marissa Calligeros"
    ],
    "text": "Laptops, phones, speakers, cameras, gaming consoles and sunglasses are among the most common items left behind in airports.\n\nNot so common is a Bvlgari 18k gold diamond necklace valued at $11,000.\n\nThe star item at this year’s Brisbane Airport auction: a Bvlgari 18k gold diamond necklace valued at $11,000. Credit: Brisbane Airport\n\nYet, the rare necklace and more than 800 other items are now up for grabs at Brisbane Airport’s lost property auction.\n\nBrisbane Airport holds an auction of lost items once a year, with the proceeds going to children’s charities in Queensland.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/is-the-taco-trade-still-alive-after-trump-s-latest-tariff-tirade-20251013-p5n1yy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "As tensions rise, is the TACO trade still alive?",
    "publish_date": "Mon, 13 Oct 2025 12:01:26 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Perhaps of more significance than the detail of either side’s complaints of the other’s recent actions, however, is a looming meeting of Trump and China’s Xi Jinping in South Korea later this month. That meeting, at the Asia Pacific Economic Cooperation summit, is planned for November 1. It is instructive that Trump’s threatened tariff increase – on top of the existing effective rate of close to 40 per cent – wouldn’t occur until November 1, which is the scheduled finishing date for the summit. The core of Beijing’s barrage of new trade restrictions also wouldn’t be implemented until after the summit. ‘Don’t worry about China, it will all be fine! Highly respected President Xi just had a bad moment.’ Donald Trump on Truth Social That could suggest that China is seeking leverage for those discussions, deploying its most powerful trade weapon -- its stranglehold on the critical rare earths sector -- to demonstrate that Xi will be negotiating from a position of strength, rather than one of vulnerability.\n\nIt was China’s imposition of restrictions on rare earths and rare earth magnets to the US earlier this year that caused the Trump administration to walk back their 145 per cent tariff rate on imports from China in April (which China had responded to with a 125 per cent tariff of its own) at the Geneva negotiations. Within days of those restrictions being imposed, US auto companies were shutting down plants. Loading Rare earths and magnets are vital to many industries, most notably defence manufacturers, aircraft manufacturers, chipmakers and auto companies. With China supplying about 70 per cent of the world’s rare earths mining, about 90 per cent of their separation and processing, more than 90 per cent of magnet manufacturing and about 80 per cent of the world’s battery cell production, it has an extraordinary powerful hand to play in response to Trump’s tariffs.\n\nTrump announced, on social media as usual, his response to China’s actions, after writing that “some very strange things are happening in China! They are becoming very hostile.” Interestingly, though, his response was surprisingly temperate. Asked later what would happen if China unwound the new export controls, he said: “We’re going to have to see what happens. That’s why I made it November 1 (after the scheduled meeting).” Trump, who said he would go to South Korea regardless of what China did, also posted another comment that lacked his usual aggression and, indeed, was placatory. “Don’t worry about China, it will all be fine! Highly respected President Xi just had a bad moment. He doesn’t want Depression for his country, and neither do I. The USA wants to help China, not hurt it!!!.” When Trump announced his “Liberation Day” tariffs on everyone in April, financial markets revolted and Trump was coerced into deferring their introduction. It took until August before they were in place.\n\nInvestors saw that as an example of the “TACO” trade (short for Trump Always Chickens Out). On Friday, they revolted again, with the US sharemarket down 2.7 per cent (the tech-heavy Nasdaq market was down 3.6 per cent) and shares in tech leaders like Nvidia and AMD hammered. Nvidia was down 5 per cent and AMD 8 per cent. Loading Oil prices fell heavily, the US dollar weakened, US bond yields tumbled and the cryptocurrency market tumbled 11.6 per cent – initially wiping out nearly $US500 billion of value – before recovering some of those losses over the weekend. Bitcoin tumbled about 9.5 per cent before recovering nearly half its losses. While Trump thinks China’s economy is vulnerable to US trade sanctions, as it is, China’s exports have held up surprisingly well despite a big slump in exports to America, which were down about 15 per cent in the first eight months of this year. Overall, its exports were up 5.9 per cent, as it exported more to South-East Asia, South America and to Europe.\n\nBeijing also has the ability, which it has so far not exploited, to boost domestic economic activity. Conversely, China knows that the Trump economy is faltering under the weight of the tariffs, with America’s inflation rate rising in tandem with higher unemployment. The US government has been shut down, Trump has threatened (more) mass sackings of government employees and some of the administration’s most high-profile policies are increasingly unpopular. Unlike Xi, Trump has to worry about politics, with next year’s midterm elections creating the prospect that the Democrats could seize control of the House. Trump can threaten higher tariffs (and China can respond with higher tariffs of its own), or more bans on exports of things like semiconductors or aircraft parts, but Xi is insulated from their impacts on his economy.\n\nTrump doesn’t (yet?) have the ability to ignore the repercussions of his policies for Americans or the US economy. The reactions of US financial markets are also far more significant for Trump than anything China’s markets might do for Xi. Loading That’s probably why US markets’ response this week could be important. If they bounce back, it will be because investors believe the TACO trade is alive. If they were to continue to slump, the pressure on Trump to revive that trade would mount. In the lead-up to the first face-to-face meeting of Trump and Xi in six years, both sides were manoeuvring for leverage. Trump was (misleadingly) boasting of the strength of the US economy, the power of his tariffs and America’s ability to harm China’s economy.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/300km-h-in-near-darkness-bathurst-1000-drivers-detail-scary-final-stages-20251013-p5n1xz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "300km/h in near darkness: Bathurst 1000 drivers detail ‘scary’ final stages",
    "publish_date": "Mon, 13 Oct 2025 11:59:06 +1100",
    "category": "sports",
    "authors": [
      "Robert Dillon"
    ],
    "text": "New Zealand young gun Matt Payne has set his sights on the Supercars championship after winning what has been described as the greatest Bathurst 1000 of all time on Sunday.\n\nPayne and veteran co-driver Garth Tander prevailed in an epic finish on a day of carnage, after persistent rain transformed the Mt Panorama circuit into an ice rink mid-race.\n\nAfter almost seven hours of racing, four seconds separated the first three placegetters. Six of the 27 starters were unable to finish, either crashing out or suffering mechanical failure.\n\nPayne emerged with his first Peter Brock Trophy, while for Tander it was a sixth victory at the Australian motorsport mecca. Both agreed it was a wild ride but were thrilled to win a race that will be remembered for decades.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/property/news/melbourne-family-splash-millions-for-harry-triguboff-s-holiday-high-rise-20251013-p5n1yb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Melbourne family splash millions for Harry Triguboff’s holiday high-rise",
    "publish_date": "Mon, 13 Oct 2025 11:56:50 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Melbourne family has splashed $11 million on the two-level Main Beach penthouse of Australia’s second-richest man – outmuscling two local bidders and paying well above reserve in a fast and furious auction on Saturday.\n\nPerched atop the iconic Silverton building at 51/3510 Main Beach Parade, the 918-square-metre apartment is among the largest on the Gold Coast.\n\nThe penthouse boasts one of Queensland’s largest private rooftop pools, three en suite bedrooms, wraparound balconies and a private lift.\n\nIt has long been the Gold Coast base of Harry “High-Rise” Triguboff – who paid just $2.6 million for it 35 years ago.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/brisbane-airports-annual-lost-property-auction-20251013-p5n21y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane Airport's annual lost property auction",
    "publish_date": "Mon, 13 Oct 2025 11:55:31 +1100",
    "category": "finance",
    "authors": [],
    "text": "Brisbane Airport's annual lost property auction\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/goodfood/nsw-good-food-guide/good-food-guide-2026-sydney-s-top-10-bars-20251007-p5n0rw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Good Food Guide 2026: Sydney’s top 10 bars",
    "publish_date": "Mon, 13 Oct 2025 11:54:11 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Collection\n\nGood Food Guide 2026: Sydney’s top 10 bars\n\nOur annual list of the best spots for a night out with cocktails, from deathly cold martinis to Ice Magic Old Fashioneds.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/national/hawthorn-man-takes-law-into-his-own-hands-after-break-in-20251013-p5n1z3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hawthorn man takes law into his own hands after break in",
    "publish_date": "Mon, 13 Oct 2025 11:54:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "Hawthorn man takes law into his own hands after break in\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://au.finance.yahoo.com/news/better-targeted-labor-tinkers-big-014810323.html",
    "title": "'Better targeted': Labor tinkers on big super accounts",
    "publish_date": "2025-10-13T01:48:10Z",
    "category": "finance",
    "authors": [
      "Sun October At Pm",
      "Min Read"
    ],
    "text": "Plans to increase taxes on large superannuation balances will be refined after the federal government's initial proposal was criticised, especially by high net worth individuals.\n\nLong-touted reforms to double the tax rate to 30 per cent on super accounts above $3 million will remain in place, but a second threshold will be created for balances above $10 million, which will be taxed at 40 per cent.\n\nThe thresholds will also be indexed, following concerns the taxes would apply to more people over time due to bracket creep.\n\nTreasurer Jim Chalmers has passed off the changes as more targeted. (Mick Tsikas/AAP PHOTOS)\n\nUnrealised capital gains will also no longer be captured by the changes, which will come into effect from July 2026.\n\nAbout 80,000 Australian have super accounts holding $3 million or more, and currently pay the standard 15 per cent concession rate.\n\nDr Chalmers said the changes would make the super system fairer.\n\n\"As treasurer and as a government we always try to take feedback seriously,\" he told reporters in Canberra on Monday.\n\n\"We always try to find the best way through.\n\n\"We found another way to satisfy the same objectives.\n\n\"It means a fairer superannuation system from top to bottom.\"\n\nThe government will also increase the low-income super tax offset payment from $500 to $810.\n\nWhile Labor had floated changes to super taxes two years ago, the proposed legislation has never been introduced into federal parliament due to opposition from the coalition and the Greens.",
    "source": "Yahoo",
    "cluster_id": 6
  },
  {
    "url": "https://au.news.yahoo.com/new-zealand-mums-revelation-about-affordable-australia-as-record-numbers-cross-the-ditch-rarely-seen-014322966.html",
    "title": "New Zealand mum's revelation about 'affordable' Australia as record-numbers cross the ditch: 'Rarely seen'",
    "publish_date": "2025-10-13T01:43:22Z",
    "category": "finance",
    "authors": [],
    "text": "A New Zealand mum who recently relocated her family to Australia has revealed the reason behind the move, as a migration exodus sees thousands of Kiwis bid farewell to the island nation.\n\nGeorgia Hobden, 23, and her fiancé James have joined hordes of New Zealanders in search of better opportunities overseas, with many lured to Australia with the promise of greater job opportunities, higher wages and a lower cost of living.\n\nGeorgia told Yahoo News that while she adores her home country, she became \"quite unhappy\" living pay cheque to pay cheque as the country's cost of living crisis spiralled out of control. After making the move to Cairns, in Queensland in August, she and James haven't looked back.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"New Zealand has become a place where the cost of living outweighs the good things, which has led to a lot of people moving over to Australia,\" she told Yahoo News, explaining \"nobody has money\" back home, adding she knows many Kiwis who have made the move and have \"zero regrets\".\n\nGeorgia and James moved their family to Australia in August after becoming 'quite unhappy' in New Zealand. Source: Supplied\n\nEven before having a baby, Georgia admits she was \"barely\" able to save any money, and after giving birth, it got even harder to make ends meet.\n\n\"We found ourselves at the start of the year quite unhappy,\" she said. The family were forced to decide between housing, petrol and groceries and having fun experiences as a family.\n\n\"After becoming older and having a family of my own, upon reflection, I knew I always wanted to start a new life in Australia or at least give it a go,\" she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAfter looking up locations online, they were stunned by the beautiful scenery of Cairns in Far North Queensland and decided to make the move.\n\n\"We did our in-depth research on the cost of living and couldn’t believe how affordable it was compared to NZ,\" she said.\n\nJames, a qualified mechanic, would be able to earn \"almost double\" what he did in New Zealand.\n\nAussies 'embracing slow life' compared to New Zealand\n\nGeorgia and James sold up all of their belongings and booked flights to Cairns, and made the move two months ago.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhile at first it was difficult arriving in a new country, she said she instantly felt \"safety and warmth\". She even managed to secure a rental and a job for James after posting on a local community Facebook.\n\n\"The amount of help we received from strangers has been overwhelming,\" she said. \"The community was so supportive, and that showed us how important connection is in Cairns compared to New Zealand.\n\nGeorgia said she was astounded by the differences in lifestyle in Australia compared to back home. \"It's like money isn't the only thing to live for,\" she said.\n\n\"The esplanade was full of families having picnics, strangers singing, people actually embracing life slowly rather than technology. That was rarely seen in Hamilton, everyone was very go, go, go,\" she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAlong with the increase in wages, the cost of living feels \"affordable\" in Cairns compared to Hamilton.\n\n\"Some things may match the prices in New Zealand, but because you are getting paid more, it’s actually achievable.\n\n\"Things we have noticed that are cheaper are fuel, rent, nappies and the majority of food,\" she explained.\n\nNew Zealand citizen exodus reaches highest level in 13 years\n\nIn August, Statistics New Zealand revealed citizens leaving the country had hit the highest levels in 13 years.\n\n71,800 citizens left the country in the year that ended June 2025, up from the 67,500 in the previous 12-month period.\n\nNew Zealand faces tough economic conditions, which analysts blame on low productivity and policy missteps.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nEconomists and analysts have said New Zealanders, stung by fewer job opportunities and the cost of living, are looking to move to neighbouring Australia, Britain and elsewhere.\n\nMichael Gordon, senior economist at Westpac, said in January that work opportunities were one of the main drivers of people leaving the country.\n\n\"It’s about work opportunities, especially here (New Zealand) versus Australia. Australia’s economy is still running reasonably strongly,\" Gordon said. “There are more opportunities over there now, so we are seeing quite high outflows of Kiwis.”\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 37
  },
  {
    "url": "https://au.news.yahoo.com/tested-ve-visited-dentist-013207415.html",
    "title": "Get tested if you’ve visited this dentist",
    "publish_date": "2025-10-13T01:32:07Z",
    "category": "lifestyle",
    "authors": [],
    "text": "Patients of a Sydney dentist have been urged to get tested after they were potentially exposed to deadly-blood borne diseases.\n\nThe Dentist Council of NSW suspended dentist Safuan Hasic and closed his Mortdale dental surgery after authorities found poor cleaning and inadequate sterilisation left patients at risk of being exposed to HIV, hepatitis B and hepatitis C.\n\nNSW Health identified a small number of patients treated at the practice and is contacting them with health advice, but a large proportion of his patients are unknown to NSW Health and cannot be contacted.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Hasic was the sole dental practitioner at a surgery located at 70 Victoria St, Mortdale, in Sydney’s south.\n\nPeople have been warned not to seek dental treatment from Sydney dentist Safuan Hasic. Picture: Supplied\n\nPeople have been warned not to seek dental treatment from Mr Hasic while he is suspended and his surgery is closed.\n\nSouth Eastern Sydney Public Health Unit director Vicky Sheppeard said while the potential risk of infection was low, blood-borne viruses could have serious health impacts.\n\n“Any current or former patients of Mr Hasic should see their GP as soon as possible and ask to be tested for blood-borne viruses as a precautionary measure,” Dr Sheppeard said.\n\n“Blood-borne viruses can be spread between clients on dental instruments where there isn’t stringent infection control.\n\nNSW Health is attempting to contact patients who have potentially been exposed to hepatitis. Picture: Supplied\n\n“People infected with blood-borne viruses may not show symptoms for many years, so it is important to be tested to see if there is silent infection. There are effective treatments for hepatitis B, hepatitis C and HIV.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nNSW Health advised people who have been tested for hepatitis B, hepatitis C and HIV after their last visit with Mr Hasic to check with their GP if more tests are required, even if results were negative.\n\nMr Hasic’s patients can contact their local public health unit on 1300 066 055 or access an information sheet on the NSW Health website health.nsw.gov.au/Infectious/alerts/Pages/mortdale-hasicfaqs.aspx.",
    "source": "Yahoo",
    "cluster_id": 0
  }
]