[
    {
        "url": "https://www.9news.com.au/national/accc-businesses-card-surcharges-explained/52785c4d-9db2-4046-bfd1-22560724e642",
        "title": "Shops put on notice about common illegal practice",
        "publish_date": "Mon, 28 Apr 2025 00:30:00 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Australia's consumer watchdog is urging businesses to ensure card surcharges﻿ are in line with the law.\n\nThe Australian Competition and Consumer Commission (ACCC) is encouraging businesses to review their surcharges to make sure the cost doesn't exceed the cost of accepting card payments.\n\nAny card payment surcharges that apply should also be ﻿adequately disclosed up front.\n\nThe Australian Competition and Consumer Commission (ACCC) is encouraging businesses to review their surcharges to make sure the cost doesn't exceed the cost of accepting card payments. (Reddit)\n\n\"Businesses need to ensure their customers know about any card payment surcharges upfront, and that they are only charging what it costs them to accept those card payments,\" ACCC Deputy Chair Mick Keogh said.\n\nAustralian Consumer Law prohibits businesses from misleading people about the prices they charge and charging a card payment surcharge that is excessive.\n\n﻿This year the ACCC will focus on educating businesses on their obligations to help them to comply with the laws.\n\nThe top 10 jobs actually making money in cost-of-living crisis View Gallery\n\n\"We understand that small businesses need to be across a lot of information to comply with all of the laws that apply to their business,\" Keogh said.\n\n\"However, charging excessive surcharges and not being upfront with customers about pricing can result in small businesses losing customers.\n\n\"It is important for small businesses to ensure they understand their obligations and check their costs of acceptance to know what amounts they can legally charge their customers as a payment surcharge, as well as reviewing how they inform customers of their prices, including any applicable surcharges.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/man-dies-after-squabble-near-brisbane-cbd/5d5a5b1b-ef15-46ff-a6e1-84ebd9204d1e",
        "title": "Police investigating sudden death of man in central Brisbane",
        "publish_date": "Sun, 27 Apr 2025 22:12:54 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "P﻿olice are investigating the death of a man near the Brisbane central business district overnight.\n\nP﻿olice are investigating the death of a man near the Brisbane central business district overnight.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/world-news-cnn-poll-has-donald-trumps-approval-lower-than-any-president-in-at-least-seven-decades/6583de94-bb15-4e89-87bd-619dc3271176",
        "title": "Trump hits a new low. It hasn't happened in seven decades",
        "publish_date": "Sun, 27 Apr 2025 21:43:24 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Donald Trump won back the Oval Office and took charge of the government amid the strongest poll numbers of his political career, but as the 100-day mark of his presidency approaches, Americans' views of what he's done so far have turned deeply negative, a new CNN poll has found.\n\nTrump's 41 per cent approval rating is the lowest for any newly elected president at 100 days dating back at least to Dwight Eisenhower – including Trump's own first term.\n\nApproval of Trump's handling of the presidency is down 4 points since March, and 7 points lower than it was in late February. Just 22 per cent say they strongly approve of Trump's handling of the job, a new low, and about twice as many say they strongly disapprove (45 per cent).\n\nDonald Trump has taken a whack in the latest polling figures, as more Americans appear to grow concerned about his policies. (AP)\n\nSince March, Trump has suffered notable drops in approval from women and Hispanic Americans (down 7 points in each group to 36 per cent among women and 28 per cent among Hispanics).\n\nPartisan views of Trump remain broadly polarised, with 86 per cent of Republicans approving and 93 per cent of Democrats disapproving. But among political independents, the president's approval rating has dipped to 31 per cent, matching his first-term low point with that group and about the same as his standing with them in January 2021.\n\nThe poll finds the president underwater and sinking across nearly all major issues he's sought to address during his time in office, with the public's confidence in his ability to handle those issues also on the decline.\n\nTrump's approval ratings on economic issues have dropped notably since early March as the rollout of his tariff plan led to volatility in the stock market and worries about rising prices.\n\nOn inflation, approval is down 9 points to 35 per cent, and on tariffs themselves, it's down 4 points to 35 per cent. His marks for handling the economy are down 5 points to a career-low of 39 per cent; he hit his previous low once in his first term and again this March).\n\nOnly about half (52 per cent) express confidence in his ability to deal with the economy, down 13 points compared with a December CNN poll.\n\nHouse Minority Leader Hakeem Jeffries leads a sit-in on the steps of the Capitol in Washington, DC. (AP)\n\n\"I'm disappointed. I didn't vote for him. I was going to give him the benefit of doubt, because I figured, you know, he could do things to help the economy and … further disappointment,\" said a 55-year-old Virginia resident who identifies as an independent and participated in the poll. She has worked for the federal government for more than two decades and asked that her name not be used.\n\nFollowing his far-reaching efforts to reshape the federal government's workforce, Trump has lost ground on approval ratings for managing the federal government (42 per cent approve, down 6 points since March) and only 46 per cent express confidence in him to appoint the best people to office, down 8 points since December. Less than half (43 per cent) see Trump's actions as a necessary shake-up in Washington, while most (57 per cent) say his approach to the presidency is unnecessarily putting the country at risk.\n\nDerek Steinmetz, a Democrat from Wauwatosa, Wisconsin, said he was most concerned by Trump's \"overarching disregard for the rule, and the norms, and the structure of our government. It was a concern the first term, but it's much worse this time around because there are fewer guardrails in place.\"\n\nTrump's moves on foreign affairs – which have included a more friendly posture toward Russia in its war with Ukraine and ending many foreign aid programs – are also seeing majority disapproval (39 per cent approve, 60 per cent disapprove). Half say they have a lot or some confidence in his ability to handle foreign affairs, down from 55 per cent before he took office.\n\nEven on immigration, an issue where Trump had outperformed his first-term high by 7 points earlier this year, the poll finds declining approval ratings and diminished confidence in Trump's actions. Overall, 45 per cent approve now, down 6 points from March, and 53 per cent express confidence in his ability to deal with it, down from 60 per cent in December.\n\nTrump earns narrowly positive ratings on only one issue tested in the poll: his handling of issues related to gender identity and trans people. Overall, 51 per cent approve of his handling of that matter, including 90 per cent of Republicans, 48 per cent of independents and 16 per cent of Democrats.\n\nTrump and Zelenskyy met on the sidelines of Pope Francis's funeral. Foreign policy is an area that has seen increased disapproval. (Ukrainian Presidential Press Office)\n\n\"I'm actually quite glad he said that there's only male and female. I was actually quite glad when that came out, when he put that into law, that there's only male and there's only female, that there's no binary, he, she, they. There's no they,\" said Lisa Munson, a Maryland mother-of-three who voted for Trump, when asked what she considers to be Trump's biggest accomplishment.\n\nTrump's efforts at shaping arts, culture and American history, though, are far less popular, with 64 per cent considering it inappropriate for him to take actions like seizing control of the Kennedy Center for the Performing Arts and seeking changes in exhibits at Smithsonian Institution museums, an effort he delegated in part to Vice President JD Vance.\n\nVance matches Trump's 41 per cent job approval rating overall in the poll, with 58 per cent disapproving. Neither Trump nor Vance is viewed favourably by most Americans. Just 40 per cent say they have a favourable view of the president and 34 per cent a favourable view of Vance.\n\nOverall, Americans' confidence in Trump to use the power of the presidency responsibly (46 per cent confident, down 8 points) and to provide real leadership for the country (50 per cent confident, down 9 points) have dropped sharply since December. Trump has issued a slew of executive orders directing changes to government practices and policy that have faced myriad challenges in court.\n\n\"I'm not a big fan of these executive orders that Trump and all the other presidents issue constantly. In Trump's case, I think that he goes overboard on these executive orders, and that's why a lot of them get shot down by the courts, you don't have the authority to do that,\" said George Mastrodonato, a Trump voter and partially retired lawyer who lives in Santa Fe, New Mexico and participated in the poll.\n\n\"I wish he would be a little more discreet and focus on the executive orders that he writes and issues that he could win in court. He seems to be like Yosemite Sam, you know? Blasting off with two guns in both hands, and some of them stick and some of them don't.\"\n\nJust over half of Americans (52 per cent), including majorities of both Democrats and Republicans, say Trump's second presidency will fundamentally change the country in a lasting way. A little more than a third (36 per cent) say any significant changes Trump makes will fade once he leaves office, and only 12 per cent say Trump's second term will not result in significant changes to the country.\n\nCelebrity Trump supporters now turning on the US president View Gallery\n\nStill, Americans are closely split on whether Trump has kept important campaign promises. Just shy of half, 48 per cent, say he's doing a good job of it, 51 per cent a bad job – numbers that closely mirror this point in his first term. A 55 per cent majority say he's taken at least some actions to effectively address the nation's problems, though only 28 per cent believe he's done things that have already started to help address the country's problems.\n\nMastrodonato, the Trump voter from New Mexico, also largely sees Trump as keeping his promises. \"He's doing what he said he would do. Some of his approaches, I would take a different approach, but, you know, he's Donald Trump so, he's going to do whatever he wants to do.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/iran-explosion-president-masoud-pezeshkian-visits-those-injured-in-port-blast/10ee61b7-ceb2-482f-b2f5-862af4559b9c",
        "title": "Photos reveal apocalyptic scene after Iran blast kills 40",
        "publish_date": "Sun, 27 Apr 2025 15:59:44 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Iran's president has visited those injured in a huge explosion that rocked one of the Islamic Republic's main ports , a facility purportedly linked to an earlier delivery of a chemical ingredient used to make missile propellant.\n\nThe visit on Sunday by President Masoud Pezeshkian came as the toll from Saturday's blast at the Shahid Rajaei port outside of Bandar Abbas in southern Iran's Hormozgan province rose to 40 with about 1,000 others injured.\n\nWhile Iran's military sought to deny the delivery of ammonium perchlorate from China, new videos emerged showing an apocalyptic scene at the still-smouldering port.\n\nFirefighters work to extinguish the fire, Sunday, April 27, 2025, after a massive explosion and fire rocked a port near the southern port city of Bandar Abbas, Iran on Saturday. (AP Photo/Meysam Mirzadeh/Tasnim News)\n\nA crater that appeared metres deep sat surrounded by burning smoke so dangerous that authorities closed schools and businesses in the area.\n\nContainers appeared smashed or thrown as if discarded toys, while the burned carcasses of trucks and cars sat around the site.\n\n\"We have to find out why it happened,\" Pezeshkian said during a meeting with officials aired by Iranian state television.\n\nAuthorities described the fire as being under control, saying emergency workers hoped that it would be fully extinguished later Sunday.\n\nOvernight, helicopters and heavy cargo aircraft flew repeated sorties over the burning port, dumping seawater on the site.\n\nSatellite pictures taken on Sunday by Planet Labs PBC and analysed by The Associated Press showed a huge plume of black smoke still over the site.\n\nA helicopter drops water on the fire, Sunday, April 27, 2025, after a massive explosion and fire rocked a port near the southern port city of Bandar Abbas, Iran on Saturday. (AP Photo/Meysam Mirzadeh/Tasnim News)\n\nA revolutionary Guard firefighting airtanker drops water on the fire, Sunday, April 27, 2025, after a massive explosion and fire rocked a port near the southern port city of Bandar Abbas, Iran, on Saturday. (AP Photo/Mahdi Nori/Fars News agency)\n\nProvincial Governor Mohammad Ashouri gave the latest death toll, Iranian state TV reported. Pir Hossein Kolivand, head of Iran's Red Crescent society, said that only 190 of about 1000 injured remained hospitalised on Sunday, according to a statement carried by an Iranian government website. The governor declared three days of mourning.\n\nPrivate security firm Ambrey says the port received missile fuel chemical in March.\n\nIt was part of a shipment of ammonium perchlorate from China by two vessels to Iran, first reported in January by the Financial Times .\n\nThe chemical used to make solid propellant for rockets was going to be used to replenish Iran's missile stocks, which had been depleted by its direct attacks on Israel during the war with Hamas in the Gaza Strip.\n\nSmoke rises in background next to the gutted remains of a truck, Sunday, April 27, 2025, after a massive explosion and fire rocked a port near the southern port city of Bandar Abbas, Iran on Saturday. (AP Photo/Meysam Mirzadeh/Tasnim News)\n\nShip-tracking data analysed by the AP put one of the vessels believed to be carrying the chemical in the vicinity in March, as Ambrey said.\n\n\"The fire was reportedly the result of improper handling of a shipment of solid fuel intended for use in Iranian ballistic missiles,\" Ambrey said.\n\nIn a first reaction on Sunday, Iranian Defense Ministry spokesman General Reza Talaeinik denied that missile fuel had been imported through the port.\n\n\"No sort of imported and exporting consignment for fuel or military application was (or) is in the site of the port,\" he told state television by telephone.\n\nIn this photo released by the Iranian Presidency Office, smoke rises in the sky on Sunday, April 27, 2025 after a massive explosion and fire rocked a port near the southern port city of Bandar Abbas, Iran, on Saturday. (Iranian Presidency Office via AP)\n\nFirefighters try to extinguish the fire, Sunday, April 27, 2025, after a massive explosion and fire rocked a port near the southern port city of Bandar Abbas, Iran, on Saturday. (Mahdi Nori/Fars News Agency via AP)\n\nHe called foreign reports on the missile fuel baseless — but offered no explanation for what material detonated with such incredible force at the site. Talaeinik promised authorities would offer more information later.\n\nIt's unclear why Iran wouldn't have moved the chemicals from the port, particularly after the Beirut port blast in 2020 .\n\nThat explosion, caused by the ignition of hundreds of tons of highly explosive ammonium nitrate, killed more than 200 people and injured more than 6000 others.\n\nHowever, Israel did target Iranian missile sites where Tehran uses industrial mixers to create solid fuel — meaning potentially that it had no place to process the chemical.\n\nSocial media footage of the explosion on Saturday at Shahid Rajaei saw reddish-hued smoke rising from the fire just before the detonation.\n\nContainers burn, Sunday, April 27, 2025, after a massive explosion and fire rocked a port near the southern port city of Bandar Abbas, Iran, on Saturday. (AP Photo/Meysam Mirzadeh/Tasnim News)\n\nThat suggests a chemical compound being involved in the blast, like in the Beirut explosion.\n\nMeanwhile on Sunday, Russian President Vladimir Putin deployed several emergency aircraft to Bandar Abbas to provide assistance.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/pope-francis-death-worldwide-mourning-rites-and-rituals-begin-following-the-death-of-pope-francis/9ffbd6e8-682f-4983-9e48-aa49a6eca4ef",
        "title": "Pope Francis's tomb seen for first time in images released by Vatican",
        "publish_date": "Wed, 23 Apr 2025 01:52:09 +0000",
        "category": "finance",
        "authors": [
            "April"
        ],
        "text": "1 of 74 Attribution: Graphic: Polly Hanning\n\nNew images of the Pope's tomb have been released after the world reacted quickly to the news of the death of Pope Francis at age 88 on Easter Monday.\n\nWithin hours of hearing of his passing, mourners flocked to churches to pay their respects to the leader.\n\nThe death of a pope sets in motion a series of carefully orchestrated rites and rituals well before the conclave to elect his successor begins.﻿\n\nThey involve the certification of death and public display of his body for the faithful to pay their respects, followed by the funeral and burial.\n\nSee all the photos here.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/world-news-german-finger-wrestling-fingerhakeln-64th-championship/19481334-0d74-4c7b-b36c-29513e7c9458",
        "title": "Men launch over tiny tables in the ultimate battle of the strongest finger",
        "publish_date": "Sun, 27 Apr 2025 22:25:38 +0000",
        "category": "sports",
        "authors": [
            "April"
        ],
        "text": "1 of 10 Attribution: AP\n\nMen in short leather pants and embroidered suspenders risked dislocated digits over the weekend as they vied for the top prize at Germany's championship in the sport of fingerhakeln, or finger wrestling.\n\nAbout 180 competitors took part in Sunday's 64th German championship in Pang, about an hour's drive south-west of Munich.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/soccer-brawl-sydney-fairfield-kids-match/9a104563-951b-4893-9250-f45d19c2cfc0",
        "title": "Five charged after brawl at Sydney U7s football game",
        "publish_date": "Sun, 27 Apr 2025 06:30:37 +0000",
        "category": "sports",
        "authors": [
            "Apr"
        ],
        "text": "Five people have been charged and an investigation is under way after a brawl broke out at a children's football game in Sydney's south-west.\n\nTwo people were injured with the matter now referred to the local football judiciary.\n\nOn Saturday morning at Fairfield, the under-sevens match between Marconi Juniors and South West Wanderers at Prospect View Park turned sour on the sidelines.\n\nFive people have been charged and an investigation is under way after a brawl broke out at a children's football game in Sydney's south-west. (Nine)\n\n9News understands a call from the referee upset one of the mothers.\n\nA second mum intervened and a brawl broke out.\n\nOne local said she \"heard a lot of screaming\" from her house.\n\nA man in his 20s and a woman were treated for minor injuries.\n\nPolice were called and five people were arrested, with two women and two men charged with affray and a third man charged with offensive conduct.\n\nThey'll all front court in May.\n\nThe Southern Districts Football Association told Nine News.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/gp-shortage-rural-communities-queensland-federal-election-2025/105205838",
        "title": "Towns with no doctors say election health promises a 'bandaid' approach",
        "publish_date": "Mon, 28 Apr 2025 01:31:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "For those living in the small busy rural town of Yarraman, 180 kilometres north-west of Brisbane, medical help can be hard to come by if something goes wrong.\n\nThe town of about 1,200 people has been without a regular doctor since 2018 and the nearest GP in Blackbutt, a 30-minute drive away, has closed its books to new patients.\n\nYarraman farmer and yoga teacher Jane Hodgekinson said residents were travelling long distances to see a doctor in Kingaroy, Toowoomba or even Brisbane or opting out of general health check-ups because it was too difficult to access without public transport.\n\nYarraman is on the intersection of the D'Aguilar and New England Highways. (Supplied: Jane Hodgekinson)\n\nMs Hodgekinson said many people also could not afford to take a day out of their schedule to travel out of town for a general check-up.\n\n\"If you can get to the surrounding towns, then they've often closed their books and not taking any new patients, so it's actually a bit of an issue because people put off their regular checks and making health a priority,\" she said.\n\n\"They end up with complex issues and that just compounds again.\"\n\nMs Hodgekinson said she travelled to Brisbane for her medical appointments in order to get consistent care but she was \"fortunate\" she could stay with family overnight, otherwise the trip would be costly.\n\nFive regional seats to watch Photo shows Kristy Alleson There are five contests in regional Australia that could influence the overall result of the federal election. Here's why they matter.\n\nRural Doctors Association of Australia chief executive Peta Rutherford said Yarraman was not the only community facing this \"real challenge\" of accessing medical support.\n\n\"When you're having to travel hundreds of kilometres to access a GP service, a lot of people actually choose to not go and have the service,\" she said.\n\n\"What that means is we often see them present to hospitals with really serious illness but something that could have been prevented and should have been managed in community.\"\n\nRoyal Flying Doctor Service Federation chief executive Emma Buchanan said more than 32,000 people across the country did not have access to a GP within a 60-minute drive.\n\nMore than 100,000 people do not have access to mental health resources.\n\n\"We know that people who live in very remote areas are likely to die 14 years earlier to their urban counterparts and that they're dying from causes that are largely preventable,\" she said.\n\nThe number of bulk billing GPs has dropped over the past five years, especially in rural areas. (ABC News: Maren Preuss)\n\nNeed more than a 'bandaid approach'\n\nAs the federal election campaign enters its final week, Ms Hodgekinson said she was disappointed rural health had not been a major talking point and believed party proposals were a \"bandaid approach\".\n\n\"I actually think it needs a fair bit of leadership. I think it needs grassroots leadership but it also needs help to get there,\" she said.\n\n\"It's not going to happen without some investment in time as well as money.\"\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nBoth major parties have put forward policies to tackle GP shortages, with the Coalition promising 200 training places specifically aimed at regional, rural and remote health.\n\nLabor has pledged to expand the GP workforce to 2,000 a year from 2028, as part of its $8.5 billion bulk-billing pledge.\n\nSwingers: How to win an election Photo shows The word Swingers lit up as a neon sign followed by how to win an election. The ABC iview logo is below it. Australia has never had more swinging voters. Casey Briggs takes stock of how we vote and how that's changing politics. Stream now on ABC iview.\n\nMs Rutherford said there had been a lot of interest in graduates looking to specialise in general practice medicine in rural communities.\n\n\"It's not all doom and gloom,\" she said.\n\n\"What we need to do is make sure the system is ready to support these young doctors coming through and that we provide job opportunities for them and we provide an appropriate level of incentive and support to facilitate them relocating into our rural communities where we need them most.\"\n\nIt comes as Darling Downs Health Service hired the total 108 nursing graduates from the University of Southern Queensland last year to secure staff for the region.\n\nQueensland Health Minister Tim Nicholls said the state government had also committed to providing \"homegrown staff\" by employing 46,000 new staff into Queensland Health by 2032.\n\n\"We know we need more specialists and we need more doctors in our rural and regional areas and we believe that one of the best ways is a grow-your-own program,\" he said.\n\nTim Nicholls says the government will add 46,000 staff to Queensland Health by 2032. (AAP: Darren England)\n\nAll-in effort to keep doctors\n\nMs Rutherford said rural communities and all levels of governments needed to work together to retain doctors, whether that was councils providing housing opportunities, state government ensuring it supported recruitment and retention and the federal government providing supportive training pathways.\n\n\"It's something we may need to be a little bit innovative on,\" she said.\n\n\"If you want someone to move to your community and you want a medical service — that's a really important pillar to ensure you've got a vibrant and sustainable community — we need to look at how as a community do we attract these people and retain them in the longer term.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/truck-hearse-among-growing-number-of-funeral-vehicles/105114644",
        "title": "Personalised hearses rise in popularity for final farewells",
        "publish_date": "Mon, 28 Apr 2025 00:59:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Funeral home manager Chris Woonings says the use of a non-traditional hearse can be part of providing someone the right service.\n\nHe said his fully enclosed truck hearse was a world first and could be a fitting farewell.\n\nChris Woonings says the truck is an option for those who want something a bit different. (ABC Great Southern: Andrew Chounding)\n\nMr Woonings, who manages a funeral home in Albany, 400 kilometres south east of Perth, said he carried out a funeral with a hire truck, but with the area's inclement weather it became apparent there were changes that needed to be made.\n\n\"We had a coffin on the back and it rained really bad and the coffin got saturated,\" he said.\n\n\"I thought there's got to be a better way to do this and more respectful.\"\n\n'Show a person's character'\n\nMr Woonings tracked down a 1982 Kenworth and spent 12 months carrying out the fabrication work needed to adapt it for use as a hearse.\n\nThe truck hearse is a 1982 Kenworth. (ABC Great Southern: Andrew Chounding)\n\n\"It's quite an old truck, it's probably vintage now but it has been given a new life,\" he said.\n\n\"All types of people use it whether it's people that are truckies, ex-truckies, farmers or farmers' wives.\"\n\nHe said it had been operational for about six months and demand had equalled that of a standard hearse.\n\nChris Woonings decided an enclosed truck hearse was needed. (ABC Great Southern: Andrew Chounding)\n\n\"People still want a bit of respect and a bit of formality, but inside that formality, they still want to show a person's character a little bit more,\" he said.\n\n\"I think it's how you remember the funeral that counts.\n\n\"If you can remember it with them going out in a truck, blowing the air horn, something like that, or the grandkids can remember it, it puts more of a positive light on the funeral.\"\n\nThe truck hearse has been operational for about six months. (ABC Great Southern: Andrew Chounding)\n\nMore options for personal funeral\n\nAustralian Funeral Directors Association WA president Mark McKenzie said variations from the standard hearse were becoming more common.\n\n\"A lot of the funeral directors are trying to provide a point of difference and to provide options to their clients,\" Mr McKenzie said.\n\n\"Whether that's different at the service or just a different way for the coffin to be moved from the funeral home to the church or where the service is being held.\"\n\nChris Woonings says the use of a motorcycle as hearse is more common. (ABC Great Southern: Rosemary Murphy)\n\nMr Woonings has also added a Harley Davidson motorcycle with an enclosed carriage to his fleet.\n\n\"Once again a unique type of audience,\" he said.\n\n\" A lot of people may say, 'I love it, but that's not what my mother was or my father was, because they never rode a bike in their life'. \"\n\nModified vehicles\n\nIn Pambula, south of Sydney, Hammond Conversions creates customised hearses that are sent across the country.\n\nCo-owner Kim Hammond said they had worked with a variety of vehicles.\n\n\"We've got a Jaguar that's just about to go out the door, Fords, Holdens, the Hyundai Palisade is one that we're doing a few of now,\" she said.\n\nA Hyundai Palisade hearse produced by Hammond Conversions in New South Wales. (Supplied: Kim Hammond)\n\n\"What generally happens is a client will send us their vehicle, just their standard vehicle.\n\n\"We strip it out, we cut it in half, we manufacture all the strengthening, the new panels, all the wiring, all the panel beating, and then all the fit out of the inside.\"\n\nA custom Land Rover was used to transport the coffin of the Duke of Edinburgh at his funeral. (AP: Steve Parsons)\n\nPrince Philip also used a customised hearse.\n\nHe helped design the dark green Land Rover hearse that was used for his funeral.\n\nThe Duke of Edinburgh oversaw the modifications over a period of 18 years, and designed the open-top rear and special stops to secure his coffin in place.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/nt-lloyd-creek-housing-development-noonamah-ridge-intrapac/105206988",
        "title": "Proposal for 4,000 new Darwin homes relaunched years after rejection",
        "publish_date": "Mon, 28 Apr 2025 00:14:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "The company behind a controversial planned housing development in Darwin's rural area that was rejected due to local opposition has relaunched its bid to build thousands of homes on former pastoral land.\n\nMelbourne-based real estate developer Intrapac Property has written to Planning Minister Josh Burgoyne requesting an amendment to the Northern Territory’s planning scheme to allow a new development named Lloyd Creek Rural Village.\n\nThe proposal would see about 4,000 homes built on a site south of Humpty Doo, a rural area suburb 36 kilometres south of Darwin, in an area currently zoned for rural living.\n\nIt comes as the NT capital, like many Australian cities, is facing an ongoing shortage of housing, with a recent report showing the city's rental vacancy rate is just 0.6 per cent — well below the national average.\n\nLloyd Creek is being proposed by Melbourne-based developer Intrapac. (Supplied: Intrapac)\n\nIntrapac chief executive Maxwell Shifman said his vision for Lloyd Creek \"speaks to that local, rural character\".\n\n\"One of the things we're aiming to do here is really deliver some housing typologies and some lot types you haven't seen in the territory for a long time — really bringing it back to that sort of local, tropical-style housing on a slightly larger lot,\" he said.\n\nThe proposed site of the Lloyd Creek housing development is currently bushland. (ABC News: Sam Parry)\n\nIn 2014, Intrapac Property proposed another development on the same parcel of land — a precinct called Noonamah Ridge that would have featured 4,200 homes.\n\nThat proposal was rejected by former planning minister Eva Lawler in 2020, following opposition from residents and former local member of parliament Kezia Purick.\n\nMr Shifman said the new plan for Lloyd Creek Rural Village responded to previous community concern about potential impacts on the local rural lifestyle, and now proposed housing connected to town water instead of bores.\n\nNoonamah Ridge was rejected by the former NT Labor government. (Supplied: Intrapac)\n\n\"We've now got the Strauss Water Treatment Plant that's under construction and we'll be able to tap in and deliver potable water to the site, so that takes up one of the key criticisms of the proposal,\" Mr Shifman said.\n\nThe application also said the rural village's proposed land offerings would range from about a quarter-acre up to five acres, with no more than 1.5 dwellings per hectare on most of the site.\n\nDarwin now second-most-expensive capital for renters Photo shows A woman wearing a black t-shirt, standing next to a tall man, orange shirt, straw hat and eye-patch. Standing on front porch. Darwin, Australia's smallest capital city, has been ranked the country's second-most-expensive place to rent a house, along with Canberra.\n\nHowever, in two higher-density sections the proposal refers to as \"rural activity centres\", that number could be as high as 10 dwellings per hectare.\n\nMany residents in the surrounding area live on much larger acreage.\n\nOpposition to development remains\n\nMs Purick said the proposed Lloyd Creek village was the \"wrong kind of development\" for the rural area, and pledged to support other locals as they relaunched their fight against the proposal.\n\n\"They have stock animals, they have farming activities, they have mango orchards and the like, and that comes with certain activities,\" she said.\n\n\"Having small, urbanised blocks right across the road from you will bring a clash of cultures. There's no doubt about it.\n\n\"If Intrapac is so keen to have a presence in the territory, [it should] go and talk to the NT government about developing Weddell, which already has big chunks of major infrastructure in place.\"\n\nKezia Purick says the proposed Lloyd Creek development would clash with existing rural blocks in the area. (ABC News: Hamish Harty)\n\nWeddell — a proposed satellite city 30 kilometres south of Darwin — has been flagged as a potential development since 1984.\n\nLabor had plans to establish Weddell while in government in 2009, before the Country Liberal Party shelved the project after taking power in 2012.\n\nIn response, Mr Shifman said his company was not competing with Weddell.\n\n\"It's a very different offering. Weddell would need significant infrastructure upgrades before it's up and running,\" he said.\n\n\"It's not a simple matter of, 'there's land there, develop it'.\"\n\nMax Shifman says the proposal suits Darwin's rural area. (Supplied)\n\nIntrapac's application to the government is out for public feedback until May 16.\n\nNT locals unconvinced by Noonamah Ridge consultation Photo shows The proposed Noonamah Ridge development site The company behind the proposed Noonamah Ridge development in Darwin's rural area begins its charm offensive to win support.\n\nAsked whether he supported the proposal, Mr Burgoyne said it was \"important for consultation processes to run their course to ensure that community expectations are being met\".\n\n\"We promised to rebuild the territory economy and as the minister responsible for the Planning Act and NT Planning Scheme, I will not rule project proposals in or out until all information and necessary feedback has been considered,\" he said.\n\nIntrapac has estimated the Lloyd Creek Rural Village would inject about $3.5 billion into the NT economy during the construction phase and create about 300 ongoing jobs.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-04-28/banana-prawn-industry-preparing-for-worst-season-seafood/105210494",
        "title": "Fishers struggle to find banana prawns in ocean after rain comes too late",
        "publish_date": "Mon, 28 Apr 2025 00:14:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "It is the season of banana prawns in northern Australia, but trawler operators in the Gulf of Carpentaria say they are coming back to shore with not much in the nets.\n\nQueensland's late wet season devastated towns and agriculture across the state, and the latest victim is the banana prawn industry, which is grappling with the worst season many have ever seen.\n\nWhether consumers will feel the pinch is yet to be determined.\n\nBryan Van Wyk says he has not ever seen a banana prawn season this poor. (Supplied: Bryan Van Wyk)\n\nThat is because much of last year's bumper season is sitting in freezers across the country, according to Bryan Van Wyk, who manages Austral Fisheries' northern prawn division.\n\n\"There's still a lot of leftover prawn stock around on the market from previous big years,\" he said.\n\n\"We've got the worst of both worlds … a market that is reasonably full, which means lower prawn price, and the lowest productive season we've ever seen.\"\n\nCall to consumers\n\nPrawn sales tend to skyrocket twice a year — Christmas and Australia Day.\n\nBanana prawns are usually flushed into the Gulf of Carpentaria with the first downpour early in the year. (ABC Rural: Abbey Halter)\n\nAs this season's banana prawns hit the shelves, private Carpentaria and Northern Prawn Fishery trawler manager Greg Albert urged people to consider seafood as a protein source when grocery shopping, especially as steak prices had risen.\n\n\"The price of prawns has basically been the same for the last five years in the supermarkets, yet I think it's just the habits of the consumer,\" he said.\n\n\"They're more economical than some of the other proteins.\"\n\nGreg Albert wants more people to eat prawns to support the local industry. (Supplied)\n\nWhy the monsoonal nightmare?\n\nMr Van Wyk said Queensland's month-late wet season flushed out many of the prawns, leaving few for trawlers to snag.\n\n\"We're basically looking at probably one of the, if not the, worst banana prawn season start we've ever had in history,\" he said.\n\nBanana prawns typically settle into northern rivers, and the first downpour of rain during January or February flushes them into the Gulf, Mr Van Wyk said.\n\nBut since the big wet came later in March, many prawns failed to escape and became prey for other animals in the rivers.\n\nBanana prawn season in northern Australia runs from late March to mid June, but the 2025 season started late. (Supplied: Michele Burford)\n\nHe said the ones that did get out were smaller than ideal.\n\n\"It's incredibly tough, probably the toughest it's ever been,\" he said.\n\nMr Van Wyk said the season was likely to close early, and 20 per cent of the northern prawn fishery chose to not head out at all.\n\n\"We currently have the lowest amount of vessels that have ever participated in the northern prawn fishery banana season of all time,\" he said.\n\nFewer vessels are heading out into northern waters this year because prawn numbers are expected to be so low. (ABC North West Queensland)\n\nBut he was confident the tide would turn for the boom-and-bust industry.\n\n\"There's still a bright future ahead, we've just got to get to that bright future,\" he said.\n\nEmpty ocean, empty nets\n\nRaptis fleet manager Phil Robinson echoed Mr Van Wyk's sentiment and said he had not seen a worse season in 25 years.\n\n\"The late wet season has very much impacted the banana prawn season,\" he said.\n\nHe said the deluge in March was far too late to prompt any meaningful catches for fishers, and sizes were down, but the quality of prawns would remain high.\n\nPrawn fishers are concerned about the late wet season in the gulf. (Supplied: Austral Fisheries)\n\nMr Albert said the late wet season impacted the aggregations, and his catch so far was \"pretty average\".\n\n\"A lot of the product has been a couple of counts smaller than previous years,\" he said.\n\nHe said he had left one trawler out of the Gulf waters, with high fuel prices, lack of mother shipping and low sale prices all factors in the decision.\n\n\"We can only go out and catch what's there and try and get it to market in the best quality we can,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/cross-cultural-kids-in-australia/105067620",
        "title": "'Cross-cultural kids' on what it's really like to grow up in Australia",
        "publish_date": "Sun, 27 Apr 2025 23:38:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "For children of migrants, growing up in Australia often means living between two worlds.\n\n'Cross-cultural kids' Kevin Han and Muna Hamid were both born in Australia to migrant families but had very different childhoods: Kevin was raised in a tight-knit ethnic community, while Muna's family was more transient and had to actively build community wherever they went.\n\nNow as adults, they reflect on their identity-shaping experiences and share the struggles and strengths of their upbringings.\n\nKevin on growing up in a 'bubble'\n\nKevin Han says he and his family were \"new types of people\". (Supplied)\n\nKevin was born in the mid-90s, and lived in Western Sydney with his brothers and mother, who came from a refugee background.\n\n\"I had a very hardworking single mother who studied and worked and raised us as best as she could,\" he says.\n\n\" My family was below the poverty line ... we were on the waiting list for public housing. \"\n\nKevin says he spent much of his time \"obsessively watching TV\" as a form of escapism from his \"tumultuous\" childhood.\n\nKevin (centre) is the youngest of three boys. (Supplied)\n\nBut television wasn't just entertainment — it's also how he learned to speak English as Chinese was the dominant language spoken in his community.\n\n\"Everyone I knew was Asian. We very much grew up in Pauline Hanson's nightmare,\" he laughs.\n\nKevin says he \"felt fine\" about his identity and did not experience racism because everyone looked like him, but when he got to high school it was more multicultural.\n\n\"Everyone's ethnic, so ... everyone's sitting around roasting each other from a place of familiarity like you would a family member, you know?\" he says.\n\nKevin says he didn't know any white people for the first half of his childhood. (Supplied)\n\nNow, as a 30-year-old, Kevin has built a career as a comedian and says he has a \"lot of pride\" in his talent and what he's been able to achieve.\n\n\"I come from poverty ... nothing was handed to me,\" he says.\n\n\"I'm not saying that's the only way to reach funny, but it's the way I've reached it.\n\n\"I feel very much that I am the master of my own destiny.\"\n\nWhy Muna hid her 'beautiful' culture\n\nUnlike Kevin who grew up in a culturally homogenous area, Muna's family moved often for work, building a community from scratch each time, before eventually settling in Western Sydney during Muna's high school years.\n\nMuna says she did not feel a strong sense of belonging as a child and was considered an \"outsider\" due to her Bangladeshi heritage.\n\n\"Being brown was not cool yet. It was actually kind of lame,\" she jokes.\n\nMuna says her family moved a lot and adapted to life in the country. (Supplied)\n\nAt one school in regional Australia, she says many kids were hesitant to be friends with her.\n\n\"The teachers had to have a conversation with my parents and be like, 'Look, I'm trying to make them talk to her, but it's not working',\" she says.\n\nShe was also made fun of for wearing henna on her hands for Eid, leading her to hide that part of herself from her peers.\n\n\"For my entire high school, I never put henna on unless I knew I had a two-week break ... so I knew it would fade [before I saw anyone],\" she says.\n\n\" [Henna] is such a beautiful part of my culture that I had to give up. \"\n\nDespite challenges at school, Muna describes her childhood as \"rich and exciting\" with her home life being an anchor.\n\nMuna uses fashion as a way to express herself and her heritage. (Supplied)\n\nMuna's parents were musicians and founded the first Bangladeshi music school in Australia.\n\n\"Music was the pathway ... we created a community wherever we went,\" she says.\n\nMuna now works in the creative industries and says she would not be who she is without the \"amazing experiences\" her parents gave her.\n\n\"Everything I do is about creating community, building bridges, and also educating,\" she says.\n\nMuna works in music and as a DJ, where she champions South Asian artists. (Supplied)\n\nHowever, the convergence of her family's conservative Muslim culture with her more progressive Western lifestyle hasn't been easy.\n\nMuna recalls having a conversation with her father as a teenager, which is when she understood her family was growing with her and she needed to give them grace.\n\n\"That was a moment where I was like, 'I need to work with them',\" she says.\n\n\" The freer I am with [my parents], the easier it is for me to authentically be myself and blend my two worlds together. \"\n\nJoining forces on diaspora representation\n\nKevin and Muna have recently collaborated to create Westerners, a TV comedy pilot funded through ABC's Fresh Blood initiative, which follows three young diaspora adults navigating life in Western Sydney.\n\nIt's a story close to both of their hearts, with the pair drawing from their own lived experiences navigating identity, belonging, and being caught between cultures.\n\nKevin Han and Muna Hamid on the set of Westerners. (Supplied)\n\nWriter and co-creator Kevin says the project has been a \"dream come true\".\n\n\"This is something that I genuinely am really appreciative of and believe in, which is the opportunity to push diaspora storytelling forward,\" he says.\n\n\"It's Australia's time for us to kind of have our crack at that.\"\n\nMuna, who directed the pilot, says the experience has given her an acute appreciation for her cultural identity and upbringing.\n\nKevin and Muna with the culturally diverse cast and crew on the set of Westerners. (Supplied)\n\n\"I never thought that brown people would have the renaissance that they are having right now,\" she says.\n\n\"People actually want my perspective and nobody knows my perspective on being a Bangladeshi migrant living here better than me.\n\n\"That's where my confidence in my work comes from.\n\n\"As I'm growing older, as cliché as it is, if you can't see yourself out there, build it for yourself. And that has become my entire purpose.\"\n\nTo watch Fresh Blood: Westerners, stream free on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/artist-paints-mural-on-gold-mine-for-suicide-prevention/105183686",
        "title": "Artist and miner saves a life with powerful, 16m-high message",
        "publish_date": "Sun, 27 Apr 2025 23:06:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "For Brisbane-based artist Vondelini, the blank surface of a 16-metre-high tank at Evolution Mining's Mungari Gold Mine in Western Australia was too good to pass up.\n\n\"I was working there as a fitter … and I walked past this tank every day for like four months,\" he said.\n\n\"Every day, it looked back at me.\n\n\" I was like, 'Man, that's the best canvas that you could ask for.' \"\n\nVondelini was inspired by the blank canvas the tank offered. (ABC Goldfields: Macey Turner)\n\nVondelini joked with a construction manager that he could paint the tank.\n\n\"He came back to me four or five days later and he was like, 'Do you have any ideas?'\" he said.\n\nHaving been given the green light Vondelini wasn't going to miss the chance to spread his important message.\n\n\"It's essentially a reason for the guys to go home,\" he said.\n\n\"Everybody's isolated, we're away for like three weeks at a time, sometimes you just need that prompt to go, 'That's why I'm going home.'\"\n\nThe mural says \"Family, you're not alone\" in order to remind workers they will be home soon. (ABC Goldfields: Macey Turner)\n\nAfter three months of planning and six days of painting involving 1,000 spray cans, the mural was complete.\n\n\"A week after I painted it, we all received a message that someone had not [died by] suicide because of the message that's on the picture there,\" Vondelini said.\n\n\" It's paid for itself. There's a guy walking around that's still alive because of this. \"\n\nVondelini was invited to speak at Evolution Mining's Mungari mill opening, along with managing director Lawrie Conway. (ABC Goldfields: Macey Turner)\n\n'The number one factor'\n\nIn 2024, a University of Western Australia (UWA) and MATES in Construction study found those working in fly-in, fly-out (FIFO) and drive-in, drive-out (DIDO) roles were at a much higher risk of having suicidal thoughts than the rest of the population.\n\nIf you or anyone you know needs help: Lifeline on 13 11 14\n\nAboriginal & Torres Strait Islander crisis support line 13YARN on 13 92 76\n\nKids Helpline on 1800 551 800\n\nBeyond Blue on 1300 224 636\n\n\"We looked at loneliness compared to job insecurity, workload, financial troubles, marital problems, being a minority person,\" UWA lead researcher Joseph Carpini said.\n\n\"Even when we compared it, loneliness came up as number one factor.\"\n\nDr Carpini said one in five workers who reported feelings of loneliness also had suicidal thoughts.\n\nIn comparison, for workers who did not classify as feeling lonely, one in 20 experienced suicidal ideation.\n\n\"This isn't feeling lonely at lunch and you know, 'Buck up mate,'\" Dr Carpini said.\n\n\" This is having a serious impact on the quality of these people's lives. \"\n\nFIFO and DIDO workers are far more likely to feel lonely than other employees. (ABC Goldfields: Macey Turner)\n\n'Keeps getting worse'\n\nSelf-leadership coach Lachie Samuel spent 12 years in the construction and mining industries and experienced how dangerous the FIFO lifestyle could be.\n\n\"I had a couple of [friends] take their lives,\" he said.\n\n\"Then I got evacuated from site for being suicidal.\"\n\nSince then Mr Samuel has forged a path in the mental health space and hopes that by sharing his experiences, he can help others.\n\nLachie Samuel quit FIFO work and now helps others improve their wellbeing. (Supplied: Lachie Samuel)\n\nHe said loneliness among FIFO workers was more complex than simple homesickness.\n\n\"A lot of people … [if] they're not feeling connected to the people that they love, they either avoid them or they try and spend time with other people that they might not actually connect with,\" he said.\n\nMr Samuel said workers often started to avoid their colleagues.\n\n\"It just keeps getting worse and worse,\" he said.\n\n\"You come back home, you feel disconnected, and then you take it to camp or site with you.\n\n\" It goes on and on. \"\n\nDr Carpini says there has been a strong response to the report, but more needs to be done. (ABC News: Aran Hart)\n\n'A long way to go'\n\nMATES in Construction said several organisations had sought to implement suicide prevention practices and policies since the release of the report last year, which made a host of recommendations.\n\nDr Carpini said he appreciated the \"incredible response\" but would like to see more action.\n\n\"I wish it was more, to be honest,\" he said.\n\n\"We know that there's still such a long way to go.\"\n\nMATES in Construction says the report has gained some traction within the industry. (ABC Goldfields: Jarrod Lucas)\n\nMr Samuel said prospective FIFO or DIDO employees should carefully consider whether the work was the right fit before signing up.\n\n\"I don't think that lifestyle is suitable for everyone,\" he said.\n\n\"There are people who need to be around other people, who need to be connected.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/major-parties-climate-change-policies/105201656",
        "title": "Where do the major parties stand on climate? Turns out they’re worlds apart",
        "publish_date": "Sun, 27 Apr 2025 22:07:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the election campaign draws to a close, it's safe to say both major parties have been quiet on climate change.\n\nEnergy policies have featured prominently, which of course carry consequences for climate change, but beyond generalities, climate has been under-represented.\n\nThe last election was dubbed by many \"the climate election\", which saw the teal independents ride a wave of climate frustration into parliament, and a promise from Anthony Albanese to \"end the climate wars\".\n\nOnce again, the independents and Greens have been advocating for stronger climate action, and in the event that Australia has a minority government after May 3, climate change would be a key focus of any negotiations.\n\nDuring its last term, Labor passed a number of significant reforms, especially focusing on speeding up the transition to renewables.\n\nMany of these policies are under threat if the Coalition wins the next election, promising to scrap or weaken them significantly.\n\n\"They have rejected every single policy that's gone through the parliament that would improve tackling climate change. They've just rejected it,\" Climate Council CEO Amanda McKenzie said.\n\n\" There is not a single policy there to cut climate pollution. So what that says to me is they are hell bent on continuing the climate crisis getting worse and worse. \"\n\nTony Wood, the Grattan Institute's energy and climate director, said everything the Coalition announced so far would either slow down or curb emissions reduction.\n\n\"I think we're at one of those points where what happens at this election will have enormous consequences, not just for the energy system, but also for our emissions more generally.\"\n\nThe Coalition’s climate platform consists of using nuclear energy to decarbonise the electricity grid, despite its own modelling indicating it will result in higher emissions between now and when any reactors would come online.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nWhat has Labor done for the climate?\n\nLabor has made inroads in its last term of office on the regulatory and policy framework that could guide Australia's transition to a green economy, the often unsexy work of climate progress.\n\nCEO of the Climate Council, Amanda McKenzie. (ABC News: Supplied)\n\nSome of the changes introduced under the last government include: new laws so that Australia's biggest corporations have to disclose their climate risk and actions; strengthening the regulation of Australia's biggest polluters; and introducing emissions standards for cars sold into the country.\n\nAt the same time, it continued to approve new coal and gas projects, disappointing climate advocates such as the Climate Council's CEO, Amanda McKenzie.\n\n\"It's sort of two sides of the one coin. You've got to grow the good stuff and you've got to stop the bad stuff. We've been doing a lot of the growing the good stuff,\" McKenzie said.\n\n\" We need to continue doing all the good stuff around the clean energy, but we need to work hard on replacing fossil fuels and exiting fossil fuels from our system much more quickly. \"\n\nClimate policies matter because they send strong signals to investors and companies about the path Australia is on, and also offer the structure for how Australia could bring down emissions across the economy (whether they do lower emissions remains to be seen).\n\nWhile most of the focus has been on energy in this election, these policies are firmly in the Coalition's crosshairs.\n\n\"This is a really interesting fork in the road. And I've never seen a situation where we've had such a divergence of proposals from the two sides of politics,\" Tony Wood said.\n\nCleaning up our transport emissions\n\nTransport makes up more than 20 per cent of Australia's total emissions. (ABC News)\n\nLast week, the opposition leader confirmed that if elected, he would end a popular tax break for electric cars aimed at reducing the cost of switching to electric.\n\nThe car industry told the ABC the policy has driven a spike in EV sales and reversing it would increase the cost for Australians of going electric.\n\nThe benefit allows people to lease an electric car through a novated leasing arrangement without paying fringe benefits tax. It's intended to boost the number of electric cars coming into the second-hand market in a few years when the leases end.\n\nDutton has promised to scrap the penalties under the new fuel efficiency standards, weakening them significantly as there would be no consequences if car makers flout the rules.\n\nSet to come into effect this July, the fuel efficiency standards ensure car makers supply Australia with more-efficient petrol cars and more hybrid and electric cars, which are cheaper to run and better for the climate.\n\nSuch regulations are standard in most countries around the world, with Russia being one of the only developed countries without one.\n\nThe policy works by setting an emissions limit for each manufacturer on all the cars it sells cars into the Australian market. It means the car companies can still sell any higher-polluting cars they want, but will have to offset them with more efficient models.\n\nCar makers are only fined if they go over their cap for three consecutive years, but Dutton wants to scrap the penalties altogether.\n\n\"The policy that Dutton has proposed would totally undermine the new vehicle efficiency standards,\" the Climate Council's Amanda McKenzie said.\n\n\"That policy is intended to reduce climate pollution [by] more than 300 million tonnes. So that pollution would still [go] in the atmosphere.\"\n\nAustralia has been dubbed a \"dumping ground\" for inefficient cars that can't be sold elsewhere.\n\nTransport now makes up almost 23 per cent of the country's emissions, and — with the exception of the pandemic — have continued to rise steadily as Australians opt to drive heavier, dirtier SUVs and fly more domestically.\n\nThe Greens helped pass the legislation last year, at the same time stating they hoped the pollution limits would be reduced further.\n\nStanding with the world on climate targets\n\nThe climate pact aims to limit global temperature increase to well below 2 degrees above pre-industrial levels. (ABC News)\n\nAustralia has a target of a 43 per cent emissions cut by 2030, promised by Labor at the last election and legislated by parliament.\n\nThe Coalition is critical of Australia’s 2030 target. After statement made in an election debate by shadow minister for climate change and energy, Ted O’Brien, the Coalition had to clarify that it was still committed to the Paris Agreement.\n\nIn a statement to the ABC, the Coalition campaign said it wouldn’t set any targets in opposition “but we will be required to do so in government” and cast doubt on Australia’s ability to hit the current 2030 target.\n\n“The emissions reduction targets we set from government will consider the impact on the economy, the trajectory of emissions, and our own policies,” the statement read.\n\nTrump 2.0 targets climate action Photo shows A projection on buildings shows an outline of Donald Trump's hair being blown by a wind turbine, with the words FUTURE VS TRUMP President Donald Trump has wasted no time dismantling climate policies and promising a new era of fossil-fuel dominance.\n\nUnder the Paris Agreement, countries are meant to increase their ambition, not weaken policies, so it's unclear what the consequences would be if the Coalition watered down the targets.\n\n\"We think this is a really important election in terms of where it is in timing, because 2030 is very close for major investment. If we start veering off moving towards that target, it's really hard to get back on track,\" Grattan's Tony Wood said.\n\nIn the last term of parliament, the teal independents supported the government in passing its 43 per cent target, while at the same making it clear that they wanted it to be higher. Independents such as Monique Ryan, Zoe Daniel and David Pocock want to see a target of a 60 per cent emissions reduction by 2030.\n\nThe teal Independents have called for more ambitious climate targets. (Reuters: Simon Dawson)\n\nThe Greens want to see Australia adopt a 75 per cent target for 2030, which is what the Climate Council is advocating for.\n\nIn government, Labor held off announcing a 2035 target until it receives advice from the independent Climate Change Authority.\n\nSwapping fossil fuels for clean energy\n\nRenewable energy is rapidly increasing, with a pipeline of projects under construction. (ABC News)\n\nAustralia's 2030 climate target hangs on decarbonising the electricity sector first, which can then help other areas like transport and industry reduce their emissions.\n\nAustralia has a target of getting to 82 per cent renewable energy by the end of the decade. Currently, around 40 per cent of the electricity system is already renewable, and there is a pipeline of projects already under construction or in the planning stages.\n\nThe independent Climate Change Authority reported to the government last year that emissions need to start falling faster if Australia is to hit that 2030 target.\n\nRegardless, the Coalition’s plans to flood the market with gas, as it’s been described, and to also build taxpayer-funded nuclear power plants would both diminish renewables investment, according to energy experts.\n\nGas policy has devil in the detail Photo shows Liquified natural gas plant and LNG ship on Curtis Island, Queensland Experts say plans to bring more gas online are years away and will fail to provide immediate relief to power prices.\n\nUnder the nuclear pathway, renewable energy would only supply around 54 per cent of Australia's energy mix, a small increase from the current 40 per cent.\n\n\"What the opposition has put together over the last few months has been a series of policies that would generate a very different mix of electricity generation,\" the Grattan Institute's Tony Wood said.\n\n\"In government, a Coalition government would slow down the move to renewables and the transmission that goes with that. It would extend the life of coal-fired power stations somewhat, and it would introduce more gas generation into the mix so that the system remains reliable until we then had nuclear.\"\n\nAccording to the Clean Energy Council, capping renewables at 54 per cent would forego $58 billion of new private investment in large-scale solar and wind projects and Australia would reach the cap in another four years.\n\nDirector of the Energy Program at Grattan Institute, Tony Wood. (ABC News: Sean Warren)\n\n\"What's happening now is considerable uncertainty and flip-flopping is not good at all for investment,\" Wood said.\n\n\"We already know that the uncertainty around offshore wind and the uncertainty around some renewable projects has meant that people say, 'well, we better stop, right?'\"\n\nIn its statement to the ABC, the Coalition referred to modelling from Frontier Economics that shows electricity sector emissions will be lower in the middle of the century.\n\n“... emissions in the Coalition’s plan will drop below Labor’s before 2050, and will generate fewer emissions in 2050 and beyond.”\n\nBut because CO2 emissions remain in the atmosphere, overall, the modelling shows far higher cumulative emissions for the Coalition’s plan.\n\nThat modelling also only accounts for the electricity sector and assumes there's a slower uptake of other clean technologies and a smaller economy overall.\n\nThe Climate Change Authority estimates a nuclear policy would add two billion tonnes of climate pollution by delaying the transition. The modelling that forms the basis of the Coalition plan also has much higher emissions.\n\nUsing 'green' money for more gas\n\nThe Coalition proposes to include gas projects in the Capital Investment Scheme. (ABC News)\n\nThe Coalition has focused on gas this election more than the nuclear policy it spent most of last year pitching to voters. In his budget reply speech, Peter Dutton promised to open up the Capacity Investment Scheme (CIS) to allow gas projects.\n\nThe CIS is a government program to boost renewables investment by underwriting major projects, taking some of the financial risk out for investors.\n\nIt applies to clean power generation (wind, solar) and storage and has so far secured 32 gigawatt of capacity by 2030.\n\nThis policy has allowed the government to secure renewable projects into the grid as the country's ageing coal power stations retire, and to plot a trajectory for how Australia's dirtiest sector — electricity — will reduce emissions.\n\nLabor's plan for the electricity grid still involves some gas, and it has refused to address the issue of Australia's gas export industry despite calls from climate experts.\n\nHolding the dirtiest 200 to account\n\nThe Safeguard Mechanism aims to reduce greenhouse gas emissions from Australia's largest industrial facilities. (ABC News)\n\nThe safeguard mechanism policy is the groaning machinery that underpins much of Australia's climate response, but thanks to its complexity, it is often overlooked and under-acknowledged.\n\nFirst introduced under former Liberal prime minister Tony Abbott, it sets the rules for how much Australia's dirtiest facilities can pollute each year, and was reformed and strengthened in the last parliamentary term.\n\nIt covers just over 200 facilities across industries like mining, manufacturing, waste and gas, which account for almost a third of Australia's emissions.\n\n\"The safeguard mechanism is the only policy that we have that regulates fossil fuel pollution from industry. So it's a really important piece of our policy mix,\" the Climate Council's Amanda McKenzie said.\n\nEach facility has its own cap for annual emissions, called a baseline, which decline at five per cent each year to 2030, plus there's an overall limit or \"hard cap\" on the emissions across all facilities.\n\nImportantly, the safeguard is set in legislation, so while a sitting government can make some changes, there are fundamental tenets that can't be altered without a vote in parliament.\n\nAustralia's key climate policy faces an uncertain future Photo shows A close up view of a smoke stack at the Whyalla steelworks, taken at sunset Some business and climate groups have voiced their support for keeping one of the federal government's key climate policies in place, with the Coalition yet to commit to its future.\n\nLast month, the AFR newspaper reported that a Coalition government would look at \"relaxing\" the mechanism, which it voted against strengthening in the last term of parliament.\n\nAmanda McKenzie said the safeguard mechanism was already a flawed policy, allowing polluters to buy or trade offsets to meet their targets.\n\n\"It's not a strong enough policy … it includes offsets, which enable companies to have a get-out-of-jail-free card when we need genuine reductions in pollution. So what we'll be advocating for in the next term is to strengthen that piece of reform.\"\n\nData from the first year of the revamped safeguard mechanism has just been released and has found that 60 per cent of the facilities used offsets to meet their targets.\n\nPlugging in our future energy system\n\nRewiring the Nation aims to modernise and upgrade Australia's electricity grid. (ABC News)\n\nThe Rewiring the Nation policy helps fund the construction of transmission lines needed to move renewable electricity around the system.\n\nTransmission projects have become a sensitive topic politically, with some people in regional Australia, where most of these projects run, mounting opposition to them.\n\nThe Coalition latched onto these concerns, and said that its nuclear policy would alleviate the need for as many transmission projects as electricity generation would remain centralised at the existing coal power stations.\n\n“Renewable energy deployment will still grow responsibly under the Coalition’s plan, but we will avoid the massive overbuild required for Labor’s plan,” the campaign told the ABC.\n\nBut energy expert Tony Wood says these projects will be needed before the Coalition's nuclear power stations would start running.\n\n\"They are becoming critical to maintaining the current reliability of the system,\" he said.\n\n\"As we find the coal-fired power stations becoming less reliable as they get older, the need to be able to move electricity between states when something does go wrong in one state becomes really important,\" Wood said.\n\n\"I think a Coalition government would be faced with some quite difficult challenges if they were to seriously try and slow down the building of some of those transmission lines.\"\n\nThe roll-out of transmission projects has sparked backlash in the regions. (Supplied: EnergyCo)\n\nWood says that Australia won't be able to connect enough renewables to meet its other targets without speeding up the transmission rollout.\n\n\"We haven't been building the necessary transmission to connect the expansion of renewable energy, wind farms, and solar farms, which have to be built in places we've never had generation before. So to connect those generators to the main grid needs more transmission.\"\n\nWhat could happen to climate after the election\n\nThe world is already halfway through what climate experts call the critical decade. In Australia, there are several climate issues that are likely to be prominent in the next parliamentary term.\n\nLabor dumped its plans to introduce a federal environmental protection agency before the election, and held off on proposing a climate trigger into the national environmental laws.\n\nThe election will have a significant impact on how Australia tackles climate change over the coming years. (Supplied: Spyrakot)\n\nCurrently, major developments can be assessed and rejected if they impact the surrounding ecosystems, threatened species, waterways, but not if they have a significant climate impact.\n\n\"It's 2025 and we don't have any way of stopping projects on a climate basis,\" Amanda McKenzie said.\n\nThe Australia Conservation Foundation ranked the major parties and key independents on their climate and environment policies, and gave the Coalition just 1/100, while Labor was rated 54/100.\n\n\"Labor scored points for its work on the clean energy and clean manufacturing transition and its strong stance against costly, thirsty, risky nuclear power, but lost points for its commitment to expanding the climate-wrecking coal and gas industries,\" ACF lead Kelly O'Shannassy said.\n\nIf it wins, Labor wants to host the major UN climate conference next year alongside Pacific countries as host, which will ratchet up the pressure on Australia to outline its position on fossil fuels.\n\nIn a statement to the ABC, climate minister Chris Bowen said that acting on climate change is in the national interest, calling its reforms “overdue”.\n\n“Australians don’t want to see more tired, frustrating climate wars, that only see us miss the economic opportunities of the global push towards Net Zero.\"\n\nHow Australia faces the climate challenge over the next three years will be different depending on the outcome on May 3. If there is a hung parliament, climate policies will be a strong negotiating point with the teal independents and the Greens.\n\nAs Grattan's Tony Wood points out, three years is a long time in a world that's changing fast.\n\n\"If the current government was to be re-elected for another three-year term, that would almost make it impossible for the coalition's nuclear plan, as they've described it, to actually be implemented. It would be too late,\" Wood concluded.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/how-labor-coalition-tax-cuts-affect-you-election-2025/105173254",
        "title": "Major parties have pledged tax relief. Calculate what it means for you",
        "publish_date": "Sun, 27 Apr 2025 22:06:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "In an election campaign dominated by the rising cost of living, few voters would turn down the promise of extra money.\n\nIt's why both the major parties are promising tax relief measures in a bid to grab your attention.\n\nLabor is offering cuts to the lowest marginal tax rate, and an instant $1,000 tax deduction for work expenses.\n\nThe Coalition is pledging a one-off tax offset for low and middle income earners, and will cut the fuel excise from 50.8 cents a litre to 25.4 cents for one year.\n\nTry our tax calculator for a rough idea of how these measures might impact you:\n\nOur calculator assumes you will claim the $1,000 instant tax deduction, and compares what you would already be claiming as work expenses this financial year to what you could save with the full $1,000.\n\nA supermarket catalogue from 2021 tells us plenty about this election Photo shows An illustration of a shopping trolley The cost of living has dominated politics for three years, and will be top of mind when voters turn up to the ballot box. But how much blame should the federal government really wear?\n\nFor example, if you already claim $1,000 or more in work expenses, your savings under the new deduction would be zero.\n\nBut if you already claim something like $300, your saving would be calculated on the extra $700 accounted for in Labor's policy.\n\nOur calculator also only examines the impact of promised changes to the tax system.\n\nIt doesn't account for other tax breaks on offer for specific groups of voters, such as instant asset write-offs for small businesses, or the Coalition's tax deduction on mortgage repayments for first home buyers.\n\nIt also doesn't account for other policies targeting Australia's rising cost of living.\n\nTax breaks\n\nLabor's latest federal budget proposed a permanent cut to the lowest marginal tax rate, costing about $17.1 billion in the first four years.\n\nTo find out more about how it works, read this.\n\nThe change effectively means if you're earning more than $45,000, you will see a tax cut of $268 a year when the rate is 15 per cent, and $536 a year when the rate is 14 per cent.\n\nBut if you earn between $18,000 and $45,000, you will get a little less than that.\n\nOur tax calculator assumes these legislated tax cuts will be repealed by the Coalition.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nLabor's instant tax deduction explained\n\nLabor is offering an automatic $1,000 instant tax deduction for work expenses, for things such as uniform or equipment.\n\nHave Your Say: What matters to you this federal election? Photo shows A graphic showing a range of reader comments about potential issues in Australia's 2025 federal election. What do you need to know before you vote in the upcoming federal election? What would you ask the candidates? Have Your Say.\n\nThere's no need to keep receipts or paperwork for deductions less than $1,000 — just tick the box when lodging your tax return.\n\nTo be clear, that doesn't mean you'll receive up to $1,000 in your bank account.\n\nRather, that sum will be deducted from your taxable income.\n\nLabor estimates the average amount of annual tax relief for those who benefit will be about $205.\n\nThis tax promise is expected to cost about $2.4 billion.\n\nThe Coalition's one-off tax offset for some earners\n\nThe Coalition is proposing tax relief for low and middle income earners for one financial year only, in mid-2026.\n\nIt's a rebadging of a measure introduced in 2018.\n\nDubbed the 'Cost of Living Tax Offset', the policy means Australians with taxable incomes between $48,000 and $104,000 will get a one-off rebate of $1,200.\n\nOther taxpayers with incomes below $144,000 will get smaller rebates.\n\nThe Coalition says these tax measures would save the average two-income family about $2,400.\n\nFuel excise\n\nThe Coalition is proposing to halve the fuel excise from 50.8 cents a litre to 25.4 cents for 12 months, starting in July.\n\nThe excise is effectively a tax paid by petrol suppliers, which is passed on to customers at the pump.\n\nYou might remember the Morrison government temporarily reducing the fuel excise in 2022 in response to high fuel prices caused by Russia's invasion of Ukraine.\n\nThe opposition claims the cut would save a motorist who fills up a 55-litre tank each week about $14 a week, and says Australia's competition watchdog will ensure service stations pass the full discount onto customers.\n\nOur tax calculator sets the average weekly fuel usage at 24 litres, based on the latest data for average fuel usage from the Australian Bureau of Statistics.\n\nOf course, not everyone will benefit equally from this measure.\n\nThe saving depends on how far someone regularly drives and the fuel efficiency of their vehicle.\n\nThe measure also won't help drivers of electric vehicles.\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/super-rugby-pacific-wallabies-reds-brumbies-waratahs-force/105221098",
        "title": "Why the name Lynagh may again haunt British and Irish rugby fans",
        "publish_date": "Sun, 27 Apr 2025 22:04:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "With Wallabies coach Joe Schmidt holding his cards close to his chest (at least publicly), it remains anyone's guess as to who will start at fly half for the first Test against the British and Irish Lions in July.\n\nThe Western Force's Ben Donaldson has been the clubhouse leader, especially with Noah Lolesio showing inconsistent form for the ACT Brumbies in the Super Rugby Pacific competition.\n\nDonaldson's main challenger may prove to be Tom Lynagh, who produced a player-of-the-match performance in the Queensland Reds' 35—21 victory over the Blues in Brisbane on Friday night.\n\nLynagh — who made three Test appearances as a reserve for the Wallabies in 2024 — illustrated his ability to take the ball to the defensive line in attack when he scored the opening try of the match in the fourth minute.\n\nHis tactical kicking ignited the play that led to his second try only minutes later, sending the ball to the sky with a perfectly weighted bomb that resulted in the Blues messing up their kick reception.\n\nThe Reds pounced on the turnover from the defending champions, with Lynagh scoring in the ensuing phase play.\n\nLynagh was awarded the Sellars Dixon Medal after being named player of the match. (Getty Images: Chris Hyde)\n\nLike Donaldson, the Italy-born Lynagh poses a threat in the second line of attack, as he displayed against the Blues, while he's also a competent tackler who doesn't shirk from his defensive responsibilities.\n\nLynagh is still learning the craft at the professional level, so it's not surprising a degree of casualness can creep into his game.\n\nHe threw a lazy pass to Zane Nonggorr soon after half-time that handed possession over to the Blues, who were initially awarded a try in the following phase-play, only for it to be disallowed because of an earlier knock-on.\n\nThere are still five rounds left in the regular season and potentially a finals series for the fourth-placed Reds, giving Lynagh the opportunity to iron out chinks in his armour.\n\nIt would be a proud family moment should Lynagh earn selection to face the Lions, given his father Michael played in the 1989 series.\n\nWhile the Lions took the honours on that occasion, British and Irish rugby fans with long memories would be mindful of the misery Michael Lynagh inflicted on their respective nations during his decorated career.\n\nHe was an integral member of the Wallabies' Grand Slam-winning side in 1984 and helped orchestrate the last-gasp quarterfinal victory over Ireland in the successful 1991 World Cup campaign, which was iced by the 12—6 defeat of England in the tournament decider.\n\nMcDermott keeps on keeping on\n\nPerhaps enhancing Lynagh's selection hopes is the effective halves combination he has developed alongside Reds co-captain Tate McDermott.\n\nLast week's column argued McDermott is the frontrunner to play scrum half for the Wallabies against the Lions and he only boosted his chances with another sound knock for the Reds in the win over the Blues.\n\nHis highlights reel featured an outstanding try in the 51st minute when the Reds were nervously leading 14—7.\n\nFrom the base of a ruck, McDermott shaped to pass just outside the Blues' 22, but spotted a gap in the defensive line, through which he galloped on his way to crossing the stripe.\n\nTate McDermott's try effectively killed off any hope of a Blues victory. (Getty Images: Chris Hyde)\n\nMcDermott's try, converted by Lynagh, gave the Reds a 14-point advantage, which the Blues could not overcome.\n\nHe also impressed in defence, having teamed up with Lynagh to hold out Kurt Eklund over the line during a sustained period of attack from the Blues.\n\nMcDermott only started in one Test in 2024, but came off the bench in another 11 internationals, replacing Jake Gordon on most of those occasions.\n\nHis solid form this year — and the fact Gordon has missed a large chunk of the NSW Waratahs' season through injury — points to him having the inside running for the Wallabies' number nine jersey.\n\nBrumbies come up short\n\nDespite scoring the first try, the Brumbies always seemed to be a step behind the Hurricanes in their 35—29 loss to the visitors at Canberra Stadium on Saturday night.\n\nSuper Rugby Pacific results: Chiefs def Force 56—22 in Tauranga\n\nReds def Blues 35—21 in Brisbane\n\nMoana Pasifika def Fijian Drua 34—15 in Albany\n\nCrusaders def Highlanders 43—10 in Dunedin\n\nHurricanes def Brumbies 35—29 in Canberra\n\nThe Hurricanes scored five tries to four and enjoyed more time with ball in hand, having restricted the Brumbies to 42 per cent of possession.\n\nAs Brumbies captain Allan Alaalatoa said after the match, his side made good use of the ball they had, but it was a case of them needing \"more of it\".\n\nThey didn't help themselves defensively, missing 46 of their 232 tackle attempts, while coach Stephen Larkham admitted his troops was beaten by the Hurricanes in the breakdown battle.\n\nThe Brumbies also conceded 10 penalties to five, including seven inside their half.\n\nBut the line-out was on song, with each of their throws finding its target.\n\nIt was an up and down night for the Brumbies, who stay third on the standings but trail the Chiefs and Crusaders by eight points.\n\nTheir fortunes were reflected in Tom Wright's performance, with the Wallabies fullback balancing bright patches with lacklustre moments.\n\nThe Hurricanes forced the Brumbies to play catch-up for much of the match. (Getty images: Mark Nolan)\n\nWright's efficient work over the ball earned a breakdown penalty during the first half and he threw a well-timed lofted pass to Andy Muirhead for the Brumbies flyer's late try.\n\nBut missed tackles, giving up a penalty and a spilt high ball were examples of when Wright put the Brumbies under pressure.\n\nAs superbly as Wright played for the Wallabies last year, his hold on the fullback role may be under threat from Joseph-Aukuso Suaalii.\n\nSuaalii has started at fullback in all but one of his five appearances for the Waratahs this season, impressing in the position since returning from a toe injury.\n\nHe will figure in the Wallabies' backline against the Lions, however it's just a matter of whether it will be at fullback or in the centres.\n\nWright and Suaalii will face each other when the Brumbies play the Waratahs in Canberra on Saturday night.\n\nThe showdown will no doubt be seen by many as a form guide as to who will play 15 against the Lions.\n\nWaratahs to decide on Tupou\n\nThe Wright vs Suaalii plot-line will be among several enticing match-ups in the capital on the weekend.\n\nSet to create interest is the potential meeting between Australia's two most talented tight-head props — Alaalatoa and the Waratahs' Taniela Tupou.\n\nBut this will largely depend on Tupou starting against the Brumbies.\n\nHe played off the bench against Moana Pasifika and the Chiefs in rounds eight and nine, before being rested against Fijian Drua due to the national rotation policy.\n\nTaniela Tupou has not started for the Waratahs since their round-seven match against the Hurricanes. (Getty Images: Hagen Hopkins)\n\nDaniel Botha has started at tight-head in the Waratahs' past three matches.\n\nTupou's demotion to the reserves came after the Waratahs were hammered 57—12 by the Hurricanes in round seven, with coach Dan McKellar saying he wanted to get \"more out\" of the Wallabies bookend.\n\nThe ex-Melbourne Rebel has given up a lot of ground to Alaalatoa, who has been the best-performed Australian tight-head this season.\n\nForce hit with leadership void\n\nThe Western Force were already facing an uphill battle when they took the field against the Chiefs at Tauranga's Bay Oval of Friday night, missing Wallabies duo Jeremy Williams and Nic White.\n\nTheir leadership and experience were sorely missed in the 56—22 thumping handed out by the competition-leading Chiefs, who were without injured All Black Damian McKenzie.\n\nDespite being in front on the scoreboard twice in the first half, not much went right for the Force.\n\nPoor defensive reads were costly, as proven by Chiefs scrum half Cortez Ratima's back-to-back tries in the second term.\n\nHarry Potter scored a double in the Force's heavy loss to the Chiefs. (Getty Images: Michael Bradley)\n\nMissing skipper Williams, the Force's line-out was often dysfunctional, although a Darcy Swain steal did spark Bayley Kuenzle's try in the fifth minute of play.\n\nFrom a Wallabies perspective, there was scarcely a Force player who pushed their selection claims for the Lions series, although winger Harry Potter's second try showed a touch of brilliance.\n\nThe Force slipped to sixth on the standings, staying on 22 points, with the Waratahs (21 points) now seventh.\n\nAfter licking their wounds following the defeat to the Chiefs, the Force will conclude a testing road trip in New Zealand when they clash with the Blues at Eden Park on Friday night.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/mums-footy-breasting-pumping-barriers/105221476",
        "title": "'More work needed' in making parenting rooms more accessible at AFL stadiums",
        "publish_date": "Sun, 27 Apr 2025 21:48:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alexandra Merrett took to social media to call for the MCG to get a breastfeeding room after being unable to find one during the Anzac Day game.\n\nComments on her post soon informed the wife of Essendon captain Zach Merrett that there were some located around the venue, however, she is not the only new mum who has had to pump in toilet cubicles at footy stadiums after being unable to find the appropriate rooms.\n\n\"I wish I knew there was a breastfeeding room!\" one comment on her video read.\n\n\"I had to feed my baby on the toilet\".\n\nAlex and Zach Merrett at the 2024 Brownlow Medal. (Getty: Sam Tabone/WireImage)\n\nLucinda McKimm, host of motherhood and career podcast Ready or Not, said needing to find a safe place to breastfeed or pump could add to the stress of early motherhood and pose an extra barrier to going to the footy.\n\n\"It's excellent that there are parenting rooms available for mums wanting to enjoy the footy,\" said McKimm, who is also a mum and footy fan.\n\n\"But if it's not easy enough for an AFL player's wife to find, more work needs to be done to ensure that all mums, including those with disabilities or for whom English might be their second language, can access these rooms that keep women and mums participating in society and feeling safe while doing so.\"\n\nMost stadiums across Australia now have rooms that include baby changing facilities and privacy areas.\n\nThe MCG has four rooms located around the stadium on level one, which each contain private feeding cubicles with armchairs, change tables, nappy disposal units, a microwave, TV, power point, sink and toilet.\n\nThe parenting room in the MCC Members' Reserve is kept locked on event day and requires staff assistance.\n\nHester Brown, wife of former premiership player Ben Brown, breastfed their two kids at stadiums between 2018 and 2023 when her husband played for North Melbourne and Melbourne.\n\nShe used the parenting room at Docklands and said some clubs now had staff whose game day role was to help partners in this area, including at the Demons.\n\nHester Brown had to navigate breastfeeding at the footy during her husband Ben's playing career. (Getty: Paul Kane)\n\nHowever, she said friends of hers had been in similar situations to Merrett.\n\n\"I've also asked for help and often — and it's not the MCG staff's problem — but they often don't know where it is, or it'll be on the other side of the members, a million miles away,\" Brown said.\n\n\"If they left their kid at home, or if it's a night game, you still have to pump if you're feeding that way.\n\n\"So often, that's just you standing in a cubicle or sitting on the loo by yourself with the machine whirring in the background having not a nice or relaxed experience.\n\nYour stories of breastfeeding in public Photo shows Nicole and her youngest breastfeeding in the pool While some caregivers told us they don't hesitate to breastfeed in shared spaces, others explained it isn't always straightforward.\n\n\"And all those things can add stress because it's [already] very hard and stressful being a parent and there's lots of emotion involved in breastfeeding, lots of pain. It can be very difficult.\"\n\nDepending on the person and age of the child, Brown said pumping could take anywhere between 10 minutes to half an hour.\n\nAs Merrett experienced, mums often don't have a lot of time to find a room to feed or pump, especially if they don't know where they're going and in a crowded stadium.\n\nMcKimm said there were extra things that needed to be considered during a breastfeeding period, including planning around feeding or pumping times, having all the right equipment, and making sure the painful experience of mastitis (inflammation caused by blocked milk) is avoided.\n\nBrown said they were all reasons why it was important to remove as many barriers as possible for new mums going to the footy.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/caitlin-foord-scores-arsenal-beat-lyon-womens-champions-league/105222616",
        "title": "Foord on target as Arsenal power into Champions League final",
        "publish_date": "Sun, 27 Apr 2025 21:36:58 +0000",
        "category": "sports",
        "authors": [],
        "text": "Three Matildas helped Arsenal to a famous Women's Champions League semifinal triumph at all-conquering Lyon, with Caitlin Foord finding the target in a remarkable 4-1 win to set up a final against champions Barcelona.\n\nFoord celebrated with fellow Australia internationals Steph Catley and substitute Kyra Cooney-Cross as the Gunners overturned a 2-1 first-leg deficit in France.\n\nThe home club, eight-time European champions, were left stunned and crestfallen, with Lyon's Australian manager Joe Montemurro having seen his side capitulate to the club he once managed so successfully in England.\n\nIt was also a massive disappointment for Lyon full-back Ellie Carpenter, whose dream of a third Champions League winner's medal was shattered after she'd been tormented all afternoon down her right flank by the excellent Foord.\n\nArsenal now faces its ultimate test in the final in Lisbon on May 24 against a rampant Barcelona side who had earlier outclassed Chelsea 4-1 for a second time in a week, sealing an 8-2 aggregate victory and a shot at a third-straight crown.\n\nIt was also the end of any faint hopes the injured Sam Kerr may have harboured of making a return to Chelsea's ranks for the biggest match in women's football.\n\nInstead Chelsea's London rivals Arsenal will go to the Alvalade Stadium, after a 5-3 aggregate win which felt wholly unexpected amid an accident-prone showing from Europe's most celebrated women's club.\n\nLyon keeper Christiane Endler began the shambles after misjudging a fifth-minute corner, with an attempted clearance then hitting her on the back and bouncing in for an own goal.\n\nMariona Caldentey's superb strike made it two before Alessio Russo cashed in on a succession of defensive errors to score 30 seconds after the resumption.\n\nIn the 63rd minute, Lyon centre back Vanessa Gilles slipped and fell in her own area, allowing Foord to pounce on the gift to hammer home gleefully.\n\nThat really sealed the deal even before Melchie Dumornay grabbed an 81st-minute consolation.\n\nAt Chelsea's Stamford Bridge, Barcelona was again in a different league to the English champions, just as in Catalonia seven days earlier.\n\nKerr was still not ready to return to action after more than a year out with her ACL injury but even the Australian captain's presence could hardly have helped the Blues against the slick visitors.\n\nIt was the end of another European dream for Kerr and Chelsea, who reached the final back in 2021, only to be routed 4-0 that day by Barcelona.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/asx-markets-business-news-live-updates/105221920",
        "title": "Live: ASX opens higher as traders await crucial inflation figures this week",
        "publish_date": "Sun, 27 Apr 2025 21:22:48 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Stephanie Chalmers"
        ],
        "text": "Australia:\n\nTue: RBA Assistant Governor (markets) Christopher Kent speaks Wed: CPI (Q1), Monthly CPI indicator (Mar), Private sector credit (Mar) Thu: Home prices (Apr), Trade balance (Mar), Trade price index (Q1) Fri: Retail trade (Mar & Q1), Producer price index (Q1)\n\nInternational:\n\nMon: US — Home prices (Feb) Tue: US — Job openings (Mar), Consumer confidence (Apr) CA — Federal election Wed: US — GDP (Q1), ADP employment (Apr), PCE inflation (Mar) CN — Purchasing Managers' indexes (Apr) EU — GDP (Q1) Thu: JP — BoJ rates decision Fri: US — Non-farm payrolls (Apr), Factory orders (Mar), ISM manufacturing (Apr)\n\nIt's a week filled to the gunwales with macro data, but the one that stands out from the local perspective is March quarter inflation to be released by the ABS on Wednesday.\n\nWhile markets have a rate cut from the RBA priced in as a near certainty, the inflation rate for the March quarter is likely to come in higher than the previous two quarters.\n\nThe CBA sees headline inflation coming in at 0.8% over the quarter, up from the consecutive quarterly prints of 0.2%, largely due the electricity rebate rolling-off calculations.\n\nBut fear not (if you're a mortgage holder), both the headline, and more importantly from the RBA's perspective, trimmed mean CPI should be within the 2-to-3% target band.\n\nHouse prices as measured by CoreLogic (Thursday) are expected to have risen again nationally across April, but perhaps by not as much as the 0.4% reported for March.\n\nThe March trade balance (Thursday) is forecast to come in at a softer $2.8 billion surplus, while in the first quarter terms of trade (Thursday), the ratio of export-to-import price has a lot of moving parts to it, including currency movements, but the good news is Australia's purchasing power probably improved by 1% over the quarter.\n\nRetail trade (Friday) is forecast to have risen by 0.4% over March, up from 0.2% growth in February. The quarterly figure, released at the same time and adjusted for inflation, is expected to show retail spending was flat over the first three months of the year.\n\nThe US has a blizzard of important data dropping.\n\nUS Q1 GDP (Wednesday) is expected to show a marked slowing in growth from 2.4% in the last quarter of the Biden administration to just 0.3% in the first three months of the year.\n\nCore Personal Consumption Expenditures (PCE) inflation (Wed) is tipped to have eased a bit to 2.6% in March but still remain above the Fed's 2% target.\n\nNon-farm payrolls (Friday) should see an increase of 120,000 new jobs in April with the unemployment rate unchanged at 4.2%",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/new-tool-engaging-australian-voters/105215708",
        "title": "As more voters become disengaged, a new tool aims to cut through the noise",
        "publish_date": "Sun, 27 Apr 2025 21:20:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "When asked which voter group they think is most fed up with Australian politics, many people are quick to point to Gen Z.\n\n\"We've been raised in a world that's left worse off for us,\" 21-year-old Zach Mead told the ABC.\n\n\" We can't really live, renting an apartment is way too expensive for us and we're struggling to get by with barely anything. \"\n\nHis partner, Catherine Ferry, 21, shared a similar sentiment.\n\n\"I feel like Gen Z is just upset with everything and they don't want to live in a world where it's been screwed over for us,\" she said.\n\nCatherine Ferry, 21, believes Gen Z is disillusioned by the political process. (ABC News: Tabarak Al Jrood)\n\nMillennials most disengaged\n\nWhile younger Australians are increasingly tuning out of politics, Australian National University senior politics lecturer Dr Jill Sheppard said the most disengaged group was actually millennials or people aged in their 30s to early 40s.\n\n\"It's really [these] voters who are getting to a point in life when they haven't created enough of a deposit to buy a house, they don't have job security, they're working contract to contract, they're renting, or they're steeped in mortgage payments,\" she said.\n\n\"People for whom the system really doesn't seem to be working that well, people who look at their parents at the same age and think they had it better.\"\n\nDr Jill Sheppard says more voters in general are tuning out of politics. (Supplied)\n\nBut Dr Sheppard acknowledged it was a growing trend, with more voters of all ages switching off from the political process.\n\n\"People are just less excited about voting, they're less excited about the political parties, they're less excited about how Australian democracy is working,\" she said.\n\nBaby boomers outnumbered\n\nThe May 3 federal election will be the first where Gen Z and millennial voters aged under 45 will outnumber baby boomers in every state and territory.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nBut Dr Sheppard said most major parties have relied on older cohorts as their \"path to victory\".\n\n\"The problem with this two-party system is that there are plenty of voters, particularly aged 40 and under, who don't feel like they're getting ahead, and there's no real electoral incentive for parties to talk to those voters, because they can build enough of an electorate without having to talk to them,\" she said.\n\n\"That's where parties like the Greens and then increasingly independents are finding a path to victory, because they can talk to these voters who don't feel heard by the major parties.\"\n\nResearchers say people aged in their 30s and early 40s are the most disengaged with politics. (Supplied: WA Electoral Commission )\n\nEarly voting\n\nWith a record 542,141 votes cast in the first day of early voting, it's clear many voters have made up their minds long before the official polling day.\n\nIn Western Australia, the first-day result of 59,000 votes marked a notable 115 per cent increase on 2022 — a figure not surprising to Dr Sheppard.\n\nThe rise of early voting in Australia Photo shows Line of people voting at Perth polling station. More than a million people have already cast their ballots for the federal election early. Some experts say the polling day has just become the last day to vote.\n\n\"We do want someone to promise us the world, sometimes we want someone to let us know that they hear our concerns and that they will respond to them,\" she said.\n\n\"And if you don't feel like you're being heard in those three years between elections, then you can't fix that in the 33 days of the actual campaign.\"\n\nBuild a Ballot\n\nA new web-based tool is hoping to change that, by helping voters cut through the political noise and make informed decisions.\n\nCreated by climate-focused charity Project Planet, the Build a Ballot website walks voters through a series of questions to see how they would tackle issues like housing, cost of living, climate change and education.\n\nFrom there, users receive a personalised voting plan and can see which of their local candidates and parties reflect their own views and preferences.\n\n\"People are starting to think, 'oh, maybe I shouldn't just vote how my parents have always voted, maybe I should actually understand a little bit more about what I'm doing,' and we've tried to design the tool in a way that really invites people into that process,\" co-founder Lizzie Hedding said.\n\nBuild a Ballot co-founder Lizzie Hedding is hoping the tool helps voters to make informed decisions. (ABC News: Marcus Simpson)\n\nMs Hedding said despite the political power younger generations held this election, she had noticed a significant divide when it came to engaging them.\n\n\"I think there's a bit of a misconception that the only way to talk to younger voters is to dumb things down or try to make it funny and silly,\" she said.\n\n\"But the reality is that these young people are smart, they do jobs in our economy, they're very switched on [but] they just don't see themselves represented in the political conversation, and they don't see that conversation talking about the issues that actually matter to them.\"\n\nEngaging young voters\n\nZach Mead believes engaging disconnected voters could be as simple as talking to them.\n\n\"Come ask us questions, ask us what we want because I see so many politicians out there that just assume what we want and do whatever and then we hate them for it,\" he said.\n\nZach Mead, 21, says politicians need to engage young voters by talking to them. (ABC News: Tabarak Al Jrood)\n\nMeanwhile, Catherine Ferry feels younger voters would connect more with people they look up to or regularly follow, such as influencers.\n\n\"For a lot of voters they just don't know where to start … so it would be a lot better if we had good examples out there to actually show us the parties and what they're offering,\" she said.\n\n\"Everyone's so focused on cardboard signs [but] it's not the way that a lot of the younger generation is raised on, so having that technology-based advertising would be absolutely amazing,\"\n\nWhile Ms Hedding hopes disengaged voters will switch on at the last minute, Dr Sheppard believes it's too late to change their minds.\n\n\"The parties can't come to them now, with [one] week to go after three years of this electoral cycle, and tell them convincingly that they care,\" she said.\n\n\"I think if you're disengaged at this point, you're going to stay disengaged until the 3rd of May.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-28/kununurra-vegetable-growers-end-production-food-security/105187246",
        "title": "Remote town's last fresh vegetable suppliers hang up their hats",
        "publish_date": "Sun, 27 Apr 2025 21:02:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Chris and Diane Robinson are hanging up their hats after more than 25 years growing fresh vegetables in Western Australia's remote north.\n\nThe couple's semi-retirement means the town of Kununurra has lost its only direct supplier of local vegetables.\n\nThe remainder of the town's produce has been trucked more than 3,000 kilometres from Perth.\n\nThe soil and water availability of the Kimberley's Ord Valley makes it fertile agricultural land. (ABC Kimberley: Alys Marshall)\n\nThe couple were working for the state government's department of agriculture when they began their horticulture business, Oria Orchards.\n\n\"We were doing a full day's work then racing out to the farm afterwards and spending all our weekends working on it,\" Ms Robinson said.\n\nThey grew grapefruit and mangoes before branching out into other produce including asparagus, herbs, corn, tomatoes and lettuce.\n\nMost of their produce went down the traditional route to be sold in the Perth markets to the major supermarkets and metro restaurants.\n\nBut they quickly found that process was not for them.\n\n\"It was just too hard to make any money when we sold to the big supermarkets,\" Ms Robinson said.\n\nChris and Diane Robinson pick all their fresh produce at their Kununurra orchard. (ABC Kimberley: Alys Marshall)\n\nAt the time their neighbours were supplying fresh produce direct to the town of Kununurra, but were getting ready to move solely into banana production.\n\n\"We fell into their spot and expanded from there,\" Ms Robinson said.\n\nIt meant supplying direct to IGA Kununurra, as well as selling their produce at the town's Saturday morning markets.\n\nOria Orchards grows fruit and flowers for sale in Kununurra. (ABC Kimberley: Alys Marshall)\n\n\"I remember it vividly, I was pregnant with our third child when we started the markets with the fruit, the citrus and just a few zucchinis and tomatoes and that was a two-table stall,\" Ms Robinson said.\n\n\" It just grew and grew until we needed seven tables. \"\n\nOria Orchards found its niche supplying directly to locals and visitors to the remote northern town.\n\n\"The best thing was probably meeting the demand of the people we serve,\" Mr Robinson said.\n\n\"And we provided a lot of fruit and vegetables to a lot of local restaurants, so to see chefs creating menus out of the stuff we grew was very rewarding.\"\n\nFreshly harvested paw paws at Oria Orchards. (ABC Kimberley: Alys Marshall)\n\nNo more local veggies\n\nDespite the Robinsons' success, no business has moved to fill the gap left by Oria Orchards in supplying vegetables direct to Kununurra without first trucking it to Perth.\n\n\"I might have put people off by complaining about my sore back too much,\" Mr Robinson joked.\n\n\" It is very intensive manual labour and most of the work is head down, bum up so it's hard work but it is very rewarding. \"\n\nCurtin University food supply chain systems researcher Liz Jackson said what was happening in Kununurra was a disappointing case study that should be noted by the rest of the country.\n\n\"While I wish the Robinsons the best as they move towards retirement, it has brought the issues of food security, carbon footprint and environmental consciousness to the forefront,\" Professor Jackson said.\n\nA tray of freshly picked grapefruits, ready for juicing to sell at the Saturday markets in Kununurra. (ABC Kimberley: Alys Marshall)\n\nLengthy trip\n\nProfessor Jackson referred to the east Kimberley town as the canary in the coal mine, warning Australia to rethink its relationship with food.\n\n\"The problem here is efficiency, as strange as that sounds,\" she said.\n\n\"Efficiency is what [commercial] supply chains have been working towards for the last 50 years and to do so is to do things by scale.\"\n\nShe said consumer demand for readily available, cheap produce had led to major supermarkets monopolising the supply chain.\n\nSupermarkets require growers to truck their produce to Perth before returning it to the region's shelves.\n\nForklifts in action at Market City Perth. (ABC Radio Perth: Emma Wynne)\n\n\"It's actually cheaper for those vegetables to be trucked down to Perth and redistributed from there than to have lots of little packing sheds dotted around the country,\" Professor Jackson said.\n\n\"But where the wheels fall off is when it comes to food security and resilience.\"\n\nShe pointed to the many recent closures of the Great Northern Highway that connected the Kimberley to the rest of the state.\n\n\" These weather events are getting worse and more frequently communities are being cut off, leaving small towns in a very precarious situation [when it comes to supply of fresh produce]. \"\n\nStill hopeful\n\nChris and Diane Robinson hope a new grower will fill their spot. (ABC Kimberley: Alys Marshall)\n\nDespite the Robinsons semi-retiring, Oria Orchards has continued to grow and sell a range of fruit and flowers in Kununurra.\n\nThe couple have not slowed down completely.\n\n\"We always have ideas, we are from a research background so we are always finding new things we want to plant,\" Mr Robinson said.\n\nThey both hoped someone new would fill the veggie supply gap they had left behind.\n\n\"It could have been a lot bigger than what we were doing, the market is there so it's a fairly good opportunity,\" Mr Robinson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/property/news/investors-beat-first-home-buyers-to-1-68m-lindfield-sub-penthouse-20250428-p5lunm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Investors beat first home buyers to $1.68m Lindfield sub-penthouse",
        "publish_date": "Mon, 28 Apr 2025 12:01:11 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "Local investors beat a young first home buyer couple to a Lindfield apartment at auction on Saturday, paying $1.68 million.\n\nThe three-bedroom home at 35/15-19 Havilah Road was billed as a luxury sub-penthouse and sold bang on its reserve price.\n\nThe home was guided at $1.6 million, bidding opened at $1.56 million and went up in $20,000 increments until it sold under the hammer.\n\nTwo parties registered for the home with a rental return of $1300 a week and leafy tree views. The winning bidders lived in Lindfield and were looking for an investment in the area.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-anthony-albanese-v-peter-dutton-leaders-debate-reaction-20250427-p5lul8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Dutton’s bus gets stuck in Sydney, Albanese visits NSW Central Coast",
        "publish_date": "Mon, 28 Apr 2025 11:59:51 +1000",
        "category": "finance",
        "authors": [
            "Olivia Ireland",
            "Nick Newling"
        ],
        "text": "One of the world’s biggest credit ratings agencies, S&P Global, has put the major parties on notice that Australia could lose its triple A credit rating if their election promises result in larger structural budget deficits.\n\nIn a statement this morning, the agency said sound budget management had underpinned Australia’s triple A rating for years. Change in net general government debt — which includes the federal and state governments — had averaged just 2 per cent of gross domestic product since the global financial crisis of 2008-09.\n\nTreasurer Dr Jim Chalmers during a doorstop interview following the final leaders’ debate. Credit: Alex Ellinghausen\n\nBut S&P believes growing risks to the global economy, plus the use by both parties of off-budget commitments to meet their spending pledges, was putting the budget at risk.\n\n“The budget is already regressing to moderate deficits as public spending hits post-war highs, global trade tensions intensify and growth slows,” it said, “how the elected government funds its campaign pledges and rising spending will be crucial for maintaining the rating.”\n\nAccording to the agency, “lax fiscal discipline at the state level” – of the states and territories, only WA has a triple-A rating – on top of the turmoil created by Donald Trump’s tariff war and growing demands in federally supported areas such as the NDIS, defence, health and aged care would likely increase general government deficits.\n\n“If major election commitments aren’t funded via additional revenues or savings, the deficit could widen further,” it said.\n\nLoading\n\nAnother concern raised by the agency is the use of off-budget items for major spending. The Albanese government has created several, such as its $19 billion Rewiring the Nation Fund and its $10 billion Housing Australia Fund.\n\nPeter Dutton is promising to axe both of these funds, but has promised to create his own Regional Australia Future Fund and a Future Generations Fund.\n\nS&P said the use of these funds was “increasingly obfuscating Australia’s fiscal position and borrowing needs”. In the March 25 budget, Treasurer Jim Chalmers forecast a deficit of $27.6 billion for the current financial year, widening to $42.1 billion in 2025-26. The budget is expected to remain in deficit for the rest of the decade and well into the 2030s.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/trump-s-billionaire-oil-industry-donors-aren-t-getting-what-they-wished-for-20250428-p5lunp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s billionaire oil industry donors aren’t getting what they wished for",
        "publish_date": "Mon, 28 Apr 2025 11:59:34 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Loading The International Energy Agency had forecast that demand for oil would increase about 1.03 million barrels a day. After Liberation Day it cut that forecast by about a third, to 730,000 barrels a day, saying about half that reduction was attributable to lower demand in the US and China as a result of the trade war. Demand is, of course, only half of the equation that generates prices. The other half is supply, and it is increasing even as demand is falling. On the day Trump unveiled his new tariffs, OPEC+ said they would unwind the 6 million barrels a day or so of cuts they have made over the past three years at a faster pace than they had previously planned, adding about 411,000 barrels a day to supply from next month. The move is seen as an attempt by Saudi Arabia, which has borne the brunt of the past cuts to production, to punish those members of the cartel that haven’t met their own commitments to constrain their production. Kazakhstan, the United Arab Emirates, Russia and Iraq have all been producing above their agreed caps.\n\nTrump’s “Golden Age” for US oil – he has said he wants to double US oil production, which reached record levels during the Biden administration – is not going to happen if demand weakens even as supply increases. He may get the other thing he wished for – lower US gasoline prices – but for less palatable reasons than the giant surge in US production he anticipated. The US shale sector is unlikely to take any heed of his urgings to “drill, baby, drill” while domestic oil prices are languishing at their current levels. While break-even levels for shale producers vary according to the richness and productivity of the various basins, a rough guide is that to break even – pay all costs, including operating and financing costs and also pay a dividend – US onshore oil companies need a price of between $US62 and $US65 a barrel. Today, however, it isn’t just the oil price that dictates whether they drill wells or not. Drilling rigs require lots of steel and there are also many components imported from China. Trump’s steel tariffs and his 145 per cent tariff on most imports from China are driving up the sector’s costs.\n\nToday’s shale industry has been heavily consolidated and is financially disciplined, with a focus on returns on capital. Where once Wall Street rewarded shale oil and gas companies for their production, now it rewards them for their returns on capital and punishes sub-optimal activity. Loading According to energy technology company Baker-Hughes, there are about 23 fewer oil rigs operating today than there were a year ago and, at 483, only just over half the record number of rigs –888 – set in 2018. Industry executives are warning that if prices fall back further, the number of operating rigs will fall much further. With the best fields’ reserves declining and costs increasing, the US shale sector was never going to double its production. While production was expected to continue to grow incrementally, peak production was expected to occur before the end of the decade, although Trump’s deregulation and opening of federal lands to exploration and drilling might have stretched the timeline.\n\nA US and, perhaps, global recession would, of course, further darken the outlook for demand and undermine the economics of production. While those recessions are not yet seen as probable, both the IMF’s odds on a US recession and those of private forecasters have been shortening. The risk of a severe downturn in the economy adds another layer of uncertainty to the outlook for US energy companies, as does the potential for Trump to do a deal with Vladimir Putin that would lift the sanctions on Russian oil (Russian drilling has already begun increasing in anticipation) and add to the global surplus of supply. Early this month, Trump’s energy secretary, Chris Wright, told the Financial Times that the shale producers could boost their output even at $US50 a barrel. Less than a fortnight later he said $US50 a barrel oil wasn’t sustainable for producers. Wright, before taking up the role in the administration, was chief executive of Denver-based Liberty Energy – America’s second-biggest “fracker” – which earlier this month announced a first-quarter profit of $US20 million, down from $US82 million in the same quarter last year and the $US52 million it earned in the December quarter last year. Liberty’s share price was around $US22.60 when Trump took office again. Today’s it’s just over $US12. The company’s market capitalisation has slumped from $US3.7 billion to $US1.97 billion over that period.\n\nLoading The current chief executive, Ron Gusek, believes that producers can maintain their drilling at current levels as long as the price remains in the low $US60s a barrel but are likely to start shutting down wells if the prices dropped any further. Maybe he had a chat with Wright, although the precipitous fall in his old company’s share price might also have grabbed Wright’s attention. Trump’s “babies” aren’t going to increase their drilling and production at current prices. At best they will, regardless of his urgings, try to maintain current levels. At worst? Trump’s tariffs, a US and global economic slowdown/recession and rising production volumes from OPEC+ will result in production cuts to a sector that generated more than 15 per cent of America’s exports last year and gave the country a $US45 billion energy surplus. The billionaire donors to Trump’s campaign should, perhaps, have been more careful of what they wished for, looking beyond his energy and tax policies to his wider platform, and the trade policies in particular.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/gardiners-creek-is-a-rare-slice-of-urban-bush-the-government-wants-to-build-20-storey-towers-on-its-bank-20250424-p5lty9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gardiners Creek is a rare slice of urban bush. The government wants to build 20-storey towers on its bank",
        "publish_date": "Mon, 28 Apr 2025 11:58:09 +1000",
        "category": "finance",
        "authors": [
            "Sophie Aubrey"
        ],
        "text": "Towers up to 20 storeys would loom over a coveted slice of urban bush under plans for the Suburban Rail Loop’s Burwood station precinct.\n\nThe move has prompted two eastern suburb councils to lash the lack of environment protections proposed for Gardiners Creek in submissions to the Suburban Rail Loop Authority after the release of draft plans for the precincts that will surround the six stations of the $34.5 billion railway line running between Cheltenham and Box Hill.\n\nTammie Zarro and Graham Scott, of the Friends of Gardiners Creek Reserve Burwood, share the concerns of Whitehorse and Monash councils. Credit: Joe Armao\n\nWhitehorse and Monash councils criticise the lack of requirements for affordable housing in the plans, neglect of community services and open space, introduction of maximum parking rates and absence of mandatory protections for Gardiners Creek and its reserve, also known as KooyongKoot.\n\nGardiners Creek snakes through the middle of Burwood’s Suburban Rail Loop station precinct, with buildings of 11 and 20 storeys deemed acceptable beside the creek’s eastern bank, and up to eight storeys abutting the western side.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/lidcombe-to-leichhardt-why-galvin-never-lost-the-love-even-if-his-teammates-did-20250428-p5lun3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lidcombe to Leichhardt: Why Galvin never lost the love, even if his teammates did",
        "publish_date": "Mon, 28 Apr 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Lachlan Galvin is sitting in a suburban dressing room surrounded by the sights, smells and sounds of rugby league.\n\nWests Tigers CEO Shane Richardson, when working as a rival CEO, more than once hosed down his players in the same Leichhardt Oval sheds because the Eighth wonder’s hot water wasn’t running.\n\nGalvin has showered and changed into club polo and dress shoes but went without socks, incoming stench and blisters not a concern.\n\nFair enough too. After the most tumultuous two weeks of his career when he has been back page and bulletin-leading news most every single day, not to mention clickbait gold and social media fodder, the kid couldn’t care less.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/referees-are-in-a-no-win-situation-with-high-tackle-crackdown-20250428-p5lup2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why referees are in a no-win situation with high-tackle crackdown",
        "publish_date": "Mon, 28 Apr 2025 11:47:16 +1000",
        "category": "sports",
        "authors": [
            "Roy Masters"
        ],
        "text": "Consider a missive sent out to NRL coaches ahead of round 8. It warned against a minor breach of “switching halves” – that is, the practice of the man about to feed a scrum, placing the ball quickly on the ground, then racing to take a place as first receiver in the backline, while another player detaches from the scrum, picks up the ball and feeds it into the scrum. Insofar as teams are not permitted to have more than seven backs at a scrum, this is a breach.\n\nAnother warning related to non-warnings – that is, referees are not obligated to issue a caution ahead of sin-binning a player. Then followed a list of sins such as “escorts”, “flops”, “rolled ball”, “stripping”, and marker depth.\n\nThese are not called crackdowns but “focus” areas, as in the line to clubs from NRL referees coach, David Fairleigh ahead of round 7: “You can expect the referee to have a higher focus on this area.” Then followed injunctions against “contact on the kicker”, “laying in the ruck”, “flops” and “checking of gear”.\n\nBut note that in these two missives, there is no warning of action against high tackles, despite round 8 producing a historic high 18 sin bins, 15 for contact with the head. That warning came after round 4 when NRL chief executive Andrew Abdo conceded officials had missed four high tackles where they should have sent players to the sin bin. NRL headquarters subsequently sent a memo to clubs warning of an increased incidence of “shoulder to the head” contact.\n\nIn the Penrith v Manly match, Sharpe penalised a Sea Eagles player for this offence but his captain challenged it and the bunker agreed. While some will say Sharpe got it wrong, the NRL will argue that video referee Ashley Klein got it right when he over-ruled her. Furthermore, headquarters will contend the recent action against high tackles is not so much an over-reaction, as it was with the plethora of penalties in magic round 2021, but a “correction” to the incidents in round 4.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/beauty/self-care-for-four-year-olds-the-rise-of-pre-teen-beauty-therapies-20250428-p5luna.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Self-care for four-year-olds? The rise of pre-teen beauty therapies",
        "publish_date": "Mon, 28 Apr 2025 11:39:31 +1000",
        "category": "lifestyle",
        "authors": [
            "Emily Retter"
        ],
        "text": "In France, child beauty salons, much like Moony’s, are opening at pace and finding themselves booked for months. In the States, the Sephora hashtag caught on after social media reported growing numbers of kids flocking to the stores, although Sephora itself makes it clear it does not put on make-over events. (A spokesperson says the company “does not offer a formal party programme for customers of any age” in the UK, and stresses that “children under 16 cannot sign up for or receive a beauty service without the permission and attendance of a parent.”) Nevertheless, children’s appetite for beauty products seems insatiable. Data from market research company NielsenIQ (NIQ) found US consumers under the age of 14 drove 49 per cent of drug store skincare sales in 2023. TikTok has a lot to do with it, say parents. Dewy-skinned children – many not yet teenagers – beam into their cameras demonstrating make-up and carefully curated beauty routines. The hashtag #GRWM – Get Ready With Me – has billions of views. Kim Kardashian’s 11-year-old daughter North West, whose joint account with her mother has 19.3 million followers, is an icon of these so-called “skinfluencers”. The Garza Crew (@garzacrew) with five million followers is another, and features a mum and her pre-tween twins from Oklahoma posting avidly.\n\nData from Statista reveals the baby and child skincare market is expected to experience a yearly rise of around 7.71 percent from now until 2028, when it will reach £299 million in market volume worldwide. Popular products with children include the brand Drunk Elephant. Slaai Makeup-Melting Butter Cleanser retails at £37 ($AU77). “Not every product in our line should be used by younger fans, 12 and under,” the website small print warns. Even Christian Dior has launched a Baby Dior skincare collection. Alcohol-free Bonne Étoile Scented Water retails at £230 ($AU479). Back in Havant, the birthday girl, five, is only concerned with one brand: Disney. Her outfit incorporates a yellow “Belle” dress and sparkly blue “Elsa” shoes. She giggles as her hair is brushed because it tickles, and selects a “do” from a picture menu. Coloured bands and glitter sit next to a very large can of “ultra strong power hold” hair spray. From the array of make-up, it’s the zany colours and glitter sticks that are chosen, but there are BB cream bases, mascaras, and blushers too, which I’m advised are for older children. At the nail bar I’m told the polishes are all child-friendly and peel off. The young customers exclaim when they feel the heat of the dryer, but bear with it with a surprisingly mature perseverance – albeit singing along to the Hokey Cokey.\n\nThe birthday girl’s dad says her love of beauty has “been more of a thing in the last year or so”. “She just loves princesses,” he says. “But she’ll still make horrible faces and some days just wants to wear what she’s picked off the floor.” Loading Wanting to wear make-up like a grown-up is perhaps nothing new. But there’s a shift at Moony’s second party of the day, for an 11-year-old, her nine-year-old sister, and their 11-year-old friend. They’re having facials and foot spas, and taking it seriously. They’re each presented with a mirror and a range of cosmetics. First, they’re instructed to cleanse their faces – I’m assured it’s water they’re using – and then move on to jade stone facial rollers, yoghurt and cucumber face masks, and moisturiser, which I’m told is emollient cream, suitable for babies. They stare intensely at their reflections as they sing along to Taylor Swift. After a quick face “mist” they are ushered to pink armchairs for brightly coloured “jelly foot spas”. No one can tell me what’s in this, but it looks like slime.\n\nThe girls – one shows me the fake eyelashes she’s wearing, a weekend treat – sigh as they sink their pale feet in. This is self-care, they say. The birthday girl’s mother explains she wanted to give her daughter the party she craved, but is candid about her worries. “She’s always on TikTok, and wants to use the new face serums, wear make-up at weekends,” she says, adding that she insists on buying all her daughter’s products and ensuring they’re gentle. Her younger daughter has expressed concerns about her appearance. “I tell her she’s beautiful and too young (to worry),” she says. Tessa Stevens, 49, is a skincare expert of 32 years. Over the past 18 months, she has received a growing number of enquiries about treatments like facials for children, but declines if they’re under 12. Over 12, she will usually only consider a consultation if they have a skin condition, such as acne. “I believe there is room for services in beauty clinics for our younger generation,” she says. “But this should be very limited. And it should always start with an in-depth consultation, which should include the parent, guardian or carer. Teaching them how to take care of their skin and reassuring them the changes they are going through are very normal.”\n\nTweens and teenage girls have long indulged in makeup and beauty treatments but the age group is now trending younger. Credit: Getty Images Many products aren’t appropriate for younger kids, she says, especially those containing salicylic acids, vitamin A and hyaluronic acid, trendy on TikTok. “Why a 10-year-old needs to use hyaluronic acid [popular for its anti-ageing properties] is beyond me,” she says. “Their skin’s an organ and it can’t tolerate those types of ingredients or daily exposure. It’s not developed properly yet. You can cause long-term damage.” She’s not against playful hair and make-up, but believes the environment of a salon, psychologically, isn’t appropriate for a young child. “We don’t need children to direct their thought process onto the way they’re looking,” she says. “My daughter is nine and she doesn’t even know what Sephora is.” She admits she has allowed her to attend a pamper party to join her friends, but they spoke about how it “wasn’t for everyday”. Tai was inspired by her own daughters, aged two and six, who adore beauty. “Growing up nowadays is so different,” she says. She hosts around five to six parties every weekend. Boys come too, although it’s primarily girls. She researches her products and emphasises the relaxation and bonding benefits of pampering, and the “playfulness”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/slice-of-annerley-history-goes-for-1-8-million-at-auction-20250428-p5luno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Slice of Annerley history goes for $1.8 million at auction",
        "publish_date": "Mon, 28 Apr 2025 11:33:20 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A slice of Annerley history has sold under the hammer for $1.8 million after three determined bidders fought “tooth and nail” for one of the suburb’s last original Queenslanders.\n\nSitting on an 810-square-metre block at 48 Junction Road, the 105-year-old home – “not even legal height downstairs” – has been barely touched in 20 years but still fetched more than its $1.75 million reserve while sailing hundreds of thousands past Annerley’s median house price.\n\nSeven registered bidders fronted up, but the contest boiled down to a local investor and an owner-occupier from central Queensland, with bidding starting at $1.4 million and climbing in $50,000 strides.\n\nSelling agent Matt Slater, of Atlas by LJ Hooker, said the feverish result reflected Annerley’s surging popularity and the shrinking supply of original Queenslanders on large blocks.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/election-spending-promises-threaten-australia-s-world-leading-credit-rating-20250428-p5lur2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Election spending promises threaten Australia’s world-leading credit rating",
        "publish_date": "Mon, 28 Apr 2025 11:26:36 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "One of the world’s biggest credit ratings agencies, S&P Global, has put the major parties on notice that Australia could lose its AAA credit rating if their election promises result in larger structural budget deficits.\n\nIn a statement this morning, the agency said sound budget management had underpinned Australia’s AAA rating for years. Change in net general government debt – which includes the federal and state governments – had averaged just 2 per cent of GDP since the global financial crisis of 2008-09.\n\nTreasurer Dr Jim Chalmers during a doorstop interview following the final leaders’ debate. Credit: Alex Ellinghausen\n\nBut S&P believes growing risks to the global economy, plus the use by both parties of off-budget commitments to meet their spending pledges, was putting the budget under risk.\n\n“The budget is already regressing to moderate deficits as public spending hits post-war highs, global trade tensions intensify, and growth slows,” it said, “how the elected government funds its campaign pledges and rising spending will be crucial for maintaining the rating.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/young-local-couple-fend-off-four-interstate-investors-for-900-500-home-20250428-p5lunn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young local couple fend off four interstate investors for $900,500 home",
        "publish_date": "Mon, 28 Apr 2025 11:17:21 +1000",
        "category": "finance",
        "authors": [
            "Abbir Dib"
        ],
        "text": "A young couple renting in Frankston North paid $900,500 for a family home in the suburb at a heated auction on Saturday, beating eight other bidders, including four investors from New South Wales.\n\nThe four-bedroom property at 10-11 Timbertop Court drew a crowd of about 75 people.\n\nIt was listed with a price guide of between $700,000 and $770,000. The reserve was set within that range, though the exact figure was not disclosed.\n\nSituated on a 1126-square-metre block, the home attracted a range of other bidders, including a mix of first-home buyers and downsizers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/all-time-lyon-blow-up-explained-20250428-p5luqv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'All-time' Lyon blow-up explained",
        "publish_date": "Mon, 28 Apr 2025 11:13:44 +1000",
        "category": "finance",
        "authors": [],
        "text": "'All-time' Lyon blow-up explained\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-is-the-conclave-heres-how-the-next-pope-is-chosen/jo9avs32z",
        "title": "What is the conclave? Everything to know about this centuries-old tradition",
        "publish_date": "Sun, 27 Apr 2025 23:04:58 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Following the death of Pope Francis, the Catholic Church is preparing for one of its most sacred traditions: The conclave.\n\n\n\n\n\nThe process is where cardinals from around the world gather to elect the next pope.\n\n\n\n\n\nHere's a breakdown of what the conclave is, how long it lasts, and when it will take place.\n\n\n\nWhat is the conclave?\n\nOver its 2,000-year history, spanning three millennia, the Catholic Church has had 266 popes.\n\n\n\n\n\nWhen a pope dies, cardinals arrive at the Vatican to elect a replacement in a process called the conclave.\n\n\n\nIt's a centuries-old tradition that takes place in the Sistine Chapel — the famous hall decorated with Michelangelo's art. Here, cardinals from around the world gather to cast anonymous votes for who they believe the next pope should be.\n\n\n\n\n\nThe Sistine Chapel is sealed off during the conclave to ensure total secrecy. No phones, media, or contact with the outside world is permitted.\n\n\n\n\n\nCardinals vote up to four times a day. They write their nominated names on white slips, which are counted by officials.\n\n\n\n\n\nAfter each round of voting, the ballots are burned in a custom stove. If no pope is elected, black smoke rises from the chapel chimney — a sign to the outside world that voting is continuing.\n\n\n\n\n\nWhite smoke signals a new pope has been elected, and the process is over.\n\n\n\nEdward Berger's 2024 film, Conclave, starred Ralph Fiennes in a fictional exploration of the conclave process. Source: AP / Philippe Antonello\n\nHow many cardinals vote in the conclave?\n\nOnly cardinals under the age of 80 can cast their vote for the new pope.\n\n\n\n\n\nIn 2025, there are 252 cardinals. While all of them can take part in the deliberations about who should be chosen, only those under 80 years old can vote.\n\n\n\n\n\nThis means there are only 135 eligible cardinal electors.\n\n\n\nThe country with the most eligible cardinal voters is Italy, with 17, followed by the United States with 10 and Brazil with seven.\n\n\n\n\n\nJust four are from the Oceania region, including Ukrainian-born Australian-based Bishop Mykola Bychok.\n\n\n\nWhen will the conclave take place?\n\nThe conclave usually begins between 15 to 20 days after the pope's death. This means the conclave is expected to gather between 6 May and 11 May.\n\n\n\n\n\nThe Vatican will confirm the exact date once the official mourning rituals, or 'novemdiales', are completed.\n\n\n\nHow long does the conclave last?\n\nThere's no set time period that conclaves last for. Voting continues until a candidate receives a two-thirds-plus-one majority.\n\n\n\n\n\nIn the past, conclaves have ranged from just one day to years. The longest was nearly three years (from 1268 to 1271) with the election of Pope Gregory X.\n\n\n\n\n\nIn more recent times, the process is typically resolved within a few days. The conclave that elected Francis in 2013 took five rounds of voting.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/final-showdown-leaders-debate-with-one-week-left-of-campaigning/bx91z4kw8",
        "title": "'Final showdown': leaders' debate with one week left of campaigning",
        "publish_date": "Sun, 27 Apr 2025 21:07:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Prime Minister and Opposition Leader have faced off in a fourth and final leaders debate hosted by Chanel 7.\n\n\n\n\n\nAnthony Albanese framed his pitch as a choice between continuing to build Australia's future, or going back to the past, arguing Labor offers certainty in an uncertain time.\n\n\n\n\n\nHe says the Coalition have chopped and changed with their policies throughout the campaign.\n\n\n\n\n\n\"Labor has a real plan for cost of living support today, whilst building with investment for tomorrow -- tax cuts for every Australian taxpayer; strengthening Medicare, including through our 1800Medicare line; making more things here in Australia; 20 per cent cut in student debt, and a 5 per cent deposit for first home owners.\"\n\n\n\n\n\nPeter Dutton sought to pin the blame for the high cost of living on the Prime Minister, saying Australians don't feel better off under Labor's watch.\n\n\n\n\n\nHe argues the Coalition will bring strong leadership during uncertain times, and represents change.\n\n\n\n\n\n\"This election is all about who can best manage the Australian economy, and if we can manage the economy well, it means that we can bring inflation down. It means that we can help families with the cost of living crisis that this government's created. We live in the best country in the world, but we do know that many families are doing it tough, and as we've moved around the country, we've spoken to families, literally in tears, they can't afford to put food on the table, they've stopped the registration renewal on their motor vehicle or on their house. They have had a tough three years under this government.\"\n\n\n\n\n\nThere were times when the debate took a personal turn, with Peter Dutton accusing Anthony Albanese of being a liar, and saying he should be ashamed.\n\n\n\n\n\n\"Well, Peter can attack me, but I tell you what I won't let him do, I won't let him attack the wages of working people. I won't let him attack the changes that were put in place for cheaper childcare. I won't let him abandon free TAFE so that people can get an opportunity in life. I won't get let him get away with this nonsense about economic management.\"\n\n\n\n\n\nMr Albanese pointed to two budget surpluses delivered by Labor, and inflation's return to the Reserve Bank's target band to defend his government's record on economic management.\n\n\n\n\n\nPeter Dutton countered by saying increased real wages don't compensate for the growing cost of groceries, suggesting that in fact, core inflation remains stubbornly high.\n\n\n\n\n\nThere were some rare points of agreement, though, including when host Mark Riley asked this.\n\n\n\n\n\n\"RILEY: Australia Day, should we change the date?\n\n\n\n\n\nALBANESE: \"No.\"\n\n\n\n\n\nDUTTON:: \"No.\"\n\n\n\n\n\nBeyond that, the leaders were less aligned on questions relating to Indigenous people.\n\n\n\n\n\nRILEY: \"Mr Dutton, as Prime Minister, we know you won't stand in front of the Indigenous flag. Will you have Welcome to Country ceremonies? Will you have smoking ceremonies? Will you acknowledge the traditional owners at your official events?”\n\n\n\n\n\nDUTTON: Well, Mark the point I've made in relation to the flag is that I don't believe that we can be the best country we can be if we're asking people to identify under different flags. No other country comparable to ours does that. I want to unite our country I want every Australian to be equal.\"\n\n\n\n\n\nPeter Dutton says it's \"fair enough\" to have a Welcome to Country ceremony for the opening of parliament as a mark of respect, but Australians have told him they're overdone, and this can cheapen the ceremony's significance.\n\n\n\n\n\nThe Opposition Leader says Welcome to Country ceremonies have the potential to divide the nation, also suggesting Anthony Albanese divided Australia with the failed referendum on an Indigenous Voice to Parliament.\n\n\n\n\n\nFor his part, Mr Albanese says he accepts the outcome of the Voice referendum, saying he has moved on, and preferring to frame Welcome to Country as a matter of choice.\n\n\n\n\n\n\"Well, from my perspective, it's a matter of respect, but it's also, of course, up to the organisations that are hosting an event of whether they have a Welcome to Country or not. It's up to them, and people will have different views, and people are entitled to their views, but we have a great privilege, from my perspective, of sharing this continent with the oldest continuous culture on Earth.\"\n\n\n\n\n\nThe leaders were also asked some lighter questions, including the price of one dozen eggs.\n\n\n\n\n\n\"DUTTON: About $4.20.\n\n\n\n\n\nRILEY: \"No, you might get half a dozen.\"\n\n\n\n\n\nBARR: \"Mr. Albanese?\"\n\n\n\n\n\nALBANESE: \"$7 If you can find them, because it's hard to find them at the moment. \"\n\n\n\n\n\nRILEY: \"Yeah, you're looking at, I reckon you're looking at eight plus. Nat?\"\n\n\n\n\n\nBARR: \"Yeah, there you go. It's the Sunny Queen 12 eggs from Woollies, they're $8.80. From Coles, they're slightly cheaper, at about $8.50.\"\n\n\n\n\n\nAnd the first thing they think of when shown a picture of US billionaire, Elon Musk, whom US President Donald Trump has tasked with cutting government spending:\n\n\n\n\n\nALBANESE: \"Tesla, and a very rich man.\"\n\n\n\n\n\nRILEY: \"Mr Dutton?\"\n\n\n\n\n\nDUTTON: \"I think evil genius.\"\n\n\n\n\n\nIn a follow up question, Peter Dutton was asked whether he's done enough to distance himself from the Trump administration's style, given Labor has sought to suggest the Coalition is adopting similar policies.\n\n\n\n\n\n\"I haven't sought to be anybody other than myself. And I believe very strongly that based on my experience working with John Howard very closely. He's been my political mentor, and I want to make sure we manage the economy, as he did.\"\n\n\n\n\n\nWith the election set for May 3, we will know soon enough how the style and message of both major parties resonates with Australian voters.\n\n\n\n\n\nMore than 13 per cent of ballots have already been cast through early voting, and with millions more expected in coming days, time's running out for the leaders to win voters over.\n\n\n\n\n\nChanel 7's panel of 60 undecided voters gave Mr Albanese the win, with half backing him, while 25 per cent picked Peter Dutton, and the final quarter said they remain undecided.\n\n\n\n\n\nIt's those voters the leaders will still hope to win over.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/driver-plows-through-crowd-at-filipino-festival-in-vancouver-morning-news-bulletin-28-april-2025/t7sovgw7s",
        "title": "Driver ploughs through crowd at Filipino festival in Vancouver | Morning News Bulletin 28 April 2025",
        "publish_date": "Sun, 27 Apr 2025 20:38:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nPeter Dutton criticises Welcome to Country ceremonies as \"overdone\".\n\nThe Filipino community in mourning after a deadly car-ramming attack in Vancouver.\n\nAnd in sport, Australian surfer Isabella Nichols claims victory at Bells Beach.\n\n----\n\n\n\n\n\nOpposition Leader Peter Dutton has criticised the frequency of Indigenous Welcome to Country ceremonies, saying they are \"overdone\" and divisive.\n\n\n\n\n\nThe topic has resurfaced in recent days after a known neo-Nazi booed during a Welcome to Country ceremony in Melbourne on ANZAC Day.\n\n\n\n\n\nMr Dutton has also reaffirmed his plan not to stand in front of the Aboriginal and Torres Strait Islander flags if he becomes Prime Minister.\n\n\n\n\n\nDuring the the fourth leaders' debate hosted by Channel Seven, Mr Dutton says he has firm views on Welcome to Country ceremonies.\n\n\n\n\n\n\"In relation to the Welcome to Country, otherwise, I think there is, and people have said this to me as we moved across the country, there is a sense across the community that it's overdone. For the opening of parliament, fair enough, it's respectful to do, but for the start of every meeting at work, or the start of a football game, I think a lot of Australians think it's overdone and it cheapens the significance of what it was meant to do. It divides the country, not dissimilar to what the Prime Minister did with the Voice.\"\n\n\n\n\n\nPrime Minister Anthony Albanese said it's up to individual organisations whether they hold Welcome to Country ceremonies, saying he sees them as being about respect.\n\n\n\n\n\n----\n\n\n\n\n\nAt least 11 people have died in Vancouver, after a car drove into a crowd at a Filipino festival In Canada.\n\n\n\n\n\nA 30-year-old man has been taken into custody.\n\n\n\n\n\nThe Filipino community had gathered to celebrate the Lapu Lapu Festival that honours their Indigenous leader Datu Lapu-Lapu, who fought against Spanish colonisation.\n\n\n\n\n\nMable Elmore is the first Filipino elected as Member of the Legislative Assembly of British Columbia.\n\n\n\n\n\nShe says the community is shattered by what's happened.\n\n\n\n\n\n\"Our community is grieving. I'm heartbroken. We're in incredible pain. The Filipino community will show true resilience. And we will come together out of this catastrophe. I also want to say that I encourage everyone who has been impacted. Please reach out. Talk to your friends and family.\"\n\n\n\n\n\n----\n\n\n\n\n\nCanadians head to the polls today in an election that has been overshadowed by the fallout from U-S President Donald Trump's tariffs.\n\n\n\n\n\nThe election was called earlier than expected, after former leader of the governing Liberal Party, Justin Trudeau, stepped down as his popularity slumped.\n\n\n\n\n\nMr Trudeau was replaced by former banker Mark Carney, who helped his party gain a narrow lead over the conservative opposition after becoming PM.\n\n\n\n\n\nSince then, the polls have tightened to become neck-and-neck, with Mr Carney campaigning on imposing tariffs in response to those imposed by Donald Trump.\n\n\n\n\n\n\"This is a time for serious leadership. It's time to come together and unite as a country because we need to fight, we need to protect, and we need build. We need to fight Trump's tariffs with counter-tariffs of our own that cause maximum damage in the United States with minimum impact here.\"\n\n\n\n\n\n----\n\n\n\n\n\nIsrael has struck the southern suburbs of Lebanon's capital Beirut in the latest violation of a November ceasefire deal between Israel and Hezbollah.\n\n\n\n\n\nA huge plume of smoke rose above the city skyline as firefighting trucks and Lebanese soldiers were deployed to the site.\n\n\n\n\n\nThere was no immediate information on casualties.\n\n\n\n\n\nThe Israeli army says it struck the southern Beirut building because it believed it was being used to store precision missiles belonging to Hezbollah - but they have so far not provided evidence.\n\n\n\n\n\nIt is the third Israeli strike on Beirut since the late November ceasefire.\n\n\n\n\n\nLocal resident Hussein al-Mokdad says the situation has become intolerable.\n\n\n\n\n\n\"I'm here, 50 metres away from the strike, this is the second time that we leave home, with our children and family. It's something that has become unbearable.\"\n\n\n\n\n\n----\n\n\n\n\n\nAustralian surfer Isabella Nichols has claimed the biggest victory of her career, by downing young Brazilian star Luana Silva at the Bells Beach women's final.\n\n\n\n\n\nThe 27-year-old threw down the gauntlet with a big early score of 8.33 points and backed it up to win 16.26 points to 12.67.\n\n\n\n\n\nAfter being named the winner, she told World Surfing League the victory felt unreal.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/this-trumpet-of-patriots-candidate-says-youre-wrong-about-clive-palmers-party/35karw936",
        "title": "This Trumpet of Patriots candidate says you're wrong about Clive Palmer's party",
        "publish_date": "Sun, 27 Apr 2025 19:34:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's easy to spot Ganesh Loke in a crowd thanks to his signature large-framed reflective sunglasses and big smile.\n\n\n\n\n\nThe Trumpet of Patriots candidate says it is important for a political candidate to have branding.\n\n\n\n\n\n\"It's good to be noticed out here,\" he told SBS News at a political forum hosted by the broadcaster in the western Sydney suburb of Parramatta on Thursday.\n\n\n\n\n\nLoke is contesting the federal electorate of Parramatta, which is held by Labor MP Andrew Charlton.\n\n\n\n\n\nHe first ran with the group in 2013, led by mining magnate Clive Palmer, when it was called the United Australia Party.\n\n\n\nOver a decade and multiple election defeats later, Loke said there's no other party he would rather be a candidate for.\n\n\n\n\n\n\"I'm always faithful and I'm always loyal to United Australia, which is now the Trumpet of Patriots,\" he said.\n\n\n\n\n\nAt the last election, one in three Australians voted for minor parties and independents. It's a trend he hopes continues in 2025.\n\n\n\n\n\n\"That will continue because people are fed up with the major parties. They want alternatives,\" he said.\n\n\n\nWhat does the Trumpet of Patriots stand for?\n\nAccording to its website, the party's key policies are:\n\n\n\nLaunch an investigation into wasteful government spending;\n\nCut immigration;\n\nAllow Australians to use their superannuation to buy housing and cap interest rates at 3 per cent;\n\nRepeal the ban on nuclear energy;\n\nExit the Paris Agreement on climate change action;\n\nGet the 'woke agenda' out of schools;\n\nHigh-speed rail;\n\nWithdraw from global organisations such as the World Health Organization and United Nations; and\n\nPlace a 15 per cent licence fee on all iron ore exports from Australia.\n\nTrumpet of Patriots chairman Clive Palmer at the party's campaign launch on 19 April. Source: AAP / Danny Casey\n\nControversy over adverts\n\nIn recent weeks the party has also caused controversy over its election advertisements, spending on which Palmer says has already reached $60 million.\n\n\n\n\n\nOne of the party's YouTube videos, which questions climate change and uses footage from a documentary, has been described as misleading because the footage was taken more than 20 years ago.\n\n\n\n\n\nA newspaper advert stating \"there are only two genders — male and female\" was also removed from the online edition of the Newcastle Herald after causing controversy.\n\n\n\n\n\nOnline ads stating \"We don't need to be welcomed to our own country\" were also run on the same day that booing during a Welcome to Country was reported at an Anzac Day service in Melbourne.\n\n\n\nLISTEN TO Party Time: The Players SBS News 10/04/2025 29:05 Play\n\nClive Palmer 'wants to help people'\n\nThe controversies have not impacted Loke's support for Palmer and his party.\n\n\n\n\n\n\"There are a lot of misconceptions. I would like to say Clive is a really good person. I have met Clive,\" Loke said of the party's leader.\n\n\n\n\n\n\"He could just sit there in his mansion and do nothing, but he wants to help people.\"\n\n\n\n\n\nLoke also explained that while the party name references US President Donald Trump, the Trumpet of Patriots does not take his policies.\n\n\n\nIf you look at our policies, they're different. But if Clive likes Trump, there's nothing wrong with it. [Trump's] trying to mediate to stop the war in Ukraine and Russia.\n\n\"So there are some good things that Trump is doing.\"\n\n\n\n\n\nHe added that he personally was not totally against or for Trump's policy decisions.\n\n\n\n\n\nAccording to the party's website, the cost of living is high as Australians are \"being ripped off\" by the political system.\n\n\n\n\n\n\"In the USA, government waste and corruption is finally being exposed. For too long, Australians have suffered from a Labor and Liberal duopoly of power supported by the Greens and now the Teals,\" it reads.\n\n\n\nPalmer says he is not worried about being compared to Trump and vowed the party would \"make Australia great again\", referencing Trump's campaign slogan.\n\n\n\n\n\nHe has also defended the party's candidate in the seat of Dickson (currently held by Opposition leader Peter Dutton), who is on bail for stalking and weapons charges.\n\n\n\n\n\n\"We believe that everybody's innocent until they're proven guilty,\" he said.\n\n\n\n\n\nAt the Trumpet of Patriots launch earlier this year, Palmer said the major parties were too focused on arguing over tax cuts and ignoring homeless people and those going hungry.\n\n\n\n\n\nHe has pledged $90 million to campaigning and is fielding more than a hundred candidates across the Senate and House of Representatives.\n\n\n\n'I would come to your house ... to help'\n\nLoke came to Australia from India in 1999, saying he had only $500 to his name and limited support.\n\n\n\n\n\n\"Twenty years back, I came to Australia with nothing. If I'm elected, I would like to be more accessible than the current MP,\" he said.\n\n\n\n\n\n\"I would come to your house if you have any issue to help you. That's what I want to change.\"\n\n\n\n\n\nSince emigrating, Loke has started an IT training business and manages a film production company.\n\n\n\n\n\nAs a candidate, his priorities are to bring down the cost of living, improve access to healthcare and reduce immigration.\n\n\n\n\n\nHe also values entrepreneurship, which is a trait he admires in Palmer.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-greens-could-hold-the-balance-of-power-in-parliament-so-what-do-they-stand-for/5bqp9f5wi",
        "title": "The Greens could hold the balance of power in parliament. So what do they stand for?",
        "publish_date": "Sun, 27 Apr 2025 01:04:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "In just three decades, the Greens have transformed from what was essentially an environmental protest movement to Australia's third largest party by vote.\n\n\n\n\n\nAt the 2022 election, the federal Australian Greens secured 12.2 per cent of the primary vote — an almost 2 per cent increase from the party's primary vote in 2019.\n\n\n\n\n\nThe Greens are looking to achieve even greater success on 3 May , capitalising on the bloc of generally more progressive Gen Z and millennial voters, who outnumber baby boomers for the first time this election.\n\n\n\n\n\nAs thousands flock to pre-polling centres, Greens leader Adam Bandt says the party is feeling confident.\n\n\n\n\n\n\"We're getting a terrific response on the doors, the streets and the polling booths to our plan to get dental and mental health into Medicare, finally tackle the housing and rental crisis, make child care free, and stop opening up new coal and gas mines in the middle of a climate crisis,\" the member for Melbourne says.\n\n\n\nWhat are the Greens' main policies?\n\nProfessor Rodney Smith from the University of Sydney says the Greens have been able to position themselves quite successfully as an alternative for disenchanted Labor voters who are looking for a more solid, leftist, or progressive policy package.\n\n\n\n\n\nKey promises from the Greens include:\n\n\n\nCancelling all student HECS debt;\n\nExpanding Medicare to cover dental;\n\nBanning new coal and gas projects; and\n\nIntroducing higher taxes on billionaires and big corporations.\n\nGreens leader Adam Bandt outside Melbourne's Luna Park earlier this month. The Greens have long campaigned for dental treatment to be covered by Medicare. Source: AAP / Nadir Kinani On the campaign trail, the party has also pledged to make HIV prevention medications PrEP and PEP free — a policy announced on the adult social media site OnlyFans , in a headline-grabbing move by Brisbane MP Stephen Bates.\n\n\n\n\n\nThey've also unveiled a national plan to provide free school meals.\n\n\n\n\n\nBut Greens MP Max Chandler-Mather, the party's housing and homelessness spokesperson, says housing is the \"defining issue\" of the election.\n\n\n\n\n\nThe party has put forward its own measures to tackle the housing crisis, including discounted mortgage rates and capping rents.\n\n\n\n\n\nIt will also scrap negative gearing and the capital gains tax discount for investors with more than one property.\n\n\n\n(From left) Ryan MP Elizabeth Watson-Brown, Greens leader Adam Bandt, Griffith MP Max Chandler-Mather and Brisbane MP Stephen Bates. Source: SBS News \"There's certainly a lot of people voting Greens for the first time in their lives because we're the only party with policies to make housing affordable,\" Mather says.\n\n\n\n\n\nMany voters have also voiced frustration with the major parties' handling of international issues, particularly the conflict in Gaza.\n\n\n\n\n\nThe Greens have taken a firm stance, pledging to continue calling for an end to the occupation of Palestinian territories and urging Israel to halt what they describe as an ongoing genocide in Gaza, a description backed by several prominent international organisations but repeatedly denied by Israel .\n\n\n\nHow powerful are the Greens?\n\nJill Sheppard, a professor of Australian Politics at the Australian National University, says the Greens' popularity in the Senate is particularly important.\n\n\n\n\n\nAs the Greens can't form government on their own, their policies are more an indication of how party members may vote on legislation, she says, and the number of seats they secure will determine how much power they'll wield over legislation in the upper house.\n\n\n\n\n\n\"Although we focus on the House of Representatives, particularly around an election because that's where government is won and lost, the Senate is still really important for passing legislation after the election,\" Sheppard says.\n\n\n\n\n\n\"There, the Greens have held the balance of power for quite a while. They are very experienced Senate negotiators, and so even if they are sidelined in some kind of independent-Labor minority government, they will still be strong in the upper house.\"\n\n\n\nPolls suggest the Greens are likely to retain the five Senate seats they are contesting in this election, meaning it's likely the party will retain its powerful 11-seat upper house voting bloc.\n\n\n\n\n\nIn the House of Representatives, Prime Minister Anthony Albanese has insisted he won't do a deal with the Greens to form government if Labor fails to win a majority.\n\n\n\n\n\nThe Coalition has frequently raised the prospect of a Labor-Greens alliance as a point of concern for voters, pointing out that the Greens and Labor usually recommend that voters put the other party in the second position on how-to-vote cards.\n\n\n\n\n\nSheppard says that, if Labor falls short of the 76 seats it needs for a majority, it will likely first look to independents to form government.\n\n\n\n\"They probably feel like they can work with [Independents] more easily ... without offering the Greens a spot in cabinet, which would be about the worst-case scenario for the ALP,\" Sheppard says.\n\n\n\n\n\n\"The major parties want you to think that a hung parliament is bad because they desperately want majority government for themselves. But a hung parliament isn't bad.\n\n\n\n\n\n\"We saw between 2010 and 2013 a minority government last the full term quite successfully.\"\n\n\n\n\n\nBandt has said that seeking a ministerial position would not be a priority for the party in the event of a hung parliament.\n\n\n\nThe Greens' relationship with Labor\n\nThe relationship between the Greens and Labor has also been fraught with tension, with both parties fighting to capture votes on the left side of politics.\n\n\n\n\n\n\"At the national level, the relationship between the Greens and Labor has never been a particularly happy one,\" Smith says.\n\n\n\n\n\n\"Initially, it was because there was a tension between Labor's union base and many of the environmental concerns and policies of the Greens.\n\n\n\n\n\n\"More recently, it's had to do with that trend of left voters moving their support away from the Labor Party to the Greens, and the Greens using their position to pressure Labor to shift its legislative agenda in a more progressive direction.\"\n\n\n\n'They didn't see us coming'\n\nThe Greens are defending their record number of lower house seats, three of which turned Green for the first time at the last election, shocking both major parties.\n\n\n\n\n\nAll three were inner-city Brisbane electorates. Griffith was won from Labor, while Brisbane and Ryan flipped from the Liberal National Party.\n\n\n\n\n\nRyan, once considered a rock-solid Liberal seat, is now a key battleground the Coalition is determined to reclaim.\n\n\n\n\n\n\"The LNP thinks they own that seat. I ousted them in 2022. They didn't see us coming then. They are certainly seeing us coming now,” Greens member for Ryan Elizabeth Watson-Brown says.\n\n\n\nLISTEN TO Climate Wars (Revisited): Party Time Ep 3 SBS News 17/04/2025 26:41 Play\n\nWatson-Brown says she's faced verbal abuse and her signs have been vandalised throughout her campaign.\n\n\n\n\n\nShe blamed far-right groups who \"want to oust [her] from the seat\" and said she's also concerned about the misinformation and disinformation that's being spread about her.\n\n\n\nGreens eyeing more seats\n\nThis year, the Greens are hopeful of picking up another Queensland seat — Moreton — located in Brisbane's south.\n\n\n\n\n\nMoreton's long-standing Labor MP Graham Perrett has held the seat since 2007 but is now retiring.\n\n\n\n\n\nGreens candidate Remah Naji, a tertiary education worker and mother-of-two, says people have told her they are fed up with the two major parties.\n\n\n\n\n\n\"They want action on the cost of living , groceries, childcare costs, rent increases, and mortgage stress,\" she said.\n\n\n\n\n\n\"People have told me that they're ready for change.\"\n\n\n\nGreens candidate Remah Naji says she's expecting a swing toward the party in the electorate where she's running. Source: SBS News Naji, who is the daughter of Palestinian refugees and grew up in Jordan before moving to Australia 12 years ago, also points to the Palestinian territories being a key issue, especially among the 7,000 Muslim voters in the electorate.\n\n\n\n\n\n\"They're traditionally Labor voters and they're switching to the Greens,\" she said.\n\n\n\n\n\nElsewhere in the country, the Greens have their eyes on five other electorates.\n\n\n\n\n\nThey are the safe Labor seats of Wills and Macnamara in Victoria, as well as Richmond in NSW and Perth in WA.\n\n\n\n\n\nAlso in their sights is the marginal Liberal seat of Sturt, South Australia.\n\n\n\nSheppard says the Greens are targeting seats with specific voter demographics, seeking to emulate their success in 2022.\n\n\n\n\n\nShe points to the Greens success in the seat of Ryan.\n\n\n\n\n\n\"Ryan has a really nice mix for the Greens of university students who are frustrated about job security, housing security, and concerned about the environment,\" she says.\n\n\n\n\n\n\"[It also has] wealthier people who are a little bit older, who have job security, quite a lot of wealth — and they are worried about the kinds of issues that affect their grandchildren, like access to education, health and climate change.\n\n\n\n\n\n\"It's that concentration of wealthy boomers and Gen X voters, alongside university students, that makes Ryan so perfect.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-shadow-foreign-affairs-spokesman-david-coleman/x1kyy27du",
        "title": "INTERVIEW: Coalition foreign affairs spokesman David Coleman",
        "publish_date": "Sat, 26 Apr 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-migrants-have-become-scapegoats-feccas-peter-doukas-voices-election-concerns/u36zmmrn0",
        "title": "INTERVIEW: 'Migrants have become scapegoats': FECCA's Peter Doukas voices election concerns",
        "publish_date": "Sat, 26 Apr 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/property/news/investors-beat-first-home-buyers-to-1-68m-lindfield-sub-penthouse-20250428-p5lunm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Investors beat first home buyers to $1.68m Lindfield sub-penthouse",
        "publish_date": "Mon, 28 Apr 2025 12:01:11 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "Local investors beat a young first home buyer couple to a Lindfield apartment at auction on Saturday, paying $1.68 million.\n\nThe three-bedroom home at 35/15-19 Havilah Road was billed as a luxury sub-penthouse and sold bang on its reserve price.\n\nThe home was guided at $1.6 million, bidding opened at $1.56 million and went up in $20,000 increments until it sold under the hammer.\n\nTwo parties registered for the home with a rental return of $1300 a week and leafy tree views. The winning bidders lived in Lindfield and were looking for an investment in the area.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-anthony-albanese-v-peter-dutton-leaders-debate-reaction-20250427-p5lul8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Dutton’s bus gets stuck in Sydney, Albanese visits NSW Central Coast",
        "publish_date": "Mon, 28 Apr 2025 11:59:51 +1000",
        "category": "finance",
        "authors": [
            "Olivia Ireland",
            "Nick Newling"
        ],
        "text": "One of the world’s biggest credit ratings agencies, S&P Global, has put the major parties on notice that Australia could lose its triple A credit rating if their election promises result in larger structural budget deficits.\n\nIn a statement this morning, the agency said sound budget management had underpinned Australia’s triple A rating for years. Change in net general government debt — which includes the federal and state governments — had averaged just 2 per cent of gross domestic product since the global financial crisis of 2008-09.\n\nTreasurer Dr Jim Chalmers during a doorstop interview following the final leaders’ debate. Credit: Alex Ellinghausen\n\nBut S&P believes growing risks to the global economy, plus the use by both parties of off-budget commitments to meet their spending pledges, was putting the budget at risk.\n\n“The budget is already regressing to moderate deficits as public spending hits post-war highs, global trade tensions intensify and growth slows,” it said, “how the elected government funds its campaign pledges and rising spending will be crucial for maintaining the rating.”\n\nAccording to the agency, “lax fiscal discipline at the state level” – of the states and territories, only WA has a triple-A rating – on top of the turmoil created by Donald Trump’s tariff war and growing demands in federally supported areas such as the NDIS, defence, health and aged care would likely increase general government deficits.\n\n“If major election commitments aren’t funded via additional revenues or savings, the deficit could widen further,” it said.\n\nLoading\n\nAnother concern raised by the agency is the use of off-budget items for major spending. The Albanese government has created several, such as its $19 billion Rewiring the Nation Fund and its $10 billion Housing Australia Fund.\n\nPeter Dutton is promising to axe both of these funds, but has promised to create his own Regional Australia Future Fund and a Future Generations Fund.\n\nS&P said the use of these funds was “increasingly obfuscating Australia’s fiscal position and borrowing needs”. In the March 25 budget, Treasurer Jim Chalmers forecast a deficit of $27.6 billion for the current financial year, widening to $42.1 billion in 2025-26. The budget is expected to remain in deficit for the rest of the decade and well into the 2030s.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/trump-s-billionaire-oil-industry-donors-aren-t-getting-what-they-wished-for-20250428-p5lunp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s billionaire oil industry donors aren’t getting what they wished for",
        "publish_date": "Mon, 28 Apr 2025 11:59:34 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Loading The International Energy Agency had forecast that demand for oil would increase about 1.03 million barrels a day. After Liberation Day it cut that forecast by about a third, to 730,000 barrels a day, saying about half that reduction was attributable to lower demand in the US and China as a result of the trade war. Demand is, of course, only half of the equation that generates prices. The other half is supply, and it is increasing even as demand is falling. On the day Trump unveiled his new tariffs, OPEC+ said they would unwind the 6 million barrels a day or so of cuts they have made over the past three years at a faster pace than they had previously planned, adding about 411,000 barrels a day to supply from next month. The move is seen as an attempt by Saudi Arabia, which has borne the brunt of the past cuts to production, to punish those members of the cartel that haven’t met their own commitments to constrain their production. Kazakhstan, the United Arab Emirates, Russia and Iraq have all been producing above their agreed caps.\n\nTrump’s “Golden Age” for US oil – he has said he wants to double US oil production, which reached record levels during the Biden administration – is not going to happen if demand weakens even as supply increases. He may get the other thing he wished for – lower US gasoline prices – but for less palatable reasons than the giant surge in US production he anticipated. The US shale sector is unlikely to take any heed of his urgings to “drill, baby, drill” while domestic oil prices are languishing at their current levels. While break-even levels for shale producers vary according to the richness and productivity of the various basins, a rough guide is that to break even – pay all costs, including operating and financing costs and also pay a dividend – US onshore oil companies need a price of between $US62 and $US65 a barrel. Today, however, it isn’t just the oil price that dictates whether they drill wells or not. Drilling rigs require lots of steel and there are also many components imported from China. Trump’s steel tariffs and his 145 per cent tariff on most imports from China are driving up the sector’s costs.\n\nToday’s shale industry has been heavily consolidated and is financially disciplined, with a focus on returns on capital. Where once Wall Street rewarded shale oil and gas companies for their production, now it rewards them for their returns on capital and punishes sub-optimal activity. Loading According to energy technology company Baker-Hughes, there are about 23 fewer oil rigs operating today than there were a year ago and, at 483, only just over half the record number of rigs –888 – set in 2018. Industry executives are warning that if prices fall back further, the number of operating rigs will fall much further. With the best fields’ reserves declining and costs increasing, the US shale sector was never going to double its production. While production was expected to continue to grow incrementally, peak production was expected to occur before the end of the decade, although Trump’s deregulation and opening of federal lands to exploration and drilling might have stretched the timeline.\n\nA US and, perhaps, global recession would, of course, further darken the outlook for demand and undermine the economics of production. While those recessions are not yet seen as probable, both the IMF’s odds on a US recession and those of private forecasters have been shortening. The risk of a severe downturn in the economy adds another layer of uncertainty to the outlook for US energy companies, as does the potential for Trump to do a deal with Vladimir Putin that would lift the sanctions on Russian oil (Russian drilling has already begun increasing in anticipation) and add to the global surplus of supply. Early this month, Trump’s energy secretary, Chris Wright, told the Financial Times that the shale producers could boost their output even at $US50 a barrel. Less than a fortnight later he said $US50 a barrel oil wasn’t sustainable for producers. Wright, before taking up the role in the administration, was chief executive of Denver-based Liberty Energy – America’s second-biggest “fracker” – which earlier this month announced a first-quarter profit of $US20 million, down from $US82 million in the same quarter last year and the $US52 million it earned in the December quarter last year. Liberty’s share price was around $US22.60 when Trump took office again. Today’s it’s just over $US12. The company’s market capitalisation has slumped from $US3.7 billion to $US1.97 billion over that period.\n\nLoading The current chief executive, Ron Gusek, believes that producers can maintain their drilling at current levels as long as the price remains in the low $US60s a barrel but are likely to start shutting down wells if the prices dropped any further. Maybe he had a chat with Wright, although the precipitous fall in his old company’s share price might also have grabbed Wright’s attention. Trump’s “babies” aren’t going to increase their drilling and production at current prices. At best they will, regardless of his urgings, try to maintain current levels. At worst? Trump’s tariffs, a US and global economic slowdown/recession and rising production volumes from OPEC+ will result in production cuts to a sector that generated more than 15 per cent of America’s exports last year and gave the country a $US45 billion energy surplus. The billionaire donors to Trump’s campaign should, perhaps, have been more careful of what they wished for, looking beyond his energy and tax policies to his wider platform, and the trade policies in particular.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/gardiners-creek-is-a-rare-slice-of-urban-bush-the-government-wants-to-build-20-storey-towers-on-its-bank-20250424-p5lty9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gardiners Creek is a rare slice of urban bush. The government wants to build 20-storey towers on its bank",
        "publish_date": "Mon, 28 Apr 2025 11:58:09 +1000",
        "category": "finance",
        "authors": [
            "Sophie Aubrey"
        ],
        "text": "Towers up to 20 storeys would loom over a coveted slice of urban bush under plans for the Suburban Rail Loop’s Burwood station precinct.\n\nThe move has prompted two eastern suburb councils to lash the lack of environment protections proposed for Gardiners Creek in submissions to the Suburban Rail Loop Authority after the release of draft plans for the precincts that will surround the six stations of the $34.5 billion railway line running between Cheltenham and Box Hill.\n\nTammie Zarro and Graham Scott, of the Friends of Gardiners Creek Reserve Burwood, share the concerns of Whitehorse and Monash councils. Credit: Joe Armao\n\nWhitehorse and Monash councils criticise the lack of requirements for affordable housing in the plans, neglect of community services and open space, introduction of maximum parking rates and absence of mandatory protections for Gardiners Creek and its reserve, also known as KooyongKoot.\n\nGardiners Creek snakes through the middle of Burwood’s Suburban Rail Loop station precinct, with buildings of 11 and 20 storeys deemed acceptable beside the creek’s eastern bank, and up to eight storeys abutting the western side.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/lidcombe-to-leichhardt-why-galvin-never-lost-the-love-even-if-his-teammates-did-20250428-p5lun3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lidcombe to Leichhardt: Why Galvin never lost the love, even if his teammates did",
        "publish_date": "Mon, 28 Apr 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Lachlan Galvin is sitting in a suburban dressing room surrounded by the sights, smells and sounds of rugby league.\n\nWests Tigers CEO Shane Richardson, when working as a rival CEO, more than once hosed down his players in the same Leichhardt Oval sheds because the Eighth wonder’s hot water wasn’t running.\n\nGalvin has showered and changed into club polo and dress shoes but went without socks, incoming stench and blisters not a concern.\n\nFair enough too. After the most tumultuous two weeks of his career when he has been back page and bulletin-leading news most every single day, not to mention clickbait gold and social media fodder, the kid couldn’t care less.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/referees-are-in-a-no-win-situation-with-high-tackle-crackdown-20250428-p5lup2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why referees are in a no-win situation with high-tackle crackdown",
        "publish_date": "Mon, 28 Apr 2025 11:47:16 +1000",
        "category": "sports",
        "authors": [
            "Roy Masters"
        ],
        "text": "Consider a missive sent out to NRL coaches ahead of round 8. It warned against a minor breach of “switching halves” – that is, the practice of the man about to feed a scrum, placing the ball quickly on the ground, then racing to take a place as first receiver in the backline, while another player detaches from the scrum, picks up the ball and feeds it into the scrum. Insofar as teams are not permitted to have more than seven backs at a scrum, this is a breach.\n\nAnother warning related to non-warnings – that is, referees are not obligated to issue a caution ahead of sin-binning a player. Then followed a list of sins such as “escorts”, “flops”, “rolled ball”, “stripping”, and marker depth.\n\nThese are not called crackdowns but “focus” areas, as in the line to clubs from NRL referees coach, David Fairleigh ahead of round 7: “You can expect the referee to have a higher focus on this area.” Then followed injunctions against “contact on the kicker”, “laying in the ruck”, “flops” and “checking of gear”.\n\nBut note that in these two missives, there is no warning of action against high tackles, despite round 8 producing a historic high 18 sin bins, 15 for contact with the head. That warning came after round 4 when NRL chief executive Andrew Abdo conceded officials had missed four high tackles where they should have sent players to the sin bin. NRL headquarters subsequently sent a memo to clubs warning of an increased incidence of “shoulder to the head” contact.\n\nIn the Penrith v Manly match, Sharpe penalised a Sea Eagles player for this offence but his captain challenged it and the bunker agreed. While some will say Sharpe got it wrong, the NRL will argue that video referee Ashley Klein got it right when he over-ruled her. Furthermore, headquarters will contend the recent action against high tackles is not so much an over-reaction, as it was with the plethora of penalties in magic round 2021, but a “correction” to the incidents in round 4.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/beauty/self-care-for-four-year-olds-the-rise-of-pre-teen-beauty-therapies-20250428-p5luna.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Self-care for four-year-olds? The rise of pre-teen beauty therapies",
        "publish_date": "Mon, 28 Apr 2025 11:39:31 +1000",
        "category": "lifestyle",
        "authors": [
            "Emily Retter"
        ],
        "text": "In France, child beauty salons, much like Moony’s, are opening at pace and finding themselves booked for months. In the States, the Sephora hashtag caught on after social media reported growing numbers of kids flocking to the stores, although Sephora itself makes it clear it does not put on make-over events. (A spokesperson says the company “does not offer a formal party programme for customers of any age” in the UK, and stresses that “children under 16 cannot sign up for or receive a beauty service without the permission and attendance of a parent.”) Nevertheless, children’s appetite for beauty products seems insatiable. Data from market research company NielsenIQ (NIQ) found US consumers under the age of 14 drove 49 per cent of drug store skincare sales in 2023. TikTok has a lot to do with it, say parents. Dewy-skinned children – many not yet teenagers – beam into their cameras demonstrating make-up and carefully curated beauty routines. The hashtag #GRWM – Get Ready With Me – has billions of views. Kim Kardashian’s 11-year-old daughter North West, whose joint account with her mother has 19.3 million followers, is an icon of these so-called “skinfluencers”. The Garza Crew (@garzacrew) with five million followers is another, and features a mum and her pre-tween twins from Oklahoma posting avidly.\n\nData from Statista reveals the baby and child skincare market is expected to experience a yearly rise of around 7.71 percent from now until 2028, when it will reach £299 million in market volume worldwide. Popular products with children include the brand Drunk Elephant. Slaai Makeup-Melting Butter Cleanser retails at £37 ($AU77). “Not every product in our line should be used by younger fans, 12 and under,” the website small print warns. Even Christian Dior has launched a Baby Dior skincare collection. Alcohol-free Bonne Étoile Scented Water retails at £230 ($AU479). Back in Havant, the birthday girl, five, is only concerned with one brand: Disney. Her outfit incorporates a yellow “Belle” dress and sparkly blue “Elsa” shoes. She giggles as her hair is brushed because it tickles, and selects a “do” from a picture menu. Coloured bands and glitter sit next to a very large can of “ultra strong power hold” hair spray. From the array of make-up, it’s the zany colours and glitter sticks that are chosen, but there are BB cream bases, mascaras, and blushers too, which I’m advised are for older children. At the nail bar I’m told the polishes are all child-friendly and peel off. The young customers exclaim when they feel the heat of the dryer, but bear with it with a surprisingly mature perseverance – albeit singing along to the Hokey Cokey.\n\nThe birthday girl’s dad says her love of beauty has “been more of a thing in the last year or so”. “She just loves princesses,” he says. “But she’ll still make horrible faces and some days just wants to wear what she’s picked off the floor.” Loading Wanting to wear make-up like a grown-up is perhaps nothing new. But there’s a shift at Moony’s second party of the day, for an 11-year-old, her nine-year-old sister, and their 11-year-old friend. They’re having facials and foot spas, and taking it seriously. They’re each presented with a mirror and a range of cosmetics. First, they’re instructed to cleanse their faces – I’m assured it’s water they’re using – and then move on to jade stone facial rollers, yoghurt and cucumber face masks, and moisturiser, which I’m told is emollient cream, suitable for babies. They stare intensely at their reflections as they sing along to Taylor Swift. After a quick face “mist” they are ushered to pink armchairs for brightly coloured “jelly foot spas”. No one can tell me what’s in this, but it looks like slime.\n\nThe girls – one shows me the fake eyelashes she’s wearing, a weekend treat – sigh as they sink their pale feet in. This is self-care, they say. The birthday girl’s mother explains she wanted to give her daughter the party she craved, but is candid about her worries. “She’s always on TikTok, and wants to use the new face serums, wear make-up at weekends,” she says, adding that she insists on buying all her daughter’s products and ensuring they’re gentle. Her younger daughter has expressed concerns about her appearance. “I tell her she’s beautiful and too young (to worry),” she says. Tessa Stevens, 49, is a skincare expert of 32 years. Over the past 18 months, she has received a growing number of enquiries about treatments like facials for children, but declines if they’re under 12. Over 12, she will usually only consider a consultation if they have a skin condition, such as acne. “I believe there is room for services in beauty clinics for our younger generation,” she says. “But this should be very limited. And it should always start with an in-depth consultation, which should include the parent, guardian or carer. Teaching them how to take care of their skin and reassuring them the changes they are going through are very normal.”\n\nTweens and teenage girls have long indulged in makeup and beauty treatments but the age group is now trending younger. Credit: Getty Images Many products aren’t appropriate for younger kids, she says, especially those containing salicylic acids, vitamin A and hyaluronic acid, trendy on TikTok. “Why a 10-year-old needs to use hyaluronic acid [popular for its anti-ageing properties] is beyond me,” she says. “Their skin’s an organ and it can’t tolerate those types of ingredients or daily exposure. It’s not developed properly yet. You can cause long-term damage.” She’s not against playful hair and make-up, but believes the environment of a salon, psychologically, isn’t appropriate for a young child. “We don’t need children to direct their thought process onto the way they’re looking,” she says. “My daughter is nine and she doesn’t even know what Sephora is.” She admits she has allowed her to attend a pamper party to join her friends, but they spoke about how it “wasn’t for everyday”. Tai was inspired by her own daughters, aged two and six, who adore beauty. “Growing up nowadays is so different,” she says. She hosts around five to six parties every weekend. Boys come too, although it’s primarily girls. She researches her products and emphasises the relaxation and bonding benefits of pampering, and the “playfulness”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/slice-of-annerley-history-goes-for-1-8-million-at-auction-20250428-p5luno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Slice of Annerley history goes for $1.8 million at auction",
        "publish_date": "Mon, 28 Apr 2025 11:33:20 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A slice of Annerley history has sold under the hammer for $1.8 million after three determined bidders fought “tooth and nail” for one of the suburb’s last original Queenslanders.\n\nSitting on an 810-square-metre block at 48 Junction Road, the 105-year-old home – “not even legal height downstairs” – has been barely touched in 20 years but still fetched more than its $1.75 million reserve while sailing hundreds of thousands past Annerley’s median house price.\n\nSeven registered bidders fronted up, but the contest boiled down to a local investor and an owner-occupier from central Queensland, with bidding starting at $1.4 million and climbing in $50,000 strides.\n\nSelling agent Matt Slater, of Atlas by LJ Hooker, said the feverish result reflected Annerley’s surging popularity and the shrinking supply of original Queenslanders on large blocks.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/election-spending-promises-threaten-australia-s-world-leading-credit-rating-20250428-p5lur2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Election spending promises threaten Australia’s world-leading credit rating",
        "publish_date": "Mon, 28 Apr 2025 11:26:36 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "One of the world’s biggest credit ratings agencies, S&P Global, has put the major parties on notice that Australia could lose its AAA credit rating if their election promises result in larger structural budget deficits.\n\nIn a statement this morning, the agency said sound budget management had underpinned Australia’s AAA rating for years. Change in net general government debt – which includes the federal and state governments – had averaged just 2 per cent of GDP since the global financial crisis of 2008-09.\n\nTreasurer Dr Jim Chalmers during a doorstop interview following the final leaders’ debate. Credit: Alex Ellinghausen\n\nBut S&P believes growing risks to the global economy, plus the use by both parties of off-budget commitments to meet their spending pledges, was putting the budget under risk.\n\n“The budget is already regressing to moderate deficits as public spending hits post-war highs, global trade tensions intensify, and growth slows,” it said, “how the elected government funds its campaign pledges and rising spending will be crucial for maintaining the rating.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/young-local-couple-fend-off-four-interstate-investors-for-900-500-home-20250428-p5lunn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young local couple fend off four interstate investors for $900,500 home",
        "publish_date": "Mon, 28 Apr 2025 11:17:21 +1000",
        "category": "finance",
        "authors": [
            "Abbir Dib"
        ],
        "text": "A young couple renting in Frankston North paid $900,500 for a family home in the suburb at a heated auction on Saturday, beating eight other bidders, including four investors from New South Wales.\n\nThe four-bedroom property at 10-11 Timbertop Court drew a crowd of about 75 people.\n\nIt was listed with a price guide of between $700,000 and $770,000. The reserve was set within that range, though the exact figure was not disclosed.\n\nSituated on a 1126-square-metre block, the home attracted a range of other bidders, including a mix of first-home buyers and downsizers.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/all-time-lyon-blow-up-explained-20250428-p5luqv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'All-time' Lyon blow-up explained",
        "publish_date": "Mon, 28 Apr 2025 11:13:44 +1000",
        "category": "finance",
        "authors": [],
        "text": "'All-time' Lyon blow-up explained\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]