[
    {
        "url": "https://www.9news.com.au/national/donald-trump-tariffs-norfolk-island-australia-export-tariffs-stock-market-finance-news/be1d5184-f7a2-492b-a6e0-77f10b02665d",
        "title": "No explanation why Norfolk Island's tariffs are nearly triple the rest of Australia's",
        "publish_date": "Thu, 03 Apr 2025 00:06:02 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A tiny Australian territory has been handed a US tariff nearly triple what the rest of the country has received .\n\nAs the rest of Australia was dealt a 10 per cent tariff from Donald Trump this morning, Norfolk Island received 29 per cent.\n\nThe White House offered no explanation for the disparity.\n\nLIVE UPDATES: Trump reveals tariff rate on Australia\n\nNorfolk Island has a population of about 2000 people. (Adobe Stock)\n\nWhen asked about it today, Prime Minister Anthony Albanese was baffled.\n\n\"I'm not quite sure that Norfolk Island, with respect to it, is a trade competitor with the giant economy of the United States,\" he said.\n\n\"But that just shows and exemplifies the fact that nowhere on Earth is exempt from this.\n\n\"I'm not sure what Norfolk Island's major exports are to the US or why it has been singled out, but it has.\"\n\nNorfolk Island is about 1400km east of the Australian mainland and has a population of about 2000 people.\n\nThe White House also specified that 10 per cent tariffs would be placed on Heard and McDonald Islands, another Australian territory.\n\nBut both islands close to the Antarctic are uninhabited.\n\nPresident Donald Trump speaks during an event to announce new tariffs in the Rose Garden at the White House (AP)\n\nChristmas Island, another Australian territory, has also been named in the list, with the same 10 per cent tariff as the rest of the country.\n\nAccording to the Associated Press, Trump's new tariffs won't affect those already in place.\n\nAs far as Australia's concerned, that means steel and aluminium tariffs will remain as is, without alteration.\n\nTariffs on goods from Canada and Mexico also remain unchanged.\n\nTrump announced earlier his global tariffs would come into effect \"from midnight\".\n\nAssuming that's midnight in Washington DC, that would be 3pm AEDT, 2pm AEST, 2.30pm in South Australia, 1.30pm in the Northern Territory, and noon in Perth.\n\nIn Norfolk Island, the tariffs will kick in at 4pm.\n\nPresident Donald Trump departs after signing an executive order at an event to announce new tariffs in the Rose Garden of the White House, Wednesday, April 2, 2025, in Washington. (AP)\n\nNot a lot of time for importers or exporters to prepare - although this has been flagged for some time now.\n\nTrade Minister Don Farrell says Australia will continue to sell into the US.\n\n\"When China imposed a 220 per cent tariff on Australian wine, that killed wine exports the next day, stone dead,\" he said.\n\n\"That's not what has happened here. Australian wine will now apparently go into the United States at a 10 per cent tariff. We'll still continue to sell wine into the United States.\"\n\nHe also flagged the possibility of a new free trade agreement with the European Union, negotiations toward which had previously fallen over.\n\n\"The world has changed as of today. The world has changed for Europe,\" he said.\n\n\"Europe is now subject to a much higher tariff into the United States.\n\n\"If they're sensible, they make us a better offer on the issues that made the agreement fall over last time, and we'll get a free trade agreement with the EU.\"\n\nNorfolk Island is about 1400km off the coast of mainland Australia. (Norfolk Island Tourism)",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/tesla-stocks-sales-drop-13-per-cent-in-first-quarter-as-elon-musk-backlash-ageing-models-hurt-demand/b195f4bd-4d37-4eac-ab83-c760ffedd60e",
        "title": "'Disaster on every metric': Tesla sales tumble amid Musk backlash",
        "publish_date": "Wed, 02 Apr 2025 14:17:42 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Tesla sales declined 13 per cent in the first three months of the year, another sign that Elon Musk 's once high-flying electric car company is struggling to attract buyers.\n\nThe double-digit drop is likely due to a combination of factors, including its ageing lineup, competition from rivals and a backlash from Musk's embrace of right-wing politics.\n\nIt also is a warning that the company's first-quarter earnings report later this month could disappoint investors.\n\nTesla CEO Elon Musk speaks before unveiling the Model Y at Tesla's design studio in 2019. (AP Photo/Jae C Hong, File)\n\nTesla reported deliveries of 336,681 globally in the January to March quarter. The figure was down from sales of 387,000 in the same period a year ago. The decline came despite deep discounts, zero financing and other incentives.\n\nAnalysts polled by FactSet expected much higher deliveries of 408,000.\n\nDan Ives of Wedbush said in a note to clients that Tesla is seeing soft demand in the US and China, as well as facing pressure in Europe.\n\n\"The brand crisis issues are clearly having a negative impact on Tesla...there is no debate,\" he said.\n\nIves said that Wall Street and analysts alike knew that the first-quarter figures were likely to be bad, but that it was even worse than expected.\n\n\"We are not going to look at these numbers with rose-colored glasses ... they were a disaster on every metric,\" he said.\n\nProtesters hold signs in Walnut Creek, California, on Saturday, March 29, 2025, during a demonstration against Elon Musk and the President Donald Trump administration. (Jose Carlos Fajardo/Bay Area News Group via AP)\n\nA Tesla car dealership stands doused in blue paint following vandalism by activists of the group New Generation on March 31, 2025 in Berlin, Germany. (Photo by Omer Messinger/Getty Images)\n\nTesla's stock has plunged by roughly half since hitting a mid-December record as expectations of a lighter regulatory touch and big profits with Donald Trump as president were replaced by fear that the boycott of Musk's cars and other problems could hit the company hard.\n\nAnalysts are still not sure exactly how much the fall in sales is due to the protests or other factors.\n\nElectric car sales have been sluggish in general, and Tesla in particular is suffering as car buyers hold off from buying its bestselling Model Y because of plans for an updated version later this year.\n\nThe Austin, Texas, electric vehicle maker has also lost market share to rivals in recent months as their offerings improve, including those of BYD.\n\nProtesters shout at a Tesla Cybertruck as people begin to arrive for a town hall with Elon Musk, Sunday, March 30, 2025, in Green Bay, Wisconsin. (AP Photo/Jeffrey Phelps)\n\nThe Chinese EV giant unveiled in March a technology that allows it cars to charge up in just a few minutes.\n\nShares of Tesla slipped nearly 6 per cent in early trading on Wednesday.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/nintendo-switch-2-every-detail-revealed-price-release-date-explainer/939f9aff-c851-47d9-9429-ab9d1b519ca9",
        "title": "Nintendo Switch 2: Every detail revealed",
        "publish_date": "Wed, 02 Apr 2025 16:47:07 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "The Nintendo Switch 2 will hit Australian shelves on June 5, 2025.\n\nMario Kart World , Donkey Kong Bananza and an exclusive game by Elden Ring's From Software headlined the announcements in today's Nintendo Direct.\n\nHere's everything you need to know about Nintendo's sequel to its best console.\n\nNintendo Switch 2 will hit Australian shelves on June 5, 2025. (Nintendo)\n\nHow much will it cost?\n\nThe Nintendo Switch 2 will cost Australians $699.\n\nThat's better than many expected after hearing the console would cost $US449 ($713).\n\nThere will also be a bundle with Mario Kart World included for $769.\n\nThe original Nintendo Switch launched on March 3, 2017, for $469.95.\n\nThen Nintendo Switch Lite arrived on September 20, 2019, for $329.95 and the Nintendo Switch OLED model hit shelves on October 8, 2021, with a price tag of $539.95.\n\nBy comparison, a PlayStation 5 and an Xbox Series X both cost $799.\n\nNintendo Switch 2 accessories. (Nintendo)\n\nWhen (and how) can you buy one?\n\nPre-orders have already begun, with EB Games the first cab off the rank to announce their pre-orders for Australians. Further details will come through individual retailers.\n\nIt's rare to find new consoles available on store shelves at launch but Nintendo has promised to \"take all possible measures\" to combat scalping with the Switch 2.\n\nScalpers contributed to a shortage of the original Switch back in 2017.\n\nNintendo president Shuntaro Furukawa told Japanese magazine Nikkei \"we are making preparations\" when asked about scalping, and the company is believed to be manufacturing far more stock this time.\n\nHow powerful is the Nintendo Switch 2?\n\nNintendo, like Apple, doesn't usually go into extreme detail about power.\n\nHowever, we got a lot of information about the Nintendo Switch 2.\n\nMetroid Prime 4: Beyond (Nintendo)\n\nMetroid Prime 4 Beyond will have two modes on Switch 2; one pushing 4K 60FPS and another at 1080p and 120FPS when docked.\n\nThe console will also handle HDR (High Dynamic Range) for better quality images.\n\nA fan is built into the Nintendo Switch 2 dock to keep the system cool during more taxing sessions.\n\nHow good is its screen?\n\nThe Switch 2 has a 7.9 inch LCD screen which is roughly 30 per cent larger than the display on the original Switch. (Nintendo)\n\nThe Switch 2 has a 7.9 inch LCD screen which is roughly 30 per cent larger than the display on the original Switch and 15 per cent larger than its OLED model.\n\nSome fans would have preferred an OLED display, but a 1080p LCD is far from a backward step.\n\nThe 120Hz display (up from 60Hz) is a huge addition here and will allow for smoother and more responsive games.\n\nWait… mouse mode is real?\n\nNintendo's new Joy-Con aren't just magnetic - they're a mouse!\n\nNintendo Switch 2 ... Mouse? (Nintendo)\n\nEach controller can be turned sideways and dragged across a surface (or your leg) to move a pointer on screen or, in one example, Drag + Drive , you'll push them forward like you're pushing a wheelchair.\n\nGameChat\n\nWe finally know what the mysterious 'C' button does too.\n\nNintendo spent way more time on this than I expected.\n\nA camera can be plugged into your Nintendo Switch 2, allowing for video chats with friends during games via a built in microphone.\n\nThese video feeds don't look great. They're low resolution and low framerates, but maybe you don't need those when you're focused on your screen.\n\nGameChat seemingly allows you to play online with friends with a press of a button. (Nintendo)\n\nI'm not super sold on the concept (yet) but Nintendo is.\n\nTheir tag line for GameChat, and the Nintendo Switch 2 itself, is \"All together, Anytime, Anywhere.\"\n\nNintendo also confirmed a \"GameShare\" feature which will allow you to play your multiplayer games with friends, even if they don't own that game.\n\nMore details about GameChat are coming from Nintendo on Friday. ﻿\n\nCan I play my old games on the Switch 2?\n\nYes, most of the time. Nintendo has confirmed the Switch 2 will be able to play digital and physical Switch games.\n\nSome games like Nintendo Labo or Ring Fit Adventure may not be fully compatible because they use physical accessories which are designed for the original Joy-Con.\n\nNintendo Switch 2 Edition games will not work on an original Nintendo Switch.\n\nThe most anticipated video games of 2025 View Gallery\n\nHow many games can the Nintendo Switch 2 fit?\n\nThe Switch 2 has 256GB of \"faster\" storage.\n\nThat's a major upgrade over the original Switch which had just 32GB of internal storage.\n\nNintendo are the masters of small file sizes but still pushed 18.2 GB for The Legend of Zelda: Tears of the Kingdom .\n\nOn the Switch 2, you'd be able to fit 14 games of that size.\n\nIf you'd like to upgrade your storage space, you'll need a MicroSD Express card.\n\nRegular MicroSD cards, which you might already have for your Switch, will not work on Nintendo Switch 2.\n\nHow long will its battery last?\n\nWe don't know.\n\nNintendo focused a lot on specs but battery life didn't get a mention!\n\nThe Nintendo Switch had a battery life of 2.5 - 6 hours at launch.\n\nBetter batteries and the OLED model eventually improved battery life to 4.5 - 9 hours.\n\nWhen will I be able to play one?\n\nIn Australia, Nintendo is holding one preview event and tickets are already exhausted.\n\nMelbourne is the only Aussie city getting a preview event on May 10 - 11.\n\nOther preview events around the world include:\n\nNorth America Europe Asia New York, April 4-6 Los Angeles, April 11-13 Dallas, April 25-27 Toronto, April 25-27 Paris, April 4-6 London, April 11-13 Milan, April 25-27 Berlin, April 25-27 Madrid, May 9-11 Amsterdam, May 9-11 Tokyo, April 26-27 Seoul, May 31-June 1 Hong Kong, TBA Taipei, TBA\n\nHere's everything you'll get in the box:\n\nNintendo Switch 2 console\n\nJoy-Con 2 controllers (L+R)\n\nJoy-Con 2 Grip\n\nJoy-Con 2 Straps\n\nNintendo Switch 2 Dock\n\nUltra High-Speed HDMI Cable\n\nNintendo Switch 2 AC Adapter\n\nUSB-C Charging Cable\n\nNintendo President Shuntaro Furukawa says \"Nintendo Switch 2 is the next step in at-home gaming that can be taken on the go based on eight years of play and discovery that began with Nintendo Switch\".\n\n\"With its new features that expand the possibilities of gaming experiences, I truly believe that Nintendo Switch 2 is a leap forward in our journey of putting smiles on the faces of everyone that Nintendo touches,\" he said.\n\nMore details on the Nintendo Switch 2 are expected in the coming weeks. ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/val-kilmer-death-life-career-in-pictures-through-the-years/69ad6a87-0721-4193-9386-f16fae07d134",
        "title": "From Iceman to Batman: Val Kilmer's life and career in pictures",
        "publish_date": "Wed, 02 Apr 2025 05:03:24 +0000",
        "category": "entertainment",
        "authors": [
            "April"
        ],
        "text": "1 of 14 Attribution: Nine\n\nOne of Hollywood's most celebrated leading men of the 80s and 90s, Val Kilmer has died aged 65.\n\nFrom roles as Top Gun's Iceman to Batman, here is a look at the leading actor's life in pictures.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-flooding-likely-to-cause-meat-prices-rise/d1b550cd-d271-4348-9dbe-145528964b8e",
        "title": "Aussie food staple tipped to rocket in price in wake of disaster",
        "publish_date": "Wed, 02 Apr 2025 02:50:49 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "S﻿hoppers should brace for a rise in the price of meat due to the devastating loss of cattle from the Queensland outback floods, an expert has warned.\n\nFarmers have seen more than 100,000 head of cattle, sheep and goats killed or lost by the weather emergency in the west of the state. The Queensland government is predicting the number will rise as further heavy rain continues.\n\nAdjunct Professor Colin Dwyer from James Cook University in Queensland has studied the impact of the catastrophic 2019 flooding in the state's north-west, and says the pressure on prices is similar now.\n\nConsumers could be facing higher meat prices as a result of the Queensland floods.. (Lisa Maree Williams/Getty Images)\n\nSix years ago about 600,000 head of livestock died in the flooding disaster﻿. Over the following year, meat prices rose by an average of 10 to 20 per cent in butchers.\n\n\"All the pressures are in place to see an increase in price ... we need the ACCC to keep an eye on this to ensure there is no unnecessary price increase,\" he said.\n\n﻿Adding to the pressure on meat prices is the impact on road haulage companies﻿ and the loss of wages in the cattle industry.\n\nBut Dwyer says a strong season by cattle farmers in NSW may be able to offset any price rises caused by the loss of Queensland livestock.\n\nMore than 100,000 head of livestock have been lost in the Queensland floods. (Getty Images/iStockphoto)\n\n﻿The impact on Australian consumers could be lessened by the fact much of the lost stock was slated for export, according to another expert.\n\n\"Most of the beef is high quality and heads to export markets,\" said Professor John Rolfe, of Central Queensland University.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/every-law-escooter-users-need-to-know-ahead-of-legalisation/5171f663-490b-4d9b-91d8-347ed1a1a2a6",
        "title": "E-scooter riders to be fined $2500 for not wearing a helmet in one state",
        "publish_date": "Wed, 02 Apr 2025 03:01:18 +0000",
        "category": "finance",
        "authors": [
            "April"
        ],
        "text": "1 of 9 Attribution: Nine\n\nA﻿ustralia is about to completely legalise e-scooters in almost every state and territory.\n\nHowever, the legalisation of the vehicles means penalties and fines for those found to be doing the wrong thing.\n\n﻿Click through to see which states have the harshest penalties and the laws e-scooter users should be aware of.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/top-10-richest-people-in-the-world-for-2025/30ea7c15-a564-4f6e-a451-0eff7be21869",
        "title": "The world's top 10 richest people for 2025",
        "publish_date": "Wed, 02 Apr 2025 01:02:06 +0000",
        "category": "finance",
        "authors": [
            "April"
        ],
        "text": "1 of 11 Attribution: AP\n\nTechnology billionaires dominate the world's top 10 richest people for 2025, according to Forbes magazine, but their fortunes have taken a hit.\n\nThe super billionaires - who are all men - were a collective $US157 billion ($250 billion) poorer due to falls on the US share markets triggered by Donald Trump's wave of tariffs.\n\nDespite the declines in the fortunes, they're still worth a whopping $US1.73 trillion﻿ as the beginning of April. Click through to see who they are.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/federal-election-2025-live-campaign-trail-thursday-april-3-blog/105130132",
        "title": "Live: PM heads to the Hunter as Dutton says he won't visit every proposed nuclear site",
        "publish_date": "Thu, 03 Apr 2025 01:41:58 +0000",
        "category": "finance",
        "authors": [
            "Courtney Gould",
            "Isobel Roe",
            "On The Trail With Dutton",
            "Tom Lowrey",
            "On The Trail With Albanese",
            "On The Tail With Dutton"
        ],
        "text": "It's already been busy morning for the prime minister. He's had an early morning press conference about the Trump tariff decision, and an interview with ABC Radio Melbourne.\n\nAnthony Albanese then jumped in the car and made his way to Bell Street Pharmacy in the Melbourne suburb of Pascoe Vale South.\n\nIt was very convenient timing, I've been told, as the PM was hunting around for a fresh tube of toothpaste.\n\n\"You run out of these things, as you do,\" he said.\n\nLoading...\n\nThe pharmacy is smack dab in the middle of the electorate of Wills. Labor's Peter Khalil currently holds the seat on a 4.6 per cent margin. But a challenge from Samantha Ratham, a former Greens state MP, has made his re-election bid a trickier task.\n\nAlbanese was joined by Health Minister Mark Butler at the visit, who used the visit to announce a number of new listings to the Pharmaceutical Benefits Scheme (an independent committee considers and approves new listings — not the government —FYI).\n\n(ABC News: Ian Cutmore)\n\nThey answered a couple of questions on the Trump tariffs (for more on that our dedicated blog has you covered) before heading off.\n\nWhat's next for the travelling pack? A trip interstate! Our road reporter Tom Lowrey will have more for you on that soon.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/broncos-walsh-thrives-on-ponga-boost-in-maroons-duel/105132250",
        "title": "Broncos' Walsh thrives on Ponga boost in Maroons duel, vows to stay with Australia",
        "publish_date": "Thu, 03 Apr 2025 01:37:45 +0000",
        "category": "sports",
        "authors": [],
        "text": "Reece Walsh is in a battle with Kalyn Ponga for the Queensland fullback spot and the Newcastle magician is a source of inspiration for the Brisbane number one to lift his game as he targets an Australian debut.\n\nWalsh is the incumbent Maroons custodian but Knights talisman Ponga has been in red-hot form to start the season and is breathing down his neck.\n\n\"Every time you watch KP go out there and run out, he's inspirational,\" Walsh said ahead of Saturday night's home clash with Wests Tigers at Lang Park.\n\n\"I've been watching him since I was a kid coming through school and to be in those conversations with him [Origin selection], it's pretty amazing.\"\n\nKangaroos out to make World Cup 'statement' in revived Ashes series Photo shows Isaah Yeo and Mal Meninga in conversation on the training paddock Australia Kangaroos coach Mal Meninga has said the revival of rugby league's Ashes provides the perfect opportunity to \"make a statement\" ahead of next year's World Cup.\n\nWalsh, who has played five State of Origin games for Queensland, has Indigenous and Maori background but ahead of the NRL's multicultural round, says he was not tempted to seek to qualify to play for New Zealand in future.\n\n\"My heart was always pretty set on Australia and Queensland. I grew up here and I always wanted to represent that side,\" Walsh said.\n\n\"I do love that Maori side of where we're from and I'm still learning a lot.\n\n\"But it's something that I've always wanted to do as a kid: play for Queensland and Australia.\n\n\"First of all, I have just got to keep turning up here for the Broncos and working hard.\"\n\nThe spotlight has been on NRL stars and their international allegiances, with Broncos and Blues prop Payne Haas telling media this week he is considering making a switch to Samoa. Haas is of Samoan, Swiss and Filipino descent.\n\nKalyn Ponga and Reece Walsh are both looking for the Maroons' number one jumper for this years' Origin series. (AAP: Dave Hunt)\n\nWalsh started the Origin decider against NSW last year and Ponga, who has eight Origins under his belt, came off the bench. It didn't work the way coach Billy Slater would have wanted and the Maroons lost.\n\nIn the next six weeks, the duo will stake their claims for the role of Queensland starting fullback. Australia will also embark on an Ashes tour at the end of the year, when Walsh will be in the frame.\n\nThe Broncos' custodian has won praise from coach Michael Maguire for his defensive mindset this year despite his attack being awry in the opening four rounds.\n\nABC Sport is live blogging every round of the AFL and NRL seasons in 2025.\n\nHe has been vocal in the defensive line with his organisational work and has put his body on the line.\n\n\"For sure, I feel like I've put myself in better positions this year defensively wise,\" Walsh said.\n\n\"My work at the back … it's improving each week and that's probably something that I haven't had in my game too much, but I think it comes back from the hard pre-season that we had.\n\n\"There is a lot of running, a defensive mindset and I think that's something that I'm incorporating in my game, having that defensive mindset level on top of that attack.\"\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/abc-to-host-election-leaders-debate/105130036",
        "title": "ABC to host election leaders' debate on April 16",
        "publish_date": "Thu, 03 Apr 2025 01:17:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "The ABC will hold a federal election debate between Prime Minister Anthony Albanese and Opposition Leader Peter Dutton, the first time it has done so in an ABC studio since 1993.\n\nThe debate, hosted by Insiders host David Speers, will be held in the public broadcaster's new Parramatta studios in the third week of the campaign, at 8pm AEST on Wednesday April 16.\n\nThe Labor and Liberal campaigns are in talks for multiple debates between now and the May 3 election, with the first of those to be held by Sky News and the Daily Telegraph.\n\nMr Speers said the ABC's aim would be to give voters an opportunity to hear the competing visions of Mr Albanese and Mr Dutton and \"genuinely debate each other\".\n\n\"This will be a gimmick-free debate, focused on the major challenges facing Australia at a critical time, and where the two leaders stand,\" he said in a statement.\n\nThe debate will be held at the ABC's new Parramatta studio, officially opened by the Prime Minister earlier this year. (ABC News: Stephanie Simcox)\n\nThe ABC has previously moderated leaders' debates at the National Press Club, most recently in 2016.\n\nIn a statement, ABC news director Justin Stevens said the ABC debate would give every Australian the opportunity to hear from both leaders.\n\n\"The ABC's election coverage is built on putting the public at the centre of our thinking and delivering the best coverage for them,\" Mr Stevens said.\n\n\"It's terrific the leaders will be appearing on the national public broadcaster and talking directly to as many Australians as possible.\"\n\nThe news comes in the same week as Mr Dutton declined to rule out cuts to the ABC's funding.\n\nAlbanese, Dutton campaign in Melbourne with cute kids and no premier Photo shows a middle-aged male politician in a suit speaking to reporters As Australia braces for Trump's trade call, Anthony Albanese and Peter Dutton have spent a day on the hustings in Melbourne.\n\n\"I think there's a lot of very good work that the ABC does, and if it's being run efficiently, then you would keep the funding in place. If it's not being run efficiently and there is waste, then I think taxpayers... would expect us to not support the waste,\" Mr Dutton told ABC Melbourne.\n\nLater on Tuesday, Mr Dutton said the ABC had some \"amazing programs\", singling out the broadcaster's coverage in regional areas during natural disasters.\n\nMr Albanese seized on the comments, suggesting his opponent had \"essentially flagged cuts to the ABC\".\n\n\"Now, Tony Abbott, of course, before 2013, said there'd be no cuts to health, no cuts to education, no cuts to the ABC.\n\n\"At least this bloke has kind of told people in a roundabout way.\"\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/aflw-matthew-clarke-steps-down-adelaide-crows-coach/105132312",
        "title": "Dual AFLW premiership-winning coach Clarke to step away from Crows",
        "publish_date": "Thu, 03 Apr 2025 01:13:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Adelaide's dual AFLW premiership coach, Matthew Clarke, will step down after the looming season.\n\nClarke has been the Crows' women's coach since 2018 but says the time will be right to relinquish the job after next season.\n\n\"My time leading this team has been the most enjoyable in my 30-plus years in football,\" Clarke said in a statement on Thursday.\n\nLoading...\n\n\"Stepping away from the role will be really tough but my experience in and around the game tells me the decision is what is best for the group in the medium and longer term.\n\n\"I love footy and will forever be connected to the game but what form that takes beyond this year is something I am yet to determine.\n\n\"For now, the focus is really clear. I want to throw everything I have into this season and give our players, staff and our Crows supporters the best possible chance to experience another amazing AFLW season.\"\n\nClarke, who will coach the Crows for an eighth season, won flags in 2019 and 2022 and has also reached six preliminary finals.\n\nClarke will leave Adelaide as one of the most successful coaches in AFLW history. (Getty Images: Sarah Reed)\n\nThe 51-year-old, nicknamed Doc given he's a qualified veterinarian, had an esteemed AFL career, playing 258 games for the Brisbane Lions, Adelaide and St Kilda from 1993 to 2007.\n\nAfter retiring, he was Adelaide's AFL ruck coach — he led the women's team concurrently until stepping away from the men's role in recent seasons.\n\n\"What Doc has done to grow and enhance the women's game and its professionalism has been significant,\" Crows chief executive Tim Silvers said.\n\n\"He's been as influential as anyone involved in the AFLW since its inception.\n\n\"While naturally we will be sad to see Doc step down later this year, we understand and respect his decision.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/rba-warns-trump-us-tariffs-threaten-financial-stability/105132346",
        "title": "Trump's tariffs hit all the RBA's key risks for the financial system",
        "publish_date": "Thu, 03 Apr 2025 01:06:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Donald Trump's tariff announcement threatens to trigger a number of key potential financial vulnerabilities, according to the latest Reserve Bank review.\n\nTwice a year, Australia's central bank publishes a financial stability review, looking at the key risks to the nation's banks, superannuation, insurance and financial markets.\n\nThe latest report was obviously prepared before US President Donald Trump's tariff announcement this morning.\n\nAnd, while it concludes Australian financial institutions generally remain secure and well-placed to weather any shocks, the report also identifies three key risks to Australia, all of which appear much closer to being realised after the sweeping global tariff regime announced at the White House this morning.\n\nRisk number one identified by the RBA:\n\n\"Compressed risk premia and concentration of exposures in equity markets increase the likelihood that adverse news — triggered by any number of global risks in a highly uncertain environment — sparks a disorderly correction in global asset prices.\"\n\nCheck. Equity markets, already on the slide as it became clearer that Trump would push ahead with his tariff threats, have fallen sharply in response to the White House announcement.\n\nWhile Australia's benchmark ASX 200 index was only down 1.6 per cent after about 90 minutes of trading, Japan's Nikkei was off about 4 per cent and the US S&P 500 futures index had dropped 3.3 per cent, with the tech-heavy Nasdaq futures down more than 4 per cent.\n\nRisk number two:\n\n\"US tariffs on Chinese imports may necessitate a further policy response from the Chinese authorities to support economic activity. If macro-financial risks were to materialise in China, stress could spill over into the global financial system, including Australia, via trade channels and increased risk aversion in global financial markets.\"\n\nWe don't know yet exactly what China's response will be, but we can be certain that President Xi Jinping will not simply take this on the chin while allowing swathes of Chinese manufacturers to collapse.\n\nRisk number three:\n\n\"Operational systems in key financial market infrastructure and key institutions are increasingly vulnerable to technology outages and malicious cyber attacks. The threat landscape for operational risk could worsen further in the context of escalating geopolitical tensions.\"\n\nTariffs on every country, with some hit with punitive import taxes above 30 per cent, are only going to increase these tensions.\n\nFinancial sell-off the biggest immediate risk\n\nThe biggest immediate threat comes from the financial market reaction to Trump's tariff announcement.\n\nThe Reserve Bank notes that, despite the market sell-off over recent weeks, many share and debt prices still remain high and are not factoring in risks to the economic outlook.\n\n\"A sharp repricing of risk, from current low levels, could abruptly increase borrowing costs for corporations and exacerbate refinancing challenges,\" the RBA warns.\n\n\"This could be triggered by geopolitical tensions, such as the imposition or threat of tariffs by the United States and its trading partners, which could impact earnings not only for firms directly affected but also for corporations more broadly from a weakening in economic conditions.\"\n\nThe RBA also makes clear that this is not simply a threat to US companies or the firms in countries hit by particularly high tariff barriers.\n\nThe fear generated about the global economic outlook could lead to finance drying up globally.\n\n\"This could sharply increase financing costs, including in Australia, and restrict Australian firms' and financial institutions' access to funding and liquidity in global markets,\" the FSR warns.\n\n\"It could also create liquidity strains for Australian banks and NBFIs [non-bank financial institutions], such as superannuation funds.\n\n\"Such an event would intensify financial pressures on domestic borrowers and, if severe enough to strain financial institutions' balance sheets, could limit credit availability in the Australian economy.\"\n\nAs these financial shocks potentially ripple through the \"real\" economy — of production, consumption and investment — the RBA warns Australia is unlikely to be immune.\n\n\"A global economic downturn, particularly one that leads to a sharp slowdown in China [Australia's most significant trading partner], could negatively affect Australia through trade channels — including commodity prices and investment — and spill over into weaker spending by Australian consumers and businesses,\" the bank notes.\n\nAustralia better placed than many: RBA\n\nHowever, the Reserve Bank is not at panic stations, at least not yet.\n\nIt notes that Australia is generally well-placed to weather any global financial and economic storm.\n\n\"The strong financial positions of most households, businesses and owners of CRE are likely to limit the risk of widespread financial stress,\" the bank forecasts.\n\n\"There is considerable scope for most borrowers and lenders to draw down on buffers in the event of a liquidity shock, and any depreciation of the exchange rate would similarly play a shock-absorbing role for the wider economy.\"\n\nBut, for a significant segment of the community, these buffers have already been eroded.\n\nThe RBA notes that business insolvencies are much higher than levels recorded throughout the 2010s, led by hospitality and construction, although the vast bulk of these are small firms.\n\nThe central bank also notes that many home loan borrowers remain in negative cash flow — that is, they spend more on essentials and mortgage repayments than they earn — although this number has recently started declining, even before the interest rate cut in February took effect.\n\n\"Around 3 per cent of borrowers are currently estimated to be experiencing a 'cash flow shortfall', putting them at risk of falling behind on their loan repayments,\" the bank observes.\n\n\"Although this percentage is higher than before the pandemic, it is notably lower than the peak observed prior to the stage 3 tax cuts and a further moderation in inflation over the second half of 2024.\n\n\"The share of borrowers at greater risk of falling behind on their loan — those estimated to have both a cash flow shortfall and low buffers — has decreased to around 1 per cent of all variable-rate owner-occupier borrowers.\n\n\"Additionally, the share of loans in formal hardship arrangements has stabilised, although it remains a little higher than pre-pandemic levels.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/finding-best-way-to-water-double-garden-harvest-koren-helbig/104955826",
        "title": "Working out the best way to water helped me double my garden harvest",
        "publish_date": "Thu, 03 Apr 2025 01:03:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rewind just a few years and I was terrible at remembering to water my veggie patch.\n\nHand-watering felt tedious and time-consuming, so I'd regularly skip it and then wonder why my plants fried.\n\nBut water is very high up in a plant's hierarchy of needs. Knowing when and how much to water plants has been crucial to eating regularly from my garden — and has helped me double my summer harvests.\n\nHere are tips I've gleaned from learning to water effectively in South Australia — the driest state on the driest continent on Earth.\n\nKnowing how much to water\n\nA rough guide used by many gardeners is that most veggie patches need about 25 litres of water per square metre weekly in summer — although dry climates like mine here in Tarntanya (Adelaide) often need more.\n\nImagine a standard nine-litre watering can. If you're following the 25L guidance, every square metre of your patch would need almost three of those full, every week.\n\nI've installed drip irrigation lines attached to a $25 tap timer to make the whole process easier. About three 1-hour drip irrigation schedules each week is enough for my plants in summer, though I water more on days over 40 degrees.\n\nI installed drip-line irrigation which delivers water directly to plant's roots. (Supplied: Koren Helbig)\n\nABC Lifestyle Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nI consider the impact of rain, too. One millimetre of rainfall roughly equals one litre on that one square metre of ground — so unless I've had a solid 25mm-plus of rain in a week, I know I'll need to add supplementary water to my edible plants.\n\nIt helps to track rainfall, because sometimes what feels like a heavy downpour can be only a millimetre or two. I use a cheap plastic rain gauge and a free charting app.\n\nLearning soil type\n\nSoil type also affects how much and how often you need to water. For example, sandy soil needs shorter and more frequent bursts, as the water tends to run straight through. Clay soil, like mine, holds water and often benefits from longer, less frequent watering.\n\nThere are simple tests, that don't require special equipment, that can help determine soil type.\n\nI add biochar along with plenty of other organic matter to the soil to help with water retention. (Supplied: Koren Helbig)\n\nWhatever soil type you're working with, adding more organic matter will help. I use a combination of compost, manure, worm castings and activated biochar.\n\nThey can act like miracle workers to improve soil structure. In sandy soils, organic matter can act like a sponge, retaining water and nutrients, while in clay soils, it can improve drainage by adding air pockets.\n\nWatering at the right time and place\n\nI water early morning or late evening, when lower temperatures help reduce evaporation. But better to water anytime than not at all.\n\nI find soaking plants at their root zone, where they need it most, works best — another benefit of drip irrigation.\n\nNewly transplanted seedlings benefit from extra watering in their first week — I treat mine to extra TLC with hand-watering to ensure the entire root ball is soaked.\n\nConsidering the needs of individual plants has been helpful. I've grouped drought-hardy edibles, such as rosemary, sage and thyme, together in places where I water less. Thirstier plants, such as tomatoes, cucumbers and eggplants, are grouped in beds where I can easily add extra water.\n\nKoren grew her own leafy greens in two weeks Photo shows A woman looks at the camera while leaning beside a vegetable box of home grown lettuce When supermarket prices soared Koren quickly set up a new vegetable patch to grow her own, and went foraging for free edible weeds.\n\nReading plants' watering cues\n\nObservation tells me if I'm watering enough. Plants often wilt during the hottest summer days — if they stand back up after the sun goes down, they probably have enough moisture. If not, I know to up my watering regime.\n\nThe 'finger test' also works well — I poke a finger deep into the soil. It should ideally feel moist and crumbly. If it feels dry, I water more.\n\nParched soil requires far more water to re-wet, so I avoid letting it dry out completely.\n\nHelping plants conserve water\n\nWater is a precious resource. These are some simple strategies I use to help reduce watering needs for my plants.\n\nCovering soil with mulch in summer to reduce evaporation. I create mine for free by 'chopping and dropping' weeds, prunings and spent veggie plants, leaving them lying across the ground.\n\nHanging 50 per cent white shade cloth or an old sheet over plants on hot days — plants won't need to push as much moisture through their leaves to keep cool.\n\nUsing plants as shade by growing vertically up trellises and garden arches.\n\nReusing greywater and harvesting rainwater also helps keep the water bill down.\n\nI'm still often surprised by how much water edible plants need to thrive — but meeting their needs adequately has rewarded me with plentiful bowls of delicious food for the kitchen.\n\nKoren Helbig is a sustainable city living educator who practices permaculture and grows organic food in the backyard of her small urban Tarntanya (Adelaide) home.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/nsw-new-sydney-metro-testing-open-door/105131742",
        "title": "Five-hour trip the first step for 'transformative' new Sydney Metro line",
        "publish_date": "Thu, 03 Apr 2025 00:46:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Testing has begun in Sydney's south-west for the first time on the new metro line between Sydenham and Bankstown, whilst investigations continue into how a door remained fully opened on a moving Sydney Metro train in the city's north.\n\nThe first metro train finished its journey along the newly-extended line at 4am on Thursday morning, marking the start of more than 6,500 hours of testing.\n\nSpeaking at Campsie Station, NSW Premier Chris Minns heralded the moment and said it was an investment for the future.\n\n\"What it means we can have rapid public transport into the city, into the heart of the city and the rest of the public transport network,\" Mr Minns said.\n\n\"It means we can do more with housing, more people on public transport, less people on the roads.\"\n\nNSW Premier Chris Minns speaks to the media at the site of testing for a Sydney Metro line. (ABC News: Tahnee Jash)\n\nMr Minns said today's testing was a milestone.\n\n\"This is a real milestone for this project the beginning of the testing on the line … this is transformative for Sydney and the area,\" he said.\n\n\"The first trip took five hours to reach Campsie Station, but do not worry it is going to speed up, when it is up and running it is going to take about 11 minutes.\"\n\nOnce operational, the metro is expected to take 18 minutes from Campsie to Central Station and 33 minutes from Campsie to Chatswood in Sydney’s north as part of the metro network.\n\nThe slow-moving test took about five hours on Thursday morning for the new line. (ABC News: Tahnee Jash)\n\nFaulty Metro door under investigation\n\nIt comes as authorities continue to investigate how a door on a crowded Sydney Metro train malfunctioned in the city's north on Wednesday.\n\nThe train was travelling southbound along the underground line between Chatswood and Crows Nest at the time of the incident.\n\nMr Minns said the matter had been taken very seriously.\n\n\"I do not want anyone to believe we are trying to sweep it under the carpet,\" Mr Minns said.\n\n\"The national regulator is looking at what happened. Transport Minister John Graham is speaking to the operator of the metro to make sure it does not happen again.\"\n\nOfficials are investigating an open door on a moving Sydney Metro train during Wednesday's peak commute. (Supplied)\n\nThe Rail, Tram and Bus Union yesterday called for the Sydney Metro system to stop operations until interim safety measures were put in place.\n\nMr Minns said that was an \"overreaction\".\n\n\"This is a glitch. We did not want it to take place and we are certainly investigating. But it should not shut down the transport network disrupting people's journey to and from work while we are undertaking the review,\" he said.\n\nSydney Metro chief executive Peter Regan said initial investigations showed the door was not closing properly.\n\n\"The system tried to close it, the system can also have a remote closing of that door,\" Mr Regan said.\n\n\"There is also the ability for a manual override. While investigations are underway, we understand the door was manually overridden but the procedure was not fully followed and therefore the door was not fully secured as it was moving.\"\n\nMr Regan said, however, the system worked properly.\n\n\"But it appears some of the procedures around the manual opening of the door were not fully followed,\" he said.\n\n\"There were staff standing next to the door and the control centre was able to apply the brakes to bring the train to a halt in the tunnel.\"\n\nMr Minns said maybe human error was involved.\n\n\"No one's life was directly in jeopardy. It was obviously a glitch in the system, but I do not want everyone to overreact when it comes to these metros and the infrastructure that we are rolling out, they are fantastic,\" he said.\n\n\"I think it would be an overreaction to shut down the system at the same time as investigations continue.\"\n\nThe south-west metro line is slated to open next year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/val-kilmer-death-dying-cancer-illness-val-documentary/105131030",
        "title": "What we learnt about Val Kilmer's illness from his documentary",
        "publish_date": "Thu, 03 Apr 2025 00:44:14 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The death of Val Kilmer — the brooding actor most well-known for his turns as Batman and as Jim Morrison in The Doors — was confirmed yesterday by his daughter Mercedes Kilmer.\n\nThe 65-year-old actor died from pneumonia following a decade of health problems including a 2014 throat cancer diagnosis that required two tracheotomies. The stress on his throat from the cancer and treatment left Kilmer with a diminished speaking ability.\n\nIn 2021, filmmakers Leo Scott and Ting Poo released Val, a documentary compiled from more than 800 hours of footage Kilmer had taken over his life, detailing his rise to fame as well as his struggles with sickness.\n\nHere's what we learnt.\n\nIn his later years, Kilmer frequently wore neck scarves to cover his tracheotomy in public. (Supplied: Prime Video)\n\nA father speaking through his son\n\nThe documentary is written by Kilmer but narrated by his son, Jack, who is also an actor.\n\nOpening on Kilmer at the start of his acting career, it quickly veers to an older version deeply enthralled in scrapbooking.\n\n\"I was recently diagnosed with throat cancer, though I healed quickly from the cancer. The extensive radiation and chemotherapy that followed treatment has left my voice impaired,\" he says through his son.\n\n\"I am still recovering and it is still difficult to talk and be understood.\"\n\nJack Kilmer narrates the film from words written by his father. (Supplied: Prime Video)\n\nKilmer sometimes talks straight to the camera, pressing on his throat to speak in a rasp that will shock those used to his robust movie star cadence. He speaks about his need to share the visual archive that he's accumulated over 60 years.\n\n\"I have lived my life and it's sort of all in these boxes, but what is part of the profound sadness is that I know it's incomplete. As much as I filmed and as hard as I've tried, there's nothing I can do to make any of it understood,\" Kilmer says.\n\n\"I know that that's not true but it's how I feel.\"\n\nThe beginning of sickness\n\nLate in his career, just before his illness, Kilmer starred in a stage production about author Mark Twain. In debt from his recent divorce, he sold 6,000 acres (2,428 hectares) of land he owned in New Mexico — and intended to turn into an artist's community — to fund the production.\n\nBut after several successful performances of the show, Kilmer began to feel ill.\n\n\"I was getting ready to put on Citizen Twain in Nashville when I lost my voice. I postponed the show for what I thought would be a month or two. My voice didn't get better, it got worse, and one day I started coughing up blood and was rushed to the hospital,\" he says.\n\nVal Kilmer's most notable roles Photo shows A close shot of Val Kilmer, featuring his face Actor Val Kilmer, star of Top Gun and Tombstone, has died aged 65.\n\n\" Through treatment and prayer, I slowly recovered but how much I would regain my voice remained unknown.\"I wrestled with the possibility of my career being over and fell into darkness. \"\n\nWhile in hospital, he began to paint again — a hobby he'd picked in his youth. When he got out, he threw himself into making art, founding a studio \"big enough\" for his ideas.\n\n\"That studio has become a sacred space where artists gather and collaborate and help the next generation of artists in our community grow,\" he says.\n\nThe film cuts to archive interview footage of Kilmer, young and effervescent as he is asked by an interviewer: \"If heaven exists, what would you like to hear God say at the pearly gates?\"\n\n\"Well, I had this dream once,\" Kilmer begins, clear and measured.\n\n\"Where this happened and she opened what would be her arms, that feeling, and enveloped me and said, 'I love you.'\"\n\nOn death, dying and daughters\n\nAt times, Kilmer is incredibly frank about how cancer has changed his life. It's possible to see the tracheotomy band around his neck and the artificial hole that allows him to speak. Midway through the film, he addresses his concept of the afterlife.\n\n\"I see this hole in my throat and I wonder whether people wonder if I had any fear of dying,\" he says.\n\n\" I have had fears, but none that have ever been overwhelming about my life because I don't believe in death and, my whole life, I've tried to see the world as one piece of life. That's how I understand it right? As you pull back from the planet, you see that we're all one life source. \"\n\nThe scene quickly moves on to Kilmer meeting his child, Mercedes, who he proclaims in the title card as \"My genius daughter\".\n\nMercedes Kilmer excitedly talks to her father on video call moments before they meet. (Supplied: Prime Video)\n\nConfirming that their meeting is imminent, Kilmer is so excited he does a small dance. The film reveals that they live next to each other, before the action cuts to grainy home videos of Kilmer and his then-wife, actor Joanne Whalley, celebrating their baby daughter.\n\nAdjusting career expectations after illness\n\nAt points in the film, Kilmer reckons with the shift in his career post cancer, saying he has no doubt that his \"illness shut down professional opportunities\".\n\nHe appears at a 2019 fan screening in Texas of his 1993 film Tombstone, the full crowd beaming at the movie star as he struggles to thank them for coming out.\n\nVal Kilmer and his Top Gun co-star Barry Tubb at the Val Kilmer Weekend screenings in Texas in 2019. (Getty: Gary Miller)\n\n\"Sometimes, I feel so low and I have the blues really, really hard about having to fly around the country,\" he says.\n\n\" I don't look great and I'm selling basically my old self, my old career. For many people, it's like the lowest thing you can do is talk about your old pictures and sell photographs of when you were Batman.\"But it enables me to meet my fans and [I] end up feeling really grateful rather than humiliated because there's so many people. \"\n\nA prankster until the end\n\nLater on, Kilmer rasps to camera that he is on his way to Arizona because his mother, Gladys, had died and \"Right now she doesn't have anyone to cremate her.\"\n\nArriving in the family home, surrounded by cactus and desert, Kilmer immediately starts shooting his loved ones with silly string (\"It glows in the dark!\" he joyfully informs them) as they're donning their funeral blacks.\n\n\"I wrote something nice last night all about her style, her hairdo, her jewellery, they always popped,\" he says about his mother, before the action cuts to Kilmer quietly sobbing.\n\n\"I miss my mama but I had a vision that she was so happy with her youngest son.\"\n\nLoading YouTube content\n\nKilmer speaks frequently of his faith and how it intersects with his life.\n\n\"I've studied all the major religions, I've always been interested in religion. Often when I talk to someone, I end up talking about their faith. I'll ask them…\" Kilmer starts but then struggles to breathe, before fainting over a nearby sofa, only to reveal that it was a joke played on his worried son.\n\n\"That's not funny,\" Jack says off camera.\n\n\"I can't help it,\" Kilmer says, smiling wide at the perfectly executed prank.\n\n\"I'm a bastard and I love you. It's very, very funny.\"\n\nVal is streaming on Prime Video now.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/bruce-baldwin-cancer-ride-wife-brain-cancer-funding/105124756",
        "title": "Man bikes around Australia to honour late wife",
        "publish_date": "Thu, 03 Apr 2025 00:33:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Bruce Baldwin's wife Natalie complained of a headache she shrugged it off.\n\nThe following week his wife of 30 years died from a brain aneurysm.\n\n\"It was very sudden and while we were in intensive care I just felt so helpless,\" he said.\n\nBruce with his late wife Natalie. (Supplied: Bruce Baldwin)\n\nAfter a visit to the GP where she was advised to take Panadol, Mr Baldwin noticed Natalie's face had drooped.\n\nSuspecting a stroke she was raced to hospital.\n\n\"That's when they found the tumour in the back of her brain,\" Mr Baldwin said.\n\n\" Even if we had found it six months prior there was nothing we could do. It would have taken her. \"\n\nMr Baldwin said by evening his wife had lost consciousness and was placed into palliative care.\n\nMr Baldwin wants more funding for research and clinical trials. (ABC News: Jasmine Hines)\n\nAlmost a decade later Mr Baldwin has set the ambitious goal of cycling around Australia to raise awareness and funds for the Cure Brain Cancer Foundation in honour of Natalie.\n\nA retiree who lives at Gladstone in central Queensland, Mr Baldwin plans to ride more than 16,000 kilometres in six months.\n\n\"She was a beautiful lady. This is probably the only thing I can do for her now,\" he said.\n\nMr Baldwin's adventure will span more than 16,000km. (ABC News: Jasmine Hines)\n\nAccording to the charity, the 23 per cent survival rate for brain cancer has not improved significantly in the past 30 years.\n\n\"At the moment there's limited spots for trial participants who want to get the trials going, and that's where the money will go that Bruce is raising for us,\" chief executive Andrew Giles said.\n\nClinical trials\n\nMr Giles said about 1,900 Australians are diagnosed with brain cancer every year, and of those about 1,500 will die.\n\nHe said treatment is complicated and there are limited options which work.\n\nAndrew Giles says funds are required to expand clinical trials in Australia. (Supplied: Cure Brain Cancer Foundation)\n\nA number of clinical trials are run nationally, funded by the foundation, governments, and other groups.\n\nOne trial the foundation is funding is investigating which therapies can improve overall survival rates for glioblastoma, an aggressive and fast-growing cancer.\n\nWhile there are six sites across the country where a glioblastoma trial is taking place — Sydney, Newcastle, two in Melbourne, Brisbane, and Adelaide — Mr Giles said access was an issue.\n\n\"We only had 50 places. We need to make these single trials broader so that more people can join them,\" Mr Giles said.\n\nThe charity is seeking $10 million in funding from state and federal governments to expand clinical trials in Australia.\n\nMr Giles said that figure would ensure every person diagnosed with brain cancer who wanted to access a clinical trial could access the treatment.\n\nFundraisers like Mr Baldwin's help raise money for research and clinical trials. (ABC News: Jasmine Hines)\n\nSince 2015 the federal government has invested more than $64.4 million for grants focusing on brain cancer research through its Medical Research Future Fund (MRFF).\n\nThis includes more than $26 million to support clinical trials.\n\nThe government's Australian Brain Cancer Mission is also investing $126.4 million across 10 years from 2017 to support research into brain cancer, including $50 million from the MRFF and $67.4 million from funding partners.\n\nMr Giles said the earlier that patients were diagnosed the quicker they could potentially access a trial and find a therapy which would improve their outcome.\n\nBut he said many patients, like Natalie, were diagnosed too late.\n\nThat can be because the warning signs — such as migraines, shakes, or flu-like symptoms — were easily dismissed, he said.\n\n\"The biggest problem with brain cancer and clinical trials is that people don't live long enough to get on the trial. It's only about a 12-month survival rate,\" Mr Giles said.\n\n\"That's quite heartbreaking.\"\n\nRemembering Natalie\n\nMr Baldwin and Natalie met and fell in love after friends introduced them when they were in their early 20s.\n\nNatalie Baldwin on her wedding day. (Supplied: Bruce Baldwin)\n\nHe said he was drawn to Natalie's bubbly personality, describing her as \"angelic\".\n\n\"She'd do anything for anyone. She was warm-hearted,\" he said.\n\n\"She couldn't have been a better mother.\"\n\nMs Baldwin was 49 years old when she died in 2016, leaving behind her husband and their four children.\n\nMr Baldwin trained on his pushbike for six months before embarking on his trip that began last weekend.\n\nHe is supported by his second wife Janet, who is following him in a caravan with their two small dogs.\n\n\"[The trip] wouldn't be possible without her,\" Mr Baldwin said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/afl-luke-beveridge-slams-rules-tackling-confusion/105132018",
        "title": "Bulldogs coach slams AFL rules, claims 'the whole competition is confused'",
        "publish_date": "Thu, 03 Apr 2025 00:28:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Western Bulldogs coach Luke Beveridge has teed off at the AFL, saying coaches have never felt more \"helpless\" about guiding their players how to tackle.\n\nThe longest-serving coach in Bulldogs history believes there is \"total confusion\", even within the umpiring ranks, about how to correctly penalise tackles.\n\nWhen asked for his thoughts on Richmond forward Rhyan Mansell receiving a three-game suspension for dangerously pushing St Kilda defender Liam O'Connell into a contest, Beveridge directed his frustrations elsewhere.\n\nLoading...\n\n\"I don't want to be too controversial today,\" the 2016 premiership coach said on Thursday.\n\n\"The main one that we're all focusing on, moving away from that (Mansell incident), is there's just too much uncertainty across the league in regards to source pressure situations with tackling and being tackled.\n\n\"No one understands the rule anymore, and it's very difficult to coach it.\n\n\"How long can you hang on to the ball? Can you attempt to dispose of it? Throw it out, miss it completely, is it play on? No one understands it.\n\n\"So the suggestion for me was to make sure we bring back prior opportunity and validate incorrect disposal.\"\n\nThe AFL adjusted their interpretations last year after coaches, led by Gold Coast's Damien Hardwick and Carlton's Michael Voss, called on umpires to start making faster calls on holding-the-ball decisions.\n\nRichmond forward Rhyan Mansell found guilty of rough conduct Richmond's bid to have a three-match suspension for Rhyan Mansell overturned at the AFL tribunal failed despite the incident not warranting a free kick at the time.\n\nBeveridge has raised it personally with the AFL.\n\n\"We've gone from that to now this total confusion, so unfortunately we need a correction and it needs to come from City Hall (the AFL) and through the umpires.\n\n\"Because the umpires are just finding it too hard.\n\n\"They don't know how to adjudicate it and our players don't know what the decision is going to be.\n\n\"I don't think we as coaches have ever felt as helpless around that and coaching it as we do now.\n\n\"I think the whole competition is confused.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/what-is-victorian-federation-art-deco-mid-century-design/105071582",
        "title": "Art deco to postmodern — your cheat sheet for design eras",
        "publish_date": "Thu, 03 Apr 2025 00:03:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "If you were walking down the street, could you pick a Victorian terrace from a Federation bungalow?\n\nCould you spot a postmodern pad from an Art Deco masterpiece?\n\nWhile Australia's architectural history doesn't stretch back as far as some centuries-old cultures, our design past reflects global trends and the Australian spin we put on many of them.\n\nRestoration Australia host and professor of architecture Anthony Burke walks us through five popular design eras.\n\nAnd you bet, there is a test at the end!\n\nVictorian\n\nMany older inner-city areas will feature Victorian terraces. (ABC Adelaide: Brett Williamson)\n\nWhat to look out for:\n\nLikely a terrace or a house with an adjoining wall\n\nWrought iron balustrades\n\nOpulent and ornate decorations like ceiling roses and cornice trim\n\nHigh ceilings\n\nDate: 1837 to 1901, the period of Queen Victoria's reign\n\nAs Burke says, the Victorian era in Australia saw an evolution from \"stripped back\" design in the early years to \"detail and flamboyance\" as the gold rush brought wealth to pockets of the country's south-east.\n\n\"Coming through the gold rush, coming out of early settlement … people have found their feet, they're setting up businesses, they're starting to express their success,\" he says.\n\n\"They're looking for ways to do that that moves architecture into a moment where we're no longer surviving, or just mimicking [what's come before], but we're trying to express something that's more of our own.\n\n\"We're enthusiastic about our own success into the future.\"\n\nThe classic Victorian features of this freestanding house were brought back to life in this season of Restoration Australia. (ABC/Fremantle Media)\n\nBurke says the opulence of Victorian architecture peaked in the 1880s and up until around 1890 \"which is where things got tough\" with an economic downturn post-gold rush.\n\n\"Then we hit the new century and things start to change,\" he says.\n\nFederation\n\nThe asymmetrical front is typical of a Federation house. (ABC/Fremantle Media: Sally Griffiths)\n\nWhat to look out for:\n\nAsymmetrical front with a living room that steps out, and recessed front door\n\nPorch at the front that sometimes wraps around\n\nDetailing in the brickwork\n\nHallmark Federation colours are dark greens, creamy yellows, rich dark reds and whites\n\nAustralian motifs in decorations\n\nDate: Period around federation from roughly 1890 to 1915\n\nOverlapping with the Victorian period, and sometimes called Edwardian, is the Federation era which, as Burke notes, sees Australia really begin to forge its own style.\n\n\"What we see now is the Australian version of the bungalow,\" he says.\n\n\"With the bungalow rather than the terrace we've got a slightly more relaxed, slightly more stepped-back kind of house.\n\n\"It moves a little further away from the front street and usually has a little bit more garden.\"\n\nBurke says that while we're all pretty familiar with this type of house in suburban Australia now, at the time it was a \"very patriotic and heroic\" moment.\n\n\"What you see in a lot of decoration in the lead lighting and stained glass and things is a lot of Australiana,\" he says.\n\n\"Suddenly we're ... seeing things like kookaburras or flowers that are Australian flora.\n\nThe stained glass in Lamb House, featured in season six of Restoration Australia, is full of Australian motifs. (ABC)\n\n\"It's a moment where we started to really try and project a sense of what Australia is into our decoration and into the houses that we were building.\"\n\nArt Deco\n\nMudgee's 1935 Regent Theatre is a good example of Art Deco style. (ABC Central West: Melanie Pearce)\n\nWhat to look out for:\n\nFuturistic and geometric patterned look\n\nStripes in the facade and masonry of buildings to exaggerate the lines of the building\n\nP&O style — curved corners and porthole windows like cruise ships\n\nDate: 1920s and 30s\n\nThe distinctive look of Art Deco originated in France in the early 20th century but, as Burke says, quickly spread around the world.\n\nNew York City's iconic Chrysler Building was opened in 1930. (Reuters: Mike Segar)\n\n\"What it was trying to do was step away from looking backwards to tradition … and look forward into a new style, a new aesthetic,\" he says.\n\nThe period coincided with revolutionary machines like aeroplanes and trains which Burke says led to a \"very futurist idea\" focused on the technological future of speed and movement.\n\n\"We see buildings like the Chrysler Building in New York. It's super decorative and elaborate, it's all about a new expression of the era looking forward,\" he says.\n\n\"It's stainless steel and shiny, it's a bit space-agey ... it's the future.\"\n\nWindermere flats in Victoria were built in 1936. (Supplied: Rohan Storey)\n\nArt Deco also includes P&O style — after the ocean liner business — that's defined by curved walls and porthole windows that mimic the look of a cruise ship.\n\n\"Again, boats and trains and movement is all stuff that's part of the future,\" Burke says.\n\nThe Archerfield Airport shows Brisbane's Art Deco history. (Supplied: Duncan Bird - Open House Brisbane)\n\nHe says out of the roaring 20s, the flamboyance of the movement began to slow down in the 30s as the Great Depression hit.\n\nMid-century modern\n\nBig windows, exposed trusses and industrial materials mark mid-century modern architecture. (ABC/Fremantle Media)\n\nWhat to look out for:\n\nMinimal decorations\n\nModest materials like brick and timber\n\nExposed beams and clear structures\n\nFull-length glass windows\n\nClearly defined spaces but beginning to open up rooms to each other and the garden\n\nDates: mid-1940s to mid-1960s\n\nAs Burke explains, mid-century modern design brought ideas like functionality from modernism into a home setting.\n\nIt was also influenced by the aftermath of World War II.\n\n\"Returned soldiers were coming home, the military industrial complex that was building bullets and tanks and things like that had nothing to do all of a sudden,\" he says.\n\n\"They turned towards making houses and they looked for ways to use the same kind of industrial materials we were using during the war, and somehow find a domestic application.\"\n\nLyon House, from season three of Restoration Australia, is mid-century modern in all its glory. (ABC/Fremantle Media)\n\nExamples are walls of windows that let light flood in and lightweight steel trusses coming into view.\n\n\"We wouldn't have seen that before in a Victorian home because it would've had a ceiling and a ceiling rose and elaborate plaster work,\" he says.\n\n\" The way in which a house is built becomes a signature of the mid-century project, probably more than any year. \"\n\nBurke also notes that in mid-century modern, the furnishings were \"as important\" as the house itself.\n\nPostmodern\n\nThe Lovie House, in Jerrabomberra just outside Canberra, was built in 1998. (Supplied: Martin Miles)\n\nWhat to look out for:\n\nPlayful design\n\nBringing life and colour to buildings\n\nHistoric motifs like broken pediments which look like a gap in a triangular roof\n\nColours like pastels, avocado and salmon\n\nDates: Started in the 1970s\n\nPostmodernism might be the wackiest, and most fun, of the design eras so far.\n\nAs Burke explains, it was a moment when architects and designers rejected the austerity and blandness of modernism.\n\n\"Postmodernism wanted to bring the human back into the story,\" Burke says.\n\n\" They wanted to not be so serious about architecture and lighten up a bit. \"\n\nThe vivid colours and playful design of Storey Hall at RMIT in Melbourne fit into postmodernism. (AAP/Julian Smith)\n\nThe result is often buildings or houses designed \"with a sense of playfulness and irony\".\n\n\"When you see a postmodern house what you might see is something which might even look a little bit cartoonish,\" Burke says.\n\n\"You get this kind of pastiche of ideas and they didn't have to sit together in some kind of coherent hole which would've had to happen in earlier periods.\n\n\"In the postmodern period you can kind of get away with anything.\n\n\"It was a little bit cartoon, a lot of colour, a little bit crazy, definitely quirky.\"\n\nWikimedia Commons: Public Domain (Wikimedia Commons)\n\nTest your knowledge\n\nTime to put your knowledge to the test.\n\nCan you pick which architectural era these houses and buildings belong to?\n\nLoading\n\nStream the new season of Restoration Australia free on ABC iview or watch tonight on ABC TV at 8pm.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/casterton-storm-damage-insurance-company-delays/105116152",
        "title": "Restaurant owners with $90k hail bill offered $28k by insurer",
        "publish_date": "Thu, 03 Apr 2025 00:00:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents hit by a major hailstorm in a south-west Victorian town six months ago say insurance companies are delaying payouts and offering paltry settlements for repair works.\n\nHail stones lashed the town of Casterton, near the South Australian border, on October 16 last year.\n\nThe Glenelg Shire estimated the storm left $50 million worth of damage in its wake, including 600 damaged cars.\n\nThe aftermath of the hailstorm which swept through Casterton six months ago. (Supplied: Vikki O'Brien)\n\nNearly six months on, residents in the town of 1,600 people say they are still waiting to have their insurance claims resolved.\n\nJohn Simlon and Nino Malvetti opened their restaurant Kwinotti shortly before the storm hit.\n\nThe hail stones broke skylights, caused water damage to walls, and broke the restaurant's outdoor lighting — all of which is yet to be fixed.\n\nRoof damage in the restaurant's office that is yet to be fixed. (ABC South East SA: Sam Bradbrook)\n\nMr Simlon said insurance assessors were yet to closely inspect the restaurant's roof which had collapsed in places.\n\n\"All of the hail and water came all through the padded ceiling areas,\" he said.\n\n\"The floor looked like the bottom of the Indian Ocean.\"\n\nThe storm caused around $90,000 in damage to the restaurant, but Mr Malvetti and Mr Simlon were only offered $28,000 to settle the insurance claim.\n\nMr Malvetti had just opened his restaurant when the storm hit. (ABC South East SA: Sam Bradbrook)\n\nMr Simlon also owns a solid brick warehouse next door, formerly a butter factory.\n\nIt was insured for its market value of $350,000, but when it came time to claim damages Mr Simlon said he was told the building's rebuild value was more than $1 million.\n\nHe said his insurance company told him his property had been underinsured, resulting in a lower payout.\n\n\"They've just been so ridiculously calculated. They're just unacceptable,\" he said.\n\n\" This has also been part of the hold up to actually getting enough funding or settlement proceeds in order to commence any sort of decent repairs. \"\n\nLoading...\n\n'Stressful' for residents\n\nGlenelg Shire Mayor Karen Stevens said the long waits for insurance outcomes was prolonging the pain from the storm.\n\nShe said some families were yet to return to their homes and others were still using portable toilets due to outstanding plumbing damage.\n\nKaren Stephens says delayed insurance negotiations are causing stress for Casterton residents. (ABC South East SA: Grace Whiteside)\n\n\"There is an emotional toll. It's been a really difficult time for businesses, for individuals,\" she said.\n\n\"It's really stressful for people to just continuously be dealing with the insurance companies.\n\n\"Some are having very good relationships with their insurance — 50 per cent are, 50 per cent aren't.\"\n\nMs Stevens said the limited number of local tradespeople had also contributed to delays.\n\nA school in the town sustained damage in the hail storm. (Supplied: Sarah Huret)\n\n\"We've had an enormous amount of outside trades coming in, which is fantastic for those people,\" she said.\n\n\"We are heading into winter, so we still have people who've got tarps on their roofs.\n\n\" So this needs to be sorted out and needs to be sorted out now. \"\n\nThe Insurance Council of Australia convened a public meeting between residents and insurance companies in Casterton this week.\n\nA spokesperson said underinsurance was a national concern for the industry.\n\n\"The insurance industry is acutely aware of the pressures that inflation is having on the building and construction sector,\" he said.\n\n\"Given the severity of damage to many properties in Casterton and complexities around many properties needing to be rebuilt to meet modern building codes, some claims are taking longer to resolve.\n\n\"These issues are often more acutely felt in regional areas where labour and materials can be harder to access, particularly after an extreme weather event that impacts many people at one time.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/merseyside-derby-horror-tarkowski-tackle-liverpool-everton/105131240",
        "title": "Tarkowski tackle escapes with yellow as Liverpool extends EPL lead",
        "publish_date": "Wed, 02 Apr 2025 23:41:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Liverpool continued their march towards the Premier League title with a 1-0 victory over Everton in a scrappy Merseyside derby as Diogo Jota slotted home the winner in the second half on Wednesday.\n\nBut the 246th meeting between the cross-town rivals was fired up by an early fierce tackle from the Toffees' James Tarkowski on the Reds' Alexis Mac Allister, with Tarkowski seen as lucky to be shown only a yellow card.\n\nThe heated mood in Anfield was cranked up another notch with the contentious early tackle. Tarkowski won the ball but his studs-up follow-through caught Mac Allister square in the calf.\n\nVAR confirmed the decision of a yellow card, which gave the centre back the joint most yellow cards without being sent off in Premier League history, with 63.\n\n\"I thought at the time that it was a brilliant tackle for a derby game,\" Everton boss David Moyes said.\n\nFormer Manchester United defender Gary Neville said on the Sky Sports commentary that Tarkowski was very lucky to escape a red card for a tackle that was a \"potential leg-breaker\".\n\nThe teams had met in an explosive derby in February that ended 2-2, with Tarkowski equalising deep in stoppage time in a chaotic game that featured four red cards, including one to Liverpool manager Arne Slot.\n\nThe champions-elect, with 73 points after 30 games, restored their 12-point lead over second-placed Arsenal while Everton, who ended their nine-game league unbeaten run, are 15th on 34 points.\n\nEverton's Beto had an early goal chalked off for offside and missed a sitter before Jota broke the deadlock in the 57th minute with his first goal in two-and-a-half months.\n\nAnfield erupted when Luis Diaz back-heeled the ball into Jota's path and the Portuguese forward beat a tackle before firing into the net.\n\n\"Massive, of course,\" Jota said, summing up the win. \"Not only because it is a derby, but because of the [first game since the] international break.\n\n\"It was important to start with three points and hopefully, that gives us momentum for the rest of the season.\"\n\nWhile Liverpool are unbeaten in 26 league games, they went into last month's international break on a negative note after being eliminated by Paris Saint-Germain in the Champions League and losing to Newcastle United in the League Cup final.\n\nSlot's men looked sluggish and disjointed on Wednesday and Everton could have gone ahead when Beto raced away from defender Virgil van Dijk and beat goalkeeper Caoimhin Kelleher before hitting his shot against the post.\n\nKelleher started in goal for Liverpool, with regular starter Alisson recovering from a concussion suffered on international duty with Brazil.\n\n\"We were playing against Everton, they make it very difficult for you,\" Van Dijk said. The games we have played against each other over the years have always been tough.\n\n\"They have a certain way of playing and you have to be ready for it. The first half wasn't our greatest but we kept a clean sheet and obviously Jota made a fantastic goal. Three points and we move on.\"\n\nMoyes remained without a victory at Anfield in 22 games leading Manchester United, Sunderland and West Ham United as well as his current team.\n\n\"Liverpool were the better team, there's no doubt about that,\" Moyes said.\n\n\"But I don't like the goal, I think the goal was offside. I'm really surprised it wasn't given. Or maybe I'm not surprised. I don't think many managers come here and think that they get loads of decisions at Anfield generally.\"\n\nIn other results, Manchester City jumped into fourth spot with a 2-0 win over Leicester City with goals from Jack Grealish and Omar Marmoush.\n\nNewcastle stayed in touch for Champions League qualification with a 2-1 win over Brentford, capped by a stunning winner from Sandro Tonali.\n\nAston Villa had an easy 3-0 win over Brighton, relegation-threatened Ipswich Town beat Bournemouth 2-1 and Southampton drew with Crystal Palace 1-1.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/bus-driver-stood-down-leaving-school-children-flooded-route/105129622",
        "title": "Bus company apologises after schoolkids left stranded near floodwater",
        "publish_date": "Wed, 02 Apr 2025 23:33:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "A bus company has suspended a driver who left school children on the side of a flooded road in North Queensland.\n\nKinetic, a state government transport partner, has launched an investigation into the incident on Friday where students were left stranded in Townsville.\n\nIt is understood students were instructed to leave the bus, which had been travelling on a school run in Townsville, due to a flooded road deemed impassable.\n\nKinetic executive general manager Martin Hall says he apologised unreservedly. (ABC North Queensland: Chloe Chomicki)\n\nThe move breached the company's mandatory protocol, which stipulates drivers to contact 24/7 control centres for real-time support during extreme weather events.\n\nIt also provides for alternative routes and exploring alternative drop off points such as returning passengers to the school.\n\nCompany apologises\n\nKinetic executive general manager Martin Hall said he had unreservedly apologised to those impacted.\n\n\"Students were incorrectly instructed to exit a school bus due to flooding concerns,\" he said.\n\n\"Above all, we put the safety and welfare of our passengers, particularly school children, at the forefront and have commenced an investigation into this incident.\n\n\"I have personally contacted all impacted schools and have spoken to parents who have reached out to us and we will continue to do so.\"\n\nMr Hall said Kinetic had established safety protocols in place which included a comprehensive network of safety measures.\n\nHe said they included alternative route planning and managing services disruptions such as flooding.\n\n\"We have taken action to reinforce safety protocols with all our drivers to ensure this remains an isolated incident,\" he said.\n\nKinetic operates 13 regional bus routes in the Townsville area.\n\nThe bus driver has been stood down while the investigation is underway.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/nsw-health-measles-alert-sydney-eastern-suburbs/105130940",
        "title": "Measles alert issued for Sydney's eastern suburbs",
        "publish_date": "Wed, 02 Apr 2025 23:23:51 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A measles alert has been issued after a person infected with the disease visited several locations in Sydney's eastern suburbs.\n\nNSW Health said the infected person visited The Bagel Co at Rose Bay, Waverley College and Rose Bay Secondary College on Sunday, and a chemist on Tuesday.\n\nHealth authorities have urged people who have visited those areas to monitor for symptoms, which could take up to 18 days to appear after exposure.\n\nPublic health physician Anthea Katelaris said it was the 18th case of measles in the state this year, but the source of the infection was unclear.\n\n\"If they have been exposed and if they do develop symptoms they should see a doctor,\" Dr Katelaris said.\n\n\"They should call ahead to their GP or emergency department to make sure that they don't spend time in the waiting room potentially exposing other people.\n\n\"The source of this person's measles infection is unclear at the moment though the person has recently travelled interstate where several measles exposures have occurred.\"\n\nSymptoms of measles include fever, runny nose, sore eyes and a cough, usually followed three or four days later by a red, blotchy rash that spreads across the body.\n\nNSW Health said a measles vaccine is available from GPs and pharmacies for people aged over five.\n\nExposure sites:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/macquarie-point-stadium-developer-legal-advice-over-draft-report/105130954",
        "title": "Hobart stadium developer takes aim at 'errors' in draft planning report",
        "publish_date": "Wed, 02 Apr 2025 23:03:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "The government authority responsible for the proposed Hobart stadium says a scathing draft planning commission report into the project should be given \"limited, if any weight\", and it has sought and received legal advice.\n\nThe draft report, which was released on Monday as part of the stadium's Project of State Significance assessment process declared the stadium was \"overbearing\", would risk the state's credit rating, and would return only a 53-cent benefit to the state for every public dollar spent.\n\nLawyers representing the stadium's proponent, the Macquarie Point Development Corporation (MPDC), have written to the Tasmanian Planning Commission arguing the report contains \"errors of law\", approach and analysis.\n\nThe MPDC — a statutory government authority — says the letter from lawyers MinterEllison is the first of three representations it intends to make as part of the next steps of the project's assessment process, where stakeholders are invited to make submissions.\n\nThe letter outlines the MPDC's concerns with the draft report and says it is \"argumentative, lacks balance and relies on untested material\".\n\nIt argues that the draft report fails to properly assess the stadium project as intended under the State Policies and Project Act, and that the scope of the project has been unreasonably extended beyond its defined boundary.\n\nIt also argues against the adoption of \"significant portions of the Gruen Report\", which the MPDC says includes \"untested and incorrect assumptions\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/horse-races-cancelled-in-wa-midwest-causes-concern/105112426",
        "title": "WA horse racing regulator shuts down country meets",
        "publish_date": "Wed, 02 Apr 2025 22:59:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Questions are arising over the future of single meetings for rural communities as country races in Western Australia are cancelled.\n\nRacing and Wagering Western Australia (RWWA) has cancelled two horse racing events in Midwest towns in the past 12 months.\n\nMeanwhile, races in other parts of the region have been at a standstill due to requests to upgrade infrastructure.\n\nThe most recent cancellation was when RWWA deemed Mingenew's track \"not fit for purpose\" for its annual meet in March.\n\nA racing event in Dongara was also cancelled last year and Yalgoo's turf club had to spend thousands of dollars to keep its track operational.\n\nRWWA said in a statement the \"safety of participants and horses was a priority\".\n\nMr Cosgrove says his club is trying to find a date to reschedule races. (Supplied: Facebook)\n\nMingenew shire president Gary Cosgrove said a new rail had been put in to rectify damage inflicted during Cyclone Seroja in 2021.\n\nBut he said the only changes that had been made to the track were re-sanding and sewing the grass layer.\n\nHe said the turf club had spent the past year watering grass to get the track up to scratch but RWWA noticed a slight slant.\n\n\"Two stewards came up from Perth and inspected the track and found an area of concern … to do with the colour of the grass and where the track fell away over a short distance,\" Mr Cosgrove said.\n\n\"The solution was to move the rail in a metre … but at politics o'clock the head steward got one of his cohorts to contact the turf club and cancel.\"\n\nHe said the RWWA told him the meet could be rescheduled until May.\n\n\"But who wants to go to the races in the middle of seeding,\" he said.\n\nA RWWA spokesperson said in a statement an inspection \"noticed insufficient turf growth from the 1000m to the 400m mark and near the crossing\".\n\nMr Cosgrove said it was an arbitrary decision and there needed to be more streamlined communication to avoid cancellations \"for a stupid reason at the last minute\".\n\n\"Racing WA needs to set the standards for country racing and be really clear about it,\" he said.\n\nRhona Macphilomy is a past winner of the Mingenew Cup. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nCountry racing 'dwindling'\n\nFormer jockey and retired trainer Rhona Macphilomy said she felt sad for the clubs and there had been a clear decline in the industry.\n\nShe said despite there being a weakening appetite for the sport it was still the heart and soul of regional towns.\n\n\"It's a great atmosphere [and the] country people that go there. It's where the horses that can't win at provincial races can win and owners get the full enjoyment,\" she said.\n\nMs Macphilomy said she had concerns about changes to track inspections and better communication was needed.\n\nMs Macphilomy says there needs to be more investment in country racing. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nShe said it was concerning if the RWWA made decisions before consulting with riders or trainers.\n\n\"Because country tracks aren't like provincial ones, they aren't bowling greens, they are classed as dirt tracks with a covering of grass,\" Ms Macphilomy said.\n\n\"Have [RWWA] approached the top leading country trainer … or jockeys who ride there year in, year out?\n\n\"But if [RWWA] just went in there and said 'nope can't do that', then that's a bit sad on their behalf.\"\n\nHorses are spending less time on the track as regional races are cancelled. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nCountry barriers\n\nShire of Yalgoo chief executive Ian Holland said his region's race club had faced \"a rough couple of years\".\n\n\"The guys in control down in Perth don't like how the tracks are red dirt for some reason, even though that's how racing's been done for many years,\" he said.\n\n\"We've had a lot of suggestions for [fixing] the race track which I know other places have had exemptions for.\n\n\"It's almost pick-and-choose for one race a year what has to happen.\"\n\nMeanwhile in Broome, more than 1,000 kilometres north of Yalgoo, the horse racing track is also dirt, which the Broome Turf Club website describes as the main attraction.\n\nA horse races past the post at Yalgoo in 2017. (ABC Midwest & Wheatbelt: Glenn Barndon)\n\nThe Yalgoo Jockey Club has been asked to put in plastic barriers, which would cost about $220,000, in order to run their annual meet.\n\nMr Holland said the volunteer-run club did not have the money and would need to ask others, such as the shire, for help.\n\n\"It doesn't look like the racing commission is wanting to assist,\" he said.\n\n\"There should be a bit more effort put into assessing tracks so that [last minute cancellations] don't happen and it doesn't screw up all the other groups.\n\n\" The pattern [of country cancellations] almost makes the risk [of putting on an event] not worth taking. \"\n\nWhen asked to further outline the process, a RWWA spokesperson said there was \"nothing further to add\" but re-emphasised horses and participants were a priority.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-03/amazon-makes-a-bid-to-buy-tiktok-as-us-ban-is-set-to-take-effect/105130732",
        "title": "Amazon makes last-minute bid to buy TikTok as deadline looms",
        "publish_date": "Wed, 02 Apr 2025 22:32:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Amazon has put in a bid to acquire TikTok, a Trump administration official said, in an eleventh-hour pitch as a US ban on the platform is set to go into effect on April 5.\n\nThe official, who was not authorised to comment publicly and spoke on the condition of anonymity, said the Amazon offer was made in a letter to US Vice-President JD Vance and Commerce Secretary Howard Lutnick.\n\nUS President Donald Trump gave the platform a reprieve on Inauguration Day, barrelling past a law that had been upheld unanimously by the Supreme Court, which said the ban was necessary for national security.\n\nUnder the law, TikTok's Chinese-owned parent company ByteDance is required to sell the platform to an approved buyer or take it offline in the United States.\n\nMr Trump has suggested he could further extend the pause on the ban, but he has also said he expected a deal to be forged by Saturday.\n\nTrump hasn't saved TikTok, he's just given it a breather Photo shows A cutout black and white picture of Donald Trump against a black background, surrounded by teal and red geometic shapes Another US TikTok outage isn't off the cards. The only certainty is more upheaval, writes Ange Lavoipierre.\n\nAmazon declined to comment. TikTok did not immediately respond to a request for comment.\n\nThe existence of an Amazon bid surfaced as Mr Trump was scheduled on Wednesday to meet with senior officials to discuss the coming deadline for a TikTok sale.\n\nAlthough it is unclear if ByteDance plans to sell TikTok, several possible bidders have come forward in the past few months.\n\nAmong the possible investors are the software company Oracle and the investment firm Blackstone.\n\nOracle announced in 2020 that it had a 12.5 per cent stake in TikTok Global after securing its business as the app's cloud technology provider.\n\nIn January, the artificial intelligence startup Perplexity AI presented ByteDance with a merger proposal that would combine Perplexity's business with TikTok's US operation.\n\nLast month, the company outlined its approach to rebuilding TikTok in a blog post, arguing that it was \"singularly positioned to rebuild the TikTok algorithm without creating a monopoly\".\n\n\"Any acquisition by a consortium of investors could in effect keep ByteDance in control of the algorithm, while any acquisition by a competitor would likely create a monopoly in the short-form video and information space,\" Perplexity said in its post.\n\nThe company said it would remake the TikTok algorithm and ensure that infrastructure would be developed and maintained in \"American data centers with American oversight, ensuring alignment with domestic privacy standards and regulations\".\n\nCompeting consortiums put bids on the table\n\nWhite House to hold meeting on TikTok deal Photo shows A black and white TiKTok logo seen on the screen of a mobile phone placed over a laptop keyboard illuminated in pink and purple US President Donald Trump set an April 5 deadline for the app to find a non-Chinese buyer or be banned in the United States.\n\nOther potential bidders include a consortium, organised by billionaire businessman Frank McCourt, which recently recruited Reddit co-founder Alexis Ohanian as a strategic adviser.\n\nInvestors in the consortium say they have offered ByteDance $US20 billion ($32 billion) in cash for TikTok's US platform.\n\nJesse Tinsley, the founder of the payroll firm Employer.com, says he, too, has organised a consortium and is offering ByteDance more than $US30 billion for the platform.\n\nWyoming small business owner Reid Rasner has also announced that he offered ByteDance roughly $US47.5 billion.\n\nBoth the FBI and the Federal Communications Commission have warned that ByteDance could share user data — such as browsing history, location and biometric identifiers — with China's authoritarian government.\n\nTikTok said it had never done that and would not do so if asked.\n\nThe US government has not provided evidence of that happening.\n\nMr Trump has millions of followers on TikTok and has credited the trendsetting platform with helping him gain traction among young voters.\n\nDuring his first term, he took a more sceptical view of TikTok and issued executive orders banning dealings with ByteDance as well as the owners of the Chinese messaging app WeChat.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/what-dolphins-need-to-reverse-horror-start-and-ignite-their-biggest-star-20250326-p5lmrd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The Hammer’ has been grounded, so why is his coach ‘not concerned’?",
        "publish_date": "Thu, 03 Apr 2025 12:54:54 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Dolphins coach Kristian Woolf has leapt to Hamiso Tabuai-Fidow’s defence, but he also needs his star fullback to make his presence felt if the team is to overturn a winless start.\n\nDespite being one of the NRL’s leading talents, “The Hammer” has been kept quiet in 2025 – his 92 running metres from 11 carries against Wests Tigers arguably his quietest showing since arriving at Redcliffe.\n\nThe Queensland Maroons livewire’s promising second half against the Broncos was also offset by the 24 minutes it took him to register a run.\n\nHamiso Tabuai-Fidow for the Dolphins. Credit: NRL Photos\n\nSouth Sydney Rabbitohs fullback and Souths Logan Magpies product Jye Gray leads the Dally M Medal count, averaging 23 runs a game for 213 metres.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/western-australia/dutton-pledges-600-million-for-wa-farm-and-mine-roads-dodges-ir-law-questions-20250403-p5lout.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dutton pledges $600 million for WA farm and mine roads, dodges IR law questions",
        "publish_date": "Thu, 03 Apr 2025 12:45:14 +1100",
        "category": "finance",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "Opposition Leader Peter Dutton has targeted mining and farming regions in his first major campaign pledge to Western Australians.\n\nDutton was in Perth on Thursday to announce a national mining and agriculture roads program.\n\nOpposition Leader Peter Dutton in Perth. Credit: James Brickwood\n\nThe program would be developed in consultation with miners and farmers to identify roads that require upgrading to improve the transport of food and mining commodities.\n\n“I want Western Australia to continue to be the powerhouse of the national economy. But we need a government in Canberra that plays to WA’s strengths, not works against it,” Dutton said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/meghans-as-ever-products-sell-out-20250403-p5lovx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan's As ever products sell out",
        "publish_date": "Thu, 03 Apr 2025 12:39:56 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan's As ever products sell out\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/first-metro-train-rolls-along-the-final-stage-of-sydney-s-21-6b-line-20250403-p5loqg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First metro train rolls along the final stage of Sydney’s $21.6b line",
        "publish_date": "Thu, 03 Apr 2025 12:33:23 +1100",
        "category": "finance",
        "authors": [
            "Matt O'Sullivan"
        ],
        "text": "A metro train has run along the final section of Sydney’s new $21.6 billion rail line, marking the start of more than 6500 hours of testing that will determine when it will open to passengers next year.\n\nThe first train – set TS28 – rolled into Campsie station at 4am on Thursday, completing a super-slow, five-hour test run from Sydenham. The 6.5-kilometre trip will take just 11 minutes when the line eventually opens next year.\n\nStopping at each station, the train made its way to Campsie before later travelling the full length of the new line to Bankstown.\n\nThe first stage of testing on the Sydenham-Bankstown line involves metro trains travelling at up to 25km/h. In the months that follow, they will be tested at speeds of up to 100km/h and transition from manual to automated operations.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/first-metro-train-rolls-along-the-final-stage-of-the-m1-line-20250403-p5lovn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First metro train rolls along the final stage of the M1 line",
        "publish_date": "Thu, 03 Apr 2025 12:32:29 +1100",
        "category": "finance",
        "authors": [],
        "text": "First metro train rolls along the final stage of the M1 line\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/myanmar-miracle-earthquake-rescue-20250403-p5love.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Myanmar miracle earthquake rescue",
        "publish_date": "Thu, 03 Apr 2025 12:09:52 +1100",
        "category": "finance",
        "authors": [],
        "text": "Myanmar miracle earthquake rescue\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/trump-hits-australia-with-10-per-cent-tariff-on-all-exports-to-the-us-20250403-p5lopx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump hits Australia with 10 per cent tariff on all exports to the US",
        "publish_date": "Thu, 03 Apr 2025 12:08:04 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol",
            "Shane Wright"
        ],
        "text": "Global oil prices fell on fears of a slowdown in the American economy, while gold hit an all-time high of $US3192 on expectations the US will face higher inflation due to the tariffs. Australia has had a free trade agreement with the US since 2005 and no tariffs. But it maintains other barriers, including the beef ban and measures that have long irked the US trade office and Trump’s economic advisers. Prime Minister Anthony Albanese was the first world leader to respond to the announcement, interrupting the federal election campaign to hold a press conference just 30 minutes after Trump had finished speaking. He said Trump’s tariffs were “unwarranted” and had “no basis in logic”, would disrupt the global economy and harm the American people most of all.\n\n“This is not the act of a friend,” he said. “The Australian people have every right to view this action by the Trump administration as undermining our free and fair trading relationship, and counter to the shared values that have always been at the heart of our two nations’ long-standing friendship.” Trump’s move would have consequences for how Australians saw the relationship between the two countries, Albanese said. Commerce Secretary Howard Lutnick holds up a chart showing tariffs of 10 per cent on Australia and other countries. Credit: AP He indicated Australia would not impose retaliatory tariffs, and would continue to negotiate with the Trump administration. But US grievances with Australia, such as the Pharmaceutical Benefits Scheme and biosecurity arrangements, were not on the table. Albanese announced a five-point plan to immediately deal with the tariffs. It includes an extra $5 million for the Anti-Dumping Commission to protect key industries such as steel and manufacturing, $50 million in trade support for companies to find new markets and prioritisation of Australian firms in government procurement and local content.\n\nCoalition leader Peter Dutton, who backed the measures on anti-dumping, extra trade support and government procurement, said he could have negotiated a better outcome with the Trump administration. Loading “This is a bad day for our country. I want to resolve the matter and the question for us now is who is best able to deal with this relationship?” he said. The Australian Industry Group has warned that Trump’s tariffs will lead to dumping of manufactured goods across the rest of the world. Group chief executive Innes Willox said with around 50 per cent of goods being intermediate goods – unfinished products but components – the tariffs would have a far-reaching impact just beyond those products immediately hit by the tariffs.\n\n“Goods destined for the US may likely need to find a new home, raising the prospect of an influx of displaced goods coming to Australia,” he said. The Business Council of Australia, which represents the nation’s 100 biggest businesses, has warned Trump’s tariffs will hurt economic growth while urging a “measured” response from the federal government. “We don’t support retaliatory tariffs and strongly urge against them, because there are no winners in a trade war, which would only risk making our situation worse by forcing Australians to pay more and reducing job security,” the council’s chief executive Bran Black said Betashares chief economist David Bassanese said the tariffs would push up prices for American consumers by around 2 per cent and reduce US economic growth by a full percentage point. He said it increases the risk of an economic slowdown in Australia, which could force the Reserve Bank to slice official interest rates at its next meeting in May.\n\n“Today’s announcement is close to a worst-case scenario and the odds of a US or global recession have clearly increased,” he said. “For Australia, the net effect of today’s announcement is that it poses much more downside risk to economic growth than upside risk to inflation – hence it adds to the case for an RBA rate cut as early as next month.” The president touted the tariff announcement for weeks, calling it “Liberation Day for America” and asserting it would restore reciprocity and balance to the US’s trade relationships after being “ripped off” by friends and foes alike. April 2 “will forever be remembered as the day American industry was reborn, the day America’s destiny was reclaimed”, Trump said in the White House Rose Garden, surrounded by hanging American flags. He said the tariffs were “a declaration of economic independence”, and lashed out at “foreign cheaters” and “foreign scavengers” who had taken advantage of America. But he blamed previous US presidents for allowing the imbalance to occur.\n\nLoading “Now it’s our turn to prosper, and in so doing use trillions and trillions of dollars to reduce our taxes and pay down our national debt,” Trump said. An executive order released shortly after Trump’s speech said he would impose the tariffs using his executive authority by declaring a national emergency arising from the US’s large and persistent trade deficits. The lack of reciprocity in bilateral trade relationships, including tariff rates and non-tariff trade barriers, “constitute an unusual and extraordinary threat to the national security and economy of the US”, it said. A separate fact sheet said the 10 per cent baseline tariff would take effect on Saturday (Sunday AEDT). The additional “reciprocal” tariffs on countries, above 10 per cent, would start next week on April 9.\n\nLoading Trump said he anticipated receiving a flood of phone calls from world leaders seeking to negotiate, and if they wanted him to change his plans, they should remove their tariffs and non-tariff trade barriers. Trade Minister Don Farrell has previously said most of the beef exported to the US goes into hamburgers, and the tariffs would increase the cost of the fast-food staple for American consumers. “It doesn’t make any sense,” he said last month. The new tariffs follow the imposition of 25 per cent duties on steel and aluminium imports last month, a policy Trump resuscitated from his first term. Australia also sought an exemption from those tariffs, but it was denied.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/climate-change/ocean-swells-erode-beachfront-properties-on-central-coast-20250402-p5lop4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ocean swells erode beachfront properties on Central Coast",
        "publish_date": "Thu, 03 Apr 2025 12:02:02 +1100",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney",
            "Caitlin Fitzsimmons"
        ],
        "text": "Chris Rogers from the Wamberal Protection Association said big swells resulted in land slippage along the beach for a number of properties and a lot more exposure of the rocks and other protection put in place in 2020. “We had the SES doorknocking last night with [the] council,” Rogers said. “The frustrating thing for us is that four and a half years ago, I was one of the many people who got evacuated, and we are still in the same position.” Several home owners at both Wamberal and The Entrance have lodged development applications to build hard protective barriers – effectively a seawall buried in the sand – to protect their properties. Loading The proposal has attracted controversy among other Wamberal residents who are concerned it would impact the beach for the rest of the community.\n\nThe erosion comes just a day after Premier Chris Minns travelled to Wamberal to make clear his opposition to plans for a seawall along the beach. At Wamberal Breakers Country Club, more than 200 locals heard the premier back sand nourishment over the wall for the first time. “I don’t have any confidence that the erection of a seawall wouldn’t have devastating impacts for the rest of the beach,” Minns said. Rogers said the beachfront residents welcomed the premier’s commitment to sand nourishment but would continue their lawful process with the development applications as well. The proposal for the 1.4-metre concrete wall at Wamberal was officially submitted to the council last year, but the idea gained traction in 2020 when wild storms caused such serious coastal erosion that beachfront homes began to crumble into the sea.\n\nThirty metres of beach were washed away, and the foundations of some homes were pictured teetering precariously from the cliff. Loading Wamberal Beach has hosted multiple rallies against the proposed wall since that storm, as the battle between the anti-wall Wamberal Beach Save Our Sand group and the pro-wall Wamberal Protection Association got heated. Seawalls have also proved controversial in other communities, such as Collaroy on the northern beaches, which was described as a “hellscape” in 2022 when a storm washed away a huge swath of sand. Experts in coastal erosion say seawalls are effective at protecting what is behind them but can exacerbate sand erosion underneath. However, a beach backed by natural dunes is also an effective barrier and can allow the beach to retreat as sea levels rise because of climate change.\n\nJavier Leon, associate professor in physical geography at the University of the Sunshine Coast, said seawalls should be reserved for places where there is valuable public infrastructure behind them. “I’m more of an advocate of nature-based solutions – having a healthy dune offers better protection in the long term for infrastructure,” Leon said. “For those houses on dunes and in erosion-prone areas like Wamberal, I believe that a more cost-effective solution is actually buying back and just managing that retreat,” Leon said. ‘We need a solution’ Mehan said his personal view was that buybacks were “a valid option” that could be considered alongside beach nourishment and other solutions. He added that buybacks would not be suitable in every location, noting that in the case of The Entrance, there was also an adjacent channel.\n\n“We need to get a solution that works for the whole state rather than wait for people to put in a DA – that’s not very satisfying,” Mehan said. Tropical Cyclone Alfred devastated Gold Coast beaches last month. Credit: AAPIMAGE A spokesperson for the NSW government said there were no plans for buybacks of beachfront properties anywhere in the state. Rogers said the idea of buybacks was “ridiculous” in the case of Wamberal because fair compensation to home owners would cost up to $700 million. He also said there were only 14 metres between the beach and the road, measured at two empty blocks, so the dunes would not provide sufficient protection for public infrastructure. “All the homes at Wamberal Beach and along the coast have been bought through a legal process,” Rogers said. “If we have the right to buy there ... we’ve got a right to protect our homes.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/reed-mahoney-is-an-unfair-target-six-tackles-with-gus-ep7-20250402-p5lop5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reed Mahoney is an unfair target: Six Tackles with Gus - Ep7",
        "publish_date": "Thu, 03 Apr 2025 12:00:10 +1100",
        "category": "finance",
        "authors": [],
        "text": "Reed Mahoney is an unfair target: Six Tackles with Gus - Ep7\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/donald-trump-s-dumb-trade-war-just-got-much-much-dumber-20250403-p5lor6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Donald Trump’s dumb war just got much, much dumber",
        "publish_date": "Thu, 03 Apr 2025 11:59:26 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "American agriculture is an obvious vulnerability if there are retaliatory responses, but its service sector, particularly its big technology companies, should be nervous. Trump always focuses on the $US1.2 trillion ($1.9 trillion) trade deficit America has in goods, but never talks about the $US1 trillion-plus surplus it has in services. It is inevitable that services would be listed within the responses the European Union prepared in anticipation of an escalation in Trump’s trade wars. Trump’s tariffs will raise revenue – the best guesstimate is around $US600 billion a year – but, contrary to what he constantly (and falsely) asserts, that revenue won’t come from the countries on which the tariffs have been imposed but from US companies and consumers. Wall Street is facing a bloodbath on Thursday in New York. Credit: AP US tariffs are paid by the importer, on US soil, and either absorbed by the importing company, passed on to consumers or shared between them. Historically, it has been consumers who have borne the brunt of the impacts.\n\nTrump says that his “beautiful” tariffs will force foreign companies to invest more in the US to manufacture in America what they previously exported from elsewhere. While that could happen at the margin, there are several problems with that assertion. One is that, for many of the goods the US imports, the US has no significant manufacturing capacity and no substitutes for the imported goods. It takes time, perhaps years, lots of capital and a stable and predictable external environment to build a major manufacturing plant in the US, as well as some form of competitive advantage. Even if Trump could coerce foreign companies to invest in US capacity – and, to be fair, some have said they will (although that proof will be in the pudding) – there will be a hiatus during which the prices of imports will spike.\n\nLoading Moreover, in the complex global manufacturing ecosystem that the US and its companies, primarily, have created over decades, supply chains are so interdependent that it will be very difficult – for many, impossible – for companies to shift from their current sourcing arrangements for their inputs to a purely US business. The US isn’t self-sufficient in some of the key inputs to manufacturing and doesn’t have all the domestic resources it would need to be self-sufficient. Trump has, for instance, put a 25 per cent tariff on aluminium imports but domestic production meets only about 50 per cent of the demand for aluminium. US aluminium prices, and the prices of downstream products that include aluminium, have already spiked. He put a similar tariff on steel imports, which covers products with steel components. The prices of things as basic as screws and nails, which America doesn’t manufacture in any meaningful volumes, are spiking.\n\nThe US is a highly developed country with – relative to many of the countries on which it is imposing high tariffs (like Vietnam and its 46 per cent rate) – high labour and non-labour costs. US manufacturing wages average just over $US100,000. Bangladeshi exporters could, if they had to, absorb the 37 per cent tariff on their exports and still massively undercut a US manufacturer. China, facing a 34 per cent rate, has wages about a quarter of those in the US. Even European manufacturing wages are at least 25 per cent lower on average than America’s. There are good reasons why America, and other developed countries, including Australia, exited low-value-added and labour-intensive sectors like the clothing, footwear and textiles industries, instead importing lower-cost products from low-cost developing economies for mutual economic benefit. Trump’s obsession with tariffs, his threats to use them again against anyone who retaliates, the shadow of further tariffs on more commodities, such as copper, and his unpredictability and chaotic approach to policymaking – even on Tuesday, he and his cabinet were still trying to decide what form the tariffs would take – make for a volatile and uncertain environment for corporate decision-making.\n\nLoading That level of uncertainty, and the potential for his web of tariffs to be unwound by a future administration – or as early as next year’s midterm elections, if the Democrats can get their act together and exploit Americans’ declining approval rates for Trump and the Republicans – will cause executives to be cautious about investing on the basis that the tariffs will be permanent. A $US600 billion tax hike and its inflationary impacts, by themselves, will be negative for US growth. Add the uncertainty around the impact of Trump’s trade war – US manufacturing activity, employment and orders were already shrinking before Liberation Day, with business citing the looming tariffs as a factor – and the outcomes could be nasty. Having been handed an economy growing at almost 3 per cent, with ultra-low unemployment and declining inflation, Trump’s love of tariffs (and misunderstanding, or mischaracterisation, of how they work) could produce a self-inflicted recession in what was regarded as the strongest developed economy in the world. Financial markets had been hoping that what Trump announced in the Rose Garden would be the “kind” tariffs that he claimed he has ordered. Wall Street closed slightly up on Tuesday afternoon.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/five-countries-worst-hit-by-trump-s-tariffs-20250403-p5los4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five countries worst hit by Trump’s tariffs",
        "publish_date": "Thu, 03 Apr 2025 11:52:59 +1100",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "The US is the second-biggest trading nation in the world after China, and the biggest importer of goods. More than 200 countries, territories and regional associations around the world trade with the US, and on Thursday, the White House released a list of more than 100 of them that would be hit by new tariffs.\n\nThe tariff rates include a baseline of 10 per cent on all imports (except those covered by an existing continental trade deal known as CUSMA between the US, Mexico and Canada). These tariffs will come into effect on Saturday, US time.\n\nThere are also further reciprocal tariffs on imports from roughly 60 countries dubbed by Trump as the “worst offenders” – those that have their own tariffs on US goods or other barriers in place, including currency manipulation or restrictions. These will come into effect on April 9, US time.\n\nHere are the countries facing some of the steepest – or unexpected – tariff rates.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/helpless-beveridge-goes-on-the-attack-swans-star-out-for-two-months-20250403-p5lotu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Helpless’ Beveridge goes on the attack; Swans star out for two months",
        "publish_date": "Thu, 03 Apr 2025 11:49:05 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Loading “So the suggestion for me was to make sure we bring back prior opportunity and validate incorrect disposal.” The AFL adjusted their interpretations last year after coaches, led by Gold Coast’s Damien Hardwick and Carlton’s Michael Voss, called on umpires to start making faster calls on holding-the-ball decisions. Beveridge has raised it personally with the AFL. “We’ve gone from that to now this total confusion, so unfortunately we need a correction and it needs to come from City Hall [the AFL] and through the umpires. Because the umpires are just finding it too hard. They don’t know how to adjudicate it and our players don’t know what the decision is going to be.\n\n“I don’t think we as coaches have ever felt as helpless around that and coaching it as we do now. I think the whole competition is confused.” AAP Papley adds to injury crisis Vince Rugari Sydney’s injury crisis has worsened with Tom Papley set to be sidelined for up to two months, while Logan McDonald has been cleared to resume playing this weekend – but will make his return through the VFL this weekend rather than being rushed into their depleted line-up.\n\nThe Swans will be missing 10 players when they face North Melbourne on Saturday, including several first-choice players in Errol Gulden (ankle), skipper Callum Mills (foot), Taylor Adams (hamstring) and defensive trio Lewis Melican (adductor), Robbie Fox (calf) and Harry Cunningham (foot). Papley is the latest to join the club’s bulging injury ward after reporting soreness in his half after training last weekend, when the Swans had the bye. Scans revealed the 28-year-old small forward has suffered a crack in his heel and is likely to miss between six to eight weeks, coach Dean Cox said on Thursday. Tom Papley (centre) is out with a heel injury. Credit: Getty Images “We’ll get a bit more verification on that in the following days. But, yeah, not great news,” he said. “We’ve already got some key personnel out, now you get another one. Fortunately, this game moves forward, and you create an opportunity for another player.”\n\nLoading Some of Sydney’s injured players, like Mills and Adams, have had either slower than expected recoveries or have had setbacks in their rehabilitation, meaning that Cox won’t be able to field anything even close to resembling his best 22 until the second half of the season at best. On the eve of Opening Round he conceded that some of his pre-season methods may have contributed to the physical toll but said it was largely a case of bad luck. “The thing when you look at it with injuries is, are they common? Are they reoccurring? Are they avoidable? Some of these ones ... Errol tackled, Callum with plantar fascia, and, obviously, Tom now with a heel. So they’re all different,” he said. “We’ve just got to make sure that we try and prepare our players the best way they can. We understand it is a contact game, and [we need] to push players to a limit knowing that they’ve got to withstand that game day.\n\n“A lot of our players were slow to start through the off-season. So some of them are finding it a little bit tough through this period.” There is better news, though, with McDonald set to play a competitive match for the first time in 2025, having undergone ankle surgery at the end of last season. However, Cox said he would need to build up his minutes – initially with the Swans’ reserves in the VFL – before he is able to properly contribute at the top level. “He’ll be on restricted minutes, but ... Logan is in our best team,” he said. “He hasn’t trained a lot through the whole pre-season program. The first couple of weeks will just be about playing. Whether that be forward, back, on a wing, I’m not really concerned with that.” Saturday’s clash with the Kangaroos will be the first for ex-Swans captain Luke Parker against his former side, though Cox said he will not be in for any extra treatment. “It’ll be different. He’s playing some really good footy, as North are as well,” he said. “He’ll just be another North player ... no doubt, he’ll be trying to prove his best, like our players will as well. They’re pretty mature now. They’ll go about their business the way they need to.”\n\nInfluential AFLW coach to depart AAP Adelaide’s dual AFLW premiership coach Matthew Clarke will step down after the looming season. Clarke has been the Crows’ women’s coach since the 2018 but says the time will be right to relinquish the job after next season. “My time leading this team has been the most enjoyable in my 30-plus years in football,” Clarke said in a statement on Thursday.\n\n“Stepping away from the role will be really tough but my experience in and around the game tells me the decision is what is best for the group in the medium and longer term. “I love footy and will forever be connected to the game but what form that takes beyond this year is something I am yet to determine. Adelaide coach Matthew Clarke with the 2022 AFLW premiership cup. Credit: AFL Photos “I want to throw everything I have into this season and give our players, staff and our Crows supporters the best possible chance to experience another amazing AFLW season.” Clarke, who will coach the Crows for an eighth season, won flags in 2019 and 2022 and also has reached six preliminary finals.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/everyone-has-a-use-by-date-v-landys-addresses-speculation-about-his-future-20250403-p5losn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Everyone has a use-by date’: V’landys addresses speculation about his future",
        "publish_date": "Thu, 03 Apr 2025 11:45:00 +1100",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Australian Rugby League chairman Peter V’landys has addressed speculation that he could be finishing up as the boss of Racing NSW at the end of the year, admitting “everyone’s use-by-date comes along at some point”.\n\nV’landys has juggled twin responsibilities for the past six years, making him arguably the most influential sporting administrator in the country. There has been renewed conjecture that he may be about to finish up in racing, with a view to potentially moving into an executive chair role in rugby league.\n\nSpeaking for the first time about his future, V’landys said he remained “undecided” whether he would continue with both jobs.\n\n“I’ve done it for the last six years and nothing’s changed; at the end of the year I will look at it again and see what I’m doing for 2026,” V’landys told this masthead.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/art-and-design/no-trace-dissident-artist-told-his-work-has-been-removed-from-hong-kong-billboard-20250403-p5lorj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘No trace’: Dissident artist told his work has been removed from Hong Kong billboard",
        "publish_date": "Thu, 03 Apr 2025 11:41:33 +1100",
        "category": "entertainment",
        "authors": [
            "Elizabeth Flux"
        ],
        "text": "An artwork by dissident artist Badiucao created to test freedom of speech in Hong Kong appears to have been removed.\n\nHere and Now is a four-second video work by the Shanghai-born, Australia-based, Walkley award-winning artist, who is also a contributor to this masthead. It had been showing hourly on two billboards in Hong Kong’s busy Mong Kok district, but Badiucao said he has been informed by multiple groups of people who visited both sites that “there is no trace of my video showing any more”.\n\nBadiucao’s Here and Now work in Hong Kong.\n\nThe clip, which has no audio or caption, shows the artist silently speaking the words “You must take part in revolution”. The video had been showing as part of an outdoor exhibition titled Luminescence, commissioned by digital gallery Art Innovation.\n\nHours before the work’s apparent removal, the artist had released a video and statement revealing its true intent, telling this masthead that Here and Now was a “test for the freedom-of-speech situation in Hong Kong”. He had expected that the work would be taken down in response to his revelation.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/who-is-the-labor-party/oea3xmz49",
        "title": "Who is the Labor Party?",
        "publish_date": "Wed, 2 Apr 2025 23:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Australian Labor Party.\n\n\n\n\n\nThat's L-A-B-O-R, we'll get to why there's no U later.\n\n\n\n\n\nIt's Australia's oldest political party, and its currently in power in Australia.\n\n\n\n\n\nBut where did the Labor party come from and who are they now?\n\n\n\n\n\n\"Well, it came out of the great shearer strikes in Western Queensland in the 1890s.\"\n\n\n\n\n\nThat's Wayne Swan, former Treasurer, and current National President of the Australian Labor Party.\n\n\n\n\n\nAlso known as the ALP, the party emerged from Australia’s labour and union movement in the 19th century.\n\n\n\n\n\nBack then, working conditions were poor, so trade unions, which are organised groups of workers, were formed.\n\n\n\n\n\nThey wanted their demands taken seriously by the government, and so they formed the Labor Party in 1901.\n\n\n\n\n\nIn the beginning, Labor's policies were focused on workers' rights.\n\n\n\n\n\nThey campaigned for the eight hour working day, and created the minimum working wage.\n\n\n\n\n\nIn its early days it was a strong advocate for the ‘White Australia Policy’ and was largely against immigration.\n\n\n\n\n\nBut these days, the party's priorities have shifted.\n\n\n\n\n\nIt still says it represents the working class, and workers' rights in Australia.\n\n\n\n\n\nAnd Mr Swan says it still has strong ties to unions.\n\n\n\n\n\n\"We are a party that is proudly of the union movement and associated with the union so the union movement is a participant in our party. Not all union members are members of the Labor Party, but many are. And the ethos of unionism, the solidarity that comes from it, looking after your mate, if you like, always been having an eye out for those that are more vulnerable, and lending them a helping hand lies at the very core of unionism, but also at the very core ethos of the Labor Party.\"\n\n\n\n\n\nBut these days, Labor fills the space of the more progressive party out of the two main contenders - it's considered to be centre left.\n\n\n\n\n\nSenior Lecturer at the Australian National University Dr Jill Sheppard says that can be a bit of a struggle.\n\n\n\n\n\n\"So sometimes, when we think, gee, we'd expect Labor to be a bit more progressive on some issues, or, you know, maybe a bit more pro immigration, we can sometimes explain that by drawing on their history of being really trade union representatives.\"\n\n\n\n\n\nWayne Swan says it's what you'd call a party of big government.\n\n\n\n\n\n\"We fundamentally believe that government has got a role to play in creating prosperity and then spreading the opportunity. So we see a significant role for government intervention in the economy, in clear contrast to the number of conservative parties over the past 100 years that have argued for essentially a survival of the fittest mentality on their side of politics, small government, regressive tax, a very sparse social safety net.\"\n\n\n\n\n\nSome more recent achievements include:\n\n\n\n\n\n- Introducing universal healthcare in 1974\n\n\n\n\n\n- The Native Title Act of 1993\n\n\n\n\n\n- Setting up the National Disability Insurance Scheme, the NDIS, in 2013\n\n\n\n\n\nDr Sheppard says over the last 15 years the party would be proud of its social achievements.\n\n\n\n\n\n\"We might look at things like the apology to the Stolen Generations, we might look at constant minimum wage increases, things that don't always sound very exciting, but they are the important business of governing the country, making sure that there is a safety net for the worst-off Australians.]\n\n\n\n\n\nOh and back to the spelling - the theory is there's no U because of at the time of its creation, a lot of the writing on the labour movement was American, hence, the American-English spelling.\n\n\n\n\n\nThe early party also probably wanted to distance itself a bit from Britain, and the British Labour Party, which is spelled with a U.\n\n\n\n\n\nThe party's longest serving leader, known as Labor royalty, was Bob Hawke.\n\n\n\n\n\nKnown for ending military conscription, establishing universal healthcare... and the speed he could skull a beer.\n\n\n\n\n\nSome other well known leaders include:\n\n\n\n\n\n- Gough Whitlam, who was controversially dismissed by the Governor-General.\n\n\n\n\n\n“Long may we say God save the Queen, because nothing will save the Governor-General.\"\n\n\n\n\n\n- Kevin Rudd - who was pushed out by Australia's first and only female PM Julia Gillard\n\n\n\n\n\n\"I will not be lectured about sexism and misogyny by this man. I will not. And the Government will not be lectured about sexism and misogyny by this man. Not now, not ever.\"\n\n\n\n\n\n- who then had the same done to her by Kevin Rudd.\n\n\n\n\n\nThe leader of the party, and Australia at the moment, is Anthony Albanese.\n\n\n\n\n\nIf Labor wins the next election, he'll be Prime Minister again.\n\n\n\n\n\nHe's been a federal politician for almost 30 years, elected to the inner west Sydney seat of Grayndler.\n\n\n\n\n\nHe talks a lot about how he grew up in public housing with a single mother.\n\n\n\n\n\nWhen taking office, he said his government's areas of focus would be the cost of living, bolstering Indigenous rights, and tougher climate action.\n\n\n\n\n\nAs we head into the election, Mr Swan says it's not going to be easy for Labor.\n\n\n\n\n\n\"There's a myriad of challenges. There's been no government in the last couple of years that's been re elected internationally in this cost of living crisis, which is largely internationally induced. So it's, it's a tough environment to go to the people.\"\n\n\n\n\n\nThis election, Labor's policies include:\n\n\n\n\n\n- Cutting student debt\n\n\n\n\n\n- Making childcare cheaper\n\n\n\n\n\n- Improving Medicare\n\n\n\n\n\n- And investing in renewable energy\n\n\n\n\n\nSo how does the party stack up to its original manifesto?\n\n\n\n\n\nDr Sheppard says there's been a lot of change.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cost-of-living-secrets-housing/o3b4vre6d",
        "title": "Cost of Living Secrets: Housing",
        "publish_date": "Wed, 2 Apr 2025 22:01:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cost-of-living-secrets-financial-planning/9nbtyymcg",
        "title": "Cost of Living Secrets: Financial Planning",
        "publish_date": "Wed, 2 Apr 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-unveils-reciprocal-tariff-plan/vcuf8tinn",
        "title": "Peter Dutton calls Anthony Albanese 'weak' over US tariffs",
        "publish_date": "Wed, 2 Apr 2025 20:53:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump has announced a \"historic executive order instituting reciprocal tariffs on countries throughout the world\", set to impact multiple industries across the globe.\n\n\n\n\n\nThe tariffs will go into effect on April 5 at 12:01am local time.\n\n\n\n\n\nTrump later brought out a chart outlining the amount of reciprocal tariffs each country around the world would have.\n\n\n\n\n\n\"For nations that treat us badly, we will calculate the combined rate of all their tariffs, non-monetary barriers and other forms of cheating, and because we are being very kind, we're kind people ... we will charge them approximately half of what they are and have been charging us,\" he said.\n\n\n\n\n\n\"So the tariffs will be not a full reciprocal — I could have done that — but it would have been tough for a lot of countries. We didn't want to do that.\"\n\n\n\n\n\n\"I call this kind reciprocal. This is not full reciprocal.\"\n\n\n\nUS President Donald Trump has announced \"kind\" reciprocal tariffs globally, including a 10 per cent base tariff on Australia. Source: Getty / Chip Somodevilla While some parts of the announcement were vague, he did announce a sweeping 25 per cent tariff on \"all foreign-made automobiles\".\n\n\n\n\n\nAccording to a White House release, the tariffs will remain in effect until \"President Trump determines that the threat posed by the trade deficit and underlying nonreciprocal treatment is satisfied, resolved, or mitigated.\"\n\n\n\nHow much will each country be tariffed?\n\nAustralia will be hit with a blanket 10 per cent base tariff. This is the global baseline and the smallest tariff implemented.\n\n\n\n\n\nAccording to the chart, the tariffs hitting each country will be:\n\n\n\nAustralia: 10 per cent\n\nChina: 34 per cent\n\nEuropean Union: 20 per cent\n\nVietnam: 46 per cent\n\nTaiwan: 32 per cent\n\nJapan: 24 per cent\n\nIndia 26 per cent\n\nSouth Korea 25 per cent\n\nThailand 36 per cent\n\nJapan: 24 per cent\n\nIsrael: 17 per cent\n\nIndia: 26 per cent\n\nNorfolk Island, a small Australian island in the South Pacific Ocean, will be tariffed 29 per cent. \"I think Norfolk Island, somehow, has been hit with 29 per cent tariff rather than 10 per cent. Last time I looked, Norfolk Island was a part of Australia,\" he told ABC Radio Melbourne.\n\n\n\nThe Heard and McDonald Islands, both uninhabited Australian external territories inaccessible by airplane, have also been included in the tariffs. The islands are home to seals, penguins, and birds — but no people.\n\n\n\n\n\nCanada and Mexico were exempt from tariffs. Meanwhile, Cuba, Belarus, North Korea and Russia were also exempt as \"they are already facing extremely high tariffs\".\n\n\n\nAustralian beef in the firing lines\n\nAustralia earned a direct mention from Trump, hinting that he will reciprocate Australia's ban on fresh beef imports.\n\n\n\n\n\n\"Australia bans — and they're wonderful people, and wonderful everything — but they ban American beef,\" he said.\n\n\n\nREAD MORE From shopping to superannuation: How a US trade war could impact Australians\n\n\"Yet, we imported $3 billion of Australian beef from them just last year alone. They won't take any of our beef. They don't want it because they don't want it to affect their farmers,\" Trump said.\n\n\n\n\n\n\"I don't blame them, but they're doing the same thing right now starting at midnight tonight, I would say.\"\n\n\n\n\n\nHe also ruled out any exemptions unless countries agreed to \"terminate your own tariffs\".\n\n\n\n\n\nSBS News understands there is no ban on Australian beef, just the 10 per cent blanket tariff.\n\n\n\n'This is not the act of a friend'\n\nPrime Minister Anthony Albanese responded to Trump's tariff plan on Thursday morning, saying the move was not surprising but \"totally unwarranted\".\n\n\n\n\n\n\"The unilateral action that the Trump administration has taken today against every nation in the world does not come as a surprise. For Australia, these tariffs are not expected, but let me be clear — they are totally unwarranted,\" he said.\n\n\n\n\n\n\"[US] President Trump referred to reciprocal tariffs. A reciprocal tariff would be zero, not 10 per cent. The administration's tariffs have no basis in logic and they go against the basis of our two nations' partnership. This is not the act of a friend.\"\n\n\n\n\n\nAlbanese then ruled out imposing reciprocal tariffs against the US.\n\n\n\n\n\n\"Today's uncertainty in the global economy and it will push up costs for American households. It is the American people who will pay the biggest price for these unjustified tariffs. This is why our government will not be seeking to impose reciprocal tariffs,\" he said.\n\n\n\n\n\n\"We will not join a race to the bottom that leads to higher prices and slower growth.\"\n\n\n\n\n\nPutting the impact of the tariffs into perspective, Albanese said trade with the US accounted for less than 5 per cent of Australian exports, but said other countries in the world — including Asian countries closer to home — would be hit hardest by the sweeping tariffs.\n\n\n\n\n\nAustralia's fourth most valuable export market is the US.\n\n\n\n'Significant failing'\n\nOpposition leader Peter Dutton said Australia needs to \"negotiate hard\" with the Trump administration while criticising Albanese for his inability to secure a phone call with Trump in recent weeks, calling it a \"significant failing\".\n\n\n\n\"I think in the end what we need to be able to do is to sit down with the administration and negotiate hard on our country's behalf,\" Dutton told 2GB radio.\n\n\n\n\n\n\"There has been no significant leader-to-leader negotiation ... we need to be strong and stand up for our country’s interests.\"\n\n\n\n\n\nDutton said \"the US requires Australian beef\" and they \"can't produce enough beef to satisfy domestic consumption\".\n\n\n\n\n\nIn a press conference late Thursday morning, Dutton continued the shots at Albanese, saying: \"The prime minister has been weak and missing in action. That's why we find ourselves in the position we're in today.\"\n\n\n\nPeter Dutton criticised Anthony Albanese over US tariffs. Source: AAP / Lukas Coch Dutton said he believed he could have achieved a different outcome than the Albanese government and said he was more capable of \"fighting\" Trump than his opposition.\n\n\n\n\n\n\"It involves making sure that we can stand up and fight for our position ... I don't think the prime minister has the strength or ability to stand up to a situation that is unacceptable to us,\" he said.\n\n\n\n\n\n\"The times at the moment don't require a weak leader.\"\n\n\n\n\n\nDutton said he had the \"ability\" to reach the Trump administration, earlier criticising Albanese for not being able to lock in a phone call or a meeting with the US leader.\n\n\n\n\n\nHowever, when asked if he could remove the tariffs if elected as prime minister, Dutton said that his team offered \"stability\" and the \"ability to manage the economy\", and hinted at bargaining chips such as defence.\n\n\n\n\n\n\"There are other elements of the relationship that are important to the United States and to us, in our mutual best interests, around the defence relationship and the trade relationship, including on beef more broadly.\"\n\n\n\n\n\n\"We're not trading anything away. We want to enhance the relationship and I believe we're the only alternative at this election that can achieve a better outcome.\"\n\n\n\nREAD MORE Is the election promise of cheaper medicines under threat from US tariffs?\n\nHe also warned that the impending tariffs would affect jobs here at home: \"Jobs will be lost and there will be economic detriment to our country.\"\n\n\n\n\n\nNationals leader David Littleproud said his immediate reaction was \"deep disappointment\" and echoed Dutton's criticism of Albanese.\n\n\n\n\n\n\"We're a trusted partner with the United States, and we stand with the government in opposing this,\" Littleproud told ABC News.\n\n\n\n\n\n\"What we need is a relationship reset. We've got a prime minister who can't even get a phone call with the president. That's because of the personal disparaging comments he made in the past.\"\n\n\n\n'Every Australian should be disappointed'\n\nBran Black, chief executive of the Business Council of Australia (BCA) said the council is \"deeply disappointed by the size and scale of global tariffs imposed by the United States on Australia and other trading nations\".\n\n\n\n\n\n\"The United States is a long-standing friend and ally, and we’ve historically stood together through thick and thin, so every Australian should be disappointed by these tariffs,\" Black said.\n\n\n\n\n\n\"We'll continue to engage with Australian businesses and directly with our contacts and counterparts in Washington DC with a view to securing the exemption from these tariffs that our nation deserves.\n\n\n\n\n\n\"There are so many reasons why Australia should be exempt from any tariffs, including that the US has a trade surplus with us and the existence of long-standing cultural and military ties between our countries, especially now with the AUKUS agreement.\"\n\n\n\nWhile the head of the European Union's executive has warned of retaliation tariffs, the BCA said it didn't support this type of reaction.\n\n\n\n\n\n\"We don't support retaliatory tariffs and strongly urge against them because there are no winners in a trade war, which would only risk making our situation worse by forcing Australians to pay more and reducing job security,\" Black said.\n\n\n\n\n\n\"As a trading nation, free and open access to global markets is critical for Australia, especially as one in every four of our nation’s jobs relies on trade.\"\n\n\n\nStocks already begin to tumble\n\nTrump's announcement came shortly after Wall Street trading ended, but US stocks have already started to plummet in after-hours trading. Dow Futures has dropped 2.32 per cent, S&P 500 futures has dropped 3.40 per cent, and Nasdaq 100 futures shrank 4.22 per cent.\n\n\n\n\n\nMeanwhile, the Australian share market has tumbled in early trade, with the ASX 200 and the All Ordinaries both down 1.8 per cent at the time of writing.\n\n\n\n\n\nThe Australian dollar is currently down 0.8 per cent, trading below 62.4 US cents.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cost-of-living-secrets-side-hustles/4yub6h4o2",
        "title": "Cost of Living Secrets: Side Hustles",
        "publish_date": "Wed, 2 Apr 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/massive-swells-pummel-australias-coastline/6nqvoi9nx",
        "title": "Massive swells pummel Australia's coastline",
        "publish_date": "Wed, 2 Apr 2025 09:49:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/on-the-campaign-trail-day-5/078jkcwc3",
        "title": "On the campaign trail: Day 5",
        "publish_date": "Wed, 2 Apr 2025 09:37:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "On the campaign trail: Day 5\n\nPublished 2 April 2025, 8:20 am\n\nLabor has asked the Fair Work Commission to deliver an economically sustainable wage rise for 3 million Australians above the rate of inflation. The Opposition is vowing to increase private sector investment but would not say where planned cuts on the public sector would come from.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/investors-bracing-for-fireworks-as-reciprocal-tariffs-revealed/ztycnq7x4",
        "title": "Investors bracing for 'fireworks' as reciprocal tariffs revealed",
        "publish_date": "Wed, 2 Apr 2025 07:08:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-study-finds-high-rate-of-chronic-conditions-in-australian-teenagers/4wnacoca6",
        "title": "New study finds high rate of chronic conditions in Australian teenagers",
        "publish_date": "Wed, 2 Apr 2025 06:19:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nMelanie Funk's twin boys Matthew and Harry were born with severe eczema, a chronic skin condition the Gold-coast based mum says can be debilitating.\n\n\n\n\n\n\"My boys, they've faced painful skin flareups and sleep disruption, difficulty concentrating on schoolwork due to fatigue, isolation from sports and social events due to bad flareups and anxiety and low confidence at times.\"\n\n\n\n\n\nDuring the twins' early years, Melanie says she found a big gap in the support available for families and people living with eczema.\n\n\n\n\n\nThat compelled her to establish Eczema Support Australia, a national charity that bridges this gap.\n\n\n\n\n\nToday, the 15 year old twins are managing the condition with advanced treatments - but Melanie says teenage-hood comes with a number of challenges that can trigger flare-ups.\n\n\n\n\n\n\"Stress and anxiety, especially during exams. Hormonal changes during adolescence can be a big one. Heat, sweat, allergens, and sometimes certain foods, poor sleep and even screen time related activities.\"\n\n\n\n\n\nA new study has now established just how many teenagers like Melanie's twins are living with a chronic condition.\n\n\n\n\n\nThe research published in the Australian and New Zealand Journal of Public Health has found almost half of the 5000 teens they surveyed - or 46 per cent - are living with either a chronic disease - such as eczema, asthma, hayfever and food allergies - or developmental conditions like autism and ADHD.\n\n\n\n\n\nThe research has observed a link to poor mental health and unhealthy habits.\n\n\n\n\n\nThese (habits) include excessive screen time, ultra-processed foods, smoking and alcohol, sleep deprivation.\n\n\n\n\n\nLead author Bridie Osman from the Matilda Centre for Research in Mental Health and Substance Use at the University of Sydney says it remains unclear just how they are connected - but the extent of these habits is troubling.\n\n\n\n\n\n\"So that statistic is quite high and it's quite shocking to see the magnitude of the issue that we are facing at the moment. It could be down to the fact that Australia has reached skyrocketing levels of ultra processed food intake, and with mental health disorders in Australia, they're also at an all time high.\"\n\n\n\n\n\nBridie Osman says asthma, hay fever and eczema among the chronic diseases with the highest prevalence, whilst the most common developmental condition is ADHD.\n\n\n\n\n\n\"These diseases, they're all variable with their pathology, so they can be genetic or they can be caused by our lifestyles so it's always hard to determine which one comes first. But what we do know is that regardless of how these diseases come about, they do get worse by worse mental health and behavioural factors.\"\n\n\n\n\n\nThe researchers, as well as experts not involved in the study, have emphasised the unhealthy habits are not the cause of such conditions.\n\n\n\n\n\nProfessor Susan Sawyer is the Director of the Centre for Adolescent Health at the Murdoch Childrens Research Institute.\n\n\n\n\n\nShe says the potential link highlights a need for further research.\n\n\n\n\n\n\"Australia's long been recognised to have a much heavier burden of atopic disease in terms of asthma, hay fever, and in particular food allergy. We are known as the food allergy capital of the world. To some extent. This may be reflections of our genetics, but more typically people think that this is reflecting something about our physical environments as well.\"\n\n\n\n\n\n\n\nProfessor Sawyer also says there needs to be better focus on prevention.\n\n\n\n\n\n\"We know that children's and young people's health behaviours, health risks, and indeed their health outcomes are shaped not only by their biology and their genetics, but also by their physical environments and social environments, including their online environments. So in addition to supporting families to try and provide the healthiest social and nutritional environments for young people that we know, they desperately try to do data like these are really suggesting that stronger attention to prevention is needed.\"\n\n\n\n\n\nMeanwhile Dr Osman says chronic conditions in young people are often overlooked as a serious public health concern.\n\n\n\n\n\nShe says the study shows the importance of paying closer attention.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/opposition-props-up-its-productivity-message-as-labor-pushes-for-workers-pay-rise-during-campaign/34umky1ne",
        "title": "Coalition props up its productivity message as Labor pushes for workers pay rise during campaign",
        "publish_date": "Wed, 2 Apr 2025 06:04:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIt's a clear pitch from Labor.\n\n\n\n\n\n\"We want wage rises and tax cuts. Those opposite us want wages to go down and taxes to go up.\"\n\n\n\n\n\nTo that end, Labor is asking the Fair Work Commission to lift award wages above the rate of inflation.\n\n\n\n\n\nWorkplace Relations Minister Murray Watt says the decision impacts around 3 million people.\n\n\n\n\n\n\"It includes some of the lowest paid people in our community, the cleaners, the retail workers, the security guards, the early childhood educators, the kind of people who all of us depend upon.\"\n\n\n\n\n\nAround a quarter of Australians are on an award wage - which dictates the minimum amount someone can be paid in a particular industry and job.\n\n\n\n\n\nEach year, the government suggests how much it should go up.\n\n\n\n\n\nThe Fair Work Commission then reviews that submission, along with submissions from business groups and unions, looks at economic factors, and comes to a decision.\n\n\n\n\n\nLabor is once again asking for an increase above inflation, which is currently about 2.5 per cent.\n\n\n\n\n\nThe workplace minister says wages can grow without productivity picking up, something that’s at odds with what the Reserve Bank Governor says - and the Australian Chamber of Industry and Commerce.\n\n\n\n\n\n\"You are kidding yourselves if you think you can have an increase that doesn't reflect the fact that we need to get productivity moving in the Australian economy.\"\n\n\n\n\n\nOpposition Leader Peter Dutton is not backing the proposal, instead preferring to talk about inflation.\n\n\n\n\n\n\"We want to see wages higher but the other side of a family budget is costs, and the fact is that families are paying 30 per cent more for groceries, interest rates have gone up 12 times under this government.\"\n\n\n\n\n\nOpposition treasurer Angus Taylor has pulled out props as he emphasises the Coalition's message.\n\n\n\n\n\n\"I'm going to show you all a chart. That blue bar is how much wages have gone up. We don't want that to go down.\"\n\n\n\n\n\nBut he says it’s more important to reduce cost of living pressures to improve household budgets.\n\n\n\n\n\nHe's announced a coalition plan he says will reduce the regulatory burden for small businesses.\n\n\n\n\n\n\"For small businesses under Labor, there is no light at the end of the tunnel. To restore this, the coalition has outlined our plans to make the instant asset write-off permanent at a higher threshold, to simplify meal deductions and save F-T-B compliance cost, to increase competition and access for small business lending, and to make it easier for small businesses to employ.\"\n\n\n\n\n\nThe opposition Treasury spokesman is promising a full suite of measures by the election - focusing on driving productivity after a stagnant few years.\n\n\n\n\n\nProductivity basically measures how much stuff can be put out into the economy compared to the resources like time, money, and materials that are being put in.\n\n\n\n\n\nIt goes up when there's more output with less input.\n\n\n\n\n\nAngus Taylor says the coalition will establish a new government agency - Investment Australia - to oversee this goal.\n\n\n\n\n\n\"It'll be backed by a legislative framework and mandate to boost our competitiveness and facilitate investment. Its legislated powers will include call in powers to hold regulators and agencies to account for bureaucratic delays on significant projects for our nation.\"\n\n\n\n\n\nMeanwhile Liberal leader Peter Dutton has been talking about cutting government jobs, but is still yet to reveal where those jobs will be eliminated from.\n\n\n\n\n\nDUTTON: \"We will look across government, in Canberra, to identify where the additional places are.\"\n\n\n\nJOURNALIST: \"Is it fair that out of a public service of 200,000 people you're not gonna say which 41,000 of them might not have a job in six weeks?\"\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/belonging-nowhere-trailer/kw724jeue",
        "title": "Belonging Nowhere: Trailer",
        "publish_date": "Wed, 2 Apr 2025 05:53:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/almost-half-of-all-australian-workers-could-benefit-from-minimum-wage-change/oxhuwcpjs",
        "title": "Albanese has backed a minimum wage boost — and other workers could benefit too",
        "publish_date": "Wed, 2 Apr 2025 05:41:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Almost half of all Australian workers could see their wages increase if the Fair Work Commission decides to increase the minimum wage.\n\n\n\n\n\nPrime Minister Anthony Albanese said on Wednesday he would ask the commission to raise the rate of the minimum wage, at least in line with inflation.\n\n\n\n\n\nThe Consumer Price Index, which is a measure of inflation, is currently at 2.4 per cent.\n\n\n\n\n\n\"The idea that a Labor government would ever advocate for a below-inflation increase, that people on the minimum wage should go backwards — that’s not the party I belong to and not the party I lead,\" Albanese told reporters.\n\n\n\n\n\nHowever, he would not provide a dollar figure, breaking course with his stance during the last election campaign when he called for a minimum 5.1 per cent increase in line with the inflation rate at the time.\n\n\n\nOpposition leader Peter Dutton was quick to match the pledge, throwing the Coalition's support behind wage increases after Labor's announcement.\n\n\n\n\n\nWhile the major parties have backed increasing the wages of Australia's lowest-paid workers, its ultimately up to the commission to make the call during its annual wages review, which is usually handed down in June. Any changes would typically come into effect on 1 July.\n\n\n\nWho could be affected?\n\nAround 2 per cent of workers earn the minimum wage but any increase would also directly impact the 20 per cent (around 2.9 million) of workers on award wages and could affect a further 20 per cent who are on collective or individual agreements.\n\n\n\n\n\n\"[There will be] a flow on to about 20 per cent of workers who are on awards — so it would impact directly about 22 per cent of the workforce,\" AMP chief economist Shane Oliver said.\n\n\n\n\n\n\"It can have an influencing effect on other workers too.\"\n\n\n\nSource: SBS News Betashares chief economist David Bassanese believes almost one in two workers could have their wages either directly or indirectly influenced by minimum wage increases.\n\n\n\n\n\n\"A further 20 per cent of other workers are estimated to have their wages linked to awards through their collective or individual agreements with their employers,\" he said.\n\n\n\n\n\nThe national minimum wage is currently $24.10 per hour, which equates to $915.90 per 38-hour week or $47,626.80 a year.\n\n\n\n\n\nIt has increased by around $7,500 a year since 2022.\n\n\n\n\n\nThe wage price index, which measures changes to wages and salaries, was up 3.2 per cent in the 12 months to December 2024.\n\n\n\nCan wage increases lead to inflation?\n\nOliver said if wage increases were not offset by an increase in productivity, this could see prices for goods and services increase.\n\n\n\n\n\nBut he said even if minimum wages increased by 3 per cent — which is above the inflation rate of 2.4 per cent — this would still be below wages growth in the rest of the economy, which is at 3.2 per cent (as shown in the wage price index).\n\n\n\n\n\n\"So I can't see much of a boost to inflation,\" he said.\n\n\n\nLISTEN TO Small businesses disappointed by federal budget offerings for sector SBS News 26/03/2025 03:11 Play\n\nBassanese said wages had grown in the past few years but the rate of inflation had declined more broadly, partly because more workers were available after Australia re-opened its borders in the period after the COVID-19 pandemic.\n\n\n\n\n\nBut he said productivity growth had been quite weak in recent years.\n\n\n\n\n\n\"Nominal wage growth has run well ahead of it — resulting in relatively high growth in unit labour costs,\" he said.\n\n\n\nSource: SBS News Labour productivity was also a talking point for the Reserve Bank this week.\n\n\n\n\n\nAfter its decision on Tuesday to keep the cash rate unchanged it wrote: \"Wage pressures have eased a little more than expected but productivity growth has not picked up and growth in unit labour costs remains high.\"\n\n\n\nAlbanese was asked if wage growth could be delivered without sustained productivity growth.\n\n\n\n\n\n\"Productivity is important. It's one of the three Ps of growth (population, participation, and productivity). But I tell you what's important too — as a Labor government — is not leaving people behind,\" he replied.\n\n\n\n\n\n\"We stand for people who are vulnerable in our community, including those people who are doing it tough because they're on minimum or award wages.\n\n\n\n\n\n\"But we also are the party of aspiration. We're the party that wants people to get ahead and opportunity.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/who-can-stand-in-federal-elections/smoecc444",
        "title": "Who can stand in federal elections?",
        "publish_date": "Wed, 2 Apr 2025 04:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn the end, being a politician is a job.\n\n\n\n\n\nThe process is a bit different - you get voted in rather than putting in an application and doing an interview.\n\n\n\n\n\nAnd there's no guarantee you'll be employed for more than a few years at a time.\n\n\n\n\n\nProfessor Luke Beck from Monash University says like every job, there's criteria for who is eligible.\n\n\n\n\n\n\"The Constitution sets out some basic rules around qualification for members of parliament, and importantly, disqualifications for members of parliament. The basic rule is you have to be 18 years of age and an Australian citizen. But then there are some disqualifications, and in recent years, we have seen some of those play out.\"\n\n\n\n\n\nThere are only a few things that disqualify someone - you can't be a public servant, have committed treason, be under sentence or waiting for sentencing of an offence that has a penalty greater than 12 months, be an undischarged bankrupt, or have any allegiance to a foreign power.\n\n\n\n\n\nThat last bit is the tricky part - because it disqualifies dual citizens.\n\n\n\n\n\nStarting in 2017, 15 MPs and Senators were caught up in what's called the Section 44 saga, named after the bit of the constitution that outlines what disqualifies you from nominating as a candidate.\n\n\n\n\n\nProfessor Beck says it wasn't intentional.\n\n\n\n\n\n\"What made it more complicated was that in most of these cases, these people did not know that they were citizens of the UK and New Zealand, which were the two common ones because whether you're a citizen of a foreign country basically depends on the law of that foreign country, and so you might effectively inherit a foreign citizenship without you ever realizing.\"\n\n\n\n\n\nSince the saga almost a decade ago, no one else has been caught out under section 44 - although it does come up time to time in Parliament.\n\n\n\n\n\nWhilst for some countries it's easy to renounce citizenship, for other's that's not the case.\n\n\n\n\n\nLike for Independent Senator Fatima Payman. She was born in Afghanistan, and despite approaching the embassy in 2021 to renounce her citizenship her request wasn't processed before the Taliban regained power.\n\n\n\n\n\nSince then, Senator Pauline Hanson has called for the government to look into her citizenship status.\n\n\n\n\n\nProfessor Beck says you're not automatically disqualified if your citizenship hasn't been formally renounced.\n\n\n\n\n\n\"The High Court has said that you have to take all reasonable steps to renounce your foreign citizenship before nominating unless that's for some reason effectively impossible to do. Either because that foreign country doesn't allow renunciation, in which case you have to effectively write a letter saying, even though legally I'm not allowed to pronounce, I nevertheless hereby renounce. Or in say, a case like Afghanistan where it's just physically impossible to do so. If there's some level of impossibility to renounce, then in that those kinds of situations, having taken all reasonable steps before nominating is sufficient.\"\n\n\n\n\n\nThese rules seem a bit old fashioned - and they can only be changed by a referendum since they're part of the constitution.\n\n\n\n\n\nProfessor Beck says there's a reason for them.\n\n\n\n\n\n\"The rationale for these is slightly different. The common thread is that so that all members of parliament have a sole loyalty to Australia and to their role as parliamentarian. So the logic being, if you're a dual citizen you might have a split allegiance. Now, in today's modern world, we probably don't think like that quite as much, but in the 1890s that's how people thought.\"\n\n\n\n\n\nWith bankruptcy, the idea is people might be more open to bribes, whilst public servants need to quit to ensure their loyalty is to their constituents instead of the executive government.\n\n\n\n\n\nSo with such a wide range of people who CAN, in theory, be politicians, who actually gets the job?\n\n\n\n\n\n\"Your typical federal politician, is a man, a white man in his late 40s or 50s, who has had a career either in the law or in politics or in finance before coming into parliament. That's not to say that we don't have a great deal more diversity in Parliament now than we have in the past. And so that typical picture we hope, is slowly changing over time.\"\n\n\n\n\n\nThat's Emma Dawson, Executive Director of progressive think tank Per Capita.\n\n\n\n\n\nThey've done some research into the demographics of Federal politicians.\n\n\n\n\n\nAs of the end of last year, 45 per cent are women.\n\n\n\n\n\nAround 4 per cent are Aboriginal or Torres Strait Islander, slight above the general population.\n\n\n\n\n\nFewer politicians are from a non English speaking background compared to the rest of Australia, and fewer are born overseas.\n\n\n\n\n\nAnd when it comes to age, it's pretty narrow. The vast majority are between 45 and 60 years old.\n\n\n\n\n\nOne of the biggest differences is in education - politicians are almost three times more likely to have a tertiary qualification.\n\n\n\n\n\nMs Dawson says that's a bit concerning.\n\n\n\n\n\n\"When we look at what those qualifications are, a lot of them are in law or economics or fields that are directly relevant to law making, to legislation and to understanding and managing the economy. And so there is a fear among some people that being a politician has become a profession, rather than a representative act that one does on behalf of the community.\"\n\n\n\n\n\nTo run a campaign you need both time and money.\n\n\n\n\n\nIf you're running as part of a political party, you need to win pre-selection to be included on the ballot paper.\n\n\n\n\n\nThat can take years of work to get the support within the local branch, through volunteering for the party and building up your standing within the community.\n\n\n\n\n\nFor independents, you need to have a lot of money behind you to run a campaign, and usually a big group of people who will volunteer to help.\n\n\n\n\n\nMs Dawson says that's an additional barrier.\n\n\n\n\n\n\"It's not cheap to run a campaign for parliament. If you think about what's required to build that profile in your community, to campaign for months at a time, to try to take a seat from a sitting politician, you really need to have some independent source of income in order to be able to do that. If you're relying week to week on a paycheck, that's not something that's going to be open to you.\"\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/what-dolphins-need-to-reverse-horror-start-and-ignite-their-biggest-star-20250326-p5lmrd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The Hammer’ has been grounded, so why is his coach ‘not concerned’?",
        "publish_date": "Thu, 03 Apr 2025 12:54:54 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Dolphins coach Kristian Woolf has leapt to Hamiso Tabuai-Fidow’s defence, but he also needs his star fullback to make his presence felt if the team is to overturn a winless start.\n\nDespite being one of the NRL’s leading talents, “The Hammer” has been kept quiet in 2025 – his 92 running metres from 11 carries against Wests Tigers arguably his quietest showing since arriving at Redcliffe.\n\nThe Queensland Maroons livewire’s promising second half against the Broncos was also offset by the 24 minutes it took him to register a run.\n\nHamiso Tabuai-Fidow for the Dolphins. Credit: NRL Photos\n\nSouth Sydney Rabbitohs fullback and Souths Logan Magpies product Jye Gray leads the Dally M Medal count, averaging 23 runs a game for 213 metres.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/western-australia/dutton-pledges-600-million-for-wa-farm-and-mine-roads-dodges-ir-law-questions-20250403-p5lout.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dutton pledges $600 million for WA farm and mine roads, dodges IR law questions",
        "publish_date": "Thu, 03 Apr 2025 12:45:14 +1100",
        "category": "finance",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "Opposition Leader Peter Dutton has targeted mining and farming regions in his first major campaign pledge to Western Australians.\n\nDutton was in Perth on Thursday to announce a national mining and agriculture roads program.\n\nOpposition Leader Peter Dutton in Perth. Credit: James Brickwood\n\nThe program would be developed in consultation with miners and farmers to identify roads that require upgrading to improve the transport of food and mining commodities.\n\n“I want Western Australia to continue to be the powerhouse of the national economy. But we need a government in Canberra that plays to WA’s strengths, not works against it,” Dutton said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/meghans-as-ever-products-sell-out-20250403-p5lovx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan's As ever products sell out",
        "publish_date": "Thu, 03 Apr 2025 12:39:56 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan's As ever products sell out\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/first-metro-train-rolls-along-the-final-stage-of-sydney-s-21-6b-line-20250403-p5loqg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First metro train rolls along the final stage of Sydney’s $21.6b line",
        "publish_date": "Thu, 03 Apr 2025 12:33:23 +1100",
        "category": "finance",
        "authors": [
            "Matt O'Sullivan"
        ],
        "text": "A metro train has run along the final section of Sydney’s new $21.6 billion rail line, marking the start of more than 6500 hours of testing that will determine when it will open to passengers next year.\n\nThe first train – set TS28 – rolled into Campsie station at 4am on Thursday, completing a super-slow, five-hour test run from Sydenham. The 6.5-kilometre trip will take just 11 minutes when the line eventually opens next year.\n\nStopping at each station, the train made its way to Campsie before later travelling the full length of the new line to Bankstown.\n\nThe first stage of testing on the Sydenham-Bankstown line involves metro trains travelling at up to 25km/h. In the months that follow, they will be tested at speeds of up to 100km/h and transition from manual to automated operations.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/first-metro-train-rolls-along-the-final-stage-of-the-m1-line-20250403-p5lovn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First metro train rolls along the final stage of the M1 line",
        "publish_date": "Thu, 03 Apr 2025 12:32:29 +1100",
        "category": "finance",
        "authors": [],
        "text": "First metro train rolls along the final stage of the M1 line\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/myanmar-miracle-earthquake-rescue-20250403-p5love.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Myanmar miracle earthquake rescue",
        "publish_date": "Thu, 03 Apr 2025 12:09:52 +1100",
        "category": "finance",
        "authors": [],
        "text": "Myanmar miracle earthquake rescue\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/trump-hits-australia-with-10-per-cent-tariff-on-all-exports-to-the-us-20250403-p5lopx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump hits Australia with 10 per cent tariff on all exports to the US",
        "publish_date": "Thu, 03 Apr 2025 12:08:04 +1100",
        "category": "finance",
        "authors": [
            "Michael Koziol",
            "Shane Wright"
        ],
        "text": "Global oil prices fell on fears of a slowdown in the American economy, while gold hit an all-time high of $US3192 on expectations the US will face higher inflation due to the tariffs. Australia has had a free trade agreement with the US since 2005 and no tariffs. But it maintains other barriers, including the beef ban and measures that have long irked the US trade office and Trump’s economic advisers. Prime Minister Anthony Albanese was the first world leader to respond to the announcement, interrupting the federal election campaign to hold a press conference just 30 minutes after Trump had finished speaking. He said Trump’s tariffs were “unwarranted” and had “no basis in logic”, would disrupt the global economy and harm the American people most of all.\n\n“This is not the act of a friend,” he said. “The Australian people have every right to view this action by the Trump administration as undermining our free and fair trading relationship, and counter to the shared values that have always been at the heart of our two nations’ long-standing friendship.” Trump’s move would have consequences for how Australians saw the relationship between the two countries, Albanese said. Commerce Secretary Howard Lutnick holds up a chart showing tariffs of 10 per cent on Australia and other countries. Credit: AP He indicated Australia would not impose retaliatory tariffs, and would continue to negotiate with the Trump administration. But US grievances with Australia, such as the Pharmaceutical Benefits Scheme and biosecurity arrangements, were not on the table. Albanese announced a five-point plan to immediately deal with the tariffs. It includes an extra $5 million for the Anti-Dumping Commission to protect key industries such as steel and manufacturing, $50 million in trade support for companies to find new markets and prioritisation of Australian firms in government procurement and local content.\n\nCoalition leader Peter Dutton, who backed the measures on anti-dumping, extra trade support and government procurement, said he could have negotiated a better outcome with the Trump administration. Loading “This is a bad day for our country. I want to resolve the matter and the question for us now is who is best able to deal with this relationship?” he said. The Australian Industry Group has warned that Trump’s tariffs will lead to dumping of manufactured goods across the rest of the world. Group chief executive Innes Willox said with around 50 per cent of goods being intermediate goods – unfinished products but components – the tariffs would have a far-reaching impact just beyond those products immediately hit by the tariffs.\n\n“Goods destined for the US may likely need to find a new home, raising the prospect of an influx of displaced goods coming to Australia,” he said. The Business Council of Australia, which represents the nation’s 100 biggest businesses, has warned Trump’s tariffs will hurt economic growth while urging a “measured” response from the federal government. “We don’t support retaliatory tariffs and strongly urge against them, because there are no winners in a trade war, which would only risk making our situation worse by forcing Australians to pay more and reducing job security,” the council’s chief executive Bran Black said Betashares chief economist David Bassanese said the tariffs would push up prices for American consumers by around 2 per cent and reduce US economic growth by a full percentage point. He said it increases the risk of an economic slowdown in Australia, which could force the Reserve Bank to slice official interest rates at its next meeting in May.\n\n“Today’s announcement is close to a worst-case scenario and the odds of a US or global recession have clearly increased,” he said. “For Australia, the net effect of today’s announcement is that it poses much more downside risk to economic growth than upside risk to inflation – hence it adds to the case for an RBA rate cut as early as next month.” The president touted the tariff announcement for weeks, calling it “Liberation Day for America” and asserting it would restore reciprocity and balance to the US’s trade relationships after being “ripped off” by friends and foes alike. April 2 “will forever be remembered as the day American industry was reborn, the day America’s destiny was reclaimed”, Trump said in the White House Rose Garden, surrounded by hanging American flags. He said the tariffs were “a declaration of economic independence”, and lashed out at “foreign cheaters” and “foreign scavengers” who had taken advantage of America. But he blamed previous US presidents for allowing the imbalance to occur.\n\nLoading “Now it’s our turn to prosper, and in so doing use trillions and trillions of dollars to reduce our taxes and pay down our national debt,” Trump said. An executive order released shortly after Trump’s speech said he would impose the tariffs using his executive authority by declaring a national emergency arising from the US’s large and persistent trade deficits. The lack of reciprocity in bilateral trade relationships, including tariff rates and non-tariff trade barriers, “constitute an unusual and extraordinary threat to the national security and economy of the US”, it said. A separate fact sheet said the 10 per cent baseline tariff would take effect on Saturday (Sunday AEDT). The additional “reciprocal” tariffs on countries, above 10 per cent, would start next week on April 9.\n\nLoading Trump said he anticipated receiving a flood of phone calls from world leaders seeking to negotiate, and if they wanted him to change his plans, they should remove their tariffs and non-tariff trade barriers. Trade Minister Don Farrell has previously said most of the beef exported to the US goes into hamburgers, and the tariffs would increase the cost of the fast-food staple for American consumers. “It doesn’t make any sense,” he said last month. The new tariffs follow the imposition of 25 per cent duties on steel and aluminium imports last month, a policy Trump resuscitated from his first term. Australia also sought an exemption from those tariffs, but it was denied.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/climate-change/ocean-swells-erode-beachfront-properties-on-central-coast-20250402-p5lop4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ocean swells erode beachfront properties on Central Coast",
        "publish_date": "Thu, 03 Apr 2025 12:02:02 +1100",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney",
            "Caitlin Fitzsimmons"
        ],
        "text": "Chris Rogers from the Wamberal Protection Association said big swells resulted in land slippage along the beach for a number of properties and a lot more exposure of the rocks and other protection put in place in 2020. “We had the SES doorknocking last night with [the] council,” Rogers said. “The frustrating thing for us is that four and a half years ago, I was one of the many people who got evacuated, and we are still in the same position.” Several home owners at both Wamberal and The Entrance have lodged development applications to build hard protective barriers – effectively a seawall buried in the sand – to protect their properties. Loading The proposal has attracted controversy among other Wamberal residents who are concerned it would impact the beach for the rest of the community.\n\nThe erosion comes just a day after Premier Chris Minns travelled to Wamberal to make clear his opposition to plans for a seawall along the beach. At Wamberal Breakers Country Club, more than 200 locals heard the premier back sand nourishment over the wall for the first time. “I don’t have any confidence that the erection of a seawall wouldn’t have devastating impacts for the rest of the beach,” Minns said. Rogers said the beachfront residents welcomed the premier’s commitment to sand nourishment but would continue their lawful process with the development applications as well. The proposal for the 1.4-metre concrete wall at Wamberal was officially submitted to the council last year, but the idea gained traction in 2020 when wild storms caused such serious coastal erosion that beachfront homes began to crumble into the sea.\n\nThirty metres of beach were washed away, and the foundations of some homes were pictured teetering precariously from the cliff. Loading Wamberal Beach has hosted multiple rallies against the proposed wall since that storm, as the battle between the anti-wall Wamberal Beach Save Our Sand group and the pro-wall Wamberal Protection Association got heated. Seawalls have also proved controversial in other communities, such as Collaroy on the northern beaches, which was described as a “hellscape” in 2022 when a storm washed away a huge swath of sand. Experts in coastal erosion say seawalls are effective at protecting what is behind them but can exacerbate sand erosion underneath. However, a beach backed by natural dunes is also an effective barrier and can allow the beach to retreat as sea levels rise because of climate change.\n\nJavier Leon, associate professor in physical geography at the University of the Sunshine Coast, said seawalls should be reserved for places where there is valuable public infrastructure behind them. “I’m more of an advocate of nature-based solutions – having a healthy dune offers better protection in the long term for infrastructure,” Leon said. “For those houses on dunes and in erosion-prone areas like Wamberal, I believe that a more cost-effective solution is actually buying back and just managing that retreat,” Leon said. ‘We need a solution’ Mehan said his personal view was that buybacks were “a valid option” that could be considered alongside beach nourishment and other solutions. He added that buybacks would not be suitable in every location, noting that in the case of The Entrance, there was also an adjacent channel.\n\n“We need to get a solution that works for the whole state rather than wait for people to put in a DA – that’s not very satisfying,” Mehan said. Tropical Cyclone Alfred devastated Gold Coast beaches last month. Credit: AAPIMAGE Rogers said the idea of buybacks was “ridiculous” in the case of Wamberal because fair compensation to home owners would cost up to $700 million. He also said there were only 14 metres between the beach and the road, measured at two empty blocks, so the dunes would not provide sufficient protection for public infrastructure. “All the homes at Wamberal Beach and along the coast have been bought through a legal process,” Rogers said. “If we have the right to buy there ... we’ve got a right to protect our homes.” The swells on Wednesday were so powerful in Sydney that the Bondi Icebergs office was battered by waves, shattering 30 metres of glass fencing and sending water gushing into the building, dislodging furniture.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/reed-mahoney-is-an-unfair-target-six-tackles-with-gus-ep7-20250402-p5lop5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reed Mahoney is an unfair target: Six Tackles with Gus - Ep7",
        "publish_date": "Thu, 03 Apr 2025 12:00:10 +1100",
        "category": "finance",
        "authors": [],
        "text": "Reed Mahoney is an unfair target: Six Tackles with Gus - Ep7\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/donald-trump-s-dumb-trade-war-just-got-much-much-dumber-20250403-p5lor6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Donald Trump’s dumb war just got much, much dumber",
        "publish_date": "Thu, 03 Apr 2025 11:59:26 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "American agriculture is an obvious vulnerability if there are retaliatory responses, but its service sector, particularly its big technology companies, should be nervous. Trump always focuses on the $US1.2 trillion ($1.9 trillion) trade deficit America has in goods, but never talks about the $US1 trillion-plus surplus it has in services. It is inevitable that services would be listed within the responses the European Union prepared in anticipation of an escalation in Trump’s trade wars. Trump’s tariffs will raise revenue – the best guesstimate is around $US600 billion a year – but, contrary to what he constantly (and falsely) asserts, that revenue won’t come from the countries on which the tariffs have been imposed but from US companies and consumers. Wall Street is facing a bloodbath on Thursday in New York. Credit: AP US tariffs are paid by the importer, on US soil, and either absorbed by the importing company, passed on to consumers or shared between them. Historically, it has been consumers who have borne the brunt of the impacts.\n\nTrump says that his “beautiful” tariffs will force foreign companies to invest more in the US to manufacture in America what they previously exported from elsewhere. While that could happen at the margin, there are several problems with that assertion. One is that, for many of the goods the US imports, the US has no significant manufacturing capacity and no substitutes for the imported goods. It takes time, perhaps years, lots of capital and a stable and predictable external environment to build a major manufacturing plant in the US, as well as some form of competitive advantage. Even if Trump could coerce foreign companies to invest in US capacity – and, to be fair, some have said they will (although that proof will be in the pudding) – there will be a hiatus during which the prices of imports will spike.\n\nLoading Moreover, in the complex global manufacturing ecosystem that the US and its companies, primarily, have created over decades, supply chains are so interdependent that it will be very difficult – for many, impossible – for companies to shift from their current sourcing arrangements for their inputs to a purely US business. The US isn’t self-sufficient in some of the key inputs to manufacturing and doesn’t have all the domestic resources it would need to be self-sufficient. Trump has, for instance, put a 25 per cent tariff on aluminium imports but domestic production meets only about 50 per cent of the demand for aluminium. US aluminium prices, and the prices of downstream products that include aluminium, have already spiked. He put a similar tariff on steel imports, which covers products with steel components. The prices of things as basic as screws and nails, which America doesn’t manufacture in any meaningful volumes, are spiking.\n\nThe US is a highly developed country with – relative to many of the countries on which it is imposing high tariffs (like Vietnam and its 46 per cent rate) – high labour and non-labour costs. US manufacturing wages average just over $US100,000. Bangladeshi exporters could, if they had to, absorb the 37 per cent tariff on their exports and still massively undercut a US manufacturer. China, facing a 34 per cent rate, has wages about a quarter of those in the US. Even European manufacturing wages are at least 25 per cent lower on average than America’s. There are good reasons why America, and other developed countries, including Australia, exited low-value-added and labour-intensive sectors like the clothing, footwear and textiles industries, instead importing lower-cost products from low-cost developing economies for mutual economic benefit. Trump’s obsession with tariffs, his threats to use them again against anyone who retaliates, the shadow of further tariffs on more commodities, such as copper, and his unpredictability and chaotic approach to policymaking – even on Tuesday, he and his cabinet were still trying to decide what form the tariffs would take – make for a volatile and uncertain environment for corporate decision-making.\n\nLoading That level of uncertainty, and the potential for his web of tariffs to be unwound by a future administration – or as early as next year’s midterm elections, if the Democrats can get their act together and exploit Americans’ declining approval rates for Trump and the Republicans – will cause executives to be cautious about investing on the basis that the tariffs will be permanent. A $US600 billion tax hike and its inflationary impacts, by themselves, will be negative for US growth. Add the uncertainty around the impact of Trump’s trade war – US manufacturing activity, employment and orders were already shrinking before Liberation Day, with business citing the looming tariffs as a factor – and the outcomes could be nasty. Having been handed an economy growing at almost 3 per cent, with ultra-low unemployment and declining inflation, Trump’s love of tariffs (and misunderstanding, or mischaracterisation, of how they work) could produce a self-inflicted recession in what was regarded as the strongest developed economy in the world. Financial markets had been hoping that what Trump announced in the Rose Garden would be the “kind” tariffs that he claimed he has ordered. Wall Street closed slightly up on Tuesday afternoon.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/five-countries-worst-hit-by-trump-s-tariffs-20250403-p5los4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five countries worst hit by Trump’s tariffs",
        "publish_date": "Thu, 03 Apr 2025 11:52:59 +1100",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "The US is the second-biggest trading nation in the world after China, and the biggest importer of goods. More than 200 countries, territories and regional associations around the world trade with the US, and on Thursday, the White House released a list of more than 100 of them that would be hit by new tariffs.\n\nThe tariff rates include a baseline of 10 per cent on all imports (except those covered by an existing continental trade deal known as CUSMA between the US, Mexico and Canada). These tariffs will come into effect on Saturday, US time.\n\nThere are also further reciprocal tariffs on imports from roughly 60 countries dubbed by Trump as the “worst offenders” – those that have their own tariffs on US goods or other barriers in place, including currency manipulation or restrictions. These will come into effect on April 9, US time.\n\nHere are the countries facing some of the steepest – or unexpected – tariff rates.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/helpless-beveridge-goes-on-the-attack-swans-star-out-for-two-months-20250403-p5lotu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Helpless’ Beveridge goes on the attack; Swans star out for two months",
        "publish_date": "Thu, 03 Apr 2025 11:49:05 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Loading “So the suggestion for me was to make sure we bring back prior opportunity and validate incorrect disposal.” The AFL adjusted their interpretations last year after coaches, led by Gold Coast’s Damien Hardwick and Carlton’s Michael Voss, called on umpires to start making faster calls on holding-the-ball decisions. Beveridge has raised it personally with the AFL. “We’ve gone from that to now this total confusion, so unfortunately we need a correction and it needs to come from City Hall [the AFL] and through the umpires. Because the umpires are just finding it too hard. They don’t know how to adjudicate it and our players don’t know what the decision is going to be.\n\n“I don’t think we as coaches have ever felt as helpless around that and coaching it as we do now. I think the whole competition is confused.” AAP Papley adds to injury crisis Vince Rugari Sydney’s injury crisis has worsened with Tom Papley set to be sidelined for up to two months, while Logan McDonald has been cleared to resume playing this weekend – but will make his return through the VFL this weekend rather than being rushed into their depleted line-up.\n\nThe Swans will be missing 10 players when they face North Melbourne on Saturday, including several first-choice players in Errol Gulden (ankle), skipper Callum Mills (foot), Taylor Adams (hamstring) and defensive trio Lewis Melican (adductor), Robbie Fox (calf) and Harry Cunningham (foot). Papley is the latest to join the club’s bulging injury ward after reporting soreness in his half after training last weekend, when the Swans had the bye. Scans revealed the 28-year-old small forward has suffered a crack in his heel and is likely to miss between six to eight weeks, coach Dean Cox said on Thursday. Tom Papley (centre) is out with a heel injury. Credit: Getty Images “We’ll get a bit more verification on that in the following days. But, yeah, not great news,” he said. “We’ve already got some key personnel out, now you get another one. Fortunately, this game moves forward, and you create an opportunity for another player.”\n\nLoading Some of Sydney’s injured players, like Mills and Adams, have had either slower than expected recoveries or have had setbacks in their rehabilitation, meaning that Cox won’t be able to field anything even close to resembling his best 22 until the second half of the season at best. On the eve of Opening Round he conceded that some of his pre-season methods may have contributed to the physical toll but said it was largely a case of bad luck. “The thing when you look at it with injuries is, are they common? Are they reoccurring? Are they avoidable? Some of these ones ... Errol tackled, Callum with plantar fascia, and, obviously, Tom now with a heel. So they’re all different,” he said. “We’ve just got to make sure that we try and prepare our players the best way they can. We understand it is a contact game, and [we need] to push players to a limit knowing that they’ve got to withstand that game day.\n\n“A lot of our players were slow to start through the off-season. So some of them are finding it a little bit tough through this period.” There is better news, though, with McDonald set to play a competitive match for the first time in 2025, having undergone ankle surgery at the end of last season. However, Cox said he would need to build up his minutes – initially with the Swans’ reserves in the VFL – before he is able to properly contribute at the top level. “He’ll be on restricted minutes, but ... Logan is in our best team,” he said. “He hasn’t trained a lot through the whole pre-season program. The first couple of weeks will just be about playing. Whether that be forward, back, on a wing, I’m not really concerned with that.” Saturday’s clash with the Kangaroos will be the first for ex-Swans captain Luke Parker against his former side, though Cox said he will not be in for any extra treatment. “It’ll be different. He’s playing some really good footy, as North are as well,” he said. “He’ll just be another North player ... no doubt, he’ll be trying to prove his best, like our players will as well. They’re pretty mature now. They’ll go about their business the way they need to.”\n\nInfluential AFLW coach to depart AAP Adelaide’s dual AFLW premiership coach Matthew Clarke will step down after the looming season. Clarke has been the Crows’ women’s coach since the 2018 but says the time will be right to relinquish the job after next season. “My time leading this team has been the most enjoyable in my 30-plus years in football,” Clarke said in a statement on Thursday.\n\n“Stepping away from the role will be really tough but my experience in and around the game tells me the decision is what is best for the group in the medium and longer term. “I love footy and will forever be connected to the game but what form that takes beyond this year is something I am yet to determine. Adelaide coach Matthew Clarke with the 2022 AFLW premiership cup. Credit: AFL Photos “I want to throw everything I have into this season and give our players, staff and our Crows supporters the best possible chance to experience another amazing AFLW season.” Clarke, who will coach the Crows for an eighth season, won flags in 2019 and 2022 and also has reached six preliminary finals.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/everyone-has-a-use-by-date-v-landys-addresses-speculation-about-his-future-20250403-p5losn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Everyone has a use-by date’: V’landys addresses speculation about his future",
        "publish_date": "Thu, 03 Apr 2025 11:45:00 +1100",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Australian Rugby League chairman Peter V’landys has addressed speculation that he could be finishing up as the boss of Racing NSW at the end of the year, admitting “everyone’s use-by-date comes along at some point”.\n\nV’landys has juggled twin responsibilities for the past six years, making him arguably the most influential sporting administrator in the country. There has been renewed conjecture that he may be about to finish up in racing, with a view to potentially moving into an executive chair role in rugby league.\n\nSpeaking for the first time about his future, V’landys said he remained “undecided” whether he would continue with both jobs.\n\n“I’ve done it for the last six years and nothing’s changed; at the end of the year I will look at it again and see what I’m doing for 2026,” V’landys told this masthead.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/art-and-design/no-trace-dissident-artist-told-his-work-has-been-removed-from-hong-kong-billboard-20250403-p5lorj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘No trace’: Dissident artist told his work has been removed from Hong Kong billboard",
        "publish_date": "Thu, 03 Apr 2025 11:41:33 +1100",
        "category": "entertainment",
        "authors": [
            "Elizabeth Flux"
        ],
        "text": "An artwork by dissident artist Badiucao created to test freedom of speech in Hong Kong appears to have been removed.\n\nHere and Now is a four-second video work by the Shanghai-born, Australia-based, Walkley award-winning artist, who is also a contributor to this masthead. It had been showing hourly on two billboards in Hong Kong’s busy Mong Kok district, but Badiucao said he has been informed by multiple groups of people who visited both sites that “there is no trace of my video showing any more”.\n\nBadiucao’s Here and Now work in Hong Kong.\n\nThe clip, which has no audio or caption, shows the artist silently speaking the words “You must take part in revolution”. The video had been showing as part of an outdoor exhibition titled Luminescence, commissioned by digital gallery Art Innovation.\n\nHours before the work’s apparent removal, the artist had released a video and statement revealing its true intent, telling this masthead that Here and Now was a “test for the freedom-of-speech situation in Hong Kong”. He had expected that the work would be taken down in response to his revelation.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-drivers-urged-to-defend-yourself-as-1200-seatbelt-fine-overturned-after-bizarre-claim-011322933.html",
        "title": "Aussie drivers urged to 'defend yourself' as $1,200 seatbelt fine overturned after bizarre claim",
        "publish_date": "2025-04-03T01:13:22Z",
        "category": "finance",
        "authors": [],
        "text": "Melbourne man Mark Johnson has urged fellow drivers to dispute any fines they have a 'gut feeling' about. Doing so saved him plenty of cash.\n\nDriver Mark Johnson had his $1,200 fine and four demerit points dropped by authorities this week. Source: Supplied\n\nA driver who copped a $1,200 fine, four demerit points and a temporary licence suspension, after a roadside camera allegedly caught his passenger not wearing her seatbelt correctly, has urged Aussies to \"defend themselves\" if they know they have been wrongly accused of a driving infringement.\n\nMark Johnson of Melbourne has endured a nine-month battle with Queensland authorities after the driving fine was issued in August following a family holiday to Brisbane. On Wednesday this week however, he was finally notified that authorities would drop the charges after months of Mark arguing the over saturation in the photo produced by the roadside camera – and its overall poor quality of it – meant the seatbelt couldn't be seen.\n\n\"When I received the email, I just thought: Oh, thank God!\" Mark told Yahoo News about being let off the hook yesterday.\n\n\"The four demerit points are a lot for me too as a truck driver, when you're on the road for hours and hours a week,\" he said.\n\nADVERTISEMENT\n\nMark believes authorities shouldn't be relying on images of such poor quality as evidence of wrongdoing on the road.\n\n\"They should be in colour, not black and white... they were so saturated you couldn't see the seatbelt, not that it wasn't there,\" he claimed. \"I said to the department if they don't review my fine then I'll take it to court and they'd have to front my court costs, my travel, my accommodation, my whole family to come up. I reckon they weighed it up with the unclear pictures and they decided it wasn't definitive.\"\n\nMark was notified his driving infringement was dropped on Wednesday. Source: Supplied\n\nIncrease in the number of drivers claiming innocence\n\nYahoo News has reported on several cases where Aussie drivers claim they have been wrongfully accused of driving penalties, such as Sydney driver Anne Guirguis who was issued a $410 fine for improperly wearing her seatbelt last month despite claiming she \"always wears one\" and her car \"beeps if the seatbelt is not on\".\n\nADVERTISEMENT\n\nMany people have copped fines after being accused of using their phones behind the wheel, however, there have been several instances where the item detected by roadside cameras have not been phones at all, such as the mum holding her child's toy in her hand and the driver who was issued a whopping 10 demerit points for handling his wallet.\n\nDo you believe you've been wrongly fined by seatbelt detection cameras? We want to hear from you: sophie.coghill@yahooinc.com\n\nLawyer Hayder Shkara previously told Yahoo News he has seen an \"uptick in motorists being wrongly accused of offences\" at his Queensland based firm and it was contributing to the rising tension between drivers and authorities as state governments ramp up surveillance.\n\nMark told Yahoo he just wants authorities to admit when they make a mistake, believing it will help dissipate the frustration felt by motorists.\n\n\"My beef is that they just don't own up to anything,\" he said. \"If you're a kid and you break your mum's crystal vase, you have to stand up and own it. Across the board, authorities don't do it... it feels like a money grab.\"\n\nAussie drivers are questioning the poor quality of pictures taken by roadside cameras. Source: Facebook/AnneHannaGuirguis & Road Safety Commission\n\nDriver pleads with Aussies to 'defend yourselves'\n\nDespite months of endless back and forth with authorities, Mark now feels emboldened to encourage other drivers to do the same as him if they believe they have been wrongfully accused.\n\nADVERTISEMENT\n\n\"If you have a gut feeling that you are not guilty and there's no sufficient evidence, defend yourself,\" he said. \"It was a substantial fine, if it had been less people might have just paid it thinking I can't remember the day because you can get the fine weeks later.\n\n\"Imagine how many people are being ripped off.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-landlords-horror-find-after-disgusting-tenants-use-loophole-to-avoid-inspections-220351029.html",
        "title": "Aussie landlord's horror find after 'disgusting' tenants use 'loophole' to avoid inspections",
        "publish_date": "2025-04-02T22:03:51Z",
        "category": "finance",
        "authors": [],
        "text": "Queensland landlord Alana said the clean-up effort took multiple days, thousands of dollars, and incredible willpower.\n\nQueensland mum Alana is out of pocket thousands after her tenants trashed her investment property. Source: TikTok/mistress_of_blyth_manor/The Project\n\nA traumatised Australian landlord said she has no choice but to cautiously retenant her investment property after the previous occupants trashed it beyond recognition, avoiding routine inspections using a \"loophole\" which meant the property went unchecked until it was too late.\n\nQueensland homeowner Alana, from Townsville in the state's northeast, would prefer not to lease the home out again after being left horrified by how the previous family used it, but said she'll have to if she's to make her mortgage repayments.\n\nVideos show the shocking condition inside the home, in which two adults apparently kept five children, with trash strewn across every surface and waste piled so high that the floorboards are almost completely buried. Stained mattresses, maggot infestations, rotting food scraps, empty bottles and mountains of garbage overwhelm every room, painting a grim picture of utter squalor.\n\nIn Queensland, tenants are required to allow property managers or owners to conduct routine inspections, provided the proper notice has been given. While occupants cannot outright refuse a properly notified inspection without their tenancy agreement, they can request to reschedule or postpone it under reasonable circumstances. Cancelling multiple times on the day of the planned inspection can prevent them from going ahead.\n\nThe home was left in utterly squalid conditions. Source: TikTok/mistress_of_blyth_manor\n\nMum's horror discovery inside her rental home\n\nAlana branded the state of the home, \"horrific, disgusting, rank and foul\". \"My god, what have they done to the house?\" she told Channel 10's The Project overnight. The landlord, a mother herself, said she tried to give the tenants \"a leg up\", but felt slapped in the face when she finally got inside the home.\n\nShe said the clean-up effort resulted in thousands of dollars spent, friends being roped in and enormous willpower. Alana had a \"gut instinct\" that something wasn't right during the course of the family's occupancy, but the discovery was \"way worse\" than anything she had anticipated.\n\nADVERTISEMENT\n\n\"When the rent was paid periodically, I was asking questions.\"\n\nEventually she discovered the family had fled before their lease had been completed. Alana's only option would be to fight the matter in a civil court, which she said would \"cost us more money\" and likely result in little action, given that she believes the tenants don't have the funds for reimbursement.\n\nAlana said it took days and enormous willpower to clean. Source: TikTok/mistress_of_blyth_manor\n\nGrime, food scraps and mountains of rubbish were strewn everywhere. Source: Tiktok/mistress_of_blyth_manor\n\n\"You never get anything back,\" she complained.\n\nThe Queensland mother's case comes after other Australian landlords in the state grapple with similar scenarios. Experts say these kinds of situations can \"scar them for a lifetime\".\n\nADVERTISEMENT\n\nA few months back, another Queensland landlord's home was left with $100,000 worth of damage and more than 30 dead cats were found left in a freezer. Other homeowners have recently taken to social media to share their horrific tenant experiences, some even having to hire skip bins to remove the waste left behind.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]