[
    {
        "url": "https://www.9news.com.au/national/childcare-worker-charged-assault-four-year-old-boy-new-south-wales-nsw/c0250823-3ffc-4be2-9c69-6e89dbbdbd3b",
        "title": "NSW childcare worker charged with assaulting four-year-old boy",
        "publish_date": "Wed, 17 Sep 2025 00:53:59 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-fire-burleigh-headland-national-park-gold-coast/edb88c6c-dcb7-44ac-b570-7eb84c2e520b",
        "title": "Boy filmed waving burning branch as bushfire rages through koala habitat",
        "publish_date": "Tue, 16 Sep 2025 23:03:49 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/breastfeeding-in-public-legal-rights-explained/e0b21c94-f6a2-47a0-947c-3c1f1ada8b74",
        "title": "Breastfeeding in public: your legal rights in Australia, explained",
        "publish_date": "Wed, 17 Sep 2025 00:48:22 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Questions have been raised about a woman's right to breastfeed in public after a mother was asked to leave a Virgin lounge for expressing breastmilk.\n\nDr Elise Turner spoke out about the incident on social media, calling it \"unbelievable\".\n\nUnder federal ﻿and state law, it is also illegal.\n\nDr Elise Turner reflected on her experience on Today this morning. (Today)\n\nFines for breaching the ﻿Sex Discrimination Act – which protects, among other things, a woman's right to breastfeed in public – can exceed $30,000.\n\nHere's what you need to know about the legalities of breastfeeding in public in Australia.﻿\n\nIs it illegal to breastfeed in public in Australia?\n\nNo, breastfeeding in public is a legal right and protected under the ﻿Sex Discrimination Act 1984.\n\nUnder the ﻿Act, it is illegal to discriminate (directly or indirectly) against a mother for breastfeeding in public.\n\nThat includes telling her to stop, cover up or leave.﻿\n\nDiscrimination against a woman who is breastfeeding or expressing is regarded as sex discrimination under federal law.\n\nPenalties for breaching the Act include:\n\nfor an individual - fines of up to $8250, imprisonment for 3 months, or both\n\nfor a body corporate (corporation, company or association) - fines of up $33,000\n\nBreastfeeding is also protected under anti-discrimination laws in every state and territory across Australia.\n\nPenalties vary.﻿\n\nBreastfeeding in public is a legal right and protected under the ﻿Sex Discrimination Act 1984. (Getty)\n\nCan someone tell me to stop breastfeeding in public?\n\nNo.\n\nI﻿t is illegal to discriminate against a woman who is breastfeeding or expressing in public.\n\nThat includes telling her to stop or cover up in places like cafes, on public transport, etc. or asking her to breastfeed or express in a bathroom or baby room instead.\n\nEven if another member of the public ﻿asks a woman to stop, she retains the right to breastfeed wherever she may legally be.\n\nCan I be asked to leave a public place for breastfeeding?\n\nNo.\n\nUnder state and federal law it is ﻿illegal to ask a woman to leave a public place while breastfeeding or expressing.\n\nThese laws apply in all public spaces,﻿ from cafes and restaurants, to parks, public transport, and shopping centres.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-warns-social-media-platforms-against-age-verification-for-all-ahead-of-a-ban-on-children/a8e0edd8-f3a5-4d30-964b-59ae0472cb5a",
        "title": "Government releases guidelines ahead of under-16 social media ban",
        "publish_date": "Tue, 16 Sep 2025 11:32:04 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Australian authorities said on Tuesday that social media platforms should not demand age verification for all account holders starting from December, when a ban on children under 16 having accounts goes into effect in the country.\n\nThe government released guidelines on how platforms such as TikTok, Facebook, Snapchat, Reddit, X and Instagram should apply the world's first ban on children using social media from December 10.\n\nIt says verifying the ages of all account holders would be unreasonable.\n\nThe government released guidelines on how platforms such as TikTok, Facebook, Snapchat, Reddit, X and Instagram should apply the world's first ban on children (Getty)\n\n\"We think it would be unreasonable if platforms reverified everyone's age,\" said Australia's eSafety Commissioner Julie Inman Grant, who drafted the guidelines.\n\nHer use of the word \"reverified\" suggested the platforms usually already had sufficient data to verify a user was older than 16.\n\nShe said the platforms have \"targeting technology\" to focus on those under 16.\n\n\"They can target us with deadly precision when it comes to advertising. Certainly they can do this around the age of a child,\" she added.\n\nAustralia's Parliament enacted the ban last year, giving the platforms a year to work out its implementation. The platforms face fines of up to $50 million for systemic failures to prevent children younger than 16 from holding accounts.\n\nCritics of the legislation fear that banning young children from social media will impact the privacy of all users who must establish they are older than 16.\n\nREAD MORE: Dog hailed a hero after scaring off intruders from Melbourne home ﻿\n\nAustralia's Parliament enacted the ban last year, giving the platforms a year to work out its implementation. (Getty)\n\nInman Grant said claims the ban would see every Australian account holder subjected to age verification as a \"scare tactic.\"\n\nCommunications Minister Anika Wells said the government seeks to keep platform users' data as private as possible.\n\n\"These social media platforms know an awful lot about us\" already, Wells said.\n\n\"If you have been on, for example, Facebook since 2009, then they know you are over 16. There is no need to verify.\"\n\nWells and Inman Grant will travel to the United States next week to discuss the guidelines with the platforms' owners.\n\nInman Grant said the platforms would need to demonstrate to her agency that they were taking \"reasonable steps\" to exclude children younger than 16.\n\n\"We don't expect that every under-16 account is magically going to disappear on December 10,\" Inman Grant said.\n\nThe top 10 apps Australians want to delete the most View Gallery\n\n\"What we will be looking at is systemic failures to apply the technologies, policies and processes.\"\n\nMelbourne's RMIT University expert on information sciences Lisa Given told Australian Broadcasting Corp. that the government's approach acknowledges that age verification technologies make errors.\n\n\"It's going to be up to each of the platforms to determine how they're going to comply and it will be interesting to see if they test the limits of the definition of 'reasonable steps,'\" Given said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/centrelink-payments-changes-2025-new-rates-september-20-everything-to-know-explained/7ad1411a-7f1e-4e0d-b1dd-c1dd45803dd6",
        "title": "Millions of Aussies to get a cash boost this Friday as Centrelink payments jump",
        "publish_date": "Tue, 16 Sep 2025 01:32:56 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Millions of Australians will get a cash boost this week as Centrelink payments increase under indexation changes, offering relief in the cost-of-living crisis.﻿\n\nThese changes are made every year in March and September and are designed to ensure that payments keep up with inflation.﻿\n\nHere's everything you need to know about the Centrelink payment changes.﻿\n\nREAD MORE: Aussie staples under threat of being wiped out in just decades\n\nA number of Centrelink payments will increase this week, offering relief to many struggling in the cost of living crisis.﻿ (Dylan Coker / The Sydney Morning Herald)\n\nWhich Centrelink payments are getting the increase?\n\nA number of payments will increase this week, including the age pension, carer payment, and disability support pension.\n\nFederal rent assistance, youth allowance and JobSeeker payments will also jump to keep up with inflation.\n\nThe income limits for some payments will also increase, ﻿meaning more Aussies may be eligible to receive them.\n\nWhen do the new Centrelink payment rates start?\n\nThe changes will come into effect on Friday, September 20.﻿\n\nRecipients will ﻿see the first increased payment in their bank account from that date onwards.\n\nREAD MORE: Father and son face fate over car chase murder\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nHow much are payments increasing in September 2025?\n\nThe dollar amount each payment will increase by varies.\n\nThe age pension will jump by $29.70 for singles, increasing the total fortnightly payment from $1149.00 to $1178.70 $29.70.\n\nFor couples it will increase by $22.40﻿ each, resulting in a total fornightly payment of $888.50 per person.\n\nSingle parents will receive a $16.20 boost and partnered parents will get an extra $11.40.\n\nThat will bring total fortnightly payments to ﻿$1039.70 and $734.40 respectively.\n\nRental assistance will go up by just $3.40 for singles and $3.20 for couples, with fortnightly payments to sit at $215.40 and $203.﻿\n\nRental assistance for families will increase by up to $4.48.\n\n﻿JobSeeker payments will jump by $12.50 for singles over 22 with no children, bringing the fortnightly total up from $781.10 to $793.60.\n\nCouples will receive an extra ﻿$11.40 each.\n\nYouth allowance will increase by $16.20, jumping from $1011.50 per fortnight to $1027.70.﻿\n\nSome payments will increase by just a few dollars per fortnight. (Getty)\n\nDo you need to do anything to get the new rate?\n\nNo. These rate changes will automatically be applied to any payments made after Friday, September 20.﻿\n\nWhy are Centrelink payments indexed twice a year?\n\nCentrelink payments are indexed twice a year to ensure payments keep up with inflation and the rising cost of living.\n\nThese changes are based on a number of factors, including the consumer price index, weekly wage changes, and the pensioner and beneficiary living cost index.﻿\n\nThe next change will be in March 2026.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/first-guardian-superannuation-collapse-queensland-man-phil-loses-hundreds-of-thousands-forced-to-reverse-retirement/170a3c03-4e70-4584-8f37-04df79d27f3c",
        "title": "Phil was forced to reverse his retirement after losing $240,000",
        "publish_date": "Mon, 15 Sep 2025 19:34:17 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Exclusive: A former mining worker has been forced to reverse his retirement and become a truck driver after losing his entire nest egg in a devastating superannuation collapse.\n\nPhil Mazitelli, 61, was about to live the good life travelling Australia in a caravan.\n\nA cold-call two years ago which convinced him to swap his super has ruined those plans.\n\nPhil Mazitelli says $240,000 of his superannuation has been frozen. (Supplied)\n\nMazitelli had just finished a 30-year career in mining in Queensland's north and finally wanted to enjoy the fruits of his back-breaking labour.\n\n\"I turned 60, wanted to retire and spend a bit of money on myself,\" Mazitelli told 9news.com.au .\n\n\"In 2023 I was online and I saw this advertisement which said 'you can improve your super', I filled out a form and before I knew it I got a call.\"\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nMazitelli was told he'd be able to secure his retirement with better returns, so he transferred his money to Australian Practical Super, known as AusPrac.\n\nHe heard nothing more and assumed everything was OK.\n\nAfter a year, it was time for Mazitelli to hang up his boots and retire.\n\nHe had a healthy nest egg of just over $240,000 to enjoy in his twilight years.\n\nWhen he went to pull it out, the nightmare began.\n\nHe couldn't access a single cent.\n\n\"Then I saw that First Guardian had gone into liquidation and my money had been frozen,\" Mazitelli said.\n\nLike many Australians stung by First Guardian's collapse, Mazitelli said he'd never heard of this fund.\n\nThe former mining worker said he wanted to retire at 60 but had to pause his plans. (Supplied)\n\nAround 6000 people who are missing some or all of their superannuation after the collapse of First Guardian Master Trust, which went into liquidation and is under investigation by corporate regulator ASIC.\n\nASIC began investigating First Guardian's responsible entity Falcon Capital and First Guardian.\n\nAusPrac, also known as Australian Practical Superannuation, is operated by parent company Sequoia Financial Group.\n\nDiversa is the trustee for AusPrac.\n\nIn a statement to impacted members, Diversa said it understands AusPrac members who invested in a First Guardian Master Fund may be experiencing \"stress, anxiety and feelings of uncertainty in response to significant financial losses\".\n\n9news.com.au has contacted Sequoia for comment but is yet to receive a reply.\n\nNine.com.au is not suggesting any wrongdoing by AusPrac.﻿\n\nThe long and complicated process of trying to win back even a fraction of Mazitelli's nest egg has been going on for 12 months.\n\nRetirement is now out of the question and he has been forced to return to work as a truck driver.\n\nHe's looking at another 10 years of work at the very least.﻿\n\nThe emotional burden of losing his financial freedom has taken a toll too.\n\nMazitelli is now among 12,000 Australians waiting for answers. (Supplied)\n\n\"If I make it to 70… that's probably how long I'll be working,\" he said.\n\n\"My life has now changed because I wanted to get away and do stuff, I can't anymore. It's had a huge impact.\n\n\"At my age I shouldn't cry but I do, I am angry a lot… now it's just each day wondering and hoping for a resolution.\"\n\nMazitelli has joined a Facebook group of 1300-strong people who have also lost their superannuation.\n\nAround 12,000 Australians are missing a combined total of $1.2 billion after the collapse of First Guardian and Shield Master Trust.\n\nMembers of the group are supporting and counselling each other as the ASIC investigation takes place.\n\nVictims of both collapses are demanding government action – and fast.\n\n\"The government needs to intervene now… to safeguard and watch every superannuation fund so that this doesn't happen to anyone else,\" Mazitelli said.\n\n\"We are all just normal and hardworking Australians who did nothing wrong.\"\n\nHundreds of victims have lodged complaints with The Australian Financial Complaints Authority (AFCA).\n\nMazitelli has contacted his local member Andrew Wilcox, the MP for Dawson in north Queensland, who said he will advocate on his behalf.\n\nA Change.org petition has also been started to ask the government to establish a victims' trust.﻿\n\nASIC's full statement\n\nASIC has an ongoing investigation in relation to First Guardian Master Fund and Falcon Capital.\n\nFollowing concerns raised by ASIC, the Federal Court appointed liquidators to Falcon Capital and ordered the wind-up of First Guardian and its related funds in April.\n\nThe court also restrained David Anderson, a director of Falcon, from dealing with his assets and appointed a receiver to his personal property.\n\nASIC's investigation suggests that potential consumers were called and referred to personal financial advice providers who advised consumers to roll their superannuation assets into a retail choice superannuation fund, and then to invest part or all of their superannuation into First Guardian.\n\nWhile ASIC's investigation is ongoing, the Federal Court has made interim travel restraint orders against Falcon Capital director David Anderson on ASIC's application. The Court also made interim orders freezing the assets of another Falcon director, Simon Selimaj and restraining his travel.\n\nThose orders are in place until 27 February 2026. We understand the circumstances surrounding First Guardian are distressing for those affected and it is one of ASIC's priorities to investigate what has happened and to preserve as much of investors' funds as possible while our investigation is continuing.\n\nSo far, ASIC has had more than 40 court appearances on matters related to First Guardian and Shield. We have taken a range of enforcement action with respect to these matters including:\n\nstop orders to prevent ongoing consumer harm,\n\ncommencing court proceedings to preserve assets and restrict travel of persons of interest,\n\nappoint receivers and liquidators with the aim of securing investor funds\n\nexecuting numerous search warrants with the assistance of the Australian Federal Police.\n\ncancelled licences and banned certain financial advisers.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-17/man-accused-assisting-suicides-allegedly-fake-lawyer/105778616",
        "title": "Qld man accused of assisting suicides also allegedly posed as lawyer",
        "publish_date": "Wed, 17 Sep 2025 01:16:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Gold Coast man alleged to have provided veterinary drugs to Queenslanders for assisted dying is separately accused of posing as a lawyer, according to court documents.\n\nBrett Daniel Taylor, 53, is accused of trafficking a drug commonly used in veterinary euthanasia for the purposes of assisting suicide.\n\nHe was remanded in custody by the Southport Magistrates Court on Saturday after being charged with two counts of aiding suicide and one count of trafficking the dangerous drug pentobarbital and possessing the same dangerous drug.\n\nBrett Daniel Taylor has faced court on assisted suicide charges. (Supplied)\n\nHe was also charged with obtaining Australian currency associated with trafficking.\n\n'Not entitled to engage in practice'\n\nThe ABC can reveal Mr Taylor is also accused of posing as a lawyer at Main Beach on the Gold Coast between June 2019 and July 2024.\n\nTwo charges were brought by the Legal Services Commissioner against Mr Taylor in December 2024 for allegedly breaching the Legal Profession Act.\n\nHe faced the Southport Magistrates Court on one count of engaging in legal practice when he was not an Australian legal practitioner.\n\nThe Legal Services Commission said in a statement the 53-year-old was alleged to have prepared wills and other legally binding documents for 126 clients and received payment for services through his business End of Life Services.\n\nThe second charge relates to Mr Taylor allegedly representing that he was entitled to engage in legal practice when he was not entitled to do so.\n\nThe commission alleges the representations were made on the website for his business, including those related to reviewing and assisting with administering wills and other services typically provided by a solicitor.\n\nHe is accused of making the representations for four years between 2020 and 2024, according to court documents.\n\nEnd of Life Services\n\nPrior to being charged, Mr Taylor operated the business called End of Life Services that offered \"strategic and effective accounting and legal options\".\n\nIts website shows the business provides services to \"plan and administer a loved [one's] passing\" including preparing wills and enduring power of attorney documents.\n\n\"End of Life Services work towards organising and planning estates, dealing in communication and processes with the family to take care of that element before end-of-life,\" the website said.\n\nASIC records showed Mr Taylor was also the director of a not-for-profit company called Cetacean Compassion Australia Ltd.\n\nHis father Ian Taylor is also listed as a director and has been charged with drug offences to appear in court later this month.\n\nThe charity was deregistered last year.\n\nA screenshot from the End of Life Services website. (Supplied)\n\nCriminal Investigation Branch Detective Inspector Mark Mooney said police would allege Mr Taylor used the company as a front to source the euthanasia drug pentobarbital, which he is accused of trafficking.\n\nThe company's registered address is the same Main Beach address where Mr Taylor was arrested and alleged to have received cash from trafficking.\n\nDetective Inspector Mark Mooney from the Gold Coast Police. (ABC Gold Coast: Dominic Cansdale)\n\nAccording to the company's governing document, all income from the charity was \"directed at achieving the purchase and distribution of agents and materials for the compassionate euthanising of cetaceans\".\n\nCetaceans are marine mammals, including dolphins and whales.\n\n\n\n\n\nBrett Taylor will return to court later this week. (Supplied) The document also noted the mission of the company was \"to ensure any beached cetaceans requiring euthanising can be done so compassionately without the responsible authority being concerned over a local shortage of euthanising product, or the associated costs involved\".\n\n\"Beaching of cetaceans can occur in large numbers in remote locations, with each animal requiring larger dosages of euthanising product than the pet or livestock requirements carried by local vets,\" the document said.\n\nAssisted suicide matter to return to court\n\nAccording to court documents, Mr Taylor is separately accused of aiding the suicide of a man at Hope Island on April 11, 2025.\n\nHe has also been charged with aiding the suicide of a woman at Southport between September 4 and 11 this year.\n\nAccording to the documents, police allege he trafficked the drug pentobarbital between July last year and September this year.\n\nDo you know more? Contact Alexandria Utting\n\nHe has been accused of possessing the same drug at Southport on September 9 this year.\n\nPolice also allege he received the cash obtained from trafficking dangerous drugs on September 12 at Main Beach.\n\nAccording to the documents, he did not apply for bail at his court appearance at the weekend and will return to court on September 18.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-17/social-media-ban-law-rules-analysis/105780188",
        "title": "We've been left with another cliffhanger on how the social media ban will work",
        "publish_date": "Wed, 17 Sep 2025 00:48:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "The TV cliffhanger has been a dying art for almost a decade now, but Australia's teen social media ban is single-handedly reviving it.\n\nQuestions as to how the saga will end have been piling up since episode one last November, when parliament passed a law to purge under-16s from major platforms such as Instagram, TikTok and Snapchat.\n\nLike any good TV drama, it's produced its share of intrigue — which platforms will actually be covered? What's a VPN? And how do the Wiggles feel about it?\n\nThe reply all along has been \"stay tuned\", and those who've done so have been drip-fed some of the answers, to varying levels of completion, in a drawn-out series of nail-biting instalments.\n\nThe political backflip of Olympic proportions Photo shows A blue background with images of Anthony Albanese, the YouTube logo and downward thumbs on top The government's announcement this week that YouTube would be included in the teen social media ban is a political backflip of Olympic proportions, and its first since the election. They pulled it off with surprising grace, but no landing is perfect, writes Ange Lavoipierre.\n\nWhich platforms will be covered by the ban? We still don't have an exhaustive list, but it's most of the big ones you can name, including YouTube!\n\nSluggish mid-season ratings perked up with the bombshell reveal that age-checking technology isn't always as accurate as hoped — especially if you're close to 16 years old and not a white male.\n\nBut with less than three months to go, the season's biggest mystery remains unsolved: how will social media companies actually check who's over 16?\n\nNot all under-16 accounts will disappear on December 10, the e-safety commissioner says. (ABC News: Declan Bowring)\n\nThe latest cliffhanger\n\nMany loyal viewers had high expectations that the answer would become clear in this week's episode, with eSafety Commissioner Julie Inman Grant unveiling long-awaited regulatory guidelines, but there was no big reveal in the end.\n\nRather than giving a concrete list of acceptable age-checking methods, Inman Grant announced a \"principles-based approach\", stating that age-checking systems should be \"reliable, accurate, robust and effective\".\n\nHow exactly the platforms go about the messy business of testing their users' ages — scanning faces, checking IDs, using third-party data from an app store, or making an educated guess based on users' online activity, to name a few options — will be up to the companies themselves.\n\nAge-checking tech for social media ban mistakes kids for 37-year-olds Photo shows A video stream on a laptop, showing a women with green lines and dots all over her face Children as young as 15 were repeatedly misidentified as being in their 20s and 30s during government tests of age-checking tools, sowing new doubts about whether the teen social media ban is viable.\n\nAddressing the media on Tuesday, the commissioner seemed aware her audience might have been expecting something less vague.\n\n\"It may be a surprise to some that the guidance does not mandate a single technology approach … or set a required accuracy rating for age estimation,\" Inman Grant acknowledged.\n\nWhat did emerge, though, was a clear expectation that social media companies provide Australians with more than one way to demonstrate their age — a so-called \"waterfall approach\", where ID is never the only option.\n\nAnd apparently, no-one is expecting perfection.\n\n\"We don't expect that every under-16 account is going to disappear on December 10,\" Inman Grant said.\n\n\"What we will be looking at is systemic failures.\"\n\nAustralia's eSafety Commissioner Julie Inman Grant revealed guidelines on Tuesday. (AAP: Lukas Coach)\n\nThe exact definition of \"systemic failures\" is yet another mystery.\n\nIt's unclear just how \"reliable, accurate, robust and effective\" age-checking methods will need to be in order to avoid attracting a $50 million fine, with no firm thresholds set out.\n\nIn any case, eSafety will be marking homework.\n\nThe regulator will have the power to force companies to hand over internal data as part of compliance checks, such as reports on how many young people they've kicked off their platform.\n\nThe big reveal? An educated guess may be good enough in many cases\n\nIf there was a big reveal in this episode, it might have been that social media companies won't need to ask everyone's ages — in many cases, an educated guess will do.\n\nIn technical terms, an educated guess as to a person's age is known as \"age inference\", and the eSafety Commissioner's new guidelines suggest it may figure much more prominently in the final shape of the policy than anyone initially imagined.\n\n\"Existing data may be sufficient to satisfy providers that the account holder is over the age of 16,\" the guidance states.\n\nLandmark study of age verification warns of risks Photo shows An iPhone screen The study, which will inform the government's impending social media ban for under-16s, found several methods were viable, but no method was foolproof, with concerns over both accuracy and privacy.\n\nAt the more sophisticated end of the spectrum, age inference can be remarkably accurate, drawing on a range of behavioural signals and contextual data, rather than face scanning or government-issued ID.\n\nAn age inference system might consider how long an account has existed, the interests and personal networks of the user, the content of their posts, or even analyse their voice and use of language.\n\nPut simply, if all your friends are 13, you speak and write like a 13-year-old, and your online activity drops off during school hours, a social media platform might ask you to prove your age.\n\nOn the other hand, if you've had an account since 2007, your friends are all in their 40s and you're a member of several online parenting communities, you might not ever hear from them.\n\nA key appeal of age inference, according to eSafety, is that no extra data is required from the user, making the whole experience \"frictionless\".\n\nSocial media platforms may use age inference, drawing on a range of behavioural signals and contextual data, rather than face scanning or government-issued ID. (ABC News: Will Ockenden )\n\nGranted, it's probably not the best way to tell a 15-year-old from a 17-year-old, but it might be enough to keep the majority of Australian adults from even noticing that the social media ban has come into force.\n\nThere's a certain irony to the fact that, amidst all the anxious guessing brought on by the shortage of policy detail over the last 10 months, very few people guessed at this ending.\n\nOf course, we can't know how heavily social media companies will lean on this option, but we do know it's already a common in-house practice for many of them.\n\nIt's also safe to assume companies will want to avoid any unnecessary headaches for themselves or users come December, and with eSafety's conditional green light, age inference will be all the more enticing now.\n\nSpeaking alongside Inman Grant this week, Communications Minister Annika Wells said platforms \"know an awful lot about us\" already, and millions of Australians could be about to learn exactly how much.\n\nBut until the season finale rolls around on December 10, it's all an educated guess.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-17/tasmania-hobart-afl-macquarie-point-planning-commission-findings/105781448",
        "title": "Hobart stadium shouldn't proceed, planning commission recommends",
        "publish_date": "Tue, 16 Sep 2025 23:31:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "The proposed Macquarie Point AFL stadium in Hobart should not proceed, a long-awaited assessment from the Tasmanian Planning Commission (TPC) has recommended.\n\nThe final report finds that the stadium would \"diminish the economic welfare\" of Tasmania, the government's cost-benefit remains significantly overestimated, and it would have an \"irrevocable and unacceptable\" impact on Hobart's landscape.\n\nIt estimates that the government would need to accumulate $1 billion in debt for construction costs, which would rise to $1.8 billion over 10 years, and taxes would need to increase $50 million per year over 30 years.\n\nThe report states the construction cost equates to $5,900 per Tasmanian household not reliant on Commonwealth income support.\n\nLive Moment Premier Jeremy Rockliff has responded to the Tasmanian Planning Commission's report. That's where we'll leave the live coverage Our story will continue to be updated as more reactions to the report come in. Stay tuned for further coverage as well, including a deep dive into the reasons the planning commission rejected the stadium. Stadium opponent group Our Place says report should be 'final nail in the coffin' Our Place spokesperson Roland Browne says the report makes clear the stadium should no proceed. He also calls on Mr Rockliff to resign. \"The TPC report should be the final nail in the coffin for a project that has no majority public support, will bankrupt the state, and is a desecration of the Hobart Cenotaph and Sullivans Cove. \"It's time for the Liberal and Labor parties to start listening to the experts and the community, and abandon their obsession with this stadium. \"The Minister ought not make any recommendation to the Governor; this project should lay where it has fallen. \"And if the government is silly enough to press on, the parliament should reject it out of hand. It has nothing going for it. It represents a triumph of vanity over sensible government. It is a recipe for massive state debt and ongoing community division.\" Premier shuts down talk of alternative stadium proposals Mr Rockliff is asked about the so-called 'stadium 2.0' proposal from a different developer for the Regatta Grounds area not so far from Macquarie Point. Journalist: What are the chances you'll consider a whole new proposal for the Hobart stadium, and should 2.0 be revived? Premier: No. 2.0 is not going to happen. That's all from the premier. Show more\n\nThe report provided a $974 million upfront construction cost, including car park, buses, lifecycle costs and state subsidy for the Tasmania Devils AFL club, while Premier Jeremy Rockliff said the government's latest total estimate is $1.13 billion.\n\nThe cost-benefit ratio is less than 0.5, meaning that for every $1 spent, less than a 50-cent direct benefit will be returned.\n\n\"The proponent's cost-benefit analysis prepared by KPMG and released in September 2024, shows a base-case benefit cost ratio of 0.69,\" the report reads.\n\n\" Since this study was undertaken, the stadium construction cost estimate has increased significantly. \"\n\nThe proposed stadium will be purpose-built to host AFL matches. (Supplied: MPDC)\n\nStadium's size is a 'fundamental problem'\n\nIn its conclusion, the report was highly critical of the planning elements of the stadium.\n\n\"The fundamental problem is the size, location and geographical features of the site, in its highly valued context, do not support the disproportionately large, monolithic building proposed,\" it reads.\n\n\"Proceeding with the project will give rise to irrevocable and unacceptable adverse impacts on Hobart's spatial and landscape character, urban form and historic cultural heritage.\n\n\"The project represents a significant net cost and will diminish the economic welfare of Tasmanians as a whole.\"\n\nThe project was assessed under the 12-month-long project of state significance (POSS) process and the recommendation comes after an interim report and public hearings.\n\nThe stadium should not proceed, the Tasmanian Planning Commission has recommended. (Supplied: MPC)\n\nThe recommendation is not binding, with Tasmania's parliament having the final say on approval for the project with a vote in both houses of parliament.\n\nThe report was critical of the stadium proponent — the state-owned Macquarie Point Development Corporation — which said that the stadium would have \"unquantifiable social benefits\".\n\nThe TPC described the measurable social benefits as \"small\".\n\nRockliff still proceeding with stadium\n\nPremier Jeremy Rockliff said the TPC report \"massively underestimates\" the social and economic benefits.\n\nHe said the findings were \"not unexpected\".\n\n\"I note that the planning report has said that this is ,\" Mr Rockliff said.\n\n\"When it comes to those matters that were concerning Tasmanians around safety, transport, and other key matters, they can all be resolved.\n\n\" We can do this. \"\n\nThe Liberal government and Labor opposition have both supported the project but the two parties would need the support of three independents in the upper house in order to proceed with the project.\n\nMr Rockliff said the government will \"make an order into the parliament\" with conditions attached, and the exact process will be made \"very clear in the not too distant future\".\n\n\"We need to get this done this year,\" he said.\n\nThe stadium is a requirement under the AFL's contract with the Tasmanian government for the state to have its own AFL men's and women's teams.\n\nThe future of the Tasmania Devils AFL club hinges on whether the stadium is built. (Supplied: Tasmania Football Club/Solstice Digital)\n\nStadium has 'divided' Tasmanians\n\nElwick independent Upper House MLC Bec Thomas — whose vote could be crucial — told ABC Radio Hobart that she hopes the government takes its time to consider the report.\n\n\"This issue has sadly really divided Tasmania, and we have an opportunity now where we have more information presented before us,\" she said.\n\n\"I really hope they will take their time in considering the information that's presented in the report, and in considering the decision of the planning commission before liaising with other members of parliament on what they do from here.\"\n\nSpokesperson for stadium opposition group Our Place, Roland Browne, said the report should be the end of the stadium.\n\n\"The TPC report should be the final nail in the coffin for a project that has no majority public support, will bankrupt the state, and is a desecration of the Hobart Cenotaph and Sullivans Cove,\" he said.\n\n\"It's time for the Liberal and Labor parties to start listening to the experts and the community, and abandon their obsession with this stadium.\"\n\nThe Tasmanian Planning Commission's conclusion:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-17/roosters-broncos-nrlw-dominance-ahead-of-finals/105782346",
        "title": "League boss not ready to declare lopsided NRLW as star suggests solution",
        "publish_date": "Tue, 16 Sep 2025 23:22:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "NRL boss Andrew Abdo says it is too early to say whether the NRLW has become too lopsided despite the newly expanded competition entering finals with two overwhelming frontrunners.\n\nBrisbane veteran Ali Brigginshaw suggested increasing squad sizes as a way to keep all 12 teams competitive throughout the season on the eve of a finals series where her Broncos and the Sydney Roosters have already been pencilled in on grand final day.\n\nThe competition's glamour sides finished well clear of the other four sides in the finals — Newcastle, North Queensland, Cronulla and Gold Coast — after the first regular season since the expansion from 10 to 12 teams.\n\nThe Roosters enter the finals undefeated on a 17-game winning streak dating back to August 2024 and handed the Broncos their only loss in a 30-26 nail-biter in round three.\n\nKelly pushes through after graphic jaw injury Photo shows Isabelle Kelly holds a towel to her mouth after an injury in a Sydney Roosters NRLW game. Isabelle Kelly was meant to rest up for a few weeks after suffering an oral fracture that nearly cost her several teeth, but the Roosters skipper missed just one match and has now returned to lead the club's premiership charge.\n\nBoth teams are one win away from facing off in a grand final for the third time after earning a first-week bye into the preliminary finals in the league's first six-team, three-week finals series.\n\nThe Tricolours are stacked with representative talent, although they will be without Maroons and Jillaroos half Tarryn Aiken for the finals, and the already elite Broncos this season welcomed star fullback Tamika Upton, who immediately topped the try-scoring with 18 in 11 games.\n\nThe third-placed Knights are still rank $26 outsiders with most bookmakers, and there have been reports this season that NSW halfback and Newcastle native Jesse Southwell has her eyes set on a move to Brisbane.\n\nBut NRL chief executive Abdo declared it was too early to make the call about whether the competition had become too top-heavy after the addition of the Bulldogs and Warriors this year.\n\n\"In any given year, you're going to have some teams that are at the top of the ladder, some teams that are at the bottom of the ladder,\" he said at the NRLW finals launch.\n\n\"Now we've got a finals series and let's see what happens.\n\n\"I think it's too early to talk about the balance of the competition because this competition is quite dynamic, continues to grow and evolve, and the quality of football and footballers is increasing.\"\n\nOnly three teams — Brisbane (2018–20), Sydney (2021, 2024) and Newcastle (2022–23) — have won the NRLW premiership since the league's first season in 2018.\n\nAnd while the men's league has similarly only had three premiers since 2017 — Storm (2017, 2020), Roosters (2018-19), Panthers (2021-24) — statistics show the gap between the bottom and top sides in the NRLW has widened this year.\n\nThe Broncos, the league's best attacking team, scored more than four times as many points as back-to-back wooden spooners Wests Tigers (404–100).\n\nLast year, the best attacking side was a little more than 2.5 times better than the worst by points scored across the regular season — 272 to Brisbane and 108 to the Tigers.\n\nThe average winning margin of games has also increased by almost a try, up from 14.2 points last regular season to 18 in 2025.\n\nThe NRL has previously been praised for its slow-burn approach to expansion, with the league slowly growing from four teams in 2018, to six in 2021, to 10 in 2023, before moving to the current 12-team format this year.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nThere is no timeline yet for reaching parity with the men's competition, as the league prioritises ensuring there is a big enough talent pool to fill each side.\n\nNRLW foundation player Brigginshaw has been pleased with the expansion to 12 teams, but has said the size of squads also needs to grow.\n\nWhile the men's competition features squads of 30 players plus at least six development players, NRLW squads have 24, plus up to four development players.\n\nThat has left teams vulnerable when injuries take a toll in the longest season yet.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nGold Coast, for example, needed to fish four uncontracted players out of reserve grade this season to make up the numbers amid an injury crisis.\n\n\"The 12 teams have been quite strong, I know we've seen some scores blow out but I do think that's to do with the squad numbers,\" Brigginshaw said.\n\n\"I definitely think we could extend those squads to 30, I know personally we do an opposed game [at training] and you don't have enough people to play against.\n\n\"I just think that will bring the standard up for each team, if we can have squads of 30, just to make sure that we're really working on upskilling everyone.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-17/bhp-alliance-to-sack-750-workers-qld-mining-royalties-saraji/105782302",
        "title": "BHP alliance to sack 750 workers blaming Qld mining royalties",
        "publish_date": "Tue, 16 Sep 2025 22:33:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of Queensland's biggest coal miners will cut about 750 jobs across its operations, blaming the impact of high royalties imposed by the state government.\n\nThe BHP Mitsubishi Alliance says its Saraji South mine at Dysart will be mothballed from November.\n\nThe Mining and Energy Union said it understood the 750 jobs will come from corporate and support roles across all of BMA's Queensland business, including rail ports and coal, and the process of cutting workers began months ago.\n\nAbout 72 miners at Saraji South are expected to be affected when it is closed in November.\n\nThe company would also put its own training academy in Central Queensland under a microscope.\n\nThe FutureFit Academy in Mackay has already trained more than 400 apprentices and trainees.\n\nThe South Saraji Mine is to be shuttered by owners BMA this November. (ABC Rural: Kim Honan)\n\nBMA asset president Adam Lancey said in a statement on Wednesday the company did not want to see jobs lost, \"but these are necessary decisions in the face of the combined impact of the Queensland government's unsustainable coal royalties and market conditions\".\n\n\"The simple fact is the Queensland coal industry is approaching a crisis point,\" Mr Lancey said.\n\n\"This is now having real impacts on regional jobs, communities and small businesses.\n\n\"The uncertainty this creates for our people and our communities is not taken lightly, and we will do everything we can to support them.\"\n\nMr Lancey said all those already learning at the FutureFit Academy in Mackay would be supported to find jobs within BHP, even as its future now remains unclear.\n\nThe Saraji South Mine, formerly Norwich Park, was last mothballed by BMA in 2012 due to falling coal prices. (ABC News)\n\nBMA behaviour 'unAustralian'\n\nDeputy Premier Jarrod Bleijie said the government was \"doing everything we can\" to make sure the state supported mining businesses.\n\n\"We are not at war with the mining sector, we are approving leases and mining approvals far more efficiently and quicker,\" he said.\n\nHe called on the company to do whatever it could to protect and support its worker who were now \"going through a pretty difficult process and stage at this time\".\n\nDeputy Premier Jarrod Bleijie called on BMA to support and protect its workers. (ABC News)\n\nBut Mr Bleijie said it was \"unAustralian\" for the company to put its Mackay training centre in doubt.\n\n\"I think that is unAustralian. I think they should keep investing,\" he said.\n\n\"They have made billions of dollars from the resources owned by Queensland taxpayers and Queenslanders, and they should keep investing in the future of young people who want a job in a mine or a resource sector in Queensland.\"\n\nMining industry says coal royalties 'wildly' underestimates revenue Photo shows A bob cat machine in front of a very large pile of coal. The Queensland Resources Council wants the state to scrap its 40 per cent royalty hike on some coal exports, saying the new rates put the industry's viability at risk.\n\nMr Bleijie said his government had vowed not to tinker with the royalty regime before its election.\n\n\"We had an election commitment not to adjust the royalty regime and we've stuck by the election commitment, so it's no surprise to BHP — a multi-billion-dollar company.\n\n\"That was our commitment to the people of Queensland.\"\n\nBMA 'spreading fear' says union\n\nUnion delegates say workers at Saraji South only learned this morning of BMA's plans.\n\nMining Energy Union president Mitch Hughes said the company must consult with its people \"rather than spread fear through the media\".\n\n\"BHP should stop using coal workers and communities as pawns in its fight with the Queensland government over royalties,\" he said.\n\n\"Workers need facts, certainty and security — not alarmism.\"\n\nQueensland Opposition Leader Steven Miles said he was calling on the government to help affected workers.\n\n\"[750 workers have] lost their source of income, losing the way that they support their families, and I would just call on the government to do whatever they can to either support BHP to keep these jobs or to help those workers into other jobs,\" he said.\n\nMr Miles' former Labor government introduced the lucrative royalties for mining and petroleum, including coal, in 2022.\n\nSteven Miles says companies were not shuttering mines when the royalties first came in, only now when prices are falling. (ABC News)\n\nThe coal royalties regime's three tiers has miners paying more as coal prices go up — 20 per cent at $175 per tonne, 30 per cent at $225/t and 40 per cent when prices topped $300/t.\n\nMr Miles said companies, including BMA, were not shuttering mines when the royalties first came in, but only now as markets have fallen.\n\n\"The coal price is now much lower than it has been over recent years and this didn't occur when those prices were higher, which is when those aggressive coal royalties would have kicked in more substantially,\" he said.\n\nShuttered for second time\n\nSaraji South, formerly Norwich Park, was last shuttered in 2012, affecting 400 workers, with BMA claiming the site was no longer viable.\n\nThe alliance says the state's coal industry is approaching a crisis point. (ABC News: Keane Bourke)\n\nIn 2015, plans were revealed showing that BMA was considering reopening the project, but only if it could use primarily fly-in, fly-out workers.\n\nIt was later reopened in 2020 as part of the larger Saraji precinct.\n\nThe union said the resources giant was being \"disingenuous\" by blaming royalties for the closure.\n\n\"It's very disappointing to see BHP close a mine as soon as coal prices come off the boil,\" Mr Hughes said.\n\n\" But they have form in turning this mine on and off to chase high coal prices with no regard for the community or workforce impact. \"\n\nMr Hughes accused the multinational miner of \"sulking\" after making enormous profits when coal prices were high.\n\n\"Even with higher royalties, BHP profited immensely from the coal price spike of 2022-2023 which saw coking coal spot prices peak at over $900 a tonne,\" he said.\n\n\"BHP is sulking that they had to share some of these windfall profits with Queenslanders.\"\n\nWill mining royalties 'kill the golden goose' or save towns? Photo shows Blair Athol coal mine dragline in central Queensland in November 2012. Regional areas are facing doctor shortages and roads that need upgrading. Mining communities hope the royalties program could fix those problems.\n\nSaraji is one of five steel-making coal mines owned by BMA in the Bowen Basin, which spans Central Queensland.\n\nIt is also one of the longest running, with operations starting more than 50 years ago in 1974.\n\nBMA estimates it employs more than 9,500 employees and contractors across all of its operations.\n\nIn 2023, it sold its Daunia and Blackwater coal mines to Whitehaven for $2 billion citing a drop in profits and higher state royalties.\n\nIn 2024, it paid more than $4 billion dollars to the Queensland government and about $8.1 billion to suppliers.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-17/asx-markets-business-live-news/105782190",
        "title": "Live: ASX falls ahead of Fed's rate cut as BHP axes 750 jobs",
        "publish_date": "Tue, 16 Sep 2025 22:01:33 +0000",
        "category": "finance",
        "authors": [
            "David Chau",
            "Emily Stewart"
        ],
        "text": "While BHP says its decision to cut 750 jobs is because of the Queensland government's coal royalties being too high, there is another part of the story.\n\nThe \"big picture\" is that coal prices have fallen sharply this year (down by more than 30%).\n\nIt's because demand from Australia's biggest trading partner, China, is on the way down. So that would also have a sizeable impact on BHP's coal revenue.\n\nCommonwealth Bank commodity analyst Vivek Dhar published an interesting research note on China's coal purchases a few weeks ago.\n\nHe pointed out China's coking coal imports have dropped by around 11% in the year to July (and they're down 8% in the first seven months of the year).\n\nIt's also worth noting the world's second-largest economy is producing less steel (so not as much need for coking coal from miners like BHP).",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-09-17/pilbara-bores-run-dry-questioning-mining-water-use/105779046",
        "title": "Pastoralist lends voice to growing concern over Pilbara water usage",
        "publish_date": "Tue, 16 Sep 2025 21:59:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Pilbara pastoralist says the West Australian government needs to intervene amid growing fears for the region's water supplies.\n\nMike Thompson owns the sprawling Mundabullangana (Munda) Station, 100 kilometres south west of Port Hedland and about 1,500 kilometres north of Perth.\n\nThe cattle station is situated above the Yule River bore field, which Western Australia's state-owned Water Corporation owns.\n\nMundabullangana (Munda) Station sits above the Yule borefield. (ABC Rural: Michelle Stanley)\n\nIt supplies about half of Port Hedland's drinking water, sustaining the planet's largest export port by tonnage.\n\nMr Thompson told ABC Radio Perth his station was once renowned for the quality of its water.\n\nBut he said he now had to drill deep into the earth to secure water for his cattle.\n\n\"We've gone from a 40-foot average to a 60-foot average now to get to water,\" he said.\n\n\"That's been worrying me for years,\" he said.\n\n\"We just continually have to keep up with whatever's going on down below.\"\n\nWater Corporation says more water is required to meet the region's needs. (Supplied: Water Corporation)\n\nHe implored the state government to re-examine water allocations amid back-to-back years of scant rainfall.\n\nCattle country running dry\n\nMr Thompson's call is the latest in a string of growing concerns around usage and allocation impacting the wider region's water resources.\n\nResource companies extract billions of litres of water, with state permission, each year for practices like iron-ore processing and dust suppression.\n\nNeither Water Corporation nor the Department of Water and Environmental Regulation (DWER) responded to requests for comment.\n\nOn its website, Water Corporation acknowledged the need to secure a future water supply for Port Hedland, with the port town currently using about 80 per cent of its available groundwater.\n\nWith the town's population forecast to surge over the next decade, the pressure on local water resources will only increase.\n\nAfter raising his concerns with the Water Corporation, Mr Thompson said the utility told him climatic pressures meant groundwater levels were generally trending downwards.\n\n\"If they're dropping the aquifer that far and they're blaming climate change, well, shouldn't there be a reassessment?\" he said.\n\nIndustry on notice\n\nSupply solutions under investigation include an expansion of the Yule bore field, the addition of a new bore field entirely, or the construction of a desalination plant at Finucane Island.\n\nA similar plant is under construction in Onslow, to the south-east, and another is planned for Exmouth.\n\nPort Hedland is an export hub for the nation's iron ore industry. (ABC News: Kimberley Putland)\n\nAnalyst Michaela Jamison said the management of water \"as a critical shared resource\" was demanding more attention from the Australian mining industry.\n\n\"Companies that are failing to manage some of these issues can experience things like production disruptions, costly legal challenges, loss of social license,\" Ms Jamison said.\n\n\" The concept of aqua nullius is that water has no owner ... that [idea] is under challenge. \"\n\nWater management objections have already delayed proposed mining projects in the region, including Australia's largest undeveloped gold find.\n\nKariyarra traditional owners recently appealed the environmental approval of Northern Star Resources' billion-dollar Hemi gold mine, citing fears its wastewater could jeopardise sacred waterways.\n\nDrilling takes place at Hemi mine. (Supplied: Topdrill/Facebook)\n\nThe miner's proposal would result in excess water being pumped into the nearby Turner River, which the Karriyarra Aboriginal Corporation (KAC) feared could harm the Yule River in turn.\n\n\"Those rivers were extensively used for both sustaining life and for heritage and cultural practice throughout Kariyarra's history on Kariyarra country,\" KAC chief executive James Gibson said.\n\nThe Hemi mine was recommended for ministerial approval by WA's Environmental Protection Authority in June, but now awaits a ruling from the independent appeals convener.\n\nMr Gibson said recent talks with Northern Star Resources had been positive, but water was too important a resource to yield lightly.\n\n\"Water in itself is the giver of life, no matter where you are,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-17/jess-hull-world-1500m-bronze-medal-wants-gold/105781748",
        "title": "Relief for Hull as her career as The Hunted begins at world championships",
        "publish_date": "Tue, 16 Sep 2025 21:23:45 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jess Hull has come a long way in a very short time.\n\nOn Tuesday, the 28-year-old from Wollongong dug as deep as she has in her international career to claim a sensational bronze medal in the 1,500m at the World Athletics Championships in Tokyo.\n\nNo Australian had ever won a medal of any colour in the 1,500m at an athletics world championships.\n\nBut despite admitting to being relieved that she was able to deliver a medal under the pressure of being a favourite to do so, she still has grand plans to take the giant step onto the top of a global podium.\n\n\"I think for me, in that moment, it was just this like other relief that I had got another medal,\" Hull said.\n\n\"I had to fight so hard for it.\n\n\"So to be relieved to get that run across the line and then to take that in for myself and then to start to take in what the others have done, it was really special.\"\n\nNo Australian man or woman had medalled at the world championships in the 1,500m. (Getty Images: Sportsfile/Sam Barnes)\n\nHull appeared to be tying up badly in the closing stages, as serial champion Faith Kipyegon stormed home to claim a fourth world championship gold in the distance and Dorcus Ewoi came past to take silver.\n\nBut with Nelly Chepchirchir, who pipped Hull to the Diamond League final crown last month lurking on inside her shoulder, the Australian dug deep to hang on for bronze by less than a tenth of a second.\n\n\"I was just fighting to get to that line and hang to to a medal,\" Hull said.\n\nAnd fight she did.\n\nEven with a lap to go Hull had to fight to hold her position, a tangle of elbows earning her a fierce look from Chepchirchir, who had been trying to cut down the Australian's space.\n\nThe race got a little bit physical between Nelly Chepchirchir (left) and Jess Hull (centre). (Getty Images: Hannah Peters)\n\nAfter collapsing over the line, Hull sat on the track, head back in relief and exhaustion before Ewoi, who smashed her personal best to get into the podium, leapt onto her to celebrate.\n\n\"That was massive moment for her. Like, that's a big, big breakthrough,\" a magnanimous Hull said.\n\n\"I was lucky to have that big breakthrough last year, so I know how special those moments are.\n\n\"And just to watch her realise what she had done, it was really special celebrate … she deserves it.\"\n\nJess Hull had to stretch to split the Kenyans Dorcus Ewoi and Nelly Chepchirchir. (AP Photo: Petr David Josek)\n\nThe humility that Hull showed speaks volumes of her character — something Hull credits her parents with instilling in her.\n\nBut for her, the feeling was more relief, the pressure of entering a major global meet as an Olympic silver medallist and among the favourites to claim a medal was clearly playing on her mind.\n\n\"That bronze is something I'm really, really proud of it,\" she said.\n\n\"It's definitely been different this year, to see myself as a medallist and to just embrace this position, and to come back and to get on the podium again, it's been really hard and it's been a lot of steps forward that I've had to make.\"\n\nJessica Hull sandwiched the Kenyan athletes. (Getty Images: Cameron Spencer)\n\nAnother series of steps has seen her rise to being one of the senior members of the growing Australian track and field team.\n\n\"I think my role in the team has morphed over time,\" Hull said.\n\n\"I was the young gun one day, just kind of following what they all did.\n\n\"Now I feel like I sort of just lead by example. I think the team can see how much I love what I do and how seriously I take it.\n\n\"I do really want to be one of the best in the world and I think just leading by experience and leading by example is something that I really pride myself on.\"\n\nStanding in her way of being the best in the world is Kipyegon, the evergreen \"Smiling Destroyer\" who added yet another major global title to her packed trophy cabinet.\n\nFour world 1,500m titles, and counting? (Getty Images: Hannah Peters)\n\n\"It was pretty incredible to watch her run away … very impressive,\" Hull said.\n\n\"The legacy she's leaving is huge.\n\n\"And you know, I hope that this means she comes back in 2027, because why would you leave an event that is still so dominant in?\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHull may be hoping her biggest rival sticks around for another couple of years, but not so the Kenyan can keep winning titles — Hull wants her around so she can be the one to beat her.\n\n\"We're three years out from LA [2028 Olympics] and I dream big every day,\" Hull said.\n\n\"I hope to get to the top of that podium at some point, whether that's in 2027, 2028, 2029.\n\n\"I still have a lot of time left in my career and I think while I love it as much as I do, I'm gonna keep getting better and keep fighting, and yeah, I hope to get to the top.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-17/wa-greyhound-racing-parliamentary-inquiry/105781496",
        "title": "As tide turns against greyhound racing, WA launches parliamentary probe",
        "publish_date": "Tue, 16 Sep 2025 21:22:39 +0000",
        "category": "sports",
        "authors": [],
        "text": "Animal advocates have called on the Western Australia government to follow the lead of other jurisdictions and phase out greyhound racing, as a state parliamentary inquiry examines the sport.\n\nAustralia has about 60 greyhound racing tracks operating nationwide, and has been touted as the world's largest commercial greyhound racing industry.\n\nBut with Tasmania's recent announcement that the sport would be phased out in that state by 2029, and the closure of the historic Dapto track in New South Wales, the tide may be turning.\n\nMel Harrison, president of advocacy group Free The Hounds, said both WA and the country had fallen behind.\n\n\"Wales is phasing it out, Scotland's phasing it out, Tasmania, New Zealand — let's get on board, Australia,\" she told ABC Radio Perth.\n\nThe Dapto track had been operating for almost 90 years. (ABC News: Billy Cooper)\n\nA petition with more than 26,000 signatures calling for the industry to be phased out was tabled in WA's parliament, prompting the inquiry.\n\nThere were 23 greyhound deaths on tracks in the state last year, second only to Victoria, which recorded 46 deaths, according to data recorded by the Coalition for the Protection of Greyhounds.\n\nThere have been 10 deaths on tracks in WA so far in 2025.\n\nMs Harrison said it was high time for the industry to be scrutinised.\n\n\"The greyhounds finally get to have their stories heard, because they can't speak for themselves,\" she said.\n\n\"There are so many ancillary things that go on with racing — you've got gambling, and all sorts of rehoming issues.\n\nDogs cross line for last time at famed track after 90 years of racing Photo shows Crowd in stand, dogs blurry The Dapto Dogs has held its final race meet after almost 90 years of greyhound racing.\n\n\"[The greyhounds] fall into the community rescue groups and these are all funded through the community … that has cost, in the past, Greyhound Adoptions WA up to $250,000 a year in vet bills.\"\n\nThe inquiry will be the first wide-ranging probe of its kind into the industry in WA.\n\nThe WA Greyhound Racing Association (WAGRA), the state's industry body, operates three tracks in Cannington, Mandurah and Northam.\n\nThe parliamentary committee will focus on industry practices and data around animal welfare, governance arrangements, and post-racing care of greyhounds.\n\nCommunity concerns\n\nCommittee chair Sandra Carr said the amount of community concern warranted a review of the industry.\n\n\"The many thousands of signatories to this petition demonstrate ongoing community concern about animal welfare and the greyhound racing industry,\" she said.\n\nSandra Carr is leading the committee. (ABC Midwest Wheatbelt: Chris Lewis)\n\nOpposition racing and wagering spokesperson Lachlan Hunter said he had seen the greyhound industry doing \"the right thing\" in his time in the job.\n\n\"I've always been a big supporter of ensuring that industries are transparent, industries are sustainable, and they meet community expectations,\" he said.\n\n\" Over the past six months in opposition, I've seen nothing but the industry do the right thing … as the shadow minister, I support the greyhound racing industry. \"\n\nMr Hunter said the industry had a track record of keeping greyhounds safe during races, and contributed to the state's economy.\n\n\"This is a government that is clearly trying to appease the Greens and the Animal Justice Party in the upper house,\" he said.\n\nThe Tasmanian government says it will phase out the greyhound industry by 2029. (AAP: David Moir)\n\nOne Nation MP Philip Scott also defended the industry while addressing the Legislative Council on Tuesday night, citing a recent visit to Cannington where he said the dogs looked \"very happy\".\n\n\"Greyhound racing has been under scrutiny for years. The industry knows this and is doing everything in its power to make sure it survives,\" he said.\n\n\"Obviously, the welfare of the dogs is front and centre in the minds of everyone. That includes the owners, the trainers and the public.\"\n\nGovernment backing\n\nBoth WAGRA and Racing and Wagering WA (RWWA) — the industry and regulating bodies respectively — are government entities.\n\nWAGRA referred the ABC's enquiry to RWWA, which declined to comment.\n\nMs Harrison said the relationship between the two organisations and the government was problematic.\n\n\"You've got these three entities sort of looking at each other, and that's part of the problem,\" she said.\n\n\"How can somebody be overseeing welfare, gaming and integrity, and also the commercial side of it?\"\n\nIn a statement, Racing and Gaming Minister Paul Papalia said he did not want to pre-empt the inquiry.\n\nPaul Papalia is WA's racing and gaming minister. (ABC Mid West: Piper Duffy)\n\n\"Parliamentary Committees are independent of government and free to undertake inquiries in accordance with their relevant chamber's Standing Orders,\" he said.\n\nMr Hunter called on the minister for more clarity.\n\n\"The government needs to come out and be very, very clear to the industry, to the people of Western Australia, whether the minister supports the future of the greyhound industry,\" he said.\n\nThe inquiry is open to public submissions until November 17.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/triggered-how-one-key-change-has-turned-sam-konstas-batting-around-in-ashes-fight-20250917-p5mvp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Triggered: How one key change has turned Sam Konstas’ batting around in Ashes fight",
        "publish_date": "Wed, 17 Sep 2025 11:45:40 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig",
            "Tom Decent"
        ],
        "text": "It’s one small step for Sam Konstas. It could be one giant leap for Australia.\n\nThe addition of a pre-ball “trigger” movement to Konstas’ batting technique can be revealed as the key change the 19-year-old has made since a bruising tour of the Caribbean and ahead of the fight to retain his Test spot for the Ashes.\n\nA rapid-fire century for Australia A in India overnight was Konstas’ second in as many hits, after also reaching three figures in a practice game for New South Wales in pre-season.\n\nBoth innings show that by starting to work on moving before the ball is bowled, Konstas will be sharper against quality bowling and more likely to avoid the types of dismissals he suffered in the West Indies.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-albanese-to-meet-trump-in-us-visit-next-week-suspect-in-kirk-killing-charged-with-aggravated-murder-20250917-p5mvmr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese to meet Trump in US visit next week; Suspect in Kirk killing charged with aggravated murder",
        "publish_date": "Wed, 17 Sep 2025 11:42:16 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Climate Change Minister Chris Bowen and Treasurer Jim Chalmers are speaking in Brisbane on the establishment of a Sustainable Aviation Fuel (SAF) industry in Australia.\n\n“We want to see more Australian jobs across the country, taking great Australian products like canola, tallow, and other agricultural products and waste products and turning it into cleaner fuels,” Bowen told journalists in Brisbane.\n\nOn Tuesday, the Albanese government said it had committed $1.1 billion to help commercialise the local production of low-carbon liquid fuels, to help the transport industry cut emissions from industries like aviation and heavy haulage.\n\nMinister for Climate Change and Energy Chris Bowen. Credit: Alex Ellinghausen\n\n“When we come to a 2025 target it will be ambitious and achievable, and it will be showing Australians what our plans are part of that plan today, showing Australians how we can create jobs and lower emissions at the same time,” Bowen said.\n\nThe government is expected to announce its 2035 emissions target this week, with Chalmers flagging that it would be “responsible, orderly and considered”.\n\n“It will be good for the economy and good for the environment and it will meet our obligations to future generations as well. We know that net zero is a huge economic opportunity for Australia. Low carbon liquid fuels have a big role to play in that and that is why today’s announcement is so important,” Chalmers said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-2032-master-plan-contract-awarded-despite-stadium-uncertainty-20250917-p5mvpj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane 2032 master plan contract awarded, despite stadium uncertainty",
        "publish_date": "Wed, 17 Sep 2025 11:32:03 +1000",
        "category": "finance",
        "authors": [
            "Cameron Atfield"
        ],
        "text": "The firm awarded the contract to deliver the Brisbane 2032 master plan for Victoria Park will start work without knowing where the Olympic stadium will be built.\n\nLess than two months after expressions of interest were called, Arup were announced as the successful tender at a Victoria Park media conference on Wednesday morning.\n\nBut just how much work Arup could do while the location of the centrepoint of the plan – the Brisbane Stadium in Victoria Park – remained undecided was a hot topic at the announcement.\n\nArup’s Penny Hall at Victoria Park with Deputy Premier Jarrod Bleijie. Credit: Cameron Atfield\n\nDeputy Premier Jarrod Bleijie said he was confident the lack of that vital detail would not be an impediment to Arup’s master planning, which would take in Victoria Park and the nearby RNA Showgrounds.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/scoop-in-september-live-why-hawthorn-s-president-brought-a-slab-of-vb-to-dinner-with-the-pm-20250914-p5muwc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scoop in September: Finals fracas or a simple contract? Seven and Fox at odds over grand final clause",
        "publish_date": "Wed, 17 Sep 2025 11:26:40 +1000",
        "category": "sports",
        "authors": [
            "Sam Mcclure"
        ],
        "text": "We are not even through to preliminary final weekend and already a television skirmish is developing over coverage of the grand final.\n\nAs many of you would know, the 2025 season marks the first year of the AFL’s new broadcast deal, which gives Fox Footy the right to televise every game of every round, live. Every game ... except the grand final.\n\nOnly Channel Seven can broadcast the grand final live. Credit: Stephen Kiprillis/AFL Photos\n\nBut that hasn’t stopped Fox asking the question. Let me explain.\n\nSeven have exclusive rights to the grand final. Once the game is over, as per the contract, Fox is allowed to show a replay on Fox Footy and Kayo. The replay can include their own commentators.\n\nSo Fox politely asked the AFL if they could use a commentary box at the MCG, for their team to call the game from the ground as if live, but air the match later.\n\nUh oh. The contract stipulates in black and white that during the grand final, no one from Fox is allowed inside the MCG.\n\nSeven – via the AFL – has reminded Fox it is absolutely allowed to call the game from its studio in South Melbourne. I mean, it’s not as if Fox hasn’t done that before this year. Just ask Brian Taylor, who has taken every opportunity to call out the opposition when they have commentated games remotely.\n\nWhen approached for comment, Seven assured Scoop in September there was no finals fracas, because there is nothing to fight about. The contract is the contract.\n\nFox Footy commentators Garry Lyon, Anthony Hudson and Nathan Buckley would have to call the grand final from their studio in South Melbourne. Credit: AFL Photos, Getty Images\n\n“We look forward to bringing every moment of the 2025 grand final to all Australians from 7am AEST through to the post match celebrations live, free and exclusively on Seven,” the network’s football boss Gary O’Keefe said.\n\nThe AFL, which wouldn’t respond publicly, told this column that only a gesture of goodwill from Seven would grant Fox entry to the ’G.\n\nSeven has sent a pretty clear message. Like Gretchen Wieners in the comedy blockbuster Mean Girls: “You can’t sit with us!” But we don’t think Seven is being mean.\n\nUnless the host broadcaster has a change of heart (highly unlikely) or the AFL changes its position, you won’t see any of Fox’s commentary team at the MCG on September 27.\n\nYou’ll see Seven’s James Brayshaw calling alongside “BT”, with special comments from Kane Cornes and Luke Hodge.\n\nAt least Fox’s marquee caller Gerard Whateley will be there if, as expected, he’s calling for SEN. But fellow Fox commentators such as Anthony Hudson, Dwayne Russell and whomever Fox chooses as its special comments pundits – Garry Lyon, Nathan Buckley, Jason Dunstall, Jonathan Brown and Jordan Lewis – are likely to be locked in a studio down the road.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/housing-stock-to-get-major-boost-in-three-brisbane-hubs-20250916-p5mvkh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More apartment towers to be built around major Brisbane shopping centres",
        "publish_date": "Wed, 17 Sep 2025 11:25:03 +1000",
        "category": "finance",
        "authors": [
            "William Davis"
        ],
        "text": "The construction of apartment towers soaring taller than 20 storeys will be encouraged around one of Brisbane’s major shopping centres under an anti-urban sprawl plan from the council.\n\nBrisbane City Council has announced it will allow developers to build residential towers around Carindale Shopping Centre and Indooroopilly Shopping Centre, as well as Nundah Village.\n\nPlanning rules will be changed to make it easier for developers to build above the current limit of 10 storeys around Westfield Carindale, and the limit of 20 stories around the centre at Indooroopilly.\n\nIndooroopilly Shopping Centre is one of three hubs where more homes will be permitted. Credit: File\n\nIn Nundah, the existing height limit of 12 storeys will remain, but changes will allow more residential homes in mixed-use buildings.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/dogs-on-planes-what-you-need-to-know-about-virgin-s-new-furry-passenger-policy-20250806-p5mkx0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dogs on planes: What you need to know about Virgin’s new furry-passenger policy",
        "publish_date": "Wed, 17 Sep 2025 11:25:01 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Small dogs and cats will be permitted to travel underneath the seat in front, secured in a carrier. Credit: iStock What is the pilot’s role? As Virgin moves ahead with its plans, the process by which pilots will judge the safety of dogs and cats remains unclear. Under Civil Aviation Safety Authority (CASA) rules, a pilot in command must take reasonable steps to ensure the carriage of an animal does not adversely affect the safety of the flight. “A person may only bring an animal onto an aircraft with your [the pilot’s] permission. Before you give permission, all reasonable steps must be taken to ensure carrying the animal will not adversely affect aviation safety,” CASA general operations and flight rules say. What constitutes a “reasonable step” may vary depending on the airline, aircraft type and the animal being carried. Virgin already transports dogs and cats in its planes’ cargo holds, as well as “non-exotic” birds, rabbits, guinea pigs, mice, rats, snakes and lizards.\n\nA common sight overseas. In New Jersey, an airline passenger checks in his pet labradoodle. Credit: iStock How much will travelling with a pet in a cabin add to your airfare? Virgin says it will cost $149 per pet per flight. That’s comparable to prices in the US. United, for example, charges $US150 ($230) for a pet in the cabin, each way. What is spent on pet travel may be saved on lodging a dog or cat while away, Jopp said. “It’s always difficult to find a dog sitter, and you might feel that owner’s guilt if you have to leave a dog in a kennel when you are going on a holiday. So the ability to take a pet with you on the holiday might be something that a lot of people are looking for.” What about people who don’t like pets?\n\n“Not everyone is an animal person,” said Jopp. “They might be allergic to cats, perhaps. You never know how your pet is going to react the first time they go on a flight, especially during the take-off and landing. Maybe they’ll become nervous; maybe they’ll start barking or howling.” Credit: Getty Images They could become nauseous. There is the possibility of backlash from people who oppose pets in planes, Jopp said. Nevertheless, a poll of pet owners commissioned by Virgin showed nearly 70 per cent of respondents said they would travel with their pet in the cabin if given the option. RSPCA Australia said it welcomed the announcement by Virgin. Nearly 70 per cent of the nation’s households own pets. What about people with allergies to pets?\n\nVirgin Australia said its aircraft were equipped with advanced HEPA (high efficiency particulate air) filtration systems, which refresh cabin air 20 to 30 times an hour with sterile air, “flowing from ceiling to floor”. As a result, most passengers can be “comfortably” seated just a few rows away from pets without experiencing allergic reactions. Allergic passengers can request to be moved within the same cabin class free of charge, Virgin said, which was a solution anticipated by Food Safety Australia New Zealand in its August report. Submissions from individuals to FSANZ focused on concerns about health impacts for people with allergies to animals, but “non-food allergens” were beyond the scope of the application made to the regulator. “Submissions from individuals were almost evenly divided between support and non-support” for pets in cabins, it said.\n\nLoading For those with pet allergies on planes, the US-based Asthma & Allergy Network, which opposes pets on planes, has laid out a plan of action: “Request to sit as far away as possible from pets when making a reservation, wear a mask or nasal filters to block pet allergens, pre-medicate with an antihistamine or nasal spray, and carry a quick-relief [Ventolin] inhaler if you have asthma.” What about the pets themselves? Dr Sam Kovac, founder of Sydney-based Southern Cross Vet said dogs and cats, like humans, also have Eustachian tubes that connect their ears, nose and throat. A pressure change can sometimes cause a sensation of build-up and even ringing for the animals. “Dogs and cats can’t tell us if they’re experiencing discomfort, and we can’t give them a lolly to suck on, or tell them to yawn.” However, special dog earmuffs exist to help with the pressure changes, he said.\n\nBringing a chew toy on board with your pet “can help to equalise the pressure for a more enjoyable flight,” Kovac said. Travelling animals can also get motion sickness. “Turbulence, the unfamiliar environment and take-off and landing can cause dogs to whimper,” said Kovac. “However, as they’re with their best friend [you], gentle affection and cuddling likely minimises this.” RSPCA Australia said: “Guardians should ensure that their pet is under control, socialised to other animals and people, and calm and comfortable when travelling.” To avoid animals relieving themselves in-flight, Virgin has worked with a veterinarian to develop guidelines for exercise, feeding, hydration, and toileting before the flight. “To manage any unexpected incidents, pet carriers must have a leak-proof base, and absorbent mats must be placed both inside and beneath the carrier,” Virgin said. When is this set to begin?\n\nFrom Wednesday, passengers can book a place for their animals on flights between Melbourne and the Gold Coast and Melbourne and the Sunshine Coast, at the introductory price of $149 per animal, per one-way trip. After January 30, the service will be available across all Virgin’s domestic flights. Passengers will need to arrive at the airport with their pet in an approved carrier with cable ties that secure all but one opening and an absorbent mat placed inside. The pet will need to be fitted with a harness or collar and lead. Why this change? For many people, pets are more important than they used to be, so allowing them on planes appears to follow this trend. The Victorian government commissioned a first-ever statewide pet census in the 2022-23 budget, finding that a quarter of those surveyed said owning a pet gave them “someone to look after” and provided a sense of family.\n\nIn May, Italy’s aviation regulator decided to allow airlines to carry dogs larger than eight kilograms on planes. Italian Civil Aviation Authority president Pierluigi Di Palma described the change as a response to new societal needs. Jopp said declining birth rates had perhaps caused a rethink about the roles of pets. “Maybe that is a sign people are replacing children with pets, and maybe that’s part of the higher status that is now given to your pet cat or dog, because it really becomes a part of the family.” Indeed, public figures as varied as Elon Musk, Italian Prime Minister Giorgia Meloni, and the late Pope Francis have sounded the alarm on declining birthrates. Francis called out people who did not want children for reasons of “selfishness”. A man with a falcon shops at Hamad International Airport in Doha, Qatar. Credit: Getty Images\n\n“Sometimes they have one, and that’s it, but they have dogs and cats that take the place of children,” he said. Jopp said: “I think that the dog has gone from being out in the yard and in the kennel to in the house to on the bed in many cases. So I think the position of the pet in the family has changed over the past couple of decades.” He said some of the views around animals differed between cultures. In the Middle East, there isn’t a special allowance for dogs or cats – but falcons are “seen with great respect and cultural significance”, particularly by the region’s wealthy, he said. For example, Emirates’ website says: “Pets are not permitted in the cabin, with the exception of falcons between Dubai and certain destinations in Pakistan.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/single-front-door-the-biggest-overhaul-of-nsw-planning-laws-in-50-years-revealed-20250917-p5mvoo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Single front door’: The biggest overhaul of NSW planning laws in 50 years revealed",
        "publish_date": "Wed, 17 Sep 2025 11:05:47 +1000",
        "category": "finance",
        "authors": [
            "Max Maddison",
            "Megan Gorrey",
            "Jessica Mcsweeney"
        ],
        "text": "The NSW Labor government will embark on the biggest rewrite of the state’s planning laws in nearly five decades after months of behind-the-scenes negotiations to shore up support from the Coalition.\n\nUnder the overhaul of the laws that shape delivery of housing and infrastructure, the Minns government will enshrine in legislation the three-person Housing Delivery Authority, which was established in January with the power to send major residential development proposals on a faster route to approval that bypasses local councils.\n\nNSW Premier Chris Minns, pictured with Planning Minister Paul Scully. Credit: Steven Siewert\n\nLabor said on Wednesday the changes were “designed to make the planning system quicker and simpler to navigate, so that more homes and jobs can be delivered across the state”, as it faces an uphill battle to meet its target to deliver 377,000 new homes demanded by the federal government under the National Housing Accord.\n\nPremier Chris Minns said the state’s planning system had become “a bottleneck in the state’s ability to build more homes – hurting housing supply, increasing costs and reducing community confidence”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/bosnich-foster-unpack-anges-calendar-20250917-p5mvpy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bosnich, Foster unpack Ange's calendar",
        "publish_date": "Wed, 17 Sep 2025 11:05:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bosnich, Foster unpack Ange's calendar\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-slide-wall-street-drifts-ahead-of-expected-rate-cut-20250917-p5mvmg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX slides after Wall Street drifts; Trump says US-China have made TikTok deal",
        "publish_date": "Wed, 17 Sep 2025 10:58:53 +1000",
        "category": "finance",
        "authors": [
            "Stan Choe"
        ],
        "text": "The Australian sharemarket opened lower on Wednesday, with miners and financial stocks declining after Wall Street edged back from record heights ahead the Federal Reserve interest-rate decision.\n\nThe S&P/ASX 200 was down 39.5 points, or 0.4 per cent, at 8838.20 as of 10.56am AEST, with eight of the 11 industry sectors in the red. The losses came after the ASX added 0.3 per cent on Tuesday. The Australian dollar was stronger at US66.83¢.\n\nWall Street is expecting a rate cut this week. Credit: AP\n\nMining stocks – the winners of the previous session – were softer, with the iron ore heavyweights BHP, Fortescue and Rio Tinto down 0.7 per cent, 1.1 per cent and 0.2 per cent, respectively. Gold miners also wobbled even as bullion rose above $US3700 an ounce for the first time overnight, supported by a falling US dollar as investors bet on a Fed rate cut. Northern Star Resources added 0.1 per cent, Evolution Mining shed 0.6 per cent and Newmont lost 0.7 per cent.\n\nThe big four banks were mixed. CBA, the nation’s biggest stock, was flat, as was ANZ Bank. NAB dropped 0.9 per cent and Westpac shed 0.5 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/defence-australia-papua-new-guinea/a51ydrt2a",
        "title": "Australia-PNG defence pact on hold, but PM insists it'll still be inked",
        "publish_date": "Wed, 17 Sep 2025 01:00:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese will leave Papua New Guinea (PNG) without finalising a high-level defence pact between the two nations after PNG's cabinet couldn't sign off on the landmark agreement in time.\n\n\n\n\n\nThe defence treaty, known as the Pukpuk Treaty and named after the pidgin word for crocodile, between Australia and Papua New Guinea was not signed as planned on Wednesday.\n\n\n\n\n\nThe treaty would elevate the countries' relationship to an alliance, allow PNG nationals to serve in Australia's defence force, and would impose mutual support obligations if either country comes under attack.\n\n\n\n\n\nPNG Prime Minister James Marape announced that a communique laying out the wording of the pact was signed in lieu and asserted to reporters that Australia and PNG are \"security partners\".\n\n\n\n\n\nMarape said he is still in the process of delivering the treaty to his cabinet and thanked Albanese for being in Port Moresby.\n\n\n\n\n\nAlbanese referred to Australia and PNG as the \"truest of friends\" and congratulated the country on the anniversary of its independence.\n\n\n\nMarape was optimistic the treaty, which was initiated by PNG, would be signed in coming weeks and said it would take the relationship between the two countries to a \"new level\".\n\n\n\n\n\n\"We will go through our respective cabinet processes and expect to finalise the signing of the treaty,\" he said.\n\n\n\n\n\n\"Australia and PNG will keep walking together, side by side, step by step.\"\n\n\n\n\n\nAsked if the failure to sign the treaty on Wednesday was \"embarrassing\" by a reporter, Albanese said he respects the processes of the PNG cabinet and they've had a \"busy week\".\n\n\n\n\n\nMarape said increasing PNG's defence capacity was crucial to him.\n\n\n\n\n\n\"I go to sleep every night worried if someone invades my country, what is my defence for my country?\" he said.\n\n\n\n\n\nAlbanese told reporters on Tuesday that the PNG cabinet met on Monday night to give final approval but didn't have a quorum (the minimum of people to make the meeting valid) because some ministers were back in their constituencies for independence celebrations.\n\n\n\nREAD MORE Albanese says Australia-PNG defence treaty on par with US and New Zealand\n\nBut he expected his counterpart James Marape to sort it out quickly by ushering the process through his cabinet virtually.\n\n\n\n\n\nCelebrations to mark PNG's independence from Australia wrapped up on Tuesday night with a mass gathering at Port Moresby's Sir John Guise Stadium.\n\n\n\nSupport for the Pukpuk Treaty\n\nIn Canberra, the pact was backed by Opposition leader Sussan Ley.\n\n\n\n\n\n\"The new treaty being finalised by Papua New Guinea and Australia will bring a transformation of our mutual partnership — providing the basis of deeper ties for the next 50 years,\" she said.\n\n\n\n\n\nAlbanese said the idea that PNG would be attacked and Australia would sit back and watch is \"something that wouldn't happen\" given their history and close ties.\n\n\n\n\n\nMarape has said he had \"a moral obligation to build my military to a level that I can have the capacity to defend Papua New Guinea, every child\".\n\n\n\n\n\nThe landmark agreement would also enable PNG nationals to serve in Australia's defence force with the same pay as other members and start a pathway to citizenship.\n\n\n\n\n\nPNG defence minister Billy Joseph said on Monday the deal was a \"mutual defence treaty\" that would have the nations working together to defend each other's territories.\n\n\n\nLISTEN TO Papua New Guinea celebrates 50th anniversary of independence from Australia SBS News 06:37 English\n\nIt is likely the deal will be seen with a more cynical eye across the Pacific, with many nations not well disposed to the militarisation of the region.\n\n\n\n\n\nAlbanese's deal-making in the Pacific has been a central tenet of his government's foreign policy, including a landmark climate pact with Tuvalu and a migrant-dumping agreement with Nauru.\n\n\n\n\n\nHe is also pursuing a security treaty with Fiji, one of just three Pacific nations to have a defence force, along with PNG and Tonga.\n\n\n\n\n\nIn recent years, Australia has struggled to carve out security pacts with two other Melanesian nations — the Solomon Islands and Vanuatu — which maintain warmer ties with China.\n\n\n\n\n\nThe Greens have also raised concerns over the Pukpuk Treaty, including the degree of integration between the two forces.\n\n\n\n\n\n\"What, for example, would Australia's role be if there is a return to conflict in [the autonomous island region of] Bougainville?\" defence spokesperson David Shoebridge asked.\n\n\n\n\n\n\"Does it mean they follow us into a US war, or is it about military bases?\n\n\n\n\n\n\"Absorbing PNG's military into the Australian Defence Force is a very questionable way to celebrate the 50th anniversary of independence.\"\n\n\n\n\n\nAs a gift to mark its golden jubilee, Australia will help PNG build a new ministerial wing at its parliament.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/federal-government-releases-guidelines-for-under-16s-social-media-ban/opfw20oxd",
        "title": "Federal government releases guidelines for under-16s social media ban",
        "publish_date": "Tue, 16 Sep 2025 10:02:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Federal government releases guidelines for under-16s social media ban\n\nPublished 16 September 2025, 9:04 am\n\nThe federal government's planned social media ban for under-16s has been causing a stir since it was first announced late last year. Today, Australia's eSafety commissioner published regulatory guidelines, outlining measures tech companies must comply with when the laws come into force on the 10th of December.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australian-dollar-hits-a-10-month-high-against-the-us/a3vmn3yt3",
        "title": "Australian dollar hits a 10 month high against the US",
        "publish_date": "Tue, 16 Sep 2025 07:22:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/doctor-furious-after-being-told-to-leave-virgin-australia-lounge-for-expressing-breast-milk/oudyn2xsw",
        "title": "Doctor 'furious' after being told to leave Virgin Australia lounge for expressing breast milk",
        "publish_date": "Tue, 16 Sep 2025 04:57:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Virgin Australia has apologised to a Gold Coast doctor who said she was told to leave the airline's lounge at Melbourne airport because she was allegedly making people \"uncomfortable\" expressing breast milk to feed her baby.\n\n\n\n\n\nElise Turner, an speciality women's health GP, told followers on Instagram she was \"furious\" after being told by a service manager in Virgin Australia's business lounge that she could not sit in the facility while she expressed milk under her shirt.\n\n\n\n\n\nTurner said she was told by the manager to instead use the bathroom to express milk instead, in what she described as a \"pretty unbelievable\" incident.\n\n\n\n\n\n\"I'm beyond furious right now,\" Turner, a mother of twins, said.\n\n\n\n\n\n\"This is just disgusting. This is 2025, and this is the sort of treatment that lactating mothers are expected to deal with.\"\n\n\n\nIn a subsequent post, Turner said she politely told the manager that breastfeeding was protected under federal laws.\n\n\n\n\n\n\"Her reply was that I am making her and other people uncomfortable. And then she put her hand on my arm and asked me to leave,\" Turner said.\n\n\n\n\n\nIt is illegal to discriminate against a person either directly or indirectly on the grounds of breastfeeding under the Sex Discrimination Act 1984.\n\n\n\n\n\nIn Victoria, breastfeeding discrimination is illegal in the areas of accommodation, clubs, education, employment, goods and services, selling and transferring land, and sport, according to the Australian Breastfeeding Association.\n\n\n\nVirgin Australia apologised for \"the way this situation was handled\".\n\n\n\n\n\n\"It fell short of the high standards of care and customer service our team strives to deliver. We have reached out to our guest today to apologise directly,\" a spokesperson told SBS News.\n\n\n\n\n\nSBS News has contacted Turner for comment.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/social-media-ban-guidelines-for-platforms/py4ll7x14",
        "title": "What social media platforms will — and won't — have to do under Australia's under-16s ban",
        "publish_date": "Tue, 16 Sep 2025 04:10:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Social media companies will be required to take \"reasonable steps\", such as deactivating underage accounts, to comply with Australia's under-16 social media ban, but they won't be compelled to verify the age of all users.\n\n\n\n\n\nCommunications Minister Anika Wells and eSafety Commissioner Julie Inman Grant on Tuesday unveiled guidance for platforms to comply with the social media age restrictions that are set to come into effect on 10 December.\n\n\n\n\n\nUnder the guidelines, they must take certain \"reasonable steps\" through a \"multilayered waterfall approach\" to prevent children under 16 from holding accounts on their services.\n\n\n\n\n\nFailure to do so could attract fines of up to $49.5 million.\n\n\n\nMinister for Communications Anika Wells said platforms have the information they need to comply with the new laws. Source: AAP / Mick Tsikas \"This industry guidance makes clear our strong expectations that social media platforms step up to the plate to implement the minimum age in a way that is effective, private, and fair on Australian users,\" Wells said.\n\n\n\n\n\n\"The government has done the work to ensure that platforms have the information they need to comply with the new laws — and it's now on them to take the necessary steps.\"\n\n\n\nWhat steps are expected from platforms?\n\nThe guidance sets out examples of \"reasonable steps\" companies must take to comply with the age restrictions.\n\n\n\n\n\nThese include detecting and deactivating existing underage accounts and preventing circumvention by users who have had their accounts deactivated or removed.\n\n\n\n\n\nPlatforms should take what Inman Grant called a \"multilayered waterfall approach\" to age assurance to minimise \"friction\" with users and provide \"accessible review mechanisms\" for those who believe they've been wrongly flagged.\n\n\n\n\n\n\"Our principles-based guidance recognises that there is no one-size-fits-all solution for industry, given the diversity of platforms and technology and to help technology companies meet their obligations in a way that is effective, privacy-preserving and fair,\" Inman Grant said.\n\n\n\nUnder the new guidance, platforms will not be required to use specific technologies, including those tested in the recent age assurance trial.\n\n\n\n\n\nA report released by the government earlier this month argued age assurance technology can be implemented \"efficiently and effectively\" but noted these methods have a margin of error.\n\n\n\n\n\nInman Grant said most age-restricted social media platforms have already developed their own tools around age assurance, while the trial offers some additional options.\n\n\n\n\n\nThe guidelines also forbid relying solely on user age declarations and mandate that platforms continuously monitor and improve systems over time.\n\n\n\nUnexpected guideline inclusions\n\nSocial media platforms will not be required to verify the age of all users, with blanket age verification considered \"unreasonable\".\n\n\n\n\n\nPlatforms cannot compel users to provide government ID as the sole method to prove their age online, and must always offer reasonable alternatives.\n\n\n\nLISTEN TO Privacy concerns loom as age verification details remain murky SBS News 04:30 English\n\nThey are also not expected to keep personal information from individual age checks, with record-taking to focus on systems and processes.\n\n\n\n\n\nThe guidance was developed by eSafety in consultation with industry and community stakeholders and informed by \"broad\" evidence including the age assurance trial, the government said.\n\n\n\nWhen will the ban come into effect?\n\nThe law will come into effect from 10 December this year.\n\n\n\n\n\nInman Grant said companies should first focus on deactivating or removing accounts of under-16s, and making user reporting available.\n\n\n\n\n\n\n\n\"We also recognise that preventing future under-16s from joining platforms will take longer and be more complex,\" she said.\n\n\n\nWells said social media companies will have had 12 months' notice to comply with Australian law, \"as we expect any company who conducts their business on these shores to do\".\n\n\n\n\n\nWhen it comes to enforcement, Inman Grant said authorities would first engage informally with platforms to raise any concerns.\n\n\n\n\n\n\"There are, of course, certain companies that aren't willing to engage, or will be likely to move to judicial review or a lawsuit. We need to be prepared for that as well,\" she said.\n\n\n\n\n\n\"But in most cases, these companies want to operate in Australia and they respect Australian law.\"\n\n\n\neSafety Commissioner Julie Inman Grant said the guidance encourages platforms to work collaboratively with eSafety to ensure compliance. Source: AAP / Mick Tsikas\n\nWhich platforms are included?\n\nThe government has previously said that age-restricted social media platforms will include Facebook, Instagram, Snapchat, TikTok, X and YouTube, among other platforms.\n\n\n\n\n\nWhen the legislation was passed by parliament last November, YouTube was one of a handful of platforms listed as exempt because they were \"out of scope\" of the policy.\n\n\n\n\n\nHowever, Inman Grant later wrote to Wells, making a formal recommendation that YouTube be included among the banned platforms.\n\n\n\n\n\nOnline gaming, messaging apps, health and education services won't be included.\n\n\n\nA 'monumental event' for children\n\nInman Grant acknowledged the upcoming ban will be a \"monumental event\" for a lot of children.\n\n\n\n\n\n\"A lot of children welcome this, as certainly parents do. But we know this will be difficult for kids,\" she said.\n\n\n\n\n\nHowever, she said companies around the world are moving towards age assurance technology, including online gaming site Roblox and dating app Tinder.\n\n\n\n\n\n\"All of this is creating an ecosystem that suggests this is the way the world is going.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/when-gout-gout-is-running-at-the-world-athletics-championships-and-how-to-watch/wxcgdxhi1",
        "title": "When Gout Gout is running at the World Athletics Championships — and how to watch",
        "publish_date": "Tue, 16 Sep 2025 01:02:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "The 2025 World Athletics Championships are in full swing in Tokyo, Japan, with a full slate of Australians to watch: from distance runner Jess Hull to discus star Matt Denny.\n\n\n\n\n\nAustralia has already claimed its first medal of the championships, with pole vaulter Kurtis Marschall taking home bronze .\n\n\n\n\n\nOne Australian who'll have plenty of eyes on them at this year's championships is wunderkind Gout Gout, the 17-year-old Queensland sprinting sensation.\n\n\n\n\n\nHe'll be making his senior international debut in Tokyo this week — the youngest ever athlete to compete in his event at the World Championships.\n\n\n\n\n\nHere's everything you need to know.\n\n\n\nWhen is Gout Gout competing and in what event?\n\nGout Gout will be running in just one event at the World Championships: the men's 200 metres. He did not enter to qualify for the 100m, and is not a part of the Australian 4x100m relay team.\n\n\n\nThe 200m heats will take place at 9.15pm AEST on Wednesday. The semi-final will be at 10.02pm AEST on Thursday.\n\n\n\n\n\nAnd should Gout Gout make it all the way to the final, you're in for a late night: that will take place at 11.06pm AEST on Friday.\n\n\n\nHow can I watch Gout Gout run?\n\nLike every session from the World Athletics Championships this year, you'll be able to catch Gout Gout's event via SBS Viceland, where it will be broadcast live and free.\n\n\n\n\n\nThe World Athletics Championships 2025 Hub , via SBS On Demand, will also feature full replays, mini recaps and Aussie Focus clips for each session. Here's the full schedule for SBS' broadcast of the World Athletics Championships.\n\n\n\nWho is Gout Gout up against?\n\nGout Gout will have some strong competition this week.\n\n\n\n\n\nThe favourite is Noah Lyles from the United States, and for good reason: he's won all three of the last world championship titles in the event.\n\n\n\n\n\nLyles is one of 13 entrants in the men's 200m who have achieved a time of under 20 seconds sometime this year.\n\n\n\n\n\nGout, who holds the Oceanian record for the 200m , is sitting just outside of that barrier at 20.02 seconds.\n\n\n\nGout Gout won the men's 200m at the Ostrava Golden Spike athletics meet in the Czech Republic earlier this year, becoming the new Oceanian record holder with a time of 20.02 seconds. Source: AAP / AP / Petr David Josek US athletes Kenneth Bednarek and T'Mars McCallum, Jamaica's Bryan Levell and Botswana's Letsile Tebogo will also be ones to watch.\n\n\n\nWhat would Gout Gout making the final mean?\n\nGout Gout qualifying for the 200m final would be an immense achievement: only three Australian men have achieved such a feat, and none have done so since 2005.\n\n\n\nAs the youngest athlete to ever compete in the 200m at the championships, he'd also be the youngest finalist in the event's history. That distinction is currently held by Japan's Abdul Hakim Sani Brown, who claimed it in 2017 at the age of 18 years and 157 days.\n\n\n\nWhat has Gout Gout said?\n\nDuring a pre-race media event on Monday, Gout Gout shared how he was feeling ahead of the heats.\n\n\n\n\n\nHe said a new personal best, regardless of where he ended up in the rankings, would he a huge success in his eyes.\n\n\n\n\"It's about mentally telling myself that I deserve to be here, that I'm the same as everyone else,\" he said.\n\n\n\n\n\n\"Obviously, my first experience at this level so I'm trying not to put too much pressure on myself.\n\n\n\n\n\n\"But also putting on enough pressure so I can go out there and run very fast and have fun with it.\"\n\n\n\n\n\nEvery session from the nine-day event will be broadcast live and free across SBS VICELAND, including the World Athletics Championships 2025 Hub via SBS On Demand, which will also feature full replays, mini recaps and Aussie Focus clips for every session.\n\n\n\n\n\nMorning sessions will run from 8am to 1.30pm AEST on September 13–15 and 20–21, while evening sessions will be from 8pm to 11.30pm AEST each night of the championships.\n\n\n\n\n\nHere's the full schedule for SBS's broadcast of the World Athletics Championships.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/triggered-how-one-key-change-has-turned-sam-konstas-batting-around-in-ashes-fight-20250917-p5mvp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Triggered: How one key change has turned Sam Konstas’ batting around in Ashes fight",
        "publish_date": "Wed, 17 Sep 2025 11:45:40 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig",
            "Tom Decent"
        ],
        "text": "It’s one small step for Sam Konstas. It could be one giant leap for Australia.\n\nThe addition of a pre-ball “trigger” movement to Konstas’ batting technique can be revealed as the key change the 19-year-old has made since a bruising tour of the Caribbean and ahead of the fight to retain his Test spot for the Ashes.\n\nA rapid-fire century for Australia A in India overnight was Konstas’ second in as many hits, after also reaching three figures in a practice game for New South Wales in pre-season.\n\nBoth innings show that by starting to work on moving before the ball is bowled, Konstas will be sharper against quality bowling and more likely to avoid the types of dismissals he suffered in the West Indies.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-albanese-to-meet-trump-in-us-visit-next-week-suspect-in-kirk-killing-charged-with-aggravated-murder-20250917-p5mvmr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese to meet Trump in US visit next week; Suspect in Kirk killing charged with aggravated murder",
        "publish_date": "Wed, 17 Sep 2025 11:42:16 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Climate Change Minister Chris Bowen and Treasurer Jim Chalmers are speaking in Brisbane on the establishment of a Sustainable Aviation Fuel (SAF) industry in Australia.\n\n“We want to see more Australian jobs across the country, taking great Australian products like canola, tallow, and other agricultural products and waste products and turning it into cleaner fuels,” Bowen told journalists in Brisbane.\n\nOn Tuesday, the Albanese government said it had committed $1.1 billion to help commercialise the local production of low-carbon liquid fuels, to help the transport industry cut emissions from industries like aviation and heavy haulage.\n\nMinister for Climate Change and Energy Chris Bowen. Credit: Alex Ellinghausen\n\n“When we come to a 2025 target it will be ambitious and achievable, and it will be showing Australians what our plans are part of that plan today, showing Australians how we can create jobs and lower emissions at the same time,” Bowen said.\n\nThe government is expected to announce its 2035 emissions target this week, with Chalmers flagging that it would be “responsible, orderly and considered”.\n\n“It will be good for the economy and good for the environment and it will meet our obligations to future generations as well. We know that net zero is a huge economic opportunity for Australia. Low carbon liquid fuels have a big role to play in that and that is why today’s announcement is so important,” Chalmers said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-2032-master-plan-contract-awarded-despite-stadium-uncertainty-20250917-p5mvpj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane 2032 master plan contract awarded, despite stadium uncertainty",
        "publish_date": "Wed, 17 Sep 2025 11:32:03 +1000",
        "category": "finance",
        "authors": [
            "Cameron Atfield"
        ],
        "text": "The firm awarded the contract to deliver the Brisbane 2032 master plan for Victoria Park will start work without knowing where the Olympic stadium will be built.\n\nLess than two months after expressions of interest were called, Arup were announced as the successful tender at a Victoria Park media conference on Wednesday morning.\n\nBut just how much work Arup could do while the location of the centrepoint of the plan – the Brisbane Stadium in Victoria Park – remained undecided was a hot topic at the announcement.\n\nArup’s Penny Hall at Victoria Park with Deputy Premier Jarrod Bleijie. Credit: Cameron Atfield\n\nDeputy Premier Jarrod Bleijie said he was confident the lack of that vital detail would not be an impediment to Arup’s master planning, which would take in Victoria Park and the nearby RNA Showgrounds.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/scoop-in-september-live-why-hawthorn-s-president-brought-a-slab-of-vb-to-dinner-with-the-pm-20250914-p5muwc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scoop in September: Finals fracas or a simple contract? Seven and Fox at odds over grand final clause",
        "publish_date": "Wed, 17 Sep 2025 11:26:40 +1000",
        "category": "sports",
        "authors": [
            "Sam Mcclure"
        ],
        "text": "We are not even through to preliminary final weekend and already a television skirmish is developing over coverage of the grand final.\n\nAs many of you would know, the 2025 season marks the first year of the AFL’s new broadcast deal, which gives Fox Footy the right to televise every game of every round, live. Every game ... except the grand final.\n\nOnly Channel Seven can broadcast the grand final live. Credit: Stephen Kiprillis/AFL Photos\n\nBut that hasn’t stopped Fox asking the question. Let me explain.\n\nSeven have exclusive rights to the grand final. Once the game is over, as per the contract, Fox is allowed to show a replay on Fox Footy and Kayo. The replay can include their own commentators.\n\nSo Fox politely asked the AFL if they could use a commentary box at the MCG, for their team to call the game from the ground as if live, but air the match later.\n\nUh oh. The contract stipulates in black and white that during the grand final, no one from Fox is allowed inside the MCG.\n\nSeven – via the AFL – has reminded Fox it is absolutely allowed to call the game from its studio in South Melbourne. I mean, it’s not as if Fox hasn’t done that before this year. Just ask Brian Taylor, who has taken every opportunity to call out the opposition when they have commentated games remotely.\n\nWhen approached for comment, Seven assured Scoop in September there was no finals fracas, because there is nothing to fight about. The contract is the contract.\n\nFox Footy commentators Garry Lyon, Anthony Hudson and Nathan Buckley would have to call the grand final from their studio in South Melbourne. Credit: AFL Photos, Getty Images\n\n“We look forward to bringing every moment of the 2025 grand final to all Australians from 7am AEST through to the post match celebrations live, free and exclusively on Seven,” the network’s football boss Gary O’Keefe said.\n\nThe AFL, which wouldn’t respond publicly, told this column that only a gesture of goodwill from Seven would grant Fox entry to the ’G.\n\nSeven has sent a pretty clear message. Like Gretchen Wieners in the comedy blockbuster Mean Girls: “You can’t sit with us!” But we don’t think Seven is being mean.\n\nUnless the host broadcaster has a change of heart (highly unlikely) or the AFL changes its position, you won’t see any of Fox’s commentary team at the MCG on September 27.\n\nYou’ll see Seven’s James Brayshaw calling alongside “BT”, with special comments from Kane Cornes and Luke Hodge.\n\nAt least Fox’s marquee caller Gerard Whateley will be there if, as expected, he’s calling for SEN. But fellow Fox commentators such as Anthony Hudson, Dwayne Russell and whomever Fox chooses as its special comments pundits – Garry Lyon, Nathan Buckley, Jason Dunstall, Jonathan Brown and Jordan Lewis – are likely to be locked in a studio down the road.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/housing-stock-to-get-major-boost-in-three-brisbane-hubs-20250916-p5mvkh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More apartment towers to be built around major Brisbane shopping centres",
        "publish_date": "Wed, 17 Sep 2025 11:25:03 +1000",
        "category": "finance",
        "authors": [
            "William Davis"
        ],
        "text": "The construction of apartment towers soaring taller than 20 storeys will be encouraged around one of Brisbane’s major shopping centres under an anti-urban sprawl plan from the council.\n\nBrisbane City Council has announced it will allow developers to build residential towers around Carindale Shopping Centre and Indooroopilly Shopping Centre, as well as Nundah Village.\n\nPlanning rules will be changed to make it easier for developers to build above the current limit of 10 storeys around Westfield Carindale, and the limit of 20 stories around the centre at Indooroopilly.\n\nIndooroopilly Shopping Centre is one of three hubs where more homes will be permitted. Credit: File\n\nIn Nundah, the existing height limit of 12 storeys will remain, but changes will allow more residential homes in mixed-use buildings.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/dogs-on-planes-what-you-need-to-know-about-virgin-s-new-furry-passenger-policy-20250806-p5mkx0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dogs on planes: What you need to know about Virgin’s new furry-passenger policy",
        "publish_date": "Wed, 17 Sep 2025 11:25:01 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Small dogs and cats will be permitted to travel underneath the seat in front, secured in a carrier. Credit: iStock What is the pilot’s role? As Virgin moves ahead with its plans, the process by which pilots will judge the safety of dogs and cats remains unclear. Under Civil Aviation Safety Authority (CASA) rules, a pilot in command must take reasonable steps to ensure the carriage of an animal does not adversely affect the safety of the flight. “A person may only bring an animal onto an aircraft with your [the pilot’s] permission. Before you give permission, all reasonable steps must be taken to ensure carrying the animal will not adversely affect aviation safety,” CASA general operations and flight rules say. What constitutes a “reasonable step” may vary depending on the airline, aircraft type and the animal being carried. Virgin already transports dogs and cats in its planes’ cargo holds, as well as “non-exotic” birds, rabbits, guinea pigs, mice, rats, snakes and lizards.\n\nA common sight overseas. In New Jersey, an airline passenger checks in his pet labradoodle. Credit: iStock How much will travelling with a pet in a cabin add to your airfare? Virgin says it will cost $149 per pet per flight. That’s comparable to prices in the US. United, for example, charges $US150 ($230) for a pet in the cabin, each way. What is spent on pet travel may be saved on lodging a dog or cat while away, Jopp said. “It’s always difficult to find a dog sitter, and you might feel that owner’s guilt if you have to leave a dog in a kennel when you are going on a holiday. So the ability to take a pet with you on the holiday might be something that a lot of people are looking for.” What about people who don’t like pets?\n\n“Not everyone is an animal person,” said Jopp. “They might be allergic to cats, perhaps. You never know how your pet is going to react the first time they go on a flight, especially during the take-off and landing. Maybe they’ll become nervous; maybe they’ll start barking or howling.” Credit: Getty Images They could become nauseous. There is the possibility of backlash from people who oppose pets in planes, Jopp said. Nevertheless, a poll of pet owners commissioned by Virgin showed nearly 70 per cent of respondents said they would travel with their pet in the cabin if given the option. RSPCA Australia said it welcomed the announcement by Virgin. Nearly 70 per cent of the nation’s households own pets. What about people with allergies to pets?\n\nVirgin Australia said its aircraft were equipped with advanced HEPA (high efficiency particulate air) filtration systems, which refresh cabin air 20 to 30 times an hour with sterile air, “flowing from ceiling to floor”. As a result, most passengers can be “comfortably” seated just a few rows away from pets without experiencing allergic reactions. Allergic passengers can request to be moved within the same cabin class free of charge, Virgin said, which was a solution anticipated by Food Safety Australia New Zealand in its August report. Submissions from individuals to FSANZ focused on concerns about health impacts for people with allergies to animals, but “non-food allergens” were beyond the scope of the application made to the regulator. “Submissions from individuals were almost evenly divided between support and non-support” for pets in cabins, it said.\n\nLoading For those with pet allergies on planes, the US-based Asthma & Allergy Network, which opposes pets on planes, has laid out a plan of action: “Request to sit as far away as possible from pets when making a reservation, wear a mask or nasal filters to block pet allergens, pre-medicate with an antihistamine or nasal spray, and carry a quick-relief [Ventolin] inhaler if you have asthma.” What about the pets themselves? Dr Sam Kovac, founder of Sydney-based Southern Cross Vet said dogs and cats, like humans, also have Eustachian tubes that connect their ears, nose and throat. A pressure change can sometimes cause a sensation of build-up and even ringing for the animals. “Dogs and cats can’t tell us if they’re experiencing discomfort, and we can’t give them a lolly to suck on, or tell them to yawn.” However, special dog earmuffs exist to help with the pressure changes, he said.\n\nBringing a chew toy on board with your pet “can help to equalise the pressure for a more enjoyable flight,” Kovac said. Travelling animals can also get motion sickness. “Turbulence, the unfamiliar environment and take-off and landing can cause dogs to whimper,” said Kovac. “However, as they’re with their best friend [you], gentle affection and cuddling likely minimises this.” RSPCA Australia said: “Guardians should ensure that their pet is under control, socialised to other animals and people, and calm and comfortable when travelling.” To avoid animals relieving themselves in-flight, Virgin has worked with a veterinarian to develop guidelines for exercise, feeding, hydration, and toileting before the flight. “To manage any unexpected incidents, pet carriers must have a leak-proof base, and absorbent mats must be placed both inside and beneath the carrier,” Virgin said. When is this set to begin?\n\nFrom Wednesday, passengers can book a place for their animals on flights between Melbourne and the Gold Coast and Melbourne and the Sunshine Coast, at the introductory price of $149 per animal, per one-way trip. After January 30, the service will be available across all Virgin’s domestic flights. Passengers will need to arrive at the airport with their pet in an approved carrier with cable ties that secure all but one opening and an absorbent mat placed inside. The pet will need to be fitted with a harness or collar and lead. Why this change? For many people, pets are more important than they used to be, so allowing them on planes appears to follow this trend. The Victorian government commissioned a first-ever statewide pet census in the 2022-23 budget, finding that a quarter of those surveyed said owning a pet gave them “someone to look after” and provided a sense of family.\n\nIn May, Italy’s aviation regulator decided to allow airlines to carry dogs larger than eight kilograms on planes. Italian Civil Aviation Authority president Pierluigi Di Palma described the change as a response to new societal needs. Jopp said declining birth rates had perhaps caused a rethink about the roles of pets. “Maybe that is a sign people are replacing children with pets, and maybe that’s part of the higher status that is now given to your pet cat or dog, because it really becomes a part of the family.” Indeed, public figures as varied as Elon Musk, Italian Prime Minister Giorgia Meloni, and the late Pope Francis have sounded the alarm on declining birthrates. Francis called out people who did not want children for reasons of “selfishness”. A man with a falcon shops at Hamad International Airport in Doha, Qatar. Credit: Getty Images\n\n“Sometimes they have one, and that’s it, but they have dogs and cats that take the place of children,” he said. Jopp said: “I think that the dog has gone from being out in the yard and in the kennel to in the house to on the bed in many cases. So I think the position of the pet in the family has changed over the past couple of decades.” He said some of the views around animals differed between cultures. In the Middle East, there isn’t a special allowance for dogs or cats – but falcons are “seen with great respect and cultural significance”, particularly by the region’s wealthy, he said. For example, Emirates’ website says: “Pets are not permitted in the cabin, with the exception of falcons between Dubai and certain destinations in Pakistan.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/single-front-door-the-biggest-overhaul-of-nsw-planning-laws-in-50-years-revealed-20250917-p5mvoo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Single front door’: The biggest overhaul of NSW planning laws in 50 years revealed",
        "publish_date": "Wed, 17 Sep 2025 11:05:47 +1000",
        "category": "finance",
        "authors": [
            "Max Maddison",
            "Megan Gorrey",
            "Jessica Mcsweeney"
        ],
        "text": "The NSW Labor government will embark on the biggest rewrite of the state’s planning laws in nearly five decades after months of behind-the-scenes negotiations to shore up support from the Coalition.\n\nUnder the overhaul of the laws that shape delivery of housing and infrastructure, the Minns government will enshrine in legislation the three-person Housing Delivery Authority, which was established in January with the power to send major residential development proposals on a faster route to approval that bypasses local councils.\n\nNSW Premier Chris Minns, pictured with Planning Minister Paul Scully. Credit: Steven Siewert\n\nLabor said on Wednesday the changes were “designed to make the planning system quicker and simpler to navigate, so that more homes and jobs can be delivered across the state”, as it faces an uphill battle to meet its target to deliver 377,000 new homes demanded by the federal government under the National Housing Accord.\n\nPremier Chris Minns said the state’s planning system had become “a bottleneck in the state’s ability to build more homes – hurting housing supply, increasing costs and reducing community confidence”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/bosnich-foster-unpack-anges-calendar-20250917-p5mvpy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bosnich, Foster unpack Ange's calendar",
        "publish_date": "Wed, 17 Sep 2025 11:05:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Bosnich, Foster unpack Ange's calendar\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-slide-wall-street-drifts-ahead-of-expected-rate-cut-20250917-p5mvmg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX slides after Wall Street drifts; Trump says US-China have made TikTok deal",
        "publish_date": "Wed, 17 Sep 2025 10:58:53 +1000",
        "category": "finance",
        "authors": [
            "Stan Choe"
        ],
        "text": "The Australian sharemarket opened lower on Wednesday, with miners and financial stocks declining after Wall Street edged back from record heights ahead the Federal Reserve interest-rate decision.\n\nThe S&P/ASX 200 was down 39.5 points, or 0.4 per cent, at 8838.20 as of 10.56am AEST, with eight of the 11 industry sectors in the red. The losses came after the ASX added 0.3 per cent on Tuesday. The Australian dollar was stronger at US66.83¢.\n\nWall Street is expecting a rate cut this week. Credit: AP\n\nMining stocks – the winners of the previous session – were softer, with the iron ore heavyweights BHP, Fortescue and Rio Tinto down 0.7 per cent, 1.1 per cent and 0.2 per cent, respectively. Gold miners also wobbled even as bullion rose above $US3700 an ounce for the first time overnight, supported by a falling US dollar as investors bet on a Fed rate cut. Northern Star Resources added 0.1 per cent, Evolution Mining shed 0.6 per cent and Newmont lost 0.7 per cent.\n\nThe big four banks were mixed. CBA, the nation’s biggest stock, was flat, as was ANZ Bank. NAB dropped 0.9 per cent and Westpac shed 0.5 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://au.finance.yahoo.com/news/mining-giant-shed-vital-coal-013607207.html",
        "title": "Mining giant to shed vital coal jobs and mothball mine",
        "publish_date": "2025-09-17T01:36:07Z",
        "category": "finance",
        "authors": [
            "Tue",
            "Sept",
            "Min Read"
        ],
        "text": "Australia's biggest mining company will cut hundreds of jobs and mothball one of its oldest sites, after claiming the state-based business has reached a \"crisis point\".\n\nAbout 750 jobs will be axed across Queensland and the Saraji South mine in the Bowen Basin will be placed into care and maintenance from November.\n\nThe BHP Mitsubishi Alliance said while the 50-50 joint venture company didn't want to see operations paused or jobs lost, the state's coal royalty scheme was causing issues.\n\nSaraji South mine at Dysart will be mothballed from November. (Dan Peled/AAP PHOTOS)\n\n\"These are necessary decisions in the face of the combined impact of the Queensland government's unsustainable coal royalties and market conditions,\" alliance asset president Adam Lancy said in a statement on Wednesday.\n\n\"The simple fact is the Queensland coal industry is approaching a crisis point.\"\n\nQueensland's Liberal National government has refused to make any changes to the state's progressive royalty regime introduced by the the previous Labor regime, saying it's locked in until 2029/30.\n\nThe former government introduced the tiered system in 2022, delivering lucrative royalties from mining companies and taking more when coal prices are high.\n\nIt earned the state billions of extra revenue but drew the ire of mining companies and lobby groups who described it as the world's highest coal royalty taxes.\n\n\"This is now having real impacts on regional jobs, communities and small businesses,\" Mr Lancy said.\n\n\"The uncertainty this creates for our people and our communities is not taken lightly, and we will do everything we can to support them.\"\n\nBHP also warned it would not make any new investments in Queensland \"under the current conditions\".\n\nThe Queensland Resources Council is a vocal critic of the tiered scheme, saying it will deter investment in new projects.\n\nThe soon-to-be mothballed Saraji South project is one of the alliance's five steel-making coal mines in central Queensland and one of the longest running, with operations starting in 1974.\n\nAlso under review is the BHP FutureFit Academy in Mackay, north Queensland, which trains workers joining the industry and currently has about 100 newcomers.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/pacific-leaders-reach-agreement-big-011801825.html",
        "title": "Pacific leaders reach agreement on big issues – but unity remains elusive",
        "publish_date": "2025-09-17T01:18:01Z",
        "category": "finance",
        "authors": [],
        "text": "The Pacific Islands Forum wrapped up its annual leaders meeting last week with some significant agreements, including the launch of the region’s own climate financing facility, the endorsement of the Ocean of Peace declaration and policies on partnerships and broader aspirations for “deeper integration”.\n\nBut integration remains a contested term. It implies unity but is shaped by the often uneven and unequal ways in which the region is tied together.\n\nAn EU-style integration has never taken root in the Pacific, primarily because forum members are not equals. Some are newly independent, while others, such as New Caledonia and French Polynesia, remain colonised.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAustralia and New Zealand sit apart as larger, wealthier powers whose influence inevitably shapes the terms of integration. A closer look into the recent forum’s resolutions illustrates this fragile balance.\n\nIntegrating peace, bilaterally\n\nLike many negotiated texts, the Ocean of Peace declaration is filled with ambiguities that allow for diverging interpretations and opportunities for it to be co-opted.\n\nFor larger forum powers, peace cannot be separated from deterrence. Since the China-Solomon Islands pact in 2022 bilateral security deals have proliferated, now including reports of a landmark PNG-Australia defence treaty promising “total integration”.\n\nSecurity is therefore integrating bilaterally, with only thin reinforcement at the regional level.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nFor many Pacific nations, peace looks different. It means little without confronting climate change, nuclear harms and human security. For them, integration takes shape through initiatives such as the Pacific Resilience Facility, a regional fund designed to unlock access to climate finance, or through joint efforts on labour mobility and human development.\n\nThe Ocean of Peace declaration is light on ambition. It avoids any reference to demilitarisation, even as the Pacific sees unprecedented military build-up.\n\nOn nuclear issues, the declaration focuses narrowly on testing and legacy, while sidestepping contemporary controversies, including Japan’s treated-nuclear water discharges or nuclear propulsion and stationing under AUKUS. That omission is deliberate – consensus was preserved, but only by avoiding the hardest questions.\n\nColonial legacies\n\nThis dynamic is also evident in the Review of the Regional Architecture (RRA), designed to respond to increasing interest in the region. The RRA is policy-speak for how the region should better “work together” under diverging pressures.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt goes to the heart of Pacific regionalism, raising difficult questions about who sits at the table, how power is shared, and how much sovereignty members are willing to cede in the pursuit of deeper integration.\n\nBut these questions expose a harder truth about the region’s dependence on Australia and New Zealand in particular, and the colonial roots of its institutions.\n\nColonial powers sit as members of all major regional bodies and dominate the security architecture. Foreign policy jargon such as the “centrality of the Forum” and “family-first approach” are less about unity than limiting entry of non-traditional partners.\n\nA high-level political panel consulted and presented its findings to forum leaders. But Nauru’s rejection of the RRA in its entirety underscores the sensitivities, and comes despite former Nauruan President Baron Waqa now serving as secretary general.\n\nTaiwan and China\n\nIn response to the surge in external interest, leaders endorsed a tiered partnerships policy. The real test will be in how it is applied and who falls to the lower tier. One partner, Taiwan, is used to this dynamic.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe leaders’ reaffirmation of their 1992 decision on “development partners” (code for Taiwan) keeps it in a separate track altogether: invited to the forum but not part of the main partners’ dialogue.\n\nBut Taiwan’s role is hard to ignore. In seeking to better integrate climate finance flows, its US$3 million pledge to the Pacific Resilience Facility sits alongside China’s US$500,000. Taiwan is excluded politically, yet contributes more than China.\n\nAnother irony is that while much of the debate focused on how to deepen integration, West Papua and New Caledonia face the opposite. To the Indigenous population, regionalism is not integration, but the right to dis-integrate.\n\nIt was also stressed last week that there cannot be genuine regionalism without addressing unfinished decolonisation. Pacific nations generally support self-determination but manage relations with France and Indonesia.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe forum’s communique reflects this balancing act. On West Papua, it once again reaffirmed Indonesia’s sovereignty, while the long-promised UN Human Rights Commissioner’s mission is no closer to happening.\n\nOn New Caledonia, leaders simply “noted” the High-Level Troika Plus mission report from October 2023, signalling reluctance to be drawn too deeply into France’s unfinished process.\n\nA region of people-centred integration\n\nThe freer movement of Pacific people is one of the clearest examples of deepening integration. Like security, it is driven through bilateral agreements, then elevated to principle at the regional level, such as the endorsement of the Labour Mobility Principles. Australia and New Zealand schemes provide vital jobs and remittances.\n\nPacific communities are interwoven with Australia, New Zealand and the United States through geography, legacy and large diasporas, and with France through its territories. But this form of integration carries economic and social impacts and actively shapes political futures.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIf sovereignty is to be preserved, integration must advance Pacific agency rather than entrench dependency. If it does the latter, it edges towards neo-colonialism in disguise.\n\nIntegration can empower Pacific nations and people through shared opportunities and connections. But it can also constrain when shaped by unequal power. The joint Pacific-Australian bid to host next year’s UN climate summit in Adelaide is a clear example of the imbalance: the Pacific lends its moral voice, but Australia holds the gavel.\n\nThis article is republished from The Conversation. It was written by: Sione Tekiteki, Auckland University of Technology and Marco de Jong, Auckland University of Technology\n\nRead more:\n\n\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMarco de Jong is affiliated with the independent foreign policy group Te Kuaka.\n\nSione Tekiteki does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/top-sports-teams-bought-sold-011327959.html",
        "title": "Top sports teams are bought and sold for billions worldwide. The risky trend is coming to Australia",
        "publish_date": "2025-09-17T01:13:27Z",
        "category": "finance",
        "authors": [],
        "text": "In recent years, private equity has changed the global sports landscape, with clubs from Major League Baseball (MLB) and the National Football League (NFL), rugby union in New Zealand and European soccer reaping massive financial benefits.\n\nSports codes in Australia and New Zealand have also dipped their toes in the water, with potentially more to come: Cricket Australia is reportedly considering selling its Big Bash League teams to private investors.\n\nHowever, there may be tax implications and other risks that negatively impact these leagues, which enjoy tax exemption status as not-for-profit entities that promote or encourage sport.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPrivate equity investments raise questions over whether sporting bodies can continue to claim the tax exemption.\n\nRead more: Australia's major sports codes are considered not-for-profits – is it time for them to pay up?\n\nHow Australian sport is changing\n\nThere was a seismic change in Australian sports’ ownership structure in 2021 when private equity firm Silver Lake paid A$140 million for a 33% share of the A-League.\n\nThere was also a $6.5 million bid to privatise Super Netball in 2021. The deal was rejected. Then-Netball Australia CEO Kelly Ryan said the bid was turned down because: “we don’t know whether private equity is what is best for our sport just yet”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThen in 2023 Football Australia considered selling the men’s and women’s national teams, the Socceroos and Matildas, to private equity for 99 years. The deal did not go ahead due to privacy concerns for participants in Australian soccer and the potential for Football Australia to lose its tax exemption and not-for-profit status.\n\nIn 2023, Rugby Australia secured an $80 million line of credit from Pacific Equity Partners.\n\nIn 2024, Wollemi Capital Group acquired a majority stake in the Women’s National Basketball League (WNBL).\n\nNow cricket is considering similar moves. It’s been reported the governing body may raise significant revenue by selling its Big Bash League teams to private equity.\n\nLessons from New Zealand\n\nIn 2022, New Zealand Rugby, which controls the famous All Blacks team, sold a 5.71% stake for NZ$200 million (A$180m) to American private equity firm Silver Lake.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe deal valued New Zealand Rugby at NZ$3.5 billion (A$3.15 billion).\n\nWhile the New Zealand Rugby League Players’ Association initially opposed the sale, it eventually voted to approve the deal.\n\nNew Zealand Rugby, the New Zealand Rugby League Players’ Association and Silver Lake created an international rugby investment business called New Zealand Rugby Commercial.\n\nOf the NZ$200 million, NZ$38m (A$34m) was invested in New Zealand Rugby Commercial for revenue generation, NZ$10.5m (A$9.5m) is paid annually to Silver Lake as interest and regional rugby unions receive an annual distribution of 17%.\n\nThe players’ association agreed to the deal on the condition that everyday New Zealand investors could purchase up to NZ$10m (A$9m) in the new commercial venture. It is unclear whether New Zealanders did invest.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nA second scheduled investment in 2023 by Silver Lake of NZ$62.5m (A$56m) to establish a legacy fund for a small share of New Zealand Rugby’s equity was blocked by the players’ association. However it was eventually approved by the New Zealand Rugby board after negotiations and a vote by the unions.\n\nIn late 2023 the New Zealand Rugby board advised stakeholders it was losing money and that it will spend the NZ$200m by 2031. These losses continued and in 2025, New Zealand Rugby posted a loss of $19.5 million (A$17.5m).\n\nThe losses appear to be associated with poor management rather than investment by a private equity firm: contributing to the losses were high fixed costs and player salaries.\n\nRisks and possible rewards\n\nLike the private equity deal with New Zealand Rugby, Australian sports exploring similar deals would need approval from their boards and respective player associations.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPrivate equity represents an alternative income stream for sports that rely on gambling income such as the AFL ($30 million a year) and NRL ($50 million a year). Many clubs in these leagues also earn income from poker machines.\n\nNew Zealand Rugby demonstrates that private equity investment can be hindered by mismanagement. However, a benefit can be the funding of grassroots associations.\n\nThere is also a risk of ceding ownership control to outside organisations that are motivated by profit and a return on their investment.\n\nThese risks can be negated by establishing controlling entities that are composed of the sports governing organisation, player associations and the private equity investor.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThere is concern some smaller leagues may miss out on investment from private equity, but the WNBL’s deal shows it is possible to make it work.\n\nThe tax conundrum\n\nAustralian sports leagues and clubs such as the AFL, NRL and Cricket Australia enjoy an income tax exemption as not-for-profit entities that promote or encourage sport.\n\nHowever, private equity investment raises questions over whether leagues can continue to claim this tax exemption.\n\nIn order to be a not-for-profit, common law requires an entity to not pay profits to its shareholders or owners.\n\nThis principle is known as the non-distribution constraint.\n\nAs profit-orientated investors who expect a return on their investment, private equity owners in sports would appear to violate the non-distribution constraint if they receive the profits of the leagues they invest in.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSports exploring private equity must balance the income stream generated from private equity with the potential loss of tax exempt and not-for-profit status.\n\nThis article is republished from The Conversation. It was written by: Matt Nichol, CQUniversity Australia and John McLaren, CQUniversity Australia\n\nRead more:\n\n\n\nThe authors do not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and have disclosed no relevant affiliations beyond their academic appointment.",
        "source": "Yahoo"
    }
]