[
  {
    "url": "https://www.9news.com.au/world/trump-draws-criticism-with-ai-image-of-himself-as-the-pope-ahead-of-the-papal-conclave/c5531f8f-051a-47fb-808b-ad16500a4c04",
    "title": "Trump draws criticism with AI image of himself as the pope",
    "publish_date": "Sun, 04 May 2025 00:44:15 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "President Donald Trump posted an artificial intelligence-generated image of himself dressed as pope as the mourning of Pope Francis continues and just days before the conclave to elect his successor is set to begin.\n\nTrump's action drew rebukes from a group representing Catholic bishops in New York and among Italians.\n\nThe image, shared on Friday night (local time) on Trump's Truth Social site and later reposted by the White House on its official X account, raised eyebrows on social media and at the Vatican, which is still in the period of nine days of official mourning following Francis' death on April 21.\n\nTrump draws criticism with AI image of himself as the pope ahead of the papal conclave (Supplied)\n\nCatholic cardinals have been celebrating daily Masses in his memory and are due to open the conclave to elect his successor on Wednesday.\n\nThe death of a pope and election of another is a matter of utmost solemnity for Catholics, for whom the pope is Christ's vicar on Earth. That is all the more true in Italy, where the papacy is held in high esteem even by nonreligious Italians.\n\nThe image featuring Trump in a white cassock and pointed miter, or bishop's hat, was the topic of several questions during the Vatican's daily conclave briefing on Saturday.\n\nPope Francis's tomb seen for first time in images released by Vatican View Gallery\n\nItalian and Spanish news reports lamented its poor taste and said it was offensive, given that the period of official mourning is still under way.\n\nLeft-leaning former Premier Matteo Renzi said the image was shameful.\n\n\"This is an image that offends believers, insults institutions and shows that the leader of the right-wing world enjoys clowning around,\" Renzi wrote on X. \"Meanwhile, the US economy risks recession and the dollar loses value. The sovereignists are doing damage, everywhere.\"\n\nThe Vatican spokesman, Matteo Bruni, declined to comment.\n\nIn the United States, the New York State Catholic Conference, which represents the bishops of the state in working with government, accused Trump of mockery.\n\nREAD MORE: Federal Election 2025 Results Tracker\n\nPope Francis meets with President Donald Trump, left, on the occasion of their private audience, at the Vatican, May 24, 2017. (AP)\n\n\"There is nothing clever or funny about this image, Mr. President,\" they wrote. \"We just buried our beloved Pope Francis and the cardinals are about to enter a solemn conclave to elect a new successor of St. Peter. Do not mock us.\"\n\nItaly's left-leaning La Repubblica also featured the image on its homepage Saturday with a commentary accusing Trump of \"pathological megalomania.\"\n\nAsked to respond to the criticism, White House press secretary Karoline Leavitt said that, \"President Trump flew to Italy to pay his respects for Pope Francis and attend his funeral, and he has been a staunch champion for Catholics and religious liberty.\"\n\nJack Posobiec, a prominent far-right influencer and Trump ally who recently participated in a Catholic prayer event in March at Trump's Florida resort, also defended the president.\n\nCardinals visit the tomb of the late Pope Francis inside St. Mary Major Basilica in Rome, Sunday, April 27, 2025. (AP Photo/Andrew Medichini) (AP)\n\n\"I'm Catholic. We've all been making jokes about the upcoming Pope selection all week. It's called a sense of humour,\" he wrote on X.\n\nThe episode comes after Trump joked last week about his interest in the vacancy. \"I'd like to be pope. That would be my number one choice,\" the thrice married president, who is not Catholic, told reporters.\n\nSen. Lindsey Graham, a close Trump ally, piled on.\n\n\"I was excited to hear that President Trump is open to the idea of being the next Pope. This would truly be a dark horse candidate, but I would ask the papal conclave and Catholic faithful to keep an open mind about this possibility!\" Graham, R-S.C., wrote on X. \"The first Pope-US President combination has many upsides. Watching for white smoke…. Trump MMXXVIII!\"\n\nVice President JD Vance, who is Catholic and was one of the last foreign officials to meet with Francis before the pope died, also joked about Secretary of State Marco Rubio becoming pope, suggesting Rubio could add it to the long list of titles he holds, including national security adviser and acting archivist.\n\nBeyond floating himself for the job, Trump also has put in a plug for Cardinal Timothy Dolan, the archbishop of New York.\n\n\"I have no preference. I must say, we have a cardinal that happens to be out a place called New York who's very good. So we'll see what happens,\" he said.\n\nDolan, 75, is one of 10 US cardinals who will be voting in the conclave, but Trump's pitch might have cost Dolan support.\n\nClergy follow the funeral of Pope Francis in St Peter's Square at the Vatican, on Saturday, April 26, 2025. (AP Photo/Alessandra Tarantino)\n\nThe reason conclaves are held in secrecy, with cardinals sequestered for the duration, is to prevent outside secular powers from influencing their choice, as occurred in centuries past.\n\nThere is an old saying about campaigning for the job of pope or of being promoted excessively, especially by outsiders: If you \"enter a conclave as pope, you leave as a cardinal.\"\n\nWhile Trump attended Francis' funeral, he and Vance have clashed with US bishops in general and Francis in particular over the administration's hard line stance on immigration and its efforts to deport migrants en masse. Right before he was hospitalised in February for pneumonia, Francis issued a strong rebuke of the administration's mass deportation plans and Vance's theological justification of it.\n\nOver 12 years as pope, Francis tried to remake the US Catholic hierarchy more in his image, elevating pastors who prioritised social justice and migration issues over culture warriors who were more favoured by his more doctrinaire predecessors St. John Paul II and Benedict XVI. A new pope who is more conservative could reverse that effort.\n\nTrump has nominated as his ambassador to the Holy See Brian Burch, whose Catholicvote.org has been aggressively covering the pre-conclave days at the Vatican. It was one of the main disseminators in English-speaking media of a report, flatly and officially denied by the Vatican, that Cardinal Pietro Parolin had had a health scare this past week that required medical attention.\n\nParolin was the secretary of state under Francis and is seen as a leading contender to be pope. He is also the main architect of the Vatican's China policy and its controversial 2018 deal with Beijing over bishop nominations -- a deal that the was sharply criticised by the first Trump administration.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/warren-buffett-shocks-shareholders-by-announcing-his-intention-to-retire-at-the-end-of-the-year/d2f58789-bb23-4970-bf80-216548abc712",
    "title": "Warren Buffett shocks shareholders by announcing his retirement",
    "publish_date": "Sat, 03 May 2025 21:48:48 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Revered investor Warren Buffett has shocked an arena full of his shareholders by announcing that he wants to retire at the end of the year.\n\nBuffett said he would recommend to Berkshire Hathaway’s board on Sunday (Monday AEST) that vice chairman Greg Abel should replace him.\n\n“I think the time has arrived where Greg should become the chief executive officer of the company at year end,” Buffett said.\n\nBerkshire Hathaway Chairman and CEO Warren Buffett. (AP)\n\nAbel has been Buffett's designated successor for years, and he already manages all of Berkshire's noninsurance businesses. But it was always assumed that he would not take over until after Buffett's death. Previously the 94-year-old Buffett always said he had no plans to retire.\n\nBuffett announced the news at the end of a five-hour question and answer period without taking any questions about it.\n\nHe said the only board members who knew this was coming were his two children, Howard and Susie Buffett.\n\nAbel, who was sitting next to Buffett on stage, had no warning.\n\nREAD MORE: Federal Election 2025 Results Tracker\n\nWarren Buffet, (right), and Bill Gates (left). (AP)\n\nAbel returned an hour later without Buffett to conduct the company's formal business meeting, and he responded to the news.\n\n“I just want to say I couldn’t be more humbled and honored to be part of Berkshire as we go forward,” Abel said.\n\nMany investors said Abel would do a good job running Berkshire, but it remained to be seen how good he would be at investing Berkshire's cash.\n\nBuffett endorsed him on Saturday by pledging to keep his fortune invested in the company.\n\nThe world's top 10 richest people for 2025 View Gallery\n\n“I have no intention — zero — of selling one share of Berkshire Hathaway. I will give it away eventually,” Buffett said.\n\n“The decision to keep every share is an economic decision because I think the prospects of Berkshire will be better under Greg’s management than mine.”\n\nThousands of investors in the Omaha arena gave Buffett a prolonged standing ovation after his announcement in recognition of his 60 years leading the company.\n\nCFRA research analyst Cathy Seifert said it had to be hard for Buffett to reach this decision to step down.\n\n“This was probably a very tough decision for him, but better to leave on your own terms,” Seifert said. “I think there will be an effort at maintaining a ‘business as usual’ environment at Berkshire. That is still to be determined.”\n\nAbel expected to do well\n\nIn many respects, Abel has already been running much of the company for years.\n\nBut he hasn't been managing Berkshire's insurance operations or deciding where to invest all of its cash.\n\nHe will now take those tasks on, but vice chairman Ajit Jain will remain to help oversee the insurance companies.\n\nBerkshire Hathaway Vice Chairman Greg Abel is seen at the CenturyLink Centre in Omaha, Neb., on May 5, 2018. (AP)\n\nInvestment manager Omar Malik of Hosking Partners in London said before Buffett’s announcement that he wasn’t worried about Berkshire’s future under Abel.\n\n“Not really (worried). He’s had such a long time alongside Warren and a chance to know the businesses,” Malik said about Abel. \"The question is will he allocate capital as dynamically as Warren? And the answer is no. But I think he’ll do a fine job with the support of the others.”\n\nCole Smead of Smead Capital Management said he wasn't surprised Buffett was stepping down after watching him on Saturday because the 94-year-old wasn't as sharp as in past years.\n\nAt one point, he made a basic math mistake in one of his answers. At other points, he got off track while telling stories about Berkshire and his investing without answering the question he was asked.\n\nAbel is well regarded by Berkshire's managers and Buffett has praised his business acumen for years. But he will have a hard time matching Buffett's legendary performance, and since he doesn't control 30 per cent of Berkshire's stock like Buffett does, he won't have as much leeway.\n\n“I think the challenge he’s going to have is if anyone is going to give him Buffett or (former Vice Chairman Charlie) Munger’s pass card? Not a chance in God’s name,\" Smead said.\n\nBuffett always enjoyed a devoted following among shareholders.\n\nBuffett has said that Abel might even be a more hands-on manager than he was and get more out of Berkshire’s companies. Managers within the company say they have to be well prepared before talking to Abel because they know he will ask tough questions.\n\nSteven Check, president of Check Capital Management, said he never thought he would see Buffett retire.\n\n“I didn't think he would retire while his mind is still working so well, nor did I think it'd happen at the annual meeting,” Check said. “But overall I'm very happy for him.”\n\nBuffett earlier warned that Trump's tariffs were harmful\n\nEarlier Saturday, Buffett warned of dire global consequences from President Donald Trump's tariffs while telling the thousands of investors gathered at his annual meeting that “trade should not be a weapon” but \"there's no question that trade can be an act of war\".\n\nBuffett said Trump's trade policies have raised the risk of global instability by angering the rest of the world.\n\n“It’s a big mistake in my view when you have 7.5 billion people who don’t like you very well, and you have 300 million who are crowing about how they have done,” Buffett said as he addressed the topic on everyone's mind at the start of the Berkshire Hathaway shareholders meeting.\n\nPresident Donald Trump speaks during an event about investing in America in the Cross Hall of the White House, Wednesday, April 30, 2025, in Washington. (AP Photo/Alex Brandon) (AP)\n\nWhile Buffett said it was best for trade to be balanced between countries, he did not think Trump was going about it the right way with his widespread tariffs. He said the world would be safer if more countries were prosperous.\n\nMarket turmoil doesn't create big opportunities\n\nBuffett said he just did not see many attractively priced investments that he understood these days, so Berkshire was sitting on $US347.7 billion ($538.4 billion) in cash, but he predicted that one day Berkshire would be “bombarded with opportunities that we will be glad we have the cash for\".\n\nBuffett said the recent turmoil in the markets that generated headlines after Trump's tariff announcement last month was \"really nothing\".\n\nHe dismissed the recent drop as relatively small. He cited when the Dow Jones industrial average went from 240 on the day he was born in 1930 down to 41 during the Great Depression as a truly significant drop in the markets. Currently the Dow Jones Industrial Average sits at 41,317.43.\n\n“This has not been a dramatic bear market or anything of the sort,\" he said.\n\nBuffett said he had not bought back any of Berkshire's shares this year either because they did not seem to be a bargain.\n\nInvestor Chris Bloomstran, who is president of Semper Augustus Investments Group, told the Gabelli investment conference on Friday that a financial crisis might be the best thing for Berkshire because it would create opportunities to invest at attractive prices.\n\n“Berkshire needs a crisis. I mean Berkshire thrives in crisis,” Bloomstran said.\n\nBerkshire meeting attracts thousands\n\nThe meeting attracts some 40,000 people every year who want to hear from Buffett, including some celebrities and well-known investors.\n\nThis year, Hillary Rodham Clinton also attended. Clinton was the last candidate Buffett backed publicly because he has shied away from politics and any controversial topic in recent years for fear of hurting Berkshire’s businesses.\n\nOne investor even camped outside the arena overnight to be first in line.\n\nDevan Bisher, 72, said he had faith in Berkshire's future and did not plan to sell the stock he started buying in the 1980s.\n\n“It’s been a good train to ride,” Bisher said, “and I’m going to stay with it.”",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/federal-election-2025-results-labor-wins-majority/4c7d2831-99a3-42cf-a3c8-586f7a094def",
    "title": "Albanese makes second term pledge as he greets Labor faithful",
    "publish_date": "Sun, 04 May 2025 01:25:30 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "\"It's a tough business politics, there's no doubt about that, and it would have been a tough night for Peter, but he was generous. He did mention my mum, and that was very kind of him, as well as mentioning Jodie and Nathan. And that was a very kind thing to do. I used to visit this coffee shop with my mum. I grew up just down the road here, and I did certainly think of her last night as well. She would be very proud, but I'm very proud of the labor team that I lead.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/9news-federal-election-have-your-say/12aef179-2751-4415-8cb5-8cab2a8120e1",
    "title": "Have your say on the big issues",
    "publish_date": "Sat, 03 May 2025 10:56:42 +0000",
    "category": "sports",
    "authors": [
      "May"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/romance-book-stores-sydney-bowral-yarra-valley/cecaf13d-e574-426e-863b-9cf2fe2d8f07",
    "title": "What they sell used to be 'taboo' but business is booming for women like Scarlett",
    "publish_date": "Sat, 03 May 2025 02:04:44 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The sky is overcast and threatening rain as women pour into Romancing The Novel in Paddington, flooding the narrow bookstore until there's barely room to move.\n\nThey're all on a 'book crawl' and they're all here for one thing: romance novels.\n\nRomance has been the most commercially successful fiction genre for decades and is reaching new heights in the 2020s, according to Nielsen BookScan data.\n\nWomen flocked to Romancing The Novel in Paddington last weekend for a Bound To Roam 'book crawl'. (Supplied)\n\n﻿More than twice as many romance novels were sold in 2024 compared to 2019 and Australians spent more than $50 million on the genre last year.\n\nRomance ﻿has also been growing at an average annual rate of 49 per cent for the last three years, suggesting the figures could be even higher in 2025.\n\nAnnabel and Eliza, the organisers behind the Bound to Roam book crawl last weekend, made sure a romance store was their last stop for that very reason.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\n\"All day our guests were saying they couldn't wait to go to [...] that they were saving their purchases for the female owned small business,\" Annabel told 9news.\n\nRomancing The Novel owner Scarlett Hopper, who is also a romance author, said she has BookTok (TikTok's book community) to thank for the boom in business.\n\nThe rise of online communities like BookTok has lessened the stigma around romance fiction, which was once considered \"taboo\" and has been dismissed as frivolous and shallow for decades.\n\nThe stigma is largely rooted in misogyny﻿, as romance is a genre predominantly written by and for women, but social media has shifted the narrative over the last five years.\n\nScarlett Hopper is a romance author and runs Sydney romance bookstore Romancing The Novel. (Instagram/@romancing.the.novel)\n\n\"Romance has always had a place in the world, people just haven't acknowledged it.﻿ Now I think women are taking back the power,\" Hopper told 9news.\n\nThat's reflected in her sales, which have been high ever since she opened her Paddington store in September 2024.\n\n﻿Some of her regulars travel hours just to visit the store each weekend and many spend hundreds of dollars each time they drop in.\n\n\"It shows how much books mean to people, especially women﻿,\" she said.\n\nAnd Romancing The Novel is not the only store benefiting from the boom in romance book sales.﻿\n\nCaitlyn, owner of A Thousand Lives﻿ Book Haven in the Yarra Valley, told 9news that \"people have been spending more and more on books\" over the last 18 months.\n\nREAD MORE: New autopsy reveals exactly how Gene Hackman died\n\nCaitlyn (left) with an author at one of A Thousand Lives Book Haven's reader events. (Instagram/@athousandlives.bookhaven)\n\nShe opened the indie romance bookstore in 2023 and cost of living pressures have forced her to raise prices recently, but customers have been happy to pay the difference.\n\nMany of the 700-plus titles she stocks can be found cheaper online from major retailers like Amazon﻿ but Caitlyn says customers prefer buying from small businesses that offer an in-store experience.\n\n\"I think that hunger has always been there, we are just hearing more about it due to social media,\" she said.\n\nMany readers, including those on the Bound to Roam ﻿book crawl, are also seeking a sense of community which can only be found in physical spaces like a bookstore.\n\n﻿\"Even in a cost of living crisis, people still crave joy, meaning, and a sense of escape﻿,\" Eliza told 9news, adding that buying a print book in-store can fulfil that need.\n\nMany readers are also passionate about owning print copies of the books they love, some even purchasing multiple copies with different covers and bonus content.\n\nIn Bowral, Aussies are forking out up to $1000 in a single visit for special edition copies of their favourite novels at ﻿Books Ever After, run by romance author Kat T. Masen.\n\nAuthor Kat T. Masen's romance novel went viral on TikTok before she opened her store Books Ever After in Bowral. (Instagram/@authorkattmasen)\n\nShe realised the power of BookTok when her novel Chasing Love went viral and opened the store soon after in 2023.\n\nWithin a year, it had caught the attention of streaming giant Netflix.\n\n\"It was really my heavy presence on TikTok that pushed the store to the next level,\" Masen told 9news.\n\nNetflix ﻿invited her to be part of the festivities when hit series Bridgerton came to Bowral for its season three press tour in April last year, sparking a huge spike in sales and online interest for the small business.\n\nOne year on, she's already planning ﻿to open a second location after proving with her first that \"brick and mortar is still very much alive\".\n\nEspecially since the interest rate cuts in February, which Masen said sparked a spike in spending from her Australian customers.\n\nOnline sales from US c﻿ustomers have dipped due to US President Donald Trump's tariffs but that just gives Masen more incentive to grow her business locally while the romance boom continues.\n\nPanic on Wall Street as Trump announces new tariffs View Gallery\n\nNielsen BookScan's international book markets report showed that romance was one of the fiction genre with the strongest growth in 2024 and that's expected to continue in 2025.\n\nPhysical bookshop purchases rose above pre-pandemic levels, with more than half of Nielsen BookScan's tracked markets showing an increase in print book sales volume compared to 2023.\n\n\"For all of the people saying romance books are dead, my sales record proves otherwise,\" Caitlyn said.\n\nMeanwhile, romance readers are lapping it up and Annabel and Eliza have already locked in another book crawl in June with an even bigger turnout expected.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/aussies-dont-trust-the-major-parties-to-solve-the-housing-crisis/48a46d55-56d0-43da-b6dd-fa6d6f30bd09",
    "title": "Whoever leads Australia, readers say no solution to housing crisis",
    "publish_date": "Fri, 02 May 2025 08:42:46 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Exclusive: ﻿ Australians don't trust either major party's approach to solving the housing crisis, nine.com.au readers say.\n\nPeter Dutton and Anthony Albanese ﻿will face-off for the keys to the Lodge tomorrow, but voters are not confident either party leader will be able to rein in out-of-control housing prices.\n\nREAD MORE: Where to get your democracy sausage this election day\n\nA nine.com.au reader survey of over 500 participants* found almost 80 per cent of respondents did not believe ﻿Labor or the Coalition's election policies will help solve the housing crisis.\n\n'Voting for the same 2 parties will not change anything,\" a reader said.\n\nWhich issue will most influence your vote? Cost of living 7680 Housing 1181 Health 1003 Leadership 3660 Climate 560\n\nOne homeowner said the housing affordability crisis meant her three adult kids were still living at home, in turn costing her more money on groceries and bills.\n\n'Neither parties (sic) policy will do nothing to help the housing crisis, both are going to make it worse and pump it higher. It's ridiculous!,\" the respondent wrote.\n\nAnthony Albanese and Peter Dutton. (Nine)\n\n\"I would gladly cop a huge 50 per cent loss on property values as this would not affect me and my day-to-day life or income, but it would mean my kids can afford a home. Which is what I really want.\"\n\nDutton﻿'s \"super for housing\" policy would allow Australians to pull a maximum of $50,000 from their retirement accounts to help pay for house deposits.\n\nThe Coalition said it would also let first-time homeowners of newly built properties make mortgage interest payments tax deductible, which would save an average of $12,000 per year.\n\nLabor's solution to getting young people on the property ladder is a scheme that would allow most first homebuyers to buy a property with just a five per cent deposit, with the federal government guaranteeing a portion of the loan.﻿\n\nThe federal government said, if re-elected, it will also invest $10 billion into building 100,000 homes reserved just for first homebuyers to address the housing shortage.﻿\n\nWhen asked what topics had been absent from the campaign trail, respondents said politicians did not spend enough time discussing issues including cost of living, energy policies, homelessness and domestic violence.\n\nDespite heightening trade tensions and causing chaos on the stock markets, just 13 per cent of Nine readers said Trump's tariffs would impact their election votes.\n\n\"Trump's tariffs haven't done anything to my vote but the LNP using the MAGA Republicans hand-book did,\" another reader said.\n\nPrime Minister Anthony Albanese with partner Jodie Haydon with some sausages in Perth. (Getty)\n\nOn a lighter note, almost three-quarters of the ﻿group believe the humble democracy sausage should be eaten in a slice of bread, rather than a roll.\n\nSeveral respondents said the term should be abolished all together.\n\n﻿\"Democracy sausage. Stop embarrassing yourself Australia,\" one reader wrote.\n\nREAD MORE: Federal Election 2025 Results Tracker\n\n\"I hate the term democracy sausage; feels forced,\" another said.\n\n*The nine.com.au poll, which runs once a fortnight, canvases the views of the nine audience on 9Nation, which is an online community of our readers and viewers.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/nrl-magic-round-panthers-broncos-storm-raiders-titans-bulldogs/105241706",
    "title": "Live: Broncos insist there are 'no demons' playing Penrith despite poor recent record",
    "publish_date": "Sun, 04 May 2025 02:01:56 +0000",
    "category": "sports",
    "authors": [
      "Michael Doyle"
    ],
    "text": "The Brisbane Broncos come into this afternoon's clash with the Penrith Panthers with plenty of momentum.\n\nThe Broncos whacked the previously unbeaten Bulldogs last weekend, while Penrith entered Magic Round last on the NRL ladder.\n\nBut the Panthers have won the previous four premierships, and Brisbane have won just one of their previous nine meetings.\n\nBrisbane Broncos winger Jesse Arthurs. (Getty)\n\nThat includes the 2023 grand final, where Penrith came from 16 points down in the second half to win the third of their four-peat.\n\nBrisbane winger Jesse Arthurs insists his team would be treating this match like any other, following training yesterday.\n\n\"No demons, no, no demons,\" Arthars said.\n\n\"The demons are out there (on the training field) doing conditioning.\"\n\nDespite the club's poor recent record, coach Michael Maguire, who took over this season, says it is irrelevant to him.\n\n\"That's history, but for us, we would like to think we are a little different now,\" Maguire said.\n\n\"What we have shown the last few months, when we are capable of playing the way we want to play, we can mix it with the best.\"\n\nABC/AAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/victoria-post-federal-election-liberal-labor/105249792",
    "title": "Liberals contend with ‘urban Australia’ issue amid Melbourne wipeout",
    "publish_date": "Sun, 04 May 2025 00:18:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ousted one-term Liberal MP from Melbourne's east, Keith Wolahan, has called on his party to focus on urban Australians after a resounding electoral loss in Victoria and across the nation.\n\nMr Wolahan, who held one of the party's few metropolitan Melbourne seats, has lost his seat to Labor's Gabriel Ng.\n\n\"It was clear our party has an issue with people in urban Australia, which is where most people live,\" he told the ABC's Insiders program on Sunday.\n\n\"We need to turn our mind to that like we never have before.\"\n\nMr Wolahan said holding the seat for three years was the honour of his life but he stopped short of officially conceding defeat.\n\nThe Liberal Party has been reduced to a handful of seats across the Melbourne region, with Opposition Leader Peter Dutton's goal to attract votes from outer suburban Victorian voters having failed.\n\nPrime Minister Anthony Albanese's landslide election victory on Saturday night has delivered Labor swings across the country, not least in Victoria, where the Liberal Party had high electoral hopes.\n\n\"We need to acknowledge the cities that we live in, not the cities that we used to live in, or think we live in,\" Mr Wolahan said.\n\n\"Because there's a lack of metropolitan members in the party room, I think we need the rural and regional members — who I have great respect for and I admire them and they have done an amazing job — to put themselves in the shoes of Australians who live in an urban area.\n\n\"We can't just go off perception, we have to go off the perspective of someone else\"\n\nMr Wolahan said he hoped the Liberal Party's electoral review would be \"serious\" and \"comprehensive\".\n\nAnother key upset for the Liberals has occurred in the eastern Melbourne electorate of Deakin, where MP Michael Sukkar has lost his seat to a more than 4 per cent swing to Labor's Matt Gregg.\n\nThe Liberals are also facing disappointment in the seat of Aston in Melbourne's east.\n\nThe formerly safe Liberal seat turned red in a surprise win for Labor's Mary Doyle at a 2023 by-election, and it appears she has once again triumphed, with Liberal hopeful Manny Cicchiello trailing behind.\n\nLiberal MP for the seat of Wannon in the state's west, Dan Tehan, said on Saturday evening his party would have to have a \"root and branch look at everything that's occurred\".\n\nPremier ties federal Labor's success to state issues\n\nVictorian Premier Jacinta Allan said the election results were an emphatic win for the broader Labor movement and the nation.\n\nShe said voters had recognised Labor's focus on working families, road and rail infrastructure and construction projects.\n\n\"The results yesterday, they're not despite what's going on here in Victoria, they're because of what's going on here in Victoria — that focus on building, on homes, on Airport Rail, Suburban Rail Loop, that focus on families in their hospital and education care, and the focus on providing meaningful cost of living support.\n\n\"Victorians know that that's what we stand for, Victorians know that's what federal Labor stands for and they also know that in Anthony Albanese and in my government, we will fight for them every single day.\"\n\nBut the seat of Bendigo — the premier's hometown — is piquing interest as its result bucks the broader trend in Labor’s favour.\n\nThere are an estimated 1290 votes between sitting MP Lisa Chester, who had held the seat at a margin of 11.9 per cent, and Nationals candidate Andrew Lethlean.\n\nIn Kooyong in the city's inner east, teal independent Dr Monique Ryan has retained her seat off Liberal hopeful Amelia Hamer with a clear win.\n\n\"We've been able to, in three years, I think, put together a body of work which has shown the community of Kooyong that it's worth having independent representation,\" she told her supporters on Saturday night.\n\nVictorian seats in doubt\n\nThe seat of Wills, in Melbourne's north, remains tight with Labor's Peter Khalil in the lead.\n\nThe Greens were hopeful of picking up the seat with the help of the profile of former Victorian party leader Samantha Ratnam.\n\nSema, a Wills voter, told the ABC on Sunday morning the election result was \"a really strong statement from the country\".\n\nShe said the result was a response to \"Trump-style politics happening elsewhere\".\n\n\"I don't think anyone expected the landslide,\" Sema said.\n\n\"I think people maybe thought a minority government. So I'm incredibly proud\".\n\nThe neighbouring seat of Melbourne remains too close to call due to a 5 per cent swing towards Labor.\n\nMelbourne MP and national Greens leader Adam Bandt is slightly ahead of Labor's Sarah Witty with about two-thirds of votes counted.\n\nIn Goldstein in Melbourne's inner south, incumbent teal independent MP Zoe Daniel celebrated success on Saturday night but Liberal rival Tim Wilson has not yet conceded defeat.\n\n\"The Liberal Party threw everything at us … and we are standing here to celebrate,\" she told her supporters to rapturous applause.\n\nThe ABC vote count indicates a win for Ms Daniel is likely, however, there are more than 20,000 votes yet to be counted.\n\nGoldstein independent MP Zoe Daniel claimed victory on Saturday night, however her Liberal rival Tim Wilson has not yet conceded defeat. (ABC News: Danielle Bonica)\n\nIn the seat of Flinders on the Mornington Peninsula, the AEC abandoned its Liberal-Labor preference count to look at preferences between Liberal MP Zoe McKenzie and independent Ben Smith, which remain on a knife edge.\n\nThere are 15 vote-counting centres in Victoria, with counting set to resume on Sunday morning.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/freezer-friendly-dinners-for-meal-prep/105161486",
    "title": "Freezer-friendly meals to help you get ahead",
    "publish_date": "Sun, 04 May 2025 00:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Life is busy and it always helps to have a few meals in the freezer.\n\nHere are five that are suitable for freezing, which taste just as good on the reheat as they do cooked fresh.\n\nIf you can, make the stew the day before and rest in the fridge for maximum flavour. (ABC News: Heidi Sze)\n\nThis fall-apart beef stew includes a healthy amount of sweet potato, so there's no need to make extra veggies when it comes time to serve. Enjoy over couscous, or with a chunk of buttered bread.\n\nChilli can be made ahead of time and freezes well, too. (ABC Everyday: Hetty Lui McKinnon)\n\nThere are so many ways to enjoy this vegetarian chilli, which is made from mostly tinned ingredients. Top it with avocado, sour cream, grated cheese and a squeeze of lime and use the leftovers to make nachos. One batch will feed six.\n\nThe ingredients I've used here are purposefully basic and pantry-friendly. (ABC News: Hetty Lui McKinnon)\n\nBolognese is a classic freezer meal and this vegetarian version hits many of the same flavour notes, only without the meat. It's cooked low and slow to build flavour and feeds six.\n\nThis warming chicken stew includes plenty of veggies. (ABC News: Heidi Sze)\n\nStock your freezer with this simple and filling meal, which includes plenty of veggies. Serve it over rice or your favourite grain. It can also be enjoyed as a soup-like meal with plenty of coriander and fresh lime juice.\n\nA pumpkin soup with a kick that's topped with coconut milk, fresh coriander and spicy roast cashews. (ABC News: Hetty McKinnon)\n\nRed curry paste adds spice and flavour to this pumpkin soup, which is finished with coconut milk. While the soup is reheating, make the roast curry cashews in the oven for added crunch.\n\nTips for freezing and defrosting food",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/octogenarian-embarks-on-trek-to-mount-everest-base-camp/105182422",
    "title": "80yo woman takes on 17-day hike to Everest base camp",
    "publish_date": "Sat, 03 May 2025 21:28:01 +0000",
    "category": "sports",
    "authors": [],
    "text": "At the age of 80, Carolyn Robinson has embarked on a 17-day trek to reach Mount Everest's South Base Camp.\n\nMs Robinson, from Berry on the New South Wales south coast, isn't letting age get in the way of her accomplishments.\n\n\"It was never on my bucket list, but this is an opportunity that I couldn't let go by because I love to experience other countries and their cultures,\" she said.\n\n\" The challenging 17-day trek is something I will never ever forget, and it will change my life. \"\n\nShe is among 13 Australians, including her neighbour Laurelle Price, 74, who have set off on the hike, a 130-kilometre round trip, in Nepal.\n\nMs Price and Ms Robinson keep fit by walking to Drawing Room Rocks, 600 metres above sea level, in NSW. (ABC Illawarra: Sarah Moss)\n\nThe adventurers have an average age of 67 and are all members of Rotary.\n\nThey aim to walk about 8 to 10 kilometres a day on the trek and will reach base camp at 5,364 metres above sea level.\n\nThe route for the group's Everest base camp trek. (Supplied: Goutam 1962)\n\nAn 'OBE'\n\nKen Hutt (right) with Ms Price in the Himalayas in 2019. (Supplied: Laurelle Price)\n\nThe trekking group's leader Ken Hutt said if Ms Robinson reached South Base Camp she could be the oldest woman to do so.\n\n\"Almost without doubt Carolyn Robinson will be the oldest female to accomplish this trek,\" he told the ABC.\n\nTrekking permits show the oldest woman to reach base camp is Eiko Funabashi, 78, from Japan, who unsuccessfully attempted to reach the summit four times between 2006 and 2018.\n\n\"If Carolyn manages to be successful in the trek, she will be the oldest ever in history to reach base camp of Everest — an incredible feat,\" Mr Hutt said.\n\nIf Ms Robinson reaches base camp, she could be the oldest woman to do so. (ABC Illawarra: Sarah Moss)\n\nMs Robinson, who was born in 1945, said she was now on the wrong side of 80.\n\n\"That's what they call an OBE, over bloody 80,\" she laughed.\n\n\"I believe everything in life happens for a reason, you don't always know what the reason is, but there's always a reason.\"\n\nPreparation is key with well-fitting walking boots an absolute must. (ABC Illawarra: Sarah Moss)\n\nFight to eradicate polio\n\nThe trekkers are Rotary members and Mr Hutt says participants have raised $50,000 to help efforts to eradicate polio worldwide.\n\nAll but two countries, Afghanistan and Pakistan, have been declared free of the infectious disease that can, in rare cases, cause paralysis.\n\n\"Across the world, Rotary International, with the help of UNICEF and the World Health Organization, have pledged to eradicate polio,\" Mr Hutt said.\n\n\"But our main function is to create awareness by talking to governments and raising funds.\"\n\nThe cause is a big reason why Ms Robinson decided to take on the challenge.\n\n\"This trip would not be happening, and I would not be doing it, if it wasn't for the fundraising aspect,\" she said.\n\nAcclimatising to higher altitude\n\nAfter spending two nights in Nepal's capital Kathmandu, the trekkers began their hike in Lukla and will take a route to South Base Camp via Gokyo Lakes.\n\n\"We fly from Kathmandu to Lukla, which is apparently the most dangerous airstrip in the world because it's curved,\" Ms Robinson said.\n\nThe fastest way to reach Lukla airport is by taking a domestic flight from Kathmandu. (Supplied: Laurelle Price)\n\nThe dangers of altitude sickness and how to avoid it Photo shows A snow-covered mountain seen past lower hills. For many adventurers, the attraction to breathtaking views on top of towering mountains is irresistible, but doctors are urging climbers to be aware of the dangers associated with altitude.\n\nThen they walk around Gokyo Lake and over three high mountain passes.\n\nStaying for two nights in some places, the group do acclimatisation walks where they go up 3 or 400 metres, then go back down and sleep lower.\n\nThe higher altitude makes each breath more laboured as oxygen decreases.\n\n\"It's not necessarily how fit you are, it's your ability to cope with the acclimatisation,\" Ms Robinson said.\n\nAlong the route to South Base Camp are tea houses where hikers stay the night. (Supplied: Laurelle Price)\n\nSlow and steady\n\nIn preparation, Ms Robinson has been regularly climbing Woodhill Mountain near Berry, an intermediate grade walk that is 4.5km return.\n\nShe also attended an altitude training centre in Sydney.\n\n\"You train in a room with altitude conditions of 3,500m, that gets you used to doing strenuous workouts with less oxygen,\" Ms Robinson said.\n\n\"You've got to watch out for headaches. Apparently, if you start getting headaches and start feeling nauseous, that's not good.\"\n\nLoading...\n\nThe octogenarian is exceptionally motivated to make it to Kala Patthar near South Base Camp where you can take in views of Mount Everest and surrounds.\n\nMs Price has been hiking up Woodhill Mountain with Ms Robinson ahead of their trek.\n\nIn 2019 Ms Price hiked a shorter route to South Base Camp. (Supplied: Laurelle Price)\n\nLast year, at 74, Ms Price was recognised as the oldest woman to complete the Kokoda Track.\n\n\"I've been climbing to Drawing Room Rocks [near Berry] for probably 12 months because I had some trips overseas last year and I did Kokoda as well, so I just continued throughout the year,\" Ms Price said.\n\nMs Price is looking forward to reaching base camp a second time. (Supplied: Laurelle Price)\n\nShe completed a shorter route to South Base Camp in 2019 and is looking forward to immersing herself in the Himalayas and vibrant Sherpa culture once again.\n\n\"The walking is slow and steady; a nice, even walk so you can conserve energy especially in higher altitude,\" Ms Price said.\n\n\"It's just one step after the other and you take a rest all the time because you struggle for air more as it's only 50 per cent oxygen when you're at base camp.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/diamond-league-shanghai-sarah-billings-800m/105249766",
    "title": "Aussie Billings just misses national 800m record in Shanghai",
    "publish_date": "Sat, 03 May 2025 21:14:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sarah Billings has narrowly missed breaking the Australian women's 800 metres record as she enjoyed another breakthrough performance at the Shanghai Diamond League meet.\n\nFollowing her third place in the 1,000m at the Xiamen leg of the Diamond League circuit last weekend, Billings finished second in the 800m on Saturday.\n\nShe clocked a personal best of 1 minute and 57.83 seconds as she chased home Ethiopian winner Tsige Duguma (1:56.64).\n\nBillings's time was just 0.05 outside Catriona Bisset's national mark of 1:57.78, set in London six years ago.\n\n\"I couldn't be happier,\" Billings said after the race.\n\nAussie Patterson second at Diamond League opener Photo shows Eleanor Patterson competing in the high jump at the 2025 Maurie Plant Meet. Australian high jumpers Eleanor Patterson and Nicola Olyslagers secure top-three finishes at the Xiamen Diamond League meet, while sprinter Lachlan Kennedy places fifth in 100m.\n\n\"I've been picked for the world championships in the 1,500m already, so that's still the main goal.\n\n\"But that was pretty close to the national record, so I'm really happy.\"\n\nBillings was not the only Australian to reach the podium.\n\nNicola Olyslagers and Eleanor Patterson finished second and third respectively behind Ukraine's Olympic champion and world record holder, Yaroslava Mahuchikh, in the women's high jump.\n\nOlyslagers cleared 1.98m on her second attempt to finish ahead of Patterson (1.95m) but Mahuchikh's 2.00m clearance again put her on top\n\nMahuchikh won ahead of Patterson and Olyslagers in Xiamen.\n\nSweden's Olympic and world champion Armand Duplantis soared 6.11m to win the men's pole vault.\n\nAustralian Kurtis Marschall cleared 5.72m to claim fourth place.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/f1-miami-grand-prix-oscasr-piastri-lando-norris-sprint/105241722",
    "title": "Piastri suffers 'cruel' fate at Miami GP, new dad Verstappen takes pole",
    "publish_date": "Sat, 03 May 2025 21:07:54 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's F1 world championship leader Oscar Piastri will start fourth on the grid at the Miami Grand Prix, having earlier been frustrated by his second-place finish in the sprint race.\n\nRed Bull's reigning world champion Max Verstappen claimed pole position ahead of Piastri's McLaren teammate Lando Norris after topping qualifying.\n\nPiastri defends teammate Norris Photo shows Oscar Piastri and Lando Norris pose for a photograph together. Oscar Piastri leaps to the defence of Lando Norris after ex-Formula 1 world champion Alan Jones suggests the Briton lacks mental toughness.\n\nMercedes rookie Kimi Antonelli qualified third fastest, with Piastri completing the second row.\n\nIn the rain-hit sprint race that preceded the qualifying session, Piastri had been controlling proceedings until a late safety car gifted victory to Norris.\n\nOnly 14 of the original 19 laps were raced.\n\nPiastri had looked set to increase his championship advantage on the wet circuit as he sped into the lead on the first corner.\n\nHe was still clear with four laps remaining, only to pit at the most inopportune moment for slick tyres on a rapidly drying track.\n\nNorris was called in immediately afterwards, but the safety car was then deployed after Fernando Alonso crashed his Aston Martin into the wall.\n\nThat meant Piastri had to slow and could not regain his lead.\n\nIt gave Norris a badly needed victory and reduced his deficit behind Piastri in the championship by one point to nine.\n\nPiastri (left) was runner-up to Lando Norris (second from left) in the sprint race. (Getty Images: Hector Vivas)\n\n\"I don't think I'm going to be buying a lottery ticket around this place,\" said Piastri, who finished second.\n\n\"I feel like I did everything right so a bit disappointed to come in second.\n\n\"But that's that's how it goes sometimes. Unfortunately, racing's a pretty cruel business so, hopefully, that means I get the luck for this afternoon and tomorrow. But another great start and I'm happy with what I did.\"\n\nThe main race in Miami will be held on Monday morning AEST.\n\nABC Sport will be live blogging the Miami F1 Grand Prix on Monday morning AEST\n\nPiastri had another superb start, just as he did in beating Verstappen to the first corner in his Saudi Arabian Grand Prix win.\n\nThis time, he outpaced the youngest-ever F1 pole-sitter, 18-year-old Antonelli.\n\nAntonelli complained Piastri had pushed him off the track unfairly with his surge up the inside, but stewards disagreed and took no further action.\n\nVerstappen, who had originally finished fourth behind Lewis Hamilton, was demoted to 17th and last after Red Bull received a 10-second penalty for an unsafe pit-lane release.\n\nHis car collided with the unfortunate Antonelli, who ended up 10th.\n\nWith the track having dried out for qualifying, Piastri had been flying in Q2, setting the fastest lap of all in 1 minute and 26.269 seconds.\n\nBut he could not match that in the final session, clocking only 1:26.375, which was bettered by Verstappen (1:26.204), Norris (1:26.269) and Antonelli (1:26.271).\n\nVerstappen is racing in Miami only days after he and his partner Kelly Piquet welcomed their first child, a daughter named Lily.\n\n\"He's walking a step higher,\" said Verstappen's team boss Christian Horner.\n\n\"But we see time and time again, when he crosses that line into the garage and puts his helmet on, everything disappears. His ability to focus and deliver is insane.\n\n\"It's really truly impressive.\"\n\nAlpine's under-pressure Australian Jack Doohan finished 16th in the sprint and later out-qualified teammate Pierre Gasly for the first time to take 14th spot on the grid.\n\nAAP/Reuters",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/mallee-land-clearing-conservation-foundation-endangered-species/105098584",
    "title": "Conservation foundation alleges illegal land clearing on NSW properties",
    "publish_date": "Sat, 03 May 2025 20:31:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Australian Conservation Foundation is accusing farmers and landholders of illegally clearing thousands of hectares of land in south-west New South Wales.\n\nThe foundation said that based on satellite images, about 5,500 hectares of land — roughly the size of 550 football ovals — was cleared on seven properties without permits between 2021 and 2025.\n\nNational nature campaigner Jess Abrahams said the clearing was concerning due to vulnerable species in the area.\n\n\"These are habitats for some of our most endangered bird species such as the malleefowl, the pink cockatoo and the southern white face,\" Mr Abrahams said.\n\n\"This bushland is critical for their survival.\"\n\nBefore: A NSW property in 2021. . . After: The same property in 2024. . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE A NSW property in 2021. / The same property in 2024.\n\nMr Abrahams said the south-eastern long-eared bat also relied on the habitat.\n\n\"This land clearing, fragmentation and degradation is the greatest threat to this bushland scientists have identified,\" he said.\n\n\" It's a death by a thousand cuts. \"\n\nA spokesperson for the federal Department of Climate Change, Energy, Environment and Water said it was aware of the allegations but could not comment due to \"ongoing enquiries\".\n\nThe malleefowl is under threat from habitat clearing. (Supplied: Australian Conservation Foundation)\n\nLaws 'not very effective'\n\nUniversity of Queensland's professor of environmental management Martine Maron said current laws were not strong enough to curb illegal land clearing.\n\n\"We do know the laws are not very effective in terms of reducing land clearing to an acceptable level but we're still accumulating really large deficits,\" Dr Maron said.\n\n\"A lot more land is being cleared than grown back or restored which is unusual for a wealthy, developed country like ours.\n\n\"It is actually very unclear for a lot of people what the laws are meant to apply to and often there are multiple different laws which might apply to a particular piece of land.\"\n\nBushland is critical to the survival of pink cockatoos. (Supplied: Australian Conservation Foundation)\n\nAccording to the most recent data from the federal government's National Greenhouse Gas Accounts, 164,500 hectares of land was cleared nationally in 2022–23.\n\nUnder national environment law, land clearing without a permit where it can affect a \"matter of national environmental significance\", such as an endangered species, can lead to maximum penalties of $16.5 million or imprisonment of up to seven years.\n\nIn NSW, the maximum penalty for intentional land clearing is $5 million for a corporation and $1 million for an individual.\n\nWill a new environmental regulator do the trick to stop illegal land clearing? Photo shows An aerial view showing black cattle grazing in a bare paddock near a fallen tree Environmental powerhouse, or toothless tiger? Michael Slezak looks at the impact of a proposed federal regulator, in light of how land clearing is managed in Australia.\n\nAccording to the Environmental Defenders Office, proving an offence beyond reasonable doubt can be \"difficult to do, so it is more common for regulators to issue Penalty Infringement Notices (PINs) for less serious offences\".\n\nThe maximum penalty for a PIN is $15,000 for a corporation or $5,000 for an individual.\n\nDr Maron said education and effective enforcement were needed to reduce clearing rates.\n\n\"A lack of awareness and appropriate penalties are all missing pieces of the puzzle,\" she said.\n\n\"Achieving a shift really involves working with the people who are managing the land.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/warren-buffett-announces-shock-retirement-plan/105249698",
    "title": "Warren Buffett announces plans to retire this year",
    "publish_date": "Sat, 03 May 2025 20:19:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Billionaire investor Warren Buffett has shocked an arena full of his shareholders by announcing that he wants to retire at the end of the year.\n\nMr Buffett said he would recommend to Berkshire Hathaway's board that Greg Abel should become CEO at the end of 2025.\n\n\"I think the time has arrived where Greg should become the chief executive officer of the company at year end,\" he said on Saturday.\n\nGreg Abel, centre, has been named by the 94-year-old Mr Buffett as his preferred successor to become the Berkshire Hathaway CEO. (AP: Josh Funk)\n\nMr Abel has been Mr Buffett's designated successor for years and he already manages all of Berkshire's non-insurance businesses, but it was always assumed he wouldn't take over until after Mr Buffett's death.\n\nMr Buffett's success, coupled with his ability to explain his thinking in clear soundbites, has made him highly influential in the business and financial communities, earning him the nickname \"The Oracle of Omaha\".\n\nThe 94-year-old billionaire announced the news at the end of a five-hour question-and-answer period and didn't take any further questions about the revelation.\n\nHe said the only board members who knew the move was coming were his two children, Howard and Susie Buffett. Mr Abel — who was sitting next to Buffett on stage — was given no warning.\n\nBill & Melinda Gates Foundation will lose its biggest donor in death Photo shows An elderly white man wearing a suit and red tie walks next to several microphones The billionaire investor and philanthropist's donations to the world's largest private charity, begun by the Microsoft founder and his former wife, will end with his death.\n\nMr Buffett also added that he believed the board of directors would be \"unanimously in favour of\" his recommendation.\n\nAbout an hour later, Mr Abel came out to oversee the formal Berkshire business meeting without Mr Buffett, and he addressed the announcement.\n\n\"I just want to say I couldn't be more humbled and honoured to be part of Berkshire as we go forward,\" he said.\n\nMr Buffett transformed Berkshire Hathaway from a medium-sized textile company when he bought it in the 1960s into a giant conglomerate, now valued at more than $US1 trillion ($1.54t) and with liquid assets of $US300 billion.\n\nShareholders queued outside Omaha's CHI Health Center before attending Berkshire Hathaway's annual meeting. (AP: Rebecca S Gratz)\n\nThe company on Saturday reported first-quarter profits of $US9.6 billion, down 14 per cent. That works out to $US4.47 per share, also down sharply.\n\nMr Buffett's net worth as of Saturday is $US168.2 billion, according to Forbes magazine's real-time rich list.\n\nAnalysts expect Abel to do well at Berkshire helm\n\nMany investors have said they believed Mr Abel would do a good job running Berkshire, but it remained to be seen how good he would be at investing Berkshire's cash.\n\nMr Buffett also endorsed him on Saturday by pledging to keep his fortune invested in the company.\n\nAnalysts issue warning as more Australians dive into Wall Street Photo shows person who is blurred walks in front of the new york stock exchange, sign says wall street Analysts point to optimism about the US economy, but much will ride on decision made by incoming US president-elect Donald Trump, and the direction of interest rates both here in Australia and overseas.\n\n\"I have no intention — zero — of selling one share of Berkshire Hathaway. I will give it away eventually,\" Mr Buffett said.\n\n\"The decision to keep every share is an economic decision because I think the prospects of Berkshire will be better under Greg's management than mine.\"\n\nThousands of investors in the Omaha arena gave Mr Buffett a prolonged standing ovation after his announcement in recognition of his 60 years leading the company.\n\nCFRA research analyst Cathy Seifert said it had to be hard for Mr Buffett to reach this decision to step down.\n\n\"This was probably a very tough decision for him, but better to leave on your own terms,\" Ms Seifert said.\n\n\" I think there will be an effort at maintaining a 'business as usual' environment at Berkshire. That is still to be determined. \"\n\nIn many respects, Mr Abel has already been running much of the company for years, but he hasn't been managing Berkshire's insurance operations or deciding where to invest all of its cash.\n\nHe will now take those tasks on, but vice-chairman Ajit Jain will remain to help oversee the insurance companies.\n\nInvestment manager Omar Malik of Hosking Partners in London said before Mr Buffett's announcement that he wasn't worried about Berkshire's future under Mr Abel.\n\n\"Not really [worried]. He's had such a long time alongside Warren and a chance to know the businesses,\" Mr Malik said.\n\nCole Smead of Smead Capital Management said he wasn't surprised Mr Buffett was stepping down after watching him on Saturday because the 94-year-old wasn't as sharp as in past years.\n\nAt one point, Mr Buffett made a basic mathematical mistake in one of his answers. At other points, he got off-track while telling stories about Berkshire and his investing without answering the question he was asked.\n\nMr Abel is well-regarded by Berkshire's managers and Mr Buffett has praised his business acumen for years.\n\nAnalysts expect, however, that he will have a hard time matching the billionaire's legendary performance, in part because he doesn't control 30 per cent of Berkshire's stock like Mr Buffett does and therefore won't have as much leeway.\n\n\"I think the challenge he's going to have is if anyone is going to give him Buffett or [former vice-chairman Charlie] Munger's pass card? Not a chance in God's name,\" Mr Smead said.\n\nMr Buffett has said that Mr Abel might even be a more hands-on manager than he is and get more out of Berkshire's companies.\n\n\"I think we'll get a more hands-on manager and that could be a good thing,\" said Steven Check, who runs Check Capital Management.\n\nAP/AFP",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-04/federal-election-tasmania-double-digit-swing-to-labor/105247118",
    "title": "When the music stopped in Tasmania, the Liberals were left without a seat",
    "publish_date": "Sat, 03 May 2025 20:02:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "There was shock on the ABC election panel when the results started coming in.\n\n\"Remarkable\" and \"extraordinary\" were some of the words used to describe what was happening in Tasmania on election night.\n\nIt was something no-one saw coming — not the Liberals who thought they would defend their own seats and maybe, just maybe, pick up one, and not even Labor dared dream it would go this well.\n\nBut when the music stopped, the Liberals were left without a single seat and a lot of questions to answer.\n\nLabor MP Julie Collins (centre) cheers at the Labor Party function at Bellerive Yacht Club. (ABC News: Maren Preuss)\n\nLet's wind back a bit first. To that weird pseudo campaign period.\n\nGoing into the election there was a general feeling that the traditionally Liberal-supporting electorates of Bass and Braddon would likely stay blue, although it was a bit of a never-say-never vibe.\n\nCertainly there was consideration that Labor might just sneak across the line in Braddon due to well-known former Labor senator Anne Urquhart taking on lesser-known Liberal candidate Mal Hingston.\n\nLabor mounted a successful campaign with Ms Urquhart switching from the Senate to the lower house. (ABC News: Mackenzie Heard)\n\nAnne Urquhart stepped away from a federal upper house seat to contest the seat of Braddon. (ABC News: Jordan Young)\n\nAt 1.4 per cent, Bass was always very marginal, but there was a sense the Liberals' Bridget Archer stood a chance based purely on her personal popularity.\n\nAs for Lyons, it was viewed as a close contest between the Liberals' Susie Bower and former state leader Rebecca White. Although many believed Ms White would manage to retain the seat.\n\nBut Labor didn't just sneak across the line, they steamrolled the Liberal candidates with huge swings in each of those three electorates, far larger than the national average.\n\nThree swings of more than 10 per cent.\n\nWith Labor likely claiming four seats and Andrew Wilkie the fifth, it means there won't be a spot of blue on that map of Tasmania.\n\nSo, what happened?\n\nIs Labor just fantastically popular on the island state? Its state counterparts aren't.\n\nAre the Liberals on the nose or was there something else at play?\n\nLet's start with the salmon factor.\n\nAlbanese plants pro-jobs flag on salmon issue\n\nShortly before the election, Prime Minister Anthony Albanese quickly passed law changes aimed at protecting salmon jobs. (ABC News: Glenn Dickson)\n\nIt was an issue that played out across the state in different ways.\n\nIn the south there was a groundswell of community opposition in the wake of a mass mortality event that saw fat globules washing up on south-eastern Tasmanian beaches.\n\nTasmanian salmon have been dying in a mass mortality event. (Supplied: Bob Brown Foundation)\n\nProtesters gathered at beaches and on parliament lawns as they urged others to \"vote salmon out\" with an anti-salmon farming candidate challenging Labor MP Julie Collins.\n\nBut at the other end of the state there was a perception the Albanese government was \"anti-worker\" and had left the industry in uncertainty, as the federal environment minister worked out whether she needed to review salmon farming operations on the state's west coast.\n\nOn the precipice of calling the election, Mr Albanese took decisive action and moved to amend the nation's environment laws to create a carve out for the salmon industry at Macquarie Harbour.\n\nAssessment of fish farming in Macquarie Harbour still 'active' Photo shows Aerial view of salmon pens and boat in coastal waterway. The future of salmon farming in Macquarie Harbour is still under \"active\" assessment by the federal government, despite the passing of laws designed to nullify the issue.\n\nIt infuriated environment groups who gathered at Canberra Parliament House to voice their opposition.\n\nIt was a gamble, given the salmon industry only accounts for 120 jobs in that area.\n\nBut it was always about much more than those few jobs, it was signalling to workers across the country that the party was pro jobs.\n\nAnd it paid off.\n\nBut in the south, the anti-salmon vote ate into the Labor stronghold of Franklin with a decent swing against Labor, in favour of anti-salmon campaigner independent Peter George.\n\nAnti-salmon farming campaigner Peter George is second on first preference votes in the seat of Franklin. (ABC News: Meg Whitfield)\n\nConsidering it was Labor's only non-marginal seat in Tasmania going into the night and by the end it was the only one that hadn't been called, the party might be smart to heed the warning.\n\nThere was another 'anti-factor' in play across the state though.\n\nThe other, worked in Labor's favour. The anti-Dutton factor.\n\nTasmanians didn't warm to Peter Dutton, who lost his own Queensland seat on election night. (ABC News: Matt Roberts )\n\nAntony Green set the gold standard for election analysis Photo shows ABC election expert Antony Green smiles at the camera with his hands clasped behind his back. Antony Green has covered every single state and federal election that I have been alive for. He makes it all seem effortless. But I know how hard he's worked to be ready for May 3.\n\nWhen the rest of the country went red last election, Tasmania bucked the trend. The northern electorates stayed blue and the Liberals' Susie Bower very nearly stole Lyons from Labor, leaving it on a margin of 0.9 per cent.\n\nTurns out Tasmanians, in particular those in the electorate of Bass, were Scott Morrison fans. That didn't translate to Peter Dutton.\n\nIn fact, the feedback door-knocking candidates regularly got was that they really didn't like Mr Dutton and at times that was enough to flip their vote.\n\nAnd both major parties knew it. Labor even played on it. Reminding people that if they voted for the well-liked Bass Liberal MP Bridget Archer, they'd ultimately get Mr Dutton.\n\nThe Liberals' Bridget Archer lost her seat. (ABC News: Jonathan Mcnee)\n\nState Liberals on the nose\n\nBut perhaps the former opposition leader isn't the only one Tasmanian voters were punishing.\n\nThe state Liberals are limping on in minority government in their fourth term.\n\nAnd it's pretty easy to come up with a list of things that are starting to really irk Tasmanians — the economy, the health system, that time they organised two brand new Spirit of Tasmania ferries but didn't get around to building a berth.\n\nAnd then there's the stadium.\n\nTasmanian Liberal Premier Jeremy Rockliff has hitched his legacy to building an AFL stadium in Hobart. (ABC News: Luke Bowden)\n\nThe proposed AFL stadium on Hobart's waterfront at Macquarie Point is almost entirely a state issue. There's of course the matter of federal funding but that's technically tied to the precinct.\n\nSure the stadium has its supporters, but if the polls are anything to go by, far more people oppose it, particularly those in the northern half of the state.\n\nPeople are furious, but that's not stopping the state Liberal government, who appear determined to see it built no matter what.\n\nYes, this is a state issue, but when you ask a Tasmanian about what they care about this election, it often crops up.\n\nCould it be that the federal Liberals have copped some of the backlash intended for their state counterparts?\n\nThe result was even better than some in Labor predicted. (ABC News: Maren Preuss)\n\nIn the end though they only have themselves to blame and as far as they're concerned, the picture isn't pretty.\n\nIn Bass, the Liberals have lost a well-liked MP to a lesser-known Labor candidate.\n\nRebecca White has not only defended Lyons for Labor, but increased the party's margin.\n\nFormer state Labor leader Rebecca White made to switch to federal politics, nabbing the seat of Lyons. (ABC News: Maren Preuss)\n\nAnd the only seat the Liberals held that wasn't marginal has been well and truly claimed by Ms Urquhart.\n\nWhatever the reason for the Liberal wipe-out, and there are no doubt a myriad of factors, the Liberals are going to have a lot of lessons to learn if they want to have a presence in the state again.\n\nAnne Urquhart celebrates her election win at an event in Ulverstone. (ABC News: Jordan Young)",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/politics/federal/federal-election-results-2025-live-updates-australia-seats-albanese-dutton-20250503-p5lwbi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election results 2025 LIVE updates: Albanese remains PM in Labor landslide; Dutton loses his seat to Ali France",
    "publish_date": "Sun, 04 May 2025 12:04:45 +1000",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "The ABC’s election coverage dominated television screens across the country on Saturday night as Labor swept to a landslide majority.\n\nThe public broadcaster was by some distance the most popular choice for Australians to watch the results come in despite some technical glitches for chief elections analyst Antony Green, with its broadcast on Saturday evening reaching more than four million people.\n\nAntony Green sits on the ABC election set ahead of what he said was his last election. Credit: Dominic Lorrimer\n\nIts programming between 8.30-10pm was the most viewed of the evening, with an average audience of 2.36 million, however its average audience remained steady around two million across the night.\n\nNetwork Seven’s coverage was the second most popular, its results broadcast reaching 2.78 million people; however, it had an average audience of 580,000, significantly lower than the ABC’s.\n\nNine’s coverage reached 2.42 million, with an average audience of 527,000 watching the results roll in. Network 10’s coverage, while reaching 1.74 million people, had an average audience of just 97,000, while Sky News Regional’s average viewership was 68,000.\n\nReach describes the total number of unique viewers having watched a program for at least one minute, while average describes the average audience watching across the length of the program on broadcast and streaming platforms, such as ABC iview and 9Now.",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/joe-montemurro-to-coach-matildas-graham-arnold-to-coach-iraq-20250504-p5lwdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Joe Montemurro to coach Matildas, Graham Arnold to coach … Iraq?",
    "publish_date": "Sun, 04 May 2025 11:55:31 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Football Australia’s long-running search for the next Matildas coach is drawing to an end, with Joe Montemurro set to be appointed - while former Socceroos boss Graham Arnold is reportedly in line for a shock move to Iraq.\n\nMontemurro has been FA’s top target in their eight-month hunt for a permanent successor to Tony Gustavsson, a process which has been so protracted that players have expressed their concern about “wasting time” and feeling in “limbo” ahead of their home Asian Cup campaign next year.\n\nBut the wait may be worth it. Network 10 commentator Andy Harper, speaking on Saturday night’s A-League Men coverage, claimed that Montemurro - who has been in charge of leading French club Olympique Lyonnais since June - was “locked in” and would be unveiled in the coming days or weeks.\n\nSources contacted by this masthead, who were not authorised to speak publicly about the courting of an under-contract coach, were not quite so definitive, but said that it was inevitable that FA would get their man, and that a formal agreement was close to being reached.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/national/pundits-predictions-and-punchlines-the-best-of-election-night-tv-20250504-p5lwd9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pundits, predictions and punchlines; the best of election night TV",
    "publish_date": "Sun, 04 May 2025 11:49:53 +1000",
    "category": "finance",
    "authors": [
      "Michelle Cazzulino"
    ],
    "text": "To its accidental credit, Seven got the tone right for Coalition supporters, offering up something called a Situation Room, and a so-called “election needle”. Liberal senator Jane Hume, who looked inclined to enter one to plunge the other into the eyeballs of fellow panellists Tanya Plibersek and Bill Shorten, spent a goodly part of the night reminding viewers that the contest wasn’t over because pre-polls and postal votes accounted for up to 50 per cent of the vote. When it became apparent that even the boss was headed for a Centrelink queue, she changed tack, accusing them of dancing on Peter Dutton’s political grave: “You are feeding on the entrails before the chicken is gutted!” she shrieked.\n\nSpeaking of catastrophic messes, Nine’s Dunk Tank looked like a thought bubble generated by a malfunctioning, AI-generated, political science graduate after a particularly heavy night on the turps. If you covered a 1990s arcade skill-tester with a roll of Bunnings contact in a fetching shade of fake wood, you’d go part of the way to explaining the device that was used to “dunk” MPs who’d lost their seats earlier in the day. So far, so hilarious, no? To their eternal credit, all the network’s panellists looked mildly mortified, with the ALP’s Chris Bowen jumping in to remind the chortling masses that politicians were actual people with actual feelings and that, in fact, forced unemployment wasn’t especially funny anyway.\n\nAlly Langdon and Peter Overton headed up Nine’s election night coverage.\n\nAt the Ten network, nobody was laughing either, although that might’ve had something to do with the eyeball-dryingly dull commentary proffered by the pink-clad teal, Kylea Tink. She spent much of the night earnestly explaining why the Coalition’s policies weren’t resonating with voters to Liberal senator Dave Sharma. He, in turn, was giving off the air of a distracted parent pretending to listen to one of his kids, nodding at timed intervals whilst frantically doomscrolling on the phone.\n\nAnd that, friends, brings us to Sky News, where Peta Credlin’s magnificent eyebrows were given the workout to end all workouts as she contemplated the Coalition’s shockingly quick demise. After using Labor’s Murray Watt for a casual spot of target practice (“your mouth is writing cheques that your brain can’t cash”, she snapped), she and her fellow panellists embarked upon an impromptu autopsy. The result, they declared, was inevitable, given that the Coalition were up against (in no particular order): history, Donald Trump and Labor’s lies, vote-thieving teals and Greens, and political traitors of assorted other shades.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/afl/the-evolution-of-sport-science-and-how-it-s-extending-our-athletes-prime-20241203-p5kvki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The evolution of sport science, and how it’s extending our athletes’ prime",
    "publish_date": "Sun, 04 May 2025 11:45:41 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Dayne Zorko spent two years stifling a laugh each time he fronted the media and cameras as questions about retirement kept coming to the Brisbane Lions star. Yet here he stands: defying Father Time as a premiership champion, and showing no signs of suffering a dramatic fade any time soon. Zorko does not believe his heroics are a flash in the pan: he is adamant the evolution of sport science will make such exploits the norm. The 36-year-old became the oldest player to claim an All Australian blazer last year, doing so in his new position of halfback as he sought comprehensive medical support within and outside the club. In 2025, the performance that helped end Brisbane’s 21-year title drought has continued. His 34 disposals, seven rebound 50s, three inside 50s, and three clearances in the Lions’ most recent triumph of St Kilda showcased just how much he still has to offer as he heads into Sunday’s QClash against the Suns. Dayne Zorko celebrates the Brisbane Lions’ 2024 premiership triumph. Credit: Getty Images But when asked if 40 might become the new 30, with older players inking longer-term deals, Zorko suppressed a giggle.\n\nAdvertisement\n\n“As you get older, you probably want to spend less time on the track and just want to play, but I’ve prided my whole career on training as much as I can. That’s how you get better, that’s how you stay in touch,” said Zorko, who comes off contract this year. “I think going forward, we’re going to see a lot more players play up until they’re 35, 36, 37, maybe even into their 40s. “You can’t replace experience. One thing all the guys still playing well into their 30s in the competition have got is really good experience in big games, finals, and they know what it takes to be a professional athlete. “I don’t know about multi-year deals, but if the player wants to play on, I can’t see why they wouldn’t.” But the evolution of sport science and player welfare, and the way it is extending careers, is not limited to the AFL. In rugby union, Wallabies prop James Slipper has become the nation’s most capped player, with former teammate Scott Higginbotham praising him as one of the game’s most “durable” athletes.\n\nAdvertisement\n\n“That’s the perfect word: durable,” Higginbotham says. “He’s achieved a lot over his whole career, it’s been achievement after achievement. It’s amazing that he’s still playing.” In the NRL, Brisbane Broncos skipper Adam Reynolds is plotting to play on in 2026, having produced one of the finest games of his career against the Bulldogs. Gold Coast Titans veteran Kieran Foran has also refused to rule out playing beyond 2025, despite turning 35 in June. Kieran Foran has refused to rule out playing beyond 2025. Credit: Getty Images Now in his 17th preseason, the stalwart of 303 NRL and 31 Test appearances revealed he had undergone 17 operations for various leg and shoulder injuries – even getting “a new ankle” late last year. It came after a 2024 season in which he made more tackles (433) and kick metres (6235) than at any stage in his career, while only twice previously bettering his 15 try assists. Before suffering a biceps injury in the Titans’ final preseason trial against the Dolphins, which he is expected to return from in May, Foran declared he still had “plenty left in the tank”.\n\nAdvertisement\n\n“The high-performance side of things is forever evolving, but ... it comes back to putting in the hard work and making sure you’re doing everything you can to keep up with this current crop of players,” he said. “I’m still loving it as much now as I was 16 years ago, so it’s great to still be pushing myself and being involved in this game.” According to sports science expert Dr Jonathon Weakley, the ability to prolong careers goes back to the strides taken in strength and conditioning practices during an athlete’s formative years. Loading Weakley, who alongside other professionals at Leeds Beckett University were instrumental in transforming the England Rugby Union’s athlete pathways, told this masthead the growth of sports science could be best illustrate by the change of props in the 15-man code. Where players in those positions two decades ago would weigh about “111 to 114 kilograms”, they now push 130 kilograms, enhancing their capacity to withstand contact and handle injuries. “They’re the same stature, but they’ve essentially put on 15 kilograms, and that’s because they’ve had more time to accumulate that mass and accumulate strength,” Weakley said.\n\nAdvertisement\n\n“Not many would have been able to squat 200 kilograms at the turn of the century. Now we’ve got players like Fletcher Newell – who’s in the squad of the All Blacks – and they’re squatting close to 300 kilograms in their teenage years. “After a while, it’s not freakish, it just becomes the norm. Strength fundamentally mitigates injury, it enhances recovery, and it improves performance on the field – they are undeniable facts. “If we implement good, proper strength and conditioning from a young age, we have a greater opportunity to enhance things like strength and power.” While the Australian Catholic University associate professor believes the extension of careers will be in small increments, the lengthening of a player’s peak period will grow as a result of their improved conditioning. Loading “What we have seen is players being able to play for longer because they had a greater training base, we’re more aware of injuries and how to treat them, the nutritional considerations around recovery, and things like sleep,” Weakley said. “It might be one to three years, but that lengthening of that window of peak performance might be why we’re feeling like players’ careers are lengthening.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/ledecky-claims-gold-titmus-silver-in-titanic-800m-battle-20240804-p5jz90.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ledecky claims gold, Titmus silver in titanic 800m battle",
    "publish_date": "Sun, 04 May 2025 11:40:43 +1000",
    "category": "sports",
    "authors": [],
    "text": "Ledecky claims gold, Titmus silver in titanic 800m battle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/world/europe/chimney-up-sistine-chapel-primped-as-cardinals-prepare-to-elect-next-pope-20250504-p5lwcg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chimney up, Sistine Chapel primped as cardinals prepare to elect next pope",
    "publish_date": "Sun, 04 May 2025 11:33:46 +1000",
    "category": "entertainment",
    "authors": [
      "Rob Harris"
    ],
    "text": "London: Preparations have entered their final phase at the Vatican ahead of this week’s papal conclave, with the installation of the traditional chimney that will soon signal to the world whether the Catholic Church has elected a new pope.\n\nMembers of the Vatican’s fire brigade were seen on the roof of the Sistine Chapel on Friday, Rome time, attaching the chimney that will emit smoke from the ballots burned inside. It is the most visible part of a complex and secretive election process set to begin on May 7, following the death of Pope Francis on April 21 at age 88.\n\nMembers of the Vatican’s fire brigade attach the chimney to the roof of the Sistine Chapel. Credit: Vatican Media\n\nA video released by the Vatican on Saturday, Rome time, showed workers preparing inside the Sistine Chapel for the conclave, including laying a temporary floor to level the space beneath Michelangelo’s famous frescoes. The chapel will host 133 cardinal-electors – the most to ever take part in a conclave.\n\nOf the 252 cardinals gathered, only those under the age of 80 are eligible to vote. Among the electors are 27 cardinals from Asia and Oceania, many of whom were appointed during Pope Francis’s decade-long effort to shift the Church’s leadership away from its traditional European core.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/politics/federal/first-it-was-canada-then-cyclone-donald-crashed-through-australia-s-election-20250503-p5lwbt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dutton was never a Trump clone. But he fell for the trap of MAGA-style politics",
    "publish_date": "Sun, 04 May 2025 11:14:42 +1000",
    "category": "finance",
    "authors": [
      "Matthew Knott"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nAnthony Albanese has two cyclones to thank for his historic trouncing of the Coalition.\n\nCyclone Alfred’s arrival off the Queensland coast delayed plans for an April election and allowed Labor to use the budget to launch into the election campaign. Even more important was the hurricane-like return of Donald Trump to the White House.\n\nCyclone Donald made landfall in Canada last week, delivering the centre-left Liberal Party a fourth-term victory that seemed impossible at the start of this year. Then he crashed through Australia’s electoral map, demolishing the Coalition’s hopes of victory. The parallels between the two countries, both close American allies, are unmistakable. Canadian Conservative Party leader Pierre Poilievre lost not just the election but his own seat, as did Peter Dutton.\n\nLocal factors at play in this election – Dutton’s woeful campaign, Albanese’s astuteness, interest rates beginning to fall – were all crucial. But around the world, Albanese’s victory will be interpreted as a repudiation of Trumpism and the latest sign of a revival of social democratic politics.\n\nTrump’s radical and in many ways frightening return to office has breathed new life into centre-left parties.\n\nThe turnaround from the beginning of this year has been rapid and remarkable. As Trump’s second inauguration approached on January 20, centre-left parties were grasping for relevance. In an era of high inflation, incumbency had become a curse and left-wing governments were in an especially grim position. Conservative populism was in the ascendancy. Canada’s progressive prince, Justin Trudeau, announced his retirement in January as a beleaguered, unpopular figure. Labor was falling behind the Coalition in the polls, raising the likelihood of a Dutton prime ministership.\n\n“Social democratic parties across the world are in disarray,” Emma Dawson, the head of the progressive Per Capita think tank, said in January. Public intellectual Clive Hamilton, who founded the left-wing Australia Institute, argued, “there is clearly something profound going on” in global politics. “There’s no doubt that social democratic parties are struggling to sustain their votes,” Hamilton said.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/volunteers-celebrate-peter-duttons-election-demise-20250504-p5lwe9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Volunteers celebrate Peter Dutton's election demise",
    "publish_date": "Sun, 04 May 2025 11:04:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Volunteers celebrate Peter Dutton's election demise\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/afl/smith-takes-a-swipe-at-the-bulldogs-as-cats-and-pies-play-out-an-mcg-thriller-20250430-p5lvbt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bontempelli bites back at Smith after crack at former club as Cats hang on in MCG thriller",
    "publish_date": "Sun, 04 May 2025 10:45:36 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "This comment could be construed as a veiled swipe at his former club, the Western Bulldogs. The Bulldogs had hosted Port Adelaide in Ballarat before a miserly 4814 fans on Saturday afternoon. Bulldogs captain Marcus Bontempelli answered his former teammate with some cheek of his own on Sunday morning. “It’s nice to know we’re still on Bailey’s mind. You know, he’s still thinking about us even at another team. And, you know, in the end, there’s probably a few less people down in Ballarat for him to flip the bird to,” Bontempelli said on Channel 7’s Sunrise. “So maybe that’s why he’s a little bit disappointed.” Smith has been fined twice this season for flipping the bird to fans.\n\nDangerfield was superb on Saturday night with 29 touches, including 13 and a long goal in the final term, to will his team across the line, while the hard-running Smith finished with 34 disposals, as the Cats produced arguably their best win of the season. In the change rooms post match, Bailey and Dangerfield were praised for their performances by club great Gary Ablett jnr – a man who also set the MCG alight on many occasions. Almost: This long-range shot from Jack Crisp would have won the game for the Pies, but it sailed wide. Credit: AFL Photos The defeat was only the second of the season for the top-of-the-table Magpies. Collingwood coach Craig McRae was proud of how his men had comforted Crisp.\n\nLoading “I have said this before – sometimes when you lose, you want to be winners. And I reckon, sometimes when you win, you can be a loser. When he misses that kick, just have a look at the response of our team,” McRae said. “It’s a testament to the character and culture that we have that we get around Jack. Straight away there was a group of players around him. I think we look like winners regardless of what the scoreboard said. “I thought: ‘If he kicked it, did we steal it?’ But we owned a lot of the numbers throughout the night.” Cats coach Chris Scott was relived to have escaped with the win.\n\n“It can’t be repeated, what was on my mind,” Scott quipped when asked about his thoughts when Crisp lined up for goal. “I think it was a game where you expected something like that to happen.” The Cats booted the opening three goals of the night, before the Magpies began to roll, and appeared to have the contest in hand when they led by 20 points early in the third term. The Magpies dominated centre clearances and overall clearances at that point, but the Cats refused to fold. Oliver Wiltshire of the Cats is congratulated by team mates after kicking a goal. Credit: Getty Images The Magpies have been the best defensive team this season, and they strangled their opponents from late in the first term to midway through the third term. Their set-up behind the football, sometimes with two spare men, and ability to control the ball between the two arcs set the tone.\n\nNick Daicos was tagged by Irishman Oisin Mullin, who had the better of the Magpies star early, but Daicos worked his way into the contest, although there were moments of frustration. Daicos finished with 28 touches, including six clearances, and was still influential. Josh Daicos was also busy, while Scott Pendlebury (26 disposals, one goal) was also magnificent, capping his evening with a snapped goal and joyous, uncharacteristic celebration – that being a salute more akin to a teammate 20 years younger than the 37-year-old. Scott started Max Holmes at half-back, but it was when he was sent into the midfield in the third term that the Cats started to move. Dangerfield began forward, but was also sent into the midfield at a time when the Cats were hammered at stoppages. He helped ease the troubles there, the Cats winning contested ball in the third term. The veteran premiership great had some key moments, a tackle on Darcy Moore late in the third term leading to a crucial Shaun Mannagh goal.\n\nIn one of the great individual final terms, Dangerfield was everywhere – at one point his seven ground-ball gets being more than the Magpies had in total. His rousing 50-metre goal helped to drag the Cats to victory. The final quarter had it all. There was a controversial score review with 3.30 minutes remaining that found a Lachie Schultz shot for goal had been touched, as the goal umpire had said on the initial soft call. “I touched it, but then I’m looking at the replay and it looked like I didn’t touch it,” Geelong’s Mark Blicavs told Fox Footy. “We were lucky that the umpire called touched going to the review so it went our way, but that could have been called inconclusive.\n\n“I touched it, but it’s amazing how it can not look like it on those replays.” A Bobby Hill chase-down tackle on Shaun Mannagh in the centre square with two minutes remaining, which appeared to be holding the ball but was called for tripping, was another contentious moment. “I thought Bobby was probably a bit stiff. I saw the replay, I saw it live,” McRae said. The Cats, ultimately, reinforced why they are the best fourth-quarter team in the competition. “We were fortunate to get away with the win in the end, the way the last two or three minutes played out – not fortunate before that to get ourselves in that position,” Scott said.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/molto-bene-australia-in-line-to-host-world-first-italian-serie-a-match-20250504-p5lwdj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Molto bene: Australia in line to host world-first Italian Serie A match",
    "publish_date": "Sun, 04 May 2025 10:38:06 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Italy’s Serie A is poised to become the first major European league to play matches for points on foreign soil, with Perth’s Optus Stadium in line to host one - or both - of the Milan clubs in competitive fixtures next season.\n\nA report in Italian newspaper Corriere della Sera claims that the competition’s chief executive Luigi de Siervo has received an offer to play a Serie A game in Australia. Sources familiar with negotiations, who were not authorised to speak publicly, say that the groundbreaking offer is from Western Australia’s tourism body, and that a deal is close to being completed.\n\nOne or both of the Milan clubs could be bound for Australia - and not for a friendly. Credit: AP\n\nNo major European league has yet staged a competitive match in another country, but Serie A has been actively exploring opportunities to do so, most publicly in the United States. Serie A’s commercial and marketing director Michele Ciccarese told reporters in March that work was being undertaken to stage a match in America, but that there were “barriers” that needed to be overcome.\n\nFIFA recently rescinded a ban on domestic leagues playing regular-season games on foreign territory, paving the way for such agreements.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/10-4-billion-test-looms-for-safe-haven-australian-banks-20250501-p5lvtl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "$10.4 billion test looms for ‘safe haven’ Australian banks",
    "publish_date": "Sun, 04 May 2025 09:00:00 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "The major Australian banks’ reputation as a safe investment bet during market volatility caused by Donald Trump’s trade war faces a key test this week, as investors expect three of Australia’s biggest banks to post $10.4 billion in profits.\n\nCommonwealth Bank, Westpac and National Australia Bank outperformed the ASX 200 during the market rebound over the past month, as investors piled into the sector after the chaos unleashed by the US president’s “Liberation Day” tariff announcements.\n\nCBA shares shot to record highs on Friday, valuing the bank at more than $280 billion. ANZ Bank shares have outperformed the ASX 200 since January, though their bounceback during April was more modest.\n\nWestpac, NAB and ANZ Bank will report half-year profits this week. Credit:\n\nFund managers say one reason for bank shares’ resilience is a perception they are a relative “safe haven” amid market turmoil, as the US tariffs are not expected to directly hit industry profits. But some analysts also say valuations are “stretched” – in particular CBA’s – making the next round of profit results, starting with Westpac on Monday, a key litmus test for the sector.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/world-leaders-congratulate-anthony-albanese-for-election-win-midday-news-bulletin-4-may-2025/ivd2a9et0",
    "title": "World leaders congratulate Anthony Albanese for election win | Midday News Bulletin 4 May 2025",
    "publish_date": "Sun, 4 May 2025 02:07:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/article/trump-photo-as-pope-draws-internet-outrage/r902ntrsa",
    "title": "'Do not mock us': Outrage at Donald Trump's AI-generated pope photo",
    "publish_date": "Sat, 3 May 2025 23:56:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "US President Donald Trump posted a spoof picture of himself dressed as the pope on his Truth Social platform after joking that he would like to be the next Catholic pontiff.\n\n\n\n\n\nTrump is seen in what appears to be an AI-generated colour image, with his right index finger pointed toward the sky, wearing papal regalia, including white robes, a gold crucifix pendant and the mitre hat.\n\n\n\n\n\nIt comes after Trump joked to reporters this week that he would like to be the next pope, just days before cardinals are due to start the conclave to elect the successor to Pope Francis, who died on 21 April .\n\n\n\n\n\nAsked who he would like to succeed Pope Francis, Trump said: \"I'd like to be pope, that would be my number one choice.\"\n\n\n\nTrump went on to say that he did not have a preference but said there was a cardinal in New York who was \"very good\".\n\n\n\n\n\nHe appeared to be referring to the archbishop of New York, Timothy Dolan, a theological conservative who is fiercely opposed to abortion.\n\n\n\n\n\nThe New York State Catholic Conference, which says it represents bishops of the state in working with the government, voiced sharp criticism of the picture.\n\n\n\n\"There is nothing clever or funny about this image, Mr. President,\" it wrote in a post on X.\n\n\n\n\n\n\"We just buried our beloved Pope Francis and the cardinals are about to enter a solemn conclave to elect a new successor of St. Peter. Do not mock us.\"\n\n\n\n\n\nVatican spokesman Matteo Bruni declined to comment on the image during a briefing with journalists.\n\n\n\n\n\nFormer Italian prime minister Matteo Renzi wrote on X: \"This is an image that offends believers, insults institutions and shows that the leader of the global right enjoys being a clown. In the meantime, the American economy risks recession and the dollar loses value.\"\n\n\n\nTrump attended the funeral service of Pope Francis last week, his first foreign trip since returning to power.\n\n\n\n\n\nAbout 20 per cent of Americans declare themselves Catholic, and exit polls indicated in November that they voted around 60 per cent in favour of Trump.\n\n\n\n\n\nPope Francis had arguably been one of the most powerful moral voices on the world stage critical of Trump.\n\n\n\n\n\nWhen Trump first ran for president in 2016, Francis was unsparing on Trump's signature promise to build a border wall to seal off Mexico.\n\n\n\n\n\nFrancis told reporters: \"Anyone, whoever he is, who only wants to build walls and not bridges is not a Christian.\"\n\n\n\n\n\nCardinals will gather on 7 May in a conclave in the Vatican's Sistine Chapel to elect a new pope.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/live-blog/australia-votes-federal-election-updates-2025/wsfcdh7zf",
    "title": "Australia election 2025: Labor wins in landslide; Liberals mourn historic defeat",
    "publish_date": "Sat, 3 May 2025 20:36:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Anthony Albanese\n\nhas described politics as a \"tough business\" while praising\n\nPeter Dutton\n\nfor his \"generous comments\" made in his concession speech.\n\nPrime Minister Anthony Albanese and partner Jodie Haydon have met with Labor supporters at a Sydney cafe the morning after his election victory. Source: AAP / Lukas Coch\n\n\"I wish him and Kirilly and his family all the best ... It would have been a tough night for Peter,\" he told reporters.\n\n\"He did mention my mum, and that was very kind of him.\n\n\"I used to visit this coffee shop with my mum, I grew up just down the road here, and I did certainly think of her last night as well.\"\n\n— Cameron Carr",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/not-our-night-peter-dutton-accepts-responsibility-for-coalition-loss-as-he-concedes-defeat/6541327ny",
    "title": "'Not our night': Peter Dutton accepts responsibility for Coalition loss, concedes defeat",
    "publish_date": "Sat, 3 May 2025 12:52:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Peter Dutton has delivered his concession speech, flanked by his wife Kirilly and their children Harry, Tom and Rebecca.\n\n\n\n\n\nThe outgoing Opposition leader — who has lost his Brisbane seat of Dickson to Labor's Ali France — said it was \"not our night\" as he accepted responsibility for the Coalition's loss .\n\n\n\n\n\nDutton conceded just after 9.30pm, following a call with Prime Minister Anthony Albanese, whom he congratulated on his success.\n\n\n\n\n\n\"I said to the prime minister that his mum would be incredibly proud of his achievement tonight, and he should be very proud of what he's achieved,\" Dutton said from Liberal HQ in Brisbane.\n\n\n\nElection analysts predict Labor will win a second term with a \"comfortable majority\".\n\n\n\n\n\nDutton apologised for a campaign that \"clearly wasn't good enough\".\n\n\n\n\n\n\"I accept full responsibility for that,\" he said.\n\n\n\n\n\n\"It is not our night as I point out, and there are good members and candidates who have lost their seats.\n\n\n\nREAD MORE Peter Dutton has made history, but not in the way he hoped\n\n\"And I am sorry for that. We have an amazing party, and we will rebuild.\"\n\n\n\n\n\nGetting emotional, he thanked his family for their support.\n\n\n\n\n\n\"I am blessed to have an amazing family — Bec, and Harry and Tom. They have stood by me through thick and thin and I am grateful for the support and their love.\"\n\n\n\nDutton praises victorious France, reflects on public life\n\nDutton praised France following her win, and said she will \"do a good job as a local member\".\n\n\n\n\n\n\"She lost her son Henry, which is a tragic circumstance no parent should ever go through,\" he said.\n\n\n\n\n\n\"I said to Ali that her son Henry would be incredibly proud of her tonight.\"\n\n\n\n\n\nIt is the third time the single mother-of-two has gone up against Dutton in Dickson, having reduced the margin to 1.7 per cent last election.\n\n\n\nREAD MORE Ali France speaks after her 'unexpected' victory over Peter Dutton in Dickson\n\nReflecting on more than two decades in public life, Dutton thanked his constituents for placing \"their faith\" in him since 2001.\n\n\n\n\n\n\"Twenty-four years is a long time to be in public life, and it has been an amazing honour,\" he said.\n\n\n\n\n\n\"Our liberal family is hurting across the country tonight, but including in my electorate of Dickson, and I want to say thank you very much to all of them.\n\n\n\nAt times emotional, Australian Liberal Party leader Peter Dutton accepted responsibility for the Coalition's election loss. Source: AP / Pat Hoelscher He noted being defence minister as a career highlight and described serving as Liberal party leader since May 2022 as \"the greatest honour\".\n\n\n\n\n\n\"I love this country, and I've fought hard for it,\" he said.\n\n\n\n\n\n\"We've been defined by our opponents in this election, which is not the true story of who we are, but we'll rebuild from here.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/ali-france-speaks-after-her-unexpected-victory-over-peter-dutton-in-dickson/y8st4o50d",
    "title": "Ali France speaks after her 'unexpected' victory over Peter Dutton in Dickson",
    "publish_date": "Sat, 3 May 2025 11:51:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Incoming Labor MP Ali France has spoken after winning the Queensland seat of Dickson from outgoing Opposition leader Peter Dutton.\n\n\n\n\n\nWhen asked what it felt like to have \"slayed a dragon\", she summed it up with one word: \"grateful\".\n\n\n\n\n\n\"I thank the people of Dickson, whether you voted for me or not, or whether you voted Labor for the first time. I'm actually so grateful,\" she told Sky News.\n\n\n\n\n\nFrance, who contested the seat for a third time, admitted the win was \"a bit unexpected\".\n\n\n\n\n\n\"I expected it to be a lot closer than it was but I was hopeful,\" France said.\n\n\n\nIn his concession speech on Saturday night , Dutton said he had called France and said she will \"do a good job as a local member\".\n\n\n\n\n\nThe major win comes after a tough year, having lost her eldest son Henry to leukaemia early last year.\n\n\n\n\n\nFrance said her late son's strength has been a motivator throughout her campaign.\n\n\n\n\n\n\"He would say to me, No, Mum, you have to do this… I know you're going to win this time,\" she said.\n\n\n\n\n\n\"I feel he's been with me on this journey. And although it's been hard, I've just thought about his strength in his journey, and that's kept me going.\"\n\n\n\nWho is Ali France?\n\nFrance is a single mother-of-two who has been working in the community for the past seven years.\n\n\n\n\n\nShe became passionate about pursuing politics following her difficulties navigating the healthcare system after being hit by a car as a pedestrian and losing a leg in 2011.\n\n\n\n\n\nHer younger son, Zac, who was with her at the time of the accident, was seen with his mum casting her vote today.\n\n\n\nLabor's Ali France, with her son Zac, votes at Albany Creek State School in Moreton Bay, Queensland. Source: AAP / Jono Searle On election morning, France spoke to SBS News' Andrew Chappelle that she felt hopeful but that a result her way would not come from luck.\n\n\n\n\n\n\"We've worked exceptionally hard for seven years in this seat ... People know me, they know what I stand for.\"\n\n\n\n\n\nIn March, France told SBS News that she felt like Dutton was \"out of touch\" with the needs of the Dickson community, including addressing traffic gridlock.\n\n\n\nREAD MORE Labor has won the 2025 federal election and Peter Dutton has lost his seat\n\n\"He hasn't supported any cost of living relief and that's probably the biggest issue in this community,\" she said.\n\n\n\n\n\n\"We've [Labor] delivered lots of cost of living relief, including tax cuts for all workers, free TAFE, cheaper childcare, cheaper medicines, invested a heap into Medicare.\"\n\n\n\n\n\nLast election, single mother-of-two Ali France tightened the race in Dickson, gaining a 2.94 per cent swing that saw Labor achieve 48.3 per cent of the vote after preferences.\n\n\n\n\n\nLast election, France tightened the race in Dickson to a slim 1.7 percent — making it the most marginal seat in all of Queensland.\n\n\n\n\n\nDutton is the first Opposition leader to lose his seat during an election.\n\n\n\n\n\nPrime ministers have lost their seats at elections before, notably former Liberal leader John Howard, who lost his seat of Bennelong in the 2007 election.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/creative/federal-election-results-2025-live-counts-for-the-house-of-representatives/hpkvuphm2",
    "title": "Federal election results 2025: Live counts for the House of Representatives",
    "publish_date": "Sat, 3 May 2025 08:07:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/politics/federal/federal-election-results-2025-live-updates-australia-seats-albanese-dutton-20250503-p5lwbi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election results 2025 LIVE updates: Albanese remains PM in Labor landslide; Dutton loses his seat to Ali France",
    "publish_date": "Sun, 04 May 2025 12:04:45 +1000",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "The ABC’s election coverage dominated television screens across the country on Saturday night as Labor swept to a landslide majority.\n\nThe public broadcaster was by some distance the most popular choice for Australians to watch the results come in despite some technical glitches for chief elections analyst Antony Green, with its broadcast on Saturday evening reaching more than four million people.\n\nAntony Green sits on the ABC election set ahead of what he said was his last election. Credit: Dominic Lorrimer\n\nIts programming between 8.30-10pm was the most viewed of the evening, with an average audience of 2.36 million, however its average audience remained steady around two million across the night.\n\nNetwork Seven’s coverage was the second most popular, its results broadcast reaching 2.78 million people; however, it had an average audience of 580,000, significantly lower than the ABC’s.\n\nNine’s coverage reached 2.42 million, with an average audience of 527,000 watching the results roll in. Network 10’s coverage, while reaching 1.74 million people, had an average audience of just 97,000, while Sky News Regional’s average viewership was 68,000.\n\nReach describes the total number of unique viewers having watched a program for at least one minute, while average describes the average audience watching across the length of the program on broadcast and streaming platforms, such as ABC iview and 9Now.",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/joe-montemurro-to-coach-matildas-graham-arnold-to-coach-iraq-20250504-p5lwdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Joe Montemurro to coach Matildas, Graham Arnold to coach … Iraq?",
    "publish_date": "Sun, 04 May 2025 11:55:31 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Football Australia’s long-running search for the next Matildas coach is drawing to an end, with Joe Montemurro set to be appointed - while former Socceroos boss Graham Arnold is reportedly in line for a shock move to Iraq.\n\nMontemurro has been FA’s top target in their eight-month hunt for a permanent successor to Tony Gustavsson, a process which has been so protracted that players have expressed their concern about “wasting time” and feeling in “limbo” ahead of their home Asian Cup campaign next year.\n\nBut the wait may be worth it. Network 10 commentator Andy Harper, speaking on Saturday night’s A-League Men coverage, claimed that Montemurro - who has been in charge of leading French club Olympique Lyonnais since June - was “locked in” and would be unveiled in the coming days or weeks.\n\nSources contacted by this masthead, who were not authorised to speak publicly about the courting of an under-contract coach, were not quite so definitive, but said that it was inevitable that FA would get their man, and that a formal agreement was close to being reached.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/national/pundits-predictions-and-punchlines-the-best-of-election-night-tv-20250504-p5lwd9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pundits, predictions and punchlines; the best of election night TV",
    "publish_date": "Sun, 04 May 2025 11:49:53 +1000",
    "category": "finance",
    "authors": [
      "Michelle Cazzulino"
    ],
    "text": "To its accidental credit, Seven got the tone right for Coalition supporters, offering up something called a Situation Room, and a so-called “election needle”. Liberal senator Jane Hume, who looked inclined to enter one to plunge the other into the eyeballs of fellow panellists Tanya Plibersek and Bill Shorten, spent a goodly part of the night reminding viewers that the contest wasn’t over because pre-polls and postal votes accounted for up to 50 per cent of the vote. When it became apparent that even the boss was headed for a Centrelink queue, she changed tack, accusing them of dancing on Peter Dutton’s political grave: “You are feeding on the entrails before the chicken is gutted!” she shrieked.\n\nSpeaking of catastrophic messes, Nine’s Dunk Tank looked like a thought bubble generated by a malfunctioning, AI-generated, political science graduate after a particularly heavy night on the turps. If you covered a 1990s arcade skill-tester with a roll of Bunnings contact in a fetching shade of fake wood, you’d go part of the way to explaining the device that was used to “dunk” MPs who’d lost their seats earlier in the day. So far, so hilarious, no? To their eternal credit, all the network’s panellists looked mildly mortified, with the ALP’s Chris Bowen jumping in to remind the chortling masses that politicians were actual people with actual feelings and that, in fact, forced unemployment wasn’t especially funny anyway.\n\nAlly Langdon and Peter Overton headed up Nine’s election night coverage.\n\nAt the Ten network, nobody was laughing either, although that might’ve had something to do with the eyeball-dryingly dull commentary proffered by the pink-clad teal, Kylea Tink. She spent much of the night earnestly explaining why the Coalition’s policies weren’t resonating with voters to Liberal senator Dave Sharma. He, in turn, was giving off the air of a distracted parent pretending to listen to one of his kids, nodding at timed intervals whilst frantically doomscrolling on the phone.\n\nAnd that, friends, brings us to Sky News, where Peta Credlin’s magnificent eyebrows were given the workout to end all workouts as she contemplated the Coalition’s shockingly quick demise. After using Labor’s Murray Watt for a casual spot of target practice (“your mouth is writing cheques that your brain can’t cash”, she snapped), she and her fellow panellists embarked upon an impromptu autopsy. The result, they declared, was inevitable, given that the Coalition were up against (in no particular order): history, Donald Trump and Labor’s lies, vote-thieving teals and Greens, and political traitors of assorted other shades.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/afl/the-evolution-of-sport-science-and-how-it-s-extending-our-athletes-prime-20241203-p5kvki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The evolution of sport science, and how it’s extending our athletes’ prime",
    "publish_date": "Sun, 04 May 2025 11:45:41 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Dayne Zorko spent two years stifling a laugh each time he fronted the media and cameras as questions about retirement kept coming to the Brisbane Lions star. Yet here he stands: defying Father Time as a premiership champion, and showing no signs of suffering a dramatic fade any time soon. Zorko does not believe his heroics are a flash in the pan: he is adamant the evolution of sport science will make such exploits the norm. The 36-year-old became the oldest player to claim an All Australian blazer last year, doing so in his new position of halfback as he sought comprehensive medical support within and outside the club. In 2025, the performance that helped end Brisbane’s 21-year title drought has continued. His 34 disposals, seven rebound 50s, three inside 50s, and three clearances in the Lions’ most recent triumph of St Kilda showcased just how much he still has to offer as he heads into Sunday’s QClash against the Suns. Dayne Zorko celebrates the Brisbane Lions’ 2024 premiership triumph. Credit: Getty Images But when asked if 40 might become the new 30, with older players inking longer-term deals, Zorko suppressed a giggle.\n\nAdvertisement\n\n“As you get older, you probably want to spend less time on the track and just want to play, but I’ve prided my whole career on training as much as I can. That’s how you get better, that’s how you stay in touch,” said Zorko, who comes off contract this year. “I think going forward, we’re going to see a lot more players play up until they’re 35, 36, 37, maybe even into their 40s. “You can’t replace experience. One thing all the guys still playing well into their 30s in the competition have got is really good experience in big games, finals, and they know what it takes to be a professional athlete. “I don’t know about multi-year deals, but if the player wants to play on, I can’t see why they wouldn’t.” But the evolution of sport science and player welfare, and the way it is extending careers, is not limited to the AFL. In rugby union, Wallabies prop James Slipper has become the nation’s most capped player, with former teammate Scott Higginbotham praising him as one of the game’s most “durable” athletes.\n\nAdvertisement\n\n“That’s the perfect word: durable,” Higginbotham says. “He’s achieved a lot over his whole career, it’s been achievement after achievement. It’s amazing that he’s still playing.” In the NRL, Brisbane Broncos skipper Adam Reynolds is plotting to play on in 2026, having produced one of the finest games of his career against the Bulldogs. Gold Coast Titans veteran Kieran Foran has also refused to rule out playing beyond 2025, despite turning 35 in June. Kieran Foran has refused to rule out playing beyond 2025. Credit: Getty Images Now in his 17th preseason, the stalwart of 303 NRL and 31 Test appearances revealed he had undergone 17 operations for various leg and shoulder injuries – even getting “a new ankle” late last year. It came after a 2024 season in which he made more tackles (433) and kick metres (6235) than at any stage in his career, while only twice previously bettering his 15 try assists. Before suffering a biceps injury in the Titans’ final preseason trial against the Dolphins, which he is expected to return from in May, Foran declared he still had “plenty left in the tank”.\n\nAdvertisement\n\n“The high-performance side of things is forever evolving, but ... it comes back to putting in the hard work and making sure you’re doing everything you can to keep up with this current crop of players,” he said. “I’m still loving it as much now as I was 16 years ago, so it’s great to still be pushing myself and being involved in this game.” According to sports science expert Dr Jonathon Weakley, the ability to prolong careers goes back to the strides taken in strength and conditioning practices during an athlete’s formative years. Loading Weakley, who alongside other professionals at Leeds Beckett University were instrumental in transforming the England Rugby Union’s athlete pathways, told this masthead the growth of sports science could be best illustrate by the change of props in the 15-man code. Where players in those positions two decades ago would weigh about “111 to 114 kilograms”, they now push 130 kilograms, enhancing their capacity to withstand contact and handle injuries. “They’re the same stature, but they’ve essentially put on 15 kilograms, and that’s because they’ve had more time to accumulate that mass and accumulate strength,” Weakley said.\n\nAdvertisement\n\n“Not many would have been able to squat 200 kilograms at the turn of the century. Now we’ve got players like Fletcher Newell – who’s in the squad of the All Blacks – and they’re squatting close to 300 kilograms in their teenage years. “After a while, it’s not freakish, it just becomes the norm. Strength fundamentally mitigates injury, it enhances recovery, and it improves performance on the field – they are undeniable facts. “If we implement good, proper strength and conditioning from a young age, we have a greater opportunity to enhance things like strength and power.” While the Australian Catholic University associate professor believes the extension of careers will be in small increments, the lengthening of a player’s peak period will grow as a result of their improved conditioning. Loading “What we have seen is players being able to play for longer because they had a greater training base, we’re more aware of injuries and how to treat them, the nutritional considerations around recovery, and things like sleep,” Weakley said. “It might be one to three years, but that lengthening of that window of peak performance might be why we’re feeling like players’ careers are lengthening.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/ledecky-claims-gold-titmus-silver-in-titanic-800m-battle-20240804-p5jz90.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ledecky claims gold, Titmus silver in titanic 800m battle",
    "publish_date": "Sun, 04 May 2025 11:40:43 +1000",
    "category": "sports",
    "authors": [],
    "text": "Ledecky claims gold, Titmus silver in titanic 800m battle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/world/europe/chimney-up-sistine-chapel-primped-as-cardinals-prepare-to-elect-next-pope-20250504-p5lwcg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chimney up, Sistine Chapel primped as cardinals prepare to elect next pope",
    "publish_date": "Sun, 04 May 2025 11:33:46 +1000",
    "category": "entertainment",
    "authors": [
      "Rob Harris"
    ],
    "text": "London: Preparations have entered their final phase at the Vatican ahead of this week’s papal conclave, with the installation of the traditional chimney that will soon signal to the world whether the Catholic Church has elected a new pope.\n\nMembers of the Vatican’s fire brigade were seen on the roof of the Sistine Chapel on Friday, Rome time, attaching the chimney that will emit smoke from the ballots burned inside. It is the most visible part of a complex and secretive election process set to begin on May 7, following the death of Pope Francis on April 21 at age 88.\n\nMembers of the Vatican’s fire brigade attach the chimney to the roof of the Sistine Chapel. Credit: Vatican Media\n\nA video released by the Vatican on Saturday, Rome time, showed workers preparing inside the Sistine Chapel for the conclave, including laying a temporary floor to level the space beneath Michelangelo’s famous frescoes. The chapel will host 133 cardinal-electors – the most to ever take part in a conclave.\n\nOf the 252 cardinals gathered, only those under the age of 80 are eligible to vote. Among the electors are 27 cardinals from Asia and Oceania, many of whom were appointed during Pope Francis’s decade-long effort to shift the Church’s leadership away from its traditional European core.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/politics/federal/first-it-was-canada-then-cyclone-donald-crashed-through-australia-s-election-20250503-p5lwbt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dutton was never a Trump clone. But he fell for the trap of MAGA-style politics",
    "publish_date": "Sun, 04 May 2025 11:14:42 +1000",
    "category": "finance",
    "authors": [
      "Matthew Knott"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nAnthony Albanese has two cyclones to thank for his historic trouncing of the Coalition.\n\nCyclone Alfred’s arrival off the Queensland coast delayed plans for an April election and allowed Labor to use the budget to launch into the election campaign. Even more important was the hurricane-like return of Donald Trump to the White House.\n\nCyclone Donald made landfall in Canada last week, delivering the centre-left Liberal Party a fourth-term victory that seemed impossible at the start of this year. Then he crashed through Australia’s electoral map, demolishing the Coalition’s hopes of victory. The parallels between the two countries, both close American allies, are unmistakable. Canadian Conservative Party leader Pierre Poilievre lost not just the election but his own seat, as did Peter Dutton.\n\nLocal factors at play in this election – Dutton’s woeful campaign, Albanese’s astuteness, interest rates beginning to fall – were all crucial. But around the world, Albanese’s victory will be interpreted as a repudiation of Trumpism and the latest sign of a revival of social democratic politics.\n\nTrump’s radical and in many ways frightening return to office has breathed new life into centre-left parties.\n\nThe turnaround from the beginning of this year has been rapid and remarkable. As Trump’s second inauguration approached on January 20, centre-left parties were grasping for relevance. In an era of high inflation, incumbency had become a curse and left-wing governments were in an especially grim position. Conservative populism was in the ascendancy. Canada’s progressive prince, Justin Trudeau, announced his retirement in January as a beleaguered, unpopular figure. Labor was falling behind the Coalition in the polls, raising the likelihood of a Dutton prime ministership.\n\n“Social democratic parties across the world are in disarray,” Emma Dawson, the head of the progressive Per Capita think tank, said in January. Public intellectual Clive Hamilton, who founded the left-wing Australia Institute, argued, “there is clearly something profound going on” in global politics. “There’s no doubt that social democratic parties are struggling to sustain their votes,” Hamilton said.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/volunteers-celebrate-peter-duttons-election-demise-20250504-p5lwe9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Volunteers celebrate Peter Dutton's election demise",
    "publish_date": "Sun, 04 May 2025 11:04:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Volunteers celebrate Peter Dutton's election demise\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/afl/smith-takes-a-swipe-at-the-bulldogs-as-cats-and-pies-play-out-an-mcg-thriller-20250430-p5lvbt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bontempelli bites back at Smith after crack at former club as Cats hang on in MCG thriller",
    "publish_date": "Sun, 04 May 2025 10:45:36 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "This comment could be construed as a veiled swipe at his former club, the Western Bulldogs. The Bulldogs had hosted Port Adelaide in Ballarat before a miserly 4814 fans on Saturday afternoon. Bulldogs captain Marcus Bontempelli answered his former teammate with some cheek of his own on Sunday morning. “It’s nice to know we’re still on Bailey’s mind. You know, he’s still thinking about us even at another team. And, you know, in the end, there’s probably a few less people down in Ballarat for him to flip the bird to,” Bontempelli said on Channel 7’s Sunrise. “So maybe that’s why he’s a little bit disappointed.” Smith has been fined twice this season for flipping the bird to fans.\n\nDangerfield was superb on Saturday night with 29 touches, including 13 and a long goal in the final term, to will his team across the line, while the hard-running Smith finished with 34 disposals, as the Cats produced arguably their best win of the season. In the change rooms post match, Bailey and Dangerfield were praised for their performances by club great Gary Ablett jnr – a man who also set the MCG alight on many occasions. Almost: This long-range shot from Jack Crisp would have won the game for the Pies, but it sailed wide. Credit: AFL Photos The defeat was only the second of the season for the top-of-the-table Magpies. Collingwood coach Craig McRae was proud of how his men had comforted Crisp.\n\nLoading “I have said this before – sometimes when you lose, you want to be winners. And I reckon, sometimes when you win, you can be a loser. When he misses that kick, just have a look at the response of our team,” McRae said. “It’s a testament to the character and culture that we have that we get around Jack. Straight away there was a group of players around him. I think we look like winners regardless of what the scoreboard said. “I thought: ‘If he kicked it, did we steal it?’ But we owned a lot of the numbers throughout the night.” Cats coach Chris Scott was relived to have escaped with the win.\n\n“It can’t be repeated, what was on my mind,” Scott quipped when asked about his thoughts when Crisp lined up for goal. “I think it was a game where you expected something like that to happen.” The Cats booted the opening three goals of the night, before the Magpies began to roll, and appeared to have the contest in hand when they led by 20 points early in the third term. The Magpies dominated centre clearances and overall clearances at that point, but the Cats refused to fold. Oliver Wiltshire of the Cats is congratulated by team mates after kicking a goal. Credit: Getty Images The Magpies have been the best defensive team this season, and they strangled their opponents from late in the first term to midway through the third term. Their set-up behind the football, sometimes with two spare men, and ability to control the ball between the two arcs set the tone.\n\nNick Daicos was tagged by Irishman Oisin Mullin, who had the better of the Magpies star early, but Daicos worked his way into the contest, although there were moments of frustration. Daicos finished with 28 touches, including six clearances, and was still influential. Josh Daicos was also busy, while Scott Pendlebury (26 disposals, one goal) was also magnificent, capping his evening with a snapped goal and joyous, uncharacteristic celebration – that being a salute more akin to a teammate 20 years younger than the 37-year-old. Scott started Max Holmes at half-back, but it was when he was sent into the midfield in the third term that the Cats started to move. Dangerfield began forward, but was also sent into the midfield at a time when the Cats were hammered at stoppages. He helped ease the troubles there, the Cats winning contested ball in the third term. The veteran premiership great had some key moments, a tackle on Darcy Moore late in the third term leading to a crucial Shaun Mannagh goal.\n\nIn one of the great individual final terms, Dangerfield was everywhere – at one point his seven ground-ball gets being more than the Magpies had in total. His rousing 50-metre goal helped to drag the Cats to victory. The final quarter had it all. There was a controversial score review with 3.30 minutes remaining that found a Lachie Schultz shot for goal had been touched, as the goal umpire had said on the initial soft call. “I touched it, but then I’m looking at the replay and it looked like I didn’t touch it,” Geelong’s Mark Blicavs told Fox Footy. “We were lucky that the umpire called touched going to the review so it went our way, but that could have been called inconclusive.\n\n“I touched it, but it’s amazing how it can not look like it on those replays.” A Bobby Hill chase-down tackle on Shaun Mannagh in the centre square with two minutes remaining, which appeared to be holding the ball but was called for tripping, was another contentious moment. “I thought Bobby was probably a bit stiff. I saw the replay, I saw it live,” McRae said. The Cats, ultimately, reinforced why they are the best fourth-quarter team in the competition. “We were fortunate to get away with the win in the end, the way the last two or three minutes played out – not fortunate before that to get ourselves in that position,” Scott said.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/molto-bene-australia-in-line-to-host-world-first-italian-serie-a-match-20250504-p5lwdj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Molto bene: Australia in line to host world-first Italian Serie A match",
    "publish_date": "Sun, 04 May 2025 10:38:06 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Italy’s Serie A is poised to become the first major European league to play matches for points on foreign soil, with Perth’s Optus Stadium in line to host one - or both - of the Milan clubs in competitive fixtures next season.\n\nA report in Italian newspaper Corriere della Sera claims that the competition’s chief executive Luigi de Siervo has received an offer to play a Serie A game in Australia. Sources familiar with negotiations, who were not authorised to speak publicly, say that the groundbreaking offer is from Western Australia’s tourism body, and that a deal is close to being completed.\n\nOne or both of the Milan clubs could be bound for Australia - and not for a friendly. Credit: AP\n\nNo major European league has yet staged a competitive match in another country, but Serie A has been actively exploring opportunities to do so, most publicly in the United States. Serie A’s commercial and marketing director Michele Ciccarese told reporters in March that work was being undertaken to stage a match in America, but that there were “barriers” that needed to be overcome.\n\nFIFA recently rescinded a ban on domestic leagues playing regular-season games on foreign territory, paving the way for such agreements.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://sg.finance.yahoo.com/news/warren-buffett-says-retire-berkshire-201908066.html",
    "title": "Warren Buffett to retire from Berkshire Hathaway by year's end",
    "publish_date": "2025-05-03T21:29:56Z",
    "category": "finance",
    "authors": [
      "Theo Marie-Courtois",
      "Jonathan Brown",
      "Sat",
      "May",
      "Min Read"
    ],
    "text": "Berkshire Hathaway's Warren Buffett has said he will step down by year's end as head of the company (Jamie McCarthy)\n\nInfluential billionaire investor Warren Buffett said Saturday he would retire from leading his Berkshire Hathaway business group by the end of the year and that he would recommend his chosen successor Greg Abel take over.\n\nBuffett's success, coupled with his ability to explain his thinking in clear soundbites, has made him highly influential in the business and financial communities, earning him the nickname \"The Oracle of Omaha.\"\n\nBuffett indicated several years ago 62-year-old Abel would be his pick for successor.\n\n\"The time has arrived where Greg should become the chief executive officer of the company at year end,\" Buffett, 94, told an annual shareholder meeting in Omaha, the Midwestern city where Berkshire is based.\n\nBuffett said he believed the board of directors would be \"unanimously in favor of\" his recommendation.\n\n\"I would still hang around and could conceivably be useful in a few cases, but the final word would be what Greg said in operations, in capital deployment, whatever it might be,\" he added.\n\nBuffett transformed Berkshire Hathaway from a medium-sized textile company when he bought it in the 1960s into a giant conglomerate, now valued at more than $1 trillion and with liquid assets of $300 billion.\n\n- 'Wizard of Wall Street' -\n\nPeter Cardillo of Spartan Capital Securities described Buffett as the \"Wizard of Wall Street\" and said his announcement could come as a relief to those worried about succession.\n\n\"This helps alleviate concerns about who will replace him and may very well be well received by his followers,\" Cardillo told AFP.\n\nThe company on Saturday reported first-quarter profits of $9.6 billion, down 14 percent. That works out to $4.47 per share, also down sharply.\n\nAnd Buffett's net worth as of Saturday was $168.2 billion, according to Forbes magazine's real-time rich list.\n\n\"I have no intention -- zero -- of selling one share of Berkshire Hathaway. I will give it away eventually,\" Buffett told shareholders, who responded with a standing ovation.\n\n\"The decision to keep every share is an economic decision because I think the prospects of Berkshire will be better under Greg's management than mine.\"\n\n\"So that's the news hook for the day,\" Buffett quipped.\n\nAbel, a long-time core figure of Berkshire, joined the group in the energy division in 1992 and has been on the board of directors since 2018.\n\n\"Greg Abel and the rest of the team has huge shoes to fill, and they have immense amounts of cash to put to work if they so desire,\" said Steve Sosnick of Interactive Brokers.",
    "source": "Yahoo",
    "cluster_id": 1
  },
  {
    "url": "https://sg.news.yahoo.com/warren-buffett-billionaire-investor-simple-195153922.html",
    "title": "Warren Buffett: billionaire investor with simple tastes",
    "publish_date": "2025-05-03T19:51:53Z",
    "category": "finance",
    "authors": [
      "John Biers"
    ],
    "text": "US billionaire investor Warren Buffett (L) and Microsoft founder Bill Gates (R) flip over their Dairy Queen Blizzard treats in Beijing in 2011; Dairy Queen is one of dozens of iconic brands owned by Buffett's Berkshire Hathaway (FREDERIC J. BROWN) (FREDERIC J. BROWN/AFP/AFP)\n\nAdmired for his investing prowess and a taste for the simple things in life rather than luxury, billionaire Warren Buffett has won public affection even as he amassed a fortune for the ages -- riches that the \"Oracle of Omaha\" has pledged to give away.\n\nBuffett studiously rejected exotic financial vehicles, as well as the brass-knuckle tactics of corporate raiders, adopting instead a buy-and-hold strategy of long-term investments.\n\nHis legacy: Berkshire Hathaway, the Nebraska-based conglomerate whose diverse holdings range from Duracell batteries to insurer Geico to paint brands to diamonds.\n\nThe company also holds carefully selected equity stakes in US corporate giants such as Coca-Cola and Chevron.\n\nADVERTISEMENT\n\nNow, at age 94, he is ready to step away from the company he built, announcing on Saturday that he plans to step down at year's end and will recommend that his chosen successor Greg Abel take his place as Berkshire CEO.\n\nAccording to Forbes magazine's real-time rich list, as of Saturday, his net worth is $168.2 billion -- the fifth biggest fortune in the world.\n\nBuffett has nevertheless avoided the trappings of the oft-maligned \"one percent,\" eschewing big-ticket art collecting or fancy mansions around the world.\n\nHe still lives in the same house in a quiet neighborhood of Omaha that he bought in 1958 for $31,500.\n\nHis gastronomic tastes are decidedly humble, including McDonald's Chicken McNuggets at least three times a week, potato chips for snacks, ice cream for dessert and an average of five cans of Coca-Cola per day.\n\nADVERTISEMENT\n\nHis hobbies include bridge and playing the ukulele.\n\n\"I don't need fancy clothes,\" Buffett told CBS in 2013. \"I don't need fancy food.\"\n\nYet he did acknowledge in 2006 that he owned a private jet, saying the splurge made his life easier.\n\n- Philanthropy -\n\nThat same year, Buffett announced that he would donate 99 percent of his fortune to philanthropic causes.\n\nJoined by his friend and bridge partner Bill Gates, Buffett subsequently persuaded other billionaires to pledge to also donate at least half their wealth away.\n\nSuch campaigns have made Buffett a beloved figure within US society, helping to draw small investors to Berkshire's annual meeting each spring in Omaha, a gathering that has been dubbed a sort of \"Woodstock for capitalists.\"\n\nThe investor has often used his platform to comment on economic policy, or to express pique on a wealth of topics, from the questionable value of bitcoin to US President Donald Trump's trade policies.\n\nADVERTISEMENT\n\nBuffett has been open in the past about supporting the Democratic Party, while also frequently expressing the view that his taxes should have been higher, given his wealth.\n\n- Early business instincts -\n\nBorn on August 30, 1930 in Omaha as the second of three children, Buffett discovered an early taste for business after reading the book \"One Thousand Ways to Make $1,000\" as a young boy.\n\nBuffett's childhood was not easy. He has described going through a shoplifting phase and being forced to navigate around his abusive mother Leila, who used to berate his sister Doris as \"stupid.\"\n\nHe had planned to abandon his studies, but that idea was vetoed by his father, a businessman and politician who served in Congress.\n\nHe attended the University of Pennsylvania as an undergraduate before transferring to the University of Nebraska, where he graduated with a business degree.\n\nADVERTISEMENT\n\nHe later received a Master's degree in economics from Columbia University in New York in 1951.\n\nBuffett worked on Wall Street in the 1950s, establishing the Buffett Partnership, which merged in 1965 with Berkshire Hathaway, then a textile firm.\n\nAn avid reader of the financial press and beyond, Buffett gravitated toward investments that he believed were undervalued, holding them until they paid off.\n\nHe transformed Berkshire into a far-flung conglomerate known for investments in nuts-and-bolts sectors such as energy, banking, air travel and food. Holdings also include Citigroup, Kroger, Apple and American Express.\n\n- Active in his 90s -\n\nDonning classic gray suits, glasses and colored ties, the white-haired Buffett has remained a vibrant player on the US business scene into his 90s.\n\nHe long ran Berkshire with his longtime vice chairman Charlie Munger, six years his senior.\n\nThen in 2021, as Buffett turned 90, Berkshire officially designated Abel as his successor -- a plan that appears now to be set into motion.\n\nBuffett married his first wife Susan in 1952. They had three children. Though they lived apart for decades, they remained married until her death in 2004.\n\nHe subsequently married his long-time partner Astrid Menks in 2006.\n\njum-jmb/sst/bbk",
    "source": "Yahoo",
    "cluster_id": 29
  }
]