[
  {
    "url": "https://www.9news.com.au/world/diane-keaton-dies-aged-79/c63a05e7-bb30-491c-b42c-cf893438e136",
    "title": "Hollywood icon Diane Keaton dies aged 79",
    "publish_date": "Sat, 11 Oct 2025 21:49:51 +0000",
    "category": "entertainment",
    "authors": [
      "Oct"
    ],
    "text": "L﻿egendary actress Diane Keaton has died at the age of 79.\n\nThere are no further details at this time and her family has requested privacy, a spokesperson told People﻿ magazine, which first reported the news.\n\nKeaton was the kind of actor who helped make films iconic and timeless, from her \"La-dee-da, la-dee-da\" phrasing as Annie Hall , bedecked in that necktie, bowler hat, vest and khakis, to her heartbreaking turn as Kay Adams, the woman unfortunate enough to join the Corleone family in The Godfather .\n\nDiane Keaton was one of Hollywood's most beloved figures. (Getty)\n\nHer star-making performances in the 1970s, many of which were in Woody Allen films, were not a flash in the pan either, and she would continue to charm new generations for decades thanks in part to a longstanding collaboration with filmmaker Nancy Meyers.\n\nKeaton won her first Oscar for Annie Hall and would go on to be nominated three more times, for Reds , Marvin's Room and Something's Gotta Give .\n\nIn her very Keaton way, upon accepting her Oscar in 1978 she laughed and said, \"This is something.\"\n\nREAD MORE: ﻿ Whistleblower claims alarming safety fails at embattled childcare chain\n\nKeaton with her Oscar in 1978 after her performance in Annie Hall. (AP)\n\nBette Midler, who starred with Keaton in The First Wives Club , paid tribute in a post on Instagram: \"﻿The brilliant, beautiful, extraordinary Diane Keaton has died. I cannot tell you how unbearably sad this makes me.\n\n\"She was hilarious, a complete original, and completely without guile, or any of the competitiveness one would have expected from such a star. What you saw was who she was…oh, la, lala!\"\n\nOctavia Spencer remembered Keaton as \"[not] just an actress: she was a force. a woman who showed us that being yourself is the most powerful thing you can be\".\n\n\"﻿From Annie Hall to Something's Gotta Give , she made every role unforgettable. But beyond the screen, she brought joy, laughter, and style that was all her own. Thank you, Diane, for reminding us that authenticity never goes out of fashion,\" Spencer's tribute read.\n\nKeaton was born Diane Hall in January 1946 in Los Angeles, though her family was not part of the film industry she would find herself in.\n\nHer mother was a homemaker and photographer, and her father was in real estate and civil engineering.\n\nKeaton made her film debut in the 1970 romantic comedy Lovers and Other Strangers , but her big breakthrough would come a few years later when she was cast in Francis Ford Coppola's The Godfather , which won best picture and become one of the most beloved films of all time.\n\nAnd yet even she hesitated to return for the sequel, though after reading the script she decided otherwise.\n\nREAD MORE: Major changes to how Aussies travel in Europe\n\nKeaton in 2015. (Richard Shotwell/Invision/AP)\n\nThe 1970s were an incredibly fruitful time for Keaton thanks in part to her ongoing collaboration with Allen in both comedic and dramatic roles.\n\nShe appeared in Sleeper , Love and Death , Interiors , Manhattan , Manhattan Murder Mystery and the film version of Play it Again, Sam.\n\nAllen and the late Marshall Brickman gave Keaton one of her most iconic roles in Annie Hall , the infectious woman from Chippewa Falls whom Allen's Alvy Singer cannot get over.\n\nThe film is considered one of the great romantic comedies of all time, with Keaton's eccentric, self-deprecating Annie at its heart.\n\n- Reported with Associated Press﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/frequent-flyer-programs-australia-steve-hui-points-whisperer/f65c9eef-ff8c-4193-86ce-da95cc5bacde",
    "title": "Betting on using frequent flyer points for a holiday? Think again",
    "publish_date": "Sat, 11 Oct 2025 21:05:18 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Steve Hui is known as the \"Points Whisperer\", one of the Australia's foremost authorities on maximising return from frequent flyer points, and he has a warning for Aussies.\n\nThere's a huge change coming ﻿for the rewards landscape, and it's not looking good.\n\nHui predicts that ﻿the Reserve Bank of Australia's (RBA) proposed reforms banning surcharges on eftpos, Mastercard and Visa cards could slash the number of points everyday Aussies earn with each purchase.\n\nSteve Hui warned Aussies there are big changes coming to the way we earn frequent flyer points. (Instagram/@iflyflat)\n\nSo if you're a Qantas Frequent Flyer, Virgin Velocity Frequent Flyer, or other points collector who earns through card purchases, you might soon be a lot worse off.\n\n\"Your ability to earn points will drop in a number of areas,\" Hui, founder of points travel advisory iFLYflat, told 9news.com.au.\n\n\"A lot of credit cards will have to change their reward system because the revenue won't be there to pay for these rewards at the current level.\"\n\nFor example, credit cards that currently offer one frequent flyer point ﻿per dollar spent may drop to one point per $2 spent, or more.\n\nIn short, ﻿earning frequent flyer points will get more expensive.\n\nHui said the RBA's proposed ﻿surcharge and interchange reforms will significantly impact how Aussies earn points and how many they can earn in a single transaction.\n\n\"I believe it will change the whole rewards landscape in Australia, and probably be the biggest change in 15 years,\" he said.\n\n\"What we don't know is when the changes are going to be implemented.\"\n\nBut as it becomes harder to earn points and the number of points required to access rewards﻿ keeps going up, is it even worth it for everyday Aussies to be part of frequent flyer loyalty programs anymore?\n\nA growing number of consumers don't seem to think so.﻿\n\nNew research from Finder revealed 57 per cent of Aussies – equivalent to more than 12 million people – no longer see the value in Qantas or Virgin's programs.\n\nOnly one in three think Qantas Frequent Flyer points are worth the chase, and just one in four believe Virgin Velocity points are worth it.\n\nThese attitudes should come as no surprise, given that Velocity recently slashed the number of points non-Velocity credit card holders earned per dollar while Qantas﻿ hiked up the points needed to redeem fares.\n\nHui understands why some Aussies have been turned off frequent flyer programs but said they still have plenty of value for those who play it smart.\n\n﻿\"It really all comes down to people working out what's the cost versus benefit of the points,\" he said.\n\n\"If benefit exceeds cost, then it's always worthwhile.\"﻿\n\nThe cost is the fee paid to collect the points, like annual credit card fees or surcharges, while benefit can be rewards like flights and seat upgrades.\n\nREAD MORE: Paedophile allowed to have photo of his victims at his bedside as he died\n\n\"If benefit exceeds cost, then it's always worthwhile.\"﻿ (Getty)\n\nBut making the most of your points isn't as simple as accruing a bunch and spending them on anything.\n\nThe biggest mistake Aussies make with frequent flyer programs is not knowing how many points they actually need to get the rewards they want.\n\n﻿Hui said the best tactic is to decide where you want to go and what class of fare you want, find out how many points it costs, and work backwards.\n\nWork out which retailers offer the points you're collecting and prioritise them whenever you can, from the supermarket (Qantas Points with Everyday Rewards at Woolworths) to the petrol station (Velocity Points at 7-Eleven stores.\n\nHui also encourages everyday consumers to pick one program and stick with it to hit their points goals and earn rewards faster.\n\nSpreading points around usually only works for business travellers who fly constantly, who can learn how to optimise their points with a membership program Hui is set to launch next week.\n\nREAD MORE: Man arrested over fire that destroyed 6000 LA homes\n\nHui is the founder and chief executive of iFLYflat, which claims to be Australia's top points travel experts. (Instagram/@iflyflat)\n\nIf you're tossing up ﻿which frequent flyer program to focus on, Hui's favourites in 2025 have been Virgin, Qatar and Cathay Pacific.\n\nQantas didn't make the cut, but don't jump ship if you're already collecting Qantas points.\n\nInstead, Hui said to focus on accruing as many points as possible in the program you're already with before the RBA's proposed surcharge reforms kick in and potentially slash your earning power.\n\n\"Make hay when the sun shines because the system's always changing and if you wait, then you may miss out.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/final-stage-perth-metronet-byford-rail-extension-opening/105876182",
    "title": "Final 'game changing' piece of Metronet rail project opening in Perth's south-east",
    "publish_date": "Sat, 11 Oct 2025 23:59:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "The final piece of the Western Australian government's flagship Metronet project, the long-awaited Byford rail extension in Perth's south-east, will open tomorrow, half a billion dollars over budget.\n\nCommunity events are planned today to celebrate the milestone, which extends the existing Armadale line 8 kilometres south to a new ground-level station in Byford.\n\nThe line will allow commuters to get from the new Byford train station, which features 400 parking bays, to Perth in 46 minutes.\n\nPremier Roger Cook and Transport Minister Rita Saffioti will launch the new rail line. (ABC News: Cason Ho)\n\nThe Shire of Serpentine-Jarrahdale President Rob Coles said it was a significant development for the rapidly growing population.\n\n\"About 75 per cent of our residents leave the shire each day and go to work, and on average they travel about 23 kilometres one way,\" he said.\n\n\"So this really is a game changer for our residents to be able to access employment.\n\n\"We are currently the fastest growing local government in WA and number three in Australia, the growth is rapid and things like the train station and other infrastructure really is so important.\"\n\nWA's new Metronet trains unveiled Photo shows New white train with green stripes being built at a railcar manufacturing facility. The WA government's signature project is facing cost blowouts, delays and a slow uptake in train patronage and an economist calls it risky.\n\nThe Byford Rail Extension was originally expected to cost $797 million, but has risen to $1.33 billion.\n\nBusinesses celebrate opening\n\nThe grand opening has been eagerly awaited by some residents and business owners in Byford, who have had to cope with a large section of the Armadale line being closed for almost two years.\n\nHair salon owner Sharlene Sandiana was looking forward to better transport links and potentially more customers.\n\nSharlene Sandiana says the new station could help her business. (ABC News: Lily Kristanto)\n\n\"Transport around here has been pretty bad for the last few years, so it'll be great,\" she said.\n\n\"We're already quite busy here as it is, so hopefully it'll get a little bit busier; a bit of extra passing traffic, a bit of good exposure.\"\n\nIt will be 46 minutes from Byford to Perth. (ABC News: Lily Kristanto)\n\nImpact of roadworks\n\nByford pharmacy assistant Bridget Ellement said roadworks related to the project had impacted some businesses.\n\n\"It affected the road access and people just found it a bit harder, so they were like, 'Oh well, I'll just go to a different pharmacy or go to a different area,'\" she said.\n\n\"I know the bakery next door … struggled a little bit.\n\n\"They were closing a bit earlier, which was a bit disappointing to see, but we're definitely excited to see [the train line] open and see more people.\"\n\nBridget Ellement says the new rail line will be beneficial for elderly residents. (ABC News: Lily Kristanto)\n\nMs Ellement also said the new rail line would make it easier for elderly residents to access health services in Armadale.\n\n\"We have had people come in and ask, 'Can you call me a taxi so I can go into Armadale?', so it definitely has been an accessibility thing,\" she said\n\nSeven level train crossings have been removed and two new road-over-rail bridges have been built as part of the project, with 8 kilometres of new walking and cycling paths created.\n\nPerth's first east-west rail connection opens Photo shows Roger Cook wears a blue suit as he smiles while standing on a train The Thornlie-Cockburn link and adjacent rail elevation in Perth's south-east is part of WA Labor's flagship infrastructure project Metronet.\n\nSince November 2023, thousands of commuters in Perth's south-east faced disruptions to their travel, with the closure of sections of the Armadale/Thornlie line as part of the project.\n\nThe Armadale line between Cannington and Perth stations reopened in June with the new Thornlie-Cockburn line, while the remainder between Beckenham and Armadale stations will reopen tomorrow, along with the new Byford Station.\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/boarders-legal-rights-victoria-housing-crisis/105865694",
    "title": "We have a lot of spare bedrooms — but boarders' rights are unclear",
    "publish_date": "Sat, 11 Oct 2025 23:08:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "When the Portland Memorial Bowling Club put out a call for housing for its newest chef, regular customer Ellen Linke did not hesitate.\n\nShe took Anoop Thapliyal into her home in February 2024 with no formal agreement, no house rules, just a simple premise of trust.\n\n\"I thought, well, if he's good enough to be employed by them, I think I can offer him a place,\" she said.\n\nEllen Linke (right) has taken up three boarding arrangements, including with Renu Thapliyal and her husband. (Supplied: Anoop Thapliyal)\n\nThe split-second decision gave Mr Thapliyal an immediate base after his journey from Abu Dhabi to country Victoria.\n\nLiving with a stranger without a lease did not faze him.\n\n\"The very first day when I talked to her [Ms Linke], I just realised that she's a really nice lady, so I was depending on that thing only,\" he said.\n\nAnoop Thapliyal was conscious of being a considerate boarder. (Supplied: Anoop Thapliyal)\n\n\"If they [boarders] are lucky, they will find … people like Ellen Linke, but I don't know if everyone is lucky.\"\n\nMr Thapliyal's wife Renu eventually joined him at Ms Linke's house. By October, the pair had found their own rental.\n\nMake me a match\n\nBeris Campbell wished boarding was more common.\n\nMs Campbell helped create Australia and New Zealand's peak body for homesharing, and said the arrangement could benefit both parties — especially when organised through a paid service.\n\n\"Being a matchmaker is a very skilled and difficult, challenging situation because you are trying to bring people … to live together,\" she said.\n\n\" For God's sake, that's the hardest thing that we do is all trying to get on with each other. \"\n\nJacinta Duffy said her father could have lived longer if boarding had delayed his move to residential aged care.\n\nShe now runs a business vetting and supporting boarding arrangements, particularly in regional areas.\n\nJacinta Duffy had a positive experience boarding as a student with an elderly relative. (Supplied: Life Shared)\n\n\"I'm swamped with people who want to be home companions,\" she said.\n\n\"The need is so much there for people who are seeking housing full stop, let alone affordable housing and housing that's well-located.\n\n\" I think it'd be a huge positive solution to the housing crisis that we can act on now … we're not waiting for properties to be built. \"\n\nA solution to the housing crisis?\n\nAustralia has 13 million spare bedrooms, according to census analysis by Queensland University of Technology's Lyndall Bryant.\n\nThe university's Housing Security Research Group lead said boarding was \"a real grey area\" that needed a clearer regulatory framework and further tax exemptions to encourage older Australians to host.\n\n\"There's no silver bullet for the housing crisis, but every little piece will help,\" Dr Bryant said.\n\n\"So even if 1 per cent of those …13 million bedrooms were released to the market, then that's 130,000 extra bedrooms.\n\n\"That would make a significant difference.\"\n\nLyndall Bryant says it is inefficient for there to be one spare bedroom for every two people. (Supplied: QUT)\n\nThe federal government aims to build an average of 240,000 homes each year until 2029, but current completion rates are falling short.\n\nReserve Bank of Australia (RBA) governor Michele Bullock is also locked into spare bedrooms, telling a house economics committee last month the housing crisis was not just about supply, but \"declining household size\".\n\nProperty analyst Cotality released research in August showing most houses have at least three bedrooms, but most households contain fewer than three people.\n\nThe company's Australian head of research Eliza Owen said this could be addressed by incentivising downsizing: abolishing stamp duty, implementing land tax and including the family home in the pension asset test.\n\nEliza Owen says it is more important to incentivise appropriately sized housing. (Supplied: Cotality)\n\nSlippery entitlements\n\nBoarding is not a solution without risks.\n\nTenants Victoria lawyer Ben Cording said ambiguity arose in situations not covered by the Victorian Residential Tenancies Act.\n\nThe legislation spelt out obligations for renters and landlords, but excluded private arrangements such as boarding.\n\n\"The key defining difference for those two things is what's called exclusive possession,\" he said.\n\n\"There's a lot of complicated factors that sort of fall into deciding the difference, and this often is not spelt out … really clearly in the legislation, it comes through decisions from the court.\"\n\nBen Cording says expectations, conduct, shared spaces and locks can play a role in reaching the legal threshold of exclusive possession. (Supplied: Tenants Victoria)\n\nMr Cording said he would also like to see housing laws amended to protect boarders.\n\n\"There's got to be a balance that we want people to be hospitable … but we also want to absolutely make sure that we're not exposing people who have no other alternative to housing to be exploited,\" he said.\n\nThe Victorian Minister for Housing did not respond to the ABC's request for comment.",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/mango-the-muster-cat-draws-attention-to-western-qld-recovery/105783150",
    "title": "Move over muster dogs — there's a new cat in town",
    "publish_date": "Sat, 11 Oct 2025 22:32:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "A ginger cat perched on his owner's lap, tearing across Queensland's mulga country by motorbike is enough to make anyone do a double-take.\n\nRaised alongside working dogs, Mango the muster cat isn't your average feline.\n\nSpot the odd one out. (Supplied: Beck Smith)\n\nThe whiskered four-legged influencer of the outback comes complete with his own Facebook page, loyal followers and even fan mail.\n\n\"When I go to the mailbox, there's packages for Mango. There's ladies who even bake him his own treats. He gets tins of salmon, cat clothes, little shoes,\" owner Beck Smith said.\n\nA pair of crocs Mango was sent by a fan. (ABC Western Qld: Hannah Walsh)\n\n\"Everyone loves Mango.\"\n\nMs Smith said Mango's rise to fame happened almost by accident after she sent videos to friends of her and Mango surveying flood damage around their property earlier this year.\n\nMango is one year old and has a sassy personality. (ABC Western Qld: Hannah Walsh)\n\n\"All they got out of it was, 'Hang on, is that a cat on the bike with you?'\" Ms Smith said.\n\n\"He comes on the bike with the dogs, he gets tied on the back of the car with the dogs, he's been mustering, he helps down the yard drafting and working weaners,\" Ms Smith said with a chuckle.\n\nIt's the duality of the outback; finding humour in harsh times.\n\nLoading...\n\n\"Having him there takes away the harshness of talking about the devastation … a lovely little fluffy cat with personality, it draws people in,\" Ms Smith said.\n\n\"People are laughing at him and his antics, but then they are also seeing what we're going through as well.\"\n\nMango and mental health\n\nMs Smith lives on and runs a 52,600-hectare station solo near Stonehenge, a tiny town about 90 minutes from Longreach in central-west Queensland.\n\nBeck Smith runs Evengy station near Stonehenge in central-west Queensland. (ABC Western Qld: Hannah Walsh)\n\nDuring destructive flooding earlier this year, Ms Smith estimated about 70 per cent of her property went under water.\n\nIt's been a domino effect since, not being able to muster or sell cattle, and the bills piling up.\n\n\"I try not to think about that dollar figure too much, because if you do, it does become very overwhelming,\" she said.\n\n\"The days are never long enough, and you never get half the things you want done each day.\"\n\nBeck Smith does not know the full extent of her stock losses yet. (ABC Western Qld: Hannah Walsh)\n\nRebuilding fences and purchasing the materials to do so has put Ms Smith back at least $100,000.\n\nAnd it's money that must be spent up-front before she can be reimbursed through government grants.\n\n\"That's the issue … most people don't have that money sitting there ready to go,\" she said.\n\nPosting videos to social media of Mango being \"one of the dogs\" helps Ms Smith talk about life on the land after disaster.\n\nMango enjoys riding in the quad bike. (Supplied: Beck Smith)\n\nShe said mental health was still a taboo topic in the bush.\n\n\"I used to be very embarrassed by my mental health journey and then I just got to the point where it's part of my healing process to speak about it, and if one person can relate and will put their hand up for help, then I've paid it forward,\" she said.\n\n\" People on the land don't like to be seen as having any weaknesses because you've got to be tough, you've got to be able to handle everything that life throws at you. \"\n\nWhich, she said, was even more apparent if you were a woman.\n\n\"There's a lot more women working in the agriculture industry now … but it's still very much a man's playground,\" she said.\n\nBeck Smith says she does not have time to be lonely, especially with all her animals. (ABC Western Qld: Hannah Walsh)\n\n\"Whatever a man does, you have to do it twice as hard and tough than what they do.\n\n\" I'm expected to bake the cake and be a bush mechanic too. \"\n\nBut Ms Smith said as she got older, it worried her less and life on the land was second nature.\n\nDeep in the Mulga, with Mango by her side, she continues rebuilding after ruin.\n\nMango on the two wheeler. (ABC Western Qld: Hannah Walsh)\n\n\"It's just one of those things you've got to keep putting one foot in front of the other.\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/live-updates-bathurst-1000-supercars/105865890",
    "title": "Live: Rain is falling at Bathurst as lead drivers jump into their Supercars",
    "publish_date": "Sat, 11 Oct 2025 22:25:23 +0000",
    "category": "sports",
    "authors": [
      "Simon Smale",
      "Michael Doyle"
    ],
    "text": "Todd Hazelwood has made the perfect start from the front, after his lead driver, Brodie Kostecki, secured pole position.\n\nDrivers have not bee afraid to get their elbows out as the fight for position in the early laps of the Bathurst 1000.\n\nAll teams are looking up to the skies, with rain almost certain to fall during the famous race.\n\nFollow all the action from the great race in our live blog.\n\nKey Events IT'S RAINING IN BATHURST! 9 minutes ago WE'RE GO AT BATHURST 1 hours ago Bathurst map 1 hours ago Show all key events 31/161: Bit of bumping as the rain sends nerves scattering S By Simon Smale (Fox Sports) Randle just hit Le Brocq in a move for 10th place on the final turn. Tom Randle may have to give that place back. Car #14 is back on the race track M By Michael Doyle is car 14 out for good? - Flermit Hello Flermit. Thanks for joining us on the Bathurst 1000 live blog. It is great news for Brad Jones Racing and the team for the #14 car. It stalled off the line, and had come into the pits twice with an issue. While all other cars were flying around the mountain, the team for #14 were completing a complete overhaul of the car's transaxle. Car #14, with drivers Bryce Fullwood/Brad Vaughan, is now racing again. Now, they are more than 20 laps behind the leaders, so don't start believing in any miracles. However, if a car completes 121 laps, it will be classified as a finisher. It is a great effort from the team to get that car back on track and a chance of being classified today. 30/161: Aaron Cameron has made big contact at the cutting! S By Simon Smale (Fox Sports) Getting a bit slippery up there, lads? 29/161: Here's how the top five looks after the first hour of racing S By Simon Smale #88 - Broc Feeney/Jamie Whincup (Red Bull Ampol Chevrolet) #38 - Brodie Kostecki/Todd Hazelwood (Shell V-Power Ford) #99 - Cooper Murray/Jobe Stewart (Chiko Chevrolet) #2 - Ryan Wood/Jayden Ojeda (Mobil 1 Truck Assist Ford) #1 - Will Brown/Scott Pye (Red Bull Ampol Chevrolet) IT'S RAINING IN BATHURST! S By Simon Smale Spots of rain on the camera. Spots of rain on the windscreen. Things might be about to get even more interesting... It's certainly not heavy yet, though. Cam Waters: I'd prefer to be in the car if it's raining S By Simon Smale Cam Waters is one of only three lead drivers to not be in the car at the moment. He says it's OK to have Mark Winterbottom in the car for now though. \"Yeah, obviously there is rain on its way. I probably prefer to be in the car if it rains, but if it does rain now, it's not the end of the world,\" he says on Fox Sport. \"He's got a lot of experience. We're going OK.\" Speaking of rain... 25/161: Ryan Wood and Mark Winterbottom are going at it S By Simon Smale Awesome battle up on top of Mount Panorama as Ryan Wood is all over the back of Mark Winterbottom through the cutting. Winterbottom shows all his skill to keep Wood at bay, but he can't stop him from running up the inside of the Chase and that's some superb driving from this pair to stay away from each other. Great driving. Meanwhile, everyone has stopped once and we'll just wait to see how things settle out. 24/161: Bit of damage to car #26 S By Simon Smale (Fox Sports) Just a little bit of a bruise on the back of the Penrite #26 car driven by Kai Allen/Dale Wood. 23/161: Main drivers coming in, but not all of them S By Simon Smale Fox Sports is reporting that most of the lead drivers will be coming into the car during this pit stop window. But there are some notable exceptions. Brodie Kostecki, Cam Waters and Chad Mostert are all sitting and enjoying what they're seeing so far. They don't have the helmets on so they will be unlikely to get into the car at this stop. Is that risky with the rain imminent? 21/161: Big moment for Hazlewood S By Simon Smale Todd Hazlewood with a big slide at McPhillinay Park. He is nearly 2 seconds clear at the front of the race. But that was a big moment. A bit of dampness up on the mountain? We haven't heard it's raining yet... 20/161: When do we start thinking about wet weather tyres? S By Simon Smale Thomas Randle is into the #55 car, with James Moffat coming out. Slick tyres on there. If they have to come in again very soon, that will be a disappointment for that team. When will the rain hit? S By Simon Smale Soon. Very, very soon. There is some debate as to exactly when they will start getting wet though. Team 18 have been telling their drivers the rain will come down in 17 minutes. But in one of the other teams, it's going to be 44 minutes.\n\nDon't go anywhere. 20/161 The top six have a big advantage over the field M By Michael Doyle We have achieved 10 per cent race distance, and there is a clear gap between the top six and the rest of the field. The currently top six are: #38 - Brodie Kostecki/Todd Hazelwood (Shell V-Power Ford) #99 - Cooper Murray/Jobe Stewart (Chiko Chevrolet) #6 - Cam Waters/Mark Winterbottom (Monster Energy Ford) #88 - Broc Feeney/Jamie Whincup (Red Bull Ampol Chevrolet) #2 - Ryan Wood/Jayden Ojeda (Mobil 1 Truck Assist Ford) #25 - Chaz Mostert/Fabian Coulthard (Mobil 1 Optus Ford) This group are separated by seven seconds. There is an eight-second gap between #25 - Chaz Mostert/Fabian Coulthard in sixth, and Will Brown/Scott Pye (#1 Red Bull Ampol Chevrolet) in seventh. The field will bunch up with a safety car, but with green flag racing, there seems to be a distinct gulf between the top six and the rest. We still have the majority of the field with co-drivers in the car. This can all change with the lead drivers. 19/161: Some movements up and down the field S By Simon Smale Some errors up and down the field. Cooper Murray is up into second as Mark Winterbottom just gets a little bit out of shape - nothing too much. Garth Tander goes wide and Craig Lowndes comes through for 14th place. #38 - Brodie Kostecki/Todd Hazelwood (Shell V-Power Ford) #99 - Cooper Murray/Jobe Stewart (Chiko Chevrolet) #6 - Cam Waters/Mark Winterbottom (Monster Energy Ford) #88 - Broc Feeney/Jamie Whincup (Red Bull Ampol Chevrolet) #2 - Ryan Wood/Jayden Ojeda (Mobil 1 Truck Assist Ford) #25 - Chaz Mostert/Fabian Coulthard (Mobil 1 Optus Ford) 17/161: Scott Pye makes a great move S By Simon Smale (Fox Sports) Lovely stuff from Scott Pye, who moves up into seventh place. Cam McLeod is the man who gave him a lot of room. There was another pit as well, James Courtney comes into the pits and swaps with Jack Perkins. There's a bit of stuff dangling off the back of the car, perhaps just race tape. (Fox Sports) 16/161: First pit stop S By Simon Smale Nick Percat is into the #10 car, an early change there as Tim Slade gets out after a short first stint. 15/161: Whincup is flying S By Simon Smale Jamie Whincup has just set the fastest lap of the race, 2.07.7. We're still about 10 laps from the first fuel pitstops. #38 - Brodie Kostecki/Todd Hazelwood (Shell V-Power Ford) #6 - Cam Waters/Mark Winterbottom (Monster Energy Ford) #99 - Cooper Murray/Jobe Stewart (Chiko Chevrolet) #88 - Broc Feeney/Jamie Whincup (Red Bull Ampol Chevrolet) #2 - Ryan Wood/Jayden Ojeda (Mobil 1 Truck Assist Ford) #25 - Chaz Mostert/Fabian Coulthard (Mobil 1 Optus Ford) 14/161: Contact between Scott Pye and Harry Jones S By Simon Smale (Fox Sports) Scott Pye has just made contact on his way through past Harry Jones. Jones was a bit stunted by that out of the final corner and is under pressure from Lee Holdsworth in the battle for 13th. RAIN DROPS ON THE MOUNTAIN! S By Simon Smale Cooper Murray has just reported some rain drops. Not much more than that, but it's coming and that fact is just raising the anticipation levels across the circuit. There are even a couple of umbrellas up in the stands at Skyline. On suspicion? Or are they reacting to something up there? 12/161: Jamie Whincup into fourth S By Simon Smale Another lovely move from Jamie Whincup. He overtakes Jayden Ojeda. At the front, the lap gap is getting smaller, down from two seconds to 1.1 to Cooper Murray, and both the lead drivers are pushing hard too, a lock up from each heading off the mountain. #38 - Brodie Kostecki/Todd Hazelwood (Shell V-Power Ford) #6 - Cam Waters/Mark Winterbottom (Monster Energy Ford) #99 - Cooper Murray/Jobe Stewart (Chiko Chevrolet) #88 - Broc Feeney/Jamie Whincup (Red Bull Ampol Chevrolet) #2 - Ryan Wood/Jayden Ojeda (Mobil 1 Truck Assist Ford) #25 - Chaz Mostert/Fabian Coulthard (Mobil 1 Optus Ford) Show more posts\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/south-east-emerges-from-drought-and-price-slump/105848144",
    "title": "Once parched and bare, these paddocks are now flourishing again",
    "publish_date": "Sat, 11 Oct 2025 22:00:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Looking at Abby Miller's fat, new season lambs standing amid belly-high, neon-green pasture today, it is hard to believe the same paddock was a brown, barren dust plain just a few months ago.\n\nFor the past two years, the Naracoorte farmer and accountant has been battling drought and dramatically low livestock commodity price slumps, which saw sheep make as little as $2 per head at saleyards.\n\nLike many farmers throughout South Australia, those in the south-east where Mrs Miller farms, have been in a desperate position.\n\nAt the height of her community's call for action, she penned a letter to SA Premier Peter Malinauskas, expressing the burden of hardship being borne by farmers — locally, around the state and across the border into western Victoria.\n\nYoung lambs on a drought-affected paddock at Richie and Abby Miller's farm near Naracoorte. (Supplied: Rosemary Miller)\n\nLambs graze on the same paddock at Richie and Abby Miller's farm near Naracoorte. (Supplied: Rosemary Miller)\n\nMrs Miller's words would underpin expanded, emergency drought support for South Australian farmers.\n\nToday, the Miller farm — and many others in the region — paint a more positive picture.\n\nThe lambs born on bare, brown paddocks just a few months ago are now grazing on lush, fresh feed.\n\nCrops sown with hopes and prayers now stand tall in swathes of yellow and green.\n\n\"It's good to walk down the main street or take kids to local sport and see people smiling again,\" Mrs Miller said.\n\n\"I think the South East is feeling optimistic.\n\n\"After these early spring rains, people can now say 'let's keep going' which is quite a turnaround, coming off the back of two very tough years.\"\n\nTough times build tough people\n\nWhile some South Australian regions remain on a knife-edge, Mrs Miller said some farmers on the Limestone Coast had the opportunity to claw back financial losses, with some districts recording up to 2 inches of rain in the first week of October.\n\n\"To know we can feed our lambs and grow our crops to their full potential — it's positive and so many farmers here are smiling and saying there's opportunity there,\" she said.\n\nThe outlook in the Upper South East is also much improved.\n\nRichie Miller and his son feed sheep during the 2024-25 drought in Naracoorte, SA. (Supplied: Abby Miller)\n\nMichael Hunt farms at Cannawigara near Bordertown, where the season also got off to a memorably difficult start.\n\n\"We started planting some barley and some canola and then we stopped because it was dead, dry, dusty and depressing,\" he said.\n\n\"We had a team meeting and decided to just keep going. We were full of self-doubt … but eventually it rained.\"\n\nA grazing property in the Penola district has been revived with recent rains. (ABC South East SA: Liz Rymill)\n\nThat rain helped improve the season, with Mr Hunt now on track to have an average harvest year.\n\n\"I don't think I've ever seen it turn around like that,\" Mr Hunt said.\n\nConditions 'much better'\n\nLower South East farmer Trevor Rayson had around 40 millimetres of rain on his property in Hatherleigh, 15 kilometres north-west of Millicent, in the first week of October.\n\nWith the improvement of conditions, Mr Rayson said he was on track for an average harvest year, much better than he expected three months ago.\n\nTrevor Rayson says another big rain would be needed in the next month to help crops finish successfully. (ABC South East SA: Elsie Adamo)\n\n\"We're so much better off than we were … from where we've come from, that's really good,\" he said.\n\n\" It doesn't rain grass, it rains potential. \"\n\nWhile the crops on his farm are looking healthy, Mr Rayson doesn't need to travel far for the outlook to change.\n\n\"Even just 10 or 15 kilometres down the road and the crops don't look as bright,\" he said.\n\n\"We might just be in a very lucky patch.\"\n\nThose patchy results are a common occurrence across the South East according to senior agronomist with Delta Ag in Keith, Scott Hutchings.\n\nScott Hutchings says there has been enough rain for most pastures to get some decent yields for livestock. (ABC South East SA: Elsie Adamo)\n\n\"There is some unevenness in some of the cropping and pasture and that can be who's had individual rainfall events,\" he said.\n\nMr Hutchings is expecting crops and pastures south of Keith to have average to slightly above average yields this season, but for those farmers further north it is a different story.\n\n\"In my area, my variation from north to south is the most I've seen for a long, long time just because of lower rainfall as we move north,\" he said.\n\nLessons remain after rains arrive\n\nFarmers are often not big on celebrating the wins publicly, aware others could be in much tougher situations, but Mr Hunt wanted to provide a bit of hope.\n\nCanola flowers have brightened up the South East in the last month. (ABC South East SA: Elsie Adamo)\n\n\"I'm just aware of all of those that are having a tough year, keep the chin up,\" he said.\n\n\"I was feeling very low in May, but once things started turning around you realise that it's not forever.\n\n\" Sometimes you've got to be thankful for what you've got. \"\n\nMrs Miller echoes this sentiment.\n\n\"I sometimes feel bad for feeling good because I know that there's still a lot of farmers across the state who don't know what happens next,\" she said.\n\n\"Farming is a small community — you're in it together, and I think reaching out to friends in regions where it's tough is still very important.\n\n\"Even just a phone call or a message over social media matters.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/gregory-porter-interview-australia-mister-holland-no-love-dying/105866372",
    "title": "From racism to romance: Gregory Porter's songs hit hard",
    "publish_date": "Sat, 11 Oct 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Gregory Porter's voice is velvet and thunder.\n\nThat duality — smooth yet commanding — perfectly reflects the emotional depth and genre-spanning versatility that defines his career.\n\nPorter's musical versatility is one of his greatest strengths. While rooted in jazz, he's equally at home in gospel, blues, and soul.\n\nHear Gregory Porter's full interview on The Music Show Photo shows a Black man smiles at the camera, wearing a suit and a hat that covers his ears and throat, swimming pool in the background Gregory Porter is at home in gospel, blues, soul, and R&B. But the foundation of it all, he tells Andrew Ford, is jazz.\n\nHis captivating live performances have delighted audiences from Glastonbury's main stage to intimate jazz clubs. He was the voice of Disclosure's dancefloor anthem Holding On and he recently released a characteristically cool Christmas album.\n\nPorter sees each recording as a reflection of a moment in time.\n\n\"Any given record is just a snapshot of what an artist is on that particular day,\" Porter tells Andrew Ford on Radio National's The Music Show.\n\n\"If I make a record, if I take the same content and same songs and record it three months down the line, it's gonna sound quite a bit different based on what I'm feeling, based on how I feel like expressing a particular song.\"\n\nLoading Instagram content\n\nPorter quickly embraced the value of versatility, giving him a rich palette of musical expression.\n\n\"Knowing that I have these things within my wheelhouse — gospel, blues, soul and the foundation of it all being jazz — I use all of the devices and come to the feeling that I like the best, based on what I feel that day.\n\n\"I don't feel like I'm tied to expressing in one way because I feel like all this music belongs together.\n\n\" The musicians that played on Saturday night were often the musicians who were on the side of the pulpit playing the music in church on Sunday morning. \"\n\nExtracting beauty from darkness\n\nThis fluidity of style also extends to the themes Porter explores in his music.\n\nHe is a deft hand with a love song: the tender Hey Laura, the determined Consequence Of Love, the devotional Heaven are just a few textbook examples of how to capture the intoxication of love in song with requisite class.\n\nGregory Porter performs as part of Queen Elizabeth II's Platinum Jubilee celebrations at Buckingham Palace in June 2022. (Reuters/Chris Jackson)\n\nAnd he has just as much impact, if not more, when singing songs that take on less comfortable subjects.\n\n\"It ceases to become a performance, it then carries on a bit of a cause,\" he says of instilling deeper meaning into a song. \"It just gives a song a little bit more nutrition, in a way.\"\n\nThe song Mister Holland from Porter's 2020 album All Rise is a perfect example. The song's protagonist goes to a young woman's door and, when her father answers, they chat calmly.\n\n\"By the way, Mister Holland, I like the way you make no trouble of my skin,\" Porter sings in the song's second verse.\n\nWhile the song was based on a true story, the reality of the situation wasn't as friendly as the song laid it out to be.\n\nLoading Instagram content\n\n\"Mister Holland is an example of me, in a way, rewriting a really negative experience that I had,\" Porter says.\n\n\"A girl that I liked, I went to her house to go for a soda or something like this. Anyway, I went to the door, and it was a super negative experience. I was told to get away from the door.\n\n\"Basically, Mister Holland is rewriting the story of something that happened to me when I was a teenager.\n\n\" In the song, I'm treated with respect, and I'm treated just like any regular normal teenager and there was no problem with my skin colour. There was no questioning. \"\n\nThe song's warmth and conviviality mask the ugliness of the real-life experience it's based on.\n\n\"I found as a songwriter and as a performer early on that when I write from personal experience, from something that I really care about, something that moves me, that my delivery is more authentic and it's a bit more true.\"\n\nThis wasn't just Porter rewriting his own history: he spun gold from a harrowing experience. He took the ugliest human behaviour and turned it into something truly beautiful.\n\nHe says he had no choice.\n\n\"If it's something that weighs heavy on my heart or something that I think about that may be happening to other people, the melody and the poetry will come to me. It can take some work afterwards. But the feeling and the melody will kind of just rise up out of me.\"\n\nThe music and message live inside him, waiting to be released. Porter releases these emotions to heal, and to help others do the same.\n\n\"I would love if I made a song like that and it sells a bunch of copies,\" he says.\n\n\"But if the soulful message that's embedded within gets out to the people and has some effect, that's more valuable than anything.\"\n\nLove and optimism are worth fighting for\n\nAnother classic example of how Porter's thoughtful music serves, and one even more universal, is Porter's brilliant 2013 track No Love Dying.\n\nThe song serves as a poignant reality check: in a world where love is often dismissed, Porter stands firm in its defence.\n\nLoading Instagram content\n\nPorter knows that we don't need to bow to that way of thinking, and No Love Dying is a quiet but formidable protest.\n\n\"I wrote that song with the idea of writing a song in the defence of optimism about love,\" Porter says.\n\nHe's comfortable being optimistic about life and love, because he knows it's important.\n\nLove doesn't always win. If we want to benefit from its power, we need to let it in. It may not always be easy and we may have been conditioned otherwise, but it's there.\n\n\"It's not blind optimism,\" he says of his most positive songs. \"It's optimism in the face of difficulty.\n\n\"This is the type of optimism that I think my mother had. The type of optimism that the civil rights workers had.\n\n\"It's the type of optimism that I think, sometimes, political people have. On either side of any issue. They believe in what it is they're working for, and they believe that it's possible through work.\n\nGregory Porter has won two Grammy Awards for Best Jazz Vocal Album (Reuters/Lucy Nicholson)\n\n\"Yes, I'm encouraged about love and about people and about peace. But not in the idea that it exists, in the idea that we have to work for it. I don't believe that there is perfect equality and perfect conditions of love and of peace. These are things that we have to work for.\n\n\"I always put that in the song when I write about optimism about love. I'll often state the opposition to the cause of peace and love and grace.\"\n\nAnd he quotes:\n\n\"The death of love is everywhere. But I won't let it be. There will be no love dying here for me.\"\n\nGregory Porter's Australian tour kicks off at Hobart's Odeon Theatre on Wednesday night before hitting Sydney, Brisbane, Melbourne and Perth.\n\nYou can hear Gregory Porter's full interview on The Music Show, available anytime on the ABC Listen app.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/west-coast-councils-fleet-of-vehicles-unregistered-for-week/105878164",
    "title": "'Administrative error' leads to council's unregistered vehicle fleet",
    "publish_date": "Sat, 11 Oct 2025 21:48:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tasmania's West Coast Council has blamed an \"administrative error\" for a week-long lapse in the registration for its entire fleet of vehicles.\n\nRegistration for the vehicles, including passenger cars, trucks and heavy machinery, expired on September 30, and the bill was not paid for renewal until October 7.\n\nDuring that time multiple vehicles were used on public roads, illegally and without valid insurance.\n\nQueenstown is the principal town in Tasmania's West Coast Council. (ABC News: Maren Preuss)\n\nLapsed rego 'not a good look', GM admits\n\nActing general manager Bill Hutcheson confirmed the oversight, and said it was the result of a miscommunication between departments at the council.\n\nHe said the alarm was raised on Wednesday afternoon when a staff member using a council car \"realised that it actually wasn't registered\".\n\n\"So therefore, that vehicle was taken off the road straight away,\" he said.\n\nThe West Coast Council is based in Queenstown. (ABC News: Maren Preuss)\n\nHe said he acted as soon as the issue was identified, and the council paid the $45,000 bill to re-register the vehicles within 30 minutes.\n\n\"If it had have taken longer, we would have had all the vehicles straight off the road,\" he said.\n\nMr Hutcheson said it was unclear how many of the council's fleet had been driven during the week they were unregistered, and said much of the heavy machinery would not have entered a public road.\n\n\"Some of them might be, just for instance, they might be used at our waste disposal sites,\" he said.\n\n\"So, they're not actually out on the road all the time. But we still need to get them registered.\"\n\nHe agreed the situation was \"very concerning\" as vehicles need to be registered for insurance to be valid.\n\n\"If there had have been an accident, then our insurance wouldn't have covered us,\" he said.\n\nScott Riley has taken responsibility for the oversight, as West Coast Council's general manager. (ABC News: Maren Preuss)\n\nScott Riley, the council's general manager, said he was unaware of the situation prior to being asked as he was on leave this week but agreed it was concerning.\n\n\"That is not a good look at all,\" he said.\n\n\"It's a significant concern, given that we're supposed to be law abiding citizens.\"\n\nMr Riley said he was not typically involved in managing the council's vehicle fleet, but as the general manager he accepted responsibility.\n\nUnion concerned, minister referring matter on\n\nSam Batchelor, Tasmanian coordinator for the Australian Services Union, said she intended to meet with Local Government Minister Kerry Vincent.\n\n\"The ASU was notified by members that council vehicles were being unknowingly driven unregistered by workers,\" she said.\n\n\"While we have received confirmation that the matter has been rectified, this points to one of many ongoing issues in our councils.\"\n\nMinister Vincent said he had \"no jurisdiction over operational matters of councils\".\n\nHowever, as the minister for transport, he said he referred the matter to the Registrar of Motor Vehicles for further investigation.\n\nUnder Tasmanian law, driving unregistered vehicles can attract significant fines and further penalties for subsequent offences.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/alyssa-healy-backs-australias-batters-to-fire-india-world-cup/105881892",
    "title": "Healy backs Aussie batters to fire despite stuttering start to World Cup",
    "publish_date": "Sat, 11 Oct 2025 21:27:10 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alyssa Healy says she is not concerned by Australia's top-order frailty in its first two World Cup wins and is confident in its batting as it faces its biggest test yet against host India.\n\nHealy's side won its opening two matches thanks to stunning rescue knocks from Ash Gardner against New Zealand and Beth Mooney against Pakistan, aided both times by some dogged assistance from the lower-order.\n\nBut with India also having faced its own batting trials and tribulations, coming off a shock defeat against South Africa on Thursday, Healy expects both the two favourites' big guns to start delivering at Sunday's sell-out.\n\nBeth Mooney bailed Australia out with a stellar knock against Pakistan. (Getty Images: Matthew Lewis/ICC)\n\n\"We're allowed to lose games of cricket and we're allowed to be put under pressure at times, in particular in World Cups,\" Healy said when asked if she was concerned by Australia's form.\n\n\"You're going to be put under the pump in unfamiliar conditions, against unfamiliar sides at times.\n\n\"I really back our depth in our side and our squad, that the 11 we put out on the park are going to be able to get the job done for us.\n\n\"And we're fortunate it's been a different person every time that stuck their hand up and said, 'yep, I've got this, I can get us to a total' or 'I can take the wickets to restrict the team'. So I wouldn't say it's a worry.\n\n\"It's something we'd like to rectify. I think it's on our top order to make the bulk of the runs, and I think we can speak on that from both sides.\"\n\nThe hosts will doubtless agree with their star batters — Smriti Mandhana, captain Harmanpreet Kaur and Jemimah Rodrigues — all having misfired so far during the tournament.\n\nOn Thursday, they all fell cheaply, leaving it down to Richa Ghosh to pull out a big-hitting 94 at number eight, which was still not enough for India to avoid defeat thanks to an even more astonishing knock from the South Africans' Nadine de Klerk (84no).\n\nIndia has endured its own batting woes at this World Cup. (AP: Anupam Nath)\n\nHealy said India remained a major threat to Australia's World Cup crown.\n\n\"The rivalry continues to grow. I feel like India have been almost a sleeping giant in the women's game for a long period,\" she said.\n\n\"It's probably since the Women's Premier League that they've realised the depth they've got and they've figured out a style of play they want to want to use, especially in this format, which has been really impressive to see.\n\n\"In their home conditions, they're obviously going to play really well and be a real threat, but as we've seen throughout this World Cup so far, there's lots of teams that are pushing everybody.\n\n\"So I wouldn't probably say there's one team that's our main threat. We know we're going to have to work hard in every fixture to get our result and that's the way a World Cup should be.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/starcevich-good-to-go-at-west-coast-concussion-concerns/105881284",
    "title": "Starcevich 'good to go' at West Coast despite concussion concerns",
    "publish_date": "Sat, 11 Oct 2025 21:13:45 +0000",
    "category": "sports",
    "authors": [],
    "text": "West Coast recruit Brandon Starcevich says he has no worries about his concussion history after completing his trade from the Brisbane Lions to the Eagles.\n\nStarcevich, who missed almost two months of football this year due to concussion, sat out the end of the grand final after a heavy collision with Geelong's Ollie Dempsey, sparking concern about his future in the game.\n\nStarcevich has suffered several consussions during his career (AAP Image/Jono Searle)\n\nBut the dual-premiership defender says he didn't suffer a concussion in that incident.\n\n\"A cautious approach with it all [sitting out the end of the grand final],\" Starcevich told ABC Perth's Summer Sportstalk.\n\n\"No need to take a risk, especially with me I think was most of it.\"\n\nThe 26-year-old, who moved from to the Eagles in a three-way trade, has consulted several experts to ensure he can keep playing in the AFL.\n\n\"With all the feedback I've gotten around my situation, I'm fairly positive that I'm fine and good to go,\" he said.\n\n\"All the professionals I spoke to when I had that bit of time off at the start of the year sort of ticked me off and said I was fine.\n\n\"I've had no lingering issues or anything, so I'm pretty positive about the whole thing.\"\n\nFrom premiers to wooden spooners\n\nStarcevich's decision to return to Perth was sparked by conversations had at the end of the 2024 season, as he entered the last year of his Brisbane contract.\n\nStarcevich played 132 games for the Lions since debuting in 2018. (AAP Image/Darren England)\n\n\"I thought I'd like to explore it a little bit and the idea of potentially coming back to Perth and playing, being back among your friends and family, was very appealing,\" he said.\n\n\"The appeal of the young talent that is at the Eagles and starting that climb back up the ladder is definitely a new challenge, sort of a fresh adventure.\"\n\nThe East Perth product conceded he'd miss Brisbane after giving up the chance to go for a third-straight premiership with the club, but was always heading home.\n\n\"I made my mind up and there was never anything that was going to change it,\" he said of his decision to move.\n\n\"It's better to go out winning it. I think losing it would probably feel a little bit more empty, but it's nice I got to go out on a high.\"\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nLoading...\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/queensland-buyers-call-for-tighter-sunset-clause-legislation/105827656",
    "title": "Buyers priced out of market as developer finds sunset clause loophole",
    "publish_date": "Sat, 11 Oct 2025 21:13:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "On their honeymoon in Queensland more than half a decade ago, Fatin Jebeili and Maher Santina fell in love with the Gold Coast, resolving to leave Sydney behind and move there one day if they could.\n\nSo, when the opportunity came up to put down a deposit on an off-the-plan, four-bedroom townhouse for $595,000 in 2022, it seemed like that dream was about to become a reality.\n\nThree years later, the couple and their two daughters are instead living a nightmare.\n\nTheir townhouse is yet to be finished, and the developer of Urbana Residences is trying to cancel their contract and return their deposit on the grounds the sunset date expired in August.\n\nMs Jebeili and Mr Santina hoped they'd be living on the Gold Coast by now, but they're still renting in Sydney. (ABC News: Glenn Mullane)\n\nAfter years of delays, the move has devastated the couple, who said they had been priced out of an exploding property market.\n\n\"Even if we go more remote in Sydney or in [the] Gold Coast or anywhere ... it's going to be a struggle,\" Mr Santina said.\n\n\" We're just kind of desperate. \"\n\nParts of Urbana are complete, or almost completed. (ABC News: Glenn Mullane)\n\nStage set for a fight\n\nSunset clauses are provisions in contracts that allow a developer, or a buyer, to terminate a contract if the build isn't complete and settled before a specified date.\n\nLoading\n\nBut Urbana buyers allege developer Cadmium Land FW2 Pty Ltd has deliberately dragged its feet on construction, so it could exploit the sunset clause and resell the properties at what would now be market value.\n\nThe Brisbane developer did not respond to repeated requests for comment but has denied the allegations in correspondence seen by the ABC.\n\nMs Jebeili and Mr Santina, who are among those who hope to launch legal action against the company, said the delays and emotional toll of the past few years had been enormous.\n\nPreparations made years ago to move — as they had expected their home to be ready in 2023 — now seem in vain.\n\nMs Jebeili had enrolled in a university course in Queensland, Mr Santina told his work he'd be moving, and they enrolled their daughters in daycare in a different state.\n\n\"It's been the worst feeling I have ever had to go through,\" Ms Jebeili said.\n\n\"Not knowing where to enrol the [girls] when it comes to childcare or taking care of planning for their future education.\"\n\nThe family has struggled with the uncertainty of not knowing where to enrol their daughters in daycare and planning for the future. (ABC News: Glenn Mullane)\n\nThey had imagined their second-born Layana, who is now two-and-a-half, would be living in her own room in Queensland by now.\n\nInstead, they're still renting a too-small place in Sydney.\n\n\"They just kept giving us hope bit by bit ... and then we wait, and then we're halfway there,\" Mr Santina said.\n\n\" We decided just to be patient. \"\n\nThat patience is now wearing thin.\n\nSamuel Amey lodged a petition with the Queensland government, calling for it to bring sunset clause legislation in line with other states. (ABC News: Glenn Mullane)\n\nIn his apartment on the Gold Coast, Samuel Amey has also run out of patience.\n\nMr Amey and his now-wife Anabel Djuric signed a contract in December 2021 for a three-bedroom, $649,000 townhouse in stage three of Urbana Residences.\n\nHe said he was told it was meant to be completed in 12 months.\n\nIt's still not ready.\n\nThey too had dreams of having a bigger place than their current two-bedroom walk-up apartment so they could hopefully start a family.\n\nBut the delays to the build have meant they have put those dreams on hold for now.\n\nMr Amey says he and his wife have had to put off starting a family because of the delays. (ABC News: Glenn Mullane)\n\nJust like in Mr Santina and Ms Jebeili's case, Mr Amey's been issued with a contract termination because his sunset date has also expired.\n\nHis lawyers requested an extension, which he said was declined, leaving the newlyweds in limbo.\n\n\"It feels like such a waste ... we've put so much time and energy into this property that we were hoping to start a new life in,\" he explained.\n\n\"We've almost been held hostage and effectively been priced out of the market now.\"\n\nUrbana Residences' buyers are in the process of launching legal action against the developer. (ABC News: Glenn Mullane)\n\nDeveloper denies allegations\n\nIn a letter addressed to Duke Myrteza, who is one of the lawyers acting for the Urbana buyers, lawyers acting for the developer strongly denied the claims of deliberate delays.\n\n\"The Seller strongly denies that ... the construction of the development was delayed for any reason attributable to 'neglect' or any lack of diligence on its part,\" the response, dated July of this year, read.\n\nAustralian Law Partners' Duke Myrteza is working with Urbana Residences' buyers. (ABC News: Mark Leonardi)\n\nIn the correspondence, Cadmium Land FW2 Pty Ltd's lawyers also rejected claims of failing to pay sub-contractors or breaching any contractual obligation to the buyers.\n\n\"The Seller denies that it is in substantial breach of the Contract or that it has engaged in misleading and deceptive conduct,\" the letter stated.\n\nIt also said the buyers' allegations were lacking \"evidence\" and had been made in \"broad and sweeping terms\".\n\nMr Myrteza, along with another lawyer, is preparing legal action on behalf of about 20 Urbana buyers. (ABC News: Lottie Twyford)\n\nMr Myrteza, solicitor at Australian Law Partners, said about 20 buyers were in the process of launching legal action against the developer.\n\nHe explained the case rested on a claim the developer had breached its obligations in the contracts they later tried to cancel.\n\n\"There were significant delays in the construction of the development and completion of the townhouses,\" he claimed.\n\n\"As well as actions such as completing later stages in the development before completing earlier stages — in other words, manipulating the construction schedule to suit the developer to allow time to pass the sunset date.\n\n\"At the end of the day, all we need to establish is a breach on the part of the developer in terms of its obligations under the contract.\"\n\nSome parts of Urbana are still under construction. (ABC News: Glenn Mullane)\n\nA push to reform laws\n\nAs well as the legal action, Mr Amey also wants to see legislative changes in Queensland to tighten rules around developers using sunset clauses to terminate a contract.\n\nQueensland off-the-plan land buyers given greater protections Photo shows A man in a light blue polo and glasses looks at the camera looking despondent. Andrew and his wife bought a block of land to build their forever home. Months after signing the contract, the couple were told their contract would be terminated because the financier of the development wanted the blocks to sell for a higher price.\n\nIn particular, he wants to see Queensland bring its laws more in line with those in New South Wales, where apartment, unit and house buyers are afforded the same protections as land buyers.\n\nHe recently lodged a petition with the government, which garnered more than 1,700 signatures, urging a review of sunset clauses in off-the-plan property contracts.\n\nThe state government has announced a review of the legislation, which was last reformed in 2023 under the former Labor government.\n\nThe 2023 changes mean developers now need the written consent of buyers, or a Supreme Court order, to terminate an off-the-plan land contract using a sunset clause.\n\nBut the changes only apply to off-the-plan land sales, rather than off-the-plan property sales, leaving the Urbana buyers without that protection.\n\nAttorney-General Deb Frecklington announced in September the government would review sunset clause legislation. (ABC News: Cameron Lang)\n\nA government spokesperson said buying a property was one of the \"biggest financial commitments\" many Queenslanders would ever make.\n\n\"[The government] appreciates the huge disappointment when an off-the-plan contract is terminated through a sunset clause,\" a statement read.\n\n\"The Crisafulli government is undertaking an in-depth review of Labor’s sunset clause amendments and has invited community, industry and other stakeholders to share their views and experiences.\"\n\nMr Santina and Ms Jebeili wanted to move to Queensland for a slower pace of life. (ABC News: Glenn Mullane)\n\nWhile there's an acknowledgement any change may come too late for this group, Ms Jebeili is adamant that won't stop them from trying.\n\n\"I hope there is light at the end of the tunnel, even if it didn't work out for us,\" she said.\n\n\"At least ... I hope that some laws can get reviewed and help someone else.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/good-omen-goodeze-volunteers-transform-hospital-stays-toys/105873276",
    "title": "When 4yo Zyan was in pain, a blue knitted octopus kept him calm",
    "publish_date": "Sat, 11 Oct 2025 21:03:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "On the way to the emergency department earlier this year, Canberra mum Guinevere Laurenco worried about how her son Zyan would cope with the noisy, unfamiliar environment.\n\nHeaded straight from the GP, they did not have the chance to pack any clothes or toys for the four-year-old.\n\n\"We didn't have anything for him,\" Ms Laurenco said.\n\nZyan had been limping for a couple of days and complaining of leg pain. Suspecting it was transient synovitis, which causes hip pain and inflammation, the GP recommended they go to Canberra Hospital.\n\nZyan still treasures his 'blue squiddy' gift. (Supplied: Guinevere Lourenco)\n\nIt was an overwhelming situation for the four-year-old.\n\n\"He was in pain, he didn't know what was going on, different people [were] talking to us, [there was] a lot of crying.\n\n\" But then the front desk lady gave him a toy. From that moment he was holding it tight. \"\n\nIt was a knitted octopus, later dubbed 'blue squiddy' by Zyan.\n\n\"It was soft and small and colourful … hand-sized for him,\" Ms Laurenco said.\n\n\"He would hold it one hand, close to his chest … It was really a comfort for him throughout his stay.\"\n\nZyan's 'blue squiddy' is one of more than 6,000 handmade gifts made every year by a team of volunteers based in Canberra.\n\nTheir mission is to give comfort to patients, all while bringing a community together.\n\nEven those who aren't the most adept knitters are welcome to join the charity. (ABC News: Yasmine Wright Gittins )\n\n'It's not just a toy'\n\nThe charity Good Omen Goodeze (GOG) has been creating 'comfort goodies' for almost eight years.\n\n\n\nSince its inception by founder Mary Liondi-Barlow, the group has grown to include more than 265 volunteers.\n\nThe volunteers knit, crochet and package an assortment of gifts — blankets, teddy bears, beanies, small fidget toys.\n\nThen the goods are delivered to hospitals and health care centres across the ACT.\n\nPatients, young and old, may be handed a gift to bring them comfort during their stay.\n\nWhen Julie Samuels joined GOG, she hadn't crocheted in many years but relearnt with the help of other volunteers. (ABC News: Yasmine Wright Gittins)\n\nThey make so many gifts that committee member Julie Samuels said they were constantly calling for yarn donations on social media.\n\nMs Samuels said they were trying to show the potential of their gifts to help patients.\n\n\"It's not just a toy; it's a therapeutic comfort,\" she said.\n\nHospital and doctor visits can be overstimulating, and medical procedures can increase anxiety among patients, particularly young children.\n\nThe use of therapeutic toys in healthcare is long recognised, with most hospitals providing patients with play areas and sensory activities.\n\n\"One of the results of our quality assessment is that when they use the toys, the kids', the adults', and this is unexpected, the staffs' stress levels reduced ... and facilitated them being able to then treat the children quickly,\" Ms Samuels said.\n\nShe said the goodies could also have potentially long-term benefits with patients able to take them home.\n\n\"They become a safety item.\"\n\nThe hum of voices and clacking of knitting needles sets the scene for the weekly catch-up. (ABC News: Yasmine Wright Gittins)\n\nReaching the socially isolated\n\nFrom conversations in the knitting aisle at Spotlight, to community outreach programs, the charity draws in volunteers from across Canberra.\n\nMs Samuels said it was part of GOG's mission to bring volunteers together in a way that transcended language, age and cultural barriers.\n\n\"It's a place for Canberrans to come that's safe, respectful. They can volunteer, they can meet new friends, enjoy new connections,\" she said.\n\n\"There are a lot of people who are socially isolated in Canberra. It is an epidemic.\"\n\nCritically, the catch-ups are coupled with a sense of purpose.\n\nDeidre McCurdy says she \"gets withdrawals\" if she misses one of the catch-ups. (ABC News: Yasmine Wright Gittins )\n\n\"For those that have been that have been socially isolated, it gives them a sense of pride, helps the self-esteem, helps self-confidence,\" Ms Samuels said.\n\nIt is something to which Deidre McCurdy can attest.\n\nMs McCurdy moved from Queensland just two and a half years ago with her son and daughter-in-law. While Canberra is not her original home, she found her place at GOG.\n\n\"I really had no friends here whatsoever,\" she said.\n\nWhen she was invited to join the group, that changed.\n\n\"I absolutely love it here, met so many nice people, it's a lovely group to join,\" she said.\n\n\"I'm just so glad I found them because it has kept my sanity in check … I get withdrawals, I think, if I don't come here each week.\"\n\nThe 86-year-old has been knitting since she was eight and finds joy in making goodies like her knitted bears.\n\n\"It's so pleasing to think that you've done something that a child or an adult really likes,\" she said.\n\n\" I can keep knitting if this is the reaction that we are getting from people in hospital. \"\n\nHandmade chickens, dolls and creatures are some of the most popular gifts. (ABC News: Yasmine Wright Gittins)\n\nA good, lasting memory\n\nZyan was back to his normal four-year-old self after a couple of days in hospital.\n\nBut he still treasures his 'blue squiddy' gift.\n\nMs Laurenco said when moving house recently, he was quick to make sure 'blue squiddy' was not lost in the move.\n\n\" He knows and he remembers — he still remembers getting this from the 'big hospital'. \"\n\nShe hopes that it will make future hospital visits easier and leave Zyan with positive feelings about the hospital.\n\n\"It was a good memory amongst a situation that is not easy,\" she said.\n\n\"We greatly appreciate it as a family and on his behalf.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/koori-formal-motivates-students-to-finish-high-school/105758224",
    "title": "Two aunties' idea for year 12 celebration thrives after almost two decades",
    "publish_date": "Sat, 11 Oct 2025 21:02:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Attending the Koori Formal is becoming a proud tradition for Indigenous students on the New South Wales Mid North Coast such as Shaylor Thompson.\n\nThe Dunghutti teen has always lived in Kempsey and was one of 30 First Nations students from across four Macleay Valley high schools who recently graduated from year 12.\n\nMacleay Valley high school students gathered at Melville High School in Kempsey for the annual Koori Formal. (ABC Mid North Coast: Sophia McCaughan)\n\n\"It's really good to see everyone else succeed and finish year 12,\" she said.\n\n\" Not a lot of kids get that opportunity, especially around … Kempsey. \"\n\nThe formal was an occasion to cherish.\n\n\"It's been really good and exciting, it's great to see all the families here watching their babies get to graduate,\" Shaylor said.\n\nGraduation rates\n\nUsing the most recent census data, the National Indigenous Australians Agency found non-Indigenous Australians aged between 20 and 24 we 1.3 times more likely to have completed year 12 or an equivalent level of study.\n\nThe situation was something local elders Aunty Jackie Welsh and Aunty Natalie Smith have long been determined to address.\n\nJackie Welsh and Natalie Smith came together nearly 20 years ago to found the Koori Formal. (ABC Mid North Coast: Sophia McCaughan)\n\nAbout 17 years ago the aunties, who worked as Aboriginal Education Officers at the time, hatched an idea to hold a special dinner for First Nations graduates in a bid to motivate others to stick with their high school education.\n\n\"It gave us an opportunity for everyone to come together and celebrate, without all the frictions that may be present in the wider community,\" Aunty Natalie said.\n\nThey took their idea to the principals of Melville and Kempsey high schools, which paid for the first Koori Formal.\n\nFirst Nations students celebrate reaching year 12 and graduating. (ABC Mid North Coast: Sophia McCaughan)\n\nThe event has since expanded to celebrate all Indigenous graduates across Macleay Valley high schools, with more than 200 tickets sold this year.\n\nFor Aunty Jackie, making sure the event is accessible for all to attend is crucial.\n\n\"The Koori Formal is just about the kids and their parents, so the parents can congratulate their kids and be proud of their kids for reaching that level,\" she said.\n\n\"A lot of parents and their kids don't go to the main formal … it could be the cost or that they have limited numbers that can go.\"\n\nOvercoming challenges\n\nIsiah Heuston, who is a Gumbaynggirr teenager living on Dunghutti country, was among those at this year's Koori Formal hosted at Melville High School.\n\nIsiah Heuston has plans to go to university after graduating. (ABC Mid North Coast: Sophia McCaughan)\n\nHe was the 2025 vice-captain of Melville High and says the Koori Formal was a big motivator that helped him complete his final years of school.\n\n\"There definitely have been a few challenges, ups and downs throughout high school but I've overcome them, whether it be teacher support or through Mum and Dad,\" he said.\n\n\" Dad said no matter what I do in the HSC or whatever it may be, he's proud of me, I got here in the end. \"\n\nMelville High School principal Andrew Ryder said the Koori Formal was a celebration of a major educational milestone for First Nations students.\n\nAndrew Ryder says he is immensely proud of all the First Nations students graduating. (Supplied: Kim Ambrose)\n\n\"It's fantastic, it really is a great achievement for all the schools to get their students to the HSC and to graduate high school,\" he said.\n\nIn the nearly two decades the Koori Formal has been running, it has never missed a year, even during the coronavirus pandemic when it had to be held online.\n\nThe Koori Formal in Kempsey has run every year for nearly two decades. (Supplied: Kim Ambrose)\n\nFormer student and 2024 graduate Zailen Campbell-Cook Flanders attended the formal this year with his sister.\n\n\"She's done well to follow in my footsteps, and finish school, I'm proud of her,\" Zailen said.\n\n\"I reckon a Koori Formal should be done for all Indigenous students around New South Wales or even Australia,\" he said.\n\nZailen Campbell-Cook Flanders attended this year's Koori Formal with his sister. (ABC Mid North Coast: Sophia McCaughan)\n\nThe state's Education Department says, from 2022 to 2024, the number of First Nations students enrolled in year 12 on the Mid North Coast grew by 7.9 per cent.\n\nA similar event was held on the state's south coast, where Catholic and independent high schools gathered on Dharwal lands for their fourth annual Deadly Grad.\n\nMore than 200 people attended the Koori Formal earlier this year at Melville High School. (ABC Mid North Coast: Sophia McCaughan)\n\nKoori Formal founders Aunty Jackie and Aunty Natalie hope their legacy continues well into the future.\n\n\"Whoever takes over from me and Natalie in the future, I'd like to see that they will continue and encourage the parents and kids to be part of it,\" Aunty Jackie said.\n\n\"The foundations are already built there, I'd like to see somebody continue it.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-12/michael-storer-il-lombardia-tadej-pogacar/105881846",
    "title": "Storer makes Aussie cycling history but is no match for Pogačar at Il Lombardia",
    "publish_date": "Sat, 11 Oct 2025 20:52:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "Michael Storer has made cycling history by becoming only the second Australian rider in 120 years to make the podium at the Tour of Lombardy monument classic, but he was still a distant sideshow to one final amazing Tadej Pogačar solo triumph of 2025.\n\nPerth rider Storer battled magnificently over the final climb for third place, but couldn't live with the \"big two\" Pogačar and Olympic champion Remco Evenepoel as they embarked on their latest one-sided duel in Italy on Saturday.\n\nAfter soloing away from his Belgian rival at the World and European road race championships over the previous two weekends, Pogačar again proved unstoppable as he made his decisive kick 36 kilometres from home on the final, bruising Passo di Ganda climb.\n\nIn his final hurrah of what he feels is his best season yet, four-time Tour de France champ Pogačar won by one minute 48 seconds, equalling the great Italian Fausto Coppi's five victories in Il Lombardia while also becoming the first man ever to win the race five years in succession.\n\nIt was the crowning glory to another astounding season in which the Slovenian master won the Tour, the world and European titles, three Monuments — Lombardy, Liège-Bastogne-Liège and Ronde van Vlaanderen — the Critérium du Dauphiné and UAE tours, as well as the La Flèche Wallonne and Strade Bianche classics.\n\nTogether with his second place finish at Paris-Roubaix and third at Milan-SanRemo, Pogačar is the first rider in history to finish on the podium of all five Monuments in a single season.\n\nIt was his 20th win altogether in 2025, so Tudor Pro's Storer could probably feel it was a considerable achievement just to have finished only 3:14 behind Pogačar, who took victory after 5 hours 45 minutes and 53 seconds in the saddle.\n\nTadej Pogacar added yet another win to his 2025 record. (Getty Images: Dario Belingheri)\n\nTudor could also look back on his best season yet after a terrific ride over the 241km course from Como to Bergamo.\n\nThe 28-year-old had tried to go with Evenepoel after they had both been left for dead by the Slovenian, but he was distanced by the Belgian superstar over the final 10km and battled home for the third spot, 25 seconds clear of American Quinn Simmons.\n\nIt represented another breakthrough ride for Storer, who becomes the only Australian apart from Phil Anderson in 1986 to make the podium at the Tour of Lombardy since its inception in 1905.\n\nIt was also Storer's maiden Monument podium in a year when he also earned his first stage victory at Paris-Nice, followed by both a stage win and the overall triumph in Tour of the Alps.\n\nHe also finished in the top-10 in the Giro d'Italia and recently won the prestigious Memorial Pantani race.\n\nThere was a strong Australian showing all round, with Jay Vine still managing to finish ninth while working for his UAE Team Emirates leader Pogačar, Ben O'Connor 18th and Michael Matthews 21st.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-fringe-2025-wrap-2-20251009-p5n1ds.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I haven’t laughed so hard in a long while’: The latest Fringe reviews are here",
    "publish_date": "Sun, 12 Oct 2025 12:34:27 +1100",
    "category": "entertainment",
    "authors": [
      "Guy Webster",
      "John Bailey",
      "Lefa Singleton Norton",
      "Nell Geraets",
      "Sonia Nair"
    ],
    "text": "Sheppard’s performance is loaded with hilarious subversion, packing in camp and toilet humour, outrageous physical comedy and pop-cultural lampoon, alongside cheerful critique of existing aesthetic hierarchies. It lobs lightning bolts at every vice (and many a sacred cow) in theatrical and critical culture, and the comedic storm she whips up has a smiling eye of calm in West’s divine presence. Carly Sheppard’s performance is loaded with hilarious subversion Credit: Jacinta Keefe I haven’t laughed so hard in a long while. Anyone involved in the theatre world will marvel at how up-to-the-minute the comedy is; fans of super irreverent humour generally – South Park leaps to mind – should love this show, too. Although – like South Park – it might be too “tasteless” for some, there’s genuine liberation in satire this fearless and clever, and to me, the show’s dissection of the politics of taste is all part of its charm. ★★★★\n\nReviewed by Cameron Woodhead\n\nTHEATRE\n\nMammalian Diving Reflex | Nightwalks with Teenagers\n\nWerribee (various locations), season ended Nightwalks with Teenagers took place in Werribee as part of Melbourne Fringe Festival Reviewing a work by Mammalian Diving Reflex is a bit like reviewing the last conversation you had. The Canada-based company makes “socially engaged participatory performance” which usually involves assembling folks who might never otherwise cross paths, providing them a structure through which to interact, and then just seeing what happens. In this case you’re invited to wander the backstreets and public gardens of Werribee for a few hours in the company of more than a dozen local teens. They’ve designed activities to explore along the way, from a dance-off and karaoke to a bunch of getting-to-know-you games, and while there’s no spectacle or showstopping moment, there are countless opportunities for real connections to be made along the way. It’s a gentle rebuke to the reductive image of troubled teens that generates headlines, and a reminder that today’s youth have much more in common with yesterday’s than we might realise.\n\n★★★★\n\nReviewed by John Bailey\n\nCOMEDY\n\nChelsea Heaney | I Swear I’m Funny\n\nMotley Bauhaus, until October 12 When a performer opens the show sashaying down the aisle delivering an absurd burlesque-style striptease, the assurance in the title – I Swear I’m Funny – hardly seems necessary; the audience is already laughing. Chelea Heaney performs at Motley Bauhaus until October 12. Credit: Nathan Smith Having won over the room, Chelsea Heaney sets about examining what influences have turned her into the funny woman on stage before us. A task predominantly undertaken through standup, peppered with a skit or two, a song and some physical comedy. These interludes are pitch-perfect both in musical ability and comedic timing. No surprise then that she lists musical theatre as one of the reasons she’s funny alongside family, eavesdropping and more. Heaney knows how to set up an anecdote for maximum laughter payoff, delivering punchlines and unexpected twists with theatre-kid aplomb. A nod should also go to her skilful audience interactions, which add charming touches to her stories. The show comes together as a satisfyingly energetic and charismatic whole.\n\n★★★★\n\nReviewed by Lefa Singleton Norton\n\nCIRCUS\n\nCasey Lorae | La Folie After Dark\n\nGasworks Theatre, until October 11 La Folie After Dark is on at Gasworks Theatre until October 11. Credit: All The Feels Photography It begins with a warning: brace yourself for “blasphemy, BDSM and assault”. Seated in a dark, hazy room looking at a suspended hoop and chains, it’s not entirely clear what you’ve walked into. But once the first performer contorts her body, uncertainty is replaced by sheer awe. Metres in the air, she lifts and twists her body effortlessly, draping her limbs around the hoop as if she were liquid. The power of the human body is on full display, whether on a hoop, trapeze, silks or straps. Artists freefall from ceiling-height, do the splits in midair, and lift other artists by the neck with their feet. It defies belief yet appears so sultry and seamless. Though each individual act astounds, the production as a whole lacks cohesion. A baffling attempt to link two performances using a prop cup interrupts your stunned reverie. La Folie struggles to connect the dots, but it’s still testament to the breathtaking strength and seductiveness of the human form.\n\n★★★\n\nReviewed by Nell Geraets\n\nTHEATRE\n\nDylan Murphy and Tom Henry Jones | In the Dark\n\nTrades Hall, until October 12 Somewhere in a secret bunker, five comedians are waiting for electricity to be siphoned from a dystopian wasteland so they can start their humble radio show: the right hand of an authoritarian regime trying to calm rebellion via foley artistry, morality tales and theatricalised propaganda. Imagine an Orwellian Orson Welles, or The Hunger Games as an interwar broadcast. The rebels are outside, the disembodied voice of your big brother-like leader is waiting to deliver performance notes via firing squad, and there’s a piss bucket if you need it. In the Dark performs at Trades Hall until October 12. Credit: Dylan Murphy It’s a fantastic premise, and writers Dylan Murphy and Tom Henry Jones have assembled a stellar cast to pull it off. Hannah Camilleri transforms into a crow with the flap of a plastic tree and an uncanny squawk. Maria Angelico switches from bawdy milk maid to doe-eyed lover with ease. And Mark Mitchell’s sonorous voice is perfect as the veteran actor desperate to appeal to butter-churning women aged 16 to 25. But too much exposition ties the script in knots. And moments of foley artistry – often the most interesting part of theatricalised radio plays – are too underdeveloped to justify why the show has been staged at all. Ultimately, this killer cast is not given enough to do, and this killer premise fails to find its feet.\n\n★★\n\nReviewed by Guy Webster",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/national/victoria/melbourne-marathon-2025-live-updates-olympians-celebrities-take-to-city-s-streets-for-major-running-event-20251010-p5n1n0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Melbourne Marathon 2025 live results: Rayner takes out marathon; Adams takes out win on debut",
    "publish_date": "Sun, 12 Oct 2025 12:09:12 +1100",
    "category": "sports",
    "authors": [
      "Ashleigh Mcmillan",
      "Carolyn Webb",
      "Jackson Graham"
    ],
    "text": "Having never ran a marathon before, plenty of questions ran through Caitlin Adams’ mind before lining up at the start this morning: “When’s the wall going to hit? How hard does it get?”\n\nShe knew winning was a possibility but still had her doubts. She finished the women’s marathon in a winning time of 2:30:26.\n\nCaitlin Adams won the Melbourne Marathon on Sunday. Credit: Jackson Graham\n\n“I’m just so glad that I’ve done one and know what it’s all about,” she said.\n\n“I had so much support out on course. My coach and my partner were there on bikes … I didn’t have to do a lot of thinking out there.”\n\nShe did feel the wall at around 35 kilometres.\n\n“Even with 3 kilometres to go. I thought, heck, like, this is the longest 3 kilometres that I have ever done.”",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/business/companies/anz-braces-for-the-nuno-effect-as-new-boss-prepares-his-big-reveal-20251008-p5n0w4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ANZ braces for the Nuno effect as new boss prepares his big reveal",
    "publish_date": "Sun, 12 Oct 2025 12:05:30 +1100",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "ANZ Group’s underperforming retail business is likely to bear the brunt of the jobs carnage about to hit the bank over the next 12 months, as its new boss, Portuguese banking veteran Nuno Matos, gets ready to deliver a clear strategy to investors on Monday.\n\nMatos, who joined the bank in July, has made it clear that the bank needs a significant overhaul to help shed its reputation as the worst performer among the Big Four. However, his tenure so far has been blemished with errors that highlighted the execution risks threatening Matos’ planned makeover.\n\nANZ chief executive Nuno Matos flagged deep job cuts last month but has yet to unveil the strategy that will lift ANZ’s performance. Credit: Marija Ercegovac\n\nMatos missed out on the top job at HSBC before joining ANZ and has been employed explicitly to transform an organisation with a poor record of execution. And he will have fresh help.\n\nAhead of the strategy reveal, Matos last week announced three big hires, including the appointment of Pedro Rodeia as the new head of ANZ’s retail bank to replace Maile Carnegie.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/culture/movies/seven-of-diane-keaton-s-most-iconic-and-memorable-roles-20251012-p5n1th.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Seven of Diane Keaton’s most iconic and memorable roles",
    "publish_date": "Sun, 12 Oct 2025 11:57:10 +1100",
    "category": "entertainment",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "In it, Keaton plays the former girlfriend of neurotic comedian Alvy Singer (Woody Allen), who attempts to understand why their relationship ended. Loading Keaton and Allen, who were romantically involved and had a longstanding professional relationship, first worked together in the 1969 Broadway production of Play It Again, Sam. They worked on eight films together between 1971 and 1993 and remained close friends. She stood by Allen amidst allegations of sexual abuse towards his and Mia Farrow’s daughter, Dylan. Despite this, Farrow mourned Keaton’s death on Instagram in a post on Sunday, writing: “She was an absolutely wonderful actress – and a rare and fascinating person. Thoughts with her children and sisters. Rest in peace Diane.”\n\nThe role won Keaton her first Oscar for Best Actress at the 1977 Academy Awards, while the film took out the Best Picture award. In her acceptance speech for the award, Keaton oozed her signature offbeat charm, beaming from the stage: “well then, this is terrific. It’s simply terrific.” Reds (1981) Diane Keaton opposite Warren Beatty - with whom she was also romantically involved - in the acclaimed film, Reds. Credit: At the height of her fame, Keaton starred alongside Warren Beatty – with whom she was also romantically involved – in the historical epic Reds (1981).\n\nThe film, which Beatty also directed, traces the true story of American journalist John Reed who covered The October Revolution – the second of two revolutions in Russia led by Vladimir Lenin’s Bolsheviks. Keaton plays American journalist and suffragist Louise Bryant, who joins Reed and a community of activists in New York. The film won Best Director and Best Cinematography at the Academy Awards, and earned Keaton a Best Actress nomination. It was screened at The White House for then-president Ronald Reagan. In 2020, New York Magazine included it in its list of “The Best Movies Which Lost Best Picture at the Oscars”. Father of the Bride (1991) Diane Keaton, Martin Short and Steve Martin in Father of the Bride. Credit: Touchstone Pictures\n\nIn 1991, Keaton starred alongside Steve Martin and Martin Short in family favourite Father of the Bride, a remake of the 1950 film of the same name. Her second of four films with American filmmaker Nancy Meyers (Baby Boom, Something’s Gotta Give and Father of the Bride II), Keaton plays Nina Banks, a steady and devoted mother and wife who supports her husband George (Steve Martin) as he begins to unravel following the news of his daughter’s engagement. A critical and box office success, the film led to a sequel released in 1995. The First Wives Club (1996) Goldie Hawn, Diane Keaton and Bette Midler in The First Wives Club. Credit: Paramount In 1996, Keaton starred alongside Goldie Hawn and Bette Midler in The First Wives Club, a comedy about three divorcees seeking revenge against their husbands for leaving them for younger women.\n\nLoading In the film, Keaton’s character Annie has separated from her advertising executive husband, is in therapy for self-esteem issues and remains hopeful the two will reconcile. Grossing US$181 million worldwide, the film was a box-office hit and garnered a cult-following among middle-aged women. The third sequel to the film, Book Club: The Next Chapter, released in 2023, is one of Keaton’s last projects. On Sunday, Bette Midler took to Instagram to pay tribute to her late co-star, writing: “She was hilarious, a complete original, and completely without guile, or any of the competitiveness one would have expected from such a star. What you saw was who she was…oh, la, lala!”\n\nGoldie Hawn also paid tribute, writing: “You stole the hearts of the world and shared your genius with millions, making films that made us laugh and cry in ways only you could. I was blessed to make First Wives Club with you, our days starting with coffee in the makeup trailer, laughing and joking, right through to the very last day of filming. It was a roller coaster of love.” Marvin’s Room (1996) With Leonardo DiCaprio and Meryl Streep in Marvin’s Room. Credit: Miramax Films; Phillip V. Caruso In 1996, Keaton starred in Jerry Zaks’ drama Marvin’s Room as Bessie, the primary caregiver for her father Martin. When she is diagnosed with leukemia – the same disease which killed her mother – she turns to her estranged sister Lee (Meryl Streep) for help. A young Leonardo DiCaprio also stars as the teenage son of Lee. A New York Times review at the time credited the film’s “powerhouse casting” with lending depth to the screen adaptation and praised Keaton’s performance.\n\n“Ms. Keaton works wonders in making Bessie much more than an advertisement for noble sacrifice, though she still must do a good deal of figurative smiling through her tears,” it read. For her performance, Keaton received nominations for an Academy Award for Best Actress, the Critic’s Choice Movie Award for Best Actress and the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role. Something’s Gotta Give (2003) Jack Nicholson and Diane Keaton in Something’s Gotta Give. Credit: AP Keaton’s comedic prowess shines in her fourth project in a longstanding, close working relationship with Nancy Myers, the 2003 romantic comedy Something’s Gotta Give.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/business/consumer-affairs/qantas-customer-data-put-on-dark-web-as-hackers-deliver-on-threat-20251012-p5n1tw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Qantas customer data put on dark web as hackers deliver on threat",
    "publish_date": "Sun, 12 Oct 2025 11:32:49 +1100",
    "category": "finance",
    "authors": [
      "Supratim Adhikari",
      "Chris Zappone"
    ],
    "text": "Hackers have released personal data of 5.7 million Qantas customers on the dark web, making good on their promise to publish the information stolen from the airline’s system this year.\n\nQantas is one of 40 companies (including Toyota, Disney, Ikea, Air France and KLM) compromised by hacker collective Scattered Lapsus$ Hunters, which stole almost 1 billion records by targeting customers of cloud technology giant Salesforce in July.\n\nQantas Airways suffered a data breach in July and the hackers demanded $1 million. Credit: Bloomberg\n\nThe hackers did not break into Salesforce’s system. Instead, they called the IT helpdesks of the 40 companies – posing as legitimate employees – and convinced them to get access to the systems. In Qantas’ case, a call centre based in the Philippines was reportedly targeted by the hackers.\n\nHaving set a deadline of leaking the data over the weekend unless ransoms were paid by either Salesforce or Qantas, the hackers released passenger information on Saturday (Australian time).",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/bathurst-1000-live-who-will-be-crowned-king-of-mount-panorama-20251012-p5n1u5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bathurst 1000 LIVE: Who will be crowned king of Mount Panorama?",
    "publish_date": "Sun, 12 Oct 2025 11:09:48 +1100",
    "category": "finance",
    "authors": [
      "Iain Payten",
      "Robert Dillon"
    ],
    "text": "Defending champion Brodie Kostecki will attempt to retain Bathurst 1000 crown on Sunday in a Ford Mustang his team claims is at an “irrefutable” disadvantage because of the inaction of Supercars officials.\n\nA controversial statement released by Dick Johnson Racing on Saturday night - within hours of Kostecki claiming pole position and Ford snaring the first four positions on the grid - has questioned the credibility of this year’s great race.\n\nIn the statement, DJR said that for more than two years they had been arguing their rival Chevrolet Camaros (General Motors) had an advantage over the Mustangs at Bathurst’s altitude.\n\nFord has not won at Mt Panorama since 2019.\n\nDJR said Supercars testing leading up to this year’s race had verified that barometric pressure gave the Camaros “an additional 10 horsepower over the Ford engine above 5900 rpm, where the engine operates for 94 per cent of a lap of Mount Panorama at full throttle. This data explains why the Mustang is slower than the Camaro in a straight line at Bathurst.”\n\nDJR said the governing body had “confirmed the problem exists. They know how to fix it. They chose not to.”\n\nBrodie Kostecki’s Mustang has earned him pole position. Credit: Getty Images\n\nThey added that General Motors, which manufactures the Camaros, had opposed any modifications.\n\nDJR appealed to stewards to resolve the dispute but said “they lacked the necessary jurisdiction to apply the remedy sought”.\n\nThe DJR statement declared “parity is the foundation of the Supercars Championship” and “Supercars have failed to implement it on the basis that GM [General Motors] declined to agree to it … Supercars chose consultation with GM over correction. They chose politics over parity.”\n\nBrodie Kostecki celebrates after winning pole position at Bathurst on Saturday. Credit: Getty Images\n\nDJR said Kostecki and the team had been “extraordinary” in winning qualifying and securing pole but warned: “Winning will require us to be more extraordinary than ever, as we will do so knowing we’re racing with one hand tied behind our back.“\n\nDespite that, they added: “We accept their decision, we move on … we didn’t come to Bathurst to make excuses. We came to win.”\n\nRacing legend Dick Johnson.\n\nWhile he was outspoken on Friday, Kostecki was giving little away on Saturday, preferring to focus on his achievement of joining legends Peter Brock and Allan Moffat in securing three consecutive poles at the mount.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/afl/petracca-eyeing-move-to-the-suns-20251012-p5n1uj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Petracca eyeing move to the Suns",
    "publish_date": "Sun, 12 Oct 2025 11:09:17 +1100",
    "category": "sports",
    "authors": [],
    "text": "Petracca eyeing move to the Suns\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/perth-the-crown-jewel-of-wwe-as-franchise-s-biggest-stars-fly-west-20251012-p5n1u1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Perth the Crown Jewel of WWE as franchise’s biggest stars fly west",
    "publish_date": "Sun, 12 Oct 2025 10:31:33 +1100",
    "category": "sports",
    "authors": [
      "Cameron Myles"
    ],
    "text": "While wrestling fans packed Perth’s CBD on Friday hoping to catch a glimpse of one of the WWE’s biggest stars, it was, predictably, WA Premier Roger Cook who scored a selfie with John Cena.\n\nOr, as the running joke goes, Cook got a photo of himself and some WWE belts.\n\nWA Premier Roger Cook poses for a photo with WWE superstar John Cena. Credit: Facebook/Roger Cook\n\nThe wrestling roadshow has rolled into town as part of a weekend “takeover” of three shows at RAC Arena, and Saturday’s Crown Jewel: Perth was the main event.\n\nThe was broadcast around the world via Netflix as part of a mega-deal struck between the streamer and WWE, and was also shown on ESPN in the United States.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/annie-hall-to-coastal-grandma-the-legacy-of-diane-keaton-s-style-20251012-p5n1tc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Annie Hall to Coastal Grandma: The legacy of Diane Keaton’s style",
    "publish_date": "Sun, 12 Oct 2025 10:16:53 +1100",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "Before stylists and designers moulded actresses into red carpet advertisements for luxury labels, Diane Keaton cultivated an individual approach to androgynous dressing that resonated with women around the world.\n\nQuirky combinations of baggy trousers, waistcoats, ties and hats from the star who has died at the age of 79, eschewed the traditional glamour of taffeta, silk and lace, projecting the image of a woman who wasn’t waiting for men to open doors for her.\n\nDiane Keaton in Ralph Lauren attire on set with director Woody Allen during the filming of Annie Hall. Credit: Getty Images\n\nIt was a timely update of silver screen stars’ Marlene Dietrich’s tuxedos and Katharine Hepburn’s turtlenecks and wide-legged trousers.\n\nDesigner Ralph Lauren is often credited with launching Keaton as a fashion icon in the 1977 Woody Allen movie Annie Hall, but the Oscar-winning actress was responsible for her character’s eclectic output.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/hull-are-crowned-champions-20251012-p5n1u2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hull are crowned champions",
    "publish_date": "Sun, 12 Oct 2025 10:05:38 +1100",
    "category": "sports",
    "authors": [],
    "text": "Hull are crowned champions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/djokovic-stunned-by-world-no-204-20251012-p5n1u3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Djokovic stunned by world No.204",
    "publish_date": "Sun, 12 Oct 2025 10:05:27 +1100",
    "category": "finance",
    "authors": [],
    "text": "Djokovic stunned by world No.204\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/queensland/teen-in-critical-condition-after-queensland-shark-attack-20251012-p5n1tr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Teen in critical condition after Queensland shark attack",
    "publish_date": "Sun, 12 Oct 2025 09:55:12 +1100",
    "category": "lifestyle",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "A teenage boy is in a critical condition after being bitten on the stomach by a shark in waters off Thursday Island in Far North Queensland on Saturday evening.\n\nEmergency services were called to Cook Esplanade on the western side of Thursday Island at 6.23pm after reports that a male in their mid-teens had been attacked by a shark while swimming.\n\nThe boy suffered significant abdominal injuries and was transported to Thursday Island Hospital before being airlifted in a life-threatening condition to Townsville University Hospital.\n\nA spokesperson for the hospital confirmed the boy’s condition remained critical on Sunday morning.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/article/oscar-winning-actress-diane-keaton-dies-at-79/c5xrom26x",
    "title": "Diane Keaton, star of Annie Hall and The Godfather, dies at 79",
    "publish_date": "Sat, 11 Oct 2025 20:47:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Diane Keaton, the Oscar-winning star of Annie Hall, The Godfather films and Father of the Bride, whose quirky, vibrant manner and depth made her one of the most singular actors of a generation, has died. She was 79.\n\n\n\n\n\nPeople Magazine reported on Sunday AEDT that she died in California with loved ones, citing a family spokesperson. No other details were immediately available, and representatives for Keaton did not immediately respond to inquiries from The Associated Press.\n\n\n\n\n\nThe unexpected news was met with shock around the world.\n\n\n\n\n\n\"She was hilarious, a complete original, and completely without guile, or any of the competitiveness one would have expected from such a star. What you saw was who she was…oh, la, lala!,\" Bette Midler said in a post on Instagram. She and Keaton co-starred in The First Wives Club.\n\n\n\n\n\nKeaton was the kind of actor who helped make films iconic and timeless, from her \"La-dee-da, la-dee-da\" phrasing as Annie Hall, bedecked in that necktie, bowler hat, vest and khakis, to her heartbreaking turn as Kay Adams, the woman unfortunate enough to join the Corleone family.\n\n\n\nGoldie Hawn (left), Diane Keaton (centre) and Bette Midler co-starred in the revenge comedy, The First Wives Club. Source: AP / Frank Wiese Her star-making performances in the 1970s, many of which were in Woody Allen films, were not a flash in the pan either, and she would continue to charm new generations for decades.\n\n\n\n\n\nShe played a businessperson who unexpectedly inherits an infant in Baby Boom, the mother of the bride in the beloved remake of Father of the Bride, a newly single woman in The First Wives Club, and a divorced playwright who gets involved with Jack Nicholson's music executive in Something's Gotta Give.\n\n\n\n\n\nKeaton won an Oscar for Annie Hall in 1978 and would go on to be nominated three more times, for Reds, Marvin's Room and Something's Gotta Give.\n\n\n\nDiane Keaton partnered with Jack Nicholson (centre) in Something's Gotta Give - her favourite film. Source: AP / Jan Bauer Keaton was born Diane Hall in January 1946 in Los Angeles and was drawn to theatre and singing while in school.\n\n\n\n\n\nShe dropped out of college after a year to make a go of it in Manhattan. Actors' Equity already had a Diane Hall in their ranks, and she took Keaton, her mother's maiden name, as her own.\n\n\n\n\n\nShe started on the stage as an understudy in the Broadway production for Hair, and in Allen' s Play It Again, Sam in 1968, for which she would receive a Tony nomination.\n\n\n\n\n\nKeaton made her film debut in the 1970 romantic comedy Lovers and Other Strangers, but her big breakthrough would come a few years later when she was cast in Francis Ford Coppola's The Godfather, which won best picture and become one of the most beloved films of all time.\n\n\n\nShe won a best actress Oscar for playing the title role in the Woody Allen comedy Annie Hall. Source: AP / Chris Pizzello The 1970s were an incredibly fruitful time for Keaton thanks in part to her ongoing collaboration with Allen in both comedic and dramatic roles. She appeared in Sleeper, Love and Death, Interiors, Manhattan, Manhattan Murder Mystery and the film version of Play it Again, Sam.\n\n\n\n\n\nAllen gave Keaton one of her most iconic roles in Annie Hall, the infectious woman from Chippewa Falls whom Allen's Alvy Singer cannot get over. The film is considered one of the great romantic comedies of all time, with Keaton's eccentric, self-deprecating Annie at its heart.\n\n\n\n\n\nIn the New York Times, critic Vincent Canby wrote, \"As Annie Hall, Miss Keaton emerges as Woody Allen's Liv Ullman. His camera finds beauty and emotional resources that somehow escape the notice of other directors. Her Annie Hall is a marvellous nut\".\n\n\n\n\n\nKeaton and Allen were also in a romantic relationship, from about 1968, when she met him while auditioning for his play, until about 1974. Afterward they remained collaborators and friends.\n\n\n\n\"He was so hip, with his thick glasses and cool suits,\" Keaton wrote in her memoir.\n\n\n\n\n\n\"But it was his manner that got me, his way of gesturing, his hands, his coughing and looking down in a self-deprecating way while he told jokes.\"\n\n\n\n\n\nShe was also romantically linked to Al Pacino, who played her husband in The Godfather, and Warren Beatty who directed her and whom she co-starred with in Reds. She never married but did adopt two children when she was in her 50s: a daughter, Dexter, and a son, Duke.\n\n\n\n\n\n\"I figured the only way to realise my number-one dream of becoming an actual Broadway musical comedy star was to remain an adoring daughter. Loving a man, a man, and becoming a wife, would have to be put aside,\" she wrote in the memoir.\n\n\n\n\n\n\"The names changed, from Dave to Woody, then Warren, and finally Al. Could I have made a lasting commitment to them? Hard to say. Subconsciously I must have known it could never work, and because of this they'd never get in the way of achieving my dreams.\"\n\n\n\n\n\nIn the remake of Father of the Bride, Keaton and Steve Martin played the flustered parents to the bride which would become a big hit and spawn a sequel.\n\n\n\n\n\nIn Something's Gotta Give in 2003 she begins a relationship with a playboy womaniser, played by Jack Nicholson, while also being pursued by a younger doctor, played by Keanu Reeves.\n\n\n\n\n\nHer character Erica Barry, with her beautiful Hamptons home and ivory outfits was a key inspiration for the recent costal grandmother fashion trend. It earned her what would be her last Oscar nomination and, later, she'd call it her favourite film.\n\n\n\n\n\nKeaton continued working steadily throughout the 2000s, with notable roles in The Family Stone, as a dying matriarch reluctant to give her ring to her son, in Morning Glory, as a morning news anchor, and the Book Club films.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/article/potato-mop-top-virus-management/hsbsfzew1",
    "title": "Australia's potato capital is facing a threat never-before-seen in the country",
    "publish_date": "Fri, 10 Oct 2025 19:34:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Stuart Applebee has been growing potatoes in north-west Tasmania for decades.\n\n\n\n\n\nPotato mop top virus (PMTV) isn't the first disease he's dealt with but hearing it has made its way into his state was a blow.\n\n\n\n\n\n\"Like any new virus, it's quite concerning when you know you're probably the first state to be detected in the country with it,\" he told SBS News.\n\n\n\n\n\n\"Once we found out a little bit more out of New Zealand and a couple of other countries that are dealing with it, that probably relaxed my own thoughts a little bit.\"\n\n\n\n\n\nPotato mop top virus isn't a threat to human health but it can affect the skin and flesh of potatoes and impact crop yields.\n\n\n\nPotato mop top virus affects the skin and flesh of potatoes and impacts crop yields. Source: Supplied / Tasmanian Government It was first detected on a farm in north-west Tasmania in July, also marking the first time it's been found in Australia.\n\n\n\n\n\nTesting in Tasmania ahead of planting saw 1,700 tonnes of infected seed potatoes destroyed, with calls for a federal assistance package for affected farmers. Concerns also remain about how it got here.\n\n\n\n\n\n\"The most concerning thing about the mop top incursion into Tasmania is that this isn't just the first time the virus has been detected in Tasmania, but it's also the first time that it's been detected within Australia,\" TasFarmers CEO Nathan Calman said.\n\n\n\n\n\n\"Its presence here represents a failure of our national biosecurity protocols, but also our state biosecurity protocols.\"\n\n\n\n\n\nA spokesperson for the Department of Agriculture, Fisheries and Forestry told SBS the current government has committed an extra $2 billion to resourcing the country's biosecurity system since it came to power.\n\n\n\n\n\n\"Australia has a world-leading national biosecurity system, which is critical to our economy, environment and way of life,\" they said.\n\n\n\nHow did it get here?\n\nEfforts so far to trace the source indicate PMTV could have been in Tasmania for two years.\n\n\n\n\n\nAustralia's chief plant protection officer Gabrielle Vivian-Smith was questioned about the incursion by Tasmanian senator Richard Colebeck in estimates this week.\n\n\n\n\n\n\"It's not known exactly how it arrived in Australia, it potentially could have come in on a number of different pathways,\" she said.\n\n\n\nStuart with his dog Ziggy in a field where he will plant his potatoes. Source: SBS News A Biosecurity Tasmania spokesperson said PMTV has been detected across multiple sites, including growing sites, a research site and storage facilities.\n\n\n\n\n\nThe only detection of PMTV on the mainland to date is in seed potatoes in cold storage in Victoria.\n\n\n\n\n\nThat state, as well as NSW and South Australia, have placed restrictions on the movement of unprocessed potatoes and production equipment from the Apple Isle.\n\n\n\n\n\nThe National Management Group — the decision-making body for national exotic plant pest, animal disease and environment eradication programs — last month decided PMTV was not eradicable in Tasmania.\n\n\n\n\n\nZarmeen Hassan is the biosecurity manager for the peak representative body for the potato industry, AUSVEG.\n\n\n\n\n\nShe said if it's been in Tasmania for two years, there is a concern it's already spread to the mainland.\n\n\n\nREAD MORE Meet the Australian farmers Donald Trump has a beef with\n\n\"So far we know that it's only in Tasmania, right? We don't actually know whether it has spread to the mainland,\" she said.\n\n\n\n\n\n\"If it has not spread to the mainland, then obviously the industry and government want to work towards containing it.\"\n\n\n\nLearning from New Zealand\n\nAcross the Tasman, they've been dealing with PMTV for seven years, after it was found at a processing plant on the South Island in September 2018.\n\n\n\n\n\nNew Zealand also determined it could not be eradicated but management is going well — so far.\n\n\n\n\n\n\"We're not seeing lost yields, we're not seeing anything, but they do call it the sleeping disease,\" Potatoes New Zealand CEO Kate Trufitt said.\n\n\n\n\n\n\"So something for us to be aware of is that something could happen in the future.\"\n\n\n\n\n\nNew Zealand is looking into varieties of potatoes resistant to mop top.\n\n\n\n\n\nTrufitt said washing down of machinery when moving between farms, crop rotation and improving soil health were crucial in preventing the disease.\n\n\n\nThe vector: powdery scab\n\nA known vector of PMTV is another disease found in potatoes, powdery scab.\n\n\n\n\n\n\"That spreads the virus, and it allows it to take hold within crops,\" TasFarmers CEO Nathan Calman told SBS News.\n\n\n\n\n\nThe Tasmanian government is investing $200,000 into a research program looking into powdery scab and PMTV.\n\n\n\n\n\n\"We've looked to our friends across the ditch in New Zealand who've told us that the key to mop top management is addressing powdery scab,\" Tasmania's primary industries minister, Gavin Pearce, said.\n\n\n\n\n\nHassan said powdery scab was prevalent in the majority of the growing regions.\n\n\n\n\n\n\"If that's the case, then [PMTV] may be further than Tasmania. We don't know that, it's a bit of an unknown right now.\"\n\n\n\n\"Developing a soil test to detect powdery scab and mop top is crucial, and work is underway.\n\n\n\n\n\n\"At this point, there isn't a soil testing protocol and methodology in place in Australia; it is being worked on.\n\n\n\n\n\n\"But planting season is starting now, so it won't be available for this planting season; it will be available for the next season.\"\n\n\n\n\n\nPlanting the next crop of potatoes is underway in Tasmania, but ongoing rain means for some, including Applebee, the ground is still too wet.\n\n\n\n\n\nDespite this and other challenges, he can't imagine doing anything different.\n\n\n\n\n\n\"There is no better feeling than growing a crop of whatever — it can be carrots, potatoes, peas — and knowing full well that it's of the highest quality,\" he said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/australians-living-in-america-anxiety/p88o60wos",
    "title": "Saving money and packing 'go bags': How Australians in the US are preparing for the worst",
    "publish_date": "Fri, 10 Oct 2025 19:34:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Kate (not her real name) describes life as an Australian living in the United States as \"dire\" right now.\n\n\n\n\n\nA musical theatre performer and manager of fitness studios, she has been living in the US for nearly seven years and after marrying her husband this year, she acquired a green card, which grants her permanent residency and the right to work.\n\n\n\n\n\nKate says New York is \"home\" to her now. The couple owns an apartment in Brooklyn, they have two dogs and a wide network of close friends from musical theatre and the gym.\n\n\n\n\n\nBut she says the attitude towards foreign nationals under the current administration has made life in the US feel \"scary\". Kate says these fears were brought to the surface during her green card interview.\n\n\n\n\n\n\"They grilled me in the interview and asked me questions not even related to our marriage but about my previous visa and time in the US,\" she says.\n\n\n\nAdvice on the Australian government's Smartraveller website advises that a valid visa does not guarantee entry to the US. Source: Getty / Alexander Spatari \"I was terrified I wouldn't be approved and every time I travel in and out of the country, there is fear of being deported. \"\n\n\n\n\n\nKate says her husband has taken to waiting nervously outside customs whenever she flies back into the US, as he is \"unsure if I'll get through or not\".\n\n\n\n\n\nSome foreign nationals in Kate's social circle have already left the US due to political concerns but she also acknowledges the ability to leave is a privilege.\n\n\n\nMost of my friends are local and worry for their futures, their kids' futures.\n\nWhile she says it might sound \"extreme\", Kate and her friends have all made contingency plans in case of any sudden changes to the political climate or their safety.\n\n\n\nLast month, US President Donald Trump's administration added a US$100,000 ($151,000) fee to the high-skilled worker visa known as the H-1B. Source: Getty / Alex Wong \"My friends and I talk about 'to go' bags. We have a safe spot at one of our gyms that we will meet at if cellular service goes down; we have cars ready to go,\" she says.\n\n\n\n\n\n\"The unexpected could happen at any time and with this government making irrational decisions at the drop of a hat, it wouldn't surprise me if we need to move quick and get out of the country.\"\n\n\n\n'Changes within days'\n\nMany Australians living in the US are reporting experiencing high levels of anxiety and feelings of instability due to the possibility of rapid political change under US President Donald Trump.\n\n\n\n\n\nLike Kate, others interviewed by SBS News declined to be identified due to concerns that they could be deported for speaking negatively about the US to foreign media.\n\n\n\n\n\nAround 99,000 Australians live in the US, according to the most recent data from the United States Census Bureau.\n\n\n\n\n\nJosh Pugh, who runs the America Josh community for expats in the US, tells SBS News that while the first Trump administration held the same beliefs about limiting immigration, a sense of unease has grown in his community during Trump's second term about what the government is capable of doing — and how quickly.\n\n\n\n\"It feels like they've become more effective at executing what they want to do and that has meant more sweeping changes without checks and balances,\" he says.\n\n\n\n\n\n\"Changes aren't scheduled months in advance; they're scheduled to enact within days and hours.\"\n\n\n\n\n\nLast month, the Trump administration added a US$100,000 ($151,000) fee to the high-skilled worker visa known as the H-1B .\n\n\n\n\n\nThe administration later clarified that it is intended as a one-time fee that will not apply to current visa-holders.\n\n\n\n\n\nThe decision dealt a heavy blow to the tech sector, which relies on skilled workers from China and India but Trump said the change should incentivise American companies to hire US workers.\n\n\n\n\n\nWhile most Australians who apply to work in the US typically apply for an E-3 visa, which was introduced as part of a free trade agreement between the two countries in 2005, Pugh says the changes to the H-1B have heightened concerns about the E-3.\n\n\n\nREAD MORE Trump authorises deployment of 300 national guard troops to Chicago\n\n\"The question I get asked the most is 'Do you think there will be changes to visas, like the E-3?', which is not something I have been asked in my almost nine years,\" Pugh says.\n\n\n\n\n\nLike Kate's friends, Pugh says he's seeing more people making contingency plans, asking one another what it would take to leave the US and how they would plan on doing it.\n\n\n\n\n\n\"In most issues, the community is resilient to change and will work through issues as they come, but we're seeing preparedness increasing and more plans being made for what to do if there are more changes to visa statuses or actions that personally impact them,\" he says.\n\n\n\nVisas no longer a guarantee for entry\n\nSydney-based Stacey Tsui, a partner of immigration at Vialto Partners, which helps skilled workers with international relocation, tells SBS News changes to the E-3 may not be likely but Australians should \"expect the unexpected\".\n\n\n\n\n\n\"If Australia can keep good diplomatic relations with the US — you know, because we're generally a good ally and it's a small visa program, hopefully it just flies under the radar,\" Tsui says.\n\n\n\n\n\nHowever, recent changes mean Australians on E3 visas may also have to return to Australia every two years to renew their visas, according to a recent directive made by the US state department.\n\n\n\n\n\nFor those on H-1B visas, there has also been continued uncertainty around the freedom to travel outside US borders and return.\n\n\n\nWhile White House spokesperson Karoline Leavitt has said current visa holders can leave and re-enter the country as normal, this has not quelled anxieties about the fee. Earlier this month, Microsoft sent an email to staff saying H-1B visa holders should not leave the country for the foreseeable future.\n\n\n\n\n\nThe likelihood of gaining entry with any visa has also been diminished and Australians have reported being turned away at the border despite holding valid documents.\n\n\n\n\n\nAdvice on the Australian government's Smartraveller website advises that a valid visa does not guarantee entry to the US and \"US authorities have broad powers to decide if you're eligible to enter and may determine that you are inadmissible for any reason under US law\".\n\n\n\n\n\nUS resident Millie (not her real name) says the current scrutiny around visas is making her feel like a \"frog in warm water that is close to boiling\".\n\n\n\n\n\nOriginally from Australia, Millie tells SBS News she moved to New York in 2016 with a former partner.\n\n\n\n\n\nShe lives in the US on an O-1B visa, which requires \"sustained acclaim in arts\" but she's worried about potential rapid changes or expenses that could be applied to that visa that could upend her life.\n\n\n\n\"If they raised the price of my visa to $100,000 like they did the H1-B, I would not be able to pay that,\" she says.\n\n\n\n\n\n\"Also, it's ridiculous and even if I could pay it, I wouldn't.\"\n\n\n\n'Saving money in case we need to flee'\n\nOther Australians living in the US report a growing fear of persecution.\n\n\n\n\n\nKarina (not her real name) has been living in the US for four years and lives with her partner in New York.\n\n\n\n\n\nShe says that while recent changes to visas have caused a significant amount of anxiety – particularly while she was renewing her E3 in April this year – there are broader political changes that have caused her to consider leaving the country.\n\n\n\nLISTEN TO Hope and hate: how governments around the world are responding to 'illegal' immigration SBS News 17:52 English\n\nKarina's wife, whom she married last year, is trans and has had top surgery. Karina says she is \"terrified\" for her wife's safety in light of rhetoric that threatens LGBTQI+ rights in the US, as well as a number of executive orders signed by the president directing the government not to recognise transgender or nonbinary identities.\n\n\n\n\n\nThe Heritage Foundation, one of the US' most influential conservative policy groups and publisher of a set of ultra-conservative policy proposals known as Project 2025 (and its offshoot the Oversight Project) have pushed for the Federal Bureau of Investigation (FBI) to designate \"Transgender Ideology-Inspired Violent Extremism\" as a domestic threat category.\n\n\n\n\n\nThe US Supreme Court is also currently weighing up whether to take on a case that could potentially overturn the landmark ruling Obergefell v Hodges that extended marriage rights to same-sex couples.\n\n\n\n\n\nKarina says she is constantly finding herself \"glued to politics\" and that these political shifts have made her and her wife reconsider their life in the US, despite significant ties to their large friendship group and family close by in New York state.\n\n\n\n\n\n\"As a queer immigrant, it is hard to feel like the country wants you to stay,\" she says.\n\n\n\n\"We have been saving our money in case we need to change our plans and flee quickly.\"\n\n\n\n\n\nWhile she sees a lot of anxiety in her community, Karina says many of her friends are American and the decision to leave is more complicated for them.\n\n\n\n\n\n\"A lot of them are politically motivated and attend protests,\" she says.\n\n\n\nHowever, I personally do not feel safe to do so.\n\nThose who have already left\n\nClaire (not her real name), 36, says she anticipated the issues that would arise with visas and immigration and decided to leave the night of the US election in November.\n\n\n\n\n\nShe was working for a humanitarian organisation in Washington DC and had been based in the US since 2021 but decided to leave after Trump was re-elected.\n\n\n\n\"Every month since has confirmed it was the right decision,\" she says.\n\n\n\n\n\n\"My E3 [visa] was set to expire in September 2025 and so I would have had to renew or reapply. I was worried that because of my work and advocacy on humanitarian issues, it would get denied and I wouldn't be able to re-enter the US.\"\n\n\n\n\n\nClaire says she had an established life in the US, including an American partner, a cat, and a large community of friends but she felt she was given no choice but to leave.\n\n\n\n\n\n\"I didn't want access to my life to be down to the whims of a border officer every time I had to travel for work — which includes to places like Iraq and Sudan, which would not be looked at kindly,\" she says.\n\n\n\nNow living in Geneva, Claire says she is in a challenging situation with her partner, who has remained in the US and works in medicine. To join her and practice in Switzerland, he would need to attain EU qualifications.\n\n\n\n\n\nWhile she says she enjoys parts of the US, the \"lack of clarity\" about her future there as a foreign worker has made her resolute that she does not want to return in the immediate future.\n\n\n\n\n\nThe deployment of the National Guard to Washington DC in August made Claire even more confident in her decision to leave.\n\n\n\n\n\n\"The rise of hateful rhetoric, and actions from political leaders, and the suspension of basic legal norms doesn't make it a place I wanted to spend more time and energy investing in.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/video/pocock-banned-from-parliamentary-sports-club-after-criticising-gambling-link/vix00u50i",
    "title": "Pocock banned from parliamentary sports club after criticising gambling link",
    "publish_date": "Fri, 10 Oct 2025 08:37:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/silver-at-highest-since-1980-how-markets-are-reacting-to-gaza-peace-deal/629kn57mq",
    "title": "Silver at highest since 1980 & how markets are reacting to Gaza peace deal",
    "publish_date": "Fri, 10 Oct 2025 06:25:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-fringe-2025-wrap-2-20251009-p5n1ds.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I haven’t laughed so hard in a long while’: The latest Fringe reviews are here",
    "publish_date": "Sun, 12 Oct 2025 12:34:27 +1100",
    "category": "entertainment",
    "authors": [
      "Guy Webster",
      "John Bailey",
      "Lefa Singleton Norton",
      "Nell Geraets",
      "Sonia Nair"
    ],
    "text": "Sheppard’s performance is loaded with hilarious subversion, packing in camp and toilet humour, outrageous physical comedy and pop-cultural lampoon, alongside cheerful critique of existing aesthetic hierarchies. It lobs lightning bolts at every vice (and many a sacred cow) in theatrical and critical culture, and the comedic storm she whips up has a smiling eye of calm in West’s divine presence. Carly Sheppard’s performance is loaded with hilarious subversion Credit: Jacinta Keefe I haven’t laughed so hard in a long while. Anyone involved in the theatre world will marvel at how up-to-the-minute the comedy is; fans of super irreverent humour generally – South Park leaps to mind – should love this show, too. Although – like South Park – it might be too “tasteless” for some, there’s genuine liberation in satire this fearless and clever, and to me, the show’s dissection of the politics of taste is all part of its charm. ★★★★\n\nReviewed by Cameron Woodhead\n\nTHEATRE\n\nMammalian Diving Reflex | Nightwalks with Teenagers\n\nWerribee (various locations), season ended Nightwalks with Teenagers took place in Werribee as part of Melbourne Fringe Festival Reviewing a work by Mammalian Diving Reflex is a bit like reviewing the last conversation you had. The Canada-based company makes “socially engaged participatory performance” which usually involves assembling folks who might never otherwise cross paths, providing them a structure through which to interact, and then just seeing what happens. In this case you’re invited to wander the backstreets and public gardens of Werribee for a few hours in the company of more than a dozen local teens. They’ve designed activities to explore along the way, from a dance-off and karaoke to a bunch of getting-to-know-you games, and while there’s no spectacle or showstopping moment, there are countless opportunities for real connections to be made along the way. It’s a gentle rebuke to the reductive image of troubled teens that generates headlines, and a reminder that today’s youth have much more in common with yesterday’s than we might realise.\n\n★★★★\n\nReviewed by John Bailey\n\nCOMEDY\n\nChelsea Heaney | I Swear I’m Funny\n\nMotley Bauhaus, until October 12 When a performer opens the show sashaying down the aisle delivering an absurd burlesque-style striptease, the assurance in the title – I Swear I’m Funny – hardly seems necessary; the audience is already laughing. Chelea Heaney performs at Motley Bauhaus until October 12. Credit: Nathan Smith Having won over the room, Chelsea Heaney sets about examining what influences have turned her into the funny woman on stage before us. A task predominantly undertaken through standup, peppered with a skit or two, a song and some physical comedy. These interludes are pitch-perfect both in musical ability and comedic timing. No surprise then that she lists musical theatre as one of the reasons she’s funny alongside family, eavesdropping and more. Heaney knows how to set up an anecdote for maximum laughter payoff, delivering punchlines and unexpected twists with theatre-kid aplomb. A nod should also go to her skilful audience interactions, which add charming touches to her stories. The show comes together as a satisfyingly energetic and charismatic whole.\n\n★★★★\n\nReviewed by Lefa Singleton Norton\n\nCIRCUS\n\nCasey Lorae | La Folie After Dark\n\nGasworks Theatre, until October 11 La Folie After Dark is on at Gasworks Theatre until October 11. Credit: All The Feels Photography It begins with a warning: brace yourself for “blasphemy, BDSM and assault”. Seated in a dark, hazy room looking at a suspended hoop and chains, it’s not entirely clear what you’ve walked into. But once the first performer contorts her body, uncertainty is replaced by sheer awe. Metres in the air, she lifts and twists her body effortlessly, draping her limbs around the hoop as if she were liquid. The power of the human body is on full display, whether on a hoop, trapeze, silks or straps. Artists freefall from ceiling-height, do the splits in midair, and lift other artists by the neck with their feet. It defies belief yet appears so sultry and seamless. Though each individual act astounds, the production as a whole lacks cohesion. A baffling attempt to link two performances using a prop cup interrupts your stunned reverie. La Folie struggles to connect the dots, but it’s still testament to the breathtaking strength and seductiveness of the human form.\n\n★★★\n\nReviewed by Nell Geraets\n\nTHEATRE\n\nDylan Murphy and Tom Henry Jones | In the Dark\n\nTrades Hall, until October 12 Somewhere in a secret bunker, five comedians are waiting for electricity to be siphoned from a dystopian wasteland so they can start their humble radio show: the right hand of an authoritarian regime trying to calm rebellion via foley artistry, morality tales and theatricalised propaganda. Imagine an Orwellian Orson Welles, or The Hunger Games as an interwar broadcast. The rebels are outside, the disembodied voice of your big brother-like leader is waiting to deliver performance notes via firing squad, and there’s a piss bucket if you need it. In the Dark performs at Trades Hall until October 12. Credit: Dylan Murphy It’s a fantastic premise, and writers Dylan Murphy and Tom Henry Jones have assembled a stellar cast to pull it off. Hannah Camilleri transforms into a crow with the flap of a plastic tree and an uncanny squawk. Maria Angelico switches from bawdy milk maid to doe-eyed lover with ease. And Mark Mitchell’s sonorous voice is perfect as the veteran actor desperate to appeal to butter-churning women aged 16 to 25. But too much exposition ties the script in knots. And moments of foley artistry – often the most interesting part of theatricalised radio plays – are too underdeveloped to justify why the show has been staged at all. Ultimately, this killer cast is not given enough to do, and this killer premise fails to find its feet.\n\n★★\n\nReviewed by Guy Webster",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/national/victoria/melbourne-marathon-2025-live-updates-olympians-celebrities-take-to-city-s-streets-for-major-running-event-20251010-p5n1n0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Melbourne Marathon 2025 live results: Rayner takes out marathon; Adams takes out win on debut",
    "publish_date": "Sun, 12 Oct 2025 12:09:12 +1100",
    "category": "sports",
    "authors": [
      "Ashleigh Mcmillan",
      "Carolyn Webb",
      "Jackson Graham"
    ],
    "text": "Having never ran a marathon before, plenty of questions ran through Caitlin Adams’ mind before lining up at the start this morning: “When’s the wall going to hit? How hard does it get?”\n\nShe knew winning was a possibility but still had her doubts. She finished the women’s marathon in a winning time of 2:30:26.\n\nCaitlin Adams won the Melbourne Marathon on Sunday. Credit: Jackson Graham\n\n“I’m just so glad that I’ve done one and know what it’s all about,” she said.\n\n“I had so much support out on course. My coach and my partner were there on bikes … I didn’t have to do a lot of thinking out there.”\n\nShe did feel the wall at around 35 kilometres.\n\n“Even with 3 kilometres to go. I thought, heck, like, this is the longest 3 kilometres that I have ever done.”",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/business/companies/anz-braces-for-the-nuno-effect-as-new-boss-prepares-his-big-reveal-20251008-p5n0w4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ANZ braces for the Nuno effect as new boss prepares his big reveal",
    "publish_date": "Sun, 12 Oct 2025 12:05:30 +1100",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "ANZ Group’s underperforming retail business is likely to bear the brunt of the jobs carnage about to hit the bank over the next 12 months, as its new boss, Portuguese banking veteran Nuno Matos, gets ready to deliver a clear strategy to investors on Monday.\n\nMatos, who joined the bank in July, has made it clear that the bank needs a significant overhaul to help shed its reputation as the worst performer among the Big Four. However, his tenure so far has been blemished with errors that highlighted the execution risks threatening Matos’ planned makeover.\n\nANZ chief executive Nuno Matos flagged deep job cuts last month but has yet to unveil the strategy that will lift ANZ’s performance. Credit: Marija Ercegovac\n\nMatos missed out on the top job at HSBC before joining ANZ and has been employed explicitly to transform an organisation with a poor record of execution. And he will have fresh help.\n\nAhead of the strategy reveal, Matos last week announced three big hires, including the appointment of Pedro Rodeia as the new head of ANZ’s retail bank to replace Maile Carnegie.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/culture/movies/seven-of-diane-keaton-s-most-iconic-and-memorable-roles-20251012-p5n1th.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Seven of Diane Keaton’s most iconic and memorable roles",
    "publish_date": "Sun, 12 Oct 2025 11:57:10 +1100",
    "category": "entertainment",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "In it, Keaton plays the former girlfriend of neurotic comedian Alvy Singer (Woody Allen), who attempts to understand why their relationship ended. Loading Keaton and Allen, who were romantically involved and had a longstanding professional relationship, first worked together in the 1969 Broadway production of Play It Again, Sam. They worked on eight films together between 1971 and 1993 and remained close friends. She stood by Allen amidst allegations of sexual abuse towards his and Mia Farrow’s daughter, Dylan. Despite this, Farrow mourned Keaton’s death on Instagram in a post on Sunday, writing: “She was an absolutely wonderful actress – and a rare and fascinating person. Thoughts with her children and sisters. Rest in peace Diane.”\n\nThe role won Keaton her first Oscar for Best Actress at the 1977 Academy Awards, while the film took out the Best Picture award. In her acceptance speech for the award, Keaton oozed her signature offbeat charm, beaming from the stage: “well then, this is terrific. It’s simply terrific.” Reds (1981) Diane Keaton opposite Warren Beatty - with whom she was also romantically involved - in the acclaimed film, Reds. Credit: At the height of her fame, Keaton starred alongside Warren Beatty – with whom she was also romantically involved – in the historical epic Reds (1981).\n\nThe film, which Beatty also directed, traces the true story of American journalist John Reed who covered The October Revolution – the second of two revolutions in Russia led by Vladimir Lenin’s Bolsheviks. Keaton plays American journalist and suffragist Louise Bryant, who joins Reed and a community of activists in New York. The film won Best Director and Best Cinematography at the Academy Awards, and earned Keaton a Best Actress nomination. It was screened at The White House for then-president Ronald Reagan. In 2020, New York Magazine included it in its list of “The Best Movies Which Lost Best Picture at the Oscars”. Father of the Bride (1991) Diane Keaton, Martin Short and Steve Martin in Father of the Bride. Credit: Touchstone Pictures\n\nIn 1991, Keaton starred alongside Steve Martin and Martin Short in family favourite Father of the Bride, a remake of the 1950 film of the same name. Her second of four films with American filmmaker Nancy Meyers (Baby Boom, Something’s Gotta Give and Father of the Bride II), Keaton plays Nina Banks, a steady and devoted mother and wife who supports her husband George (Steve Martin) as he begins to unravel following the news of his daughter’s engagement. A critical and box office success, the film led to a sequel released in 1995. The First Wives Club (1996) Goldie Hawn, Diane Keaton and Bette Midler in The First Wives Club. Credit: Paramount In 1996, Keaton starred alongside Goldie Hawn and Bette Midler in The First Wives Club, a comedy about three divorcees seeking revenge against their husbands for leaving them for younger women.\n\nLoading In the film, Keaton’s character Annie has separated from her advertising executive husband, is in therapy for self-esteem issues and remains hopeful the two will reconcile. Grossing US$181 million worldwide, the film was a box-office hit and garnered a cult-following among middle-aged women. The third sequel to the film, Book Club: The Next Chapter, released in 2023, is one of Keaton’s last projects. On Sunday, Bette Midler took to Instagram to pay tribute to her late co-star, writing: “She was hilarious, a complete original, and completely without guile, or any of the competitiveness one would have expected from such a star. What you saw was who she was…oh, la, lala!”\n\nGoldie Hawn also paid tribute, writing: “You stole the hearts of the world and shared your genius with millions, making films that made us laugh and cry in ways only you could. I was blessed to make First Wives Club with you, our days starting with coffee in the makeup trailer, laughing and joking, right through to the very last day of filming. It was a roller coaster of love.” Marvin’s Room (1996) With Leonardo DiCaprio and Meryl Streep in Marvin’s Room. Credit: Miramax Films; Phillip V. Caruso In 1996, Keaton starred in Jerry Zaks’ drama Marvin’s Room as Bessie, the primary caregiver for her father Martin. When she is diagnosed with leukemia – the same disease which killed her mother – she turns to her estranged sister Lee (Meryl Streep) for help. A young Leonardo DiCaprio also stars as the teenage son of Lee. A New York Times review at the time credited the film’s “powerhouse casting” with lending depth to the screen adaptation and praised Keaton’s performance.\n\n“Ms. Keaton works wonders in making Bessie much more than an advertisement for noble sacrifice, though she still must do a good deal of figurative smiling through her tears,” it read. For her performance, Keaton received nominations for an Academy Award for Best Actress, the Critic’s Choice Movie Award for Best Actress and the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role. Something’s Gotta Give (2003) Jack Nicholson and Diane Keaton in Something’s Gotta Give. Credit: AP Keaton’s comedic prowess shines in her fourth project in a longstanding, close working relationship with Nancy Myers, the 2003 romantic comedy Something’s Gotta Give.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/business/consumer-affairs/qantas-customer-data-put-on-dark-web-as-hackers-deliver-on-threat-20251012-p5n1tw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Qantas customer data put on dark web as hackers deliver on threat",
    "publish_date": "Sun, 12 Oct 2025 11:32:49 +1100",
    "category": "finance",
    "authors": [
      "Supratim Adhikari",
      "Chris Zappone"
    ],
    "text": "Hackers have released personal data of 5.7 million Qantas customers on the dark web, making good on their promise to publish the information stolen from the airline’s system this year.\n\nQantas is one of 40 companies (including Toyota, Disney, Ikea, Air France and KLM) compromised by hacker collective Scattered Lapsus$ Hunters, which stole almost 1 billion records by targeting customers of cloud technology giant Salesforce in July.\n\nQantas Airways suffered a data breach in July and the hackers demanded $1 million. Credit: Bloomberg\n\nThe hackers did not break into Salesforce’s system. Instead, they called the IT helpdesks of the 40 companies – posing as legitimate employees – and convinced them to get access to the systems. In Qantas’ case, a call centre based in the Philippines was reportedly targeted by the hackers.\n\nHaving set a deadline of leaking the data over the weekend unless ransoms were paid by either Salesforce or Qantas, the hackers released passenger information on Saturday (Australian time).",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/bathurst-1000-live-who-will-be-crowned-king-of-mount-panorama-20251012-p5n1u5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bathurst 1000 LIVE: Who will be crowned king of Mount Panorama?",
    "publish_date": "Sun, 12 Oct 2025 11:09:48 +1100",
    "category": "finance",
    "authors": [
      "Iain Payten",
      "Robert Dillon"
    ],
    "text": "Defending champion Brodie Kostecki will attempt to retain Bathurst 1000 crown on Sunday in a Ford Mustang his team claims is at an “irrefutable” disadvantage because of the inaction of Supercars officials.\n\nA controversial statement released by Dick Johnson Racing on Saturday night - within hours of Kostecki claiming pole position and Ford snaring the first four positions on the grid - has questioned the credibility of this year’s great race.\n\nIn the statement, DJR said that for more than two years they had been arguing their rival Chevrolet Camaros (General Motors) had an advantage over the Mustangs at Bathurst’s altitude.\n\nFord has not won at Mt Panorama since 2019.\n\nDJR said Supercars testing leading up to this year’s race had verified that barometric pressure gave the Camaros “an additional 10 horsepower over the Ford engine above 5900 rpm, where the engine operates for 94 per cent of a lap of Mount Panorama at full throttle. This data explains why the Mustang is slower than the Camaro in a straight line at Bathurst.”\n\nDJR said the governing body had “confirmed the problem exists. They know how to fix it. They chose not to.”\n\nBrodie Kostecki’s Mustang has earned him pole position. Credit: Getty Images\n\nThey added that General Motors, which manufactures the Camaros, had opposed any modifications.\n\nDJR appealed to stewards to resolve the dispute but said “they lacked the necessary jurisdiction to apply the remedy sought”.\n\nThe DJR statement declared “parity is the foundation of the Supercars Championship” and “Supercars have failed to implement it on the basis that GM [General Motors] declined to agree to it … Supercars chose consultation with GM over correction. They chose politics over parity.”\n\nBrodie Kostecki celebrates after winning pole position at Bathurst on Saturday. Credit: Getty Images\n\nDJR said Kostecki and the team had been “extraordinary” in winning qualifying and securing pole but warned: “Winning will require us to be more extraordinary than ever, as we will do so knowing we’re racing with one hand tied behind our back.“\n\nDespite that, they added: “We accept their decision, we move on … we didn’t come to Bathurst to make excuses. We came to win.”\n\nRacing legend Dick Johnson.\n\nWhile he was outspoken on Friday, Kostecki was giving little away on Saturday, preferring to focus on his achievement of joining legends Peter Brock and Allan Moffat in securing three consecutive poles at the mount.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/afl/petracca-eyeing-move-to-the-suns-20251012-p5n1uj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Petracca eyeing move to the Suns",
    "publish_date": "Sun, 12 Oct 2025 11:09:17 +1100",
    "category": "sports",
    "authors": [],
    "text": "Petracca eyeing move to the Suns\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/perth-the-crown-jewel-of-wwe-as-franchise-s-biggest-stars-fly-west-20251012-p5n1u1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Perth the Crown Jewel of WWE as franchise’s biggest stars fly west",
    "publish_date": "Sun, 12 Oct 2025 10:31:33 +1100",
    "category": "sports",
    "authors": [
      "Cameron Myles"
    ],
    "text": "While wrestling fans packed Perth’s CBD on Friday hoping to catch a glimpse of one of the WWE’s biggest stars, it was, predictably, WA Premier Roger Cook who scored a selfie with John Cena.\n\nOr, as the running joke goes, Cook got a photo of himself and some WWE belts.\n\nWA Premier Roger Cook poses for a photo with WWE superstar John Cena. Credit: Facebook/Roger Cook\n\nThe wrestling roadshow has rolled into town as part of a weekend “takeover” of three shows at RAC Arena, and Saturday’s Crown Jewel: Perth was the main event.\n\nThe was broadcast around the world via Netflix as part of a mega-deal struck between the streamer and WWE, and was also shown on ESPN in the United States.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/annie-hall-to-coastal-grandma-the-legacy-of-diane-keaton-s-style-20251012-p5n1tc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Annie Hall to Coastal Grandma: The legacy of Diane Keaton’s style",
    "publish_date": "Sun, 12 Oct 2025 10:16:53 +1100",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "Before stylists and designers moulded actresses into red carpet advertisements for luxury labels, Diane Keaton cultivated an individual approach to androgynous dressing that resonated with women around the world.\n\nQuirky combinations of baggy trousers, waistcoats, ties and hats from the star who has died at the age of 79, eschewed the traditional glamour of taffeta, silk and lace, projecting the image of a woman who wasn’t waiting for men to open doors for her.\n\nDiane Keaton in Ralph Lauren attire on set with director Woody Allen during the filming of Annie Hall. Credit: Getty Images\n\nIt was a timely update of silver screen stars’ Marlene Dietrich’s tuxedos and Katharine Hepburn’s turtlenecks and wide-legged trousers.\n\nDesigner Ralph Lauren is often credited with launching Keaton as a fashion icon in the 1977 Woody Allen movie Annie Hall, but the Oscar-winning actress was responsible for her character’s eclectic output.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/hull-are-crowned-champions-20251012-p5n1u2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hull are crowned champions",
    "publish_date": "Sun, 12 Oct 2025 10:05:38 +1100",
    "category": "sports",
    "authors": [],
    "text": "Hull are crowned champions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/djokovic-stunned-by-world-no-204-20251012-p5n1u3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Djokovic stunned by world No.204",
    "publish_date": "Sun, 12 Oct 2025 10:05:27 +1100",
    "category": "finance",
    "authors": [],
    "text": "Djokovic stunned by world No.204\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/queensland/teen-in-critical-condition-after-queensland-shark-attack-20251012-p5n1tr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Teen in critical condition after Queensland shark attack",
    "publish_date": "Sun, 12 Oct 2025 09:55:12 +1100",
    "category": "lifestyle",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "A teenage boy is in a critical condition after being bitten on the stomach by a shark in waters off Thursday Island in Far North Queensland on Saturday evening.\n\nEmergency services were called to Cook Esplanade on the western side of Thursday Island at 6.23pm after reports that a male in their mid-teens had been attacked by a shark while swimming.\n\nThe boy suffered significant abdominal injuries and was transported to Thursday Island Hospital before being airlifted in a life-threatening condition to Townsville University Hospital.\n\nA spokesperson for the hospital confirmed the boy’s condition remained critical on Sunday morning.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://au.news.yahoo.com/feet-pm-hotly-anticipated-trump-163000138.html",
    "title": "Critical minerals talk heats up before PM's US visit",
    "publish_date": "2025-10-12T00:51:42Z",
    "category": "finance",
    "authors": [],
    "text": "A deal to give the United States more access to Australian critical minerals could be on the agenda ahead of Prime Minister Anthony Albanese's trip to the White House.\n\nThe government has been discussing a potential agreement with miners and US officials, in the hopes of countering China's dominance in the production of metals like lithium, cobalt and nickel.\n\nCritical minerals are crucial for the production of clean energy technologies like batteries and solar panels, but also high-tech military products including fighter jets.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nChina currently produces the vast majority of the world's critical minerals, prompting the Trump administration to seek deals with friendly countries.\n\nCritical minerals trade will likely be discussed when Anthony Albanese visits the White House. (Lukas Coch/AAP PHOTOS)\n\nTrade Minister Don Farrell said Australia is keen to strike an agreement with the US, and had been discussing the issue since \"day one\" of Donald Trump's presidency.\n\n\"We've got vast resources of the critical minerals that the world is going to need to decarbonise... what we don't always have, of course, is the financial resources to extract those minerals,\" he told Sky News on Sunday.\n\nBut Senator Farrell said he wouldn't put a timeline on when such a deal with the US would be struck.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Trade Minister also stressed the importance of securing critical minerals pacts with other countries and said he was in talks with Japan, South Korea and the European Union.\n\n\"We've seen in the past what happens when you put all of your eggs in the one basket,\" he said, likely referencing Beijing's trade bans on products like wine and barley, which were introduced in 2020 and devastated industries which predominantly traded with China.\n\nCritical minerals trade is widely expected to be discussed when Mr Albanese sits down with Mr Trump at the White House on October 20.\n\nSenator Farrell had lengthy discussions with US trade representative Jamieson Greer about access to Australia's vast stockpiles in September.\n\nAnthony Albanese was in the US last month, but has had to wait for a meeting with Donald Trump. (Lukas Coch/AAP PHOTOS)\n\nMr Albanese's mission has been hotly anticipated following a series of delays in securing an audience with Mr Trump.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe prime minister is now taking a week of leave before his trip to Washington DC, and Defence Minister Richard Marles is serving as acting prime minister during that time.\n\nOpposition frontbencher Julian Leeser said more clarity was needed around the government's critical minerals negotiations.\n\n\"Why haven't they made the plan public?\" he asked on Sky News.\n\nMr Leeser said Labor needed to be clear about what critical minerals would be prioritised, and suggested the trade of uranium should be given greater importance.",
    "source": "Yahoo",
    "cluster_id": 29
  },
  {
    "url": "https://au.news.yahoo.com/aussie-drivers-shocking-video-of-dangerous-vehicle-sparks-heated-road-debate-002701020.html",
    "title": "Aussie driver's shocking video of 'dangerous' vehicle sparks heated road debate",
    "publish_date": "2025-10-12T00:27:01Z",
    "category": "finance",
    "authors": [],
    "text": "Shocking footage of a “dangerous” vehicle emitting massive amounts of smoke while stopped at a traffic light has sparked a surprising debate among Australian drivers.\n\nThe divisive video, recently captured by a concerned Perth resident, shows a staggering amount of white smoke emerging from the back of the grey SUV. After the light turns green, a thick plume erupts into the air, temporarily blocking the view of trailing motorists.\n\nThe footage, shared online by 6PR Perth, has prompted a discussion among Aussies after the radio station asked viewers if they would report the car to Western Australia’s Smoky Vehicle Reporting Program.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe program — a joint initiative between the Department of Water and Environmental Regulation (DWER) and the Department of Transport — encourages drivers who witness a vehicle smoking continuously for 10 seconds to flag the issue with authorities.\n\nBy submitting the car’s licence number, make, model and colour, as well as the location and date and time of the sighting, the departments can track down the owner to discuss any necessary maintenance.\n\nAussies debate dobbing in driver over smoky car\n\nWhile many viewers said they would immediately report the SUV seen in the worrying footage, more declared they wouldn’t dream of dobbing in the driver.\n\n“I think the driver is already realising they’re in for an expensive mechanic trip,” one person commented. “How about mind your own business,” another wrote.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Really, the concern would be their engine potentially catching on fire. This is very dangerous for the occupants,” someone else said, adding that they still wouldn’t file a report because the driver may not have the money to fix the car’s obvious issues.\n\nSurprisingly, in stark contrast to the claims of those on social media, a DWER spokesperson told Yahoo News authorities had seen “a large increase in reports” in the last two years, which they attributed to improvements made to the online portal.\n\nAccording to the Smoky Vehicle Reporting Program’s annual report, 1,077 valid complaints were received between July 2023 and June 2024. Of those, just under 300 vehicle owners responded to authorities.\n\n“Reporting excessively polluting vehicles to the program allows us to contact the owners and encourage repair and maintenance,” the spokesperson said. “We are aware from responses that we have received that vehicle owners do undertake maintenance or repairs in response to our advice.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt is unknown if the car seen in the footage was reported to DWER. In WA, drivers who wilfully cause excessive noise or smoke can cop a $100 on-the-spot fine and three demerits, however Yahoo News understands this primarily relates to burnouts, and that no penalties are handed out through the smoky vehicle program.\n\nWestern Australia's Smoky Vehicle Reporting Program has seen a large increase in reports. Source: Getty\n\nWhat is causing the car to emit so much smoke?\n\nJames Ward, content director at Drive.com.au, told 6PR Perth the driver of the SUV “needs to make a trip to the mechanic lickety split”. The “light, grey” smoke is an indicator that there is “water where it shouldn’t be”, he explained.\n\n“Most likely what that means is he’s got a cracked head gasket, or the vehicle has ingested water some way,” James told host Simon Beaumont. “The fact that it’s still running says that it’s not terminal for the engine.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“A cracked head gasket — you don’t know how it’s been driven or taken care of — but it is something that needs attention, and yeah, absolutely, dob those drivers in.\n\n“It’s mostly vapour, so it’s not so much noxious fumes and things like that, but it’s not good, and it’s certainly not good for that car that is going along.”\n\nAs well as WA, New South Wales, Queensland, Victoria and the Northern Territory all have systems for reporting smoky vehicles.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/australia-needs-help-enter-golden-225632601.html",
    "title": "Australia needs help to enter ‘golden age’",
    "publish_date": "2025-10-11T22:57:41Z",
    "category": "finance",
    "authors": [],
    "text": "Federal trade minister Don Farrell says Australia is in the “golden age” in critical minerals as he refuses to be drawn on reports for a new $1.2 billion critical minerals strategic reserve.\n\nAustralia is working to secure a critical mineral deal with the US, ahead of Prime Minister Anthony Albanese’s meeting in Washington with President Donald Trump later this month.\n\nMr Farrell told Sky’s Sunday Agenda, Australia is the “lucky country”, and we want to “ensure that we become a reliable supplier of critical minerals to the rest of the world”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We’ve got vast resources of the critical minerals that the world is going to need to decarbonise, to build data centres, to process AI, and all of the things that critical minerals are going to be crucial in.\n\n“What we don’t always have, of course, is the financial resources to extract those minerals,” he said.\n\n“And so what the Australian government has been trying to do in recent years is to ensure that we’ve got partners with us to extract those minerals, and we’ve been talking to the Europeans.”\n\nMr Farrell added Australia is seeing “wonderful opportunities”, ahead of discussions with the European Trade Minister.\n\nMinister for Trade and Tourism of Australia, Senator Don Farrell says Australia is in the “golden age” in critical minerals. Picture: NewsWire / Martin Ollman\n\nMr Farrell would not be drawn on a $1.2 billion plan. Picture: NewsWire / Martin Ollman\n\n“In fact, I’ve often described it as a golden age for critical minerals,” he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Two weeks ago, I was with the premier of South Australia at Roxby Downs.\n\n“We were kilometres underground, and we announced the doubling of Olympic Dam’s copper mining … currently, they produce about 300,000 tons per year.\n\n“That’s going to double over the next few years to 600,000 tons … so we’re very focused on critical minerals.”\n\nMr Farrell added it’s “no secret” that they have been discussing the issue of critical minerals, since the day Donald Trump became president of the United States.\n\n“We’ve been very public about that … we would like to have an agreement on critical minerals, as we’ve got with the Europeans, with the United States … there’s no secrets about that.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Just when that agreement might be reached, I’m not going to predict those things … these things always take a lot longer to do than you’d like them to.”\n\nAgenda host Andrew Clennell quipped back: “one of these days … next Monday perhaps?”\n\nWhen further asked about how a critical minerals strategic reserve might work, Mr Farrell said he will leave that to the resources minister, Madeleine King.\n\n“That’s her space, and I’m not going to step into her space. But I can say we value our ability to sell these products to the rest of the world and that’s what we’re going to do.”\n\nAustralia ‘scrambling’ to get minerals deal\n\nMeanwhile, Nationals leader David Littleproud was asked about Australia’s critical minerals export deal in the wake of Donald Trump’s China tariffs on Sunday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe criticised Prime Minister Anthony Albanese for not having already held a White House meeting with the US President.\n\n“I would have thought that Anthony Albanese would have found himself in the White House long before now to not only talk about AUKUS, but trade,” he told Today.\n\n“We hold some of the aces, and the fact that we’re now scrambling speaks volumes about the level of relationship that not only Anthony Albanese has, but Kevin Rudd has, in Washington.\n\n“We want Australia to succeed, but we actually have to be honest with ourselves that for us to take this long, such an enriched relationship that we’ve had for so many generations, for us to struggle to get a meeting not only on trade but on, more importantly, strategic defence, I just think something’s not right. “\n\nQuestioned over the fact a meeting had been locked in, Mr Littleproud accused the government of “scrambling to try and piece some sort of deal together on resources”.",
    "source": "Yahoo",
    "cluster_id": 29
  }
]