[
    {
        "url": "https://www.9news.com.au/world/donald-trump-health-what-is-chronic-venous-infufficiency-everything-to-know-explained/dd028a8e-30e8-4e0d-a76e-5a65e5a19ef6",
        "title": "Is Trump's diagnosis benign? Everything to know about chronic venous insufficiency",
        "publish_date": "Fri, 18 Jul 2025 02:00:14 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "US President Donald Trump has been diagnosed with \"benign\" chronic venous insufficiency , a common condition in overweight, aging adults.\n\nThe White House announced his diagnosis this morning, almost six months after he became the oldest person inaugurated as US president.\n\nThe 79-year-old will also become the nation's oldest serving president during his second term﻿.\n\nREAD MORE: Trump diagnosed with blood condition after troubling find\n\nUS President Donald Trump has been diagnosed with \"benign\" chronic venous insufficiency. (AP Photo/Evan Vucci)\n\nHere's everything you need to know about the condition he's now been diagnosed with.﻿\n\nWhat was Donald Trump's specific diagnosis?\n\nTrump was diagnosed with ﻿chronic venous insufficiency after he \"noted mild swelling in his lower legs\" over a period of weeks.\n\nThe 79-year-old commander-in-chief underwent a \"comprehensive examination, including diagnostic vascular studies\" with the White House Medical Unit.\n\nA note from his ﻿physician, Captain Sean Barbabella, stated that \"bilateral lower extremity venous doppler ultrasounds were performed and revealed chronic venous insufficiency, ICD-9, a common condition, particularly in individuals over the age of 70\".\n\nThere was \"no evidence of deep vein thrombosis or arterial disease\" and that Trump's lab testing was all \"within normal limits\".\n\nAn echocardiogram found \"no signs of heart failure, renal impairment, or systemic illness\".\n\nWhat is chronic venous insufficiency?\n\nChronic venous insufficiency occurs when valves inside certain veins, typically in the legs, don't work as they should.\n\nInstead of allowing blood to flow back towards the heart, it pools or collects in the veins, causing symptoms like swelling, aching, ﻿varicose veins, pain or skin changes.\n\nThough not a serious health threat on its own, ﻿chronic venous insufficiency can be painful and debilitating and should be assessed by a medical professional.\n\nCardiologist Dr Bernard Ashby said that even though Trump's diagnosis was reportedly \"benign\", \"venous insufficiency, by itself doesn't necessarily mean it's benign\".\n\n\"The question is, what's causing the venous insufficiency?\" he told CNN.\n\nREAD MORE: The man who skydived from space dies in freak accident\n\nThough Trump's diagnosis was reportedly \"benign\", \"venous insufficiency, by itself doesn't necessarily mean it's benign\". (AP Photo/Alex Brandon)\n\nWhat causes chronic venous insufficiency?\n\nThe causes of ﻿chronic venous insufficiency can vary and the risk of developing the condition increases with age.\n\nCommon contributing factors include:\n\nbeing overweight\n\nlack of exercise﻿\n\nsmoking﻿\n\npregnancy﻿\n\na family history of ﻿chronic venous insufficiency\n\ndamage to the leg due to injury, surgery or previous blood clots\n\nhigh blood pressure in the leg veins due to sitting or standing for long periods\n\nOther causes may include ﻿deep vein thrombosis, where a blood clot forms in a deep vein, and phlebitis, the swelling and inflammation of a vein close to the skin.\n\nChronic venous insufficiency can also be related to conditions like increased pressure from the heart or sleep apnea.\n\nDr Jeremy Faust, an assistant professor of emergency medicine at Harvard Medical School, told CNN that Trump's diagnosis was neither alarming nor surprising.\n\n\"This is a pretty normal part of aging, and especially for someone in the overweight to obese category, which is where the president has always been,\" he said.\n\nWhat are the symptoms of chronic venous insufficiency?\n\nCommon symptoms of ﻿chronic venous insufficiency include:\n\nswelling of the legs or ankles\n\ntightness, itching or pain in the legs\n\npain while walking\n\nskin discolouration, usually near the ankles﻿\n\nvaricose veins﻿\n\nrestless legs﻿\n\nleg cramps and muscle spasms﻿\n\nSome patients may also experience leg ulcers, painful open wounds that may take weeks to heal ﻿even with treatment.\n\nTrump's symptoms, as reported by the White House, currently include mild swelling of the legs.\n\nWhite House press secretary Karoline Leavitt said he was experiencing \"no discomfort\".\n\nCommon symptoms of ﻿chronic venous insufficiency include swelling of the legs or ankles, which Trump has experienced. (AP)\n\nWhat is the treatment for ﻿chronic venous insufficiency?\n\nTreatment for ﻿chronic venous insufficiency may include minimally invasive procedures to improve blood flow or, in more severe cases, surgery.\n\nRegular exercise, ﻿wearing compression stockings and keeping the legs elevated may help improve blood flow.\n\nMedications may also be prescribed to help increase blood flow.\n\nSome patients may underdo endovenous laser ablation or radiofrequency ablation, minimally invasive procedures designed to stimulate affected veins.\n\nIn more serious cases, ﻿sclerotherapy or surgery may be required.\n\nSclerotherapy involves injecting a chemical into the affected veins which causes scarring that prevents them from carrying blood.\n\nThe body ﻿absorbs the scarred veins and blood is redirected through healthy veins.\n\nSurgery may involve ﻿ligation, wherein the affected vein is tied off to prevent blood flow or removed entirely if it is heavily damaged.\n\nThe White House has not yet announced any details regarding Trump's treatment.﻿\n\n- Reported with CNN﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/james-nowland-death-australian-base-jumper-dies-in-italian-dolomites-accident/32d0c86d-86b0-42e6-952e-ce3254c164f9",
        "title": "Australian BASE jumper dies in jump gone wrong in Italy",
        "publish_date": "Thu, 17 Jul 2025 12:30:29 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "Tributes are pouring in for an experienced Australian BASE jumper who died in a jump gone wrong in Italy .\n\nJames Nowland, a 42-year-old from Perth , died on Wednesday after jumping from the summit of Sass Pordoi, in Val di Fassa in the country's picturesque Dolomites region, according to local media.\n\nHis brother Adrian Nowland posted a tribute to social media on Thursday, along with a photo of the pair skiing in the Canadian province of British Columbia in 2010.\n\nBASE jumper James Nowland flies in a wingsuit in China in 2024. (James Nowland/Instagram)\n\n\"Rest in peace brother!\" he posted on Facebook.\n\n\"Wish we had more times like this together!\n\n\"Hope you're soaring through the clouds doing what you love forever.\"\n\nAdrian said James \"left us too early but doing what he loves!\"\n\nJames reportedly crashed about 1pm (9pm AEST) on Wednesday roughly 400 metres from his intended landing point at an altitude of about 1700, after his wingsuit failed to open properly.\n\nHe and some fellow Australians were basing themselves out of Lupo Bianco at the time.﻿\n\nAdrian and James Nowland skiing in Canada in 2010. (Adrian Nowland/Facebook)\n\nThe 42-year-old's social media feeds are full of action-camera videos of him wingsuiting – a type of BASE jumping described as \"the world's most extreme air sport\" – in spectacular locations around the world.\n\nHe'd successfully completed jumps in Italy, France, Switzerland, China and other countries.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sudden-death-investigation-mackay-queensland/1fd27959-730f-4ccc-b15d-9d3966fcdc22",
        "title": "Man found dead in yard on Queensland coast",
        "publish_date": "Thu, 17 Jul 2025 22:52:37 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/the-late-show-with-stephen-colbert-cancelled-in-shock-decision-from-network/7b4bf8e6-1a16-4ffb-b1d8-a9836f9a7864",
        "title": "US network denies shock axing of Stephen Colbert is politically motivated",
        "publish_date": "Fri, 18 Jul 2025 01:22:28 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "In a shocking move, CBS is ending The Late Show with Stephen Colbert next year, potentially exiting the late-night television business altogether.\n\nThe cancellation will take effect in May 2026, the normal end of the broadcast TV season, the network said.\n\nThe show airs in Australia on Network Ten ﻿at midnight.\n\nIn a shocking move, CBS is ending The Late Show with Stephen Colbert next year. (CNN)\n\nThe move is particularly surprising because The Late Show is typically the highest-rated show in late-night.\n\nAnd the timing is bound to raise questions because it comes just two weeks after the parent company of CBS, Paramount, settled a lawsuit lodged by President Donald Trump against CBS News.\n\nThe settlement – and Paramount's pending merger with Skydance Media – spurred speculation about Colbert's future at CBS.\n\nColbert, after all, is one of the staunchest critics of Trump on television.\n\nColbert alluded to the online worrying about his fate when he returned from vacation on Monday night.\n\nREAD MORE: Dyan is forced to choose between her health and paying rent\n\nHe condemned the Paramount settlement on air, likening it to a \"big fat bribe,\" and he joked that his new moustache would protect him from the corporation.\n\n\"Okay, okay, but how are they going to put pressure on Stephen Colbert… if they can't find him?\"\n\nCBS, however, said in a statement that \"this is purely a financial decision against a challenging backdrop in late night\".\n\n\"It is not related in any way to the show's performance, content or other matters happening at Paramount.\"\n\nColbert shared the news at his show taping today.\n\nREAD MORE: Britain will lower its voting age to 16 in bid to strengthen democracy\n\nColbert took the reins from David Letterman in 2015 and has interviewed hundreds of mega-famous guests, including Prince Harry. (AP)\n\n\"Next year will be our last season,\" Colbert said as audible boos were heard in the studio audience.\n\n\"The network will be ending our show in May,\" he said.\n\n\"It's the end of The Late Show on CBS,\" he added, going on to say, \"This is all just going away.\"\n\nColbert said he found out about the network's decision \"last night\".\n\n\"I do want to say that the folks at CBS have been great partners,\" Colbert said.\n\n\"I'm so grateful to the Tiffany network for giving me this chair and this beautiful theater to call home.\n\n\"And of course, I'm grateful to you, the audience, who have joined us every night in here, out there, all around the world.\"\n\nThe move is particularly surprising because The Late Show is typically the highest-rated show in late-night. (Getty)\n\nColbert, who took the reins from David Letterman in 2015, said, \"I wish somebody else was getting it\" after him.\n\nThe network ended James Corden's Late Late Show in 2023.\n\nAt the time, executives said that 12.35am show had become unprofitable for CBS.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/father-furious-after-school-says-he-isnt-allowed-to-throw-footy-around-with-his-son/1c735aae-82aa-4c45-abad-40a603f1106d",
        "title": "Father furious after school says he isn't allowed to throw footy around with his son",
        "publish_date": "Thu, 17 Jul 2025 22:38:46 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "A﻿ Queensland dad has been left disgruntled after he was told he isn't allowed to throw a footy around with his son on school grounds.\n\nDean's son asked him to throw the football around for a few minutes after he dropped him off at school yesterday morning.\n\nDean and his son found a spot to throw the ball around, until a teacher approached them and said the unthinkable.\n\nDean's son asked him to throw the football around for a few minutes after he dropped him off at school yesterday morning. (Supplied/Nine)\n\n\"A teacher came over and started telling me about how it was unsafe to be over here, and we had to go over with all the other children and sit down and read quietly before school,\" Dean told Today .\n\n\"I asked why, and she said it's not safe to be over here because you're unsupervised... I said, 'Well, I'm supervising my son, so consider him supervised.'\n\n﻿\"She said, 'No, it's not safe to be here, and it's unfair on the other children who don't have their parents here at the moment to play with them.'\"\n\nDean said he and his son were about 20 metres away from the rest of the kids on a patch of grass near a classroom.\n\nREAD MORE: ﻿ Children defend parents jailed for drug syndicate\n\nDean said both he and his son were upset by the incident. (Nine)\n\n﻿A few minutes later, Dean separated from his son to put his backpack into his locker, and he saw the deputy principal approach his child to reprimand him about the incident.\n\n\"﻿He gave him a bit of a rev up, apparently about being over there, passing the ball with his dad,\" the Queensland dad said.\n\n\"That really upset me, I didn't understand why he didn't come and speak to me.\n\n\"[My son] was pretty shook up, he was visibly upset, he said, 'Dad are you in trouble?' and I said, 'Mate, how could I be in trouble for passing a footy with you?'\n\n\"He just couldn't understand why they were so worked up about nothing.﻿\"\n\nDean said it was an escalation of recent rules around kids playing sport after school unsupervised. (Supplied/Nine)\n\nDean said it was an escalation of recent rules around kids playing sport after school unsupervised.\n\n﻿\"I know that after school they don't want kids playing sport... I think now the school's pulled back,\" he said.\n\n\"They don't want kids playing on the playground. They don't want them playing on the oval, on any grass patch.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/new-covid19-vaccine-protects-against-several-variants-researchers-claim/800fcca9-8c3a-4d2e-b139-2ebe07f7f720",
        "title": "New Aussie vaccine protects against several COVID variants: researchers",
        "publish_date": "Fri, 18 Jul 2025 00:39:59 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "Australian scientists say they have created a COVID-19 vaccine that can protect against several variants of the virus.\n\nResearchers from the Centenary Institute and the University of Sydney ﻿created the CoVEXS5 vaccine, which protects against five variants of the virus, including the \"highly immune-evasive\" Omicron XBB.1.5 variant and SARS-CoV-1, a relative of SARS-CoV-2.\n\nStudies showed reduced virus levels in the lungs of vaccinated mice by 99.9 per cent, compared to unvaccinated controls.\n\nScientists have created a COVID-19 vaccine that can protect against several variants of the virus, health researchers said. (AP)\n\nIt also triggered high levels of virus-blocking antibodies and activated special immune T-cells in the lungs, which are critical for the body to fight the virus.\n\n\"By combining parts of multiple coronaviruses, we've created a vaccine that can better prepare the body to fight off both current and future threats,\" Dr Claudio Counoupas, a researcher at the Centenary Institute's Centre for Infection and Immunity, said.\n\nThe CoVEXS5 vaccine features a unique version of the spike protein, fusing protein elements from several different COVID-19 variants into one single structure.\n\nResearchers say this fusion helps the immune system recognise and respond to a broader range of virus types.\n\nREAD MORE: Dyan is forced to choose between her health and paying rent\n\nThe CoVEXS5 vaccine features a unique version of the spike protein, fusing protein elements from several different COVID-19 variants into one single structure. (Getty)\n\n﻿\"The immune response we saw in the laboratory was both strong and broad,\" co-lead study author Elizabeth Chan said.\n\n\"It's exciting to think that this approach could help future-proof vaccines against ongoing changes in the virus.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/continuous-glucose-monitor-subsidy-type-2-diabetes-exclusive/6ef11a04-9a0f-4e1a-bf88-fefb90101259",
        "title": "'I don't want to die': Dyan's forced to choose between her health and paying rent",
        "publish_date": "Thu, 17 Jul 2025 19:33:20 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "Exclusive: Dyan Henry, 45, was about to do the school pickup run when an alarm sounded.\n\nIt was her continuous glucose monitor﻿ (CGM) alerting her that her blood sugar was dangerously low.\n\nHenry lives with insulin-requiring type 2 diabetes but doesn't ﻿show typical hypoglycaemia (low blood sugar) symptoms until it's too late, at which point she can lose coordination or pass out.\n\nA proud mum, Dyan Henry doesn't want to miss out on experiences with her child because of unmanaged diabetes. (Supplied)\n\nIf not for her CGM alarm, that afternoon could have turned into a tragedy.﻿\n\n\"I was about to get in the car to go to a school with kids everywhere, with the chance that I could have just gone unconscious behind the wheel,\" Henry told 9news.com.au.\n\nBut she's had to live without that safeguard for decades because she can't afford it.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nWho gets subsidised CGMs?﻿\n\nCGMs are wearable tech that allow people with diabetes to track their blood sugar levels in real-time without finger-prick tests.\n\nOne lasts about 14 days and costs around $100, adding up to more than $2500 per year.\n\nResearch has shown that they can dramatically reduce the risk of life-threatening diabetes-related complications for people living with type 2 diabetes.\n\nBut under the National Diabetes Services Scheme (NDSS), CGMs are only subsidised for Australians with type 1 diabetes.\n\nType 2 diabetes affects almost 1.2 million people in Australia and many more have yet to be diagnosed. (Graphic: Polly Hanning)\n\nThat leaves more than 310,000 people with insulin-requiring type 2 diabetes to pay out of pocket in a cost-of-living crisis or go without.\n\nHenry falls into the second category.\n\n\"I work, my husband works, but we can't even say we're getting by,\" she said.\n\n\"We spend every day worrying about, 'Can we pay our rent? Can we keep our lights on?'\n\n\"I can't pay $200 a month, that's half a week's rent. It's ridiculous.\" ﻿\n\nAs a result, her health has suffered.﻿\n\nLiving with type 2 diabetes\n\nPrimarily caused by a combination of genetic predisposition and lifestyle factors﻿, type 2 diabetes affects almost 1.2 million people in Australia.\n\nIndividuals with a family history are at ﻿higher risk of developing the condition so Henry, whose mother and father both had diabetes, \"stood no chance\".\n\n﻿\"It was really a matter of when, not if I got diabetes,\" she said.\n\nDiagnosed at 23 despite having \"no symptoms\", Henry spent years struggling to manage her diabetes with traditional blood glucose meters which require finger-prick tests.\n\nREAD MORE: Two teenagers charged with murder over deadly stabbing\n\nBoth of Henry's parents had diabetes, so she was at higher risk of developing the condition as well. (Supplied)\n\nShe ﻿﻿has autism spectrum disorder (ASD) and attention-deficit/hyperactivity disorder (ADHD), which made it difficult for her to keep track of her blood sugar and injections.\n\n\"Trying to remember to take insulin two, three times a day, checking my blood sugar levels and getting used to needles is hard,\" she said.\n\n\"A lot of that early time, my diabetes was not controlled at all. It was terrible.\"\n\nHenry regularly ﻿experienced severe lows without warning because she didn't experience typical hypoglycaemia symptoms﻿, leaving her confused and barely conscious.\n\n﻿She also suffered multiple devastating pregnancy losses that she said were ﻿linked to her uncontrolled diabetes.\n\n'Life-changing' wearable tech﻿\n\nIn late 2024, Henry was given the chance to trial a continuous glucose monitor (CGM) free of charge and had her life \"transformed\" almost overnight.\n\nWith it, she was able to consistently keep her blood sugar levels within a safe range for the first time in years.\n\nIt also woke her in the night when her levels dropped dangerously low, something she previously would have slept through due to a lack of symptoms.\n\nHenry lives with insulin-requiring type 2 diabetes but can't afford the medical device that would change her life. (Supplied)\n\n\"To have that visual of where [your blood sugar levels] are, where it's headed, having an alarm with that attached ... it was life-changing,\" she said.\n\nHenry claimed her health was better in the two weeks she trialled that CGM than it has been in decades.﻿\n\nBut without an NDSS subsidy, she can't afford to pay for them long-term and she fears her health will decline again.﻿\n\n\"Sometimes it comes down to: we can afford a monitor, or we can afford the insulin. You can't fight over that when you really need both.\"\n\nBarely getting by, physically and financially\n\nThis National Diabetes Week (July 13–19), Henry is calling for the ﻿NDSS to change the existing CGM subsidy to include Australians living with insulin-requiring type 2 diabetes.\n\nMany Australians living with type 2 diabetes experience ﻿stigma and feel shamed for \"bringing the disease upon themselves\".\n\nHenry feels this stigma is part of the reason why ﻿people living with type 2 diabetes are not yet eligible for subsidised CGMs.\n\nWith so many people already struggling to make ends meet in the cost-of-living crisis, they shouldn't be made to choose between their health and paying rent.﻿\n\n\"I don't see why it can't be subsidised for both groups,\" Henry said.\n\n\"A lot of people who make the decisions have never experienced it﻿, but [CGMs] saved my life and I know they could save so many other lives﻿.\"\n\nAbout one in 15 Australian adults currently lives with diabetes, according to Australian Bureau of Statistics (ABS) data, and the number requiring insulin is expected to rise.\n\nHenry was 33 when she lost her mother, who also suffered from diabetes, and doesn't want her own child to go through the same thing.\n\n\"I don't want to be hospitalised for a diabetes complication or, heaven forbid, die from one because of something that was unaffordable.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/felix-baumgartner-skydiver-dies-paragliding-accident-italy/9e18f39c-6a1d-45b9-9ac8-452ec76c88d5",
        "title": "Skydiver famed for jump from space dies in paragliding accident",
        "publish_date": "Thu, 17 Jul 2025 21:53:30 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "Felix Baumgartner, an Austrian BASE jumper and skydiver renowned for his record-breaking jump from the stratosphere, has died while paragliding in Italy, local media reported.\n\nBaumgartner, 56, lost control of his paraglider and crashed into a hotel swimming pool in the coastal town of Porto Sant'Elpidio, CNN affiliate SkyTG24 reported.\n\nThe apparatus struck a woman who was not seriously injured, according to SkyTG24.\n\nREAD MORE: Australian BASE jumper dies in jump gone wrong in Italy\n\nAustrian skydiver Felix Baumgartner has died after a paragliding accident in Italy. (Getty)\n\nItaly's national broadcaster RAI reported that authorities were working to determine the exact cause of the crash.\n\nCNN has reached out to Baumgartner's representatives.\n\nThe mayor of Porto Sant'Elpidio, Massimiliano Ciarpella, said on his official Facebook page that his community was \"deeply affected\" by the death of Baumgartner, who he called a \"symbol of courage.\"\n\nBaumgartner was known for a record-breaking jump from the stratosphere in 2012. (supplied)\n\nBaumgartner, who had BASE jumped from landmarks like the Petronas Towers in Malaysia and the Christ the Redeemer statue in Rio de Janeiro, achieved international recognition in 2012 when he broke a world record by skydiving from a pressurised pod about 39km above the ground.\n\nA decade later, he described to CNN how he felt at that moment.\n\n\"I'm standing there on top of the world outside of a capsule in space and in the stratosphere. I looked around the sky above me was completely black,\" Baumgartner told CNN Sport's Patrick Snell.\n\n\"I was really trying to inhale that moment,\" he added.\n\nBaumgartner spoke about the jump in subsequent years. (Supplied)\n\nAs he fell to Earth, his speed reached more than 1350km/hr, breaking the sound barrier.\n\nThe so-called Red Bull Stratos freefall took six years to plan as the team worked out every detail of the jump.\n\n\"We thought, we're going to build the capsule, build the pressure suit, practice for a while, and then we go all the way up to the stratosphere and come back to Earth at supersonic speed,\" said Baumgartner.\n\nBaumgartner after the jump in 2012. (AP)\n\n\"Sometimes we'd go into a meeting with three problems and then leave that meeting eight hours later with another five … and no solution for the previous problems.\"\n\nTo get Baumgartner up to the stratosphere, his team had to construct a helium balloon the size of 33 football pitches, weighing 1682kg. It took as many as 20 people to move without damaging the balloon's material, which was 10 times thinner than a sandwich bag.\n\nBut the biggest threat to the project was perhaps the most unforeseen – Baumgartner's mental fortitude.\n\nBaumgartner was awarded the Laureus World Action Sportsperson trophy. (AP)\n\nThe suit had to be both pressurised and able to handle temperatures of -72 degrees.\n\n\"It's very uncomfortable,\" said Baumgartner.\n\n\"You have a total lack of mobility. It always feels like you're breathing through a pillow. You're completely separated from the outside world. So once the visor is down, all you can hear is yourself breathing.\"\n\nPrisoner-of-war blinks out T-O-R-T-U-R-E in television interview View Gallery\n\nSoon after landing, Baumgartner said he struggled to process his emotions as he approached the Earth.\n\n\"I had tears in my eyes when I was coming back a couple of times because you're sitting there and you thought about that moment so many times, you know, how it would feel and how it would look like,\" he said.\n\n\"And this is way bigger than I had anticipated.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/first-guardian-master-trust-superannuation-lost-asic-investigation-exclusive/7a944ee1-faa0-40c0-8972-011f056c9fee",
        "title": "Christian, JC and Johanna are missing a combined $319k in super",
        "publish_date": "Thu, 17 Jul 2025 06:54:48 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Christian Eriksen was hoping to retire next year.\n\nBut the 59-year-old from NSW is terrified that $140,000 of his superannuation has disappeared without a trace.\n\nMelbourne man JC Sanchez, 41, also faces losing $124,000 from his retirement fund.\n\nAnd single mum Johanna Henderson, 31, said $55,000 of her nest egg is now circling the drain.\n\nChristian Eriksen said he is missing $140,000 in super. (Supplied)\n\nAll three are financial victims of collapsed superannuation fund First Guardian Master Trust, which went into liquidation this year – taking around $446 million from 6000 people with it.\n\nAmong them are business owners, parents and mum and dad investors who are now worried sick about their future.\n\nApproaching 60, Eriksen hoped retirement was in his future.\n\nBut the small business owner said he will have to keep working for years to come to recoup the losses.\n\n\"I intended to retire at the end of the year,\" he told 9news.com.au.\n\n\"I'm just going to have to keep working. It throws all my plans completely out the window.\"\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nHis $140,000 had been frozen since 2024, but recently his balance had returned to zero.\n\nEriksen has started a Facebook group to help others who lost super from First Guardian.\n\nA group of 122 people have come together to ask for help and support.\n\nCorporate regulator ASIC began investigating First Guardian's responsible entity Falcon Capital, First Guardian and director David Anderson in late 2024.\n\nAccording to ASIC, most of the 6000 people accessed First Guardian through superannuation platforms Diversa, Netwealth and Equity Trustees.\n\nIt alleges investors were lured into transferring their super by \"lead generators\" who referred them to personal financial advice providers.\n\nASIC says they were \"advised to roll their superannuation assets into a retail choice superannuation fund, and then invest into First Guardian\".\n\nEriksen is concerned he will never see his money again.\n\nHe said he \"inadvertently\" had money in First Guardian via Netwealth.\n\nJC Sanchez looks set to lose $124,000 in super - 90 per cent of his retirement nest egg. (Supplied)\n\nSanchez, who runs his family business, said he feels the \"Australian dream\" has been ripped away from thousands of people.\n\nHe said Venture Egg convinced him to roll his super from ANZ into First Guardian.\n\nASIC froze the assets of Venture Egg's owner Ferra Merhi in February and cancelled his financial services licence in June.\n\n\"I'm not really near retirement age, so I'm trying to be positive,\" Sanchez said.\n\n\"My grandfather always said, he was a World War II immigrant from Italy, and he said, 'Australia is a lucky country, just work and you'll be looked after, you'll be able to succeed here.'\n\n\"And I just thought super was sacred. I never thought it could be stolen like this.\"\n\nSanchez said the idea that 6000 people simply made a bad investment or are victims of a scam is wrong.\n\n\"You should be protected no matter what. But we feel like idiots,\" he said.\n\n\"Some nights I don't sleep right because I'm up lying in bed thinking about it.\n\n\"There's a lot of hurt people out there.\"\n\nHenderson is a single mum and lost her super after consolidating through Venture Egg following a separation.\n\n\"I've just started studying full-time with the hope of working part-time whilst studying. But now I have to work full time whilst studying to earn more super as I'm stressed I won't have enough,\" Henderson said.\n\n\"It also makes me feel pressure to find a partner to support my retirement.\"\n\nJohanna Henderson is worried she has lost $55,000. (Supplied)\n\nHenderson is also confused as to how it happened.\n\n\"Our super should be protected,\" she said.\n\nAnother 6000 Australians are facing the same uncertainty following the Shield Master Fund collapse.\n\nBoth funds had exposure to failed property developer Paul Chiodo, who ASIC alleges has questionable transactions, including luxury properties, linked to Shield Master.\n\nFormer investors in First Guardian want the government to help.\n\nThey believe they shouldn't be punished for investments they knew nothing about.\n\nThere are also calls for more transparency and regulation in the complex superannuation fund industry.﻿\n\n\"We want to kick up a hornet's nest,\" Sanchez said.﻿\n\nThe Federal Court has made interim travel restraint orders against Falcon Capital Limited directors David Anderson and Simon Selimaj.\n\nThe court also made interim orders freezing the assets of Mr Selimaj until February 27, 2026.\n\nLiquidators from FTI Consulting say the case could take at least a year to resolve.\n\n9news.com.au has contacted FTI Consulting for an update on the liquidation.\n\nA spokeswoman for Assistant Treasurer Daniel Mulino told 9news.com.au the government was concerned for investors.\n\n\"The government is committed to ensuring that investor interests are safeguarded and the regulatory framework governing the investment landscape is fit for purpose,\" the spokeswoman said.\n\n\"ASIC has taken steps to commence enforcement and protect investors, including freezing assets and cancelling financial licences where appropriate.\n\n\"As these matters are before the Federal Court and part of ongoing investigations by ASIC and the liquidators, it would be inappropriate to provide further comments or speculation.\"\n\nASIC's full statement\n\nASIC has an ongoing investigation in relation to First Guardian Master Fund and Falcon Capital.\n\nFollowing concerns raised by ASIC, the Federal Court appointed liquidators to Falcon Capital and ordered the wind-up of First Guardian and its related funds in April. The court also restrained David Anderson, a director of Falcon, from dealing with his assets and appointed a receiver to his personal property.\n\nASIC's investigation suggests that potential consumers were called and referred to personal financial advice providers who advised consumers to roll their superannuation assets into a retail choice superannuation fund, and then to invest part or all of their superannuation into First Guardian.\n\nWhile ASIC's investigation is ongoing, the Federal Court has made interim travel restraint orders against Falcon Capital director David Anderson on ASIC's application. The Court also made interim orders freezing the assets of another Falcon director, Simon Selimaj and restraining his travel. Those orders are in place until 27 February 2026.\n\nWe understand the circumstances surrounding First Guardian are distressing for those affected and it is one of ASIC's priorities to investigate what has happened and to preserve as much of investors' funds as possible while our investigation is continuing.\n\nSo far, ASIC has had more than 40 court appearances on matters related to First Guardian and Shield. We have taken a range of enforcement action with respect to these matters including:\n\nstop orders to prevent ongoing consumer harm,\n\ncommencing court proceedings to preserve assets and restrict travel of persons of interest,\n\nappoint receivers and liquidators with the aim of securing investor funds\n\nexecuting numerous search warrants with the assistance of the Australian Federal Police.\n\ncancelled licences and banned certain financial advisers.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/uber-and-uber-eats-partners-with-afterpay-to-leverage-younger-customer-base/626488f7-6ae2-4205-aa30-cdd6ade7226b",
        "title": "You can now pay for your Uber and Uber Eats with Afterpay",
        "publish_date": "Thu, 17 Jul 2025 05:27:05 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Uber and Uber Eats are teaming up with Afterpay as customers move away from traditional forms of credit.\n\nThe buy now, pay later service - available t﻿o Uber and Uber Eats customers in Australia and New Zealand - can be added to a customer's wallet for takeaway purchases and rideshare trips.\n\nAfterpay CEO Nick Molnar said it would give Uber customers more control over their finances.\n\nUber and Uber Eats is teaming up with Afterpay to leverage the company's ﻿Gen Z and millennial customer base. (Getty)\n\n\"Bringing Uber on board is a perfect representation of Australians continuing to call for Afterpay as a preferred partner in their lives,\" Molnar said.\n\n\"Afterpay is, and always has been, about providing customers safe and flexible ways to pay in their everyday lives and Uber plays a crucial role in the lives of millions of Australians.\n\n\"We're giving customers greater control over how and when they pay via a seamless addition to Uber Wallet.\"\n\nA recent report found younger Australians are turning away from credit cards , with many considering them to be financially dangerous.\n\nFinancial stress is the main driving factor for Gen Zs born between 1996 and 2005 shunning the payment method.\n\nThe ﻿ buy now, pay later industry is facing tougher regulations this year after the Australian Securities and Investments Commission (ASIC) proposed modifications to the Credit Act.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/larapinta-trail-northern-territory-second-hiker-rescued/105541318",
        "title": "Larapinta Trail hikers urged caution after two rescues in one week",
        "publish_date": "Fri, 18 Jul 2025 01:45:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "Northern Territory Parks is reminding hikers to carry personal location devices and be well prepared when they head into the outback after a man was rescued from the Larapinta Trail in central Australia this week.\n\nPerth resident Mark Foley was walking the breathtaking track through the West MacDonnell Ranges/Tjoritja National Park west of Alice Springs when he started to feel unwell.\n\nThe view from Brinkley Bluff on section four of the Larapinta Trail. (Supplied: Lukáš Pečinka)\n\n\"I had a skin sore, which one of the guys was fixing up and I all of a sudden felt very dizzy,\" the 62-year-old said.\n\n\" I got quite nauseous, clammy, sweaty. It just came on out of nowhere. I've never had that sensation before. \"\n\nMr Foley and his friends were well prepared and one of them used a device to send out the alarm.\n\nA few hours later, Mr Foley was airlifted to Alice Springs Hospital, where he received treatment for infection and dehydration.\n\nMr Foley was airlifted to Alice Springs Hospital. (ABC Alice Springs: Victoria Ellis)\n\nPlanning and preparation key\n\nSenior director for Parks and Wildlife Operations Chris Day said the incident was the second rescue of a hiker from the Larapinta Trail that week.\n\nGoing hiking? One of these devices could save your life Photo shows A selection of electronic devices held by a person for display. When you go hiking, experts say a personal locator beacon should be a non-negotiable. So how do they work, and where do you get one? Mr Day said even the most experienced hikers could get into trouble, so it was important to be prepared.\n\n\"It starts well before you get on the walk, that's the key. It's planning and preparation,\" the Parks ranger of 44 years said.\n\n\" It's not just about knowing your route. It's knowing your own capability. It's knowing that you've got the right equipment. \"\n\nChris Day says everyone should carry a personal location device on the walk. (ABC Alice Springs: Victoria Ellis)\n\nMr Day recommended all hikers or people adventuring into the outback carry a personal locator beacon (PLB) so rescuers could easily find them in an emergency.\n\n\"Number one is that communication device, the personal locator beacon, or increasingly these days these messaging devices, which both have the ability to raise an alarm,\" he said.\n\nA personal locator beacon. (ABC Alice Springs: Victoria Ellis)\n\nPreparing for hike Carry a PLB\n\nCarry enough water and food\n\nPack for the climate\n\nKnow your capability\n\nKnow your route\n\nTell family members or park officials your route and expected arrival or check in times Source: Northern Territory Parks\n\nAll's well that ends well\n\nAfter a three-day stint resting in Alice Springs, Mr Foley was given the all clear by doctors to return to the trail.\n\n\"I rejoined the trip at Standley Chasm,\" he said.\n\nMr Foley said the experience had not deterred him from future hikes, but he was grateful his group was carrying a location and communication device.\n\n\"It's just so essential,\" he said.\n\n\" It all went smoothly in the end. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/afl-ross-lyon-hits-out-at-racist-social-media-trolls/105546344",
        "title": "'It was hate, it was vehement': Saints coach hits out at racist trolls",
        "publish_date": "Fri, 18 Jul 2025 01:11:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ross Lyon has called for stronger language to be used around social media \"hate\" after St Kilda star Nasiah Wanganeen-Milera was the target of racial abuse online.\n\nWanganeen-Milera and Port Adelaide's Jase Burgoyne called out anonymous trolls after both players received a series of abusive messages following their games last round.\n\nThose directed at Wanganeen-Milera appeared related to betting on the 22-year-old playmaker's disposal count in the Saints' loss to Sydney.\n\n\"It was hate, it was vehement, it was disgusting,\" St Kilda coach Lyon said.\n\n\"We don't stand for it as a club and the AFL doesn't, and the community shouldn't.\n\n\"It's more than racism — it's hate. You know what? The standards you walk past are the standards you accept.\n\n\"They call it out, we'll move on and play our footy.\"\n\nLyon said Wanganeen-Milera had been \"really well\" in the days since calling out the abuse.\n\nThe out-of-contract star, who is weighing up his playing future amid huge interest from rival clubs, will line up for the Saints in their clash with Geelong at Kardinia Park on Sunday.\n\n\"Nothing fazes Nas,\" Lyon said.\n\nLoading...\n\n\"It's nothing to do with Nas … Nas is a great person and he's becoming a great player.\n\n\"If anything, the power's in how you respond. He's got nothing to shy away from.\n\n\"Deep down, would it be really hurtful and uncomfortable? Yeah, but guess what? That's out there … it was hate, it was vehement and it was disgusting.\n\n\"We don't stand for it and we want to stamp it out and we want to call it out, which has been done.\"\n\nThe AFL on Monday condemned the \"abhorrent racist remarks\" directed at Wanganeen-Milera and Burgoyne, and is investigating the incidents.\n\nLast week, a Melbourne man was arrested and charged after alleged racist comments on social media directed towards NBL star Montrezl Harrell.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/moesha-johnson-5km-world-aquatics-championships/105546108",
        "title": "Moesha Johnson wins back-to-back world titles after thrilling sprint",
        "publish_date": "Fri, 18 Jul 2025 01:09:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Moesha Johnson has won her second gold medal at the World Aquatics Championships, sprinting to the gong in the 5-kilometre race in Singapore.\n\nJust 36 hours after winning gold in a gruelling 10km swim in soupy conditions in Singapore, Johnson backed up by leading from the front in the 5km event.\n\nThe Australian beat Italian Ginevra Taddeucci, whom she also beat to gold in the 10km race earlier in the week, in a thrilling sprint finish after 1 hour, 2 minutes and 1 second of swimming.\n\n\"A little bit of shock,\" an exhausted Johnson said after the race.\n\n\"That was harder than I expected. The body's not feeling too crash hot.\n\n\"To come away with two world titles in two plus days, in 30 degrees plus water, you can't ask for much more than that.\"\n\nMoesha Johnson was absolutely spent after the sprint finish. (Supplied: Swimming Australia/Delly Carr)\n\nIchika Kajimoto of Japan finished third, 27.6 seconds behind Johnson.\n\nDolphins debutant Tayla Martin finished in 20th spot with a time of 1:04.37.\n\nJohnson, the Olympic 10km silver medallist, burst free from the pack just before the start of the third and final lap alongside Taddeucci of Italy, the Paris bronze medallist.\n\nThe 27-year-old from northern New South Wales set the pace from early on before delivering a blistering burst of speed just before the final feed zone.\n\nThat gap opened up to 15 seconds to the chasing pack with half a lap to go.\n\nTaddeucci stuck with Johnson, who furiously tried to break the elastic to the Italian by varying her line and pace, risking the pair's position at the front of the race.\n\nThe cat-and-mouse battle — taking place with a backdrop of shipping containers outside Singapore's bustling harbour — made for a thrilling conclusion to the race.\n\n\"I've mad a lot of decisions that have forced me to commit,\" Johnson, who has moved from Griffith to Miami swimming club since winning her Olympic silver.\n\nMoesha Johnson had to dig deep in the final sprint. (Getty Images: Quinn Rooney)\n\n\"When it comes to a close finish, I just think about what I've been through over the last 12, 18 months.\n\n\"Nobody's getting past me.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWater-quality problems had plagued the open water events, leading to several delays at Sentosa, the island area on the coast of Singapore.\n\nThe events were delayed due to high levels of E. coli in the water, although that had settled before the 10km events on Thursday.\n\nWater quality is not an unusual problem for open-water swimmers, who also had to deal with multiple delays at the Paris Olympics last year.\n\nJohnson now has three World Championship gold medals to her name.\n\nShe will look to defend the mixed relay gold the Australians won in Doha last year, before turning her attention to the pool, where she will compete in both the 1,500m and 800m events.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/teladoc-remote-telehealth-surgery-technology-central-queensland/105541826",
        "title": "Neurosurgeon dials in to emergency brain surgery from 600km away",
        "publish_date": "Fri, 18 Jul 2025 00:11:25 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Michael Lamparelli was at a party in Brisbane last month, he did not expect to be saving a life that night.\n\nBut when he helped another remote colleague virtually \"scrub in\" to a surgery in Rockhampton, more than 600 kilometres away, that is exactly what happened.\n\n\"The patient had a significant bleed inside their skull, causing pressure on their brain,\" Dr Lamparelli said.\n\n\" If it hadn't been relieved, there was a danger they were going to be permanently damaged, or die. \"\n\nThe deputy director of surgery at Rockhampton Hospital, in central Queensland, had spent three years campaigning for the new specialised piece of telehealth equipment, which allowed the surgery to go ahead.\n\nThe Teladoc system, which has rolled out in the Rockhampton, Gladstone and Emerald hospitals, allows specialists to dial in virtually to a surgery, see close up what is happening via multiple camera angles and provide advice to colleagues.\n\nTeladoc allows specialist surgeons to dial in to regional surgeries. (ABC Capricornia: Katrina Beavan)\n\nIt is the first time the equipment has been used in an Australian public hospital.\n\nDr Lamparelli said last month, when he was away in Brisbane, other Rockhampton colleagues were unavailable for the complex emergency surgery.\n\nOn his phone from the party, he connected Brisbane neurosurgeon Craig Winter into the live surgery to assist the general surgeon on call in Rockhampton, who had never performed that particular operation before.\n\nMichael Lamparelli says the technology is life-saving. (ABC Capricornia: Katrina Beavan)\n\n\"What I was able to do was push those images from my phone to the neurosurgeon, and he was able to supervise that case … talking to her [the on-ground surgeon] through the whole procedure,\" Dr Lamparelli said.\n\n\" I was able to watch this in real time as she removed a bit of bone from the skull and then relieved all that clot. \"\n\nDr Lamparelli said the procedure took about an hour, then the patient was stabilised and taken to Brisbane — a transfer which took about five hours.\n\nThe patient is now back in the Rockhampton hospital, recovering well in the rehabilitation centre.\n\nHopes to change regional healthcare\n\nRockhampton Hospital director of surgery Chris Lewis said he was hopeful the new technology could change the landscape of regional healthcare.\n\n\"The geography of Australia is fatal,\" Dr Lewis said.\n\n\"Especially in trauma and severe injury, a lot of our patients come from cattle stations in the middle of nowhere, and time is of the essence.\n\n\"You actually need the help there and then, and you can't stop the operation and come back at a later date.\"\n\nChristina McInally says staff will love connecting with global specialists. (ABC Capricornia: Katrina Beavan)\n\nDr Lamparelli said it was thanks to fundraising through not-for-profit organisation CQ Shines Hospital Foundation and the Gladstone Ports Corporation that the machines could be purchased.\n\n\"If we can prove that it's worthwhile, we would hope that other hospitals would get this,\" he said.\n\nRockhampton Hospital telehealth coordinator and clinical nurse consultant, Christina McInally, said any specialist in the world could be dialled in to the secure network, so she was hopeful it would also help to retain staff.\n\n\"It's also showing that our staff are great at their job and can do absolutely amazing things when we just have a little bit of extra support,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/cbds-need-revitalisation-as-shops-close/105541756",
        "title": "Calls to make CBDs cool again as empty shops haunt cities",
        "publish_date": "Thu, 17 Jul 2025 23:37:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "The main streets in two of Western Australia's largest regional cities were once bustling hives of activity but are now lined with empty shops.\n\nRetailers throughout Australia are struggling to compete with online markets and battling to attract customers at a time when many people are unable to make ends meet.\n\nThe situation has prompted calls from locals in Albany and Bunbury to make each city's CBD cool again.\n\nBunbury has to deal with rising costs and competition from online and outer suburban shopping centres. (ABC South West WA: Jacqueline Lynch)\n\nWhile Bunbury, 170km south of Perth, is WA's largest regional city, the population has not helped local businesses escape the slump.\n\nFormer restaurateur Calum Murphy found it particularly difficult to keep afloat, closing his burger shop in 2023 after just two years operation.\n\nFormer business owner Calum Murphy says it's sad to see so many empty shops in Bunbury's CBD. (Supplied: Calum Murphy)\n\n\"The price of rent in town is really high at the moment,\" he said\n\n\"And everything from food to energy all started to go up after the pandemic.\n\n\" Bunbury's CBD is specifically struggling now that there are more businesses out in the suburbs. \"\n\nA further 330km south, empty shops and \"for lease\" signs are a similarly regular sight in Albany.\n\nAlbany shop owner Vivian Cann is retiring after some tough years working in retail. (ABC Great Southern: Andrew Chounding)\n\nJeweller Vivian Cann is set to retire and close her Middleton Loop shop after more than 20 years in business.\n\n\"Retail has been hard,\" she said.\n\n\"People don't have the time to go shopping when they've got kids and school, and they're working full time.\n\n\"And the cost of living has had a huge impact.\"\n\nAn Albany business owner says young people seem hesitant to get into retail. (ABC Great Southern: Andrew Chounding)\n\nCalls to revitalise the CBD\n\nGenevieve Mardon's clothing store in Bunbury also struggled, opening in 2020 but shutting two years later.\n\nThe long-term resident remembered Bunbury \"thriving\" in the 1980s.\n\n\"People just don't come into the CBD anymore like they used to,\" she said.\n\nGenevieve Mardon wants to see Bunbury become cool and thriving like it was in the 1980s. (Supplied: Genevieve Mardon)\n\nBut while big money had been spent bringing sporting stars to Bunbury, Ms Mardon said the city had little else to offer.\n\nShe called for Bunbury CBD to reinvent itself in a fashion similar to cities like Newcastle in New South Wales which lent its empty spaces to artists in a bid to bring vibrancy back to the city.\n\n\"We want to make Bunbury cool again,\" she said.\n\nOther businesses have raised concerns about theft and threatening behaviour, which some say had become commonplace in the Bunbury city centre.\n\nThere is noticeable anti-social behaviour in Albany and Bunbury city centres. (ABC Great Southern: Andrew Chounding)\n\nCan it be done?\n\nGeraldton, 400km north of Perth and WA's second-largest regional city, faced similar problems in its CBD six months ago.\n\nThey turned to the Town Team Movement, a social enterprise set up to foster active citizenship and development from within smaller communities.\n\nSpokesperson Julian Canny said it took some simple steps to turn things around.\n\n\"We had pavement art that went onto arcades that have been needing a bit of love,\" he said.\n\n\"We had kids cutting up stickers and putting them all over the [empty] windows.\n\nSimple steps have helped revitalise Geraldton's CBD, advocates say. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nNow, he said, business owners were keen to invest.\n\n\"We have a cafe strip that used to be one shop on the east end of Marine Terrace that now runs the whole length of our mall, and you cannot walk through without seeing people from end to end,\" Mr Canny said.\n\n\" Anecdotally we're actually seeing the most amount of new retailers and new hospitality venues that we have seen in years. \"\n\nHe urged other areas to explore similar initiatives.\n\n\"Who is already doing great things? And how do we build on their stuff? From there it just slowly snowballs and grows,\" Mr Canny said.\n\nWhat's in the works for Bunbury?\n\nThere's hope sporting games and a new hotel in Bunbury will help breathe some life back into the city. (ABC South West WA: Jacqueline Lynch)\n\nBack in Bunbury the business community believes tourism and hospitality will provide the spark the city centre needs.\n\nThe head of the Bunbury Geographe Chamber of Commerce and Industry, Sean McKeown, said businesses were keen to embrace new opportunities.\n\n\"Every city centre, every area, has a chance to reinvent itself,\" he said.\n\n\"There are plans for a bigger hotel in town … and we have seen recently new owners for one of the hotels bringing in live music and entertainment.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/forensic-science-queensland-director-linzi-wilson-wilde-resigns/105545630",
        "title": "Forensic science director quits after suspension",
        "publish_date": "Thu, 17 Jul 2025 23:14:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "The director of Forensic Science Queensland (FSQ) has resigned a month after she was suspended by the state government following \"contamination issues\" being identified.\n\nDr Linzi Wilson-Wilde, who was appointed to the role in September 2024, confirmed to the ABC she had resigned.\n\nIn a statement, she said she wished the lab nothing but the best.\n\n\"I'm honoured to have worked at FSQ the last two years with amazing staff,\" Dr Wilson-Wilde said.\n\nAttorney-General Deb Frecklington announced in June she had immediately suspended Dr Wilson-Wilde, pending a show cause notice for her removal.\n\nAttorney-General Deb Frecklington suspended Dr Wilde in June. (ABC News)\n\n\"This action was taken following advice I received today that FSQ was placing a general pause on routine DNA testing after contamination issues were identified,\" Ms Frecklington said at the time.\n\nThe government has not disclosed the nature of the contamination issues, but has confirmed routine DNA testing has since resumed.\n\nActing director to continue in role\n\nIn a statement on Friday morning, Ms Frecklington said the Dr Wilson-Wilde's resignation was effective immediately.\n\n\"Natasha Mitchell, Executive Manager Forensic Biology, will continue acting in the role of director until a permanent appointment is made,\" she said.\n\n\"The Crisafulli government is firmly committed to the future of Forensic Science Queensland.\"\n\nFSQ director suspended after DNA contamination issues identified Photo shows A woman in a purple jacket with large silver buttons sitting in an office chair. Attorney-General Deb Frecklington says she has moved to immediately suspend the director, Linzi Wilson-Wilde, pending a show cause notice for removal.\n\nFSQ is an independent statutory authority and forensic service provider, which supports the criminal justice and coronial systems with specialised services in forensic biology and forensic chemistry.\n\nTwo commissions of inquiry, in 2022 and 2023, found serious failings over many years at the FSQ lab, including a \"fatally-flawed\" automated testing method that might have seen offenders escaping conviction.\n\nDr Wilson-Wilde became director in September 2024 after joining FSQ as interim chief executive in January 2023.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/garbage-shirley-manson-let-all-that-we-imagine-be-the-light/105539034",
        "title": "Garbage's Shirley Manson pulled herself out of the abyss to write new album",
        "publish_date": "Thu, 17 Jul 2025 23:13:20 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Shirley Manson thinks her band mates are \"f***ing lucky\" to have her.\n\nThe Scottish frontwoman is one of the coolest figures in alternative rock, and has led Garbage — made up of bassist Duke Erikson, guitarist Steve Marker and drummer Butch Vig — for more than 30 years.\n\nIn those years, the band, remarkably still in its original configuration, has sold more than 20 million albums and earned critical acclaim, starting with its self-titled 1995 debut, which included dark rock singles like 'Only Happy When It Rains' and 'Stupid Girl'.\n\nManson was 28 and on the dole in Scotland when she was asked to join Garbage, after Marker saw her performing in a music video for her band Angelfish. (Pictured in 1995.) (Supplied: Stéphane Sednaoui)\n\nBut it hasn't all been smooth sailing. In 2004, Garbage quietly disbanded midway through recording their fourth album, Bleed Like Me, amid communication issues, pressure from its label and a vocal injury for Manson.\n\nA year later, the band cancelled their scheduled European tour dates and announced an indefinite hiatus, which lasted (mostly) until they reunited in 2010.\n\nNow, Manson tells Double J: \"We've enjoyed a long career together and we still enjoy each other's company, which is kind of a miracle, really.\n\n\"Because it's hard. When you're stuck together for that long, it's like a really dysfunctional family unit.\n\n\" I do their head in and they do my head in and it's all beautiful. \"\n\nGarbage performed the theme song for the 1999 Pierce Brosnan James Bond movie The World Is Not Enough. (Supplied: BMG)\n\nThis year, Garbage is back with a new record, their eighth studio album, Let All That We Imagine Be the Light.\n\nTuning into love\n\nManson recorded some of her vocals for the new album from a bedroom in Los Angeles, as she was recuperating from not one, but two, hip-replacement surgeries.\n\nThe first, in 2023, was a long time coming: In 2016, while touring Garbage's sixth album, Strange Little Birds, she fell off stage into the security barrier at a concert in Los Angeles. At the time, she seemed unhurt, but it left her hip \"battered\".\n\nGarbage in 2016, the year the band released Strange Little Birds (and Manson hurt her hip). (Supplied)\n\nAs Manson was recovering from the first surgery — suffering brain fog from the painkillers, and using a walker to get around — the band were deep into writing what would become Let All That We Imagine Be the Light.\n\n\"I was all higgledy-piggledy, as we say in Scotland,\" Manson says. \"And I wasn't really myself.\"\n\nNot feeling up to joining her band in the studio, she encouraged them to go on without her. They sent her pieces of music to write lyrics for when she was up for it, with \"really trite\" titles like 'Ding Dong' or 'Brats' or 'Bad Kitty'.\n\n'Bad Kitty' ended up sticking: It became the record's second single 'Get Out My Face AKA Bad Kitty'.\n\n\"The male members of the band could never remember the actual title of the song and they kept referring to it as 'Bad Kitty',\" Manson explains.\n\n\"When I put the sequence together on the record, I kept the 'Bad Kitty' so they would know which song I was referring to.\"\n\nOn album closer 'The Day That I Met God', Manson sings about taking opioids for pain relief, tongue firmly in cheek: \"I found God in Tramadol.\" (Supplied: BMG)\n\nManson's other hip collapsed just after Garbage's show at Wembley Arena in London last year, leading to them cancelling their US tour. The shows were scheduled just before the band planned to start mastering the new album.\n\nIt was the physical and mental toll of her recovery that shaped the kind of songs Manson wrote for the new album.\n\nThey're a marked shift from the tracks on their previous record, No God No Masters, whose lyrics directly comment on social injustices, including racism, sexism and misogyny, and Manson's social media presence, where she is outspoken on political issues, including the war in Gaza.\n\n\"I just couldn't separate myself from what was happening to me in my own life,\" Manson says. \"And I was really struggling with what I saw going on around me: the world felt very violent and chaotic and full of intolerance, and it really was getting me down.\"\n\nShe found herself in what she describes as a physical, mental and spiritual depression. It led her to reach for \"something that felt more positive\".\n\n\"I wanted to tune into love, which sounds so hackneyed and cliched,\" she says.\n\nManson's quest to \"find love out there in the world, for myself and for my wellbeing\", is immediately apparent on the record, which opens with the single, 'There's No Future in Optimism', and the refrain: \"If you're ready for love…\"\n\n\"In the search for love, I realised it's a mighty force,\" Manson says. \"There's many different shapes of love in the world. It's not just romantic love. It's all kinds: being in love with your community or, in my case, my band, or with the Earth and the ocean and the animals.\n\n\"I had to really reach into that in order to pull myself out of what felt like a bit of an abyss.\"\n\nTurning 60\n\nManson's health struggles also brought up ideas around aging, which became a theme of Let All That We Imagine Be the Light.\n\nIn 'Chinese Fire Horse', Manson sings: \"You say my time is over/That I have gotten old… That I should do the right thing by everybody/And I should just retire.\"\n\nListen to Garbage talk to Dylan Lewis on Double J Photo shows Garbage frontwoman Shirley Manson crouches in the desert\n\nBut she retorts in the chorus, over angular guitars: \"I may be much older, so much older … But I've still got my power in my brain and my body.\"\n\nManson admits she did think she would find getting older — and her body changing — a frightening prospect. But, as she sings on 'Sisyphus', the first song she wrote for the record: \"This little body of mine is going to make things right.\"\n\nInstead, her health struggles have left her feeling grateful and with a new understanding of her body as she approaches her 60th birthday next year.\n\n\"I suddenly realised: 'Oh my God, I am aging and I've had a 30-year career with this band,'\" Manson says.\n\n\"I'm like an elder all of a sudden, a grown-up. But that's been quite beautiful in a funny way … I am enjoying the ride in a way that I didn't expect I would.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/olivia-smith-first-million-pound-player-in-womens-football/105545550",
        "title": "Smith becomes first million-pound signing in women's football",
        "publish_date": "Thu, 17 Jul 2025 22:56:07 +0000",
        "category": "sports",
        "authors": [],
        "text": "European champions Arsenal have shattered the women's transfer record by signing Canadian forward Olivia Smith from Liverpool for a fee of 1 million pounds ($2 million).\n\nThe new benchmark in women's football surpasses the 900,000 pounds ($1.8 million) Chelsea paid for Naomi Girma from San Diego Wave in January.\n\n\"She's one of the most-talented young players in the game and has huge potential for further development here at the club,\" Arsenal director of women's football Clare Wheatley said.\n\nThe 20-year-old Canada forward signed a four-year deal, a person with knowledge of the contract told The Associated Press.\n\nThe person, who also confirmed the record fee, spoke on the condition of anonymity because the full details of the transfer had not been made public.\n\nSmith's deal highlights the rapid increase in spending in women's football, with transfer records regularly broken in recent years.\n\nZambia striker Racheal Kundananji set a new record when joining Bay FC from Madrid CFF for $US788,000 (587,000 pounds, $1.2 million) last year, and that figure was quickly exceeded by Girma's move to Chelsea, becoming the first $US1 million player in women's football.\n\nOlivia Smith shone for Liverpool in a disappointing season for the club. (Getty Images: Jess Hornby)\n\nAs recently as 2020, the most expensive women's player was Denmark's Pernille Harder, who joined Chelsea from Wolfsburg for $US355,000 (264,000 pounds).\n\nEngland's Keira Walsh left Manchester City for Barcelona in 2022 for a deal worth $US513,000 (382,000 pounds), and Chelsea broke the record again in 2024 when signing Mayra Ramirez from Levante for $US542,000 (404,000 pounds).\n\nBut those figures are still a long way behind the men's game where Neymar remains the record signing following his 2017 move from Barcelona to Paris Saint-Germain for $US262 million (195 million pounds).\n\nKylian Mbappe joined PSG for $US216 million (160 million pounds) and is the second-most-expensive player of all time.\n\nThe first player in men's football to command a million-pound price tag was former England forward Trevor Francis when he moved from Birmingham City to Nottingham Forest in 1979.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nSmith became an international at 15\n\nAfter one season at Penn State, Smith joined Sporting Lisbon in 2023 and scored 16 goals in 28 appearances. She moved to Liverpool last year and scored nine times in 25 games.\n\nSmith is also Canada's youngest international after making her debut at 15 in 2019.\n\n\"Olivia is an exciting young player and we believe she can make a big contribution here at Arsenal,\" head coach Renee Slegers said.\n\n\"We've been impressed by her mentality and character, excelling in two European leagues at such a young age.\"\n\nArsenal is a 15-time English champion and won the Champions League for the second time in its history last season.\n\nDespite Chelsea being the dominant force in women's football in England, Arsenal is the only English team to win the Champions League.\n\n\"It's my dream to compete for the biggest titles here in England and in Europe and I'm excited to get started and contribute to doing that here with Arsenal,\" Smith said.\n\nReuters/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/federal-politics-live-blog-july-18/105545406",
        "title": "Live: Uptick in unemployment is 'unwelcome but unsurprising': Chalmers",
        "publish_date": "Thu, 17 Jul 2025 22:18:52 +0000",
        "category": "finance",
        "authors": [
            "Patrick Bell",
            "Courtney Gould",
            "Tom Crowley",
            "Stephen Dziedzic In Chengdu"
        ],
        "text": "(ABC News: Patrick Bell)\n\nIt was a variation on a theme for SA Greens senator Sarah Hanson-Young today, commenting on the latest in her state's algal bloom.\n\nAfter bringing a dead salmon into the Senate chamber earlier this year, the senator today opted for a photo of a dead dolphin, snapped yesterday by one of her team on a beach in southern Adelaide.\n\nThe ongoing toxic algal bloom has devastated the state's marine life and coastline.\n\nHanson-Young has slammed the Environment Minister Murray Watt, who told ABC Radio Adelaide the \"primary responsibility\" over the bloom was with the SA government.\n\n\"This is a national disaster, and South Australians deserve the full response from the federal government,\" she said.\n\nShe also called for a \"COVID-style rescue package\" for affected businesses and local councils and questioned whether the PM had been briefed about the algae crisis.\n\n\"Does the prime minister even know this is happening? Because if he does, he'd be doing something about it. But he hasn't even said a word,\" Hanson-Young said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/aussies-struggle-the-open-portrush-day-one/105545430",
        "title": "Aussie Open crew playing catch-up after Smith shocker",
        "publish_date": "Thu, 17 Jul 2025 22:17:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Cameron Smith duffed his tee shot in near-darkness at 6:57am — and it did not get much better for Australia's British Open contingent over the next 14 hours, as they are already playing catch-up at Royal Portrush.\n\nThe mildly embarrassed 2022 champion, Smith, could hardly believe his scuffed effort at the first hole of the 153rd Open — it trickled, perhaps fittingly, a mere 153 yards into some rough stuff down the left.\n\nIt was not even far enough to reach the fairway on a demanding Thursday morning, local time, on the Northern Ireland links.\n\nBut credit to Smith, he bounced back after labouring to the turn at three over and then scrapped, summoning up what he hailed as \"a bit of Queensland spirit\", as he fought to a one-over 72.\n\n\"I think I tried to hit that one underground — and almost missed it,\" sighed Smith.\n\n\" Not the greatest start to a major championship I've ever had. \"\n\nYet he could hardly have imagined that not one of the other eight Australians to follow could improve on his round, with none managing to break par.\n\nThat was in stark contrast to the rest of the field, with 29 players able — either side of a couple of hours of dreadful rain-swept, windy conditions — to finish in red figures as the day approached its conclusion.\n\nThey were being headed by the quintet of Denmark's Jacob Skov Olesen, China's Li Haotong, Britain's former US Open champion Matt Fitzpatrick, South African Christiaan Bezuidenhout, and American Harris English, who all shot four-under 67s.\n\nEven Adam Scott, who, like Smith, began with a workable 72 a day after his 45th birthday, admitted the green and gold contingent will need to get to work fast on Friday to drag themselves back into the fray.\n\nAdam Scott hit a 72. (Getty Images: Christian Petersen)\n\nAsked if he was still in the hunt in his 25th consecutive Open and 97th straight major, Scott said: \"I mean, kind of. It could have got away. I'm not out of it, but I'm going to have to have a good morning tomorrow. Hopefully, the weather cooperates.\"\n\nThat is the imponderable. Jason Day, who also had to battle with a fine inward nine to get back to two-over for his round, was left tearing his hair out about the ever-changing climate, featuring heavy rain, gusty winds and sunshine.\n\n\"It's the craziest weather pattern I've ever experienced in my life here. There's no consistency to it whatsoever. I'd love to be a weatherman here. You just get it wrong all the time,\" the 2023 Open's joint runner-up at Hoylake said.\n\nNot that he was happy with his game.\n\n\"To work hard coming into this week and then to go out there and have poor process is not acceptable, especially in my eyes,\" Day said.\n\n\"I've got to do a better job of it, and hopefully come back tomorrow and do it again, play better.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe rest of the Aussies were left muttering something similar.\n\nIn-form Lucas Herbert started brightly, and was among the early leaders at two under, but four bogeys over the last eight holes left him with a three-over 74.\n\nLike Herbert and Scott, Marc Leishman was fuming to bogey the last, ending at two over, while Elvis Smylie had six bogeys in his 75, and Min Woo Lee had three straight late bogeys to finish with a 74. Curtis Luck, the last Aussie to finish, was six over after 14.\n\nRyan Peake's big adventure in his first major went somewhat awry as he ended with a six-over 77.\n\nThe Australian former motorcycle gang member, who turned his life around through golf after spending time in prison for assault, has been the centre of much attention at Portrush this week after gaining his place thanks to a fairytale win at the New Zealand Open.\n\nPartnering former champion Phil Mickelson, 31-year-old Peake ended up getting the six-time major winner to sign his glove and to give him his ball after the round.\n\nMickelson recorded a one-under 70, while the Perth debutant struggled, admitting: \"I just got beat up out there.\"\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/meta-investors-zuckerberg-settle-lawsuit-over-facebook-privacy/105545342",
        "title": "Meta investors settle $8b lawsuit with Zuckerberg over Facebook privacy",
        "publish_date": "Thu, 17 Jul 2025 21:56:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Meta CEO Mark Zuckerberg has agreed to settle an $US8 billion ($12 billion) lawsuit with a group of shareholders over how top executives and directors handled repeated privacy violations of Facebook users.\n\nThe settlement was announced on Thursday by a lawyer for the shareholders. The parties did not disclose how much they agreed to settle for nor on what terms.\n\nJudge Kathaleen McCormick adjourned the trial just as it was to enter its second day in a Delaware court and congratulated the parties.\n\nThe plaintiffs' lawyer, Sam Closic, said the agreement just came together quickly.\n\nBillionaire venture capitalist Marc Andreessen, a defendant in the trial and a Meta director, was scheduled to testify on Thursday.\n\nShareholders of Meta sued Mr Zuckerberg, Mr Andreessen and other former company officials — including former chief operating officer Sheryl Sandberg — in hopes of holding them liable for billions of dollars in fines and legal costs the company paid in recent years.\n\nThe Federal Trade Commission fined Facebook $US5 billion in 2019 after finding it failed to comply with a 2012 agreement with the regulator to protect users' data.\n\nHigh Court dumps Facebook's privacy challenge Photo shows US President-elect Donald Trump speaks at his election night rally in Manhattan, New York, US, November 9, 2016. Facebook had argued it was not responsible for allegedly unlawful access to Australians' personal data in 2014 and 2015.\n\nThe shareholders wanted the 11 defendants to use their personal wealth to reimburse the company. The defendants denied the allegations, which they called \"extreme claims\".\n\nFacebook changed its name to Meta in 2021. The company was not a defendant and declined to comment.\n\nOn its website, the company has said it has invested billions of dollars into protecting user privacy since 2019.\n\nA lawyer for the defendants declined to comment.\n\n\"This settlement may bring relief to the parties involved, but it's a missed opportunity for public accountability,\" said Jason Kint, the head of Digital Content Next, a trade group for content providers.\n\nExecutives avoid probing questions\n\nMr Zuckerberg was expected to take the stand on Monday and Ms Sandberg on Wednesday. The trial was scheduled to run through the end of next week.\n\nThe case was also expected to include testimony from former Facebook board members Peter Thiel, Palantir Technologies co-founder, and Reed Hastings, co-founder of Netflix.\n\nBy settling, Mr Zuckerberg and other defendants avoid having to answer probing questions under oath.\n\nMs Sandberg was found during the litigation to have deleted what were likely her most sensitive emails and she was sanctioned, making it harder for her to tell her side of the story in court.\n\nThe settlement allows plaintiffs to avoid trying a very difficult case.\n\nSheryl Sandberg was found during the litigation to have deleted what were likely her most sensitive emails and she was sanctioned. (AP: Thibault Camus)\n\nMeta investors alleged that former and current board members completely failed to oversee the company's compliance with the 2012 FTC agreement.\n\nThe lawsuit also claimed that Mr Zuckerberg and Ms Sandberg knowingly ran Facebook as an illegal data harvesting operation.\n\nThe oversight allegations are known as Caremark claims, considered the most difficult to prove under Delaware corporate law.\n\nIt was the first time Caremark claims went to trial, and even if the plaintiffs had gotten a judgement in their favour, the case would have been appealed to the Delaware Supreme Court.\n\nThat court has reversed major shareholder victories in recent years.\n\nThe case followed revelations that data from millions of Facebook users was accessed by Cambridge Analytica, a now-defunct political consulting firm that worked for Donald Trump's successful US presidential campaign in 2016.\n\nThose revelations led to the FTC fine, which was a record at the time.\n\nFacebook hit with $US5b fine Photo shows Mark Zuckerberg stands and gives a speech at a conference The FTC approves a $US5 billion settlement with Facebook over its investigation into the social media company's handling of user data.\n\nOn Wednesday, an expert witness for the plaintiffs testified about what he called \"gaps and weaknesses\" in Facebook's privacy policies but would not say if the company violated the 2012 agreement that Facebook reached with the FTC.\n\nJeffrey Zients, a former board member, testified on Wednesday that the company did not agree to the FTC fine to spare Mr Zuckerberg legal liability, as shareholders alleged.\n\nThe defendants' legal team also showed the court notes that Mr Zients had taken when he was on the board that seemed to show he was urging the board to make user privacy a top priority, which would undercut plaintiffs' claims.\n\nThe trial settlement marks the second time Mr Zuckerberg avoided testifying in the court.\n\nIn 2017, Facebook abandoned a plan to issue a new class of stock as a way for Mr Zuckerberg to extend his control over the company while selling his shares.\n\nThe decision came a week before Mr Zuckerberg was expected to testify in the Court of Chancery to defend the stock plan.\n\n\"Facebook has successfully remade the Cambridge Analytica scandal about a few bad actors rather than an unravelling of its entire business model of surveillance capitalism and the reciprocal, unbridled sharing of personal data,\" Mr Kint said.\n\n\"That reckoning is now left unresolved.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/asx-markets-business-news-live-updates/105545412",
        "title": "Live: All Ords nears 9,000 points as ASX follows Wall St to record highs",
        "publish_date": "Thu, 17 Jul 2025 21:40:16 +0000",
        "category": "finance",
        "authors": [
            "Michael Janda",
            "Adelaide Miller"
        ],
        "text": "In Australia we have a board of governors of the Reserve Bank. Is the structure of the US Federal Reserve similar and how would removing/replacing Jerome Powell affect the FED? - Andy Smith\n\nGreat question Andy.\n\nIn short, removing Jay Powell and replacing him with a more \"administration friendly\" Fed chair would probably have limited effect on the bank's decisions.\n\n(Aside from the fact that Powell was originally appointed by Donald Trump during his first term as president — and look how that's played out!).\n\nThat's because, as with most developed economy central banks, the Fed's decisions are made by a committee, not an individual.\n\nAs we saw at the last RBA board meeting, three members voted to cut rates, and six voted to hold.\n\nWith the Fed, we even get to see how each member voted.\n\nAnd, at the last meeting in mid-June, we know from the minutes that no-one on the Federal Open Market Committee (FOMC) voted to cut rates, all members present voted to keep rates on hold:\n\nVoting for this action: Jerome H. Powell, John C. Williams, Michael S. Barr, Michelle W. Bowman, Susan M. Collins, Lisa D. Cook, Austan D. Goolsbee, Philip N. Jefferson, Adriana D. Kugler, Alberto G. Musalem, Jeffrey R. Schmid, and Christopher J. Waller. Voting against this action: None.\n\nSo, even if Trump can replace Powell, he'll have a tough job overhauling the thinking of literally every other Fed member.\n\nSeven of the FOMC members are Federal Reserve governors appointed by the president, but, like the chair, can only be removed for \"cause\". Otherwise, their terms run for 14 years and only one is up for replacement every second year.\n\nThe other five members of the FOMC are presidents of the various regional Federal Reserve branches — the New York Fed president and then a rotation among the other branches.\n\nThe president doesn't even get a say in appointing those FOMC members.\n\nSo, at least in theory, under the current system it is virtually impossible for Trump to stack the FOMC and thereby shift rates policy.\n\nI guess the concern on markets is that if he can sack the chair and appoint something of a puppet, then it might pressure the other independent FOMC members to fall more in line with the president's views, lest they be targeted next.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/ons-jabeur-taking-break-from-tennis/105545386",
        "title": "Grand slam finalist taking time out to 'rediscover the joy of simply living'",
        "publish_date": "Thu, 17 Jul 2025 21:29:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Three-time grand slam finalist Ons Jabeur says she is taking a break from competitive tennis.\n\nThe 30-year-old made the announcement in a social media post on Thursday.\n\nTunisia's Jabeur, the first Arab woman to reach a grand slam final, has struggled with her form in recent months, failing to get past the third round of a major this year.\n\nThe two-time Wimbledon finalist's campaign came to a disappointing end at the All England Club last month as she retired from her first-round clash against Viktoriya Tomova, unable to continue after a long medical timeout.\n\nThe former world number two suffers from asthma and experienced breathing difficulties at this year's Australian Open.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nJabeur, often called the \"minister of happiness\" for her cheerful personality, said she was not feeling truly happy on the court.\n\n\"For the past two years, I've been pushing myself so hard, fighting through injuries and facing many other challenges. But deep down, I haven't truly felt happy on the court for some time now,\" she said in a statement.\n\n\"Tennis is such a beautiful sport. But right now, I feel it's time to take a step back and finally put myself first: to breathe, to heal, and to rediscover the joy of simply living.\"\n\nJabeur, married to former fencer Karim Kamoun, has also been open about her wish to start a family.\n\n\"Thank you to all my fans for understanding. Your support and love mean the world to me. I carry it with me always,\" she said.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-18/mayor-says-epa-monitored-toxic-waste-for-years-and-did-nothing/105541098",
        "title": "Council faces $500k toxic waste clean-up EPA watched happen, mayor says",
        "publish_date": "Thu, 17 Jul 2025 21:18:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Victorian mayor who discovered that authorities were aware that toxic waste had been dumped outside a property near Bacchus Marsh says the state government has \"absolutely no care for the safety of its people\".\n\nMoorabool Shire Council lost a battle at the Victorian Civil and Administrative Tribunal (VCAT) against the Environment Protection Authority (EPA) on Wednesday.\n\nAs a result the council has been ordered to clean up 20 pallets of dissolved acetylene cylinders, which are highly flammable and filled with asbestos.\n\nMoorabool Shire Mayor Paul Tatchell alleged the cylinders were moved from a property in Merrimu, near Bacchus Marsh, onto council land.\n\nHe also alleged the EPA monitored the property for two years and watched on as the cylinders were dumped beside a public road.\n\nCr Tatchell says it is \"disgraceful\" that ratepayers must foot an expected $500,000 bill to clean up the waste, which can only be processed at one site in Victoria.\n\n\"At the end of the day we're there to protect our residents and we're going to get a bill for about half a million bucks, plus legal costs, for something the EPA knew all about and watched happen,\" he said.\n\n\"They waited until these trailers were removed off this property and then put the order on us … to clean it up because the perpetrator was bankrupt.\n\n\"[We either] have a gutless minister that won't stand in and protect the people, or an EPA … that is more interested in protecting the minister.\"\n\nEnvironment Minister Steve Dimopoulos has been contacted for comment.\n\nThe VCAT hearing heard the EPA had cameras set up at the address to monitor movement of the material but did not intervene.\n\nVCAT found that the footage was not monitored in real time and so would \"simply provide information about what had happened rather than providing a realistic opportunity for intervention\".\n\nIn an affidavit to VCAT, Moorabool Shire chief executive Derek Madden said the community was being forced to pay for \"the EPA's failure to manage a site under its knowledge and oversight\".\n\nCulprit known to EPA, mayor says\n\nCr Tatchell said the dumping of acetylene cylinders had been a problem for years throughout the state.\n\n\"This is when they used to dispose of acetylene with asbestos … those cylinders can never be refilled by the people who manage the products,\" he said.\n\n\" They became proscribed waste, I suppose — there's only one place that can get rid of it. \"\n\nThe EPA says its order for the council to clear the waste \"remains in force\". (Supplied)\n\nCr Tatchell believed whoever dumped the cylinders at Merrimu did so without the property owner's knowledge.\n\n\"The EPA definitely knows [who it is], but they just haven't given it to us,\" he said.\n\n\"There are still thousands of these acetylene tanks floating around Victoria on people's properties.\n\n\"I've got absolutely no doubt that the EPA knows where they are and are just going to do the same thing all over the Victoria.\"\n\nThe EPA said \"as a result of VCAT's ruling, EPA's decision requiring council to clear the waste remains in force\".\n\n\"The matter is continuing in VCAT as the final hearing is not until later this year,\" it said in a statement.\n\n\"EPA's investigation into the illegal dumping is ongoing so further comment cannot be made.\"\n\nThe Victorian government said it was working with local governments to crack down on illegal dumping.\n\n\"We know illegal dumping of waste has an impact on local communities and environment — that's why we have given the EPA greater powers to crack down on offenders, including tougher penalties for repeat offenders,\" a spokesperson said.\n\n\"The EPA is working with local governments across the state, along with industry and community, to address this issue as part of its Illegal Waste Disposal Program, which aims to disrupt systematic illegal waste disposal.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/musicals/phantom-of-the-opera-returns-to-sydney-harbour-amid-opera-australia-woes-20250718-p5mfxd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Phantom of the Opera returns to Sydney Harbour amid Opera Australia woes",
        "publish_date": "Fri, 18 Jul 2025 12:18:42 +1000",
        "category": "finance",
        "authors": [
            "Chris Hook"
        ],
        "text": "Following this year’s disastrous financial results, Opera Australia will restage its hit 2022 production of Phantom of the Opera for next summer’s Opera on the Harbour season.\n\nThe season will kick off the beloved Andrew Lloyd Webber musical’s 40th anniversary year in March and promises a lucrative box office – the 2022 Handa Opera on the Harbour season sold 61,580 tickets, despite being dogged by wild rain and unpredictable weather, narrowly missing the record 65,000 tickets sold to West Side Story in 2019.\n\nJoshua Robson as the Phantom and Georgina Hopson as Christine in the 2022 production. Credit: Prudence Upton\n\nIt comes at a crucial time for the national opera company, which posted a $10 million operating deficit this year, following disappointing returns for its 2024 production of Sunset Boulevard.\n\nOpera Australia chair Rod Sims said that when the results were released in May, the company was committed to “better programming”, trimming procurement costs and “taking a stronger look at musicals”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/god-is-a-literary-snob-i-ll-have-the-scar-to-prove-it-20250710-p5mdyt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "God is a literary snob. I’ll have the scar to prove it",
        "publish_date": "Fri, 18 Jul 2025 12:17:28 +1000",
        "category": "lifestyle",
        "authors": [
            "Anson Cameron"
        ],
        "text": "Job 20:27: And the Heavens will expose his iniquity, and the Earth will rise up against him.\n\nIn the Kimberley, the red battlements overhanging Australia’s prettiest waterfall are decorated with Gwion art tens of thousands of years old, most of it depicting people amid lively ceremony. The falling water fans out into a long semicircular fringe of white with outlying strands decorating the cliff face for hundreds of metres. Below the falls is a stretch of dark river where massive crocodiles make patient ambush. Above, there are only freshwater crocs and there, we swam away the inherent aches of this hard country.\n\nKing George River in the Kimberley. Credit: Getty Images\n\nThe far side of this remote river is Indigenous land, empty now. The side we were walking was a cattle station, a couple of million acres, but the cattle were gone or gone wild. We camped on a rock shelf a kilometre above the falls and as the sun went down, I wrote a poem in my notebook.\n\nRoads and years give out short of here\n\nWhere clear water runs chasms of red stone.\n\nNo man-made proof of man, no inkling of sapiens\n\nSave arrangements of blood and sap on sheltered rock,\n\nRevellers and warriors daubed by bygones,\n\nDressed to the nines and dancing evermore,\n\nBeseeching their gods, soundlessly, endlessly,\n\nUselessly, as it turns out.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/australian-golfers-struggle-as-royal-portrush-lashed-by-wild-weather-20250717-p5mfu1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Almost missed it’: Cam Smith makes an ‘awful’ start to Open but recovers as Royal Portrush weather turns crazy",
        "publish_date": "Fri, 18 Jul 2025 12:14:07 +1000",
        "category": "sports",
        "authors": [
            "Sam Mcclure"
        ],
        "text": "Day, who teed off early in the morning and avoided the worst of the weather, admitted it was some of the most challenging conditions he’s ever seen. “The weather here … it’s the craziest weather pattern I’ve ever experienced in my life,” Day said after walking off the 18th hole as the heavens opened. “Craziest weather pattern I’ve ever experienced”: Jason Day reacts on the 18th green. Credit: Getty Images “There’s no consistency to it whatsoever. I mean, I’d love to be a weatherman here. You just get it wrong all the time. “Definitely not (the weatherman doesn’t get it right). And I can say that with true honesty because I’ve been watching the weather pattern over the last two weeks … other than last weekend; he got it right. But this whole week has just been awful for trying to get it right.\n\n“It’s not good to be wrong in golf, it might be good to be wrong as a weatherman.” Day was also highly critical of himself, reflecting on his errors as the root cause of his poor round. He said he would speak to his performance coach on Thursday night to try to rectify the situation before he tees off for his second round. Adam Scott plays a shot on the 12th hole. Credit: Getty Images “My process out there was actually quite horrific … I’ve been a professional too long to get this wrong. To work hard coming into this week and then to go out there and have poor process is not acceptable, especially in my eyes. I have no one else other than myself to blame.” It was also a tough day for Smith. He bogeyed the first hole after finding the long grass off the tee and made a rare double bogey on the ninth to be four over at the turn.\n\nIt’s at that point the Queenslander said he gave himself a stern talking to. He didn’t want to repeat what he said because he didn’t want to use expletives. “I can’t say it,” he laughed. “I’ve just been doing a really good job of committing to swings and committing to shots. I think being a little bit uncomfortable out there, it just kind of slipped my mind a few times and hit a few bad shots and got myself into a bit of trouble when I really shouldn’t have. Marc Leishman tees off on the first hole. Credit: Getty Images “I’ve been swinging the club really nicely. Like I said, I just need to go out there and commit to some swings. I was able to do that on the back nine and give myself a lot of looks.” Smith said whoever is able to grind away through the conditions and hold on for long enough will put himself in contention late on Sunday.\n\n“I think that’s every major. You see the guys that are playing well, and generally the guys at the top of the leaderboard at the end of the week are the guys that are grinding it out and really putting 100 per cent into every shot,” he said. Loading “For sure that’s how it’s going to be. Looks like we’re going to get a bit of Open weather here the next few days. Yeah, kind of strap in.” Meantime, Leishman was critical of the slow pace of play on the course. Several groups were taking well over five hours to complete their rounds, which is extraordinary given they are playing in groups of three and not four. “I think I got up about eight [holes], watched an hour. Felt like we were on the golf course for about 12 hours. We’ve been on the course for three hours through eight holes. That was tough to deal with, especially coming from somewhere where we play in under four-and-a-half every week,” Leishman said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/why-isn-t-there-a-single-social-media-savvy-mp-in-parliament-20250712-p5megm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why isn’t there a single social media-savvy MP in Parliament?",
        "publish_date": "Fri, 18 Jul 2025 12:02:49 +1000",
        "category": "finance",
        "authors": [
            "Nick Bonyhady"
        ],
        "text": "Chandler-Mather is in some ways a poor messenger, given his loss, but he insists there are longer-term risks from politicians’ lack of engagement with voters on social media platforms. “Australia’s going down the pathway of this sort of slow disengagement,” says Chandler-Mather. “Like, the number of people disengaging from politics increases every year. The number of people who feel sort of distrustful of politics increases every year.” Tim Doyle, a marketing savant who has done contract work for Labor in the past and now leads telehealth company Eucalyptus, says Australian political parties are behind much of the Western world. “They also only fire up the engine, which needs to be always on, about six weeks before an election,” Doyle says.\n\nWhere an American politician like Mamdani might throw himself into the ocean fully clothed in midwinter as he declares “I’m freezing… your rent”, Australian MPs play it safe, Doyle says. “Politicians are terrified of being vulnerable and that’s the essential thing for social media,” he says. “They have no idea what engagement matters. They preach to their true believers, who like and share their content, but that does nothing to convince the undecided voters they need.” Good social posts, he says, “should make your true believers a little bit uncomfortable.” Only a handful of politicians tiptoe into the stunts and trends that might distinguish them online from the parade of slick brand videos and AI-generated slop.\n\nDan Repacholi, the MP for the Hunter in NSW, has, for example, posted videos with fake wounds to promote safety in the mining industry and tells men to “watch your nuts” as part of his role as a men’s health envoy. One Nation’s Please Explain cartoon has flourished online, but is between seasons. And Keith Wolahan, a Liberal MP who did extensive social media directed at Chinese-Australian voters, lost his Melbourne seat at the election. Loading But most MPs have only a few thousand followers, far fewer than niche hobby influencers, and fill their feed with screenshots of press releases, clips from television interviews and awkward, unedited speeches about the opening of local facilities. One Labor MP, speaking on condition of anonymity, says the government has no unified social media strategy outside of elections. “People just do their own social media,” the MP says. “After coming to government, I just don’t have the time.” Former Labor campaign strategist Megan Lane says Australia’s compulsory and preferential voting system means that politicians here can use social media differently than other countries.\n\nThere is no need to persuade voters to back a candidate in a primary, to bring disengaged people to a booth on polling day, or to tack to extremes because preferential voting tends to bring those ballots back to the parties in the centre. Politics is also less polarised, making it less likely to be picked up by an algorithm online. “Instead of exciting rusted-on supporters to drive up voter turnout, Australian politicians are essentially focused on persuading punters that they are the least bad option,” Lane says. Max Chandler-Mather’s social media success did not save him at the last federal election. Credit: Alex Ellinghausen Mainstream media too still has huge influence. Seven’s Sunrise breakfast television program, for example, had a national average audience of 399,000 people as of July 16, according to figures from industry measurement provider Virtual Australia. Morning interviews often draw further reporting from outlets, as do scoops in newspapers, multiplying their audience throughout the day.\n\nBut another dynamic is staffing. Political staffers on both sides of politics, who were not authorised to speak publicly, said social media was typically the responsibility of the most junior person in an MPs office. Career progression required going into policy development or traditional public relations. “They all think about traditional media all the time and never social,” Doyle says of politicians, who are in their mid-40s on average when elected, according to data from the Parliamentary Library. Jenrick’s approach is different. The MP employs a 21-year-old called Dov Forman to film his videos. Uniquely among political staffers, Forman is a social star in his own right who racked up millions of views filming the stories of his great-grandmother, a Holocaust survivor, during the pandemic. His expertise is evident in his style. Where most Australian MPs talk straight into the camera, Forman’s videos for Jenrick are frenetic. His 58-second clip on fare evasion has 33 jump cuts. There is a risk in getting social media wrong, though. “It’s a personal choice,” says the Labor MP. “How do you get people to focus on your message without turning yourself into a clown?”\n\n“Some people in the crossbench are happy to veer towards silly stuff but if you want to be serious in government I don’t think it’s worthwhile.” Loading Chandler-Mather, the former Greens MP who developed a huge social media following, disagrees. “The idea that ‘We’re a party of government, and so we can’t propose anything other than tinker around the edges’ is a completely self-serving argument,” Chandler-Mather says. He argues that politicians from the major parties lack the charisma and appealing messages that work online. “To be honest, the calibre of Australian politician isn’t fantastic,” Chandler-Mather concludes. His loss, he says, was a result of major party preferences and being outspent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/carey-video-filming-legal-but-insinuation-could-spark-defamation-lawyer-warns-20250718-p5mfwu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Carey video: Filming legal, but insinuation could spark defamation, lawyer warns",
        "publish_date": "Fri, 18 Jul 2025 12:01:09 +1000",
        "category": "finance",
        "authors": [
            "Hannah Hammoud"
        ],
        "text": "A prominent Melbourne lawyer says it is legal to film in a public place and legal to publish a video, but any insinuation that former footballer Wayne Carey and a Melbourne marketing executive had acted inappropriately in a wine bar bathroom could spark a defamation claim.\n\nA group of women filmed Melbourne woman Kate Aston leaving a bathroom at Armadale venue Toorak Cellars last Friday night and walking up steps. She was followed about 20 seconds later by Carey.\n\nMelbourne woman Kate Aston. Credit: Oreana\n\nIn the widely shared video, Carey is seen stopping to make a phone call while the women filming can be heard making comments such as “she looks embarrassed” and “what’s he doing in there?”\n\nCarey and Aston have both denied the insinuation that anything occurred between them in the bathroom. Carey said the toilets were unisex.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/snowboarding-gun-guseli-hints-at-dropping-new-stuff-20250718-p5mfzp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Snowboarding gun Guseli hints at 'dropping new stuff'",
        "publish_date": "Fri, 18 Jul 2025 12:00:14 +1000",
        "category": "sports",
        "authors": [],
        "text": "Snowboarding gun Guseli hints at 'dropping new stuff'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/lions-block-wallaby-from-playing-in-first-nations-and-pasifika-xv-20250718-p5mfvw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lions block Wallaby from playing in First Nations & Pasifika XV",
        "publish_date": "Fri, 18 Jul 2025 12:00:00 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "The British and Irish Lions have refused to allow Waratahs and Wallabies backrower Pete Samu to represent the First Nations and Pasifika XV next Tuesday in Melbourne because he did not play Super Rugby this season.\n\nSamu won the European Cup with Bordeaux in May and then joined the Waratahs in the same month. The demand comes three weeks after British and Irish Lions chief executive Ben Calveley pressurised Wallabies coach Joe Schmidt to release his squad to Super Rugby sides to ensure a competitive build-up ahead of the Test matches.\n\nSources with knowledge of the Lions’ demand but not authorised to speak publicly said that Samu was told the news yesterday in Melbourne and was offered the opportunity to leave the First Nations and Pasifika XV, but requested to stay with the squad. Samu’s teammates were told on Friday morning at training.\n\nThe First Nations & Pasifika XV fixture in Melbourne was created after the collapse of the Melbourne Rebels last May and will be the first time a team of this nature has played the British and Irish Lions in Australia.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/brussels-sprouts-salad-with-pancetta-cheddar-and-sherry-vinaigrette-20250716-p5mfan.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brussels sprouts salad with pancetta, cheddar and sherry vinaigrette",
        "publish_date": "Fri, 18 Jul 2025 11:55:53 +1000",
        "category": "finance",
        "authors": [
            "Danielle Alvarez"
        ],
        "text": "This textural salad works as a standalone meal or robust side. William Meppem\n\nWinter might be my favourite time of year for salads. Greens, such as Brussels sprouts, kale and radicchio, are all hearty enough to hold up to any number of toppings and punchy dressings.\n\nHere, Brussels sprouts, both raw and roasted, are combined to provide different textures and greater depth of flavour, then tossed with crispy pancetta, shallots, sharp cheddar cheese and a sherry vinaigrette. A grated-egg topping lends further oomph for a standalone meal or a robust side dish for roast meats.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/stephen-colbert-delivers-devastating-update-on-future-of-the-late-show-20250718-p5mfxp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stephen Colbert delivers devastating update on future of The Late Show",
        "publish_date": "Fri, 18 Jul 2025 11:52:36 +1000",
        "category": "finance",
        "authors": [],
        "text": "Los Angeles: The Late Show with Stephen Colbert, the most-watched late-night program on US broadcast television and a frequent platform of satire aimed at President Donald Trump, will end its 10-year run on CBS in May 2026, the network said on Thursday.\n\nThe show will be retired and Colbert will not be replaced. New episodes will air until the end of the broadcast TV season in May 2026, a network statement said.\n\nThe Late Show with Stephen Colbert has been cancelled. Credit: CBS via Getty Images\n\n“This is purely a financial decision against a challenging backdrop in late night. It is not related in any way to the show’s performance, content or other matters happening at Paramount,” the executives said in a statement.\n\nCBS parent company Paramount is seeking approval from the US Federal Communications Commission for an $US8.4 billion ($12.5 billion) merger with Skydance Media. This month, Paramount agreed to settle a lawsuit filed by Trump over an interview with former vice president Kamala Harris, his Democratic challenger in the 2024 presidential race, that CBS’s 60 Minutes broadcast in October.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-albanese-returns-after-week-long-china-visit-trump-diagnosed-with-medical-condition-20250718-p5mfva.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese returns after week-long China visit; Trump diagnosed with medical condition",
        "publish_date": "Fri, 18 Jul 2025 11:51:53 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "A law firm has lodged a complaint with Australia’s information commissioner on behalf of Qantas customers whose data was exposed in a June 30 data breach.\n\nMaurice Blackburn lodged the complaint with the Office of the Australian Information Commissioner over the data on 5.7 million customers, a potential first step in a class action suit.\n\nQantas sought an injunction to minimise the impact of the data breach. Credit: Wolter Peeters\n\nThe complaint with the commissioner claims Qantas didn’t take reasonable steps to protect the customers’ personal information.\n\n“We think it’s important that privacy breaches are compensated because there are very real consequences for everyday Australians who have to deal with the fallout, whether its scam callers, risks of identity theft or other criminal activity,” said Maurice Blackburn principal lawyer Elizabeth O’Shea.\n\nThe airline on July 9 confirmed that 5.7 million customers had their information accessed, including name, phone numbers, business phone number, addresses and even the food preferences of thousands of travellers.\n\nQantas later confirmed the “majority” of a subset of 2.8 million customer records had names, email addresses and frequent flyer information, including the level of Qantas membership of the affected customer.\n\nLoading\n\nThe breached data, which Qantas says to the best of its knowledge has not been leaked, can nonetheless be used by scammers as a list of future victims. For example, the information on membership tiers included whether the frequent flyer is a member of the Chairman’s Lounge.\n\nOn Thursday, in a legal move designed to minimise the impact of the data breach, Qantas got an interim injunction in the NSW Supreme Court to “prevent the stolen data from being accessed, viewed, released, used, transmitted or published by anyone, including by any third parties”.\n\nThe move blocks anyone from publishing or sharing the details of the customers, who were affected by the theft of millions of customer records.\n\nCompanies and organisations like law firm HWL Ebsworth, Ticketek, and Western Sydney University that have been hacked have turned to seeking injunctions as a way to prevent the dissemination of the hacked data through social media and media reporting.\n\nO’Shea said: “If I was a member of the Chairman’s Lounge, I might be relieved that the court order might prevent journalists reporting on that if the information gets out, but I am not. So it’s little solace to most of us.”\n\nClayton Utz partner James Neil has written injunction orders can be obtained against “persons unknown”, including overseas hackers.\n\n“By notifying potential publishers of their obligations under the court’s orders, affected businesses demonstrate a proactive effort to mitigate further harm from being caused by the cyberattack,” Neil wrote.\n\n“This proactive approach is particularly relevant where a business has obligations to maintain the integrity of the stolen data and use their best endeavours to prevent sensitive information from being disseminated.”\n\nClayton Utz is not involved in the legal action against Qantas over the hacked data.\n\nMaurice Blackburn encourages Qantas customers who were affected by the breach to register with the law firm, which is free and non-binding.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/to-defend-our-democracy-pm-must-disavow-and-abandon-segal-report-20250717-p5mfpd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "To defend our democracy, PM must disavow and abandon Segal report",
        "publish_date": "Fri, 18 Jul 2025 11:41:06 +1000",
        "category": "finance",
        "authors": [
            "Richard Flanagan"
        ],
        "text": "The eminent Jewish historian, the late Tony Judt, put it this way in the leading Israeli newspaper Haaretz in 2006: “When Israel breaks international law in the occupied territories, when Israel publicly humiliates the subject populations whose land it has seized – but then responds to its critics with loud cries of ‘antisemitism’ – it is in effect saying that these acts are not Israeli acts, they are Jewish acts: The occupation is not an Israeli occupation, it is a Jewish occupation, and if you don’t like these things it is because you don’t like Jews. The Russian-American journalist M. Gassen at the Festival of Dangerous Ideas in Sydney last year. Would they be welcome if Jillian Segal’s recommendations were adopted? Credit: Dion Georgopoulos “In many parts of the world this is in danger of becoming a self-fulfilling assertion: Israel’s reckless behaviour and insistent identification of all criticism with antisemitism is now the leading source of anti-Jewish sentiment in Western Europe and much of Asia.” Anyone repeating Judt’s words would risk no longer being able to speak in mainstream Australia because they would have been branded as antisemitic. Similarly, a university or writers’ festival or public broadcaster could lose its funding for hosting Ehud Olmert, Israel’s former prime minister, who last week compared plans for a “humanitarian city” to be built in Rafah to “a concentration camp”, making him yet another antisemite according to the Segal report. Pointedly, Olmert said, “Attitudes inside Israel might start to shift only when Israelis started to feel the burden of international pressure.” In other words, leading Israelis are saying criticism of Israel can be helpful, rather than antisemitic. Yet, even by me doing no more than quoting word-for-word arguments made by globally distinguished Jews, could it be that I meet the Segal report’s criteria for antisemitism? Would I be blacklisted for repeating what can be said in Israel about Israel but cannot be said in Australia?\n\nAt the same time, in an Australia where protest is being increasingly criminalised, the Segal report creates an attractive template that could be broadened to silence dissenting voices that question the state’s policies on other matters such as immigration, climate and environment. Loading That the ABC and SBS could be censored on the basis of “monitoring” by Jillian Segal, a power she recommends she be given as the Special Envoy to Combat Antisemitism, raises the unedifying vision of our public broadcasters being policed from the Segal family lounge room. No matter how much Segal seeks to now distance herself from her husband’s political choices, that his family trust is a leading donor to Advance – a far-right lobby group which advocates anti-Palestinian, anti-immigrant positions, publishes racist cartoons and promotes the lie that climate change is a hoax – doesn’t help engender in the Australian public a sense of political innocence about her report. It is hard to see how this helps a Jewish community that feels threatened, attacked and misunderstood. Could it be that the Segal report’s only contribution to the necessary battle against antisemitism will be to fuel the growth of the antisemitism it is meant to combat?\n\nIf the ironies are endless, the dangers are profound. Loading It is not simply that these things are absurd, it is that they are a threat to us as a democratic people. That the prime minister has unwisely put himself in a position where he now must disavow something he previously seemed to support is unfortunate. But disavow and abandon it he must. Antisemitism is real and, as is all racism, despicable. The federal government is right to do all it can within existing laws to act against the perpetrators of recent antisemitic outrages. Earlier this month, the Federal Court found Wissam Haddad guilty of breaching the Racial Discrimination Act with online posts that were “fundamentally racist and antisemitic” but ruled that criticism of Israel, Zionism and the Israel Defence Forces was not antisemitic. It is wrong to go beyond our laws in new ways that would damage Australian democracy and seem to only serve the interests of another nation that finds its actions the subject of global opprobrium. The example of the USA shows where forgetting what is at stake leads. Just because the most powerful in our country have endorsed this report does not mean we should agree with it. Just because it stifles criticism of another country does not make Australia better nor Jews safer. Nor, if we follow the logic of Ehud Olmert, does it even help Israel.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/this-is-chess-it-ain-t-checkers-inside-the-nrl-s-season-defining-tactical-calls-20250716-p5mfbg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This is chess, it ain’t checkers. Inside the NRL’s season-defining tactical calls",
        "publish_date": "Fri, 18 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Billie Eder"
        ],
        "text": "For the first 39 minutes of the experiment, against the Tigers in round 17, it looked like it shouldn’t last another second. The Sea Eagles couldn’t get the ball wide to Trbojevic at right centre. Hopoate could only drop it when the Tigers bombed Manly’s new No.1. And then, seemingly out of nowhere, Trbojevic reprised the roaming centre role that, on the all-too rare occasions he has played for NSW, has made him the most dangerous man in sky-blue. Increasingly throughout Manly’s recent wins over the struggling Tigers and Rabbitohs, Trbojevic has slotted in as a left-edge ball-player just as he does when playing fullback. Left-edge back-rower and brother Ben rightly points out that “Tom’s done that in the Origin arena many times”. Five-eighth Luke Brooks echoes feedback from NSW camp whenever Trbojevic has popped up wherever he wants.\n\nThe play is rarely practiced, Trbojevic instead left to his own devices and instincts “because he’s got such good game awareness, he just naturally does that. I feel like he just knows the right time to come.” Not only does Trbojevic’s roaming keep one of the game’s most devastating ball-runners - when his body lets him - in the game, but it balances up a Manly attack that has been exceptionally right-side centric. Understandably, Haumole Olakau’atu’s threat outside Daly Cherry-Evans on the right edge has played a significant part in 35 tries (second in the NRL) being generated on the injured back-rower’s side.\n\nThe issue when Manly’s attack has stagnated this season has been listless shifting from side-to-side trying to use arguably the quickest backline in the competition. Especially if Jake Trbojevic is reduced to a non-running link man, where defences do not anticipate him taking on the line, and he doesn’t, so they just slide and comfortably shut down the play. Manly’s go-forward has been hampered by injuries to Olakau’atu, Taniela Paskea and Nathan Brown, and upcoming top-eight clashes against the Storm, Bulldogs, Roosters and Raiders will put that firmly under the microscope. So too Hopoate’s hands under the high ball - a month-long aerial assault from Jahrome Hughes, Matt Burton, Sam Walker and Jamal Fogarty looms if Tom Trbojevic stays at centre.\n\nBut if he is still swinging from edge to edge as a second fullback, the defence at least has food for thought, particularly if Brooks and Cherry-Evans make good on a conscious effort to play both sides of the ruck as playmakers. “That’s something we’ve really wanted to bring to our game,” Brooks says. “Getting our hands on the ball a bit more and sort of linking up together because we feel like when we’re linking up we’re connected, and we’re playing our best footy.” Galvinised: The glaring issue still confronting Canterbury\n\nWith similar on-field context to Manly, and a significantly brighter spotlight because it’s the Bulldogs, Lachlan Galvin, Phil Gould and all that entails, Ciraldo has bitten the bullet on his star mid-season signing. Toby Sexton is playing the unfortunate role of Bambi’s mother, shot down to NSW Cup with Canterbury still at the pointy end of the ladder as their attack begins to really stall. Much has been made of Sexton’s own individual statistics - not a single try-assist in the past seven weeks, not one line-break all season. With a wider lens though, Canterbury’s attack in the past month - albeit coloured by a brutal finals-worthy 8-6 loss to Penrith - has been statistically, the worst in the NRL. It hasn’t been for lack of trying. The Bulldogs short passing, fast-moving attack went into overdrive trying to crack the Panthers with 297 passes and 17 offloads, bumping up their recent averages for both facets of the game.\n\nThe clunkiness has been plain to see though and has translated to the scoreboard because such a playing style with so many ballplayers can easily be thrown out of sync. “The last little period we’ve been working really hard on our attack,” Ciraldo said on SEN radio this week. “We’ve been trying to evolve our attack gearing towards the back end of the year, understanding what’s going to beat those top teams who have really good defensive systems. And we just felt like we weren’t sort of getting there.” For Galvin’s spark to surpass Sexton’s steady hand, less will be more from the 19-year-old.\n\nGalvin’s strength is his running game and a right-foot step that straightens the attack on the right edge, but can see him drifting and cramping his outside men on the left. With Jacob Preston and Stephen Crichton making for a potent right-edge, Galvin doesn’t need to force his hand as was the case against Brisbane two weeks ago. Points will come. But the same question mark over Sexton, Matt Burton and Canterbury’s mobile pack remains.\n\nThe Bulldogs were caught out at the end of last year by North Queensland and Manly’s big forward packs, and when the whips were cracking against the Sea Eagles in a sudden death semi, a lack of game management. Sexton and Burton couldn’t guide the Bulldogs home that day, and expecting Galvin to take on the highest-pressure role in rugby league is fraught too. The finals are two months away, but Saturday’s clash against the Dragons will be the first time he’s worn the No.7 jumper in his career. Galvin’s short kicking game has shown promise, but we’ve barely seen a long kicking game from him. Burton’s booming boot is a fine long-range option.\n\nLoading Yet without a fallback, Nathan Cleary pinched a critical charge down try last month because he knew the Bulldogs No.6 was the only man for a clearing kick. How Ciraldo manoeuvres Galvin’s development alongside Burton, as well as the duel playmaking roles of Reed Mahoney and Bailey Hayward, all while trying to add big-game polish to Canterbury’s campaign will be fascinating. Because after all, this ain’t checkers. NRL is Live and Free on Channel 9 & 9Now",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/sam-konstas-was-a-boxing-day-hero-today-he-can-barely-make-a-run-where-to-now-for-cricket-s-golden-boy-20250717-p5mftn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sam Konstas was a Boxing Day hero, today he can barely make a run. Where to now for cricket’s golden boy?",
        "publish_date": "Fri, 18 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "“I think everything’s up in the air at the moment,” former Australian Test captain Mark Taylor, who presented Konstas his baggy green on Boxing Day last year, told this masthead. “That’s for Sam and Usman [Khawaja] because they both haven’t set the world on fire.” The numbers are jarring for a player nicknamed “Pinter” — a pint-sized Punter (Ricky Ponting) — by some in NSW cricket circles. Scores of 60, 8, 23, 22, 3, 5, 25, 0, 17 and 0 leave Konstas with a Test average of 16.3 — the lowest ever by an Australian opener from as many innings. “You can see the effects of Test cricket affected him mentally,” said former NSW and Australian wicketkeeper Brad Haddin. “Test cricket’s a tough place. Mentally, if things aren’t going your way, there’s nowhere to hide. His confidence would have taken a big hit.”\n\nHow did it get to this point? Where to from here? “We’ve got to be really, really careful,” said a former Australian cricketer, speaking on the condition of anonymity. “He’s such a young kid. I feel sorry for him.” A rapid rise and even sharper fall A little over 13 weeks before Konstas walked out to bat on Test debut at the Melbourne Cricket Ground against the best fast bowler on the planet, India’s Jasprit Bumrah, he was bowled by a 15-year-old fourth grader in a Sydney Premier Cricket match. Konstas, playing for Sutherland’s under-21s Poidevin-Gray team, had already blasted what ended up being a match-winning hundred, yet was dismissed by a young Northern Districts bowler by the name of Rubeindranath Gobinath.\n\nThe anecdote isn’t to crticise Konstas, but to highlight how quickly his star rose. Some believe that hundred, albeit against teenagers, kick-started his season. No one could have predicted he’d be playing for Australia by December. Professional sport is full of sliding door moments and Konstas had several late last year. Konstas was selected to bat at No.6 in a NSW trial match early last season. He then made 25 and 8 in a second XI game for NSW. Only when Steve Smith didn’t return for NSW - Konstas thought Australia’s No.4 was going to be playing the match - did the teenager get a start at the top of the order in the Sheffield Shield.\n\nHe responded with twin hundreds at Cricket Central in Sydney and became the name on everyone’s lips. Sam Konstas at the SCG. Credit: Kate Geraghty Even then, had any number of more experienced found form - Cameron Bancroft, Marcus Harris or Matt Renshaw - Konstas probably wouldn’t have debuted at the MCG. An audacious century at Manuka Oval in a Prime Minister’s XI game against the touring Indians only added to the intrigue and hype. If Nathan McSweeney had made one reasonable score against India, Konstas wouldn’t have played in Melbourne. He was brought in as a “disruptor”, in the words of head coach Andrew McDonald. Had one of Bumrah’s seaming deliveries caught his edge on Boxing Day, his debut 60 would not have happened.\n\n“It was not as if he made huge scores,” Taylor said. “It was the fact he made the papers for a different reason. It gave him a spotlight he probably didn’t need. Sam Konstas ahead of his debut innings on Boxing Day. Credit: Getty Images “Normally, you try and make your way in quietly and then assert your authority once you become a bit more of a senior player. That didn’t happen to Sam. It’s a lot to handle. I think he’s now trying to, quite rightfully, backpedal a bit and settle into the side.” Haddin believes the uniqueness of the debut shaped perceptions. “I think that might have played a role in the hype around what everyone expected in Test cricket,” Haddin said. “I don’t think we’ll ever see a debut quite like that. What comes with that was a lot of outside pressure and expectations.”\n\nIn October, Konstas became the third-youngest player to make centuries in both innings of a Shield game, behind Ponting and Archie Jackson. Then, his first-class average was 50.25. After another 28 first-class innings, it’s now 30.34. “I think he’s still probably trying to work out exactly the right way to play,” Taylor said. “He hasn’t been helped [in the West Indies] by not being given a decent pitch to play a normal, orthodox innings.” Much has been made of conditions in the Caribbean. Australia anticipated dry wickets and the chance to play two spinners. Instead, all three surfaces — in Barbados, Grenada and Kingston — offered exaggerated seam movement.\n\n“That cricket was borderline impossible to play at some stages,” Australian head coach Andrew McDonald said this week on SEN. According to data seen by the Australian team, the average seam movement in the third Test was 0.84 degrees, which is extreme. Of the 670 Test matches where data has been kept on ball movement, Australia’s latest rout of the West Indies was the 15th most for seam in history. Sam Konstas is out for duck in the second innings in Kingston. Credit: X Konstas’ strike rate for the series was 33.11 and he was caught between batting styles. “If you look at the contrasting techniques of the way the openers went about it, some tried to nut it out, work hard and battle through. You end up making 20 off 100 balls and still nick one anyway,” Taylor said. “I think Sam wasn’t sure whether to try that method or try, dare I say it, the Boxing Day method and some different shots.”\n\nThere have been other changes. Since becoming a household name, Konstas has increased his social media presence. “I don’t want to get distracted,” Konstas told cricket.com.au in February last year at the under-19 Cricket World Cup. “I don’t really need it – I just try to live in the moment and not be glued to my phone.” Konstas now updates his Instagram regularly with brand endorsements and behind-the-scenes glimpses to his 286,000 followers. It would be difficult to not soak up the adulation and added attention. A shirtless walk down a Barbados beach sampling local fish burgers before the first Test went viral. According to those close to Konstas, he is still in good spirits and eager for a reset before the Sheffield Shield season. His demeanour on tour certainly did not change as the runs dried up. He worked hard in the nets, desperate to turn his fortunes around.\n\nIt just didn’t translate to the middle. Loading “I think you can see at the end of the tour, it was all mental,” Haddin said. “He’s never been exposed to any pressure like this before. He wouldn’t have gone on a run like this in any of his cricket, like in junior cricket, without being able to dominate an attack. “What we’ve got to remember is the kid’s 19. He’s only had half a season of first-class cricket. This would have been a huge learning curve for him … which is a good thing. The learnings he’ll take will be enormous.” What about the Ashes? Konstas received a strong endorsement from Ricky Ponting this week, who said he wouldn’t change Australia’s top three.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/how-oasis-ruined-the-socceroos-plans-for-a-20-year-anniversary-clash-with-uruguay-20250716-p5mfab.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Oasis ruined the Socceroos’ plans for a 20-year anniversary clash with Uruguay",
        "publish_date": "Fri, 18 Jul 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Jackson Irvine and Tony Popovic. Credit: AP Welcome to the complicated world of booking friendlies. It’s not as simple as picking up the phone and asking a rival national team if they’re up for a game. As Football Australia plots the Socceroos’ road to the 2026 World Cup, they must juggle a mix of competing interests - commercial, political, technical and logistical - while navigating domestic hurdles like venue availability and government backing, plus the shifting international landscape, where potential opponents are suddenly ruled in or out, depending on their own qualification campaigns or asking prices. Then there’s the pursuit of FIFA ranking points, which could determine whether Australia ends up with a favourable draw or a group of death, and thus presents another dilemma: is it better to face ‘easier’ nations and chase wins, or go for tougher assignments you might lose, but learn more from? ‘We want to experience as much as possible’\n\nThese are good problems to have. Direct World Cup qualification has plenty of advantages, like enabling Football Australia to get “ahead of the game”, as Popovic put it, with reconnaissance on possible hotels and training venues for the tournament; the federation is sending staff to the three co-host nations, the United States, Canada and Mexico, in the coming weeks. In avoiding the play-offs, it also meant they had five free international windows to fill up: September, October and November 2025, and March and June 2026. It’s a situation Australia hasn’t faced since the last time they qualified directly, back in 2013 under Holger Osieck. Preliminary talks with other national associations about potential friendlies tend to begin many months in advance, but games can only be booked once there is certainty about their qualification or otherwise. Popovic’s ask is simple: “To try and cover as many different styles and confederations as possible,” he said this week.\n\n“If we can cover, hopefully, an African team, South American team, European team … that will help in terms of preparation and just having the different styles that you come up against. Is it a pressing team, is it a team that sits back? Do they build up, don’t build up - so you get a little bit of an understanding of the different countries and how they like to play. We want to experience as much as possible. “That’s what we’re trying to do. Then there’s the other side of trying to get a Uruguay - can they come, how much do they cost? There are many things that come into that; it’s not just about plucking someone out, come to Australia to play us. The opportunity to face Lionel Messi and Argentina won’t come cheap. Credit: Getty Images “I’m sure the FA is doing everything they can to support us to bring, if it’s here, good opposition … [but] it changes daily. One moment you think you’ve got someone, and they’ve got another idea and other plans.” Football Australia moved quickly to lock in a two-match home-and-away series in September against New Zealand, who have also qualified through Oceania, for the Soccer Ashes trophy that was re-discovered two years ago. This week, a friendly against the United States on October 14 in Colorado was confirmed, to go with an earlier announcement of a showdown with fellow co-hosts Canada in Montreal four days earlier - both valuable opportunities to experience World Cup conditions and facilities.\n\nFootball Australia wants to play two games at home in the November window, but finding an opponent is proving tricky. UEFA qualification goes through until the end of that month, which rules out a European team - and the prospect dream of a clash with the likes of Italy, or England, on Aussie soil. It leaves two realistic options: South America or Africa. SOCCEROOS’ ROAD TO THE 2026 WORLD CUP September 2025 Australia vs New Zealand - GIO Stadium, Canberra, September 5\n\nNew Zealand vs Australia - Go Media Stadium, Auckland, September 10 October 2025 Canada vs Australia - Saputo Stadium, Montreal, Canada, October 10\n\nUnited States vs Australia - Dick’s Sporting Goods Park, Colorado, United States, October 14 November 2025 Two games in Australia against South American or African opposition - TBC March 2026 Two games in Europe against European opposition - TBC June 2026 Farewell match in Australia - TBC\n\nWarm-up friendlies before the World Cup - TBC The issue is that the best nations are very reluctant to travel so far. A big, fat cheque could persuade them, but even with government support and the right venue, that sort of money is beyond FA’s current reach. Argentina, according to reports, charge around $7.5 million per match - so a two-game series in Australia would cost $15 million, plus on-the-ground expenses. Brazil, sources say, have asked for a similar fee. Other countries might want less, but would be less commercially appealing, and would still rather not come out all this way.\n\nAnd the trouble with Africa is that the first round of their World Cup qualification campaign ends in October, which leaves a very short runway for matches to be organised involving any of the nine teams that make it through. The likely outcome for November, according to sources, is a clash with a lower-ranked South American team or one of the African qualifiers, with talks ongoing for one of the two games to take place at Sydney’s CommBank Stadium. Why ranking points matter so much What happens after that will be dictated to some extent by what happens in December, when the World Cup draw is conducted, and groups are created from the 48 teams split across four pots. The profile of the teams in Australia’s group could dictate the kind of opponents Popovic would want in the March window - which will probably take place in Europe - and then in June, when there are tentative plans for a farewell game on home soil before the Socceroos relocate to North America ahead of the World Cup, which kicks off on June 11. But the other element that will factor into things is Australia’s FIFA ranking. Currently No.24 in the world, having moved up two places after the June window, the Socceroos sit on the edge of pots two and three. To give themselves the best statistical chance of a softer group, they will most likely need to be inside the top 23 to finish in pot two and thus avoid playing against one of the other teams in it - the likes of Croatia, Morocco and Colombia, as things stand.\n\nTo do that, they need to win as many matches as they can before the draw. However, the nature of the draw mechanics - this being the first World Cup with 48 teams - means that no matter what they do, there could still be dangerous floaters, such as Italy, Greece and Serbia, in pot four. Former Socceroos boss Graham Arnold was highly strategic when it came to ranking points, but Popovic seems to be taking a more relaxed approach, and said he was not thinking about those permutations, though FA staff certainly are on his behalf. Popovic has his own balancing act to deal with. Most fans would like to see him experiment over the next 12 months, and try players who haven’t featured much or at all for the Socceroos in his short reign to date - like Watford-bound Nestory Irankunda, or departed A-League stars Adrian Segecic, Noah Botic and Nicolas Milanovic, who have landed at Portsmouth, Austria Wien and Aberdeen respectively this off-season.\n\nLoading He is open to change, suggesting he feels no sense of obligation towards those who have helped them qualify in terms of them making his final squad for the World Cup. But Popovic doesn’t want to simply hand out caps. “When we say trying players for the national team, they still must earn their call,” he said. “It’s not about, okay, I heard some guy scored two goals and yeah, great, we’ll just give them a call to the national team. It doesn’t go like that.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/right-call-johns-backs-parramattas-brown-axing-20250718-p5mfyd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Right call': Johns backs Parramatta's Brown axing",
        "publish_date": "Fri, 18 Jul 2025 11:19:20 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Right call': Johns backs Parramatta's Brown axing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/stephen-colbert-announces-shock-ending-to-the-late-show-20250718-p5mfys.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stephen Colbert announces shock ending to The Late Show",
        "publish_date": "Fri, 18 Jul 2025 11:18:41 +1000",
        "category": "finance",
        "authors": [],
        "text": "Stephen Colbert announces shock ending to The Late Show\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-christian-of-denmark-steps-up-as-regent-amid-parents-holiday-20250718-p5mfyl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Christian of Denmark steps up as regent amid parents' holiday",
        "publish_date": "Fri, 18 Jul 2025 11:13:28 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Christian of Denmark steps up as regent amid parents' holiday\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/jim-chalmers-says-unemployment-expected-to-rise-further/5sevovz9z",
        "title": "Unemployment to rise further, Chalmers says, as Trump 'volatility' weighs on employers",
        "publish_date": "Fri, 18 Jul 2025 00:56:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Treasurer Jim Chalmers expects unemployment to rise further, arguing the uptick is \"unsurprising\" amid global uncertainty.\n\n\n\n\n\nAustralia's unemployment rate rose to 4.3 per cent in June, according to the latest data by the Australian Bureau of Statistics released on Thursday.\n\n\n\n\n\nSpeaking against the backdrop of economic slowdowns and trade tensions as he attends a G20 meeting of finance ministers and central bank governors in South Africa, Chalmers urged Australians to keep perspective.\n\n\n\n\n\n\"Unemployment has been really quite outstandingly low for some time now — 4.3 (per cent) in historical terms would be seen as quite a good outcome,\" he told ABC radio on Friday.\n\n\n\n\n\n\"When it comes to this tick up in unemployment, it is modest, it is unwelcome, but it's also unsurprising.\"\n\n\n\nREAD MORE Jobless rate rises to highest level since 2021 as number of unemployed Australians jumps\n\nHe said cost-of-living pressures, coupled with high interest rates, had resulted in a small lift, but overall, the economy \"kept ticking over,\" unlike other countries.\n\n\n\n\n\nAsked whether Treasury anticipated unemployment would rise as high as 5 per cent, he said not quite.\n\n\n\n\n\n\"We're not expecting unemployment to go that high. We think somewhere around the middle floors in our current forecast, but obviously there's a lot of uncertainty in that,\" Chalmers said.\n\n\n\n\n\nHowever, signs of a tougher jobs market could help set the scene for lower interest rates in the months ahead.\n\n\n\n\n\nEx-Reserve Bank of Australia economist Luke Hartigan said the June outcome met the central bank's year-end unemployment forecast.\n\n\n\n\"This just adds information to say that some modest reduction in interest rates is warranted,\" the University of Sydney economics lecturer told the Australian Associated Press.\n\n\n\n\n\nAfter its July meeting, the RBA disappointed mortgage-holders and shocked market economists by opting to hold the cash rate at 3.85 per cent in a split decision.\n\n\n\nTrump tariffs weighing on employers' minds globally\n\nThe unpredictable nature of US President Donald Trump's tariffs , which have changed regularly, has contributed to global uncertainty and is weighing on employers, Chalmers said.\n\n\n\n\n\nAsked if he believed the policy uncertainty was affecting decisions on whether to hire workers, Chalmers said: \"That's certainly the feedback that we get around the place, speaking with CEOs and meeting with company boards.\n\n\n\n\n\n\"There is a real sense that this volatility and unpredictability and uncertainty is really a defining and an ongoing feature of the global economy.\"\n\n\n\n\n\nOver the weekend, Trump announced a 30 per cent tariff on major trading partners Mexico and the European Union, set to kick in on 1 August.\n\n\n\n\n\nChalmers said the \"new normal\" requires a \"shift\" in thinking, with \"more collaboration, more secure supply chains and more reliable markets\" the best pathway forward.\n\n\n\n\n\nWith additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-babies-born-free-of-devastating-genetic-diseases-using-dna-from-three-people/3rl2rnu7k",
        "title": "New babies born free of devastating genetic diseases using DNA from three people",
        "publish_date": "Thu, 17 Jul 2025 21:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"Lily was my third daughter. She was born five weeks early, small, but otherwise healthy. Around about seven weeks old, she started to have these absent seizures where she would stop breathing and just sort of stare into space. And then we had the situation where she had two cardiac arrests. And she was rushed into intensive care and put on a life support machine.\"\n\n\n\n\n\nMeet Liz Curtis.\n\n\n\n\n\nShe's reflecting on her daughter Lily, who was born with a rare genetic condition.\n\n\n\n\n\nDoctors struggled to find answers, and further tests eventually confirmed a life-limiting condition with no treatment: mitochondrial disease.\n\n\n\n\n\nRobin Lovell-Badge is the Head of Stem Cell Biology and Developmental Genetics at The Francis Crick Institute.\n\n\n\n\n\n\"Mitochondria are these little energy-producing factories, if you like, which all our cells contain. They have their own DNA, and if that DNA carries a mutation, or is a pathogenic variant, it can cause a whole range of different types of disease according to specific mutation, but these are all a nasty set of diseases where children can suffer a lot and die. It's particularly important for energy-demanding tissues like brain and muscle.\"\n\n\n\n\n\nLily's family ultimately brought her home after the doctors told them there was nothing more they could do.\n\n\n\n\n\nAnd for six precious months, she defied expectations.\n\n\n\n\n\n\"And I guess it was during those six months that we really started to understand what mitochondrial disease was, what the implications of it were.\"\n\n\n\n\n\nOver the ocean from the UK lives Ash Greenhalgh, a 28 year old woman from Brisbane who has Leber Hereditary Optic Neuropathy disease, which affects her vision.\n\n\n\n\n\nHer younger brother also has it, as does her mother.\n\n\n\n\n\n\"Leading on from my vision loss when I was a child and kind of growing into my teenage years... it was an illness and a disorder with my eyes that was not visible to the people around me. It was internal, which made it very difficult for people to support me and understand. A lot of the times I would hear things like 'won't glasses fix that', which is not the way it works with LHON.\"\n\n\n\n\n\nAsh says she was overcome upon hearing that scientists at Britain's Newcastle University and Australia's Monash University have pioneered a treatment aimed at preventing such genetic diseases in children.\n\n\n\n\n\n\"I cried. I cried. Obviously it's not something that's happening any time soon, but it means the world... I have a lot of gratitude for Monash, I have a lot of gratitude for the researchers who have put in so many countless hours into the research into doing what was the right thing, and helping the community. Because it is genuinely going to make a lot of difference for a lot of people.\"\n\n\n\n\n\nThe idea behind the technique is to produce children who are born free of devastating genetic diseases, including mitochondrial disease, which is passed down through the mother's line.\n\n\n\n\n\nRobin Lovell-Badge says the method uses DNA from three people - the mother's egg, the father's sperm, and a donor's mitochondria - transferring pieces from inside the mother's fertilised egg into a healthy egg provided by the anonymous donor.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-12-tadej-pogacar-retakes-lead-in-crushing-mountain-win/pwaa4xl6k",
        "title": "Tour de France stage 12: Tadej Pogačar retakes lead in crushing mountain win",
        "publish_date": "Thu, 17 Jul 2025 20:16:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tadej Pogačar said he was in the form of his life after climbing to a commanding Tour de France stage win on the Hautacam mountain in the Pyrenees.\n\n\n\n\n\nThe three-time Tour winner punished his key rival Jonas Vingegaard on stage 12 as he left him trying to limit the damage on the first major mountain on the 21-day race.\n\n\n\n\n\nTeam UAE leader Pogačar skipped away on an 11km solo ascent to finish two minutes and 10 seconds ahead of Vingegaard, who refrained from trying to follow the blistering attack.\n\n\n\n\n\nOvernight leader Ben Healy of Ireland wilted to a 13-minute deficit on the day.\n\n\n\n\n\nFrench President Emmanuel Macron was on hand at the mountaintop finish, shaking his head in admiration as the 26-year-old shot across the line.\n\n\n\nOlympic champion Remco Evenepoel was also left trying to limit his losses, finishing 3 minutes 35 seconds down in seventh on the 180.6km ride from Auch.\n\n\n\n\n\nIn the overall standings, Pogačar now leads by 3 minutes 31 seconds over Visma rider Vingegaard, while Evenepoel is third at a daunting 4 minutes 45 seconds.\n\n\n\n'Like a fairytale'\n\nPogačar admitted after the race that he had been cranky, complaining about the attacks, the heat, and tiredness.\n\n\n\n\n\nBut he offered a different story in the Pyrenees.\n\n\n\n\n\n\"I could see that Visma weren't feeling so well,\" he said.\n\n\n\n\n\n\"On the last climb it was really hot but I was really feeling good,\" he said, explaining how he shattered the 12-man group still clinging on at the foot of the final climb.\n\n\n\nSlovenia's Tadej Pogačar has taken the yellow jersey after the 12th stage of the Tour de France cycling race. Source: AAP / Mosa'ab Elshamy/AP Pogačar also offered a broader explanation.\n\n\n\n\n\n\"This is the best moment of my career. It's been like a fairytale,\" he said of the stage win on a mountain where he had previously been beaten.\n\n\n\n\n\n\"I enjoy this sufferfest,\" he said of the long climb days. \"I'm at the peak of my career. Once this fire goes out, my performance will drop.\"\n\n\n\n\n\nPogačar admitted at the finish line his team had been secretly targeting this stage for some time.\n\n\n\n\"The plan was to win this stage,\" he said. \"I'm super happy to take time and win on this particular climb,\" said Pogačar, who fell heavily on stage 11.\n\n\n\n\n\n\"You don't know how your body reacts after a crash. It wasn't so bad. The team did a super job.\"\n\n\n\nTough day for the Irishman\n\nThe champion had kind words for Irishman Healy, who had a bruising day himself.\n\n\n\n\n\n\"Healy tried, he showed big spirit. It was hard for everybody today,\" Pogačar said.\n\n\n\n\n\nHe also dedicated this win to Italian junior cyclist Samuele Privitera, who died aged 19 following a fall at this week's Tour of the Aoste Valley-Mont Blanc.\n\n\n\n\n\n\"I was thinking of him in the final kilometre. This sport can be so hard. It's so sad,\" Pogačar said.\n\n\n\n\n\nFriday's stage 13 could shake up the standings again as it is an unforgiving individual time trial, mainly uphill, that the Slovenian has been looking forward to.\n\n\n\n\n\n\"The race isn't over, just look at the next few stages and then there's next week too,\" he said.\n\n\n\nThe 12th stage of the Tour de France is a 180.6km ride from Auch to Hautacam. Source: AAP / Martin Divisek / EPA Pogačar also took over the polka dot king of the mountain jersey, while Jonathan Milan has the green sprint jersey, and Evenepoel secured the white jersey as the best young rider.\n\n\n\n\n\nHealy described his time in yellow as a \"whirlwind\" after dropping to 11th, over 13 minutes off the pace.\n\n\n\n\n\nThere were three mountains on the menu on Thursday as the peloton entered the Pyrenees. The pack was whittled down before Pogačar's astonishing attack on the fabled Hautacam, a 13.6km ascent at 7.8 per cent incline.\n\n\n\n\n\nOn Friday, a 10.9km race up the Peyragudes mountain rescue airfield, with slopes of up to 16 per cent, awaits some potentially tired legs, as the temperature is set to hit around 33C.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/concerns-over-ubers-new-flexible-payment-move/3nvfs0q0c",
        "title": "'Worrying': Concern as Uber makes new 'flexible' payment move in Australia",
        "publish_date": "Thu, 17 Jul 2025 19:39:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Consumer advocate lawyers are concerned about Uber's decision to integrate buy now pay later (BNPL) technology into the app, while the rideshare company says it's being innovative for customers.\n\n\n\n\n\nBNPL platform Afterpay said it's \"excited\" to pair with Uber.\n\n\n\n\n\nBut consumer advocates say allowing people to borrow money for small transactions like Uber rides could contribute to \"debt spirals\".\n\n\n\n\n\nConsumer Action Law Centre senior policy officer Rose Bruce-Smith told SBS News it's \"concerning\" that Afterpay is becoming more accessible and is being used more for everyday purchases, when it was previously reserved for discretionary items.\n\n\n\n\n\n\"We know that people are optimistic about how much they'll be able to repay in the future. Uber is something that is almost an essential, and we regularly speak to people who can't pay for essentials and get further and further into debt with these services,\" she said.\n\n\n\n\n\nAfterpay charges users fees if they miss their scheduled repayments, which are up to 25 per cent of the purchase price or $68, whichever is less.\n\n\n\nUber told SBS News it is \"constantly looking for ways to enhance the experience for everyone who uses the Uber and Uber Eats app, and this includes providing users more flexibility and control over how they pay for their rides and meals\".\n\n\n\n\n\nAccording to a survey by financial comparison site Finder, an estimated 41 per cent of Australians have used BNPL products in the past six months.\n\n\n\n\n\nNational Debt Helpline coordinator Vicki Staff told SBS News it's \"worrying\" that these services are trying to \"normalise\" their own use, which means people \"have the potential to spiral\" into compounding debts.\n\n\n\n\"We worry that a lot of people are using buy now, pay later, setting up multiple accounts, and then using it to buy lots of small discretionary type services or products,\" Staff said.\n\n\n\n\n\n\"What we often see as financial counsellors on the National Debt Helpline is all of these direct debits coming out of people's bank accounts to pay for multiple buy now pay later accounts, and people can't keep track of it. And so things start to spiral and they get out of control.\"\n\n\n\n\n\nResponding to calls to regulate the sector, the federal government last month introduced new laws that require providers to hold an Australian credit licence, comply with existing credit laws, and have also established a new category of low-cost credit under the Credit Act.\n\n\n\n\n\nAfterpay co-founder Nick Molnar said at the time he was glad the services were given \"legitimacy\" by the government and that he would want to see Afterpay used wherever a credit card is.\n\n\n\nBruce-Smith said that ambition was \"concerning\".\n\n\n\n\n\n\"There are checks and balances with a credit card, which is very different from this sort of tech-first approach to integrating your business into every payment system we have.\n\n\n\n\n\n\"I think it's pretty disappointing that Afterpay has used the instruction of legislation to use the legitimacy of that to aggressively expand into new areas in Australia.\"\n\n\n\n\n\nAn Afterpay spokesperson said in a statement that the company is committed to giving people \"flexible, transparent\" ways to manage their spending.\n\n\n\n\n\n\"This partnership with Uber — one of the most widely used apps in everyday life — reflects growing demand for safe, simple, and affordable payment alternatives,\" the spokesperson said.\n\n\n\n\n\n\"Afterpay has no fees when customers pay on time, with no risk of revolving debt spirals.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/uk-to-lower-voting-age-to-16-in-landmark-reform/4mm1x59xc",
        "title": "UK to lower voting age to 16 in landmark reform",
        "publish_date": "Thu, 17 Jul 2025 11:39:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "The United Kingdom will now give 16 and 17-year-olds the right to vote in all elections in a major overhaul of its democratic system.\n\n\n\n\n\nThe British government said the proposed changes, which are subject to parliamentary approval, would align voting rights across the UK with Scotland and Wales, where younger voters already take part in devolved elections.\n\n\n\n\n\n\"We are taking action to break down barriers to participation that will ensure more people have the opportunity to engage in UK democracy,\" Deputy Prime Minister Angela Rayner said in a statement on Thursday.\n\n\n\n\n\nThe decision comes after turnout at the 2024 general election fell to 59.7 per cent, the lowest at a general election since 2001, according to a parliamentary report.\n\n\n\n\n\nAccording to the House of Commons library, research from countries that have lowered the voting age to 16 shows it has had no impact on election outcomes, and 16-year-olds are more likely to vote than those first eligible at 18\n\n\n\nAn election promise\n\nLabour, whose popularity has fallen sharply in government after its landslide victory a year ago, had previously promised it would lower the voting age if elected.\n\n\n\n\n\nThe reforms — if granted final approval — would also expand acceptable voter ID to include UK-issued bank cards and digital formats of existing IDs, such as driving licences and Veteran Cards.\n\n\n\nTo tackle foreign interference, the government said it also planned to tighten rules on political donations, including checks on contributions from unincorporated associations and closing loopholes used by shell companies.\n\n\n\n\n\nIn an interview with ITV News, Prime Minister Keir Starmer praised the move for its inclusivity.\n\n\n\n\n\n\"I think it's really important that 16 and 17-year-olds have the vote, because they are old enough to go out to work, they are old enough to pay taxes.\n\n\n\n\n\n\"And I think if you pay in, you should have the opportunity to say what you want your money spent on, which way the government should go.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/anthony-albaneses-soft-diplomacy-with-china-questioned-by-coalition/wpfmivb7j",
        "title": "Anthony Albanese’s soft diplomacy with China questioned by Coalition",
        "publish_date": "Thu, 17 Jul 2025 09:54:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese’s soft diplomacy with China questioned by Coalition\n\nPublished 17 July 2025, 9:32 am\n\nThe Prime Minister has wrapped up a six-day visit to China. Among the final stops featured a touch of panda diplomacy. Parts of the tour have been branded 'indulgent' by the Coalition, who wanted guarantees extracted from Beijing. Our Chief Political Correspondent Anna Henderson has the details from the city of Chengdu.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/jobless-rises-to-4-3-increasing-rate-cut-chance-diversity-on-boardrooms/6gdj56asf",
        "title": "Jobless rises to 4.3% increasing rate cut chance & diversity on boardrooms",
        "publish_date": "Thu, 17 Jul 2025 07:59:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/albanese-wraps-up-six-day-china-visit/9jmuc4ijg",
        "title": "From security to panda diplomacy: PM wraps up China tour, but not without criticism",
        "publish_date": "Thu, 17 Jul 2025 07:37:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese is framing his long-awaited China tour as a diplomatic win, despite criticism from the Opposition that he has failed to achieve any \"tangible outcomes\" during the six-day visit.\n\n\n\n\n\nFollowing high-level talks with Chinese President Xi Jinping, Premier Li Qiang, and Communist Party chair Zhao Leji earlier in the week, Albanese concluded his trip with some softer diplomacy.\n\n\n\n\n\nOn Thursday, he visited giant pandas at the Chengdu panda research base in south-west China, after dropping by the Great Wall of China the day before.\n\n\n\n\n\nHe stressed that, unlike the site's inhabitants, diplomacy wasn't black-and-white, and the softer elements of his itinerary were critical to building stronger economic and diplomatic ties.\n\n\n\n\n\n\"This has been a very successful visit,\" Albanese told reporters in Chengdu.\n\n\n\nPrime Minister Anthony Albanese's fiancée, Jodie Haydon, accompanied him to the research site, which holds about 260 of the estimated 700 pandas in captivity worldwide. Source: AAP / Lukas Coch \"It was an opportunity to have constructive discussions across the range of issues, security, our relationship, including people-to-people and importantly, our trade,\" Albanese said.\n\n\n\n\n\nHe hailed the visit for reaching \"more agreement and less disagreement\".\n\n\n\n\n\n\"What we've had is constructive engagement … The fact that you have the four major Australian resource and iron ore exporters — BHP, Rio [Tinto], Fortescue and Hancock — all sitting down with their Chinese purchasers of their products, that benefits Australia enormously,\" he added.\n\n\n\nREAD MORE PM reacts to Chinese readout saying Australia opposes Taiwan's independence\n\nAlbanese praised Xi for his interest in Australia and for touring every state during previous visits, as both trade partners try to build on their understanding of one another.\n\n\n\n\n\n\"President Xi is warm and engaging. We have had four bilateral meetings, but have also engaged at other times as well on an informal basis. That's a positive thing,\" he said.\n\n\n\n\n\nAlbanese's trip to the panda sanctuary is being viewed as a sign that Australia is in China's favour.\n\n\n\n\n\nGenerally, when China is happy, countries receive pandas, such as Li Yan and Xing Qiu, who are currently on loan to the Adelaide Zoo. However, if relations sour, these can be recalled.\n\n\n\n\n\nAlbanese's final stop will be a Cochlear implant factory, which manufactures Australian hearing devices and has restored hearing in more than 50,000 patients in China.\n\n\n\n\n\nAt a luncheon earlier in the day, Albanese said there is scope for the \"inspiring\" technology to expand further, but this relies on continued free and fair trade with China.\n\n\n\nAlbanese brushes off 'indulgent' trip criticism\n\nOpposition finance spokesperson James Paterson has criticised the softer diplomacy as somewhat \"indulgent\", stating the \"tangible outcomes at this stage are very hard to identify\".\n\n\n\n\n\n\"I do wonder whether a Gough Whitlam history tour on the Great Wall of China, whether a visit to Chengdu to pose with some pandas, and whether a hit of tennis is strictly necessary as part of a six-day visit to China when there is so much else at stake in our other international relationships around the world,\" he told Sky News.\n\n\n\n\n\n\"And frankly, I have to say that some of this is starting to look a little bit indulgent.\"\n\n\n\nREAD MORE Anthony Albanese urged to avoid being 'weak', push China to release detained Australian\n\nAlbanese brushed off Paterson's critique, highlighting that a visit to three cities has broader economic and domestic benefits.\n\n\n\n\n\n\"Those pictures go to 27 million people, potentially, in Australia. They go to over a billion people in China … who are increasingly rising up the income ladder and are potential tourists and therefore job creators in Australia,\" he told reporters.\n\n\n\n\n\n\"If James Patterson doesn't understand that, then he doesn't understand much.\"\n\n\n\n\n\nOpposition leader Sussan Ley also took aim at Albanese for not raising security concerns more forcefully.\n\n\n\n\"I was disappointed that in his meeting with President Xi, he didn't get the assurances that he should about the unacceptable nature of the circumnavigation of Australia by the Chinese Communist Party's navy warships,\" Ley said.\n\n\n\n\n\nAlbanese said he raised the issue and sought assurances that Australia would be better informed about Chinese military drills in the region, noting the live-fire exercise didn't break international law, as it took place in international waters.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/from-economy-to-health-what-lower-birth-rates-could-mean-for-australias-future/t1wbdnzux",
        "title": "'Human catastrophe': What lower birth rates could mean for Australia's future",
        "publish_date": "Thu, 17 Jul 2025 06:52:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia is facing the possibility of population decline and deaths outpacing births, which could have long-term consequences for the labour force and economy.\n\n\n\n\n\nNew data analysis from financial firm KPMG has found that while the number of births in 2024 increased from the previous year, it is still below pre-pandemic levels.\n\n\n\n\n\nThis means Australia is now in the midst of an ageing population and at a \"tipping point\" in maintaining our way of living.\n\n\n\nAustralia's changing birth rates\n\nThe KPMG analysis examined birth data from the Australian Bureau of Statistics and analysed Australia's fertility rate, which is the average number of children born to a woman over her lifetime.\n\n\n\n\n\nAccording to KPMG, Australia's fertility rate now sits at 1.51 in 2024, well below the 2.1 replacement rate needed to sustain population growth.\n\n\n\nThere were 292,500 births nationally in the last year, up from 285,000 the previous year. But birth rates are well below those in previous years, with more than 300,000 births recorded each year between 2013 and 2019.\n\n\n\n\n\nThe analysis found that birth rates are declining more in metropolitan areas compared to regions, with the number of births in capital cities declining by 6.5 per cent between 2019 and 2024.\n\n\n\n\n\nKPMG urban economist Terry Rawnsley said finances and the cost of living, particularly in major cities, are key factors driving this reduction.\n\n\n\n\n\n\"Rising rents, mortgage payments and childcare costs in the metro areas are putting a handbrake on people's plans to start or grow their family,\" he said.\n\n\n\n\n\n\"Instead, regional communities are continuing to emerge as popular places to live, work and raise a family, with affordability now top of mind for many Australians.\"\n\n\n\nThe number of births in Australia has declined by 3.8 per cent between 2019 and 2024. Source: SBS News Liz Allen, demographer at the ANU Centre for Social Policy Research, said while the analysis is based on preliminary data, not official statistics, it is concerning for Australia's population.\n\n\n\n\n\nShe said Australia's fertility rate has been trending toward below-replacement levels since the 1970s, and is now getting toward \"critical territory\".\n\n\n\n\n\n\"We've essentially hit rock bottom, and trying to come back from that is going to be incredibly difficult,\" she said.\n\n\n\n\n\n\"It will be a task that requires enormous policy and political intervention.\"\n\n\n\n\n\nAllen said many young Australians may want to have children, but are either changing their plans or opting out due to the challenges of having children, due to economic or environmental concerns.\n\n\n\nAllen describes this as a \"constrained choice\".\n\n\n\n\n\n\"At the heart of all of this is a lack of hope, dwindling hope, and a deep uncertainty and fear about tomorrow,\" she said.\n\n\n\n\n\n\"There are a number of very big issues confronting Australians; housing affordability, economic insecurity, gender inequality and climate change come together and weigh quite heavily on people and are at the forefront of people's decision-making processes when considering having a child or having a subsequent child.\"\n\n\n\nWhy do birth rates matter?\n\nThe key concerns surrounding birth rates are linked to population growth and an ageing population.\n\n\n\n\n\nAllen said by the mid-2050s, the number of deaths in Australia could exceed the number of births, which could lead to population decline becoming a \"real prospect\".\n\n\n\n\n\nThis could mean fewer people in the labour force working and paying taxes in Australia, which could put pressure on healthcare systems and government services.\n\n\n\nAustralia's fertility rate has increased slightly since 2023, but remains below its 2013 level. Source: SBS News \"Currently, Australia's government funds are largely fuelled by individual income tax,\" Allen said.\n\n\n\n\n\n\"That means that if we were to see an ageing population and fewer people ageing into the workforce, our bottom line by way of the government budget will be reduced.\n\n\n\n\n\n\"We will have to do more with less government money going forward.\"\n\n\n\n\n\nAllen believes it is unlikely Australia will witness a \"bounce back\" in the average number of births per woman without \"drastic and very swift\" policy changes in areas such as housing affordability, economic security, gender equality, and climate action.\n\n\n\nBut Rawnsley said the data indicated \"cause for optimism\" that birth rates could recover further if there is growth in disposable income.\n\n\n\n\n\n\"While many Australians are still holding back due to cost-of-living pressures, those with a little more cash in the bank are now turning their attention to having a family again. The baby bounce back is absolutely on, with the birth rate set to reach 300,000 over the next year,\" he said.\n\n\n\n\n\n\"However, it will still be some time before we exceed the magic 350,000 figure needed to sustain our way of life well into the 21 st century.\"\n\n\n\nBirth rate across the world\n\nAustralia is not the only country facing the challenges of an ageing population.\n\n\n\n\n\nAccording to a 2024 report from the Organisation for Economic Co-operation and Development (OECD), the fertility rate dropped from 3.3 to 1.5 between 1960 and 2022 across all OECD countries.\n\n\n\n\n\nThe country with the lowest fertility rate at the time was South Korea, which had an average of 0.7 children per woman in 2023.\n\n\n\n\n\n\"Australia, like much of the world, is facing a human catastrophe,\" Allen said.\n\n\n\n\n\n\"The trouble is that we have kicked the can down the road so far now that we are confronted with multiple crises.\n\n\n\n\n\n\"We're now at a tipping point and we either fall into the precipice ... or we do something and we bridge a path forward [but] I'm not seeing any effort really to get us across this tipping point.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pm-calls-for-more-collaboration-in-australia-china-medical-research-evening-news-bulletin-17-july-2025/mfd2yi18q",
        "title": "PM calls for more collaboration in Australia-China medical research | Evening News Bulletin 17 July 2025",
        "publish_date": "Thu, 17 Jul 2025 06:18:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\n\n\nPrime Minister calls for more collaboration in Australia-China medical research...\n\n\n\nThree men accused of attempting to import more than $500 million worth of drugs,\n\n\n\nWallabies coach Joe Schmidt says Nick Champion de Crespigny [[deh crep-nee]] ready to make a big impression on his test debut.\n\n\n\n\n\n\n\nPrime Minister Anthony Albanese is finishing his tour of China with calls for more joint endeavours between Chinese and Australian medical technology researchers.\n\n\n\n\n\nHe has attended a Medical Technology lunch in Chengdu promoting bilateral business deals in the space, including the manufacture of Australian-owned Cochlear hearing devices in western China.\n\n\n\n\n\nHe says some of Australia and China's top minds have been working together to improve the lives of millions around the world.\n\n\n\n\n\n\"Australian and Chinese researchers, hospitals and universities are driving remarkable progress in every field of medical technology. From the development of new vaccines, to prevention and early-detection technology, to the work that Cochlear are doing with the delivery of bionic ears, people in their millions are benefitting from Australia and China working together and learning from each other.\"\n\n\n\n\n\nEmployment Minister Amanda Rishworth has attributed a surprising uptick in Australia's unemployment to global market uncertainty.\n\n\n\n\n\nThe jobless rate has risen to 4.3 per cent, surpassing market expectations that the rate would remain steady at 4.1 per cent.\n\n\n\n\n\nThe Australian Bureau of Statistics says there was a 34,000 increase in people without work, while full-time employment fell by 38,000.\n\n\n\n\n\nMinister Rishworth says the Australian economy remains resilient despite this.\n\n\n\n\n\n\" There is significant global uncertainty across the world and of course that has an impact here in Australia. I would say that the uptick in unemployment is broadly in line with Treasury's forecast which was outlined in March and is within market expectations.\"\n\n\n\n\n\nThe Reserve Bank of Australia will factor this employment data into their next monetary policy meeting in August with the market expecting this could result in a cut to interest rates.\n\n\n\n\n\nNew South Wales Housing Minister, Rose Jackson, has called independent state M-P Mark Latham a pig after allegations he took covert photographs of female colleagues in the upper house and shared them.\n\n\n\n\n\nThe messages, reportedly sent to his former partner Nathalie Matthews, have been published in the Daily Telegraph, allegedly included disparaging comments about the appearance of a number of female politicians.\n\n\n\n\n\nThe report follows allegations made by Ms Matthews that she sustained a pattern of abuse and manipulation by Mr Latham, which the former Labor leader and prime ministerial candidate has described as ridiculous.\n\n\n\n\n\nHe has acknowledged sexting his former partner from the Parliamentary chamber however, something Premier Chris Minns reportedly called inappropriate.\n\n\n\n\n\nHousing Minister Jackson says it must be made clear that Mr Latham's parliamentary behaviour is unacceptable.\n\n\n\n\n\n\"Mark Latham's a pig, this is not new to me. This man has attacked Rosie Batty, told her to grieve in private. This man is well-known on the record, multiple times, as a bigot. He's one of the biggest bigots in this state. Obviously it's extremely confronting for me to think that in a workplace there's someone who thinks it's acceptable to take photos of you, to share them with derogatory comments. In any other workplace you'd be shown the door.\"\n\n\n\n\n\nOne of three men accused of attempting to import more than $500 million worth of drugs into Australia inside rolls of fabric has been denied bail.\n\n\n\n\n\n24-year-old Martin Nguyen appeared in Brisbane Magistrates Court after being charged with attempting to possess a commercial quantity of an unlawfully imported border-controlled drug.\n\n\n\n\n\nBrendan Ky and Tony Nguyen were also arrested and charged on Monday after the Australian Border Force intercepted sea cargo from Thailand earlier this month.\n\n\n\n\n\nSubsequent testing allegedly found almost 600 kilograms of methamphetamine valued at $555 million wrapped inside 200 rolls of fabric.\n\n\n\n\n\nIn rugby,\n\n\n\n\n\nWallabies coach Joe Schmidt says the absence of Rob Valetini for the first British & Irish Lions clash this Saturday is a loss but he's confident flanker Nick Champion de Crespigny will make a big impression on his test debut at Lang Park.\n\n\n\n\n\nThe flanker, one of just two uncapped players in the 36-strong squad, has surged into calculations after an injury to pivotal backrower Rob Valetini and the in-form Langi Gleeson.\n\n\n\n\n\nSchmidt says Nick is ready to prove himself.\n\n\n\n\n\n\"It's a great opportunity for Nick Champion de Crespigny who's trained well, had a good Super Rugby season and is really excited about the opportunity he has. Big shoes to fill. The good thing with Nick is that he's a good line-out option. I thought he was very good in the force line-out. He's probably a bit more of a roving scavenger than Bobby V who's been a big ball carrier in the past.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/jobless-rate-rises-to-highest-level-since-2021-as-number-of-unemployed-australians-jumps/lji6fac2g",
        "title": "Jobless rate rises to highest level since 2021 as number of unemployed Australians jumps",
        "publish_date": "Thu, 17 Jul 2025 02:28:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "The jobless rate has risen to 4.3 per cent — its highest rate since 2021 — surpassing expectations as the number of unemployed Australians jumped.\n\n\n\n\n\nFinancial markets had expected the rate to remain steady at 4.1 per cent in June, but there was a nearly 34,000 increase in people without work, according to the Australian Bureau of Statistics.\n\n\n\n\n\nEmployment rose by 2,000, up 2 per cent compared to the same month last year, after part-time employment grew by 40,000 and full-time employment fell by 38,000 people.\n\n\n\n\n\nUntil this result, the unemployment rate had sat at 4.1 per cent for three consecutive monthly readings .\n\n\n\n\n\nThe Reserve Bank of Australia (RBA) will closely monitor the labour market before its next monetary policy meeting in August, NAB's head of Australian economics Gareth Spence said.\n\n\n\n\"The focus for the RBA will be ensuring the labour market remains healthy going forward,\" Spence said\n\n\n\n\n\n\"The timing of [rate] cuts is not super important. It's more about, where do they end up?\"\n\n\n\n\n\nIn a move that shocked analysts and disappointed mortgage holders, the RBA kept the cash rate steady at 3.85 per cent earlier this month .\n\n\n\n\n\nMost economists had pencilled in a 0.25 per cent cut on the back of slowing inflation growth.\n\n\n\nLISTEN TO Why the RBA didn't cut interest rates in July SBS News 08/07/2025 09:03 English\n\nSpence still expected the jobless rate to climb to 4.4 per cent by the end of 2025, but said economic indicators point to the labour market still being in a strong position.\n\n\n\n\n\nRBA said in its latest monetary policy decision that labour market conditions remained tight.\n\n\n\n\n\n\"Measures of labour under-utilisation are at relatively low rates and business surveys and liaison suggest that availability of labour is still a constraint for a range of employers.\n\n\n\n\n\n\"Alternatively, labour market outcomes may prove stronger than expected, given the signal from a range of leading indicators.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/musicals/phantom-of-the-opera-returns-to-sydney-harbour-amid-opera-australia-woes-20250718-p5mfxd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Phantom of the Opera returns to Sydney Harbour amid Opera Australia woes",
        "publish_date": "Fri, 18 Jul 2025 12:18:42 +1000",
        "category": "finance",
        "authors": [
            "Chris Hook"
        ],
        "text": "Following this year’s disastrous financial results, Opera Australia will restage its hit 2022 production of Phantom of the Opera for next summer’s Opera on the Harbour season.\n\nThe season will kick off the beloved Andrew Lloyd Webber musical’s 40th anniversary year in March and promises a lucrative box office – the 2022 Handa Opera on the Harbour season sold 61,580 tickets, despite being dogged by wild rain and unpredictable weather, narrowly missing the record 65,000 tickets sold to West Side Story in 2019.\n\nJoshua Robson as the Phantom and Georgina Hopson as Christine in the 2022 production. Credit: Prudence Upton\n\nIt comes at a crucial time for the national opera company, which posted a $10 million operating deficit this year, following disappointing returns for its 2024 production of Sunset Boulevard.\n\nOpera Australia chair Rod Sims said that when the results were released in May, the company was committed to “better programming”, trimming procurement costs and “taking a stronger look at musicals”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/god-is-a-literary-snob-i-ll-have-the-scar-to-prove-it-20250710-p5mdyt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "God is a literary snob. I’ll have the scar to prove it",
        "publish_date": "Fri, 18 Jul 2025 12:17:28 +1000",
        "category": "lifestyle",
        "authors": [
            "Anson Cameron"
        ],
        "text": "Job 20:27: And the Heavens will expose his iniquity, and the Earth will rise up against him.\n\nIn the Kimberley, the red battlements overhanging Australia’s prettiest waterfall are decorated with Gwion art tens of thousands of years old, most of it depicting people amid lively ceremony. The falling water fans out into a long semicircular fringe of white with outlying strands decorating the cliff face for hundreds of metres. Below the falls is a stretch of dark river where massive crocodiles make patient ambush. Above, there are only freshwater crocs and there, we swam away the inherent aches of this hard country.\n\nKing George River in the Kimberley. Credit: Getty Images\n\nThe far side of this remote river is Indigenous land, empty now. The side we were walking was a cattle station, a couple of million acres, but the cattle were gone or gone wild. We camped on a rock shelf a kilometre above the falls and as the sun went down, I wrote a poem in my notebook.\n\nRoads and years give out short of here\n\nWhere clear water runs chasms of red stone.\n\nNo man-made proof of man, no inkling of sapiens\n\nSave arrangements of blood and sap on sheltered rock,\n\nRevellers and warriors daubed by bygones,\n\nDressed to the nines and dancing evermore,\n\nBeseeching their gods, soundlessly, endlessly,\n\nUselessly, as it turns out.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/australian-golfers-struggle-as-royal-portrush-lashed-by-wild-weather-20250717-p5mfu1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Almost missed it’: Cam Smith makes an ‘awful’ start to Open but recovers as Royal Portrush weather turns crazy",
        "publish_date": "Fri, 18 Jul 2025 12:14:07 +1000",
        "category": "sports",
        "authors": [
            "Sam Mcclure"
        ],
        "text": "Day, who teed off early in the morning and avoided the worst of the weather, admitted it was some of the most challenging conditions he’s ever seen. “The weather here … it’s the craziest weather pattern I’ve ever experienced in my life,” Day said after walking off the 18th hole as the heavens opened. “Craziest weather pattern I’ve ever experienced”: Jason Day reacts on the 18th green. Credit: Getty Images “There’s no consistency to it whatsoever. I mean, I’d love to be a weatherman here. You just get it wrong all the time. “Definitely not (the weatherman doesn’t get it right). And I can say that with true honesty because I’ve been watching the weather pattern over the last two weeks … other than last weekend; he got it right. But this whole week has just been awful for trying to get it right.\n\n“It’s not good to be wrong in golf, it might be good to be wrong as a weatherman.” Day was also highly critical of himself, reflecting on his errors as the root cause of his poor round. He said he would speak to his performance coach on Thursday night to try to rectify the situation before he tees off for his second round. Adam Scott plays a shot on the 12th hole. Credit: Getty Images “My process out there was actually quite horrific … I’ve been a professional too long to get this wrong. To work hard coming into this week and then to go out there and have poor process is not acceptable, especially in my eyes. I have no one else other than myself to blame.” It was also a tough day for Smith. He bogeyed the first hole after finding the long grass off the tee and made a rare double bogey on the ninth to be four over at the turn.\n\nIt’s at that point the Queenslander said he gave himself a stern talking to. He didn’t want to repeat what he said because he didn’t want to use expletives. “I can’t say it,” he laughed. “I’ve just been doing a really good job of committing to swings and committing to shots. I think being a little bit uncomfortable out there, it just kind of slipped my mind a few times and hit a few bad shots and got myself into a bit of trouble when I really shouldn’t have. Marc Leishman tees off on the first hole. Credit: Getty Images “I’ve been swinging the club really nicely. Like I said, I just need to go out there and commit to some swings. I was able to do that on the back nine and give myself a lot of looks.” Smith said whoever is able to grind away through the conditions and hold on for long enough will put himself in contention late on Sunday.\n\n“I think that’s every major. You see the guys that are playing well, and generally the guys at the top of the leaderboard at the end of the week are the guys that are grinding it out and really putting 100 per cent into every shot,” he said. Loading “For sure that’s how it’s going to be. Looks like we’re going to get a bit of Open weather here the next few days. Yeah, kind of strap in.” Meantime, Leishman was critical of the slow pace of play on the course. Several groups were taking well over five hours to complete their rounds, which is extraordinary given they are playing in groups of three and not four. “I think I got up about eight [holes], watched an hour. Felt like we were on the golf course for about 12 hours. We’ve been on the course for three hours through eight holes. That was tough to deal with, especially coming from somewhere where we play in under four-and-a-half every week,” Leishman said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/why-isn-t-there-a-single-social-media-savvy-mp-in-parliament-20250712-p5megm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why isn’t there a single social media-savvy MP in Parliament?",
        "publish_date": "Fri, 18 Jul 2025 12:02:49 +1000",
        "category": "finance",
        "authors": [
            "Nick Bonyhady"
        ],
        "text": "Chandler-Mather is in some ways a poor messenger, given his loss, but he insists there are longer-term risks from politicians’ lack of engagement with voters on social media platforms. “Australia’s going down the pathway of this sort of slow disengagement,” says Chandler-Mather. “Like, the number of people disengaging from politics increases every year. The number of people who feel sort of distrustful of politics increases every year.” Tim Doyle, a marketing savant who has done contract work for Labor in the past and now leads telehealth company Eucalyptus, says Australian political parties are behind much of the Western world. “They also only fire up the engine, which needs to be always on, about six weeks before an election,” Doyle says.\n\nWhere an American politician like Mamdani might throw himself into the ocean fully clothed in midwinter as he declares “I’m freezing… your rent”, Australian MPs play it safe, Doyle says. “Politicians are terrified of being vulnerable and that’s the essential thing for social media,” he says. “They have no idea what engagement matters. They preach to their true believers, who like and share their content, but that does nothing to convince the undecided voters they need.” Good social posts, he says, “should make your true believers a little bit uncomfortable.” Only a handful of politicians tiptoe into the stunts and trends that might distinguish them online from the parade of slick brand videos and AI-generated slop.\n\nDan Repacholi, the MP for the Hunter in NSW, has, for example, posted videos with fake wounds to promote safety in the mining industry and tells men to “watch your nuts” as part of his role as a men’s health envoy. One Nation’s Please Explain cartoon has flourished online, but is between seasons. And Keith Wolahan, a Liberal MP who did extensive social media directed at Chinese-Australian voters, lost his Melbourne seat at the election. Loading But most MPs have only a few thousand followers, far fewer than niche hobby influencers, and fill their feed with screenshots of press releases, clips from television interviews and awkward, unedited speeches about the opening of local facilities. One Labor MP, speaking on condition of anonymity, says the government has no unified social media strategy outside of elections. “People just do their own social media,” the MP says. “After coming to government, I just don’t have the time.” Former Labor campaign strategist Megan Lane says Australia’s compulsory and preferential voting system means that politicians here can use social media differently than other countries.\n\nThere is no need to persuade voters to back a candidate in a primary, to bring disengaged people to a booth on polling day, or to tack to extremes because preferential voting tends to bring those ballots back to the parties in the centre. Politics is also less polarised, making it less likely to be picked up by an algorithm online. “Instead of exciting rusted-on supporters to drive up voter turnout, Australian politicians are essentially focused on persuading punters that they are the least bad option,” Lane says. Max Chandler-Mather’s social media success did not save him at the last federal election. Credit: Alex Ellinghausen Mainstream media too still has huge influence. Seven’s Sunrise breakfast television program, for example, had a national average audience of 399,000 people as of July 16, according to figures from industry measurement provider Virtual Australia. Morning interviews often draw further reporting from outlets, as do scoops in newspapers, multiplying their audience throughout the day.\n\nBut another dynamic is staffing. Political staffers on both sides of politics, who were not authorised to speak publicly, said social media was typically the responsibility of the most junior person in an MPs office. Career progression required going into policy development or traditional public relations. “They all think about traditional media all the time and never social,” Doyle says of politicians, who are in their mid-40s on average when elected, according to data from the Parliamentary Library. Jenrick’s approach is different. The MP employs a 21-year-old called Dov Forman to film his videos. Uniquely among political staffers, Forman is a social star in his own right who racked up millions of views filming the stories of his great-grandmother, a Holocaust survivor, during the pandemic. His expertise is evident in his style. Where most Australian MPs talk straight into the camera, Forman’s videos for Jenrick are frenetic. His 58-second clip on fare evasion has 33 jump cuts. There is a risk in getting social media wrong, though. “It’s a personal choice,” says the Labor MP. “How do you get people to focus on your message without turning yourself into a clown?”\n\n“Some people in the crossbench are happy to veer towards silly stuff but if you want to be serious in government I don’t think it’s worthwhile.” Loading Chandler-Mather, the former Greens MP who developed a huge social media following, disagrees. “The idea that ‘We’re a party of government, and so we can’t propose anything other than tinker around the edges’ is a completely self-serving argument,” Chandler-Mather says. He argues that politicians from the major parties lack the charisma and appealing messages that work online. “To be honest, the calibre of Australian politician isn’t fantastic,” Chandler-Mather concludes. His loss, he says, was a result of major party preferences and being outspent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/carey-video-filming-legal-but-insinuation-could-spark-defamation-lawyer-warns-20250718-p5mfwu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Carey video: Filming legal, but insinuation could spark defamation, lawyer warns",
        "publish_date": "Fri, 18 Jul 2025 12:01:09 +1000",
        "category": "finance",
        "authors": [
            "Hannah Hammoud"
        ],
        "text": "A prominent Melbourne lawyer says it is legal to film in a public place and legal to publish a video, but any insinuation that former footballer Wayne Carey and a Melbourne marketing executive had acted inappropriately in a wine bar bathroom could spark a defamation claim.\n\nA group of women filmed Melbourne woman Kate Aston leaving a bathroom at Armadale venue Toorak Cellars last Friday night and walking up steps. She was followed about 20 seconds later by Carey.\n\nMelbourne woman Kate Aston. Credit: Oreana\n\nIn the widely shared video, Carey is seen stopping to make a phone call while the women filming can be heard making comments such as “she looks embarrassed” and “what’s he doing in there?”\n\nCarey and Aston have both denied the insinuation that anything occurred between them in the bathroom. Carey said the toilets were unisex.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/snowboarding-gun-guseli-hints-at-dropping-new-stuff-20250718-p5mfzp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Snowboarding gun Guseli hints at 'dropping new stuff'",
        "publish_date": "Fri, 18 Jul 2025 12:00:14 +1000",
        "category": "sports",
        "authors": [],
        "text": "Snowboarding gun Guseli hints at 'dropping new stuff'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/lions-block-wallaby-from-playing-in-first-nations-and-pasifika-xv-20250718-p5mfvw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lions block Wallaby from playing in First Nations & Pasifika XV",
        "publish_date": "Fri, 18 Jul 2025 12:00:00 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "The British and Irish Lions have refused to allow Waratahs and Wallabies backrower Pete Samu to represent the First Nations and Pasifika XV next Tuesday in Melbourne because he did not play Super Rugby this season.\n\nSamu won the European Cup with Bordeaux in May and then joined the Waratahs in the same month. The demand comes three weeks after British and Irish Lions chief executive Ben Calveley pressurised Wallabies coach Joe Schmidt to release his squad to Super Rugby sides to ensure a competitive build-up ahead of the Test matches.\n\nSources with knowledge of the Lions’ demand but not authorised to speak publicly said that Samu was told the news yesterday in Melbourne and was offered the opportunity to leave the First Nations and Pasifika XV, but requested to stay with the squad. Samu’s teammates were told on Friday morning at training.\n\nThe First Nations & Pasifika XV fixture in Melbourne was created after the collapse of the Melbourne Rebels last May and will be the first time a team of this nature has played the British and Irish Lions in Australia.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/brussels-sprouts-salad-with-pancetta-cheddar-and-sherry-vinaigrette-20250716-p5mfan.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brussels sprouts salad with pancetta, cheddar and sherry vinaigrette",
        "publish_date": "Fri, 18 Jul 2025 11:55:53 +1000",
        "category": "finance",
        "authors": [
            "Danielle Alvarez"
        ],
        "text": "This textural salad works as a standalone meal or robust side. William Meppem\n\nWinter might be my favourite time of year for salads. Greens, such as Brussels sprouts, kale and radicchio, are all hearty enough to hold up to any number of toppings and punchy dressings.\n\nHere, Brussels sprouts, both raw and roasted, are combined to provide different textures and greater depth of flavour, then tossed with crispy pancetta, shallots, sharp cheddar cheese and a sherry vinaigrette. A grated-egg topping lends further oomph for a standalone meal or a robust side dish for roast meats.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/stephen-colbert-delivers-devastating-update-on-future-of-the-late-show-20250718-p5mfxp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stephen Colbert delivers devastating update on future of The Late Show",
        "publish_date": "Fri, 18 Jul 2025 11:52:36 +1000",
        "category": "finance",
        "authors": [],
        "text": "Los Angeles: The Late Show with Stephen Colbert, the most-watched late-night program on US broadcast television and a frequent platform of satire aimed at President Donald Trump, will end its 10-year run on CBS in May 2026, the network said on Thursday.\n\nThe show will be retired and Colbert will not be replaced. New episodes will air until the end of the broadcast TV season in May 2026, a network statement said.\n\nThe Late Show with Stephen Colbert has been cancelled. Credit: CBS via Getty Images\n\n“This is purely a financial decision against a challenging backdrop in late night. It is not related in any way to the show’s performance, content or other matters happening at Paramount,” the executives said in a statement.\n\nCBS parent company Paramount is seeking approval from the US Federal Communications Commission for an $US8.4 billion ($12.5 billion) merger with Skydance Media. This month, Paramount agreed to settle a lawsuit filed by Trump over an interview with former vice president Kamala Harris, his Democratic challenger in the 2024 presidential race, that CBS’s 60 Minutes broadcast in October.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-albanese-returns-after-week-long-china-visit-trump-diagnosed-with-medical-condition-20250718-p5mfva.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese returns after week-long China visit; Trump diagnosed with medical condition",
        "publish_date": "Fri, 18 Jul 2025 11:51:53 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "A law firm has lodged a complaint with Australia’s information commissioner on behalf of Qantas customers whose data was exposed in a June 30 data breach.\n\nMaurice Blackburn lodged the complaint with the Office of the Australian Information Commissioner over the data on 5.7 million customers, a potential first step in a class action suit.\n\nQantas sought an injunction to minimise the impact of the data breach. Credit: Wolter Peeters\n\nThe complaint with the commissioner claims Qantas didn’t take reasonable steps to protect the customers’ personal information.\n\n“We think it’s important that privacy breaches are compensated because there are very real consequences for everyday Australians who have to deal with the fallout, whether its scam callers, risks of identity theft or other criminal activity,” said Maurice Blackburn principal lawyer Elizabeth O’Shea.\n\nThe airline on July 9 confirmed that 5.7 million customers had their information accessed, including name, phone numbers, business phone number, addresses and even the food preferences of thousands of travellers.\n\nQantas later confirmed the “majority” of a subset of 2.8 million customer records had names, email addresses and frequent flyer information, including the level of Qantas membership of the affected customer.\n\nLoading\n\nThe breached data, which Qantas says to the best of its knowledge has not been leaked, can nonetheless be used by scammers as a list of future victims. For example, the information on membership tiers included whether the frequent flyer is a member of the Chairman’s Lounge.\n\nOn Thursday, in a legal move designed to minimise the impact of the data breach, Qantas got an interim injunction in the NSW Supreme Court to “prevent the stolen data from being accessed, viewed, released, used, transmitted or published by anyone, including by any third parties”.\n\nThe move blocks anyone from publishing or sharing the details of the customers, who were affected by the theft of millions of customer records.\n\nCompanies and organisations like law firm HWL Ebsworth, Ticketek, and Western Sydney University that have been hacked have turned to seeking injunctions as a way to prevent the dissemination of the hacked data through social media and media reporting.\n\nO’Shea said: “If I was a member of the Chairman’s Lounge, I might be relieved that the court order might prevent journalists reporting on that if the information gets out, but I am not. So it’s little solace to most of us.”\n\nClayton Utz partner James Neil has written injunction orders can be obtained against “persons unknown”, including overseas hackers.\n\n“By notifying potential publishers of their obligations under the court’s orders, affected businesses demonstrate a proactive effort to mitigate further harm from being caused by the cyberattack,” Neil wrote.\n\n“This proactive approach is particularly relevant where a business has obligations to maintain the integrity of the stolen data and use their best endeavours to prevent sensitive information from being disseminated.”\n\nClayton Utz is not involved in the legal action against Qantas over the hacked data.\n\nMaurice Blackburn encourages Qantas customers who were affected by the breach to register with the law firm, which is free and non-binding.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/to-defend-our-democracy-pm-must-disavow-and-abandon-segal-report-20250717-p5mfpd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "To defend our democracy, PM must disavow and abandon Segal report",
        "publish_date": "Fri, 18 Jul 2025 11:41:06 +1000",
        "category": "finance",
        "authors": [
            "Richard Flanagan"
        ],
        "text": "The eminent Jewish historian, the late Tony Judt, put it this way in the leading Israeli newspaper Haaretz in 2006: “When Israel breaks international law in the occupied territories, when Israel publicly humiliates the subject populations whose land it has seized – but then responds to its critics with loud cries of ‘antisemitism’ – it is in effect saying that these acts are not Israeli acts, they are Jewish acts: The occupation is not an Israeli occupation, it is a Jewish occupation, and if you don’t like these things it is because you don’t like Jews. The Russian-American journalist M. Gassen at the Festival of Dangerous Ideas in Sydney last year. Would they be welcome if Jillian Segal’s recommendations were adopted? Credit: Dion Georgopoulos “In many parts of the world this is in danger of becoming a self-fulfilling assertion: Israel’s reckless behaviour and insistent identification of all criticism with antisemitism is now the leading source of anti-Jewish sentiment in Western Europe and much of Asia.” Anyone repeating Judt’s words would risk no longer being able to speak in mainstream Australia because they would have been branded as antisemitic. Similarly, a university or writers’ festival or public broadcaster could lose its funding for hosting Ehud Olmert, Israel’s former prime minister, who last week compared plans for a “humanitarian city” to be built in Rafah to “a concentration camp”, making him yet another antisemite according to the Segal report. Pointedly, Olmert said, “Attitudes inside Israel might start to shift only when Israelis started to feel the burden of international pressure.” In other words, leading Israelis are saying criticism of Israel can be helpful, rather than antisemitic. Yet, even by me doing no more than quoting word-for-word arguments made by globally distinguished Jews, could it be that I meet the Segal report’s criteria for antisemitism? Would I be blacklisted for repeating what can be said in Israel about Israel but cannot be said in Australia?\n\nAt the same time, in an Australia where protest is being increasingly criminalised, the Segal report creates an attractive template that could be broadened to silence dissenting voices that question the state’s policies on other matters such as immigration, climate and environment. Loading That the ABC and SBS could be censored on the basis of “monitoring” by Jillian Segal, a power she recommends she be given as the Special Envoy to Combat Antisemitism, raises the unedifying vision of our public broadcasters being policed from the Segal family lounge room. No matter how much Segal seeks to now distance herself from her husband’s political choices, that his family trust is a leading donor to Advance – a far-right lobby group which advocates anti-Palestinian, anti-immigrant positions, publishes racist cartoons and promotes the lie that climate change is a hoax – doesn’t help engender in the Australian public a sense of political innocence about her report. It is hard to see how this helps a Jewish community that feels threatened, attacked and misunderstood. Could it be that the Segal report’s only contribution to the necessary battle against antisemitism will be to fuel the growth of the antisemitism it is meant to combat?\n\nIf the ironies are endless, the dangers are profound. Loading It is not simply that these things are absurd, it is that they are a threat to us as a democratic people. That the prime minister has unwisely put himself in a position where he now must disavow something he previously seemed to support is unfortunate. But disavow and abandon it he must. Antisemitism is real and, as is all racism, despicable. The federal government is right to do all it can within existing laws to act against the perpetrators of recent antisemitic outrages. Earlier this month, the Federal Court found Wissam Haddad guilty of breaching the Racial Discrimination Act with online posts that were “fundamentally racist and antisemitic” but ruled that criticism of Israel, Zionism and the Israel Defence Forces was not antisemitic. It is wrong to go beyond our laws in new ways that would damage Australian democracy and seem to only serve the interests of another nation that finds its actions the subject of global opprobrium. The example of the USA shows where forgetting what is at stake leads. Just because the most powerful in our country have endorsed this report does not mean we should agree with it. Just because it stifles criticism of another country does not make Australia better nor Jews safer. Nor, if we follow the logic of Ehud Olmert, does it even help Israel.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/this-is-chess-it-ain-t-checkers-inside-the-nrl-s-season-defining-tactical-calls-20250716-p5mfbg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This is chess, it ain’t checkers. Inside the NRL’s season-defining tactical calls",
        "publish_date": "Fri, 18 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Billie Eder"
        ],
        "text": "For the first 39 minutes of the experiment, against the Tigers in round 17, it looked like it shouldn’t last another second. The Sea Eagles couldn’t get the ball wide to Trbojevic at right centre. Hopoate could only drop it when the Tigers bombed Manly’s new No.1. And then, seemingly out of nowhere, Trbojevic reprised the roaming centre role that, on the all-too rare occasions he has played for NSW, has made him the most dangerous man in sky-blue. Increasingly throughout Manly’s recent wins over the struggling Tigers and Rabbitohs, Trbojevic has slotted in as a left-edge ball-player just as he does when playing fullback. Left-edge back-rower and brother Ben rightly points out that “Tom’s done that in the Origin arena many times”. Five-eighth Luke Brooks echoes feedback from NSW camp whenever Trbojevic has popped up wherever he wants.\n\nThe play is rarely practiced, Trbojevic instead left to his own devices and instincts “because he’s got such good game awareness, he just naturally does that. I feel like he just knows the right time to come.” Not only does Trbojevic’s roaming keep one of the game’s most devastating ball-runners - when his body lets him - in the game, but it balances up a Manly attack that has been exceptionally right-side centric. Understandably, Haumole Olakau’atu’s threat outside Daly Cherry-Evans on the right edge has played a significant part in 35 tries (second in the NRL) being generated on the injured back-rower’s side.\n\nThe issue when Manly’s attack has stagnated this season has been listless shifting from side-to-side trying to use arguably the quickest backline in the competition. Especially if Jake Trbojevic is reduced to a non-running link man, where defences do not anticipate him taking on the line, and he doesn’t, so they just slide and comfortably shut down the play. Manly’s go-forward has been hampered by injuries to Olakau’atu, Taniela Paskea and Nathan Brown, and upcoming top-eight clashes against the Storm, Bulldogs, Roosters and Raiders will put that firmly under the microscope. So too Hopoate’s hands under the high ball - a month-long aerial assault from Jahrome Hughes, Matt Burton, Sam Walker and Jamal Fogarty looms if Tom Trbojevic stays at centre.\n\nBut if he is still swinging from edge to edge as a second fullback, the defence at least has food for thought, particularly if Brooks and Cherry-Evans make good on a conscious effort to play both sides of the ruck as playmakers. “That’s something we’ve really wanted to bring to our game,” Brooks says. “Getting our hands on the ball a bit more and sort of linking up together because we feel like when we’re linking up we’re connected, and we’re playing our best footy.” Galvinised: The glaring issue still confronting Canterbury\n\nWith similar on-field context to Manly, and a significantly brighter spotlight because it’s the Bulldogs, Lachlan Galvin, Phil Gould and all that entails, Ciraldo has bitten the bullet on his star mid-season signing. Toby Sexton is playing the unfortunate role of Bambi’s mother, shot down to NSW Cup with Canterbury still at the pointy end of the ladder as their attack begins to really stall. Much has been made of Sexton’s own individual statistics - not a single try-assist in the past seven weeks, not one line-break all season. With a wider lens though, Canterbury’s attack in the past month - albeit coloured by a brutal finals-worthy 8-6 loss to Penrith - has been statistically, the worst in the NRL. It hasn’t been for lack of trying. The Bulldogs short passing, fast-moving attack went into overdrive trying to crack the Panthers with 297 passes and 17 offloads, bumping up their recent averages for both facets of the game.\n\nThe clunkiness has been plain to see though and has translated to the scoreboard because such a playing style with so many ballplayers can easily be thrown out of sync. “The last little period we’ve been working really hard on our attack,” Ciraldo said on SEN radio this week. “We’ve been trying to evolve our attack gearing towards the back end of the year, understanding what’s going to beat those top teams who have really good defensive systems. And we just felt like we weren’t sort of getting there.” For Galvin’s spark to surpass Sexton’s steady hand, less will be more from the 19-year-old.\n\nGalvin’s strength is his running game and a right-foot step that straightens the attack on the right edge, but can see him drifting and cramping his outside men on the left. With Jacob Preston and Stephen Crichton making for a potent right-edge, Galvin doesn’t need to force his hand as was the case against Brisbane two weeks ago. Points will come. But the same question mark over Sexton, Matt Burton and Canterbury’s mobile pack remains.\n\nThe Bulldogs were caught out at the end of last year by North Queensland and Manly’s big forward packs, and when the whips were cracking against the Sea Eagles in a sudden death semi, a lack of game management. Sexton and Burton couldn’t guide the Bulldogs home that day, and expecting Galvin to take on the highest-pressure role in rugby league is fraught too. The finals are two months away, but Saturday’s clash against the Dragons will be the first time he’s worn the No.7 jumper in his career. Galvin’s short kicking game has shown promise, but we’ve barely seen a long kicking game from him. Burton’s booming boot is a fine long-range option.\n\nLoading Yet without a fallback, Nathan Cleary pinched a critical charge down try last month because he knew the Bulldogs No.6 was the only man for a clearing kick. How Ciraldo manoeuvres Galvin’s development alongside Burton, as well as the duel playmaking roles of Reed Mahoney and Bailey Hayward, all while trying to add big-game polish to Canterbury’s campaign will be fascinating. Because after all, this ain’t checkers. NRL is Live and Free on Channel 9 & 9Now",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/sam-konstas-was-a-boxing-day-hero-today-he-can-barely-make-a-run-where-to-now-for-cricket-s-golden-boy-20250717-p5mftn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sam Konstas was a Boxing Day hero, today he can barely make a run. Where to now for cricket’s golden boy?",
        "publish_date": "Fri, 18 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "“I think everything’s up in the air at the moment,” former Australian Test captain Mark Taylor, who presented Konstas his baggy green on Boxing Day last year, told this masthead. “That’s for Sam and Usman [Khawaja] because they both haven’t set the world on fire.” The numbers are jarring for a player nicknamed “Pinter” — a pint-sized Punter (Ricky Ponting) — by some in NSW cricket circles. Scores of 60, 8, 23, 22, 3, 5, 25, 0, 17 and 0 leave Konstas with a Test average of 16.3 — the lowest ever by an Australian opener from as many innings. “You can see the effects of Test cricket affected him mentally,” said former NSW and Australian wicketkeeper Brad Haddin. “Test cricket’s a tough place. Mentally, if things aren’t going your way, there’s nowhere to hide. His confidence would have taken a big hit.”\n\nHow did it get to this point? Where to from here? “We’ve got to be really, really careful,” said a former Australian cricketer, speaking on the condition of anonymity. “He’s such a young kid. I feel sorry for him.” A rapid rise and even sharper fall A little over 13 weeks before Konstas walked out to bat on Test debut at the Melbourne Cricket Ground against the best fast bowler on the planet, India’s Jasprit Bumrah, he was bowled by a 15-year-old fourth grader in a Sydney Premier Cricket match. Konstas, playing for Sutherland’s under-21s Poidevin-Gray team, had already blasted what ended up being a match-winning hundred, yet was dismissed by a young Northern Districts bowler by the name of Rubeindranath Gobinath.\n\nThe anecdote isn’t to crticise Konstas, but to highlight how quickly his star rose. Some believe that hundred, albeit against teenagers, kick-started his season. No one could have predicted he’d be playing for Australia by December. Professional sport is full of sliding door moments and Konstas had several late last year. Konstas was selected to bat at No.6 in a NSW trial match early last season. He then made 25 and 8 in a second XI game for NSW. Only when Steve Smith didn’t return for NSW - Konstas thought Australia’s No.4 was going to be playing the match - did the teenager get a start at the top of the order in the Sheffield Shield.\n\nHe responded with twin hundreds at Cricket Central in Sydney and became the name on everyone’s lips. Sam Konstas at the SCG. Credit: Kate Geraghty Even then, had any number of more experienced found form - Cameron Bancroft, Marcus Harris or Matt Renshaw - Konstas probably wouldn’t have debuted at the MCG. An audacious century at Manuka Oval in a Prime Minister’s XI game against the touring Indians only added to the intrigue and hype. If Nathan McSweeney had made one reasonable score against India, Konstas wouldn’t have played in Melbourne. He was brought in as a “disruptor”, in the words of head coach Andrew McDonald. Had one of Bumrah’s seaming deliveries caught his edge on Boxing Day, his debut 60 would not have happened.\n\n“It was not as if he made huge scores,” Taylor said. “It was the fact he made the papers for a different reason. It gave him a spotlight he probably didn’t need. Sam Konstas ahead of his debut innings on Boxing Day. Credit: Getty Images “Normally, you try and make your way in quietly and then assert your authority once you become a bit more of a senior player. That didn’t happen to Sam. It’s a lot to handle. I think he’s now trying to, quite rightfully, backpedal a bit and settle into the side.” Haddin believes the uniqueness of the debut shaped perceptions. “I think that might have played a role in the hype around what everyone expected in Test cricket,” Haddin said. “I don’t think we’ll ever see a debut quite like that. What comes with that was a lot of outside pressure and expectations.”\n\nIn October, Konstas became the third-youngest player to make centuries in both innings of a Shield game, behind Ponting and Archie Jackson. Then, his first-class average was 50.25. After another 28 first-class innings, it’s now 30.34. “I think he’s still probably trying to work out exactly the right way to play,” Taylor said. “He hasn’t been helped [in the West Indies] by not being given a decent pitch to play a normal, orthodox innings.” Much has been made of conditions in the Caribbean. Australia anticipated dry wickets and the chance to play two spinners. Instead, all three surfaces — in Barbados, Grenada and Kingston — offered exaggerated seam movement.\n\n“That cricket was borderline impossible to play at some stages,” Australian head coach Andrew McDonald said this week on SEN. According to data seen by the Australian team, the average seam movement in the third Test was 0.84 degrees, which is extreme. Of the 670 Test matches where data has been kept on ball movement, Australia’s latest rout of the West Indies was the 15th most for seam in history. Sam Konstas is out for duck in the second innings in Kingston. Credit: X Konstas’ strike rate for the series was 33.11 and he was caught between batting styles. “If you look at the contrasting techniques of the way the openers went about it, some tried to nut it out, work hard and battle through. You end up making 20 off 100 balls and still nick one anyway,” Taylor said. “I think Sam wasn’t sure whether to try that method or try, dare I say it, the Boxing Day method and some different shots.”\n\nThere have been other changes. Since becoming a household name, Konstas has increased his social media presence. “I don’t want to get distracted,” Konstas told cricket.com.au in February last year at the under-19 Cricket World Cup. “I don’t really need it – I just try to live in the moment and not be glued to my phone.” Konstas now updates his Instagram regularly with brand endorsements and behind-the-scenes glimpses to his 286,000 followers. It would be difficult to not soak up the adulation and added attention. A shirtless walk down a Barbados beach sampling local fish burgers before the first Test went viral. According to those close to Konstas, he is still in good spirits and eager for a reset before the Sheffield Shield season. His demeanour on tour certainly did not change as the runs dried up. He worked hard in the nets, desperate to turn his fortunes around.\n\nIt just didn’t translate to the middle. Loading “I think you can see at the end of the tour, it was all mental,” Haddin said. “He’s never been exposed to any pressure like this before. He wouldn’t have gone on a run like this in any of his cricket, like in junior cricket, without being able to dominate an attack. “What we’ve got to remember is the kid’s 19. He’s only had half a season of first-class cricket. This would have been a huge learning curve for him … which is a good thing. The learnings he’ll take will be enormous.” What about the Ashes? Konstas received a strong endorsement from Ricky Ponting this week, who said he wouldn’t change Australia’s top three.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/how-oasis-ruined-the-socceroos-plans-for-a-20-year-anniversary-clash-with-uruguay-20250716-p5mfab.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Oasis ruined the Socceroos’ plans for a 20-year anniversary clash with Uruguay",
        "publish_date": "Fri, 18 Jul 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Jackson Irvine and Tony Popovic. Credit: AP Welcome to the complicated world of booking friendlies. It’s not as simple as picking up the phone and asking a rival national team if they’re up for a game. As Football Australia plots the Socceroos’ road to the 2026 World Cup, they must juggle a mix of competing interests - commercial, political, technical and logistical - while navigating domestic hurdles like venue availability and government backing, plus the shifting international landscape, where potential opponents are suddenly ruled in or out, depending on their own qualification campaigns or asking prices. Then there’s the pursuit of FIFA ranking points, which could determine whether Australia ends up with a favourable draw or a group of death, and thus presents another dilemma: is it better to face ‘easier’ nations and chase wins, or go for tougher assignments you might lose, but learn more from? ‘We want to experience as much as possible’\n\nThese are good problems to have. Direct World Cup qualification has plenty of advantages, like enabling Football Australia to get “ahead of the game”, as Popovic put it, with reconnaissance on possible hotels and training venues for the tournament; the federation is sending staff to the three co-host nations, the United States, Canada and Mexico, in the coming weeks. In avoiding the play-offs, it also meant they had five free international windows to fill up: September, October and November 2025, and March and June 2026. It’s a situation Australia hasn’t faced since the last time they qualified directly, back in 2013 under Holger Osieck. Preliminary talks with other national associations about potential friendlies tend to begin many months in advance, but games can only be booked once there is certainty about their qualification or otherwise. Popovic’s ask is simple: “To try and cover as many different styles and confederations as possible,” he said this week.\n\n“If we can cover, hopefully, an African team, South American team, European team … that will help in terms of preparation and just having the different styles that you come up against. Is it a pressing team, is it a team that sits back? Do they build up, don’t build up - so you get a little bit of an understanding of the different countries and how they like to play. We want to experience as much as possible. “That’s what we’re trying to do. Then there’s the other side of trying to get a Uruguay - can they come, how much do they cost? There are many things that come into that; it’s not just about plucking someone out, come to Australia to play us. The opportunity to face Lionel Messi and Argentina won’t come cheap. Credit: Getty Images “I’m sure the FA is doing everything they can to support us to bring, if it’s here, good opposition … [but] it changes daily. One moment you think you’ve got someone, and they’ve got another idea and other plans.” Football Australia moved quickly to lock in a two-match home-and-away series in September against New Zealand, who have also qualified through Oceania, for the Soccer Ashes trophy that was re-discovered two years ago. This week, a friendly against the United States on October 14 in Colorado was confirmed, to go with an earlier announcement of a showdown with fellow co-hosts Canada in Montreal four days earlier - both valuable opportunities to experience World Cup conditions and facilities.\n\nFootball Australia wants to play two games at home in the November window, but finding an opponent is proving tricky. UEFA qualification goes through until the end of that month, which rules out a European team - and the prospect dream of a clash with the likes of Italy, or England, on Aussie soil. It leaves two realistic options: South America or Africa. SOCCEROOS’ ROAD TO THE 2026 WORLD CUP September 2025 Australia vs New Zealand - GIO Stadium, Canberra, September 5\n\nNew Zealand vs Australia - Go Media Stadium, Auckland, September 10 October 2025 Canada vs Australia - Saputo Stadium, Montreal, Canada, October 10\n\nUnited States vs Australia - Dick’s Sporting Goods Park, Colorado, United States, October 14 November 2025 Two games in Australia against South American or African opposition - TBC March 2026 Two games in Europe against European opposition - TBC June 2026 Farewell match in Australia - TBC\n\nWarm-up friendlies before the World Cup - TBC The issue is that the best nations are very reluctant to travel so far. A big, fat cheque could persuade them, but even with government support and the right venue, that sort of money is beyond FA’s current reach. Argentina, according to reports, charge around $7.5 million per match - so a two-game series in Australia would cost $15 million, plus on-the-ground expenses. Brazil, sources say, have asked for a similar fee. Other countries might want less, but would be less commercially appealing, and would still rather not come out all this way.\n\nAnd the trouble with Africa is that the first round of their World Cup qualification campaign ends in October, which leaves a very short runway for matches to be organised involving any of the nine teams that make it through. The likely outcome for November, according to sources, is a clash with a lower-ranked South American team or one of the African qualifiers, with talks ongoing for one of the two games to take place at Sydney’s CommBank Stadium. Why ranking points matter so much What happens after that will be dictated to some extent by what happens in December, when the World Cup draw is conducted, and groups are created from the 48 teams split across four pots. The profile of the teams in Australia’s group could dictate the kind of opponents Popovic would want in the March window - which will probably take place in Europe - and then in June, when there are tentative plans for a farewell game on home soil before the Socceroos relocate to North America ahead of the World Cup, which kicks off on June 11. But the other element that will factor into things is Australia’s FIFA ranking. Currently No.24 in the world, having moved up two places after the June window, the Socceroos sit on the edge of pots two and three. To give themselves the best statistical chance of a softer group, they will most likely need to be inside the top 23 to finish in pot two and thus avoid playing against one of the other teams in it - the likes of Croatia, Morocco and Colombia, as things stand.\n\nTo do that, they need to win as many matches as they can before the draw. However, the nature of the draw mechanics - this being the first World Cup with 48 teams - means that no matter what they do, there could still be dangerous floaters, such as Italy, Greece and Serbia, in pot four. Former Socceroos boss Graham Arnold was highly strategic when it came to ranking points, but Popovic seems to be taking a more relaxed approach, and said he was not thinking about those permutations, though FA staff certainly are on his behalf. Popovic has his own balancing act to deal with. Most fans would like to see him experiment over the next 12 months, and try players who haven’t featured much or at all for the Socceroos in his short reign to date - like Watford-bound Nestory Irankunda, or departed A-League stars Adrian Segecic, Noah Botic and Nicolas Milanovic, who have landed at Portsmouth, Austria Wien and Aberdeen respectively this off-season.\n\nLoading He is open to change, suggesting he feels no sense of obligation towards those who have helped them qualify in terms of them making his final squad for the World Cup. But Popovic doesn’t want to simply hand out caps. “When we say trying players for the national team, they still must earn their call,” he said. “It’s not about, okay, I heard some guy scored two goals and yeah, great, we’ll just give them a call to the national team. It doesn’t go like that.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/right-call-johns-backs-parramattas-brown-axing-20250718-p5mfyd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Right call': Johns backs Parramatta's Brown axing",
        "publish_date": "Fri, 18 Jul 2025 11:19:20 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Right call': Johns backs Parramatta's Brown axing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/stephen-colbert-announces-shock-ending-to-the-late-show-20250718-p5mfys.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stephen Colbert announces shock ending to The Late Show",
        "publish_date": "Fri, 18 Jul 2025 11:18:41 +1000",
        "category": "finance",
        "authors": [],
        "text": "Stephen Colbert announces shock ending to The Late Show\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/prince-christian-of-denmark-steps-up-as-regent-amid-parents-holiday-20250718-p5mfyl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Christian of Denmark steps up as regent amid parents' holiday",
        "publish_date": "Fri, 18 Jul 2025 11:13:28 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Christian of Denmark steps up as regent amid parents' holiday\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]