[
  {
    "url": "https://www.9news.com.au/national/telstra-investigating-outage-for-webmail-customers/e683dbe2-38c7-40b9-b879-f4160a964db9",
    "title": "Telstra investigates outage that hit mail users",
    "publish_date": "Tue, 29 Apr 2025 00:44:19 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "T﻿elstra said today it is continuing to monitor an outage that impacted thousands of customers.\n\nProblems began about 2 pm AEST yesterday when the telco's Bigpond and Webmail services struck problems around email logins and some apps.\n\nEarly today, Telstra said on social media that Telstra Mail was back up and running, but some customers using a third-party app may continue to experience troubles.\n\nREAD MORE: Mystery power outage strikes millions across Spain and Portugal\n\nTelstra is continuing to monitor an outage that impacted some of its customers. (AAP)\n\n\"We've seen that some customers are still facing issues accessing Telstra Mail. Our team's continuing to monitor and investigate,\" it said in an X post.\n\n\"As a first step, we recommend attempting to reset your password and then accessing your account using webmail.\"\n\nTelstra is continuing to monitor and investigate impacts from the outage.\n\n\"If you need help, reach out to us via phone or message in the My Telstra app or website,\" the telco said.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/jayne-hrdlicka-appointed-chief-executive-of-endeavour-hospitality-group/7a3c72f1-6ffa-495e-a9b6-fdf27b6aecbd",
    "title": "Former Virgin Australia boss to run giant bottle shop chains",
    "publish_date": "Tue, 29 Apr 2025 00:37:06 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Former Virgin Australia boss Jayne Hrdlicka will turn her hand to running the company that owns the Dan Murphy's and BWS bottle shop chains.\n\nHospitality group Endeavour announced today ﻿Hrdlicka will take over as chief executive next year.\n\nIt will be managed by executive chairman Ari Mervis for the remainder of this year.\n\nHrdlicka was appointed to the top job at Virgin Australia ﻿by owner Bain Capital and steered it out of administration following the airline's collapse during the pandemic.\n\nLIVE UPDATES: Both leaders enter final days of campaigning\n\nJayne Hrdlicka has been appointed to run the hospitality group Endeavour, owner of the Dan Murphy's and BWS liquor chains. (Supplied)\n\n\"I have a long history with Endeavour's retail and hotel businesses, initially as a consultant to Woolworths, including on their early liquor strategy, and then as a Woolworths Group Board member,\" she said.\n\n\"Endeavour Group has much to play for. I look forward to working with the 30,000+ team members and together, continuing to deliver for millions of valued customers as we look to grow the company and unlock value for all of our shareholders.\"\n\nIn addition to owning ﻿Dan Murphy's and BWS, the company also has hundreds of pubs across Australia.\n\nThe 10 most expensive countries in the world for beer View Gallery\n\nSince it was spun out of Woolworths four years ago, Endeavour has battled flattening retail sales as the cost-of-living crisis impacted household budgets.\n\nMervis said ﻿Hrdlicka had the \"proven track record\" to run Endeavour.\n\n\"She has led many complex organisations and delivered significant shareholder value by capturing the true potential of a company's brands and assets,\" he said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/spain-portugal-major-power-outage-in-lisbon-madrid-europe/fe805732-3398-4028-bbe1-a318f7a04313",
    "title": "Mystery power outage hits millions across Spain and Portugal",
    "publish_date": "Mon, 28 Apr 2025 15:06:54 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A widespread and unexplained power outage has knocked out electricity in most of Spain and Portugal, shutting off traffic lights and causing chaos at airports, train stations and on the roads.\n\nPortugal's grid operator Redes Energéticas Nacionais (REN) said electrical supply was lost across the entire Iberian peninsula, and in parts of France, late on Monday morning (Monday night AEST). By 4pm (1am on Tuesday AEST), it still looked like it could be hours until power was restored.\n\nThe outage took out screens, lighting and power sockets, and caused traffic lights and subway systems to suddenly fail. Some power began to trickle back across Spain hours later, but efforts to fully revive the grid and to investigate the cause have not yet been successful.\n\nPeople try to board a crowded bus after the subway stopped running following a power outage in Lisbon, Portugal. (AP)\n\nIn Madrid, traffic piled up on the roads after the lights went out.\n\n\"I was driving and suddenly there was no traffic lights … It was a bit of a jungle,\" Luis Ibáñez Jiménez told CNN.\n\n\"I saw a massive bus coming, and I had to accelerate a lot to go past it.\"\n\nThe cause of the sudden blackout was unclear, but its impact was dramatic.\n\nCalls to declare national emergency﻿\n\nThe cause of the blackout was unclear, but its impact was dramatic: transport hubs shuttered and governments in both countries, which share a population of about 60 million people, hastily co-ordinated a response.\n\nMadrid's mayor José Luis Martinez Almeida asked people to minimise their movements and only call emergency services if it was truly urgent. He also called on people to stay clear of the roads for emergency workers. Later in the day, Madrid's emergency services provider urged the country's government to declare a national emergency.\n\nPortugal's grid operator said restoring power was a \"complex operation\".\n\n\"At the moment it is impossible to predict when the situation will be normalised,\" it said.\n\nEfforts could stretch into the night.\n\n\"The experience of other similar events that have taken place in other countries indicate to us that this process – the total reestablishment of the electrical supply – will take several hours,\" Eduardo Prieto, director of services for system operation at Red Eléctrica, told broadcaster La Sexta.\n\nPassengers roam outside Atocha train station in Madrid. (AP)\n\nCustomers forced to use what cash they have at a store in Barcelona, Spain. (Getty)\n\n\"We could be talking about six to 10 hours, if everything goes well, until we re-establish supply to every last customer,\" he said.\n\nDozens of Iberian cities, like Madrid, Lisbon, Barcelona, Seville and Valencia, are major hubs for transport, business and tourism. Two of the five busiest airports in the European Union in 2023 were Madrid's and Barcelona's, according to EU data.\n\nLife goes on, with difficulties﻿\n\nAt lunchtime in the Alcântara neighbourhood in Lisbon, the streets were busy with cars and pedestrians but the shops were dark.\n\nMany were still operating using pen, paper and cash to record purchases but there were longer than usual lines as shoppers chatted uneasily while they waited.\n\nIt wasn't exactly panic buying but cans of beans and tuna were in high demand.\n\nOne young couple realised that without cash, and with ATMs not working, they didn't have any way to pay for anything.\n\nTraffic seemed to still be flowing normally and the occasional plane flew overhead on a warm April day.\n\nBarber Hugo Fernandes, 42, was still cutting hair this afternoon but said he probably only had three or four cuts left before the shaver batteries ran out.\n\n\"I think a little bit we were already expecting all these sorts of things,\" he said.\n\nAn empty court after matches are suspended due to the power outage at the Madrid Open. (Violeta Santos Moura/Reuters via CNN Newsource)\n\n\"We, at times, I think, let things happen and while they don't happen, I think people think they will never happen.\"\n\nHospitals activate emergency plans﻿\n\nPortugal's National Institute for Medical Emergencies said it had \"activated its contingency plan\", running its telephone and IT systems through a backup generator. Spain's health ministry said the same process happened in hospitals there.\n\nBut flights at major airports in the region were suddenly delayed or cancelled, with travelers scrambling to adapt; online flight trackers reported that several airports saw their frequent departures suddenly halted after midday. Portugal's flag carrier TAP Air Portugal told people not to travel to the airport until further notice.\n\nEllie Kenny, a holidaymaker inside Lisbon's Humberto Delgado airport, said hundreds of people were stood in the dark in queues, with no air conditioning or running water. Shops were only accepting cash, she told CNN.\n\nSpanish train operator Renfe said trains had stopped and departures were canceled. And in subway tunnels, passengers were plunged into darkness. Video posted on social media showed blackened subway cars stuck in standstill on platforms in Madrid, where the metro was suspended and entrances to stations were taped off.\n\nSome parts of southern France, near the Spanish border, felt a more sporadic impact.\n\nA file photo showing power lines in Madrid, Spain. (Bloomberg)\n\nEmilie Grandidie, a spokeswoman for France's electricity transmission operator RTE, told CNN there was \"a small power cut\" in the French Basque Country.\n\n\"It lasted only a couple of minutes and was restored very quickly,\" she said.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/world-news-gene-hackman-new-autopsy-confirms-he-died-from-heart-disease-notes-his-alzheimers-and-prolonged-fasting/7188e319-d25e-447f-b8ed-b34419997356",
    "title": "New autopsy reveals exactly how Hackman died",
    "publish_date": "Mon, 28 Apr 2025 20:24:54 +0000",
    "category": "lifestyle",
    "authors": [
      "Apr"
    ],
    "text": "The main cause of Gene Hackman's death was heart disease, but he was also in the advanced stages of Alzheimer's disease and likely had not eaten for a long time, according to a new autopsy report.\n\nThe report documents the 95-year-old actor’s poor heart health , noting he had experienced congestive heart failure, an aortic valve replacement and an irregular heartbeat. He was given a pacemaker in April 2019.\n\nHackman’s carbon monoxide concentration was less than 5 per cent saturation, which is within the normal range. He tested negative for the hantavirus, which is a rare but potentially fatal disease spread by infected rodent droppings .\n\nGene Hackman and Betsy Arakawa are pictured in 1989. (Ralph Dominguez/MediaPunch /IPX/AP)\n\nAuthorities have said Hackman’s wife, Betsy Arakawa, likely died February 11 at home from hantavirus pulmonary syndrome.\n\nHer autopsy report hasn’t yet been released.\n\nA toxicology report says Hackman tested negative for alcohol and intoxicating drugs, but that he had a low concentration of acetone in his system that indicates prolonged fasting.\n\nHackman appeared to have outlived Arakawa at home by about a week, possibly unaware of his wife's death. Hackman’s pacemaker showed an abnormal heart rhythm on February 18 — the day he likely died, according to the state's chief medical examiner.\n\nRecords released earlier in the investigation showed Arakawa made phone calls and internet searches as she scoured for information on flu-like symptoms and breathing techniques.\n\nRecently released videos outline the scope of the investigation into the deaths of Hackman and Arakawa.\n\nBefore they understood how Hackman and Arakawa died, authorities recorded themselves conducting interviews with workers and returning to Hackman’s home to search for more evidence.\n\nDetectives searched the home in early March for Arakawa’s laptop and other clues.\n\nA photo taken by investigators during the search of the home of Gene Hackman and his wife Betsy Arakawa. (Santa Fe County Sheriff)\n\nArakawa's computer showed that between February 8 and the morning of February 12, she was researching medical conditions related to COVID-19 and flu-like symptoms, according to the records released by the Santa Fe County Sheriff's Office.\n\nIn an email to her masseuse, she said Hackman woke up on February 11 with flu or cold-like symptoms and she'd have to reschedule her appointment for the next day.\n\nHer search history on the morning of February 12 showed she was looking into a medical concierge service in Santa Fe. A call with the service lasted less than two minutes, and she missed a return call later that afternoon, according to investigators.\n\nNew images show inside home of Gene Hackman and wife after mysterious deaths View Gallery\n\nRedacted police body camera images showed officers going through the home and finding no signs of forced entry or anything out of the ordinary with the home's contents. Investigators took note of prescription medication on a bathroom counter as one of the couple's dogs barked in the background.\n\nInitially, all photos, video and documents from the investigation were sealed by a temporary court order.\n\nHackman's estate and Arakawa's mother asked a judge to extend that order, citing privacy concerns.\n\nThe Associated Press, CBS News and CBS Studios intervened in the matter, saying in court filings that they would not disseminate images of the couple's bodies.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/depression-spray-esketamine-pbs/948caeaa-58e6-43ea-9805-878b1860df69",
    "title": "Price of 'miracle' ketamine spray for depression cut as it's added to PBS",
    "publish_date": "Mon, 28 Apr 2025 09:37:11 +0000",
    "category": "sports",
    "authors": [
      "Apr"
    ],
    "text": "A nasal spray that's having life-changing impacts on people living with depression is set to be listed on the Pharmaceutical Benefits Scheme (PBS), slashing the cost and improving accessibility.\n\nIt's the first time in three decades that a new type of depression medicine has been added to the subsidised list, a decision that's expected to help up to 30,000 Australians.\n\nAlexis Hutcheon and Samuel Hockey live with depression that's resistant to treatment.\n\nFEDERAL ELECTION 2025: What happened on the campaign trail today\n\nAlexis Hutcheon has been using the new spray for depression. (Nine)\n\n\"It really has been a concoction of things that you trial and feel let down by,\" Hockey said\n\nThat's until they qualified for a clinical trial testing Esketamine.\n\n\"At the time it felt like a last resort option for me,\" Hutcheon said.\n\n\"I started to notice that things improved almost immediately.\"\n\nEsketamine - or Spravato as it's known on the market - is a nasal spray that increases glutamate levels in the brain.\n\nThat's the chemical messenger that impacts a person's mood and thought processes.\n\n\"About half the people who've had treatment-resistant depression experience a significant improvement in their quality of life, a significant reduction in their symptoms,\" Professor Ian Hickie from the University of Sydney said.\n\nThe new spray for depression will be cheaper for all Aussies. (Nine)\n\nConsultant psychiatrist Associate Professor Liz Scott said: \"We think that in some people it's going to put them into remission, and long-term remission.\"\n\nPatients start with treatment twice a week then extend to weekly and fortnightly doses.\n\nThey have to fast for two hours before and be supervised after receiving the spray.\n\nThey also can't drive for the rest of that day.\n\nAfter years of testing it's being added to the PBS.\n\nREAD MORE: A local council has come up with an unusual solution to trolley dumping\n\nHutcheon called it a \"gamechanger\" and Hockley said it was \"just a miracle\".\n\nThe spray will officially be listed on the PBS on Thursday, reducing the price from about $800 a week to $7.70 per dose for concession card holders, and $31.60 for everyone else.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/commsec-state-of-the-states-report-wa-has-top-economy/f3a73588-75b7-4053-ba2d-7cfa972e2149",
    "title": "Where the powerhouse economies of Australia are",
    "publish_date": "Mon, 28 Apr 2025 02:52:09 +0000",
    "category": "finance",
    "authors": [
      "April"
    ],
    "text": "1 of 9 Attribution: Glenn Campbell\n\nT﻿he economic powerhouses and laggards of Australia have been revealed in a new report today.\n\nThe CommSec State of the States report ranks every jurisdiction based on eight key economic indicators.\n\nThe research by the broking arm of the Commonwealth Bank found the economic performance of states and territories is being supported by a strong job market, solid government spending and steady population growth at a time of higher cost-of-living pressures﻿.\n\nClick on to find the winners and losers.﻿",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/the-highest-paying-jobs-in-construction/7de0e716-a179-44fc-93d1-baf621d6022a",
    "title": "The highest paying jobs in the construction industry",
    "publish_date": "Thu, 17 Apr 2025 19:31:37 +0000",
    "category": "finance",
    "authors": [
      "April"
    ],
    "text": "1 of 9 Attribution: Getty\n\nThe construction industry accounts for almost nine per cent of the total workforce in Australia.\n\nWith some skills in demand in the job market, there are opportunities to earn high salaries.\n\nN﻿ew data from Hays has revealed which roles attract the most money in the sector.\n\nThe data was compiled based on average salary ranges from 2023 to 2024.\n\nContinue through the gallery to find the highest paying roles.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/world/pope-francis-death-worldwide-mourning-rites-and-rituals-begin-following-the-death-of-pope-francis/9ffbd6e8-682f-4983-9e48-aa49a6eca4ef",
    "title": "Pope Francis's tomb seen for first time in images released by Vatican",
    "publish_date": "Wed, 23 Apr 2025 01:52:09 +0000",
    "category": "finance",
    "authors": [
      "April"
    ],
    "text": "1 of 74 Attribution: Graphic: Polly Hanning\n\nNew images of the Pope's tomb have been released after the world reacted quickly to the news of the death of Pope Francis at age 88 on Easter Monday.\n\nWithin hours of hearing of his passing, mourners flocked to churches to pay their respects to the leader.\n\nThe death of a pope sets in motion a series of carefully orchestrated rites and rituals well before the conclave to elect his successor begins.﻿\n\nThey involve the certification of death and public display of his body for the faithful to pay their respects, followed by the funeral and burial.\n\nSee all the photos here.﻿",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/world/world-news-german-finger-wrestling-fingerhakeln-64th-championship/19481334-0d74-4c7b-b36c-29513e7c9458",
    "title": "Men launch over tiny tables in the ultimate battle of the strongest finger",
    "publish_date": "Sun, 27 Apr 2025 22:25:38 +0000",
    "category": "sports",
    "authors": [
      "April"
    ],
    "text": "1 of 10 Attribution: AP\n\nMen in short leather pants and embroidered suspenders risked dislocated digits over the weekend as they vied for the top prize at Germany's championship in the sport of fingerhakeln, or finger wrestling.\n\nAbout 180 competitors took part in Sunday's 64th German championship in Pang, about an hour's drive south-west of Munich.",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/diesel-4wd-essential-outback-ev-sales-low/105216142",
    "title": "Outback hybrid sales strong, but diesel 4WDs unlikely to be replaced",
    "publish_date": "Tue, 29 Apr 2025 00:22:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "New South Wales livestock and property agent Troy Hartman knows firsthand how essential a four-wheel drive is on outback stations, particularly when it rains.\n\n\"If you had 10 millimetres [and] you jump in an old two-wheel drive, you'd probably slip all over the road and slide off it and get stuck,\" he said.\n\nFarmers and graziers also rely on four-wheel drives to cart tools, motorbikes, fuel, hay and supplies.\n\nWhile lowering vehicle emissions is the subject of national discussion, Mr Hartman said it was too soon for outback farmers to make the switch to hybrid or electric vehicles.\n\nFour-wheel drives are a must in tough outback conditions. (ABC Broken Hill: Katherine Spackman)\n\n\"There's a few electric vehicles in town, I've noticed, but to have them out on a property — no doubt one day it will happen, but it's a little bit too early,\" he said.\n\nHe believed some hybrid vehicles could appeal to farmers.\n\n\"It was interesting to see the ad on TV [for a hybrid ute], where the farmer was in the paddock and he pulled up to do a bit of work on a strainer post on a gateway and he actually hooked up his electric welder to the vehicle to fix up a gate hinge, which I thought it was an interesting option,\" Mr Hartman said.\n\nOutback hybrid sales strong\n\nBroken Hill Motor Company general manager Liam Aitken said station workers tended to purchase Mazda BT50s or Toyota HiLuxes and LandCruisers.\n\n\"You're not going to see certain vehicles make a hybrid or a EV option because it's not going to be suitable to be able to tow that load, carry that load, travel that distance, or travel that type of terrain,\" he said.\n\nMr Aitken said hybrids accounted for about 40 per cent of business sales last year and that one EV was sold.\n\nLiam Aitken says people in rural areas need to be looked after. (ABC Broken Hill: Katherine Spackman)\n\nToyota hybrids accounted for 51 per cent of national sales.\n\nMr Aitken supported the federal government's national vehicle emission scheme, which is due to come into place in July 2025, but said there needed to be a multi-pathway response.\n\nThe Coalition has promised to axe the vehicle efficiency standard if it wins the election.\n\n\"We are a big country and we need to make sure we look after our people in the rural areas,\" Mr Aitken said.\n\n'Going to be very hard'\n\nBroken Hill mechanic Matthew Gerrs believed charging infrastructure was the main thing holding back the transition to EVs.\n\n\"I think, probably, your biggest con would be your range reliability,\" he said.\n\n\"A lot of those farmers, they want to jump in a car and do 1,200 to 1,400 kilometres.\n\n\"It's going to be very hard to do that — obviously limited infrastructure, with a lack of charging stations … and then, obviously, the time that it takes to charge them.\"\n\nMatthew Gerrs says four-wheel drive services make up the bulk of his work. (ABC Broken Hill: Katherine Spackman)\n\nMr Gerrs's business employs 26 people in the workshop and on mine sites.\n\nThey mostly service four-wheel drives.\n\nMr Gerrs said station owners often held onto a vehicle until it reached 300-400,000km.\n\nHe has put his staff through an introductory course on safety in EV, but doubts it will come in handy anytime soon.\n\n\"I don't think that we'll see a lot of them through independent workshops for a long time,\" he said.\n\nInfrastructure rollout woes\n\nIn Far West NSW, the NRMA has charging stations in Wilcannia and Broken Hill, but there are no plans to install more in other towns.\n\nA NRMA spokesperson said it cost about $600,000 to build a charging site, but that was dependent on the \"location and availability of energy\".\n\n\"This figure could increase by a third or more depending on what is needed to solve those challenges at a local site,\" he said.\n\nThe NRMA's Broken Hill charging station opened in 2022. (ABC Broken Hill: Jonathon Poulson)\n\nOver the border in South Australia, the RAA has rolled out charging stations over the 500km between Broken Hill and Adelaide.\n\nIn 2023, it planned to put a charging station in Yunta but had to backtrack.\n\n\"Unfortunately, Yunta has been removed from the scope of the network due to challenges associated with getting sufficient power to the site,\" head of EV charging Andrew Howard said.\n\n\"The RAA charge network now spans 143 sites, with over 550 plugs across the state — more than the original network scope — giving EV drivers more confidence to travel around regional SA than ever before.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/media-watch-abc-chair-kim-williams-editorial-interference-/105226714",
    "title": "ABC chair denies interference over comedian interviews",
    "publish_date": "Tue, 29 Apr 2025 00:08:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "ABC chair Kim Williams has denied interfering in editorial decision-making after the organisation's Media Watch program reported he pushed for teams to offer airtime to an Australian comedian.\n\nThe Media Watch report said Mr Williams intervened on at least five occasions to encourage interviews with comedian Sandy Gutman, better known by his stage name Austen Tayshus.\n\nThe ABC's editorial teams are governed by a set of editorial policies designed to give them independence in editorial decision-making.\n\nMr Williams denied any attempt to \"impose actions or outcomes on any editorial managers\".\n\n\"I emphasise this is just not the case,\" Mr Williams said.\n\n\"If there have been misunderstandings in the process, or erroneous assumptions, I genuinely regret that they have arisen\".\n\nAusten Tayshus seeks support\n\nAccording to Media Watch, Gutman, best known for his 1983 hit Australiana, has since last year received more than 90 minutes of airtime on ABC local radio over 11 segments, with presenters frequently citing the details of his upcoming shows.\n\nThe program said on some of those occasions local staff had initially declined to interview Gutman.\n\nIn one incident described by Media Watch, after ABC Port Pirie turned down an interview, the performer telephoned Mr Williams to complain, alleging antisemitism.\n\nKim Williams calls for greater investment into ABC Photo shows A man in a suit with glasses New ABC chair Kim Williams has outlined his vision in his first major speech since taking on the role, calling for more government funding to help revitalise the national broadcaster.\n\nIn response, Mr Williams called ABC head of audio content Ben Latimer who, Media Watch alleges, passed a message down to editorial staff on Mr Gutman's behalf.\n\nDays later, Mr Gutman was interviewed on ABC North and West SA local radio.\n\nAfter Mr Gutman repeatedly lobbied Mr Latimer, the executive contacted Mr Williams to tell him that Sandy Gutman was out of line, according to Media Watch.\n\nIn another incident, Media Watch alleges, Mr Gutman complained to Mr Williams about being denied an interview with ABC New England.\n\nMr Williams forwarded the complaint to Mr Latimer, now the ABC's director of audio, as well as another senior news executive, who was on extended leave.\n\nMr Williams denied interfering with editorial matters. (AAP: Lukas Coch)\n\nMedia Watch quoted from an email sent from Mr Williams to Mr Latimer in which he said he was \"essentially on his [Gutman's] side\".\n\n\"Our people are often arrogant with talent,\" the email said.\n\n\"How often would someone like Austen Tayshus be in New England? Strange attitude. I know he can be demanding but he is talent.\"\n\nThe editorial decision was subsequently reversed and Mr Gutman secured an interview with ABC New England Breakfast a week later.\n\nIn relation to the email, Mr Williams told Media Watch: \"I did not at any time intervene and would never seek to override editorial judgement from local teams.\"\n\n\"My comment was about responding to talent.\"\n\n'Inappropriate' pressure\n\nMedia Watch reported the actions prompted some staff members to raise concerns about editorial independence.\n\nManaging director Hugh Marks, who joined the broadcaster earlier this year, described the matters raised by Media Watch as \"important\".\n\n\"I have been at the ABC a short time but I am vigilant to ensure the proper delineation of responsibility between the Board and management, and will act appropriately to ensure the best interests of the ABC, its people and audiences as we move forward,\" he said.\n\nHugh Marks said the matters raised by Media Watch are \"important\". (ABC News: John Gunn)\n\nFormer ABC editorial director Alan Sunderland told Media Watch board members needed to take great care not to be seen as \"lobbying or pressuring for a specific editorial outcome\".\n\nHe said in the examples cited, the chair appeared to be intervening on behalf of someone he knew.\n\n\"This sort of pressure on program teams from any board member, let alone the chairman, is in my view inappropriate,\" he said.\n\n\"The fact that it was not only passed on but acted upon by program teams who felt pressured to change their editorial judgement, indicates a significant failure of process and judgement, both on the part of the chairman and senior management.\"\n\nWhile Mr Gutman described Mr Williams as a \"friend\", Mr Williams said he was an acquaintance with whom he had \"brief involvement some 27 years ago\".\n\nIn a later statement, Mr Gutman said he was not sure if he had ever met Mr Williams.\n\n\"I contacted him because I thought he may be able to help me with what I perceived as lack of impartiality on the part of some journos,\" he said.\n\n\"All I expected was some help with some interviews and that's what I got from him and Ben Latimer.\"\n\nABC News approached Mr Latimer for comment.\n\nIn response to the Media Watch segment, the ABC said in a statement: “In recent months ABC management spoke with Mr Gutman to express clear expectations of his behaviour to staff when pitching interviews and discuss how the ABC makes editorial decisions.\n\n“The ABC regularly engages with members of the performance community for appearances across our networks and it’s important for the arts and entertainment sectors that we continue to do so.\n\n“The ABC Chair has always made clear he expects ABC management to follow its own independent decision-making on content. As the Editorial Policies state, the trust and respect of the community depend on the ABC’s editorial independence and integrity.”",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/lauren-brown-women-state-of-origin/105227670",
    "title": "How Brown's fire and ice create Origin field goal magic",
    "publish_date": "Mon, 28 Apr 2025 23:53:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "Firefighter and Queensland field goal specialist Lauren Brown is the queen of the big moment, because no-one understands pressure the same way she does.\n\nOn the field and off it, the versatile 30-year-old life's work has been all about facing pressure head-on.\n\nLast year's 68th-minute golden point field goal in Game II of the State of Origin series was a classic case in point.\n\nWith the Maroons trailing 1-0 in the series and scores locked up, she landed a stunner in pouring rain and into a gale to secure an 11-10 win, a feat Brown had performed several times for Gold Coast in the NRLW.\n\nThe Maroons went on to win the series 2-1.\n\nABC Sport will provide live coverage of the Women's State of Origin Game I from Brisbane, with a live blog and radio commentary from 7pm AEST on Thursday.\n\nAhead of Thursday night's Origin opener at Lang Park, the Maroons magician explained several home truths about pressure.\n\n\"I'm a firefighter by day and night. If we are rocking up to a house fully engulfed in fire it can be a life-or-death situation,\" she told AAP.\n\n\"That is what real pressure is, making sure you don't let it overwhelm you.\n\n\"You go back to being task-focused. It helps shift you back to your principles and process.\n\nLauren Brown kicked a last-gasp field goal to win Game II for the Maroons. (AAP Image: NRL Photos/Gregg Porteous)\n\n\"That allows you to harness the adrenaline, nerves and pressure by doing what you have been trained to do in those situations. That has helped me on the footy field as well.\n\n\"The training we receive in academy for firefighting is incredible and they always put us in worst cases [scenarios] so you are ready … to do your best possible job.\"\n\nSo does training for do-or-die moments help in front of the posts?\n\n\"I guess subconsciously it does translate across, to not worrying about the outcome and going back to process,\" she said.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\n\"I don't think about that when I am on the field. What I do relate to is that muscle memory, so I make sure I do one or two field goal sessions a week.\n\n\"It is just like I am down at Burleigh Bears practising with Dad. I am not one to think before I kick a field goal, 'Is it going to go in?'\n\n\"It is more about catch the ball, get a good ball drop, a good follow through with my [leg] swing, keep my head down and hopefully by the time I look up it is sailing through, which lucky enough it did [in Newcastle].\"\n\nBrown recalled the best part of last year's magic moment was looking at teammates and \"seeing how much it meant to them\".\n\n\"I'm a footy tragic. You watch so many iconic moments over the years where my favourite players — [Darren] Lockyer, [Johnathan] Thurston, [Cooper] Cronk — have iced moments like that,\" she said.\n\n\"When you are a little kid down the park you imagine there's 10 seconds to go and you have to land it to win.\n\n\"I look back at the field goal and I am super grateful … but everyone in the team did something that contributed to the win.\"\n\nBrown said the Maroons were determined to make amends for last year's Game I loss in Brisbane and \"make Queenslanders proud\".\n\nAAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/how-multinational-firms-profit-from-australian-childcare-kids/105197310",
    "title": "US fund managers cut corners at Australian daycares for bigger profits",
    "publish_date": "Mon, 28 Apr 2025 23:36:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "When a parent drops their child at their local Only About Children (OAC) childcare centre in Sydney or Melbourne, they probably don't know the revenue will be cheered on the New York Stock Exchange (NYSE).\n\nThat's because OAC's 80 childcare centres were sold by a private equity company to a US multinational called Bright Horizons for $450 million in 2022.\n\nLowly-paid childcare workers and parents struggling with the cost of living may have been left cold by the following year's annual report from Bright Horizons to the NYSE.\n\n\"Tuition revenue increased by $199.9 million, or 17 per cent, when compared to the prior year, on a 15 per cent increase in enrolment and revenue contributions from OAC of $71.5 million,\" shareholders were told.\n\nHow do you check to make sure your childcare centre is safe? Photo shows Colouring pencils in a plastic container. Here is some practical advice to help you feel confident in your childcare provider — and what to do if something does not seem right.\n\nIt's emblematic of the \"corporatisation\" of childcare in Australia. And experts say it's putting kids at risk.\n\n\"Private equity, pension funds and publicly listed businesses all have investors expecting a return — and this is what creates significant risks for the quality of care,\" said Macquarie University Professor Gabrielle Meagher, who studies privatisation of social services.\n\n\" These businesses are motivated to come into the childcare sector by the opportunity that a highly-subsidised, high-demand service offers. \"\n\nGovernment subsidies, increased women's workforce participation and a push to promote the benefits of early education have fuelled enormous growth with almost 15,000 centres operating today.\n\nAustralia's top 10 for-profit childcare providers and their ownership G8 Education – ASX listed Affinity – private equity owned Guardian – private equity owned Busy Bees – owned by the Ontario Teachers’ Pension Plan Nido Early School – ASX listed Only About Children – wholly owned subsidiary of NYSE-listed Bright Horizons Green Leaves – private equity owned Edge Early Learning – private equity owned Montessori Academy – majority owned by founders Charles and Colette Assaf Sparrow Early Learning – majority owned by Fullshare, listed on the Hong Kong stock exchange (Source: Professor Gabrielle Meagher Macquarie University)\n\n\"Children are missing out on high-quality education and care experiences that could set them up for life,\" Professor Meagher said.\n\n\"In some cases children are exposed to unsafe environments and poor treatment.\"\n\nThe honey pot attracting investors is huge. Subsidies to the industry from Australian taxpayers are on track to cost the budget $15 billion a year by 2026-2027.\n\nMacquarie University Professor Gabrielle Meagher studies privatisation of social services. (Supplied)\n\nSeventy per cent of the centre-based recipients are run by private operators and a recent Four Corners investigation revealed serious failings endangering kids at some centres.\n\nIt also revealed sloppy regulation with 10 per cent of all centres — covering an estimated 47,000 kids in privately-owned centres — not meeting national quality standards.\n\nMany parents are choosing for-profit centres, including OAC, so clearly these operators are keeping parents happy.\n\nBut that business model is allowing unscrupulous providers to \"put profit before our children\" in some cases, said Maddy Butler from Parenthood, an independent group that advocates for parents.\n\n\"In the worst instances this leaves children vulnerable to mistreatment and educators underpaid, working in poor conditions,\" she said.\n\nThese views are backed up by a number of expert reviews that revealed better conditions at not-for-profits and government-run services.\n\nChildcare disadvantage Photo shows A young mother sitting on a couch with a smiling toddler lying across her lap With research showing educational disadvantage can begin as young as two if children cannot access child care, experts are demanding more action from the major parties.\n\n\"Forty-three per cent of government-managed services and 37 per cent of not-for-profit, community-managed services are exceeding the National Quality Standard, as opposed to only 12 per cent of for-profit services,\" Ms Butler said.\n\n\"For-profit providers also tend to charge higher fees.\"\n\nThe Australian Competition and Consumer Commission found not-for-profits spent more on staff, had higher retention levels and more full-time rather than casual workers.\n\nBright Horizon's filing to the NYSE gives an insight into its approach to resourcing its centres.\n\n\"We seek to cluster centres in geographic areas to enhance operating efficiencies and to create a leading market presence,\" the annual filing said.\n\nAmong other things, that kind of clustering has led to a phenomenon dubbed \"childcare deserts\", which is leaving families in poorer areas without enough places.\n\nLoading...\n\nIn a perfect world a profit motive might drive higher quality, as services sought to compete for more enrolments by lifting quality — meeting the needs of children and shareholders alike.\n\nHowever, OAC's website lists just 10 of its 80 centres as exceeding the national quality standards despite being located in some of the most expensive suburbs for childcare.\n\nABC News also recently revealed serious incidents at a number of OAC facilities including inappropriate contact when a child was kissed on the lips and others were disciplined with excessive force.\n\nAn educator at another centre was sentenced to two years in prison for touching a young boy on the groin and bottom.\n\nDo those shocking incidents and the comments to the NYSE suggest the profits of US shareholders are being put above the needs of Australian children?\n\nOAC did not respond to a request for comment. But it's far from alone in juggling profit and care, and others that aren't publicly traded can operate with even less public scrutiny.\n\nThat has left some experts calling for a reconsideration of the model of funding for profit operators.\n\nAustralia's childcare rating system labelled 'a joke' Photo shows A child playing with magnetic plastic shapes on a surface. The child's face can't be seen. With centres reassessed on average every four years, and some gaming the system, parents cannot be sure their child's centre meets the standards or that staff are properly trained or qualified.\n\n\"We don't know enough about what goes on inside these companies — how they use public funds and how they organise their staff and operations — especially when it comes to private equity companies who do not have the same reporting obligations as listed companies,\" Professor Meagher said.\n\nDuring the ABC election debate, Prime Minister Anthony Albanese said he hoped childcare would be his legacy.\n\n\"We want the universal provision of affordable childcare so that it is as natural to have your child have access to childcare as it is to have access to public education,\" Mr Albanese said.\n\nBut there's a crucial difference between the operators of schools and the operators of childcare centres.\n\nUnlike childcare centres, private schools are not allowed to operate as for-profit enterprises.\n\nHowever, Mr Albanese's plan to grow the childcare industry is relying on for-profit operators, capable of building centres quickly and at scale, to deliver his ambition.\n\nThat's left some experts sceptical.\n\n\"The government's universal childcare policy is an important step forward for children and families but if the quality of early learning centres does not improve, it will not achieve its aims,\" Professor Meagher said.\n\nDisturbing childcare incidents exposed Photo shows Children play with toys at a preschool Some of the country's largest childcare operators are named in a damning cache of regulatory documents the NSW government and regulator tried to keep hidden from the public.\n\n\"Currently the system is going in the wrong direction, given what we know about quality and costs.\"\n\nFollowing the 4 Corners investigation the government announced it would target operators that put \"profit over quality\" in a new enforcement scheme co-designed with industry.\n\nThe government said there was only a \"small number\" of operators doing the wrong thing.\n\nThe Australian Childcare Alliance, a lobby group that advocates for many for-profit providers did not respond to a request for comment.\n\nIt has previously welcomed the government's new scheme and noted the government's comments about problems being confined to a small group of operators.\n\nIf the government is re-elected and the expansion of childcare continues, then likely so too will the conflict between the operator's responsibilities to shareholders and the nation's most vulnerable.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/calls-to-investigate-water-levels-at-karijini-national-park/105202452",
    "title": "Calls for investigation as water levels drop at Karijini National Park",
    "publish_date": "Mon, 28 Apr 2025 23:29:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "The condition of Karijini National Park's spectacular gorges is worrying traditional owners and business operators as Western Australia's tourism season looms.\n\nThe national park, which attracts tens of thousands of visitors each year, is the traditional home of the Banjima, eastern Kuruma, and Yingawangka people.\n\nBanjima man Felix Wilfert is a wood carver who often cuts paperbark trees from Karijini.\n\nHe said there was a creek that flowed through the back roads and that the water was always deep enough to cover the bonnet of his vehicle.\n\n\"The last time I went there, last year, there was no water there — nothing,\" he said.\n\nFelix Wilfert says he has seen trees dying in parts of the national park. (ABC Pilbara: Mietta Adams)\n\nMr Wilfert said trees appeared to be dying in the area and that parts of the park were drier than usual.\n\nMr Wilfert said that because of the area's high altitude, the water at Karijini ran down the hills to neighbouring tributaries.\n\n\"Water and rain are a big thing to us,\" he said.\n\n\"It mainly runs all underground.\n\n\"It's like the backbone of our culture — that's what the elders left behind.\n\n\"They said: 'Take care of the land and the water.'\"\n\nRepeat visitors and tourism operators say the trail leading to Hancock Gorge is usually filled with waist-high water. (ABC Pilbara: Mietta Adams)\n\nRisk of partial closure\n\nKarijini Eco Retreat manager Drew Norrish said long-time staff and repeat guests were noticing lower water levels at some gorges.\n\n\"We need the gorges to remain open all season,\" he said.\n\n\"When there's no water flow, it can cause stagnated water and parts of the national park can close.\n\n\" There are several hundred thousand people that come through every year and water plays a massive part in the experience. \"\n\nMr Norrish said the situation was puzzling because he believed the area had received more rain over the most recent wet season — November to April — than the previous season.\n\nThe Bureau of Meteorology's only weather station in the national park has already recorded 113 more millimetres of rain this wet season than the 2023–24 season.\n\nMr Wilfert suggested neighbouring mining companies could be causing the lower water levels.\n\n\"I think it's something to do with mining and there should be water there all the time, really,\" he said.\n\nKarijini's waterfalls and gorges attract hundreds of thousands of tourists to WA's Pilbara region every year. (ABC Pilbara: Alistair Bates)\n\nMiners vow to protect park\n\nThe national park sits within the heart of the Pilbara's multi-billion-dollar network of iron ore mines, which are owned by some of the country's biggest companies, including BHP, Rio Tinto, Fortescue Metals Group, and Hancock Prospecting.\n\nRio Tinto's Marandoo mine is bordered by the national park on three sides and is about 50 kilometres from some of the most popular gorges.\n\nSince 2010, Rio Tinto has mined below the water table at Marandoo, which involves the removal of groundwater to access the iron ore.\n\nA Rio Tinto spokesperson said the aquifer connected to Marandoo was regularly monitored.\n\nThere has been speculation about the impact mines in the area could be having on the park. (ABC Pilbara: Charlie Mclean)\n\n\"We continue to conduct monitoring of all water sources we access as required under our environmental approvals,\" the spokesperson said.\n\n\" Our work is ongoing to reduce water usage across our operations. \"\n\nFortescue Metals Group, which also operates mines near Karijini, said it always tried to minimise its impact on the environment.\n\n\"Regarding Karijini National Park specifically, we recognise its environmental and cultural significance and remain committed to safeguarding this iconic region,\" a spokesperson said.\n\nCalls for investigation\n\nMr Norrish said it was time for the state government to investigate the condition of the gorges.\n\n\"It's not healthy to have speculative reasons,\" he said.\n\n\"I just feel like we as a community … need to get the facts on the table so we can deal with it knowing that everyone has the same information.\"\n\nThe Department of Water and Environmental Regulation did not respond when asked if it would investigate the situation, but pointed out rainfall during the past three wet seasons at Karijini National Park had been below the long-term average.\n\n\"This results in low recharge to watercourses and aquifers,\" the department said in a statement.\n\n\" The government is confident that the monitoring regimes and protections in place are appropriate. \"\n\nDrew Norrish wants the government to investigate, but says the national park is still a top destination. (ABC Pilbara: Charlie McLean)\n\nThe ABC understands an organisation representing some of the national park's traditional owners has started its own investigation and commissioned a hydrogeologist to assist.\n\nMr Norrish said people visiting Karijini this year could still expect a great experience.\n\n\"You know, [there are] two billion years of geology, but also the cultural connection to country — it's very active and still very much alive with the traditional owners,\" he said.\n\n\"Karijini is one of the most amazing places in Australia … so we're very keen to make sure it remains at the top of the list for tourists travelling through WA.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/sam-kerr-no-date-on-return-to-play-after-acl-injury/105227306",
    "title": "'She's working really hard': Still no return date for Sam Kerr",
    "publish_date": "Mon, 28 Apr 2025 22:14:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "The date when Matildas captain Sam Kerr can return to action remains unclear, her club coach says.\n\nThe West Australian has been out of action since suffering an anterior cruciate ligament injury during training in early January 2024.\n\nKerr had been included on Chelsea's Champions League roster in the hope she would be able to play a part in their campaign, but she was never fit enough to even be named in a matchday squad prior to the English club's exit at the hands of Barcelona on Sunday, although she did attend both legs.\n\nHowever, Chelsea still have much to play for. They have three matches left in the Women's Super League, in which they are on course for a sixth successive title being six points clear.\n\nThat campaign finishes on May 10. Eight days later Chelsea meet Manchester United at Wembley Stadium in the FA Cup final.\n\nKerr would love to be able to feature in that having scored in three successive deciders won by Chelsea from 2021-2023, scoring five goals in total.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nHowever, Sonia Bompastor, Chelsea's coach, said she still had no clarity as to when she would be able to select Kerr for the first time, having joined the club ahead of this season.\n\n\"She's working really hard,\" Bompastor said.\n\n\"All the performance staff are doing everything for her to play this season.\n\n\"We'll see how it goes. We know we only have a few games left now. Hopefully, yes, but it's difficult for me to have a clear answer.\"\n\nKerr returned to individual training in January this year and her recovery has now gone well beyond the usual length of time for an ACL.\n\nThe 31-year-old has scored 99 goals in 128 matches since making her Chelsea debut in January 2020.\n\nAustralia's next matches are May 30 and June 2 against Argentina as the Matildas build towards hosting the Women's Asian Cup next March.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/asx-markets-business-live-news-april29-2025/105223726",
    "title": "Live: Australian share market on the rise as Trump eases auto tariffs",
    "publish_date": "Mon, 28 Apr 2025 22:08:57 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Gareth Hutchens",
      "Daniel Ziffer"
    ],
    "text": "Earlier I put up a section of a fascinating long read in TIME magazine that lays out Donald Trump's economic vision for America.\n\nThe questions are from senior political correspondent Eric Cortellessa and editor-in-chief Sam Jacobs.\n\nThe interview transcript is worth your time and you can read it in full here.\n\nYour trade adviser, Peter Navarro, says 90 deals in 90 days is possible. We're now 13 days into the point from when you lifted the reciprocal, the discounted reciprocal tariffs. There's zero deals so far. Why is that?\n\nNo, there’s many deals.\n\nWhen are they going to be announced?\n\nYou have to understand, I'm dealing with all the companies, very friendly countries. We're meeting with China. We're doing fine with everybody. But ultimately, I've made all the deals.\n\nNot one has been announced yet. When are you going to announce them?\n\nI’ve made 200 deals.\n\nYou’ve made 200 deals?\n\n100%.\n\nI’m just curious, why don’t you announce these deals that you’ve solidified?\n\nI would say, over the next three to four weeks, and we're finished, by the way.\n\nYou’re finished?\n\nWe’ll be finished.\n\nOh, you will be finished in three to four weeks.\n\nI’ll be finished. Now, some countries may come back and ask for an adjustment, and I'll consider that, but I'll basically be, with great knowledge, setting—ready? We're a department store, a giant department store, the biggest department store in history. Everybody wants to come in and take from us.\n\nWill you call President Xi if he doesn’t call you?\n\nNo.\n\nYou won’t?\n\nNope.\n\nHas he called you yet?\n\nYep.\n\nWhen did he call you?\n\nHe's called. And I don't think that's a sign of weakness on his behalf.\n\nBut you would think it’s a sign of weakness if you called him?\n\nI don’t–I just look—\n\nWell, what did he say?\n\nIf people want to–well, we all want to make deals. But I am this giant store. It's a giant, beautiful store, and everybody wants to go shopping there. And on behalf of the American people, I own the store, and I set prices, and I'll say, if you want to shop here, this is what you have to pay.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/final-fantasy-xiv-masayoshi-soken-game-show-distant-worlds/105142026",
    "title": "Final Fantasy composer Masayoshi Soken on making music that stops the world",
    "publish_date": "Mon, 28 Apr 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Japanese video game composer Masayoshi Soken doesn't see his work as separate from the games he scores, it's all part of the full experience.\n\nThe Final Fantasy XIV and Final Fantasy XVI composer was recently in London for live performances of his music.\n\nMusic from video game series Final Fantasy, a long running role-playing franchise with more than 30 titles, is being toured globally as part of Distant Worlds: music from Final Fantasy an orchestral concert series.\n\n\"When we are creating music for games, I do have to acknowledge that there isn't a lot of freedom to do whatever you want, it is not easy to make game music like this,\" says Soken\n\n\"When I'm putting music into Final Fantasy XIV, I'm trying very hard to think about the game experience overall, I think that each sound that goes into it is incredibly important, but I'm not trying to think of each of the songs as separate to the game.\"\n\nYour weekly playlist of iconic soundtracks from video games Photo shows ABC Game Show promo image with stylised joy stick Discover a new world of music, as composer, multi-instrumentalist and performance poet Meena Shamaly brings you iconic soundtracks and orchestral scores from digital gaming.\n\nUnlike film and television composers who score music after the scenes are shot, composers for video games often work hand in hand with the game development team as the game is being made to make sure music and sound effects respond to gameplay.\n\nMusic in video games is often dynamic responding to player actions and milestones within the story, with each player experiencing their own audio mix and sequence.\n\nSoken says it's a challenge but the response from players makes the process worth it.\n\nDrinking buddies with Nobuo Uematsu\n\nSoken's career spans nearly thirty years, originally starting at Konami, working as an editor and sound designer as well as composer and eventually becoming sound director.\n\nHe has also worked closely with another composer whose name is still synonymous with the Final Fantasy series, Nobuo Uematsu.\n\nUematsu composed soundtracks for the first 12 mainline Final Fantasy games, starting in 1987 with the original game for the Nintendo Entertainment System.\n\nHow Final Fantasy maestro Nobuo Uematsu legitimised video game music Photo shows Japanese composer Nobuo Umeatsu sits playing viola in a lounge surrounded by cds and musical equipment This self-taught Japanese composer is behind some of the most beloved video game music\n\nThe two musicians worked together on the original 2010 version of the multiplayer role-playing game Final Fantasy XIV and would drink together every day after work.\n\n\"If I focus on my relationship with Uematsu, I think that when we moved the company [office] to a location that was quite far from Uematsu's house, he slowly started coming less into the company and eventually he left. For me that was a major part of my history when I look back.\"\n\n\"We would go out drinking every day before we moved and that’s not to say we didn’t drink at all, but I did find that quite sad that we couldn't do that anymore, we didn't have that flow of literally going to drink every single day.\"\n\nUematsu established the signature Final Fantasy sound which draws influences from classical music, along with rock and jazz, with composers like Soken building on that canon 'sound' of the games with their own compositions.\n\nThe famous piece One Winged Angel from Final Fantasy VII for example draws equally from the music of Stravinsky and Jimmy Hendrix according to interviews with Uematsu.\n\nLoading YouTube content\n\nEach piece of music in Final Fantasy features a strong memorable melody, which works as well with the original basic 1980s and 1990s chiptune synthesisers of early video game consoles or arranged for a full orchestra.\n\nThe main theme of the series, Prelude, originally composed by Uematsu and featured in nearly every game in the series has been recontextualised in Soken's Final Fantasy XVI piece, Land of Eikons, which moves the classic harp melody into a darker minor key.\n\nComposing with acting performance as a guide\n\nSoken, who only speaks Japanese, says his music was inspired heavily by acting performances of lead characters in the game, even though in some cases he couldn't understand what the performers were saying.\n\n\"For [Final Fantasy] XVI quite early on in the process I knew that all of the voice actors would be key and I was able to receive inspiration from the acting performances of the voice actors while writing,\" says Soken.\n\n\"I'm not very good at speaking English, so when I listen to the English voice acting, I can't really tell the details of the words but I can understand what is actually being portrayed through the performance.\n\n\"That is proof for how extraordinary their performance was and so I wanted to make the best music that I can to contribute to that game experience that was already there.\"\n\nThe concert series Distant Worlds: music from Final Fantasy was co-founded by game series composer Nobuo Uematsu and music director and conductor Arnie Roth. (Supplied: AWR Music/ Square Enix)\n\nMusic that stops the world\n\nSoken plays rock versions of his Final Fantasy music live with band The Primals, and said that he was still touched by the energy that players around the world share after playing the games and listening to his performances.\n\n\"We have Primals performances in big halls and when we play [Final Fantasy XIV musical piece] Rise, there's obviously that time-stop moment and you see tens of thousands of people stopping all together, that is brilliant to see.\"\n\n\"I really am just touched by the energy that all of the [players] have and I'm very much moved by their extraordinary energy.\"\n\nLoading YouTube content\n\n\"So I would say that what hasn't changed in all these years is that all of this is about the game experience, everyone is trying to feel the game.\"\n\n\" I think that there are aspects of music and sound that are more important than others but what I like about it is that I'm just a gamer, that's how I feel. \"\n\nSign up to the ABC Classic Newsletter",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/alex-de-minaur-madrid-open-power-outage-candles-coco-gauff/105227218",
    "title": "Coco Gauff ends her day in candlelight as power outage hits Madrid Open",
    "publish_date": "Mon, 28 Apr 2025 21:51:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alex de Minaur has been one of the millions hit by the power outage that left Spain without electricity for hours.\n\nThe Australian tennis number one was preparing to play his third round match in the Madrid Open when the lights went out across the Iberian peninsula.\n\nAfter a delay of more than four hours all play was cancelled for the day.\n\nDe Minaur was due to play Canada's Denis Shapovalov in the final match of the night session on Arantxa Sanchez Vicario court, which had just hosted Coco Gauff's 6-4, 6-2 win over Belinda Bencic when the outage occurred.\n\nGauff posted an Instagram story showing only an emergency light working in an otherwise dark locker room.\n\n\"No power where the showers are. So I'm about to take a shower and I'll let you all know how it goes,\" the American said.\n\nShe then discovered the water was off too.\n\n\"I just had to take baby wipes and wipe myself, and spray some perfume and call it a day,\" she added.\n\nGauff also posted a photo of candles being distributed.\n\nCoco Gauff's instagram story showed officials handing out candles after the power went out at the Madrid Open. (Supplied: Instagram/Coco Gauff)\n\n\"I don't think we're even going to be able to go back to the hotel because the traffic lights are out,\" Gauff said.\n\n\"It's just crazy how much we depend on electricity. It's really insane and puts it in perspective.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHaving saved a match point at 5-2 down, Briton Jacob Fearnley was serving to stay in the game at 6-4, 5-4 against Grigor Dimitrov on the main Manolo Santana court when play was suspended.\n\nThe ATP Tour said two singles matches and one doubles match were underway when power went out at 12:34 pm local time on Monday (20:24 AEST).\n\n\"The cut is preventing the use of electronic line calling systems and also left a spider cam dangling over the court inside Manolo Santana Stadium,\" the ATP added.\n\nIt later issued a statement saying play had been postponed \"for reasons beyond the control of the organisation and in order to guarantee general safety\".\n\nMatteo Arnaldi's match with Damir Dzumhur continued after a small break with manual line calling. Arnaldi, then 3-2 up in the second set, went on to win 6-3, 6-4.\n\nIn one of the few matches finished before the power cut Aussie doubles duo John Peers and Matt Ebden lost 6-4, 7-6 (7-5) to Americans Chris Harrison and Evan King.\n\nAAP/AP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/brisbane-olympics-2032-softball-baseball-push-for-inclusion/105217036",
    "title": "Softball Australia concerned Olympic dream could end after LA 2028",
    "publish_date": "Mon, 28 Apr 2025 21:30:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "One of Australia’s most successful Olympic team sports faces the prospect of being cut from the Brisbane 2032 Games, with softball administrators concerned money will outweigh legacy when deciding the sports program.\n\n“We don't have chequebooks that are deep at all, we don't even have a chequebook,” Softball Australia CEO Sarah Loh told ABC Sport.\n\nThe Brisbane 2032 Organising Committee has confirmed to the ABC that the sports selected will have to be operationally viable, with the criteria to include gender balance, global representation and popularity, and must generate revenue.\n\nBaseball-softball, considered a combined event for men and women respectively, will feature in the next Olympic Games in Los Angeles in 2028.\n\nIt’s one of five additional sports added onto the program, increasing to a total of 36 sports overall.\n\nLA 2028 will be the seventh time men's baseball and sixth time women's softball has appeared at the Games, with Tokyo the last time both sports featured after being dropped for Paris 2024.\n\nTanya Harding competed at four consecutive Olympics after softball made its debut in Atlanta in 1996, winning three bronze medals and one silver.\n\nFour-time Olympian, Tanya Harding with her Olympic medals collected during her Australian Softball career. (ABC News: Glen Mullane)\n\nShe said it would be devastating if the sport was not involved in Brisbane.\n\n\"It would make me really sad because I think that it would be such a downfall for our sport,\" she said.\n\n\"We struggle to compete with the bigger professional sports, rugby, the AFL, now that have all strong women's programs, we just don't have that presence, and we don't have the same funding.\n\n\"So if we're not in 2032 … I'm not too sure what would happen to the sport of softball post that, particularly for young girls.\"\n\nPitch for international appeal\n\nSoftball/baseball last appeared at the Olympics in Tokyo 2020. (Getty Images: Yuichi Masuda)\n\nLast month, Brisbane Organising Committee boss Andrew Liveris told the ABC in a wide-ranging interview that any sports added to the Brisbane Games needed to have a \"financial positive\" and \"it can't be criteria that's a flight of fancy.\"\n\nHe has since told ABC Sport that the committee's focus is working with bodies, including the IOC, International Paralympic Committee, sports federations and AOC, to finalise the sport program.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\n\"We've had strong interest from a range of sports wanting to be involved in our Games and I expect that interest will continue in the months ahead,\" he said.\n\n\"We look forward to our sport program taking shape and presenting it to the IOC and IPC in due course.\"\n\nLoh said she wanted to remind organisers that softball and baseball are not new Olympic sports, as they have to pitch along with dozens of other sports to be included in the program for Brisbane.\n\n\"We're working really, really hard … to demonstrate our power in growing the game and having that ability to generate revenue for Brisbane Olympics,\" she said.\n\n\"We are international sports. Baseball and softball is massive … internationally, over 137 countries play and there's billions of viewers.\n\n\"So when it comes to ticketing and the ability from the global stage, we're very confident we're actually going help deliver a really successful games.\"\n\nSoftball Australia CEO Sarah Loh. (ABC News: Glen Mullane)\n\nHowever, Loh said the pockets of the tier two sport do not run deep.\n\n\"To have chequebooks to be able to get into Olympics that just can't happen for us … we don't have that type of money,” she said.\n\n\"All we can do is present our sport of softball and baseball, as a rich traditional history that has every right to be in the Olympics.\n\n\"It's about grassroots giving young girls and boys the opportunity to play a sport that may not be football or cricket or netball or soccer.\"\n\nBaseball Australia has been working alongside its softball counterpart to ensure it stays on the program from Los Angeles to Brisbane.\n\nCEO Glenn Williams said Australia can recreate another silver medal moment like in Athens 2004.\n\nAustralia won baseball silver at the Athens 2004 Olympics. (Getty Images: Nick Laham)\n\n\"In the conversations that I continue to have there's a genuine surprise when we say we're not guaranteed of being in Brisbane,\" Williams said.\n\n\"People assume that baseball-softball will be there and we're hoping that the decision makers view that as something favourable.\n\n\"We have about 150 collegiate athletes in the US at the moment … Travis Bazzana was the number one pick in the MLB draft last year and he's from northern part of Sydney and is doing great for the Cleveland Guardians.\"\n\nBid for the 2027 Softball World Cup\n\nSoftball Australia's push to be a part of Brisbane 2032 centres around a bid to host the 2027 Softball World Cup in Brisbane – the key qualification event for the LA Olympics.\n\nIt would be the first time Australia has hosted the tournament since the inaugural event in 1965 in Melbourne.\n\nMembers of the Aussie Spirit, the national softball team, training in Brisbane. (ABC News: Glen Mullane)\n\nLoh said if the bid is unsuccessful, it will weaken Softball Australia's ability to showcase to the Brisbane Organising Committee that they are a global sport that can generate sponsorship and broadcast revenue.\n\nAdditionally, the team would likely have to travel to another country to qualify, losing home advantage and costing Softball Australia hundreds of thousands of dollars.\n\nAfter securing some funding from the Queensland State Government, Loh has pleaded with both sides of the federal government ahead of this weekend’s election.\n\n\"We're only looking for $750,000,\" she said.\n\n\"It is going to be the smallest investment that's going have the biggest impact on a small sport like us, a women's sport, to be able to grow our participation numbers and to bring the top eight countries around the world to Brisbane.\"\n\nA Government spokesperson told the ABC in a statement it has \"funded significant events on the green and gold runway and assess(es) each proposal on its merit through the Major Events Legacy Framework.\"\n\nFederal Shadow Minister for Sport Anne Rushton provided a statement saying the Coalition wants to ensure Brisbane 2032 is the \"best possible event\" by \"supporting sports which inspire young Australians and showcase our national talent to the world.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/vaibhav-suryavanshi-ipl-14-year-old-scores-maiden-century/105227164",
    "title": "14yo schoolboy hits second-fastest IPL century ever in 'dream' innings",
    "publish_date": "Mon, 28 Apr 2025 21:12:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Rajasthan Royals announced they had signed a 13-year-old for the Indian Premier League, there was plenty of scepticism.\n\nIt looked, at best, like the start of a long-term plan to lay claim to and develop a promising youngster. At worst, it looked like a gimmick.\n\nNo-one is sceptical now.\n\nIn his third match the now-14-year-old Vaibhav Suryavanshi has smashed the second fastest century in the IPL's 18 seasons, a blistering 35-ball display of pyrotechnics that carried his team to a thumping eight-wicket victory over Gujarat Titans in Jaipur.\n\nOnly \"Universe Boss\" Chris Gayle has hit a quicker IPL ton than his fellow left-hander, and \"Baby Boss\" Suryavanshi would have been close to that 30-ball display had he not played himself in with nine off his first seven balls — albeit that included a straight six off 140kph Indian Test seamer Ishant Sharma.\n\nThereafter he hit 92 off 28 balls, including ten more sixes and seven fours.\n\nA couple of boundaries were streaky, but most were hit with devastating power, with fearless clean hitting all round the wicket.\n\nHis century was brought up with a six over mid-wicket off skilled leg spinner Rashid Khan.\n\nEvery boundary was rapturously cheered by pink-clad Royals fans in the \"Pink City\".\n\nBy the time Suryavanshi was yorked for 101, Royals were well on the way to overhauling Titans' 4-209, doing so with 25 balls to spare, ending a five-match losing streak.\n\nYashasvi Jaiswal, dropped by wicketkeeper Jos Buttler on 2, made 70 not out.\n\n\"Incredible innings, one of the best I have seen,\" said Jaiswal of Suryavanshi, whose innings was made against a high-class attack of Test bowlers.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nJaiswal, who himself was hailed as a tyro when making Test and IPL centuries as a 21-year-old two years ago, added: \"I hope he will do it for us for a long time.\n\n\"I was telling him to just keep going. He just played amazing shots, he practises well, works hard in the nets. He has the game and temperament, I wish him all the luck.\"\n\n\"It was Suryavanshi's day, his hitting was tremendous and he made full use of it,\" said Shubman Gill, Gujarat's captain, who himself made 84 off 50 balls, backed up by Buttler's unbeaten 50 off 26.\n\nThe boy himself was still taking it in.\n\n\"It feels really good,\" he said.\n\n\"What I've been practising for the last three-four months, the result is showing. I don't see the ground so much, just focus on the ball.\n\n\" It is like a dream, to score a century in the IPL. \"\n\nTitans, in third with 12 points, are still well-placed to make the play-offs. Royals, in eighth with six, are unlikely to do so. Nevertheless, they have provided what will probably be the most memorable occasion of the tournament.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-04-29/mainland-australian-apples-export-china-trade-deal/105224684",
    "title": "Apple growers no longer at mercy of supermarkets with China agreement",
    "publish_date": "Mon, 28 Apr 2025 21:08:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "As global trade wars continue to escalate, apples from mainland Australia have been quietly granted access to China.\n\nThe decision is being celebrated by growers hoping to cash in on a market already worth hundreds of millions of dollars to Australian horticulture.\n\n\"It's a great, great outcome,\" Apple and Pear Australia head of government relations Jeremy Griffith said.\n\n\"Our growers will now have access to the huge China market.\"\n\nTasmanian apples have had access to the Chinese market since 2010, but apples from mainland Australia have missed out until now.\n\nThat was due to so-called technical trade barriers, which require biosecurity protocols to be in place to allow the export of fresh produce that could carry pests and diseases from one country to another.\n\nTasmania is free of fruit fly, but the mainland is not, and Australia was waiting on China to approve protocols relating to the control of fruit fly.\n\nOrchards exporting apples to China will need to be registered. (ABC Rural: Sophie Johnson)\n\nMr Griffith said the deal, which had taken years to negotiate, had now been done.\n\n\"That's all been agreed to between our government and the Chinese government,\" he said.\n\n\"Orchards need to be registered, there needs to be cold treatment [of fruit], so hopefully everything will be ready to go for the 2026 harvest.\"\n\nA Department of Agriculture, Fisheries and Forestry spokesperson confirmed the government had secured technical market access protocols for mainland apples to be sent to China.\n\n\"This will be beneficial to Australian apple farmers looking to enter new trade markets,\" the spokesperson said.\n\n\" We will continue to work with our apple industry to support their ability to meet the protocol requirements. \"\n\nThe announcement comes after 10 Australian abattoirs were this week given the ability to export Australian sheep and goat meat into the lucrative Chinese market.\n\nMarket access worth millions\n\nAccording to the Australian Fresh Produce Alliance (AFPA), which represents a large network of the horticulture industry, China bought $380 million worth of Australian fruit and vegetables in 2024 alone.\n\nAFPA chief executive Claire McClelland said it was yet another opportunity for Australian agriculture to improve its relationship with one of its biggest buyers.\n\n\"Securing access to China for Australian apples is a significant achievement for the sector and provides an important new opportunity for growers,\" she said.\n\n\"This announcement highlights the value of stable, two-way trade with China and the importance of continuing to strengthen that relationship for the benefit of both countries.\"\n\nNinety per cent of Australian apples are grown on the mainland. (ABC News: Tim Lee)\n\nStability for struggling growers\n\nNinety per cent of Australian apples are grown on the mainland, and the industry has lacked lucrative export markets for decades.\n\nMr Griffith said that had left growers at the mercy of supermarkets.\n\n\"Australian growers are very reliant on the domestic market, which is 66 per cent controlled by Coles and Woolworths, so we've been very much exposed to two buyers,\" he said.\n\n\"There has been a lot of pressure on Australian growers with increasing costs and that inability to pass those costs on to supermarkets because of their buying power.\n\n\" The opportunity to find an alternative market is a huge opportunity for the industry. \"\n\nThe Coalition has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-29/how-polling-can-mislead/105214486",
    "title": "How to spot political polls that don't stack up",
    "publish_date": "Mon, 28 Apr 2025 21:05:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians are being targeted with misleading claims originating from bias or poorly constructed polls and surveys.\n\nNot all polls are scientific or accurate. Sometimes, what politicians say about them is even less so.\n\nABC NEWS Verify takes a tour of some of the ways polling can influence or mislead voters, with questions you can ask yourself about polls to avoid getting fooled.\n\n1. Who is being sampled?\n\nLabor is seeking to use Peter Dutton’s time as health minister, from 2013 to 2014, against him.\n\nAcross countless soundbites and ads from the party, Labor is claiming that Australian doctors voted Mr Dutton as the worst health minister in decades.\n\nThe claim has been made across many platforms, including social media. (Facebook: Australian Labor Party)\n\nBut does that stack up?\n\nThe claim comes from an online survey conducted a decade ago by a publication called Australian Doctor, shortly after Mr Dutton left the role of health minister — a period which included introducing a controversial policy for a GP co-payment.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nThe online survey pitted Mr Dutton against nine former health ministers from both parties, and asked: “Who has been the worst federal health minister in recent memory?”\n\nForty-six per cent of respondents put Mr Dutton as their answer.\n\nContact Hidden Campaign Photo shows A designed image showing an eye, a ballot paper and ballot box, pencil and social media like, love and angry symbols. During the federal election, ABC NEWS will be shining a light on the hidden campaign, revealing how you're being targeted, why and by whom, and we need your help.\n\nAs the publication’s editor Paul Smith wrote this year, the survey was conducted in 2015 – meaning it doesn’t include subsequent health ministers like the Coalition’s Sussan Ley and Greg Hunt, or the incumbent Mark Butler\n\nHe wrote the poll ran for 24 hours and had a sample of only 1,077 respondents drawn from the publication’s readership.\n\nAt the time, the publication itself had a total readership of around 20,000.\n\nElection analyst Kevin Bonham told ABC NEWS Verify the survey “sounds like it's an opt-in poll where it's just taking whoever actually responds”.\n\nAsked whether it was misleading to use the findings of the poll to suggest this was representative of Australian doctors, a spokeswoman for the Labor Party didn't directly answer the question.\n\nSo without running a scientific poll today, it’s impossible to know whether such a large proportion of doctors would consider Mr Dutton in the same light as Labor’s claim.\n\n2. Is the survey omitting results?\n\nIn February, Trumpet of Patriots chairman Clive Palmer claimed polling showed Australian support for ‘Trump-like’ policies.\n\nThe media release omitted the percentage of respondents who said no. (Supplied: Trumpet of Patriots)\n\nMr Palmer used the results to launch his new party during a press conference on February 19.\n\n“Australia needs Trump policies. Australians want them as the opinion polls have shown us,” he said.\n\nThe claim has also been used in YouTube ads run by the Trumpet of Patriots featuring Mr Palmer’s press conference.\n\nBut despite the assertion that Australians want ‘Trump-like’ policies, is this really what the poll results showed?\n\nA closer look at the actual polling results, linked at the bottom of a press release, shows more people said they don’t want Trump-like policies, than those who said they did.\n\nWould you vote for a party with Trump-like policies?\n\nBrisbane: 34% Yes, 18% Unsure, 48% No\n\nSydney: 25% Yes, 20% Unsure, 55% No\n\nMelbourne: 29% Yes, 20% Unsure, 52% No\n\nAdelaide: 26% Yes, 19% Unsure, 55% No\n\n\"The poll only shows that a small proportion of voters say that they would support a party with Trump like policies,” said Dr Bonham.\n\nHe also pointed out that the wording of the question doesn’t indicate whether those voters interested in Trump-like policies would vote for Trumpet of Patriots ahead of other parties with similar views.\n\n3. Does the poll contain leading questions?\n\nA poll heard by ABC NEWS Verify contained a leading question about independent MP Sophie Scamps. (ABC News: Matt Roberts)\n\nSometimes, it’s not the results of a poll that can influence voters, but the poll itself.\n\nSome polls contain leading questions. While they may still be used to gather data, they might also influence respondents to vote a certain way.\n\nABC NEWS Verify has heard a recording of a poll targeting voters in Sydney’s Mackellar electorate, held by independent Climate 200-backed MP, Dr Sophie Scamps.\n\nIt describes her in a favourable light – highlighting her achievements in the medical profession, and in parliament.\n\n“Dr Sophie Scamps has spent her first term in parliament as an independent fighting for cost-of-living relief, better economic management, stronger climate policy and honest politics. Prior to being elected she was a GP in Narrabeen and an emergency room doctor in our local hospitals. Knowing this about Dr Sophie Scamps, if a federal election were held today, who would receive your first preference vote?” the survey asked, after demographic and other voting questions.\n\nLoading...\n\nOther candidates in the poll were mentioned in name only.\n\nClimate 200 has confirmed it commissioned the poll, describing it as \"standard message testing\".\n\nDr Bonham questioned the usefulness of what he referred to as “aided questions” in research, “because they capture the support for the candidate in an environment where the voter has heard only good things”.\n\n“It's hard to avoid suspecting that an advantage of this kind of polling is that it gets … positive claims about candidates out there in the community and it’s a kind of advertising designed to work by word-of-mouth,” he said.\n\n4. Have you been served a push poll?\n\nSeparately, there have also been allegations of so-called ‘push-polling’ mobilised against independent Climate 200-backed candidates in other seats, such as Goldstein in Melbourne and Wentworth in Sydney.\n\nFollow the latest election news Photo shows ABC News Radio logo and the ABC Listen logo below it on a light blue background. Hear the latest election news as it happens on the Election Central Playlist. Only on the ABC listen app.\n\nPush polls contain loaded questions, and are designed to influence rather than genuinely survey voters.\n\nABC NEWS Verify has seen a poll featuring independent MP Allegra Spender, which was reportedly sent to voters in Sydney’s Wentworth electorate. The questions were geared towards attacking her.\n\n“Allegra Spender is a Teal MP and receives significant funding from Simon Holmes à Court, a billionaire investor. Some people are concerned this makes her, and other Teals, less independent. Do you agree or disagree?” the survey asked.\n\nVoters received the poll via text message. (Supplied)\n\nThe net worth of Mr Holmes à Court, the convener of Climate 200, is not clear, but he does not appear as a billionaire on either the Australian Financial Review’s or The Australian’s most recent rich lists.\n\nThese questions only appeared when the respondent selected the Climate 200-backed candidates as their voting preference.\n\nSelecting any other candidate resulted in the survey abruptly ending.\n\n“I do have concerns, from what we've heard, this may actually be a push poll,” said Dr Bonham.\n\nIn March, the Guardian reported that a Liberal Party spokesperson told the publication the party had \"nothing to do\" with the surveys.\n\nThe survey was sent to voters via text – and attributed to \"Intelligent Dialogue\".\n\nCoalition pollster working with 'astroturfing' gas group Photo shows Two men and a woman enjoy a barbecue on the verandah or a home in the country. The Coalition's internal pollster is helping orchestrate a campaign to boost public support for the gas industry ahead of the federal election.\n\nThat company is not registered with the Australian Polling Council, a voluntary industry body which requires members to transparently publish their methodologies.\n\nABC NEWS Verify found a UK customer service company with the same name, but it said it “had no business connections in Australia” when contacted.\n\nDr Bonham was also unfamiliar with the survey company.\n\n\"There’s no evidence that it’s a real pollster of any kind whatsoever,\" he said.\n\nIf you come across any surveys or polls that you have your doubts about this election, check the source and the language used.\n\nAnd, share it with the ABC NEWS Verify team so we can investigate.\n\nThe ABC is on the hunt for any misinformation or disinformation circulating in the lead-up to the federal election. Send us a tip by filling out the form below, or if you require more secure communication, select an option from our confidential tips page.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/world/four-dead-after-car-crashes-into-after-school-camp-in-usa-20250429-p5lv2b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Four dead after car crashes into after-school camp in USA",
    "publish_date": "Tue, 29 Apr 2025 11:53:29 +1000",
    "category": "finance",
    "authors": [],
    "text": "Four dead after car crashes into after-school camp in USA\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/thousands-of-australians-banking-details-stolen-20250429-p5lv2c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Thousands of Australians' banking details stolen",
    "publish_date": "Tue, 29 Apr 2025 11:53:29 +1000",
    "category": "finance",
    "authors": [],
    "text": "Thousands of Australians' banking details stolen\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/nsw/the-battle-of-barbecues-and-blocked-views-2b-sydney-tower-faces-fresh-fight-20250428-p5luuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The battle of barbecues and blocked views: $2b Sydney tower faces fresh fight",
    "publish_date": "Tue, 29 Apr 2025 11:48:47 +1000",
    "category": "finance",
    "authors": [
      "Megan Gorrey"
    ],
    "text": "The divisive $2 billion tower reshaping Darling Harbour is facing fresh resistance after residents of nearby apartments complained about blocked water views and noise from rooftop bars and events.\n\nMirvac submitted a $63.5 million plan to develop the public spaces around the 42-storey luxury apartment block rising from the rubble of the bulldozed Harbourside Shopping Centre.\n\nMirvac is pursuing the next stage of planning approvals for its divisive $2 billion Harbourside redevelopment. Credit: Mirvac\n\nThe Department of Planning, Housing and Infrastructure has backed the proposal, arguing improved parks and public areas would help revitalise Darling Harbour and foster a “lively and engaging city”.\n\nBut the plan for the waterfront garden, promenade and pedestrian bridges attracted more than 50 negative submissions, which means it has been referred to the Independent Planning Commission.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/afl/blues-star-banned-for-whack-20250429-p5lv22.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blues star banned for whack",
    "publish_date": "Tue, 29 Apr 2025 11:44:19 +1000",
    "category": "finance",
    "authors": [],
    "text": "Blues star banned for whack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/around-the-clubs-nrl-round-9-20250429-p5lv01.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dragons wield the axe after Anzac Day debacle",
    "publish_date": "Tue, 29 Apr 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Promising playmaker Lyhkan King-Togia is poised to replace the axed Lachlan Ilias, and it’s unlikely to be the only change in the St George Illawarra line-up.\n\nDespite scoring a slashing try in the Anzac Day loss to the Roosters, Dragons winger Sione Finau is poised to be another casualty for Saturday’s clash with Wests Tigers. Corey Allan, who made one State of Origin appearance for the Maroons in 2020, is tipped to make his Dragons debut after overcoming an ACL injury that wiped out his entire 2024 season.\n\nKing-Togia has made four NRL appearances to date and recently signed a contract extension that will result in him progressing to the club’s top-30 squads for the 2026 and 2027 seasons.\n\nOnce the decision was made to drop Ilias, coach Shane Flanagan pondered whether to promote King-Togia or his NSW Cup halves partner Jonah Glover. Ultimately, King-Togia won the race to partner Kyle Flanagan in the halves.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/markets/trade-worries-and-tech-stocks-to-play-on-asx-s-open-20250429-p5luxv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX opens higher after late buying surge on Wall Street",
    "publish_date": "Tue, 29 Apr 2025 11:12:31 +1000",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "On Wall Street overnight, stocks drifted to a mixed finish on Monday, ahead of potential flashpoints later this week that could bring more sharp swings for financial markets. The S&P 500 inched up by 0.1 per cent to extend its winning streak to a fifth day. The Dow Jones Industrial Average added 0.3 per cent, while the Nasdaq composite slipped 0.1 per cent.\n\nEndeavour shares rose 0.5 per cent. The retailer and hotel owner, which runs the bottle shop chains Dan Murphy’s and BWS, said this morning that former Virgin chief executive Jayne Hrdlicka will become its new boss from January 1, with executive chairman Ari Mervis continuing in his role until then.\n\nAustralia’s biggest oil and gas producer, Woodside, edged up 0.1 per cent after making its final investment decision on a $17.5 billion ($27.4 billion) liquefied natural gas export project in the US, cementing its position as a top supplier of the fuel. The approval clears the way for large-scale construction of the Louisiana LNG export plant, which is targeting its first shipment in 2029, Woodside said.\n\nThe relative lull in trading offered a respite from the sharp, historic swings that have rocked markets for weeks, as hopes rose and fell that President Donald Trump may back down on his trade war. Many investors believe Trump’s tariffs could cause a recession if left unaltered. Coming into Monday, the S&P 500 had roughly halved its drop that had taken it nearly 20 per cent below its record set earlier this year.\n\nYet with a jittery April near its close, several market pros see little reason to think volatility is in the rearview mirror. For sharemarkets to keep rising, investors would need to see Donald Trump’s White House follow through on the “dovish pivot” toward trade with China, according to Chris Larkin at E*Trade from Morgan Stanley.\n\nMixed trading for some influential tech stocks ahead of their earnings reports this week pulled the S&P 500 back and forth between modest gains and losses for much of the session overnight.\n\nAmazon fell 0.7 per cent, Microsoft dipped 0.2 per cent, Meta Platforms added 0.4 per cent, and Apple rose 0.4 per cent. All are set to report their latest result this week, and they’re some of Wall Street’s most influential companies because they’ve grown to become some of the biggest in terms of size, by far. That gives their movements extra weight on the S&P 500 and other indexes.\n\nOutside of big tech, executives from Caterpillar, ExxonMobil, and McDonald’s may also offer clues this week about how they’re seeing economic conditions play out. Several companies across various industries have already slashed their estimates for upcoming profits or pulled their forecasts entirely due to uncertainty about what will happen with Trump’s tariffs.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/casey-council-clamping-down-on-record-number-of-illegal-corflutes-20250429-p5lv1m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Casey Council clamping down on record number of illegal corflutes",
    "publish_date": "Tue, 29 Apr 2025 11:12:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Casey Council clamping down on record number of illegal corflutes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/afl/blues-make-call-on-cerra-s-suspension-20250429-p5lv0z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blues make call on Cerra’s suspension",
    "publish_date": "Tue, 29 Apr 2025 11:04:14 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Carlton will challenge Adam Cerra’s suspension in a bid to have him free for the Blues’ important clash with Adelaide on Saturday.\n\nThe in-form Cerra was given a one-match ban for striking Jack Bowes in the Blues’ victory over Geelong on Sunday. The hit was graded as intentional, low impact and high contact.\n\nTo overturn the ban, the Blues will need to convince the tribunal the strike should have been assessed as careless rather than intentional or that the contact was made to the body and not high. Either scenario would result in a fine.\n\nThe Blues have had considerable success in appealing bans over the last four seasons, headlined by the famous Patrick Cripps case in 2022 which cleared the way for the Blues captain to win that year’s Brownlow Medal.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/money/super-and-retirement/the-myth-of-the-self-funded-retiree-why-we-need-urgent-tax-reform-20250429-p5lv03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The myth of the self-funded retiree: Why we need urgent tax reform",
    "publish_date": "Tue, 29 Apr 2025 11:04:07 +1000",
    "category": "finance",
    "authors": [
      "Thomas Walker"
    ],
    "text": "A few months back, I wrote about how inheritances and parental gifts are turbocharging inequality. I suggested we introduce a modest inheritance and gifts tax, which would raise money to invest in younger Australians and ensure a good start in life for all.\n\nWhile I received some great support, there was significant pushback. One common complaint from people with wealth was some variation of, “I have worked hard and built my own wealth while paying lots of tax. Why should I pay more? It’s unfair”.\n\nOlder generations naturally control much of our nation’s wealth and political power. Credit: Dominic Lorrimer\n\nHowever, what many wealthy Australians don’t seem to realise is that their wealth has grown with considerable taxpayer support. In recent decades, both major political parties have introduced or maintained tax concessions for private wealth accumulation, including the capital gains tax discount, preferential treatment of superannuation, and deductions for property investors.\n\nThese concessions together cost the budget over $100 billion annually and continue to grow. That’s nearly double what the federal government spends on education.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/politics/federal/pm-treasurer-challenged-on-aaa-credit-rating-risk-20250429-p5lv17.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM, treasurer challenged on AAA credit rating risk",
    "publish_date": "Tue, 29 Apr 2025 10:45:06 +1000",
    "category": "finance",
    "authors": [],
    "text": "PM, treasurer challenged on AAA credit rating risk\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/afl/race-for-longmire-kicks-off-20250429-p5lv13.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Race for Longmire kicks off",
    "publish_date": "Tue, 29 Apr 2025 10:34:26 +1000",
    "category": "finance",
    "authors": [],
    "text": "Race for Longmire kicks off\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/national/drone-footage-shows-monster-great-white-near-sa-marina-20250429-p5lv0x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Drone footage shows monster great white near SA marina",
    "publish_date": "Tue, 29 Apr 2025 10:29:00 +1000",
    "category": "finance",
    "authors": [],
    "text": "Drone footage shows monster great white near SA marina\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/national/peter-duttons-office-vandalised-in-queensland-20250429-p5lv10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Peter Dutton's office vandalised in Queensland",
    "publish_date": "Tue, 29 Apr 2025 10:28:39 +1000",
    "category": "finance",
    "authors": [],
    "text": "Peter Dutton's office vandalised in Queensland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/trumpet-of-patriots-texts/vsqj4l75x",
    "title": "Trumpet of Patriots spam texts: Why are you receiving them, and are they legal?",
    "publish_date": "Tue, 29 Apr 2025 01:08:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "If you have been receiving text messages from the Trumpet of Patriots party — despite never signing up to a mailing list — you are not alone.\n\n\n\n\n\nIn the weeks leading up to the federal election , many voters have been sent an influx of text messages listing the party's key policies and linking to a promotional video.\n\n\n\n\n\n\"Solve housing fast trains 20 min CBD cheaper land. Super for deposit 3% interest, cut immigration by 80%,\" one message reads.\n\n\n\n\n\n\"Double fees for foreign students. Free education for Australians. Forgive loans Vote1 Trumpet of Patriots,\" another says.\n\n\n\n\n\nThe messages are authorised by Trumpet of Patriots candidate Harold Fong, and have sparked criticism and anger among recipients, with many questioning whether this type of campaigning is legal.\n\n\n\nIs it legal for political parties to send spam texts?\n\nYes, it is legal for political parties to send you unsolicited text messages.\n\n\n\n\n\nACMA (the Australian Communications and Media Authority) regulates spam text messages in Australia under the Spam Act 2003.\n\n\n\nREAD MORE The 24-year-old rule that lets politicians use your data however they want\n\nUnder the Spam Act, anybody who plans to send marketing messages or emails must have consent from the person who will receive them. The messages must always identify the sender, contain the sender's contact details, and make it easy to unsubscribe.\n\n\n\n\n\nBut political parties are exempt from the Spam Act and the Do Not Call Register, meaning they are allowed to send unsolicited text messages without an opt-out option.\n\n\n\nCan you unsubscribe from political text messages?\n\nThe messages being sent by the Trumpet of Patriots do not include an opt-out option, meaning you cannot unsubscribe.\n\n\n\n\n\nMany recipients have tried responding to the text with requests to stop the messages, but these replies fail to send.\n\n\n\nRecipients cannot reply to the Trumpet of Patriots texts. Source: SBS News Some have tried blocking the number, but this is not guaranteed to work because the messages are not coming from a real phone number.\n\n\n\nHow did Trumpet of Patriots get my number?\n\nThe Australian Electoral Commission told SBS it does not supply political parties with voters' mobile phone numbers.\n\n\n\n\n\nPolitical parties may have accessed mobile phone numbers through a marketing agency, which could have obtained your number through online databases. Parties or marketing agencies might also use random number generators when sending out bulk messages, so receiving them can be by chance.\n\n\n\n\n\nSBS News has contacted the Trumpet of Patriots party for comment.\n\n\n\nWhat is the Trumpet of Patriots party?\n\nThe Trumpet of Patriots party is run by mining magnate Clive Palmer , who previously ran the United Australia Party.\n\n\n\n\n\nAccording to the party's website, the Trumpet of Patriots is focused on \"democracy, individual freedoms, free speech, reducing government intrusion in our lives, breaking the duopoly, real choice and real liberty\".\n\n\n\n\n\nThe party's policies include launching an investigation into government spending, cutting immigration, establishing high-speed rail networks, exiting the Paris Agreement, getting the 'woke agenda' out of schools, and exiting the World Health Organization, United Nations and World Economic Forum.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/african-student-performers-denied-entry-into-australia/vdapvihle",
    "title": "'What does this say about Australia?' African student performers' visas refused",
    "publish_date": "Mon, 28 Apr 2025 19:31:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "A group of 14 young Ugandan and Kenyan performers who were scheduled to arrive in Australia have been refused entry, forcing the cancellation of their cultural charity tour.\n\n\n\n\n\nThe group was set to perform as part of the Ubuntu Africa Tour organised by KwaYa Australia, a not-for-profit organisation that fosters cultural exchange and education for Ugandan children through music and outreach.\n\n\n\n\n\nKwaYa Australia had planned an eight-week schedule of events aimed at promoting cultural understanding and raising funds for African youth programs. It has previously run five national tours successfully under the same initiative.\n\n\n\n\n\nThey were due to leave Africa for Australia this Friday.\n\n\n\nDreams dashed as visa refusals force tour cancellation\n\nThe performers had applied for the GG-408 Entertainment Activity Visa under the Cultural Subclass, designed to support programs that promote international cultural exchange.\n\n\n\n\n\nHowever, all 14 applications were refused by the Department of Home Affairs, citing concerns under Clause 408.213 — specifically, that the applicant 'genuinely intends to stay in Australia temporarily to carry out the activity for which the visa is granted'.\n\n\n\n\n\nSBS News has seen the letters of rejection issued to multiple members of the group by the Department of Home Affairs.\n\n\n\n\n\nSBS has contacted the department but had not received a response at the time of writing.\n\n\n\nREAD MORE Questions over extended wait times for parent visa applicants\n\nOne of the key criteria for assessment is whether the applicants have previously travelled to Australia, complied with visa conditions, and provided sufficient evidence of their genuine intention to stay temporarily as entertainers.\n\n\n\n\n\nMarsha Gusti, president and founder of KwaYa Australia, said the decision has devastating consequences not only for the young performers but also for their charity partners and supporters in Australia.\n\n\n\n\n\nIn a letter to Home Affairs Minister Tony Burke appealing the decision, she wrote: \"Are we now saying that only those who have already entered Australia can be trusted, while first-time visitors, no matter how strong their evidence, cannot?\"\n\n\n\n\n\n\"If this precedent holds, then we are effectively closing the door permanently on cultural exchange with new African participants.\"\n\n\n\nREAD MORE Coalition to cut international student numbers by 80,000, raise visa application fees\n\nIf this precedent holds, we are effectively closing the door permanently on cultural exchange. Marsha Gusti, president and founder of KwaYa Australia\n\nThe group estimates that cancelling the tour will result in an $80,000 direct financial loss, with up to $600,000 in potential sponsorship and fundraising opportunities now in jeopardy.\n\n\n\n\n\nGusti said she was \"absolutely flummoxed\" by the decision, questioning what message it sends about Australia's reputation on the world stage.\n\n\n\n\n\n\"The Ubuntu Africa program just sent a bunch of kids over to the UK. They travelled for two months and were celebrated all across the UK ... they were first-time travellers just as ours were,\" Gusti said.\n\n\n\n\n\n\"Are we now not welcoming cultural performers? Do they have to have been here twice? And how do they get to be here twice if they're not allowed here once?\"\n\n\n\n\n\nGusti also questioned whether the same decision would have been made if the group were a sports team, asking: \"Is this a cultural thing?\"\n\n\n\nFaith Nasande says she hopes the government will reconsider their decision. Source: Supplied\n\nHope remains as performers appeal for a second chance\n\nAdding to the confusion, three of the performers, including choir conductor Faith Nasande, had previously been approved to travel to Australia in 2020 as part of an earlier tour.\n\n\n\n\n\nHowever, their trip was cancelled due to COVID-19 border closures.\n\n\n\n\n\nKwaYa Australia said it was particularly disheartening that students who had once been granted visas were now being refused.\n\n\n\n\n\nSpeaking from Kampala, Uganda, Nasande told SBS that while she understood the government's decision, she hoped that it would be reconsidered given her previous approval.\n\n\n\n\n\n\"Hopefully if things go well, I'll be able to meet you guys in Australia officially. I think you're amazing people. I've known you to be amazing people from the different people I've met here in Africa, that have been to Australia before,\" she said.\n\n\n\n\n\n\"I would request the government to just give us another chance to allow us to come share our beauty, our culture and everything. And before they know it, we shall be back to Africa.\"\n\n\n\nAlso speaking from Uganda, program manager Barnett Twesigome said the choir had been in rehearsals for two months, and that while visa applications were submitted three months ago, the government's decision came only a few days out from their flight, which is due to leave this Friday.\n\n\n\n\n\n\"The [Australian] government has been good to us so far. I will just wait for the response of the appeal, but I know they are trying to protect people from immigrating there and I know any country could easily do that,\" he said.\n\n\n\n\n\n\"But I just want them to know that we are not that kind of people. We are a very well-established organisation and we don't want to jeopardise anything.\n\n\n\n\n\n\"Ubuntu means togetherness. So togetherness regardless of where you come from or regardless of which continent you are at. So we are together and that's what we continue to emphasise.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/video/african-performers-denied-entry-to-australia/dgcazwaig",
    "title": "African performers denied entry to Australia",
    "publish_date": "Mon, 28 Apr 2025 10:48:08 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "African performers denied entry to Australia\n\nPublished 28 April 2025, 10:28 am\n\nA group of performers from Uganda and Kenya have been left searching for answers after they were refused visas to tour Australia. The show has travelled around the country on two other occasions, with different performers. This would be the first trip to Australia for this year’s tour group, but organisers say no previous performers have overstayed their visas in the past.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/video/new-medication-for-treatment-resistant-depression-added-to-pbs/ahj0sjb1p",
    "title": "New medication for treatment resistant depression added to PBS",
    "publish_date": "Mon, 28 Apr 2025 10:37:50 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "New medication for treatment resistant depression added to PBS\n\nPublished 28 April 2025, 9:07 am\n\nA new nasal spray treatment for depression has been added to the Pharmaceutical Benefits Scheme. The drug called esketamine is the first new depression medication to be subsidised by the federal government in 30 years. But experts say more needs to be done to increase accessibility.",
    "source": "SBS",
    "cluster_id": 4
  },
  {
    "url": "https://www.sbs.com.au/news/video/major-parties-promise-to-boost-tradie-numbers-but-will-it-be-enough-to-ease-the-housing-crisis/6j355k454",
    "title": "Major parties promise to boost tradie numbers but will it be enough to ease the housing crisis?",
    "publish_date": "Mon, 28 Apr 2025 10:31:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Major parties promise to boost tradie numbers but will it be enough to ease the housing crisis?\n\nPublished 28 April 2025, 9:04 am\n\n: During the election campaign, both major parties have announced plans to boost tradie numbers in Australia to help increase the supply of new homes. Builders have welcomed the move to fast-track qualifications but say there still won't be enough workers to build more than one million new homes that have been promised in the next five years without skilled labour from overseas.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/video/vietnam-war-veterans-reflect-on-escape-to-australia-and-legacy-of-saigons-fall-50-years-on/1wcysp4pz",
    "title": "Vietnam War veterans reflect on escape to Australia and legacy of Saigon's Fall, 50 years on",
    "publish_date": "Mon, 28 Apr 2025 09:32:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/flight-centres-one-piece-of-advice-for-travellers-to-the-us-accc-on-card-surcharge-watch/o1l5enbfp",
    "title": "Flight Centre's one piece of advice for travellers to the US & ACCC on card surcharge watch",
    "publish_date": "Mon, 28 Apr 2025 08:21:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/both-major-parties-announce-plans-to-boost-tradie-numbers-but-will-it-fix-the-housing-shortage/hdvaij0u4",
    "title": "Both major parties announce plans to boost tradie numbers, but will it fix the housing shortage?",
    "publish_date": "Mon, 28 Apr 2025 07:29:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPolitical promises to build tens of thousands of new homes have left Melbourne architect Bruce Allen sceptical.\n\n\n\n\n\n\"I just cannot understand how they think we can build that many houses in the short time available. Even if we imported migrant, skilled Labor, it takes a while for that to happen.\"\n\n\n\n\n\nHe says the shortage of skilled tradies like; carpenters, glaziers, plumbers and electricians is already causing delays to building projects and pushing up property prices in Victoria.\n\n\n\n\n\n\"This is the worst situation that I've come across and I've been in my own practice for 50 years. So we've had a history in Australia of benefiting from migrant construction workers... But those people now, from actually applying to move here, there is the delay, the delayed process of going through the visa application process, and then going through the accreditation that's required once they get here.\"\n\n\n\n\n\nThe Master Builders Association says 130 thousand extra workers are needed across the country.\n\n\n\n\n\nThe building Industry lobby group says Australia’s immigration and visa system is failing to attract skilled tradies or allow those already here, to work.\n\n\n\n\n\nMaster Builders South Australia CEO Will Frogley, says many skilled tradies are already here.\n\n\n\n\n\n\"A lot of them are already here, they might have a background working in construction in their home countries but they might be driving ubers or stacking shelves or working at a supermarket or petrol station - we'd like to get them working in our industry because it is causing delays the lack of labour. Also, employers are being forced to use people they perhaps wouldn't want to use, because there's not enough people around.\"\n\n\n\n\n\nThe South Australian branch has set up its own agency to help migrants find work, overcome skill gaps and gain employment in the building sector.\n\n\n\n\n\nThe program has identified a potential local workforce of 700 international student graduates and 90 skilled migrants on permanent visas.\n\n\n\n\n\nNishriti Shetty is one of the first participants to gain employment - as a surveyor.\n\n\n\n\n\n\"I've got three years of experience in India but that would get discounted here because it's not Australian experience, that is where I really struggled, but I think most of my skills actually come from my Indian experience. So, that kind of unconditional, or subconscious bias, didn't help me get a job.\"\n\n\n\n\n\nAbdul Rivzi is a former immigration official.\n\n\n\n\n\nHe says the skilled visa process can work against would-be migrants.\n\n\n\n\n\n\"Most of the people who are skilled say carpenters, joiners, bricklayers etc from outside western nations will tend to not have the English language requirements to enter Australia. How you address that is not easy but that is the big challenge in terms of attracting more constructions tradies from overseas.\"\n\n\n\n\n\nIt's not clear if Labor's program to fast track 6000 tradies will be open to visa holders.\n\n\n\n\n\nThe coalition says it will fast track skilled visas for construction workers, but hasn't detailed how.\n\n\n\n\n\nDuring the campaign both parties have shied away from the debate around the details of skilled migration, instead spruiking smaller net migration targets and caps on international students.\n\n\n\n\n\n\"Both major parties have been at fault in terms of dressing these issues and yet the finger pointing is all we get, there's not details on what they are actually going to do.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/life-changing-ketamine-derived-depression-treatment-to-become-more-affordable-for-australians/p4m39c092",
    "title": "'Life-changing' ketamine-derived depression treatment to become more affordable for Australians",
    "publish_date": "Mon, 28 Apr 2025 07:23:14 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSamuel Hockey is 29 years old and has experienced treatment-resistant depression.\n\n\n\n\n\nHe compares living with the condition to having a flu that lasts for months.\n\n\n\n\n\n\"You feel lethargic. Your body feels fatigued and actually sort of aches. You might lose weight because you're not eating. You feel headachey, you feel overall sluggish and you just can't move from where you are.\"\n\n\n\n\n\nAround a third of people diagnosed with depression continue to experience symptoms despite trying multiple medications.\n\n\n\n\n\nSamuel says he felt incredibly disappointed after years of looking for different treatments.\n\n\n\n\n\n\"Trialling different medications and different sort of therapies and treatments, nothing was really sticking and nothing -- it might improve slightly but then it would plateau or it would slide back and for me personally you just felt incredibly disheartened.\"\n\n\n\n\n\nHowever, a new drug is bringing hope and from Thursday, it will be made will be made more affordable for up to 30,000 Australians through the Pharmaceutical Benefits Scheme.\n\n\n\n\n\nThe medication is Spravato, known chemically as esketamine and it's a chemical cousin of ketamine, which is used as a powerful anaesthetic as well as an illicit recreational drug.\n\n\n\n\n\nSamuel has been one of a small number of patients who have been using the medication under a special access scheme and currently takes the drug once a fortnight.\n\n\n\n\n\nHe says it has been life-changing.\n\n\n\n\n\n\"For me it knocks out half a day but I sort of wouldn't even see it as knocking out half a day, it's sort of a half a day of investment in the next 14 days of wellness and being able to show up for work on time, complete tasks, interact socially, get out and experience the sun, you know all those tiny daily tasks that you often take for granted when things are going smoothly.\"\n\n\n\n\n\nThe listing of the drug is the first new government-backed initiative to treat depression in decades.\n\n\n\n\n\nIt will reduce the cost of Spravato from around $800 for a single dose to $31.60 or $7.70 for pensioners and concession card holders.\n\n\n\n\n\nMinister for Health and Aged Care Mark Butler says the listing would make the novel drug more affordable and improve quality of life for thousands of Australians.\n\n\n\n\n\nProfessor Ian Hickie, co-director of Health and Policy at the University of Sydney's Brain and Mind Centre, says it's a positive step for many people living with depression, which can have broad and serious impacts on a person's life.\n\n\n\n\n\n\"Severe depression interferes with a person's capacity to live their life. Whether that's in education, whether that's in training, whether that's in employment. So, the productivity costs associated with depression, the productivity losses, are very significant. Additionally the impact on people's relationships is high. And of course what we also see are complications -- drug and alcohol abuse, other sets of problems medically and then of course we have the risk of suicide and self harm. So, we lose lives prematurely through physical health complications and through suicide, accident and injury.\"\n\n\n\n\n\nProfessor Hickie says there have been few pharmaceutical innovations for depression in recent years but Spravoto works very differently to other antidepressants.\n\n\n\n\n\n\"Largely, in fact over the last 60 years, most antidepressants have focused on one of the common monoamines: serotonin, noradrenaline, dopamine. This has a different chemical target: glutamate in the brain, so it's different and it's the first drug to be supported by the PBS that is fundamentally different from all of those other compounds, which have focused on the traditional monoamines.\"\n\n\n\n\n\nWhile other antidepressants may take weeks or months to work, Spravato is fast-acting.\n\n\n\n\n\nMany leading psychiatrists and researchers have been advocating for the government subsidy for esketamine for several years.\n\n\n\n\n\nProfessor Colleen Loo from the Black Dog Institute says there has been mounting evidence for ketamine's treatment of severe depression for around two decades.\n\n\n\n\n\n\"One of the early studies coming out of the US, so they showed that even people who had trialled four or more medications and for some people, even electroconvulsive therapy, which up to that point and up to now has really been the gold-standard treatment for severe and treatement-resistant depression and suicidality, that even for people who had failed to get better with all of those treatments, something like about half of people were getting a good response to ketamine.\"\n\n\n\n\n\nProfessor Loo says one way ketamine appears to work is by allowing people with depression to break out of thought patterns.\n\n\n\n\n\n\"It causes a profound change in your brain function at a whole of brain level. A simple analogy of this has been like rebooting a computer. We do know that when people are depressed, many people will say 'It's like my brain has become stuck, like a broken record.'\"\n\n\n\n\n\nWhile other psychedelic drugs such as psilocybin or magic mushrooms and MDMA, otherwise known as ecstasy, can have similar effects, Professor Loo says ketamine and esketamine are easier for many patients to take because they don't require patients to come off other medications before using them.\n\n\n\n\n\nWhile the cost of Spravato itself has now been significantly reduced, there are still significant costs associated with the administration of the medication.\n\n\n\n\n\nProfessor Loo says administration of the drug requires a team of practitioners and around two hours in a clinic.\n\n\n\n\n\n\"That's the big part of the equation that still makes ketamine difficult to afford for many people. We've already had an affordable drug -- the generic version, the PBS now brings the other formulation of ketamine into the affordable range but for both forms of ketamine, the clinic treatment costs haven't been covered by the government. What we really need is Medicare funding for the clinic treatment cost.\"\n\n\n\n\n\nMr Hockey agrees that while the listing of Spravato on the PBS is a first step, he wants to see the administration of the medication become more accessible.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/labor-to-fund-760m-in-election-promises-by-raising-international-student-visa-fees/n8gsjqhcr",
    "title": "Labor to fund $760 million in election promises by raising international student visa fees",
    "publish_date": "Mon, 28 Apr 2025 05:19:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Labor has announced it will fund some of its election promises by raising visa fees for international students.\n\n\n\n\n\nThe move will mean the fee will rise from $1,600 to $2,000 if Labor is re-elected.\n\n\n\n\n\nThe Coalition has also said it would raise the student visa application charge to $5,000 for Group of Eight universities and $2,500 for all other international students.\n\n\n\n\n\nElection costings outline how the major parties plan to fund all the policies and announcements made throughout their campaign.\n\n\n\n\n\nIn a bid to pressure the Coalition to release its costings, Labor unveiled the cost of commitments made since March's budget on Monday. However, the parliamentary budget office doesn't release its full list of costings until after the election.\n\n\n\nREAD MORE Revealed: The winners and losers of the 2025 federal budget\n\nIn a joint press conference, Treasurer Jim Chalmers and Finance Minister Katy Gallagher revealed a further $1 billion in savings since the pre-election economic and fiscal outlook.\n\n\n\n\n\n\"We will finish this election campaign with the budget in a stronger position than at the start of the election campaign,\" Chalmers told reporters.\n\n\n\nWhere has Labor found savings?\n\nSavings will come from student visa fees, which will increase to $2,000 from 1 July 2025 and are anticipated to deliver $760 million to the budget over the forward estimates.\n\n\n\n\n\nThe change will not affect arrangements for Pacific Island and Timor-Leste applicants.\n\n\n\nTreasurer Jim Chalmers and Finance Minister Katy Gallagher have found an extra $1 billion in savings since last month's budget week. Source: AAP / LUKAS COCH An extra $6.4 billion will come from reducing spending on consultants, contractors, and labour hire, as well as non-wage expenses such as travel, hospitality, and property.\n\n\n\n\n\nGallagher said unlike the Coalition's pledge to cut 41,000 public job s, these savings would not impact any services or programs that the Australian Public Service provides.\n\n\n\n\n\nThe cumulative budget deficit will reduce from $151.6 billion to $150.5 billion as a result of the changes.\n\n\n\n\n\nIt will help to cover Labor's $1,000 instant tax deduction for work expenses, which is estimated to cost the budget $2.4 billion over forward estimates.\n\n\n\n\n\nGallagher said Labor had managed to get \"rid of a lot of waste and rorts\" embedded in previous budgets, which have been redirected to cost of living measures.\n\n\n\n\n\n\"We returned that money to budget, and it allowed us to ... deliver through our budgets — our investments in Medicare, our investments in housing, the income tax cuts, and other measures like lowering HECS debt,\" she said.\n\n\n\nTreasurer challenges Coalition to 'come clean' on cuts\n\nChalmers has urged the Coalition to \"come clean\" with its figures, letting voters know the cost of its policies as well as what it intends to cut to cover the spending.\n\n\n\n\n\n\"We call on the Coalition to release their costs and cuts immediately,\" Chalmers said.\n\n\n\n\n\n\"It is long past time for the Coalition to come clean on their secret cuts to pay for their nuclear reactors.\"\n\n\n\n\n\nHe said Labor was the only party with a \"costed, coherent, and credible plan\" for voters.\n\n\n\nDeputy Opposition leader Sussan Ley defended the timeframe last week, stating the Coalition's costings would be published in time to be \"fully interrogated\" ahead of election day.\n\n\n\n\n\nHowever, with more than two million early voters already having cast their ballots, many will head into polling booths without the figures on hand.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/article/ketamine-derived-nasal-spray-improved-alexis-depression-its-being-added-to-the-pbs/6q4lzq4l8",
    "title": "A ketamine-derived nasal spray improved Alexis' depression. It's being added to the PBS",
    "publish_date": "Mon, 28 Apr 2025 04:07:21 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A new medicine chemically similar to the drug ketamine could be a \"step forward\" for Australians living with the \"constant battle\" of depression.\n\n\n\n\n\nThousands of Australians could be eligible to receive the nasal spray, called Spravato, which contains esketamine, at a subsidised rate through the Pharmaceutical Benefits Scheme (PBS) from 1 May.\n\n\n\n\n\nIt's the first medicine to be PBS-listed specifically for treatment-resistant depression and will cost $31.60 per dose, or $7.70 for pensioners and concession holders.\n\n\n\n\n\nThe medication is chemically similar to ketamine and would be offered to people experiencing treatment-resistant depression, like 34-year-old youth mental health researcher Alexis Hutcheon.\n\n\n\n\n\nHutcheon started using the spray in 2022 after years of \"frustrating\" failed attempts with oral antidepressants.\n\n\n\nHutcheon's journey with Spravato\n\nHutcheon said her depression largely manifested as physical symptoms like gut issues, sleeping problems, and losing a lot of weight. It got to the point where she struggled to walk to the front door, let alone leave the house.\n\n\n\n\n\n\"I was that depressed that my body was experiencing such horrible physical symptoms due to my deteriorating mental health,\" she told SBS News.\n\n\n\n\n\nHutcheon went through years of trying oral antidepressants with limited to no success.\n\n\n\n\n\n\"Some of them worked for a little bit, and then they didn't, and some of the side effects weren't something that I could handle, like no sleeping,\" she said.\n\n\n\n\n\n\"If it doesn't work, you get this feeling like you want to give up, or you feel like it's your fault.\"\n\n\n\nREAD MORE Allan says no depression treatments worked for him. Then he tried ketamine\n\nHutcheon first tried Spravato during a clinical trial in 2022 and noticed positive changes almost \"straight away\".\n\n\n\n\n\n\"I was always waiting for the moment where it stopped working, but it's been a number of years now, and things have improved and improved,\" she said.\n\n\n\n\n\n\"Things haven't gone back to as bad as they were at all since I started using ketamine.\"\n\n\n\nHow ketamine works for treatment-resistant depression\n\nIan Hickie, the co-director of the Brain and Mind Centre at the University of Sydney, has been working with patients who take Spravato.\n\n\n\n\n\nHe told SBS News its PBS listing marks a \"significant advance\".\n\n\n\n\n\n\"It's a really different compound to the available antidepressants we've had over recent years,\" he said.\n\n\n\nLISTEN TO New PBS listings offer timely and affordable treatment options for women SBS News 17/03/2025 06:22 Play\n\nHickie explained it's the first PBS-supported drug that targets a different chemical in the brain called glutamate.\n\n\n\n\n\n\"Internationally, about half the people with treatment-resistant depression demonstrated a significant improvement with this drug,\" he said.\n\n\n\n\n\n\"In trials, I've personally been associated with in Australia, we have found the same thing in specialist clinics here.\"\n\n\n\n\n\nHe said many patients have experienced a significant improvement in their quality of life, but cautioned it can cause some to feel \"disoriented, disassociated, or quite unusual\".\n\n\n\nStrict clinical regulations\n\nKetamine therapy, along with other forms of treatment like psychedelic-assisted therapy, is highly regulated and is done in strict clinical settings.\n\n\n\n\n\nStudies have shown low doses of oral ketamine can treat post-traumatic stress disorder, and in tablet form, can reduce the symptoms of severe depression.\n\n\n\n\n\nThese therapies are administered in hospitals and clinics under medical supervision.\n\n\n\n\n\n\"You're in your own room and you're there for an hour and a half to two hours monitored by a clinician throughout the whole time,\" Hutcheon said.\n\n\n\nHickie said the cost of attending clinics can be hundreds or even thousands of dollars, which can create a barrier for people wanting to try the nasal spray.\n\n\n\n\n\n\"The cost of medical specialist care generally in Australia is very high, and that has meant access to these compounds to be difficult,\" he said.\n\n\n\n\n\nHe said many mental health treatments are only offered privately, and he would like public hospitals to \"step up\" and provide the \"novel\" treatment.\n\n\n\n\n\nDespite the availability of ketamine therapy, illicit use of the drug is on the rise in Australia.\n\n\n\nUse of illicit ketamine on the rise\n\nA national survey of 740 people who regularly use illicit stimulants found over half had used non-prescribed ketamine.\n\n\n\n\n\nFifty-three per cent of those surveyed last year used the drug, up from 49 per cent the year before, according to the University of New South Wales' Drug Trends program.\n\n\n\n\n\nThe group releases annual surveys of hundreds of people who use illicit drugs living in each of Australia's capital cities.\n\n\n\n\n\nDr Rachel Sutherland, lead of the Drug Trends program, said use of illicit ketamine was \"infrequent\" in a survey report for 2024.\n\n\n\n\"It is important to note that most participants who had used ketamine reported infrequent use [i.e., less than monthly], although approximately one in 10 reported weekly or more frequent use,\" Sutherland said in the report.\n\n\n\n\n\nHutcheon said there is more to do to help people access therapeutic ketamine.\n\n\n\n\n\n\"Seeking help can be difficult, especially due to stigma.\n\n\n\n\n\n\"Even though PBS-listing is one step forward, which we're so happy for, there will still be a number of people who won't be able to afford those private fees that occur to actually have the medication.\"\n\n\n\n\n\nReaders seeking support with mental health can contact Beyond Blue on 1300 22 4636. More information is available at beyondblue.org.au .\n\n\n\n\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 4
  },
  {
    "url": "https://www.sbs.com.au/news/video/major-parties-seek-to-shore-up-votes/bp6zoc2ol",
    "title": "Major parties seek to shore up votes",
    "publish_date": "Mon, 28 Apr 2025 03:11:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.theage.com.au/world/four-dead-after-car-crashes-into-after-school-camp-in-usa-20250429-p5lv2b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Four dead after car crashes into after-school camp in USA",
    "publish_date": "Tue, 29 Apr 2025 11:53:29 +1000",
    "category": "finance",
    "authors": [],
    "text": "Four dead after car crashes into after-school camp in USA\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/thousands-of-australians-banking-details-stolen-20250429-p5lv2c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Thousands of Australians' banking details stolen",
    "publish_date": "Tue, 29 Apr 2025 11:53:29 +1000",
    "category": "finance",
    "authors": [],
    "text": "Thousands of Australians' banking details stolen\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/nsw/the-battle-of-barbecues-and-blocked-views-2b-sydney-tower-faces-fresh-fight-20250428-p5luuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The battle of barbecues and blocked views: $2b Sydney tower faces fresh fight",
    "publish_date": "Tue, 29 Apr 2025 11:48:47 +1000",
    "category": "finance",
    "authors": [
      "Megan Gorrey"
    ],
    "text": "The divisive $2 billion tower reshaping Darling Harbour is facing fresh resistance after residents of nearby apartments complained about blocked water views and noise from rooftop bars and events.\n\nMirvac submitted a $63.5 million plan to develop the public spaces around the 42-storey luxury apartment block rising from the rubble of the bulldozed Harbourside Shopping Centre.\n\nMirvac is pursuing the next stage of planning approvals for its divisive $2 billion Harbourside redevelopment. Credit: Mirvac\n\nThe Department of Planning, Housing and Infrastructure has backed the proposal, arguing improved parks and public areas would help revitalise Darling Harbour and foster a “lively and engaging city”.\n\nBut the plan for the waterfront garden, promenade and pedestrian bridges attracted more than 50 negative submissions, which means it has been referred to the Independent Planning Commission.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/afl/blues-star-banned-for-whack-20250429-p5lv22.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blues star banned for whack",
    "publish_date": "Tue, 29 Apr 2025 11:44:19 +1000",
    "category": "finance",
    "authors": [],
    "text": "Blues star banned for whack\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/around-the-clubs-nrl-round-9-20250429-p5lv01.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dragons wield the axe after Anzac Day debacle",
    "publish_date": "Tue, 29 Apr 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "Promising playmaker Lyhkan King-Togia is poised to replace the axed Lachlan Ilias, and it’s unlikely to be the only change in the St George Illawarra line-up.\n\nDespite scoring a slashing try in the Anzac Day loss to the Roosters, Dragons winger Sione Finau is poised to be another casualty for Saturday’s clash with Wests Tigers. Corey Allan, who made one State of Origin appearance for the Maroons in 2020, is tipped to make his Dragons debut after overcoming an ACL injury that wiped out his entire 2024 season.\n\nKing-Togia has made four NRL appearances to date and recently signed a contract extension that will result in him progressing to the club’s top-30 squads for the 2026 and 2027 seasons.\n\nOnce the decision was made to drop Ilias, coach Shane Flanagan pondered whether to promote King-Togia or his NSW Cup halves partner Jonah Glover. Ultimately, King-Togia won the race to partner Kyle Flanagan in the halves.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/markets/trade-worries-and-tech-stocks-to-play-on-asx-s-open-20250429-p5luxv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX opens higher after late buying surge on Wall Street",
    "publish_date": "Tue, 29 Apr 2025 11:12:31 +1000",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "On Wall Street overnight, stocks drifted to a mixed finish on Monday, ahead of potential flashpoints later this week that could bring more sharp swings for financial markets. The S&P 500 inched up by 0.1 per cent to extend its winning streak to a fifth day. The Dow Jones Industrial Average added 0.3 per cent, while the Nasdaq composite slipped 0.1 per cent.\n\nEndeavour shares rose 0.5 per cent. The retailer and hotel owner, which runs the bottle shop chains Dan Murphy’s and BWS, said this morning that former Virgin chief executive Jayne Hrdlicka will become its new boss from January 1, with executive chairman Ari Mervis continuing in his role until then.\n\nAustralia’s biggest oil and gas producer, Woodside, edged up 0.1 per cent after making its final investment decision on a $17.5 billion ($27.4 billion) liquefied natural gas export project in the US, cementing its position as a top supplier of the fuel. The approval clears the way for large-scale construction of the Louisiana LNG export plant, which is targeting its first shipment in 2029, Woodside said.\n\nThe relative lull in trading offered a respite from the sharp, historic swings that have rocked markets for weeks, as hopes rose and fell that President Donald Trump may back down on his trade war. Many investors believe Trump’s tariffs could cause a recession if left unaltered. Coming into Monday, the S&P 500 had roughly halved its drop that had taken it nearly 20 per cent below its record set earlier this year.\n\nYet with a jittery April near its close, several market pros see little reason to think volatility is in the rearview mirror. For sharemarkets to keep rising, investors would need to see Donald Trump’s White House follow through on the “dovish pivot” toward trade with China, according to Chris Larkin at E*Trade from Morgan Stanley.\n\nMixed trading for some influential tech stocks ahead of their earnings reports this week pulled the S&P 500 back and forth between modest gains and losses for much of the session overnight.\n\nAmazon fell 0.7 per cent, Microsoft dipped 0.2 per cent, Meta Platforms added 0.4 per cent, and Apple rose 0.4 per cent. All are set to report their latest result this week, and they’re some of Wall Street’s most influential companies because they’ve grown to become some of the biggest in terms of size, by far. That gives their movements extra weight on the S&P 500 and other indexes.\n\nOutside of big tech, executives from Caterpillar, ExxonMobil, and McDonald’s may also offer clues this week about how they’re seeing economic conditions play out. Several companies across various industries have already slashed their estimates for upcoming profits or pulled their forecasts entirely due to uncertainty about what will happen with Trump’s tariffs.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/casey-council-clamping-down-on-record-number-of-illegal-corflutes-20250429-p5lv1m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Casey Council clamping down on record number of illegal corflutes",
    "publish_date": "Tue, 29 Apr 2025 11:12:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Casey Council clamping down on record number of illegal corflutes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/afl/blues-make-call-on-cerra-s-suspension-20250429-p5lv0z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blues make call on Cerra’s suspension",
    "publish_date": "Tue, 29 Apr 2025 11:04:14 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Carlton will challenge Adam Cerra’s suspension in a bid to have him free for the Blues’ important clash with Adelaide on Saturday.\n\nThe in-form Cerra was given a one-match ban for striking Jack Bowes in the Blues’ victory over Geelong on Sunday. The hit was graded as intentional, low impact and high contact.\n\nTo overturn the ban, the Blues will need to convince the tribunal the strike should have been assessed as careless rather than intentional or that the contact was made to the body and not high. Either scenario would result in a fine.\n\nThe Blues have had considerable success in appealing bans over the last four seasons, headlined by the famous Patrick Cripps case in 2022 which cleared the way for the Blues captain to win that year’s Brownlow Medal.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/money/super-and-retirement/the-myth-of-the-self-funded-retiree-why-we-need-urgent-tax-reform-20250429-p5lv03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The myth of the self-funded retiree: Why we need urgent tax reform",
    "publish_date": "Tue, 29 Apr 2025 11:04:07 +1000",
    "category": "finance",
    "authors": [
      "Thomas Walker"
    ],
    "text": "A few months back, I wrote about how inheritances and parental gifts are turbocharging inequality. I suggested we introduce a modest inheritance and gifts tax, which would raise money to invest in younger Australians and ensure a good start in life for all.\n\nWhile I received some great support, there was significant pushback. One common complaint from people with wealth was some variation of, “I have worked hard and built my own wealth while paying lots of tax. Why should I pay more? It’s unfair”.\n\nOlder generations naturally control much of our nation’s wealth and political power. Credit: Dominic Lorrimer\n\nHowever, what many wealthy Australians don’t seem to realise is that their wealth has grown with considerable taxpayer support. In recent decades, both major political parties have introduced or maintained tax concessions for private wealth accumulation, including the capital gains tax discount, preferential treatment of superannuation, and deductions for property investors.\n\nThese concessions together cost the budget over $100 billion annually and continue to grow. That’s nearly double what the federal government spends on education.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/politics/federal/pm-treasurer-challenged-on-aaa-credit-rating-risk-20250429-p5lv17.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM, treasurer challenged on AAA credit rating risk",
    "publish_date": "Tue, 29 Apr 2025 10:45:06 +1000",
    "category": "finance",
    "authors": [],
    "text": "PM, treasurer challenged on AAA credit rating risk\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/afl/race-for-longmire-kicks-off-20250429-p5lv13.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Race for Longmire kicks off",
    "publish_date": "Tue, 29 Apr 2025 10:34:26 +1000",
    "category": "finance",
    "authors": [],
    "text": "Race for Longmire kicks off\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/national/drone-footage-shows-monster-great-white-near-sa-marina-20250429-p5lv0x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Drone footage shows monster great white near SA marina",
    "publish_date": "Tue, 29 Apr 2025 10:29:00 +1000",
    "category": "finance",
    "authors": [],
    "text": "Drone footage shows monster great white near SA marina\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/peter-duttons-office-vandalised-in-queensland-20250429-p5lv10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Peter Dutton's office vandalised in Queensland",
    "publish_date": "Tue, 29 Apr 2025 10:28:39 +1000",
    "category": "finance",
    "authors": [],
    "text": "Peter Dutton's office vandalised in Queensland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://au.news.yahoo.com/today-show-slammed-for-most-australian-joke-as-upsetting-video-emerges-012818511.html",
    "title": "Today show slammed for 'most Australian' joke as 'upsetting' video emerges",
    "publish_date": "2025-04-29T01:28:18Z",
    "category": "finance",
    "authors": [],
    "text": "A video aired on Channel Nine’s flagship morning show Today, featuring hosts laughing at a kangaroo being harassed by a large dog, has sparked frustration among native animal lovers. Experts have dubbed the response to the clip “careless”, arguing it highlights a wider misconception many Aussies have about wild animals interacting with domestic pets.\n\nAs the short clip is played, the Sydney-based team describe the native marsupial as “very menacing” and joke that its encounter with a dog is “the most Australian thing”. But further south in Melbourne, where the incident occurred, locals fear the kangaroo could have been serious injured by the attack.\n\nThe kangaroo in the video is beloved by a large community southeast of Melbourne, where he’s been affectionately named Nigel.\n\n“Nigel is a very gentle kangaroo. I’ve known that kangaroo for four years and I know his movements, but I can’t find him,” local shelter operator Sue Johnson told Yahoo News.\n\nDetail in alternative video sparks concern for kangaroo\n\nDespite ongoing searches, Nigel hasn’t been seen since the incident occurred a week ago, sparking concern around the southeast suburb of Rowville. And some residents are upset at the tone of the morning TV segment on Monday.\n\nADVERTISEMENT\n\n“It was upsetting the way Today handled it. When something like this happens, and they think it’s funny, but it’s not on,” Sue said.\n\nShe has reviewed alternative footage of the incident and noticed tiny signs in the animal’s behaviour that indicate he could now be suffering from myopathy, a marsupial disease that’s induced by stress and causes a long, painful death.\n\n“In the other video, once the dog has gone, he stands up to turn around and his right leg is swivelling. And it shouldn't be doing that,” she told Yahoo.\n\nNigel the kangaroo hasn't been seen since the incident occurred on April 22. Source: Supplied\n\nDetail in kangaroo clip sparks online backlash\n\nDuring the segment, the Today team make it clear they don’t know what happened to the kangaroo, or where it occurred, suggesting it could be Canberra or Melbourne.\n\nAfter Today posted the clip to Instagram yesterday, it attracted hundreds of comments, with many animal lovers around Australia also taking umbrage with the tone of the video. “Everyone forgets that poor roo is simply trying to protect himself,” one person wrote. “This ain’t funny,” another said. “This is not cool at all,” another commented.\n\nADVERTISEMENT\n\nOthers questioned why the dog wasn’t on a leash. “This is absolutely stupid – where is the owner of the dog?” one person said. Meanwhile some expressed concern for the dog's welfare, saying; “That ain’t funny, that dog is lucky to be alive.”\n\nToday declined to comment on the community response to its segment.\n\nExperts reveal why kangaroo video is 'quite worrying'\n\nThe clip was clearly aired without malice, and experts in kangaroo behaviour believe it was simply “careless”. They argue the television show’s response to the clip indicates a wider issue of Australians misunderstanding how damaging the harassment of kangaroos by dogs is. Some also don’t realise that large kangaroos can kill dogs if they fear for their lives.\n\nDeakin University wildlife ecology expert Professor Euan Ritchie described the video as “distressing”.\n\nADVERTISEMENT\n\n“The owner of the dog may not realise their dog is in serious risk of being harmed by the kangaroo. Large males are very powerful animals with long sharp claws and powerful feet and are quite capable of killing a dog,” he told Yahoo.\n\n“Of course, there’s also the possibility that the dog will harm the kangaroo, which is of course protected native wildlife. And then on top of that, there are pedestrians and drivers in the vicinity of the panicked kangaroo and it could potentially hit a car or bystander.\n\n“Really the whole situation is quite worrying and problematic, and certainly nothing to make a joke about.”\n\nFear kangaroos could be driven from suburbs\n\nKangaroo expert and documentary maker Mick McIntyre said people in Rowville are lucky to have wildlife in their community, but more “common sense” is needed. If dogs aren’t kept on leashes kangaroos will be forced out as they see dogs as predators.\n\nADVERTISEMENT\n\n“When you see a wild kangaroo, give it space, do not harass it,” he told Yahoo.\n\n“The TV commentary made much hilarity. But imagine if that dog had been injured by the kangaroo, their commentary [could] have changed very quickly, blaming the kangaroo. The kangaroo is our national icon and deserves our care and respect.”\n\nAlyssa Wormald who founded the Victorian Kangaroo Association, said in 2025, Australians need to move away from laughing at animals being “attacked”.\n\n“This is presented as a titillating story, but really it is just desperately sad. Not only has this magnificent kangaroo been displaced by suburbia, he is fighting for his life against a dog,” she told Yahoo.\n\nVictorian shelter operator Helen Round is also concerned about the longterm welfare of the kangaroo.\n\n“One bite is all it takes. The kangaroo [now could face] a slow, agonising death,” she said.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 42
  },
  {
    "url": "https://au.news.yahoo.com/live/telstra-outage-sparks-chaos-mans-surprise-lotto-move-after-1m-win-religious-group-campaigning-for-coalition-undercover-235527093.html",
    "title": "Telstra outage sparks chaos, man's surprise Lotto move after $1m win, religious group 'campaigning for Coalition undercover'",
    "publish_date": "2025-04-28T23:55:27Z",
    "category": "finance",
    "authors": [
      "Tom Flanagan",
      "Stewart Perrie"
    ],
    "text": "Plus a Queensland man is keeping his lotto win a secret from his family, for now at least.\n\nTelstra customers have been hit by an outage which the telco says it is taking seriously. Source: Getty\n\nHello and welcome to Yahoo's live news blog this Tuesday. Telstra customers have been hit with a major outage, leaving thousands unable to access their accounts and apps.\n\nLiberal Senator James Paterson has downplayed concerns members of a controversial religious group are campaigning for the party \"undercover\". Hundreds of members of the Plymouth Brethren Christian Church have been deployed at pre-polling booths at marginal seats, The Age reports.\n\nA Lotto winner says he's keeping his $1m windfall from his family for now. So when is the right time to tell them? Have your say below.\n\nThe debate over Welcome to Country has intensified overnight, with the two major parties clashing on the ABC's Q+A.\n\nFollow along as we bring you regular updates throughout the day.\n\nLive 9 updates Featured Should you tell your family about a lottery win straight away? A Queensland retiree is $1 million richer – but his family are none the wiser. That's because the Lockyer man says he's going to keep his Weekday Windfall win from Monday night a secret, for now at least. “I’m not going to tell anyone for now. I’ll sit on it and then tell family when the time is right,\" he told lottery officials. So when's the right time to tell your family you've won a life-changing sum of money? Have your say below. Dutton's grocery photo opp after egg fail I wonder if Peter Dutton's getting familiar with some supermarket prices after he was caught out on the price of eggs in the final leaders' debate. The Opposition leader was joined by Liberal Candidate Andrew Constance at a farmers market in Nowra as they look to claim the marginal seat of Gilmore, which was won by Labor by a tiny margin in 2022. Peter Dutton pictured in front of some grocery price signs. Source: AAP\n\nTrump says he 'runs the world' as he reaches 100 days in White House US President Donald Trump has reached 100 days in his second stint in the White House and he's appearing as confident as ever despite concerns about some of his policies. Trump has said he is in a much stronger position this time, suggesting to The Atlantic he's the most powerful person in the world. “The first time, I had two things to do — run the country and survive; I had all these crooked guys,\" he said. “And the second time, I run the country and the world.”\n\nDutton hoping for election 'surprise' And sticking with Peter Dutton, the Opposition leader has stressed he's still got a great chance of winning the federal election despite falling behind in the polls. \"There's a lot of quiet Australians ... particularly people in suburbs, who believe that the government hasn't delivered for them,\" he told Brisbane radio station 4BC. \"I think there are a few surprises coming and there's no doubt in my mind that we can win this election.\" Earlier in the campaign Prime Minister Anthony Albanese himself said the election was far from over, pointing to the 2019 federal election when Scott Morrison claimed an unlikely election victory.\n\nPeter Dutton's office vandalised again Peter Dutton’s electorate office in Brisbane has been vandalised for a third time in the election campaign. The office building in Arana Hills in Brisbane’s north was splashed with red paint and covered in signs, condemning the Opposition Leader on Gaza and other issues overnight. One flyer read: “Dutton says he can find ‘common ground’ with Trump and praises the US interference with Gaza.” Another said: “Dutton opposes tertiary education funding and public housing initiatives but used 6k of taxpayers’ money for company at Gina Rinehart’s birthday party.” The incident follows recent comments from the Opposition Leader on the Welcome to Country being “overdone” and attacks on the Greens for being anti-Semitic and “Jew haters”. While Dutton said Welcome to Country should reserved for important events, such as the opening of parliament, it should be respected if held. Peter Dutton's office has once again been vandalised. Source: NewsWire - NCA NewsWire\n\nStop wasting your time at traffic lights We've all witnessed a button basher. Or maybe you're one of them. But the NSW government has set the record straight, and you don't even need to press the button sometimes. That's because doing so in Sydney CBD between 6am and 10am, it won't make a difference as its automated at that time, NSW Road Safety says. \"Outside these hours in the CBD and at all times everywhere else in NSW, pushing the button once alerts the traffic system to clear traffic and turn the signal green,\" it said. And for pressing repeatedly? Well that's a waste of time. \"Pressing more than once won't speed this up.\"\n\nQ+A clash for Liberal and Labor MPs Debate over the appropriate place of Welcome to Country ceremonies threw the ABC’s flagship Q and A program into acrimony on Monday night, with accusations of “gutter politics” and “straw man” arguments quickly emerging in the heated exchanges between panellists. Audience member Peter asked how the debate around the ceremonies could be resolved “amicably” and “in the interest of all parties concerned” following days of campaign trail division between Anthony Albanese and Peter Dutton on the matter. Liberal MP Paul Fletcher said the country needed to recognise the “distinctive place” of Indigenous Australians but suggested many across society felt there were now too many ceremonies. The issue has escalated in the federal election after neo Nazis booed a Welcome to Country from Bunurong man Uncle Mark Brown at Melbourne’s Anzac Day Dawn Service at the Shrine of Remembrance. Tanya Plibersek and Paul Fletcher battled on the ABC’s flagship Q and A program on Monday night. Picture: ABC Both sides of politics reacted with anger to the scenes and condemned the disruptive behaviour. But Mr Dutton has since said the ceremonies were losing their significance because of overuse and has suggested they might not be appropriate for Anzac Day services. On Monday night, Environment Minister Tanya Plibersek backed the ceremonies on Anzac Day and said acknowledging the service of Indigenous Australians in the military was “perfectly appropriate”. Mr Fletcher said veterans should determine the matter. When Ms Plibersek shot back and said he was speaking as though “we don’t have Indigenous veterans”, Mr Fletcher accused her of deploying “straw man rhetoric”, or suggesting she was not engaging directly with his position. “I can tell you the role of Indigenous people in defending Australia over many conflicts has been very significant,” he said. “Nobody is contesting that for a second.” Read more from NCA NewsWire here.\n\nLiberals welcome volunteers from 'all religions' Liberal senator James Paterson says he isn't concerned by reports hundreds of members of a controversial breakaway Christian church are campaigning for the Coalition \"undercover\". The Plymouth Brethren Christian Church, formerly known as the Exclusive Brethren, has allegedly instructed members to attend polling booths in marginal seats in a bid to influence voters, The Age reported. However the church denied to the publication it has instructed such a co-ordinated strategy. Paterson rejected suggestion from ABC Breakfast host Bridget Brennan more should be done to vet volunteers. \"I think that would be an extraordinary thing in a country that has no official state religion, that has freedom of religion, that we would say that some people are not welcome to participate in the political process because of their beliefs,\" he said. \"If you support our agenda, you're welcome to assist our campaign.\"\n\nThousands impacted by Telstra outage Well this is not the news you want if you're a Telstra customer. The telco has addressed concerns after thousands of customers were hit with a huge outage on Monday. The problems first arose around 2pm AEST, with a few simmering complaints being reported to DownDetector. However, that exploded to nearly 2,300 reports three hours later, with the majority of issues concentrating around email logins and certain apps. Telstra revealed on Monday night it was trying to rectify the issue. \"Our team's on it, and we hope to have you back in your inbox soon. Using an app to access your mailbox (Outlook) may help in the meantime,\" the company said. The telco revealed on Tuesday morning that while the issue has been rectified for some, others are still facing problems with Telstra Mail. \"Our team's continuing to monitor and investigate,\" it said. Read more from Yahoo Finance here.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 43
  },
  {
    "url": "https://au.news.yahoo.com/neighbour-rages-over-pointless-real-estate-sign-lighting-up-quiet-aussie-street-225025934.html",
    "title": "Neighbour rages over 'pointless' real estate sign lighting up quiet Aussie street",
    "publish_date": "2025-04-28T22:50:25Z",
    "category": "finance",
    "authors": [],
    "text": "Local Sydney man Richard claims the sign is an 'unnecessary' disturbance for residents and wildlife along the residential street.\n\nThe For Sale sign shone bright along View Street in Annandale, Sydney. But not everyone was impressed. Source: Reddit/mommypaste\n\nA luminous For Sale sign erected outside an Aussie home has quietly perturbed neighbours due to the bright light it emits every night, causing a disturbance in the usually quiet residential street.\n\nLocal man Richard, who asked to only be identified by his first name, told Yahoo News the sign was switched on in front of the property on View Street in Annandale, Sydney by real estate agency McGrath Lower North Shore. He claims the the street was suddenly illuminated every night thanks to its solar-powered light.\n\n\"I think the light is completely unnecessary and pointless,\" he told Yahoo News. \"The sign is behind a large tree and shrub. It is a quiet neighbourhood road. No potential buyers are going to see it.\"\n\nRichard believes the intention of having a readable sign at night is already lost due to it being blocked by the tree and shrub, so the light is simply a nuisance that \"disturbs local residents and wildlife\".\n\nADVERTISEMENT\n\n\"It's another form of light pollution,\" he complained.\n\nAfter sharing a picture of the sign online, other Aussies shared their disdain for the practice.\n\n\"I've seen this once before in person and it was ridiculously bright! I immediately felt sorry for the person living across the street,\" one person wrote.\n\nOne recent home seller said they had one of the bright signs outside their property and even admitted they found it \"annoying\".\n\nOthers called the use of these signs \"obtrusive\" and \"unnecessary\" and questioned how many prospective homebuyers are \"house-hunting after dark\" to make the use of the signs worthwhile.\n\nReal estate agency defends use of bright sign\n\nMcGrath Estate Agents told Yahoo News the solar-powered signs are not in breach of any marketing laws set out for real estate agents and they are simply used to help drive interest for their clients.\n\nADVERTISEMENT\n\n\"As property agents, our aim is to find buyers for the properties we market. A part of the marketing strategy is to provide signboards alerting passersby that the property is for sale,\" Rachel Maher, Chief Operating Officer of McGrath Lower North Shore told Yahoo.\n\n\"We use standard sized signboards and illuminate them to draw attention to the property and make the details legible at night.\"\n\nHowever following the complaint from the neighbour, Maher confirmed the sign in question will be removed as the agency doesn't want to cause a disturbance to residents.\n\n\"Following the neighbour's request, we will remove the illumination. Our signboard company will remove the lighting tomorrow, Tuesday April 29,\" she said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 44
  }
]