[
    {
        "url": "https://www.9news.com.au/world/savannah-guthrie-video-message-nancy-guthrie-kidnappers-usa/f1e0e952-0fee-4285-b872-785722159046",
        "title": "US TV anchor willing to pay ransom for safe return of mother",
        "publish_date": "Sun, 08 Feb 2026 01:37:11 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "US television presenter Savannah Guthrie claims she will pay a ransom in exchange for the safe return of her missing mother Nancy.\n\nThe anchor of prominent NBC News program Today shared a video on social media on Saturday (Sunday morning AEDT) alongside her two siblings Annie and Camron.\n\nShe said they had received a message from the potential captors of her 84-year-old mother, who has been missing for a week.\n\nREAD MORE: ﻿ Coalition reunion expected soon following messy split over hate laws\n\nSavannah Guthrie, middle, claims to be responding to messages from her mother's potential captors. (Instagram/@savannahguthrie)\n\n\"We received your message, and we understand. We beg you now to return our mother to us,\" Guthrie said.\n\n\"This is the only way we will have peace. This is very valuable to us, and we will pay.\"\n\nIt is the third time the family has directly addressed the kidnappers since Guthrie's disappearance .\n\nInvestigators think Nancy Guthrie was taken against her will from her home just outside Tucson, Arizona last weekend. DNA tests showed blood on Guthrie's front porch was a match to her, Pima County Sheriff Chris Nanos has said.\n\nAuthorities have not identified any suspects or ruled anyone out.\n\nInvestigations into Nancy Guthrie's dissapearance have been hampered by incomplete or missing evidence. (NBC via CNN Newsource)\n\nSavannah Guthrie was referencing a message that was sent to the Tucson-based television station KOLD on Friday afternoon (Saturday AEDT), according to Kevin Smith, a spokesperson for the FBI office in Phoenix.\n\nKOLD said it received an email related to the Guthrie case on social media that day but declined to share specific details about its contents as the FBI conducted its review.\n\nThe station was one of multiple press outlets that received alleged ransom letters during the week. At least one letter made monetary demands and established Thursday evening and the following Monday evening as deadlines.\n\nLaw enforcement officials declined to affirm that the letters were credible but said all tips were being investigated seriously. They also said one letter referenced Nancy Guthrie's Apple watch and a specific feature of her property.\n\nPresident Donald Trump claims the investigation is going well. (AP)\n\nIt has been reported that a camera at Nancy Guthrie's home was not able to capture images of anyone the day she went missing.\n\nInvestigators have found that the home's doorbell camera was disconnected early on Sunday and that software data recorded movement at the home minutes later. However, Nancy Guthrie did not have an active subscription, so none of the images were able to be recovered.\n\nDespite this, President Donald Trump , speaking on Air Force One, said the investigation was going \"very well\".\n\n\"We have some clues that I think are very strong,\" Trump said, while en route to his Florida estate. \"We have some things that may be coming out reasonably soon.\"\n\nReported with Associated Press﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/generational-screen-time-brain-rot/106278964",
        "title": "'Mum's addicted to Candy Crush': Is it only young people hooked on screens?",
        "publish_date": "Sun, 08 Feb 2026 01:56:17 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Like many young people, Bailee has faced criticism from older people about her screen time.\n\n\"My mum is always like, 'it's that phone', like every single time I do something wrong, she's like, 'it's that phone,'\" the 24-year-old told triple j hack.\n\nBut after spending time with her mother, Bailee said she was not convinced she was the only one whose relationship with screens was a problem.\n\n\"My mum's addicted to Candy Crush,\" she said.\n\nLoading...\n\n\"I'll try to talk to her for like a solid 30 seconds and she's just locked in on something, and I literally look and it's just a bubble popping game.\"\n\nSocial media bans target teenagers\n\nEarlier this week, Spain and Greece joined countries including Britain and France in considering introducing tougher stances on social media, after Australia in December became the first nation to prohibit access to some platforms for children aged under 16.\n\nAs in Australia, the focus in other countries in debates about mental health and screen time is on teenagers and young adults, but young people have told triple j hack they are noticing older people are in the grips of their devices too.\n\n\"The older generation is a bit more addicted than they want to admit,\" Bailee said.\n\nBailee, 24, thinks her mum is addicted to the game Candy Crush. (Supplied)\n\nA YouGov survey conducted last year in the United States suggested older people were clocking significant screen time, with more than half of 45 to 64-year-olds reporting spending five or more hours per day looking at screens, and one in five estimating their screen time at between seven and eight hours daily.\n\nAnd while the survey, which polled more than 1,000 people, did show younger people spent the most time on screens — 70 per cent of 18 to 29-year-olds reported five or more hours a day, while nearly one in three spent at least nine hours — neuropsychologists say the differences between the age groups are narrowing over time.\n\n'Digital natives' can help parents: psychologist\n\nMichoel Moshel, a Melbourne-based neuropsychologist who has researched the impact of screens on the brain, said screen time was rising across all age groups.\n\nBut Dr Moshel said he believed younger \"digital natives\" may be able to play a role in helping older people recognise problematic screen use.\n\n\"I think this is one of the skills that actually younger people are a lot more comfortable in the digital environment than older people,\" Dr Moshel told triple j hack.\n\n\"So, I think there is some place for younger people, if they feel like they are in control of their technology use … to have a very frank conversation with their parents, with their grandparents, and say, 'Look, there's a lot of these features that are in-built into these technologies that wrestle this control we have away from us'.\n\n\"I think for elderly people, this might not be as intuitive as it is for younger people.\"\n\nMichoel Moshel specialises in the intersection of digital technology and brain health. (Supplied)\n\nAccording to the YouGov survey, younger people in the United States were also more likely to acknowledge their struggles with screen time, with almost 70 per cent of 18 to 29-year-olds wanting to cut back on their screen use and nearly half saying they had intentionally tried to reduce their screen time within the past 12 months.\n\nBut for Bailee, spending time away from screens is harder to implement than it is to commit to.\n\n\"Your wallet's on your phone, all your personal details are on your phone — you have to have a phone to be able to be in society at this point,\" she said.\n\nBut one observation, she said, was the uptake of scrolling, watching reels, playing games and seeking the dopamine-driven reward cycles that app developers can manipulate to keep users engaged.\n\n\"It is also like a quick dopamine hit, I think for everybody, but I think, like, it's other generations included now,\" Bailee said.\n\nJess, 22, says an older woman complimented her and her friend for \"actually speaking to each other\". (Supplied)\n\nJess, 22, has also tried cutting back — including by setting time limits on some apps and deleting others altogether — but, she said, largely without success.\n\n\"I would say I'm in a constant limbo of trying to get my screen time lower, and I fear I've been failing for years,\" she told hack.\n\nJess also said that, over time, her parents had become more understanding of her generation's phone use.\n\n\"When I was younger, my parents used to be like, 'You're wasting your life on your phone', whereas now they're coming a bit more to the understanding of like, 'Actually, this is the generation you're in and you're used to being on your phone 24/7,'\" Jess said.\n\nBut still, she said, there had also been comments from older people about younger people and their phones, including one time when she said a woman approached her and her friends.\n\n\"She was like, 'I just have to tell you, it's so refreshing to see a group of young people just actually speaking to each other and not being on their phones,'\" she told hack.\n\nA YouGov survey in the United States found 11 per cent of adults leave their phone in another room at night. (Adobe Stock: terovesalainen)\n\nDifferent generations watching different screens\n\nResearchers say Australian data on screen time, broken down by age, is not regularly collected, but one dataset published by the Australian Bureau of Statistics on screen time in 2020-21 suggested time spent watching TV and video screens increased with age, with interwar and baby boomer generations recording daily averages of more than three hours.\n\nAccording to the same dataset, gen Z females spent the most time on their phones, while gen Z males played digital games for longer than any other generation.\n\nJazmin, Jess, Bailee and Blaize reflect on screen time with triple j hack. (triple j hack: Alice Angeloni)\n\nIn terms of problematic screen use, Dr Moshel said some statistics suggested that about one in 10 people have a problem with time spent in front of screens, which he said was defined as a loss of control over screen time with negative consequences.\n\nDr Moshel said somewhere between 3 and 5 per cent of people were addicted to screens in a clinical sense.\n\n\"Typically, when I speak to people who have some sort of problematic relationship, it's that 'I can't get off it' … so I have an intention, the amount of time that I want to spend, the sort of platforms that I want to use, but I'm really finding no matter how much I try to intentionally use these technologies, I'm just not able to.\n\n\"The negative consequences that they're experiencing as a result of this loss of control … there has to be a recognition that something is problematic, and that really helps when it comes to trying to turn it back and trying to gain some measure of control.\"\n\nTeenagers experience summer without social media\n\nOn the eve of the implementation of the social media ban in December, Prime Minister Anthony Albanese had a message for Australia's youth.\n\n\"Start a new sport, learn a new instrument or read that book that's been sitting there on your shelf for some time,\" Mr Albanese told younger people.\n\nJazmin, 15, said she was booted off most social media apps ahead of summer, and her screen time had reduced because of it.\n\n\"Now I don't have as many apps, I don't really use my socials that much,\" Jazmin told hack.\n\n\"I only use it when I need it, and at first it was like, 'Oh, I feel like I'm missing out on things', but it's actually been pretty good cause I've gotten out more.\"\n\nHer friend Blaize, who at 16 years old is not included in the ban, said he believed his screen time had been impacted, too.\n\n\"I used to be on my phone 24/7 scrolling my friend's posts, talking to everyone, but now I can only talk to people that are my age or higher,\" Blaize said.\n\nAnd on older people's screen time, Blaize said it was something he had noticed too.\n\n\"My mum just uses it to gossip with her friends and play Candy Crush — same with my pop and my nan.\"\n\nBut among young people and older, 19-year-old Amos shows not everyone is glued to their phone.\n\n\"I don't use it as much as a lot of people my age,\" Amos said.\n\nHe said he only used his phone for essentials, as he had seen among the older people in his life, too.\n\n\"I feel like I kind of used to be like that in high school, but now I just use it for, I guess, more necessities and ways to keep me happier,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/winter-olympics-2026-daily-guide-tess-coady/106307392",
        "title": "Winter Olympics 2026 quick guide: What to watch today",
        "publish_date": "Sun, 08 Feb 2026 01:06:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "What's on today?\n\nAussies Seve de Campo, Hugo Hinckfuss and Lars Young Vik are competing in the cross-country skiing from 10:30pm AEDT .\n\n\n\nfrom . Set your alarm for 3am AEDT to watch Alex Ferlazzo represent Australia in the luge .\n\n\n\nto watch represent Australia in the . Snowboard Slopestyle bronze medallist from the 2022 Winter Olympics, Tess Coady, will begin competition in the Big Air event from 5:30am AEDT tomorrow. Fellow Aussies Melia Stalker and Ally Hickman will also compete.\n\nStay across the action\n\nOtherwise you can stream the games live on 9 Now or Stan Sport.\n\nGive me more",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/health/2026-02-08/retinoids-and-retinol-when-pregnant/106250060",
        "title": "Retinol is booming, but doctors don't recommend it for pregnant women",
        "publish_date": "Sun, 08 Feb 2026 01:01:32 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Being pregnant comes with a minefield of advice from doctors, midwives, well-meaning friends and family, not to mention social media and other mums.\n\nThere are foods you're recommended to avoid, and medications that aren't approved. But skincare is less clear: some products are fine whereas others are not recommended.\n\nThe family of ingredients known as retinoids, for example, are booming in popularity in skincare products but there is conflicting advice on their safety for pregnant women.\n\nWhat are retinoids?\n\nRetinoids is an umbrella term for vitamin A derivatives that treat all manner of skin concerns from acne to wrinkles, fine lines and pigmentation.\n\n\"They're pretty much the gold standard skincare ingredients because they work for so many things,\" says Michelle Wong, a chemist and science communicator based in Sydney.\n\nRetinoids come in different forms.\n\nThe most potent are prescription-only acne treatment drugs such as isotretinon, which is taken orally, and tretinoin which is applied to the skin to treat severe acne.\n\nIsotrentinols have clearly labelled packaging. (Supplied: Sam Yarwood)\n\nThen there are pharmacist-only products containing adapalene, and a range of \"over-the-counter\" retinoids such as retinal and retinol which are in topical creams applied to the skin at much lower concentrations.\n\nIt's widely accepted that oral retinoids are not safe for pregnant women and may cause birth defects — and that is labelled clearly on the packaging and drug information leaflets. Prescription-only and pharmacist-only topical retinoids also carry warnings.\n\nBut what about over-the-counter (OTC) topical retinoid products?\n\nConfusing advice for pregnant women\n\nNSW Health's Mothersafe, a service for mothers run by NSW Health, says OTC creams are safe for pregnant women to use because they are applied topically and contain smaller doses, but advises against the use of prescription topical treatments.\n\nDr Wong agrees.\n\n\"Looking at standard retinol products on the market, it should be safe for pregnancy, as long as people are not using it in weird ways,\" she says.\n\nBut many health practitioners advise against using any type of topical retinoid.\n\nRetinoids are commonly used to treat acne. (Pixabay: Sharon McCutcheon/ABC Life: Daniel Mee)\n\nLaura Gerhady, a maternal fetal medicine specialist who studies the effects of medication in pregnancy says there is insufficient research to make clear determinations for the use of topical retinoids during pregnancy.\n\n\"Part of that is because most people using topical retinoids will be using them for conditions that are not vital to treat during pregnancy, things like acne.\"\n\nTypes of retinoids Prescription only: Isotretinoin: Strong oral retinoid to treat acne\n\nStrong oral retinoid to treat acne Tretionoin: A topical retinoid used for acne and skin ageing\n\nA topical retinoid used for acne and skin ageing Tazarotene: A topical cream retinoid for acne and psoriasis\n\nA topical cream retinoid for acne and psoriasis Trifarotene: A topical cream to treat acne Non-prescription: Adapalene: A topical retinoid for treating acne. Products containing this ingredient can only be bought directly from a pharmacist.\n\nA topical retinoid for treating acne. Products containing this ingredient can only be bought directly from a pharmacist. Retinol: A weaker retinoid, found in OTC skincare products\n\nA weaker retinoid, found in OTC skincare products Retinal: A topical OTC serum, cream or lotion that is stronger than retinol but weaker than prescription retinoids\n\nThere are no mandatory standards for labelling cosmetic skincare products containing retinoids such as retinal and retinol. The only non-prescription topical products that require labelling are those containing adapalene. These products were recently downgraded from prescription-only and made available as behind-the-counter products in pharmacies.\n\nDr Gerhardy says there isn't clear labelling because there isn't a specific guideline on what is and isn't safe.\n\n\"For [all] topical retinoids, the message is that we don't have great information, but if you use it, it's probably fine.\n\n\"To communicate that in a single sentence on packaging is quite difficult. It is straightforward with oral retinoids — they are certainly harmful in pregnancies.\n\n\"But topical is more challenging because we just don't have the data,\" she says.\n\nRetinols are a type of retinoid that treat fine lines. (Unsplash)\n\nAs research about both prescription and OTC topical retinoids is limited, guidance from health practitioners is typically interchangeable.\n\nDeshan Sebaratnam, a dermatologist at Liverpool Hospital says he advises his pregnant patients to avoid using all retinoids — including retinol — as a precaution.\n\n\"Much like alcohol, the safest choice would be to avoid retinol in pregnancy but the absolute risk is low,\" he says.\n\nLikewise, the American College of Obstetricians and Gynaecologists says that even though the amount absorbed by the body is low, neither prescription nor OTC products are recommended.\n\nWhat happens if you accidentally use a topical retinoid while pregnant?\n\nDr Wong says pregnant women who may have used topical retinoids without knowing should not be alarmed.\n\n\"Topical retinoids are generally not recommended during pregnancy but it's not worth panicking about if you accidentally use it once or twice,\" she says.\n\n\"If applied topically, the amount of product that would enter your system would be quite low.\n\nWhat in the world is retinol? It's widely touted as the \"gold standard\" in anti-ageing skin care, but what is retinol, and do you really need it?\n\n\"Including from prescription creams,\" she says, but adds: \"There's still a hierarchy of risk though. For example, tretinoin is the riskiest one.\"\n\nA large Nordic study published last year found that while the use of topical retinoids had significantly increased over the past 20 years, there was no evidence of increased risk of birth defects in babies exposed to topical retinoids during pregnancy.\n\nWhile the authors say those findings are \"the strongest evidence to date on the safety of topical retinoids during pregnancy\", they also acknowledge their study may underestimate the risk and more research is needed.\n\nIf you are thinking about using topical retinoid products, speak to your healthcare practitioner for advice.\n\nOther skincare ingredients to look out for\n\nProfessor Sebaratnam recommends avoiding minoxidil (a hair growth formula) and hydroquinone, which treats dark spots.\n\n\"Most other over-the-counter beauty products are probably safe,\" he says.\n\n\"But mums need to weigh up whether they really need to be using them or not.\"\n\nABC Health in your Instagram feed Follow @abchealth on Instagram, where we're busting myths and sharing practical, smart health advice.\n\nOther products Dr Wong recommends watching out for are online products that might be unregulated or high doses of salicylic acid, a cleanser that is also a chemical exfoliator.\n\nMothersafe NSW says salicylic acid is safe for use in smaller doses, however \"quantities of salicylic acid absorbed may be higher in specific situations so safety of use should be confirmed with MotherSafe or your healthcare provider.\"\n\nDr Wong also cautions against using beauty products bought online that don't have verified information.\n\n\"I would be cautious about those sorts of products that are really cheap and too good to be true,\" Dr Wong says.\n\nFor most pregnant women, the safest approach is to stick with simplicity; use well-regulated products, and speak to your healthcare practitioner.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/may-federal-budget-to-focus-on-lifting-speed-limit-on-economy/105435282",
        "title": "Next federal budget to 'lift speed limit' on economy, treasurer says",
        "publish_date": "Sun, 08 Feb 2026 00:44:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "The treasurer has indicated the May federal budget could be punctuated by spending restraint but will focus on productivity and tax reform, leaving the door open to changes to the capital gains tax.\n\nJim Chalmers said the objective of the budget would be to \"lift the speed limit\" on the economy so it can achieve higher growth with lower inflation.\n\n\"We're working up a productivity package, [and] there will be a savings package that we're working on,\" he told ABC's Insiders.\n\n\" We'll consider whether more steps can be taken on tax reform, but overall, it will all be about lifting the speed limit on the economy. \"\n\nHe said the budget would also deal with intergenerational housing equity issues and \"getting the budget in better shape\".\n\nMr Chalmers has been forced to defend the government's spending habits this week, after being criticised for its role in driving up inflation.\n\nThe opposition had argued that public spending was the main driver behind the Reserve Bank's interest rate rise this week.\n\nJim Chalmers argued in parliament this week the government was not to blame for the RBA's interest rate hike. (ABC News: Callum Flinn)\n\nBut the treasurer insisted government spending was \"not a factor\" in the bank's decision, pointing instead to higher spending in the private sector.\n\nToday, Mr Chalmers conceded government spending had played a role but insisted it was not the primary factor, while also admitting government spending was still growing.\n\n\"Typically, it is growing,\" he said.\n\n\"But what was unusual last year … in the first half of the year, when [the public sector] was actually making a negative contribution, the big contribution was being made by the private sector.\"\n\nCapital gains tax reform possibility\n\nThe treasurer also left open the possibility of changes to the capital gains tax and said intergenerational equity in housing was \"front and centre\" as the government prepared the budget.\n\nSpeculation is growing after government sources told the ABC the government was looking for a way to revive its 2019 proposal to impose heavier taxes on property investors.\n\nCapital gains tax reform among options as Labor weighs housing pitch After Jim Chalmers repeatedly refused to rule out changing the capital gains tax discount, a government source told the ABC that changes related to housing were being considered, with capital gains not ruled out.\n\nToday, the treasurer said any changes to the capital gains tax discount would have to have the support of cabinet, but did not rule it out.\n\n\"We've got a tax reform agenda that is primarily focused on cutting income taxes,\" he said.\n\n\"I know that there are intergenerational issues in housing and in tax, and we've got a big agenda to deal with those issues already, and any further steps we would take to address those intergenerational equity issues would be a matter for cabinet.\"\n\nThe treasurer was evasive when asked if he would rule out retrospective reform that would impact existing investments.\n\n\"I'm not going to get into hypothetical,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/fire-risk-concerns-authorities-breakup-illegal-bush-doof/106313870",
        "title": "'Oblivious' bush ravers putting themselves and locals at risk",
        "publish_date": "Sat, 07 Feb 2026 23:57:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Illegal raves in national parks throughout Western Australia's South West are creating an unacceptable fire risk that leaves both partygoers and locals in danger, authorities say.\n\nThe most recent bush doof was reported at Redgate, 280 kilometres south of Perth, on Wednesday afternoon, with hundreds of partygoers reportedly in attendance.\n\nAt the same time, local brigades were fighting an emergency bushfire just 11 kilometres away.\n\nThe Department of Biodiversity, Conservation and Attractions (DBCA) said the revellers were \"completely oblivious\" to the danger posed by the fire.\n\n\"DBCA staff and resources had to be diverted from the bushfire to go and investigate the bush doof and evacuate the people,\" a spokesperson said.\n\n\"Cars were backed up and blocking access to and from the party area.\"\n\n'The perfect storm'\n\nRedgate resident Terry Stanley has witnessed multiple illegal raves near his home over his 40 years in the coastal community.\n\nHe said the dangers of the raves in remote bushland, coupled with the fire risk, were a \"perfect storm\".\n\nAudio and electrical equipment was found scattered after a recent bush doof. (Supplied: DBCA)\n\n\"I'm all peace, love and brown rice, and I think a lot of the people are in this area, but you've got to be realistic,\" he said.\n\n\"It's all fun and games until it's not and things get out of hand … especially with fire involved and people in a very confined little spot.\n\n\" It can turn into a catastrophe. \"\n\nMr Stanley said Wednesday's bush doof was held in a small clearing at the end of a long, narrow, sandy track which would make evacuating difficult.\n\n\"It's surrounded on three sides by very spiky, dry, almost impenetrable coastal heath,\" he said.\n\n\"On the fourth side, which is the ocean side, if you wanted to escape down to the beach … you'd actually have to drop down a limestone cliff.\"\n\nTerry Stanley says a bushfire in 2021 showed him just how fast-moving a blaze can be. (Supplied: Terry Stanley)\n\nThe rave organisers were fined $1,200, according to DBCA.\n\nMr Stanley said current penalties were not enough to deter revellers.\n\n\"If you're going to give someone a fine, and they're going to be out of the country in two months or three months, they're not going to pay that fine, they'll just leave,\" he said.\n\n\"People just throw it on the ground because who cares?\"\n\nPartygoers 'oblivious' to dangers\n\nParks and Wildlife senior ranger Naz Graue was tasked with responding to the rave.\n\nBush doofs held in WA's South West have caused fire safety concerns. (File photo) (ABC Wimmera: Angus Mackintosh)\n\n\"There were hundreds of cars parked on both sides of the road and then down the sandy track, which was difficult to drive down,\" Ms Graue said.\n\n\"There's no way we'd have got a fire truck in there if we needed to.\n\n\"It amazes me how people are oblivious to the danger that they're putting themselves in.\"\n\nElectrical equipment left at a disbanded bush doof earlier this month. (Supplied: DBCA)\n\nA lack of fire safety consideration from organisers was putting partygoers at risk, she said.\n\n\"They just don't seem to understand that our landscape is very volatile to fire and how quickly fire can move through the landscape.\n\n\" There's just no way to get out, that they'll be trapped in there. \"\n\nAuthorities say unsanctioned raves in nature reserves create an unacceptable fire risk. (Supplied: DBCA)\n\nMs Graue said critical resources were directed away from a nearby fire to help manage partygoers.\n\n\"It was still in a dangerous situation where we needed those resources to help out to protect the properties that were under threat at the time,\" she said.\n\nDBCA has urged anyone to report suspicious activity in national parks and state forests.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/3-doors-down-frontman-brad-arnold-dies/106318798",
        "title": "3 Doors Down frontman Brad Arnold dies after cancer battle",
        "publish_date": "Sat, 07 Feb 2026 23:33:08 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Brad Arnold, a founder and the lead singer of American rock band 3 Doors Down, has died nine months after revealing he had kidney cancer.\n\nThe band said in a statement that Arnold \"passed away peacefully, surrounded by loved ones, in his sleep\", aged 47.\n\nThe Kryptonite singer said in a social media video in May that he had been diagnosed with advanced-stage clear cell renal carcinoma that had spread to one of his lungs.\n\n3 Doors Down cancelled their planned 2025 summer tour because of the illness.\n\nThe band, formed in 1996 in Escaatawpa, Mississippi, rose to popularity in 2000 with Kryptonite, which peaked at number three on the Billboard Hot 100, for which they were nominated for a Grammy.\n\n3 Doors Down performing in 2007. (Reuters: Steve Marcus)\n\nArnold wrote the song in maths class when he was 15 years old, according to the band statement.\n\nTheir debut album, The Better Life, sold more than 6 million copies. A second Grammy nomination came in 2003, for the song When I'm Gone.\n\nThe band has been described as post-grunge, alternative rock and hard rock.\n\n\"As a founding member, vocalist and original drummer of 3 Doors Down, Brad helped redefine mainstream rock music, blending post-grunge accessibility with emotionally direct songwriting and lyrical themes that resonated with everyday listeners,\" the band said.\n\n\"Above all, he was a devoted husband to Jennifer, and his kindness, humor and generosity touched everyone fortunate enough to know him.\n\n\"Those closest to him will remember not only his talent, but his warmth, humility, faith and deep love for his family and friends.\"\n\n3 Doors Down has released six albums, most recently Us And The Night in 2016.\n\nBrad Arnold performing at Patriots Fest, a military charity event, in 2024. (AP: Rob Grabowski/Invision)\n\nSingles included Loser, Duck and Run and Be Like That, which appeared on the soundtrack for the 2001 film American Pie 2.\n\nWhile promoting their fifth album, Time of My Life, Arnold said he considered himself lucky to have carved out a career in the music business.\n\n\"If you do something as long as we've done it, you can't help but get better at it, you know?\" Arnold told The Associated Press in 2011.\n\nIn 2017, 3 Doors Down performed at the first inauguration concert of US President Donald Trump.\n\nAP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/korean-exchange-bithumb-accidentally-gives-away-60b-bitcoin/106318826",
        "title": "Korean cryptocurrency exchange accidentally gives away $60b in bitcoin",
        "publish_date": "Sat, 07 Feb 2026 23:24:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "A South Korean cryptocurrency exchange has apologised after mistakenly transferring more than $60 billion worth of bitcoin to users, which briefly prompted a sell-off on the platform.\n\nBithumb said it accidentally sent 620,000 bitcoins, currently worth more than $60 billion, and blocked trading and withdrawals for the 695 affected users within 35 minutes after the error occurred on Friday.\n\nAccording to local reports, Bithumb was meant to send about 2,000 won ($1.95) to each customer as part of a promotion, but mistakenly transferred roughly 2,000 bitcoins per user.\n\n\"We sincerely apologise for the inconvenience caused to our customers due to the confusion that occurred during the distribution process of this [promotional] event,\" Bithumb said in a statement.\n\nThe platform said it had recovered 99.7 per cent of the mistakenly sent bitcoins, and that it would use its own assets to fully cover the amount that was lost in the incident.\n\nThe error caused temporary volatility in bitcoin prices on the platform. (Reuters: Dado Ruvic)\n\nIt admitted the error briefly caused \"sharp volatility\" in bitcoin prices on the platform as some recipients sold the tokens, adding that it brought the situation under control within five minutes.\n\nIts charts showed the token's prices briefly went down 17 per cent to 81.1 million won on the platform late Friday.\n\nIn a separate statement released later on Saturday, Bithumb said some trades were executed at unfavourable prices for users due to a price drop during the incident, including \"panic selling\".\n\nThe platform said it would compensate affected customers, covering the full price difference as well as a 10 per cent bonus.\n\nIt estimated losses at about 1 billion won ($976,579).\n\nThe platform earlier stressed that the incident was \"unrelated to external hacking or security breaches\".\n\nBitcoin, the world's biggest cryptocurrency, sank this week, wiping out gains sparked by US President Donald Trump's election victory in November 2024.\n\nAFP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/valentino-guseli-2026-winter-olympics-big-air-snowboard/106318724",
        "title": "Valentino Guseli's 'massive personal win' during big air final",
        "publish_date": "Sat, 07 Feb 2026 23:01:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "It wasn't from a lack of trying.\n\nValentino Guseli may have missed a medal in the snowboard big air final, finishing in a hugely credible 10th place in Saturday night's final at the Livigno Snow Park.\n\nBut in competing in the event for the first time at the Olympics, he reclaimed something far more important.\n\n\"I had a lot of personal wins,\" Guseli told the media after the final.\n\n\"I did the first backside 1800 on snow since I did my ACL on that same trick a year and a half ago in China, so that's a massive personal win.\n\n\"Getting over that and owning that trick again instead of it owning me.\"\n\nValentino Guseli had a bonus final appearance, and he made great use of it. (Getty Images: Hannah Peters)\n\nThat ACL injury is the principal reason Guseli was not able to compete in big air, slopestyle and his favoured half pipe off his own merits due to the time it forced him off the snow and out of competition.\n\nA good thing to put to bed, in that case.\n\nOf course, Guseli was never really supposed to be in the big air final in the first place.\n\nHe shouldn't have even started the qualifiers but for a late call-up after Canadian Mark McMorris went down in practice.\n\n\"To be honest, I took qualies as a little bit of a joke,\" Guseli said.\n\n\"I don't know if that sounds bad, but since I didn't expect to be there, and then when I got there it was such late notice, I sort of … I had goals, I didn't have expectations.\n\n\"I just went out there and tried to do the best riding I could, and then miraculously I made the finals.\n\n\"And then, yeah, tonight I took it a little bit more seriously.\n\nValentino Guseli landed a jump that had caused him such pain 18 months before. (Getty Images: Hannah Peters)\n\n\"It was the third time I landed the switchback 19 ever in my life, which was my second trick, and it was the first time I ever tried the back 19, which was the last trick that I crashed on. Unfortunately.\"\n\nAs the beats pumped and the crowd gazed up at the whirring phenomena descending upon them from the frigid, inky sky, it's both paradoxically easy and baffling to think you could consider this a laughing matter.\n\nThe towering, 40-metre high structure looms at the end of the postcard picturesque Alpine town like a fairground show — the most eye-catching of temporary big tops juxtaposed into a high-end snowy paradise.\n\nWith the continuous music and the strobe lights highlighting the surrounding peaks, the event was rave-like amidst the highest stakes of an Olympic final.\n\nValentino Guseli was in with a shot of a medal with a jump to go. (Getty Images: Michael Reaves)\n\n\"I was just stoked to be out there riding,\" Guseli said.\n\n\"First big air final in quite a long time. First big air [Olympic] final … first big air comp in the Olympics.\n\n\"I left it all out there for sure. I couldn't have tried harder or wanted it more. So yeah, no regrets.\"\n\nThe 20-year-old certainly made the most of his bonus opportunity.\n\nThe 10th-place finish is his best in a big air event since 2023. It is only his fourth big air event since he ruptured his ACL in 2024.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAnd Guseli was fully aware that he was there thanks to the misfortune of a rival competitor in McMorris, who may yet be forced to give up his slopestyle spot too, although Guseli was not counting on that.\n\n\"I'd say he'll probably be OK for slopestyle, which is really good news because you never want to see one of your competitors not be able to compete, especially someone that's done as much for the sport as Mark has,\" Guseli said.\n\n\"I haven't spoken to him or even seen him or anything, but something that I wanted to make sure I did was … kind of like, he came out, I went in, so essentially I had his spot and I wanted to do something special with his spot, to sort of just pay my respects to him.\"\n\nAnd given he used his chance, proffered by one injury to banish the memory of another that arguably cost him his spot at the Games in the event anyway, he certainly did it justice.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/meg-s-bookshop-port-pirie-closes-after-35-years-south-australia/106277430",
        "title": "They were told kids 'didn't read' in this town, they opened a bookshop anyway",
        "publish_date": "Sat, 07 Feb 2026 23:00:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "In one of the most disadvantaged parts of the country, more known for its lead than its literature, an independent bookshop would go on to become a \"world class\" institution and attract readers from all over South Australia.\n\nBut when Margie and Mark Arnold opened Meg's Bookshop in the early 1990s, few expected it to last.\n\n\"Me and my wife were told that the kids in Port Pirie would never read… that was some of the impression we got from people,\" Mr Arnold said.\n\n\"People weren't confident, they said there was no market.\"\n\nMark Arnold says it will be sad to see the shop close but it's the right time to move on. (ABC News: Isabella Kelly)\n\nA former teacher and author, Ms Arnold did not let those expectations shape her plans.\n\nAnd in 1991, with help from her husband and sister-in-law, she opened a book shop in Flinders Arcade, in a very small location, and it soon grew.\n\nAccording to the Australian Bureau of Statistics, 2021 data identified Port Pirie LGA as one of Australia's most disadvantaged areas based on income, education, and employment levels.\n\nBut that didn't stop Meg's Bookshop from becoming a success, and not just in Port Pirie but in the wider region.\n\nIt soon expanded beyond the smelter city, supplying books to communities from Port Augusta and Whyalla, to the Eyre Peninsula and far north, into the South Australian outback.\n\nBookshop events, including Harry Potter book launches in the 90s and 2000s, attracted hundreds of visitors. (Supplied: Meg's Bookshop)\n\n\"She just decided that's what she wanted to do, and she followed that path,\" said her childhood friend Ros Mayfield.\n\nAfter relocating to the main street of Port Pirie, the husband-and-wife duo built Meg's Bookshop into a space that encouraged children to sit, browse and listen.\n\nResearch from the Australian Council for Educational Research links reading for enjoyment with improved educational outcomes and mental health. Some studies suggest its academic impact can outweigh family educational background.\n\nMargie Arnold in her bookshop in Port Pire's main street. (Supplied: Meg's Bookshop)\n\n\"It was the heart and soul of Port Pirie,\" Ms Mayfield said.\n\n\"It was a real hub. Margie ran reading groups and events, and she involved the community for all those years.\"\n\nClosure after 35 years\n\nOver three decades, Meg's Bookshop developed a loyal following, drawing local readers as well as some of Australia's most recognisable authors.\n\nChildren's author Mem Fox, whose book Possum Magic is one of Australia's best-selling titles, visited the shop a number of times.\n\nBeloved children's book author Mem Fox (right) visited Meg's Bookshop many times over the years. (Supplied: Meg's Bookshop)\n\n\"When I heard it was closing, it felt like a death,\" she said.\n\n\"I could not believe it.\"\n\nThe decision to close Meg's Bookshop comes as Margie Arnold's health has declined, leaving her unable to continue running the business.\n\nFor some time, her husband managed the shop alone.\n\nStars decorate the ceiling and the walls throughout Meg's Bookshop. (ABC News: Isabella Kelly)\n\n\"It's been wonderful seeing so many children grow their passion for reading here,\" he said.\n\n\"But it's time to move on.\"\n\nThe book shop in the 'middle of nowhere'\n\nFox said Meg's Bookshop stood apart from many others she had visited.\n\n\"I could not believe she had a bookshop at such a high level in what the world would say was in the 'middle of nowhere'.\n\n\"It was a world-class bookshop.\n\nMargie Arnold shared her passion for reading with children from the cities to the outback. (Supplied: Meg's Bookshop)\n\n\" She was a go-getter, she was entrepreneurial, she was efficient, she was a damn good business woman. \"\n\nMargie Arnold and Mem Fox later toured regional and remote South Australia together, running read-aloud programs in towns without bookshops or libraries.\n\n\"It was one of the best things she ever did,\" Mr Arnold said. \"Margie really pushed the boundaries.\"\n\n\"It gave people an opportunity to see what was out there,\" Ms Mayfield said.\n\nAn author in her own right\n\nAlongside running the shop, Margie Arnold continued her advocacy for children in Port Pirie as a co-author of a book titled Lead, published in the mid-1990s.\n\nThe book, funded by state and national health authorities, was designed to help children and families understand the effects of lead exposure.\n\nLead was funded by health authorities to spread awareness about the dangers of lead exposure. (ABC News: Jenae Madden)\n\n\"Margie felt there was a need for education about lead for children, because we've got a lead-in-blood issue here,\" Mr Arnold said.\n\nThe book was used in local schools and sold widely throughout the community.\n\n\"It was very appreciated when it was published,\" Mr Arnold said.\n\nMs Mayfield said the book helped shift awareness in the town.\n\nThe book was aimed at families and children living in Port Pirie. (ABC News: Jenae Madden)\n\n\"People became more aware it was an issue and how to deal with it,\" she said.\n\nThe last chapter\n\nMr Arnold said the closure of Meg's Bookshop was difficult, but he was proud of what the store had achieved.\n\n\"People have their favourite shops, and for a lot of people this was it,\" he said.\n\n\"It's the circle of life. People I've watched grow up now come in with their children.\"\n\nMs Mayfield added: \"It was one of Margie's greatest passions to see kids pick up a book… and she really made that a reality for so many.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-08/who-says-one-person-dead-from-nipah-virus-in-bangladesh/106318702",
        "title": "WHO says one person dead from Nipah virus in Bangladesh",
        "publish_date": "Sat, 07 Feb 2026 22:24:50 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A woman has died in northern Bangladesh after contracting the deadly Nipah virus infection.\n\nNipah is an infection that spreads mainly through products contaminated by infected bats, such as fruit.\n\nThere are currently no licensed medicines or vaccines specific for the infection.\n\nIt can be fatal in up to 75 per cent of cases, but it does not spread easily between people.\n\nAsian countries taking no changes with DRT Two cases of the Nipah virus have been detected in India, prompting a raft of screening measures to be enacted in countries across Asia.\n\nThe case in Bangladesh, where Nipah cases are reported almost every year, follows two Nipah virus cases identified in neighbouring India, which has already prompted stepped-up airport screenings across Asia.\n\nThe patient in Bangladesh, aged between 40 and 50 years, developed symptoms consistent with Nipah virus on January 21, including fever and headache followed by hypersalivation, disorientation and convulsion, the World Health Organization reported.\n\nShe died a week later and was confirmed to be infected with the virus a day after that.\n\nThe woman had no travel history but had a history of consuming raw date palm sap.\n\nScientists in Bangladesh have previously caught bats to test them for the virus. (Reuters: Mohammad Ponir Hossain, file)\n\nAll 35 people who had contact with the patient are being monitored and have tested negative for the virus, and no further cases have been detected to date, the WHO said.\n\nAustralia monitoring Nipah virus The federal government is closely monitoring an outbreak of Nipah virus in India but has not received any advice to tighten border controls at this stage.\n\nCountries including Malaysia, Thailand, Indonesia, and Pakistan implemented temperature screenings at airports after India said cases of the virus had been found in West Bengal.\n\nThe WHO said on Friday that the risk of international disease spread was considered low and that it does not recommend any travel or trade restrictions based on current information.\n\nIn 2025, four laboratory-confirmed fatal cases were reported in Bangladesh.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/markets/the-dark-side-of-ai-weighs-on-the-stock-market-after-tech-plunge-20260208-p5o0h3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The dark side of AI weighs on the stock market after tech plunge",
        "publish_date": "Sun, 08 Feb 2026 14:24:09 +1100",
        "category": "finance",
        "authors": [
            "Mike Isaac",
            "Joe Rennison",
            "Maureen Farrell"
        ],
        "text": "Advertisement\n\nAnalysis BusinessMarketsAI The dark side of AI weighs on the stock market after tech plunge Mike Isaac , Joe Rennison and Maureen Farrell February 8, 2026 — 2:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA washout in the stocks of software companies has been flowing through Wall Street this week, as investors realised the threat that artificial intelligence will displace businesses had arrived. While the prospect of AI disruptions has hung over the economy for years, a new set of tools released this week by a San Francisco start-up forced a sudden reckoning on Wall Street. Anthropic’s Claude app. A new set of tools released by the company last week sent tech stocks plunging. Bloomberg Software companies most at risk from the new tools were the hardest hit, as well as the investment funds that lend to these companies. But the sell-off helped push down the broader market. On Thursday, the S&P 500 turned negative for the year after falling on six of the past seven days. But it rebounded the next day, rising 1.5 per cent. AI has been like rocket fuel for stocks, driving prices to record highs in recent years. Since October, though, that exuberance has been fading, as some realities of this transformative technology have begun to sink in.\n\nAdvertisement\n\nNot only are investors growing worried that AI could render certain businesses obsolete, they are also questioning the growing piles of money that companies are spending on AI. On Thursday, investors were spooked by Amazon’s revelation that it planned to spend $US200 billion ($285 billion) on AI and other large investments this year, exceeding analysts’ predictions by $US50 billion; shares fell 7 per cent on Friday. Last week, Google’s parent Alphabet said it would spend as much as $US185 billion this year, and last week Meta said its capital expenses, in large part to support AI, could reach $US135 billion. In the software sector, the catalyst for the sell-off was the release on Tuesday by San Francisco-based artificial intelligence firm Anthropic of free plug-in software tools that allow companies to automate functions like customer support and legal services. Because they were created as “open source” software, any company can download the tools without paying for them. These plug-ins could replace the tools that companies currently sell to businesses. Another area vulnerable to AI are providers of software-as-a-service, or SaaS, a mode of delivering subscription-based computer programs over the internet instead of buying and installing them locally on one’s computer. New, free software models from AI companies have the potential to replace not only the SaaS business model but also much of the workforce behind it.\n\nAdvertisement\n\n“There have been a number of these big sell-offs of these SaaS stocks over the past few years as these software models have rolled out,” Open AI CEO Sam Altman said in an interview with TBPN, a tech-focused streaming show. “I expect there will be more.” Editor's pick Updated\n\nWorld markets More than $60 billion wiped from ASX in market rout Analysts have taken to calling the broad sell-off the “SaaSpocalypse”. Shares of companies like LegalZoom, LexisNexis and Thomson Reuters, which offer legal services and research, dropped as much as 20 per cent over the past week. They had mixed recoveries after their drop. Shares of Salesforce, which produces SaaS and customer relationship management software for sales workers, have fallen 25 per cent over the past month.\n\nAdvertisement\n\nEven companies catering to the arts have been hit. Shares in Adobe and Figma, which produce tools for artists, fell 9 per cent and 17 per cent over the past week, driven by fears that many of the bread-and-butter design tools they provide to creative workers could eventually be automated. The fervour for AI is not just affecting the software industry. The surge in AI spending has generated enormous demand for random-access memory, or RAM, a kind of chip required to produce the AI hardware built by these companies. Shares of Salesforce, which produces SaaS and customer relationship management software for sales workers, have fallen 25 per cent over the past month. Bloomberg On Wednesday, Qualcomm, which makes microprocessors for smartphones and computers that require RAM, said it faced uncertainty around how much demand it would have for its chips over the next two years. That is, in part, because the skyrocketing cost of memory could dampen consumer demand for new devices. Shares of Qualcomm are down about 20 per cent this year. Software companies have also been a favourite target of lenders of private credit, because the companies’ subscription-based business model provides a stable stream of income to support taking on more debt.\n\nAdvertisement\n\nPrivate credit deals, as the name suggests, are not public, but the loans held by related business development companies, or BDCs, are seen as a proxy for the industry. Roughly half the software debt held by BDCs, equal to about $US45 billion, comes due in 2030 or later, according to analysts at Barclays, raising worries about the length of time until these loans are repaid. The more time a borrower has to repay a loan, the more time there is for the borrower to default — or, in this case, the more time for a business to be displaced by AI. An exchange-traded fund run by VanEck that contains holdings in many of the major BDCs is down about 6 per cent this year and more than 20 per cent over the past 12 months. Even as Ares Management and Blue Owl Capital — two of the largest private-credit firms — reported results that Wall Street analysts largely applauded, the two companies couldn’t escape investors’ worries about AI disruption. Shares of Ares have fallen more than 20 per cent this year and Blue Owl’s have fallen over 16 per cent. On an analyst call Thursday, Blue Owl CEO Marc Lipschultz denied that AI posed a threat to its lending business.\n\nAdvertisement\n\n“We don’t have red flags, and, point of fact, we don’t have yellow flags. We actually have largely green flags,” Lipschultz said. Editor's pick Opinion\n\nMergers & acquisitions Why Elon Musk just created a $1.8 trillion space monster Stephen Bartholomeusz Senior business columnist Blue Owl chief financial officer Alan Kirshenbaum attributed the company’s challenges to “headwinds in private credit, AI, software”, as well as investors who want some of their money back. Analysts could find little to worry about in the firm’s results. “If you took the name off the top of the release and ripped through the details, you’d think that’s a pretty darn good quarter,” Evercore ISI analyst Glenn Schorr wrote in a note late last week.\n\nAdvertisement\n\nBitcoin, a retail-dominated market that tends to swing with some of the popular stock trades, also skidded, sliding as low as $US60,000, its lowest level since October 2024, before rising back towards $US70,000. On Wednesday, US Treasury Secretary Scott Bessent said during a congressional hearing that the government had no power to order banks to buy bitcoin in order to stem the price decline. As investors dial down their exposure to the more speculative bets like bitcoin and AI-related stocks, they are shifting towards previously unloved sectors that are seen as better insulated through periods of volatility. So far this year, energy stocks, consumer staples and the materials sector have all gained over 10 per cent while tech has languished. “After years of tech-driven market leadership, the balance of power is shifting as investors rotate toward traditional ‘old economy’ sectors,” said Angelo Kourkafas, a strategist at fund manager Edward Jones.\n\nAdvertisement\n\nThis article originally appeared in The New York Times. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: AI\n\nAnalysis",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/severe-tropical-cyclone-mitchell-headed-for-wa-coast-20260208-p5o0h7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Severe Tropical Cyclone Mitchell headed for WA coast",
        "publish_date": "Sun, 08 Feb 2026 13:21:28 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cartwright-injured-as-aussies-start-hot-at-perth-sevens-20260208-p5o0gx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cartwright injured as Aussies start hot at Perth Sevens",
        "publish_date": "Sun, 08 Feb 2026 12:35:33 +1100",
        "category": "sports",
        "authors": [],
        "text": "Australia’s rugby sevens men are rallying around Will Cartwright after the 22-year-old dislocated his shoulder in the opening minutes of their hoodoo-busting 21-14 win over New Zealand in the world series event in Perth.\n\nAustralia’s William Cartwright leaves the field after being injured in the match against New Zealand. Credit: Getty Images\n\nBut there was otherwise plenty to cheer about for the fans at the Perth Sevens on a scorching Saturday after both the home teams went unbeaten on the way to securing semi-final berths.\n\nThe Australian women posted wins over Great Britain (54-5), France (26-12) and Canada (38-10) to set up a semi-final showdown with the US on Sunday.\n\nThe Aussie men broke a nine-match losing streak to NZ before going on to beat France 29-14 and Great Britain 24-21, setting up a final-four match-up against South Africa.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/festival-brings-food-fireworks-and-brutally-honest-advice-from-asian-aunties-20260202-p5nyy9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane festival brings food, fireworks and brutal advice from ‘Asian Aunties’",
        "publish_date": "Sun, 08 Feb 2026 12:30:00 +1100",
        "category": "entertainment",
        "authors": [
            "Nick Dent"
        ],
        "text": "Advertisement\n\nNationalQueenslandEntertainment Brisbane festival brings food, fireworks and brutal advice from ‘Asian Aunties’ Nick Dent February 8, 2026 — 12:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nOne is a CSIRO scientist noted for her work with fruit bats. The other is a former Filipino TV celebrity, now employed at QUT. Together, they’re creating comedy gold. Himali Ratnayake and Janette McBride are the Asian Aunties, a burgeoning Brisbane improv duo whose chemistry was so palpable during their first on-stage appearance in 2025, audiences were urging them to team up. “We were a Big Fork Theatre Cage Match team, which means the audience votes for who they want to come back the next week, and we won 12 weeks in a row,” McBride says. Aunty Maria from the Philippines (Janette McBride) and Aunty Rani from Sri Lanka (Himali Ratnayake) have some blunt advice to offer audiences at the Brisbane Powerhouse. Nick Dent “We just became the aunties. We felt the chemistry, and the audience also felt it,” Ratnayake recalls.\n\nAdvertisement\n\nThe Asian Aunties both celebrate and eviscerate the figure of the “older female mentor” prominent in many Asian cultures. In their shows, Aunty Maria from the Philippines (McBride) and Aunty Rani from Sri Lanka (Ratnayake) ask the audience to write their problems on scraps of paper that go into a rice cooker to be plucked out at random. “We then give advice as the aunties,” McBride says. “It’s not always good advice,” Ratnayake adds, noting the characters are drawn from life. “When I go to Sri Lanka, aunties will ask me those annoying questions. There’s generally love at the core, but it does come across as very direct, and toxic.”\n\nAdvertisement\n\nMcBride’s character is based on her mother, who immigrated to Queensland in 1981. “She was a very sassy, funny lady and brutally honest. “This is therapeutic for us,” she laughs. Ratnayake got her PhD at the University of Melbourne and is noted for developing the Flying Fox Heat Stress Forecaster as part of her CSIRO research into biosecurity. She discovered improv at a point in her life when she needed a change and was “saying yes to everything”. McBride left Brisbane as a teenager seeking fame in the Philippines. She was swiftly cast in films, TV productions including Tabing-Ilog (a Filipino answer to teen drama Dawson’s Creek), and was co-host of a talk show, Talk TV, that was cancelled after a year. Back in Brisbane, she has produced the BrisAsia Comedy Gala for the last five years at Big Fork Theatre in the Valley.\n\nAdvertisement\n\nThe show is transferring to the larger stage at the Brisbane Powerhouse for the first time on Saturday, February 14, with a line-up of local and interstate acts. Michael Hing (The Project) is hosting, and stand-ups include Urvi Majumdar, He Huang, Ting Lim, Jo Gowda and Ashwin Segkar. Run by the Brisbane City Council, BrisAsia (February 13-22) marks Lunar New Year across town with food, music, art and performances. McBride says Brisbane is a more welcoming and diverse city now than when she was growing up. “There weren’t too many mixed-race kids at that time, and so me and my brother were bullied, and asked if we were Chinese or Japanese – there could just be two. “Now it is more multicultural, and we embrace who we are.”\n\nAdvertisement\n\nBrisAsia Festival 2026: 10 more highlights Southside by Night\n\nCar culture fans bring their hot rods to this mix of hip hop and street food. Unidus Community Centre, Willawong, Friday, February 13, 5-9pm. BrisAsia Sk8 Zone\n\nAsian-Australian skateboarders showcase kickflips and tricks, and hold a workshop for rising skaters. Bracken Ridge Skate Plaza, Fitzgibbon, Saturday, February 14, 9am-12pm. ON:STAGE K-pop Showcase\n\nTalented dance crews present original choreography and creative stage concepts showcasing the growing influence of Korean pop culture across Australia. Thomas Dixon Centre, West End, Saturday, February 14, 4pm & 6.30pm. Vietnamese Lunar New Year Festival\n\nThe festival features Vietnamese cuisine, lion dances, fireworks, a traditional costume parade, martial arts, calligraphy, folk games and children’s rides. C.J. Greenfield Complex Park, Richlands, Saturday, February 14 5.30-9.30pm.\n\nAdvertisement\n\nHyoshi in Counterpoint\n\nA free all-ages concert by this South Australia all-female Asian fusion band. Queensland Multicultural Centre, Kangaroo Point, Saturday, February 14, 7.30-9pm. Related Article Exclusive\n\nFood Tassis Group’s Aunty arrives, and perhaps isn’t quite what you think it is Lunar New Year in the Gardens\n\nA kaleidoscope of traditional music, dance and theatre from across Asia presented by Kelly Higgins Devine and Ashwin Segkar. Brisbane Botanic Gardens Mt Coot-tha, Sunday, February 15, 4-6pm. Lunar Soul Party\n\nThis party on the Kite Terrace has performances from Neo Soul DJ Saie, hip-hop artist Chong Ali, and Chinese opera singer Zi Wang, as well as food and drinks. Thomas Dixon Centre, West End, Tuesday, February 17, 6-10pm. Lunar New Year\n\nWatch the lion and dragon dances in the mall, and ring in the Year of the Horse. Chinatown Mall, Fortitude Valley, Saturday, February 21, 2-9pm.\n\nAdvertisement\n\nDiscover Improv Comedy Workshop\n\nJanette McBride leads you through the fun of unscripted acting in this introduction to improv comedy workshop. Big Fork Theatre, Fortitude Valley, Sunday, February 22, 1.30-4.30pm. Sunnybank Lunar New Year Rooftop Party\n\nBrisbane’s biggest Lunar New Year fireworks display happens alongside lion and dragon dance performances and activities for the kids. Sunnybank Plaza, Saturday, February 28, 5-8.30pm. Get alerts on significant breaking news as happens. Sign up for our Breaking News Alert.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/savannah-guthrie-willing-to-pay-ransom-for-safe-return-of-mother-20260208-p5o0gs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Savannah Guthrie willing to pay ransom for safe return of mother",
        "publish_date": "Sun, 08 Feb 2026 12:19:40 +1100",
        "category": "finance",
        "authors": [],
        "text": "Savannah Guthrie willing to pay ransom for safe return of mother\n\nSavannah Guthrie said she is willing to pay a ransom for the safe return of her mother in a video message to the potential kidnappers of Nancy Guthrie.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/floating-a-bad-idea-20260201-p5nylp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Floating a bad idea",
        "publish_date": "Sun, 08 Feb 2026 11:53:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "When a developer floats the idea to build housing on a floodplain, it’s best to factor in how well the future residents may need to float too (“Hundreds of homes to be built on floodplain”, February 1). Nature and the landscape have ways to remain “buoyant” despite the travails of extremes in weather and climatic events. Not always so with the human the abode. In simple planning terminology, a plain is often an ideal location to overlay suburbs. A caveat to this easy-fix home installation, is that if the word plain is prefixed by flood, you will have not wanted to come down in the last shower to gauge the inherent rising risks of such a proposal. Steve Dillon, Thirroul\n\nFloods inundated Lismore, NSW, again, in March 2025. Nick Moir\n\nAs a long-time resident of the Hawkesbury area and having experienced numerous floods over the years, I find it incomprehensible that developers are still utilising floodplains to build on. This despite all the evidence available about climate change impacts on rain/flood/storm events and increasing urban runoff, by volume and velocity. It seems that there is a complete lack of will by our politicians to address the serious problems we face around housing and environmental risk. With that in mind, perhaps it’s time to have the insurance sector, along with the banking sector, to provide some guidance around premiums and interest rates they will apply for homeowners in these types of development areas. We already know many people can’t afford insurance for their property and regardless of platitudes the banks will always hold the home owner liable for any debt. It is simply unconscionable for this cavalier approach to housing developments to continue as we know that after every major flood all the stakeholders blame everyone else and demand government assistance, whilst most of the insurers either walk away, dissemble over liability or price themselves out of the market. How simple would it be to identify many of these costs before development? That would be a simple “factor” to help determine where these developments go. Bernard Stever, Richmond\n\nAn Insurance Council of Australia spokeswoman states, “there are already more than 240 000 homes in Australia that face a severe to extreme risk of flooding, we should not be adding to this”, regarding the NSW government decision to approve the building of 1000 new homes on a floodplain. Two dictionary definitions sum up this decision. Floodplain: “a trait of low-lying ground which is periodically flooded by a river or creek”, and “unintelligent, foolish”. This decision could cost lives and is setting our state up for a very likely future disaster. John Cotterill, Kingsford\n\nWhile busy committing to buy back homes in flood-prone Lismore the government is giving the green light to a mass housing development at Marsden Park North, rated Sydney’s most flood-prone area. Who will insure these properties? Will taxpayers have to provide relocation assistance when the inevitable floods occur, not to mention the physical and psychological effects of losing all to flood damage? Katriona Herborn, Blackheath\n\nMorrison off mark\n\nJacqueline Maley asks the right questions of Scott Morrison’s words spoken in Israel (“Morrison didn’t hold a hose, but is still happy to fan flames remotely”, February 1), apparently blaming Australian Muslims for the actions of two men at Bondi. Morrison, as usual, is way off the mark and his selective blaming is reminiscent of his ham fisted but memorable stint as our least illustrious prime minister. Maley led with Morrison’s worst efforts as PM, which always make me shudder. Morrison’s more memorable words since he left his non-hose holding role of many ministries have been pronounced outside this country, and only reported back to us. What was he doing in Israel? There is an adage from a master storyteller, “let those without guilt cast the first stone”. Morrison may have heard that one, but hasn’t internalised it. Morrison may have been forgiven by some for not holding a hose, however, as the man who gave life to robo-debt, he fails to accept an ounce of culpability. Geoff Nilon, Mascot",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/streamer-kicked-out-of-phoenix-open-20260208-p5o0gh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Streamer kicked out of Phoenix Open",
        "publish_date": "Sun, 08 Feb 2026 11:50:13 +1100",
        "category": "finance",
        "authors": [],
        "text": "Streamer kicked out of Phoenix Open\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/brisbane-now-more-expensive-than-sydney-for-first-home-buyers-20260208-p5o0fs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane now more expensive than Sydney for first-home buyers",
        "publish_date": "Sun, 08 Feb 2026 11:32:19 +1100",
        "category": "finance",
        "authors": [
            "Brittney Deguara"
        ],
        "text": "First-home buyers in Brisbane have been dealt another blow, with new data showing entry-level homes are now more expensive here than in Sydney.\n\nNew figures from property data firm Foundit showed that while Sydney remained more expensive overall, Brisbane had surpassed it on the lower end of the spectrum.\n\nDuring the past year, only 3.2 per cent of homes sold for under $500,000 in the Greater Brisbane area, compared with 4 per cent in Greater Sydney.\n\nNew data shows homes under $500,000 are rarer in Brisbane than Sydney now. Credit: Courtney Kruk\n\nThe report found the most homes to go to market in that price range were mainly apartments and townhouses in the CBD, Woodridge and Beenleigh.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/anger-builds-ahead-of-the-israeli-presidents-arrival-midday-news-bulletin-8-february-2026/wgaq3i5j0",
        "title": "Anger builds ahead of the Israeli president's arrival | Midday News Bulletin 8 February 2026",
        "publish_date": "Sun, 8 Feb 2026 00:52:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\nIn this bulletin;\n\nAnger builds ahead of the Israeli president's arrival\n\nReports the coalition is poised to reunite\n\nAustralia's first medal hope dashed at the Winter Olympics.\n\n---\n\nAn organiser of a Melbourne march against Israeli President Isaac Herzog's visit to Australia says the federal government's invitation to him made no sense.\n\nMr Herzog was formally invited to Australia by Prime Minister Anthony Albanese, following an earlier invitation from the Zionist Federation of Australia.\n\nProtests are planned across Australia from Monday, with writer and activist Noura Mansour saying the visit is problematic.\n\n\"I think his visit, extending an invitation to someone with statements that are problematic, someone who has signed missiles that have been dropped on Palestinian children, Palestinian hospitals, schools, someone who has blamed an entire population in Gaza for the actions of some, clearly generalisation fallacy.\"\n\nWhile some groups welcome his trip as a moment of deep significance following the December 14 Bondi attack others want the invitation rescinded.\n\nMr Albanese says people have a right to express their views in a democracy — but he hopes they will be respectful in this difficult time.\n\n—\n\nReports are emerging that the Coalition is poised to reunite, with speculation Sussan Ley is set to accept a deal from David Littleproud to rejoin the Nationals.\n\nAn announcement confirming the reunion is expected on Sunday, which would see the coalition restored and all former Nationals frontbenchers reinstated to shadow cabinet.\n\nThe pair are also expected to sign an agreement codifying the convention of shadow cabinet solidarity, in which frontbenchers must step down if they vote against an agreed position of the joint party room.\n\nSpeaking to Nine's Today Show, Mr Littleproud says the Coalition is stronger together.\n\n\"Because of the timelines Anthony Albanese put on us to vote on a free speech bill, we couldn't get comfort in it, and we couldn't bring ourselves to vote for it. We had less than five hours to determine whether we wanted to vote for this bill or not, and I don't think that's good legislating. So we've been consistent all the way, we're back to with integrity and respect, and we'll continue to have those discussions with the Liberal Party, but I hope that in the near future, that there is a coalition because that's the only way to bring Anthony Albanese down.\"\n\nUnited States President Donald Trump's so-called \"Board of Peace\" will meet for the first time in two weeks.\n\nThe first meeting is scheduled for 19 February and will reportedly also serve as a fundraising conference for the reconstruction of Gaza.\n\nMany rights experts say that Mr Trump overseeing a board to supervise a foreign territory's affairs resembled a colonial structure, and they criticised the board for not including a Palestinian.\n\nSecretary-general of the League of Arab States, Ahmed Aboul-Gheit, says he's hopeful that Palestinians can govern themselves.\n\n\"I hope for a continuous rebuilding of the cities that have been demolished and destroyed beyond recognition, and I hope that the Palestinian Authority would be allowed to emerge back in Gaza, aiming at the establishment of a Palestinian state ruled by the Palestinians themselves.\"\n\nPolling has opened in Japan, where Prime Minister Sanae Takaichi is hopeful the election will allow her to push new conservative policies.\n\nPolls predict the election will hand Ms Takaichi's ruling coalition a resounding win, though record snowfall in parts of the country could keep many voters at home.\n\nOpinion polls suggest the conservative coalition, led by Japan's first female prime minister, could win more than 300 of the 465 seats in the lower house of Parliament.\n\nAhead of the vote, some residents say they fear the direction Japan is heading.\n\n“I feel Japan may have drifted too far to the right. I also want Japan to be protected, but things seem to be moving towards an extreme direction, that scares me.\"\n\nSnowboarder Valentino Guseli has fallen short in his unexpected bid for Australia’s first medal at the Winter Olympics in Italy.\n\nThe 20-year-old reached the final of the men’s big air event — a single jump off a huge ramp — but couldn’t land two of his jumps, finishing 10th.\n\nJapan’s Kira Kimura claimed gold ahead of compatriot Ryoma Kimata, with China’s defending champion Su Yiming taking bronze.\n\nIn other results, Alex Ferlazzo sits 20th after the first round of the men’s luge, while Rosie Fordham was Australia’s best in the women’s skiathlon, finishing 49th.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/off-again-on-again-coalition-reunites-after-almost-month-long-split/qhy1jiqg0",
        "title": "'We trust each other': Coalition reunited after Ley, Littleproud strike fresh deal",
        "publish_date": "Sun, 8 Feb 2026 00:29:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Liberal leader Sussan Ley and Nationals leader David Littleproud insist the pair \"trust\" each other after the parties agreed on a deal to reunite and reform the Coalition after a three-week split.\n\nIn a joint press conference on Sunday, the pair confirmed earlier reporting of the deal, which will allow all former Nationals frontbenchers reinstated to shadow cabinet after they were sacked or stood down for breaking solidarity conventions over hate speech laws.\n\nLey said the Coalition was \"looking to the future, not the past\".\n\n\"We are back in coalition. We are stronger. Differences have been resolved,\" she said.\n\n\"We're squarely focused on representing the Australian people and fighting for their needs, their aspirations and their hopes. They deserve no less. They expect no less. And they will receive no less.\"\n\nWhen asked during the press conference about reports Littleproud had asked for Ley's resignation, and whether they trusted each other, the duo said they did.\n\nLey said: \"Yes, 100 per cent, I trust David and I value and respect the National Party as one of the two great parties with.\"\n\n\"I wouldn't be standing here today if I didn't trust Susan, if I didn't trust the Liberal Party,\" Littleproud said.\n\n\"So I'm very comfortable and we've said to one another, this is where we can look each other in the eye and say, this is the team that will go to the next election.\"\n\nLittleproud and deputy Nationals leader Kevin Hogan will immediately rejoin leadership meetings and shadow cabinet processes.\n\nThe leaders also signed an agreement codifying the convention of shadow cabinet solidarity, in which frontbenchers must step down from their roles if they vote against an agreed position of the Liberal-National joint party room.\n\nThe written agreement clearly sets out that the joint party room has primacy over the individual National and Liberal party rooms, addressing the contradiction that instigated the split.\n\nLISTEN TO What is behind the surge in support for Pauline Hanson and One Nation? SBS News 05:38 English\n\nThree Nationals frontbenchers — Ross Cadell, Bridget McKenzie and Susan McDonald — voted against Labor's hate speech laws, in line with a party decision but in defiance of an agreed shadow cabinet position to vote in favour.\n\nThe trio later tendered their resignations to Ley, which she accepted.\n\nBut the move triggered a furious response from Littleproud and the Nationals, who resigned from shadow cabinet en masse and caused the Coalition collapse.\n\nSpeaking at the press conference on Sunday, Littleproud said the fall-out was \"disappointing\".\n\n\"The Coalition isn't one party, but we're two parties and we've been able to work together. But when it matters, we've got to be able to say to the Australian people what we stand for.\n\n\"And that's the maturity and leadership that I thank Susan for, that we've been able to say we've got to find a better way forward.\"\n\nThe reunification comes during a seismic shift in Australia's right-wing political landscape, with minor-party One Nation surging past the former Coalition partners in some polls.\n\n— With additional reporting from the Australian Associated Press.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-measles-cases-are-on-the-rise/sxtbm9vr7",
        "title": "'Spreads like wildfire': Why measles cases are on the rise and what we should do about it",
        "publish_date": "Sun, 8 Feb 2026 00:20:59 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Health experts are concerned about the rise of measles in Australia, with 22 cases already reported this year, mirroring a global increase in the spread of the viral disease.\n\nAcross Australia, Queensland accounts for eight of those cases, while seven are in NSW, five in Victoria and one each in Western Australia and South Australia, according to Australian Centre for Disease Control (CDC) data as of 6 February.\n\nHealth authorities in Victoria noted in early February that a recent increase in measles cases was linked to overseas travel and warned that outbreaks of the highly contagious disease had been reported in popular Australian travel destinations, including Indonesia, Thailand and India.\n\nIndonesia, which became Australia's favourite international travel destination in 2023, had the highest number of cases between June and November 2025, according to the World Health Organization (WHO).\n\nTwo experts SBS News spoke to said increased international travel following the end of COVID-19 restrictions was partly behind rising measles infection rates in Australia.\n\nThey also cited vaccine scepticism, and an underestimation of how serious and contagious measles can be, as factors.\n\nMeasles can spread through air conditioning\n\nInfectious disease physician and clinical microbiologist Paul Griffin said some Australians underestimate the danger measles can pose to health.\n\n\"About one in 1,000 to one in 10,000 cases will lead to severe complications. And that could be a nasty pneumonia, for example, or could be brain inflammation and swelling that can lead to death or permanent disability,\" he said.\n\nHe also highlighted the extreme contagiousness of the disease.\n\n\"It's so infectious that you can be in an exposure site after someone with measles was there, even up to a few hours afterwards, and still get infected.\n\n\"It's one of these infections that can travel through air conditioning circuits, and we can see people be infected in other rooms if they're on the same circuit ... So it's spread very easily via the airborne route.\"\n\nChair of child and young person's health at the Royal Australian College of General Practitioners (RACGP) Dr Tim Jones agreed, telling SBS News: \"It spreads like wildfire. It's orders of magnitude more contagious than COVID was.\"\n\nUp to nine out of 10 people who don't have immunity will become infected after exposure to an infected person, according to the CDC.\n\nVaccine hesitancy and misinformation\n\nThe CDC also advises that two measles vaccinations are 99 per cent effective at preventing measles infection.\n\nHowever, Australian vaccination rates, particularly among children, have decreased in recent years.\n\nAccording to recent Department of Health data, around 93 per cent of five-year-olds have had all vaccines recommended for their age, while around 89.5 per cent of two-year-olds are fully vaccinated.\n\nThe department warned that, over the last three years, the nation's vaccination rate has dropped below its aspirational target of 95 per cent, which it says is needed to reach the \"herd immunity\" required to stop the spread of vaccine-preventable diseases such as measles.\n\nThe Australian Medical Association issued a call in December last year for \"immediate action to combat vaccine hesitancy and reverse declining immunisation rates across the country\". Source: Getty / Halfpoint Images\n\nBoth experts interviewed by SBS News pointed to vaccine hesitation as driving the increased spread of measles, with Griffin saying it was \"getting harder to convince people to make the right decision and get the vaccine\".\n\nJones said the years of COVID-19 restrictions and mandates had induced a hesitation about vaccination in some Australians.\n\n\"Families are just burnt out after COVID. They were tired of the constantly changing advice that was given on vaccination. So they're sceptical about whether the [measles] vaccination truly is as important as we say it is.\"\n\nJones said that, in his experience as a doctor, sitting down with families and discussing the risks associated with the disease changed most people's minds.\n\n\"What I find I need to do as a clinician for those families is to put what was happening in COVID in context — that things were changing very, very quickly — versus something like measles, where it's a disease that's been around for a very long time.\n\n\"We know it very well, and the vaccinations that we've been using have also been around for a long time, and we know what they are.\"\n\nMajor outbreak to elimination to a tripling of cases\n\nIn 1994, Australia faced a major measles outbreak with 4,794 confirmed cases. It was that year that the two-dose vaccination schedule was introduced for children aged between 10 and 16 years old.\n\nAt first, vaccination rates were low, but by 2000 they were sufficient to reduce the circulation of the virus, according to the Communicable Diseases Network Australia.\n\nThe two-dose vaccine offers 99 per cent protection against illness and serious complications, according to the CDC\n\nMeasles often comes with flu-like symptoms — such as a fever and runny nose — but it's important to also look out for a rash, cough and conjunctivitis, which are tell-tale signs of measles.\n\nThe National Immunisation Program now includes two doses of the measles vaccine for children aged 12 and 18 months. Source: AAP\n\nSince 1994, most Australians have received their vaccination as part of the National Immunisation Program (NIP).\n\nIn 2014, measles was declared eliminated in Australia by WHO due to the endemic measle strain not circulating for several years — thanks to the effectiveness of the vaccine.\n\nHowever, cases continue to occur in Australia, mostly in those who have travelled overseas.\n\n\"What we need to recognise is that what's kept those numbers down is consistently keeping the measles vaccination rate in Australia over 95 per cent of our population. And that's a number that's been steadily slipping over the last few years,\" Jones said.\n\n\"We've seen a tripling of measles cases in Australia over the last year ... I do think there needs to be some, at least a mild degree of, concern about what's going on.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/chinamaxxing-trend-and-why-everyone-want-to-be-chinese-now/n2607p6zg",
        "title": "The Trump effect and 90s nostalgia: What's behind the rise in 'Chinamaxxing'?",
        "publish_date": "Sat, 7 Feb 2026 19:34:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Videos of people drinking hot water, wearing slippers at home and boiling apples have gone viral on social media, as creators look to emulate traditional Chinese practices. But the trend, known as 'Chinamaxxing', has sparked mixed responses from those of Chinese heritage.\n\nSome of the videos feature people of non-Asian backgrounds embracing Chinese food customs, such as drinking soup for breakfast, and adopting Traditional Chinese Medicine (TCM) practices, with creators proclaiming, \"You met me at a very Chinese time of my life\".\n\nOne TikTok video of a young man eating steamed buns has been viewed 1.4 million times since being posted in October.\n\nChinese Australian content creator Vanessa Li says she found the trend interesting when she first saw it, and initially thought it was cool that people were embracing Chinese culture, but now she has mixed feelings about it.\n\nI'm seeing Chinese culture be reduced to very consumable aesthetics such as wearing slippers or the Tang jacket, or going to yum cha.\n\n\"I [also] wonder if it's something that people are adopting because, right now, it's trendy and therefore it's cool ... [and] it's going to get you [social media] engagement.\"\n\nHow did being Chinese become cool?\n\nSome of the content appears to have been inspired by a line in the 1999 movie Fight Club, where the protagonist says: \"You met me at a very strange time in my life\", which creators have appropriated to \"a very Chinese time\".\n\nDr Jennifer Beckett, a senior lecturer in media and communications at the University of Melbourne, says the videos became a trend in late 2025.\n\n\"It was bubbling away slightly in the background in mid-2025 and then it just really takes off.\"\n\nMore recently comedian Jimmy O Yang posted a TikTok video referencing the catchphrase while wearing a traditional Tang-inspired jacket released as part of Adidas' Chinese New Year collection designed by Canadian-born Hong Kong performer and designer Edison Chen.\n\nSome Chinese influencers are also hopping on the trend, providing tips to followers on how to be a \"Chinese baddie\". Other videos talk about 'Chinamaxxing' — essentially wanting to maximise Chinese attributes.\n\nDr Fan Yang, a research fellow on digital technologies at the University of Melbourne, says she first noticed the trend on Xiaohongshu, the Chinese lifestyle app (also known as RedNote), which became popular with Americans last year ahead of a threatened US ban of TikTok.\n\nYang recalls seeing a British vlogger putting goji berries into her tea and talking about how good it was.\n\n\"This is interesting because on the Chinese internet, on RedNote, we've seen people embracing so-called Western culture [and the fact that] it is not good to drink hot water anymore because the hot water [burns] your throat.\"\n\nWhat's driving the trend?\n\nBeckett says although the \"Chinese time in my life\" videos started in America, and the trend remains predominantly US-based, social media users in countries such as Australia are seeing it because of the dominance of US-based content on platforms such as Instagram and TikTok.\n\nShe believes the current state of US politics and global instability is playing a part in the rise of Chinamaxxing.\n\nPeople appear to be drawn to a sense of community amid the ramping up of the US government's rhetoric about \"who belongs and who doesn't belong\", Becketts says.\n\n\"[It's] almost like nostalgia for a Western idea of what collectivism and community looks like,\" she says, adding that it's something they feel they are missing.\n\nThere is something really nostalgic about looking at a collectivist culture like China.\n\nAnother factor that may be driving the trend is the uptick in wellness culture, and the move away from Western medicine.\n\nThis could also be in part linked to the Make America Healthy Again (MAHA) movement led by Robert F Kennedy Jr, which emphasises reducing ultra-processed foods, removing food dyes and reviewing vaccine safety, she says. The movement has been met with backlash from public health officials over its promotion of anti-vaccine sentiment and unsubstantiated medical claims.\n\n\"There's also an element of it [Chinamaxxing] which is really about slowing down and responding to the [seasons], and sort-of anti-tech.\"\n\nThe embrace of wellness trends in the United States may have influenced people to try traditional Chinese ways of living. Source: Getty / d3sign\n\nCultural exchange increasing on social media\n\nThe third aspect influencing the trend may be the cultural dialogue fostered on Xiaohongshu, which has changed following an influx of Americans who joined the platform last year.\n\n\"[The rush of Americans onto the platform] saw a lot more cultural exchange between young Westerners and young Chinese people,\" Becketts says.\n\n\"Xiaohongshu — which had until then been a completely Chinese language platform — is now suddenly a dual language platform, and the cultural exchange that [has been] going on there [is] fascinating.\n\nThere was a lot of breaking down of stereotypes on both sides.\n\nYang agrees RedNote has facilitated cultural exchange between Chinese people and the rest of the world, and this is also partly due to how easy it is to get an account.\n\nUnlike other popular Chinese platforms, such as WeChat and Weibo, which require a Chinese national ID to verify an account, RedNote only asks for a valid mobile phone number.\n\nTikTok refugees flocked to RedNote in January 2025 ahead of a threatened TikTok ban in the US. Source: AAP / CFOTO/Sipa USA\n\nChinese culture is being more widely distributed\n\nAnother type of content that could be influencing the Chinamaxxing trend are videos created by foreigners living in China; or videos showing quirky aspects of life, such as people as rapping while cooking, or doing tai chi.\n\nThese videos can encourage interest in the culture and are often redistributed outside of China by intermediaries — such as Chinese-based agencies managing vloggers.\n\nYang notes it's suspected that some intermediaries in China disseminate content showing the country in a positive light because they're paid by the government to do so.\n\nChina has also made it easier to travel to the country, with visa-free travel for Australia and many other European countries introduced in 2024.\n\nSo in this way the nation opens the door and gives foreigners access to make posts about the country, to understand the country, and to give foreigners opportunities to explore the country and culture as well.\n\nMore generally, Yang says people are seeing images and videos about China's rapidly evolving infrastructure and technological advancements — particularly via innovations in AI and electric vehicles, which are now competitive with those coming out of the US.\n\nREAD MORE What is DeepSeek? The AI company overtaking ChatGPT\n\nThe Trump effect and 90s nostalgia\n\nThe framing of China's regime as authoritarian and America's as democratic may also be shifting amid recent coverage of Immigration and Customs Enforcement (ICE) raids in America.\n\nYang points to the sarcastic nickname \"Chuan Jianguo\" often used by Chinese netizens for US President Donald Trump, which translates to \"Trump the Nation Builder\".\n\nIt's a phrase that suggests Trump's policies — such as his trade war and treatment of allies — is actually helping China, and could be encouraging people to rethink their views of the country.\n\nYang says these complex issues could also be driving the Chinamaxxing trend.\n\nChinese netizens have started calling US President Donald Trump \"Chuan Jianguo\", a sarcastic nickname translated as \"Trump the Nation Builder\". Source: AAP / Shawn Thew/Consolidated News Photos/Sipa USA\n\nAesthetically the world is also embracing 90s nostalgia, Beckett notes, an era that saw fashion imbued with Chinese influences, including the wearing of traditional dresses such as the cheongsam (also called a qipao), and the study of Chinese medicine being brought into Australian universities.\n\n\"There's a distinct possibility that this is also part of a more generalised 90s nostalgia being picked up [on social media], hitting this particularly restless time in US politics and global politics, hitting this uptick in wellness trends — and it's just created a perfect storm,\" Beckett says.\n\n\"I think [we need to] watch where the trend goes. Look to see who's taking it forward and where it's going, and whether or not those people are people we should be concerned about.\"\n\nGeri Halliwell (right, with Nelson Mandela) embraced the Chinese traditional dress, the cheongsam, during her time in the Spice Girls in the 1990s. Source: Getty / John Stillwell/PA Images\n\nIs the Chinamaxxing trend positive?\n\nYang says so far, the trend of embracing aspects of the Chinese lifestyle is positive but she is concerned that it could also perpetuate stereotypes.\n\n\"Not every single Chinese person drinks hot water,\" she says.\n\nBut she is hoping the trend could also help to debunk myths around Asian food, including the use of MSG, which has long-been been stigmatised and labelled as unhealthy.\n\n\"Asian food is healthy, it's healthier than some foods like McDonald's because it is less processed — it's just more ingredients and more flavourful, it doesn't mean that it's not healthy,\" Yang says.\n\nOne part of the positive development is about accepting China's culture rather than opposing a culture that one doesn't know. [It's] about being willing to understand the culture rather than being afraid.\n\nYang says if it helps people to distinguish between Chinese culture and China's political system, that could also be a welcome development.\n\nTraditional Chinese soups often include goji berries and other herbs considered to be healthy. Source: Getty / South China Morning Post\n\nBut the intention of the content is very important.\n\n\"Are [these bloggers] trying to be part of the Chinese culture to be funny — which is also racism — or are they genuinely interested in learning more about the country [and culture]?\n\n\"They have to be catchy in order to get clicks, but catchy videos can also apply some kind of mockery, stigma, stereotypes or even new stereotypes.\n\n\"The negative side ... would be taking the culture at face value [saying] I want to be like this just because it's trendy, without knowing why.\"\n\nWhen being Chinese becomes a vibe\n\nPart of the reason why Li has mixed feelings about the trend is because of her experiences growing up.\n\nShe was teased about the food in her lunchbox, and more recently, points to the racism Chinese people suffered during the COVID-19 pandemic.\n\n\"I spent most of my teenage years trying not to be Chinese, I dyed my hair blonde, I only spoke English, and I really tried to remove myself from my culture.\"\n\nWhile it feels validating to see aspects of her culture that were previously ridiculed and othered being embraced, she's concerned about Chinese culture being reduced to a \"vibe and a trend\".\n\n\"It's kind of neglecting the fact that it's this whole value system and it's a lifestyle, and it's thousands of years of history and culture and traditions,\" Li says.\n\nWhen culture becomes a trend ... it becomes disposable, and given the nature of social media, the trends cycle so quickly.\n\n\"I worry that in a year's time, or even a few months' time ... will Chinese culture just be another thing that people thought was cool once and then discarded because it's not relevant anymore?\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/bad-bunny-to-make-history-at-super-bowl-sunday/u8z8cqbs2",
        "title": "From SoundCloud to the Super Bowl — Bad Bunny set to make halftime history",
        "publish_date": "Sat, 7 Feb 2026 08:07:42 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Puerto Rican musician Bad Bunny will perform at the United States' most-watched concert this weekend — the 2026 Super Bowl halftime show — fresh off Grammy Awards success for his latest album, Debí Tirar Más Fotos.\n\nThe album, described as a \"love letter to Puerto Rico\", became the first Spanish-language work to win the Grammy's top prize, Album of the Year, as well as Best Música Urbana Album. The album's fifth single, EoO, won Best Global Music Performance.\n\nIn his acceptance speech for Album of the Year, mostly delivered in Spanish, the rapper born Benito Antonio Martínez Ocasio dedicated the award to migrants.\n\n\"I want to dedicate this award to all the people who had to leave their homeland, their country, to follow their dreams,\" he said.\n\nThe 31-year-old artist, who was born and lives in Puerto Rico, has been outspoken on issues of colonisation, identity, and immigration.\n\nIn Debí Tirar Más Fotos — which translates to \"I should have taken more photos\" — Bad Bunny addresses Puerto Rican identity, the ongoing effects of colonisation, and the displacement of residents on the island, which is an unincorporated territory of the United States.\n\nHe used his Grammy acceptance speech for Best Música Urbana Album — awarded for Latin performers showcasing Latin urban styles — to criticise the US Immigration and Customs Enforcement (ICE) agency.\n\n\"Before I say thanks to God, I'm gonna say ICE out,\" he said, to fervent applause.\n\n\"We are not savages, we are not animals, we are not aliens. We are humans and we are Americans.\"\n\nHis protest at the event mirrored the pro-immigration and anti-ICE sentiment of other winners, including Olivia Dean and Billie Eilish.\n\nICE agents have been deployed in several cities since President Donald Trump took office last year to carry out the administration's mass deportation of suspected illegal immigrants.\n\nTwo civilians were shot and killed by ICE agents in Minnesota last month, triggering mass protests in cities across the country.\n\nHistory-making concert\n\nThe Super Bowl is America’s most-viewed television broadcast. A record 127.7 million Americans tuned in to watch the 2025 game, eclipsing the estimated 123 million viewership a year earlier.\n\nOn Sunday, Bad Bunny will make history as the first Latino and Spanish-speaking solo headliner at the Super Bowl. The halftime concert, now in its 60th iteration, has previously featured artists including Beyoncé, Prince, Rhianna and The Rolling Stones.\n\nSpeaking at a press conference on Thursday, Bad Bunny remained tight-lipped about his plans for the 13-minute performance, but said he wanted people to have fun.\n\n\"I want to bring to the stage, of course, a lot of my culture,\" he said.\n\n\"I really want people to have fun. It’s gonna be a huge party.\"\n\nBad Bunny began releasing music on SoundCloud in 2016 and has since risen to become one of the world's most-streamed artists.\n\nSinging in Puerto Rican Spanish about Latino and Puerto Rican pride, his music is often categorised as Latin trap, with influences of reggaeton — a popular Caribbean genre with roots in Jamaican dancehall — American hip-hop, and southern US trap music.\n\nWhen a verse on Cardi B’s 2018 hit I Like It pushed him into the mainstream, Bad Bunny already had more than a dozen top-40 hits on the US Latin charts.\n\nHis third album, 2020's El Último Tour del Mundo — meaning The Last World Tour — became the first Billboard number one recorded entirely in Spanish.\n\nHe was the most-played artist on Spotify from 2020 to 2022 and again in 2025, with nearly 20 billion streams.\n\nHe will tour Australia later this month, with two shows at Sydney's ENGIE Stadium on 28 February and 1 March.\n\nBad Bunny said he was excited for the Super Bowl performance.\n\n\"I grew up watching sport, playing sport, very bad,\" he laughed.\n\n\"But I do love sport. It's actually one of my favourite combinations, sport with music.\"\n\nTrump not attending\n\nTrump said he will not attend the game, telling the New York Post in January that the venue location in Santa Clara, California, was \"too far away\".\n\nAsked about the lineup, with American punk band Green Day opening the event, Trump said he was \"anti-them\".\n\n\"I think it's a terrible choice. All it does is sow hatred. Terrible,\" he said.\n\nLISTEN TO Bad Bunny prepares for Super Bowl halftime performance SBS News 01:02 English\n\nDuring his world tour last year, Bad Bunny did not play on the US mainland, saying he feared his fans would be targeted by ICE.\n\n\"There was the issue of, like, f—k ICE could be outside [the concert],\" he told i-D Magazine in September. \"And it's something that we were talking about and very concerned about.\"\n\nHe instead opted for a three-month residency in San Juan, Puerto Rico, which was estimated to generate $200 million for the local economy. Tickets were reserved nearly exclusively for locals over the 31-show run.\n\nWho is playing at the Super Bowl?\n\nThe New England Patriots will face the Seattle Seahawks.\n\nThe two teams competed at the 2015 Super Bowl, which the Patriots won.\n\nThe Patriots have won six Super Bowl titles, in 2002, 2004, 2005, 2015, 2017, and 2019. The Seahawks won in 2014 against the Denver Broncos.\n\nWhen is the game?\n\nThe Super Bowl will screen in the US on Sunday at 3:30pm local time which is Monday morning in Australia.\n\nThe game will be at 10:30am on Monday in NSW, the ACT, Victoria, and Tasmania, 10am in South Australia, 9.30am in Queensland and 7.30am in Western Australia.\n\nThe Super Bowl will be available to watch free-to-air on Channel 7, and online at 7plus.\n\nIt will be broadcast on Disney+, Foxtel's ESPN channel, or KAYO.\n\nThe halftime show, which usually runs for 12 to 15 minutes, is during the halftime break.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/in-pictures-milan-cortina-2026-winter-olympics-opening-ceremony/2tl518ldk",
        "title": "In pictures: Twin flames and message of unity open Milano Cortina Winter Olympics",
        "publish_date": "Sat, 7 Feb 2026 00:18:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian flag bearers Jakara Anthony and Matt Graham have led a small but enthusiastic team in the Milano Cortina Winter Olympics, with the parade of athletes split over four locations.\n\nIn an Olympic first, the main ceremony was held at the San Siro Stadium in Milan while athletes marched at different clusters across Italy. With competition venues dotting an area of about 22,000km it will be the most spread-out Games in Winter Olympics history.\n\nThe largest Australian contingent was in Livigno, some 250km from Milan in the Italian alps, where Olympic moguls medallists Anthony and Graham led a 23-strong team that included other freestyle skiers, as well as the team's snowboarders.\n\nFive ice skaters were marching in Milan, 10 sliders and alpine skiers in Cortina and only two in Predazzo, with Australia's female cross-country quartet skipping the ceremony to prepare for the skiathlon on Saturday (local time).\n\nWearing traditional green with gold beanies, Anthony and Graham rallied the troops with a traditional \"Aussie, Aussie, Aussie, oi oi oi,\" before setting off.\n\nIn another shift, the Olympic flame was lit in two cauldrons with former Italian champion skiers Deborah Compagnoni and Alberto Tomba given the honour in Milan and current alpine star Sofia Goggia, who will for compete Italy next week, lighting the cauldron in Cortina, 400km away.\n\nItalian torchbearers Deborah Compagnoni and Alberto Tomba light the Olympic cauldron in Milan. Source: Getty / Jamie Squire\n\nDuring the two-hour long ceremony American songstress Mariah Carey delivered the iconic Volare in Italian, there was a tribute to famous composers like Giuseppe Verdi and the late design king Giorgio Armani at the main stadium.\n\nTenor Andrea Bocelli wowed the 61,000 ticket-holders in Milan, while Italian pop singer Laura Pausini performed the Italian national anthem before Italian President Sergio Mattarella formally opened the 25th Winter Olympics.\n\nMattarella was introduced in a video suggesting he was arriving at San Siro by a tram driven by Italian motorcycle legend Valentino Rossi.\n\nAmerican singer Mariah Carey hit performed \"Nel Blu Dipinto Di Blu\" aka \"Volare\" to kick off the the 25th Winter Olympics. Source: Getty / Andreas Rentz\n\nInternational Olympic Committee (IOC) president Kirsty Coventry, overseeing her first Games since succeeding Thomas Bach last year, told the athletes to \"enjoy every second\".\n\n\"You'll show us what it means to be human. To dream. To overcome. To respect one another. To care for each other. You'll show us that strength isn't just about winning — it's about courage, empathy and heart,\" she said.\n\n\"Thank you for believing in the magic of the Olympic Games. The spirit of the Olympic Games is about so much more than sport.\n\n\"Let these Games be a celebration of what unites us — of everything that makes us human. This is the magic of the Olympic Games: inspiring us all to be the best that we can be — together.\"\n\nREAD MORE Your Milano Cortina 2026 Winter Olympics guide: Aussie athletes and how to watch\n\nThe Games bring together around 2,900 athletes from 92 countries who will compete for 116 gold medals. They are in first Games in Italy since Torino 2006.\n\nAfter Vancouver (2010) and Sochi (2014), Asia hosted the last two Olympics in Pyeongchang (2018) and Beijing (2022).\n\nSBS News has compiled some of the best photographs from the opening ceremony.\n\nIn pictures: Milano Cortina Winter Olympics opening ceremony\n\nFlagbearers Matt Graham and Jakara Anthony led the Australian contingent. Source: AAP / Dan Himbrechts\n\n93 countries are competing at this year's Games. Credit: Matthew Stockman/Getty Images\n\nMilan-born rapper Ghali performs Promemoria (Memorandum) by Gianni Rodari during the ceremony. Source: Getty / Sarah Stier\n\nPerformers form into the shape of the Milky Way. Source: Getty / Matthias Hangst\n\nPerformers form into the shape of the Milky Way. Source: Getty / Matthew Stockman\n\nItalian mezzo-soprano Cecelia Bartoli performing. Source: Getty / Alexander Hassenstein\n\nItalian actress Sabrina Impacciatore with performers on stage. Source: Getty / David Davies\n\nAn outside view of the San Siro stadium in Milan. Source: Getty / Alessandro Levati\n\nLaura Mattarella, (left) the first lady of Italy, Sergio Mattarella, (centre) the President of Italy, and Kirsty Coventry, president of the IOC, watching on. Source: Getty / Andreas Rentz\n\nHow to watch the Milano Cortina Winter Olympic Games from Australia\n\nYou can watch the Games on the Nine Network, its streaming service Nine Now or on Stan Sport.\n\nThe opening ceremony will be on Friday 6 February at 8pm (local time) — so 6am Saturday, AEDT.\n\nThe closing ceremony will be held on Sunday 22 February (Saturday 23 February AEDT).\n\nYou can view the full schedule of the Games' events here.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-sbs-talks-to-milduras-mayor-on-managing-heatwaves-and-overcoming-climate-change-scepticism/2f65oth3c",
        "title": "INTERVIEW: SBS talks to Mildura's mayor on managing heatwaves, and overcoming climate change scepticism",
        "publish_date": "Fri, 6 Feb 2026 22:04:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-does-where-you-live-in-australia-affect-your-income/zc6kzm5iq",
        "title": "Do you earn more or less than others working in the same job?",
        "publish_date": "Fri, 6 Feb 2026 19:36:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "The average wage in Australia is $1,611.10 a week, but this figure can change dramatically depending on where you live, your sex and occupation.\n\nEmployee Earnings and Hours data released by the Australian Bureau of Statistics on 23 January reveals which workers are the most highly paid and how wages vary by state.\n\nThe business survey was conducted in May last year and is completed every two years. The average wage figure includes people working part-time and full-time, as well as those in managerial roles.\n\nExcluding part-time workers and managerial staff — who have strategic responsibilities or oversee a significant number of employees — the survey found the average weekly wage for a full-time worker in Australia is $2,061 before tax.\n\nThe state with the highest average wage is the Australian Capital Territory (ACT), where full-time workers earn an average of $2,206 a week. This drops to $1,784 in Tasmania.\n\nWhen you exclude high-level managerial staff, workers in WA have the highest average wages for full-time adult employees in Australia.\n\nThe data also shows which Australian workers are earning more or less based on their industry and gender.\n\nMen employed in the mining industry are on average the highest-earning full-time workers, bringing home $3,319 a week.\n\nThe most highly paid women in the country are also those working in mining, earning an average of $2,750 a week.\n\nMen and women working in the mining industry earn on average the highest wages in Australia.\n\nThe most highly paid workers\n\nThat picture changes slightly when you look at specific occupations.\n\nThe highest-paid occupations in Australia — based on average weekly earnings for all employees — are anaesthetists, who earn $5,366 on average before tax, followed by surgeons on $4,159 and engineering managers on $3,939.\n\nAnaesthetists are the highest-paid workers in Australia based on average weekly earnings for all employees. Source: SBS News\n\nAverage wage data can be skewed by a few exceptionally high earners whose income can push the average higher. It's also important to note that these figures include part-time workers, who earn considerably less than full-time workers.\n\nThe data can also be broken down by gender, but there are some limitations to this, as it is not available for every occupation (anaesthetists are not included, for example).\n\nOf the occupations that do provide a breakdown, among women, the highest earners are engineering managers, who earn an average weekly wage of $3,818, and surgeons, who earn $3,752. They are followed by \"commissioned officers (management)\" — those employed in high-ranking positions in the defence forces, fire and police services — on $3,605.\n\nEngineering managers are the highest paid women on average. Source: Getty / chain45154\n\nAmong men, \"other medical practitioners\" takes the top spot with an average income of $4,990 a week. This is a category that includes dermatologists, emergency medicine specialists, obstetricians, gynaecologists, ophthalmologists, pathologists and radiologists.\n\nThey are followed by surgeons on $4,486, and commissioned officers (management) on $3,990.\n\nSBS News has created a searchable database, showing average wages for specific occupations. The figures include both part-time and full-time workers. Enter your occupation below to explore.\n\nGender pay gap is closing\n\nWhile average weekly earnings for different occupations appear to show a stark difference in what men and women are being paid, ABS head of labour statistics Sean Crick says comparing hourly pay is more useful when looking at the gender pay gap because women are more likely to work part-time than men.\n\nAcross all professions, men earned $50 an hour on average, while women earned $46.\n\nThe gender pay gap in May 2025 was 8.4 per cent, a 0.5 percentage point improvement on the figure two years prior, when it was 8.9 per cent.\n\nHow wages change depending on your state and age\n\nIncluding part-time workers, the ABS survey found those employed in the ACT have the highest average wage, earning $1,821 a week before tax.\n\nThose aged 45 to 54 in the ACT are the most highly paid age group in Australia, earning on average $2,456 a week, while those aged 20 years and younger in the territory are the fourth lowest earners, bringing home $497 on average.\n\nTasmania is the state or territory with the lowest average wage overall, with employees earning around $1,389 a week.\n\nBut the demographic with the lowest average wage in the country is South Australians aged 20 years and younger, who are paid around $464 per week.\n\nWorkers in the ACT are the highest paid employees in Australia. Source: SBS News\n\nNon-managerial staff exclude high-level managers with strategic responsibilities or who oversee a significant number of employees. Source: SBS News\n\nIt can also be helpful to look at median wages when seeking to understand what a typical Australian earns. The median wage is the middle value in a list of incomes ranging from lowest to highest — so half of all people earn more than that figure, and half earn less.\n\nIn Australia, the median wage is $1,436 a week — $1,674 for men and $1,250 for women. This includes both full and part-time workers.\n\nYou can find out more information about where your wages sits compared to others in the interactive below, which has been based on data from the latest ABS release on Characteristics of Employment, August 2025.\n\nInteractive design by Ken Macleod\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/markets/the-dark-side-of-ai-weighs-on-the-stock-market-after-tech-plunge-20260208-p5o0h3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The dark side of AI weighs on the stock market after tech plunge",
        "publish_date": "Sun, 08 Feb 2026 14:24:09 +1100",
        "category": "finance",
        "authors": [
            "Mike Isaac",
            "Joe Rennison",
            "Maureen Farrell"
        ],
        "text": "Advertisement\n\nAnalysis BusinessMarketsAI The dark side of AI weighs on the stock market after tech plunge Mike Isaac , Joe Rennison and Maureen Farrell February 8, 2026 — 2:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA washout in the stocks of software companies has been flowing through Wall Street this week, as investors realised the threat that artificial intelligence will displace businesses had arrived. While the prospect of AI disruptions has hung over the economy for years, a new set of tools released this week by a San Francisco start-up forced a sudden reckoning on Wall Street. Anthropic’s Claude app. A new set of tools released by the company last week sent tech stocks plunging. Bloomberg Software companies most at risk from the new tools were the hardest hit, as well as the investment funds that lend to these companies. But the sell-off helped push down the broader market. On Thursday, the S&P 500 turned negative for the year after falling on six of the past seven days. But it rebounded the next day, rising 1.5 per cent. AI has been like rocket fuel for stocks, driving prices to record highs in recent years. Since October, though, that exuberance has been fading, as some realities of this transformative technology have begun to sink in.\n\nAdvertisement\n\nNot only are investors growing worried that AI could render certain businesses obsolete, they are also questioning the growing piles of money that companies are spending on AI. On Thursday, investors were spooked by Amazon’s revelation that it planned to spend $US200 billion ($285 billion) on AI and other large investments this year, exceeding analysts’ predictions by $US50 billion; shares fell 7 per cent on Friday. Last week, Google’s parent Alphabet said it would spend as much as $US185 billion this year, and last week Meta said its capital expenses, in large part to support AI, could reach $US135 billion. In the software sector, the catalyst for the sell-off was the release on Tuesday by San Francisco-based artificial intelligence firm Anthropic of free plug-in software tools that allow companies to automate functions like customer support and legal services. Because they were created as “open source” software, any company can download the tools without paying for them. These plug-ins could replace the tools that companies currently sell to businesses. Another area vulnerable to AI are providers of software-as-a-service, or SaaS, a mode of delivering subscription-based computer programs over the internet instead of buying and installing them locally on one’s computer. New, free software models from AI companies have the potential to replace not only the SaaS business model but also much of the workforce behind it.\n\nAdvertisement\n\n“There have been a number of these big sell-offs of these SaaS stocks over the past few years as these software models have rolled out,” Open AI CEO Sam Altman said in an interview with TBPN, a tech-focused streaming show. “I expect there will be more.” Editor's pick Updated\n\nWorld markets More than $60 billion wiped from ASX in market rout Analysts have taken to calling the broad sell-off the “SaaSpocalypse”. Shares of companies like LegalZoom, LexisNexis and Thomson Reuters, which offer legal services and research, dropped as much as 20 per cent over the past week. They had mixed recoveries after their drop. Shares of Salesforce, which produces SaaS and customer relationship management software for sales workers, have fallen 25 per cent over the past month.\n\nAdvertisement\n\nEven companies catering to the arts have been hit. Shares in Adobe and Figma, which produce tools for artists, fell 9 per cent and 17 per cent over the past week, driven by fears that many of the bread-and-butter design tools they provide to creative workers could eventually be automated. The fervour for AI is not just affecting the software industry. The surge in AI spending has generated enormous demand for random-access memory, or RAM, a kind of chip required to produce the AI hardware built by these companies. Shares of Salesforce, which produces SaaS and customer relationship management software for sales workers, have fallen 25 per cent over the past month. Bloomberg On Wednesday, Qualcomm, which makes microprocessors for smartphones and computers that require RAM, said it faced uncertainty around how much demand it would have for its chips over the next two years. That is, in part, because the skyrocketing cost of memory could dampen consumer demand for new devices. Shares of Qualcomm are down about 20 per cent this year. Software companies have also been a favourite target of lenders of private credit, because the companies’ subscription-based business model provides a stable stream of income to support taking on more debt.\n\nAdvertisement\n\nPrivate credit deals, as the name suggests, are not public, but the loans held by related business development companies, or BDCs, are seen as a proxy for the industry. Roughly half the software debt held by BDCs, equal to about $US45 billion, comes due in 2030 or later, according to analysts at Barclays, raising worries about the length of time until these loans are repaid. The more time a borrower has to repay a loan, the more time there is for the borrower to default — or, in this case, the more time for a business to be displaced by AI. An exchange-traded fund run by VanEck that contains holdings in many of the major BDCs is down about 6 per cent this year and more than 20 per cent over the past 12 months. Even as Ares Management and Blue Owl Capital — two of the largest private-credit firms — reported results that Wall Street analysts largely applauded, the two companies couldn’t escape investors’ worries about AI disruption. Shares of Ares have fallen more than 20 per cent this year and Blue Owl’s have fallen over 16 per cent. On an analyst call Thursday, Blue Owl CEO Marc Lipschultz denied that AI posed a threat to its lending business.\n\nAdvertisement\n\n“We don’t have red flags, and, point of fact, we don’t have yellow flags. We actually have largely green flags,” Lipschultz said. Editor's pick Opinion\n\nMergers & acquisitions Why Elon Musk just created a $1.8 trillion space monster Stephen Bartholomeusz Senior business columnist Blue Owl chief financial officer Alan Kirshenbaum attributed the company’s challenges to “headwinds in private credit, AI, software”, as well as investors who want some of their money back. Analysts could find little to worry about in the firm’s results. “If you took the name off the top of the release and ripped through the details, you’d think that’s a pretty darn good quarter,” Evercore ISI analyst Glenn Schorr wrote in a note late last week.\n\nAdvertisement\n\nBitcoin, a retail-dominated market that tends to swing with some of the popular stock trades, also skidded, sliding as low as $US60,000, its lowest level since October 2024, before rising back towards $US70,000. On Wednesday, US Treasury Secretary Scott Bessent said during a congressional hearing that the government had no power to order banks to buy bitcoin in order to stem the price decline. As investors dial down their exposure to the more speculative bets like bitcoin and AI-related stocks, they are shifting towards previously unloved sectors that are seen as better insulated through periods of volatility. So far this year, energy stocks, consumer staples and the materials sector have all gained over 10 per cent while tech has languished. “After years of tech-driven market leadership, the balance of power is shifting as investors rotate toward traditional ‘old economy’ sectors,” said Angelo Kourkafas, a strategist at fund manager Edward Jones.\n\nAdvertisement\n\nThis article originally appeared in The New York Times. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: AI\n\nAnalysis",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/severe-tropical-cyclone-mitchell-headed-for-wa-coast-20260208-p5o0h7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Severe Tropical Cyclone Mitchell headed for WA coast",
        "publish_date": "Sun, 08 Feb 2026 13:21:28 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cartwright-injured-as-aussies-start-hot-at-perth-sevens-20260208-p5o0gx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cartwright injured as Aussies start hot at Perth Sevens",
        "publish_date": "Sun, 08 Feb 2026 12:35:33 +1100",
        "category": "sports",
        "authors": [],
        "text": "Australia’s rugby sevens men are rallying around Will Cartwright after the 22-year-old dislocated his shoulder in the opening minutes of their hoodoo-busting 21-14 win over New Zealand in the world series event in Perth.\n\nAustralia’s William Cartwright leaves the field after being injured in the match against New Zealand. Credit: Getty Images\n\nBut there was otherwise plenty to cheer about for the fans at the Perth Sevens on a scorching Saturday after both the home teams went unbeaten on the way to securing semi-final berths.\n\nThe Australian women posted wins over Great Britain (54-5), France (26-12) and Canada (38-10) to set up a semi-final showdown with the US on Sunday.\n\nThe Aussie men broke a nine-match losing streak to NZ before going on to beat France 29-14 and Great Britain 24-21, setting up a final-four match-up against South Africa.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/festival-brings-food-fireworks-and-brutally-honest-advice-from-asian-aunties-20260202-p5nyy9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane festival brings food, fireworks and brutal advice from ‘Asian Aunties’",
        "publish_date": "Sun, 08 Feb 2026 12:30:00 +1100",
        "category": "entertainment",
        "authors": [
            "Nick Dent"
        ],
        "text": "Advertisement\n\nNationalQueenslandEntertainment Brisbane festival brings food, fireworks and brutal advice from ‘Asian Aunties’ Nick Dent February 8, 2026 — 12:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nOne is a CSIRO scientist noted for her work with fruit bats. The other is a former Filipino TV celebrity, now employed at QUT. Together, they’re creating comedy gold. Himali Ratnayake and Janette McBride are the Asian Aunties, a burgeoning Brisbane improv duo whose chemistry was so palpable during their first on-stage appearance in 2025, audiences were urging them to team up. “We were a Big Fork Theatre Cage Match team, which means the audience votes for who they want to come back the next week, and we won 12 weeks in a row,” McBride says. Aunty Maria from the Philippines (Janette McBride) and Aunty Rani from Sri Lanka (Himali Ratnayake) have some blunt advice to offer audiences at the Brisbane Powerhouse. Nick Dent “We just became the aunties. We felt the chemistry, and the audience also felt it,” Ratnayake recalls.\n\nAdvertisement\n\nThe Asian Aunties both celebrate and eviscerate the figure of the “older female mentor” prominent in many Asian cultures. In their shows, Aunty Maria from the Philippines (McBride) and Aunty Rani from Sri Lanka (Ratnayake) ask the audience to write their problems on scraps of paper that go into a rice cooker to be plucked out at random. “We then give advice as the aunties,” McBride says. “It’s not always good advice,” Ratnayake adds, noting the characters are drawn from life. “When I go to Sri Lanka, aunties will ask me those annoying questions. There’s generally love at the core, but it does come across as very direct, and toxic.”\n\nAdvertisement\n\nMcBride’s character is based on her mother, who immigrated to Queensland in 1981. “She was a very sassy, funny lady and brutally honest. “This is therapeutic for us,” she laughs. Ratnayake got her PhD at the University of Melbourne and is noted for developing the Flying Fox Heat Stress Forecaster as part of her CSIRO research into biosecurity. She discovered improv at a point in her life when she needed a change and was “saying yes to everything”. McBride left Brisbane as a teenager seeking fame in the Philippines. She was swiftly cast in films, TV productions including Tabing-Ilog (a Filipino answer to teen drama Dawson’s Creek), and was co-host of a talk show, Talk TV, that was cancelled after a year. Back in Brisbane, she has produced the BrisAsia Comedy Gala for the last five years at Big Fork Theatre in the Valley.\n\nAdvertisement\n\nThe show is transferring to the larger stage at the Brisbane Powerhouse for the first time on Saturday, February 14, with a line-up of local and interstate acts. Michael Hing (The Project) is hosting, and stand-ups include Urvi Majumdar, He Huang, Ting Lim, Jo Gowda and Ashwin Segkar. Run by the Brisbane City Council, BrisAsia (February 13-22) marks Lunar New Year across town with food, music, art and performances. McBride says Brisbane is a more welcoming and diverse city now than when she was growing up. “There weren’t too many mixed-race kids at that time, and so me and my brother were bullied, and asked if we were Chinese or Japanese – there could just be two. “Now it is more multicultural, and we embrace who we are.”\n\nAdvertisement\n\nBrisAsia Festival 2026: 10 more highlights Southside by Night\n\nCar culture fans bring their hot rods to this mix of hip hop and street food. Unidus Community Centre, Willawong, Friday, February 13, 5-9pm. BrisAsia Sk8 Zone\n\nAsian-Australian skateboarders showcase kickflips and tricks, and hold a workshop for rising skaters. Bracken Ridge Skate Plaza, Fitzgibbon, Saturday, February 14, 9am-12pm. ON:STAGE K-pop Showcase\n\nTalented dance crews present original choreography and creative stage concepts showcasing the growing influence of Korean pop culture across Australia. Thomas Dixon Centre, West End, Saturday, February 14, 4pm & 6.30pm. Vietnamese Lunar New Year Festival\n\nThe festival features Vietnamese cuisine, lion dances, fireworks, a traditional costume parade, martial arts, calligraphy, folk games and children’s rides. C.J. Greenfield Complex Park, Richlands, Saturday, February 14 5.30-9.30pm.\n\nAdvertisement\n\nHyoshi in Counterpoint\n\nA free all-ages concert by this South Australia all-female Asian fusion band. Queensland Multicultural Centre, Kangaroo Point, Saturday, February 14, 7.30-9pm. Related Article Exclusive\n\nFood Tassis Group’s Aunty arrives, and perhaps isn’t quite what you think it is Lunar New Year in the Gardens\n\nA kaleidoscope of traditional music, dance and theatre from across Asia presented by Kelly Higgins Devine and Ashwin Segkar. Brisbane Botanic Gardens Mt Coot-tha, Sunday, February 15, 4-6pm. Lunar Soul Party\n\nThis party on the Kite Terrace has performances from Neo Soul DJ Saie, hip-hop artist Chong Ali, and Chinese opera singer Zi Wang, as well as food and drinks. Thomas Dixon Centre, West End, Tuesday, February 17, 6-10pm. Lunar New Year\n\nWatch the lion and dragon dances in the mall, and ring in the Year of the Horse. Chinatown Mall, Fortitude Valley, Saturday, February 21, 2-9pm.\n\nAdvertisement\n\nDiscover Improv Comedy Workshop\n\nJanette McBride leads you through the fun of unscripted acting in this introduction to improv comedy workshop. Big Fork Theatre, Fortitude Valley, Sunday, February 22, 1.30-4.30pm. Sunnybank Lunar New Year Rooftop Party\n\nBrisbane’s biggest Lunar New Year fireworks display happens alongside lion and dragon dance performances and activities for the kids. Sunnybank Plaza, Saturday, February 28, 5-8.30pm. Get alerts on significant breaking news as happens. Sign up for our Breaking News Alert.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/savannah-guthrie-willing-to-pay-ransom-for-safe-return-of-mother-20260208-p5o0gs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Savannah Guthrie willing to pay ransom for safe return of mother",
        "publish_date": "Sun, 08 Feb 2026 12:19:40 +1100",
        "category": "finance",
        "authors": [],
        "text": "Savannah Guthrie willing to pay ransom for safe return of mother\n\nSavannah Guthrie said she is willing to pay a ransom for the safe return of her mother in a video message to the potential kidnappers of Nancy Guthrie.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/streamer-kicked-out-of-phoenix-open-20260208-p5o0gh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Streamer kicked out of Phoenix Open",
        "publish_date": "Sun, 08 Feb 2026 11:50:13 +1100",
        "category": "finance",
        "authors": [],
        "text": "Streamer kicked out of Phoenix Open\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/brisbane-now-more-expensive-than-sydney-for-first-home-buyers-20260208-p5o0fs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane now more expensive than Sydney for first-home buyers",
        "publish_date": "Sun, 08 Feb 2026 11:32:19 +1100",
        "category": "finance",
        "authors": [
            "Brittney Deguara"
        ],
        "text": "First-home buyers in Brisbane have been dealt another blow, with new data showing entry-level homes are now more expensive here than in Sydney.\n\nNew figures from property data firm Foundit showed that while Sydney remained more expensive overall, Brisbane had surpassed it on the lower end of the spectrum.\n\nDuring the past year, only 3.2 per cent of homes sold for under $500,000 in the Greater Brisbane area, compared with 4 per cent in Greater Sydney.\n\nNew data shows homes under $500,000 are rarer in Brisbane than Sydney now. Credit: Courtney Kruk\n\nThe report found the most homes to go to market in that price range were mainly apartments and townhouses in the CBD, Woodridge and Beenleigh.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-making-90-an-hour-in-male-dominated-industry-with-huge-shortage-so-much-flexibility-020023899.html",
        "title": "Aussie making $90 an hour in male-dominated industry with huge shortage: 'So much flexibility'",
        "publish_date": "2026-02-08T02:00:23Z",
        "category": "finance",
        "authors": [],
        "text": "An Australian woman has shared the benefits of her well-paid job, which she can do whenever she wants, wherever she wants, across the country. Gold Coast woman Pamela Sanchez works the hours she chooses in a high-demand role across Australia.\n\nThe mum said she became a driving instructor five years ago, wanting a role with more flexibility so she could spend more time with her kids.\n\n\"It's been really enjoyable,\" she told Yahoo News, adding it's \"incredibly rewarding\" seeing learners pass their tests and go on to enjoy the freedom a driver's licence can offer.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPamela spends her days teaching learner drivers across the northern part of the Gold Coast. Her students are \"really diverse\" and range in age from 16 to 89.\n\nShe's just one of a dwindling number of female driving instructors across the country. Research conducted by EZ Licence revealed women make up just 23 per cent of the 6,000 instructors across the country.\n\n\"The feedback I get constantly is that there are not a lot of us around,\" she said.\n\nShe thinks the industry is more male-dominated, with women preferring more \"professional\" roles.\n\n\"I am heavily booked most days,\" she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPamela says she's capable of restricting both the hours she works, and the locations she operates in, charging students $90 an hour for her expertise.\n\nHowever, she says, it's a great job for those looking for flexibility.\n\n\"It's wonderful for women who might be returning to the workforce, because it offers so much flexibility. From a woman's perspective, it's an ideal role.\n\nShe admits that anyone who becomes an instructor requires a \"calm disposition\".\n\n\"If you are an anxious driver or you find you get nervous in heavy traffic conditions, you’re going to pass that feeling on to someone new and learning,\" she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"You don't need to be the best driver in the world, but very patient and very calm. It’s a critical thing that you remain calm when things are not ideal.\"\n\nDriving school hopes to 'close the gap' in driving instructors\n\nAccording to national driving school EZ Licence's Ross Rivalland, female driving instructors are in \"short supply\" across the country and in high demand among learners who prefer to train with a woman.\n\n\"Closing this gap could give learners more choice and help them feel confident with the instructor they pick,\" he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"At the same time, this shortage creates a fantastic opportunity for women seeking a flexible and fulfilling career.\n\n\"If you’re exploring a career change or want to make a real impact, EzLicence can guide you on how to become a driving instructor and get started on this rewarding path.”\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]