[
    {
        "url": "https://www.9news.com.au/world/donald-trump-says-he-will-still-sue-bbc-for-up-to-us-5-billion-over-documentary-edit/fe1bdac4-b1aa-487c-a203-1943c699404e",
        "title": "Trump vows to sue BBC for up to $7.7bn over documentary edit",
        "publish_date": "Sat, 15 Nov 2025 20:38:54 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "aprilU﻿S President Donald Trump has flagged his intention to sue the BBC for up to $US5 billion ($7.7 billion) over its documentary edit, despite receiving an apology from the broadcaster.\n\nThe BBC apologised to the president after airing an edited ﻿version of his speech on January 6, 2021, splicing two parts of his address which took place almost an hour apart.\n\nIn a letter to Trump, the British broadcaster's chair Samir Shah personally apologised for the edit of the speech and accepted it \"unintentionally created the impression that we were showing a single continuous section of the speech\".\n\nPresident Donald Trump speaks to reporters on Air Force One on his way to his Mar-a-Lago estate in Palm Beach. (AP)\n\nTrump's lawyer had previously sent the BBC a letter demanding an apology and threatened to file a US$1 billion ($1.5 billion) lawsuit.\n\nThe president said he still plans to sue the BBC, potentially now for a much larger sum.\n\n﻿\"We'll sue them for anywhere between a billion and five billion dollars, probably some time next week. I think I have to do it,\" Trump told reporters aboard Air Force One.\n\n\"They've even admitted that they cheated.\"\n\nThe legal dispute was sparked by an edition of the BBC's flagship current affairs series Panorama , titled \"Trump: A Second Chance?\" broadcast days before the 2024 US presidential election.\n\nA third-party production company spliced together three quotes from two sections of the 2021 speech, into what appeared to be one quote in which Trump urged supporters to march with him and \"fight like hell.\"\n\nThe US president said he still plans to sue the BBC, potentially now for a much larger sum. (Jack Taylor/Reuters)\n\nAmong the parts cut out was a section where Trump said he wanted supporters to demonstrate peacefully.\n\nTrump earlier declared the BBC was \"fake﻿ news\", adding that the people of the UK are \"very angry\" about the edit.\n\nHe said he would raise the issue with UK Prime Minister Keir Starmer.\n\n\"I'm going to call him over the weekend. He actually put a call in to me. He's very embarrassed,\" Trump said.﻿\n\nDirector-general Tim Davie, along with news chief Deborah Turness, quit on Sunday, saying the scandal was damaging the BBC and \"as the CEO of BBC News and Current Affairs, the buck stops with me.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/perth-dentist-six-figure-side-hustle-dr-grillz/581b67d1-6b11-4003-bf9e-521d32642bbb",
        "title": "Aussies pay this guy up to $5000 for what's in his mouth",
        "publish_date": "Sat, 15 Nov 2025 19:11:49 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Dr Maheer Shah didn't even want to be a dentist; now he's using his dentistry skills to run a six-figure side hustle making jewellery for your teeth.\n\nGrillz are removable dental accessories often made from gold and diamonds and Shah is the founder of one of Australia's only grillz businesses, Dr Grillz.\n\nHe can charge up to $5000 for a single removable set and right now, business is booming.﻿\n\nDr. Maheer Shah is a leading Perth dentist specialising in aesthetic dentistry - and making grillz on the side. (Supplied)\n\n\"Now I'm getting this demand for permanent work,\" Shah told 9news.com.au.\n\n\"I think the culture is moving in that direction – everyone's got so many tattoos now, and piercings, the permanent gold teeth and diamond teeth is probably the next phase.\"\n\nBorn in Nairobi and raised in the suburbs of Perth, Shah decided to pursue dentistry after hearing that a schoolmate's dentist dad only had to work three days a week.\n\nHe went in blind and admitted he didn't have much \"natural talent\". ﻿\n\nBut he persevered and completed his degree in 2015.\n\nThe idea for Dr Grillz﻿ struck him just a few weeks later, when he went to see his favourite DJs perform.\n\n\"I won some backstage passes, so I met them before their show and they had grillz in,\" Shah said.\n\nThese are grillz, removable dental accessories often made from gold and diamonds. (Supplied)\n\nWhen he asked about the accessories, the DJs confessed they travelled abroad to buy them because grillz were so hard to find in Australia.\n\nShah immediately saw it as an opportunity.\n\nAfter the show, his mates wanted grillz of their own, so he connected with designers and jewellers to create them.\n\nIt became a hobby, one he shared online via his Dr Grillz Instagram page.\n\nMost of the dentists he worked with called it a \"gimmick\", insisting it wouldn't amount to anything.\n\nBut Shah's social media page had started to gain traction.\n\nBefore long, total strangers were reaching out to order custom grillz.\n\nStill working full-time as a dentist, Shah slowly built a team of designers, jewellers and technicians to help bring each set of custom grillz to life.\n\nShah has built a team of jewellers, designers and technicians who keep Dr Grillz going. (Supplied)\n\nHe did most of the work for Dr Grillz between appointments or on weekends, but Shah didn't mind dedicating that time to a creative outlet.\n\nAnd at up to $5000 a pop, grillz were becoming a lucrative little side hustle.\n\n\"A little silver tooth would maybe be $200 or $300, and if you wanted a little tooth gem that's somewhere between $30 and $50,\" Shah explained.\n\n\"But then, when the pieces start to get bigger, covering multiple teeth, then it'll move to that $500 to $1000 mark.\n\n\"And then when you add diamonds, or if they're very big pieces, it goes into the thousands – up to $5000.\"\n\nHe charges even more for permanent work, though it's not something he does often.\n\n﻿On one occasion, Shah created a custom gold and diamond implant worth several thousand dollars to replace a patient's missing tooth.\n\nThis gold and diamond permanent tooth implant was created to fill the place where a client was missing a tooth. (Supplied)\n\nBut he's reluctant to do anything permanent that could damage a patient's natural smile – even though he could charge tens of thousands for it.\n\n﻿\"I'm still a dentist, my job is to protect your teeth,\" Shah said.\n\nDr Grillz is now a six-figure business and Shah will soon be opening a grillz studio in the Perth suburb of Northbridge.\n\nGetting to this point hasn't been easy but the challenges he's faced building this side hustle are nothing compared to his day job.\n\n\"The mishaps you have in dentistry, the complications and pain and bleeding, is a way worse headache than grillz ever will be,\" he said.\n\n﻿At least his Dr Grillz clients are happy to see him – unlike many of the patients he sees working full-time across two private dentistry practices.\n\n﻿\"When you work as a dentist, no one's really that excited to see you,\" Shah laughed.\n\nAustralian musician Mia Rodriguez shows off a custom set of grillz from Dr Grillz. (Supplied)\n\nBut he never considered giving up work as a dentist to focus on Dr Grillz alone.\n\nAbout 55 per cent of Australians are currently earning money from a side hustle, or actively considering starting one, according to Westpac data.\n\nLike many of them, ﻿Shah has had to play it smart with his money to keep his business going.\n\nWithout his salary as a dentist to fall back on, he doubts Dr Grillz would be as successful as it is today – if at all.\n\n﻿He urged other Aussies looking to build a brand or make cash on the side not to dive into a side hustle without considering how they'll pay rent when business is slow.\n\nShah encouraged other Aussies pursuing side hustles to keep their day jobs and focus on making smart money decisions. (Supplied)\n\nBecause there's nothing ﻿that can kill a small business quicker than poor financial planning.\n\n\"If you can have a job that pays your bills and things like that, then all the money your side hustle makes, you can reinvest into the business,\" he said.\n\n\"And even if that business doesn't grow into something that makes you $1 million, it will lead you into that next thing that might be the golden ticket for you.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-family-faces-fine-over-immaculate-lawn/b38e6366-7c60-4e2f-8c82-82da512bd6df",
        "title": "Family faces fine over 'immaculate' lawn",
        "publish_date": "Fri, 14 Nov 2025 09:22:09 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A Gold Coast woman is facing an ﻿$834 fine due to her family's \"immaculate\" lawn.\n\nAmanda Blair uses a high quality synthetic turf at her home which is low maintenance and helps her partner's son's allergies.\n\n\"When my partner was mowing at the previous home, the smell and the grass clippings and things like that just set him off,\" Blair said.\n\nREAD MORE: Health star ratings could be mandated as industry fails to meet target ﻿\n\nAmanda Blair uses a high quality turf at her home which is low maintenance and helps partner's sons' allergies. (A Current Affair)\n\nThe synthetic grass covers the front and back yards but it is the footpath patch that has made her local council see red.\n\nIn a letter, Gold Coast City Council advised her to rip it up or face further action.\n\n\"Get rid of it and put real grass down and then they will come in and inspect it,\" Blair said.﻿\n\nWhile fake grass on private property is widely allowed, council laws vary on footpath rules.\n\nIpswich City Council, just like the Gold Coast, doesn't allow it. Brisbane, Logan, the City of Moreton Bay and Redland councils require residents to apply for permission.\n\nPedestrian safety is a big consideration when councils weigh up artificial turf.\n\nOther factors can include the impact on neighbours and whether water can drain freely through it.\n\nREAD MORE: Australia now has a new leading cause of death\n\nThe synthetic grass covers the front and back yards but it is the footpath patch that has made her local council see red. (A Current Affair)\n\nGold Coast City Council fears turf could become a trip hazard and attract significant heat.\n\nIf residents don't comply they'll be fined $834 and council will remove the turf at the residents' expense.\n\nBlair's local councillor Nick Marshall is sympathetic.\n\n\"This is a really good example of where the resident has a really good reason for why they're doing what they're doing,\" Marshall said.\n\n\"They keep it really well maintained so I hope we can get a good outcome.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/gst-inequity-study-unsw-e61-institute-research/9475b147-a3dc-41fa-af72-bb3122c4d76d",
        "title": "Hidden issue in $80b tax leaving some Aussies thousands out of pocket",
        "publish_date": "Fri, 14 Nov 2025 19:59:36 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "The federal government is facing yet another call to overhaul the GST, with new research outlining the tremendous amount of unfairness baked into the current system.\n\nThe GST is the federal budget's third-largest source of income, behind income and company tax .\n\nFor 2022-23, the ATO collected $81.7 billion of it; the last federal budget forecast that figure will rise to $94.1 billion this financial year, and again to close to $100 billion in 2026-27.\n\nAustralians pay close to $100 billion in GST every year. But some cough up far more than others. (Photograph by Chris Hopkins)\n\nWhile ostensibly a flat 10 per cent rate on all goods and services sold, the number of exemptions on certain products means some Australians are paying almost 50 per cent more GST than others, even though they have similar spending habits.\n\nThe findings were published in a new report from the e61-UNSW Policy Research Partnership earlier this week, which outlined the levels of inequity in the current arrangements.\n\n\"Only around half of items attract GST,\" study co-author Dr Matt Nolan said.\n\n\"Our research finds these exemptions are causing a significant inequity where households which spend or earn similar amounts overall end up paying hugely different amounts of tax.\"\n\nAccording to the report, the amount of GST paid by low-spending households, who spend an average of $15,222 a year, ranges from $729 to $1354 – a difference of 46 per cent.\n\nFor an average household with about $37,500 in yearly expenses, there's a 37 per cent difference between the lowest and highest GST bills.\n\nThat figure eases again to 33 per cent for the highest-spending households, although in dollar terms that represents a difference of more than $2500 a year.\n\nThis is a clear example of \"horizontal inequity\", Nolan and fellow co-author Josh Clyne wrote, which brought about two clear issues in the tax system.\n\n\"As a fairness principle, horizontal inequity is bad as it involves making households contribute different amounts of tax when they have the same means to pay,\" the authors wrote.\n\n\"In terms of efficiency, taxing different consumption choices differently encourages people to change their decisions about what to consume solely due to taxation – leading households and firms to organise themselves in inefficient ways to avoid the tax (i.e. supermarkets no longer offering warm cooked chickens to focus on the untaxed cold cooked chicken substitute).\"\n\nFresh food is exempt from GST, but other food products aren't. (Dominic Lorrimer/AFR)\n\nA wide range of goods and services are currently exempt from GST, including fresh food, private health insurance, childcare, sunscreen, and charitable donations.\n\nNolan said a select few are the main culprits driving the inequity.\n\n\"For households with low spending or income, the main cause of the divergence is the type of food they buy,\" he said.\n\n\"While for high-spending and high-income households, exemptions for education and child care play a larger role.\"\n\nThe GST has frequently come under fire this year from economists who argue it needs to be broadened, given both sides of politics want to reduce income taxes despite the federal budget being in structural deficit.\n\nConsumption taxes are seen to do relatively little economic damage, and compared to other nations', the GST is relatively low, at 10 per cent compared to the OECD average of 19.4.\n\nUNSW economist Richard Holden and teal independent MP Kate Chaney put forward a proposal in August to increase the GST to 15 per cent and remove all exemptions from it .\n\nUnder the proposal, every adult would receive a $3300 \"basics rebate\", effectively providing a $22,000 GST-free threshold to ensure low-income households weren't left worse off.\n\nSimilarly, Nolan and Clyne called for all exemptions to be removed and to provide an annual rebate of around $900 to all adults, while keeping the rate set at 10 per cent.\n\nThey said the measure would be budget-neutral and remove the unfairness of the current system.\n\n\"In this scenario, people who earn and spend less are made better off, while those who are higher earners and spenders end up contributing additional tax,\" Clyne said.\n\n\"This is just one example of how GST could be redesigned so it no longer depends on what people buy.\n\n\"The exact form of compensation is up for debate, but it's clear we can reduce these horizontal inequities without punishing the most vulnerable.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/t100-dubai-chaos-hayden-wilde-pto/106014892",
        "title": "'What's going on?' Chaos erupts at Dubai triathlon",
        "publish_date": "Sun, 16 Nov 2025 01:55:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "Chaos has marred the T100 professional triathlon event in Dubai, with athletes confused over the number of laps they had completed on the bike and run legs.\n\nNew Zealand's Olympic silver medallist Hayden Wilde was the biggest casualty, the series leader missing the turn-off towards the second transition zone while leading the bike leg.\n\n\"He's missed the turn,\" Jack Kelly said in disbelief on commentary.\n\n\"Oh my God, he has missed transition. Jesus Christ Hayden, what are you doing?,\" added Jan Frodeno in co-coms.\n\n\"You're wrong buddy.\"\n\nLoading Instagram content\n\nAccording to some social media posts, it appeared there were cones still covering the entrance to the transition when Wilde passed it.\n\nRegardless of why he missed the turn though, Wilde, second-placed Frenchman Mathis Margirier and Belgian Marten Van Riel all had to complete an extra 8 kilometre lap, with no opportunity to either communicate their error or for the trio to turn back.\n\n\"Guys seriously, how can you do this?\" the commentator said.\n\nPreviously fourth-place British athlete Sam Dickinson rolled into transition and looked desperately confused as to where the leaders had gone, before setting off on the 18km run leg.\n\n\"I don't think they'll know what's happened,\" the commentator said as the new leading trio looked around at the empty bike stands on course.\n\nWilde, meanwhile, was left even more confused when he arrived in transition to see that he was not in the lead as he had expected.\n\n\"What's going on?\" he shouted at a spectator as he set out on the first of eight laps of the 18km run leg.\n\n\"You've done one extra lap on the bike,\" the spectator was heard shouting back.\n\n\"F***'s sake. That's bullshit,\" he said.\n\nLater in the run, he came up to race leader Morgan Pearson and asked him, \"What's going on?\"\n\n\"Apparently you did an extra lap,\" Pearson said.\n\n\"We did not. We were at 76k,\" Wilde replied.\n\n\"Were you?\" a stunned Pearson said.\n\n\"Yes,\" Wilde spat in disgust, racing on to try to limit the damage.\n\nHe completed the fastest run leg by far with 49:19 for the 18km, but finished eighth.\n\nIncredibly, that wasn't the last of the confusion.\n\nRun leg brings more chaos\n\nTowards the end of the eight-lap run leg, while the cameras focused on race leader Pearson, who was seemingly all set to win his first T100 race, footage immediately cut to German Mika Noodt crossing the line and raising the winner's tape.\n\nLoading Instagram content\n\n\"No buddy, you have not won this race. Oh my god,\" the commentators said on the coverage as Noodt shrugged his shoulders, looked around and then could be seen asking \"have I won?\" on the footage.\n\n\"What is going on here?\" said the co-commentator as Noodt shrugged his shoulders again and looked around before somewhat sheepishly celebrating.\n\n\"We're trying to work this out,\" the first commentator said, clearly baffled at what had taken place.\n\n\"Has Morgan Pearson now counted wrong as well?,\" the commentator postulated, trying to make sense of this latest turn of events.\n\n\"We're still trying to work out exactly what has happened here.\"\n\nSam Dickinson and Vincent Luis soon arrived behind Noodt, thinking they too had finished the race.\n\nConfused, they then watched the arrival of Pearson, who was shocked to see that his winning moment had seemingly passed him by, hijacked by people he thought were behind him in the race.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nWilde eventually flew home after a blistering run but was absolutely furious and demanded that the cameras leave him alone.\n\nMore than an hour passed as several athletes protested the result, with Pearson eventually crowned as winner.\n\nThe issue was a faulty lap counter, with World Triathlon and the Professional Triathletes Organisation (PTO) releasing a statement to that effect.\n\n\"Due to a technical issue with the lap counting board and timing, the official result for the Dubai T100 Men's race was determined after the 7th lap, which was the last known timing and follows World Triathlon guidelines,\" it read.\n\nAlthough Pearson was justifiably crowned the winner, the organisers will be left red faced by the shambolic finish to the event.\n\nNoodt was awarded second and Gregory Barnaby third. Luis was fifth, behind Jason West.\n\nThe T100 is a relatively new format, middle-distance race featuring a 2km swim, 80km bike and 18km run organised by the PTO, taking place around the world, with an event set for the Gold Coast in March 2026.\n\nOlympic triathlon distances are 1.5km run, 40km bike and 10km run, while traditional half iron-distance races feature a 1.9km swim, 90km bike and 21km run.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/louise-sheather-hero-of-blayney-toy-library/105994988",
        "title": "Librarian's toy story spanning six decades started in Sydney CBD",
        "publish_date": "Sun, 16 Nov 2025 01:07:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Louise Sheather has lined the walls of a quaint church hall in a quiet corner of central west NSW with shelves of toys.\n\nIt is a world away from the bustle of Sydney's CBD, but the former retail guru can draw a line between the two.\n\n\"I was a management trainee at David Jones in the 70s and I got a toy department to manage,\" Ms Sheather said.\n\n\"It was so successful it ended up taking about a third of the floor in Barrack Street.\"\n\nClever software and stocktakes mean the volunteer-run Blayney Toy Library works like a retail store. (ABC Central West: Micaela Hambrett)\n\nMs Sheather said the toys had to be rolled down in shopping trolleys from the main Elizabeth Street store to meet demand, as the seasonal pop-up department grew to include toy company representatives giving live demonstrations and a gift-wrapping team.\n\n\"I walked around helping people telling them, you know, 'At this age, this is fantastic,'\" she said.\n\n\"But what really rocked my boat was that every single child that got a toy knew it was going to work on Christmas Day.\"\n\nMs Sheather said that was because \"every single toy was tested\".\n\n\"If it had batteries, every single toy was sold with batteries separated out in the box,\" she said.\n\nSavings for families\n\nFour decades on, Ms Sheather is happy applying her vast retail and marketing insight to the tiny Blayney Toy Library.\n\nOnce again, her approach to her customers has yielded results.\n\n\"We love her,\" said Orange mum Kayla Melton.\n\nKayla Melton drives the hour-long round trip to Blayney because the toy library is so helpful. (ABC Central West: Micaela Hambrett)\n\n\"I don't know if we'd be there without her.\n\n\"She's like family — she just wants the best for your child.\n\n\"There have been toys there that Louise has suggested, and I'm like, 'Oh, no'. but they end up being [my daughter's] favourite toys.\"\n\nMs Melton said for $80 a year, her toy library membership had saved her \"thousands\" during a cost-of-living crisis.\n\n\"That's the price of two toys,\" she said.\n\n\"We're borrowing six toys every fortnight.\"\n\nThe Blayney Toy Library occupies a church hall on the main street. (ABC Central West: Micaela Hambrett)\n\nRallying community support\n\nWhen she was just 10 years old, Ms Sheather donated a doll to a little girl with impaired vision.\n\nIt was a moment she will never forget.\n\n\"She just stood there and she felt all over it and just cried with sheer happiness,\" Ms Sheather said.\n\n\"It was so moving. It still moves me.\"\n\nMs Sheather spent a year convincing the Rotary Club of Blayney to get behind the library idea.\n\n\"I think they thought it'd be a bunch of screaming kids but they realised it was great for the community,\" she said\n\nIt took her a month to upload the almost 600 items into a sophisticated software system that allows their usage to be monitored.\n\nEvery single toy part is numbered by hand and regular stocktakes mean unpopular toys are periodically sold to raise money for new acquisitions.\n\nLoading...\n\nMs Sheather said the meticulous work had given her a focus.\n\n\"I have an ill brother, and my best friend of 46 years died this year,\" she said.\n\n\"It's probably been the toughest year of my life.\n\n\" Being able to bring a bit of joy has been a really nice thing. \"\n\nChild development\n\nIn August, the library hosted speech and occupational therapists who provided free advice to families on the role of toys in childhood, especially for children experiencing developmental delays.\n\n\"We want therapists to recommend toys and then send families down here and say, 'You don't have to buy this expensive thing — your child is only going to need it for six weeks,'\" Ms Sheather said\n\n\"Their brains are growing so quickly, they need constant stimulation.\"\n\nToy Libraries Australia (TLA) project officer Adelle Suitor said the benefits of temporary toys went far beyond saving money.\n\n\"113 million toys end up in landfill after one year, which is crazy,\" she said.\n\n\"But it is the social connection as well.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/west-gate-tunnel-walkthrough-metro-tunnel-early-open/106014830",
        "title": "Government insists West Gate Tunnel is safe for walkthrough, reveals earlier Metro Tunnel opening",
        "publish_date": "Sun, 16 Nov 2025 01:05:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Victorian government has been forced to again defend the safety of the West Gate Tunnel as thousands of Melburnians took a first look at the new multi-billion dollar piece of infrastructure.\n\nThe government has also revealed major rail project, the Metro Tunnel, will open on November 30, a week earlier than previously announced.\n\nThe West Gate Tunnel is due to open to vehicles by the end of the year, but opened today for a \"Discovery Day\", allowing more than 50,000 people to walk through.\n\nBut the United Firefighters Union (UFU) urged people not to walk through the tunnel and told the government to call off the event due to safety concerns.\n\nMelburnians got their first look inside the new West Gate Tunnel on Sunday. (ABC News: Leanne Wong)\n\nDozens of firefighters also gathered at the tunnel on Sunday morning to hand out pamphlets explaining why they believe the tunnel should not yet be declared safe.\n\nUFU Secretary Peter Marshall said nobody should enter the tunnel until scenario testing had been completed.\n\n\"We know we don't have the capacity to access large parts of the tunnel if the air becomes unbreathable. We have no idea how our radios will work, or if they will work at all,\" he said.\n\n\"In some parts of the tunnel the only way out is through a maintenance tunnel beneath the roadway that carries high voltage equipment, can only be accessed by stairs, has an eight degree incline, and which may not have breathable air in a major emergency.\n\n\" In this environment, without any scenario testing having taken place, it is irresponsible to hold an event like this, and it should be called off until these significant issues are resolved. \"\n\nThe government is yet to reveal exactly when the West Gate Tunnel will open to vehicles. (Supplied)\n\nHowever, Transport Infrastructure Minister Gabrielle Williams dismissed the union's concerns.\n\n\"We simply would not be holding an event like this if it wasn't safe. We have emergency management plans in place. We work very closely with emergency services including Fire Rescue Victoria to make sure people are safe as they engage with this great new piece of infrastructure,\" she said.\n\n\"Safety is always at the forefront of our mind in both construction of this brand new piece of infrastructure and of course in time for us to open it to the public as well.\n\n\" We hold ourselves to the highest possible safety standards and we always will. \"\n\nShe was backed by Major Road Projects Victoria CEO Duncan Elliot who said four of the final six stages of testing had been completed.\n\n\"All the systems are working now, absolutely. The fire deluge systems are in place,\" he said.\n\n\"The scenario testing is obviously much more aligned to vehicles in the tunnel and getting people out of vehicles and exiting the tunnel safely.\"\n\nMs Williams was unable to give an exact opening date for the tunnel but said the $10.2 billion project would be launched before the end of the year.\n\nWilliamstown Road to be truck-free at night\n\nThe government has also announced night-time and weekend truck restrictions on Williamstown Road once the tunnel opens next month.\n\nWilliamstown Road will be declared a No-Truck Zone from 8pm to 6am on weekdays and from 8pm Fridays to 6am Mondays.\n\n\"It's a terrific game changer for the community, we're going to see such a difference in the western suburbs with this iconic project,\" Road Safety Minister Melissa Horne said.\n\nTrucks will be banned from driving on Williamstown Road in the evening and on weekends. (ABC News: Danielle Bonica)\n\nThe government has installed cameras along Williamstown Road to enforce the ban.\n\nThere'll be exemptions for grocery and parcel delivery vehicles.\n\nThe government said it is also rezoning land at Brooklyn and Tottenham to encourage container parks to move to better located areas.\n\nGovernment brings forward Metro Tunnel launch\n\nPremier Jacinta Allan also revealed the Metro Tunnel will open at the end of November, ahead of the previously announced launch date.\n\nThe tunnel was due to open in early December but Ms Allan said that opening has been moved forward.\n\nMs Allan said the confirmation and sign off from the national rail safety regulator had enabled the project to open earlier than scheduled.\n\n\"Over the next couple of weeks the final touches will be put to the timetable and the tunnel as we open the tunnel on November 30 with hundreds of additional services from November 30 that will be servicing communities across our city and state,\" she said.\n\nPrime Minister Anthony Albanese joined Ms Allan at the new State Library Station on Sunday to make the announcement.\n\n\"If there have ever been two leaders of respectively a state and a nation who are infrastructure nerds, you are looking at us right here,\" Mr Albanese said.\n\nMelbourne's Metro Tunnel will open on November 30. (Supplied: Victorian government)\n\nHe said the pair had spoken about the project for a decade, since his time serving in the shadow transport portfolio while in opposition.\n\n\"This was unplugging the system. This was the key to growth. You couldn't do other things with the network unless you fixed this central congestion which was here,\" he said.\n\n\"That is what the Metro will do. It opens up the opportunity for further investment, further expansion. The key to people getting around major cities around the world is always public transport, including this great city here of Melbourne\"\n\nThe tunnel will only carry a limited number of services until February, when a full timetable begins operation.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/young-people-in-regional-areas-tell-their-stories-abc-takeover/106004344",
        "title": "The 'takeovers' helping young people in regional areas have a voice",
        "publish_date": "Sun, 16 Nov 2025 00:45:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Toby is a 17-year-old from Ballarat in Victoria, and while he is still in high school, he has had some big challenges to overcome.\n\nHis father was diagnosed with lung cancer in 2021 and brain cancer earlier this year.\n\n\"I sacrificed [by] missing school to make the trip to Melbourne to support my dad in each and every way,\" Toby said.\n\nHis dad is now recovering, but the experience and rehabilitation process have been tough for Toby and his family.\n\nSo, to help deal with the stress, Toby loves to sing and bowl.\n\nHe started singing five years ago, winning an award for his performance of Nutbush last year.\n\nHe is also a high achiever at the bowling alley, winning the local league in 2021.\n\n\"That made me feel really happy. It was the best time of my life,\" he said.\n\nAllysa, 18, also faced challenges during her schooling.\n\nAllysa says she had a good experience with alternative learning after being bullied in high school. (BTN High: Joseph Baronio)\n\n\"From like the start of year seven, I didn't have a very good start to high school.\n\n\"[I was] relentlessly bullied all year, and I just needed a way out,\" she said.\n\nAllysa found her comfort in alternative learning, attending Yuille Park Community College, where she is the only year 12 student and the first to complete the Victorian Pathway Certificate.\n\nAllysa said she was grateful for the opportunities alternative learning had given her.\n\nShe said other people could benefit from hearing how it had helped her.\n\nJohn, 16, also attends Yuille Park Community College. He left home at 15, and his story is about becoming more independent.\n\nHe said it was important for others to hear stories like his because it might give them the confidence to speak up about their situations and raise awareness for youth mental health.\n\nThey are just three of more than 600 students from across Ballarat who have submitted their stories to ABC Takeover.\n\nJohn is sharing his story about leaving home at 15. (BTN High: Joseph Baronio)\n\nWhat is Takeover?\n\nTakeover is a storytelling competition created to give young people aged 15 to 19 in regional areas the skills and platform to share their unique personal stories with the rest of the country.\n\nIt is run by a team that is also responsible for Heywire, a similar youth storytelling initiative for people aged 16 to 22 that has been running since 1998.\n\nWhile Takeover has not been around as long, starting in 2022, the competition has broadcast the stories of 240 young people who live, work or study in Shepparton, Mildura, Melbourne, Lismore, Latrobe Valley, the WA Goldfields, and Burnie.\n\nTakeover has broadcast the stories of more than 200 young people, including in WA's Goldfields. (ABC: Mark Eiden)\n\nNow, the Takeover team has its sights set on Ballarat, where students such as Allysa say it can be hard for young people to have their experiences and opinions heard.\n\n\"It probably doesn't get out as much being the town it is,\" she said.\n\nHer classmate, John, 16, said, \"Mostly, everyone in Ballarat does go to Melbourne or interstate just to get their voice heard.\"\n\nHow does it work?\n\nTakeover begins by carefully choosing an area to host its events to make sure they have maximum impact, by considering things such as the youth population, number of government schools, diversity, and socio-economic status.\n\nSinging helped me survive depression and brain surgery Singing saw me through severe depression and brain surgery.\n\nOnce an area is chosen, Takeover facilitators visit schools and community groups and get to know the participants, asking things such as what brings them joy, what home means to them, what challenges they have had to overcome, and their strengths or skills they are working on.\n\nAnswers and ideas from those questions become stories and ultimately submissions for the Takeover competition.\n\nOnce written, the long process of reading each entry begins. There are more than 600 entries from Ballarat alone.\n\nJust 35 winners will be chosen.\n\nSix hundred entries in Ballarat will be whittled down to 35 winners. (BTN High: Joseph Baronio)\n\nA panel of judges, including members of the local community and previous Takeover and Heywire alumni, helps pick the winners.\n\nSwathi Shanmukhasundaram, who is a producer from Takeover, said narrowing it down could be very tricky.\n\n\"There are multiple things that go into it. The most important thing is: is this young person passionate about the thing that they're sharing? Is there a story structure in there that the producer can play with? And some of our best entries come from stories that were two lines.\"\n\nSwathi Shanmukhasundaram says young people, who do not see themselves as leaders, grow through Takeover. (Supplied: Swathi Shanmukhasundaram)\n\nThe winning stories are then broadcast on ABC television and radio.\n\nTakeover ends with a five-day summit that showcases the 35 winners' stories, with a red-carpet screening and ideas presentation.\n\nThe winners can talk with leaders about how to make their communities a better place to grow up in.\n\n\"They get leadership development, they get opportunities, and they're not always related to what's in their story,\" Swathi said.\n\n\"Sometimes it's about funding for their community, about learning something new, making friends. You never know what will come out of it.\n\n\" The growth that I've been able to see in some of the young people who don't traditionally see themselves as leaders is probably the most beautiful outcome for me. \"\n\nThe Takeover Ballarat Summit will take place in June 2026, and entrants such as Pat, 15, from Ballarat Specialist School say it will be an important event for the community and young people across the country.\n\nPat says it is important young people have an opportunity to talk about how they feel. (BTN High: Joseph Baronio)\n\nSubscribe to the BTN Newsletter Do you want to be notified when the next BTN High stories arrive? Join our weekly newsletter.\n\n\"I feel like young people definitely do deserve a chance to talk out their feelings, because of course, a lot of people have been saying they're the new generation. They're probably going to lead the world,\" Pat said.\n\nAlyssa said, \"I think it's important for all young people to tell the adults how it is and share their story and know that not everyone's the same, but we can all learn to accept each other.\"\n\n\"The more we share, the more it can inspire other young people.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/winton-hotel-sold-amid-booming-outback-pub-sales/106005676",
        "title": "Buying a business and place to live for the price of a house in Brisbane",
        "publish_date": "Sun, 16 Nov 2025 00:40:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Katherine Trembath has just bought an outback pub for the price of a house in Brisbane.\n\nThe 73-year-old said she was soaking up retirement in the seaside town of Hervey Bay when the Winton Hotel in central-west Queensland came calling.\n\n\"I was doing a trip around Queensland, and I thought, 'I need to be back out in the country', came across the pub and thought, 'Yep, this is the one,'\" she said.\n\nMs Trembath said it was her fourth time \"out of retirement,\" having owned motels in regional Queensland for more than 20 years.\n\nKatherine Trembath has spent the past week learning the ropes from Kevin and Jo Fawcett. (ABC Western Qld: Hannah Walsh)\n\n\"I like being active and you can't be more active than running a pub,\" she said.\n\nAccommodation broker David Faiers sold Ms Trembath the hotel and said although she had decided to come out of retirement, the price of housing in coastal areas was a driver for outback pub and hotel sales.\n\nMr Faiers was tight-lipped on the final sale price, but he said it was not too far off Brisbane's median house price of $1.126 million.\n\n\"What's changed is the cost of housing,\" he said.\n\n\"For a hotel like the Winton Hotel, for under $1.5 million, you buy a residence and [you can make] an income.\n\n\"[If] you go to the coast for instance, you don't get much for a million dollars anymore.\"\n\nIn her first week, Ms Trembath said she had learnt that everyone in Winton had a nickname and she was not allowed to change anything in the establishment.\n\nThere is a lot of history on the walls of the hotel, built in 1899.\n\nThe Winton Hotel in 1907. (Supplied: State Library of Queensland)\n\n\"I won't change anything; I'll just enhance it,\" Ms Trembath said.\n\n\"This is a family pub where locals can relax and enjoy the atmosphere.\"\n\nFormer owners Kevin and Jo Fawcett said they wanted to hand over the keys to the right person after running the hotel for 27 years.\n\n\"We turned away 10 or 12 prospective buyers until we found a nice lady to take the reins,\" Mr Fawcett said.\n\n\"That was important to us.\"\n\nJo and Kevin Fawcett sold the Winton Hotel to Katherine Trembath. (ABC Western Qld: Hannah Walsh)\n\nHe said it was their turn to retire to the coast.\n\n\"The fish and mud crabs are calling my name of a night-time,\" Mr Fawcett said.\n\n'Live and do business'\n\nWinton, a town of fewer than 1,000 people, boasts four pubs.\n\nBut the tourist season between May and October means thousands of thirsty travellers pass through.\n\nIn the past 12 months, Mr Faiers has sold two pubs and a motel in Winton.\n\nHe said sales across Queensland had been exceptional.\n\nDavid Faiers says hospitality businesses such as hotels and motels are a place to live and a source of income. (ABC Western Qld: Hannah Walsh)\n\n\"The market is very strong; there's a lot of natural migration,\" he said.\n\n\" People have identified that hospitality businesses, both hotels, motels and caravan parks, are a good source of income; it's a growing market, it's somewhere to live and do business. \"\n\nIn the nearby town of Longreach, a privately owned Australian hotel and property group has been snapping up businesses.\n\nWaymark Hotels now owns two pubs and a restaurant in the popular tourist town.\n\nBut Winton sales have remained with individual buyers.\n\nBernie Hogan, chief executive of the Queensland Hotels Association, said interest in regional hotels had increased in the past 18 months.\n\n\"I think people have realised what great businesses they are, what great investments they can be … and, as always, people … are looking for that change of lifestyle,\" he said.\n\n\"There are many success stories of people heading west and loving it.\"\n\nThe Australian Hotel in Winton was sold earlier this year. (ABC Western Qld: Hannah Walsh)\n\nBut Mr Hogan said running a regional pub was still challenging, with rising costs and transient staff.\n\nMr Faiers said sales worked in a cyclical nature.\n\n\"It's pretty typical what we see in the market — when somebody sells a business, other local business people are surprised with the value … it makes them start to think about their position and what their next steps are,\" he said.\n\n\"The cost of buildings [are] not dissimilar to housing, it's hard to get something built.\n\n\"That's helped the older buildings and businesses become more valuable, the structure is already in place.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/cop31-price-penny-wong/106014762",
        "title": "Wong won't put price tag on COP31 as final host decision looms",
        "publish_date": "Sun, 16 Nov 2025 00:39:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Foreign Minister Penny Wong has refused to say how much it would cost Australia to hold the COP31 climate conference, as negotiations over hosting rights enter the final stages.\n\nAustralia has pitched to hold next year's meeting in Adelaide in \"partnership\" with Pacific nations, but has been locked in a stand-off with Türkiye for months, with both parties refusing to cede their bid.\n\nClimate Minister Chris Bowen is currently at this year's Conference of Parties (COP) meeting in the Amazonian city of Belem, where he will continue to push Australia's case.\n\nBut even as the final decision on where the conference will be held looms, Senator Wong would not be drawn on the price tag if Australia's bid is successful.\n\nSome reports have put the potential cost at up to $2 billion, but the minister did not say whether that was accurate when it was put to her.\n\n\"I'm not going to comment on the costs of a conference that we haven't won the bid for yet,\" Senator Wong told ABC's Insiders when asked repeatedly what the cost would be.\n\n\" Obviously, those costs would be finalised, including with the state government and the scope of the bid. \"\n\nThe foreign minister said she anticipated that there would be a resolution to the deadlock by the end of the coming week, when this year's conference comes to a close.\n\nIf both countries are unable to come to an agreement, hosting rights will default to the German city of Bonn, home of the United Nation's committee.\n\nPrime Minister Anthony Albanese is due to travel to the G20 summit in South Africa next weekend, where Türkiye's President Recep Tayyip Erdoğan will also be in attendance.\n\nSenator Wong said the prime minister was \"looking forward\" to seeing the president but would not say whether the issue would be raised.\n\n\"Obviously, what the Pacific want for the conference and what Türkiye want are very different. So, we're going to keep advocating for the Pacific COP,\" she said.\n\n\"What I would say is, this does need to be resolved.\"\n\nDecision set for coming week\n\nThe government has already spent $7 million preparing to host the conference, Mr Bowen said on Saturday before he departed for Brazil.\n\nHe also confirmed that a decision would be made this week, noting that Australia had \"overwhelming support\" for its bid.\n\nBut because the decision was not made through a traditional ballot process, he said, the government would have to reach an agreement with Türkiye.\n\n\"That makes it difficult,\" he told reporters.\n\n\"I'll continue to have conversations with my Turkish counterparts in consultation with the Pacific over the next week or so, and we'll see how we go.\"\n\nThe government has said it wants to use COP31 to highlight urgent climate threats faced by Pacific nations and champion their calls for more ambitious action.\n\nTürkiye has previously proposed sharing the COP presidency with Australia, but the ABC understands the United Nations Framework Convention on Climate Change (UNFCCC) Secretariat has made it clear that co-presidencies are not permitted under its rules.\n\nClimate change debate swirls at home\n\nThe last ditch push for COP comes as climate change and emissions reduction dominated domestic political debate, after the Liberal Party this week announced it would join the Nationals in ditching its commitment to reach net zero by 2050.\n\nSenator Wong on Sunday characterised the opposition's decision as \"trying to outflank Pauline Hanson\".\n\n\"And what I'd say to Sussan Ley — and to Andrew Hastie and to Angus Taylor — is you can't be more Pauline than Pauline,\" she said.\n\nThe conundrum at the core of the Coalition's net zero backflip Liberal shadow cabinet members landed on a plan that has left many inside and outside the party bewildered and confused.\n\nShe added that the opposition's \"confused, divided\" approach to climate policy would result in higher costs for Australians, while the Coalition has argued that ditching the target is necessary to bring down power prices.\n\nThe prime minister also took aim at the Coalition during a press conference on Sunday, describing its approach to climate and energy policy as a \"clown show\".\n\n\"The real problem is that that kills off investment certainty, that kills off investment, and less investment means higher power prices,\" he said.\n\nOpposition Leader Sussan Ley this week confirmed the party would remain in the Paris Agreement and would continue to set five-yearly interim targets from government.\n\nAnd while the party would not actively strive for net zero, she said reaching it would be \"welcome\".\n\nThe Coalition will hold a joint-partyroom meeting on Sunday to determine a final policy.\n\nLiberal frontbencher Jonathan Duniam, who is part of the team leading the negotiations, said the ultimate decision would be in line with what the two parties had already announced.\n\n\"The key difference between our approach to this, and the government's, is we're focused on energy affordability,\" he said.\n\n\"They're focused on emissions reductions, no matter the cost. And that has cost Australia dearly.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/fourth-measles-case-confirmed-after-jelly-roll-concert/106014898",
        "title": "Fourth case of measles confirmed after Jelly Roll concert",
        "publish_date": "Sun, 16 Nov 2025 00:25:32 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A fourth case of measles has been confirmed after last month's Jelly Roll concert in Brisbane, prompting authorities to urge attendees to be alert for symptoms.\n\nQueensland Health's metro south unit said a person with the virus had been identified in the Logan region, after three cases linked to the October 24 concert at the Brisbane Entertainment Centre were confirmed on Wednesday.\n\nThe person was unknowingly infectious while visiting a number of places, including Mustangs Brothers Football Club on November 8, Mullein Pharmacy at Hillcrest on November 12 and Logan Hospital Emergency Department on November 12, 13 and 14.\n\n\"While these locations do not pose an ongoing risk, people who attended these locations during the same time periods may have been exposed to the virus and should monitor for symptoms,\" the metro south public health unit said in a statement.\n\n\"Contact tracing is underway and those who are identified as being exposed will be contacted.\"\n\nHealth Minister Tim Nicholls said contact tracing was continuing, with almost all of the cases coming from overseas.\n\n\"Anyone who has symptoms … I would say to you get medical advice but please don't come to an emergency department because that is how it gets spread,\" he said.\n\n\"What we want to do is make sure people are treated appropriately but we contain the spread of measles.\"\n\nMeasles is a highly contagious infection which can be associated with severe complications.\n\nSymptoms can include fever, a runny nose, a moist cough and sore eyes as well as a blotchy red rash.\n\nIt can start on the face and spread across the body.\n\nThe time from contact with the virus until onset of symptoms is typically 10 days but may be anywhere up to 18 days.\n\nThe most up-to-date list of locations can be found on the Queensland Health website.\n\nPeople who believe they have measles symptoms are urged to arrange testing with their doctor or call 13HEALTH (13 43 25 84) for advice.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/wa-government-accused-of-secrecy-abuse-of-power/106010294",
        "title": "Fractures and leaks in WA Labor's third term a blip, or a sign of more?",
        "publish_date": "Sat, 15 Nov 2025 23:59:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "The longer a government is in power, the more time it has to lay traps for itself.\n\nAccusations of secrecy and abuse of process have been levelled at the Western Australian government this week on several fronts.\n\nOn one end, the government was accused of hijacking the historical sexual abuse case of Dion Barber to protect its coffers.\n\nOn the other end, accusations were made about the government altering a secret report to justify its claims about fossil fuels.\n\nThe government has also been accused of altering a report to justify its claims about fossil fuels. (ABC News: Brendan Esposito)\n\nWhen the stories came to a head on Wednesday, WA Labor MP Sabine Winton diligently defended the government despite having little to do with the decisions behind these particular issues.\n\n\"We're not going to shy away from difficult conversations,\" she said.\n\nBut critics say that is exactly what the government is trying to do.\n\nPath to self-destruction?\n\nLawyer slams government's Dion Barber appeal A lawyer accuses the WA government of hijacking a case of historical sexual abuse to \"clarify law\", instead of legislating it through parliament, because it would be \"political suicide\".\n\nIn 2018 the WA government removed the time limit for survivors of historical sexual abuse to take legal action.\n\nThe government made it easier for abuse survivors to seek justice and now, surprise, surprise, more abuse survivors are seeking justice, and the state may have to fork out more in compensation.\n\nThe state of Western Australia is taking Dion Barber's $2.8 million compensation case back to court to try and limit its potential liability in future cases, or as the government keeps saying, to \"clarify points of law\".\n\nDion Barber was abused by his stepfather as a boy, taken into state care, and then sent back to live with him again. (ABC News: David Weber)\n\nThe government could try to seek clarity by introducing legislation through parliament, according to abuse lawyer Juliana Fiorucci, but won't.\n\n\"Because doing so flies in the face of celebrating being the government that enacted the legislation to allow these claims to pass in the first place,\" Ms Fiorucci said.\n\n\" That would be political suicide. \"\n\nRight or wrong, it seems the government may be trying to protect its bottom line while avoiding the difficult conversations.\n\n\"Some might say pursuing the appeal in those circumstances could be an abuse of process,\" Ms Fiorucci said.\n\nJuliana Fioruccia says the government could seek clarity by introducing legislation through parliament. (ABC News: Cason Ho)\n\nAttorney General Tony Buti said while he acknowledged Mr Barber's courage, it would be inappropriate to comment further as the matter was before the courts.\n\nIt doesn't look great when the government gives with one hand, but takes with the other, which may be why it seems like it's trying to keep the issue at arm's length.\n\nPremier Roger Cook literally said the appeal of Mr Barber's case was \"at arm's length\" because it was being sought by the government's insurance arm, the Insurance Commission of WA.\n\nSecret report altered\n\nIn another potential example of keeping its distance, the government quietly released a secret report this week that was supposed to justify claims WA's fossil fuels are critical to helping the rest of the world reach net zero.\n\nOne would think the government would jump on the opportunity to laud a $402,000 report it commissioned that supported its campaign to expand WA's gas industry.\n\nThe role of gas in Australia's energy transition is heavily contested. (ABC News: Andrew Seabourne)\n\nBut the report was tabled in parliament — eight months after it was finalised — just days after a draft version was leaked highlighting the \"substantial\" risk that WA's gas could hamper the transition to renewables.\n\nThe problem is, the government published the final report with changes throughout, which could be clearly compared to the original draft.\n\nAmong the changes, Asia's projected gas consumption was altered dramatically (it somehow doubled), and language describing the risks of gas was softened.\n\nThe government insisted the report by consultancy firm Deloitte \"was drafted and revised independent of government\", and said both the draft and the final versions supported its claims about the need for WA's gas — a claim rejected by the WA Greens.\n\nSophie McNeill says the tabled report downplays the risks of fossil fuels. (ABC News: Alistair Bates)\n\n\"They sat on it for months, they hid it from the public, and now they've come out with a version that downplays the risks,\" WA Greens MLC Sophie McNeill said.\n\n\"I just can't believe what an own goal this is by the government.\"\n\nUnited front under strain\n\nThere are questions to be asked about the veracity of these consultancy reports that underpin government policy.\n\nWhat has become clearer, however, is the longer a government is in power, the more difficult it is not to contort itself.\n\nIn the last week alone, an insider leaked the confidential gas report, and Labor backbencher Dave Kelly publicly spoke out against the appeal of Dion Barber's case — rarities in a government known for its solidarity.\n\nIt remains to be seen if this week's events are just blips, or fractures in a government wading through its third term in power.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/indonesia-free-school-meals-program-for-kids-in-schools-problems/106009984",
        "title": "More than 10,000 children poisoned by free school meals in Indonesia",
        "publish_date": "Sat, 15 Nov 2025 23:59:31 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Within minutes of eating a school lunch of chicken, rice, salad and strawberries, Aldo Revaldo started getting very sick.\n\n\"After finishing the food, I felt a headache, then a stomach-ache,\" the 17-year-old said.\n\n\"Then I struggled to breathe.\"\n\nAll around him, one by one, his classmates were also succumbing to a painful and overwhelming sickness.\n\nFootage from the school in Indonesia shows teenagers convulsing, vomiting and crying with pain.\n\nStudents seen receiving treatment at the Cipongkor District Hall in September. (ANTARA: Abdan Syakura)\n\nAmbulances took the sick children to a nearby sports hall and a town hospital, where some had to receive oxygen.\n\nAldo's father, Ade Jalal, said there was hysteria and mass panic.\n\n\"Parents there were crying,\" he said.\n\nMr Ade said he found Aldo in the corner having seizures.\n\nIn a video that went viral on TikTok, Aldo was filmed on a stretcher, crying in pain and foaming at the mouth.\n\n\"Both his arms were tied to the folding bed,\" Mr Ade said.\n\n\"They had to hold him down to put the IV [intravenous drip] in.\"\n\nLoading...\n\nAldo and his classmates fell ill after eating meals provided by the Indonesian government's Free Nutritious Meals program, known locally as MBG (Makan Bergizi Gratis).\n\nThe program was Indonesian President Prabowo Subianto's key election promise.\n\nBut since launching earlier this year, it has caused thousands of cases of food poisoning in children.\n\nMore than 130 children from Aldo's school in Cipongkor, West Java, were hospitalised in the mass outbreak of food poisoning in September.\n\nAcross the region, more than 1,000 children fell sick over the span of a few days.\n\nBut across the country, more than 10,000 have been poisoned since the program was launched.\n\nEstimates vary but JPPI, an Indonesian education-focused NGO, believes more than 16,000 children had become sick after consuming the food.\n\nThe Indonesian government's own figures, revealed in a parliamentary hearing last week, said 13,370 people had experienced \"health problems due to poisoning\".\n\nDespite the controversies, the government is pushing ahead with expanding the program.\n\nPlans to double number of free meal kitchens\n\nThe president's pitch was very popular: free meals for every school-aged child and pregnant mother, every single day.\n\nThe MBG program's goal was to address stunting, a condition where children's height is lower than average, often because of malnutrition.\n\nBut the program has been marred by poisonings, as well as concerns over its cost and allegations of corruption.\n\nLoading...\n\nIn some incidents, students in East Java and South Sulawesi found maggots in their meals, while children reportedly found shards of glass in rice in meals in the Riau Islands.\n\nFootage of mass poisonings play on Indonesia's local news regularly, galvanising a strong response across Indonesian NGOs and mothers' groups, who have called for the program to be suspended.\n\nBut there are still many supporters.\n\nThe free meals are popular with the enormous number of Indonesian families who live in poverty, or those who find feeding their children difficult when faced with the increasing cost of living.\n\nThe free meals program's rollout began earlier this year. (ABC News: Tim Swanston)\n\nIndonesia's National Nutrition Agency (BGN), which runs the program, said by the end of the month, it wanted to be providing weekday meals to more than 75 million children and pregnant mothers.\n\nMore than 14,000 kitchens across the country have been set up to support the program — and the nutrition agency wants to double that by next year.\n\nMany kitchens are run with oversight by Indonesia's military.\n\nLocal media has also reported that many kitchens are managed by local politicians, members of parliament, or residents near the kitchen sites.\n\nIn the wake of mass food poisoning events in September, Indonesia's president acknowledged \"deficiencies\" in the program. The government then issued kitchens with a range of guidance notes on sanitation, supervision, sterilisation and testing.\n\nPrabowo defended the record of the program, claiming the \"percentage of error\" of meals that caused sickness was just \"0.0017 per cent\".\n\nBGN head Dadan Hindayana also apologised, admitting \"negligence\".\n\nParents have held protests in the wake of the food poisoning outbreaks. (ABC News: Tim Swanston)\n\nCases of food poisoning have been blamed on improper ingredients and storage, poor sanitation, poor water quality, and slow meal distribution times.\n\nAt a parliamentary hearing on November 12, Mr Dadan identified another possible culprit: high nitrite levels in food.\n\n\"We found that nitrite infection is quite high, possibly because of farmers' cultivation practices providing too much nitrogen,\" he said.\n\n\"This results in high nitrite content in the plants, leading to frequent poisoning.\"\n\nOver the last few months, more than 130 kitchens have been suspended following poisoning events, with some reopening following testing and training.\n\nBut cases of food poisoning do not appear to have slowed down.\n\nBlame on 'kitchens that did not follow the rules'\n\nThe government has issued guidance to kitchens on sanitation, supervision, sterilisation and testing. (ABC News: Tim Swanston)\n\nAt a kitchen in East Jakarta, BGN-appointed kitchen head Tommy Afoan said kitchens had been ordered by the president to send in samples for testing, improve food quality, and recruit professional chefs.\n\n\"Based on our experience, food poisoning could be attributed to raw ingredients, contamination during storage, production or transportation,\" he said.\n\n\"There are so many factors … so we need mitigation on every level, to follow strict procedures to minimise the risk.\n\n\"I feel sad seeing the children suffering in hospital, caused by kitchens that did not follow the rules.\"\n\nTommy Afoan says kitchens have been ordered to improve food quality. (ABC News: Tim Swanston)\n\nKitchen nutritionist Achyar Fuadi said lab tests had been carried out for salmonella and E. coli.\n\n\"In some cases, small, remote kitchens don't have experience,\" he said.\n\n\"A problem could come from workers that are inexperienced, nutritionists that are less detailed … this could all lead to food poisoning.\n\n\"I work here for 12 hours from 6pm to 6am nonstop, to make sure things are correct.\"\n\nAchyar Fuadi works 12 hours a day to make sure the kitchen is up to scratch. (ABC News: Tim Swanston)\n\nBGN spokesperson Dian Fatwa said that for the agency, food safety was \"non-negotiable\".\n\n\"This is a challenge of growth, not of neglect … this is a living system and we learn every day,\" she said.\n\n\"Every bowl, every plate we serve to the kids, it carries a duty of care, so one case is too many for us.\n\n\"This is not a perfect story, but this is a story of progress.\"\n\nProtesters want program paused and reviewed\n\nThe program has also drawn criticism from civil society groups, frustrated at the amount of money the government has allocated for it in the budget.\n\nBGN said it expected to spend more than 99 trillion Indonesian Rupiah ($9 billion AUD) this year.\n\nBut the costs could more than triple, with the program reportedly budgeted for 335 trillion Indonesian Rupiah next year.\n\nThe government eventually aims to provide free school lunches to more than 70 million children and pregnant women. (ABC News: Tim Swanston)\n\nAt a recent protest against MBG outside the nutrition agency's Jakarta headquarters, mothers voiced their anger over the poisonings and the cost of the program.\n\nNada Arini from the Indonesian Mothers Alliance said the government had sacrificed education funding.\n\n\"They need more targeting of children, especially the most remote, poorest and farthest areas from development,\" she said.\n\n\"I want this MBG to be stopped, evaluated and back to the drawing board.\"\n\nNada Arini is worried about the safety of the free food program. (ABC News: Tim Swanston)\n\nBhima Yudhistira Adhinegara, executive director of legal and economic think tank CELIOS, said any program aimed at improving childhood development and lowering malnutrition rates should be more specific.\n\n\"It should target poor children from the poorer family backgrounds,\" he said.\n\n\"Other alternatives like cash transfers might be better.\"\n\nDian Fatwa says that for the agency, food safety is \"non-negotiable\". (ABC News: Tim Swanston)\n\nMs Dian said she was optimistic the program would achieve its aims.\n\n\"This nutrition intervention is starting when the mother is pregnant,\" she said.\n\n\"From the tummy to high school, we are feeding [children].\n\n\"The parents, the teachers, they see the benefits … the kids can study more, in the weight of the kids they can see an improvement.\"\n\nKids still 'traumatised' by mass food poisoning\n\nDespite the calls for a moratorium on the program, it is unlikely to be paused, as the nutrition agency is ramping up the number of kitchens and recipients.\n\nAt the parliamentary hearing earlier in the week, the nutrition agency's chief said 1.8 billion portions of food had been produced.\n\nThe ABC visited the kitchen at the centre of the school outbreak in Cipongkor, which was undergoing refurbishments.\n\nAde Jalal with Aldo Revaldo, who still feels traumatised by the program. (ABC News: Tim Swanston)\n\nThe school said it felt it should be consulted before the free meals program was brought back to its classrooms, as the children were still processing the mass food poisoning.\n\n\"We still feel it,\" Aldo said.\n\n\"I don't want to eat the MBG again, my friends and I feel traumatised.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/victorian-farmer-to-auction-fathers-vintage-tractor-collection/105990840",
        "title": "Victorian farmer says goodbye to vintage tractors prized by late dad",
        "publish_date": "Sat, 15 Nov 2025 23:55:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tony Forrest farms at Ripplebrook in Victoria's Gippsland region, where his cows share paddocks with more than 200 vintage tractors.\n\n\"As a kid I gravitated towards everything from tractors, stationary engines, cars, trucks, petrol bowsers,\" he said.\n\n\"Anything that was older than me, pretty much.\"\n\nTony Forrest Sr collected vintage tractors for 40 years. (Supplied: Tony Forrest Junior)\n\nMr Forrest shared his passion with his father, the late Tony Sr, for decades.\n\n\"My dad mainly worked on bulldozers, so he'd buy a bunch of them, use them for a few months and then flog them off,\" Mr Forrest said.\n\n\"By the 1980s he had 150-odd bulldozers scattered around the place.\"\n\nTony Forrest has been busy preparing his vintage tractors for sale. (ABC Rural: Faith Tabalujan)\n\nTractor trove\n\nFor more than four decades the father-and-son team sourced tractors from around Victoria, New South Wales, South Australia and Western Australia.\n\n\"Dad and I used to travel all over Australia, buying and selling machines from John Deere, Massey Ferguson, Ford etc, so I caught the collecting bug pretty quickly,\" he said.\n\n\"When I got a bit too serious, I started importing them from America, England, Belgium, Germany, Holland — all over really.\"\n\nMr Forrest says Lanz Bulldog tractors are some of his favourites. (ABC Rural: Faith Tabalujan)\n\nMr Forrest said there was strong overseas demand for his vehicles.\n\n\"I'm sending three tractors — a Lanz Bulldog, a Fordson P5 crawler and a Mercedes-Benz 800 — to someone in the Netherlands and they send other machines back to me in containers,\" he said.\n\nMr Forrest said he preferred older tractors.\n\n\"For starters, the antique models don't have computers, so you don't have to be a tech whiz to fix the darn things and they tend to be more reliable too,\" he said.\n\nA Mercedes-Benz tractor sits in Mr Forrest's paddock. (ABC Rural: Faith Tabalujan)\n\nBut Mr Forrest said there was a fine line between collecting and accumulating.\n\n\"I've lost count of how many I have,\" he said.\n\n\"I've sold a dozen in this first auction and only plan to keep about 50.\n\n\"I've got a little 1954 Ferrari tractor which is extremely rare, because Enzo and his cousin only built 13 of them.\n\n\"And there's also my 1937 Vierzon, which is a French copy of a Lanz Bulldog, although I love all my Bulldogs.\"\n\nTony Forrest has been collecting antique machinery for decades. (Supplied: Tony Forrest)\n\nSaying goodbye\n\nMr Forrest said collecting went on the backburner after his father's death in 2018.\n\n\"After he passed away, life changed a whole lot,\" Mr Forrest said.\n\nHe took over the family's dairy farm and decided to sell some of his father's tractors.\n\n\"We've only got 226 acres, which is not enough room for cows and a whole tractor collection,\" Mr Forrest said.\n\n\"But I also realised there's no point them rusting away when someone else could repair, restore and actually enjoy them.\"\n\nTony Forrest and his late father collected various tractor brands, including Fordson. (ABC Rural: Faith Tabalujan)\n\nMr Forrest said selling the tractors would take time and tug at the heartstrings.\n\n\"I'm planning a bigger auction around May 2026, but I expect I'll still be sifting through the collection for another couple years,\" he said.\n\n\"Dad loved his tractors, so it's definitely difficult to let them go.\n\n\"The ones I'm most sentimental about are still tucked away in the shed under covers because I haven't even thought of getting rid of them — but you just can't keep them all.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/women-showing-up-for-community-during-drought/105926946",
        "title": "Through dust and drought, these women are redefining resilience",
        "publish_date": "Sat, 15 Nov 2025 23:23:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Dusty paddocks, with no grain crop to harvest, and scarce feed for the few animals left.\n\nThat is the harsh reality at fourth-generation farmer Louise Smith's property at Maggea, 200 kilometres east of Adelaide.\n\nWindswept paddocks conceal the bones of livestock that have succumbed to the harsh conditions. (ABC Riverland: Amelia Walters)\n\nLouise runs the farm alongside her brother Tim, and the pair hasn't harvested a crop to sell at market for the past two years.\n\n\"We don't have a continuous cash flow coming in, we'd probably be better off going on the dole knowing you've got a cheque coming in every two weeks,\" she said.\n\n\"Never have we seen it this bad and this dry ... it's a part of history I never want to be part of again.\"\n\nNow entering their third harvest season fruitless, they have sold almost all of their cattle and have halved their flock of sheep.\n\nIt is a decision taking a heavy mental toll.\n\nLouise Smith has destocked her cattle from 350 to just 24 to maintain some income. (ABC Riverland: Amelia Walters)\n\n\"Many nights I have just sat there trying to sleep, but I'm thinking about where the next lot of feed will come from or planning the next load of sheep or cattle to go,\" she said.\n\n\" We are just winging it day-to-day praying it all falls into line. \"\n\nWhile some parts of South Australia are now expecting an average harvest after decent Spring rainfall, it is a different story for large parts of the Murraylands and Riverland region, which have not been so lucky.\n\nThe Maggea property has only received 106 millimetres of rain for the year. (ABC Riverland: Amelia Walters)\n\n\"[If] we were relying on cereal crops [this season], I don't think we would be here ... I'm pretty sure we wouldn't be here actually,\" Louise said.\n\nRemaining cattle feed on grape marc as hay supply is scarce across the region. (ABC Riverland: Amelia Walters)\n\nTo get her farm and her family through, she has picked up extra work shearing sheep for farmers across the state.\n\nShe said it has been a lifeline for her financially and mentally.\n\n\"Going out to the shearing sheds has been a lifesaver for us because we're out talking to other farmers,\" she said.\n\nLouise is just one of many women who are diversifying and trying to rise above the drought.\n\nHealing through hardship\n\nSuzie Evans is no stranger to isolation or prolonged drought conditions and knows more than most how hard life on the land can be.\n\nShe lost her son, Murray \"Muzz\" Chesser, to suicide seven years ago.\n\nHer program, 'Workbench for the Mind', aims to support people while they wait for a GP appointment. (ABC Riverland: Amelia Walters)\n\nThrough her grief, she found purpose and is now a mental health advocate, providing in-person workshops to those impacted by drought.\n\n\"We all have mental health, just like we have physical health,\" she said.\n\nSuzie Evans says every farmer should take one per cent out of their day for themselves, which is 14 minutes. (ABC Rural: Jessica Schremmer)\n\nA 2023 report on the mental health of the country's farmers revealed that almost half have had thoughts of self-harm or suicide.\n\nSuzie feared the \"pressure to keep farms going\" for generations would hold many back from seeking help, but she urged them to do so.\n\nSuzie Evans says a failed crop is a compounding factor on farmers' mental health. (ABC Riverland: Amelia Walters)\n\nCapturing the impact\n\nKiara Fisher is witnessing the mental and financial burden of the drought from her fifth-generation Bugle Hut family farm.\n\nShe noticed many people living in metropolitan areas were unaware that drought was still an issue in SA.\n\nTo try and raise national awareness online and bring the community together, she founded 'A Farmer's Plate' — a storytelling social media project.\n\nKiara Fisher's project aims to put a face to the farmers who are responsible for the food and fibre on supermarket shelves. (ABC Riverland: Amelia Walters)\n\n\"We want to achieve understanding, compassion and education of the general public,\" she said.\n\n\"I hope the general public will then have conversations with people that can help make change, so when [farmers] ask for help, they know they truly need it.\"\n\nThese mounds of sand used to be cropping paddocks. (ABC Riverland: Amelia Walters)\n\nTo capture the raw reality of people on the land, she connected with Riverland photographer and farmer's wife Rebecca Flack.\n\n\"I like to share the real elements of what we're going through with the drought,\" Rebecca said.\n\n\"Some of those pictures are quite graphic of animals, who unfortunately passed away, but that's a real visual.\"\n\nRebecca Flack says it's the first year her family is considering stopping farming. (ABC Riverland: Amelia Walters)\n\nThe duo said they have had an \"overwhelming response\".\n\n\"It's been comforting seeing farmers realise they're not the only ones going through a tough time and we are experiencing similar conditions,\" Rebecca said.\n\n\" We're all in this together. There is no such thing as a bad farmer. \"\n\nFor many Mallee farmers, sand drift has been the biggest battle this season. (Supplied: Rebecca Flack)\n\nMisconceptions of drought\n\nThese four rural women are all stepping up in their own way to highlight the challenges of farming in drought.\n\nBut they all agreed, the best support farmers could receive was understanding from people outside of their communities.\n\nLouise Smith says interest-free loans for two years would help farmers get back on their feet. (ABC Riverland: Amelia Walters)\n\nLouise wants people to understand that some rain won't break a drought, and owning a farm does not always equate to wealth.\n\n\"A lot of city people think it's rained statewide, but there are still patches of the state that are struggling pretty badly,\" she said.\n\nKiara Fisher says many have spent money they don't have to get government assistance. (ABC Riverland: Amelia Walters)\n\nKiara agreed and said she was disappointed by the government's lack of understanding of what assistance would effectively help farmers through the drought.\n\n\"I think most farmers will say that their neighbours have done more for them this season than the government ever will,\" she said.\n\n\"The drought packages, look great on paper but for most people, spending money to get money back from the government is not a position they are in.\"\n\nMinister for Primary Industries and Regional Development, Clare Scriven, said there has been \"strong uptake\" of the State Government’s drought support package with \"just over $70 million distributed\".\n\n\"More than 3,600 producers have been approved for money to assist them purchase equipment and other infrastructure ... including 749 producers in the Riverland, Murray and Mallee regions,\" she said in a statement.\n\nSuzie Evans bought Wally after her son died, as it was his dream to have a Labrador. (ABC Riverland: Amelia Walters)\n\nFor Suzie Evans, she hopes more farmers can take that first step to seek support, even if it is just from a neighbour.\n\n\"We all need support, and we are all in this together; it's not a competition,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/weona-horse-stud/106012012",
        "title": "Weeks before public outcry, Biosecurity Tasmania was worried about this horse stud",
        "publish_date": "Sat, 15 Nov 2025 22:46:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Just weeks before a firestorm of public outrage erupted over conditions at a Tasmanian horse breeder's stud, an interdepartmental email was sent, revealing Biosecurity Tasmania feared it would become \"our next significant animal/welfare issue\".\n\nIn late September, Weona Park Stud, which is located in Tasmania's Southern Midlands and operates over two properties in Antill Ponds and Parattah, made headlines after photos of some of the horses were shared online.\n\nUnder Right to Information laws, the ABC has obtained a copy of an email dated September 2, 2025 from Biosecurity Tasmania investigators to the Department of Natural Resources and Environment (NRE).\n\nIt was sent after an inspection of Weona Park Stud.\n\n\"This situation will continue and this property is likely to [be] the next welfare issue hitting the news, following on from harness racing horses with Yole and the Labradoodle case,\" the email said.\n\n\" The properties are so severely overstocked with horses, that its (sic) almost as if the horses are being feed lotted. \"\n\nThe ABC understands at that time there were up to 250 horses being kept on the properties, with many in foal.\n\nA Biosecurity Tasmania inspector described the properties as \"severely overstocked with horses\". (ABC News: Jess Moran)\n\nThe Biosecurity Tasmania report found there were several serious animal welfare issues at the property, and some round hay bales were at least three-years-old.\n\n\"I identified the major risk being welfare: overstocking, intensive yarding, horses exposed to high levels of manure, inadequate nutrition, no exercise, no shelter, no rugging, inadequate parasite treatment routine. There was not a single well-grown, well-presented strong yearling on the property,\" the report said.\n\n\"For such an untidy place, no overflowing bin with empty feed bags, no stack of feeding buckets near the feed supply area or in the yards.\"\n\nVet report raises serious concerns\n\nThe documents have also revealed a vet in Tasmania's north reported serious animal welfare concerns about the operation to the RSPCA and called for action to be taken.\n\nBreeder agrees to rehome horses A Tasmanian horse breeder has agreed to reduce the number of horses on her property and rehome them, after concerns were raised by members of the racing community.\n\n\"The conditions at both properties fail to meet basic animal welfare standards … I am a veterinarian and have visited these sites professionally on multiple occasions,\" the vet said.\n\nThe vet, from the Meander Valley Veterinary Clinic, said on September 19, 2025, following two recent visits that month to the properties, they \"observed a significant increase in the number of horses, despite already overstocked conditions\".\n\n\"The excessive numbers and lack of space result in more frequent bullying, kicks, and bites,\" the vet said.\n\n\"This constant stress and physical conflict put the animals at a higher risk of injury and disease.\"\n\nA vet visited the stud twice in September and raised several concerns. (ABC News: Jess Moran)\n\nThe vet said they had attempted to address these issues directly with the owners and employees and \"believed they are trying to do the right thing with feed, veterinary care etc but simply do not think it can be done to an adequate standard [with] the sheer number of horses on the properties\".\n\n\"My hope is that someone will conduct a formal and thorough assessment of these properties and work with the owners to improve the horses' living conditions,\" they said.\n\nWeona Park Stud manager Fiona Methorst said feed sources had been improved and all horses have adequate feed and fresh water.\n\n“A lot of people see no grass in the paddock and think that means no feed. This is far from the truth.\n\n\"We source a large quantity of round bales of hay and hard feed each year,” Ms Methorst said.\n\n“Yes overcrowding is an issue but all horses have adequate feed and fresh water.\n\n“We have since added exercise areas and equipment, along with the order of new shelters and stables back in July that are finally due for delivery this week.”\n\nYears of complaints received\n\nBetween July 2011 and September 2025, the RSPCA received numerous animal welfare complaints about the breeder, raising concerns about stocking, feed and shelter.\n\n\"Too many horses for the size of the land,\" one complaint said.\n\nAnother said the horses were in \"poor condition\" in \"overcrowded paddocks,\" while another complaint said \"all horses are well fed and in great body condition\" but \"the concern is in relation to the amount of room they have to move around\".\n\n\"A lot of manure in the paddocks which hasn't been removed, there is no shelter for these horses to get out of the weather,\" another complaint said.\n\nThe RSPCA said in a statement it triages calls that come through and forwards them to the agency with responsibility.\n\n“Under our service agreement with NRE, the RSPCA operates a contact centre which houses the Animal Cruelty Helpline,” RSPCA chief executive Andrea Dawkins said.\n\n\"With the current complaints with Weona Park we are forwarding complaints to NRE as they are the lead investigators.\"\n\nAndrea Dawkins says the RSPCA referred the case to NRE and the TasRacing Integrity Unit. (ABC News: Georgia Hogge)\n\nInspection finds horses emaciated, partially blind\n\nThe documents have also revealed the Antill Ponds property was the centre of an equine disease outbreak in 2023 with multiple horses experiencing \"neurological clinical signs\".\n\nEquestrian Australia received controversial video weeks before probe Australia's peak body for equestrian sports received a controversial video of Olympic rider Heath Ryan appearing to whip a horse weeks before an investigation was commenced.\n\nInspection notes from July 2023 show several horses on the property were experiencing body and muscle weakness, one was emaciated, and another was found \"down\", and remained down despite food being offered.\n\nOthers had partial blindness, and deterioration in body condition.\n\nIn the report, the property was found to have no pasture and only had small areas of grass between some pens, there were too many horses on the property, and all pen walkways were muddy.\n\nThere was also a deficiency in vitamin E recorded. The report said this either demonstrated extreme malnutrition or a horse having two or more diseases or medical conditions at the same time.\n\n\"This owner should be required to consult a veterinarian for feeding instructions, an auditable chart to observe feeding protocol between visits, and regular visits to determine if feeding/husbandry requirements are being met,\" the report said.\n\n\"In addition, she should have licence removed as she is encouraged to buy more horses = profit, to cover costs of increased production (husbandry and feeding) costs.\"\n\nThe RSPCA received numerous animal welfare complaints about the breeder over a period of 14 years. (ABC News: Jess Moran)\n\nThe property was next inspected in November that year by officers from the Office of Racing Integrity and Biosecurity Tasmania.\n\nSome mares were found to have overgrown hooves, not all horses had access to areas where they could exercise, feed and water was not consistent, and there was a deep layer of manure in most yards.\n\n\"Water troughs must be kept clean and contain clean water at all times, horses should be allowed to exercise in a large yard or paddock for at least an hour every day, shade and shelter from wind and rain should be available in every yard and spoilt feed and manure should be removed from yards every day,\" the report said.\n\nRehoming efforts underway, owner says\n\nIn late September, following a multi-agency investigation sparked by the community outcry, stud manager Ms Methorst agreed the property was overstocked and said she would rehome around 100 horses, which she thought would take between three and six months.\n\nSo far, more than 40 horses have been rehomed and several are on a permanent lease agreement.\n\n“I have had discussions with our vet team about the issue of concern which was overstocking,” Ms Methorst said.\n\n“We have formulated a plan to downsize our stock and focus on our future goals.\n\n\"But we [are] currently and have been addressing all aspects to ensure quality horse welfare moving forward.\n\n“I am pleased with the homes we have managed to get for these horses so far.\n\n\"There will be more available in the future for new homes but we are currently working on the younger horses in preparation for their next steps.\n\n“As I said previously it will take time for this to happen and people need to understand that in the current market and economic climate it is hard to find so many suitable homes in a short timeframe.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/if-i-had-legs-i-kick-you-rose-byrne-movie-mary-bronstein/105977540",
        "title": "The movie that pushed Rose Byrne to the edge of motherhood",
        "publish_date": "Sat, 15 Nov 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "I hadn't planned on posing my curliest question to Sydney-born, New York-based star Rose Byrne straight off the bat. In fact, my notes clearly say: \"Don't ask this first.\"\n\nWhat: Motherhood as panic-attack inducing thriller that will also make you snort laugh Directed by: Mary Bronstein Starring: Rose Byrne, Danielle Macdonald, Delaney Quinn, A$AP Rocky, Christian Slater, Conan O'Brien, Ivy Wolk When: In cinemas November 13 Likely to make you feel: Like screaming into the void\n\nBut a bit like the absolute mayhem that follows a ceiling collapsing in a biblical flood, leaving a void in Linda's apartment — Linda being the harried mother Byrne plays in Mary Bronstein's second feature, If I Had Legs I'd Kick You – it just happened.\n\n\"What does the void mean to you, Rose?\"\n\nI've jumped ahead because a bright and breezy Byrne, white T-shirt glowing in New York's afternoon sun, is perched below an intricately painted floral ceiling. Like her spectacular lead performance, it simply cannot be ignored.\n\n\"Let's start with the easy ones,\" she says with a hearty guffaw, her Australian accent only occasionally twanging with adopted American intonations.\n\n\" The ceiling is the show-stopper. It's so funny, because someone said to me that it's like an existential birth canal. \"\n\nFunnily enough, in one trippy sequence, Linda stares up into the chasm and sees strange swirling lights that may or may not be there, spookily responding: \"Mum?\"\n\nByrne expands: \"It's not not an existential birth canal, that's for sure. I live for the weirder aspects of filmmaking and the grey areas — the parts of being a person that are unexplainable.\"\n\n\"Mary definitely pushes the limits of that with this movie, which is very Lynchian,\" she says, referencing the late American filmmaker who created the weird and wonderful Twin Peaks.\n\nToo many voices\n\nLynchian is a great way to sum up If I Had Legs I'd Kick You, which brilliantly functions on more than one level.\n\nSure, there are surreal moments, but on the surface, it's just a very bad day in the life of Linda.\n\nLoading Instagram content\n\nAn exasperated therapist with enough of her own stuff going on at home, Linda can be brusque towards her clients. They include fellow US-based Australian actor Danielle Macdonald's clearly drowning new mum, Caroline.\n\n\"Danielle's is such a fantastic performance, embodying a woman in a deep, postpartum psychosis,\" Byrne says.\n\n\"It's heartbreaking, and Linda isn't helping.\"\n\nThat's partly because no-one is helping Linda.\n\nHer husband (Christian Slater) is a captain away at sea, full of not-so-supportive suggestions on the phone while she struggles to single-handedly manage the health care of their persistently heard but almost-never-seen daughter (Delaney Quinn).\n\nLinda is harangued by the beep of her daughter's feeding tube, connected to a mysterious ailment that's never named. She also has to battle with a snooty social worker (played by Bronstein) who constantly questions her medical choices.\n\nAt work, her colleague, who is also her therapist, is equally dismissive. Chat show host Conan O'Brien plays him in a chameleonic turn.\n\nTalk-show royalty Conan O'Brien plays Linda's contemptuous therapist. (Supplied: A24)\n\n\"It's such a wink, because Conan's spent 20 years having someone in that chair, listening to, laughing at and indulging them,\" Byrne says.\n\n\"Then, in this, he actively has contempt for his patient, which is so funny, and Conan's razor-sharp wit shines through.\"\n\nWhen the sky falls in, Linda's spiralling panic attack sees her and her daughter cooped up in a seedy motel.\n\nIn desperate need of peace, Linda's further frustrated by the pedant working at the front desk (Ivy Wolk), who refuses to sell her wine because ringing it up will creep past the licence.\n\nSo, Linda turns to rapper A$AP Rocky's motel manager for help with securing other means to dull her pain.\n\n\"Rocky fills the screen with charm, with that quality that you can't direct,\" Byrne says.\n\n\"You just have it, or you don't, and that brings relief to the audience. Suddenly, you can breathe.\"\n\nAnd breathe\n\nBreathing easy won't last in a film that's way more into hyperventilating.\n\nRose Byrne plays a mother on the edge in If I Had Legs I'd Kick You. (Supplied: Logan White / Courtesy of A24)\n\n\"The day-to-day minutia can tip you into the darkest part of your soul,\" Byrne, a mother of two, says.\n\n\" That's what makes the film so extraordinary and darkly funny — that tightrope comedy between the hugest questions and the tiniest little grievances. \"\n\nEverything from a screaming abandoned babe to a feral hamster on the loose to that gunk-raining chasm in her roof pushes Linda to her limits.\n\n\"Mary's vision was to ramp up this fever-pitch tension that adds up to a car crash, but you can't look away,\" Byrne says.\n\nBronstein told Byrne that no matter how wild Linda's responses to these rolling catastrophes get, we had to stay on her side.\n\n\"We might hate or be disgusted by her actions, but I said to Rose, 'The number one thing is, we love Linda',\" Bronstein says.\n\n\"It doesn't work if there's no empathy.\"\n\nBronstein had complete trust in her star.\n\n\"When Rose came on, it became a movie,\" Bronstein says.\n\nMary Bronstein says Rose Byrne brings a certain depth to the role that couldn't have come from anyone else. (Supplied: A24)\n\n\"She's a true creative partner. She's a serious theatre actor who's played Medea, and she's a gifted comedian as well.\n\n\"I was given a gift to have her talent.\"\n\nA career with legs\n\nByrne grew up in Balmain and cut her teeth in the movie Dallas Doll alongside Sandra Bernhard and Two Hands with the late Heath Ledger.\n\n\"We were just kids starting out, and it's beyond my wildest dreams I'm still doing it,\" Byrne says.\n\n\"More and more, it feels like a miracle, what with AI, and I have so many friends who are out-of-work crew members.\"\n\nAs Bridesmaids star Byrne sees it, comedy kicked her career into high gear.\n\n\"It was a huge creative turning point,\" Byrne says.\n\n\"It felt freeing, and also more challenging. Something I can really sink my teeth into.\"\n\nRose Byrne and Heath Ledger take a break from celebrating Two Hands at the Sundance Film Festival in 1999. (Lindsay Brice / Getty Images)\n\nFor every excruciating moment in If I Had Legs I'd Kick You, there’s a laugh-out-loud chaser.\n\nDebuting at Sundance in January, it went on to the Berlin International Film Festival, where Byrne was awarded the Silver Bear for Best Leading Performance. There's already Oscars buzz.\n\n\"It's very surreal, because I've never been in this conversation,\" Byrne says.\n\n\"Of course it's flattering, and I'm as vulnerable as the next person in this business. But I've also realised it's out of my hands. I'm just honoured to be part of the conversation.\"\n\nLaughing at herself as much as anyone else allows me to end on a slightly cheekier note. Is Bobby Cannavale — who also starred in Medea — a more supportive husband than the frankly useless one played by Slater?\n\n\"That's not cheeky at all,\" Byrne says, with a hearty chuckle. \"Bobby's hyper-present, completely engaged.\"\n\nIf I Had Legs I'd Kick You is in cinemas now.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/victorian-drought-not-over-despite-relief-of-spring-rain/106004802",
        "title": "Rain a relief but Victorian drought 'certainly not over'",
        "publish_date": "Sat, 15 Nov 2025 21:50:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Soaking rain has brought relief to dry paddocks across Victoria, but it will take months or even years for farmers to recover from the drought.\n\nAfter a dry start to spring, the rain clouds rolled in during October and early November, bringing widespread falls.\n\nMuch of Victoria has been in drought for the past two years, but it has been particularly tough in the south-west of the state.\n\nColac dairy farmer and president of Dairy Farmers Victoria Mark Billing said his farm had been transformed by the rain.\n\n\"I've never seen a change around so quickly. Six weeks ago we were on a knife's edge,\" he said.\n\nBefore: Jason Smith's farm in south-west Victoria in April. . . After: The same farm after the rain in October. . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE Jason Smith's farm in south-west Victoria in April. / The same farm after the rain in October.\n\nBarren to bogged\n\nBefore the rain, Mr Billing had to re-sow his pasture because earlier plantings did not survive.\n\n\"Now I'm sitting in a paddock of oats that's been cut for silage. I'm 6 foot 3 and it's up to my waist.\n\n\"We've got feed coming out of our ears. We've gone from famine to feast for the cows, which is absolutely awesome,\" Mr Billing said.\n\nHe has had so much rain that his car got bogged in a paddock.\n\n\"That's an embarrassing thing … but it's a nice place to be at the moment,\" he laughed.\n\nMark Billing's car got bogged because it is so wet. (Supplied: Mark Billing)\n\nLate break\n\nIt is a similar story in Gippsland, where paddocks are now lush.\n\nIan Hooker received 75 millimetres on his dairy farm at Loch in South Gippsland this week in what he described as \"a spring turn-around\".\n\n\"It was getting pretty desperate (before this rain), our dams were near enough on stumps,\" he said.\n\n\"All the fodder was gone, we used it all and had to buy a few loads, which is very expensive and took the profit out of the job.\n\n\"I reckon if we keep getting follow up rains over the next couple of months we'll end up doing alright.\"\n\nSouth Gippsland farmers are enjoying good pasture and dams filling up. (ABC Rural: Faith Tabalujan)\n\nDrought 'not over'\n\nAgriculture Victoria seasonal risk agronomist Dale Grey said the recent rain had been welcome.\n\n\"We're seeing enough rainfall to keep the soil moisture damp in the surface, and keep pastures and crops growing really well.\n\n\"It should be good grass growth now around the state right up until mid-December, which is not what it was looking like [a few months ago],\" he said.\n\nBut Mr Grey said there is \"not a lot (of moisture) left underneath those plants and crops\".\n\n\" The drought is certainly not over. \"\n\nDale Grey says Victorian farmers are not out of the woods yet. (ABC Rural: Annie Brown)\n\n'Tough year' continuing in the north\n\nFarmers in the north-west have not been as fortunate with the rain this spring.\n\nDale Ramsay farms in Werrimull, south-west of Mildura, and he has received about half his average annual falls.\n\n\"It's probably around 110 millimetres compared with an average of about 230 millimetres.\n\nMillewa farmer Dale Ramsay searches the sky for rain. (ABC News: Timu King)\n\n\"It's been a tough year with no sheep feed, and we've gone through a lot of hay and grain to maintain the flock.\n\n\"(But) with the low rainfall, we're grateful for the crops we've got … and hopefully next year things will get back on track.\"\n\nCounting the financial cost\n\nBack near Colac, farmer Jason Smith is dealing with paddocks that are too wet.\n\n\"But I'm not complaining,\" he said.\n\n\"In April-May, I had a thousand acres without a blade of grass on it … it looked like the moon.\"\n\n\"Now there's feed in every paddock.\"\n\nBut Mr Smith said the effects of drought will last for a long time.\n\n\"I've got debt levels for hay purchasing, and I've got forward contracts for palm kernel and such that I don't need anymore.\n\n\"There is those sort of hang-overs that we'll have to catch-up with,\" he said.\n\nMark Billing's dairy cows have plenty of feed now. (Supplied: Mark Billing)\n\nMr Billing agrees, saying that cash flow on farms is still \"really tight\".\n\n\"The effects of the drought as far as the on-farm physical part of it is recovering.\n\n\"But the financial implications of the drought is still going to be hanging over us for quite a while,\" he said.\n\nAdditional reporting by Faith Tabalujan and Timu King.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/survival-camping-quiz-tasmanian-wilderness/105888688",
        "title": "Survival-inspired camping is the ultimate challenge — how long would you last?",
        "publish_date": "Sat, 15 Nov 2025 21:18:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Figuring out what 18-year-old Rivi can leave behind when he goes camping in Tasmania's wilderness has been as important as knowing what to take.\n\nIt has been a gradual process — first, starting out with short trips and then slowly building up to longer stays.\n\n\"In our packs, we carry a first aid kit, sleeping bags, a shovel, ropes, canned food, and water. No tents, only a tarp in case it rains,\" Rivi said.\n\nJump to the Survival Camping Quiz\n\nHe also carries a satellite phone to contact his parents, who were hesitant at first but have come to trust his skills and judgement.\n\nWhile camping, Rivi said respecting the environment came first — leave the forest as its found and carefully return any fallen trees used for shelter. (Supplied)\n\nThe Tasmanian terrain is known for its harsh elements, so much so, its West Coast Range was chosen to test contestants on SBS's survival reality show, Alone Australia.\n\nBut Rivi's love for survival-inspired camping didn't come from TV — it began on a camping trip with his friend Harrison.\n\nThe pair went hiking deep in the forest, which meant carrying only the essentials.\n\nOriginally from Gampaha, Sri Lanka, Rivi didn’t grow up camping, but he hopes to join the Defence Force after falling in love with Australia’s wilderness. (ABC News: Marc Eiden)\n\n\"Because we were walking over an hour into the forest, we had to get rid of a lot of gear — that's when it changed to 'survival mode,'\" Rivi said.\n\nFor Rivi, it is less about exploring the area and more about creating a temporary home off the main tracks, sitting in silence, and putting his problem-solving skills to the test as conditions change.\n\n\"The more I'm away from my phone and distractions, the more I'm connected to what matters,\" he said.\n\n\" I've realised that the more I seek discomfort, the more comfortable I feel in myself. It's also taught me to be more confident. \"\n\nBefore you explore Tasmania's parks and reserves Entry to all national parks require a valid pass\n\nLight fires only in designated pits or zones. Extra bans apply during fire-danger periods\n\nDon't feed, harm, or remove protected wildlife or plants\n\nPack clothing and equipment for changeable weather\n\nLet someone know your plans — they should call triple-0 if you don't return at a set time\n\nCarry a Personal Locator Beacon (PLB) in remote areas\n\nWhen Rivi and his family arrived in Tasmania two years ago, it was the middle of a winter night in August.\n\nOriginally from Gampaha, a city 40 minutes from Sri Lanka's capital, Colombo, 18-year-old Rivi found that his new home in Burnie, Tasmania, looked nothing like the place he had grown up.\n\nRefining the necessities in his pack was a slow, methodical process for Rivi, with safety always at the forefront. (ABC News: Marc Eiden)\n\nWith the coast on one side and thick bush and mountains on the other, Rivi never imagined this would become home, or that he would forge such a strong connection to the land through survival-style camping.\n\n\"When I first moved to Australia, I felt separated from my home, my family, my friends and everything I knew,\" he said.\n\n\"But in the landscape of my new Australian home, camping has given me a new kind of connection.\"\n\nHave fun but know your limits and be prepared, expert warns\n\nAlex Mileham, founder of Survival Courses Tasmania, has spent 35 years hiking and camping solo across the world. (Supplied)\n\nAlex Mileham has spent 35 years hiking and practising survival alone around the world, and he says the real danger is often closer than people expect.\n\nHe says that, unlike Rivi, survival camping is not always a choice, and most people getting caught out were underprepared and did not have the right skills.\n\n\"The most likely scenario for a real-life survival situation is often day hikers,\" he said.\n\n\"Because they think that by nine o'clock at night, they're going to be back on the couch with a pizza or something, so they go unprepared and overconfident.\"\n\nThere are rules to follow when using Tasmania's national parks. (ABC News: Maren Preuss)\n\nMr Mileham is the founder of Survival Courses Tasmania and teaches survival and bushcraft skills to people from all walks of life, including surgeons, teachers, mechanics, and psychologists.\n\nHalf of his students are women.\n\n\"Some of the women who have done my courses are part of a hiking group, and they want to venture out on their own,\" he said.\n\n\"I teach how to build your self-confidence and your resilience in those situations in the bush.\"\n\nMr Mileham grew up hiking the Brecon Beacons in Wales, a mountainous region bordering England, which has been used for SAS training for years.\n\nBy 14, he was testing survival skills alone, and at 25 he completed his first solo trek in Nepal. He has also trained with survival experts, the UK's Ray Mears and Australia's Bob Cooper.\n\nMr Mileham says it's most likely day trekkers that get caught out in changing conditions without the right gear. (ABC News: Jano Gibson)\n\nHe stressed that Tasmania's weather was unpredictable and changed quickly, with mistakes happening fast if people became disorientated and began to panic.\n\n\"You can start off on a hike in lovely weather, wearing lightweight clothing and it can just change,\" he said.\n\n\"If you're wet, there's wind, and you're cold, those three things are almost guaranteed to bring on hypothermia when combined.\n\n\"At least with a multi-day hike, you're probably better prepared, because you're planning to spend the night or more.\"\n\nIn October, Tasmania's wilderness claimed the life of bushwalker Daryl Fong and has prompted numerous rescue operations, with a 76-year-old man still missing in Tasmanian bushland.\n\n\"I encourage everybody to go out and have fun, but be prepared with the right clothing and equipment, and ideally some training … because nature will always defeat you if you're overconfident,\" Mr Mileham said.\n\nTest your instincts with this survival-inspired quiz",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/qld-ndis-funding-cuts-means-brisbane-couple-cant-retire/106006192",
        "title": "'We can't retire yet — or ever': NDIS uncertainty up-ending families",
        "publish_date": "Sat, 15 Nov 2025 21:05:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "While most couples in their 60s are planning for retirement, Louise and Darren Catton have been preparing for the day they can no longer care for their 22-year-old daughter, Mary.\n\nThe Caboolture couple has spent years curating a care plan for Mary, who is non-verbal, that accommodates for her cerebral palsy, epilepsy, mobility issues and autism.\n\nBut Ms Catton said their plans were up-ended earlier this year when they received notice that Mary's National Disability Insurance Scheme (NDIS) care plan would be cut dramatically.\n\nMs Catton is 60, while her husband is 63.\n\nThe Cattons discovered in August that Mary's annual NDIS funding would be cut by almost $250,000. (Supplied: Louise Catton)\n\n\"As we got older, we needed to set Mary up as best we could so she could live her life as independently as possible from us,\" Ms Catton said.\n\n\" We know that we can't retire just yet, or maybe ever, because now we don't know what the future holds. \"\n\nWhile the NDIS says adjustments to plans are carefully made to suit each participant's needs, disability advocates believe Mary's case is a drop in the \"tsunami of cuts\" to plans being experienced across the country.\n\nFunding cut threatens overnight care\n\nIn a decision that has since been reviewed by the NDIS, the Cattons discovered in August that Mary's annual NDIS funding would be cut by almost $250,000.\n\nMary's care plan included one-on-one, around-the-clock care from a support worker, with two support workers periodically assigned to help take her to appointments or to socialise.\n\nThe Cattons requested the NDIS carry out an internal review of Mary's case. (Supplied: Louise Catton)\n\nThe family said the looming funding cut meant they may not be able to afford overnight care and allied health services for Mary, and threatened the removal of two-on-one community access support.\n\n\"With her uncontrolled epilepsy now, she needs two staff to safely support her outside of her home,\" Ms Catton said.\n\n\"If she has a seizure, we need two staff. If she has a meltdown, she needs two staff … she can become aggressive because of anxiety.\"\n\nThe Caboolture couple has spent years curating a care plan for Mary. (Supplied: Louise Catton)\n\nIn a statement, a spokesperson for the National Disability Insurance Agency said its priority was to ensure every participant had access to the services they required.\n\n\"Participant support needs may go up and down,\" the spokesperson said.\n\n\"Providing time for a gradual adjustment to any changes to current supports ensures this is done carefully over time, with a focus on maintaining the needs of participants while building their capacity.\"\n\nProcess takes a toll\n\nThe Cattons requested the NDIS carry out an internal review of Mary's case, which this week saw her funding increased by almost $70,000 — but not restored to its previous amount.\n\n\"We should not have had to have made the number of complaints we did to be heard,\" Ms Catton said.\n\nMs Catton said the internal review process had taken a toll on the family.\n\nMs Catton is concerned she may have to fight for her daughter's funding each year. (ABC News: Lucy Loram)\n\nMary is the youngest of four children. Her older siblings are Emily, 30, Oliver, 27, and Grace, 25.\n\n\"Mary became so depressed that she was sobbing through the night due to the cuts that the NDIS made back in August,\" she said.\n\n\"Is the expectation that Darren and I have to mount this battle every single year? Are they going to be looking at cutting her funding every time even though nothing is changing?\"\n\n'Tsunami of cuts' to plans\n\nMatilda Alexander, a human rights lawyer and chief executive of Queensland Advocacy for Inclusion, said the number of NDIS recipients reaching out for help to review their funding cuts was increasing.\n\n\"This is a very worrying trend. We're seeing a real tsunami of cuts to plans,\" Ms Alexander said.\n\n\"This has huge implications on day-to-day living and the ability to keep trusted long-term workers engaged in support employment.\"\n\nFamily fears NDIS review could cut 'essential' exercise therapy Leo depends on exercise physiology to keep him moving, but there are fears that could change under an NDIS review.\n\nMs Alexander said NDIS participants and families should feel empowered to ask for both internal and tribunal reviews.\n\n\"It's very hard to find lawyers and advocates who have capacity to help because we are just overloaded with this case work at the moment,\" she said.\n\n\"But do try and seek help … a lot of these decisions are actually being overturned.\"\n\nData from the Administrative Review Tribunal found 80 per cent of reviews into NDIS plans resulted in overturned decisions.\n\nSupport coordinator Kylie Lamb, who manages the specialist services that Mary used, said significant reductions in funding risked jeopardising a participant's progress.\n\nWith uncontrolled epilepsy, Mary needs two staff to safely support her outside of her home. (Supplied: Louise Catton)\n\n\"The Mary that I started working with in 2021, to the Mary that I supported in 2025, is night and day — but that does not mean that her disability has stopped being complex,\" Ms Lamb said.\n\n\"It just means that probably for the first time in her life she had the most appropriate level of support for her disability.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/gold-coast-schoolies-scaled-back-and-subdued/106012262",
        "title": "Gold Coast Schoolies celebrations set to be scaled back and subdued",
        "publish_date": "Sat, 15 Nov 2025 20:58:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Schoolies celebrations on the Gold Coast will be scaled back for the first time this year due to ongoing beach erosion in the wake of Tropical Cyclone Alfred.\n\nThe state government and Gold Coast Council have confirmed graduates will still be able to party on the beach when celebrations kick off next weekend, November 22.\n\nHowever, the schoolies hub — which is a dedicated alcohol-free and drug-free entertainment precinct, set up on the Surfers Paradise beachfront — will be smaller than previous years due to safety concerns.\n\n\"The department has been working closely with the City of Gold Coast on the best location for the Schoolies Hub,\" a Queensland government spokesperson said.\n\n\"On advice from council's coastal experts, event infrastructure [including the stage] will be located off the sand.\n\n\"The safety of young people and the local community remains the highest priority.\"\n\nA smaller section of Surfers Paradise Beach will be cordoned off for the Schoolies hub (right) compared to previous years (left). (Supplied: Schoolies GC)\n\n'Fitness for fun'\n\nThe first Schoolies run club will also be held this year to cater for the growing proportion of school leavers trading hangovers for wholesome daytime activities.\n\nRed Frogs founder and director Andy Gourley said there had been a \"dramatic change\" in the culture over the past five years.\n\n\"The key indicator to us were the cafes. The cafes at Surfers were empty back in the day — tumbleweeds going through them,\" Mr Gourley said.\n\nAndy says there has been a dramatic shift in drinking habits. (Supplied: National Australia Day Council)\n\n\" But now, come 9-10 in the morning, they're just full of schoolies doing smashed avo and lattes. \"\n\nHe said schoolies were also focused on their health and fitness, consuming less alcohol than previous years.\n\n\"We see about probably half of schoolies aren't big drinkers now and they're more interested in their fitness and sport so, this year, we've got some run clubs we're setting up to do, and also we'll jump into a bit of morning yoga with them as well,\" Mr Gourley said.\n\n\"If we can wear them out during the day, that means less dramas at night-time.\"\n\nThe first Schoolies run club will be held on the Gold Coast. (Getty Images/Warren Little)\n\nWhy the shift?\n\nGold Coast-based GP and Bond University assistant professor Kieran Le Plastrier said generation Alpha and Z were some of the lowest alcohol consumers in the history of Western culture.\n\n\"Their initiation to alcohol is much later, the risk of binge-drinking is much lower and all drug use in that group of people is actually much, much lower,\" Dr Le Plastrier said.\n\nThe stage will be set up off the sand. (ABC Gold Coast: Kimberley Bernard)\n\n\"This is a group of humans which have had the benefits since they were children of understanding the risks and harms, and so a lot of young people actually don't want to drink excessively because they actually know the damage that it's doing to their bodies and to their brains.\"\n\nHe urged schoolies wanting to consume alcohol to pace themselves and to ensure they had plenty of water to drink and food to eat.\n\n\"Make sure you're not drinking alone and if you see your friend obviously becoming intoxicated, it's really time to stop drinking, get the water into them, get them a bit of ibuprofen and get them home for a sleep,\" Dr Le Plastrier said.\n\nPlenty of space to party\n\nMayor Tom Tate says beach restoration works are continuing. (ABC Gold Coast: Steve Keen)\n\nSchoolies beach parties were in limbo after Cyclone Alfred ripped an estimated 6 million cubic metres of sand from beaches across the city in March.\n\nSince then, the Gold Coast Council has spent about $35 million to get the beaches back to a suitable condition, with 1 million cubic metres of sand dredged and pumped towards the shoreline.\n\nMayor Tom Tate said there would be ample space to host an estimated 15,000 teenage school leavers, especially with the closure of the Surfers Paradise Esplanade to traffic for a three-month trial.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-16/wbbl-sydney-sixers-thunder-caoimhe-bray-hat-trick/106014712",
        "title": "Sixers teenager left shocked after claiming WBBL hat-trick",
        "publish_date": "Sat, 15 Nov 2025 20:35:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sydney Sixers rising star Caoimhe Bray needed to be told she had claimed a hat-trick, as the 16-year-old added another WBBL highlight in a thumping derby defeat of the Thunder.\n\nBray took her wickets across two overs, the third thanks to a fantastic diving catch at point from Erin Burns.\n\nThe excitement of that wicket may have been to blame for Bray and her teammates not knowing she had completed a hat-trick.\n\nThey were all shocked to hear of the feat when the ground announcer informed the crowd over the speakers.\n\nBray finished with 4-15 from her four overs, helping the Sixers record a 24-run win over the Thunder at Sydney's Drummoyne Oval on Saturday night.\n\n\"It's pretty crazy … I didn't realise,\" said Bray, who is also the Junior Matildas goalkeeper.\n\n\"It was one of those weird ones that was at the end of the over.\"\n\nMaitlan Brown (2-18) was also effective on a night that favoured the bowlers.\n\nBut the Sixers will wait on scans for New Zealand all-rounder Amelia Kerr, who injured her quad in the warm-up and was forced out of the match.\n\nThe Sixers had Sophie Dunkley (43 off 35) and Mady Villiers (24 not out) to thank for scraping together their total of 9-142, while Alyssa Healy (26 off 15) threatened to explode.\n\nBut the Thunder's star-studded batting order failed to fire in reply, with 18-year-old debutante Lucy Finn (49 not out off 34 balls) valiant in a losing cause after her side had fallen to 7-49.\n\nThe Thunder finished their 20 overs on 8-118.\n\nIn Saturday's earlier match at Drummoyne Oval, the Hobart Hurricanes posted a 16-run win over the Brisbane Heat via the DLS method.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/bakasetas-scores-in-nightmare-start-for-scotland-20251116-p5nfru.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bakasetas scores in nightmare start for Scotland",
        "publish_date": "Sun, 16 Nov 2025 12:50:19 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bakasetas scores in nightmare start for Scotland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/the-brisbane-restaurants-that-will-restore-your-faith-in-yum-cha-20251111-p5n9c4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Brisbane restaurants that will restore your faith in yum cha",
        "publish_date": "Sun, 16 Nov 2025 12:50:10 +1100",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outFood The Brisbane restaurants that will restore your faith in yum cha Yum cha isn’t what it used to be, but these restaurants are offering innovative menus to keep the tradition alive – with or without the trolleys. Matt Shea November 16, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nYum cha has changed. That’s the first thing you need to know when considering where to head for some leisurely Sunday dim sum. The sprawling suburban joints with the powered trolleys? They’re few and far between these days. Instead, if a restaurant is peddling a yum cha menu, it will usually be a tiered-price menu that’s a variation on an a la carte menu, or a banquet menu that presents a number of dishes (perhaps bottomless, within reason) for a set price. Supernormal is serving a special dumplings menu on Sundays. Markus Ravik Southside and Central executive chef Benny Lam remembers yum cha quickly becoming part of his Brisbane childhood after he moved with his family from Hong Kong in 1992. “My uncle had a Chinese restaurant in Capalaba,” Lam says. “Every Monday was his day off so he would go to Chinatown [in Fortitude Valley] to buy groceries and have a bit of yum cha.\n\nAdvertisement\n\nRelated Article Perspective Restaurants open in Brisbane until 2am? Why not? “Back then, it was the Chinese chef tradition to go to Chinatown on Mondays because the daytime would be so quiet at their restaurants. So you’d go in, and it had this really good vibe because you would see everyone and talk about this and that.” Lam reckons yum cha isn’t what it used to be for two reasons. First, fresh dim sum is hard. “Because dumplings are handmade, you need to have a large restaurant and a super high volume to make it sustainable. Even a restaurant like Southside – if we did just yum cha, we’d 100 per cent have to close in a few months.”\n\nAdvertisement\n\n“It was the Chinese chef tradition to go to Chinatown on Mondays … it had this really good vibe because you would see everyone and talk about this and that.” Southside and Central executive chef Benny Lam. But also, fresh dim sum is popular, and long ago became part of the everyday a la carte menu at upmarket Chinese and pan-Asian restaurants, meaning the need for yum cha-focused restaurants – or a yum cha service in those restaurants – fell away. Those that remain are a bit hit or miss. The economies of scale Lam talks about mean a lot of restaurants are ordering their dim sum wholesale, rather than making it fresh themselves. Everyone has an underwhelming yum cha story. The following list is not that. Here’s where to get your yum cha fix in Brisbane. Southside\n\nAdvertisement\n\nSouth Brisbane east Asian restaurant Southside recently revised its yum cha menu, which kicks off at noon every Sunday. Southside runs its yum cha menu every Sunday. Markus Ravik It features a la carte menu dishes alongside signature yum cha items, such as goldfish prawn dumplings with tobiko, and panfried pork gyoza with a dan dan sauce and vinegar caramel. The menu is priced at $59 without drinks, or $99 with a two-hour beverage package that throws in house wines, tap beer and signature cocktails. Where to enjoy it? Outside, in the restaurant’s bucolic fern garden beneath the train overpass is best. 63 Melbourne Street, South Brisbane, southside-restaurant.com.au\n\nAdvertisement\n\nRu Yi Dim Sum A bunch of top Brisbane chefs will happily chew your ear off about Ru Yi – Lam, Stanley’s Louis Tikaram, and The Fifty Six’s Gerald Ong among them. This is closer to the traditional yum cha experience, but with the trolley replaced by an extensive sub-menu of dim sum, tiered in price. Dishes range from a wide variety of dumplings (prawn and chive, prawn and water chestnut, assorted mushroom, to name a few) to pork buns, steamed chicken feet with signature sauce, congee, and rice noodle rolls. Related Article One of West End’s best small restaurants has closed permanently Everything is housemade, meaning the dumplings are fresh and precisely executed.\n\nAdvertisement\n\nDon’t be put off by the location within Calamvale Central shopping centre: the restaurant itself is a charming, comfortable little space in which to spend an hour or two. Just be sure to book because this place absolutely pumps most services. Shop 59/662 Compton Road, Calamvale, ruyidimsum.com.au Longwang This slick CBD diner from Tassis Group bills itself as pan-Asian, but Cantonese is the cornerstone of Longwang’s cuisine so it leans hard into yum cha over summer, 11am-4pm on Friday and Saturday, and all day on Sunday. CBD restaurant Longwang will kick off a new yum cha menu in December. Markus Ravik\n\nAdvertisement\n\nNamed Yum Cha Cha Cha, the menu features dishes such as natural oysters; a beef tartare bite with chilli kosho, chives and tobiko; a wagyu beef dumpling in a beef broth with chilli oil; and XO prawn toast. For drinks, there are wines by Counterpoint and house beers on tap, but you can add cocktail jugs or a premium drinks upgrade. Yum Cha Cha Cha runs from December 15 to January 31 and is $68 per diner for a 90-minute sitting, or $78 per person for a two-hour sitting. 144 Edward Street, Brisbane, longwang.com.au Landmark Sunnybank These huge yum cha spots arguably aren’t what they used to be, but Landmark Sunnybank remains an institution in the southern suburbs, and at busy times, at least, you’ll get some trolley action.\n\nAdvertisement\n\nLandmark in Sunnybank is a perennial favourite with yum cha tragics. Robert Shakespeare Expect a yum cha menu with tiered pricing and dishes such as steamed spare ribs in black bean sauce, Shanghai pork dumplings, and steamed custard buns, along with barbecue dishes and seafood. Just don’t leave your visit too late on the weekend – this place is immensely popular. Golden Lane, in the same centre, is also worth a shout-out. 101/358 Mains Rd, Sunnybank, landmarkrestaurant.com.au Goodtime\n\nAdvertisement\n\nThis neatly designed little restaurant has quietly developed a loyal local following since opening in one of the old warehouse spaces in West Village in September 2024. Related Article Lion to permanently close Stone & Wood brewpub Monday to Thursday it presents its dim sum items as a banquet menu priced at $29 with any drinks order, or $69 with bottomless drinks. Dishes include pork xiao long bao, crispy pork gyoza, chicken siu mai, salt and pepper chicken, and crispy fried squid with salt and pepper. Shop T22/45 Mollison Street, West End, goodtimecheers.com\n\nAdvertisement\n\nStanley Stanley runs a yum cha menu every lunch Monday to Saturday, but on Sundays from 11.30am it becomes more of an event with a yum cha banquet for $59, or a champagne option for $158, and DJs spinning on the restaurant’s riverside deck. Stanley turns its lunchtime yum cha into an event on Sundays. The menu includes dishes such as prawn and chive spring rolls; Moreton Bay bug spring rolls; steamed barbecue pork buns with chilli jam; and pork and prawn dumplings served with either an aromatic broth or spicy sichuan with peanut and sesame. The champagne package adds two hours of free-flowing Louis Roederer.\n\nAdvertisement\n\n5 Boundary Street, Brisbane, stanleyrestaurant.com.au Yum Cha Garden City This handsome spot in the Westfield Mount Gravatt dining precinct presents its yum cha menu as a one-hour all-you-can-eat (with a drink purchase) deal, with prices for adults $59 during the week and $69 from Friday to Sunday and on public holidays. Related Article Brisbane’s best sandwiches? Here are our top picks of the past year Expect the yum cha classics, from pork and shrimp siu mai and barbecue pork buns through to crispy skin chicken and a variety of cheung fun. There’s also a premium section limited to one order per diner – think steamed scallops in garlic sauce, crispy roast duck, and black truffle fried rice.\n\nAdvertisement\n\nThe fitout is a modern interpretation of a classic Chinese restaurant, with parquet floors, white table linen and red and mirrored features, making it a neat place to dwell over some dim sum. Shop R6, Westfield Mount Gravatt, Cnr Logan and Kessels Road, Upper Mount Gravatt, yumchagc.com.au Supernormal A modern yum cha offering in all but name, every Sunday from 11.30am this riverside blockbuster looks not to just Hong Kong and China, but also Korea and Japan, for a tight menu of dim sum that changes weekly. Supernormal’s Sunday dumpling menu changes weekly.\n\nAdvertisement\n\nCheck the restaurant’s website to find out what’s on that week but expect dishes such as Moreton Bay bug toast; vegetable dumplings with shiitake XO; prawn and chicken dumplings with chilli vinegar; barbecue pork buns; and oxtail dumplings with red radish and orange. All are priced to be ordered individually to keep things approachable and flexible, and the a la carte menu is still available. In conjunction with the yum cha menu, the bar is stirring a tight, seasonal selection of chuhai highballs. 443 Queen Street, Brisbane, brisbane.supernormal.net.au Donna Chang This beautiful CBD restaurant feels tailor-made for a leisurely Sunday gathering, and Donna Chang has addressed that with a yum cha banquet menu.\n\nAdvertisement\n\nRelated Article Where to find Brisbane’s best ramen There are three variations: standard, pescatarian and non-pescatarian. Expect dishes such as pork xiao long bao; Moreton Bay bug dumplings; chicken, prawn and shiitake siu mai; cumin-spiced lamb buns; prawn and wombok gyoza; and a sesame prawn toast with a seaweed mayo. Donna Chang’s yum cha runs every Sunday 10am-12pm. Suite 3/171 George Street, Brisbane, donnachang.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/we-are-addicted-to-fossil-fuels-so-let-s-just-accept-it-20251113-p5nfbq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "We are addicted to fossil fuels, so let’s just accept it",
        "publish_date": "Sun, 16 Nov 2025 12:49:37 +1100",
        "category": "finance",
        "authors": [
            "Javier Blas"
        ],
        "text": "Suggesting that fossil fuels will stay around for a long time remains taboo in the energy debate. In climate change gatherings, the world has agreed to “consign coal to history” and “transition away” from oil and natural gas.\n\nIt has signalled, too, “the beginning of the end” of the fossil-fuel era and a “swift” transition to renewables.\n\nThat’s all very well meaning, but there’s a problem: With apologies to Margaret Thatcher, fossil fuels are not for turning.\n\nThe main long-term influence is the global push to reduce carbon emissions. Credit: AP\n\nJust two years ago, the International Energy Agency (IEA) unequivocally said that fossil-fuel demand would peak before the end of this decade. It was a black-and-white statement that left no wiggle room.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-guewel-20251113-p5nf43.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It took 20 years to convince her to take this role – was it worth the wait?",
        "publish_date": "Sun, 16 Nov 2025 12:44:23 +1100",
        "category": "entertainment",
        "authors": [
            "Bridget Davies",
            "Vyshnavee Wijekumar",
            "Andrew Fuhrmann"
        ],
        "text": "MUSIC\n\nCocteau’s Circle ★★★★\n\nAustralian Chamber Orchestra, Melbourne Recital Centre, November 15 “Astonish me!” This striking command drove the work of French poet and artistic polymath Jean Cocteau, after he was challenged by legendary Russian ballet impresario Sergei Diaghilev. In the years following World War I, Cocteau became associated with a remarkable number of painters, writers and most importantly, musicians. His collaborations with composers such as Stravinsky, Satie, Poulenc and Honegger certainly did yield astonishing results. Le Gateau Chocolat performs in Cocteau’s Circle with the Australian Chamber Orchestra. Credit: Daniel Boud In paying homage to Cocteau’s remarkable legacy, the Australian Chamber Orchestra has chosen to celebrate it in truly contemporary fashion. Set in a smoky, would-be cabaret, Cocteau’s spirit speaks through Le Gateau Chocolat, whose combination of deep bass voice, gender-bending costumes and outré stage presence reinterpret the libertine ambience of interwar Paris for our own times. Richard Tognetti and the ACO enthusiastically lead the audience on a 90-minute musical odyssey through scores associated with Cocteau, interspersed with empathetic connective tissue commissioned from Elena Kats-Chernin.\n\nAustralian-born, German-based soprano Chloe Lankshear adds a classy vocal element, including a nostalgic sung waltz by Poulenc and Lili Boulanger’s plangent Pie Jesu, before finishing with a husky, impassioned account of Edith Piaf’s Hymn to Love. Melbourne pianist Stefan Cassomenos dashes off some pianistic pyrotechnics from Jean Francaix’s Concertino for Piano and Orchestra with customary aplomb. Loading Movements from string quartets by Ravel and Debussy arranged for the orchestra elicit the ACO’s habitual verve, as does Darius Milhaud’s Le boeuf sur le toit, named for the bar where Cocteau’s set used to hang out. Le Gateau Chocolat’s glitteringly camp but heartfelt vocal contributions range from Gershwin to, of all things, Janis Ian’s 1970s hit Stars. While perhaps not astonishing, this thoughtful, colourful tribute to one of last century’s most precocious artistic minds does have an appropriate sense of pushing boundaries, just as the ACO has done over its 50 years of existence.\n\nReviewed by Tony Way\n\nMUSIC\n\nSam Fender | People Watching Tour ★★★★\n\nSidney Myer Music Bowl, November 14 The brisk cold of a Melbourne spring evening doesn’t thwart the crowd’s enthusiasm at Sidney Myer Music Bowl. Some in the seated section have already left their allocated spots to surround the front of the stage. When the lights dim, fans roar at Sam Fender and his band’s arrival. Sam Fender performs at the Sidney Myer Music Bowl on November 14. Credit: Paul Rovere The 31-year-old English singer-songwriter from North Shields has sold out arenas across the UK, Ireland, Europe and North America. He recently won the Mercury Prize for his 2025 album People Watching – awarded to musicians from the UK and Ireland for best album – and donated the winnings to the Music Venues Trust, a charity that preserves small live performance venues. Fender is accompanied by a seven-piece band filled with multi-instrumentalists, including drums, guitar, keys, back-up vocals, tambourine, saxophone and trumpet. When they all perform together, the sound inside the bowl is so electric you can feel the pulsating rhythm in your body; getting lost in the music, you forget where you are.\n\nDespite confessing that he’s suffering from jet lag, Fender’s performance never falters. “All right, let’s do this, lads,” he says as he launches into Will We Talk? His repertoire is a mix of slower tracks and American-style 1970s rock ballads. Talk to You, a collaboration featuring Elton John on piano on the original track, is sung with an air of regret about the end of a long-term friendship. Spit of You seeps with a pleading tone as he sings about the fraught communication between a father and son; a Polaroid appears of him and his father on screen. Fender’s Melbourne performance never faltered. Credit: Paul Rovere Contrastingly, the album’s title track People Watching feels anthemic and Crumbling Empire is reminiscent of the Killers’ heartland rock era, with visuals of mountain ranges, desert landscapes and industrial plants playing into the working-class sensibility. Howdon Aldi Death Queue is a fun punk rock interlude, which Fender jokingly describes as “the stupidest song I ever wrote”. Seventeen Going Under is a highlight. Fender demands that the crowd sings along, and they abide enthusiastically. The keyboard player stands on his seat and amps up fans as the drums pound and trumpet and saxophone soar. Fender makes fun of the pretence of leaving the stage before an encore, and the crowd continues the vocal riff to coax him back. “Melbourne, thank you so much for a wonderful f---ing night,” Fender shouts. With a bang, white confetti fills the air, followed by deafening guitar and cheers.\n\nReviewed by Vyshnavee Wijekumar\n\nPERFORMANCE\n\nGuewel ★★★\n\nArts House, until November 16 A guewel is a West African oral historian, someone who carries in memory the stories of local families, who can summon the lore of a place and its people as a celebratory recitation. Guewel at Arts House. Credit: Gregory Lorenzutti In this hour-long production led by Lamine Sonko, the figure of the guewel is reimagined as a conduit between earthly rhythms and the life of the stars: the custodian of a larger lore. The show sketches the outlines of a cosmology, while also showcasing a cohort of gifted performers – dancers, musicians, ritualists – in front of lushly animated projections.\n\nAt its centre are three figures personifying the sun, the moon and the stars. Their full-body costumes – gorgeously sculptural – recall masquerades from Senegal’s Casamance region, with their all-enveloping silhouettes. The dried fronds and towering crest of the figure representing the stars suggest a Kumpo-like apparition, while the moon reads as a delicate crescent, with cowrie shells gleaming on dark cloth. The voltage that runs through Guewel comes from the drumming and dancing. Credit: Gregory Lorenzutti The costumes are impressive, but the voltage that runs through Guewel comes from the drumming and dancing. Hand-drum flurries launch sudden accelerations; legs carve lateral pathways as the dancers kick up their heels. The animations are often beautiful, with veils and translucencies, but at times the smoky effects pull focus from bodies onstage. The visual busyness dilutes the intimacy.\n\nStill, it’s the projections that spell out the work’s big ideas: everything is interwoven, nature moves in cycles. The cosmology is legible, even when dramaturgical transitions feel more ceremonial than exploratory. The figure representing the stars in Guewel, who harks back to West African masquerades. Credit: Gregory Lorenzutti What does it mean to really inhabit ancestral knowledge, not just cite it? Brief as it is, Guewel cannot offer a full answer. It plays more like a prelude that clears space for a deeper encounter. Seven years in gestation and framed as a cross-cultural collaboration, Guewel feels like the opening scene of a larger narrative – and makes you curious for the epic adventure to follow.\n\nReviewed by Andrew Fuhrmann\n\nTHEATRE\n\nThe Haunting of Spook Mansion (By Ghosts) ★★\n\nChapel Off Chapel, until November 23 This paranormal piss-take from comedy writer Michael Ward (Shaun Micallef’s Mad as Hell, RockWiz, I’m A Celebrity … Get Me Out of Here) sports well-known comedic talent. It’s flagrantly inane and does scrape the bottom of the proverbial, humour-wise, though it does also barrel along. Ghost-busting super-sceptic professor Adrian Chambers (Peter Houghton) has made a career debunking the supernatural. At a sparsely attended launch for his latest book, he’s buttonholed by hot librarian Beth Jackson (Emily Taheny) during the post-launch Q&A. Peter Houghton in The Haunting of Spook Mansion (By Ghosts). Credit: Darren Gill Yet the bookish Beth is no ordinary fan. She has a fiendish proposition for Chambers: $500,000 to spend the night in Spook Mansion, a notorious haunted house. Chambers nearly declines – crackpot offers are common in the paranormal investigation biz – but he needs the cash.\n\nSo begins a ridiculous comedy horror haunted by every trope in the book, including an elderly potato-seller with a terrible provincial accent (Ben Russell) to warn the stranger off. Spook Mansion goes all in for cheesy visual tricks: bookcases, sinister portraits, a fireplace with strange objects on the mantel. Beth will summon poltergeists and apparitions in a seance; the source of the clangour in the basement will be discovered. Houghton and Emily Taheny lean into myriad horror tropes. Credit: Darren Gill Why has Chambers been lured to this place? All will come to light, as murderous secrets are revealed and a diabolical plot unmasked. Some of the buffoonery relies on pop culture references aimed at Boomer and Gen X audiences, but there are enough shameless hijinks on offer, under Russell Fletcher’s direction, to get a giggle and a snort from anyone. As a mainstream lampoon of supernatural horror, The Haunting of Spook Mansion (By Ghosts) does the job, but it could be significantly improved. Plot points swarm the denouement like flying monkeys, in a way that makes final revelations difficult to follow. And the show sometimes feels like a TV comedy skit that got out of hand.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/wallabies-player-ratings-how-the-men-in-gold-performed-against-ireland-20251116-p5nfpb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wallabies player ratings: How the men in gold performed against Ireland",
        "publish_date": "Sun, 16 Nov 2025 11:57:27 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "5. Tom Hooper - 6.5 One of the Wallabies best on a night of underwhelming performances. Topped both the Wallabies’ carry and tackle counts. Was likened to Ireland’s impressive middle-rower Tadgh Beirne in the pre-game call, and while he’s not there yet, that’s a realistic ambition for the youngster, who is still only 24 and is arguably the Wallabies’ find (or re-discovery) of 2025. 6. Rob Valetini - 5.5 Took some big carries early in the first half and used his power in the contact zone. But fell out of the game in the second half. We haven’t seen the same game-changing talents from big Bobby V in the last few months.\n\n7. Fraser McReight - 6 Pushed hard, and is always one of the Wallabies players searching to turn the game. Scored a well-taken try. But he was well negated by the Ireland forwards, and wasn’t rewarded by the referee for his 50-50 poaching opportunities. 8. Harry Wilson - 5 Another whose effort is never in question. Puts his hand up for carries and hard tackles whenever they’re needed. But the impact of those involvements ebbs and flows, and there is a question on Wilson’s dwindling battery level, too. No one will enjoy a post-tour break more.\n\n9. Jake Gordon - 5 Kicking game was arguably a fraction off this week, with chasers rarely getting up for a contest. Gordon’s work when recycling on attack in Ireland’s red zone was sharp, but the problem was the Wallabies didn’t get to it more often. 10. James O’Connor - 4 Tough night for James O’Connor, who was thrown headfirst into the mincer by Joe Schmidt in Dublin. Not even in the squad for the tour until this week, he was called in and then immediately given a starting jersey. And then tasked with running an unwise attacking game plan. James O’Connor of Australia is tackled by Sam Prendergast. Credit: Getty Images\n\nNone of that excuses O’Connor’s skill errors. His rustiness was apparent. He was beaten in the air, too. But this was just another episode of the blindfolded darts game that is the Wallabies selection policy for the No.10. And it’s left us no closer to getting answers. 11. Harry Potter - 4 As said every week about Potter: a mixed game. But this time the good - some impressive defence - was outweighed by poor work under the high ball, both defensively and offensively, and being caught out of position. Schmidt rates Potter as strong in the air, but it hasn’t been apparent in recent outings. 12. Len Ikitau -5.5 Another who shone when the Wallabies had the ball in the Irish red zone, and were attacking directly. Ikitau plays as an extra back-rower in that zone, and also handles as a first receiver. A try was a good reward. But otherwise was passing out the back, and Ireland always had the answers.\n\n13. Joseph-Aukuso Suaalii - 5.5 Filipo Daugunu of Australia jumps for the ball with Mack Hansen. Credit: Getty Images Looked for ways to enter the game on attack and defended intelligently. And was even one of the few Wallabies to take a clean catch under a high ball. Are we wedded to Suaalii at No.13? Hands up if you think he should be the Wallabies’ fullback against France. 14. Filipo Daugunu - 4 A big powerful ball runner, but had little opportunity other than one nice run, that was ruined by a loose inside pass. His high ball work was also not where it needs to be.\n\n15. Max Jorgensen - 3.5 Park this one and move on. Not a night to remember for the young superstar, with errors aplenty, many of which led to Irish tries. High balls were dropped, there were knock-ons, and the usually unshakeable confidence of Jorgensen was clearly shaken. Kudos to Schmidt, perhaps, for backing him, but Jorgensen should have moved to the wing when Kellaway came on. Reserves 16. Billy Pollard - 5 Powerful running on display, and his try was a good reward. But losing the lineout in the 64th minute was a bad miss, and while the lift and jump were off, this has to be bread-and-butter stuff at Test level.\n\n17. Tom Robertson - 4.5 Loading No major impact from Robertson, who keeps a scrum locked down and does his tight duties well. But he doesn’t threaten as a ball carrier. 18. Zane Nonggorr - 3.5 Penalised for collapsing his first scrum and then slow on lift on Frost for that crucial missed lineout.\n\n19. Nick Frost - 3.5 Worked hard in a short time on the field, with eight tackles in 16 minutes. But then missed the key lineout and was binned for the last 10 minutes, which allowed Ireland to exploit his absence. 20. Carlo Tizzano - 4.5 Played a quarter but didn’t get sighted with any big plays. Like McReight, he couldn’t get on the ball. Question mark whether a second No.7 is a good use of the reserve back row slot, given McReight is an 80-minute player. 21. Ryan Lonergan - n/a",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/inside-our-journalism-and-the-real-estate-agent-tricks-used-to-underquote-20251115-p5nfn0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside our journalism and the real estate agent tricks used to underquote",
        "publish_date": "Sun, 16 Nov 2025 11:51:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "Inside our journalism and the real estate agent tricks used to underquote\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/meet-the-afl-prospect-with-the-best-kick-in-this-year-s-draft-class-20251113-p5nf44.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meet the AFL prospect with the best kick in this year’s draft class",
        "publish_date": "Sun, 16 Nov 2025 11:24:23 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Josh Lindsay starts each day the same way.\n\nEver since the Geelong Falcons’ top AFL prospect was about 12 years old, he wakes to an alarm, showers, then spends roughly 15 minutes honing his kicking skills – arguably the best in this year’s draft – in the family garage.\n\nJosh Lindsay is set to be a first-round selection in the national draft. Credit: AFL Photos\n\nThere are footballs and boots scattered everywhere, goal posts on the back wall of the garage to aim at, and a rebound net to maximise how many kicks Lindsay can perform in a short period.\n\n“It’s something a bit different that I do, but I think it goes a long way. I really enjoy doing it, so each morning I’m in the garage getting plenty of touches in before I attack the day,” he told The Age.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/this-is-not-acceptable-wallabies-woes-paint-bleak-world-cup-picture-20251116-p5nfqd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This is not acceptable: Wallabies woes paint bleak World Cup picture",
        "publish_date": "Sun, 16 Nov 2025 11:23:17 +1100",
        "category": "sports",
        "authors": [
            "Peter Fitzsimons"
        ],
        "text": "The Wallabies vs Ireland Test match in Dublin?\n\nThe staggering news, early, was that the Australians scored five – count’em – FIVE tries in the first half!\n\nLess good was that it was Ireland’s fullback, and Canberra boy, Mack Hansen, who scored three of them – the first seeing him go over completely untouched to score under the posts, after clever Irish razzle-dazzle to frazzle the Wallabies’ defence.\n\nBut forget that! Our blokes were able to absorb those disasters and still come back into the match - despite our line-out continuing to malfunction, and so many unforced errors it’d kill a brown dog – by scoring two tries to make it 19-14 down at the break. It was further proof of what this year has already established - this generation of Wallabies has character and ability.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/slick-early-knockout-on-ufc-blockbuster-20251116-p5nfr2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Slick' early knockout on UFC blockbuster",
        "publish_date": "Sun, 16 Nov 2025 11:19:29 +1100",
        "category": "sports",
        "authors": [],
        "text": "'Slick' early knockout on UFC blockbuster\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/metro-tunnel-opening-date-revealed-taking-passengers-earlier-than-expected-20251116-p5nfq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Metro Tunnel opening date revealed, taking passengers earlier than expected",
        "publish_date": "Sun, 16 Nov 2025 11:02:06 +1100",
        "category": "finance",
        "authors": [
            "Kieran Rooney"
        ],
        "text": "Melbourne’s Metro Tunnel will be taking passengers from November 30, more than a week earlier than expected.\n\nPrime Minister Anthony Albanese joined Premier Jacinta Allan on Sunday in announcing the opening date for the $15.5 billion project.\n\nThe pair met at Sunshine station, where both levels of government are funding a $4 billion upgrade of the rail network in the region, and caught a train into the tunnel before disembarking at the new State Library station for a tour.\n\nThe state government had previously revealed services would start from December, and it was widely believed the opening date would be on a Saturday or Sunday when services were less frequent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/demolition-derby-car-ploughs-into-crowd-two-critical-20251115-p5nfp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘He’s blacked out’: Demolition derby car ploughs into crowd at NSW show",
        "publish_date": "Sun, 16 Nov 2025 10:28:02 +1100",
        "category": "sports",
        "authors": [
            "Josefine Ganko",
            "Ben Cubby"
        ],
        "text": "Nine people have been injured, including a 54-year-old man who is in a critical condition with spinal injuries, after a car ploughed into the crowd at a demolition derby event in the state’s north-west on Saturday night.\n\nDemolition derby driver Blake Taylor said his brother, Steven, had blacked out behind the wheel with his foot wedged on the accelerator before smashing through a perimeter fence into the crowd at Walcha showgrounds, 90 kilometres east of Tamworth, about 6.15pm on Saturday night.\n\nTerrifying footage captured the moment of impact as the car demolished a temporary grandstand and sent people flying through the air.\n\nA 54-year-old man with spinal injuries and a man in his 30s with a head injury were taken by helicopter to John Hunter Hospital in Newcastle in critical conditions.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/eubank-dropped-twice-in-final-round-20251116-p5nfqp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Eubank dropped twice in final round",
        "publish_date": "Sun, 16 Nov 2025 10:16:47 +1100",
        "category": "sports",
        "authors": [],
        "text": "Eubank dropped twice in final round\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/bullets-sprayed-into-home-in-sydneys-south-west-20251116-p5nfql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bullets sprayed into home in Sydney's south-west",
        "publish_date": "Sun, 16 Nov 2025 10:07:11 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bullets sprayed into home in Sydney's south-west\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/coalition-attempts-to-present-united-front-on-climate-policy-midday-news-bulletin-16-november-2025/qdvnpok7q",
        "title": "Coalition attempts to present united front on climate policy | Midday News Bulletin 16 November 2025",
        "publish_date": "Sun, 16 Nov 2025 01:02:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nThe Coalition attempts to present a united front on climate policy\n\nPope Leo celebrates cinema in a meeting with Hollywood stars\n\nAlex de Minaur says he will come back stronger after ATP Finals defeat\n\nNational Party Leader David Littleproud says he is pretty confident of reaching a deal with the Liberals to formalise the Coalition's position on net zero when they hold a joint partyroom meeting today.\n\n\n\n\n\nAfter a party-room meeting earlier this week, the Liberal Party announced it would scrap its commitment to reach net zero emissions by 2050. It follows the same action taken by the Nationals earlier this month.\n\n\n\n\n\nOpposition leader Sussan Ley says the party agreed its policy platform would be about energy affordability as an issue - and that could be achieved without the 2050 emissions reduction target.\n\n\n\n\n\nShe said the party platform would be for Australia to stay with the Paris Agreement.\n\n\n\n\n\nLiberal Senator Jonathon Duniam told Sky News, the national interest would govern decisions made on emission reduction plans, called Nationally Determined Contributions, under the Paris Agreement.\n\n\n\n\n\n\"I think when you read Article 4 of the Paris Agreement in totality, there is provision for us to do what is in the national interest. And we would determine those contributions and the emission reductions effort in line with national interest. That means making energy more affordable. We have been doing ourselves a disservice. Climate change is settled - don't worry about that. It's not the debate here. It's about how you deal with the efforts our country puts in when it comes to emissions reduction.\"\n\n\n\n\n\n**\n\n\n\n\n\nThe Bureau of Meteorology says the risk of severe thunderstorms remains active over the next 24 hours for parts of eastern Australia.\n\n\n\n\n\nHailstones, heavy rain and destructive winds have hit parts of New South Wales and Queensland on Saturday.\n\n\n\n\n\nSoutheast Queensland received more than 50 millimetres of rain recorded in 30 minutes - at multiple locations west of Brisbane.\n\n\n\n\n\nAnd almost 3,000 properties were without power in southeast Queensland at 9pm on Saturday, according to Energex.\n\n\n\n\n\nAngus Hines, from the Bureau of Meteorology, says the storm danger continues for eastern Australia before the focus shifts from Monday to parts of the country's north and west.\n\n\n\n\n\n\"Where these storms do develop, they could bring some pretty significant weather impacts with them. Damage to cars and property, particularly from the large and giant hail is absolutely possible. And we've seen that happen many times in the last few weeks. We could also see power outages, travel and transport delays as well as flash flooding.\"\n\n\n\n\n\n**\n\n\n\n\n\nThousands have marched in the Brazilian city of Belem to call for climate justice and land rights at COP30.\n\n\n\n\n\nThe demonstration brought together Indigenous communities, Brazilian youth groups, and activists from around the world.\n\n\n\n\n\nIndigenous activists have been protesting outside the COP venue, saying many have been excluded access to the proceedings.\n\n\n\n\n\nBrazil's Minister of Indigenous Peoples, Sonia Guajajara, says 400 places out of 1,200 in Brazil's delegation were granted to Indigenous representatives.\n\n\n\n\n\nCristiane Puyanawa says she wants to be heard on the issue of Indigenous land rights.\n\n\n\n\n\n\"We are here today at the global climate march. Women, youths, Indigenous peoples, and river communities are united to demand social justice and the demarcation of Indigenous lands. Our land and our forest are not commodities. Respect nature and the peoples who live in the forest.\"\n\n\n\n\n\n**\n\n\n\n\n\nAustralian actor Cate Blanchett says the pope's message on the vital role of cinema, actors and filmmakers is affirming and inspiring.\n\n\n\n\n\nScreen stars Blanchett, Monica Bellucci, Chris Pine and Viggo Mortensen were among those invited to the private Vatican audience with the Pope to mark the 130th anniversary of cinema this year.\n\n\n\n\n\nPope Leo told the group that the logic of algorithms tends to repeat what works, but art opens up what is possible.\n\n\n\n\n\nAnd he urged those involved in cinema to have the courage to keep tackling difficult subject matter.\n\n\n\n\n\n\"In the present era, there is a need for witnesses of hope, beauty and truth. Good cinema and those who create and star in it have the power to recover the authenticity of imagery in order to safeguard and promote human dignity. Do not be afraid to confront the world’s wounds. Violence, poverty, exile, loneliness, addiction and forgotten wars are issues that need to be acknowledged and narrated. Good cinema does not exploit pain; it recognises and explores it.\"\n\n\n\n\n\n**\n\n\n\n\n\nIn Tennis, Alex de Minaur says he is already looking to come back even stronger after losing to Jannik Sinner 7-5 6-2 in the semis at the ATP Finals in Turin.\n\n\n\n\n\nSinner had to overcome first-set resistance from de Minaur until forging away in breathtaking fashion to set up a final against either world No.1 Carlos Alcaraz or Canadian Felix Auger-Aliassime.\n\n\n\n\n\nDe Minaur says he sees no other way, but to move forward.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-nitv-radio-talks-to-dr-harry-hobbs-on-victorias-treaty-becoming-law/rj3bkrqua",
        "title": "INTERVIEW: NITV Radio talks to Dr Harry Hobbs on Victoria's treaty becoming law",
        "publish_date": "Sat, 15 Nov 2025 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/new-health-advice-issued-after-asbestos-found-in-kids-play-sand/e2gc116j7",
        "title": "New health advice issued after asbestos found in kids' play sand sold at major retailers",
        "publish_date": "Sat, 15 Nov 2025 05:19:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's peak environmental health advisory body has issued fresh advice after trace amounts of asbestos were detected in children's play sand products.\n\n\n\n\n\nThe Australian Competition and Consumer Commission (ACCC) on Wednesday issued a recall notice for the coloured sand products after laboratory testing detected traces of two types of naturally occurring asbestos.\n\n\n\n\n\nThe move prompted the ACT to close 15 schools and three preschools as a precaution. One school in Brisbane was also closed.\n\n\n\n\n\nOn Friday, the Environmental Health Standing Committee (enHealth) — which advises the Australian Health Protection Committee (AHPC) on environmental health policy — issued interim advice about the products.\n\n\n\n\n\n\"National regulators and agencies are collaborating with multiple health authorities to ensure precaution, consistency and public safety across the country as the situation unfolds,\" the advice states.\n\n\n\nREAD MORE Schools in Canberra and Brisbane closed after asbestos found in children's coloured sand\n\n\"While further analysis is underway, regulatory authorities are taking a precautionary approach to minimise any potential risk.\"\n\n\n\n\n\nThe committee said education providers, retailers and families should stop using any identified products and follow recall and disposal instructions.\n\n\n\n\n\n\"Preliminary assessment indicates that there is a low risk to human health from these products,\" it said.\n\n\n\n\n\n\"Based on the currently available information, we do not recommend any clinical assessment for those who may have been in contact with these products.\"\n\n\n\n\n\nIf the sand is still in its packaging, it should be placed in a heavy-duty plastic bag, sealed with tape and stored securely while awaiting further disposal advice.\n\n\n\nenHealth recommends cleaning up areas where the product has been used with wet cloths to avoid generating dust, and using gloves, a mask and disposable coveralls before storing the material in a secure location.\n\n\n\n\n\n\"If possible, keep children and other people away from areas where the sand has been used until the area has been cleaned,\" it says.\n\n\n\nWhat are the sand products that have been recalled?\n\nThe recalled products — sold at retailers including Officeworks, Educating Kids, Modern Teaching Aids, and Zart Art — include:\n\n\n\n\n\n- Kadink Sand (1.3kg)\n\n\n\n- Educational Colours Rainbow Sand (1.3kg)\n\n\n\n- Creatistics Coloured Sand (1kg)\n\n\n\n- Kadink Decorative Sand (10g 6 pack)\n\n\n\nAustralia's consumer watchdog recently issues a recall notice for Kadink Sand (1.3kg), Educational Colours — Rainbow Sand (1.3kg) and Creatistics — Coloured Sand (1kg). Source: Supplied / ACCC Officeworks was a \"major supplier\" for the sand, the ACCC said, with the products sold in Australia between 2020 and 2025.\n\n\n\n\n\nAsbestos, a hazardous material that can cause terminal diseases, has been banned in Australia since 2003 and is not allowed to be imported except in very limited circumstances.\n\n\n\n\n\nInhalation of asbestos can lead to an increased incidence of some respiratory diseases, including lung cancers.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-climate-change-minister-travels-to-brazil-for-un-summit-midday-bulletin-15-november-2025/jcz1dkfe2",
        "title": "Australia's Climate Change Minister travels to Brazil for UN summit | Midday Bulletin 15 November 2025",
        "publish_date": "Sat, 15 Nov 2025 00:55:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nAustralia's Climate Change Minister travels to Brazil for the final week of negotiations at the UN Climate Summit.\n\nA five-metre tall statue of Pope Leo unveiled in Peru.\n\nIn tennis, Alex De Minaur to face defending champion Jannik Sinner in the semis of the ATP Finals\n\nClimate Change Minister Chris Bowen says he will continue to advocate strongly for Australia's bid to host COP31 in partnership with the Pacific.\n\n\n\n\n\nThe decision on who will host next year's UN climate summit will be made over the coming week at this year's COP in Brazil.\n\n\n\n\n\nIf Türkiye does not withdraw its bid to host the event, it will be hosted in the German city of Bonn*.\n\n\n\n\n\nMr Bowen, who is travelling to Brazil for the final week of COP, says he hopes it doesn't come to that.\n\n\n\n\n\n\"The situation remains that Australia has the overwhelming support of the world to host COP31. But that is not how the system works. It is not a ballot process in that sense. That means we need to reach an agreement with Türkiye. That's difficult. I do know it is in Australia's best interest to be COP President and to host COP. I will continue to have conversations with my Turkish counterparts - in consultation with the Pacific over the week or so. And we'll see how we go.\"\n\n\n\n\n\n*Under the COP rules, hosting duties rotate through five blocs of countries, which for 2026, includes Türkiye, Australia, Canada and other countries in Europe. If no consensus is reached the summit reverts to Bonn, a city in Germany that hosts the UN's climate secretariat\n\n\n\n\n\n—\n\n\n\n\n\nThe Bureau of Meteorology says severe storms will impact much of eastern Australia this weekend, after heavy rain, wind and hail resulted in thousands of households losing power in southeast Queensland.\n\n\n\n\n\nThe storm cell moved north-east over the Brisbane region on Friday evening, before heading out to sea.\n\n\n\n\n\nMore than 11, 000 households lost power.\n\n\n\n\n\nMiriam Bradbury, from the Bureau of Meteorology, says there has already been a significant amount of rainfall in the last 24 hours - and there is more to come.\n\n\n\n\n\n\"In the east (of Australia), in particular, we've seen about 30 to 70 millimetres of rain in southeast Queensland and northeast New South Wales. And this weekend, storms remain possible in Queensland and eastern New South Wales; pushing down through parts of Victoria as well. The key areas of concern though - the areas likely to be hardest hit are where we might see severe thunder storms. So for today, Saturday, those severe thunderstorm areas include southeast Queensland and much of eastern New South Wales.\"\n\n\n\n\n\n—\n\n\n\n\n\nA five-metre tall statue of Pope Leo XIV has been unveiled in northern Peru.\n\n\n\n\n\nThe monument is intended to honour the pontiff’s ties to the country.\n\n\n\n\n\nThe statue is part of a new tourist route called \"Paths of Pope Leo XIV\" designed to showcase sites connected to his pastoral work in Peru, where he served from 1985 to 2023.\n\n\n\n\n\nAt the ceremony for the statue's unveiling, Chiclayo bishop Monsignor Edinson Edgardo Farfan Cordova says the statue celebrates the spiritual connection between the city and the head of the Catholic Church.\n\n\n\n\n\n(Spanish then translated into English): \"The heart of the Holy Father is in Peru. I am sure that in a few years he will give us an answer and visit his beloved Peru, especially the city of Chiclayo.\"\n\n\n\n\n\n—\n\n\n\n\n\nAround 3,000 deaf and hard-of-hearing athletes are gathering in Tokyo for the 25th Summer Deaflympics, with the opening ceremony kicking off today.\n\n\n\n\n\nThe event takes place just over 100 years after the first Deaflympics were held in Paris in 1924.\n\n\n\n\n\nAustralia is sending a team of more than 90 athletes to the event, including members of the country's deaf women's basketball team, the Geckos.\n\n\n\n\n\nAdam Kosa, the president of The International Committee of Sports for the Deaf, says 81 countries are represented - including some for the first time.\n\n\n\n\n\nJapanese then translated into English: \"As a refugee, South Sudan. It is going to be their first time joining this Games. The East Timor and Laos - they are going to join this Game for the first time. So I am very, very happy.\"\n\n\n\n\n\n(Athletes will contest more than 200 medal events across 21 disciplines, including athletics, badminton, and karate.\n\n\n\n\n\nThe event continues until November 26.\n\n\n\n\n\n—\n\n\n\n\n\nIn Tennis, after achieving mission improbable, Alex de Minaur must now pull off what shapes as his mission impossible at the ATP Finals in Turin.\n\n\n\n\n\nAs expected in front of his home fans, defending champ Jannik Sinner breezed to yet another indoor victory in his final group match (on Friday 14 Nov).\n\n\n\n\n\nHe overcame the power serving of Ben Shelton to win 6-3 7-6 (7-3) and set up a semi-final with the Australian No.1 (Sat 15 Nov local time).\n\n\n\n\n\nSinner says he is looking forward to the match.\n\n\n\n\n\n\"In the matches we played, he has been close in a couple of matches. Especially this season we played always in different situations on the court. On different types of courts. And tennis really can change a lot from one day to the other. So I am just excited to go at least one more time on this court. Having the great support, and great crowd. And I hope I can perform in the best possible way.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/bowen-heads-to-brazil-to-push-for-australias-cop31-bid-amid-standoff-with-turkiye/6yupway4l",
        "title": "Bowen heads to Brazil to push Australia's COP31 hosting bid amid standoff with Türkiye",
        "publish_date": "Sat, 15 Nov 2025 00:28:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Climate Change Minister Chris Bowen will travel to the COP30 climate summit in Brazil to press Australia's case to host next year's event, amid a standoff with Türkiye.\n\n\n\n\n\nAustralia and Türkiye have both bid to host COP31, and with neither side backing down, the summit risks defaulting to Bonn, Germany — where the United Nations climate agency is based — if the dispute cannot be resolved.\n\n\n\n\n\nBowen, who is also the energy minister, left Sydney on Saturday morning for Belém to lead the Australian delegation at COP30.\n\n\n\n\n\nHe said he would push for Australia's COP31 bid, which is backed by Pacific island nations and would give Australia a chance to showcase its clean energy industry.\n\n\n\n\n\n\"It's not a matter of fighting on for months afterwards — it gets decided at this conference,\" he told reporters before his flight from Sydney Airport.\n\n\n\n\n\n\"Australia has the overwhelming support of the world to host COP31, but that's not how the system works.\n\n\n\nREAD MORE Australia's dispute with Türkiye over COP31 hosting rights could see both miss out\n\n\"It's not a ballot process ... that means we need to reach an agreement with Türkiye, that's difficult.\"\n\n\n\n\n\nIn a statement before he left, Bowen said global investment in clean energy projects would exceed US$2 trillion ($3.057 trillion) in 2025 and Australia's climate change targets \"were a big green light to local and international investors that we want to be part of this global shift\".\n\n\n\n\n\n\"As the National Climate Risk Assessment showed us, our nation has a lot at stake when it comes to climate change, but every effort we make now will help avert the worst impacts,\" he said.\n\n\n\n\n\n\"That’s why we want to host COP31 in partnership with the Pacific — to bring the world to the Pacific for the first time and show how together we can fight this existential threat.\"\n\n\n\nPacific islands back Australian bid\n\nThe Conference of the Parties, or COP, is the annual gathering of countries that have signed the Paris Agreement and the UN Framework Convention on Climate Change.\n\n\n\n\n\nHost countries take on a presidential role, allowing them to set the summit's agenda, highlight domestic climate issues and play a key role in brokering negotiations.\n\n\n\nAustralia made its bid to host COP31 in Adelaide with the support of the Pacific Islands Forum, a bloc of 18 countries among the most vulnerable to climate change.\n\n\n\n\n\nPrime Minister Anthony Albanese wrote to Turkish President Recep Tayyip Erdoğan in an attempt to resolve the dispute, but Türkiye has refused to concede and withdraw its bid to host in Antalya.\n\n\n\n\n\nTürkiye has previously argued its Mediterranean location would help reduce emissions from flights bringing delegates to the conference, and has pointed out its smaller oil and gas industry compared to Australia.\n\n\n\n\n\nIn July, the UN urged Australia and Türkiye to resolve the hosting standoff, calling the delay unhelpful and unnecessary. It had set a deadline of June for the group to reach consensus.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-cuts-tariffs-on-food-imports-including-australian-beef-amid-grocery-price-fears/n7710l8um",
        "title": "Australia welcomes Trump's backtrack on food-import tariffs",
        "publish_date": "Fri, 14 Nov 2025 23:11:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia has welcomed an executive order from United States President Donald Trump exempting a wide range of food imports from sweeping tariffs imposed earlier this year on nearly every country.\n\n\n\n\n\nThe move means Australian beef — one of Australia's leading exports to the US — will no longer be subject to a 10 per cent tariff.\n\n\n\n\n\nTrade Minister Don Farrell welcomed the shift, saying his government has been \"consistent and clear\" on the issue.\n\n\n\n\n\n\"We maintain our position that tariffs on any Australian products are unjustified, and continue to advocate for their removal,\" he said.\n\n\n\n\n\nThe National Farmers' Federation (NFF) also welcomed the decision, with interim chief executive Su McCluskey calling it \"a sensible step that brings us back into line with the Australia-US Free Trade Agreement, which provides for zero tariffs on two-way trade\".\n\n\n\nREAD MORE The big biosecurity question at the centre of Australia's US beef move\n\nMeat is Australia's second largest export to America behind non-monetary gold, according to the Australian Bureau of Statistics.\n\n\n\n\n\nIn 2024, the US accounted for 30 per cent of Australia's beef exports, the United States Studies Centre found.\n\n\n\nA sharp reversal for Trump\n\nThe order — which includes beef, tomatoes, coffee and bananas — is part of a major push by Trump and his top officials to address Americans' growing concerns about persistently high grocery prices.\n\n\n\n\n\nThe new exemptions — which take effect retroactively at midnight on Thursday — mark a sharp reversal for Trump, who has long insisted that his import duties are not fuelling inflation.\n\n\n\n\n\nThey come after a string of victories for Democrats in state and local elections in Virginia, New Jersey and New York City, where affordability was a key topic.\n\n\n\n\n\nIt said any refunds due would be processed under the rules and procedures of the US Customs and Border Protection.\n\n\n\nTrump has upended the global trading system by imposing 10 per cent base tariffs on imports from every country, plus additional specific duties that vary from state to state.\n\n\n\n\n\nFriday's order followed framework trade deals announced on Thursday that will eliminate tariffs on certain foods and other items imported from Argentina, Ecuador, Guatemala and El Salvador, once those deals are finalised, with US officials eyeing additional deals before the year's end.\n\n\n\n\n\nTrump has focused squarely on the issue of affordability in recent weeks, while insisting that any higher costs were triggered by policies enacted by former president Joe Biden, and not his own tariff policies.\n\n\n\n\n\nConsumers have remained frustrated over high grocery prices, which economists say have been fuelled in part by import tariffs and could rise further next year as companies start passing on the full brunt of the import duties.\n\n\n\nREAD MORE Donald Trump softens tone on China after tariff tensions flare\n\nThe top Democrat on the House of Representatives Ways and Means Committee, Richard Neal, said the Trump administration was \"putting out a fire that they started and claiming it as progress\".\n\n\n\n\n\n\"The Trump Administration is finally admitting publicly what we've all known from the start: Trump's Trade War is hiking costs on people,\" Neal said in a statement.\n\n\n\n\n\n\"Since implementing these tariffs, inflation has increased and manufacturing has contracted month after month.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/as-power-prices-surge-david-has-found-ways-to-cut-running-costs-by-thousands/b8175zrzi",
        "title": "As power prices surge, David has found ways to cut running costs by thousands",
        "publish_date": "Fri, 14 Nov 2025 21:00:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nDavid Stuart runs a paint business on Sydney’s northern beaches and when it comes to cutting electricity costs, he’s ahead of the curve.\n\n\n\n\n\n\"Our factory here in Brookvale is powered 100 per cent with solar energy. Before we went solar, we were spending $24,000 a year on electricity. All that was being wasted. We took the plunge, we went solar, we got a bank loan to do it. That bank loan is now paid off. Our power bills are now negative.\"\n\n\n\n\n\nAs managing director of Colormaker Industries, Mr Stuart has combined sustainability and innovation to beat rising prices.\n\n\n\n\n\n\"Electricity is an inescapable cost for most small businesses. We're an Australian manufacturer, trying to be competitive on a world stage. As power prices rise, that takes money out of the bottom line.\"\n\n\n\n\n\nMr Stuart’s paint factory now runs entirely on renewable energy, powered by a 100-kilowatt rooftop array backed by a custom-built battery.\n\n\n\n\n\n\"Our big battery is Australian designed and built. It can take the surplus solar that we produce during the course of the day, store it overnight, then we can run all of our morning production with it. Had you told me six years ago we'd be where we are now, I would never have believed you.\"\n\n\n\n\n\nMore Australians are buying big batteries as upfront prices fall, by around 20 per cent last year alone, according to the Climate Council’s Greg Bourne.\n\n\n\n\n\n\"Initially the cost of batteries was too high and the payback period didn't really work, but that crossover point has really occurred right now and there's many more batteries available, whether it be at the residential level or at the small business level.\"\n\n\n\n\n\nAs power prices soar, up by 9 per cent last quarter according to the Australian Bureau of Statistics, Mr Bourne urges more people to get on board with battery storage.\n\n\n\n\n\n\"We have 4 million homes already with solar panels, but it's a much smaller percentage have got batteries. I would want it to double and double and double again.\"\n\n\n\n\n\nElectricity prices are driving up Australia’s inflation figures.\n\n\n\n\n\nThe cost of living (CPI) rose by 3.2 per cent in the year to September.\n\n\n\n\n\nAccording to a new report from the Australian Chamber of Commerce and Industry, these rising costs are hurting Australia’s 2.5 million small business owners.\n\n\n\n\n\nCEO Andrew McKellar explains.\n\n\n\n\n\n\"Energy is certainly one of the top costs that small businesses cite. So, it is very clear that rising energy bills over recent years have taken a toll, we know that across NSW, Victoria and QLD for many businesses those costs have gone up 200 per cent in the past three years or so and it’s a significant cost pressure that many small businesses are facing!\"\n\n\n\n\n\nFor its Small Business Conditions Survey, the Chamber of Commerce spoke with 1,100 small business owners across the nation.\n\n\n\n\n\nMore than one quarter, 28 per cent, had considered closing in the past year and 30 per cent worried they may close within the next 12 months.\n\n\n\n\n\nCost pressures are a concern for the Council of Small Business Organisations Australia (COSBOA).\n\n\n\n\n\nChair Matthew Addison says many owner operators surveyed for the Small Business Perspectives reported they use personal savings to stay afloat.\n\n\n\n\n\n\"Really tough business environment we're in at the moment and what this report brought out was 64 per cent said they recorded lower profits this year than they did the year before. Sixty per cent reported as business owners, they couldn't pay themselves every payday.\"\n\n\n\n\n\nDespite rising costs, including power prices, Mr Addison says going solar is not for everyone.\n\n\n\n\n\n\"Bill comparison is always a wise technique. If a business is in a situation, they can look at putting solar panels in or put a battery in. But in the two and a half million small businesses in Australia, one and a half million of those are sole traders, that's the individual themselves. They don't necessarily have the time or capacity or the financial capacity to invest in what might be the solar panels or the battery.\"\n\n\n\n\n\nBut with profits under pressure, Mr Stuart says making small changes can make a big difference to the bottom line.\n\n\n\n\n\n\"We bought in an energy efficiency engineer, he did an audit of the entire site and found that 26 per cent of our electricity was being used to make compressed air and a third of that was being wasted. So, we bought a new compressor and over the 12 months after that was introduced, we saw a 23 per cent drop in entire energy usage. We also bought an electric forklift. So that means we've got no more LPG on site. W e changed our lighting to LEDs. That's something that any company can do, at surprisingly little cost. And we also bought a mega shredder. So, a lot of the cardboard that we had previously sent out to be recycled we can now use on site and give it a second life. Since we introduced solar and the other enhancements, we're now saving somewhere between $35,000 and $50,000 a year every year. That's baked in!\"\n\n\n\n\n\nBusiness failure rates are forecast to stay above 5 per cent for the next year, and Mr Stuart has this advice for those struggling.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/april-le-sueur-claims-2025-natsi-sports-award/clej1o01a",
        "title": "April Le Sueur claims 2025 NATSI Sports Award",
        "publish_date": "Fri, 14 Nov 2025 21:00:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAs a First Nations community-led sporting club with a rich history, Rumbalara is where April Le Sueur hangs out, even when she was just a baby.\n\n\n\n\n\n\"I've been a part of this club since I was a baby, a baby 1 year-old running around, being babysat by everyone around here.\"\n\n\n\n\n\nThe 24-year-old used to play netball and Australian football at the club, but a back injury is keeping her off the field.\n\n\n\n\n\nInstead of staying away, Le Sueur chose to stay involved another way.\n\n\n\n\n\nShe became a volunteer there, helping with errands so others can focus on the sports.\n\n\n\n\n\nShe's now a board member at Rumbalara, and also the chair of the women's football community and the women's football team manager.\n\n\n\n\n\n\"I like knowing what's running down on a Sunday and being able to control a few things otherwise I'm worried it won't get done.\"\n\n\n\n\n\nThis weekend, Le Sueur will be receiving the 2025 National Aboriginal and Torres Strait Islander Sport Award, or the NATSI Sport Award, after becoming the AFL Young Leader of the Year .\n\n\n\n\n\nComing along with the award is a brand new car, which means she now faces new requests from her friends at the club.\n\n\n\n\n\n\"I've been in it but she hasn't given me a lift to training in it yet but it's nice you'll have to get her to now.\"\n\n\n\n\n\nBut besides the jokes, Le Sueur's peers say they are grateful for the volunteering work she's done for the team.\n\n\n\n\n\n\"I'm just really grateful for April. I haven't been playing footy for that long / and if it wasn't for her encouraging me to a skill level I probably wouldn't be here.\"\n\n\n\n\n\nShonelle Ritchie is the secretary of Rumbalara.\n\n\n\n\n\nShe praises Le Sueur's young leadership in the club.\n\n\n\n\n\n\"She's amongst her peers and community and is now coming into the space as one of our young leaders.\"\n\n\n\n\n\nRumbalara's history can be traced back to the 1800s.\n\n\n\n\n\nMs Ritchie says the sports club has become an important place for the First Nations community.\n\n\n\n\n\n“It's so important to have this place - it's our meeting ground basically where we can come and connect.”\n\n\n\n\n\nApril Le Sueur agrees.\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-orders-criminal-investigation-into-epsteins-alleged-ties-to-clinton-and-other-democrats/lap4lr4dx",
        "title": "Trump orders criminal investigation into Epstein's alleged ties to Clinton and other Democrats",
        "publish_date": "Fri, 14 Nov 2025 20:14:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "The US Justice Department said it will carry out President Donald Trump's request to investigate Jeffrey Epstein's alleged ties with former Democratic president Bill Clinton, as Trump sought to shift the focus from his own relationship with the convicted sex offender.\n\n\n\n\n\nThe move comes two days after a congressional committee released thousands of documents that raised new questions about Trump's relationship with the late financier, and marks the latest in a series of demands by Trump for federal law enforcement to pursue his perceived political enemies.\n\n\n\n\n\nAttorney-general Pam Bondi on Friday said Jay Clayton, the top federal prosecutor in Manhattan, will take the lead on the investigation.\n\n\n\n\n\nThe Epstein scandal has been a political thorn in Trump's side for months, partly because he amplified conspiracy theories about Epstein to his own supporters.\n\n\n\n\n\nMany Trump voters believe Bondi and other Trump officials have covered up Epstein's ties to powerful figures and obscured details surrounding his death by suicide in a Manhattan jail in 2019.\n\n\n\nAlong with Clinton, who socialised with Epstein in the early 2000s, Trump said he had asked the Justice Department to investigate former treasury secretary Larry Summers, and Reid Hoffman, the LinkedIn founder who is also a prominent Democratic donor.\n\n\n\n\n\nAll three men were mentioned in the 20,000 Epstein-related documents released by the House Oversight Committee on Wednesday.\n\n\n\n\n\n\"Epstein was a Democrat, and he is the Democrat's problem, not the Republican's problem!\" Trump wrote on social media. \"They all know about him, don't waste your time with Trump. I have a Country to run!\"\n\n\n\n\n\nJPMorgan, which is also under investigation, said in a statement it regrets its past association with Epstein, who was a client between 1998 and 2013, and did not help him commit \"heinous acts\".\n\n\n\nJeffrey Epstein (left) and Donald Trump at Trump's Florida estate in 1997. Source: Getty / Davidoff Studios Photography JPMorgan paid $290 million in 2023 to some of Epstein's victims to settle accusations that it had turned a blind eye to his sex trafficking. The bank did not admit wrongdoing in the settlement.\n\n\n\n\n\nClinton's deputy chief of staff, Angel Urena, said on X: \"These emails prove Bill Clinton did nothing and knew nothing. The rest is noise meant to distract from election losses, backfiring shutdowns, and who knows what else.\"\n\n\n\n\n\nIn a post on X, Hoffman called on Trump to release all of the Epstein files, saying his only engagement with Epstein was to raise funds for the Massachusetts Institute of Technology.\n\n\n\n\n\n\"I want this complete release because it will show that the calls for baseless investigations of me are nothing more than political persecution and slander,\" he said.\n\n\n\n\n\nSummers did not immediately respond to a request for comment.\n\n\n\nTrump faces continued pressure over Epstein\n\nTrump and Epstein were friends during the 1990s and the 2000s, but Trump says he broke off ties before Epstein pleaded guilty in 2008 to charges of soliciting a minor for prostitution.\n\n\n\n\n\nTrump has consistently denied knowing about the late financier's abuse and sex trafficking of underage girls.\n\n\n\nLISTEN TO White House dismisses emails that raise new questions about Trump ties to Epstein SBS News 05:24 English\n\nStill, some of Trump's most ardent supporters have accused his administration of a cover-up. Trump, who frequently engages with reporters, has declined to take questions over the last several days as new revelations about Epstein have become public.\n\n\n\n\n\nThe Republican-controlled House of Representatives is expected to vote next week on legislation that would force the Justice Department to release all of the material it holds on Epstein, who was facing federal charges of sex trafficking minors at the time of his suicide.\n\n\n\n\n\nThe measure is expected to pass, even after house speaker Mike Johnson repeatedly manoeuvred to try to block the vote. It would also require the Senate to pass similar legislation and Trump's approval to compel the Justice Department to act.\n\n\n\n\n\nJust four in 10 Republicans in an October Reuters poll said they approved of Trump's handling of the Epstein files, well below the nine in 10 who approve of his overall performance in the White House.\n\n\n\nNo credible evidence has surfaced that Clinton, Summers or Hoffman were involved in Epstein's sex trafficking. All have previously denied wrongdoing and have expressed regret about their relationships with him.\n\n\n\n\n\nClinton flew on Epstein's private jet several times before the financier's 2008 conviction, while Summers accepted philanthropic gifts from Epstein while serving as president of Harvard University. Hoffman has acknowledged meeting with Epstein multiple times in professional situations.\n\n\n\n\n\nBefore his 2008 conviction, Epstein worked and socialised with a long list of well-known figures, including the UK's former Prince Andrew, who was stripped of his royal title due in part to his association with Epstein.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/if-i-had-legs-id-kick-you-film-asks-what-if-a-mother-regrets-children/88i3o5x66",
        "title": "This film starring Rose Byrne airs the unspeakable parts of motherhood",
        "publish_date": "Fri, 14 Nov 2025 19:35:24 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "It's pretty controversial to hate your children. It's even more controversial to leave your dying child in a hotel room to go smoke and flirt with a stranger.\n\n\n\n\n\nBut that's the type of motherhood at the heart of indie production house A24's new film, If I Had Legs I'd Kick You.\n\n\n\n\n\nStarring Australian actor Rose Byrne and written and directed by American filmmaker Mary Bronstein, If I Had Legs I'd Kick You follows therapist Linda (played by Byrne) — one of the unapologetically difficult mothers you'll see on screen.\n\n\n\n\n\nWith her sick daughter requiring round-the-clock care, Linda's life begins to unravel in spectacular fashion. She becomes obsessed with a mysterious hole in her ceiling — a symbol of her waning mental state, poor decision-making and inner turmoil.\n\n\n\n\n\nForced into a tiny motel room with her dying child, Linda sneaks out at night to eat Reese's Peanut Butter Cups, drink wine and engage in a flirtationship with the motel worker downstairs (a surprising A$AP Rocky) despite having a husband. She ditches her daughter's therapy sessions, zones out and offers bad advice to her own clients, confessing her darkest thoughts to her therapist and colleague (Conan O'Brien).\n\n\n\n\n\nShe's stressed. Sleepless. Hungry. An alcoholic. Trying to hold it all together — and failing.\n\n\n\nWith a surprising cast featuring the likes of Rose Byrne, rapper A$AP Rocky and talk-show host Conan O'Brien, If I Had Legs I'd Kick You might seem like a quirky affair. But there's a deeper side to it. Source: Supplied The casting might seem intentionally surprising, but the film is less about shock value than it is a meditation on the unspeakable parts of motherhood that rarely make it to the screen.\n\n\n\n\n\n\"What I wanted to do expressly was create a portrait of a mother that I had never seen before,\" Bronstein tells SBS News.\n\n\n\n\n\n\"When I thought about it, I was like: what movie have I ever seen where it centres a woman who happens to have a child, but it's not about her mothering and it doesn't judge her and it lets her be an actual human being? That's written and made by a woman?\"\n\n\n\nWriter and director Mary Bronstein doesn't want audiences to escape from the spiral of anxiety and existential dread that comes with her new film, If I Had Legs I'd Kick You. Source: Getty / Mondadori Portfolio Bronstein says she made the film for a very particular audience: mothers who may not recognise themselves in glossy or idealised portrayals.\n\n\n\n\n\n\"The more specific you get with something, the more people can actually relate to it. The movie is about something that's very specific: a mother who's in a very specific situation that most mothers are not going to be in.\"\n\n\n\n\n\nThe film is partially inspired by Bronstein's own experience caring for her seven-year-old daughter in a tiny San Diego motel room, surrounded by takeaway containers and existential dread — while navigating what she calls a \"confused combination of reverence and complete disrespect\" for motherhood.\n\n\n\n'You're stuck with her'\n\nAcross 113 minutes, If I Had Legs I'd Kick You drags its audience into a steady, uncomfortable spiral.\n\n\n\n\n\nWe watch Byrne's Linda eat with animalistic intensity — mouth open, food falling out — a visual shorthand for a woman who can't take care of herself. She drinks two bottles of wine a night while her daughter, meant to be under constant surveillance, sleeps alone. She buys a hamster and watches it escape and get run over by a car, guts spurting before the camera cuts abruptly to a slice of lasagna.\n\n\n\n\n\nThen there's the hole: a growing, pulsing void in the ceiling that serves as the film's trigger point. Even Bronstein isn't sure if the hole is real or not, explaining it as a symbol of that place in your brain where you shove everything that you can't deal with — knowing full well that it will force its way out eventually.\n\n\n\nIn If I Had Legs I'd Kick You, Rose Byrne is going through an \"existential crisis of tremendous proportions\". Source: Supplied / A24 \"This woman is having an existential crisis of tremendous proportions. She's experienced a trauma that she's avoiding at all costs. She's running away from it for the entire movie and it's going to come and get her,\" Bronstein says.\n\n\n\n\n\n\"It starts out as the first problem in the film and then expands out into this thing that takes on meaning beyond anything that reality can answer. I can't even really tell you [what it is] because it's a completely expressive idea that I can't fully articulate in words.\"\n\n\n\nREAD MORE Anya says having a child was the 'stupidest' decision she ever made\n\nByrne's performance is repulsive, unkempt, unpleasant — and terrifyingly real.\n\n\n\n\n\n\"She's in a state where she cannot take care of herself in any way, shape or form. We don't even know if she's bathing,\" Bronstein says.\n\n\n\n\n\n\"She has a de-evolution of appearance in this film. As her emotional state goes down, so does her appearance. She can't pretend anymore on the outside, it's gone.\"\n\n\n\nIf you are seeing an actual child, your sympathy is immediately going to go with that child.\n\nHer child, meanwhile, is a faceless voice that exists only off-screen and whose presence is felt through Byrne's reactions. The camera stays close to Bryne, lingering on the small, irritated microexpressions that have already generated Oscar's buzz.\n\n\n\n\n\n\"As soon as you're dealing with some of the behaviours that Linda is doing, if you are seeing an actual child, your sympathy is immediately going to go with that child. That's how we're wired,\" Bronstein says.\n\n\n\n\n\n\"What I wanted to do is make it impossible — impossible for there to be an easy way for the viewer to put their sympathy elsewhere than her. You're stuck with her. It's about her.\"\n\n\n\n'There's a deep shame'\n\nWhen it comes to motherhood on screen, the depictions we get are often narrow. In films like Bad Moms, the 'bad mother' is softened with humour — she might smoke too much or go out clubbing on a Wednesday, but she still loves her kids. She doesn't hate them. She doesn't regret becoming a mother.\n\n\n\n\n\nThat sanitation leaves little space for women who do struggle — those who experience perinatal depression, anxiety, or even regret having children entirely.\n\n\n\n\n\nUp to one in five women experience perinatal depression or anxiety during pregnancy or following the birth of their baby, according to Perinatal Anxiety & Depression Australia (PANDA). Postnatal psychosis — rarer but more severe — affects one to two new mothers per 1,000 births. Women may also experience PTSD, bipolar disorder or schizophrenia after giving birth.\n\n\n\nWriter and director Mary Bronstein isn't interested in 'bad' mothers. Instead, she hopes her film will break apart overly sentimental depictions of motherhood. Source: Supplied / A24 Julie Borninkhof, a clinical psychologist and the CEO of PANDA, says perinatal depression and anxiety often look different for everyone — sometimes like wanting to \"climb into a dark little box and block yourself away\", or being \"wound up like a rubber band\" with anxiety.\n\n\n\n\n\n\"Baby blues is an experience that's really common to women … but it's more short-winded and usually only lasts for a few weeks following the birth of a baby. Whereas anxiety and depression can go on for months and beyond the 12-month period,\" Borninkhof tells SBS News.\n\n\n\n\n\nBronstein tackles that taboo directly.\n\n\n\nOne subplot follows Linda's client Caroline (Australian Danielle Macdonald), a new mother who abandons her baby mid therapy session. Earlier, she emailed Linda a video of Andrea Yates — the real-life Texas mother who drowned her five children in 2001 after developing postpartum psychosis — fearing she might follow the same path.\n\n\n\n\n\n\"That storyline was very inspired by a lot of real cases that have happened in the [United] States. Every once in a while on the news, it's like: 'This mother did this. She did that'. She's villainised.\" Bronstein says.\n\n\n\n\n\n\"Sometimes it is bad people doing bad things. But most often, it's a mental illness. It's a real thing. It's postpartum depression and postpartum psychosis.\"\n\n\n\nWe're sold a bill of goods ... but it's not like that for a lot of women.\n\nBronstein wanted to challenge the overly sentimental depictions of motherhood we're sold.\n\n\n\n\n\n\"We're sold a bill of goods — the baby comes out, they give it to the mother, and you immediately look at and bond with the baby. But it's not like that for a lot of women.\"\n\n\n\n\n\nBorninkhof agrees that varied portrayals can help dismantle shame and stigma.\n\n\n\n\n\n\"People still find it difficult to say that they're struggling and that they need help … this pervasive feeling of being a failure and that you're not able to do what so many others are able to do is still a real barrier to people seeking help.\"\n\n\n\n'Maybe I got rid of the wrong one'\n\nThe film's most polarising moment comes when Linda, reflecting on a previous abortion, wonders aloud to her therapist: \"Maybe I got rid of the wrong one\".\n\n\n\n\n\nIt's a punch to the gut — and exactly the point.\n\n\n\n\n\n\"I wrote it in the script. I took it out. I put it back in because I knew that was the line that was going to make people uncomfortable,\" Bronstein says. \"But I was like, no — that's why it needs to be in there.\"\n\n\n\nI wrote it in the script. I took it out. I put it back in because I knew that was the line that was going to make people uncomfortable.\n\n\"It's the only time in the movie where she's truly being honest and expressing something really real and she's fuc---g kicked in the face for it.\"\n\n\n\n\n\nRegret over parenthood isn't rare. While difficult to quantify, one 2023 study estimated that between 5 and 14 per cent of parents in developed countries regret having children and would choose childlessness if they could turn back time.\n\n\n\n\n\nOnline, communities like Reddit's r/regretfulparents (54,000 members) and the Facebook group 'I Regret Having Children' (88,000 followers) share anonymous confessions — a testament to the lingering taboo.\n\n\n\nThe film's most controversial line almost didn't make it to the final cut, with Bronstein worried it would make people \"uncomfortable\". Source: SBS News / A24 Borninkhof says such regret is \"normal\" and \"human\", but can become damaging if left unaddressed.\n\n\n\n\n\n\"For people who do experience regret about being a parent and then sit in that space, it's hard to parent through that feeling,\" she says.\n\n\n\n\n\n\"We need to get help with the internal conflict that comes with that as soon as possible.\"\n\n\n\n'There's nothing wrong with being uncomfortable'\n\nBorninkhof urges viewers with lived experience of perinatal mental illness to approach films like this with care.\n\n\n\n\n\n\"For some people who feel like they've gotten through and survived that experience and have learned and grown from it, they may feel a sense of empathy and distance from being able to see a movie like this,\" she says.\n\n\n\n\n\n\"Some people feel this great sense of empowerment and self-reflection because they see that their experience was real and valid.\"\n\n\n\nWhile one clinical psychologist warns a film like this could be confronting for those who have experienced perinatal mental illness, Bronstein says there's \"nothing wrong with being uncomfortable\". Source: Supplied / A24 But she says for those who might be in the \"thick of it\", it might be confronting.\n\n\n\n\n\n\"That's not because the portrayal is not correct or shouldn't be told, but simply because our ability to hold all of our emotions at once and see them portrayed on a screen or reflected back to us in somebody's words can be really confronting.\"\n\n\n\n\n\nBronstein says discomfort is part of the point.\n\n\n\nIf something makes you uncomfortable, you need to wonder why it makes you so uncomfortable.\n\n\"There's nothing wrong with being uncomfortable. If something makes you uncomfortable, you need to wonder why it makes you so uncomfortable,\" she says.\n\n\n\n\n\n\"Why can't a woman wonder that in the privacy of her therapist's office? Why can't she say that? She's not saying it to her child. She's not even saying it to her husband.\n\n\n\n\n\n\"It's none of my business if somebody likes the movie or doesn't like the movie … I made a movie that really is dealing with some very uncomfortable things.\n\n\n\n\n\n\"But if the reason you don't like it is because something made you uncomfortable, that interests me. Why would that be a reason to not like a movie?\"\n\n\n\n\n\nThe PANDA National Helpline is available 9am-7.30pm Monday to Friday on 1300 726 306. More information is available at panda.org.au .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/bakasetas-scores-in-nightmare-start-for-scotland-20251116-p5nfru.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bakasetas scores in nightmare start for Scotland",
        "publish_date": "Sun, 16 Nov 2025 12:50:19 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bakasetas scores in nightmare start for Scotland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/the-brisbane-restaurants-that-will-restore-your-faith-in-yum-cha-20251111-p5n9c4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Brisbane restaurants that will restore your faith in yum cha",
        "publish_date": "Sun, 16 Nov 2025 12:50:10 +1100",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outFood The Brisbane restaurants that will restore your faith in yum cha Yum cha isn’t what it used to be, but these restaurants are offering innovative menus to keep the tradition alive – with or without the trolleys. Matt Shea November 16, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nYum cha has changed. That’s the first thing you need to know when considering where to head for some leisurely Sunday dim sum. The sprawling suburban joints with the powered trolleys? They’re few and far between these days. Instead, if a restaurant is peddling a yum cha menu, it will usually be a tiered-price menu that’s a variation on an a la carte menu, or a banquet menu that presents a number of dishes (perhaps bottomless, within reason) for a set price. Supernormal is serving a special dumplings menu on Sundays. Markus Ravik Southside and Central executive chef Benny Lam remembers yum cha quickly becoming part of his Brisbane childhood after he moved with his family from Hong Kong in 1992. “My uncle had a Chinese restaurant in Capalaba,” Lam says. “Every Monday was his day off so he would go to Chinatown [in Fortitude Valley] to buy groceries and have a bit of yum cha.\n\nAdvertisement\n\nRelated Article Perspective Restaurants open in Brisbane until 2am? Why not? “Back then, it was the Chinese chef tradition to go to Chinatown on Mondays because the daytime would be so quiet at their restaurants. So you’d go in, and it had this really good vibe because you would see everyone and talk about this and that.” Lam reckons yum cha isn’t what it used to be for two reasons. First, fresh dim sum is hard. “Because dumplings are handmade, you need to have a large restaurant and a super high volume to make it sustainable. Even a restaurant like Southside – if we did just yum cha, we’d 100 per cent have to close in a few months.”\n\nAdvertisement\n\n“It was the Chinese chef tradition to go to Chinatown on Mondays … it had this really good vibe because you would see everyone and talk about this and that.” Southside and Central executive chef Benny Lam. But also, fresh dim sum is popular, and long ago became part of the everyday a la carte menu at upmarket Chinese and pan-Asian restaurants, meaning the need for yum cha-focused restaurants – or a yum cha service in those restaurants – fell away. Those that remain are a bit hit or miss. The economies of scale Lam talks about mean a lot of restaurants are ordering their dim sum wholesale, rather than making it fresh themselves. Everyone has an underwhelming yum cha story. The following list is not that. Here’s where to get your yum cha fix in Brisbane. Southside\n\nAdvertisement\n\nSouth Brisbane east Asian restaurant Southside recently revised its yum cha menu, which kicks off at noon every Sunday. Southside runs its yum cha menu every Sunday. Markus Ravik It features a la carte menu dishes alongside signature yum cha items, such as goldfish prawn dumplings with tobiko, and panfried pork gyoza with a dan dan sauce and vinegar caramel. The menu is priced at $59 without drinks, or $99 with a two-hour beverage package that throws in house wines, tap beer and signature cocktails. Where to enjoy it? Outside, in the restaurant’s bucolic fern garden beneath the train overpass is best. 63 Melbourne Street, South Brisbane, southside-restaurant.com.au\n\nAdvertisement\n\nRu Yi Dim Sum A bunch of top Brisbane chefs will happily chew your ear off about Ru Yi – Lam, Stanley’s Louis Tikaram, and The Fifty Six’s Gerald Ong among them. This is closer to the traditional yum cha experience, but with the trolley replaced by an extensive sub-menu of dim sum, tiered in price. Dishes range from a wide variety of dumplings (prawn and chive, prawn and water chestnut, assorted mushroom, to name a few) to pork buns, steamed chicken feet with signature sauce, congee, and rice noodle rolls. Related Article One of West End’s best small restaurants has closed permanently Everything is housemade, meaning the dumplings are fresh and precisely executed.\n\nAdvertisement\n\nDon’t be put off by the location within Calamvale Central shopping centre: the restaurant itself is a charming, comfortable little space in which to spend an hour or two. Just be sure to book because this place absolutely pumps most services. Shop 59/662 Compton Road, Calamvale, ruyidimsum.com.au Longwang This slick CBD diner from Tassis Group bills itself as pan-Asian, but Cantonese is the cornerstone of Longwang’s cuisine so it leans hard into yum cha over summer, 11am-4pm on Friday and Saturday, and all day on Sunday. CBD restaurant Longwang will kick off a new yum cha menu in December. Markus Ravik\n\nAdvertisement\n\nNamed Yum Cha Cha Cha, the menu features dishes such as natural oysters; a beef tartare bite with chilli kosho, chives and tobiko; a wagyu beef dumpling in a beef broth with chilli oil; and XO prawn toast. For drinks, there are wines by Counterpoint and house beers on tap, but you can add cocktail jugs or a premium drinks upgrade. Yum Cha Cha Cha runs from December 15 to January 31 and is $68 per diner for a 90-minute sitting, or $78 per person for a two-hour sitting. 144 Edward Street, Brisbane, longwang.com.au Landmark Sunnybank These huge yum cha spots arguably aren’t what they used to be, but Landmark Sunnybank remains an institution in the southern suburbs, and at busy times, at least, you’ll get some trolley action.\n\nAdvertisement\n\nLandmark in Sunnybank is a perennial favourite with yum cha tragics. Robert Shakespeare Expect a yum cha menu with tiered pricing and dishes such as steamed spare ribs in black bean sauce, Shanghai pork dumplings, and steamed custard buns, along with barbecue dishes and seafood. Just don’t leave your visit too late on the weekend – this place is immensely popular. Golden Lane, in the same centre, is also worth a shout-out. 101/358 Mains Rd, Sunnybank, landmarkrestaurant.com.au Goodtime\n\nAdvertisement\n\nThis neatly designed little restaurant has quietly developed a loyal local following since opening in one of the old warehouse spaces in West Village in September 2024. Related Article Lion to permanently close Stone & Wood brewpub Monday to Thursday it presents its dim sum items as a banquet menu priced at $29 with any drinks order, or $69 with bottomless drinks. Dishes include pork xiao long bao, crispy pork gyoza, chicken siu mai, salt and pepper chicken, and crispy fried squid with salt and pepper. Shop T22/45 Mollison Street, West End, goodtimecheers.com\n\nAdvertisement\n\nStanley Stanley runs a yum cha menu every lunch Monday to Saturday, but on Sundays from 11.30am it becomes more of an event with a yum cha banquet for $59, or a champagne option for $158, and DJs spinning on the restaurant’s riverside deck. Stanley turns its lunchtime yum cha into an event on Sundays. The menu includes dishes such as prawn and chive spring rolls; Moreton Bay bug spring rolls; steamed barbecue pork buns with chilli jam; and pork and prawn dumplings served with either an aromatic broth or spicy sichuan with peanut and sesame. The champagne package adds two hours of free-flowing Louis Roederer.\n\nAdvertisement\n\n5 Boundary Street, Brisbane, stanleyrestaurant.com.au Yum Cha Garden City This handsome spot in the Westfield Mount Gravatt dining precinct presents its yum cha menu as a one-hour all-you-can-eat (with a drink purchase) deal, with prices for adults $59 during the week and $69 from Friday to Sunday and on public holidays. Related Article Brisbane’s best sandwiches? Here are our top picks of the past year Expect the yum cha classics, from pork and shrimp siu mai and barbecue pork buns through to crispy skin chicken and a variety of cheung fun. There’s also a premium section limited to one order per diner – think steamed scallops in garlic sauce, crispy roast duck, and black truffle fried rice.\n\nAdvertisement\n\nThe fitout is a modern interpretation of a classic Chinese restaurant, with parquet floors, white table linen and red and mirrored features, making it a neat place to dwell over some dim sum. Shop R6, Westfield Mount Gravatt, Cnr Logan and Kessels Road, Upper Mount Gravatt, yumchagc.com.au Supernormal A modern yum cha offering in all but name, every Sunday from 11.30am this riverside blockbuster looks not to just Hong Kong and China, but also Korea and Japan, for a tight menu of dim sum that changes weekly. Supernormal’s Sunday dumpling menu changes weekly.\n\nAdvertisement\n\nCheck the restaurant’s website to find out what’s on that week but expect dishes such as Moreton Bay bug toast; vegetable dumplings with shiitake XO; prawn and chicken dumplings with chilli vinegar; barbecue pork buns; and oxtail dumplings with red radish and orange. All are priced to be ordered individually to keep things approachable and flexible, and the a la carte menu is still available. In conjunction with the yum cha menu, the bar is stirring a tight, seasonal selection of chuhai highballs. 443 Queen Street, Brisbane, brisbane.supernormal.net.au Donna Chang This beautiful CBD restaurant feels tailor-made for a leisurely Sunday gathering, and Donna Chang has addressed that with a yum cha banquet menu.\n\nAdvertisement\n\nRelated Article Where to find Brisbane’s best ramen There are three variations: standard, pescatarian and non-pescatarian. Expect dishes such as pork xiao long bao; Moreton Bay bug dumplings; chicken, prawn and shiitake siu mai; cumin-spiced lamb buns; prawn and wombok gyoza; and a sesame prawn toast with a seaweed mayo. Donna Chang’s yum cha runs every Sunday 10am-12pm. Suite 3/171 George Street, Brisbane, donnachang.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/we-are-addicted-to-fossil-fuels-so-let-s-just-accept-it-20251113-p5nfbq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "We are addicted to fossil fuels, so let’s just accept it",
        "publish_date": "Sun, 16 Nov 2025 12:49:37 +1100",
        "category": "finance",
        "authors": [
            "Javier Blas"
        ],
        "text": "Suggesting that fossil fuels will stay around for a long time remains taboo in the energy debate. In climate change gatherings, the world has agreed to “consign coal to history” and “transition away” from oil and natural gas.\n\nIt has signalled, too, “the beginning of the end” of the fossil-fuel era and a “swift” transition to renewables.\n\nThat’s all very well meaning, but there’s a problem: With apologies to Margaret Thatcher, fossil fuels are not for turning.\n\nThe main long-term influence is the global push to reduce carbon emissions. Credit: AP\n\nJust two years ago, the International Energy Agency (IEA) unequivocally said that fossil-fuel demand would peak before the end of this decade. It was a black-and-white statement that left no wiggle room.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-guewel-20251113-p5nf43.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It took 20 years to convince her to take this role – was it worth the wait?",
        "publish_date": "Sun, 16 Nov 2025 12:44:23 +1100",
        "category": "entertainment",
        "authors": [
            "Bridget Davies",
            "Vyshnavee Wijekumar",
            "Andrew Fuhrmann"
        ],
        "text": "MUSIC\n\nCocteau’s Circle ★★★★\n\nAustralian Chamber Orchestra, Melbourne Recital Centre, November 15 “Astonish me!” This striking command drove the work of French poet and artistic polymath Jean Cocteau, after he was challenged by legendary Russian ballet impresario Sergei Diaghilev. In the years following World War I, Cocteau became associated with a remarkable number of painters, writers and most importantly, musicians. His collaborations with composers such as Stravinsky, Satie, Poulenc and Honegger certainly did yield astonishing results. Le Gateau Chocolat performs in Cocteau’s Circle with the Australian Chamber Orchestra. Credit: Daniel Boud In paying homage to Cocteau’s remarkable legacy, the Australian Chamber Orchestra has chosen to celebrate it in truly contemporary fashion. Set in a smoky, would-be cabaret, Cocteau’s spirit speaks through Le Gateau Chocolat, whose combination of deep bass voice, gender-bending costumes and outré stage presence reinterpret the libertine ambience of interwar Paris for our own times. Richard Tognetti and the ACO enthusiastically lead the audience on a 90-minute musical odyssey through scores associated with Cocteau, interspersed with empathetic connective tissue commissioned from Elena Kats-Chernin.\n\nAustralian-born, German-based soprano Chloe Lankshear adds a classy vocal element, including a nostalgic sung waltz by Poulenc and Lili Boulanger’s plangent Pie Jesu, before finishing with a husky, impassioned account of Edith Piaf’s Hymn to Love. Melbourne pianist Stefan Cassomenos dashes off some pianistic pyrotechnics from Jean Francaix’s Concertino for Piano and Orchestra with customary aplomb. Loading Movements from string quartets by Ravel and Debussy arranged for the orchestra elicit the ACO’s habitual verve, as does Darius Milhaud’s Le boeuf sur le toit, named for the bar where Cocteau’s set used to hang out. Le Gateau Chocolat’s glitteringly camp but heartfelt vocal contributions range from Gershwin to, of all things, Janis Ian’s 1970s hit Stars. While perhaps not astonishing, this thoughtful, colourful tribute to one of last century’s most precocious artistic minds does have an appropriate sense of pushing boundaries, just as the ACO has done over its 50 years of existence.\n\nReviewed by Tony Way\n\nMUSIC\n\nSam Fender | People Watching Tour ★★★★\n\nSidney Myer Music Bowl, November 14 The brisk cold of a Melbourne spring evening doesn’t thwart the crowd’s enthusiasm at Sidney Myer Music Bowl. Some in the seated section have already left their allocated spots to surround the front of the stage. When the lights dim, fans roar at Sam Fender and his band’s arrival. Sam Fender performs at the Sidney Myer Music Bowl on November 14. Credit: Paul Rovere The 31-year-old English singer-songwriter from North Shields has sold out arenas across the UK, Ireland, Europe and North America. He recently won the Mercury Prize for his 2025 album People Watching – awarded to musicians from the UK and Ireland for best album – and donated the winnings to the Music Venues Trust, a charity that preserves small live performance venues. Fender is accompanied by a seven-piece band filled with multi-instrumentalists, including drums, guitar, keys, back-up vocals, tambourine, saxophone and trumpet. When they all perform together, the sound inside the bowl is so electric you can feel the pulsating rhythm in your body; getting lost in the music, you forget where you are.\n\nDespite confessing that he’s suffering from jet lag, Fender’s performance never falters. “All right, let’s do this, lads,” he says as he launches into Will We Talk? His repertoire is a mix of slower tracks and American-style 1970s rock ballads. Talk to You, a collaboration featuring Elton John on piano on the original track, is sung with an air of regret about the end of a long-term friendship. Spit of You seeps with a pleading tone as he sings about the fraught communication between a father and son; a Polaroid appears of him and his father on screen. Fender’s Melbourne performance never faltered. Credit: Paul Rovere Contrastingly, the album’s title track People Watching feels anthemic and Crumbling Empire is reminiscent of the Killers’ heartland rock era, with visuals of mountain ranges, desert landscapes and industrial plants playing into the working-class sensibility. Howdon Aldi Death Queue is a fun punk rock interlude, which Fender jokingly describes as “the stupidest song I ever wrote”. Seventeen Going Under is a highlight. Fender demands that the crowd sings along, and they abide enthusiastically. The keyboard player stands on his seat and amps up fans as the drums pound and trumpet and saxophone soar. Fender makes fun of the pretence of leaving the stage before an encore, and the crowd continues the vocal riff to coax him back. “Melbourne, thank you so much for a wonderful f---ing night,” Fender shouts. With a bang, white confetti fills the air, followed by deafening guitar and cheers.\n\nReviewed by Vyshnavee Wijekumar\n\nPERFORMANCE\n\nGuewel ★★★\n\nArts House, until November 16 A guewel is a West African oral historian, someone who carries in memory the stories of local families, who can summon the lore of a place and its people as a celebratory recitation. Guewel at Arts House. Credit: Gregory Lorenzutti In this hour-long production led by Lamine Sonko, the figure of the guewel is reimagined as a conduit between earthly rhythms and the life of the stars: the custodian of a larger lore. The show sketches the outlines of a cosmology, while also showcasing a cohort of gifted performers – dancers, musicians, ritualists – in front of lushly animated projections.\n\nAt its centre are three figures personifying the sun, the moon and the stars. Their full-body costumes – gorgeously sculptural – recall masquerades from Senegal’s Casamance region, with their all-enveloping silhouettes. The dried fronds and towering crest of the figure representing the stars suggest a Kumpo-like apparition, while the moon reads as a delicate crescent, with cowrie shells gleaming on dark cloth. The voltage that runs through Guewel comes from the drumming and dancing. Credit: Gregory Lorenzutti The costumes are impressive, but the voltage that runs through Guewel comes from the drumming and dancing. Hand-drum flurries launch sudden accelerations; legs carve lateral pathways as the dancers kick up their heels. The animations are often beautiful, with veils and translucencies, but at times the smoky effects pull focus from bodies onstage. The visual busyness dilutes the intimacy.\n\nStill, it’s the projections that spell out the work’s big ideas: everything is interwoven, nature moves in cycles. The cosmology is legible, even when dramaturgical transitions feel more ceremonial than exploratory. The figure representing the stars in Guewel, who harks back to West African masquerades. Credit: Gregory Lorenzutti What does it mean to really inhabit ancestral knowledge, not just cite it? Brief as it is, Guewel cannot offer a full answer. It plays more like a prelude that clears space for a deeper encounter. Seven years in gestation and framed as a cross-cultural collaboration, Guewel feels like the opening scene of a larger narrative – and makes you curious for the epic adventure to follow.\n\nReviewed by Andrew Fuhrmann\n\nTHEATRE\n\nThe Haunting of Spook Mansion (By Ghosts) ★★\n\nChapel Off Chapel, until November 23 This paranormal piss-take from comedy writer Michael Ward (Shaun Micallef’s Mad as Hell, RockWiz, I’m A Celebrity … Get Me Out of Here) sports well-known comedic talent. It’s flagrantly inane and does scrape the bottom of the proverbial, humour-wise, though it does also barrel along. Ghost-busting super-sceptic professor Adrian Chambers (Peter Houghton) has made a career debunking the supernatural. At a sparsely attended launch for his latest book, he’s buttonholed by hot librarian Beth Jackson (Emily Taheny) during the post-launch Q&A. Peter Houghton in The Haunting of Spook Mansion (By Ghosts). Credit: Darren Gill Yet the bookish Beth is no ordinary fan. She has a fiendish proposition for Chambers: $500,000 to spend the night in Spook Mansion, a notorious haunted house. Chambers nearly declines – crackpot offers are common in the paranormal investigation biz – but he needs the cash.\n\nSo begins a ridiculous comedy horror haunted by every trope in the book, including an elderly potato-seller with a terrible provincial accent (Ben Russell) to warn the stranger off. Spook Mansion goes all in for cheesy visual tricks: bookcases, sinister portraits, a fireplace with strange objects on the mantel. Beth will summon poltergeists and apparitions in a seance; the source of the clangour in the basement will be discovered. Houghton and Emily Taheny lean into myriad horror tropes. Credit: Darren Gill Why has Chambers been lured to this place? All will come to light, as murderous secrets are revealed and a diabolical plot unmasked. Some of the buffoonery relies on pop culture references aimed at Boomer and Gen X audiences, but there are enough shameless hijinks on offer, under Russell Fletcher’s direction, to get a giggle and a snort from anyone. As a mainstream lampoon of supernatural horror, The Haunting of Spook Mansion (By Ghosts) does the job, but it could be significantly improved. Plot points swarm the denouement like flying monkeys, in a way that makes final revelations difficult to follow. And the show sometimes feels like a TV comedy skit that got out of hand.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/wallabies-player-ratings-how-the-men-in-gold-performed-against-ireland-20251116-p5nfpb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wallabies player ratings: How the men in gold performed against Ireland",
        "publish_date": "Sun, 16 Nov 2025 11:57:27 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "5. Tom Hooper - 6.5 One of the Wallabies best on a night of underwhelming performances. Topped both the Wallabies’ carry and tackle counts. Was likened to Ireland’s impressive middle-rower Tadgh Beirne in the pre-game call, and while he’s not there yet, that’s a realistic ambition for the youngster, who is still only 24 and is arguably the Wallabies’ find (or re-discovery) of 2025. 6. Rob Valetini - 5.5 Took some big carries early in the first half and used his power in the contact zone. But fell out of the game in the second half. We haven’t seen the same game-changing talents from big Bobby V in the last few months.\n\n7. Fraser McReight - 6 Pushed hard, and is always one of the Wallabies players searching to turn the game. Scored a well-taken try. But he was well negated by the Ireland forwards, and wasn’t rewarded by the referee for his 50-50 poaching opportunities. 8. Harry Wilson - 5 Another whose effort is never in question. Puts his hand up for carries and hard tackles whenever they’re needed. But the impact of those involvements ebbs and flows, and there is a question on Wilson’s dwindling battery level, too. No one will enjoy a post-tour break more.\n\n9. Jake Gordon - 5 Kicking game was arguably a fraction off this week, with chasers rarely getting up for a contest. Gordon’s work when recycling on attack in Ireland’s red zone was sharp, but the problem was the Wallabies didn’t get to it more often. 10. James O’Connor - 4 Tough night for James O’Connor, who was thrown headfirst into the mincer by Joe Schmidt in Dublin. Not even in the squad for the tour until this week, he was called in and then immediately given a starting jersey. And then tasked with running an unwise attacking game plan. James O’Connor of Australia is tackled by Sam Prendergast. Credit: Getty Images\n\nNone of that excuses O’Connor’s skill errors. His rustiness was apparent. He was beaten in the air, too. But this was just another episode of the blindfolded darts game that is the Wallabies selection policy for the No.10. And it’s left us no closer to getting answers. 11. Harry Potter - 4 As said every week about Potter: a mixed game. But this time the good - some impressive defence - was outweighed by poor work under the high ball, both defensively and offensively, and being caught out of position. Schmidt rates Potter as strong in the air, but it hasn’t been apparent in recent outings. 12. Len Ikitau -5.5 Another who shone when the Wallabies had the ball in the Irish red zone, and were attacking directly. Ikitau plays as an extra back-rower in that zone, and also handles as a first receiver. A try was a good reward. But otherwise was passing out the back, and Ireland always had the answers.\n\n13. Joseph-Aukuso Suaalii - 5.5 Filipo Daugunu of Australia jumps for the ball with Mack Hansen. Credit: Getty Images Looked for ways to enter the game on attack and defended intelligently. And was even one of the few Wallabies to take a clean catch under a high ball. Are we wedded to Suaalii at No.13? Hands up if you think he should be the Wallabies’ fullback against France. 14. Filipo Daugunu - 4 A big powerful ball runner, but had little opportunity other than one nice run, that was ruined by a loose inside pass. His high ball work was also not where it needs to be.\n\n15. Max Jorgensen - 3.5 Park this one and move on. Not a night to remember for the young superstar, with errors aplenty, many of which led to Irish tries. High balls were dropped, there were knock-ons, and the usually unshakeable confidence of Jorgensen was clearly shaken. Kudos to Schmidt, perhaps, for backing him, but Jorgensen should have moved to the wing when Kellaway came on. Reserves 16. Billy Pollard - 5 Powerful running on display, and his try was a good reward. But losing the lineout in the 64th minute was a bad miss, and while the lift and jump were off, this has to be bread-and-butter stuff at Test level.\n\n17. Tom Robertson - 4.5 Loading No major impact from Robertson, who keeps a scrum locked down and does his tight duties well. But he doesn’t threaten as a ball carrier. 18. Zane Nonggorr - 3.5 Penalised for collapsing his first scrum and then slow on lift on Frost for that crucial missed lineout.\n\n19. Nick Frost - 3.5 Worked hard in a short time on the field, with eight tackles in 16 minutes. But then missed the key lineout and was binned for the last 10 minutes, which allowed Ireland to exploit his absence. 20. Carlo Tizzano - 4.5 Played a quarter but didn’t get sighted with any big plays. Like McReight, he couldn’t get on the ball. Question mark whether a second No.7 is a good use of the reserve back row slot, given McReight is an 80-minute player. 21. Ryan Lonergan - n/a",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/inside-our-journalism-and-the-real-estate-agent-tricks-used-to-underquote-20251115-p5nfn0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inside our journalism and the real estate agent tricks used to underquote",
        "publish_date": "Sun, 16 Nov 2025 11:51:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "Inside our journalism and the real estate agent tricks used to underquote\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/meet-the-afl-prospect-with-the-best-kick-in-this-year-s-draft-class-20251113-p5nf44.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meet the AFL prospect with the best kick in this year’s draft class",
        "publish_date": "Sun, 16 Nov 2025 11:24:23 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Josh Lindsay starts each day the same way.\n\nEver since the Geelong Falcons’ top AFL prospect was about 12 years old, he wakes to an alarm, showers, then spends roughly 15 minutes honing his kicking skills – arguably the best in this year’s draft – in the family garage.\n\nJosh Lindsay is set to be a first-round selection in the national draft. Credit: AFL Photos\n\nThere are footballs and boots scattered everywhere, goal posts on the back wall of the garage to aim at, and a rebound net to maximise how many kicks Lindsay can perform in a short period.\n\n“It’s something a bit different that I do, but I think it goes a long way. I really enjoy doing it, so each morning I’m in the garage getting plenty of touches in before I attack the day,” he told The Age.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/this-is-not-acceptable-wallabies-woes-paint-bleak-world-cup-picture-20251116-p5nfqd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This is not acceptable: Wallabies woes paint bleak World Cup picture",
        "publish_date": "Sun, 16 Nov 2025 11:23:17 +1100",
        "category": "sports",
        "authors": [
            "Peter Fitzsimons"
        ],
        "text": "The Wallabies vs Ireland Test match in Dublin?\n\nThe staggering news, early, was that the Australians scored five – count’em – FIVE tries in the first half!\n\nLess good was that it was Ireland’s fullback, and Canberra boy, Mack Hansen, who scored three of them – the first seeing him go over completely untouched to score under the posts, after clever Irish razzle-dazzle to frazzle the Wallabies’ defence.\n\nBut forget that! Our blokes were able to absorb those disasters and still come back into the match - despite our line-out continuing to malfunction, and so many unforced errors it’d kill a brown dog – by scoring two tries to make it 19-14 down at the break. It was further proof of what this year has already established - this generation of Wallabies has character and ability.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/slick-early-knockout-on-ufc-blockbuster-20251116-p5nfr2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Slick' early knockout on UFC blockbuster",
        "publish_date": "Sun, 16 Nov 2025 11:19:29 +1100",
        "category": "sports",
        "authors": [],
        "text": "'Slick' early knockout on UFC blockbuster\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/metro-tunnel-opening-date-revealed-taking-passengers-earlier-than-expected-20251116-p5nfq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Metro Tunnel opening date revealed, taking passengers earlier than expected",
        "publish_date": "Sun, 16 Nov 2025 11:02:06 +1100",
        "category": "finance",
        "authors": [
            "Kieran Rooney"
        ],
        "text": "Melbourne’s Metro Tunnel will be taking passengers from November 30, more than a week earlier than expected.\n\nPrime Minister Anthony Albanese joined Premier Jacinta Allan on Sunday in announcing the opening date for the $15.5 billion project.\n\nThe pair met at Sunshine station, where both levels of government are funding a $4 billion upgrade of the rail network in the region, and caught a train into the tunnel before disembarking at the new State Library station for a tour.\n\nThe state government had previously revealed services would start from December, and it was widely believed the opening date would be on a Saturday or Sunday when services were less frequent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/demolition-derby-car-ploughs-into-crowd-two-critical-20251115-p5nfp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘He’s blacked out’: Demolition derby car ploughs into crowd at NSW show",
        "publish_date": "Sun, 16 Nov 2025 10:28:02 +1100",
        "category": "sports",
        "authors": [
            "Josefine Ganko",
            "Ben Cubby"
        ],
        "text": "Nine people have been injured, including a 54-year-old man who is in a critical condition with spinal injuries, after a car ploughed into the crowd at a demolition derby event in the state’s north-west on Saturday night.\n\nDemolition derby driver Blake Taylor said his brother, Steven, had blacked out behind the wheel with his foot wedged on the accelerator before smashing through a perimeter fence into the crowd at Walcha showgrounds, 90 kilometres east of Tamworth, about 6.15pm on Saturday night.\n\nTerrifying footage captured the moment of impact as the car demolished a temporary grandstand and sent people flying through the air.\n\nA 54-year-old man with spinal injuries and a man in his 30s with a head injury were taken by helicopter to John Hunter Hospital in Newcastle in critical conditions.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/eubank-dropped-twice-in-final-round-20251116-p5nfqp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Eubank dropped twice in final round",
        "publish_date": "Sun, 16 Nov 2025 10:16:47 +1100",
        "category": "sports",
        "authors": [],
        "text": "Eubank dropped twice in final round\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/bullets-sprayed-into-home-in-sydneys-south-west-20251116-p5nfql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bullets sprayed into home in Sydney's south-west",
        "publish_date": "Sun, 16 Nov 2025 10:07:11 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bullets sprayed into home in Sydney's south-west\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/mates-mp-shrugs-off-net-232833068.html",
        "title": "‘Disrespect’: Libs blasted for net zero move",
        "publish_date": "2025-11-16T01:33:15Z",
        "category": "finance",
        "authors": [],
        "text": "Foreign Minister Penny Wong has slammed the Coalition’s approach to climate policy, claiming it amounts to “disrespect” for Australia’s Pacific neighbours and will have significant geopolitical consequences.\n\nBoth the Liberals and the Nationals have separately abandoned Australia’s commitment to net zero by 2050, with the senior Coalition partner making the announcement on Thursday.\n\nA joint position will now formally be announced on Sunday afternoon.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nNet zero is a long-term goal of the Paris Agreement, an international climate change treaty that aims to keep global temperatures below 2C on pre-industrial levels.\n\nTo achieve that, global emissions must reach net zero by 2050, as per the accords.\n\nThe Coalition signed Australia up to the agreement in 2016 and also set Australia’s net zero target in 2021.\n\nSenator Wong, who was appointed Australia’s first-ever climate change minister under the Rudd government in 2007, said the Liberal Party’s move to scrap the emissions target was a sign extreme views had permeated the party.\n\nThe Coalition’s climate policies have historically been met with concern by Pacific nations, Penny Wong said. Picture: Christian Gilles / NewsWire\n\n“I mean this used to be a serious mainstream political party in this country and now it is overrun by the fringes,” she told the ABC.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAsked what the response was from the Pacific, a region that is both a key strategic partner for Australia, as well as one of the world’s most vulnerable to climate change, Senator Wong said the Coalition’s climate policies had historically been met with apprehension.\n\n“The Pacific’s view of the Coalition’s approach to climate policy is well documented and it has become emblematic of the Coalition’s disrespect for the Pacific.\n\n“I mean, that was the case under Tony Abbott, that was the case under Scott Morrison, and regrettably, it is the case under Sussan Ley.”\n\nAsked point-blank whether Pacific nations had criticised the Liberals and Nationals for abandoning net zero, Senator Wong said the region regarded “climate change as their number one issue”.\n\nMs Wong said the Coalition’s climate policies had long been met with apprehension in the Pacific. Picture: Supplied\n\n“So, when parties ostensibly of government in our country do this, or make jokes about water lapping at the door, or demonstrate to them that they simply are not prepared to act, what the Pacific take from that is disrespect.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Now, we know our prosperity and our security is tied to our region.\n\n“This just demonstrates again that the Coalition not only would impose higher costs on Australians, but would impose a cost on Australia in our region.”\n\nLib denies net zero stunt\n\nA Liberal frontbencher has shut down rumours the party’s conservatives pulled a stunt as a bloc to try intimidate Sussan Ley to drop net zero.\n\nOn Wednesday, about 15 members of the Liberal Party’s right faction, including leadership aspirants Andrew Hastie and Angus Taylor, entered a crucial party room meeting as a bloc.\n\nThey were accompanied by senators Jacinta Nampijinpa Price and Sarah Henderson, both outspoken critics of Ms Ley’s leadership, among other conservative colleagues.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThat midweek meeting at Parliament House ultimately determined the party’s decision to axe committing to a net zero emissions target, following months of internal divisions over energy policy.\n\nSeveral outspoken critics of Sussan Ley’s leadership fronted a net zero party room meeting as a unit. Picture: NewsWire / Martin Ollman\n\nAsked whether the right faction’s show of unity was a strategy designed to intimidate the Opposition Leader into dropping the contentious emissions target, opposition home affairs spokesman Jonathon Duniam told Sky News: “No, I think, as I say, there are people who will have similar views around a particular issue.”\n\nMr Duniam, who was also part of the bloc appearance on Wednesday, said everyone in the pictured group believed the “the approach taken ultimately by the Liberal Party (was) the right one” and all held the same views.\n\n“So there’s not really much to say about it, other than we’re all good mates.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We all believe in the same thing, and we look forward to winning the next election with a good policy suite.”\n\nJonathon Duniam backed Ms Ley’s leadership, saying the group’s main motivation was their agreement on dropping net zero. Picture: Supplied\n\nHe added he was equally “great mates” with Mr Taylor and Mr Hastie, as he was with “people that others would classify as moderates”.\n\nAsked which of his self-described friends would make a better leader of the Liberals, Mr Duniam avoided answering, instead endorsing Ms Ley’s leadership to take the party to the next election.\n\n“Well Sussan Ley is our leader … I’ve been asked multiple times: ‘Do I support her?’ And my answer is, as it has been on all of those occasions, I support her because she has she’s the one who’s guided us through this process. She’s the one who’s landed this policy outcome.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I look forward to working with her on other issues like migration, which is in the home affairs and immigration policy area.\n\nSussan Ley announced the Liberal Party would abandon net zero targets on Thursday. Picture: NewsWire / Martin Ollman\n\n“So I’m supporting Sussan Ley. She’s our leader. She’ll take us to the next election, and we are going to give it a red hot go and hold this appalling government to account.”\n\nOn Wednesday, the Liberals agreed to reducing emissions year-on-year within five year blocks, tying those reductions to comparable countries, and as quickly as technologies allow, as well as staying in the Paris Agreement, an international climate treaty that aims to keep global temperatures below 2C on pre-industrial levels.\n\nThe Coalition signed Australia up to it in 2016 and also set Australia’s net zero by 2050 target in 2021.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt comes as the Nationals abandoned net zero earlier this month.\n\nBoth changes paved the way to establish a new Coalition position on energy, which is due to be announced after a joint party room meeting on Sunday afternoon.",
        "source": "Yahoo"
    }
]