[
    {
        "url": "https://www.9news.com.au/world/maria-eftimova-inquest-into-womans-fatal-fall-off-mountain-ends-uk/90995ff9-d501-4722-8aec-81272a69a289",
        "title": "'Flying over my head': Inquest examines woman's fatal plunge down mountain",
        "publish_date": "Thu, 12 Jun 2025 01:20:17 +0000",
        "category": "sports",
        "authors": [
            "Jun"
        ],
        "text": "T﻿he inquest into the death of a woman who took a fatal fall down one of Britain's most popular mountains has concluded.\n\nMaria Eftimova, a Bulgaria-born structural civil engineer who lived in the UK, fell when she tried to pull herself up a ledge of Mount Tryfan, in Eryri, or Snowdonia, Wales, the BBC has reported .\n\nThe inquest was told Eftimova was part of a group who elected to choose a more challenging route up the popular climbing mountain.\n\nMaria Eftimova died falling from a mountain in Wales. (Maria Eftimova/Instagram)\n\nTwo of her companions described the moment she fell after being unable to secure a handhold.\n\n\"She started to pull herself up, but then I saw her flying over the top of my head down the mountainside,\" said fellow climber Harry Jones in a statement.\n\nAnother group member, Neil Oakes, said he remembered shouting \"no no no\" as he watched Eftimova in \"freefall\", and that he looked away before she struck the mountainside below.\n\nMount Tryfan in Wales. (Getty Images/iStockphoto)\n\nDictator avoids punishment for cannibalism through legal loophole View Gallery\n\nEftimova died before rescue crews could remove her from﻿ the mountain.\n\nShe was found to have suffered severe head injuries.\n\nShe was an experieced mountain climber and overall adventurer, having completed a glacier climbing course in Norway, the BBC said.\n\nThe coroner recorded a conclusion of accidental death and passed her condolences on to loved ones over the loss of a \"bright and conscientious young woman\".﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/monash-ivf-chief-executive-resigns-after-second-embryo-bungle/feb0452b-6c95-49ef-b0fc-84e5f847a6f4",
        "title": "Monash IVF CEO resigns after second embryo bungle",
        "publish_date": "Wed, 11 Jun 2025 23:54:05 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "T﻿he chief executive of Monash IVF has stood down after the company recently reported a second bungled procedure involving embryo transfer .\n\nMichael Knaap has resigned as chief executive, managing director, and director at the IVF giant.\n\nKnaap had been the chief executive since 2019.\n\nMonash IVF has revealed two embryo bungles in recent months. (Nine)\n\nEarlier this week, Monash IVF revealed a mix-up whereby a patient in Melbourne had their own embryo \"mistakenly transferred\" back to them, rather than one belonging to their partner.\n\nThe incident took place on June 5.\n\nIt followed a revelation two months prior that another mixup had seen a woman in Brisbane carry a stranger's child to term.\n\nMichael Knaap has resigned as chief executive, managing director, and director at the IVF giant. (Nine)\n\nAn independent review is underway for both incidents, though it's understood they took place years apart.\n\nMonash IVF chief financial officer Malik Jainudeen has been appointed acting chief executive.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/jamie-dimon-the-economy-could-deteriorate-soon/623ba8c4-cc81-4417-8f41-179757d1e89d",
        "title": "Boss of world's biggest bank sounds alarm",
        "publish_date": "Wed, 11 Jun 2025 21:42:30 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "JPMorgan Chase CEO Jamie Dimon has warned that encouraging economic data could soon turn worrisome as President Donald Trump's tariffs continue to bite.\n\n\"You're going to see real numbers, and I think there's a chance real numbers will deteriorate soon,\" Dimon said, according to a FactSet transcript of the Morgan Stanley US Financial Conference in New York.\n\nTrump's tariffs have yet to really affect data like monthly inflation and jobs reports, but the economy is prone to a downturn if that changes, he said.\n\nPresident Donald Trump speaks during an event in April to announce new tariffs in the Rose Garden at the White House (AP)\n\nWall Street has been eager for any sign the economy might muddle through the confusion stoked by Trump's tariffs, even as tremendous uncertainty lingers. It will likely be a few months before the full impact of tariffs on business decisions, hiring and inflation show up.\n\nConsumer sentiment and the stock market have both rebounded from peak uncertainty in early April, Dimon said, but it's important to recognise that neither \"consumer sentiment nor businesses\" ever determine the key \"inflection points\" for how the economy is faring.\n\nThe hard data, like job growth and inflation, is what matters most, Dimon said.\n\n\"You haven't seen an effect yet other than in the sentiment,\" Dimon said. \"And maybe in July, August, September, October, you'll start to see, did it have an effect? My guess is it did, hopefully not dramatic.\"\n\n\"Employment will come down a little bit. Inflation will go up a little bit,\" Dimon said. \"Hopefully, it's just a little bit.\"\n\nJPMorgan Chase CEO Jamie Dimon is pictured in Washington, DC, in October 2024. (Kevin Dietsch/Getty Images via CNN)\n\nThe latest Consumer Price Index data showed inflation cooled more than expected in May. But Dimon said he's worried about inflation and economic growth because Trump's tariffs and deportations could change things.\n\nHe also added that lower immigration to the US could hurt the economy.\n\n\"These are a lot of moving parts,\" he said.\n\n\"The buts are real, and I am not trying to be negative,\" Dimon said. \"You have all these really complex moving tectonic plates around trade, economics, geopolitics.\"\n\nHe added that the impact of tariffs might disrupt the economy but won't make the \"ship go down.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/whale-stuck-in-net-off-gold-coast-beach-rescue-operation-underway/6d2fd5b0-4d65-4bbb-8a3a-7db78c29e0db",
        "title": "Whale freed from shark net off Gold Coast",
        "publish_date": "Thu, 12 Jun 2025 00:41:17 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A whale has been freed from a shark net after a rescue operation off the\n\nIt's understood the whale was caught in the net off Greenmount Beach at Coolangatta.\n\nIt's understood the whale was caught in the net off Greenmount Beach at Coolangatta.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/rare-labubu-sells-for-more-than-230000-at-auction/d9b6f33d-397b-496e-901b-b5370a83dc47",
        "title": "Rare Labubu sells for more than $230,000 at auction",
        "publish_date": "Thu, 12 Jun 2025 01:17:11 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A rare, first-generation Labubu figure has sold for $US150,000 ($230,000) in Beijing at an auction held exclusively for the toys that have taken the world by storm.\n\nThe 131-centimetre mint green figurine with a gremlin-like appearance, sharp teeth and puckish grin went for 1.08 million yuan at the Yongle International Auction house that normally specialises in selling jewellery and modern art.\n\n\"Congratulations to the online buyer on collecting the world's only such one,\" said the auctioneer at an exhibition centre in downtown Beijing on Tuesday afternoon.\n\nA rare, first-generation Labubu figure has sold for $150,000 in Beijing at an auction held exclusively for the toys that have taken the world by storm. (Nine)\n\nLabubus are currently the trendiest plush toys on the planet, created by Hong Kong-born illustrator Kasing Lung and retailed by the Chinese toy giant Pop Mart.\n\nIn recent months, the bunny-bodied, elf-faced creatures — equal parts grotesque and adorable — have surged in popularity, sparking buying frenzies around the world, and in some cases, brawls among fans outside shops selling them.\n\nEven in China, where Pop Mart is based and most of its toys are made, people are struggling to get their hands on Labubus.\n\nA total of 48 Labubus were auctioned at the special event, billed as the \"world's first\" auction of first-generation collectible Labubus.\n\nA brown, 160-centimetre Labubu figure sold for $175,331, the second highest hammer price at the event.\n\nA brown, 160-centimetre (63-inch) Labubu figure, sold for A$175,331, the second highest hammer price at the event. (Today)\n\nThe company said only 15 such figures exist around the world.\n\nOther figures went for more than $1500 each.\n\n\"As a trendy toy in China, Labubu is now becoming a global artwork as it has truly sparked a craze around the world,\" Zhao Xu, the founder of Yongle Auction, told state-owned outlet The Beijing News .\n\nZhao said the company planned to hold monthly livestream auctions for Labubu and other trendy artworks.\n\nA pair of Minion-like Labubus sold at auction for $2137.\n\nBuyers at the auction also had to pay an additional 15 per cent brokerage fee on top of the hammer prices.\n\nLabubu's viral popularity has been a booster for Pop Mart. (Edward Berthelot/Getty )\n\nAnd it is not rare to see a price inflation of Labubus due to the crazy demand in China.\n\nFor instance, a blind box from the latest Labubu 3.0 series, originally priced at about $121.50, has been selling for up to $417 on the second-hand market, state-owned outlet Cover News reported.\n\nLabubu's viral popularity has been a booster for Pop Mart.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/monica-will-graduate-with-a-student-debt-of-130k-here-is-what-she-wishes-she-knew-at-18/3aab9e31-5671-4dab-9b3e-e72bca3cbd29",
        "title": "Monica has a $130k student debt. Here is what she wishes she knew at 18",
        "publish_date": "Wed, 11 Jun 2025 19:31:57 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A Melbourne woman who racked up a $130,000 student debt, as well as $30,000 in up-front university fees, says she now regrets some of the expensive study choices she made as an 18-year-old.\n\nMonica, who asked for her surname to be withheld, will graduate this year and become a registered psychologist after six years of study.\n\nWhile Monica said she was still happy with her career choice, there were many things she would like to go back and tell her teenage self.\n\nMelbourne psychology student has a student debt of $130,000 and has paid $33,000 for her master's degree after hitting the HECS/HELP cap. (iStock)\n\nMonica grew up in a low-income household and, after finishing school, she didn't have much parental support.\n\n\"I got kicked out of home. I was 18 years old and completely on my own,\" she said.\n\nAs she was selecting her first degree, Monica remembers steering clear of Victoria's more prestigious universities, such as Monash University and the University of Melbourne, because she believed they had the highest fees.\n\nHowever, she soon found herself \"sucked in\" by the marketing campaigns of private tertiary education providers.\n\nShe ended up enrolling in a Bachelor of Criminology and Justice degree with one of those tertiary training colleges, the main drawcard of which was that students could finish the degree in two years instead of three.\n\n\"That was really attractive to me because I was living out of home. I was thinking, 'This will help me find a job faster,'\" she said.\n\n\"And the reality was, when I finished, it didn't actually help me find a job faster. No-one cared that you had finished a degree in two years.\"\n\nThat degree cost Monica $66,000 and now makes up a large portion of her debt.\n\nOne key thing Monica said she didn't realise when she signed up for the degree was that there were Commonwealth Supported Places (CSPs) on offer at universities teaching the same degree.\n\nA CSP is a subsidised place at an Australian university or approved higher education provider where part of your fees are paid by the government.\n\nThose fees do not need to be repaid and are not a loan.\n\nIn Monica's case, getting a CSP at a university would have halved her fees.\n\nMonica said she was \"beside herself\" several years later when she found out how much she could have saved in student fees.\n\n\"I just felt very naive and embarrassed,\" she said.\n\n\"I wish that I was more aware of what a Commonwealth Supported Place was, and what it can actually do for you.\"\n\nAfter finishing her criminology degree, Monica ended up completing a graduate diploma at the same private tertiary college.\n\nHowever, she then needed to study for a further graduate diploma at Deakin University, which included a thesis component, before qualifying for entry to a master's degree in professional psychology, also at Deakin University.\n\nMonica completed an undergraduate degree and a diploma at a private tertiary training college, before studying for another diploma and her master's at Deakin University. (iStock)\n\nAs she had reached the HECS/HELP borrowing limit of $126,000 - the amount is higher for some students studying some courses, such as Medicine - Monica needed to pay the $33,000 for her master's degree up front.\n\nIn order to afford the fees, Monica took two years off her studies and work full-time.\n\n\"I pretty much saved like mad, so I could actually afford to pay for the master's degree up-front,\" she said.\n\nThe cost of a university degree can vary wildly depending on the course studied and at which institution.\n\nUnder changes implemented by the Coalition government in 2021, some courses, such as Arts-related degrees, became more expensive, while the fees for others, like teaching and nursing, were reduced.\n\nDepartment of Education figures released last July show arts, law and commerce students can expect to pay nearly $17,000 a year for their courses, compared to just over $4600 for agriculture or nursing students.\n\nA person graduating from a three-year nursing degree would expect a student loan debt of $14,000.\n\nBut a recent graduate of a three-year degree in history would have a HECS debt of $51,000.\n\nLast year, the Albanese Government retrospectively changed the way HECS/HELP debts are indexed in response to a public outcry when indexation rates - tied to inflation - hit 7.1 per cent in July 2023.\n\nIndexation is now based on either the Consumer Price Index (CPI) or Wage Price Index (WPI), whichever is lower.\n\nDuring his election campaign, Prime Minister Anthony Albanese also committed to slashing the HECS/HELP debts by 20 per cent , with Labor saying it plans to introduce the required legislation as its first bill when parliament resumes later this month.\n\nWhile the changes were likely to be a big help, Monica - who is now 28 years old - said she could still foresee her huge student debt holding her back.\n\n\"I definitely think this will be a major issue for me in the long term, especially in terms of housing,\" she said.\n\nWhile a bank manager had recently assured Monica she would likely still be able to get a home loan because she had been frugal in her spending, it would still be a burden, she said.\n\n\"It will create difficulties for me in the sense that, rather than building upon other things in my life that could be really helpful for me, I'll be paying this off for a very long time.\"\n\nMonica said she wanted to warn young people to do their research when looking to enrol in a tertiary education course.\n\n\"You need to do your due diligence and really explore and compare all of the different courses that are offered at the different universities. It's surprising how much variation there can be,\" she said.\n\nFinance expert Joel Gibson agreed, saying people shouldn't be treating student loans as \"free money\".\n\n\"When you enrol in a degree, you're effectively taking out a loan for tens of thousands of dollars,\" he said.\n\n\"Ideally, that loan is what we call 'good debt' - it's funding your personal growth and empowering you to make many times that money back later in life.\n\n\"HECS/HELP and other student loans are some of the cheapest and most productive debt you can have, but they're still debt and they're not a bottomless well of support.\n\n\"Don't dive in if you're not sure - take some time off study to make a plan, or start working and see where your passion leads you.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/young-henrys-brewery-sydney-could-be-forced-to-shut-down-original-operation/96c61ea1-160f-428c-a749-a5be3030046d",
        "title": "'We're sticking around': Iconic Sydney brewery facing demolition",
        "publish_date": "Wed, 11 Jun 2025 22:34:39 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A﻿ popular Inner West Sydney brewery could be forced to shut down its original operation as the local council considers a new building development proposal.\n\nSince 2012, Young Henry's Brewery has made its home in a rented Newtown warehouse, becoming a bar landmark, while the brewery's trademark Newtowner pale ale is a common sight in pubs around the city.\n\n﻿Prime Minister Anthony Albanese and his fiancee Jodie Haydon went there on their first date.\n\nYoung Henry's co-founders Oscar McMahon and Dan Hampton. (Today)\n\nBut now, the Inner West Council is considering a proposal that could send the iconic brewery looking for a new home.\n\nThe proposal, which was lodged in May and has not been approved, would see the brewery demolished and replaced with a six-storey unit block.\n\nSpeaking on Today , Young Henry's co-founders Oscar McMahon and Dan Hampton admitted to mixed feelings.﻿\n\nPremier Chris Minns visits the brewery. (Flavio Brancaleone/Sydney Morning Herald)\n\n\"It sort of makes sense, right,\" McMahon said.\n\n\"The Inner West is a vibrant and attractive area and it needs housing. Still, that means we're looking for a new home.\"\n\nMcMahon said they had been talking to the landlord for some months now and were aware of their plans to turn the building into housing.\n\nDictator avoids punishment for cannibalism through legal loophole View Gallery\n\n\"While there's optimism for the future, it also is disruptive,\" McMahon said.\n\n\"And you know, we've built a really beautiful cultural business there.﻿\"\n\nCo-founder Dan Hampton said Young Henry's would remain a part of the local scene.\n\n﻿\"We'll always be part of Newtown. Our main beer is the Newtowner,\" he said.\n\n\"So the fans and community need to know that we're sticking around.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/strawberry-moon-june-full-moon-australia-skygazing/f8b3b5b0-545d-4401-b366-fc44852c0dce",
        "title": "A strawberry moon is lighting up the sky tonight. Here's how you can see it",
        "publish_date": "Wed, 11 Jun 2025 08:04:11 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A lunar phenomenon not seen in almost 20 years is lighting up skies across Australia this evening.\n\nThe June full moon - also known as the Strawberry Moon - is illuminating skies across the world on June 11.\n\nUnfortunately, the Strawberry Moon will not be pink or red for those of us in the southern hemisphere.\n\nREAD MORE: Qantas to slash hundreds of jobs in shutdown of budget airline\n\nThe June full moon - also known as the Strawberry Moon - is illuminating skies across the world on June 11. (Danielle Smith)\n\nIn fact, its name comes from the Native American strawberry ﻿harvest season it shares a date with.\n\nMoon gazers in the northern hemisphere might have a better chance at a pink-hued moon, due to its low placement closer to the horizon.﻿\n\nHere's everything you need to know about tonight's Strawberry Moon.﻿\n\nWhen is it ?\n\nThe Strawberry Moon has already begun lighting up skies across Australia from sunset this evening, but it will be best viewed once it's completely dark.\n\nAcross the east coast, that means 5.43pm onwards is the best timeframe for skygazing.\n\nThe moon will look a little different in the northern hemisphere compared to the southern hemisphere.\n\nHow to watch it\n\nIn areas located below the equator,﻿ including Australia, the strawberry moon will be the highest full moon in nearly 20 years.\n\nKnown as a lunar standstill, it's expected to sit almost overhead, making it look bigger than usual.﻿\n\nThose in the northern hemispher﻿e will experience the opposite, with the lowest moonrise since 2006.\n\nThe next lunar standstill is not due until 2043.﻿\n\nThe full moon, also known as the Strawberry Moon, rises over St Mary's Lighthouse in Whitley Bay, England, Tuesday, June 10, 2025. (Owen Humphreys/PA via AP) (AP)\n\nWhere can you see it in Australia?﻿\n\nThe Strawberry Moon will be visible across the country, provided it is not concealed by clouds or light pollution.\n\nUnsurprisingly, skygazing is as simple as looking up.\n\nBut those who want to make a night out of the celestial marvel have a few different options.\n\nVenturing away from light pollution is your best chance at seeing the moon in its full glory, but there are alternatives for city dwellers, ﻿too.\n\nSydneysiders can head to Palm Beach Headland﻿ on the Northern Beaches, which is regarded as Australia's First Urban Night Sky Place.\n\nIn Melbourne, The Royal Botanic Gardens is a beautiful spot to see the stars.\n\nFor those willing to travel a bit further, Sky High in Mt Dandenong ﻿or the Snake Valley Observatory, which is an Australian Dark Sky Site, are great options.\n\nIf you're still unsure, any beach, wide open space or elevated grounds provide a great vantage point.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/griffith-university-staff-underpayment-ombudsman/105407186",
        "title": "Griffith University to repay over $8m to thousands of underpaid employees",
        "publish_date": "Thu, 12 Jun 2025 01:18:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland's Griffith University will repay more than $8 million to thousands of underpaid employees, as part of an agreement with the national workplace watchdog.\n\nThe underpayments, which occurred between 2015 and 2024, affected approximately 5,457 current and former casual, academic and professional staff at all six of the university's south-east Queensland campuses.\n\nAffected employees worked across the arts, education, law, business, health and sciences divisions, with the majority based in Brisbane.\n\nIn total, the workers will receive $8.34 million in back pay, including interest and superannuation.\n\nHighest individual repayment more than $92,000\n\nIndividual underpayments ranged from less than $1 to more than $92,400, according to the Fair Work Ombudsman.\n\nThe ombudsman said pay issues were caused by insufficient training among course convenors and school administrators, deficiencies in payroll systems, and a lack of data review processes.\n\nThe university self-reported to the national regulator in 2022.\n\nThe university self-reported to the national regulator in 2022. (ABC News: Julius Dennis)\n\nFair Work Ombudsman Anna Booth said the university had \"cooperated with investigations\" and had \"demonstrated a strong commitment to rectifying its non-compliance issues\".\n\n\"The matter serves as a warning of the significant long-running problems that can result from an employer failing to have appropriate checks and balances to ensure workplace compliance,\" Ms Booth said.\n\n\"We expect universities to meet their legal obligations under their own enterprise agreements and underlying awards.\"\n\nThe university has entered an \"enforceable undertaking\" agreement with the ombudsman.\n\nUnder that agreement, it must make a contrition payment of $175,000, which will be paid to the not-for-profit Cleaning Accountability Framework, which helps ensure fair working conditions for cleaners.\n\nIt is also required to implement a range of measures to ensure compliance with workplace laws going forward.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/female-tennis-players-fertility-procedures-get-protected-ranking/105407154",
        "title": "Female tennis players undergoing fertility procedures to get protected ranking",
        "publish_date": "Thu, 12 Jun 2025 00:43:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "Female players who choose to undergo a fertility protection procedure will be allowed to take time away from the sport and return to competitive action with a protected ranking, the governing body of women's tennis has said.\n\nThe new rule aims to support women athletes to balance their family goals and career ambitions, and comes three months after the WTA offered players up to 12 months of paid maternity leave for the first time.\n\nWomen in Sport Spotlight We put the spotlight on women making a big impact on and off the field in the sporting world — from the grassroots through to the elite level.\n\n\"The new rule means that players can now take time away from professional tennis for a fertility protection procedure, such as egg or embryo freezing, and safely return to competition with a protected ranking,\" the WTA said in a statement on Wednesday.\n\n\"Eligible players will receive a Special Entry Ranking (SER), which can be used to enter up to three tournaments, based on the 12-week average of their WTA Ranking from eight weeks prior to the start of their out-of-competition period.\"\n\nSloane Stephens, the 2017 US Open champion, has previously called for egg freezing to be recognised as a protected ranking activity, and called Wednesday's announcement a \"ground-breaking\" move.\n\n\"I'm incredibly proud of our sport in recognising the importance of fertility treatments for female athletes. For any woman, the conversation of family life versus a career is nuanced and complex,\" the former world number three said.\n\n\"The WTA has now created a safe space for players to explore options and to make the best decisions for themselves.\"\n\nThe WTA also said players will benefit from paid maternity leave and grants for fertility protection through the WTA Maternity Fund sponsored by the Saudi Public Investment Fund.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/kysaiah-pickett-signs-nine-year-deal-with-melbourne-demons/105406894",
        "title": "Demons sign Pickett to staggering deal to keep WA teams at bay",
        "publish_date": "Thu, 12 Jun 2025 00:21:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Melbourne star Kysaiah Pickett has emphatically rejected the lure of a return to Western Australia, signing a monster seven-year contract extension with the Demons.\n\nLivewire forward Pickett, already locked in for two more seasons, becomes the longest-contracted player in the AFL after signing a deal that will keep him at Melbourne until at least the end of 2034.\n\nPickett will be 33 by the end of his new contract, a deal reportedly worth $12 million.\n\nHe eclipses Fremantle's Hayden Young, who signed a six-year extension in December to stay at the Dockers until 2033.\n\nGold Coast young gun Mac Andrew signed a five-year contract from 2025 in September, which will be extended by another four years to 2034 if targets are met.\n\nPickett had been heavily linked with a move to Fremantle, where former 2021 premiership teammate Luke Jackson plays.\n\nThe 24-year-old, who has family links to both Perth and Adelaide, had been open about struggling with homesickness since being drafted to the Demons in 2019.\n\nPickett thanked the club for their support after announcing the deal on Thursday.\n\n\"I'm really happy and proud to be continuing my career in the red and blue,\" Pickett said in a club statement.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I love my teammates and my coaches, and I can't wait to see what we can achieve together in the years to come.\n\n\"The club has shown so much care for me and my family, and I can't thank them enough for their support.\n\n\"I get to live out my childhood dream, playing footy for the oldest club at the MCG, and I'm excited and grateful to be a Demon for life.\"\n\nPickett has become one of the most lethal small forwards in the competition with his creative talents.\n\nThe 24-year-old leads 14th-placed Melbourne (5-8) with 21 goals after kicking three in their King's Birthday blockbuster against Collingwood, ahead of Bayley Fritsch (14).\n\nIt was his five-goal haul against Fremantle in round six that helped spark Melbourne after a 0-5 start to the season.\n\nDrafted with pick No.12, Pickett boasts 182 goals from 116 games.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/monash-ceo-michael-knapp-steps-down-embryo-bungle/105407100",
        "title": "Monash IVF CEO quits after second embryo bungle",
        "publish_date": "Thu, 12 Jun 2025 00:12:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Monash IVF chief executive officer Michael Knaap has resigned following the reveal of a second embryo bungle.\n\nIn a statement to the ASX, Monash IVF said its board had accepted Mr Knaap's resignation and \"respects his decision\".\n\n\"Since his appointment in 2019, Michael has led the organisation through a period of significant growth and transformation, and we thank him for his years of dedicated service,\" the statement said.\n\nMonash IVF revealed on Tuesday that it had incorrectly transferred the wrong embryo to a patient — the second incident the company has apologised for in recent months.\n\nFertility group transfers wrong embryo for second time Photo shows A close up of an embryo being created with scientific equipment in a lab. In an announcement to the ASX on Tuesday morning, Monash IVF said the incident happened on June 5 at its laboratory in Clayton, Melbourne.\n\nThe patient's own embryo was used instead of their partner's, which was \"contrary to the treatment plan\", the company said on Tuesday.\n\nIt comes two months after the company revealed a Brisbane patient was mistakenly implanted with another patient's embryo.\n\nThe woman gave birth to a baby who had no genetic link to her later that year, which the ABC understands happened in 2023.\n\nMr Knaap was also the managing the director of Monash IVF Group and had led the organisation since 2013.\n\nChief financial officer and company secretary Malik Jainudeen has been appointed as acting CEO.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/f1-academy-driver-joanne-ciconte-australia-racing/105370062",
        "title": "Making history at 240kph, Joanne is blazing a trail for young girls",
        "publish_date": "Thu, 12 Jun 2025 00:10:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "At just 16 years of age, Joanne Ciconte is living life in the fast lane.\n\nThe Melbourne-born teenager spends a significant portion of her life on planes, travelling around the world in pursuit of speed.\n\nCiconte is the youngest driver in this year's F1 Academy, mixing it with some of the world's most talented female racers.\n\nAiva only has a learners licence, but is inspiring young girls to go fast Photo shows A young female racing driver leaning on her car, holding her helmet, looking in the distance As one of the two inaugural Aussies on the grid in the all-female racing category, Aiva Anagnostiadis wants to be an example for other young girls who dream of driving fast.\n\nShe joins Aiva Anagnostiadis as the first Australians to contest the all-female series, who will this year compete across three continents over seven race weekends.\n\nA junior karting star who won the prestigious Pink Plate in 2023, Ciconte is in just her second year of single-seater motor racing.\n\nNow she wrestles a car with a top speed of 240 kilometres per hour, which from a standing start reaches 100kph in 3.6 seconds.\n\n\"I think that this year has been a bit of a rollercoaster in the F1 Academy series,\" Ciconte told ABC Sport.\n\n\"Jumping into the field of many mixed-experience drivers and older girls is something different. I'm always used to driving against boys.\"\n\nThe series is in Montreal this weekend for the fourth weekend of the season.\n\nThis is the second year Joanne Ciconte is racing in single-seater cars. (Getty Images: Formula 1/Manuel Eletto)\n\nThe Aussie teen has had a troubled year so far on the track, plagued by incidents often out of her control.\n\nBut she does have a top 10 finish, which earned her two championship points, becoming the first Australian to achieve that feat in F1 Academy.\n\n\"I think my attitude this year has [been to] make sure to try and progress and learn as quick as I can,\" a positive Ciconte said ahead of this weekend.\n\n\"I believe the results will come from there.\"\n\nThe profile of the F1 Academy has grown year-on-year, with each round of this year's series being part of a Formula 1 weekend.\n\nJoanne Ciconte, driving for MP Motorsport, has scored two championship points heading into round four in Montreal. (Getty Images: Formula 1/Pauline Ballet)\n\nA new series on the entertainment streaming platform Netflix has recently been released.\n\nThe program, F1: The Academy, aims to attract new audiences, similar to what the popular program 'Drive to Survive' did for F1.\n\n\"What I'm most amazed about is how F1 Academy, and Susie Wolff (F1 Academy managing director), is doing such an amazing job bringing a spotlight on us female drivers,\" Ciconte said.\n\n\"I think it's great to see how more and more followers and supporters for the series has grown over the years.\"\n\nAs more eyes tune in to watch the women of the F1 Academy battle on track, the spotlight on each driver shines brighter.\n\nWomen in Sport Spotlight We put the spotlight on women making a big impact on and off the field in the sporting world — from the grassroots through to the elite level.\n\nFor Ciconte, the growing spotlight has allowed her to become a role model for young girls in Australia starting in motorsport — something she is embracing as she continues her own journey.\n\n\"It's definitely part of the experience that I'm building in,\" she said.\n\n\"I do get reminders that there are a lot of younger generation girls who want to be in motorsport and aspire to be in the position that I am.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/che-keneally-boxing-womens-sport-funding-battles/105375140",
        "title": "World championship boxer struggles to pay $25k to fight for title",
        "publish_date": "Wed, 11 Jun 2025 23:43:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "Before Che Kenneally can step into the ring to defend a boxing world title next month, the 30-year-old Gold Coaster must raise thousands of dollars for the privilege.\n\nAs a professional boxer, Kenneally's light-heavyweight bouts have to be sanctioned by one of the sport's governing bodies — in Kenneally's case, the World Boxing Association (WBA).\n\nSanctioning costs, which can reach into the tens of thousands of dollars, are often covered by boxing promoters who recoup their investment by selling tickets, broadcast rights and access to fights.\n\nFemale fighters punch their way from a backyard shed to the world stage Photo shows A composite photo of three female boxers The dream for boxers Skye Nicolson, Che Kenneally and Cherneka Robinson all started in the same Gold Coast garage.\n\nBut female fighters are rarely afforded this luxury, and Kenneally will need to stump up more than $25,000 to enter the ring.\n\nTo reach that financial goal, the single mother has turned to community fundraising while working full time as a stevedore at the Port of Brisbane.\n\n\"I still have to fit in two training sessions per day and try to find the funds to fight,\" Kenneally said.\n\n\"You're either at one end of the spectrum where you're killing it as an athlete … or you're on the other end, living pay cheque to pay cheque, doing your best and that's still not enough.\"\n\nKenneally won the WBA light-heavyweight title in June 2024. (Supplied: Instagram)\n\nDefending her title is not the first time Kenneally has had to pay to fight — to challenge for the then-vacant world title last year, she raised funds and used sponsorship and a loan to cover the costs.\n\nAs the champion, the stakes are higher; if she can't raise the sanctioning fees before the July deadline and the fight is cancelled, she will have to give up her title without the opportunity to defend it.\n\nNarrow, steep and treacherous path\n\nKenneally's position is a \"path well-trodden\" by professional athletes, according to the director of La Trobe University's Centre for Sport and Social Impact, Geoff Dickson.\n\n\"The pathway to being a fully-fledged, highly remunerated professional athlete is a very difficult journey for men and women,\" Dr Dickson said.\n\nNo women in top 100 highest-paid athletes Photo shows Ben Simmons puts his hands on his hips while someone holds a basketball above his head at LA Clippers NBA training. Despite missing more games than he played for the past three years, former NBA All Star Ben Simmons remains the highest-paid Australian athlete in the world, while no women featured in the top 100.\n\n\"[But] the pathway to the top for elite female athletes is slightly narrower, steeper, and fundamentally more treacherous than it is for male athletes.\"\n\nDr Dickson said government grants and funding were generally unavailable to professional boxers like Kenneally, as they were reserved for amateurs who had a pathway to the Olympic Games.\n\n\"She's to be commended for what she's doing. She's getting towards the pointy end of her sport,\" he said.\n\n\" But she's occupying this very awkward zone where the money doesn't necessarily equate to her sporting capabilities. \"\n\nKenneally said she recognised the path of a professional female boxer was always going to be difficult, but working full time to make ends meet for her and her daughter made it even more so.\n\nKenneally works full time to make ends meet for her and her daughter. (Supplied: Che Kenneally)\n\n\"Being an athlete is hard … but I've chosen to be an athlete and I've chosen to have a baby, so I've put the pressure on myself,\" she said.\n\n\"I want to be a great athlete, and to be that I need to put the time in, but there's only so many hours in the day and mine are pretty full up at the moment.\"\n\n'Powerful tenacity'\n\nGriffith University researcher and former Muay Thai fighter Erin Nichols said there was a long way to go before gender equality was achieved in combat sports such as boxing.\n\n\"Women's boxing is still building legitimacy, unfortunately, in the eyes of promoters and broadcasters, despite the evidence of growing fan interest,\" Dr Nichols said.\n\n\" While male fighters benefit from a legacy system of investment, female fighters are often expected to prove their commercial worth before receiving support. \"\n\nErin Nichols trained as a Muay Thai fighter and is now a Griffith University researcher. (Supplied: Erin Nichols)\n\nDr Nichols said Kenneally's fight outside the ring to raise the required funds was \"emblematic of the wider landscape\" female athletes operated in.\n\n\"Her story is a powerful example of the tenacity [and] the leadership that so many women athletes bring to their sport,\" she said.\n\n\"Her willingness to fundraise publicly to maintain her title defence and speak openly about the barriers she faces makes it not just a personal triumph, it's a form of advocacy.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/wtc-cricket-steve-smith-becomes-greatest-test-scorer/105406738",
        "title": "Smith becomes greatest visitor to Lord's as Rabada makes quirky history",
        "publish_date": "Wed, 11 Jun 2025 23:24:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "At the party they always get to host but never get the chance to play in, English cricket has again been left to gaze on enviously at Australia.\n\nIn this third World Test final to be staged in England, it had been that old nuisance Steve Smith — in all his familiar idiosyncratic glory even while suffering with a dose of the flu — marking himself the greatest overseas top scorer in all Lord's Tests with a knock of 66 that took his total to 591 in 10 innings.\n\nSmith moved ahead of Australia's Warren Bardsley (575 runs in seven innings), West Indian legend Garry Sobers (571 runs in nine innings), and the legendary Sir Donald Bradman (551 runs in eight innings) to become the most prolific visiting batter at the home of cricket.\n\nAnd he probably should have scored more.\n\nHe was left fuming at himself for falling to part-time spinner Aiden Markram when creeping ever so slightly in reach of a 37th Test century.\n\n\"I'm still trying to fathom how I've done that,\" Smith said, putting his head into his hands.\n\nWhile the vicious Australian pace attack once again came to Lord's and left English onlookers positively blushing with envy, it was a South African bowler that created his own small piece of history.\n\nKagiso Rabada became just the second player in history at Lord's to have his name gilded on the honour boards of both the home dressing rooms and the away dressing rooms.\n\nQuick hits from the World Test Championship Photo shows Steve Smith, kagiso rabada and Travis Head in the World Test Championship final. Travis Head falls to a screamer, Steve Smith falls to a part-timer, and South Africa fails to review. Here are the quick hits from the World Test Championship final.\n\nBefore the first day of the final, only one other Test player in the storied 141-year history of the longer format at Lord's had appeared on both boards, after legendary West Indies opener Gordon Greenidge scored tons for the Windies in 1984 and 1988, while also notching 122 for Rest of the World in 1987, when that team was playing out of the MCC dressing rooms.\n\nA piece of sticky batting tape with Rabada's name written on it in pen has been attached to the board for his figures of 5-51, as is the tradition for players during matches. The gold lettering should soon follow.\n\n\"It was cool to have it in the home changing room now,\" said Rabada, whose name is on the board in the away dressing room for the 5-52 he took for his country in a Test against England in 2022.\n\nThe 30-year-old fast bowler had come into the match with something of a cloud hanging over him having recently served a short ban for recreational drug use.\n\n\"It wasn't my best moment, as I have alluded to,\" Rabada said, in a matter-of-fact manner.\n\n\"Life moves on. Every game that I play for South Africa, I try to do my best.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/adam-scott-gears-up-for-another-us-open-majors-streak/105406694",
        "title": "Adam Scott gears up for another US Open, continuing his impressive majors streak",
        "publish_date": "Wed, 11 Jun 2025 23:02:58 +0000",
        "category": "sports",
        "authors": [],
        "text": "Adam Scott is one year away from an impressive streak that the Australian considers to be a classic glass-half-full moment in golf.\n\nThis week's US Open, which begins on Thursday evening (AEST), is his 96th consecutive major championship appearance dating to the 2001 Open Championships at Royal Lytham & St Annes.\n\n\"It sounds like a lot to have won one,\" Scott said humorously, referring to his lone major title in the 2013 Masters.\n\n\"It would be twice as good if there was one more.\"\n\nStill, he realises he is approaching a big milestone.\n\nThe PGA Championship next year, assuming he qualifies or gets an invitation, will be his 100th career major. He could make it 100 in a row if he makes it to Shinnecock Hills for next year's US Open.\n\nA streak like that requires eligibility and good health. Tiger Woods and Phil Mickelson only had eligibility in their favour.\n\nWoods played 46 straight majors until knee surgery after he won the 2008 US Open. Mickelson played 61 in a row before he sat out the 2009 British Open as his wife was being treated for breast cancer.\n\nThe record is among the most untouchable in golf — Jack Nicklaus played 146 major championships in a row from the 1962 US Open through the 2008 US Open.\n\n\"Probably whenever it ends, whether it's 100 or more or less, I think it will be hard for guys to get to that number going forward,\" Scott said.\n\n\"I think it's getting harder. And I think I have been a consistent player over a 25-year career.\n\n\"I could probably pick three troughs where my game was looking pretty ordinary and I fell outside the top 50 and I was really struggling. But over 25 years, I'd expect that of almost any player.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nScott has had a few close calls with the US Open in the past which could have ended his streak.\n\nHe made it through 36-hole qualifying with one shot to spare in 2018.\n\nHe failed to make it through qualifying last year but was the first alternative and was called up following a withdrawal. \\\n\nScott said Mickelson and Rory McIlroy are among the few who never went through bad spells or serious injury, \"and we're talking about two of the greatest of their generation\".\n\nMcIlroy's streak was interrupted when he injured his left ankle and could not play the 2015 Open Championship. This week's US Open is McIlroy's 39th consecutive major.\n\nScott will tee off at 9:18pm (AEST) on Thursday, playing with 2021 Masters champion Hideki Matsuyama, and two-time US PGA Tour winner Ludvig Åberg.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/wa-housing-and-rental-crisis-laid-bare-in-affordability-report/105404398",
        "title": "Majority of WA households now deem their home unaffordable, report finds",
        "publish_date": "Wed, 11 Jun 2025 22:49:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than half of West Australian households consider their housing unaffordable, an increase of 91 per cent in just two years, according to a new report.\n\nThis was true of both renters and those paying off a mortgage, the Bankwest Curtin Economics Centre (BCEC) report found, with the housing market beset by multiple problems including rapid population growth, limited supply, escalating rents and construction delays.\n\nThe report shows the median weekly rent in WA has increased by 76 per cent since 2020, and now sits at $740.\n\n'Astonishing' Perth rent increases Photo shows Houses close to Perth's CBD Renters in Perth are feeling the pinch as it becomes the nation's second-most expensive capital to rent in, and an economic expert says the state desperately needs to increase its building capacity.\n\nBCEC director Alan Duncan said WA's housing crisis had been \"years in the making\".\n\n\"I think the fundamental challenge that we're facing is simply that there are not enough houses to go around,\" he said.\n\nWhile more than 20,000 new homes being built were completed in the last year, WA still fell 4,000 homes short of its target set under the National Housing Accord.\n\nA shortage of new homes is one of the main problems facing the state. (ABC News: James Carmody)\n\nAnd Perth fell 7,700 rental homes short of keeping pace with population growth from March 2023 to the end of 2024.\n\nMeanwhile, housing build times have blown out to 15.6 months, from seven months in 2018-19.\n\nDeepening inequality\n\nProfessor Duncan said the lack of housing was pushing people to the outskirts of the city, to areas that lacked public transport and essential services.\n\n\"There's a shift away from rental opportunities in inner Perth and far more towards the outer suburbs, further away from amenity, further away from jobs,\" he said.\n\nSome growing outer areas like Ellenbrook have received transport upgrades but remain isolated from services. (ABC News: Gian De Poloni)\n\nProfessor Duncan said the housing crisis was reshaping the social map of the state.\n\n\"In order to find affordable rental housing, [low income households] will need to travel progressively further and further away from the centre of Perth, and that's one of the things that's really pushing inequality in the state,\" he said.\n\nWA rental crisis reaches new depths Photo shows Two people, Darcy and Caitlin, sit outside a home with Caitlin holding a mug. Not a single property or room is affordable for people on Jobseeker, Youth Allowance or the Disability Support Pension in WA, an Anglicare report finds.\n\n\"We are witnessing a breakdown in the ability of WA's housing system to meet the needs of ordinary West Australians.\"\n\n\"There's an awful long way to go before the housing system gets anywhere near back to balance.\"\n\nHousing solutions\n\nBut the report also outlines a range of measures its authors believe could provide immediate, medium and long-term relief to struggling households.\n\nQuick fixes include expanding rent assistance programs, reinstating and improving crisis and transitional accommodation and boosting support for homelessness support services.\n\nThe report has highlighted the scale of WA's housing crisis. (Supplied: Carballo)\n\nIn the medium term, the report recommends fast-tracking housing completions by increasing subsidies, streamlining approvals and mobilising the construction workforce, as well as targeting groups such as first home buyers and key workers for extra support.\n\nLonger-term solutions include more ambitious housing targets — at least 1,200 new social housing dwellings a year — along with axing stamp duty in favour of a \"more efficient\" tax that encourages mobility and unlocking more public land for development.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/shepparton-news-riverine-herald-newspapers-cut-print-run/105405568",
        "title": "Seniors lament news 'feel' as historic regional mastheads cut print run",
        "publish_date": "Wed, 11 Jun 2025 22:23:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sylvia Campbell has fond memories of her late husband flicking through the local daily newspaper, Shepparton News.\n\nThe northern Victorian paper was a fixture in the Campbell house and, once it was read, would be taken to the neighbour, sharing the cost.\n\n\"He used to sit and read the paper every day,\" she said.\n\n\"If I was lucky and it did not go next door, I would get to read the paper but half the time it had gone before I got back home.\n\n\"But he has been gone now nearly 11 years, so just one less expense for me when you are on your own.\"\n\nMs Campbell says her friends buy the paper every day. (ABC Shepparton: Callum Marshall)\n\nThe 84-year-old said she still occasionally picked up the paper and would often hear about its news through a close friend who bought it every day.\n\nBut that will come to an end soon.\n\nMcPherson Media Group announced last week that Shepparton News and another of its papers, Echuca's Riverine Herald, will become twice-weekly print editions.\n\nThe Riverine Herald was printed three times a week.\n\nThe company, which has run Shepparton News for 135 years, said the change would start on July 14 with printed editions on Tuesdays and Fridays.\n\nRoss McPherson says most people read the news online. (Supplied: McPherson Media Group)\n\nIt said it would provide daily news updates on its digital platforms through an upgraded mobile app, newsletters and audio bulletins.\n\nExecutive chairman Ross McPherson told the ABC's Statewide Drive program the company was adapting to fundamental changes in the industry.\n\n\"Nearly 80 per cent of our readers now are on mobile devices of one kind or another,\" he said.\n\n\"We need to provide the kind of service they are looking for.\"\n\nThe Shepparton News and Riverine Herald have been serving readers since 1877 and 1863, respectively. (ABC Shepparton: Callum Marshall)\n\nMr McPherson said the company had been considering the move for years.\n\n\"Most of our print readers are the older age groups and they are gradually dying,\" he said.\n\n\"Few under 50 pick up a print paper as often as they used to.\n\n\" People look for their news in a convenient mobile, tablet or desktop sort of environment these days. \"\n\nOlder readers lament\n\nMs Campbell says many older people don't use the internet. (ABC Shepparton: Callum Marshall)\n\nMs Campbell, vice-president of the Shepperton Senior Citizens Club of about 90 members, which has existed for more than 65 years, said the decision was \"not helping the elderly at all\".\n\n\"A lot of us do not have computers or laptops so that [the print paper] is where we get our information,\" she said.\n\n\"It makes it very hard for the older ones.\"\n\nProfessor Kristy Hess. (Supplied: Kristy Hess)\n\nDeakin University Professor of Communication and Australian local news expert, Kristy Hess, said a national study conducted a few years ago found the demand for local print news remained strong.\n\n\"People are very passionate about feeling a newspaper between their fingertips,\" she said.\n\nProfessor Hess said it was important that the media industry's continued shift towards digital platforms factored in everyone's needs.\n\n\"I have long highlighted that that shift has to be slow to accommodate older audiences to address issues of digital literacy,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/moira-deeming-john-pesutto-ibac-referral-bankruptcy-proposal/105406352",
        "title": "Moira Deeming referred to corruption investigators over John Pesutto offer",
        "publish_date": "Wed, 11 Jun 2025 22:14:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Victorian Liberal MP Moira Deeming has been referred to the state's anti-corruption investigators over her proposal to delay bankruptcy proceedings against former party leader John Pesutto in exchange for guaranteed pre-selection for next year's election.\n\nMs Deeming is pursuing Mr Pesutto over a $2.3 million debt for legal costs after she successfully sued him for defamation over comments he made about her when an anti-trans-rights rally she attended was gatecrashed by neo-Nazis.\n\nThe rally, titled Let Women Speak, was categorised by supporters as a women's rights event.\n\nMr Pesutto missed the deadline for paying the costs, and Ms Deeming's lawyers began proceedings, creating a new three-week timeframe for the Hawthorn MP to find the money or be expelled from parliament under a law forbidding anyone who is bankrupt from holding a seat.\n\nOn Wednesday, Ms Deeming offered to delay the proceedings if the party bypassed its rules and guaranteed her preselection for the 2026 Victorian election.\n\nA notice of referral has been sent to Liberal Party members, outlining the complaint made against Moira Deeming. (AAP: James Ross)\n\nMike Soccio, who describes himself as a member of the public but had been a member of the Greens, Labor and the Reason Party in the past, has since lodged a complaint about the matter with the Independent Broad-based Anti-Corruption Commission (IBAC).\n\nMr Soccio sent notification of the referral to Ms Deeming and party leader Brad Battin.\n\nHe alleged Ms Deeming made financial inducements to guarantee preselection and requested IBAC conduct a thorough investigation into whether any rules or election laws were broken and whether her actions constituted \"corrupt conduct by an elected parliamentarian\".\n\nHe said he was not a member of the Liberal Party and was not involved in the dispute in any way.\n\n\"I simply followed the lead of the [National Anti-Corruption Commission] in that it allows members of the public to make complaints,\" he said.\n\nJohn Pesutto is still to find the $2.3 million to pay the legal costs from Moira Deeming's successful defamation case. (ABC News: ABC News)\n\nIBAC said it does not comment about complaints or investigations \"as a matter of practice\".\n\nThe ABC has contacted Ms Deeming regarding the IBAC referral.\n\nMr Pesutto and the party yesterday rejected Ms Deeming's offer.\n\nHe instead is continuing to ask the Liberal Party for a loan. The party's administrative committee will meet on Thursday next week to discuss the request, approval of which would help it avoid a by-election in Mr Pesutto's electorate.\n\nOn Wednesday night, Ms Deeming sent a letter to colleagues.\n\n\"I am sad that my latest attempts to settle this matter in the best interests of all parties, including the Liberal Party — were not successful,\" she said.\n\n\" However, my conscience is clear; I did my very best to try and turn our collective focus away from internal matters and onto the injustices continually inflicted on Victorians by the Labor Government. \"\n\nFormer premier likens Deeming proposal to blackmail\n\nFormer Liberal premier Jeff Kennett described Ms Deeming's proposal as \"most unusual\", disappointing and amateurish.\n\n\"For her to be saying that, in fact, the party should be guaranteeing her preselection shows that she clearly doesn't understand how the party works,\" Mr Kennett told ABC Radio Melbourne.\n\nHe said he felt like the party was being blackmailed.\n\n\"I really felt she has been terribly, badly advised so, to some degree, I feel very sorry for her,\" he said.\n\nMr Kennett said the Liberal Party was still working on raising the funds to help Mr Pesutto.\n\n\"The Liberal Party should never, ever contemplate throwing one of its own under a bus and, second, we've always got to do what's in the best interests of, in this case, the state and the party.\"\n\nHe warned the party needed to settle its internal divisions before next year's election.\n\nFormer premier Jeff Kennett urged the Liberal Party to settle the tensions between Moira Deeming and John Pesutto before the next election. (Facebook)\n\nGeoffrey Watson SC, a former political adviser and now director of The Centre for Public Integrity, described Ms Deeming's proposal as \"a shocker\" and said it would undermine public confidence.\n\n\"If somebody were to say well I've achieved preselection for a particular seat in parliament and the endorsement of a particular party on the basis I was owed money and I've foregone a debt to get it, that's not right, that's not how it works,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/jordan-thompson-rinky-hijikata-chris-oconnell-lose-rosmalen/105406526",
        "title": "Triple defeat for Aussies as grass-court season begins",
        "publish_date": "Wed, 11 Jun 2025 22:12:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Jordan Thompson has failed to convert two match points to be bundled out of the grass-court ATP event in the Dutch town of Rosmalen.\n\nThompson, an accomplished grass court performer whose body has been beaten up over a tough season, had won his opening-round contest on Monday against American Aleksandar Kovacevic but lost out in the last-16 from a set up and despite having held two match points against Canada's Gabriel Diallo 4-6 6-1 7-5.\n\nThompson, a two-time finalist in the event, had his chance when holding match points on return at 5-4 in the final set, but Diallo kept his nerve to win 13 of the final 16 points and seal victory in two hours and eight minutes.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I played some really good tennis, he's a very tricky opponent on the grass, it's a surface that suits him well,\" said Diallo.\n\n\"I knew I had to be really sharp. I came really close to losing on my serve but I managed to come up with some good points and carry that momentum.\"\n\nIt was a tough day for the Australians, with Rinky Hijikata and Chris O'Connell also bowing out on Wednesday.\n\nHijikata was also a set up against British stalwart Dan Evans before eventually succumbing 3-6 6-4 6-3, while world number 80 O'Connell found French veteran Adrian Manarino too much to cope with on the grass, as the world number 127 prevailed 6-1 6-3.\n\nThe triple defeat meant that Australian hopes now rest solely with fourth seed Alexei Popyrin, the last Aussie man standing at Roland Garros who had a first-round bye but will face Belgian Zizou Bergs in the last-16 on Thursday.\n\nAlex de Minaur won this event in 2024, but elected not to defend his title as he takes a break before preparing for Wimbledon.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/asx-markets-business-live-news-june-12-2025/105406510",
        "title": "Live: Oil prices leap on Middle East tensions, energy stocks lead ASX",
        "publish_date": "Wed, 11 Jun 2025 22:08:04 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Adelaide Miller",
            "Daniel Ziffer"
        ],
        "text": "The Australian Private Hospitals Association (APHA) has asked the question — when is a ministerial deadline and election commitment neither a deadline nor a commitment?\n\nEarlier this year, the federal Health Minister Mark Butler, via The Australian, reportedly put the health insurance industry on notice “to take action on payments to private hospitals within the next three months, directing they increase funding to a greater proportion of benefits”.\n\nThen, just over a month later, he doubled down at the AFR Health Summit, saying: “There is no question there’s been a structural shift of where the money is going in the system and there is a structural shift downwards for private hospitals. There has been a shift up in profitability and management expenses of insurers. Which is why I’ve said I think there needs to be a lift in the benefits payments ratio from insurers to hospitals. I want them working on that urgently.”\n\nBut yesterday, in an interview with ABC Radio Brisbane’s Ellen Fanning, he appears to have walked away from his own deadline.\n\nHe told Fanning: “We want to see very clear evidence of what has happened since I put that challenge to them (the insurers) a couple of months ago, and what is going to happen over coming months. And if it's not satisfactory to me, if it doesn't give me confidence that it's going to underpin a strong viability of the private hospital sector going forward, as I said, I will take action.”\n\nAHPA are now asking: \"Just how many more months do the insurers have before the Minister will act? Three months ago private hospitals on the brink of collapse put a lot of faith in the Minister’s word that he would act, as promised, 'within three months,'\" APHA CEO Brett Heffernan said.\n\n\"The Minister’s deadline has lapsed. Now that commitment appears to have been fudged and pushed out further, with private hospitals desperate to keep their doors open back in no-man’s land and left scratching their heads. Like the Minister’s failed Private Hospital Viability Health Check process, that faith, once again, seems to have been misplaced. \"Private hospitals welcomed the Federal Government’s pre-election and election campaign pledges recognising the runaway profits and growing management fees of health insurers, while benefits to private hospitals have failed to keep pace with costs.\"\n\nThe Australian Prudential Regulation Authority (APRA) data shows the shortfall in funding to private hospitals from insurers in 2022 was $660 million.\n\nIn 2023 this blew out to $1.135 billion and to $1.254 billion last year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/koloamatangi-realistic-about-chances-of-playing-origin-ii/105406484",
        "title": "Rampaging Rabbitoh realistic about Origin selection",
        "publish_date": "Wed, 11 Jun 2025 21:51:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "South Sydney enforcer Keaon Koloamatangi is realistic about missing out on the NSW starting 17 after the dominant performance from the Blues' big men in Origin I.\n\nDespite the Rabbitohs forward having arguably the best month of his career, racking up over 200 run metres in each of his past four games, he said he did not expect coach Laurie Daley to change his winning formula.\n\nABC Sport will have live blog coverage of the State of Origin series.\n\nAn ACL tear to Warriors forward Mitch Barnett opened the door for a new forward in the NSW team, but Daley chose to elevate game one squad member Stefano Utoikamanu, with Koloamatangi coming onto the extended bench.\n\n\"Obviously you want to be able to play and be in the 17, but everything happens for a reason,\" Koloamatangi said.\n\n\"The team would have been obviously unchanged because of the dominant win in game one, so I'm just happy to be here.\"\n\nThe 27-year-old said he was eager to learn from the likes of game-one hero Payne Haas at the Blues' camp.\n\nKoloamatangi played one game of Origin in 2022 and will use his NSW recall to soak up the confident atmosphere before game two in Perth next Wednesday.\n\n\"You can always improve your game no matter how good you are,\" Koloamatangi said on Tuesday.\n\n\"I'm just looking forward to being able to train with the boys and see what they're doing on a daily basis that people don't see.\"\n\nAnother unlucky player on Daley's extended bench is 18th man Matt Burton, who will now miss Canterbury's game against Koloamatangi's Rabbitohs on Sunday.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBurton is no stranger to the number 18 jersey, having filled the role several times for NSW in the past. But he said preparing as a utility presented unique challenges.\n\n\"Eighteenth man's a bit tricky. You don't know where you're going to get to come on,\" Burton said.\n\n\"It's just about me getting my reps during the week at different positions and go from there.\"\n\nBurton's club coach Cameron Ciraldo has been critical in the past of not being able to pick Origin 18th men for club duties, but his five-eighth insists his coach is full of good wishes for the experience.\n\n\"[Ciraldo] was pumped for me to be back in this arena and around the group,\" Burton said.\n\n\"We [the Bulldogs] obviously want players in this arena so he didn't say too much, just, 'Enjoy the week.'\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-12/australian-swimming-trials-day-three-world-championships/105401046",
        "title": "O'Callaghan opens up on the insular life of elite swimmers",
        "publish_date": "Wed, 11 Jun 2025 21:21:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "Mollie O'Callaghan was the darling of Australia during last year's Olympic Games in Paris.\n\nShe had beaten Australia's swimming queen Ariarne Titmus in her world record event, the 200m freestyle, one of three golds O'Callaghan won during the Games.\n\nHowever, things have not gone as planned since then.\n\nO'Callaghan freely admits she has struggled this year both in and out of the pool with injuries and other demons.\n\nShe is still the fastest woman in Australia over 200m, proving that on night three of the Australian Swimming Trials with a strong win that included her customary kick over the final 50.\n\nBut her time of 1 minute 54.43 seconds was more than 1.5 seconds slower than her personal best — the world record she held before Titmus took it.\n\nWhile it was her fastest time of the year, she was still disappointed.\n\n\"I was a bit off today,\" she said on Wednesday night in Adelaide.\n\n\"You know you get a bit anxious like everyone does, and I think I was just overthinking it.\n\n\"I'm trying too hard not to think about the time, it's all about racing at the moment.\n\n\"I think after the lead-up I've had over the past few months, to come back off a big break and injury and other little bits and bobs and personal stuff, I think I'm pretty proud of myself to show up behind the blocks and do that two-hundred.\"\n\nO'Callaghan said she was working on ways to find enjoyment in swimming after the high of the Paris Olympics, following the inevitable comedown after winning three gold medals.\n\nMcKeown off to world titles despite DQ Photo shows An Australian swimmer arches her back as she dives into the water in a backstroke race. Kaylee McKeown beat rival Mollie O'Callaghan in the race of the night at the Australian Swimming Trials, but she acknowledges she is still not at her best after struggling since the Paris Olympics.\n\n\"After the Olympics I'd achieved everything I wanted to, and I needed that mental recovery after that,\" she said.\n\n\"This year's about having fun, but there's been a lot of curveballs thrown at me, so it's making it very hard to have fun.\n\n\"But I think making the team and having the pressure taken off, just to race and go meet new people, go have fun and train alongside my buddies overseas, which is the whole purpose of this.\"\n\nIt has led O'Callaghan to ponder how she can balance having fun while being in a highly competitive environment, trying to qualify for the World Aquatics Championships.\n\n\"That's something I'm still learning,\" said O'Callaghan, who earlier in the meet revealed she didn't have any friends outside of swimming.\n\n\"At 21 years old, you're forever learning that.\n\n\"You know we've been in this sport for a very long time when you get stuck down and you have to be so dedicated to each and every little thing where it's like you don't have a life outside of it.\n\n\"This part is about discovering who I am outside of the pool.\n\n\"But a part of me is trying to force myself to get back into the rhythm. But I think incredible people like Lani (Pallister) and Kaylee (McKeown) make it a lot more fun.\n\n\"You know I put a lot of pressure on myself but externally a lot of people expect a lot out of me, but they don't really see the work that goes behind it or what I've been through.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nO'Callaghan's introspection and dissatisfaction mirror that of backstroke star Kaylee McKeown, who has won both the 50m and 100m backstroke events at these trials, but has been extremely disappointed with her times.\n\n\"Mollie is so hard on herself,\" said Pallister, who finished second in the 200m freestyle final with a personal best time.\n\n\"When she comes and stands here and talks about, I guess wanting the world record back, and wanting to be a 1:52, there's two people who have ever done that, and that's her and Ariarne.\n\n\"So, as much as she says that it wasn't a good swim, she's just incredible with what she does and what she can do.\"\n\nPallister, who won a gold medal in Paris as part of Australia's 4x200m freestyle relay team, said O'Callaghan's struggles are a reflection of the pressures Australian swimmers face.\n\n\"This is going to sound really brutal, but I think sometimes people forget that these athletes are also people,\" Pallister said.\n\n\"There's so much expectation put on Australian swimmers, and I think that shows.\n\n\"Every four years we're expected to win multiple gold medals, and sometimes, if you don't race at your best, I guess it's almost [the] public and other people that bring you down.\n\n\"But I think if you have a supportive group around you, it doesn't really matter what the rest of the world says,\" Pallister said.\n\nCameron McEvoy said he also experienced the same comedown after winning gold in the men's 50m freestyle in Paris.\n\n\"I definitely went through a pretty tough period,\" he said.\n\n\"You go from your world being extremely tiny, where it's just swim, sleep, eat, and that's it.\n\n\"And as soon as you touch the wall, it gets flipped upside down, and you've got the entire world trying to talk to you, and kind of the world opens up, and you're not swimming as much, and then you've got to come down emotionally.\"\n\nLoading Instagram content\n\nBut the 31-year-old has 10 years more life experience than O'Callaghan, is now married and expecting his first baby.\n\n\"Now digesting the marriage, digesting starting a family, that kind of put the whole swimming gig into comparison and it humbles the whole job here — makes me realise there's so much more to the world,\" he said.\n\nUnlike O'Callaghan, the physics and mathematics graduate was happy with his winning time in the men's 50m freestyle of 21.3 seconds — the fastest time in the world this year.\n\nMcEvoy said he is swimming so well and consistently that even an average performance is enough to win at these trials, and there's more to come.\n\n\"I definitely think I can go faster before the world champs,\" he said.\n\n\"How much more, I'm not sure, but longer term — more LA (Olympics) levels to the future, I think yeah, there's a lot more I can improve upon.\"\n\nTeenage breaststroker Sienna Toohey followed up her 100m success by winning the 50m women's breaststroke final, but could not make the qualifying time for the World Championships.\n\n\"I'm honestly very happy with it, the qualifying time is extremely tough,\" she said.\n\n\"Last night was a good swim, got the qualifying time, hopefully they might put me in the 50 over in the worlds, maybe, who knows?\"\n\nToohey said she was prepared for the hype that followed her extraordinary swim on Tuesday night.\n\n\"I knew that it was going to blow up like that. I saw a bit of popping up and then I was like, 'Well I can't get too full of myself,' so I put my phone on do not disturb and I haven't really been on it since then,\" she said.\n\nSam Short continued his stunning form, taking out the men's 800m freestyle final in 7:40.95, to go with his win in the 400m and second place in the 200m.\n\n\"It's going to be a battle in Singapore like it always is, we're like in a golden age of distance swimming at the moment,\" Short said.\n\n\"I love racing, it's just so much fun, I love getting in there hurting, that's why I do it.\"\n\nIn other results, Paralympic gold medallist Benjamin Hance set the fastest time in history in the S14 men's 50m backstroke event.\n\nHis time of 26.09 seconds was recognised by VIRTUS Sport as a world record, but not an official world record as the event isn't raced at the Paralympics or Para World Championships.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/manning-icac-inquiry-live-updates-former-head-of-school-infrastructure-nsw-to-appear-20250612-p5m6uj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Manning ICAC inquiry LIVE updates: Former head of School Infrastructure NSW to appear",
        "publish_date": "Thu, 12 Jun 2025 11:59:23 +1000",
        "category": "finance",
        "authors": [
            "Michael Mcgowan",
            "Michael Ruffles"
        ],
        "text": "Hello and welcome to our live coverage of the NSW Independent Commission Against Corruption’s public hearing in the investigation of School Infrastructure NSW. After nearly six weeks, the key subject of the inquiry, Anthony Manning, is due to give evidence from 11.50am.\n\nManning was the first chief executive of School Infrastructure NSW, a government agency within the Department of Education set up in 2017 under the previous government to manage what was forecast to be a $2.6 billion investment in school building over the following four years. He left the role in February last year.\n\nFormer NSW Schools Infrastructure chief Anthony Manning, pictured here at budget estimates in 2023, is a key subject of the ICAC’s public inquiry. Credit: Janie Barrett\n\nThere are two main allegations, which were outlined on day one. The first is whether Manning and others used their official functions to subvert “appropriate recruitment practices to benefit friends and business associates”, improperly award contracts worth millions of dollars and misallocate funds from school projects.\n\nThe second allegation is whether Manning, School Infrastructure human resource strategic adviser Wendy O’Brien and others engaged in reprisal actions against staff who made complaints.\n\nThis will be the first chance to hear from Manning. His previous barrister, Tim Hale SC, had raised concerns earlier in the hearing that the arguments against Manning were “relatively unspecific”. “There is extreme doubt certainly from my client’s point of view what actually is being alleged to be the corrupt conduct,” he said.\n\nThe ICAC’s livestream can be viewed here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/we-are-about-to-find-out-the-cost-of-the-trump-chaos-20250612-p5m6u0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "We are about to find out the cost of the Trump chaos",
        "publish_date": "Thu, 12 Jun 2025 11:58:22 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The March surge has been attributed to “front-loading,” or importers rushing to build their inventories before the broader Trump tariffs, announced on April 2, which Trump labelled “Liberation Day,” could take effect. The existence of those inflated stocks means the impact of the tariffs on prices for consumers would take some time to filter through to inflation data. There’s also a sense from the anecdotal evidence that companies are waiting for the dust to settle and a clearer picture of the final tariff settings to emerge before acting. Fed chair Jerome Powell. The central bank will want to wait until the full picture of the tariffs and the effect they have on the inflation numbers is fully reflected before cutting rates. Credit: AP The Fed’s “Beige Book” – a compilation of surveys undertaken by the 12 regional Fed banks, said last week that there had been “widespread” reports from companies that they expected costs and prices to rise at a faster rate, with some of the districts reporting that those survey expected the cost increases to be “strong, significant or substantial.” All the district reports, the Fed said, indicated that higher tariff rates were putting upward pressure on costs and prices and that the companies that planned to pass through tariff-related costs to customers expected to do so within three months.\n\nThat fits with what consumer-facing companies have been saying in their investor presentations and makes sense. They are saying that the tariffs are too material to be absorbed and will be passed on. Loading Allowing for the buffer provided by the front-loading of imports in March, the question mark over what will happen when the pause on the reciprocal tariffs ends and a reluctance of companies to increase prices and lose sales until they actually experience cost increases that they expect to persist, the impact of the tariffs could be expected to show up progressively over the rest of the year. Data over the next three to six months will better reflect the impacts of the tariffs. Nevertheless, there were some early indications that the effects of Trump’s earliest tariffs are showing up.\n\nThe prices of major appliances, for instance, jumped nearly 4.5 per cent last month. They were included in Trump’s February tariff announcements. The prices of perishables like bananas and vegetables, where supply can’t be front-loaded, rose significantly, as did toys, a segment China dominates. The price hikes in those categories were offset by a decline in the prices of new cars, a segment where the tariffs are expected to eventually have a substantial impact, eggs, gasoline and air fares. US oil prices have fallen more than 15 per cent this year amid a global glut of oil. West Texas Intermediate prices bottomed out around $US60 a barrel in May and are now trading around $US68 a barrel. Data over the next three to six months will better reflect the impacts of the tariffs on the US economy. Credit: Bloomberg The drop in airfares, which reflects a slump in demand, may have something to do with Trump’s immigration policies and the harsh treatment of visitors to the US by US Customs and Border Protection personnel.\n\nWhile the May data might appear benign, it is improbable that the Fed will heed Trump’s call for a percentage point cut to the federal funds rate when its Open Market Committee meets next week. The markets are assigning zero probability to a cut, although the odds on one in September improved from 60 per cent to 70 per cent after the inflation data was released. The Fed will want to wait until the full picture of the tariffs and the effect they have on the inflation numbers is fully reflected. It will also want to understand the dynamic between the tariffs’ impacts on prices and their impacts on the underlying economy. It is conceivable that the tariffs, the likely price increases associated with them and the uncertainty generated by the way they have been announced – they’ve evolved unpredictably and appear dependent on Trump’s volatile moods – will lead to materially lower US economic growth, which would reduce demand and blunt the inflationary impact of the tariffs. It’s also conceivable that the outcome could be shrinking growth and spiking inflation – stagflation – which would force the Fed to choose between combatting inflation or saving jobs. That’s why the safest course for the Fed at this point is to sit on its hands until it has more useful data.\n\nTrump, of course, has always advocated for lower interest rates and has routinely verbally assaulted the Fed chair, Jerome Powell, for not delivering them. He needs them more than ever, with the Congressional Budget Office saying his “One Big Beautiful Bill” – his budget bill – would add $US3 trillion to US government debt over the next decade if enacted in its current form. Trump, on his Truth Social platform, in posting his plea for the Fed to cut rates, added that the US “WOULD PAY MUCH LESS INTEREST ON DEBT COMING DUE. SO IMPORTANT!!!.” The Republicans are tearing themselves apart – fiscal conservatives versus the Trumpists – in negotiations over the bill. Lower debt-servicing costs would help his cause. It doesn’t seem to have occurred to Trump and his advisers that damaging the credibility of Powell and the Fed would be damaging to the US economy and markets and would be more likely to increase the perceived risk of investing in the US. The likelihood that the Fed will wait until at least September, if not later, before seriously contemplating a cut has led to new speculation that Trump will move to undermine Powell, reviving and refining a plan schemed up by Bessent during last year’s election campaign. Powell, whose term as chair of the Fed (but not as a governor) expires in May next year, can’t be removed by Trump. Bessent suggested that a “shadow” governor should be announced, one who would provide their own commentary on rates and inflation and, because they would be Powell’s successor, increasingly undermine Powell and the Fed’s credibility.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/freak-of-nature-why-wallabies-teammates-aren-t-among-the-tupou-doubters-20250611-p5m6og.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Freak of nature’: Why Wallabies teammates aren’t among the Tupou doubters",
        "publish_date": "Thu, 12 Jun 2025 11:58:00 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Will Taniela Tupou make the Wallabies team to play against the British and Irish Lions?\n\nRewind just a year ago and that’s a question few could have imagined being possible on the eve of the blockbuster Lions series.\n\nWith immense power and the dimensions of a tank, 150kg tighthead prop Tupou has been one of the Wallabies’ highest profile and most destructive stars during the past five years.\n\nBut struggling under the weight of expectation of a $1.2 million salary, a move to the Waratahs and several years of calf, Achilles and hamstring injuries, Tupou this year turned in his poorest Super Rugby season.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-commuters-react-to-bus-network-shake-up-20250611-p5m6i1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Burpengary storage facility engulfed in fire | Toll road laws passed in Parliament | Commuters react to bus network shake-up",
        "publish_date": "Thu, 12 Jun 2025 11:54:29 +1000",
        "category": "finance",
        "authors": [],
        "text": "There will be major changes to bus services in the Brisbane CBD over 10 weekends as part of testing for the new Adelaide Street tunnel, which will allow buses and metro vehicles to drive through it for the first time.\n\nOver 10 weekends, from June 20 to August 25, specialists will activate software systems, test lighting, ventilation and public announcements, and test the Adelaide Street tunnel under 70 different scenarios.\n\nTo allow testing, the inner-city busway tunnel systems will temporarily close on weekends with detours in place.\n\nThe Adelaide Street tunnel under construction. Credit: Brisbane City Council\n\nThe Queen Street, King George Square and Roma Street busway stations will close from the last service Friday night until 5am Monday.\n\nBuses that normally use the inner-city busway tunnel will detour at street level, and metro services will be operated by bus replacement services.\n\nSome services might arrive or depart up to six minutes earlier or later during works, and the Ezymart inside King George Square will not open during weekend works.\n\nTransport chair Ryan Murphy said when the tunnel opened, it would mean more services more often.\n\n“By moving more than 1390 services underground every day, we’re easing CBD congestion and freeing up space on city streets,” he said.\n\nThe Roma Street busway station will reopen from 4.30pm to midnight on Saturday, July 19 to support travel to and from the Wallabies vs British and Irish Lions game at Suncorp Stadium.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/four-more-years-free-agent-brayden-maynard-re-signs-with-collingwood-20250611-p5m6p2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Four more years: Free agent Brayden Maynard re-signs with Collingwood",
        "publish_date": "Thu, 12 Jun 2025 11:52:41 +1000",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Free agent Brayden Maynard has re-signed with Collingwood for four more years on a deal worth about $3.3 million.\n\nThe vice captain, considered the modern embodiment of the classic Collingwood player, a heart-and-soul figure extremely popular with the Collingwood fans, will be likely now to remain a Magpie for life.\n\nBrayden Maynard has re-signed with the Magpies for four more years. Credit: AFL Photos\n\nGiven the popularity of the tough defender, it always seemed unlikely Maynard would leave. But the arrival of two more half-back flankers in Dan Houston and Harry Perryman last off-season created the idea that Maynard could become surplus to requirements in a team searching for options to bring in a draft pick.\n\nMaynard’s form had been excellent this year regardless of the duo’s arrival and the fact he has carried a foot injury. His ruptured his plantar fascia a fortnight ago and will miss at least one more game after this week’s bye before returning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/the-brilliant-yet-troubled-life-of-the-beach-boys-damaged-genius-20250612-p5m6v0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The brilliant yet troubled life of the Beach Boys’ damaged genius",
        "publish_date": "Thu, 12 Jun 2025 11:50:24 +1000",
        "category": "lifestyle",
        "authors": [
            "Ben Sisario"
        ],
        "text": "Abandoned by Wilson, Smile entered rock lore as a lost document of a brilliant but troubled mind. Mike Love, the Beach Boys vocalist and longtime foil of Wilson’s, called it “a whole album of Brian’s madness”. It remained unfinished for nearly 40 years. Wilson’s life story came to be portrayed as a struggle to escape from the yokes of two men: his abusive father and a controlling psychotherapist, Eugene Landy. Landy’s unorthodox methods were effective in nursing Wilson back to health during two periods of treatment in the 1970s and ’80s. Yet Landy also went into business with his patient, sharing copyrights with Wilson and taking writing credits on some of his songs. Brian Wilson in 1965. Credit: Michael Ochs Archives/Getty Images Landy eventually came under the scrutiny of Californian authorities and surrendered his licence. After an intervention by Wilson’s family, a court order also blocked Landy from contact with Wilson. Wilson spoke openly about his struggles with mental illness, including his experience with schizoaffective disorder, a condition characterised by hallucinations and delusions. The condition led to the conservatorship granted to his business associates in early 2024.\n\nBrian Douglas Wilson was born June 20, 1942, in Inglewood, California, to Murry and Audree (Korthof) Wilson. His father was a heavy-machinery salesperson who had collected a handful of credits as a frustrated songwriter. His mother, a homemaker, kept the Beach Boys’ books in the early days of the band. The family moved to Hawthorne, California, when Brian was a toddler, and had two more boys, Dennis and Carl. Loading By 1961, the three Wilson boys were playing rock music with Love, a cousin, and a schoolmate of Brian’s, Al Jardine. Around that time, Dennis began surfing and delighted in the fashion, trendy lingo and carefree lifestyle that went along with it. One day he told Brian and Love, “You guys ought to write a song about surfing.”\n\nThey did, and that fall, the group recorded its first song, Surfin’. The young men called themselves the Pendletones, after a type of flannel shirt popular among surfers. When they received the finished record, released by a small local label, Candix, they discovered that they had been renamed the Beach Boys. Signed by Capitol Records in 1962, the group was prolific from the start, releasing 10 studio LPs through 1965. The Beach Boys in 1966 (from left): Al Jardine, Mike Love, Dennis Wilson, Brian Wilson and Carl Wilson. Credit: AP Wilson became the band’s primary producer and songwriter, and his sophistication soon shone through. Surfer Girl, a lilting, harmony-drenched ballad that went to No. 7 in 1963, was perhaps the first pop hit written, arranged, produced and sung by the same person. Wilson’s first No. 1, however, came as a writer of Jan and Dean’s song Surf City (1963). In a sign of conflicts to come, Murry Wilson, who managed the Beach Boys and controlled the band’s songwriting copyrights, was furious that Brian had given a valuable hit to another act.\n\nOther problems surfaced. Surfin’ U.S.A. resembled Chuck Berry’s Sweet Little Sixteen a bit too closely, so Berry’s name was added to the credits, and his publisher acquired the song’s copyright. In December 1964, Wilson married Marilyn Rovell, who sang in a girl group called the Honeys. A few weeks later, he had a panic attack on a flight to a Beach Boys engagement in Houston and decided to quit touring to concentrate on songwriting and recording. That same year, the group fired Murry Wilson as manager. As Brian Wilson would recount, his father had long tormented him. In one form of punishment, his father would remove his glass eye and force his son to stare into the empty socket. “My dad was violent,” Wilson wrote in a 2016 memoir, I Am Brian Wilson, written with Ben Greenman. “He was cruel.”\n\nFreed from his father’s control and the Beach Boys’ touring demands, Wilson immersed himself in the studio. Pet Sounds, released in May 1966, elevated the Beach Boys’ music to a level far above anything they had created before. With the rest of the group on the road, Wilson made the album primarily with studio musicians. Upon release, the album stalled at No. 10, a relative dud by Beach Boys standards. By then, however, Wilson was working on his next gem: the single Good Vibrations. The beach Boys: (from left) Bruce Johnston, David Marks, rear, Brian Wilson, Mike Love and Al Jardine in New York in 2012. Credit: Jason Decrow/Invision/AP Spliced together from months of sessions across four studios, Good Vibrations was a catchy and sonically adventurous invocation of peppy West Coast spirituality. Released in October 1966, the song became an indelible radio hit, but it was Wilson’s last moment at the vanguard of pop.\n\nWilson’s drug use, which had begun during happier times for the band, had grown out of control, stunting his creativity. “I lost interest in writing songs,” Wilson once told Rolling Stone. For about a year, starting in 1975, he was treated by Landy, whose methods included dousing his patient with cold water in the morning. He also limited his patient’s contact with others, including Wilson’s family, to underscore the therapist’s role as “the ultimate power in this situation,” as Landy once put it. Wilson continued to perform as part of the Beach Boys, but his behaviour was erratic and his drug use continued. In 1982, the Beach Boys kicked Wilson out of the group, and he returned to the care of Landy. His treatment, begun in seclusion in Hawaii, included a strict diet and vitamin regimen, with Wilson under constant supervision. Landy’s techniques raised eyebrows, but in Wilson’s case they seemed effective. When the singer made the press rounds in 1988 for his first solo album, Brian Wilson, he appeared fit, energetic and focused. Brian Wilson, left, and his second wife Melinda Ledbetter Wilson at the 55th annual Grammy Awards in 2013. Credit: Jordan Strauss/Invision/AP\n\nThe extent of Landy’s control over his patient, and his involvement in Wilson’s career, drew concern among Wilson’s family and people in the music industry. The two men started a business partnership, called Brains and Genius, that allowed Landy to draw profits from Wilson’s recordings, films and other ventures. Landy was the executive producer of Brian Wilson, and he and his girlfriend, Alexandra Morgan, shared songwriting credits with Wilson on some tracks. Wilson said he even modified his will to make Landy its primary beneficiary. After an investigation by California authorities into his treatment of Wilson and other patients, Landy surrendered his license in 1989, though he continued to work with Wilson through their partnership. Members of Wilson’s family filed a conservatorship case over Wilson’s care. In 1992, as a result of a settlement in that case, Landy was barred by court order from making any contact with Wilson; his name and that of Morgan, whom he later married, were removed from song credits. Landy died in 2006 at 71. In 1995, Wilson married Melinda Ledbetter, a former model who worked at a car dealership and had sold him a Cadillac. He frequently credited her with helping him rebuild his life after his entanglement with Landy. She died in 2024. “Melinda was more than my wife,” Wilson said at the time. “She was my saviour. She gave me the emotional security I needed to have a career. She encouraged me to make the music that was closest to my heart. She was my anchor.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/aukus-in-doubt-as-us-starts-review-into-whether-the-deal-is-america-first-20250612-p5m6rn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Time to wake up’: Turnbull, opposition seize on Trump’s AUKUS review",
        "publish_date": "Thu, 12 Jun 2025 11:48:20 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol",
            "Rob Harris",
            "Paul Sakkal"
        ],
        "text": "“It is natural that the administration would want to examine this major undertaking including progress and delivery, just as the UK government recently concluded an AUKUS review and reaffirmed its support. “Our engagement with the Trump Administration and across the full political spectrum in the United States has shown clear and consistent support for AUKUS.” The US Defence Department is reviewing AUKUS to see whether it aligns with President Donald Trump’s “America First” priorities. Credit: AP “Importantly, AUKUS will grow both US and Australian defence industry as well as generating thousands of new manufacturing jobs,” the spokeswoman said. Australia is investing $US3 billion ($4.6 billion) in US shipyards as part of the deal.\n\nOpposition frontbencher Bridget McKenzie said AUKUS was critical for Australia’s defence. “[The review is] a deeply concerning development,” she said on Channel Nine’s Today show. “There’s now a growing list of serious issues and tasks for the prime minister with his meeting with President Trump next week. Any undermining of this serious and substantial alliance between our two countries should be of grave concern”. Former prime minister Malcolm Turnbull, who has been critical of AUKUS, questioned why Australia has not yet reviewed the scheme. “The UK is conducting a review of AUKUS. The US... is conducting a review of AUKUS,” he said on X. “But Australia, which has the most at stake, has no review. Our parliament to date has been the least curious and least informed. Time to wake up?”\n\nColby has previously called himself an AUKUS sceptic and last year said it would be “crazy” if the arrangement resulted in nuclear-powered submarines going to the wrong places at the wrong time. Of particular concern is the US’s lagging rates of submarine production, and failure to meet its own needs. As part of the AUKUS deal, the president of the day can refuse to release the boat to Australia if it is required for American defence priorities. US Defence Secretary Pete Hegseth while meeting with his Australian counterpart Richard Marles earlier this year. Credit: AP However, Colby expressed more optimism about AUKUS at his confirmation hearing earlier this year, saying he wanted to remove red tape and barriers to submarine production so that the partnership could be expedited. News of the review comes just days before Prime Minister Anthony Albanese expects to meet Trump on the sidelines of the G7 world leaders’ summit in Canada. But on Thursday, White House press secretary Karoline Leavitt said the president’s schedule for those G7 meetings was still being finalised.\n\nAlbanese’s office has been contacted for comment, as was Australia’s embassy in Washington, which referred questions to Canberra. At a meeting with Defence Minister Richard Marles at the start of this month, Hegseth urged Australia to lift defence spending to 3.5 per cent of GDP – a request reiterated by Colby on social media this week. Loading A UK government spokesperson said AUKUS was “one of the most strategically important partnerships in decades”. “It is understandable that a new administration would want to review its approach to such a major partnership, just as the UK did last year,” they said. “The UK will continue to work closely with the US and Australia at all levels to maximise the benefits and opportunities which AUKUS presents for our three nations.”\n\nSeveral AUKUS experts urged caution in interpreting the intent of the US review. They pointed to the fact the United Kingdom recently commenced a parliamentary inquiry into the pact, and said it was natural that the Trump administration would seek to ensure AUKUS aligned with its own priorities. The review also comes just weeks after the new US ambassador to Britain, Republican donor Warren Stephens, told a London audience that AUKUS was “vital” to global peace and security. Under the first pillar of the pact, Australia will purchase three to five nuclear-powered submarines from the US, starting in the 2030s, and build more through a joint initiative with the US and UK. Under the second pillar, the three nations will collaborate on advanced defence technologies. Australia is also contributing at least $US3 billion ($4.6 billion) to the US defence industrial base to shore up submarine production; $800 million has already been paid. The deal was announced in 2021 under then prime minister Scott Morrison and then US president Joe Biden. Loading\n\nSophia Gaston, UK foreign policy lead at the Australian Strategic Policy Institute in London, said the British inquiry had “injected new dynamism and political edge into the UK’s approach”, which was helpful in taking AUKUS forward under Trump. She said it was perfectly reasonable for the new administration to conduct a review into a project as large and significant as AUKUS. “We can never be certain of where another government’s review will take them, but Britain and Australia must be confident in the rationale behind AUKUS and its alignment with America’s core goals of deterrence and competition towards China,” Gaston said. “The best thing both allies can do during this review process is to put themselves in a posture ready to deliver some quick wins, particularly on pillar two, which will demonstrate the value in America partnering with allies to amplify its strengths in both scale and innovation.” Alessio Patalano, a professor of war and strategy in East Asia at King’s College London, said Colby’s views on AUKUS before he joined the current administration would likely inform how AUKUS advocates perceived this review.\n\n“However, these views are now being channelled into a government effort to ‘audit’ how AUKUS advances the US economy and security,” he said. “As such, the review represents an opportunity to assess whether the current governance structure and priorities would benefit from greater focus.” Supporters argue the pact is a strategic bulwark in an increasingly contested Indo-Pacific region, though critics warn that delays and shifting political dynamics could undermine its success. But British Prime Minister Sir Keir Starmer last month declared the AUKUS defence pact the centrepiece of his government’s national security strategy, promising the UK’s largest military investment since the Cold War. At a high-level event in Westminster, Starmer described AUKUS as a “national endeavour” and named former national security adviser Sir Stephen Lovegrove as his special representative to lead the project.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/bulldogs-star-appears-to-rupture-acl-20250421-p5lt2l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bulldogs star appears to rupture ACL",
        "publish_date": "Thu, 12 Jun 2025 11:45:23 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bulldogs star appears to rupture ACL\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/insane-crusaders-record-goes-on-line-20250612-p5m6wb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Insane Crusaders record goes on line",
        "publish_date": "Thu, 12 Jun 2025 11:45:13 +1000",
        "category": "finance",
        "authors": [],
        "text": "Insane Crusaders record goes on line\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/bridgerton-star-takes-on-phone-thief-in-cafe-20250612-p5m6wc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bridgerton star takes on phone thief in cafe",
        "publish_date": "Thu, 12 Jun 2025 11:45:12 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Bridgerton star takes on phone thief in cafe\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/max-king-daring-to-dream-of-ashes-tour-if-blues-clinch-origin-series-20250610-p5m6du.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Max King daring to dream of Ashes tour if Blues clinch Origin series",
        "publish_date": "Thu, 12 Jun 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Max King once thought his only hope of playing representative rugby league was to put his hand up for England, the land of his birth.\n\nSoon the Canterbury prop could be heading to the Old Dart wearing the green and gold of Australia on an Ashes tour, as his grandfather Johnny King did more than 50 years ago.\n\nKing is focused on helping NSW win State of Origin II in Perth next week to clinch a series victory, having made his interstate debut off the bench in the Blues’ 18-6 triumph at Suncorp Stadium in game one.\n\nAfter Mitch Barnett suffered a season-ending knee injury two weeks ago, King has been promoted to the starting line-up – another surreal moment for a player who until a few weeks ago had never dared dream he would be good enough to play at rep level.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/katy-perry-melbourne-20250604-p5m4vp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This show breaks some of my rules for theatre. Here’s why it works",
        "publish_date": "Thu, 12 Jun 2025 11:44:47 +1000",
        "category": "entertainment",
        "authors": [
            "Sonia Nair",
            "Karl Quinn",
            "Will Cox"
        ],
        "text": "There are musical interludes featuring heartbreak songs throughout – vocals auto-tuned and self-accompanied by the synth McCracken half-heartedly learnt to play while trying to get back on the horse. Comically obsessive monologues on the physiology of heartbreak are interwoven, too. McCracken gives a biomolecular hot take on the grieving process; makes excursions into neuro- and social psychology. These, and a penchant for Google-diagnosing the rarest possible disorders – yes, you can really die of a broken heart, it’s called Takotsubo cardiomyopathy, apparently – are desperate measures to control the acute sense of powerlessness the show explores. A minimalist set creates a transient, liminal space reminiscent of a hotel lobby, and it’s all seamlessly directed and performed, without a hint of sentiment or preachiness or over-realisation. Instead, Heartbreak Hotel offers the balm of warmth and authenticity, using a melange of cabaret, stand-up, and the brisk intimacy of a theatrical two-hander to transform the ineffable mess of life into art.\n\nReviewed by Cameron Woodhead\n\nTHEATRE\n\nThe Wrong Gods ★★★★\n\nArts Centre Melbourne, Fairfax Studio, until July 12 Countless clashes take hold in Sydney playwright S. Shakthidharan’s follow-up to his critically acclaimed epic Counting and Cracking: that between old and new, fate and agency, tradition and technology, the rural and the metropolis, the ancient practice of animism and the worship of progress at all costs. Radhika Mudaliyar and Nadie Kammallaweera play Isha and Nirmala in The Wrong Gods. Credit: Brett Boardman These concerns find their apotheosis in the increasingly frayed relationship between Isha (Radhika Mudaliyar) and her mother Nirmala (Nadie Kammallaweera). Isha dreams of a life beyond the confines of her riverside village and finding a different truth, but is stultified by her mother’s reticence to change. Nirmala is staunch and steadfast in her desire to live and die by her land, dictated by the caprices of the climate and environment. Enter Lakshmi (Vaishnavi Suryaprakash), a cog in a multinational company who Nirmala calls “the devil”. Simultaneously introducing Nirmala to newfangled farming technology and financial arrangements while offering Isha the freedom to realise her dreams of becoming a scientist, Lakshmi promises a form of liberation to both women. What could go wrong?\n\nThe Wrong Gods takes its inspiration from India’s “greatest planned environmental disaster”, where one of the world’s biggest hydropower infrastructure projects involved damming the Narmada River, a life source for millions, leading to displacement of indigenous communities and severe ecological catastrophe. Catapulting us seven years into the future in its second act, we see Nirmala protesting the ever-encroaching threat of irresponsible development on her land, aided by Devi (Manali Datar), while Isha pursues her dreams in the city. Their eventual reunion occurs under fraught circumstances none of them could have foreseen – but how they contend with it is the tension that drives the play forward. Much of the exposition occurs in the dense dialogue that’s exchanged between all four characters. Credit: Brett Boardman The Wrong Gods allows space for multiple truths to exist at once, disavowing easy resolutions and the reductive tendency to pick a side. You can support Isha’s desire to live a self-determined life, while wanting this same autonomy to be extended to her mother. You can wish for an easier life for Nirmala, while rejecting the ways colonial powers and corrupt state governments extract and exploit. At times, The Wrong Gods is both oversimplified and overexplained – much of the exposition occurs in the dense dialogue that’s exchanged between all four characters. They flit from idea to idea at lightning speed, from the patriarchy of god worship to the overconsumption of cities that sees rural denizens as collateral damage.\n\nBut the heightened emotional stakes of the personal relationships at the play’s fulcrum anchor it. Each character undergoes a metamorphosis of sorts as their perspectives and perception in the eyes of the others shift. Under Shakthidharan and Hannah Goodwin’s direction, they pace around and across the deep concentric grooves of tree rings, stuck in a cycle that was imposed on them as they look for ways to resist and defy it. Loading Kammallaweera is a highlight as the exceedingly strong Nirmala, providing comedic relief even as she wrenches the rug from beneath us in an emotionally stirring performance (special mention to her machete skills). Suryaprakash keeps us guessing as to Lakshmi’s motives in a stunning interplay of opacity and sincerity. Compressed into a neat 90 minutes, The Wrong Gods is significantly shorter than Counting and Cracking, but shares its deep engagement with big ideas that traverse the personal and the political. Reviewed by Sonia Nair\n\nTHEATRE | Rising Festival\n\nLegends (of the Golden Arches) ★★★\n\nMerlynn Tong and Joe Paradise Lui, Melbourne Theatre Company, until June 28 This rambunctious show follows two Australian artists of Singaporean Chinese descent as they battle ghosts past and present, in a comedy of (pop) cultural collision that sends them to Chinese hell and back. Joe Paradise Lui and Merlynn Tong in a scene from Legends (of the Golden Arches). Credit: Jessica Wyld Merlynn Tong and Joe Paradise Lui saunter onto the stage as themselves. They’re super low-key about it, and as their banter moves between shared nostalgia for, and shit-talking about, the childhoods they’ve left behind, conflict emerges. It emerges that both Lui and Tong have lost older relatives with a taste for McDonald’s burgers – one was a Filet-O-Fish connoisseur, the other a Big Mac fiend – and the immediate reason for their being onstage together is the aftermath of a funeral for one of these – Lui’s grandfather, for whom Tong insists on observing Chinese funerary traditions. She wants to fold and burn joss paper (as underworld currency, so the deceased can bribe their way past the many lords and officials in Chinese hell) and stay up all night, lest the dead ancestor remain trapped as a hungry ghost.\n\nMourning doesn’t become Joe Paradise Lui, though. He hired strippers for the funeral and has long outgrown superstitions he now finds anathema to his firmly anti-capitalist, pacifist ethos. Whether his contempt is (at least partly) a psychological defence against loss – Lui chose an artistic career and permanent exile in Australia over compulsory military service in Singapore – is a question he’ll have an eternity to confront. Legends (of the Golden Arches) draws the audience into hilarious and heartfelt odyssey. Credit: Jessica Wyld In a moment of pique, Lui throws a bag of Mickey D’s on the offering pyre. The act of disrespect opens a portal to a terrifying, and distinctly Chinese, hell dimension. There’s a flamboyant reveal, supercharged by garish Getai performance in futuristic costume, before all hell does break loose.\n\nLoading Set designer Cherish Marrington brings the guardians of the underworld to carnivalesque life through custom-made inflatables, and the performers can only escape the funfair atmosphere after Guanyin – goddess of mercy in the Chinese pantheon – intervenes. Visually splendid video artistry from Wendy Yu illustrates the retelling of Chinese legends in this work, from the backstory of the Chinese god of war, Guan Yu, to tales of the underworld’s incorruptible judge, Bao Gong. Unfortunately, the script isn’t always as vibrant or effective as the design – some jokes fall flat, and some of the cultural commentary is so basic it feels patronising. When Legends (of the Golden Arches) succeeds, though, it draws the audience into a hilarious and heartfelt odyssey – one that balances respect for the living and the dead, while navigating the mystery and majesty (and absurdity) of cultural traditions ancient and modern. Reviewed by Cameron Woodhead\n\nMUSIC\n\nKaty Perry | The Lifetimes Tour ★★★★\n\nRod Laver Arena, until June 14 Katy Perry is pure pop. Her songs promise, and mostly deliver, a good time. And her Lifetimes concert does the same, across two and a half hours, five acts, multiple costume changes and more than 20 songs from a back catalogue stretching to 2008 (the pre-Perry Christian singer Katy Hudson gets a brief acknowledgement but no stage time). Katy Perry on stage at Rod Laver Arena. Credit: Martin Philbey But this big, spectacular, noisy and surprisingly intimate show also has grander ambitions, in which it has mixed success. It’s all there in the framing device: a video game in which KP143, an “enhanced” version of Katy Perry, attempts to unseat Mainframe, the AI that has come to rule humanity rather than serve it. To do so, she must free the butterflies that have been captured to power the AI, and to do that she needs to collect love, in the form of glowing hearts that descend from the arena rafters.\n\nThe 143, of course, refers to the title of her latest and much-criticised album, and is tech speak for “I love you” (with its origins in pager messaging from the 1990s). Phew. That’s a lot of freight to load onto the shoulders of a bunch of pop songs, even a set as hook-heavy as Perry’s. And at times, the strain shows. Perry and her team of 10 dancers work their collective butts off. Credit: Martin Philbey The stage is set in what looks like a figure eight, though it’s actually the infinity symbol; later on, while singing E.T., a lightsaber-wielding Perry does battle with a lengthy bit of heating duct that is meant to represent the “infinite worm” spewed out by Mainframe. It’s the weakest moment in a show that has plenty of goof and lots of camp and heaps of flying on wires, and mostly manages to deploy them to great effect. The backdrop is a wall of screens, suggestive of the importance of video to Perry’s success, but also integral to the narrative; it’s up here, in lengthy clips, that the framing story unfolds, while Perry is offstage changing costumes.\n\nThe four-piece band – women on guitar and keys, men on bass and drums – play beneath the screen, while Perry and her 10 dancers make full use of the elongated stage. “Not a bad seat in the house,” she boasts. If “love” is the connective tissue here – and suddenly, her bizarre proclamation upon returning to Earth after that ill-conceived Bezos-shilling space flight makes so much promotional sense – the main theme is self-actualisation. The video screen backdrop plays a crucial role in the show’s narrative. Credit: Wolter Peeters In the dubiously conceived segment where the audience gets to “request” songs via QR code (it sent me to a sign-up page for the tour, with no option to vote), she plucked an 11-year-old to join her onstage while she sang Thinking of You, from her 2008 album One of The Boys. Maddie from Traralgon said she’d had a dream about this moment; Katy from California says keep dreaming because as this moment proves, if you dream it you can be it. The singer’s continual reinvention of herself is proof of that maxim. And her performance of the ballad – playing acoustic guitar, with no backing track and nowhere to hide – was proof that beneath all the razzle-dazzle she remains a serious talent. As she says towards the end, “Never forget you are the main character of your video game”.\n\nThe 143 album got a cold shoulder from critics and the charts, but its songs were loudly cheered and sounded great – Woman’s World and Lifetimes especially. Once the dust settles, these will, I suspect, come to be considered bona fide bangers to rank alongside Hot and Cold, Roar, California Girls and the rest (all of which got an airing, naturally). Whenever she is onstage, Perry works her butt off. Running, jumping (at the end of Act One, she literally leaps into a pit and disappears), standing atop a tall pillar, dangling upside down in a spherical cage, flying high on the back of a giant butterfly. It’s spectacular, and for the most part she sings well, looks great, and appears to be having almost as much fun as her audience (a spread of ages, including many young girls, with their mums, first-wave Perry fans who’ve passed the baton of sparkly empowerment on). Katy Perry is a consummate performer. Credit: Martin Philbey Perry can be a little tone-deaf at times – her Blue Origin flight reeked of privilege, and working with producer Dr Luke was problematic at the least – but so much of the recent criticism of her smacks of ageism. She knows it, too. When she finished a terrific rendition of Teenage Dream, she responded to a call from a fan. “Oh still? I can be your hall pass still? I’m 40 years old. Forty and fabulous.” That she is.\n\nReviewed by Karl Quinn\n\nMUSIC | Rising festival\n\nPete and Bas ★★★\n\nMax Watts, June 8 Peter Bowditch and Basil Bellgrave take the stage at the packed Max Watts a little early. They’re men in their 70s and they talk (and dress) like they’re in a Guy Ritchie film. Pete and Bas perform at Max Watts on June 8. Credit: Mandy Wu “Are you ready for some madness?” says Bas, in a broad cockney accent. “We ain’t here for a laugh! This is serious” says Pete. The DJ fills the room with reverberating rap airhorn and they launch into a drill track called Do One. I’m in.\n\nSo are they actors? An elaborate bit of performance art? A septuagenerian Milli Vanilli? Did they have ties to notorious London gangsters the Kray brothers? Did Bas do a stint playing piano on cruise ships? I’ve looked into all this. The answers are far less interesting than the questions. So maybe it’s a joke. But the joke wouldn’t land if they weren’t actually great. Are Pete and Bas actors? An elaborate bit of performance art? Credit: Mandy Wu Their flow (on the recordings at least, more on that later) is fast, aggressive, razor sharp. And their lyrics are full of colour, character and flashes of violence. Sample: “Recipes, batches, powders, waxes, cash in hand no taxes / Kerosene, matches, burn down factories, big boy tactics / Burning, burning, all this money I’m earning.” Like most rappers, they’re entertainers, storytellers. Bas drags an excited young woman on stage.“I f--ken love you c---s!” she screams into the mic before twerking her way through the next track, Pint and a Fag.\n\nLoading The crowd are rowdy. Half a dozen people are hauled up to dance and occasionally rap. It is, as Bas puts it, “gettin’ a little bit lively”. Pete throws a wad of cash into the crowd. Like the rest of the night, I can’t quite tell if it’s real or not. At 70-something, they do struggle to keep up with the flow. The backing tracks come complete with the recorded vocals as guides, and occasionally they lose track and mumble their way through a verse. It doesn’t hinder the night as much as you might think. After about an hour ,they wrap up with Mr Worldwide (“Keep one eye open for the plainclothes / I need more leg room for the plane home”), and they’re off. “Back to our coffins,” as Pete puts it. It’s possible I’ve just seen a couple of elderly actors fumble through a lip sync for an hour at the behest of a canny management company. I don’t know! Frankly, I don’t want to know. That was the most fun I’ve had at a show in ages.\n\nReviewed by Will Cox",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/the-aussie-nfl-punter-making-84-000-a-kick-20250612-p5m6so.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Aussie NFL punter making $84,000 a kick",
        "publish_date": "Thu, 12 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "Australian Michael Dickson has become the NFL’s highest-paid punter after re-signing with the Seattle Seahawks on a $25.68 million four-year deal.\n\nThe 29-year-old Swans academy product first signed with the Seahawks in 2018, and had previously held the title of the league’s highest-earning punter when he extended with the club back in 2021.\n\nDickson will earn a guaranteed $15.67 million across the four years, but could earn up to $25.68 million. The new deal means Dickson will earn about $6.4 million a season – or $84,000 for every punt until the end of his contract in 2029 – based on his 2024-25 number of 72 punts for the season.\n\nAustralia Michael Dickson has extended his contract with the Seattle Seahawks for another four years. Credit: AP\n\nDickson’s contract surpasses that of Jacksonville Jaguar Logan Cooke, who was set to become the league’s best-paid punter two days ago, with his four-year contract extension speculated to be worth about $6.15 million a season.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/questions-over-future-of-aukus-deal-after-us-review-announced-midday-news-bulletin-12-june-2025/a7pzd2j9q",
        "title": "Questions over future of AUKUS deal after US review announced | Midday News Bulletin 12 June 2025",
        "publish_date": "Thu, 12 Jun 2025 01:59:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nDefence Minister Richard Marles has dismissed speculation the United States may back out of the AUKUS defence pact it holds with Australia and the UK.\n\n\n\n\n\nHe says it is important to stick to the plan to ensure the defence capability is acquired.\n\n\n\n\n\nThe Pentagon has launched a review of the agreement - signed in 2021 - to ensure it aligns with President Donald Trump's policy agenda.\n\n\n\n\n\nThe Opposition's spokesman for defence, Angus Taylor says actions must be taken to ensure the AUKUS deal is maintained.\n\n\n\n\n\nGreens defence spokesperson David Shoebridge says the US review shows the AUKUS deal makes Australia a junior partner in America's military strategy, not an equal ally.\n\n\n\n\n\n+++\n\n\n\n\n\nThe National Anti-Corruption Commission says there is no evidence of corrupt conduct in the settlement between Brittany Higgins and the federal government.\n\n\n\n\n\nThe commission says it found no corruption issue after an extensive preliminary investigation into the settlement, and that there was no inappropriate intervention by any minister.\n\n\n\n\n\nThe $2.4 million compensation settlement was reached in 2022 following allegations by Ms Higgins, a former political staffer to Linda Reynolds, that she had been raped by another staffer, Bruce Lehrmann, at Parliament House.\n\n\n\n\n\nMs Reynolds is currently suing the federal government over the settlement, alleging it did not act in her best interests during the settlement process.\n\n\n\n\n\nA civil court has found that on the balance of probabilities, Bruce Lehrmann raped Ms Higgins.\n\n\n\n\n\nHe has always denied the allegations and a criminal trial was aborted and charges later dropped.\n\n\n\n\n\n+++\n\n\n\n\n\nThe chief executive of Monash IVF has resigned, after the fertility clinic revealed a second instance of an error involving an embryo transfer - two months after the first mix-up.\n\n\n\n\n\nMichael Knaap, who had been the chief executive since 2019 has resigned.\n\n\n\n\n\nEarlier this week, in a statement to the stock exchange, Monash IVF revealed the mix-up took place on June 5 at its Melbourne laboratory.\n\n\n\n\n\n+++\n\n\n\n\n\nAn Australian sperm donor, caught up in a cyber security data breach, has told S-B-S he is unsure how he and his donor-conceived child will be affected.\n\n\n\n\n\nIsaac chose to use Genea Fertility, which was later hacked by cyber criminals in a data breach.\n\n\n\n\n\nThe family histories of medication and mental illness of some of the clinic's donors are now being shared on the dark web.\n\n\n\n\n\nIsaac says he is worried his own sensitive medical information could be weaponised.\n\n\n\n\n\nHis response has been voiced up by a journalist to protect his privacy:\n\n\n\n\n\n\"What happens if I get a job which is relatively high profile or dealing with sensitive activity, could this open me up to not getting employed because an employer might've found my internet history, and maybe they have had ethical concerns or concerns with my health record. It's taken away my agency and my choice to disclose that information if I want to. That's only compounded further by the lack of information that I've been provided about this investigation and the data breach.\"\n\n\n\n\n\nIn a statement, Genea told SBS its cyber teams and cybersecurity experts are working hard to understand the nature and extent of the data that has been published, and to identify affected individuals.\n\n\n\n\n\n+++\n\n\n\n\n\nTo sport and in test cricket,\n\n\n\n\n\nAustralia is leading against South Africa after day one at Lords in Britain, as part of the World Test Championships final.\n\n\n\n\n\nBatsman Steve Smith had a remarkable day, knocking up 66 to take his total runs at the grounds to a record-breaking 591 - the most runs by any overseas touring player in history.\n\n\n\n\n\nAustralia were in deep trouble in the early overs, but rallied after lunch time to lead.\n\n\n\n\n\nSmith says it was a great fightback from the team.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/brian-wilson-beach-boys-co-founder-dies-aged-82/l7wjo7sf3",
        "title": "Brian Wilson, Beach Boys co-founder, dies aged 82",
        "publish_date": "Wed, 11 Jun 2025 20:05:56 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Beach Boys co-founder Brian Wilson, who created some of rock's most enduring songs such as Good Vibrations and God Only Knows has died at the age of 82.\n\n\n\n\n\nWilson's family announced his death in a statement on the singer's website.\n\n\n\n\n\n\"We are at a loss for words right now,\" the statement said. \"We realise that we are sharing our grief with the world.\"\n\n\n\n\n\nThe statement did not disclose a cause of death.\n\n\n\n\n\nWilson had suffered from dementia and was unable to care for himself after his wife Melinda Wilson died in early 2024, prompting his family to put him under conservatorship.\n\n\n\n\n\nWilson was the eldest and last surviving of the three musical brothers who formed the United States rock band in 1961, alongside their cousin Mike Love and school friend Al Jardine.\n\n\n\nThe Beach Boys were driven by Brian Wilson's (left) prodigious songwriting, surf-influenced sound and frequent use of vocal harmonies. Source: Getty / Michael Ochs Archives The band, known for their vocal harmonies, signed with Capitol Records in 1962 and released their first album, Surfin' Safari, that same year.\n\n\n\nMusic a safe haven for Wilson\n\nWilson was born on 20 June 1942 and began playing the piano and teaching his brothers to sing harmony at a young age.\n\n\n\n\n\nMusic was a haven of safety and joy for Wilson after an upbringing in which he suffered abuse from his domineering father, who would go on to manage the group.\n\n\n\n\n\nThe Beach Boys started as a neighbourhood act, rehearsing in Wilson's bedroom and in the garage of their house in suburban Hawthorne, California.\n\n\n\n\n\nWilson played bass while his brother Dennis drummed and Carl played lead guitar. The band's work centred on Wilson's songwriting and arrangements.\n\n\n\nBrian Wilson performed regularly as a solo artist from 1999 to 2022. Source: Getty / Larry Hulst Their debut single, Surfin', became a minor hit upon its release in 1961 but was nothing compared with the success that followed from their second studio album, Surfin' USA, released in 1963.\n\n\n\n\n\nThe band's 1966 album Pet Sounds is considered by many to be their defining work — and is often cited as one of the greatest albums of all time.\n\n\n\n\n\nWilson's career would be derailed, though, as his drug use became untenable and his mental state, which would eventually be diagnosed as schizoaffective disorder with auditory hallucinations, grew shakier.\n\n\n\n\n\nSplitting from the band in the late 1990s, Wilson released several solo albums, including 2004's critically acclaimed Smile.\n\n\n\n\n\nWilson's brothers had both died by the time of the Beach Boys' 50th reunion tour in 2012, but he joined Love, who became the band's controlling force in its later years, for several shows\n\n\n\n\n\nThey were inducted into the Rock and Roll Hall of Fame in 1988 and received a Lifetime Achievement Grammy Award in 2001.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/choice-says-some-popular-sunscreens-dont-meet-spf-claims/cyaffvrcs",
        "title": "Some of your favourite sunscreens aren't up to their SPF claims, Choice says",
        "publish_date": "Wed, 11 Jun 2025 14:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Some of Australia's most popular sunscreens are not living up to their own SPF rating claims, according to consumer advocacy group Choice, after it tested 20 products and found only four met the advertised ratings.\n\n\n\n\n\nThe revelations have prompted one brand to review the SPF ratings of four of its products by an independent international laboratory, while others questioned the results and insisted their product claims were accurate.\n\n\n\n\n\nIn a new report published on Thursday, Choice said it tested 20 popular sunscreen products in a specialised lab. Volunteers had sunscreen applied to a specific area of skin before a 'solar simulator' was applied to that area, as well as an unprotected area, as a control method.\n\n\n\n\n\nAfter testing, Choice said it found only four products matched their SPF claims while 16 failed.\n\n\n\nSome of the products Choice said failed its test include:\n\n\n\n\n\n— Aldi Ombra Everyday Sunscreen Lotion 50+ — tested at 26\n\n\n\n\n\n— Banana Boat Baby Zinc Sunscreen Lotion SPF 50+ — tested at 28\n\n\n\n\n\n— Bondi Sands SPF 50+ Zinc Mineral Body Lotion — tested at 26\n\n\n\n\n\n— Cancer Council Everyday Value Sunscreen 50 — tested at 27\n\n\n\n\n\n— Cancer Council Ultra Sunscreen 50+ — tested at 24\n\n\n\n\n\n— Banana Boat Sport Sunscreen Lotion SPF 50+ — tested at 35\n\n\n\n\n\n— Neutrogena Sheer Zinc Dry-Touch Lotion SPF 50 — tested at 24\n\n\n\n\n\n— Woolworths Sunscreen Everyday Tube SPF 50+ — tested at 27\n\n\n\n\n\n—Nivea Sun Kids Ultra Protect and Play SPF 50+ — tested at 41\n\n\n\n\n\nBut the product that performed the worst in the test was Ultra Violette's Lean Screen SPF 50+ Mattifying Zinc Skinscreen, which returned an SPF of 4.\n\n\n\n\n\nChoice said it was so \"perturbed\" by the result that it did a second test to confirm the finding.\n\n\n\n\n\nChoice CEO Ashley de Silva said: \"We were really shocked to see the results for Ultra Violette's Lean Screen SPF 50+ product, so much so that we actually decided to test a different batch at a completely different lab in Germany to confirm the results.\"\n\n\n\n\n\n\"Those tests found the product had an SPF of 5 — an almost identical result to our initial testing.\"\n\n\n\n\n\nSPF stands for Sun Protection Factor. The higher the number, the fewer UV rays reach the skin.\n\n\n\nOn the other hand, the four sunscreens Choice said met its SPF claims were:\n\n\n\n\n\n— La Roche-Posay Anthelios Wet Skin Sunscreen SPF 50+ — tested at 72.\n\n\n\n\n\n— Neutrogena Ultra Sheer Body Lotion SPF 50 — tested at 56.\n\n\n\n\n\n— Cancer Council Kid Sunscreen 50+ — tested at 52.\n\n\n\n\n\n— Mecca Cosmetica To Save Body SPF 50+ Hydrating Sunscreen — tested at 51.\n\n\n\nSunscreen companies stand by their products\n\nUltra Violette said it did not accept the results of its tested product as \"even remotely accurate\", questioning the methodology of the test. It said its Lean Screen product contained 22.75 per cent zinc oxide and that the SPF result of 4 was \"scientifically impossible\".\n\n\n\n\n\n\"We find this study counterintuitive and not at all in the best interest of consumers,\" it said in a response published by Choice.\n\n\n\n\n\nCancer Council Australia — which had three products including Kids Clear Zinc 50+, Everyday Value Sunscreen 50 and Ultra Sunscreen 50+, fail Choice's test — said it was \"very concerned\" by the findings but stood by its own test results.\n\n\n\n\n\n\"We can confirm that we hold SPF test results from our product sponsor for each of the products Choice has tested, all of which show compliance with their labelled SPF rating,\" a spokesperson told SBS News.\n\n\n\nREAD MORE Consumer watchdog alleges Optus pressured vulnerable customers into sales\n\n\"Noting the test results published by Choice and out of an abundance of caution, we have submitted the four referenced products for further testing by an independent international laboratory. All necessary actions to any findings will be implemented,\" the spokesperson said.\n\n\n\n\n\nThe responses of other companies were published by Choice.\n\n\n\n\n\nAldi and Coles said they requested the results for further investigation, Banana Boat said its sunscreens met the requirements set out by the medicines regulator, Therapeutic Goods Administration (TGA), while others, including Bondi Sands, said they disagreed with the Choice assessment.\n\n\n\n\n\nChoice called on the TGA to undergo its own compliance tests and the consumer watchdog, the Australian Competition and Consumer Commission, to investigate any misleading SPF claims.\n\n\n\nREAD MORE Watchdog unveils proposal to end supermarket price-gouging, shrinkflation\n\nRegulator says it's investigating\n\nThe TGA said it was investigating the Choice findings and will take regulatory action as required.\n\n\n\n\n\nIt said there could be variability in SPF testing results across laboratories, due to the reliance on human subject testing.\n\n\n\n\n\nIt said a number of the Choice-tested products returned results in the range of SPF 30, which provide \"high protection\" and are effective.\n\n\n\n\n\n\"Given Australia's high incidence of skin cancer, the TGA reiterates that using sunscreen is an important measure to prevent harmful effects of ultraviolet radiation, in addition to seeking shade, wearing a wide-brimmed hat, wearing protective clothing and using sunglasses.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/socceroos-look-to-2026-after-sealing-world-cup-qualification/000whzbzw",
        "title": "Socceroos look to 2026 after sealing World Cup qualification",
        "publish_date": "Wed, 11 Jun 2025 09:12:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nOnce rare now routine but never to be taken for granted.\n\n\n\n\n\nWorld Cup qualification has been achieved by the Socceroos for a sixth consecutive time.\n\n\n\n\n\nAustralia's two goals to one defeat of Saudi Arabia in Jeddah on the last matchday of stage three guarantees them second place in Group C, and a spot in next year's World Cup without having to go through one of the playoff rounds.\n\n\n\n\n\nAfter their last-gasp win over Japan in Perth last week, they only needed to avoid defeat by five goals or more to book their place.\n\n\n\n\n\nBut perspective is required here.\n\n\n\n\n\nBooking a place at all was a result that was in some jeopardy when Tony Popovic was appointed coach in the wake of Graham Arnold's resignation nine months ago.\n\n\n\n\n\nPopovic, a former Socceroo himself, is proud to have turned that dream into reality.\n\n\n\n\n\n\"It's not something you see happening. When you're young, you dream of these things. And to be standing here, I'm very honoured with the responsibility, and I feel privileged to have this role.\"\n\n\n\n\n\nIt's a tale of individual redemption, not just that of the team.\n\n\n\n\n\nThe often-criticised striker Mitchell Duke scored the winning goal against the Saudi squad.\n\n\n\n\n\nHis typically Australian reaction to that twist of fate is also typical of the Socceroos with his determination to get back at those who doubt him.\n\n\n\n\n\n\" I wasn't even supposed to be here, to honest. Mat Leckie got injured, and I was a late call-up. Got the voodoo doll out and maybe injured Leckie! Nah...sorry, mate! But it feels good, and probably a good way to silence some of the keyboard warriors as well. Feels good.\"\n\n\n\n\n\nWith a spot in the 2026 World Cup secure, thoughts now turn, naturally, to 2026, and the tournament, which has now been expanded to 48 teams, and is set to be co-hosted between the United States, Canada, and Mexico.\n\n\n\n\n\nCaptain Mat Ryan is leading the way in dreaming of North America.\n\n\n\n\n\n\"We're going to enjoy, obviously, tonight, and that direct qualification now. And come, maybe not tomorrow, but in week's time or little bit longer, the prep starts for the next goal we set ourselves.\"\n\n\n\n\n\nBut, in looking forward, sometimes you can't help looking back.\n\n\n\n\n\nAnd that glance in the rear-view mirror is more than pleasant for the Socceroos, who inspired the nation with victories over Denmark and Tunisia at the last World Cup in 2022, making the knockout stage for just the second time.\n\n\n\n\n\nDefender Milos Degenek was there in 2022... and is looking to build on that legacy.\n\n\n\n\n\n\"It's going to be special. There's obviously going to be a lot of Australian people supporting us in the games. But for the people who don't make it, who do stay home, hopefully we can create memories similar, and if not better than the ones we created in Qatar.\"\n\n\n\n\n\nEven in an expanded tournament where 32 teams will make the knockout stage, Australia's football will need to further improve if they are to make the desired splash in 2026.\n\n\n\n\n\nPopovic says, with qualification now achieved, the truly hard work begins.\n\n\n\n\n\n\"Yeah, well, we have some plans obviously for September with some games. And then there;s a plan moving forward now that we know we've definitely gone throigh, we're not in the playoffs. We've got some different plans in october that we've been working on. So, it's exciting.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/jetstar-asia-to-close-asx200-hits-another-record-despite-slowing-global-growth/jyz1hzxu9",
        "title": "Jetstar Asia to close & ASX200 hits another record despite slowing global growth",
        "publish_date": "Wed, 11 Jun 2025 09:04:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-persistent-employment-struggles-of-refugees/nnu6u3845",
        "title": "INTERVIEW: The persistent employment struggles of refugees",
        "publish_date": "Wed, 11 Jun 2025 08:44:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/islamic-preacher-wasnt-calling-all-jews-vile-and-treacherous-court-told/2es0uia7a",
        "title": "Islamic preacher wasn't calling all Jews 'vile' and 'treacherous', court told",
        "publish_date": "Wed, 11 Jun 2025 08:32:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Sydney-based Islamic preacher wasn't referring to all Jewish people when he made allegedly inflammatory remarks in a series of speeches, a court has heard.\n\n\n\n\n\nWissam Haddad took the stand in the Federal Court on Wednesday in a case brought by the nation's peak Jewish body, the Executive Council of Australian Jewry's (ECAJ) co-CEO Peter Wertheim and deputy president Robert Goot.\n\n\n\n\n\nThey allege remarks made in these speeches, which came in the wake of Hamas' October 7 2023 attack on Israel , contain \"gratuitous insults and antisemitic tropes\" and have breached the Racial Discrimination Act.\n\n\n\n\n\nHaddad denies the breach.\n\n\n\n\n\nThe court heard that Haddad, in a lecture series titled The Jews of Al Madina, referred to Jews as \"vile\", treacherous\", \"descended from apes and pigs\", and \"hiding like the rats that they are\".\n\n\n\n\n\nUnder cross-examination, Haddad told the court he spoke about references to Jews in the Quran and Hadith at the time of the Prophet Muhammad, because \"the events that took place … those certain events are still taking place now in Israel or Palestine\".\n\n\n\n\n\nHe said he was referring to \"Jews of faith, not ethnicity\", and quoting religious scriptures with stories about interactions between Jewish and Muslim people in the 7th century.\n\n\n\n\n\nCounsel representing the ECAJ, Peter Braham SC, asked Haddad if his \"intent was to describe the eternal character of the Jewish people\".\n\n\n\n\n\nHaddad denied that he did, saying: \"I was talking about the Jewish people that are in power in Israel.\"\n\n\n\n\n\nHaddad was grilled about why he said in one speech \"there is no difference\" between Zionists and Jews.\n\n\n\n\n\n\"There is no such thing as Zionists at the time of the Prophet\", Haddad said.\n\n\n\n\n\nHe said it was not his intent to describe all Jews as \"mischievous\" or \"murderous\", but said it is acceptable to say those words if they are written in religious scriptures.\n\n\n\nExecutive Council of Australian Jewry deputy president and barrister Robert Goot (centre), and Executive Council of Australian Jewry co-CEO Peter Wertheim (right) arriving at the Federal Court during the first day of the trial on Monday. Source: AAP / Bianca De Marchi\n\nKey legal question: Were Haddad's comments public or private?\n\nThe case before Justice Angus Stewart centres on five speeches made by Haddad, also known as Abu Ousayd, from November 2023 at the Al Madina Dawah Centre in Bankstown, which he co-founded, and later posted online where they have received thousands of views.\n\n\n\n\n\nApplicants Wertheim and Goot are seeking the removal of the allegedly racist speeches and injunctive relief to prevent Haddad from engaging in similar activity.\n\n\n\n\n\nTo prove a breach of the Racial Discrimination Act, the applicant’s lawyers must establish the speeches were made \"otherwise than in private\".\n\n\n\n\n\nHaddad was questioned by Braham about the context in which he gave the speeches and the various social media accounts connected with the Al Madina Dawah Centre and Haddad in a personal capacity.\n\n\n\n\n\nThe court heard Haddad has around 10,000 followers of an Instagram account under the name Abu Ousayd, and the Al Madina Dawah Centre has had and promoted social media accounts including Facebook, YouTube, Telegram, Rumble and Soundcloud.\n\n\n\n\n\nWhen asked by Braham, Haddad agreed that \"one of the purposes the sound and video recordings were being made was to allow publication on the YouTube channel\", but denied he had any personal involvement in uploading the videos.\n\n\n\n\n\nHaddad’s barrister, Andrew Boe, argues, Haddad’s acts were private as he was speaking to a \"Muslim audience\", and Jewish Australians only saw Haddad’s remarks through the mainstream media, or on a social media outlet \"dedicated to publishing antisemitic content\".\n\n\n\n\n\nBraham defended his line of questioning, following an objection by Boe.\n\n\n\n\n\n\"A very large part of the respondent’s case is that these speeches were delivered in private to a purely Muslim audience, and it wasn't reasonably likely they would come to the attention of the broader community,\" Braham told Justice Stewart.\n\n\n\n\n\n\"That is absolutely not how this man has run his life … just about everything that happens at the Al Madina Dawah Centre is designed and calculated for public consumption and to create or attract controversy.\"\n\n\n\n\n\nBraham questioned Haddad about the Al Madina Dawah Centre’s YouTube account being taken down from time to time, and the court heard the account has \"never been reopened\" after \"the speeches, the subject of these proceedings, went up onto [YouTube] in November 2023.\n\n\n\n\n\nHaddad was also asked about comments he made about other religions before 7 October 2023.\n\n\n\n\n\n\"Do you remember describing Hindus as worshippers of cows and monkeys?\" Braham asked.\n\n\n\n\n\nHaddad responded: \"Yes.\"\n\n\n\n\n\n\"You recognise seeing in mid-April 2023 on MEMRI TV, an article and video showing you describing Jews as descendants of pigs and monkeys and Hindus as being worshippers of cows and monkeys?\" Braham asked.\n\n\n\n\n\nHaddad responded: \"Yes\".\n\n\n\n'Perceived as antisemitic'\n\nHaddad’s lawyers argue his comments about Jewish people have not been heard in their entirety and, taken out of context, were \"perceived to be antisemitic\" by members of the Jewish community.\n\n\n\n\n\nThe court heard from a series of lay witnesses from Australia’s Jewish community who were cross-examined about how Haddad’s speeches first came to their attention and their feelings of safety in Australia as Jewish people.\n\n\n\n\n\nOne witness, Robert Kaye, said he first formed the opinion Haddad expressed antisemitic views and was inciting violence against Jews through media reports.\n\n\n\n\n\n\"I didn't see the speeches as they were delivered, only the reporting of them,\" Kaye said.\n\n\n\n\n\n\"The first time I saw reference to the speeches or quotes from them was when I read extracts in The Australian newspaper.\"\n\n\n\n\n\nAnother witness, who cannot be named for legal reasons, said he also first became aware of Haddad’s speeches from articles in The Australian.\n\n\n\n\n\n\"That caused you to form the view that Mr Haddad was an extremist … and a supporter and friend of terrorists, is that correct?\" Boe asked.\n\n\n\n\n\nThe witness agreed that he then formed the view that characterisation was true.\n\n\n\n\n\nThe trial continues.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/heres-what-new-buy-now-pay-later-regulations-mean-for-you/sb1ce7n2k",
        "title": "Here's what new Buy Now, Pay Later regulations mean for you",
        "publish_date": "Wed, 11 Jun 2025 07:47:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFor millions of Australians, Buy Now, Pay Later providers like Afterpay or Zip have become a common tool to take the pain out of purchases by breaking the cost of goods or services into smaller chunks paid over several weeks.\n\n\n\n\n\nWhile their products are new, their model is a different take on a more traditional lay-by agreement, where a customer would pay off a larger purchase in two or more payments, receiving the object after paying the whole of the sum.\n\n\n\n\n\nProducts like Afterpay flip the scheme on its head, giving customers the goods or service up front and letting them delay the costs.\n\n\n\n\n\nBut, until now, these credit products have managed to evade government regulation for over a decade.\n\n\n\n\n\n“Today is a positive day for Australian consumers with the law now treating Buy Now, Pay Later as what it really is: it's credit. The reason why it's taken so long is by now pay later providers had taken advantage of a loophole in the law that ensured that they didn't get covered by the credit laws that apply to all other credit, including credit cards and mortgages and the like.\"\n\n\n\nLISTEN TO How low financial literacy is exposing migrant youths in Australia to scams and risky spending SBS News 15/03/2025 08:36 Play\n\nThat's Drew MacRae, Senior policy and advocacy officer at the Financial Rights Legal Centre.\n\n\n\n\n\nAs of Tuesday, the 10th June, strict new regulations from the Albanese government have come into play with Buy Now, Pay Later providers now treated similarly to a credit card.\n\n\n\n\n\nThe new laws require providers to hold an Australian credit licence, comply with existing credit laws, and have also established a new category of low-cost credit under the Credit Act.\n\n\n\n\n\nSo, if you're curious about these products or if you're one of the estimated 41 per cent of Australians who've used them already in the last six months, according to a Finder survey - you may be wondering how these regulations will affect you.\n\n\n\n\n\n\"They have responsible lending obligations so the laws are being introduced to ensure that they take the steps they need to be assured that you can afford the credit that they're providing.\"\n\n\n\n\n\nMichael Saadat, International Head of Public Policy at Afterpay, says this means for new users there will now be additional checks and balances before they can pay for products with their service.\n\n\n\n\n\n“Anyone who's applying for an Afterpay account will be asked to agree to a credit check and will be asked to provide some additional information as part of the application process. So that's already live and it's working well. And that credit check will assist Afterpay in determining what spending limits should be allocated to the customer.”\n\n\n\n\n\nDr Domenique Meyrick, co-CEO of Financial Counselling Australia, says there will also be new protections for those struggling with making their payments.\n\n\n\n\n\n\"The other big change is that it means that consumers have a right to ask for hardship if they're having difficulty making payments and they can complain to the Financial Ombudsman, AFCA or the Australian Financial Complaints Authority. And then the final thing it means is that credit checks will be done. And so, when you use Buy Now, Pay Later, it might show up on your credit report.\"\n\n\n\n\n\nThis last change means that your Buy Now, Pay Later debts could impact your credit score.\n\n\n\n\n\nWhile using the service responsibly can offer an opportunity to build a positive credit score, missed or late payments may affect a customer's future borrowing capacity for a house or a car.\n\n\n\n\n\nMr MacRae from the Financial Rights Legal Centre says customers should make sure they're not accepting a higher spending limit than they require as some providers may display the full amount on the user's credit report.\n\n\n\n\n\n\"Understand that these products will now be listed on your credit report. So, it means that if you're being offered say $4,000 for a Buy Now Pay Later facility for something that you wanted to buy use to buy $150 pair of jeans, the full amount will be on your credit report, that $4,000. So it's important to engage upfront whether you need that higher limit. If you don't need it, don't take it and make sure your Buy Now Pay Later limit is right for you and your needs.\"\n\n\n\n\n\nConsumer advocates like Dr Meyrick say the new checks and balances provided by these regulations have been a long time coming.\n\n\n\n\n\n\"Almost as soon as by now pay later products emerged onto the scene, financial counsellors started seeing people getting into trouble with them. We've been calling for a really long time for some protections in place.\"\n\n\n\n\n\nCritics have long argued that products like Afterpay could encourage consumers to be flippant with using money they don't have and could lead vulnerable people into lasting debt.\n\n\n\n\n\nHowever, Afterpay's Michael Saadat says their customers are overwhelmingly responsible with their debts and he argues there are significant guard-rails in place to avoid harm.\n\n\n\n\n\n\"I guess the biggest difference is that a product like Afterpay is completely interest free. So unlike traditional credit products like credit cards, there's no risk that a consumer will end up in a spiral of revolving debt that's incurring interest rates of 20 per cent or more. Every transaction is four instalments. It's really straightforward. You're never charged interest and if you miss a repayment, you can't actually use Afterpay to spend again until you pay back the amount that's overdue.\"\n\n\n\n\n\nThe element not mentioned here are Afterpay's late fees, which have historically represented upwards of 20 per cent of their annual revenue.\n\n\n\n\n\nIf you miss an Afterpay payment you will be subject to a fee of up to 25 per cent of the cost of the order.\n\n\n\n\n\nWhile this sum may not be much, Dr Domenique Meyrick of Financial Counselling Australia says costs can compound when vulnerable people are using several Buy Now, Pay Later providers at once.\n\n\n\n\n\n\"You see people who are using buy now pay later products for everyday items. They'll have multiple buy now, pay later products on the go at once. It's very hard to track. There's late fees accumulating.\"\n\n\n\n\n\nVicki Penner, Queensland manager of the Salvation Army's Moneycare team, says - prior to this regulation - she would see clients use Buy Now, Pay Later products lost in a debt spiral.\n\n\n\n\n\n\"Recently, one of our clients came in working hard, finding it hard to make ends meet. That's when he started to use Buy Now, Pay Later to fill the gap. He thought it was like a one-off time, but the next pay cycle, the same thing happened. So he continued to use the Buy Now, Pay Later, and eventually what happened was he maxed out his accounts and opened up another to cover the first repayment. This cycle actually continued until he had six Buy Now, Pay Later accounts. That's when it became unmanageable.\"\n\n\n\n\n\nShe believes the new regulation will do much to protect those at risk of accruing severe debt.\n\n\n\n\n\n\"Buy Now, Pay Later debt doesn't always come from poor choices, but it actually creeps up quietly and these reforms are here to catch those risks a lot earlier.\"\n\n\n\n\n\nWhile consumer advocates have welcomed the transparency and accountability that regulation has brought the Buy Now, Pay Later sector, many argue there's room for further reform.\n\n\n\n\n\nDrew MacRae from the Financial Rights Legal Center says these changes don't address the issue of customers using several products concurrently and potentially generating significant debt through these providers.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-occupational-downgrade-problem-and-who-its-hurting/ihgfyhawu",
        "title": "Australia's 'occupational downgrade' problem — and who it's hurting",
        "publish_date": "Wed, 11 Jun 2025 07:04:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "A decade after arriving in Australia, many refugees who were working as managers and professionals in their home countries are still struggling to find the same level of work.\n\n\n\n\n\nThey are experiencing an \"occupational downgrade\", according to a new report by the Australian Institute of Family Studies (AIFS).\n\n\n\n\n\nThe findings add to existing knowledge about the challenges refugees in Australia can face in gaining a foothold in the labour market.\n\n\n\n\n\nLead author of the report, John van Kooy, told SBS News: \"We looked at the jobs they were doing before they arrived in Australia and the jobs they've been able to secure, or go for, in Australia over that 10-year period. What we found was a major drop off.\"\n\n\n\n\"We're calling it occupational downgrading, which basically means for those that were working in professional and managerial roles prior to coming to Australia — in sectors like business, human resources and IT — many of those individuals, even after 10 years of permanent residency in Australia, weren't able to find the same level of employment or occupational status,\" van Kooy said.\n\n\n\n\n\nAround 2,400 humanitarian migrants were surveyed over a 10-year period from when their first visas were granted in 2013. Most of the participants were from Iraq, Afghanistan, Iran and Myanmar — reflecting the humanitarian intake that year.\n\n\n\n\n\nIt's part of what AIFS cites as the largest longitudinal study of this cohort of migrants in Australia, capturing post-humanitarian arrival and settlement support over a longer term.\n\n\n\nA starker 'occupational downgrade' for women\n\nAccording to the study, 30 per cent of employed women and 19 per cent of employed men had worked in managerial or professional roles before arriving in Australia. That dropped to 17 and 10 per cent respectively after 10 years of residency.\n\n\n\nOnly half of the men working in their home country in business, human resources, marketing and ICT (information and communications technology) were working as technicians, tradespeople or machinery operators after a decade of residence in Australia.\n\n\n\n\n\nThe \"occupational downgrade\" was starker for women.\n\n\n\n\n\nOver two-thirds (67 per cent) of women who had been managers or professionals in their home countries were not in paid work in Australia. The remaining women were mostly carers, cleaners, education aides or sales assistants.\n\n\n\nVan Kooy said women who were part of families with children under five years old were 84 per cent less likely to be in employment compared to men over that period.\n\n\n\n\n\nThe study found 39 per cent of women and 63 per cent of men were in the labour force 10 years after arriving in Australia. Of those that weren't, 33 per cent and 41 per cent indicated they wanted a job.\n\n\n\n\n\nHe said refugees can face various challenges, including language barriers — with those who were quickly able to acquire English language skills being more able to enter the labour force earlier — along with the recognition of skills and qualifications in Australia.\n\n\n\nA 'billion-dollar benefit'\n\nThe AIFS study references a 2024 report from Settlement Services Australia (SSI), a national not-for-profit service provider, which estimated the country's economy would benefit from a $9 billion annual boost if migrants and refugees worked in jobs that matched their full skill set.\n\n\n\n\n\nDane Moores, SSI's head of strategic relations, said almost half of permanent migrants in Australia work below their skill level — and humanitarian entrants were more likely to have their skills underutilised.\n\n\n\n\n\n\"Many refugees arrive in Australia with years of professional experience and valuable skills, but they face a system that devalues their expertise and puts up unnecessary roadblocks to formally recognising their qualifications,\" he said.\n\n\n\n\n\n\"In addition to having remarkable personal qualities like resilience and determination, professionals from refugee backgrounds bring skills we urgently need — in health, education, engineering and more. Yet many of these skills are currently being wasted.\"\n\n\n\nVan Kooy said the skills and qualification recognition system in Australia has improved, but \"there is still work to be done\".\n\n\n\n\n\nThe federal government made significant changes to Australia's migration system last year, which, in part, aimed to target skilled migration to address workforce shortages.\n\n\n\n'We're all losing out'\n\nVan Kooy said the new study shows a \"significant number\" of refugees who come to Australia with high skill levels, experience and qualifications — along with the time it can take to break into the labour market.\n\n\n\n\n\n\"Any time we under-utilise those qualifications, or those individuals aren't able to access the same level of employment or pursue their career aspirations, then we're all losing out,\" he said.\n\n\n\n\n\n\"It is a long-term investment, and a long-term journey that we need to be going along with people.\n\n\n\n\n\n\"Settlement is not something that happens in a two to three-year period, just after people arrive. It's a lifelong experience, and I think we need to work with that timeframe in mind.\"\n\n\n\nAcknowledging refugees have a diverse range of experiences and backgrounds, van Kooy said many show personal resilience in their journey to Australia.\n\n\n\n\n\n\"Refugees have been through traumatic journeys — often prolonged time spent in transit countries or camp situations. By the time they arrive in Australia, they have that accumulation of experience and resilience that can be an asset in terms of the economy,\" he said.\n\n\n\n\n\n\"It can also lead to difficulties for individuals who have experienced traumatic events.\"\n\n\n\n\n\nNevertheless, van Kooy said over one-fifth of the study participants started their own business or ended up in self-employment over the 10-year period, which is higher than the rate of self-employment for the Australian-born population.\n\n\n\n\n\nThis could partly be due to difficulties in accessing the open labour market.\n\n\n\n\n\n\"But it does show that the refugee cohort is resilient, and they will do what they need to do to earn income and support their families, and get ahead in Australia.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/a-curfew-announced-in-los-angeles-after-days-of-protests/gm3i5kkvf",
        "title": "A curfew announced in Los Angeles after days of protests",
        "publish_date": "Wed, 11 Jun 2025 06:12:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/syria-orders-women-to-wear-burkinis-decent-swimsuits-on-public-beaches/9tm01l99i",
        "title": "Syria orders women to wear burkinis, 'decent' swimsuits on public beaches",
        "publish_date": "Wed, 11 Jun 2025 05:42:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Syria's new Islamist authorities said women going to public beaches must wear burkinis or other \"decent\" clothes that cover the body.\n\n\n\n\n\nSix months after Islamist-led forces toppled longtime Syrian ruler Bashar al-Assad , the country's tourism ministry announced in a statement beachgoers must wear \"more decent\" clothes, citing the \"public's interest\" as a reason.\n\n\n\n\n\nWomen must wear \"burkinis or swimwear that covers more of the body\" on public beaches, the statement said.\n\n\n\n\n\nOutside of swimming areas, women must wear loose-fitting clothing while men are not allowed to be topless.\n\n\n\n\n\nPrivate beach clubs and venues considered \"luxurious\" by authorities do not have to abide by the new rules, with the tourism ministry saying \"Western swimsuits are allowed\" there within the limits of \"general morals\".\n\n\n\nOther private establishments must follow the modesty rules.\n\n\n\n\n\nGenerally, while out in public, Syrians are asked to \"wear loose clothing, cover the shoulders and knees and avoid transparent and tight clothing\", according to the ministry's statement, which did not specify if and how the rules may be enforced.\n\n\n\n\n\nThe announcement drew mixed reactions from social media users, adding to concerns among some Syrians about their personal freedoms under the new authorities, who took power in December.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-11-june-2025/oc46zellh",
        "title": "SBS News in Easy English 11 June 2025",
        "publish_date": "Wed, 11 Jun 2025 04:31:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "TRANSCRIPT\n\n\n\n\n\nWelcome to SBS News in Easy English, I'm Biwa Kwan.\n\n\n\n\n\nMajor construction is now complete at Sydney's new 24 hour airport in Badgerys Creek, ahead of its opening in 2026.\n\n\n\n\n\nThe airport is only the second to be built in Australia in the past 50 years, and was first promised in 1946 and then again in 1986.\n\n\n\n\n\nWestern Sydney International Airport CEO Simon Hickey says testing will now begin on the runway to ensure it is ready for passengers and cargo freight next year.\n\n\n\n\n\nPrime Minister Anthony Albanese says he is confident the project will be completed smoothly and become a major draw card for economic growth.\n\n\n\n\n\n\"What we know is that the centre of population is here in Western Sydney. And what this airport will do - not just a runway or terminal, but the aerotropolis that will grow around with it the Bradfield city - is to be a catalyst for economic activity. And for Sydney to look out - not just in. And that is why this is vision is so important.\"\n\n\n\n\n\n+++\n\n\n\n\n\nQantas has announced it is closing down Jetstar Asia by the end of July, following years of financial losses.\n\n\n\n\n\nIt says 13 planes used by Jetstar Asia will be redeployed across Australia and New Zealand, creating 100 jobs.\n\n\n\n\n\nAn estimated 500 jobs will be lost in the closure.\n\n\n\n\n\n+++\n\n\n\n\n\nAustralia has joined the UK, Canada, New Zealand and Norway in announcing financial sanctions and travel bans for two Israeli government ministers.\n\n\n\n\n\nForeign Minister Penny Wong has confirmed the sanctions apply to Israel's National Security Minister and Finance Minister.\n\n\n\n\n\nShe says they have encouraged extremist actions that have led to grave human rights violations against Palestinians.\n\n\n\n\n\nIsrael's foreign minister, Gideon Saar, says the action is outrageous - and the government has set a special meeting for early next week to decide how to respond.\n\n\n\n\n\nThe US has also condemned the sanctions.\n\n\n\n\n\nFormer Palestinian Ambassador to Australia Izzat Abdulhadi told SBS Arabic he welcomes the announcement from the Albanese government - and thinks it should go even further.\n\n\n\n\n\n\"I call on the Australian government to impose sanctions on Israeli government not just those two members of the government. Also, I call on the Australian government to recognise the state of Palestine immediately in the forthcoming peace conference to be held in New York frm 17th to 20th June of this year.\"\n\n\n\n\n\nWorld leaders and diplomats will meet in in New York later this month to discuss the issue of Palestinian statehood.\n\n\n\n\n\n+++\n\n\n\n\n\nAustria is mourning the victims of a school shooting.\n\n\n\n\n\nThe city of Graz has already held a memorial service for the 10 people killed by the 21-year-old gunman, identified by Interior Minister Gerhard Karner as a former pupil at the school who had not completed his studies.\n\n\n\n\n\nThree days of mourning have been declared in Austria.\n\n\n\n\n\nEuropean Commission President Ursula von der Leyen is among the world leaders to express their shock over the mass shooting.\n\n\n\n\n\n\"Today, my thoughts are with the families of the dead and injured, with their friends and relatives. Schools are symbols of hope in the future and youth. It's very hard to bear when schools become the scene for violence and death. I mourn today with Austria.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn football, the Socceroos have achieved automatic World Cup finals qualification for the first time in 12 years.\n\n\n\n\n\nThe team beat Saudi Arabia 2-1 in Jeddah.\n\n\n\n\n\nExactly a year before the start of next year's finals in the US, Canada and Mexico, Australia qualify in the second automatic spot - behind Japan and ahead of Saudi Arabia.\n\n\n\n\n\nCoach Tony Popovic has said he is happy with the team's result, but won't let them get complacent.\n\n\n\n\n\n\"It's not easy. And to show that character and resilience and then quality to come back and take the lead and win the game, so I'm delighted, and you know, we've built a good foundation now and we want to really get better and get better and kick on and try and do something special at the World Cup.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/manning-icac-inquiry-live-updates-former-head-of-school-infrastructure-nsw-to-appear-20250612-p5m6uj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Manning ICAC inquiry LIVE updates: Former head of School Infrastructure NSW to appear",
        "publish_date": "Thu, 12 Jun 2025 11:59:23 +1000",
        "category": "finance",
        "authors": [
            "Michael Mcgowan",
            "Michael Ruffles"
        ],
        "text": "Hello and welcome to our live coverage of the NSW Independent Commission Against Corruption’s public hearing in the investigation of School Infrastructure NSW. After nearly six weeks, the key subject of the inquiry, Anthony Manning, is due to give evidence from 11.50am.\n\nManning was the first chief executive of School Infrastructure NSW, a government agency within the Department of Education set up in 2017 under the previous government to manage what was forecast to be a $2.6 billion investment in school building over the following four years. He left the role in February last year.\n\nFormer NSW Schools Infrastructure chief Anthony Manning, pictured here at budget estimates in 2023, is a key subject of the ICAC’s public inquiry. Credit: Janie Barrett\n\nThere are two main allegations, which were outlined on day one. The first is whether Manning and others used their official functions to subvert “appropriate recruitment practices to benefit friends and business associates”, improperly award contracts worth millions of dollars and misallocate funds from school projects.\n\nThe second allegation is whether Manning, School Infrastructure human resource strategic adviser Wendy O’Brien and others engaged in reprisal actions against staff who made complaints.\n\nThis will be the first chance to hear from Manning. His previous barrister, Tim Hale SC, had raised concerns earlier in the hearing that the arguments against Manning were “relatively unspecific”. “There is extreme doubt certainly from my client’s point of view what actually is being alleged to be the corrupt conduct,” he said.\n\nThe ICAC’s livestream can be viewed here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/we-are-about-to-find-out-the-cost-of-the-trump-chaos-20250612-p5m6u0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "We are about to find out the cost of the Trump chaos",
        "publish_date": "Thu, 12 Jun 2025 11:58:22 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The March surge has been attributed to “front-loading,” or importers rushing to build their inventories before the broader Trump tariffs, announced on April 2, which Trump labelled “Liberation Day,” could take effect. The existence of those inflated stocks means the impact of the tariffs on prices for consumers would take some time to filter through to inflation data. There’s also a sense from the anecdotal evidence that companies are waiting for the dust to settle and a clearer picture of the final tariff settings to emerge before acting. Fed chair Jerome Powell. The central bank will want to wait until the full picture of the tariffs and the effect they have on the inflation numbers is fully reflected before cutting rates. Credit: AP The Fed’s “Beige Book” – a compilation of surveys undertaken by the 12 regional Fed banks, said last week that there had been “widespread” reports from companies that they expected costs and prices to rise at a faster rate, with some of the districts reporting that those survey expected the cost increases to be “strong, significant or substantial.” All the district reports, the Fed said, indicated that higher tariff rates were putting upward pressure on costs and prices and that the companies that planned to pass through tariff-related costs to customers expected to do so within three months.\n\nThat fits with what consumer-facing companies have been saying in their investor presentations and makes sense. They are saying that the tariffs are too material to be absorbed and will be passed on. Loading Allowing for the buffer provided by the front-loading of imports in March, the question mark over what will happen when the pause on the reciprocal tariffs ends and a reluctance of companies to increase prices and lose sales until they actually experience cost increases that they expect to persist, the impact of the tariffs could be expected to show up progressively over the rest of the year. Data over the next three to six months will better reflect the impacts of the tariffs. Nevertheless, there were some early indications that the effects of Trump’s earliest tariffs are showing up.\n\nThe prices of major appliances, for instance, jumped nearly 4.5 per cent last month. They were included in Trump’s February tariff announcements. The prices of perishables like bananas and vegetables, where supply can’t be front-loaded, rose significantly, as did toys, a segment China dominates. The price hikes in those categories were offset by a decline in the prices of new cars, a segment where the tariffs are expected to eventually have a substantial impact, eggs, gasoline and air fares. US oil prices have fallen more than 15 per cent this year amid a global glut of oil. West Texas Intermediate prices bottomed out around $US60 a barrel in May and are now trading around $US68 a barrel. Data over the next three to six months will better reflect the impacts of the tariffs on the US economy. Credit: Bloomberg The drop in airfares, which reflects a slump in demand, may have something to do with Trump’s immigration policies and the harsh treatment of visitors to the US by US Customs and Border Protection personnel.\n\nWhile the May data might appear benign, it is improbable that the Fed will heed Trump’s call for a percentage point cut to the federal funds rate when its Open Market Committee meets next week. The markets are assigning zero probability to a cut, although the odds on one in September improved from 60 per cent to 70 per cent after the inflation data was released. The Fed will want to wait until the full picture of the tariffs and the effect they have on the inflation numbers is fully reflected. It will also want to understand the dynamic between the tariffs’ impacts on prices and their impacts on the underlying economy. It is conceivable that the tariffs, the likely price increases associated with them and the uncertainty generated by the way they have been announced – they’ve evolved unpredictably and appear dependent on Trump’s volatile moods – will lead to materially lower US economic growth, which would reduce demand and blunt the inflationary impact of the tariffs. It’s also conceivable that the outcome could be shrinking growth and spiking inflation – stagflation – which would force the Fed to choose between combatting inflation or saving jobs. That’s why the safest course for the Fed at this point is to sit on its hands until it has more useful data.\n\nTrump, of course, has always advocated for lower interest rates and has routinely verbally assaulted the Fed chair, Jerome Powell, for not delivering them. He needs them more than ever, with the Congressional Budget Office saying his “One Big Beautiful Bill” – his budget bill – would add $US3 trillion to US government debt over the next decade if enacted in its current form. Trump, on his Truth Social platform, in posting his plea for the Fed to cut rates, added that the US “WOULD PAY MUCH LESS INTEREST ON DEBT COMING DUE. SO IMPORTANT!!!.” The Republicans are tearing themselves apart – fiscal conservatives versus the Trumpists – in negotiations over the bill. Lower debt-servicing costs would help his cause. It doesn’t seem to have occurred to Trump and his advisers that damaging the credibility of Powell and the Fed would be damaging to the US economy and markets and would be more likely to increase the perceived risk of investing in the US. The likelihood that the Fed will wait until at least September, if not later, before seriously contemplating a cut has led to new speculation that Trump will move to undermine Powell, reviving and refining a plan schemed up by Bessent during last year’s election campaign. Powell, whose term as chair of the Fed (but not as a governor) expires in May next year, can’t be removed by Trump. Bessent suggested that a “shadow” governor should be announced, one who would provide their own commentary on rates and inflation and, because they would be Powell’s successor, increasingly undermine Powell and the Fed’s credibility.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/freak-of-nature-why-wallabies-teammates-aren-t-among-the-tupou-doubters-20250611-p5m6og.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Freak of nature’: Why Wallabies teammates aren’t among the Tupou doubters",
        "publish_date": "Thu, 12 Jun 2025 11:58:00 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Will Taniela Tupou make the Wallabies team to play against the British and Irish Lions?\n\nRewind just a year ago and that’s a question few could have imagined being possible on the eve of the blockbuster Lions series.\n\nWith immense power and the dimensions of a tank, 150kg tighthead prop Tupou has been one of the Wallabies’ highest profile and most destructive stars during the past five years.\n\nBut struggling under the weight of expectation of a $1.2 million salary, a move to the Waratahs and several years of calf, Achilles and hamstring injuries, Tupou this year turned in his poorest Super Rugby season.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-commuters-react-to-bus-network-shake-up-20250611-p5m6i1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Burpengary storage facility engulfed in fire | Toll road laws passed in Parliament | Commuters react to bus network shake-up",
        "publish_date": "Thu, 12 Jun 2025 11:54:29 +1000",
        "category": "finance",
        "authors": [],
        "text": "There will be major changes to bus services in the Brisbane CBD over 10 weekends as part of testing for the new Adelaide Street tunnel, which will allow buses and metro vehicles to drive through it for the first time.\n\nOver 10 weekends, from June 20 to August 25, specialists will activate software systems, test lighting, ventilation and public announcements, and test the Adelaide Street tunnel under 70 different scenarios.\n\nTo allow testing, the inner-city busway tunnel systems will temporarily close on weekends with detours in place.\n\nThe Adelaide Street tunnel under construction. Credit: Brisbane City Council\n\nThe Queen Street, King George Square and Roma Street busway stations will close from the last service Friday night until 5am Monday.\n\nBuses that normally use the inner-city busway tunnel will detour at street level, and metro services will be operated by bus replacement services.\n\nSome services might arrive or depart up to six minutes earlier or later during works, and the Ezymart inside King George Square will not open during weekend works.\n\nTransport chair Ryan Murphy said when the tunnel opened, it would mean more services more often.\n\n“By moving more than 1390 services underground every day, we’re easing CBD congestion and freeing up space on city streets,” he said.\n\nThe Roma Street busway station will reopen from 4.30pm to midnight on Saturday, July 19 to support travel to and from the Wallabies vs British and Irish Lions game at Suncorp Stadium.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/four-more-years-free-agent-brayden-maynard-re-signs-with-collingwood-20250611-p5m6p2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Four more years: Free agent Brayden Maynard re-signs with Collingwood",
        "publish_date": "Thu, 12 Jun 2025 11:52:41 +1000",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Free agent Brayden Maynard has re-signed with Collingwood for four more years on a deal worth about $3.3 million.\n\nThe vice captain, considered the modern embodiment of the classic Collingwood player, a heart-and-soul figure extremely popular with the Collingwood fans, will be likely now to remain a Magpie for life.\n\nBrayden Maynard has re-signed with the Magpies for four more years. Credit: AFL Photos\n\nGiven the popularity of the tough defender, it always seemed unlikely Maynard would leave. But the arrival of two more half-back flankers in Dan Houston and Harry Perryman last off-season created the idea that Maynard could become surplus to requirements in a team searching for options to bring in a draft pick.\n\nMaynard’s form had been excellent this year regardless of the duo’s arrival and the fact he has carried a foot injury. His ruptured his plantar fascia a fortnight ago and will miss at least one more game after this week’s bye before returning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/the-brilliant-yet-troubled-life-of-the-beach-boys-damaged-genius-20250612-p5m6v0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The brilliant yet troubled life of the Beach Boys’ damaged genius",
        "publish_date": "Thu, 12 Jun 2025 11:50:24 +1000",
        "category": "lifestyle",
        "authors": [
            "Ben Sisario"
        ],
        "text": "Abandoned by Wilson, Smile entered rock lore as a lost document of a brilliant but troubled mind. Mike Love, the Beach Boys vocalist and longtime foil of Wilson’s, called it “a whole album of Brian’s madness”. It remained unfinished for nearly 40 years. Wilson’s life story came to be portrayed as a struggle to escape from the yokes of two men: his abusive father and a controlling psychotherapist, Eugene Landy. Landy’s unorthodox methods were effective in nursing Wilson back to health during two periods of treatment in the 1970s and ’80s. Yet Landy also went into business with his patient, sharing copyrights with Wilson and taking writing credits on some of his songs. Brian Wilson in 1965. Credit: Michael Ochs Archives/Getty Images Landy eventually came under the scrutiny of Californian authorities and surrendered his licence. After an intervention by Wilson’s family, a court order also blocked Landy from contact with Wilson. Wilson spoke openly about his struggles with mental illness, including his experience with schizoaffective disorder, a condition characterised by hallucinations and delusions. The condition led to the conservatorship granted to his business associates in early 2024.\n\nBrian Douglas Wilson was born June 20, 1942, in Inglewood, California, to Murry and Audree (Korthof) Wilson. His father was a heavy-machinery salesperson who had collected a handful of credits as a frustrated songwriter. His mother, a homemaker, kept the Beach Boys’ books in the early days of the band. The family moved to Hawthorne, California, when Brian was a toddler, and had two more boys, Dennis and Carl. Loading By 1961, the three Wilson boys were playing rock music with Love, a cousin, and a schoolmate of Brian’s, Al Jardine. Around that time, Dennis began surfing and delighted in the fashion, trendy lingo and carefree lifestyle that went along with it. One day he told Brian and Love, “You guys ought to write a song about surfing.”\n\nThey did, and that fall, the group recorded its first song, Surfin’. The young men called themselves the Pendletones, after a type of flannel shirt popular among surfers. When they received the finished record, released by a small local label, Candix, they discovered that they had been renamed the Beach Boys. Signed by Capitol Records in 1962, the group was prolific from the start, releasing 10 studio LPs through 1965. The Beach Boys in 1966 (from left): Al Jardine, Mike Love, Dennis Wilson, Brian Wilson and Carl Wilson. Credit: AP Wilson became the band’s primary producer and songwriter, and his sophistication soon shone through. Surfer Girl, a lilting, harmony-drenched ballad that went to No. 7 in 1963, was perhaps the first pop hit written, arranged, produced and sung by the same person. Wilson’s first No. 1, however, came as a writer of Jan and Dean’s song Surf City (1963). In a sign of conflicts to come, Murry Wilson, who managed the Beach Boys and controlled the band’s songwriting copyrights, was furious that Brian had given a valuable hit to another act.\n\nOther problems surfaced. Surfin’ U.S.A. resembled Chuck Berry’s Sweet Little Sixteen a bit too closely, so Berry’s name was added to the credits, and his publisher acquired the song’s copyright. In December 1964, Wilson married Marilyn Rovell, who sang in a girl group called the Honeys. A few weeks later, he had a panic attack on a flight to a Beach Boys engagement in Houston and decided to quit touring to concentrate on songwriting and recording. That same year, the group fired Murry Wilson as manager. As Brian Wilson would recount, his father had long tormented him. In one form of punishment, his father would remove his glass eye and force his son to stare into the empty socket. “My dad was violent,” Wilson wrote in a 2016 memoir, I Am Brian Wilson, written with Ben Greenman. “He was cruel.”\n\nFreed from his father’s control and the Beach Boys’ touring demands, Wilson immersed himself in the studio. Pet Sounds, released in May 1966, elevated the Beach Boys’ music to a level far above anything they had created before. With the rest of the group on the road, Wilson made the album primarily with studio musicians. Upon release, the album stalled at No. 10, a relative dud by Beach Boys standards. By then, however, Wilson was working on his next gem: the single Good Vibrations. The beach Boys: (from left) Bruce Johnston, David Marks, rear, Brian Wilson, Mike Love and Al Jardine in New York in 2012. Credit: Jason Decrow/Invision/AP Spliced together from months of sessions across four studios, Good Vibrations was a catchy and sonically adventurous invocation of peppy West Coast spirituality. Released in October 1966, the song became an indelible radio hit, but it was Wilson’s last moment at the vanguard of pop.\n\nWilson’s drug use, which had begun during happier times for the band, had grown out of control, stunting his creativity. “I lost interest in writing songs,” Wilson once told Rolling Stone. For about a year, starting in 1975, he was treated by Landy, whose methods included dousing his patient with cold water in the morning. He also limited his patient’s contact with others, including Wilson’s family, to underscore the therapist’s role as “the ultimate power in this situation,” as Landy once put it. Wilson continued to perform as part of the Beach Boys, but his behaviour was erratic and his drug use continued. In 1982, the Beach Boys kicked Wilson out of the group, and he returned to the care of Landy. His treatment, begun in seclusion in Hawaii, included a strict diet and vitamin regimen, with Wilson under constant supervision. Landy’s techniques raised eyebrows, but in Wilson’s case they seemed effective. When the singer made the press rounds in 1988 for his first solo album, Brian Wilson, he appeared fit, energetic and focused. Brian Wilson, left, and his second wife Melinda Ledbetter Wilson at the 55th annual Grammy Awards in 2013. Credit: Jordan Strauss/Invision/AP\n\nThe extent of Landy’s control over his patient, and his involvement in Wilson’s career, drew concern among Wilson’s family and people in the music industry. The two men started a business partnership, called Brains and Genius, that allowed Landy to draw profits from Wilson’s recordings, films and other ventures. Landy was the executive producer of Brian Wilson, and he and his girlfriend, Alexandra Morgan, shared songwriting credits with Wilson on some tracks. Wilson said he even modified his will to make Landy its primary beneficiary. After an investigation by California authorities into his treatment of Wilson and other patients, Landy surrendered his license in 1989, though he continued to work with Wilson through their partnership. Members of Wilson’s family filed a conservatorship case over Wilson’s care. In 1992, as a result of a settlement in that case, Landy was barred by court order from making any contact with Wilson; his name and that of Morgan, whom he later married, were removed from song credits. Landy died in 2006 at 71. In 1995, Wilson married Melinda Ledbetter, a former model who worked at a car dealership and had sold him a Cadillac. He frequently credited her with helping him rebuild his life after his entanglement with Landy. She died in 2024. “Melinda was more than my wife,” Wilson said at the time. “She was my saviour. She gave me the emotional security I needed to have a career. She encouraged me to make the music that was closest to my heart. She was my anchor.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/aukus-in-doubt-as-us-starts-review-into-whether-the-deal-is-america-first-20250612-p5m6rn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Time to wake up’: Turnbull, opposition seize on Trump’s AUKUS review",
        "publish_date": "Thu, 12 Jun 2025 11:48:20 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol",
            "Rob Harris",
            "Paul Sakkal"
        ],
        "text": "“It is natural that the administration would want to examine this major undertaking including progress and delivery, just as the UK government recently concluded an AUKUS review and reaffirmed its support. “Our engagement with the Trump Administration and across the full political spectrum in the United States has shown clear and consistent support for AUKUS.” The US Defence Department is reviewing AUKUS to see whether it aligns with President Donald Trump’s “America First” priorities. Credit: AP “Importantly, AUKUS will grow both US and Australian defence industry as well as generating thousands of new manufacturing jobs,” the spokeswoman said. Australia is investing $US3 billion ($4.6 billion) in US shipyards as part of the deal.\n\nOpposition frontbencher Bridget McKenzie said AUKUS was critical for Australia’s defence. “[The review is] a deeply concerning development,” she said on Channel Nine’s Today show. “There’s now a growing list of serious issues and tasks for the prime minister with his meeting with President Trump next week. Any undermining of this serious and substantial alliance between our two countries should be of grave concern”. Former prime minister Malcolm Turnbull, who has been critical of AUKUS, questioned why Australia has not yet reviewed the scheme. “The UK is conducting a review of AUKUS. The US... is conducting a review of AUKUS,” he said on X. “But Australia, which has the most at stake, has no review. Our parliament to date has been the least curious and least informed. Time to wake up?”\n\nColby has previously called himself an AUKUS sceptic and last year said it would be “crazy” if the arrangement resulted in nuclear-powered submarines going to the wrong places at the wrong time. Of particular concern is the US’s lagging rates of submarine production, and failure to meet its own needs. As part of the AUKUS deal, the president of the day can refuse to release the boat to Australia if it is required for American defence priorities. US Defence Secretary Pete Hegseth while meeting with his Australian counterpart Richard Marles earlier this year. Credit: AP However, Colby expressed more optimism about AUKUS at his confirmation hearing earlier this year, saying he wanted to remove red tape and barriers to submarine production so that the partnership could be expedited. News of the review comes just days before Prime Minister Anthony Albanese expects to meet Trump on the sidelines of the G7 world leaders’ summit in Canada. But on Thursday, White House press secretary Karoline Leavitt said the president’s schedule for those G7 meetings was still being finalised.\n\nAlbanese’s office has been contacted for comment, as was Australia’s embassy in Washington, which referred questions to Canberra. At a meeting with Defence Minister Richard Marles at the start of this month, Hegseth urged Australia to lift defence spending to 3.5 per cent of GDP – a request reiterated by Colby on social media this week. Loading A UK government spokesperson said AUKUS was “one of the most strategically important partnerships in decades”. “It is understandable that a new administration would want to review its approach to such a major partnership, just as the UK did last year,” they said. “The UK will continue to work closely with the US and Australia at all levels to maximise the benefits and opportunities which AUKUS presents for our three nations.”\n\nSeveral AUKUS experts urged caution in interpreting the intent of the US review. They pointed to the fact the United Kingdom recently commenced a parliamentary inquiry into the pact, and said it was natural that the Trump administration would seek to ensure AUKUS aligned with its own priorities. The review also comes just weeks after the new US ambassador to Britain, Republican donor Warren Stephens, told a London audience that AUKUS was “vital” to global peace and security. Under the first pillar of the pact, Australia will purchase three to five nuclear-powered submarines from the US, starting in the 2030s, and build more through a joint initiative with the US and UK. Under the second pillar, the three nations will collaborate on advanced defence technologies. Australia is also contributing at least $US3 billion ($4.6 billion) to the US defence industrial base to shore up submarine production; $800 million has already been paid. The deal was announced in 2021 under then prime minister Scott Morrison and then US president Joe Biden. Loading\n\nSophia Gaston, UK foreign policy lead at the Australian Strategic Policy Institute in London, said the British inquiry had “injected new dynamism and political edge into the UK’s approach”, which was helpful in taking AUKUS forward under Trump. She said it was perfectly reasonable for the new administration to conduct a review into a project as large and significant as AUKUS. “We can never be certain of where another government’s review will take them, but Britain and Australia must be confident in the rationale behind AUKUS and its alignment with America’s core goals of deterrence and competition towards China,” Gaston said. “The best thing both allies can do during this review process is to put themselves in a posture ready to deliver some quick wins, particularly on pillar two, which will demonstrate the value in America partnering with allies to amplify its strengths in both scale and innovation.” Alessio Patalano, a professor of war and strategy in East Asia at King’s College London, said Colby’s views on AUKUS before he joined the current administration would likely inform how AUKUS advocates perceived this review.\n\n“However, these views are now being channelled into a government effort to ‘audit’ how AUKUS advances the US economy and security,” he said. “As such, the review represents an opportunity to assess whether the current governance structure and priorities would benefit from greater focus.” Supporters argue the pact is a strategic bulwark in an increasingly contested Indo-Pacific region, though critics warn that delays and shifting political dynamics could undermine its success. But British Prime Minister Sir Keir Starmer last month declared the AUKUS defence pact the centrepiece of his government’s national security strategy, promising the UK’s largest military investment since the Cold War. At a high-level event in Westminster, Starmer described AUKUS as a “national endeavour” and named former national security adviser Sir Stephen Lovegrove as his special representative to lead the project.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/bulldogs-star-appears-to-rupture-acl-20250421-p5lt2l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bulldogs star appears to rupture ACL",
        "publish_date": "Thu, 12 Jun 2025 11:45:23 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bulldogs star appears to rupture ACL\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/insane-crusaders-record-goes-on-line-20250612-p5m6wb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Insane Crusaders record goes on line",
        "publish_date": "Thu, 12 Jun 2025 11:45:13 +1000",
        "category": "finance",
        "authors": [],
        "text": "Insane Crusaders record goes on line\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/bridgerton-star-takes-on-phone-thief-in-cafe-20250612-p5m6wc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bridgerton star takes on phone thief in cafe",
        "publish_date": "Thu, 12 Jun 2025 11:45:12 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Bridgerton star takes on phone thief in cafe\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/max-king-daring-to-dream-of-ashes-tour-if-blues-clinch-origin-series-20250610-p5m6du.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Max King daring to dream of Ashes tour if Blues clinch Origin series",
        "publish_date": "Thu, 12 Jun 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Max King once thought his only hope of playing representative rugby league was to put his hand up for England, the land of his birth.\n\nSoon the Canterbury prop could be heading to the Old Dart wearing the green and gold of Australia on an Ashes tour, as his grandfather Johnny King did more than 50 years ago.\n\nKing is focused on helping NSW win State of Origin II in Perth next week to clinch a series victory, having made his interstate debut off the bench in the Blues’ 18-6 triumph at Suncorp Stadium in game one.\n\nAfter Mitch Barnett suffered a season-ending knee injury two weeks ago, King has been promoted to the starting line-up – another surreal moment for a player who until a few weeks ago had never dared dream he would be good enough to play at rep level.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/katy-perry-melbourne-20250604-p5m4vp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This show breaks some of my rules for theatre. Here’s why it works",
        "publish_date": "Thu, 12 Jun 2025 11:44:47 +1000",
        "category": "entertainment",
        "authors": [
            "Sonia Nair",
            "Karl Quinn",
            "Will Cox"
        ],
        "text": "There are musical interludes featuring heartbreak songs throughout – vocals auto-tuned and self-accompanied by the synth McCracken half-heartedly learnt to play while trying to get back on the horse. Comically obsessive monologues on the physiology of heartbreak are interwoven, too. McCracken gives a biomolecular hot take on the grieving process; makes excursions into neuro- and social psychology. These, and a penchant for Google-diagnosing the rarest possible disorders – yes, you can really die of a broken heart, it’s called Takotsubo cardiomyopathy, apparently – are desperate measures to control the acute sense of powerlessness the show explores. A minimalist set creates a transient, liminal space reminiscent of a hotel lobby, and it’s all seamlessly directed and performed, without a hint of sentiment or preachiness or over-realisation. Instead, Heartbreak Hotel offers the balm of warmth and authenticity, using a melange of cabaret, stand-up, and the brisk intimacy of a theatrical two-hander to transform the ineffable mess of life into art.\n\nReviewed by Cameron Woodhead\n\nTHEATRE\n\nThe Wrong Gods ★★★★\n\nArts Centre Melbourne, Fairfax Studio, until July 12 Countless clashes take hold in Sydney playwright S. Shakthidharan’s follow-up to his critically acclaimed epic Counting and Cracking: that between old and new, fate and agency, tradition and technology, the rural and the metropolis, the ancient practice of animism and the worship of progress at all costs. Radhika Mudaliyar and Nadie Kammallaweera play Isha and Nirmala in The Wrong Gods. Credit: Brett Boardman These concerns find their apotheosis in the increasingly frayed relationship between Isha (Radhika Mudaliyar) and her mother Nirmala (Nadie Kammallaweera). Isha dreams of a life beyond the confines of her riverside village and finding a different truth, but is stultified by her mother’s reticence to change. Nirmala is staunch and steadfast in her desire to live and die by her land, dictated by the caprices of the climate and environment. Enter Lakshmi (Vaishnavi Suryaprakash), a cog in a multinational company who Nirmala calls “the devil”. Simultaneously introducing Nirmala to newfangled farming technology and financial arrangements while offering Isha the freedom to realise her dreams of becoming a scientist, Lakshmi promises a form of liberation to both women. What could go wrong?\n\nThe Wrong Gods takes its inspiration from India’s “greatest planned environmental disaster”, where one of the world’s biggest hydropower infrastructure projects involved damming the Narmada River, a life source for millions, leading to displacement of indigenous communities and severe ecological catastrophe. Catapulting us seven years into the future in its second act, we see Nirmala protesting the ever-encroaching threat of irresponsible development on her land, aided by Devi (Manali Datar), while Isha pursues her dreams in the city. Their eventual reunion occurs under fraught circumstances none of them could have foreseen – but how they contend with it is the tension that drives the play forward. Much of the exposition occurs in the dense dialogue that’s exchanged between all four characters. Credit: Brett Boardman The Wrong Gods allows space for multiple truths to exist at once, disavowing easy resolutions and the reductive tendency to pick a side. You can support Isha’s desire to live a self-determined life, while wanting this same autonomy to be extended to her mother. You can wish for an easier life for Nirmala, while rejecting the ways colonial powers and corrupt state governments extract and exploit. At times, The Wrong Gods is both oversimplified and overexplained – much of the exposition occurs in the dense dialogue that’s exchanged between all four characters. They flit from idea to idea at lightning speed, from the patriarchy of god worship to the overconsumption of cities that sees rural denizens as collateral damage.\n\nBut the heightened emotional stakes of the personal relationships at the play’s fulcrum anchor it. Each character undergoes a metamorphosis of sorts as their perspectives and perception in the eyes of the others shift. Under Shakthidharan and Hannah Goodwin’s direction, they pace around and across the deep concentric grooves of tree rings, stuck in a cycle that was imposed on them as they look for ways to resist and defy it. Loading Kammallaweera is a highlight as the exceedingly strong Nirmala, providing comedic relief even as she wrenches the rug from beneath us in an emotionally stirring performance (special mention to her machete skills). Suryaprakash keeps us guessing as to Lakshmi’s motives in a stunning interplay of opacity and sincerity. Compressed into a neat 90 minutes, The Wrong Gods is significantly shorter than Counting and Cracking, but shares its deep engagement with big ideas that traverse the personal and the political. Reviewed by Sonia Nair\n\nTHEATRE | Rising Festival\n\nLegends (of the Golden Arches) ★★★\n\nMerlynn Tong and Joe Paradise Lui, Melbourne Theatre Company, until June 28 This rambunctious show follows two Australian artists of Singaporean Chinese descent as they battle ghosts past and present, in a comedy of (pop) cultural collision that sends them to Chinese hell and back. Joe Paradise Lui and Merlynn Tong in a scene from Legends (of the Golden Arches). Credit: Jessica Wyld Merlynn Tong and Joe Paradise Lui saunter onto the stage as themselves. They’re super low-key about it, and as their banter moves between shared nostalgia for, and shit-talking about, the childhoods they’ve left behind, conflict emerges. It emerges that both Lui and Tong have lost older relatives with a taste for McDonald’s burgers – one was a Filet-O-Fish connoisseur, the other a Big Mac fiend – and the immediate reason for their being onstage together is the aftermath of a funeral for one of these – Lui’s grandfather, for whom Tong insists on observing Chinese funerary traditions. She wants to fold and burn joss paper (as underworld currency, so the deceased can bribe their way past the many lords and officials in Chinese hell) and stay up all night, lest the dead ancestor remain trapped as a hungry ghost.\n\nMourning doesn’t become Joe Paradise Lui, though. He hired strippers for the funeral and has long outgrown superstitions he now finds anathema to his firmly anti-capitalist, pacifist ethos. Whether his contempt is (at least partly) a psychological defence against loss – Lui chose an artistic career and permanent exile in Australia over compulsory military service in Singapore – is a question he’ll have an eternity to confront. Legends (of the Golden Arches) draws the audience into hilarious and heartfelt odyssey. Credit: Jessica Wyld In a moment of pique, Lui throws a bag of Mickey D’s on the offering pyre. The act of disrespect opens a portal to a terrifying, and distinctly Chinese, hell dimension. There’s a flamboyant reveal, supercharged by garish Getai performance in futuristic costume, before all hell does break loose.\n\nLoading Set designer Cherish Marrington brings the guardians of the underworld to carnivalesque life through custom-made inflatables, and the performers can only escape the funfair atmosphere after Guanyin – goddess of mercy in the Chinese pantheon – intervenes. Visually splendid video artistry from Wendy Yu illustrates the retelling of Chinese legends in this work, from the backstory of the Chinese god of war, Guan Yu, to tales of the underworld’s incorruptible judge, Bao Gong. Unfortunately, the script isn’t always as vibrant or effective as the design – some jokes fall flat, and some of the cultural commentary is so basic it feels patronising. When Legends (of the Golden Arches) succeeds, though, it draws the audience into a hilarious and heartfelt odyssey – one that balances respect for the living and the dead, while navigating the mystery and majesty (and absurdity) of cultural traditions ancient and modern. Reviewed by Cameron Woodhead\n\nMUSIC\n\nKaty Perry | The Lifetimes Tour ★★★★\n\nRod Laver Arena, until June 14 Katy Perry is pure pop. Her songs promise, and mostly deliver, a good time. And her Lifetimes concert does the same, across two and a half hours, five acts, multiple costume changes and more than 20 songs from a back catalogue stretching to 2008 (the pre-Perry Christian singer Katy Hudson gets a brief acknowledgement but no stage time). Katy Perry on stage at Rod Laver Arena. Credit: Martin Philbey But this big, spectacular, noisy and surprisingly intimate show also has grander ambitions, in which it has mixed success. It’s all there in the framing device: a video game in which KP143, an “enhanced” version of Katy Perry, attempts to unseat Mainframe, the AI that has come to rule humanity rather than serve it. To do so, she must free the butterflies that have been captured to power the AI, and to do that she needs to collect love, in the form of glowing hearts that descend from the arena rafters.\n\nThe 143, of course, refers to the title of her latest and much-criticised album, and is tech speak for “I love you” (with its origins in pager messaging from the 1990s). Phew. That’s a lot of freight to load onto the shoulders of a bunch of pop songs, even a set as hook-heavy as Perry’s. And at times, the strain shows. Perry and her team of 10 dancers work their collective butts off. Credit: Martin Philbey The stage is set in what looks like a figure eight, though it’s actually the infinity symbol; later on, while singing E.T., a lightsaber-wielding Perry does battle with a lengthy bit of heating duct that is meant to represent the “infinite worm” spewed out by Mainframe. It’s the weakest moment in a show that has plenty of goof and lots of camp and heaps of flying on wires, and mostly manages to deploy them to great effect. The backdrop is a wall of screens, suggestive of the importance of video to Perry’s success, but also integral to the narrative; it’s up here, in lengthy clips, that the framing story unfolds, while Perry is offstage changing costumes.\n\nThe four-piece band – women on guitar and keys, men on bass and drums – play beneath the screen, while Perry and her 10 dancers make full use of the elongated stage. “Not a bad seat in the house,” she boasts. If “love” is the connective tissue here – and suddenly, her bizarre proclamation upon returning to Earth after that ill-conceived Bezos-shilling space flight makes so much promotional sense – the main theme is self-actualisation. The video screen backdrop plays a crucial role in the show’s narrative. Credit: Wolter Peeters In the dubiously conceived segment where the audience gets to “request” songs via QR code (it sent me to a sign-up page for the tour, with no option to vote), she plucked an 11-year-old to join her onstage while she sang Thinking of You, from her 2008 album One of The Boys. Maddie from Traralgon said she’d had a dream about this moment; Katy from California says keep dreaming because as this moment proves, if you dream it you can be it. The singer’s continual reinvention of herself is proof of that maxim. And her performance of the ballad – playing acoustic guitar, with no backing track and nowhere to hide – was proof that beneath all the razzle-dazzle she remains a serious talent. As she says towards the end, “Never forget you are the main character of your video game”.\n\nThe 143 album got a cold shoulder from critics and the charts, but its songs were loudly cheered and sounded great – Woman’s World and Lifetimes especially. Once the dust settles, these will, I suspect, come to be considered bona fide bangers to rank alongside Hot and Cold, Roar, California Girls and the rest (all of which got an airing, naturally). Whenever she is onstage, Perry works her butt off. Running, jumping (at the end of Act One, she literally leaps into a pit and disappears), standing atop a tall pillar, dangling upside down in a spherical cage, flying high on the back of a giant butterfly. It’s spectacular, and for the most part she sings well, looks great, and appears to be having almost as much fun as her audience (a spread of ages, including many young girls, with their mums, first-wave Perry fans who’ve passed the baton of sparkly empowerment on). Katy Perry is a consummate performer. Credit: Martin Philbey Perry can be a little tone-deaf at times – her Blue Origin flight reeked of privilege, and working with producer Dr Luke was problematic at the least – but so much of the recent criticism of her smacks of ageism. She knows it, too. When she finished a terrific rendition of Teenage Dream, she responded to a call from a fan. “Oh still? I can be your hall pass still? I’m 40 years old. Forty and fabulous.” That she is.\n\nReviewed by Karl Quinn\n\nMUSIC | Rising festival\n\nPete and Bas ★★★\n\nMax Watts, June 8 Peter Bowditch and Basil Bellgrave take the stage at the packed Max Watts a little early. They’re men in their 70s and they talk (and dress) like they’re in a Guy Ritchie film. Pete and Bas perform at Max Watts on June 8. Credit: Mandy Wu “Are you ready for some madness?” says Bas, in a broad cockney accent. “We ain’t here for a laugh! This is serious” says Pete. The DJ fills the room with reverberating rap airhorn and they launch into a drill track called Do One. I’m in.\n\nSo are they actors? An elaborate bit of performance art? A septuagenerian Milli Vanilli? Did they have ties to notorious London gangsters the Kray brothers? Did Bas do a stint playing piano on cruise ships? I’ve looked into all this. The answers are far less interesting than the questions. So maybe it’s a joke. But the joke wouldn’t land if they weren’t actually great. Are Pete and Bas actors? An elaborate bit of performance art? Credit: Mandy Wu Their flow (on the recordings at least, more on that later) is fast, aggressive, razor sharp. And their lyrics are full of colour, character and flashes of violence. Sample: “Recipes, batches, powders, waxes, cash in hand no taxes / Kerosene, matches, burn down factories, big boy tactics / Burning, burning, all this money I’m earning.” Like most rappers, they’re entertainers, storytellers. Bas drags an excited young woman on stage.“I f--ken love you c---s!” she screams into the mic before twerking her way through the next track, Pint and a Fag.\n\nLoading The crowd are rowdy. Half a dozen people are hauled up to dance and occasionally rap. It is, as Bas puts it, “gettin’ a little bit lively”. Pete throws a wad of cash into the crowd. Like the rest of the night, I can’t quite tell if it’s real or not. At 70-something, they do struggle to keep up with the flow. The backing tracks come complete with the recorded vocals as guides, and occasionally they lose track and mumble their way through a verse. It doesn’t hinder the night as much as you might think. After about an hour ,they wrap up with Mr Worldwide (“Keep one eye open for the plainclothes / I need more leg room for the plane home”), and they’re off. “Back to our coffins,” as Pete puts it. It’s possible I’ve just seen a couple of elderly actors fumble through a lip sync for an hour at the behest of a canny management company. I don’t know! Frankly, I don’t want to know. That was the most fun I’ve had at a show in ages.\n\nReviewed by Will Cox",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/the-aussie-nfl-punter-making-84-000-a-kick-20250612-p5m6so.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Aussie NFL punter making $84,000 a kick",
        "publish_date": "Thu, 12 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "Australian Michael Dickson has become the NFL’s highest-paid punter after re-signing with the Seattle Seahawks on a $25.68 million four-year deal.\n\nThe 29-year-old Swans academy product first signed with the Seahawks in 2018, and had previously held the title of the league’s highest-earning punter when he extended with the club back in 2021.\n\nDickson will earn a guaranteed $15.67 million across the four years, but could earn up to $25.68 million. The new deal means Dickson will earn about $6.4 million a season – or $84,000 for every punt until the end of his contract in 2029 – based on his 2024-25 number of 72 punts for the season.\n\nAustralia Michael Dickson has extended his contract with the Seattle Seahawks for another four years. Credit: AP\n\nDickson’s contract surpasses that of Jacksonville Jaguar Logan Cooke, who was set to become the league’s best-paid punter two days ago, with his four-year contract extension speculated to be worth about $6.15 million a season.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/jerry-seinfeld-chose-not-to-run-this-is-why-i-choose-not-to-bump-20250611-p5m6ly.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s not about courage’: Why I choose not to bump",
        "publish_date": "Thu, 12 Jun 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "The goal isn’t to flatten opponents any more – it’s to outplay them. Why bump when you can tackle, smother, or shepherd to protect a teammate? The AFL’s match review officer Michael Christian ruled Tom Stewart’s bump on Gold Coast skipper Noah Anderson was within the rules. Credit: Fox Footy Sometimes the bump works, like when Geelong’s Stewart collected Gold Coast’s Noah Anderson last weekend, but it’s a gamble. But if Anderson had been concussed, Stewart would’ve missed weeks. If Anderson slipped at the last second, he might have copped a shoulder to the head, and there would have been little Stewart could have done to control that. Stewart had other options: intercepting a dribbling ball or tackling if Anderson had control. Joel Amartey bumped Jordan Boyd in round 10, resulting in concussion and a suspension. On Sunday night, Durham was second to the ball – he should’ve waited for Cerra and then tackled. Instead, he bumped, with consequences.\n\nSo why would players cling to this old action as the game moves forward? Suspensions mean time off the field and letting your team down – worse, a bump risks lifelong harm to an opponent. We will make mistakes, but how far we go wrong is what counts. The Blues remonstrate with Sam Durham and his Bombers’ teammates after Adam Cerra was crunched by Sam Durham. Credit: AFL Photos When I approach a contest, I’m not thinking about cleaning someone up with a bump. I focus on what we train: stutter steps to slow my speed, stay agile, and react to tiny changes. Before I arrive, I assess the numbers – do I need to contest or is a teammate better placed? If I’m close, I read how my opponent approaches – front-on or side-on – then decide how to contest safely, avoiding frees or injury risks. That aggressive body-on-body hit? It’s disappearing – at least in bump form. Stewart’s teammate Mitch Duncan said coaches are actively teaching players to avoid those high-risk actions.\n\nLoading That’s not to say I won’t put my body on the line like most AFL and AFLW players. It’s not about courage or toughness. We all want to win. We all have white-line fever – the drive for teammates and club. But let’s do it with elite skills – in the air, on the ground, and with precise tackles. Let’s play as we train, guided by specialist coaches every day. Some say it’s instinct to protect yourself in collisions, like when Essendon’s Peter Wright took out Sydney’s Harry Cunningham last year. But that shoulder bump wasn’t instinct – it was a choice. He got four matches. That’s no longer a footy action. Spoiling the mark would’ve been the right play. Instinct can be trained. When I hear “it’s just instinct,” I wonder, would you do that to a teammate at training? No. We don’t train to bump or sling tackle. We train to win the ball cleanly and protect each other. So why do it in a game if you’d never do it in training?\n\nBeing tough and uncompromising is still footy – but it can be done without knocking someone out or missing weeks. Brayden Maynard’s attempt to smother in the 2023 qualifying final against Melbourne, while cleared by the AFL tribunal as a football action, resulted in a bump which, along with earlier concussions, left Angus Brayshaw with lifelong consequences. This isn’t something we train; it’s what happens when heat overrides discipline. Collingwood recruit Dan Houston did something similar in round four of this year against Carlton and was suspended for two matches. I’m sure he and many others didn’t mean to cause any harm, but fast decisions in a heated contest carry high risks. Discipline matters – the best players are brave and disciplined. They stick to the process: win the ball, be physical, and be smart. Mistakes happen, but the goal is to win safely and skilfully – for your health and your opponents’.\n\nThe game’s future is at stake This isn’t just about individual actions. It’s about protecting the future. Angus Brayshaw’s AFL career ended prematurely because of concussion. Credit: Archives The AFL faces concussion lawsuits from former players. We’ve lost incredible athletes, including Brayshaw, too early due to repeated head trauma. His retirement was alarming – he loved the game but had to protect his brain health. This is a real risk, not just missing games, but living with conditions like CTE linked to repeated head knocks. We can’t ignore this. It’s preventable – if we make better choices now. Serious injuries will always happen in our sport, but we must control what we can.\n\nLoading Parents and kids watch. We want the next generation to love footy – not turn away from it. We want them to know footy can be safe, exciting, physical, and skilful all at once. It starts with us – AFLW and AFL players. We are role models. What we do is copied on local fields across the country. Let’s show them the right way. The game is in great shape: fast, skilful, physical, and evolving. We can adapt or be left behind. So, yes, I choose not to bump.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-councils-cost-of-living-move-to-save-locals-7000-from-july-1-224704743.html",
        "title": "Aussie council's cost of living move to save locals $7000 from July 1",
        "publish_date": "2025-06-11T22:47:04Z",
        "category": "finance",
        "authors": [],
        "text": "The council hopes by waiving secondary dwelling fees, it'll encourage more landowners to build and rent out granny flats.\n\nAn Aussie council is waiving application fees for residents seeking to build granny flats on their property in a bid they hope will provide some relief to the housing crisis. Source: Noosa Council\n\nAs Australia's housing crisis deepens, more councils are rolling out new measures aimed at easing the pressure on those struggling to find a place to call home.\n\nThis week in Australia, the median home price across the entire country rose to over $1 million — a first in history — with renters also facing record-high prices in large parts of the nation. Recently, some councils have announced they'll allow people to live in caravans and tiny homes on wheels on private property, providing short-term accommodation for those in desperate need.\n\n\"If something this small can make life a bit easier for someone, then I think it’s the least we can do,\" Shire of Manjimup President Donelle Buegge told Yahoo News after announcing the scheme.\n\nNow, Noosa landowners can build secondary dwellings, such as granny flats, without paying infrastructure charges. This is in contrast to most parts of the country, where councils normally charge infrastructure contributions or developer fees for additional dwellings.\n\nADVERTISEMENT\n\nLocal authorities say these charges help cover the cost of additional strain on local infrastructure, like roads, water, sewerage, and community services, that comes with increased housing density.\n\nLocals to save $7000 in application fees\n\nThat's all about to change in Noosa, however, with the changes about to be ushered in in the new financial year. Council’s director of development and regulation, Richard MacGillivray, said scrapping infrastructure charges for new secondary dwellings would save applicants roughly $7,000 on average.\n\nGranny flats are an easy way to provide accommodation relief to battling Aussies, experts say. Source: Supplied\n\nThe council hopes waiving infrastructure charges will encourage more landowners to build and rent out granny flats, helping address demand for affordable, long-term housing, particularly for singles, couples, and older residents. It said dwellings must be used for permanent accommodation and cannot be listed as short-term rentals.\n\nADVERTISEMENT\n\n\"This change takes effect from the new financial year, so any infrastructure charge notices issued prior to July 1 are still payable,\" MacGillivray said in a statement.\n\nCouncil's standout policy amid broader Australian trend\n\nIt's a move property experts have long called for, saying it's one easy way to increase availability in suburbs in particular. Noosa’s move to scrap infrastructure charges for secondary dwellings is part of this broader trend, but it’s still not the norm nationally, making it a standout policy decision that could influence other councils to follow suit.\n\nSeveral locations across Australia have introduced changes to encourage the construction of granny flats. In Victoria, from December 2023, homeowners can build a small second dwelling of up to 60 square metres without needing a planning permit, provided the land is over 300 square metres and free of environmental or flood overlays.\n\nIn Western Australia, from April 2024, granny flats are allowed to be built on any residential lot without planning approval, as long as they meet local setback requirements and stay under 70 square metres.\n\nADVERTISEMENT\n\nNoosa Mayor Frank Wilkie said granny flats offer a sustainable solution to the housing shortage, and hopes scrapping infrastructure charges will encourage more residents to build and rent them out.\n\n\"We hope by removing the infrastructure charges, which are typically several thousand dollars per application, we will see more people build them and offer them for rent,\" he said.\n\nIn addition to waiving fees, the council will also remove development application fees for not-for-profit housing providers where projects are fully dedicated to affordable rentals. Private developers may also be eligible for waived fees if their developments include long-term affordable rental units.\n\nWilkie acknowledged the financial challenges of building affordable rentals. \"We realise building affordable rental premises needs to stack up financially given the cost of land and construction, so these incentives will help,\" he said, adding that the incentives form part of a broader strategy to address Noosa’s housing crisis\n\nADVERTISEMENT\n\nWilkie also highlighted upcoming planning scheme amendments aimed at boosting the supply of smaller, affordable homes for key workers, older residents, and small households, now awaiting ministerial approval. All of the financial incentives apply from July 1, 2025.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/100-million-powerball-winner-reveals-how-her-life-has-changed-if-only-we-knew-072452682.html",
        "title": "$100 million Powerball winner reveals how her life has changed: 'If only we knew'",
        "publish_date": "2025-06-11T07:24:52Z",
        "category": "finance",
        "authors": [],
        "text": "In Australia, only an exclusive group of six know what it’s like to win a Powerball prize of $100 million or more.\n\nIf one person takes home the entire $100 million prize, they’ll share the title of Australia’s third-biggest lottery winner ever. Source: The Lott\n\nAustralians taking part in Thursday's incredible $100 million Powerball prize stand a chance to share the title of Australia’s third-biggest lottery winner ever. Just six people know what it’s like to win the $100 million prize across the country, but that all could change come this Thursday at 7.30pm AEST.\n\nAt 5.47pm on the day of the last $100 million draw, back in November 2024, ticket sales peaked, with 6,415 entries sold in just one minute. The Lott expects a similar frenzy to take place in just a little over 48 hours, as anticipation builds for the draw.\n\nIn February last year, a Queensland woman took home half of the record-breaking $200 million Powerball draw. Reflecting on her win more than a year on, the lucky winner has revealed she's since embraced a sea change, relocating from the suburb of Hawthorne in Brisbane to a serene coastal home.\n\n\"I often speak with my partner about the version of us from last year to now, and if only we knew what was to come,\" she said. \"On a day-to-day basis, not a huge amount has changed. I still get up for the 6am gym session, and the dog still needs to be walked and fed. The longer-term vision we have for our life is slowly coming together.\"\n\nWhat are the odds of winning the lotto in Australia?\n\nThe Lott's Anna Hobdell said the woman is a part of an exclusive group of six Aussies who know what it’s like to win a Powerball prize of $100 million or more. While it's easy to get swept up in the excitement, if you're thinking about taking a swing, the chances of you actually pocketing the big Powerball jackpot are incredibly slim.\n\nAccording to The Lott themselves, the chances of scoring a Powerball jackpot are 1 in 134,490,400.\n\nADVERTISEMENT\n\nWe often hear in the news that meteorites fly by earth, sometimes coming a little too close for comfort. If a decent-sized one were to make an impact, however, it could have catastrophic consequences. As it turns out, the odds of you dying from a local meteorite, asteroid or comet impact are one in 1.6 million, according to National Geographic — MUCH more likely than a Powerball win.\n\nTickets for Powerball draw 1517 on Thursday can be purchased at any licensed lottery outlet, online from thelott.com or via The Lott mobile app.\n\nIf gambling is a problem for you go to Gambling Help Online or call 1800 858 858.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com. You can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/call-from-officeworks-sparks-three-day-mission-after-worrying-find-in-store-054446760.html",
        "title": "Call from Officeworks sparks three-day mission after worrying find in store",
        "publish_date": "2025-06-11T05:44:46Z",
        "category": "finance",
        "authors": [],
        "text": "A very 'clever' owl's performance in Queensland last week has highlighted an increase in incidents of birds getting trapped in large retail stores.\n\nStaff at an Officeworks in Queensland called for help last week after they made a concerning discovery. Source: Keith Porteous/The Wildlife Rescuer\n\nA call from concerned staff at an Officeworks store has triggered a three-day rescue mission after a surprise visitor was spotted chucking laps around the store’s roof. Employees were stunned to discover one morning last week that a boobook owl had also decided to clock in at the Maroochydore venue, in Queensland.\n\nHoping the bird would realise his error and head home, they placed a bowl of water on the ground in a bid to keep him comfortable. But as the owl continued to flap his wings metres above their heads, staff realised they needed proper help.\n\nEnter Keith Porteous, otherwise known online as The Wildlife Rescuer.\n\nAfter arriving at the Officeworks, the Sunshine Coast local told Yahoo News he tried to catch the owl as it slept during the day but it was “too clever for that”. The following day he tried to lure the boobook down with mealworms and mice, but it wouldn't budge.\n\nADVERTISEMENT\n\n“He wasn’t coming down at all. I think because the store had the lights on 24 hours, and the bird being nocturnal, it was totally spun out by that,” Porteous said.\n\n“The factor that concerned me most is, like all big stores, they lay baits for rodents, so there was a high possibility it might pick up one of those in the store. So I was quite keen to get it out as quickly as possible.”\n\nOwl stuck in Officeworks rescued after three days\n\nFinally, after eluding Porteous for three days, the owl, which had likely chased his dinner into the warehouse, was captured with the help of “an extremely fine net that is virtually invisible to the bird”.\n\n“It’s such an unnatural place, with very, very high ceilings and very, very low doors, and the doors are glass as well, so the birds can’t understand that. So they get their way in there, and they just can’t navigate their way out,” the rescuer told Yahoo.\n\nADVERTISEMENT\n\nVideo footage shows Porteous repeatedly trying to catch the owl as it flaps across the rows of shelves, before gently retrieving it with the large net. After cutting off the netting in the store’s locker room, he found the bird was healthy and released it in the carpark.\n\nKeith Porteous said he's seen a huge increase in call-outs for birds stuck in stores this year, but he's unsure why. Source: Keith Porteous/The Wildlife Rescuer\n\nRescuer sees huge jump in call-outs for birds stuck in stores\n\nWhile one of the great perks of living in Australia is being able to observe its distinct wildlife, such incidents appear to be occurring more frequently.\n\nLast year Bunnings shoppers shared concerns for the welfare of a barn owl flying around a shop in Melbourne’s west. Earlier this year, two Coles stores were visited by curious magpies, one of which frequented a Canberra supermarket for a month.\n\nUsually, Porteous responds to two to three call-outs for birds stuck in stores a year. In the past six months he has completed 10 to 12 rescues. “Over the last few years I have done quite a lot, but it’s stepped up a heap this year compared to others,” he told Yahoo.\n\nADVERTISEMENT\n\nHowever Porteous said he wasn’t sure if the increase was due to it occurring more often, or if locals were simply more familiar with his work and know he can handle such situations.\n\nOther wildlife rescuers have also noted a jump in the number of birds getting caught in shops, with Nigel Williamson previously telling Yahoo it seems to be “happening more and more often”.\n\n“I’ve been getting birds out of supermarkets for 40 years now, but it does seem to me that I’m doing more and more of them as time goes on,\" he said in March.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]