[
    {
        "url": "https://www.9news.com.au/finance/inflation-june-quarter-2025-cpi-interest-rates-reserve-bank-australia/1efbb25f-0c3d-4091-9c9e-f715bec737da",
        "title": "New inflation data paves way for interest rate cut in two weeks",
        "publish_date": "Wed, 30 Jul 2025 02:01:25 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Core inflation has fallen to its lowest level since the height of the pandemic, paving the way for a third interest rate cut of the year when the Reserve Bank meets in two weeks.\n\nNew data from the Australian Bureau of Statistics this morning had headline inflation slowing to 2.1 per cent in the 12 months to the June quarter – down from 2.4 per cent in March and now right at the bottom of the RBA's target range.\n\nImportantly, the trimmed mean – the central bank's preferred measure of core or underlying inflation – slowed from 2.9 to 2.7 per cent, right in line with economists' expectations, although the RBA had previously forecast it would be 2.6 per cent.﻿\n\nCore inflation has fallen to its lowest level since the height of the pandemic, paving the way for a third interest rate cut of the year when the Reserve Bank meets in two weeks. (AAP)\n\nBoth measures ﻿are now at their leanest since the middle of the COVID-19 pandemic – headline inflation hasn't been this slow since March 2021, while the last time the trimmed mean was 2.7 per cent or lower was December of that year.\n\nReserve Bank Governor Michele Bullock said the surprise decision to leave interest rates on hold earlier this month was a case of wanting to be cautious and wait for more data, while minutes from the board's meeting revealed further cuts are still expected this year .\n\nEconomists say today's inflation figures make it highly likely that the next of those cuts will be delivered on August 12.\n\n\"This is good news for all those millions of mortgage holders that are hoping for some rate relief,\" 9News finance editor Chris Kohler said.\n\n\"They were disappointed last time, this is one of those big barriers that's now been knocked out of the way.﻿..\n\n\"The market has been wrong before, but before this data was dropped, there was an 88 per cent likelihood, according to the market, of a cut at the August meeting, which is held on the 11th and 12th of August.\n\n\"You'd have expect, and I haven't looked at the data just yet, but you'd have to expect that likelihood has just increased﻿.\"\n\nWestpac Chief Economist Luci Ellis – herself a former assistant governor at the RBA – said the data could even open up the possibility of further cuts well into next year.\n\nEconomists now fully expect Michele Bullock and her monetary policy board to cut interest rates in August. (Louise Kennerley)\n\n\"﻿The RBA... opted to wait for more confirmation that inflation is on track to return to the midpoint of the 2-3 per cent target range and stay there,\" she said.\n\n\"That confirmation has now come with the full June quarter CPI data.\n\n\"We therefore expect the monetary policy board to cut rates by 25 basis points at its August meeting, to 3.60 per cent.\n\n\"Further cuts in November, February 2026 and May 2026, also look increasingly likely.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sydney-newtown-mcdonalds-king-street-proposal-local-businesses-say-they-cant-compete/ac37e002-0a90-46fd-9165-db338e6950de",
        "title": "Not McLovin' it: Outrage over plan for 'killer' Golden Arches",
        "publish_date": "Tue, 29 Jul 2025 19:29:54 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Local businesses say they are preparing to close their doors if a proposal to bring McDonald's to a bustling street in Sydney's Inner West gets the green light.\n\nMcDonald's Australia has lodged an application with the City of Sydney to build a $1.7 million restaurant at 212-214 King Street in Newtown.\n\nUnder the plan, it would operate 24 hours a day, seven days a week. ﻿\n\nREAD MORE: Commonwealth Bank says AI is reason behind dozens of job cuts\n\nA McDonald's in Newtown would be the final nail in the coffin for the nearby ﻿Broaster Chicken. (Facebook)\n\nKing Street ﻿already has six chicken shops within a roughly 170-metre radius — KFC, Broaster Chicken, El Jannah Chicken, Gami Chicken, Ogalo Newtown, and Clem's.\n\nAnd for some of those businesses, they say ﻿a McDonald's would be the final nail in the coffin.\n\nMD Ruben has owned Broaster Chicken for five years and has recently been ﻿struggling with losing customers to KFC.\n\nHe said he does not stand a chance if McDonald's — which made $US14.6 billion ($22.4 billion) in the year to March globally and has 1050 restaurants across Australia — opens up.\n\nREAD MORE: Trump hints tariff for Australia could double\n\n\"I know it's going to be a disaster. I don't think that small business can survive,\" he told 9news.com.au.\n\nRuben said he would have to pack up and move shop, and has already begun speaking with the franchise office and his lawyers.\n\n\"If McDonald's is coming, we might need to run off,\" he said.\n\n\"It's just literally in front of me, the other side of the road, and probably they try to open 24/7.\n\n\"There's no point to stay here and wasting all the time and fighting against McDonald's.\"\n\nRazwan Raza, who has owned and managed Ogalo Newtown with his family for almost 10 years, says he will also be forced to sell and chase cheaper operating costs in Melbourne if the plan is approved.\n\n\"If the small businesses come, there is healthy competition. We can compete with them,\" he said.\n\n\"But if the big company comes, we can't compete. Their marketing strategies, their wages.\"\n\nRaza's high monthly rent of $12,000, utility bills and council rates have left him and his family making only their wages.\n\nIf McDonald's opens up, he said he could become bankrupt if he doesn't sell Ogalo.\n\n\"Right now we are just earning our wages, and we are happy with this, because for the nine to 10 years, we [have been] working in the same place,\" he said.\n\n\"If McDonald's comes, definitely our turnover will decrease, and we can't even pay our wages out of this.\"\n\nREAD MORE: Cold snap imminent as Sydney braces for wet week\n\nS﻿LR Consulting has lodged an application to build a McDonald's on 212-214 King Street in Newtown. (NSW Government)\n\nLocal residents are campaigning against the McDonald's proposal, with an online petition already gaining 770 signatories at the time of publication. ﻿\n\nThe City of Sydney has notified residents and property owners and is accepting feedback on the proposal until August 7. ﻿\n\n﻿McDonald's Australia﻿ said it was \"excited by the possibility of joining the Newtown community\" and becoming a potential \"local employer\".\n\n\"We are committed to engaging with councils and communities to ensure we're listening to feedback and submitting development applications for restaurants that are thoughtfully designed for the community,\" McDonald's Australia said in a statement.\n\n\"A new Macca's in Newtown represents an investment of around $2 million and will mean more than 100 new local jobs and more support for local community groups in the area.\"﻿\n\nREAD MORE: ﻿ Government denies shock smoking claim after vape ban\n\nMcDonald's rejected plan to create a new restaurant in Redfern, Sydney. (Supplied)\n\nMcDonald's proposal to bring a 24/7 restaurant to nearby Redfern was unanimously knocked back by the City of Sydney in May.\n\n﻿The community feared it would bring crime to the area, with an overwhelming majority of submissions from the public being against the plan.\n\nDown ﻿south in Melbourne, residents are in a similar fight against a plan for a 24/7 McDonald's in what could be the city's equivalent to Sydney's King Street.\n\nAn application ﻿was submitted to open a restaurant on 323 High Street in Northcote.\n\nCurrently, there are active ﻿petitions against new McDonald's restaurants in Newtown, Northcote, Manly Vale, Kalamunda and Mount Evelyn.\n\nResidents won their fight against a McDonald's in Redfern in May, while locals lost their battle against a McDonald's in Safety Beach last week .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/one-third-of-students-falling-behind-naplan-results-show/a85e907c-aa2a-4b6b-bcc9-eede1a353a52",
        "title": "One third of students falling behind, NAPLAN results show",
        "publish_date": "Tue, 29 Jul 2025 22:56:46 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "This year's NAPLAN results show roughly one-third of students continue to fall short of key benchmarks in literacy and numeracy.\n\nAbout 10 per cent of students have fallen so far behind that they need additional support, while around one-fifth fell into the category of \"developing\" the skills needed to meet expectations.\n\nNAPLAN tests provide an annual snapshot of how students in years 3, 5, 7 and 9 are performing across the country in literacy and numeracy.\n\nOne third of students are continuing to fall behind in key education benchmarks. (Getty Images/iStockphoto)\n\nThe agency that runs the test — the Australian Curriculum, Assessment and Reporting Authority (ACARA) — said the results were \"broadly stable\" but there had been some signs of improvement.\n\nYears 5, 7 and 9 students who participated in this year's NAPLAN tests are the first students to have completed 2 assessments since the introduction of the new proficiency levels in 2023.\n\nThe results showed higher NAPLAN scores on average across Years 5, 7 and 9 in numeracy, particularly among stronger students, as well as a reportable increase, from 2023 to 2025, in the percentage of Indigenous students achieving \"Exceeding\" in writing and numeracy at both Years 7 and 9, ACARA said.\n\nHowever, more than 60 per cent of the country's Indigenous students are not meeting standards in reading and numeracy across most of the year groups tested.\n\nACARA CEO Stephen Gniel said while the results were broadly encouraging, they highlighted areas needing improvement.\n\n\"The latest results also continue to highlight areas that need collective attention, such as supporting students from our regional and remote areas, those from a disadvantaged background, and Indigenous students,\" Gniel said.\n\nEducation Minister Jason Clare said: \"The improvements in literacy and numeracy are good news, but there's more work to do.\n\n\"That's what the new agreements we've now signed with every state and territory are all about.\n\n\"These agreements fix the funding of our public schools.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-soft-drink-study-diabetes/251e9105-66b6-46a9-98e1-ad7ede8a03c4",
        "title": "The soft drink habit increasing diabetes risk by more than a third",
        "publish_date": "Wed, 30 Jul 2025 00:56:02 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "Drinking artificially-sweetened soft drinks increases the risk of developing type 2 diabetes by more than a third, a new study has warned.\n\nWhilst artificial sweeteners have been recommended for those at risk of developing diabetes as a better alternative to sugar-sweetened beverages, researchers at Monash University in Melbourne found drinking one of these soft drinks a day increases the diabetes risk by 38 per cent.\n\nAbout 1.3 million Australians are affected by type 2 diabetes, with most cases linked to diet and lifestyle.\n\nArtificially sweetened soft drinks have been marketed as a better alternative for those at risk of type 2 diabetes, but the opposite could be true. (Towfiqu Barbhuiya - stock.adobe.com)\n\nConsumption of sugar-sweetened drinks also increases the risk of type 2 diabetes, and the link between the two is often explained through obesity.\n\nHowever, the study found the link between artificial sweeteners and diabetes remained strong even after adjusting for body weight, indicating artificial sweeteners could directly impact metabolism.\n\nProfessor Barbora de Courten from Monash University said the study challenged some assumptions surrounding artificially sweetened soft drinks.\n\nAbout 1.3 million Australians are affected by type 2 diabetes, with most cases linked to diet and lifestyle. (Getty Images/iStockphoto)\n\n\"Artificial sweeteners are often recommended to people at risk of diabetes as a healthier alternative, but our results suggest they may pose their own health risks,\" she said.\n\nDe Courten claims the study should be a message for consumers and policymakers alike.\n\n\"We support measures like sugary drink taxes,\" she said.\n\n\"But our study shows we also need to pay attention to artificially sweetened options.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/social-media-ban-youtube-included-in-federal-government-ban-for-under-16s/50da2a9d-21ce-44f8-8c40-1c90e165f92e",
        "title": "YouTube will not be exempt from under-16 social media ban",
        "publish_date": "Tue, 29 Jul 2025 12:56:50 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "YouTube will be included in a national social media ban for kids aged under 16, the federal government has confirmed.\n\nThe Google-owned platform lobbied for the government to make it exempt from the ban, claiming it is a \"video streaming platform\" and not a social media platform.\n\nHowever Prime Minister Anthony Albanese has announced YouTube will be captured in the landmark legislation alongside other age-restricted platforms Facebook, Instagram, TikTok, Snapchat and X.﻿\n\nShould YouTube be banned for under 16s? Yes 6179 No 4400\n\nIn a statement tonight, a YouTube spokesperson told 9news.com.au it was considering its next move.\n\n\"Our position remains clear: YouTube is a video sharing platform with a library of free, high-quality content, increasingly viewed on TV screens. It's not social media,\" the spokesperson said.\n\n\"The government's announcement today reverses a clear, public commitment to exclude YouTube from this ban.\n\n\"We will consider next steps and will continue to engage with the government.\" ﻿\n\nOther online services which don't fall under the ﻿ban include online gaming, messaging apps, and health and education services.\n\nThe Google-owned video streaming platform lobbied for the government to make it exempt from the landmark ban. (Getty)\n\nThese services are excluded in the ban because the government said they pose fewer harms to children under 16 or are subject to different laws.﻿\n\nSocial media platforms listed in the legislation will be subject to the ban from December 10.\n\n﻿The social media giants face fines of up to $49.5 million if they \"fail to take responsible steps to prevent underage account holders onto their services\".\n\n\"Our government is making it clear – we stand on the side of families,\" Albanese said.\n\nPrime Minister Anthony Albanese confirmed the list of platforms captured in the legislation. (Alex Ellinghausen)\n\n\"Social media has a social responsibility and there is no doubt that Australian kids are being negatively impacted by online platforms so I'm calling time on it.\n\n\"Social media is doing social harm to our children, and I want Australian parents to know that we have their backs.\"\n\nAustralia's eSafety Commissioner Julie Inman Grant recommended to Communications Minister Anika Wells that YouTube be included in the ban after the draft rules were released in June.\n\nWells said there is \"no one perfect solution\" for ensuring kids are safe online but said today's announcement would make a positive difference.\n\n\"﻿The rules are not a set and forget, they are a set and support,\" she said.\n\n\"There are heavy penalties for companies who fail to take reasonable steps to prevent underage account holders onto their services of up to $49.5 million.\n\n\"There's a place for social media, but there's not a place for predatory algorithms targeting children.\"\n\nThe social media giants face fines $49.5 million if they \"fail to take responsible steps to prevent underage account holders onto their services\". (SOPA Images/LightRocket via Gett)\n\nYouTube has argued it should be exempt from the ban as it would restrict political freedom and prevent people under 16 from contributing to political discourse by posting videos and making comments.\n\nIt has also argued that by allowing children to log in to the platform, it enables safety guardrails specifically designed for younger people.\n\nGoogle has also threatened to sue the﻿ Australian government if YouTube is roped into the ban after writing to Wells announcing it would consider its legal position.\n\n\"The government was firm in its decision that YouTube would be excluded because it is different and because of its value to younger Australians. This intention was repeatedly made clear in its public statements, including to the Australian Parliament,\" a spokesperson for YouTube told 9news.com.au earlier today.\n\n\"However, signals that the government is contemplating an abrupt policy reversal have prompted us to seek further clarity on this matter.\n\n\"Our position has always been clear: YouTube is a video sharing platform, not a social media service, that offers benefit and value to younger Australians.\n\n\"We have written directly to the government, urging them to uphold the integrity of the legislative process and protect the age-appropriate experiences and safeguards we provide for young Australians.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/lung-cancer-new-screening-program-diagnoses-lung-cancer-in-aussies-without-symptoms/96457415-4881-445a-b173-da3c78497971",
        "title": "Australian-first sees tumour removed from man with no lung cancer symptoms",
        "publish_date": "Tue, 29 Jul 2025 08:54:51 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "A Melbourne man has become the first patient of a national cancer lung screening program to undergo curative surgery, just two weeks after he was diagnosed with the disease.\n\nPatrick Griffin, 65, was initially referred to a lung specialist for sleep apnoea﻿.\n\nBut after meeting test criteria, including being over 50 and an ex-smoker, he was sent to the Australian National Lung Cancer Screening Program for further testing.\n\nGriffin underwent surgery to remove a quarter of his lung just weeks after he was diagnosed with cancer. (Nine)\n\nThere, a CT scan picked up stage 1 lung cancer.﻿\n\n\"I was very surprised, again because there were no symptoms,\" Griffin said.\n\nJust two weeks later, Griffin underwent surgery at Cabrini Hospital to remove a quarter of his lung.\n\n\"I probably wouldn't have got checked out because I was going along all right, [I'd] given up smoking about 12 months ago,\" he said.\n\nIn more than half of cases, lung cancer is picked up at stage 4.\n\nOnly 16 per cent of lung cancer cases are detected at stage 1, with more than half reaching stage 4 before they are detected.\n\nThe Australian National Lung Cancer Screening Program is government funded. (Nine)\n\nThere's hope the free screening program could detect as much as 60 per cent of cases, preventing more than 500 deaths every year.\n\n\"It'll fundamentally change the way lung cancer is treated in this country, and it will fundamentally change the outcome for patients,\" said Professor Chris Merry, cardiothoracic surgeon at Cabrini Hospital.\n\nAnyone who is between 50 and 70 years old, is a current or former smoker, and isn't showing any symptoms is eligible for the Medicare-subsidised program.\n\nIt's as easy as getting a referral from your GP.\n\n\"This is just changing the paradigm, really to flip the script and make more early stage lung cancers more diagnosable,\" lung specialist at Cabrini Hospital Dr Hari Wimaleswaran said.\n\n\"It's an absolute game changer for the patient, their family members, and even us as clinicians to see how impactful this screening program can be, and change the trajectory of their life really.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/june-quarter-inflation-2025-australia-2-1-per-cent/105589364",
        "title": "Breaking: Annual inflation hits 2.1pc in the June quarter, down from 2.4pc in March",
        "publish_date": "Wed, 30 Jul 2025 01:41:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Inflation eased further in the June quarter, with consumer prices rising at an annual pace of 2.1 per cent, down from 2.4 per cent in the March quarter.\n\nThe \"trimmed mean\" measure of inflation, which is the Reserve Bank's preferred measure of underlying inflation, also declined.\n\nIt fell from 2.9 to 2.7 per cent between March and June, which broadly matches the Reserve Bank's forecasts from May.\n\nOn a quarterly basis, Bureau of Statistics data show headline inflation rose by 0.7 per cent in the June quarter, down from 0.9 per cent pace in the March quarter.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/thomas-foods-reduces-capacity-due-to-drought/105589466",
        "title": "Thomas Foods International scales back Adelaide Hills operations due to drought",
        "publish_date": "Wed, 30 Jul 2025 01:39:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of the nation's biggest food businesses has scaled back operations at its Adelaide Hills site as the state battles the impact of ongoing drought.\n\nThomas Foods International operates lamb and cattle farms and provides retail-ready meat products for supermarkets, butchers and retail outlets.\n\nIn a statement, it attributed the move to the drought, but said most workers would be offered alternative positions.\n\n\"Thomas Foods International is reducing its processing capacity in South Australia due to the well-documented drought in South Australia and lower livestock supply,\" the statement read.\n\n\" The drought has sharply decreased sheep with recovery not expected before 2027, despite recent rainfall. \"\n\nThe statement did not detail how many workers had been impacted, but said the company remained committed to \"long-term operations\" at its Lobethal facility.\n\n\"Production workers were notified on Friday, and it is envisaged that most workers will be utilised under the new working arrangements,\" it said in a statement.\n\n\"Employees will be offered work at its other sites if not required at Lobethal.\"\n\nSouth Australian Independent Member for Kavel Dan Cregan posted on social media that \"hundreds\" of people had been impacted.\n\n\"Thomas Foods' decision to stand down hundreds of workers at Lobethal is hitting our community hard,\" he wrote.\n\n\"We need certainty from TFI about its plans at Lobethal.\"\n\nThe ABC has contacted Thomas Foods and the Australasian Meat Industry Employees Union for comment.\n\nAccording to its website, the company employs more than 3,000 people globally, services 85 countries and turns over $3 billion annually.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/nationals-push-for-senate-inquiry-into-us-beef-imports-decision/105586822",
        "title": "Nationals push for Senate inquiry into decision to resume US beef imports",
        "publish_date": "Wed, 30 Jul 2025 01:27:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Nationals are pushing for an inquiry into the federal government's decision to resume US beef imports, claiming the government ignored its own scientific advice when it made the decision.\n\nLast week it was announced biosecurity controls on US beef would be lifted, including beef sourced from Canada or Mexico and slaughtered in the US.\n\nNationals leader and Shadow Agriculture Minister David Littleproud says the Coalition wants the Senate inquiry to provide transparency around the decision.\n\nIt wants to get cross-party support from the Greens to launch an inquiry by the Rural and Regional Affairs and Transport References Committee.\n\nMr Littleproud said the government's decision to allow all US beef imports for the first time since 2019 was about \"getting Anthony Albanese a meeting with President Trump without looking at the proper scientific reasons nor process\".\n\nHe said an inquiry was necessary after it was revealed an Inspector-General of Biosecurity review released in March called for independent scientific advice on import risk assessments.\n\nDavid Littleproud wants more transparency over the decision to allow US beef imports back into Australia. (ABC News: Simon Beardsell)\n\nMore scientific oversight needed\n\nThe Inspector-General of Biosecurity is an independent, statutory officer appointed by the government, a role held by former agriculture veterinarian Lloyd Klumpp.\n\nDr Klumpp's March review found the federal Department of Agriculture, Fisheries and Forestry (DAFF) \"should review the role of the scientific advisory group focusing on … expanding the group's role to provide technical oversight for non-regulated import risk analyses\".\n\nHe also found import risk analyses were \"more developed and consistent in plant biosecurity compared to animal biosecurity\".\n\nHis review noted that if the scientific advisory group provided more high-level technical oversight it would address concerns raised by stakeholders involved with imports and achieve trade outcomes that aligned with the Biosecurity Act, thus safeguarding Australia's biosecurity status.\n\nThe federal government has lifted import restrictions on US beef. (ABC News: Bec Whetham)\n\nGovernment 'ignoring own advice'\n\nMr Littleproud accused the government of ignoring its own independent biosecurity advice, despite DAFF accepting that recommendation.\n\nHe said, in a briefing, the government was unable to offer any information about its import protocols or how the department would mitigate biosecurity risk.\n\n\"On the day they announced they're going to allow this beef to come in, they had not done the work to provide the [biosecurity] protocol on the way in which that beef could be bought in this country,\" Mr Littleproud said.\n\n\"They could not tell me the traceability model that they would have for these cattle that originated in Mexico,\" he said.\n\n\"That says to me the department is catching up on the [government's] deal.\"\n\n\" Every Australian should be worried about this. This is protecting us from diseases like tuberculosis and from mad cow disease. \"\n\nLabor's Agriculture Minister Julie Collins was contacted for comment.\n\nOver the weekend Prime Minister Anthony Albanese accused the Nationals of politicising biosecurity.\n\n\"The agency that looked at this, the department, independently of government, this wasn't a political decision,\" Mr Albanese said.\n\n\"They looked at it [and] said they've satisfied the requirements.\"\n\nThe Greens were contacted for comment. A spokesperson said they're yet to see the proposed inquiry details.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/qld-teachers-union-strike-cresta-richardson-john-paul-langbroek/105589264",
        "title": "Decision by Queensland teachers to strike 'not taken lightly', union says",
        "publish_date": "Wed, 30 Jul 2025 01:03:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "An immediate improvement in daily working conditions is the top priority as Queensland teachers prepare to strike for the first time in 16 years, the union says.\n\nMembers of the Queensland Teachers' Union (QTU) voted yesterday to strike for 24-hours next Wednesday, August 6, at the state's 1,266 public schools.\n\nQTU President Cresta Richardson said while meetings held over the past five months had been conducted \"in good faith\", the government's current offer did not cut the mustard.\n\n\"We just can't see how what has been on offer will make a difference in schools immediately,\" she told ABC Radio Gold Coast.\n\nCresta Richardson says conditions are just as important as salary to the union's members. (ABC News: Mark Leonardi)\n\nMs Richardson said the government had so far offered a pay rise of 8 per cent over three years and a second offer that included \"some other little things\", such as a $100 camp allowance.\n\nShe said while \"nation leading salaries\" were important to attract and retain teachers to the workforce, conditions were at the front of mind for the union's members.\n\n\"Pay is important, but what's even more important for our members is conditions that support their ability to teach and lead schools,\" Ms Richardson said.\n\n\" We know that our teachers are really worried about their conditions, we have a lot of people leaving the profession and not enough coming in. \"\n\nDecision to strike not 'taken lightly'\n\nRoughly 570,000 students are set to be impacted by next Wednesday's strike.\n\nThe QTU has asked parents to keep kids at home but also ensured students would be looked after if they must attend school.\n\nMs Richardson said calling to strike for the first time since 2009 was not a decision \"teachers take lightly\".\n\nEducation Minister John-Paul Langbroek said the department would ensure schools organised appropriate supervision for students and encouraged parents to send their kids to school next Wednesday.\n\nTeachers to strike for first time in 16 years as union seeks 'fair' pay Photo shows Primary school kids carrying backpacks on a rainy winter day. Teachers are preparing to hold a 24-hour strike next Wednesday as pay negotiations with the state government hit a stalemate, in a move which would impact more than half-a-million students.\n\nHe said student safety was the government's \"number one priority\".\n\nMr Langbroek said he wanted to \"make sure that Queensland teachers are well-renumerated and respected\" and was confident a deal would be made.\n\nHe said protected action is a \"regular part of the negotiation process\".\n\n\"It's not as if you can sit down and sort out a deal. We've made a couple of offers to the teachers' union, and they of course have been rejected,\" Mr Langbroek said.\n\n\"I know renumeration is important, but conditions as well, and that's why we are working on conciliation with the teachers' union and will continue to do so.\"\n\nJohn-Paul Langbroek says he is confident a deal will be made soon. (ABC News: Lucas Hill)\n\nMore work, same class size\n\nMs Richardson said \"it feels like the whole job has changed\" since she stopped teaching six years ago,\n\nShe said in that time the number of students that \"required additional support\" per class had grown despite classes staying the same size.\n\nExperts split on special schools Photo shows A young boy and a woman stand side by side in a pose for the camera. The Queensland government has announced the state's largest-ever investment in special schools, with Education Minister John-Paul Langbroek saying there is a \"clear demand for the schools\".\n\n\"What's changed is we have an inclusion model in Queensland which means more students with complex needs are placed in mainstream classrooms,\" she said.\n\n\"I've been talking to people that are seeing 10 or 12 students in their classes who require additional needs for the complexity that they have,\" she said.\n\n\"The maximum class size is still 28 — so we're not resourced properly.\n\nMs Richardson said the teacher shortage and occupational violence were other major issues for members.\n\n\"Just being a teacher is way more complex than it's ever been. They don't get paid overtime — they just carry the load,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/nt-power-and-water-corporation-northern-gas-pipeline-reversal/105586778",
        "title": "Expert says actions by power supplier in the NT 'unfathomable to understand'",
        "publish_date": "Wed, 30 Jul 2025 00:57:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "In a move to ease chronic gas shortages, the Northern Territory's only energy provider has requested the ability to reverse the flow of gas through a major pipeline connecting the territory to Queensland.\n\nWorks are now complete on the Northern Gas Pipeline (NGP) to make it capable of flowing in both directions, allowing the NT government-owned Power and Water Corporation (PWC) to purchase gas from the east coast gas market.\n\nIn 2019, PWC entered a long-term deal with Italian company Eni to purchase gas from its Blacktip field in the Joseph Bonaparte Gulf.\n\nThe Blacktip gas field is located in northern Australian waters. (Supplied)\n\nThe $5.5 billion deal was expected to secure supply for the NT's mostly gas-fired electricity grid and produce a surplus of gas that PWC could sell using the NGP.\n\nBut output from the Blacktip gas field has been significantly reduced since early 2021.\n\nThe ongoing shortfall has led to the company purchasing emergency gas from costly alternative sources in an effort to meet the territory's power generation needs.\n\nThe provider has been scrambling to source emergency gas in an effort to keep up with power demands in the NT. (ABC News: Lucas Hill)\n\nA spokesperson for PWC said the company made the request to allow reversed gas flow through the NGP \"as part of a broader approach to securing adequate gas supplies in the territory\", following four years of reduced gas production at Blacktip.\n\n\"Reversal of the NGP provides a backup solution if gas supply is not available from alternative arrangements,\" the spokesperson said.\n\n\"If gas is required from [the] east coast, the cost will be dependent on the gas market price at that time.\"\n\nThe major infrastructure upgrade was delivered by Zinfra in eight months. (Supplied: Zinfra)\n\nA spokesperson for pipeline owner and operator Jemena said its affiliated company Zinfra completed upgrades this month to make the NGP \"bi-directional\", following the request from PWC.\n\nAccording to Jemena, the Northern Gas Pipeline is now capable of delivering about 60 terajoules of gas a day into the NT from Queensland.\n\nThe operator's spokesperson said: \"To put this in context, this is around the same amount of gas used in the Northern Territory on a typical day for energy generation, as well as for household and industrial applications.\"\n\nJemena owns and operates the Northern Gas Pipeline and said around 60 terajoules of gas can be sent to the NT from Queensland each day. (ABC News: Katrina Beavan)\n\nAccording to its annual report, PWC contributed $18.9 million to the NGP reversal project during the 2023-24 financial year, but a spokesperson for the provider said \"total project costs have not yet been finalised\".\n\nAustralian Energy Market Operator data shows that the NGP remained unused on 282 days over the last 12 months.\n\nGas stops flowing to east coast as $800m pipeline sits idle Photo shows huge pipelines stockpiled on top of each other Gas has stopped flowing through the only pipeline from the Northern Territory to the east coast, highlighting uncertainty in the region's gas supply.\n\nDuring a hearing of the Northern Territory Legislative Assembly's Estimates Committee in June, the chair of Power and Water Corporation Board, Peter Wilson, said the NT's ongoing gas shortage was \"without precedent in the history of the Australian energy industry\".\n\n\"Here, we have been working with a significant interruption to supply for four years,\" he said.\n\nGas shortfall linked to significant cost\n\nGas is costing PWC more than anything else.\n\nAccording to the provider's corporate documents for the 2024-25, the company is expecting to record a $95.6 million operating loss in its gas division this financial year.\n\nThe company said a significant factor in its reduced profitability in the 2024-25 financial year is \"the ongoing gas curtailment\" and the hit to gas sales caused by the supply issues.\n\nPWC's gas division is expecting to record a $95.6 million operating loss this financial year. (ABC News: Michael Donnelly)\n\nThe NT's shortfall in gas supply cost taxpayers $43.4 million in 2023-24.\n\nThe Australia Institute's principal advisor and gas analyst, Mark Ogge, said he found it \"unfathomable to understand what on earth Power and Water Corporation in the Northern Territory are doing\".\n\n\"It's hard to conclude that Power and Water Corporation are competently doing their job of providing electricity to Territorians at a reasonable cost,\" he said.\n\n\"Instead of doing what they're basically meant to do, which is provide electricity for the Northern Territory, they've got into the wholesale gas market game, and they've decided to buy an enormous amount of gas and sell some of it on.\n\n\"Then, the gas project that they bought the gas from failed, so they found themselves without enough gas, and now they're having to import it.\"\n\nMark Ogge says the project that PWC \"bought the gas from failed\", leaving the NT with less supply than it needs. (ABC News: Peter Drought)\n\nMST Financial senior energy analyst Saul Kavonic said — while it's uncommon in Australia for government entities to trade gas on the wholesale market — globally, \"it's very, very common\".\n\n\"The Northern Territory hasn't got 5 million people and very large, diverse, sophisticated economic drivers,\" he said.\n\n\" It's quite small, the government's inherently going to be quite involved. \"\n\nHe argued the Blacktip deal had brought benefits to the Northern Territory.\n\n\"All things considered, it's been good for the state,\" he said.\n\nSaul Kavonic says the Blacktip deal has brought benefits to the NT. (ABC News: John Gunn)\n\nA spokesperson for PWC said the company \"remains in a position where its main gas supplier, Eni Australia Limited, is unable to meet its contractual obligations in relation to gas supply\".\n\nIn a statement, they said PWC continues to pursue \"its legal rights and entitlements\" under the 25-year gas sale agreement with the Italian energy company.\n\nWhile PWC said the exact details of the litigation are confidential, the spokesperson confirmed the provider is still working \"with Eni operationally and professionally to ensure that whatever gas is available is provided from Eni Blacktip into the Northern Territory electricity generation grid\".\n\nThe ABC contacted Eni, but a spokesperson said the company couldn't comment on the matter.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/churches-open-up-for-homeless-toowoomba/105587506",
        "title": "The 'invisible' guests taking refuge in churches on cold winter nights",
        "publish_date": "Wed, 30 Jul 2025 00:46:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "On a cold and rainy midweek afternoon, the hall at St Stephens Uniting Church in Toowoomba's CBD is a hive of activity.\n\nThe pews have been stacked to the side, and beds with blankets sit next to a long table lined with cutlery.\n\nEvery week, volunteers welcome people sleeping rough and give them a meal and a safe, warm place to spend the night.\n\n\"Then, everything's packed up and the trailers are moved onto the next church, ready for them to provide the accommodation the next night, every night of winter,\" explained parishioner and venue coordinator Shaaron Currie.\n\nIt's part of Winter Shelter, a program run by Toowoomba churches to use their facilities to offer a warm place for the garden city's homeless during the coldest months of the year.\n\nThe hall at St Stephen's is transformed every Wednesday. (ABC Southern Qld: Peter Gunders)\n\nNine churches in the city are part of the program.\n\n\"It's putting my faith into action,\" Ms Currie said. \"It's rewarding, and I see what it does to our volunteers.\"\n\nHer volunteers are like a small army, each doing whatever they can.\n\n\"Some work full time, so they bake. Some are happy to take home a basket [of clothes] to wash. We've got a lady who makes a pot of soup every week,\" she said.\n\nOther volunteers spend all night in the hall.\n\n\"There's always something you can do,\" Ms Currie said.\n\nThis year, the program has enough resources for 10 \"guest\" beds.\n\nA trailer is parked outside with a washing machine, dryer, and a shower.\n\n'Nobody should feel like that'\n\nWinter Shelter doesn't receive any funding, but fundraising has allowed the service to employ a welfare coordinator for the three months of winter.\n\nAs the welfare coordinator, mental health nurse Katrina Cox spends her time linking guests to medical help and support services.\n\nShe also liaises with the state housing sector in hopes of finding more permanent accommodation for those in need.\n\nKatrina Cox is the welfare coordinator for Winter Shelter. (ABC Southern Qld: Peter Gunders)\n\n\"A lot of the guests always say people walk past them, or cross the road when they see them, and don't want to talk to them,\" Ms Cox said.\n\n\"It makes them feel like they're invisible. Nobody should feel like that.\n\n\"I always say, 'When our Father walked the Earth, it wasn't the businessmen that he looked after, it was the people that were doing it tough.'\"\n\nEvery night, guests and volunteers have dinner together.\n\nMs Cox said it was heartening to see \"church ladies\" sharing a meal with people sleeping rough.\n\n\"Instead of sitting there with their heads down trying to be invisible, I watch them actually engaging in conversation,\" she said.\n\n\"They don't take for granted things we take for granted — like having a warm bed and a blanket that's not getting soaked by the rain.\"\n\nGuests agree to abide by the \"community code\" while at Winter Shelter. (ABC Southern Qld: Peter Gunders)\n\n'Guests' give back\n\nFive years into the program, it's now common for former guests to return as volunteers.\n\nSteven Hughes found himself living in his vehicle in 2023 and turned to Winter Shelter when his van was involved in an accident, which meant it had to be at the panel beater for a month.\n\nHe still remembers the first night he spent in a church hall.\n\n\"People were fussing over me, and just really wanting to look out for you,\" he said.\n\n\" I'd never witnessed anything like that before … people to be so caring when you're at your lowest, when I was thinking, 'What's the point?' \"\n\nVolunteers cook and bake every week. (ABC Southern Qld: Peter Gunders)\n\nTwo years on, Mr Hughes is back in the church hall, this time as a volunteer.\n\n\"You meet some great people that you'll probably be friends with for the rest of your life,\" he said.\n\n\"I just wanted to give back because they gave me so much.\"\n\nHe now has a home of his own and is grateful for the help he received, but said the help was not one-sided.\n\n\"There was one volunteer at a church, and he actually thanked all of us for changing his attitude on homeless people,\" Mr Hughes said.\n\n\"Before that, his attitude towards homeless people was, 'Why don't you get off your bum and go and get a job?'\"\n\nHe's got a message for anyone who still might have that same attitude.\n\n\"Get off their bums themselves, come and volunteer and have an open mind, and then … you'll see what [homelessness] is all about,\" he said.\n\nAs dinner is about to be served, another former guest arrives, guitar and amplifier in hand.\n\nAnthony Davidson now volunteers at Winter Shelter after being a guest in 2023. (ABC Southern Qld: Peter Gunders)\n\n\"Winter Shelter did everything for me. I came every day for three months,\" Anthony Davidson said.\n\n\" You could feel the love, and they want to share things that are lovely. \"\n\nIt's the reason he's drawn back to the church hall to help where he can.\n\nTonight, that means dinner is accompanied by power chords.\n\n\"Rock and roll helps the soul, absolutely!\" he laughs.\n\nHe looks around at his surroundings and is quick to add, \"Amen\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/a-league-women-bev-priestman-wellington-phoenix-coach/105589468",
        "title": "Ex-Canada coach returns from spying ban to lead ALW's Phoenix",
        "publish_date": "Wed, 30 Jul 2025 00:39:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "Bev Priestman, who was banned over her role in the Paris Olympics drone spying scandal, will make her coaching return with A-League Women club Wellington Phoenix.\n\nPriestman, who guided Canada to Olympic gold at the 2020 Tokyo Olympics, has signed a two-year deal with the Phoenix following Paul Temple's departure at the end of last season.\n\nCanada Soccer sacked her in 2024 and FIFA banned her for one year after opponents New Zealand uncovered Canada's surveillance tactics.\n\nCanadian football coach sent home from Paris Photo shows Bev Priestman Canada's women's football coach is removed from her position as more claims emerge of drones being used to spy on opponents.\n\nPriestman apologised and said she accepted accountability as the leader of the team.\n\nShe would have been among the top contenders to take over as Matildas coach — a role now filled by Joe Montemurro — had she not been suspended.\n\nHer ban ended on July 27, paving the way for a coaching return with the Phoenix.\n\n\"Coming back to New Zealand and seeing the Phoenix week in week out as the only professional women's team has been amazing,\" Priestman said.\n\n\"We have a responsibility now to fly the flag for this country and try to do something special.\"\n\nPriestman returns to New Zealand after heading up coach development in Wellington 16 years ago.\n\nShe has also served as New Zealand Football's director of football development, and has coached at four FIFA Women's World Cups, three Olympics and three FIFA Youth World Cups.\n\nPhoenix chair Rob Morrison said the club was excited Priestman was joining its ranks.\n\n\"We all know she's had a period of time away from the game, but we understand the circumstances and we're really comfortable with this appointment,\" he said.\n\n\"Bev can't wait to get started and we're really happy that she's going to be coaching the Phoenix.\"\n\nThe Phoenix finished ninth last season, parting ways with Temple before appointing Amy Shepard as interim coach.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/who-is-eligible-for-a-share-of-60-million-in-bank-refunds/105585308",
        "title": "Who is eligible for a share of $60 million in bank refunds?",
        "publish_date": "Tue, 29 Jul 2025 23:46:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 800,000 banking customers are eligible for refunds totalling $60 million.\n\nIt comes after a review of banks found customers had been unfairly charged high fees.\n\nHere's what to know about the refunds and whether you're eligible.\n\nWhy are banks giving refunds?\n\nThe Australian Securities and Investments Commission (ASIC) last year revealed banks had knowingly kept at least 2 million customers in high-fee accounts despite them qualifying for cheaper products.\n\nThe customers, who receive government concession payments, were found to have been unfairly charged dishonour, overdraw, assisted withdrawal and account-keeping fees.\n\nThe report named ANZ, Bankwest, Bendigo Bank, Commonwealth Bank and Westpac as having overcharged customers.\n\nLoading...\n\nWhich banks will issue refunds?\n\nThe latest ASIC report said some banks have agreed to provide compensation to more than 770,000 affected customers. They are:\n\nANZ\n\nBendigo Bank\n\nWestpac\n\nWhy isn't Commonwealth Bank issuing refunds?\n\nCommonwealth Bank and its subsidiary Bankwest have refused to refund the $270 million it had charged low-income customers.\n\nCommbank refuses to pay millions in refunds to low-income customers Photo shows A woman sits on a bench looking at an iPad Hundreds of thousands of Australians slugged more than $60 million in excessive bank fees could soon get a refund, but Commonwealth Bank customers may not see a cent of $270 million in unfair charges.\n\nA spokesperson for the bank argued the fees \"were disclosed to customers and were charged in accordance with their terms and conditions\".\n\nThe bank has previously made $25 million in \"goodwill payments\" to about 87,000 Indigenous concession customer accounts.\n\n\"Where customers have incurred unusually high fees, we consider goodwill adjustments where appropriate while continuing to provide access to lower-fee options,\" the spokesperson said.\n\nInstead, the bank said it would move 1.5 million eligible customers to a \"new nominal fee account\" that is yet to be approved.\n\nASIC commissioner Alan Kirkland said the commission currently isn't considering legal action against Commonwealth Bank.\n\n\"This is an issue about doing the right thing by customers, and in particular, doing the right thing by customers on low incomes, who can least afford to be hit by high and unfair fees.\"\n\nHow will I know if I'm getting a refund?\n\nYour bank will contact you in the coming months.\n\nWestpac said customers who are eligible can expect to receive a refund notification through their preferred communication method, which is \"usually via letter and/or email\".\n\n\"If those contact details are unavailable, alternative methods such as SMS or phone calls may be used,\" a Westpac spokesperson said.\n\nYour bank will notify you if you're set to receive a refund. (ABC Kimberley: Esse Deves)\n\nDo I need to do anything to receive it?\n\nIf you're eligible for a refund, it will be deposited into your account automatically.\n\nThe deposit will appear as a \"refund\" on your account statement.\n\nA spokesperson for Westpac said the bank expects to process most refunds by the end of this year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/magnitude-4-8-earthquake-near-wyalkatchem-north-east-of-perth/105588848",
        "title": "Magnitude-4.8 earthquake felt in Perth and across south-west WA",
        "publish_date": "Tue, 29 Jul 2025 22:45:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "A magnitude-4.8 earthquake has struck Western Australia's Wheatbelt.\n\nResidents hundreds of kilometres away felt the tremor but there have been no reports of damage so far.\n\nThe quake hit just after 2am, local time, about 30 kilometres south-east of Wyalkatchem and 200 kilometres north-east of Perth.\n\nMore than 500 \"felt\" reports have been registered since with Geoscience Australia, which said the earthquake was the largest to hit the region in recent times.\n\nSenior seismologist Trevor Allen said reports were coming from people far away from where the earthquake hit.\n\n\"The earthquake appears to have been felt extensively throughout south-western WA, including in Perth,\" he said.\n\n\"And it has been felt as far away as Kalgoorlie.\"\n\nResidents shaken, surprised\n\nDr Allen said many people might have felt the quake without realising, given it struck during the night.\n\nHe said he expected more people to report feeling the quake when they realised what happened.\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nOne resident of Goomalling, about 60km west of the quake's epicentre, said the tremor took her by surprise.\n\n\"It sounded like a truck motor starting at the other end of the building,\" she told ABC Radio Perth.\n\n\"It seemed to go through the building, as if it was going through the roof.\n\n\"I went to check outside to see if there was a truck going past. But there was nothing.\"\n\nMemories of Meckering\n\nCunderdin shire president Alison Harris said tremors were a routine part of Wheatbelt living.\n\n\"It's a concern in our area. It can be a bit triggering for us around here,\" she told ABC Radio Perth.\n\n\"The town of Meckering was absolutely decimated back in 1968. So it's certainly something we live with, especially the older generations have [strong] memories.\n\nMeckering was devastated when a magnitude-6.5 earthquake struck in 1968. (Supplied: State Library of Western Australia)\n\n\"It goes with the territory.\"\n\nRegion 'quite active'\n\nDr Allen said about 130 earthquakes had been detected across the Wheatbelt since July last year.\n\n\"The region has been quite active for the past 12 months,\" he said.\n\n\"A couple of days ago there was a magnitude-4. And prior to today's event, the largest earthquake in the region was a magnitude-4.5.\n\n\" This is certainly the largest earthquake we have seen in the current sequence in the Wyalkatchem area. \"\n\nDr Allen said the earthquake's relative remoteness would limit any destruction.\n\nWestern Australia's earthquakes explained Photo shows Supermarket aisle with groceries strewn on the floor. On average, Australia records 700 earthquakes a year, occurring all over the country — but WA is the most active both in the size and number of earthquakes.\n\nHe said those closer to the tremor would likely have experienced strong ground shaking, while anyone in Perth who felt it might have experienced a minor swaying sensation.\n\nBut he urged all those who did notice the earthquake to report it to Geoscience Australia.\n\n\"That information is not only used by us,\" he said.\n\n\"It's used by emergency services and first responders to get a better idea about the potential impacts of earthquakes.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/concerns-over-e-rideable-safety-wa-inquiry-begins/105586984",
        "title": "When does an e-bike become a motorbike? Inquiry examines e-rideable rules",
        "publish_date": "Tue, 29 Jul 2025 22:30:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Cycling bodies and advocates say clearer education and tougher import standards for e-rideables and modifications are needed across Australia as a parliamentary inquiry into their safety begins in Western Australia.\n\nLifeCycle Bikes in Margaret River, 270 kilometres south of Perth, has reported a surge in e-bike interest, with electric bikes making up at least a quarter of sales.\n\nBut assistant manager Karl Stade said the interest had been accompanied by a spike in dangerous and illegal e-bike and e-motorbike modifications.\n\nA compliant e-rideable in WA has a maximum speed of 25 kilometres per hour, weighs 25 kilograms, and has a motor that does not exceed 250 watts.\n\nBut Mr Stade said some modification kits allowed speeds of up to 100kph.\n\nKarl Stade says anyone can import an e-rideable that doesn't meet Australian rules. (ABC South West WA: Pip Waller)\n\n\"In our area, the kits are really popular — we're looking at a $50 bike from the tip with totally inadequate components on it with a high-powered motor,\" Mr Stade said.\n\n\"Generally, we're happy to work on any legal bike that comes into the store.\n\n\"But we're seeing people with full-blown electric motorbikes coming in with a throttle and high-powered motor, and we're not allowed to work on them.\n\n\" We're concerned because … the faster you go, the greater the consequences are for yourself and for other people. \"\n\nE-bikes in WA must be pedal-assisted and are limited to a 250-watt motor. (ABC South West WA: Pip Waller)\n\nMore education, stricter import rules as inquiry begins\n\nThe concern also extends to the importation of illegal e-rideables, a worry echoed by WA's peak cycling body WestCycle.\n\nChief executive Wayne Bradshaw said the Australian market was flooded with illegal devices capable of high speeds, and there was a lack of awareness about the rules.\n\nWayne Bradshaw says there should be bans on importing illegal e-rideables. (Supplied)\n\n\"Right now, I could go online and purchase an e-scooter that goes 105kph and it promotes itself as, 'Say goodbye to traffic jams,'\" Mr Bradshaw said.\n\n\"The reality is you're not allowed to use these devices on the road, so it's about stopping them from coming into Australia in the first place.\n\n\"There's a big push across all states … lobbying heavily to change the importation rules to prohibiting these devices.\"\n\nE-bike interest welcomed\n\nWA's parliamentary inquiry begins today and is scheduled to hear from representatives from several organisations, including the State Trauma Service, WA Police, the Road Safety Commission and WestCycle.\n\nIssues around electric dirt bikes will also be included, following the death of a 59-year-old woman allegedly struck by an electric motorbike at a suburban Perth park.\n\nDespite issues with illegal e-rideables and modifications, Mr Stade said it was great to see increasing interest in e-bikes.\n\n\"Because now we're seeing people riding bikes that haven't before,\" he said.\n\n\"An alternative to a teenager's first car, people who are commuting to work, young families looking for a cheaper alternative, retired people who are moving to the South West.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-30/us-open-mixed-doubles-de-minaur-boulter-kyrgios-osaka/105588826",
        "title": "US Open omits de Minaur-Boulter, Kyrgios-Osaka mixed-doubles duos",
        "publish_date": "Tue, 29 Jul 2025 21:53:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "The revamped US Open mixed-doubles event may not include proposed pairings featuring Nick Kyrgios and Alex de Minaur, but they could yet be offered places.\n\nThe qualifiers and six of the wildcards have been announced for the revamped mixed-doubles format, with two slots remaining open.\n\nKyrgios and Naomi Osaka were overlooked by US Open organisers, as were de Minaur and his fiancee, Katie Boulter.\n\nVenus Williams, fresh from last week's comeback after a year off the circuit, has been included as part of a wildcard pairing alongside fellow American Reilly Opelka.\n\nEmma Raducanu and Carlos Alcaraz are also among the wildcard entries.\n\nThe remodelled 16-team mixed-doubles event is designed to attract the attention of fans, sponsors, television and social media.\n\nDe Minaur wins epic DC decider Photo shows Alex de Minaur puts his arm around Alejandro Davidovich Fokina after their Washington DC Open final. Australia's Alex de Minaur wins an epic Washington DC Open final against Alejandro Davidovich Fokina, claiming his 10th singles title 7-3 in the final-set tiebreak.\n\nTaking place in the Fan Week ahead of the main US Open, it has a short format and prize money lifted to $1.5 million.\n\nEight pairs qualify on the strength of their combined singles rankings.\n\nThe other eight are given wildcards by the US Tennis Association.\n\nDC Open singles winner De Minaur, eighth on the ATP rankings, is the highest-ranked male player not included in the event at this stage.\n\nOne of the remaining slots could be on hold for Kyrgios to confirm his fitness.\n\nAfter his comeback playing doubles with Gael Monfils at the DC Open in Washington last week, Kyrgios posted on social media that his knee was \"cooked\", but he did complete the match.\n\nAnother slot may be kept open for women's world number one Aryna Sabalenka, who was set to be partnered with Grigor Dimitrov.\n\nBut Dimitrov sustained a pectoral muscle injury at Wimbledon when he was leading Jannik Sinner two sets to love in their men's fourth-round match.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-dip-as-wall-street-drifts-lower-20250730-p5mit3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX rises as inflation figures open the door for rate cut",
        "publish_date": "Wed, 30 Jul 2025 12:22:55 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket has inched higher at the open ahead of the latest inflation numbers, which will be released later on Wednesday morning.\n\nThe ASX 200 was 2.5 points higher to 8707.1 in early trade, with just four of 11 sectors in the green, led by energy stocks. The Australian dollar was steady at US65.17¢ at 10.31am AEST.\n\nWall Street’s benchmark index had recorded six-straight winning sessions before Tuesday. Credit: Bloomberg\n\nEnergy giant Woodside added 1.1 per cent as oil prices bounced higher overnight after US President Donald Trump reiterated he may impose additional economic penalties on Russia unless a truce is reached with Ukraine. Ampol added 1.4 per cent, Yancoal lifted by 0.2 per cent, while Santos shed 0.3 per cent.\n\nMining stocks are mixed. Rio Tinto slid 0.4 per cent ahead of the release of its latest quarterly numbers out of London later on Wednesday. Fortescue edged up 0.1 per cent while BHP slipped 0.2 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/star-losses-rise-with-queen-s-wharf-deal-on-verge-of-collapse-20250730-p5mixz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Star losses rise with Queen’s Wharf deal on verge of collapse",
        "publish_date": "Wed, 30 Jul 2025 12:19:48 +1000",
        "category": "finance",
        "authors": [
            "Colin Kruger",
            "Matt Dennien"
        ],
        "text": "Embattled casino operator Star Entertainment is facing the potential collapse of the deal to offload its troubled Queen’s Wharf precinct in Brisbane to its Asian partners a day before the deadline.\n\nUnderlying losses increased for the June quarter at Star, but the bigger problem is the possible eleventh-hour failure of the sale, according to an update to the ASX.\n\nBrisbane’s Star Casino at the riverfront Queen’s Wharf precinct. Credit: Joe Ruckli\n\nStar’s quarterly report – which precedes audited financial accounts due next month – states that it made a loss before interest, tax, depreciation and amortization costs (EBITDA) of $27 million for the quarter ending June 30 on revenue of $270 million.\n\nThe casino operator said mandatory carded play and $5000 cash limits at its flagship Sydney casino have continued to drag on its gambling performance, with average daily revenue down 17 per cent since it was introduced in August last year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/inflation-hits-four-year-low-as-pressure-mounts-on-rba-to-cut-rates-20250730-p5miu0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inflation hits four-year low as pressure mounts on RBA to cut rates",
        "publish_date": "Wed, 30 Jul 2025 12:05:39 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright",
            "Millie Muroi"
        ],
        "text": "The lowest annual inflation rate in four years has ramped up pressure on the Reserve Bank to deliver an interest rate cut when they meet within the next fortnight.\n\nThe Australian Bureau of Statistics on Wednesday morning reported that headline inflation was 0.7 per cent in the June quarter, taking the annual rate down to 2.1 per cent. It had been 2.4 per cent in the March quarter and is the lowest inflation rate since early 2021 when the country was in the midst of the pandemic.\n\nThe important measures of underlying inflation showed a 0.6 per cent increase in the quarter, with the annual rate easing to 2.7 per cent.\n\nThe underlying inflation result was the lowest since December 2021.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/inflation-data-paves-way-for-next-rate-cut-20250730-p5miy1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inflation data paves way for next rate cut",
        "publish_date": "Wed, 30 Jul 2025 12:02:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "Inflation data paves way for next rate cut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/how-a-bloke-with-a-stutter-changed-the-way-we-talk-about-wages-20250721-p5mgf4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How a bloke with a stutter changed the way we talk about wages",
        "publish_date": "Wed, 30 Jul 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Jenna Price"
        ],
        "text": "Silly me. There are a few Patience Kershaws in this book. In 1883, Eileen Creswell comes before a royal commission into working conditions in Victorian factories. She tells them she has no power, that she is no better than a slave. Byrne writes of Creswell: “To complain or argue over rates was to run the risk of dismissal.”\n\nThen 140 years later, Danielle (her last name is not given in the book) tells another story, this time to an Inquiry into Price Gouging and Unfair Pricing Practices. There was an imbalance, she argued: working people were suffering while large corporations were posting major profits. “I never thought I’d be considering whether I pay for a family member’s medication or whether we can go to the doctor.” She worked full time as a nurse but was considering a second job to make ends meet.\n\nAnd British-born James Galloway, a leader of the Stonemasons’ Society, fighting for the eight-hour work day, while a Melbourne developer dismissed the demands. Apparently, the timing wasn’t right. Such a familiar argument. We also meet Lara Watson, a self-described “mouthy barmaid”, who unionised her entire workplace in six weeks.\n\nByrne also tells the story of one man who was not a unionist but had an enormous impact on all of us. I knew about the Harvester judgment, but not much about the man who handed it down. He had one of the biggest impacts on Australian working conditions – the president of the Commonwealth Court of Conciliation and Arbitration, James Bournes Higgins. He’d entered law because he thought constant public speaking would help him with his stutter. His decision to rule on what was really a “fair and reasonable wage” had an impact on Australians for decades.\n\nByrne doesn’t shy away from telling us that unions face hurdles. Membership is in decline while Australia witnesses “growing wealth inequality, a reduction in real wages, a loosening of workplace protections, the growth of insecure work, and the rise of the gig economy”, he writes. Is this a blip? Or a trajectory?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/strange-ideas-take-root-in-this-ambitious-story-about-our-climate-crisis-20250724-p5mhk9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Strange ideas take root in this ambitious story about our climate crisis",
        "publish_date": "Wed, 30 Jul 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Gus Goswell"
        ],
        "text": "FICTION\n\nArborescence\n\nRhett Davis\n\nHachette, $32.99\n\nWe’re familiar with the idea that planting a tree is a gesture of hope, a way of helping to heal the Earth. But what about taking root and becoming trees ourselves?\n\nThe characters in Victorian writer Rhett Davis’ new novel Arborescence feel both overwhelmed and underwhelmed by life in what is recognisably a version of urban Australia. Their planet has been ravaged by humanity’s overconsumption. Their workplaces are being transformed by “alternative intelligences”. Someone has spray-painted “THERE IS NO HOPE” on a train station wall.\n\nBut something extraordinary is happening. In forests and fields, on roads and along waterways, people are turning into trees – by choice. The book’s title was our first hint that this was going to happen; arborescence means “becoming tree-like”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/trump-xi-turn-up-the-heat-in-a-battle-for-the-future-20250730-p5miue.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Whatever it takes’: Trump, Xi turn up the heat in a high-stakes battle",
        "publish_date": "Wed, 30 Jul 2025 11:58:06 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Ominously for copyright holders, he said that AI companies had to be able to use “that pool of knowledge” without experiencing the complexity of contract negotiations. The administration’s objective is to make America’s AI sector and its technologies the global standards for AI, exporting the technologies to its allies. Given how world-changing and disruptive AI might be, and the pace at which AI developments are occurring, the stakes in this contest for AI leadership are extremely high. Credit: Getty “We want the entire world to be running on American artificial intelligence stack. That is our cloud, our chips, our algorithms, all of that needs to be exported and packaged to the world so that we become the ecosystem of choice globally,” the White House science and technology director, Michael Kratsios, told Bloomberg. China’s approach, or at least the approach it publicly stated last week at the World Artificial Intelligence Conference in Shanghai, is very different.\n\nChina’s premier, Li Qiang, said AI innovation was being hampered by bottlenecks, like access to semiconductors, that could lead to AI becoming an “exclusive game for a few countries and companies.” Loading “Currently, overall global AI governance is still fragmented. Countries have great differences, particularly in terms of areas such as regulatory concepts and institutional rules. “We should strengthen coordination to form a global AI governance framework that has broad consensus, as soon as possible,” he said. China has proposed creating a new international organisation to develop AI, arguing that AI has risks that require nations to collaborate.\n\nDenied access by the US to the most advanced semiconductors, China has adopted an “open source” approach to AI, with its leading AI companies – companies like DeepSeek and Alibaba – making their large language models available to developers within and outside China as a strategy for fast-tracking a low-cost approach to developing AI and differentiating itself from Trump’s America First approach. Beijing wants China, not the US, to influence international standards for AI and its AI companies to win a bigger proportion of the global AI market. It is placing a particular emphasis on the development of AI within the “Global South” group of loosely aligned countries that it has been working to bring within its sphere of influence. Xi Jinping is taking a different approach than Trump. Credit: AP In the US, the race is on between the mega tech companies to develop artificial general intelligence (AGI), or human-level artificial intelligence. In China, Xi Jinping appears more focused on AI applications, or usages with practical applications for industries. The two countries are therefore pursuing somewhat different AI goals, which might reflect the success of America’s export controls in denying China access to the most advanced chips and chip-making equipment required to pursue AGI. It might also be that China doesn’t believe AGI will be attainable within a reasonable timeframe.\n\nIn Europe, as you’d expect, the focus has been on heavily regulating AI, prohibiting some AI practices that manipulate behaviours or are exploitative: imposing rules on the use of AI in critical infrastructure, employment and other sectors regarded as high-risk and legislating in areas like the transparency of the data used for the models, the protection of copyright and the management of risks. The competition between the US and China in particular, and the differing nature of their strategies might accelerate the development and deployment of AI, but it could also inflate the risks. In Australia, where there aren’t yet any AI-specific regulations, the prevailing sentiment appears to be for “light touch” regulation, with safeguards. Trump has effectively abandoned the safeguards the Biden regime tried to erect around the development of AI, essentially adopting the laissez-faire approach that most of the big US technology companies (which contributed heavily to his presidential campaign) have been lobbying for. Having jettisoned Biden’s guardrails, he’s told the technology advisers in the administration that they have six months to come up with a new set of AI policies that support his plan to fast-track AI projects, boost US technology exports and expunge the “woke” out from AI.\n\nHe has said he will use every rule at his disposal to facilitate the building of AI infrastructure like data centres and chip-manufacturing plants and the energy infrastructure they require and use the US export-Import Bank and Development Finance Corp to help spread US AI technologies to other countries. The US will do “whatever it takes to lead the world in artificial intelligence,” he said. Given that those developing AI systems have themselves warned that it poses risks, not just to individuals but humankind, Trump’s deregulatory approach is itself risky. Moreover, the competition between the US and China in particular, and the differing nature of their strategies might accelerate the development and deployment of AI, but it could also inflate the risks.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/they-bought-a-knockdown-rebuild-and-got-a-fight-over-thornbury-s-tallest-trees-20250729-p5mils.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "They bought a knockdown rebuild and got a fight over Thornbury’s tallest trees",
        "publish_date": "Wed, 30 Jul 2025 11:56:29 +1000",
        "category": "finance",
        "authors": [
            "Tom Cowie"
        ],
        "text": "The new owners of a dilapidated house in Thornbury bought at auction for more than $1 million are now locked in a battle with locals who want to protect two large eucalypts believed to be among the suburb’s tallest trees.\n\nThe City of Darebin is considering an application in Ballantyne Street to remove two silver gum trees on a private property that could date back to the construction of the house more than 100 years ago.\n\nLocals in Thornbury want to protect two silver gum trees that are at risk of being pulled down. Credit: Justin McManus\n\nThe larger of the two is estimated at more than 25 metres tall and believed to be one of the tallest trees in Thornbury.\n\nThe trees sit on the western edge of a block which sold at auction nearly two months ago as a deceased estate for just over $1 million.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-oil-tanker-docks-at-kwinana-port-20250729-p5misl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: West Coast boss concedes club considering asking AFL for help to be more competitive",
        "publish_date": "Wed, 30 Jul 2025 11:50:08 +1000",
        "category": "sports",
        "authors": [],
        "text": "West Coast chief executive Don Pyke has just been interviewed on SEN WA Mornings, saying he believes the Eagles are in a position to request a leg-up from the league.\n\nThe club is facing another wooden spoon this season, and have won just 11 of their past 91 games since late 2021.\n\nWest Coast CEO Don Pyke. Credit: Getty Images\n\nPyke said the poor results mean the club is “well and truly in the window” to ask the AFL for draft compensation, although he says he is yet to formally make the request.\n\n“I’m mindful of people saying, ‘Well, West Coast got into this problem, so they should just work their way out of it’,” he said.\n\n“But this is the essence of equalisation. The equalisation across the comp is designed to allow clubs to not spend a long period of time either at the top or at the bottom.\n\n“I think we’d not be doing our duty if we didn’t ask the question about ‘How do we get any assistance we can?’ if it’s available to help us get out of this and get back to playing competitive, strong footy week-on-week.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/does-not-belong-in-this-country-hockey-australia-stands-by-peris-as-more-anti-islam-re-posts-emerge-20250730-p5mity.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Does not belong in this country’: Hockey Australia stands by Peris as more anti-Islam re-posts emerge",
        "publish_date": "Wed, 30 Jul 2025 11:47:44 +1000",
        "category": "sports",
        "authors": [
            "Chris Barrett"
        ],
        "text": "Hockey gold medallist and former Labor senator Nova Peris shared a series of social media posts scathing of Islam in the lead-up to her election as a director of the sport, including one which said the religion “should be banned in the West”.\n\nPeris was voted onto the board of Hockey Australia last month, nearly three decades after her triumph with the national women’s team, the Hockeyroos, at the 1996 Atlanta Olympics.\n\nNova Peris has become a prominent advocate for Israel and a voice against antisemitism. Credit: Aresna Villanueva\n\nBut her position as a director of the government-funded national federation has come under question because of comments she has re-posted online this year.\n\nThis masthead reported that the pro-Israel campaigner shared a comment from another user on X in April that called Muslims “Satan worshipping cockroaches that need to be eradicated”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/she-was-busted-for-cheating-at-the-olympics-now-she-s-coaching-in-the-a-league-20250729-p5mio4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "She was busted for cheating at the Olympics. Now she’s coaching in the A-League",
        "publish_date": "Wed, 30 Jul 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "A few days before Imane Khelif became the centre of the world’s attention, the biggest controversy at the 2024 Olympic Games in Paris involved a drone. On the eve of New Zealand’s first women’s football match, Rebekah Stott spotted the craft hovering over the team’s training session.\n\n“We were just doing throw-ins, and I was waiting for Ali Riley to throw me the ball and I hear this noise,” Stott told Sam Mewis, the former American international, on her podcast The Women’s Game last year.\n\n“I’m a bit of a drone enthusiast, I’ve got one myself, and so I hear this noise, and I’m like, ‘Oh my gosh ... is that a Mavic Pro?’”\n\nQuite aside from the fact that flying drones above people was illegal in France, Stott’s discovery unravelled one of the biggest scandals in women’s football history.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-femmes-wiebes-claims-back-to-back-stage-wins/dujpwuwag",
        "title": "Tour de France Femmes: Lorena Wiebes claims back-to-back stage wins",
        "publish_date": "Tue, 29 Jul 2025 21:20:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "Lorena Wiebes has stormed to her second successive stage victory at the Tour de France Femmes, winning the fourth leg with a dominant sprint finish.\n\n\n\n\n\nThe Dutch rider from Team SD Worx launched her move around 250m from the line and proved untouchable, sealing another stage victory.\n\n\n\n\n\nFellow Dutch rider Marianne Vos again took second place, with Ireland's Lara Gillespie third.\n\n\n\n\n\nWiebes also triumphed in a chaotic sprint on Monday and now sits second overall, trailing Vos, who retains the yellow jersey.\n\n\n\n\n\nSarah Gigante finished 49th on the stage and remains the highest-placed Australian in 19th overall.\n\n\n\nIt was Wiebes' fifth stage win overall, a record since the event's revival in 2022. Jeannie Longo holds the all-time record, with 24 stage wins from 1985 and 1989.\n\n\n\n\n\nOn the largely flat 130.7km stage from Saumur to Poitiers, the peloton remained tightly packed until the closing stretch before a showdown amongst the sprinters.\n\n\n\n\n\nWiebes timed her effort perfectly, leaving her rivals unable to respond before it was too late.\n\n\n\n\n\nFormer champion Demi Vollering continued racing despite a heavy crash on Monday.\n\n\n\n\n\nVollering, from the FDJ-Suez team, underwent medical tests that excluded a risk of a concussion and finished the day safely in the peloton.\n\n\n\n\n\nShe remained sixth overall, lagging 25 seconds behind Vos.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/talking-to-kids-about-the-climate-crisis/gmzhxbnj6",
        "title": "Talking to kids about the climate crisis",
        "publish_date": "Tue, 29 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nNic: This is a lifelong conversation that we are all going to be a part of and we need to see it in that way. If you need a break, take a break, come back to it later. Don't see it as an all or nothing. Don't let yourself burn out. We've got too much pressure to let something like this take away the positive change that we can create for our kids.\n\n\n\n\n\n*music*\n\n\n\n\n\nSB: Extreme weather events – whether floods, fires or cyclones – have become increasingly common. Scientists say they’re fuelled by climate change, and that the world is currently off-track to limit a global temperature rise to prevent the worst impacts of the climate crisis. Nic Seton is the CEO of an activist group called Parents For Climate and he wants to do something about it.\n\n\n\n\n\nI’m Sophie Bennett and in this episode of the Beta Blueprint, we'll discuss how parents can help influence change and how to navigate climate conversations with young kids.\n\n\n\n\n\n*music*\n\n\n\n\n\nSB: Thanks for joining me Nic, to start with why do you get into climate activism?\n\n\n\n\n\nWell, I grew up on the fringes of suburbs in Logan and Queensland and really saw a lot of expansion and just with the local community felt very concerned about new freeways and the removal of forests. And then as I grew older, I realised that this is actually a big global condition that we've kind of industrialised to the point of actually undermining our own ecosystems. And I got really engaged in climate. I signed up for everything I could find to sort of campaign and make a difference. And then seven years ago I became a dad and that's when it all got very real in a different way. I sort of stopped thinking about climate change and started feeling it, particularly during the Black Summer bushfires. My 3-year-old boy at the time suffered quite acute bronchiolitis and was hospitalised a few times with need for oxygen and he was one of thousands of kids who were struggling to breathe under 90 days of constant smoke. And we were in Sydney, we're not in the middle of the bush, but we were really feeling it hard and it felt very personal. It is hard to describe, but if you've ever had a moment where your kid is in danger and you want to do something to protect them, it's very, very motivating. And I saw Parents for Climate around that time and I thought that's absolutely the organisation I want to be a part of and to help other parents respond to that constructively and make a difference for their kids.\n\n\n\n\n\nSB: Yeah, I remember that summer it was truly horrible. So, with the Parents For Climate group, can you tell me a bit more about it?\n\n\n\n\n\nSo I literally just saw a notice in a cafe, in a cafe window in the inner west of Sydney and it just said, come along, we're just having a meetup, we're doing a playgroup. Bring your kids, we've got toys. We're having a chat about climate activism. I thought, well, that's a great place to start because most parents don't really know what actions to take or don't have a lot of time, but if you can fit it in because you need a play date and frankly socialising your kids and meeting some other parents is pretty important to you, especially with young kids that just fit our schedule beautifully. And so it just so happened to be that we were coming together for that and for a positive conversation about climate action. And yeah, I really found a home there.\n\n\n\n\n\nSB: When you mentioned before that you said you started really feeling climate change rather than just being aware of it … would you describe that feeling as climate anxiety or a heightened level of fear?\n\n\n\n\n\nDefinitely, I'm one of those people that want to know as much as possible on the issues of things like climate change. And I do as much reading as I can and reading different perspectives and I think it sort of led me to understand that we're going to struggle to deal with some of the fallout of climate impacts for the next few decades as a community, as society, and also just as individual families. And this really hit home when I was talking to Professor Mark Howden, so he's an ANU climate scientist and one of the lead authors on the Impacts report from the most recent International Panel on Climate Change and he is also a dad. And he said, yeah, look, I'd gladly talk to your community online. We ran a webinar and people just sort of said, how bad is it? It was a hard conversation. He really sort of said, this is what we know could happen. But he also said something that was very motivating, which was we could turn this around in the lifetimes of ourselves, not just our kids, but our own eyes could witness our kids' world becoming safer from a climate perspective. If we get it right, if we get on top of this, the next few decades will be hard, but there is a world we will live in if we get it right. And that's so powerful to hear because while knowing your kids have to go through so much growing up and all the change that comes with that and there's going to be hard times, you accept that and still do everything you can to set them up for success. And I think climate change is no different.\n\n\n\n\n\nSB: Ok, so when it comes to practical action, what are you doing now as a parent?\n\n\n\n\n\nLook, I sometimes describe Parents for Climate as both a home for those parents who maybe are starting their journey into climate action and just need a sense of community and to be seen and heard and felt and respected and belong. But it's also a strategy. Parents for Climate plays a really big role in power and politics because 12.5 million Australians are parents. It's the majority of voters. There might be grandparents, there might be carers, there might be single parents, but we've all got this innate prioritising of our kids' best interest going on. And research in the Climate Compass, which looks at attitudinal profiles towards climate change, shows us that about a quarter of those parents are already alarmed or alert, they're engaged, they're switched on to wanting to do something about climate change, but in another quarter the bit that start to cross over into the middle of the normal curve, they're concerned but they're quite passive. They're not given the time, space, opportunity, or access to make a difference. And that's what our organisation is focused on is working with those people who are active to really connect with and support those who aren't yet active. But if asked, they have a strong opinion to express and want to see things that are in the best interest of their kids and that could be really powerful and we're already seeing it play out. The current parliament has a cross bench made up of climate champions, which wouldn't be there if it wasn't for the mums in particular in those electorates who decided to change their vote from their traditional pathway to that particular option.\n\n\n\n\n\nSB: So you’re talking about driving political change, but maybe not through some of the more reactionary ways you tend to see in the media, like people throwing paint on famous artworks or blocking ports and roads.\n\n\n\n\n\nThat's right. I think the media's really good at showing those moments, those peaks of conflict or action that are maybe a bit more polarising. And to be honest with you, I know that very well because my background, I spent seven years working with Greenpeace in different countries. I specialised in how to engage audiences and get their attention on issues by creating big spectacles and polarisation moments. Like to give you an example, back in the early 2000's, tweens, I was figuring out how to attach iPhone cameras to the tops of climber's helmets so that a team of female climbers could scale the outside of London's tallest building and hang a banner. And we managed to get the attention according to YouGov polling of half the country in the UK during that moment.\n\n\n\n\n\nSB: It's interesting too that you've come from that background working with GreenPeace and doing those big stunts. Do you still believe that they're effective?\n\n\n\n\n\nYeah, in climate campaign circles, we often refer to this as different theories of change. How does change happen? And generally speaking, we don't all agree on the theory of change, but we all agree that we need all of them because we don't know which one's going to be the most effective till we try it. And the metaphor I use is if you want to put out a fire, you're going to need a pretty big blanket and you're not going to be able to be covering every corner yourself. You're going to need a lot of people tanking on different corners. One succinct way to put it is we need to build bridges on climate. We've learned in Australia that polarisation, partisanship and extreme points of view can cost us so much time and so much energy and so much missed opportunity. We've got to build common ground. We've got to agree on there's the principles that's in everybody's best interests because this isn't an us versus them that's totally manufactured and made up, it's everybody's kids altogether. Let's get it done for them.\n\n\n\n\n\nSB: Your children are 4 and 7, have you started discussing the climate with them? How do you plan to navigate those conversations?\n\n\n\n\n\nI think on a personal level, the conversation we have in our family about climate change, we've done a bit of reading and we've made some of these resources available on the Parents for Climate website. It's important not to go too heavy, too hard and too strong on the emotion side of this conversation. These are big conversations. Any big world issues, global conflict health and pandemics, climate change, you don't just drop it all on top of your kids with all of your feelings. You've got to listen to them first. So you've got to ask them, what do you know? What have you heard? How are you feeling about this? And get a read on where they're at so that you are not trying to shape it. Then you've got to check yourself how do you feel as a parent? And if you are not in the right emotional space to be giving them a constructive and positive direction, don't go there. Just take a break. You don't have to solve the problem with them in every moment, but of course if you are ready to listen to them and say, okay, where are you at? Got it, let's talk about this and talk about it in constructive terms because it's a problem that we are solving and it's always got to be in that frame because if we say to kids, this is a problem and there's nothing you can do about it that's so disempowering. It's not good for their self-esteem, not good for their mental health at any age, and it's also not true.\n\n\n\n\n\nWe're at halfway to a 2030 target already on renewable energy. We're seeing 40% in Australia. There's terrific examples of how renewable energy or climate solutions are happening at a grand pace that is actually really exciting. And so it's really useful to point to those examples of this is how we're dealing with this problem and talk about how would you like to engage with that. They might talk about careers or ideas or they might say, let's do some art and drawing and create pictures. Sometimes when I go into classrooms, I really love pulling up a slide that comes from a Bluey episode where they picture the future. They just do a sort of brief landscape and they picture the future of what Bluey might look like when she's an adult and the kids point to the screen and they call out all the things they can see, like solar panels and the plants are on the buildings and the car is electric. It's really exciting to think about the future where we're building together, and I think that's the attitude we need to give our kids so that it builds them up, makes them feel strong and resilient and also gives them some control.\n\n\n\n\n\nSB: So being in classrooms and having your kids at home, do you think this generation will be different to previous ones?\n\n\n\n\n\nDefinitely. I think, and the teachers do an amazing job here when kids are learning about influence and media or discourse or advertising or geography and weather cycles and rain patterns, and they're coming home with this immense interest and fascination in what they're seeing in the real world, not just at school, how the weather's behaving. And so we're talking about it all the time. I think it's something that we just need to be ready for. There will be a lot of changes in our own world. Right now for example, our organisation's looking at the fact that for the last few years we've had a pattern of the back to school week being one of the most heavily impacted in Australia by unnatural weather disasters. We are observing this stuff and our kids are too, and it's hard to know where things will happen and when, but we need to be ready to have those conversations and to equip the kids with the understanding. We also need to be ready as a community, we need to be ready to have a conversation about what types of changes might we need to make. How can we set schools up so that they have solar powered air conditioning with a battery that's resilient to power outages during heat waves because that's an issue that's affecting kids' health and their access to education or as in the case of countries like the Philippines, do we actually need to talk about, and I know this might alarm some parents who are just done with the school holidays this year, but do we need to talk about moving the academic calendar? Because if the first week back at school is too heavily exposed to risk, particularly risk to health, but also education, we might need to think about how to adjust to that even if it's uncomfortable.\n\n\n\n\n\nSB: Yeah, that's interesting. What other changes do you think need to be happening right now?\n\n\n\n\n\nYeah, look, this all kind of falls out from solving climate change for kids can be boiled down to a few basic points. We need to make sure that we stop making the problem worse. And so we're talking to parents about what kind of products are you experiencing that might be creating unnecessary pollution or not necessarily accounting for that pollution accurately. Another aspect is that we need to make sure that kids are safe at school and in any environments they go to. That means looking at what are the adjustments we need to make to keeping them safe from a lot of the impacts we can't avoid. Schools should be resilient in places of learning. We already know that childcare centres have a legal requirement to maintain safe air temperatures, for example. Schools need to be supported to do that too. Many states have already done significant air conditioning rollouts. There are still massive gaps in some states and that really needs to be backed up by clean energy and solar panels because ultimately that is just the most cost effective way of getting it done.\n\n\n\n\n\nSchools are open during the day, they cool during the day and they need to use that daytime energy. It also creates a different kind of grid equation which can benefit community at large when it comes to solar supply and renewable energy and its impact on wholesale electricity prices. We also want to make sure that kids are safe at home. Unfortunately, not all homes are able to do that without support. You've got low income homes, you've got renters, you've got social housing that just don't have the agency or the autonomy to make changes to their living conditions and frankly should be supported to also have an efficient all electric and air conditionable home so that they can withstand the worst effects of heat and storms. And lastly, we just need to make sure we're getting it done in a way that's really visible to our kids. We want to make sure that we're building essentially resilient infrastructure in the form of schools and childcare centres in particular that are powered and backed by solar and batteries because we think at scale, not only could that be fantastic for the equation of each of those individual centres and sites, but at scale that would actually be a significant change, like top 10 electricity users, if you include all the energy and carbon that goes into schools and drop-offs and all of this, we could be talking about the fifth biggest energy consumer industry in Australia. It's just getting our kids educated at high school and primary school and childcare centres. If we tackle that by saying, well, why don't we just use that roof space, that huge roof space to turn that around, then we can get that done. And that's something that we've been working on. Some states have worked with us towards some progress. We've seen about 71 million across three states unlocked to fund solar and battery installations. We think it should be Australia wide. It's a bit of a no brainer, and I think a lot of the politicians we're talking to agree with us. We just need to get it up to the hierarchy of issues on their agenda.\n\n\n\n\n\nSB: It’s good to hear you talk about those large scale projects. Just reflecting on my own childhood, there was a lot of talk around individual action like recycling and eating less meat and obviously while they're good things to do, just that list of things you've just said, it's clearly putting the responsibility on governments and businesses rather than only individuals. Do you think there has been a transition in the way people consider who is responsible when it comes to climate change?\n\n\n\n\n\nI think so. I think a lot of Australians are sort of coy to the notion that they are responsible for this. This is a bigger systemic issue and we see it in polling, across polling from all sides of the spectrum, hearing that Australians want more action from government, they want more action from industry and business. They get that those actors are capable of making differences that an individual simply can't by themselves. But also it's potentially really positive to think about individual action because if you show your kids in your own life that you take care, you do some active transport, go walking or bike riding rather than driving your car on the occasion just because it's good for us and it's the kind of world that we want to create, show how you're managing your own household waste, things like that. Not only does that help your kids see and feel and get involved and feel quite a degree of agency and empowerment, it also helps us all to see ourselves as agents of change and just to feel good about making that little difference that we can make. Because at the end of the day, these are big issues that are beyond the capability of an individual.\n\n\n\n\n\nSo we have to think, well, what can we control and focus on that. But I highly recommend connecting with others because if we connect, we get stronger and that means we can affect the big picture and that's something that we're focused on doing. So we are trying to present big ideas to parents so that we can get them on board. But of course it starts with what can we do at home and how can we get our kids involved? And that's something to be really proud of as well. I think the number one trap that I want people to watch out for is feeling like they're not doing enough. I mean, God, it's hard enough as a parent these days to not feel guilty for spending too much time at work or not doing everything you can for your kids or all of those extra clubs you could be going to with the sports involvement or whatever, take the pressure off. You are not responsible for this issue. Do what you can. And if the best you can do right now means you have to use a product that might not be perfect, that's fine. Let's focus on working together to fix the supply chain so that you are not responsible for that decision on your own.\n\n\n\n\n\nSB: Yeah, I think that's an important message to send out. And just quickly before we wrap up, is there any other final advice you have for parents navigating climate activism and raising kids?\n\n\n\n\n\nThis is a lifelong conversation that we are all going to be a part of and we need to see it in that way. If you need a break, take a break, come back to it later. Don't see it as an all or nothing. Don't let yourself burn out. We've got too much pressure to let something like this take away the positive change that we can create for our kids. So I do want to remind everybody, particularly parents, that the world's not on your shoulders. Let's shoulder it all together because you're not alone and you don't have to do it all, all the time.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-basem-abdo-australias-first-federal-mp-with-palestinian-heritage/ie3casfs6",
        "title": "INTERVIEW: Basem Abdo, Australia's first federal MP with Palestinian heritage",
        "publish_date": "Tue, 29 Jul 2025 09:39:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/federal-judge-dismisses-covid-cruise-ship-class-action-appeal-but-negligence-ruling-upheld/aku2bb8sz",
        "title": "Federal judge dismisses COVID cruise ship class action appeal but negligence ruling upheld",
        "publish_date": "Tue, 29 Jul 2025 09:34:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Federal judge dismisses COVID cruise ship class action appeal but negligence ruling upheld\n\nPublished 29 July 2025, 6:46 am\n\nFederal judge dismisses COVID cruise ship class action appeal but negligence ruling upheld ABSTRACT: The Federal Court has dismissed two appeals related to the class action against Princess Cruise Lines over the Ruby Princess COVID-19 outbreak in 2020. One appeal sought to increase compensation for a passenger, while the other was filed by Carnival Cruises, challenging an earlier court finding of negligence.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/labor-scrambles-to-anticipate-trumps-next-tariffs-play/q3sqd3j8d",
        "title": "Labor scrambles to anticipate Trump's next tariffs play",
        "publish_date": "Tue, 29 Jul 2025 09:31:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor scrambles to anticipate Trump's next tariffs play\n\nPublished 29 July 2025, 6:46 am\n\nThe Australian Government is scrambling to make sense of the latest remarks from the US President which suggest the nation could face higher tariffs than anticipated. As the deadline for the decision looms, the opposition remains convinced the lack of face-to-face negotiations has led to a worse outcome for Australia.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-challenging-wine-industry-reporting-season-preview/tpsywfy7y",
        "title": "Australia's challenging wine industry & reporting season preview",
        "publish_date": "Tue, 29 Jul 2025 07:37:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/are-australians-at-risk-from-lifting-the-restrictions-on-us-beef-imports/r4sl79ker",
        "title": "Are Australians at risk from lifting the restrictions on US beef imports?",
        "publish_date": "Tue, 29 Jul 2025 06:23:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"Australia bans — and they’re wonderful people, and wonderful everything — but they ban American beef. Yet we imported $3 billion of Australian beef from them just last year alone. They won’t take any of our beef. They don’t want it because they don’t want it to affect their farmers and, you know what I don’t blame them, but we’re doing the same thing.”\n\n\n\n\n\nWhen United States President Donald Trump singled out Australia's ban on US beef imports, Prime Minister Anthony Albanese said he would never compromise on protecting farmers or biosecurity.\n\n\n\n\n\n\"We have made it very clear to the United States that we will not compromise on biosecurity. We will not weaken the measures that protect our farmers and producers from the risks of disease or contamination. Indeed, we've made it a priority to strengthen biosecurity, because one of the things that makes Australian food and fibre the best in the world is a people everywhere, know that it stands for quality. It also stands for safety.\"\n\n\n\n\n\nNow, ahead of the tariff deadline on August 1, Australia's restrictions on US beef imports have been dropped.\n\n\n\n\n\nBut the government says the timing of the decision is a coincidence, and has nothing to do with Donald Trump.\n\n\n\n\n\nMinister for Agriculture, Julie Collins, says a review into the US beef ban began in 2015 under the Coalition Government.\n\n\n\n\n\n\"This decision has been purely based on science and a rigorous assessment by my department. Biosecurity risk assessment process is very robust and I have faith in the officials in my department to do this appropriately. These are experts in the field. Australia's biosecurity system is world-renowned for a reason and this assessment has now been completed.\"\n\n\n\n\n\nIn 2019, Australia changed restrictions to allow beef imports from cattle traceably born, raised, and slaughtered in the US.\n\n\n\n\n\nIn practice, however, the ongoing biosecurity rules meant that only a small amount of beef, largely shelf-stable products, were imported from the US.\n\n\n\n\n\n\"We are assured that the supply chain and traceability and the safety of any food coming into Australia is safe. The US, of course, has been able to bring beef into Australia since 2019. Our farmers, are of course, are exporting already to the United States. We're exporting over four billion dollars' worth of beef to the United States presently and our farmers are a net beneficiary of our two-way trading system.\"\n\n\n\n\n\nSo, why was the ban imposed in the first place?\n\n\n\n\n\nAnd should Australians be concerned about eating beef imported from the US?\n\n\n\n\n\nIn 2003, Australia placed restrictions on the import of US beef in response to an outbreak of bovine spongiform encephalopathy, more commonly known as Mad Cow Disease.\n\n\n\n\n\nHumans cannot contract mad cow disease, though in rare cases they can develop a variant which leads to dementia and premature death.\n\n\n\n\n\nHowever, the Australian food regulator deems US beef is low-risk.\n\n\n\n\n\nTrade Minister Don Farrell says the government would not compromise standards for trade.\n\n\n\n\n\n\"We have not made any compromise and we certainly have not compromised Australia's strict biosecurity laws. This has been a process that's been underway for the last 10 years. It's now come to a completion and it's appropriate that we announce the results of that inquiry. But at no stage do we risk our terrific biosecurity standards for any trade arrangement.\"\n\n\n\n\n\nOne key concern remaining after 2019 was that Mexico's livestock tracking system could inadvertently allow beef from disease-affected regions to enter Australia.\n\n\n\n\n\nHowever, the government says the review has found that the US Department of Agriculture protocols for beef imported from Canada and Mexico now address Australia's biosecurity concerns.\n\n\n\n\n\nMark Thomas, the Chair of the Western Beef Association, says it's unclear how effective the US tracking system is.\n\n\n\n\n\n\"Well, we implement an NIL system, as they call it, so any animal that's born on your property has a electronic tag, and that same tag is scanned and transferred whenever that animal leaves your property, all the way through to sort of slaughter. So an animal that's been slaughtered, they can go back and work out where that animal has been over its lifetime. I am unsure how quickly America can get up to speed. However, it's taken many, many years for Australia to implement that system and make sure that it works efficiently.\"\n\n\n\n\n\nDespite government assurances, National Party leader David Littleproud is among critics calling for an independent examination into the matter.\n\n\n\n\n\n\"The government has not provided or released the protocols on which the beef from the U.S could be imported into this country. Those are the legal requirements that an importer would have to meet to bring beef from the United States into Australia, that was from Mexico or Canada. The fact they haven't done that raises serious concerns to me around how this decision has been made and the timing of it. If it was well planned, the department would be able to provide me with those details. They have not. I think the prudent way forward is to have an independent scientific panel review the department's decision and the protocols when they came out.\"\n\n\n\n\n\nAlong with concerns about the spread of disease, there are also concerns about differing US regulations around the use of hormones and antibiotics on cattle.\n\n\n\n\n\nWhile some cattle in the US are given approved natural or synthetic hormones to help them grow, the US Food and Drug Administration regulates these, and experts say they are in extremely low levels.\n\n\n\n\n\nUS beef, according to both Australian and US officials, is safe to eat, but is it better than Australian beef?\n\n\n\n\n\nEvangeline Mantzioris is the Program Director of Nutrition and Food Sciences at the University of South Australia.\n\n\n\n\n\nShe says the diet of an animal impacts the nutritional value of the meat.\n\n\n\n\n\n\"What it comes down to is the type of feed that the animals are given. So in the US they tend to be grain-fed whilst here in Australia, they tend to be grass-fed, and that produces differences in the way that the body of the cow handles it and in the way that they make and lay down fat in their body. The other thing that might make a slight difference is also the genetics of the cows. So assuming it's the same breed of cow, we expect grain-fed to lead to more fat in the meat compared to grass-fed.\"\n\n\n\n\n\nStudies show that grass-fed beef can be 30 to 75 per cent lower in fat than grain-fed.\n\n\n\n\n\nGrass-fed is also reported to have higher levels of beneficial Omega-3 fats, up to five times more antioxidants, and slightly higher protein, with some studies also indicating lower cholesterol.\n\n\n\n\n\nSo, for consumers, choosing between local and imported beef will mostly come down to personal preference rather than health concerns.\n\n\n\n\n\nDr Mantzioris says while the differences aren't major, grass-fed beef is the best option.\n\n\n\n\n\n\"So if we combine all of those different components of the beef that we've looked at, overall grass fed beef, which is what we have in Australia, is the healthier option.\"\n\n\n\n\n\nBut what about Australian farmers?\n\n\n\n\n\nWhen Australia lifted the ban, Donald Trump wrote on social media that the US was now going to sell 'so much beef' to Australia.\n\n\n\n\n\nAustralia is the second largest exporter of beef products in the world.\n\n\n\n\n\nAnd while Australians are some of the highest per capita consumers of beef products, our relatively small population means we have a lot left to export.\n\n\n\n\n\nMark Thomas says he isn't too worried about competing with U-S products.\n\n\n\n\n\n\"Well, I suppose, from a from a cattle perspective's point of view, our only concern would be if we thought that US beef was going to compete with our own product here in Australia, and I don't believe that that is going to do so based on the price of cattle in the US over a longer period of time and considering their cattle numbers compared to what we have here in Australia.\"\n\n\n\n\n\nIn fact, US cattle stocks have been in decline for two decades.\n\n\n\n\n\nThe United States is the second largest importer of beef globally and cattle stocks in the country are the lowest they've been since the 1950's.\n\n\n\n\n\nThe US Department of Agriculture says beef prices have increased by 8 per cent since the start of 2025, with one kilogram of beef costing around AU$30..\n\n\n\n\n\nMark Thomas says with beef shortages in the United States, it's unlikely the Australian market is going to be flooded with imported US beef.\n\n\n\n\n\n\"Well, currently, there's a lot of Australian beef going into the US market, purely because they need it. At the moment, cattle prices in the US are just quoting a heavy steer close to $5 whereas that same animal in Australia is only going for $2.50 so how can they purchase an animal for $5 a kilo? Process it, send it to the other side of the world and expect to compete with the product that we have here?\"\n\n\n\n\n\nWhile beef prices have been increasing in the United States, Australian beef exports broke an all-time monthly record in June.\n\n\n\n\n\nAnd the biggest buyer was, that's right, the United States.\n\n\n\n\n\nIn New York, Stew Leonard Junior is the CEO of a grocery chain.\n\n\n\n\n\nHe says he gets grass-fed beef from Australia and plans on splitting the tariff cost with his supplier.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-dip-as-wall-street-drifts-lower-20250730-p5mit3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX rises as inflation figures open the door for rate cut",
        "publish_date": "Wed, 30 Jul 2025 12:22:55 +1000",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "The Australian sharemarket has extended gains after the Reserve Bank’s preferred measure of inflation fell to 2.7 per cent annually, adding to pressure on the central bank to deliver an August rate cut.\n\nThe S&P/ASX 200 was up 44.9 points or 0.5 per cent to 8749.5 around noon, after the Australian Bureau of Statistics data release, with just one of 11 sectors in the red. The Australian dollar was steady at US65.18¢ at noon AEST.\n\nThe ASX welcomed the latest inflation figures Credit: Oscar Colman\n\nTrimmed mean inflation, which omits volatile items to measure underlying growth in prices, came in at 0.6 per cent in the June quarter, the Australian Bureau of Statistics reported on Wednesday. The figure was in line with consensus expectations. It represented a 0.2 per cent drop in the annual trimmed mean from the March quarter and continued progress towards the midpoint of the Reserve Bank’s two to three per cent target band.\n\nBut the result was slightly above the central bank’s forecast in its latest statement on monetary policy in May. Nevertheless, alongside a recent uptick in unemployment and weaker-than-expected household spending, it should be enough to secure another 25 basis point cut.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/star-losses-rise-with-queen-s-wharf-deal-on-verge-of-collapse-20250730-p5mixz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Star losses rise with Queen’s Wharf deal on verge of collapse",
        "publish_date": "Wed, 30 Jul 2025 12:19:48 +1000",
        "category": "finance",
        "authors": [
            "Colin Kruger",
            "Matt Dennien"
        ],
        "text": "Embattled casino operator Star Entertainment is facing the potential collapse of the deal to offload its troubled Queen’s Wharf precinct in Brisbane to its Asian partners a day before the deadline.\n\nUnderlying losses increased for the June quarter at Star, but the bigger problem is the possible eleventh-hour failure of the sale, according to an update to the ASX.\n\nBrisbane’s Star Casino at the riverfront Queen’s Wharf precinct. Credit: Joe Ruckli\n\nStar’s quarterly report – which precedes audited financial accounts due next month – states that it made a loss before interest, tax, depreciation and amortization costs (EBITDA) of $27 million for the quarter ending June 30 on revenue of $270 million.\n\nThe casino operator said mandatory carded play and $5000 cash limits at its flagship Sydney casino have continued to drag on its gambling performance, with average daily revenue down 17 per cent since it was introduced in August last year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/inflation-hits-four-year-low-as-pressure-mounts-on-rba-to-cut-rates-20250730-p5miu0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inflation hits four-year low as pressure mounts on RBA to cut rates",
        "publish_date": "Wed, 30 Jul 2025 12:05:39 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright",
            "Millie Muroi"
        ],
        "text": "The lowest annual inflation rate in four years has ramped up pressure on the Reserve Bank to deliver an interest rate cut when they meet within the next fortnight.\n\nThe Australian Bureau of Statistics on Wednesday morning reported that headline inflation was 0.7 per cent in the June quarter, taking the annual rate down to 2.1 per cent. It had been 2.4 per cent in the March quarter and is the lowest inflation rate since early 2021 when the country was in the midst of the pandemic.\n\nThe important measures of underlying inflation showed a 0.6 per cent increase in the quarter, with the annual rate easing to 2.7 per cent.\n\nThe underlying inflation result was the lowest since December 2021.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/inflation-data-paves-way-for-next-rate-cut-20250730-p5miy1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Inflation data paves way for next rate cut",
        "publish_date": "Wed, 30 Jul 2025 12:02:39 +1000",
        "category": "finance",
        "authors": [],
        "text": "Inflation data paves way for next rate cut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/how-a-bloke-with-a-stutter-changed-the-way-we-talk-about-wages-20250721-p5mgf4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How a bloke with a stutter changed the way we talk about wages",
        "publish_date": "Wed, 30 Jul 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Jenna Price"
        ],
        "text": "Silly me. There are a few Patience Kershaws in this book. In 1883, Eileen Creswell comes before a royal commission into working conditions in Victorian factories. She tells them she has no power, that she is no better than a slave. Byrne writes of Creswell: “To complain or argue over rates was to run the risk of dismissal.”\n\nThen 140 years later, Danielle (her last name is not given in the book) tells another story, this time to an Inquiry into Price Gouging and Unfair Pricing Practices. There was an imbalance, she argued: working people were suffering while large corporations were posting major profits. “I never thought I’d be considering whether I pay for a family member’s medication or whether we can go to the doctor.” She worked full time as a nurse but was considering a second job to make ends meet.\n\nAnd British-born James Galloway, a leader of the Stonemasons’ Society, fighting for the eight-hour work day, while a Melbourne developer dismissed the demands. Apparently, the timing wasn’t right. Such a familiar argument. We also meet Lara Watson, a self-described “mouthy barmaid”, who unionised her entire workplace in six weeks.\n\nByrne also tells the story of one man who was not a unionist but had an enormous impact on all of us. I knew about the Harvester judgment, but not much about the man who handed it down. He had one of the biggest impacts on Australian working conditions – the president of the Commonwealth Court of Conciliation and Arbitration, James Bournes Higgins. He’d entered law because he thought constant public speaking would help him with his stutter. His decision to rule on what was really a “fair and reasonable wage” had an impact on Australians for decades.\n\nByrne doesn’t shy away from telling us that unions face hurdles. Membership is in decline while Australia witnesses “growing wealth inequality, a reduction in real wages, a loosening of workplace protections, the growth of insecure work, and the rise of the gig economy”, he writes. Is this a blip? Or a trajectory?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/strange-ideas-take-root-in-this-ambitious-story-about-our-climate-crisis-20250724-p5mhk9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Strange ideas take root in this ambitious story about our climate crisis",
        "publish_date": "Wed, 30 Jul 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Gus Goswell"
        ],
        "text": "FICTION\n\nArborescence\n\nRhett Davis\n\nHachette, $32.99\n\nWe’re familiar with the idea that planting a tree is a gesture of hope, a way of helping to heal the Earth. But what about taking root and becoming trees ourselves?\n\nThe characters in Victorian writer Rhett Davis’ new novel Arborescence feel both overwhelmed and underwhelmed by life in what is recognisably a version of urban Australia. Their planet has been ravaged by humanity’s overconsumption. Their workplaces are being transformed by “alternative intelligences”. Someone has spray-painted “THERE IS NO HOPE” on a train station wall.\n\nBut something extraordinary is happening. In forests and fields, on roads and along waterways, people are turning into trees – by choice. The book’s title was our first hint that this was going to happen; arborescence means “becoming tree-like”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/trump-xi-turn-up-the-heat-in-a-battle-for-the-future-20250730-p5miue.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Whatever it takes’: Trump, Xi turn up the heat in a high-stakes battle",
        "publish_date": "Wed, 30 Jul 2025 11:58:06 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Ominously for copyright holders, he said that AI companies had to be able to use “that pool of knowledge” without experiencing the complexity of contract negotiations. The administration’s objective is to make America’s AI sector and its technologies the global standards for AI, exporting the technologies to its allies. Given how world-changing and disruptive AI might be, and the pace at which AI developments are occurring, the stakes in this contest for AI leadership are extremely high. Credit: Getty “We want the entire world to be running on American artificial intelligence stack. That is our cloud, our chips, our algorithms, all of that needs to be exported and packaged to the world so that we become the ecosystem of choice globally,” the White House science and technology director, Michael Kratsios, told Bloomberg. China’s approach, or at least the approach it publicly stated last week at the World Artificial Intelligence Conference in Shanghai, is very different.\n\nChina’s premier, Li Qiang, said AI innovation was being hampered by bottlenecks, like access to semiconductors, that could lead to AI becoming an “exclusive game for a few countries and companies.” Loading “Currently, overall global AI governance is still fragmented. Countries have great differences, particularly in terms of areas such as regulatory concepts and institutional rules. “We should strengthen coordination to form a global AI governance framework that has broad consensus, as soon as possible,” he said. China has proposed creating a new international organisation to develop AI, arguing that AI has risks that require nations to collaborate.\n\nDenied access by the US to the most advanced semiconductors, China has adopted an “open source” approach to AI, with its leading AI companies – companies like DeepSeek and Alibaba – making their large language models available to developers within and outside China as a strategy for fast-tracking a low-cost approach to developing AI and differentiating itself from Trump’s America First approach. Beijing wants China, not the US, to influence international standards for AI and its AI companies to win a bigger proportion of the global AI market. It is placing a particular emphasis on the development of AI within the “Global South” group of loosely aligned countries that it has been working to bring within its sphere of influence. Xi Jinping is taking a different approach than Trump. Credit: AP In the US, the race is on between the mega tech companies to develop artificial general intelligence (AGI), or human-level artificial intelligence. In China, Xi Jinping appears more focused on AI applications, or usages with practical applications for industries. The two countries are therefore pursuing somewhat different AI goals, which might reflect the success of America’s export controls in denying China access to the most advanced chips and chip-making equipment required to pursue AGI. It might also be that China doesn’t believe AGI will be attainable within a reasonable timeframe.\n\nIn Europe, as you’d expect, the focus has been on heavily regulating AI, prohibiting some AI practices that manipulate behaviours or are exploitative: imposing rules on the use of AI in critical infrastructure, employment and other sectors regarded as high-risk and legislating in areas like the transparency of the data used for the models, the protection of copyright and the management of risks. The competition between the US and China in particular, and the differing nature of their strategies might accelerate the development and deployment of AI, but it could also inflate the risks. In Australia, where there aren’t yet any AI-specific regulations, the prevailing sentiment appears to be for “light touch” regulation, with safeguards. Trump has effectively abandoned the safeguards the Biden regime tried to erect around the development of AI, essentially adopting the laissez-faire approach that most of the big US technology companies (which contributed heavily to his presidential campaign) have been lobbying for. Having jettisoned Biden’s guardrails, he’s told the technology advisers in the administration that they have six months to come up with a new set of AI policies that support his plan to fast-track AI projects, boost US technology exports and expunge the “woke” out from AI.\n\nHe has said he will use every rule at his disposal to facilitate the building of AI infrastructure like data centres and chip-manufacturing plants and the energy infrastructure they require and use the US export-Import Bank and Development Finance Corp to help spread US AI technologies to other countries. The US will do “whatever it takes to lead the world in artificial intelligence,” he said. Given that those developing AI systems have themselves warned that it poses risks, not just to individuals but humankind, Trump’s deregulatory approach is itself risky. Moreover, the competition between the US and China in particular, and the differing nature of their strategies might accelerate the development and deployment of AI, but it could also inflate the risks.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/they-bought-a-knockdown-rebuild-and-got-a-fight-over-thornbury-s-tallest-trees-20250729-p5mils.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "They bought a knockdown rebuild and got a fight over Thornbury’s tallest trees",
        "publish_date": "Wed, 30 Jul 2025 11:56:29 +1000",
        "category": "finance",
        "authors": [
            "Tom Cowie"
        ],
        "text": "The new owners of a dilapidated house in Thornbury bought at auction for more than $1 million are now locked in a battle with locals who want to protect two large eucalypts believed to be among the suburb’s tallest trees.\n\nThe City of Darebin is considering an application in Ballantyne Street to remove two silver gum trees on a private property that could date back to the construction of the house more than 100 years ago.\n\nLocals in Thornbury want to protect two silver gum trees that are at risk of being pulled down. Credit: Justin McManus\n\nThe larger of the two is estimated at more than 25 metres tall and believed to be one of the tallest trees in Thornbury.\n\nThe trees sit on the western edge of a block which sold at auction nearly two months ago as a deceased estate for just over $1 million.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-oil-tanker-docks-at-kwinana-port-20250729-p5misl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: West Coast boss concedes club considering asking AFL for help to be more competitive",
        "publish_date": "Wed, 30 Jul 2025 11:50:08 +1000",
        "category": "sports",
        "authors": [],
        "text": "West Coast chief executive Don Pyke has just been interviewed on SEN WA Mornings, saying he believes the Eagles are in a position to request a leg-up from the league.\n\nThe club is facing another wooden spoon this season, and have won just 11 of their past 91 games since late 2021.\n\nWest Coast CEO Don Pyke. Credit: Getty Images\n\nPyke said the poor results mean the club is “well and truly in the window” to ask the AFL for draft compensation, although he says he is yet to formally make the request.\n\n“I’m mindful of people saying, ‘Well, West Coast got into this problem, so they should just work their way out of it’,” he said.\n\n“But this is the essence of equalisation. The equalisation across the comp is designed to allow clubs to not spend a long period of time either at the top or at the bottom.\n\n“I think we’d not be doing our duty if we didn’t ask the question about ‘How do we get any assistance we can?’ if it’s available to help us get out of this and get back to playing competitive, strong footy week-on-week.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/does-not-belong-in-this-country-hockey-australia-stands-by-peris-as-more-anti-islam-re-posts-emerge-20250730-p5mity.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Does not belong in this country’: Hockey Australia stands by Peris as more anti-Islam re-posts emerge",
        "publish_date": "Wed, 30 Jul 2025 11:47:44 +1000",
        "category": "sports",
        "authors": [
            "Chris Barrett"
        ],
        "text": "Hockey gold medallist and former Labor senator Nova Peris shared a series of social media posts scathing of Islam in the lead-up to her election as a director of the sport, including one which said the religion “should be banned in the West”.\n\nPeris was voted onto the board of Hockey Australia last month, nearly three decades after her triumph with the national women’s team, the Hockeyroos, at the 1996 Atlanta Olympics.\n\nNova Peris has become a prominent advocate for Israel and a voice against antisemitism. Credit: Aresna Villanueva\n\nBut her position as a director of the government-funded national federation has come under question because of comments she has re-posted online this year.\n\nThis masthead reported that the pro-Israel campaigner shared a comment from another user on X in April that called Muslims “Satan worshipping cockroaches that need to be eradicated”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/she-was-busted-for-cheating-at-the-olympics-now-she-s-coaching-in-the-a-league-20250729-p5mio4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "She was busted for cheating at the Olympics. Now she’s coaching in the A-League",
        "publish_date": "Wed, 30 Jul 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "A few days before Imane Khelif became the centre of the world’s attention, the biggest controversy at the 2024 Olympic Games in Paris involved a drone. On the eve of New Zealand’s first women’s football match, Rebekah Stott spotted the craft hovering over the team’s training session.\n\n“We were just doing throw-ins, and I was waiting for Ali Riley to throw me the ball and I hear this noise,” Stott told Sam Mewis, the former American international, on her podcast The Women’s Game last year.\n\n“I’m a bit of a drone enthusiast, I’ve got one myself, and so I hear this noise, and I’m like, ‘Oh my gosh ... is that a Mavic Pro?’”\n\nQuite aside from the fact that flying drones above people was illegal in France, Stott’s discovery unravelled one of the biggest scandals in women’s football history.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/mini-bus-crashes-down-embankment-020645974.html",
        "title": "Mini bus crashes down embankment",
        "publish_date": "2025-07-30T02:06:45Z",
        "category": "finance",
        "authors": [
            "Emma Kirk"
        ],
        "text": "A mini bus has crashed down an embankment in the Hunter Valley. Picture: NewsWire/ Tim Pascoe\n\nA mini bus has crashed down an embankment in the Hunter Valley, injuring six people.\n\nEmergency services were called to Mount View Rd in Mount View at about 10.30am on Wednesday.\n\nSix people have been injured in the crash. Picture: NewsWire/ Tim Pascoe\n\nA NSW Ambulance spokesman confirmed several crews were on the scene, including a helicopter.\n\nTwo people were in a serious but stable condition, and another four people sustained minor injuries.\n\nMore to come",
        "source": "Yahoo"
    }
]