[
    {
        "url": "https://www.9news.com.au/national/queensland-bakers-bend-emergency-declaration-after-chemical-spill/beb88de5-48a3-4aa2-b993-3c7e2f5f40a6",
        "title": "Emergency declaration after chemical truck catches fire in Queensland",
        "publish_date": "Sun, 06 Jul 2025 00:54:01 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/elon-musk-reveals-he-has-formed-new-political-party-the-america-party/91f36524-b88a-4193-844a-efa9e6242db4",
        "title": "Elon Musk declares formation of The America Party in latest Trump snub",
        "publish_date": "Sun, 06 Jul 2025 01:07:27 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "T﻿esla founder and billionaire Elon Musk has announced the name of his new political party: The America Party.\n\nThe South African-born tech entrepreneur has been vocal about his desire to create a third major political party to contest the Republican Party and Democratic Party in the United States.\n\n﻿After pilot-testing the name of his party with a poll on his platform X (formerly Twitter), Musk declared he has now formed The America Party.\n\nTesla CEO Elon Musk announced the formation of The America Party. (Getty)\n\n\"By a factor of 2 to 1, you want a new political party and you shall have it!\" Musk said.\n\n\"When it comes to bankrupting our country with waste & graft, we live in a one-party system, not a democracy.\n\n\"Today, the America Party is formed to give you back your freedom.\"\n\nMusk spoke about how he would bring his new US party into power in a post late last week on X.\n\n\"﻿One way to execute on this would be to laser-focus on just 2 or 3 Senate seats and 8 to 10 House districts,\" he said.\n\n\"Given the razor-thin legislative margins, that would be enough to serve as the deciding vote on contentious laws, ensuring they serve the true will of the people.\"\n\nMusk suggested his party could run during the 2026 midterm elections.\n\nPolitical parties in the US only need to be registered with the Federal Election Commission if they raise or spend money over a certain threshold.\n\nMusk spent hundreds of millions bankrolling Trump's second presidential election campaign. (Bloomberg via Getty Images)\n\nMusk spent US$277 million (approx. $422 million) of his own money ﻿in support of Donald Trump's 2024 election campaign.\n\nWithin months of Trump's re-election, relations soured between the president and the world's richest person.\n\n﻿Musk has publicly opposed Trump's 'Big, Beautiful Bill' which narrowly passed Senate last week and has critiqued the president's economic policy on X.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/us-dollar-falling-why-worlds-king-currency-going-backwards-explained/a7d39032-98ca-4509-ae72-1967171b6ec6",
        "title": "The world's most important currency is suddenly sliding backwards",
        "publish_date": "Fri, 04 Jul 2025 21:11:08 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "The Australian dollar is enjoying a resurgence as of late, but it's not down to anything special about our local currency.\n\nIn fact, plenty of currencies are performing strongly in 2025, thanks to one surprising laggard: the US dollar.\n\nThis week, the greenback chalked up its worst opening half of a year in more than half a century, dropping 10.7 per cent over the six months to June 30.\n\nREAD MORE: Trump trade war blamed for surprise shrinking of US economy ﻿\n\nThe US dollar has had its worst start to the year since 1973. (AP Photo/Ted Shaffrey)\n\nNot since 1973, when it fell 15 per cent, has it had a weaker start to the year.\n\nThe US dollar has been the dominant currency across the globe since the end of World War II, currently used for about 90 per cent of all foreign exchange transactions.\n\nSo what's causing it to go backwards?\n\nIn part, it's a bit of a correction.\n\n\"Given the strength in the US dollar in recent years, it has looked overvalued (based on purchasing power parity), especially since the pandemic,\" AMP deputy chief economist Diana Mousina wrote early this week.\n\n\"So the recent depreciation is probably... a normalisation closer to fair value.\"\n\nBut there are concerns ﻿the slide could continue, and in a year when the dominant finance story has been the tariffs thrown around by the White House, it will come as little surprise that Donald Trump is playing a key role.\n\nA hit to US GDP from those tariffs is weighing on investors, as are ﻿concerns about debt levels linked to the president's \"Big Beautiful Act\", and his more America-first approach to foreign policy.\n\nThere are also longer-term factors at play –﻿ in a more polarised world, the proportion of US dollars in foreign exchange reserves has shrunk from about 70 per cent two decades ago to a tick under 60 per cent today.\n\nAll are contributing to concerns that it's no longer the reliable, safe-haven currency it once was.﻿\n\n\"If you cannot with certainty take a view on the position of the US administration, it's hard to commit capital,\" Arun Sai, a strategist at Pictet Asset Management, said.\n\n\"What we've seen with the current administration in the last few months is that this notion of the US being a default destination for global capital is being challenged.\"\n\nBut another significant issue for the greenback is what Trump's been saying about US Federal Reserve Chairman Jerome Powell , who on Thursday (Australian time) admitted he would likely have cut interest rates were it not for the White House's tariffs.\n\nREAD MORE: Retirement crisis coming for millions of Aussies ﻿\n\nTrump's attacks on Jerome Powell have been weighing on the US dollar. (AP Photo/Carlos Osorio)\n\n﻿In Australia, you'll pretty much never hear Treasurer Jim Chalmers say \"Reserve Bank\" without uttering \"the independent\" first.\n\nTrump has no such qualms about trying to influence his central bank, having constantly belittled Powell in an attempt to get him to lower interest rates, and therefore make borrowing cheaper for the government.\n\nThe president has variously labelled Powell \"a total and complete moron\"﻿, \"stupid\", \"a dumb guy\", \"average mentally\", \"a very stupid person\", and \"low IQ for what he does\" – and that's just in the last two weeks.\n\nHe's also sent a handwritten note to the Fed demanding ultra-low interest rates, saying the US's cash rate should be \"1 per cent... or better\".\n\nIt's currently above 4 per cent.﻿\n\nTrump has threatened to fire Powell – who he actually appointed during his first term before an extension by Joe Biden – and called for him to resign, and said last week that he already ﻿has a shortlist of replacements, fuelling speculation he could announce a successor well before Powell's term expires next year.\n\nInvestors have been concerned about the Federal Reserve's independence under Donald Trump. (CNN)\n\nThat would be a \"terrible idea\", AGF Investments chief US policy strategist Greg Valliere said, as it would be \"sure to annoy and confuse the financial markets if there are two Fed chairs\".\n\n\"The damage to the Fed's independence would be considerable if Trump becomes a monetary back-seat driver, second-guessing Fed policies,\" he said.\n\nIt's those independence concerns that are proving detrimental to the US dollar. ﻿\n\n\"One of the key foundations of the strong dollar, of the dollar as a dominant currency globally, is to have an independent central bank,\" ING foreign exchange strategist Francesco Pesole said.\n\n\"So, if [global investors] feel there is greater influence of politics into the Fed's decisions, then they are pricing in a greater risk for the dollar.\"\n\nThat said, there's no obvious replacement for the greenback as the world's international currency, despite a host of countries including China, Russia, India, Brazil, Indonesia and South Africa wanting one.\n\n﻿\"There has been talk about these countries using a new currency called 'The Unit', which would be... a digital currency on the blockchain,\" Mousina wrote.\n\nThe Australian dollar is likely to keep rising over the next 12 months, although interest rate cuts will limit just how high it will go. (Fairfax Media)\n\n\"But setting up a potential new currency faces many hurdles, particularly from the Western world that dominates the financial markets and global payments system.\"\n\nThere could be a little more good news for Australian travellers to the US, with AMP forecasting the Aussie dollar will buy just under 70 cents by mid-to-late next year.\n\nBut against other currencies, it's likely to remain fairly stable, and the greenback's slide – if it continues – could have complex and far-reaching consequences.\n\n\"If the US dollar loses its safe-haven status, then the Australian dollar may fall less in times of uncertainty,\" Mousina said.\n\n\"[This] will impact its role as a shock absorber for the Australian economy (like when it fell in the GFC and pandemic, which boosted our exports and supported the economy).\n\n\"This may put more pressure on the RBA to support growth in time of global shocks.\"\n\n– With CNN ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/uk-chancellor-cries-in-parliament-spooked-financial-markets/474bc738-2feb-42f6-9e16-1de006ea5e62",
        "title": "Tears of the UK's treasury chief spooked financial markets",
        "publish_date": "Sat, 05 Jul 2025 01:04:14 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "The weekly session in which the British prime minister is questioned by lawmakers in Parliament can be an ordeal for the government leader.\n\nFor Cabinet members, it’s usually simply a matter of backing their boss.\n\nBut on Wednesday the spotlight ended up on Chancellor of the Exchequer Rachel Reeves during the Prime Minister's Questions session because it became evident that she was crying as she sat beside Prime Minister Keir Starmer.\n\nREAD MORE: ﻿ Australian actor Julian McMahon dies after private battle with cancer\n\nThis screen grab of Chancellor of the Exchequer Rachel Reeves, right, crying as Prime Minister Keir Starmer speaks during Prime Minister's Questions in the House of Commons, London, Wednesday July 2, 2025. (House of Commons/AP)\n\nIt's not known what triggered the tears, later said to have been personal.\n\nThey came as Starmer sought to fend off attacks that his year-old government was losing its authority and that he was about to fire Reeves to regain the initiative.\n\nMarkets spooked\n\nTraders got spooked, with the interest rate charged on the UK’s 10-year benchmark bond in the markets up sharply, and the pound down.\n\nIt's not known what triggered the tears, later said to have been personal. (UK Parliament)\n\nThe moves were a sign investors had lost confidence in UK financial assets.\n\nReeves had become associated with fiscal discipline, in particular a rule of covering day-to-day government spending with tax revenue, said Andrew Wishart, an economist at Berenberg Bank.\n\n“The markets are concerned that if the Chancellor goes, such fiscal discipline would follow her out of the door,\" he added.\n\nWith Starmer insisting on Thursday that Reeves would remain in post, the markets calmed down.\n\nPrime minister's weekly ordeal\n\nPrime Minister's Questions, or PMQs, can come as close to a gladiatorial contest as is possible in a modern legislative chamber.\n\nVery little deference is given to the man or woman holding the highest office in the land.\n\nThe prime minister is considered the first among equals.\n\nBritain's Chancellor of the Exchequer Rachel Reeves during a visit to the Sir Ludwig Guttman Health & Wellbeing Centre on July 03, 2025 in London, England. (Getty)\n\nLike all other members of Parliament, the prime minister represents one of 650 constituencies.\n\nAnd nowhere is that shared connection more noticeable than at noon every Wednesday in the House of Commons.\n\nStarmer stands for half an hour every week to be quizzed by friends and foes.\n\nHe may get soft balls, but there's always a potential zinger around the corner.\n\nThe leader of the biggest opposition party, currently the Conservative Party's Kemi Badenoch, has the best chance to knock the prime minister off course.\n\nWith six questions, she can lay traps and go for the jugular.\n\nTypically it's more theatre than substance, and the weekly shouting match is consistently the most-watched parliamentary event, viewed around the world, including on C-Span in the United States.\n\nREAD MORE: At least 13 dead in Texas floods ﻿\n\nBritain's Chancellor of the Exchequer Rachel Reeves and Britain's Prime Minister Keir Starmer during a visit to the Sir Ludwig Guttman Health & Wellbeing Centre . (Getty)\n\nThis week was fraught\n\nThis week's session appeared to have more at stake than usual following a chaotic run-up to a welfare reform bill.\n\nWith scores of Labour lawmakers opposed, Starmer was forced to scrap key planks of the bill — at a cost, politically and economically.\n\nFor a prime minister, with one of the biggest majorities in history, it was a sign of weakness.\n\nMany Labour MPs blame Reeves, for her rigid adherence to her budget rules.\n\nAs usual, Starmer was flanked to his left by Reeves, who didn't look her usual self, clearly bloated around the eyes.\n\nBadenoch showed little mercy, describing Reeves as “absolutely miserable” and a “human shield” for Starmer.\n\nShe asked Starmer whether he could repeat a pledge that Reeves would stay in her post until the general election, which has to take place by the middle of 2029.\n\nWhile praising Reeves' handling of the economy, Starmer didn't give that assurance, and it was around this point that Reeves wiped away a tear.\n\n“How awful for the Chancellor that he couldn’t confirm that she would stay in place,\" Badenoch responded.\n\nTwo-time Oscar winner mauled by lion as a nine-year-old View Gallery\n\nThe immediate political aftermath\n\nStarmer's Downing Street operation faced questions over Reeves' teary appearance. Could it have been hay fever?\n\nHad Starmer told Reeves she would be fired for the government's recent woes, which has seen Labour's approval ratings slide?\n\nStarmer's press spokesman said it was a “personal matter,” insisted Reeves was “going nowhere” and had the prime minister's “full backing.”\n\nLater, Starmer told the BBC that Reeves would be Chancellor for a “very long time” and that it was “absolutely wrong” to suggest her distress was related to the welfare U-turn.\n\nREAD MORE: What we know about the rare bat virus that has claimed a fourth life ﻿\n\nA day on\n\nImages of Reeves' agitated state were emblazoned across newspapers and remained a key item on the news agenda.\n\nStarmer repeated on Thursday that Reeves would remain Chancellor “for years to come\" and sought to explain why he hadn't comforted Reeves during PMQs.\n\n“In PMQs, it is bang, bang, bang,\" he said at an event where he and Reeves hugged.\n\n\"That’s what it was yesterday and therefore I was probably the last to appreciate anything going on in the chamber.”\n\nReeves appeared more like her usual self.\n\n“People saw I was upset, but that was yesterday,\" she told Sky News.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/toxic-algae-bloom-south-australia-calls-natural-disaster-declaration-seafood-industry/07536ff4-1fba-404d-a6fc-aaef88299593",
        "title": "Calls for national disaster declaration as seafood industry 'ripped to pieces'",
        "publish_date": "Fri, 04 Jul 2025 10:30:19 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "South Australian fishers are grappling with a severe economic downturn as the state's toxic algal bloom threatens the local seafood industry.\n\nDeclining sales, fuelled by consumer concerns over contamination, have prompted calls for the algal bloom to be declared a national disaster by the federal government.\n\nRod Ness, a commercial fisherman in Victor Harbor for three decades, expressed deep concern about the devastation facing the industry.\n\nREAD MORE: Stinky town notices an improvement after expert sniffs out source of odour ﻿\n\nSouth Australian fishers are grappling with a severe economic downturn as the state's toxic algal bloom threatens the local seafood industry. (9News)\n\n\"It's a massive part of the foundation of the state. And it's being ripped to pieces,\" Ness said.\n\nThe crisis was a central topic at an urgent meeting hosted by the state government.\n\n\"The public is scared of… eating fish. And our sales at our fresh fish shop have dropped 70 per cent in the last three weeks,\" Ness said.\n\nThe algal bloom, which has been spreading for months, is showing no signs of abating.\n\n\"Now that it's here, it's going to be hard to get rid of,\" Ness said.\n\n\"And while we've seen a lot of weather changes, a lot of that has just pushed the bloom around, instead of getting rid of it.\"\n\nREAD MORE: The email six million Australians should expect from Qantas ﻿\n\nRod Ness, a commercial fisherman in Victor Harbor for three decades, expressed deep concern about the devastation facing the industry. (9News)\n\nThere are reports scientists wrote to the federal government seeking funding to deal with the worsening problem but were knocked back.\n\n\"If we had dead fish and marine life washing up day after day on Bondi Beach or on the North Shore of Sydney, there'd be a national outcry,\" Greens senator Sarah Hanson-Young said.\n\nThe federal government has so far resisted calls to declare the situation a national disaster.\n\n\"Well I'd have to look at the request because it hasn't come to me but we'll obviously work with governments across the board increasingly to deal with the impacts of climate change,\" Climate Change Minister Chris Bowen said.\n\nThe state government says it may increase pressure on the Commonwealth to reconsider its position if the bloom continues to spread. (9News)\n\nThe state government says it may increase pressure on the Commonwealth to reconsider its position if the bloom continues to spread.\n\nNess voiced his frustration with the federal response.\n\n\"I'm questioning them not jumping at the chance to call it a national disaster,\" he said.\n\n\"I know a lot of fishermen from a lot of various areas that are very stressed out and doing it pretty hard.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/money-news-new-finder-survey-reveals-millions-of-australians-relying-on-inheritance-due-to-cost-of-living-crisis-for-major-financial-milestones-such-as-purchasing-a-home-and-retirement/6d3e4036-21fa-4061-a0ff-739766cb14f8",
        "title": "Millions of Australians relying on an inheritance to achieve major financial goals",
        "publish_date": "Fri, 04 Jul 2025 03:27:03 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Millions of Australians are relying on an inheritance to achieve major financial goals such as purchasing a home or retiring, but experts are warning the expectation of a windfall is creating a \"false sense of security\".\n\n﻿A survey by comparison website Finder found 8.8 million Australians were expecting family money over the coming years, with 43 per cent of men in line for an inheritance compared to 41 per cent of women.\n\nThe research comes as many Australians find themselves in the middle of a perfect storm, with property prices climbing for a fifth consecutive month and new research revealing a lack of superannuation among the country's smallest business owners .\n\nREAD MORE: ﻿ Retirement crisis coming for millions of Aussies\n\nMillions of Australians are expecting an inheritance and feel dependent on the windfall to achieve major financial goals such as buying a house or retiring. (Getty Images/iStockphoto)\n\nWith the current cost of living, ﻿one in 10 respondents to the Finder survey said they were dependent on an inheritance to achieve their financial goals.\n\nAlmost one in five Australians said an inheritance would significantly improve their finances but they were not dependent on the money.﻿\n\nThe survey also found that while 12 per cent of respondents expect to receive an inheritance, the financial boost would not have a major impact on their financial plans.\n\nREAD MORE: Restaurants reaping the benefits of food delivery surge\n\nThe top 10 jobs actually making money in cost-of-living crisis View Gallery\n\nAlmost one in 10 respondents did not expect ﻿to get an inheritance due to family circumstances such as a lack of family or strained relationships.\n\nMeanwhile, half of Australians said their family was not in a position to leave an inheritance.\n\nFinder personal finance expert Sarah Megginson said the family money was increasingly viewed as a lifeline for many Australians navigating rising costs.\n\nREAD MORE: Millions of Aussies unaware of big boost to their financial future\n\nOne in 10 respondents to the Finder survey said they were dependent on an inheritance to achieve their financial goals such as home ownership. (Getty Images/iStockphoto)\n\n﻿\"With the cost of living sky-high, it's not surprising that some Aussies are hinging their future financial security on an inheritance, but it's a risky strategy,\" Megginson said.\n\n\"Relying on money that hasn't hit your bank account yet can delay important financial decisions and create a false sense of security.\n\n\"Not everyone can count on a family payout, nearly half of Aussies say their family won't be in a position to leave anything behind.\"\n\nMegginson urged Australians who expect to receive an inheritance to use this time to educate themselves on topics such as investing, tax implications and budgeting﻿.\n\n\"A sudden windfall can disappear fast without a solid financial plan in place,\" Megginson said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/afl-round-17-live-blog-sydney-fremantle-adelaide-melbourne/105499844",
        "title": "Live: Dockers take on Swans as they seek seven wins in a row",
        "publish_date": "Sun, 06 Jul 2025 02:01:42 +0000",
        "category": "sports",
        "authors": [
            "Marnie Vinall"
        ],
        "text": "It was a big topic over the course of the last week: would the SCG be right to play on?\n\nThe deck came under criticism after Sydney and the Western Bulldogs' last Friday night, which saw players slip over and chunks of mud coming up with their boots.\n\nSwans and Bulldogs last weekend. (Getty)\n\nThe turf below its best after Italian tenor Andrea Bocelli had a concert there in April.\n\n“Are you allowed to play on this surface? This is as bad as I’ve seen in years,” Jonathan Brown said on the Fox broadcast.\n\nFremantle coach Justin Longmuir added his thoughts to the choir ahead of today's clash.\n\n\"I watched the game on Friday night, and we'll be led by the AFL, but the moment my brain goes to 'that's unsafe for players', I have a concern,\" he told media.\n\nBut the AFL got a turf consultant in and the SCG curator Adam Lewis said it was all ok. So, we play on.\n\n“We’re very confident it’ll hold up. We’ve had independent testing done along with our own testing and we’re lucky the AFL have sent up their testing as well and we’ve passed with flying colours so we’re really looking forward to Sunday,” Lewis said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/unesco-world-heritage-murujuga-rock-art-meaning/105453930",
        "title": "The story behind the ancient rock art at Murujuga",
        "publish_date": "Sun, 06 Jul 2025 01:55:29 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "From the air, the meaning of Murujuga becomes clear.\n\nThe Ngarluma-Yaburara word translates to \"hip bone sticking out\".\n\nIt paints an evocative bird's-eye view of the Burrup Peninsula, which juts into the Indian Ocean north of Karratha, 1,500 kilometres north of Perth.\n\nThe Ngarluma-Yaburara word Murujuga translates to \"hip bone sticking out\". (Supplied: Anna-Lena Tibud)\n\nIn 2023, the Murujuga Cultural Landscape was nominated for inclusion on the World Heritage List, culminating in a multi-generational campaign for international recognition.\n\nThe referral is contentious among activists, who have condemned the federal government for extolling the area's heritage values while simultaneously approving heavy industry nearby.\n\nA final decision from UNESCO's World Heritage Committee is expected in the coming week.\n\nMurujuga's renowned rock art carries ancient and deep meaning for traditional owners. (ABC Pilbara: Mietta Adams)\n\nCentral to the bid are between one and two million petroglyphs dotting Murujuga's rocky red mounds and shadowy ravines.\n\nIt is arguably the densest single concentration of rock art on the planet.\n\nTraditional custodians say these ancient engravings inscribe a living cultural tradition and human creative genius.\n\nHere are some of those stories, handed down for more than 50,000 years.\n\nWhat does the rock art tell us?\n\nAboriginal people have gathered at Murujuga for millennia.\n\nFive language groups, known collectively as the Ngarda-Ngarli, have connections to the land: the Ngarluma, Mardudhunera, Yaburara, Yindjibarndi, and Wong-Goo-Tt-Oo peoples.\n\nYindjibarndi man and Murujuga Aboriginal Corporation (MAC) director Vincent Adams says the rock art is a \"cultural signpost\" for those travelling on country.\n\nVincent Adams points out some rock art. (ABC Pilbara: Alistair Bates)\n\nHe stops at Nganjarli, one of Murujuga's most prominent \"galleries\", to point out a ghostly carving near the gorge's entrance.\n\nHundreds of visitors pass the figure unawares, with photography of the image prohibited according to cultural law.\n\n\"We call that the Marrga in Ngarluma-Yinjibarndi,\" Mr Adams says.\n\n\"He's normally classified as a six-toe, six-finger figure, different to us, always dressed in headgear.\"\n\nThe nearly 2 million petroglyphs are known as Marni in language. (ABC Pilbara: Amelia Searson)\n\nThe Marrga features in a host of Pilbara creation stories from \"when the world was soft\", like how the kangaroo got its tail and how the emu lost the ability to fly.\n\n\"We couldn't just walk up onto anybody's country. We needed permission,\" Mr Adams explains.\n\n\"How we got that permission? We see this significant site, and we know people are close.\n\n\"[We] make fire, smoke. People inside the gorges will see this smoke, they come out to see who it is.\"\n\nThe engravings are both practical and spiritual in purpose. (ABC Pilbara: Mietta Adams)\n\nThe Marni, as the petroglyphs are called, signify the practical and religious significance of Ngurra, or country.\n\nThey constitute a visual language: \"footsteps\" crossing boundaries of speech, marriage, and skin groups to form the basis of local lore.\n\n\"We have symbols that have been marked around the Burrup that tell us we are in a sacred place, a special place,\" Mr Adams says.\n\n\" It tells us … things that we want to do, how we can do it, where we can do it, what tools we can do it with. \"\n\nWho created the rock art?\n\nStepping deeper into Nganjarli, Mr Adams recounts the meetings between cultural groups that once took place there.\n\nYinjibarndi people would travel to the coast from inland and convene with the peninsula's first inhabitants, the \"saltwater\" Yaburara people.\n\n\"Yaburara … meaning sea, sea breeze,\" he says.\n\nSome rock art depicts animals, showing hunters what they could find in the area. (ABC Pilbara: Alistair Bates)\n\nMr Adams says the Yinjibarndi sought out the Yaburara during the season of Muhlu, when the days grew shorter and the weather cooler.\n\nThey bartered for bush tucker and the fruits or \"sweets\" budding by the ocean.\n\nDuring the season of Muhlu, the days grow shorter and the weather cools. (ABC Pilbara: Alistair Bates)\n\nBut in the late 19th century, the custodianship of Murujuga changed forever.\n\nOne of Nganjarli's later additions captures what is thought to be Francis Thomas Gregory's ship, the Dolphin, which anchored off the peninsula in 1861.\n\nThe settlers' arrival had a life-changing impact on the local Aboriginal communities.\n\nColonial-era violence at the hands of settlers and local police, such as the 1868 Flying Foam Massacre, devastated the Yaburara people.\n\nThe Ngarda-Ngarli adopted Murujuga, dubbed \"orphan country\" because its owners could no longer care for it alone, melding artistic traditions and interpretations.\n\nLooking closely, you can see a thylacine depicted in the rock art on Murujuga. (ABC Pilbara: Alistair Bates)\n\nHow is the rock art used?\n\n\"They depict stories of connection to country: how me, you, everyone here today connects to this place,\" Mr Adams says.\n\nHe describes a kangaroo-like motif with three stripes on its back.\n\nThree lines depicted in rock art are drawn in ochre along a man's collarbone during traditional ceremonies. (ABC Pilbara: Mietta Adams)\n\nIt also taught hunters what game they would find.\n\n\"When we want something to eat, we go to the supermarket,\" Mr Adams says.\n\n\"Here [it is] no different.\"\n\nSome of the rock art possibly bears witness to extinct megafauna, such as giant kangaroos. (ABC Pilbara: Mietta Adams)\n\nA handful of the creatures recorded by the rock art are frozen in time.\n\n\"You'll see animals that are no longer here … megafauna, they call it,\" Mr Adams says.\n\n\"He still got a songline today, belong to us even though he's gone.\"\n\nSome petroglyphs act as \"increase sites\", where rituals are performed to replenish resources.\n\n\"If we run low on emu, we do ceremony; next year, big mob [of] emu,\" Mr Adams says.\n\n\"Increase sites\" were used in ceremonies to maintain the balance of plants and animals. (ABC Pilbara: Alistair Bates)\n\nSpecial configurations mark paths and ceremonial grounds for men's and women's business, as well as warnings to unwelcome intruders.\n\nThere is even, not pictured for cultural reasons, a tableau of a man and woman in what Mr Adams refers to, with a booming laugh, as the world's \"oldest sex education\" lesson.\n\nWhat does it mean today?\n\nA short drive from Nganjarli, the spinifex-strewn hills give way to a sheltered bay.\n\nThis is Hearson's Cove, so named for a member of Francis Gregory Thomas's crew mistakenly shot by his fellows as they headed ashore.\n\nLong before, it was known as Binabarranha.\n\nMurujuga rock art petroglyphs sit on the Burrup Peninsula and islands off the Dampier Archipelago. (ABC Pilbara: Alistair Bates)\n\nWhen Ngarluma woman Belinda Churnside looks out at this landscape, she sees her \"old people\", including her mother.\n\n\"She's a very proud Ngarluma woman … I wouldn't be doing this today if I didn't acknowledge and support her fight, determination, and leadership,\" she says.\n\nBelinda Churnside says she sees her elders among the rock art. (ABC Pilbara: Alistair Bates)\n\nAs MAC vice-chair, Ms Churnside departed on Sunday for Paris, where a delegation of custodians will hear the UNESCO World Heritage decision firsthand.\n\n\"To actually carry the fight for your old people … they want us young people now to support them and fight the fight until we do get this World Heritage,\" she says.\n\nA delegation of traditional owners has travelled to Paris to hear UNESCO's World Heritage decision. (ABC Pilbara: Alistair Bates)\n\nBoth MAC and the federal government have protested against a draft decision knocking back the bid amid fears industrial emissions could damage the petroglyphs.\n\nOthers say it is a rallying cry for stronger protection.\n\nHeavy industry sits nearby, including Yara Pilbara's fertiliser plant and Perdaman's under-construction urea project. (ABC Pilbara: Alistair Bates)\n\nFor Mr Adams, the looming outcome is immaterial in the face of deep time.\n\n\"One day, [industry] will be gone, [but] this will still be here,\" he says.\n\n\"People like me will be telling that story in 200, 300 years' time.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/rba-reserve-bank-of-australia-cash-rate-interest-/105475978",
        "title": "We're expecting another rate cut this week. Will more cuts follow?",
        "publish_date": "Sun, 06 Jul 2025 01:11:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank of Australia (RBA) will meet again this month, with the board to make a decision about whether or not to change the cash rate target.\n\nThe decisions of the board impact the budgets of many Australians — either directly or indirectly — so it's a pretty big deal.\n\nThese meetings happen eight times a year so every month or so there's another update.\n\nLet's get up to speed on where we're at and what to expect.\n\nWhen will the RBA meet next?\n\nTomorrow.\n\nThe RBA board has a two-day meeting on Monday and Tuesday.\n\nWill there be a rate cut?\n\nNo-one can say for sure, but many economists are predicting a cash rate cut on Tuesday.\n\nFor example, Reuters asked 37 economists and 31 of them are banking on a cut this week — the other six reckon rates won't change at this meeting.\n\nWhat is the cash rate target?\n\nCurrently, the cash rate target is 3.85 per cent.\n\nThis figure is often referred to as \"the interest rate\" in conversation, but it's not the rate people with mortgages pay.\n\n\"The cash rate is the interest rate that banks pay to borrow funds from other banks in the money market overnight,\" the RBA's website says.\n\n\"It influences all other interest rates, including mortgage and deposit rates.\"\n\nThat's why, if you're paying interest on a loan, your interest rate is probably higher than 3.85 per cent.\n\nWhen the RBA changes the cash rate target, interest rates for mortgages don't automatically change — the individual banks decide that.\n\nThis graph shows how the cash rate target has changed since the 1990s. (Reserve Bank of Australia)\n\nHow much will the cash rate be cut by?\n\nWe're expecting rates to be cut by 0.25 per cent.\n\nThat would take the new cash rate down to 3.6 per cent.\n\nWhen will we know if there's a rate cut?\n\nNot until the Tuesday afternoon.\n\nTypically, the RBA publishes its decision at about 2:30pm AEST — this happens after every meeting.\n\nThe ABC team will be live blogging the RBA announcement right here on our website.\n\nWhen will interest rates go down?\n\nIf the RBA does cut rates, it'll be up to the banks to decide if they'll pass that cut on to customers.\n\nSo if you have a mortgage, you'll have to wait to hear from your lending institution about whether your rates are changing.\n\nWe typically hear from the major banks within a few hours of the RBA's decision though — so you probably won't have to wait very long.\n\nWill there be more cuts this year?\n\nAgain, we can't say for sure, but we can look to economists for their predictions.\n\nHere's what the major banks say:\n\nANZ : Expects rates to be cut to 3.35 per cent in August\n\n: Expects rates to be cut to 3.35 per cent in August Commonwealth : Expects rates to be cut to 3.35 per cent in August\n\n: Expects rates to be cut to 3.35 per cent in August NAB: Predicts rates will go down to 3.35 per cent this quarter and will go down to 3.1 per cent in December\n\nPredicts rates will go down to 3.35 per cent this quarter and will go down to 3.1 per cent in December Westpac: Expects rates to be cut to 3.35 per cent by the end of the year\n\nHow many rate cuts have there been this year?\n\nTwo.\n\nThe RBA board cut the cash rate from 4.35 to 4.1 after the meeting in February.\n\nIt cut it again after the most recent meeting in May, lowering it to 3.85.\n\nThis graph representing 2020 to now demonstrates how the cash rate is tracking downwards after the steep hikes in 2022. (Reserve Bank of Australia)\n\nWhat are RBA's 2025 meeting dates?\n\nThe RBA will meet eight times this year.\n\nHere are the dates listed on the Reserve Bank's website:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/72yo-female-pilot-says-it-is-never-too-late-to-fly/105491864",
        "title": "Woman takes retirement to new heights and wants others to do the same",
        "publish_date": "Sun, 06 Jul 2025 01:07:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "There is a moment always guaranteed to put a smile on Carol Browne's face.\n\n\"I get in the aircraft, open the throttle and we're hurtling down the runway, and we lift off … and I have to pinch myself,\" she said.\n\n\" I just can't wipe the grin off, every time I take off. \"\n\nThe 72-year-old earned her pilot's licence four years ago after a long career in education, and said her most recent skill surprised many of her friends.\n\n\"Somebody asked me how a flight with a friend went [and] who flew the plane,\" she said.\n\n\"I said, 'I did! I was the pilot.'\n\n\"Their jaw hit the ground because you don't expect 70-year-old ladies to say that in the sewing circle environment.\"\n\nCarol Browne (right) and her instructor Trevor Bange check the oil on one of the aircraft at the flying school. (ABC Southern Qld: Peter Gunders)\n\nEarning her wings was never a bucket-list item for Ms Browne, but a conversation with her brother-in-law, \"over a chardonnay or two\", proved pivotal.\n\nHe said he'd love to fly, but it was cost-prohibitive at his stage of life with a mortgage and kids.\n\n\"He couldn't do it, and said, 'Why don't you?'\" Ms Browne said.\n\n\"And I thought, 'Well … why don't I?'\"\n\nWith 400 hours in her flight logbook, Ms Browne is now studying for her instructor rating.\n\nShe says it keeps her feeling younger.\n\n\"I think having a passion is what it's all about. Doing something that you really love, and wanting to keep getting better at it is the other thing,\" she said.\n\n\"There's incredible multitasking you have to do as a pilot … you seem to have to do 15 things at once!\"\n\nCarol Browne says being given her flight cap after her first solo flight was a special moment. (ABC Southern Qld: Peter Gunders)\n\nShe recalls her flying \"milestones\" with pride.\n\n\"My son was my first ever passenger,\" Ms Browne said.\n\n\"How many mums get to take their 30-year-old sons flying?\"\n\nComing to flying later in life, Ms Browne said her new-found skill aligned with her lifelong passion for learning.\n\n\"I think once you stop learning, you die. And once you stop doing things you enjoy, you might as well be dead anyway,\" she said.\n\nHer instructor, chief pilot Trevor Bange at Clifton on Queensland's Darling Downs, said having a mature-age student in the passenger seat was becoming more common.\n\nTrevor Bange is the chief flying instructor at the Lone Eagle Flying School in Clifton. (ABC Southern Qld: Peter Gunders)\n\n\"Once the children are off their hands, they've finished university, they've now got themselves a bit more settled in life,\" he said.\n\n\"That's why I always promote it in retirement, they've got the time to spare and can come out here and enjoy a bit of company with people who have a like-minded interest in the concept of aviation.\n\n\"It's never too late. We had a pilot here who flew into his 90s.\"\n\nWomen under-represented in aviation\n\nIn Australia, women account for between 5 and 7 per cent of recreational and commercial pilots.\n\n\"We're obviously extremely under-represented in the industry,\" said Sarah Hume, national president of the Australian Women Pilots' Association (AWPA).\n\nThe AWPA was founded by aviation pioneer Nancy Bird Walton.\n\n\"Nancy's whole goal was to increase the number of women pilots in Australia. There were 50 pilots that all gathered at Bankstown in 1950,\" Ms Hume said.\n\n\"Now there's 550 to 600 of us in the association. So, we've definitely come a long way, but 5 to 7 per cent isn't good enough.\n\n\"I was a pilot for nearly four years before I ever saw another woman pilot in my same job.\"\n\nMs Hume said to boost the numbers, three key areas needed attention: strong mentorship and support networks, improved financial access to training, and more inclusive employer practices.\n\n\"There's a real shortage of pilots in the industry, so we are missing out on a huge percentage of the population by not employing women as much as we employ men,\" she said.\n\nIt's one of the reasons Carol Browne pursued her instructor rating.\n\nCarol Browne is now training to become a flight instructor. (ABC Southern Qld: Peter Gunders)\n\n\"I was able to talk to a little six-year-old one day,\" she said.\n\n\"She didn't want to go flying with her dad because she was scared, but I was able to say, 'Look, I fly these, it's a girl thing to do.'\"\n\nAnd she wants girls of all ages to have the same experience.\n\n\"I think the fact that other people saw that I could do it meant that they didn't have to be afraid of failing because of their age,\" Ms Browne said.\n\n\"You can fail because you lack motivation. You can fail because you goof off and you don't work, but you don't fail because you're older.\n\n\"It's a beautiful world from up there. It's really beautiful.\"\n\nCarol Browne learnt to fly on Queensland's Darling Downs. (ABC Southern Qld: Peter Gunders)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/marathon-tribute-to-honour-father-suffering-locked-in-syndrome/105490648",
        "title": "Son to push father with locked-in syndrome through Gold Coast Marathon",
        "publish_date": "Sun, 06 Jul 2025 00:46:24 +0000",
        "category": "sports",
        "authors": [],
        "text": "When Clay Daly's father suffered a massive stroke, a lot of things went through the 23-year-old's mind, but none of them involved a long-distance running race.\n\n\"He was unable to move, unable to talk,\" Clay said.\n\n\"We were told he was going to pass away.\"\n\nThe medical emergency in December 2023 left Clay's father, Mark, with locked-in syndrome — a neurological condition that leaves people physically paralysed but otherwise aware and conscious.\n\n\"Everything looks very, very different now in life and around home,\" Clay said.\n\n\" My dad needs 24-hour care now, but this is what we do now and we just take it in our stride. \"\n\nClay Daly is running the Gold Coast Marathon with his father who suffered a life-altering stroke. (ABC Gold Coast)\n\nThe pair has found a new goal and purpose by running the Gold Coast Marathon alongside 39,000 other competitors.\n\n\"A marathon itself is a massive ordeal, but while pushing someone in a wheelchair as well — my dad is a big man,\" Clay said.\n\n\"He's over six foot [1.8 metres] and over 100 kilos, so it's a lot to push.\"\n\nAlmost 40,000 runners will compete in Gold Coast Marathon events. (ABC Gold Coast: Heidi Sheehan)\n\nClay said they expected to finish Sunday's marathon in around four hours, after preparing for the 42-kilometre feat in just six weeks.\n\n\"We originally did it just to start running, get out of the house. Get some sun and fresh air,\" he said.\n\n\" [But Dad] was super excited. We actually came up with the idea together. \"\n\nThey even modified a specialised wheelchair for the marathon.\n\n\"Along the race, I'm going to have to get my family to meet us at certain points for his food and medication,\" Clay said.\n\nA voice for stroke survivors\n\nStrokes are the leading cause of disability in Australia, but around 80 per cent of them can be prevented according to the Stroke Foundation.\n\nRisk factors include high blood pressure and cholesterol, type 2 diabetes and heart conditions that affect blood flow.\n\nClay said he wanted to raise awareness and funds for stroke survivors and their families, and remind people of \"the simple pleasures of life\".\n\n\"My dad hasn't been able to eat food, he has to get fed through a feeding tube now,\" Clay said.\n\n\"We haven't had a proper normal conversation in 18 months like we used to be able to.\"\n\nClay Daly is running the Gold Coast Marathon to honour his dad, Mark. (ABC Gold Coast)\n\nThe marathon also represents a chance for Clay to connect with his dad on a new level.\n\n\"It was something I wanted to do to honour my dad, honour his strength and the pain and suffering that he's been through,\" Clay said.\n\n\"I wanted to fill those boots and take care of him like he has for me all these years.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/york-park-alternative-hobart-macquarie-point-stadium-explainer/105486542",
        "title": "Why York Park is not considered an alternative to the new Hobart stadium",
        "publish_date": "Sun, 06 Jul 2025 00:42:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "Of all the questions asked by Tasmanians throughout the stadium debate, a couple stick out.\n\nWhy does a new stadium need a roof? Why does Tasmania need a stadium at all?\n\nBut perhaps the most often asked question relates to the team location.\n\nWhy can't a Tasmanian AFL team be based in the more geographically central city of Launceston and play out of York Park?\n\nIt's been regularly raised by ABC's state election Your Say respondents.\n\nThe problem isn't York Park\n\nEven with a planned upgrade, York Park will still be too small to be the Devils' primary home ground. (Austadiums.com)\n\nYour Say: Tell us what matters to you this Tasmanian election Photo shows Have your say for the Tasmanian election. We want to know what issues matter most to you and what you want us to find out as Tasmania goes to another election.\n\nKate from Blackmans Bay was opposed to a new Hobart stadium and said \"they should update the stadium at York Park, Launceston\".\n\nGerry in Beauty Point said Tasmania \"should have an AFL team based at York Park, upgraded of course\".\n\nIt's not a new proposition.\n\nThe latest iteration of the argument is rooted in opposition to a new and expensive stadium in Hobart and greater access to AFL games for Tasmanians from the north and northwest.\n\nWhile it's true that York Park is indeed a perfectly solid football ground, with a playing surface regularly referred to one of the best in the nation, York Park's problem isn't York Park.\n\nIts problem is Launceston.\n\nHobart preferred for player retention\n\nThe playing surface at York Park is highly regarded. (Facebook: University of Tasmania Stadium)\n\nPlayer, coach and staff retention is a challenge that was quickly identified by the Tasmanian AFL task force when it compiled the Devils business case in 2018, leading it to make a key finding — it would be difficult to attract and retain personnel if the club wasn't based in Hobart.\n\n\"Based on the advice provided to the Taskforce by the AFL, AFL Players Association, community consultation and the fact that most of the playing roster presently would be from the mainland states, Hobart would be the likely team base\" it reads.\n\n\"In terms of the key drivers around team location, it should be reconsidered to centre around player attraction and retention, the availability of partner jobs, schools and general demographics.\n\n\"It is highly likely the majority of the playing roster will be from interstate and so air links and general access for partners, families and friends were also assessed,\" it continues.\n\nStadium issue a vote changer Photo shows Man looking away from camera wears green beanie with 'Devils' written on it Whether or not to spend many millions of dollars on a stadium in Hobart is a question being weighed by voters, with some saying they'll change who they usually vote for.\n\nThe notion was supported by former AFL commissioner and independent assessor Colin Carter in his analysis of the business case, where he said:\n\n\"Half the state's population lives in Hobart, which has a good lifestyle, services and airport connectivity, university access, jobs for partners and spouses. And, compared to the mainland, it has modest housing prices and relatively lower cost of living.\"\n\nThe point was further impressed by Tasmanian commentator Tim Lane, who gave evidence to a legislative council select committee on AFL in Tasmania in 2020.\n\nHe believed that \"the infrastructure, the social circumstances and what-have-you of the capital city should be available to a group of 40 young men coming together to play football there\".\n\n\"The idea of putting it in a regional city of lesser population, infrastructure and everything else is something that could be seen to weaken the case,\" he said.\n\nFormer Collingwood president Eddie McGuire put it a little more bluntly in 2023 when he said: \"I don't think there's any kids at the moment lying awake hoping that they're going to play in Tasmania on a refurbished oval in Launceston.\"\n\nOf course, things have changed since then.\n\nCrowd numbers\n\nLoading...\n\nHealth issues top the list for these Tasmanian voters Photo shows Table scattered with medical items including a stethoscope. Two people's arms with one taking the other's blood pressure While a proposed AFL stadium has been a hot topic for discussion this election, many Tasmanians say their health needs are the main issue when considering how they'll vote on July 19.\n\nThe proposed Macquarie Point stadium has people thinking about alternative options for the team, given its cost and location.\n\nBut does putting the Devils in Launceston solve much of the problem? Would it make the state's AFL dream that much cheaper?\n\nWhile the AFL has listed the current capacity at York Park as high as 19,500, the true figure is considered lower.\n\nJames Avery, chief executive of Stadiums Tasmania, explained York Park's current seated capacity is 13,106, with a total capacity of 15,500 if you include standing patrons.\n\nAfter the planned redevelopment, the seated capacity would be 16,578, with a total capacity of 17,500.\n\nThat is short of the forecast average Devils crowd of 18,000, and 6,000 short of the ideally-sized 23,000 needed for games against higher-drawing clubs.\n\nCapacity constraints affect financial viability\n\nYork Park's capacity, even with an upgrade, is considered as not enough to viably host Devils matches with popular opposition teams. (ABC News: Morgan Timms)\n\nTasmania Football Club chief executive Brendon Gale told a planning commission panel last week that playing in a smaller stadium would lock fans out of games, and in turn, hurt the club's bottom line.\n\n\"Our average crowd forecast on a conservative basis is at 18,000 which is already outside the capacity of existing stadia,\" Mr Gale said.\n\n\"Forget about the financial constraints, we'd have massive capacity constraints.\n\n\" If you want to be a club that provides access and affordability, you're simply not going to be able to get people in. \"\n\nTasmanians have taken to displaying stickers to convey their position on the proposed Hobart stadium. (ABC News)\n\nBellerive also not an option\n\nA larger, and costlier, upgrade would be required to get York Park up to the required level of capacity, and while it would likely cost less than what's estimated for a new build at Macquarie Point, it would only create a secondary problem around capacity for games in Hobart.\n\nWith no new stadium, Devils matches would need to be staged at Bellerive Oval — a 13,000-seat cricket ground, that while capable of hosting games of football, would be too small to satiate the demand of tens of thousands of Devils members, robbing the club of an estimated $5.9 million in revenue each year.\n\nWhy not Bellerive Oval? The answer is more complicated than you think Photo shows A sports stadium as seen from the sky. Bellerive Oval has hosted AFL games for years, so why does Hobart need a multi-million-dollar stadium for its newly minted footy team?\n\nThe idea of upgrading that venue has repeatedly been dismissed, given its tight suburban constraints.\n\nIn 2018, the Tasmanian AFL task force addressed this, firmly declaring playing at Bellerive long-term would be highly detrimental to the team and its fans.\n\nIt flirted with the idea of basing a team at a 27,000-capacity York Park, but even that would have only been in the short term, and until a new Hobart CBD stadium was constructed.\n\nA team playing out of Launceston, with Hobart as its secondary venue, would also make little sense demographically.\n\nNumbers just don't add up\n\nThe AFL lists the record attendance for York Park as 20,971, when the Hawks played Richmond in June 2006. (Supplied: City Of Launceston)\n\nThere are 114,000 people living within a 25-kilometre radius of Launceston, compared to about 250,000 people within the same distance of Hobart.\n\nAbout 70 per cent of the state's population live within a one-hour drive of the capital, compared to about 30 per cent for Launceston.\n\nThat might be why the proposed split for Devils games in Hobart and Launceston from 2028 is 7 and 4.\n\nA team in Launceston might be good for Launceston, but it would be bad for the team — and not much chop for most Tasmanian football fans.\n\nAnd while it would probably save some short-term stadium spend, the long-term cost could be much higher.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/rti-jeremy-rockliff-chocolate-experience-tasmania-hobart/105496508",
        "title": "Where is the 'chocolate fountain' promised to Tasmanians at the 2024 election?",
        "publish_date": "Sun, 06 Jul 2025 00:33:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "When it comes to eye-catching election promises, it's hard to look past \"the world's tallest chocolate fountain\".\n\nIt was midway through the Tasmanian election campaign last year when Premier Jeremy Rockliff strode into the Cadbury factory in Hobart to make the announcement, alongside tourism developer Simon Currant.\n\nTasmanian tourism developer Simon Currant and Premier Jeremy Rockliff at the funding announcement at the Cadbury factory in Hobart last year. (7 Tasmania)\n\nAnd it wasn't just a chocolate fountain; it was pitched as an entire \"chocolate experience\".\n\nThere would be a \"bespoke chocolate studio\", a chocolate lounge, an \"immersion into chocolate making\" and even an arboretum.\n\n\"This will be MONA-esque,\" Mr Rockliff told the media.\n\nThen came the public funding.\n\nMr Rockliff promised $2 million for planning, designs and approvals, then another $2 million for public site works and a further $8 million for the precinct.\n\nThe \"Chocolate Experience\" was proposed to be built separately from the Cadbury factory, rather than conduct tours of the factory. (ABC News)\n\nIt seemed to come out of the blue.\n\nBut it turns out, it had been bouncing around with Tasmanian public servants for over two years.\n\nInternal communications and reports — obtained under right to information — show undisclosed grants to help the developer gauge demand and no available detailed business case or economic impact study when Mr Rockliff promised the funds.\n\nAnd before he made the promise, documents show public servants were under the impression that the developer was already funding the first $2 million themselves.\n\nThey also wrote advice that the developers would ultimately seek one-third funding for the entire construction cost, but this has since been ruled out.\n\nIt starts with two small undisclosed 'custom grants' to developers\n\nMr Currant has a list of successful tourism ventures across Tasmania, from Strahan Village on the west coast, to Pumphouse Point in the wilderness world heritage area.\n\nSimon Currant has developed a number of tourism ventures in Tasmania, including Pumphouse Point (pictured) in the wilderness world heritage area, and Cradle Mountain Lodge and Strahan Village. (Supplied: Pumphouse Point)\n\nHis next venture — the \"chocolate experience\" proposal — made its way through the doors at the Department of State Growth in February 2022, when Mr Currant asked for funds for a demand study.\n\nThe department was happy to oblige, it just needed a bit more information about what the project actually was.\n\n\"As discussed please see attached as a very quickly put together overview,\" Mr Currant wrote to the department's deputy secretary.\n\nHaving looked over the 15-page project summary, the department recommended providing a $79,800 grant to Simon Currant and Associates (SCA) for the study, matched by Cadbury parent company, Mondelez International.\n\nA funding pathway for the grant was \"identified\" — it would come from a tourism hospitality stream.\n\nAn artist's impression of the \"chocolate lab\". (Supplied)\n\nIt was not publicly disclosed and was one of the only grants in the stream to go to a private tourism developer outside of established grant programs.\n\nThe demand study was created, based on an online survey of 827 people to gauge interest in the chocolate experience.\n\nOnly 12 out of 44 pages of the publicly funded document were released to the ABC showing generic information like population and tourism visitor data, the rest was redacted as commercial in confidence.\n\nThe proposed \"chocolate emporium\". (Supplied)\n\nA month later, the developers asked for more funds from State Growth for a feasibility study, using the demand study to show the project's \"potential contributions to the Tasmanian visitor economy\".\n\nA letter from Mondelez backing the idea was also provided.\n\nThe department approved this funding request, so another $70,000 grant was provided to help the developers update financial figures and develop a public relations strategy and a corporate strategy.\n\nThis second grant was also placed under the tourism hospitality funding stream, and not publicly disclosed.\n\n\"These were one-off custom grants following various discussions and negotiations noting the significant potential of the project and in line with the T21 Tasmanian Visitor Economy Strategy,\" a State Growth spokesperson said.\n\nDepartment had questions around the numbers\n\nState Growth's tourism and hospitality team seemed a little uncertain on some of the details, well before Mr Rockliff made his funding promise.\n\nThe \"taste kitchen\" at the proposed Chocolate Experience at Cadbury in Hobart. (Supplied)\n\nWith ministers set to face questioning in budget estimates, they sent part of the minister's brief to Mr Currant for his feedback, in case it came up.\n\nAn internal departmental email noted that some details in the funding agreement were \"unclear\".\n\n\"The paperwork we have access to does lack some context given that we came to the administration of the (grant) deeds later,\" it reads.\n\nMr Currant and business partner David Inches were pleased with progress, with Mondelez \"excited by and supportive of\" the project.\n\nThe \"time tunnel\", one of a number of proposed features at the Cadbury Chocolate Experience. (Supplied)\n\nMr Currant took the project to the Office of the Co-ordinator General, and it started to appear in the office's fortnightly briefings with Mr Rockliff.\n\nState Growth deputy secretary Mark Bowles also kept the premier up to date.\n\n\"I've verbally updated the premier and he's keen to show what support he can for the project,\" Mr Bowles told Mr Currant in an email.\n\nThe department started preparing a brief for Mr Rockliff in mid-2023 and asked for updated information from Mr Currant, who sent a document intended for investors, requesting state servants sign non-disclosure agreements.\n\nA brief was completed in November, saying the demand study had \"ambitiously\" projected the project would bring 34,000 additional visitors to Tasmania, and that the department was reviewing all the information.\n\n\"It is felt that further questions may emerge from this review, and these will need to be resolved by the developer prior to any further advice being provided to government,\" it reads.\n\nDepartment wanted more information before funding provided\n\nWhile State Growth appeared to have some questions, it was full steam ahead with the Office of the Co-ordinator General — an office that works to attract investment in Tasmania.\n\nPremier Jeremy Rockliff with Cadbury staff on the day of the $12 million announcement. (7 News)\n\nIt started to prepare a case for the developers to apply for government funds through the Tasmanian Development Board, with Tourism Tasmania supporting it as filling a gap for the 'young families' tourism market.\n\nA meeting was arranged between Mr Currant, Mr Inches and Mr Rockliff on February 9, 2024, during which the developers brought a paper to update him on.\n\nIt's unclear what was in this paper.\n\nThe Cadbury factory is at Claremont, up the Derwent River from the Hobart waterfront. (Cadbury)\n\nHowever, a meeting brief by State Growth appeared to advise some caution.\n\n\"While the project is innovative and could deliver good outcomes for the Tasmanian economy … the request is very significant and will require a detailed commercial review,\" it reads.\n\n\"(Simon Currant and Associates) will need to provide a detailed proposal and make all project information available for verification and analysis to feed into a business case for government support.\n\n\"Given the scale of the request, State Growth may consider funding an independent analysis of the proposal to verify its economic and social benefit to Tasmania.\"\n\nA few days later, more State Growth advice was written for the premier.\n\nIt stated that the developers had requested one-third of the total construction cost for project, on top of the planning costs — a government contribution that, at that stage, could be a further $25 million to $30 million.\n\nA month later — on March 10, 2024 — Mr Rockliff walked into the Cadbury factory with Mr Currant to make a funding promise.\n\nWas the $2 million in government funds already privately funded?\n\nThe first $2 million of the promise was for \"planning, designs, approvals\", which Simon Currant and Associates describe as phase two.\n\nBut advice to the premier a month earlier stated that the developers were already funding this.\n\n\"SCA has indicated it is independently funding Phase 2 … costing $2 million,\" it reads.\n\nA spokesperson for SCA said the total cost of the planning and design phase is \"significantly higher\" than what was known at that time, and the remaining costs were privately funded.\n\nMr Currant and Mr Rockliff, with Cadbury staff, at the March 2024 announcement. (ABC News)\n\nThe project also involved two electric ferries to transport visitors to and from the Chocolate Experience site, requiring upgrades to the Brooke Street pier on the Hobart waterfront — originally described as an extension.\n\nBut the SCA spokesperson said the pier would not be extended.\n\nSCA is yet to access the second $2 million in funding, which is largely for public site works.\n\nIt plans to submit a development application with Glenorchy council later this year.\n\nEarly concept images of the Chocolate Experience included this \"mass ingredient barn\". (Supplied)\n\nA spokesperson says it has provided a business case to the government.\n\nThe government is yet to formalise the process for the final $8 million — or determine what the funding will be spent on.\n\nSCA says the total project cost is now $155 million.\n\n\"SCA will not be seeking any further grant funding from the government,\" a spokesperson said.\n\n\" The project will be primarily funded by private investment. \"\n\nWhen asked if Mr Currant will be an equity partner in the project, giving him a stake in its profits and losses — as noted in a government document, seen by the ABC — SCA responded that \"the community will benefit through increased investment, more jobs through construction\".\n\nSCA said Mondelez International — one of the world's largest confectionary companies — has \"no financial stake in the project\", but is providing land lease and access to Cadbury branding.\n\nHobart idea draws from Dunedin closure, to Lindt experience\n\nThe last Cadbury factory tours in Hobart closed in 2010.\n\nTours also ended at the Cadbury factory in Dunedin, New Zealand, in 2017, and Mr Currant told the department he had \"brought back together\" the team from that venture.\n\nDevelopers of the Hobart proposal took some inspiration from the Lindt chocolate experience in Switzerland. (Lindt)\n\nPart of the feasibility study involved a \"study tour\" to the Lindt experience in Switzerland, which could be similar to the scale of the tour planned in Hobart.\n\nAn SCA spokesperson said the new Chocolate Experience in Hobart would target more modern tourism demands.\n\n\"What SCA is proposing is not comparable to the previous tours,\" they said.\n\n\" This is a new, immersive experience more on par with similar experiences in Europe, Japan and USA and price points that are aligned with Tasmanian attractions. \"\n\nThe partly government-funded demand analysis estimated it could add $104 million to the annual spending by tourists.\n\nThis week, Mr Rockliff said it would be a major contributor to the state's tourism economy.\n\n\"One in six Tasmanians are employed in the tourism and hospitality sector,\" he said.\n\n\"We have backed this project with a $12 million investment to get the project shovel-ready and commence initial site works, including public walkways, cycleways and headworks, subject to agreed milestones.\"\n\nThe ABC asked Mr Rockliff what level of detailed business case and economic analysis he had access to when he made the $12 million funding promise, and if the $2 million was already privately funded, but this was not clear in the response.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/woman-taken-to-hospital-after-animal-bite-queensland-zoo/105499728",
        "title": "Woman suffers significant arm injuries after animal bite at zoo",
        "publish_date": "Sun, 06 Jul 2025 00:30:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "A woman in her 50s has been airlifted to hospital with significant arm injuries after being bitten by an animal at a Queensland zoo.\n\nIt's understood the woman was bitten by a big cat.\n\nEmergency services said they were called to the Darling Downs Zoo in Pilton, south of Toowoomba, around 8:30am this morning.\n\nThe woman was assessed at the scene and subsequently transported to Brisbane's Princess Alexandra Hospital in a stable condition.\n\nA post on the zoo's Facebook page confirmed it would be closed all day due to \"unforeseen circumstances\".\n\nDarling Downs Zoo is home to several species of big cats, (ABC News: Tobi Loftus)\n\nThe zoo, which is a two-hour drive from Brisbane, is home to several species of big cats including lions, tigers and leopards.\n\nDarling Downs Zoo has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/cleveland-dodd-inquest-analysis-can-progress-be-sustained/105487892",
        "title": "Historic issues continue to haunt WA’s most vulnerable children",
        "publish_date": "Sun, 06 Jul 2025 00:26:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "The way some of WA's most complex and vulnerable children have been failed in recent years has drifted from the headlines recently.\n\nWARNING: This story discusses incidents of self-harm and contains the name and image of an Indigenous person who has died.\n\nPart of that is a good thing, because conditions in youth detention have so markedly improved.\n\nLockdowns ruled unlawful by the Supreme Court are a thing of the past. Young people are out of their cells much more often and benefiting from a wide range of supports.\n\nCoroner's early take on teen's death shows Justice Department on defensive Photo shows Roslyn Sullivan speaks to journalists. In handing down his early assessment of Cleveland Dodd's death, the coroner could have given a vote of confidence in the Department of Justice's response to the tragedy. He didn't. WARNING: This story discusses incidents of self-harm and contains the name and image of an Indigenous person who has died.\n\nIn theory, we're on the path to a safer society for everyone.\n\nBut the inquest into the state's first recorded death in youth detention, which probed more than a decade of troubles, has highlighted how similar progress in the past has been short-lived and eventually given way to a return to crisis.\n\nIt makes the government's next steps, to do more than bandaid over problems, so critical, even if they are taken out of the public eye.\n\nWhen will Unit 18 close?\n\nThe biggest bandaid to rip off is closing Unit 18, a hastily constructed youth detention facility inside the adult Casuarina Prison, where Cleveland Dodd fatally self-harmed nearly two years ago.\n\nThe government first promised to build a replacement facility in late 2023, but it took nearly a year to work out where to put it and commit $11.5 million for planning and early site works.\n\nNearly a year on again there is still no firm plans, no aimed completion date or money for construction.\n\n\"It's important you get these things right,\" Corrective Services Minister Paul Papalia said during the week.\n\nPaul Papalia was the minister for corrective services when Cleveland Dodd died. (ABC News: Keane Bourke)\n\n\"It's important that the design is thorough, it is informed by a lot of work, not just with people like architects and prison authorities but also the people who work inside those youth detention facilities right now.\"\n\nThat is a fair point but it begs the question: why did that work only start after the state recorded its first death in youth detention, and more than a year after Unit 18 was opened?\n\nImplicit in the decision to create Unit 18 was an acknowledgement that a second youth detention facility was urgently needed.\n\nCleveland Dodd was just 16 when he fatally self-harmed inside Unit 18. (Supplied: Family)\n\n\"The priority clearly at the time … was making the place safe, and that continued until the end of 2023 really,\" Papalia said during budget estimates, highlighting damage done to cells and a major riot.\n\nThree years on though, the waiting game continues.\n\nSolution not simple\n\nWA's top child advocate, Jacqueline McGowan-Jones, wants young people out of an adult facility \"as soon as we can\" — but said it was not a simple situation.\n\n\"A couple of our neurodivergent kids actually find it really helpful to be over there because it's way less frantic and way less busy,\" the Commissioner for Children and Young People said.\n\n\"What we need to do is make sure wherever our kids are, it is the best possible care and support.\"\n\nWA Commissioner for Children and Young People Jacqueline McGowan-Jones. (ABC News: Keane Bourke)\n\nPart of that, Ms McGowan-Jones said, was about the facilities.\n\nBut she said it was also about the supports available to young people to achieve the ultimate aim of detention — rehabilitation.\n\n\"We have done some really great cohort work with programmes and initiatives and supports [recently],\" she said.\n\n\"We still need the right approach to individualised plans that look at this child, at this time, and what is going on for them and what is needed.\"\n\nSpecial inquiry unlikely\n\nAmong the 25 recommendations put to Coroner Philip Urquhart at an inquest into Cleveland's death, many are addressed at that aim.\n\nBut he also proposed another on Tuesday in an effort to learn from the mistakes of the past: hold a special inquiry into the systemic failures over the decade leading up to Unit 18's opening.\n\nSpecial inquiry into Unit 18 flagged by coroner in wake of teen's death Photo shows Counsel assisting the commissioner, Philip Urquhart The coroner investigating Western Australia’s first recorded death in youth detention says there is significant evidence the teenager’s needs were not met, and indicated he may call for a wider-ranging inquiry.\n\nWhile some of that information came out during the inquest — including how rushed decisions to open the unit were — the law prevents the coroner from making official findings or recommendations which are not closely connected to Cleveland's death.\n\nA special inquiry could make those findings, but would first have to be ordered by government, which seems unlikely.\n\nIt's also an idea which has not found a lot of support.\n\nMs McGowan-Jones said the money would be better spent on improving supports for those in detention and stopping others from going on to offend.\n\nDelivering 'real change'\n\nOne of the people who would likely be called before that inquiry, former Corrective Services Commissioner Mike Reynolds, agreed.\n\nLast year he told the ABC the state government never gave him the resources or support to do his job, especially as problems arose in youth detention.\n\nMike Reynolds was sacked as corrective services commissioner in the wake of Cleveland Dodd's death. (ABC News: Cason Ho)\n\n\"The coronial inquest has already thoroughly examined the circumstances, decisions and systemic factors leading to the opening of Unit 18,\" he said this week.\n\n\"A further inquiry risks duplicating that work without delivering new insights or practical solutions.\n\n\"Instead … I believe the focus should shift to implementing the recommendations where possible, improving conditions and outcomes in youth detention, and strengthening accountability in a way that delivers real change for young people, staff and the community.\"\n\n'We'll continue to work hard'\n\nHis successor, Brad Royce, told media outside court this week that was exactly what he was doing.\n\n\"There's over 630,000 young people in this state and we're talking, at any one time, less than 100 in care,\" he said.\n\nBrad Royce says the Justice Department will continue to work hard to deliver change in youth detention. (ABC News: Keane Bourke)\n\n\"They are in our care, we acknowledge that we have a lot of work to do and we'll continue to work hard in that space.\"\n\nCleveland's death — and another suicide in youth detention 10 months later — has given Royce the resources to do that work now.\n\nOne of his key challenges will be keeping the government's attention so that he continues to have those resources if everything goes to plan and youth justice issues drift further from the headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/goon-bag-surfer-james-mcanaulty-fringe-surfing/105470926",
        "title": "Surfing a goon bag the Aussie twist on fringe surfing",
        "publish_date": "Sun, 06 Jul 2025 00:17:21 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "James McAnaulty surfs like no other.\n\nHe slides down the face of waves on Western Australia's southern coast on an empty wine bladder.\n\nThe \"goon bag\" is half inflated and hashed with lines of wax.\n\n\"It's legit,\" Mr McAnaulty says.\n\n\"It's got nice pull; it's got nice drag.\n\n\"It's a legit surf craft that I highly rate.\"\n\nFor James McAnaulty, a goon bag is the ultimate surf craft. (ABC Great Southern: Samantha Goerling)\n\nIt's not the only unconventional surf craft he's tried.\n\nHis foray into the alternative world of surfing began when a mate challenged him to catch a wave with an inflatable travel pillow.\n\n\"That got my attention, so from that I went on to surf mats,\" Mr McAnaulty says.\n\n\"I've tried the Maccas tray, that was fun, bit hard on the thumbs.\n\n\"I've tried hand planes, they're not too bad, and lots of mini short boards like kick boards and paddle boards.\"\n\nJames McAnaulty shakes the water from his hair after a surf at Mutton Bird. (ABC Great Southern: Samantha Goerling)\n\nThen an empty goon bag on the kitchen bench struck him as not dissimilar to an inflatable surf mat.\n\nWith a set of fins in tow, he headed to the beach to test it out.\n\n\"It's very slippery; you need to wax up,\" he says.\n\n\"Deflation levels as well need to be a certain nice level, so it's not too round and not too low.\n\n\"Challenging, it's good cardio, lots of work on the thighs.\"\n\nLoading...\n\nAfter only a few sessions refining preparation and technique, it became his surf craft of choice.\n\n\"This is the pinnacle,\" he says.\n\nThe goon bag, Mr McAnaulty says, fits firmly in the field of \"fringe surfing\".\n\n\"It's just an alternative way of riding surf crafts, it's very open, like anything goes really,\" he says.\n\n\"Just make it fun for yourself, pretty much, and try not to live by other people's expectations of what's cool.\"\n\nJames McAnaulty says fringe surfing is all about getting in the water and enjoying the waves. (ABC Great Southern: Samantha Goerling)\n\n'Get your slide on'\n\nWatching from afar, a burgeoning fringe surf community in the United Kingdom is spurring on Mr McAnaulty's creativity in the waves.\n\nOn the UK's rugged south-west coast, veteran surfer turned fringe surf enthusiast Steven Halpin has just launched an alternative surf magazine.\n\n\"The more I came across the characters that make up the fringe of surfing, the more I related to them,\" he says.\n\n\"The lack of ego, treading their own path, as surfing became more mainstream.\n\n\"I'll never look back.\"\n\nSteven Halpin launched into the world of fringe surf craft after more than 40 years of traditional surfing. (Supplied)\n\nThe owner of the Fringe Surf Shop in Newquay, Mr Halpin defines fringe as anything outside of mainstream that enables you to \"get your slide on\".\n\n\"I guess bodyboarding is also fringe … they are brothers and sisters of the slide, and I respect them greatly,\" he says.\n\nHis own repertoire of \"weird and wonderful\" includes burger trays, surf mats, and hand planes.\n\n\"Sometimes it's a nightmare trying to decide which one to take, as I have so many to choose from, but I pretty much always have a blast on all of them,\" Mr Halpin says.\n\nWhile many of these are not new, Mr Halpin says there is a growing number of traditional surfers turning to fringe craft.\n\n\"Whether it's due to age, injury, or just wanting to find a different way to slide waves, it's really grown over here,\" he says.\n\nSteven Halpin says fringe surfing is about \"getting your slide on\" and having a blast in the water. (Supplied)\n\nThe longtime editor of Real Surfing Magazine, Mr Halpin published the first edition of Fringe in May, initially running 500 copies, and going to reprint a fortnight later.\n\n\"I was so shocked, it turns out there are more of us around the world than I thought,\" he says.\n\nOrders had come in from America, Europe, South Korea, Japan, South Africa and Australia.\n\n\"I'm stoked and hope that it can inspire people to just get in the water, have fun again, and put a big smile on their faces.\"\n\nLooking for the new thing\n\nIn Australia, Johannes Oberholster rises early to build surf mats in his home studio in Brisbane before his day job.\n\nJohannes Oberholster became hooked on surf mats when he realised he could pack one into his travel bag. (Supplied: Kyle Cabano)\n\nHe became enthralled with mat riding in 2021, when he realised he could easily pack one on an overseas trip.\n\n\"You're sort of sliding around and getting amazing speed down the line, I'm just loving the fun of it and just the feeling of it,\" he says.\n\n\"It's a very welcoming community, and everybody just wants to have fun.\"\n\nEach mat takes him around six hours to build, and since launching Cumulus Surf Mats in early 2023, he's sold nearly 250 mats.\n\n\"Probably 10 years ago, it was really considered quite a niche market, quite fringe,\" Mr Oberholster says.\n\nJohannes Oberholster has made hundreds of surf mats in his home workshop. (Supplied: Kyle Cabano)\n\nInterest has peaked in the past five years, Mr Oberholster says, in part thanks to social media.\n\n\"Everyone's always looking for the new thing.\" Mr Oberholster says.\n\n\"You definitely see a lot more younger surfers surfing them now, especially in Australia, whether it's Byron Bay, Noosa, anywhere where there's a nice long point.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/formula-one-british-grand-prix-oscar-piastri-qualifies-second/105499576",
        "title": "'I was a bit safe': Piastri to start from second in British GP",
        "publish_date": "Sat, 05 Jul 2025 22:53:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Formula 1's hot topic is where Max Verstappen might go next season, but there was no doubt about where he belonged on the grid as he snatched pole position for the British Grand Prix.\n\nAs his title rivals from McLaren made small but costly errors, Verstappen had the pace when it mattered most.\n\nHe sacrificed grip for speed and went fastest by 0.103 of a second to beat Oscar Piastri's time. Lando Norris was third, .015 further back, as his fans in the new \"Landostand\" saw a setback to his chances of a first home win.\n\nFerrari's Lewis Hamilton, a record nine-time winner of his home race, was also in the fight for pole but had to settle for fifth after a relatively slow end to his lap.\n\nWith George Russell fourth for Mercedes, that made three British drivers in the top five, but none on the front row.\n\nPiastri lost time with a slight slide in the last corner on his final run, while Norris clipped a curb on an otherwise strong lap.\n\nVerstappen had seemed pessimistic about having the pace to challenge the McLarens at Silverstone — Ferrari had been closer than Red Bull in practice — and he described his car as \"so difficult\" over the radio partway through the session. Even so, he found the pace for pole.\n\nOscar Piastri in action during qualifying at Silverstone. (Getty Images: Rasid Necati Aslim/Anadolu)\n\nAfter Verstappen was frustrated with his car in practice, Red Bull tweaked the set-up for higher straight-line speed, at the cost of some grip, especially in Silverstone's many high-speed corners.\n\n\"It seemed to hold on,\" was Verstappen's verdict.\n\nIn Monday morning's race at 12am (AEST), that could make it trickier for the McLarens to get close enough to try to overtake. Even with the DRS overtaking aid, Norris said the McLarens might be able to match Verstappen's higher top speed only on the straights, not reel him in.\n\nPiastri said the conditions reminded him of qualifying at the Japanese GP in April, when Verstappen took pole. He kept both McLarens behind him in the race for his first win of 2025.\n\n\"I was trying to think of how I was going to go faster and I didn't,\" Piastri said.\n\n\"The last lap was a little bit messy, but it's been tight all weekend.\n\n\"I think my first lap was very good … but I left a little bit on the table.\n\n\"It's tough, especially when you think it's a good lap. You don't want to overdo it and try and go over the limit. There were a couple of corners where maybe I was a bit safe on the way in and tried to make up for it on the way out and it didn't quite work.\"\n\nOscar Piastri expecting a 'good fight' in Britain Photo shows Oscar Piastri poses with a fan for a selfie photograph during a fan day Formula 1 drivers' championship leader Oscar Piastri says he believes any of the top four teams are in with a chance of victory at Silverstone this weekend.\n\nPiastri has a 15-point lead over Norris, while Verstappen was third, 61 points off the lead.\n\nAmid speculation over Verstappen's future, there was another sign of how much Red Bull relies on the four-time world champion as his teammate Yuki Tsunoda missed the top 10 for the sixth straight qualifying session. Tsunoda placed 12th and will seek to end a run of four races without scoring a point.\n\nMercedes rookie Kimi Antonelli qualified seventh but has a three-place penalty for crashing into Verstappen on the opening lap of the Austrian GP last week, dealing a heavy blow to Verstappen's title challenge.\n\nHaas rookie Oliver Bearman had impressive pace to qualify eighth. It meant little because he already had a 10-place penalty after he crashed in the pits after speeding under a red flag in practice.\n\nFranco Colapinto is under pressure with no points this season at Alpine and did himself no favours by qualifying last with a spin and slide into the barriers that brought out the red flag.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/matildas-inspire-young-boys-play-soccer-football-bunbury-panama/105486858",
        "title": "Matildas inspire new generation of footballers to kick 'like a girl'",
        "publish_date": "Sat, 05 Jul 2025 22:51:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "More than 10,000 people gathered at Bunbury's Hands Oval on Saturday to watch the Matildas play Panama, including local kids keen to see their heroes up close.\n\nAs the Australian women's soccer team took to the field for the first time ever in regional Western Australia, kids lined the fences with permanent markers heavy in their pockets in the hope of scoring a signature after the game.\n\nAmong them was 10-year-old Axel Crowe, who has been an avid fan of the Tillies since the 2023 FIFA Women's World Cup, which saw them reach semi-finals for the first time.\n\nAxel Crowe, 10, says he aspires to play like Matildas' attacking midfielder Amy Sayer. (ABC South West WA: Bridget McArthur)\n\n\"They just never gave up, they kept going and going, even in the finals when they got knocked out sadly,\" he said.\n\nAxel, who plays for the Collie Power Soccer Club, said he had modelled his own game style on the Matildas, in particular attacking midfielder Amy Sayer.\n\nWhile the Matildas have been celebrated for getting a generation of young girls to pull on a pair of footy boots, Axel is one of a growing number of young boys looking to sportswomen as role models.\n\nFootball West chief executive Jamie Harnwell said it was a huge win for the sport at large.\n\nJamie Harnwell says boys and girls alike got Matildas fever during the 2023 World Cup. (ABC South West WA: Ezra Kaye)\n\n\"You see boys on the streets with Sam Kerr guernseys so it's a generation growing up with no barriers,\" he said.\n\n\"My boy plays FIFA and he's got men and women players in his team.\"\n\nFemale sports role models now the norm\n\nGrowing up in Margaret River, former Perth Glory captain Natasha Rigby said her main role models had been men as she simply had not known of many professional sportswomen.\n\nGirls and boys of all ages turned out to watch the Matildas' first game in regional WA. (ABC South West WA: Bridget McArthur)\n\nNow the head of women's football and advocacy at Football West, Ms Rigby said it had been incredible to see that change.\n\n\"When I've gone to hold clinics in schools [and] I've asked them to pick a team name, I'll have an all-boys team be like, 'We want to be called the Matildas,'\" she said.\n\n\" We never really saw that happen prior to the World Cup and for them to not really see gender and for them to see women as role models for themselves is so powerful. \"\n\nIt is not just the Matildas who kids look up to. Margaret River surfer Bronte Macaulay is another role model. (ABC South West WA: Bridget McArthur)\n\nHolly McNamara, 22, who scored her first international goal for the Matildas in a friendly against Slovenia last week, said she had also witnessed a shift.\n\n\"There's not … that stigma that's around 'kicking like a girl' anymore,\" she said.\n\nMatildas coach Joe Montemurro, who took the helm just last month, said he was honoured to join a team that was changing the way the world saw women in sport.\n\n\"It's a really special brand,\" he said.\n\n\"They're amazing role models and it's brilliant to see young boys looking up to [them].\"\n\nHolly McNamara says she has witnessed a shift in the way people view women's sport. (ABC South West WA: Ezra Kaye)\n\nBut Ms Rigby said there was still work to be done at the A-League level to ensure sportswomen were able to get to the point of being elite athletes and role models for the next generation.\n\n\"Our women are yet to be able to play full time and be paid an adequate wage to survive so we've still got a big gap to close,\" she said.\n\nSpotlight on regional communities\n\nDalyellup Park Rangers president Nicky Duncan said participation rates in soccer had skyrocketed across the board after the 2023 Women's World Cup.\n\nThe Matildas' World Cup win inspired lots of boys and girls to join the local league in Dalyellup. (ABC South West WA: Bridget McArthur)\n\n\"I was getting calls at nine o'clock at night saying, 'When does registration open?' and it was like in December and registration was two months away,\" she said.\n\nMs Duncan said it was a huge deal for many players to get the opportunity to see their heroes up close this weekend.\n\nPerth Glory defender Josh Risdon, who has played for the Socceroos, said he was thrilled to see more investment in bringing the sport's best players to regional areas.\n\nDalyellup under 9s boys going through their soccer drills ahead of the Matildas' weekend game. (ABC South West WA: Bridget McArthur)\n\n\"Soccer's always been battling against AFL, rugby, cricket,\" he said.\n\n\"It's good to see the Matildas coming down to Bunbury [to] create more awareness and buzz around the region.\"\n\nThe 32-year-old, who moved from Bunbury to Perth when he was 14 to pursue soccer, said he hoped it would help create more pathways for regional players.\n\nThe Matildas went down 1-0 to Panama in Bunbury but will have another shot in a second friendly in Perth later this week.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/diogo-jota-funeral-liverpool-portugal-players-attend/105499536",
        "title": "Liverpool players join mourning family at Diogo Jota's funeral",
        "publish_date": "Sat, 05 Jul 2025 22:44:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Players from Liverpool and Portugal's national team have joined family and friends for the funeral of their teammate Diogo Jota and his brother, two days after the siblings died in a car crash in Spain.\n\nLiverpool captain Virgil Van Dijk arrived carrying a red floral arrangement in the shape of a soccer shirt with Jota's number 20 in white.\n\nClose friend and Liverpool teammate Andrew Robertson carried a similar arrangement with the number 30, the number worn by Jota's brother, André Silva, who played for Portuguese club Penafiel.\n\nVirgil van Dijk and Andrew Robertson carried wreaths honouring the two brothers. (Reuters: Pedro Nunes)\n\nLiverpool coach Arne Slot was part of the Liverpool contingent.\n\nPortugal international Rúben Neves served as a pallbearer for Jota a day after playing for Al Hilal at the Club World Cup in the United States.\n\n\"More than a friendship, we're family, and we're not going to stop being family just because you've decided to sign a contract a little further away from us,\" he said.\n\n\" I'll make sure you're always there and I'll make sure your family never lacks anything while you're there, far away but thinking of us, waiting for us. \"\n\nJota's legacy will live forever Photo shows Diogo Jota looks to the heavens and smiles Diogo Jota wasn't Liverpool's best player or the most famous. But he will be immortalised in a song that is proof of how deeply he wove himself into the fabric of the city.\n\nPortugal's national team coach Roberto Martínez and several other top Portuguese players also attended, including Manchester City duo Bernardo Silva and Rúben Dias and Manchester United's Bruno Fernándes.\n\n\"These are really, really sad days, as you can imagine,\" Martínez said.\n\n\"But today we showed we are a large, close family. … Their spirit will be with us forever.\"\n\nThe service was held at Igreja Matriz church in the Portuguese town of Gondomar near Porto, where Jota had a home.\n\nThe last time many of his friends in football made the trip to Porto was two weeks prior, for Jota's wedding.\n\nFamily pays tribute\n\nRute Cardoso, who married her childhood sweetheart Jota only weeks before the fatal crash, arrived with relatives.\n\nDiogo Jota and Andre Silva's parents Joaquim and Isabel. (AP: Manu Fernandez)\n\nHundreds of residents of Gondomar, a small town in northern Portugal where Jota grew up, gathered outside.\n\nThe private service was presided over by the Bishop of Porto, Manuel Linda.\n\nIn an emotional homily addressed to Jota's parents, his wife and their three young children, the bishop said \"solidarity in love is always stronger than death\".\n\nThe church was filled to capacity and a couple of dozen people followed the service via loudspeaker from outside.\n\nThe pair's grandfather attended the funeral. (Reuters: Pedro Nunes)\n\nAfterwards, the coffins were carried to the cemetery next to the church.\n\nJota's death at the age of 28 sent shock waves through the world of soccer and beyond.\n\nThe brothers were believed to have been driving to a ferry in Spain to travel to Britain when their Lamborghini veered off the road and burst into flames after midnight on Thursday.\n\nPolice suspected a tyre had burst but are investigating the cause of the crash, which did not involve another vehicle, they said.\n\nReuters/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/wildlife-art-museum-australia-halls-gap-grampians-pomonal/105482062",
        "title": "New Wildlife Art Museum of Australia opens near Grampians",
        "publish_date": "Sat, 05 Jul 2025 22:29:47 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Nestled in the foothills of Victoria's towering Grampians mountain range, also known as Gariwerd, is a new, world-class art centre.\n\nThe new Wildlife Art Museum of Australia (WAMA) at Pomonal in western Victoria is a celebration of environmental art.\n\nThe venue is an Australian first, combining an environmental art gallery with a native Australian garden.\n\nChief executive Pippa Mott said the 16-hectare project was 14 years in the making.\n\n\"[WAMA is] a gallery and garden precinct that exists in proximity to beautiful Gariwerd Grampians National Park, which is a place of such amazing geological, cultural, and ecological significance,\" Ms Mott said.\n\n\" So it's the perfect location to explore … and create a community hub where we can celebrate our nature together. \"\n\nThe gallery opening on July 5 featured an exhibition called End & Being by Jacobus Capone, exploring the concept of climate change through pre-recorded performance art created on the glaciers of Mont Blanc in France.\n\nPippa Mott showing part of Jacobus Capone's End & Being exhibition at the gallery. (ABC Wimmera: Tamara Clark)\n\nEnvironmental art movement\n\nMs Mott said the installation was the newest addition to the environmental art movement.\n\n\"[Environmental art is] a really broad genre and it's not a new thing,\" Ms Mott said.\n\n\"It's been really accelerating since the 1960s. Artists have forever responded to the environment and the natural world.\n\n\"But I suppose in the past few decades, they're responding with a little bit more agency, are often informed more by science, and often speaking directly to some of the issues facing the natural world.\"\n\nBiological purpose\n\nBotanical gardens on the site contain 500 native Australian plants including 20 of the 40 plants endemic to the Grampians.\n\nWAMA director Jill Burness said the plants were protected by a feral-proof fence.\n\nJill Burness orchestrated the Grampians Gariwerd endemic botanic gardens. (ABC Wimmera: Tamara Clark)\n\nShe said the plants could be used as a seed bank to revegetate the Grampians after bushfire, and, if the site itself were affected by fire, seeds could be brought in to regenerate it.\n\n\"[The protected endemic plants are] not only here, they're at Halls Gap and they're certainly protected at the Cranbourne botanical gardens,\" Ms Burness said.\n\n\"If a bushfire came through here … we could duplicate these plants again from Cranbourne.\"\n\nPhilanthropy and volunteers\n\nThe art gallery is a privately funded venture.\n\nMs Mott said the board was still fundraising to support future developments.\n\n\"[This is] stage one of the centre and the endemic garden is just the beginning,\" Ms Mott said.\n\n\"We rely on giving or philanthropy alongside grants and sponsorships.\"\n\nTickets to the venue are free for children, and $12–18 for adults.\n\n\"Obviously, we are a ticketed destination,\" Ms Mott said.\n\n\"We have a retail space, we have a cafe, but we are essentially a not-for-profit at the end of the day, and so we hope that what we're doing inspires people.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/five-quick-its-australia-west-indies-day-three/105487564",
        "title": "Five quick hits: Smith cops a nasty blow and rain unsettles Webster",
        "publish_date": "Sat, 05 Jul 2025 22:03:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Steve Smith cops a nasty blow on his injured finger, Cameron Green gets back in the runs, and Beau Webster falls in the rain.\n\nHere are five quick hits from the third day of the second Test in Grenada. Tap here for the full match report and re-live the live blog.\n\n1. Smith's glove comes off\n\nSmith copped a sore one first up on day three. (AP: Ricardo Mazalan)\n\nIn Test match cricket, weaknesses don't go unexploited for long.\n\nStill dealing with the effects of the dislocated finger that kept him out of the first Test, Steve Smith had been noticeably ginger in the outfield for much of day two.\n\nAnd coming to the crease after nightwatchman Nathan Lyon had been dismissed during a rain interrupted day three morning session, the last thing the veteran needed was a hit to the recently relocated digit.\n\nBut that's exactly what he got on his very first delivery, when a nasty one from Alzarri Joseph nipped back and reared up and struck him plumb on the pinky.\n\nSmith was in some serious discomfort as his head went back and glove came off.\n\nThankfully for Australia, the vice-captain was able to battle on.\n\n2. Green's biggest since his best\n\nThe second innings in Grenada marked Cameron Green's highest score in over a year. (AP: Ricardo Mazalan)\n\nCameron Green is on the comeback from back surgery, but even before that he wasn't in glistening form.\n\nLeading into the second innings, Green was averaging just under 27 since the 2023 World Test Championship final. And that average plummeted by 10 if you took out one innings — his career-high 174 not out against New Zealand in Wellington in early 2024.\n\nThat towering knock was his only score over 42 since Australia's tour of India in March 2023, but day three in Grenada changed that.\n\nIn tough conditions, Green showed gritty watchfulness while attacking bad balls to deliver exactly the kind of innings Australia needed.\n\nElevated to number three in the batting order and not bowling as he continues his recovery from back surgery, runs are more important than ever for the 26-year-old West Australian.\n\n3. Green gives it away\n\nGreen fought hard to reach 50 on day three. (AP: Ricardo Mazalan)\n\nAfter 121 painstaking deliveries, Green brought up his drought-breaking half-century with a glorious drive back past Shamar Joseph.\n\nTwo balls later, he was back in the pavilion courtesy of an ugly lapse in concentration.\n\nLooking to manufacture a bit of width to a back of a length Joseph delivery, Green's attempted cut ended up cannoning back into his stumps.\n\nIt was a lazy, loose shot and Green was fully aware of it, throwing his head back and his bat to ground.\n\nUp the other end, Smith was equally disappointed.\n\nOn the way to a milestone of his own, the vice-captain shook his head as Green trudged off.\n\n4. Smith's remarkable Windies record\n\nIn a career defined by statistical superiority, Smith's remarkable record against the West Indies might fly under the radar a touch.\n\nIncluding his efforts this week, Smith has played 10 Tests against the West Indies, scoring almost 1,000 runs as well as three centuries at an eye watering average of over 116.\n\nAnd Smith was typically imperious on day three, especially after passing 50.\n\nHe charged down the track to clobber Justin Greaves back past the medium pacer, deposited captain Roston Chase over the fence for six and manipulated a tiring West Indian field expertly.\n\n5. Webster comes unstuck in the rain\n\nIf the rain had been much heavier the teams likely would have been taken off. (AP: Ricardo Mazalan)\n\nThere were multiple rain delays on day three at Grenada's National Cricket Stadium, but with stumps in sight and showers blowing over, umpires didn't want to take the players off unless it was absolutely necessary.\n\nIt wasn't immediately clear on the television broadcast how much it was raining, but every angle illuminated by the setting Grenadian sun showed a healthy squall.\n\nIt was in these conditions that Beau Webster found himself at the crease after Smith's surprise dismissal.\n\nAfter a couple of attacking strokes, the Slug from Snug nicked off to his sixth delivery, perfectly picking out Roston Chase as the only fielder in the slips.\n\nCricket famously isn't a wet weather sport, so most likely Webster doesn't have much experience in inclement conditions. He certainly looked a little extra perturbed as he trudged off.\n\nThree overs later, a similar downpour was enough to force the teams off.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-06/espresso-coffee-machine-cleaning-home/105482812",
        "title": "The best ways to clean your home coffee machine",
        "publish_date": "Sat, 05 Jul 2025 21:58:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Have you bought an espresso machine to cut down on buying takeaway coffee?\n\nThey can save you money but require a little cleaning and maintenance to keep them running smoothly. Here's what is recommended.\n\nHow often should an espresso machine be cleaned?\n\nMarco Farina says he can taste when a machine hasn't been cleaned recently enough. He sells, repairs and services domestic and commercial coffee machines in Naarm/Melbourne.\n\nMr Farina says a household machine often makes three to four coffees a day. This might not seem like a lot, so people do not tend to clean them often, he says.\n\nBut he recommends giving machines a simple clean every day.\n\n\"The cleaner it is, the better it is for the next coffee.\"\n\nWhat should you include in an everyday clean?\n\nA portafilter is the part of the machine with a handle that holds the filter basket. (Adobe Stock)\n\nConsumer group Choice recommendsemptying and rinsing the portafilter (the part of the espresso machine with the handle) and wiping out the filter basket with a clean cloth after every use.\n\nIf you enjoy coffee with milk, Choice advices purging the steam wand by turning it on and off before and after you steam milk, and wiping it clean after use.\n\nMr Farina says this should be done with a wet cloth every time the machine is used to avoid an off-milk smell developing.\n\nWiping the bench and surrounding areas, plus emptying the drip tray are other tasks you'll want to do after you've finished making coffee for the day.\n\nWhat about a more intensive clean?\n\nLara Timbrell is the head barista and assistant manager of Tribute cafe in Perth, on the traditional lands of the Whadjuk Nyoongar people.\n\nShe says a domestic espresso machine is likely to benefit from a more intensive clean once every week or two, or monthly, depending on how often it is being used.\n\nHelpful definitions: The group head is a permanent metal attachment at the front of the machine that brings hot water out of the machine and into the portafilter's filter basket.\n\nis a permanent metal attachment at the front of the machine that brings hot water out of the machine and into the portafilter's filter basket. The portafilter locks into the group head and holds coffee grounds in a filter basket. It has a plastic or wooden handle attached.\n\nlocks into the group head and holds coffee grounds in a filter basket. It has a plastic or wooden handle attached. The shower screen diffuses water flowing from the group head so it spreads evenly over the coffee grounds in the filter basket. Source: Choice\n\nMs Timbrell says both home and commercial machines tend to have plenty of nooks and crannies.\n\nHer trick is folding a cleaning cloth into quarters or eighths \"so you have a nice firm corner\" that you can use to remove grind build-up, particularly around the group head.\n\nChoice says a weekly clean can include refilling the water tank, and emptying coffee grounds from your knock box.\n\nFor a monthly clean, it recommends removing the filter basket from the portafilter and soaking them both in a cleaning solution and using a toothbrush to clean grounds from around the shower screen.\n\nMs Timbrell recommends dismantling the group head and cleaning behind the shower screen (the fixture that diffuses water from the group head onto the filter basket) for a more intensive clean, which Choice lists as an annual task. It's best to consult the instructions for your specific machine first.\n\nWhat about back-flushing and descaling?\n\nMarco Farina is the founder of Coffee for Marco. (Supplied: Coffee for Marco)\n\nMr Farina recommends back-flushing the machine with a blind filter regularly.\n\nHe says espresso machines should come with a blind filter. It's a solid basket, while the filter baskets used with coffee grind have a series of small holes.\n\nBack-flushing involves placing the blind filter into the portafilter, placing it in the group head and turning on the espresso button, allowing pressure to build before turning it off and repeating a few times.\n\nIt's not something every machine can do so check your model and its instructions.\n\nMr Farina says it helps clean away leftover oil residue from the grind. Coffee supply stores sell cleaning products designed to help with this, he says.\n\nFor semi-automatic and manual machines, Choice says to use the blind filter to flush hot water through about once a week.\n\nFor a monthly clean it advises a \"back-flush (for three-way-valve systems) using a commercial coffee machine cleaner\" or running a cleaning cycle (if the model permits).\n\n\"A good rule of thumb is to do this once for every 4kg of coffee you put through the machine.\"\n\nChoice also recommends descaling the coffee machine as part of an annual clean following the manufacturer's instructions, but some manuals will advise you do this more often.\n\nMs Timbrell says depending on where you live, you can get a lot of build-up through the machine because of the water which will require you to descale.\n\nShe says water also impacts the taste.\n\n\"I would say one thing that you would really taste the difference with your coffee is, if you use filtered water instead of tap water.\"\n\nWhat about the coffee grinder?\n\nMs Timbrell says regardless of whether your coffee grinder is a separate appliance or built into the espresso machine, looking up the manual before cleaning is a good way to get started.\n\n\"When you keep grinding more and more coffee, the [remaining] coffee is getting ground over and over again.\"\n\nShe says this may result in a bitter taste, because some of the grind will be older and finer (more likely to burn).\n\nShe recommends emptying out the grinder and clearing out residual grinds with a dry brush or vacuum.\n\nChoice does not recommend using water to clean out rancid coffee bean oil from your grinder, and warns the blades can be sharp.\n\nIt suggests using a small, clean paintbrush, soft-bristled toothbrush or a vacuum for the \"really committed\".",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/slater-speaks-after-death-of-cameron-munsters-father-20250706-p5mcuv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Slater speaks after death of Cameron Munster's father",
        "publish_date": "Sun, 06 Jul 2025 12:20:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Slater speaks after death of Cameron Munster's father\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/around-the-clubs-nrl-round-19-20250706-p5mcul.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin team rocked by tragic death",
        "publish_date": "Sun, 06 Jul 2025 12:02:22 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Queensland captain Cameron Munster has left Origin camp after the death of his father Steven, but plans to return and lead the Maroons in Wednesday’s decider.\n\nMunster learned of his father’s death overnight in Queensland camp on the Sunshine Coast, with coach Billy Slater confirming the news in a statement on The Sunday Footy Show.\n\nCameron Munster is set to play the Origin decider. Credit: Getty Images\n\n“Unfortunately we woke to the sad news of the passing of Cameron Munster’s father Steven Munster overnight,” Slater said on Sunday morning.\n\n“Cam will exit camp to be with his family before rejoining his team for the game on Wednesday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/home-tech-upgrades-to-splash-your-tax-refund-on-20250702-p5mbw6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Home tech upgrades to splash your tax refund on",
        "publish_date": "Sun, 06 Jul 2025 12:01:00 +1000",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "Where other mixers and my weak kneading skills fail, the Ooni delivers. Ooni Halo Pro Spiral Mixer – $1100 I have mixers at home and have never felt the need to invest in an overly fancy or expensive model. When I heard that a mixer from Ooni — maker of home pizza ovens — had sold out in Australia within six hours, I wasn’t sure what the fuss was about. But after trying it, I see it’s a simple but novel concept; this is a massive professional-style spiral mixer, just shrunk down for your bench. I don’t use many $1000+ mixers, but all the mixers I have used simply will not handle bread or pizza dough. It will get clagged up on the hook, or won’t mix properly, or get too hot, or just literally stop the mixer from turning. But the spiral hook and breaker bar on this machine do a consistently excellent (and hypnotic) job, and since nobody has to knead the dough we’ve been making a lot more yeast bread, sourdough and pizza at home, with great results. The mixer has a dial and a simple display on the top so you can set the speed, and there’s also a timer for both mixing and proving so you don’t have to babysit the machine; it will turn off when the mixing’s done and play a sound when it’s ready. I also like the included splash guard that has a little funnel and a door for adding liquid or ingredients mid-mix.\n\nThe Halo Pro is explicitly designed for dough, but it can work as a more general stand mixer as well. The head tilts up, and you can remove the breaker bar and spiral to insert another attachment for whisking or beating. The new model is the lightest ever Surface Laptop. Surface Laptop 13-inch – $1360+ Microsoft’s latest portable computers are a little smaller than usual, and a little less expensive, so as expected they also have some light compromises. But unlike the often-hard-to-recommend Surface Laptop Go, the new 13-inch Surface Laptop feels intentionally and thoughtfully small. Of course, that’s not to say it’s exactly like full-fat 7th Edition Surface Laptop – its screen is limited to the standard 60Hz, it has a mechanical trackpad rather than a haptic one, and it doesn’t have any high-speed Thunderbolt 4 ports – but the new model carries over the most important elements of its siblings.\n\nThe keyboard feels great, the metal construction is solid and satisfying, there’s a nice bright touchscreen, and you get a clean version of Windows 11 with all the Copilot+ PC AI-powered trimmings. Loading Overall the laptop stands up really well as Microsoft’s answer to Apple’s MacBook Air, and that’s especially true in the battery department. I was able to get through an entire day of work without charging, even with some heavy Photoshop involved, and the device happily went for two days if I was just writing. It’s powered by a Snapdragon X Plus chip, which is plenty fast enough for productivity tasks and packs a powerful AI processor, and it’s generally a joy to work on. I had no issue with any of my work apps, and I even lent it to a less-technical person to work on, and they loved it. But I am compelled to mention that since this is an ARM chip there are apps designed for Intel x86 chips that do not work. So if there’s a less-common program you vitally need, it’s worth checking that there’s an ARM version available, or that it works with Windows’ compatibility layer. It’s becoming difficult to clock the incremental improvements LG makes to the C-series each year, but it’s still one of the best on the market.\n\nLG C5 OLED TV – $2200+ LG’s C4 was my favourite all-rounder TV of last year and, as expected, the C5 is just a little bit better. The C-series has frequently been my go-to recommendation for OLEDs because it hits every high-end feature you need, without any gimmicks or esoteric features that demand a higher price tag. Plus, you don’t lose any features if you go for a smaller size; the 42-inch model has the same processor, the same full-speed HDMI ports, the same 144Hz refresh, the same low-latency gaming mode and the same accuracy-focused film modes as the 83-inch. So what’s new with the C5? It’s brighter, which is great if your loungeroom has a lot of glare from windows during the day, but also makes for more impactful scenes in HDR content. Upscaling of older low-resolution content is also improved, so while you won’t magically get more detail from a 25-year-old DVD, it will be sharp and artefact-free. Otherwise, things haven’t changed too much. You still get a fantastic experience out of the box just by changing to one of the pre-calibrated or filmmaker picture modes, and you won’t find a better screen for watching movies in the C5’s price class. The 55- and 65-inch models are sold for $1000 less than some models that provide a very similar core experience. The C5 is also one of the best on the market for gaming, with support for all kinds of variable refresh rate, and 4K at up to 165Hz through all four HDMI ports.\n\nThere are only two areas where the C5 has arguably taken a step backwards; it has dropped support for passing through DTS sound (which will impact few people since the large majority of movies have Dolby mixes, but it seems a pointless removal), and I don’t like the new smaller remote. The numbers were useful for shortcuts, and there is now no dedicated input button, despite buttons being given to the TV guide, help, and voice search. The Area-51 looks great, runs relatively quietly, uses mostly off-the-shelf parts for upgradability, and easily ran all the new games I tested at their most ridiculous settings. Alienware Area-51 PC Desktop – $5520+ If you’re looking for the most graphically powerful Windows machine you can get, you want it to be built for you, and you don’t mind that it’s several times more expensive than the priciest games console, this is the machine for you.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/smith-whacked-on-dodgy-finger-20250706-p5mcu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smith whacked on dodgy finger",
        "publish_date": "Sun, 06 Jul 2025 11:23:29 +1000",
        "category": "finance",
        "authors": [],
        "text": "Smith whacked on dodgy finger\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/smith-green-pull-aussies-out-of-strife-20250706-p5mcu2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smith, Green pull Aussies out of strife",
        "publish_date": "Sun, 06 Jul 2025 10:39:12 +1000",
        "category": "finance",
        "authors": [],
        "text": "Smith, Green pull Aussies out of strife\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/kenyan-superstar-breaks-her-own-1500m-world-record-20250706-p5mcu0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kenyan superstar breaks her own 1500m world record",
        "publish_date": "Sun, 06 Jul 2025 10:34:08 +1000",
        "category": "sports",
        "authors": [],
        "text": "Kenyan superstar breaks her own 1500m world record\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/young-gun-clinches-astonishing-come-from-behind-win-20250706-p5mctv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young gun clinches astonishing come-from-behind win",
        "publish_date": "Sun, 06 Jul 2025 10:18:57 +1000",
        "category": "finance",
        "authors": [],
        "text": "Young gun clinches astonishing come-from-behind win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/i-didn-t-want-to-leave-tupou-confirms-move-to-paris-20250706-p5mcs6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I didn’t want to leave’: Tupou confirms move to Paris",
        "publish_date": "Sun, 06 Jul 2025 09:40:00 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Wallabies tighthead prop Taniela Tupou confirmed that he played his last game for the Waratahs after the 21-10 loss to the British and Irish Lions in Sydney.\n\nTupou will move to play for Racing 92 next season, the former club of South Africa’s World Cup winning Siya Kolisi and current Lions squad member Owen Farrell.\n\nFarrell was in the crowd at Allianz Stadium and like Kolisi lasted just one season at Racing 92 to return to their homelands early. Tupou is hoping for a longer stay in Paris after joking that he hoped the English playmaker had left some money for him at the club.\n\n“It’s a big move for me, I wasn’t sure, I didn’t want to leave (Australia), that’s the honest truth,” Tupou said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/musk-declares-new-america-party-is-formed-after-trump-s-bill-passes-20250706-p5mct4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Musk declares new America Party ‘is formed’ after Trump’s bill passes",
        "publish_date": "Sun, 06 Jul 2025 09:33:25 +1000",
        "category": "finance",
        "authors": [
            "Sam Kim"
        ],
        "text": "Elon Musk said a new political party he has been threatening to start up “is formed”, a day after US President Donald Trump signed a tax-cut and spending bill that the billionaire Tesla chief executive officer has denounced.\n\nMusk made the announcement on his X social network after posting the results of a poll on the platform that he said showed 65 per cent of respondents in favour of creating an America Party.\n\nElon Musk had previously threatened to launch a political party the day after “this insane spending bill passes”. Credit: Getty Images\n\n“You want a new political party and you shall have it!” he said on Saturday (Sunday AEST). “Today, the America Party is formed to give you back your freedom.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/you-pinch-yourself-wallabies-veteran-set-to-realise-childhood-dream-against-lions-20250704-p5mcnl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You pinch yourself’: Wallabies veteran set to realise childhood dream against Lions",
        "publish_date": "Sun, 06 Jul 2025 09:32:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "He scored the opening try against them on tour, and now, evergreen halfback Nic White is ready to realise a childhood dream by wearing the green and gold against the British and Irish Lions in a Test match.\n\nAt 35, and with 71 Tests under his belt, the veteran has pretty well been there, done that, but one box that remains unticked is representing his country against the Lions, who venture Down Under once every 12 years.\n\nHe missed out in 2013, after suffering a shoulder injury while playing for the Brumbies in Super Rugby, and realises the three-Test campaign that kicks off in Brisbane on November 19 represents his last chance.\n\nHe has already observed the Lions at close quarters, during the tour opener in Perth, when he scored the only try for Western Force in a 54-7 defeat.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/entrepreneurship/celebrities-are-putting-the-a-list-in-capitalist-like-never-before-20250704-p5mcl1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Celebrities are putting the ‘A-list’ in capitalist like never before",
        "publish_date": "Sun, 06 Jul 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "The Economist"
        ],
        "text": "Celebrities are venturing beyond the billboard and the big screen – and into big business. Hailey Bieber, a model married to Justin, recently sold Rhode, her make-up brand, in a deal valued at as much as $US1 billion ($1.5 billion).\n\nSkims, a shapewear label founded by Kim Kardashian, a reality-TV star, makes $US1 billion in annual sales and is expected to list on the stockmarket soon. Rihanna is now a billionaire not directly because of her music, but thanks to Fenty Beauty, her make-up label. Ryan Reynolds, a Hollywood actor, is active in everything from telecoms to online privacy. Surprisingly, many of these superstar businesses have become a source of innovative new consumer products.\n\nHailey Bieber, Rihanna and Ryan Reynolds are among a new cohort of celebrity entrepreneurs proving there’s a new type of star power in town. Credit: Sydney Morning Herald/Chris Fowler\n\nCelebrities have long used their fame to peddle things. Michael Jordan, a basketball player, is thought to have made over $US1.5 billion ($2.3 billion) from his partnership with Nike over the past 40 years. Nespresso has reportedly paid George Clooney more than $US40 million ($61 million) to have his mug selling its coffee. Two decades ago Hulk Hogan, a professional wrestler, helped market the “Hulkster” cheeseburger, pre-cooked and frozen for your convenience.\n\nThe practice continues. This week President Donald Trump launched “Victory 45-47″, a line of fragrances for men and women priced at $US249 ($379), having launched “Fight Fight Fight” ($US199, $303) last year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/demon-advances-daria-drops-out-20250706-p5mctc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Demon advances, Daria drops out",
        "publish_date": "Sun, 06 Jul 2025 09:15:10 +1000",
        "category": "finance",
        "authors": [],
        "text": "Demon advances, Daria drops out\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/meghan-markle-flaunts-sold-out-as-ever-spread-20250706-p5mct0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan Markle flaunts sold-out As Ever spread",
        "publish_date": "Sun, 06 Jul 2025 08:33:42 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan Markle flaunts sold-out As Ever spread\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/pm-anthony-albanese-shares-subtle-message-about-us-relations-20250706-p5mcsu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PM Anthony Albanese shares subtle message about US relations",
        "publish_date": "Sun, 06 Jul 2025 08:13:45 +1000",
        "category": "finance",
        "authors": [],
        "text": "PM Anthony Albanese shares subtle message about US relations\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/smith-and-green-rise-to-the-occasion-as-australia-pile-pressure-on-west-indies-20250706-p5mcse.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smith and Green rise to the occasion as Australia pile pressure on West Indies",
        "publish_date": "Sun, 06 Jul 2025 07:58:54 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "St George’s: It was as if Steve Smith and Cameron Green looked at each other on an overcast third morning of the second Test in Grenada and made a pact that enough was enough.\n\nAustralia’s top order has been the subject of enough scrutiny and ridicule on this West Indies tour that it was time for two players at very different stages of their career to rise to the occasion when it mattered most.\n\nBy stumps on Saturday (Sunday morning AEST) at Grenada’s National Cricket Stadium, Australia had rallied from 2-4 late on day two to 7-221, with a healthy 254-run lead, thanks to potentially match-defining contributions from Green (52) and Smith (71).\n\nTheir hard-fought partnership of 93 runs was the highest they’ve shared in Tests and surpassed their previous best of 81 against Pakistan in Rawalpindi in 2022.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-australia-among-first-countries-to-launch-lung-cancer-screening-program/9z7x715g3",
        "title": "INTERVIEW: Australia among first countries to launch lung cancer screening program",
        "publish_date": "Sat, 5 Jul 2025 22:30:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-1-philipsen-wins-windy-opener-as-evenepoel-trapped-in-split/y54dxtcgo",
        "title": "Tour de France Stage 1: Philipsen wins windy opener as Evenepoel trapped in split",
        "publish_date": "Sat, 5 Jul 2025 21:23:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "There were mixed fortunes for the thousands of Belgian fans who poured over the border for the opening stage of the Tour de France as Jasper Philipsen won, but star rider Remco Evenepoel faltered in his long-range bid for the title itself.\n\n\n\n\n\nPhilipsen took the yellow jersey in a frantic sprint finish at the northern city of Lille, his tenth Tour de France win crowned with a rare race lead for a rider usually chasing sprint points.\n\n\n\n\n\nPhilipsen outsprinted Eritrean Biniam Girmay and Norway's Soren Waerenskjold while Dane Vingegaard and defending champion Tadej Pogacar of Slovenia crossed the line in the leading group.\n\n\n\n\n\nAustralia's Kaden Groves was delighted to play his part in helping his Alpecin-Deceuninck teammate Philipsen grab his third win of the season.\n\n\n\n\n\n\"There were echelons and the race split with about 25km to go,\" Groves said.\n\n\n\n\"That's what we expected actually, and we had numbers in the front [group] who could dictate the race.\"\n\n\n\n\n\nAnd Philipsen added: \"It's really amazing. My 10th victory is something I will never forget.\n\n\n\n\n\n\"The team performance was incredible. I think we were there all day. It was very nervous but we knew today could be our day and we have to be in the front and we were there in the split.\n\n\n\n\n\n\"The team did amazing and in the end we could just use our strength and finish it off.\"\n\n\n\nHow the Stage 1 race unfolded\n\nVingegaard was on red alert as the split started and his explosive acceleration helped stun the peloton and leave his Visma team delighted with the damage done by the day's work with a 40sec advantage over several important rivals.\n\n\n\n\n\n\"It was our plan to use the wind at 20km and it worked,\" said Vingegaard.\n\n\n\n\n\nKnown for his pounces in the mountains, Vingegaard has won the Tour in 2022 and 2023.\n\n\n\n\n\nThe 28-year-old grew up in a remote fishing community, racing into strong winds on the coastal roads in Denmark.\n\n\n\nDefending champion Pogacar appeared flustered at the finish line.\n\n\n\n\n\n\"It was as frantic as we had expected, but when the split came fortunately I was near the front,\" said the 26-year-old Slovenian.\n\n\n\n\n\n\"I'm just happy day one is done. Nine days to go before the first rest day.\"\n\n\n\n\n\nBilled as the third man here after finishing behind Pogacar and Vingegaard on his debut Tour in 2024, star rider Remco Evenepoel was in sombre mood at his team bus.\n\n\n\n\n\n\"We were asleep, we thought any danger was over,\" Evenepoel said of the split where both he and his team's sprinter Tim Merlier found themselves trapped just 20km from the finish.\n\n\n\nBelgian Remco Evenepoel of Soudal Quick-Step pictured at the start of the first stage. Source: AFP / Jasper Jacobs Around 40 riders in the first group contested the sprint where one of the day's many falls happened.\n\n\n\n\n\nPrimoz Roglic and Florian Lipowitz of Red Bull, and Team UAE's Joao Almeida were also caught out in the blustery winds.\n\n\n\n\n\nAnother UAE man, Adam Yates, lost minutes, meaning Pogacar's two deputies are off the pace if something happens to the UAE star man.\n\n\n\n\n\nAfrica's sole rider Biniam Girmay, winner of three stages in 2024, was second on the day as Philipsen got ahead of him with 100m to go.\n\n\n\nEritrean rider Biniam Girmay celebrates on the podium with the best young rider's white jersey after the 1st stage. Source: AFP / Loic Venance But Girmay, winner of the 2024 best sprinter's green jersey, ended the stage with the white jersey for the best 25-and-under rider.\n\n\n\n\n\nFans packed the route in one of France's more modest regions passing First World War memorials, red-brick houses and slagheaps from long-closed coal mines along the Belgian border.\n\n\n\n\n\nUnder overcast skies with the temperature a manageable 22C, the peloton cut a fast pace despite the windy conditions.\n\n\n\nRacing towards an intermediate sprint over cobbles, escapee Benjamin Thomas slid sideways and took out his sole rival Matteo Vercher in one spectacular fall and the pair were still bickering when the peloton shot past them.\n\n\n\n\n\nFormer time-trial world champion Filippo Ganna was one rider who will take no further part after a clumsy fall on a corner.\n\n\n\n\n\nThe Italian would have been a contender on the lengthy stage five individual time-trial, as well as key in the Ineos team's campaign to get veteran Geraint Thomas into the top 10 on his 14th and final Tour de France.\n\n\n\n\n\nPhilipsen, in yellow, will lead the peloton out for Sunday's second stage, a hilly 209km route to the beaches of Boulogne-sur-Mer.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/12-year-olds-first-sale-sparks-international-art-career/h249vv3o0",
        "title": "12-year-old's first sale sparks international art career",
        "publish_date": "Sat, 5 Jul 2025 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSinging an ancient story passed from generation to generation.\n\n\n\n\n\nArtist Juanella Donovan and her daughters are joining the older women to dance the story of the seven sisters, feet in the pink desert sand outside Port Augusta.\n\n\n\n\n\n“I started singing along with the ladies, and I could hear my babies singing along with the ladies and I had to stop myself from crying. You know, those are the memories that I have of my childhood, the same sand dunes, that same dances and some of the elders aren’t here anymore, but those are the beautiful memories that we cherish.”\n\n\n\n\n\nBringing together her community to practice culture on country is what inspires Juanella Donovan.\n\n\n\n\n\nHer own childhood memories are steeped in the art and culture of her mob.\n\n\n\n\n\n\"I feel like that has really helped me build a strong cultural foundation and also cementing my identity as a proud Aboriginal person and my community and then helping me share that with others.”\n\n\n\n\n\nMs Donovan's latest work - in progress under a national regional arts fellowship – is a sculptural installation called 'Mother.'\n\n\n\n\n\nWoven from emu feathers and raffia, Mother is the root ancestor connecting the past present and future.\n\n\n\n\n\nHer maker - a mother of four herself - is also a director of a new art collective.\n\n\n\n\n\nPort Augusta Aboriginal Arts Mob arts mob - or PAAM - is part of the APY Art Collective, an Aboriginal owned network of art centres in communities across South Australia's remote north west.\n\n\n\n\n\nThe artists' inaugural exhibition recently showed in Adelaide, but as Ms Donovan explains, it’s not all about hanging work in galleries.\n\n\n\n\n\n“Art centres change lives, it helps our people to make an income that's respectful of themselves, and their culture and you know we have that here in Port Augusta. From award winning artists to people doing their first canvas, we’re all together, we are all helping each other and that's really, really special.\"\n\n\n\n\n\nMs Donovan says Port Augusta has not had a centre like this since she was a child.\n\n\n\n\n\nAnd she’s hoping it will bridge what she sees as a break down in connection between young people and elders.\n\n\n\n\n\n\"And helping the youth to get back on track and the fellas to get back together and remember what's important and that's preserving our culture and moving forward in a positive and productive way and I feel like PAAM is helping to make our community strong again. I think the hidden beauty of these art centres is the conversations that we as women are having over the table with the youth, with our children with out babies in our arms while we are making.\"\n\n\n\n\n\nShe says PAAM supports many artists from more remote areas who need to stay in Port Augusta to access services.\n\n\n\n\n\n“There's many artists that have disabilities or medical reason why they need to live in Port Augusta and away from country and to have that access to supported culture in a culturally safe place that's what PAAM provides to them and I think that's very important.”\n\n\n\n\n\nMs Donovan's mother Artist Regina McKenzie is also a strong advocate.\n\n\n\n\n\n\"The more we teach our children about who and where we come from and that's our culture, the better and the continuance is something I believe we should keep practising.”\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-music-icon-and-croc-hunter-who-was-a-driving-force-for-naidoc-week/zc2x99wpa",
        "title": "The music icon and croc hunter who was a driving force for NAIDOC Week",
        "publish_date": "Sat, 5 Jul 2025 20:29:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Ted Egan isn't just a songwriter with an extensive and well-known catalogue documenting life in the Northern Territory.\n\n\n\n\n\nAs a public servant, he also played a significant role in the formation of the group behind what is today known as NAIDOC (National Aboriginal and Islanders Day Observance Committee) Week.\n\n\n\n\n\nBorn in 1932 in Melbourne, Egan moved to the Top End in 1949 and started working for the NT Department of Aboriginal Affairs.\n\n\n\n\n\nHis work as a patrol officer and reserve superintendent took him out of the city and on to cattle stations and crocodile-hunting expeditions.\n\n\n\n\n\nIn his late 30s, Egan worked as a project officer with the Office of Aboriginal Affairs: a new national agency within the Prime Minister’s Department that had been established following the successful 1967 Referendum, which saw the Commonwealth now having overall responsibility for Aboriginal affairs.\n\n\n\n\n\nIn 1970, a year after Egan wrote the track Gurindji Blues with land rights leader Vincent Lingiari, Egan was sent to Sydney to attend the annual general meeting of the Commonwealth Council of NADOC (National Aborigines' Day Observance Committee).\n\n\n\nThe purpose of the National Aborigines Day Observance Committee was to \"create and promote an informed public opinion on the status and needs of the Aborigines\". The committee had been set up back in 1957, two years after the National Missionary Council of Australia (NMCA) had asked the federal government to establish a National Aborigines Day.\n\n\n\n\n\nWhile denying the request for a National Day, the federal government supported a National Aborigines Day via funding for publications, leaflets and stickers as a way of \"creating and promoting an informed public opinion on the status and the needs of the Aborigines … as to what is being done, and what remains to be done\".\n\n\n\n\n\nIn 1969, the NADOC Federal Executive was made up of Rev Frank Engel (chairman), Rev Robert Denham (secretary), Rev Richard Udy (treasurer) and committee members: Rev Robert Brown (SA), Rev James Sweet (Qld), Rev G Night (NSW), Mr Ken Colbung, Mrs S Dunn (NSW), Rev E Newman (NSW) and Pastor Schultz (NSW).\n\n\n\nA turning point\n\nIn the overall historical context of National Aborigines Day or NAIDOC Week, the February 1970 meeting of the National Executive was a turning point.\n\n\n\n\n\nAt the meeting, there was a move to elect an Aboriginal man — Ken Colbung from WA — as the new National Chairman. Colbung was the Secretary for NSW NADOC which had large staunch Aboriginal membership including Kaye Mundine, Clive and Tom Williams, Charles 'Chicka' Dixon, Lyall Munro, Bert Groves and Reverend Frank Roberts.\n\n\n\n\n\nIt would be the first time an Aboriginal person would be at the helm of the National Committee; Lester Bostock was also elected a joint treasurer.\n\n\n\n\n\nOn returning to Darwin, Egan typed up a report to his supervisor — Frank H Moy, assistant director (research) at the Office of Aboriginal Affairs — about the meeting.\n\n\n\n\n\n\"The members of the outgoing committee seemed anxious to replace some of the church officials on the Executive with Aboriginals and this is an encouraging sign,\" he wrote.\n\n\n\nEgan recommended that NADOC should be a national committee made up entirely of Indigenous representatives. Moy endorsed his observation about the lack of Aboriginal people on the National Executive.\n\n\n\n\n\n\"We have been lecturing them on this for two years now,\" Moy scrawled in pen over this section of Egan's report.\n\n\n\n\n\nIn his report, Egan went further, writing that the NADOC should be a national committee made up entirely of Indigenous representatives.\n\n\n\n\n\n\"It seems to me that if this is to become a national body, NADOC should appoint a representative (preferably an Aboriginal) in each state,\" Egan wrote.\n\n\n\n\n\n\"Mr Phillip Roberts would be an ideal choice for the Northern Territory and perhaps one of our liaison officers for the ACT. Could it be suggested to NADOC that an Aboriginal be appointed in each State, NT and ACT?\"\n\n\n\nFrom National Aborigines Day to NAIDOC Week\n\nLater that year, in September 1970, the annual general meeting of the National Council of NADOC saw Indigenous representatives from across the nation attend.\n\n\n\n\n\nThese included: Dick Roughsy (Mornington Island Qld) G Winnunguj (Goulburn Island NT), Tom Williams (Foundation Aboriginal Affairs NSW), George Abudullah (WA), Lyall Munro (Moree Advancement Committee), Kath Walker (National Tribal Council), and Dulcie Flower and Faith Bandler (Federal Council for the Advancement of Aborigines and Torres Strait Islanders - FCAATSI).\n\n\n\n\n\nEgan also used his report to cheekily comment on the lack of interest in the NT about the national celebrations.\n\n\n\n\n\n\"I know at present in the Northern Territory little is done towards the observance of National Aborigines Day because it is considered to be a day on which a few 'compensation neurotics' do a bit of stirring in Sydney,\" he wrote.\n\n\n\nLISTEN TO The Next Generation celebrated by First Nations Australians during NAIDOC Week 2025 SBS News 04/07/2025 05:58 English\n\nEgan's attendance at the meeting occurred in an era of growing calls to make National Aborigines Day a proper national day.\n\n\n\n\n\n\"It seems to me that there should be a move to make it a national day in its true sense,\" Egan summarised in his report.\n\n\n\n\n\n\"I think that our role should be to make the thing financially secure as far as publications etc are concerned and thereby make it an attractive enough proposition for Aborigines to take over 'their day',\" he concluded.\n\n\n\n\n\nKen Colbung would again sit as National Chairman in 1971 with Pastor Frank Roberts, Kath Walker and Dulcie Flower joining him on the National Executive.\n\n\n\nREAD MORE Women and children were at the heart of the protest that birthed NAIDOC\n\nIn 1972, control of NADOC was given to the newly established Commonwealth Department of Aboriginal Affairs, and in 1974, the Committee had full Aboriginal representation for the first time.\n\n\n\n\n\nIn 1975, National Aborigines Day became NAIDOC Week.\n\n\n\n\n\nBy this point, Egan had already released several albums and begun to establish his reputation as a musical chronicler of outback life.\n\n\n\n\n\nHe would go on to be a member of the first National Council for Aboriginal Reconciliation and serve as administrator of the Northern Territory from 2003 to 2007.\n\n\n\n\n\nNAIDOC Week will be marked 6-13 July.\n\n\n\n\n\nThe Point airs Tuesdays 7.30pm on NITV, and is available after the broadcast on SBS On Demand .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-says-tiktok-sale-is-pretty-much-finalised/4nmx8idj1",
        "title": "Donald Trump says TikTok sale is 'pretty much' finalised, only needing China’s sign off",
        "publish_date": "Sat, 5 Jul 2025 07:58:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "President Donald Trump says the United States \"pretty much\" has a deal on the sale of popular short-video app TikTok.\n\n\n\n\n\nTrump told reporters on Saturday (AEST) that he would start talking to Chinese President Xi Jinping \"or one of his representatives\" early next week.\n\n\n\n\n\nWhen asked how confident he was that China would agree to the deal, he said: \"I'm not confident, but I think so.\"\n\n\n\n\n\n\"I think the deal is good for China, and it's good for us\" Trump said. \"And for us, it's money ... we make a lot of money if the deal goes through.\"\n\n\n\n\n\nThe TikTok saga started after bipartisan legislation to ban the app on national security grounds unless it was sold to American buyers was signed early last year under the Biden administration.\n\n\n\n\n\nIt was scheduled to take effect the day before Trump's inauguration in January. But since then, the US President has extended the deadline for a sale three times , giving ByteDance time to spin off TikTok's US operations into a new firm that is majority-owned and operated by US citizens.\n\n\n\nWhat do we know about the potenial buyers?\n\nByteDance has previously confirmed talks with the US government, saying key matters needed to be resolved and that any deal would be \"subject to approval under Chinese law\".\n\n\n\n\n\nFor the deal to comply with US law, ByteDance cannot own more than 20 per cent of TikTok.\n\n\n\n\n\nLate last month, Trump told Fox News a buyer had been found and could be disclosed in about two weeks.\n\n\n\n\n\nHe didn't name the potential buyers, but said they are \"very wealthy people\".\n\n\n\n\n\nIn May, Trump also mentioned that a group of buyers was prepared to pay \"a lot of money\" for TikTok.\n\n\n\n\n\nThe previous month he said China would have agreed to a deal on the sale of TikTok if it were not for a dispute over Trump's tariffs on Beijing .\n\n\n\n\n\nSeveral US media outlets reported earlier this year that TikTok's US technology partner, Oracle, could take over in a deal that would potentially include the app's American investors.\n\n\n\n\n\nAnd there have also been reports that a group called The People’s Bid for TikTok might also be a potential buyer. The group is owned by billionaire Frank McCourt, who is known as the former owner of the Los Angeles Dodgers baseball team.\n\n\n\n\n\nWith reporting by the Reuters and Agence France-Presse news agencies.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/texas-floods-at-least-43-people-dead-dozens-of-children-remain-missing/88lr9mkon",
        "title": "Texas floods: At least 43 people dead; dozens of children remain missing",
        "publish_date": "Sat, 5 Jul 2025 04:54:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Some 43 people, including 15 children, have been confirmed dead following flash floods in central Texas, authorities said as rescuers continued a frantic search for campers, vacationers and residents who were still missing.\n\n\n\n\n\nMore than 850 people had been rescued, including some who were clinging to trees, after a sudden storm dumped up to 38cm of rain in an area around the Guadalupe River, about 140km northwest of San Antonio.\n\n\n\n\n\nAmong the missing were 27 girls from the Camp Mystic summer camp, Kerrville city manager Dalton Rice said at a press conference on Saturday evening, and there may be others beyond that.\n\n\n\n\n\n\"We are kind of looking at this in two ways called the known missing, which is the 27 ... We will not put a number on the other side because we just don't know,\" Rice said.\n\n\n\n\n\nThe disaster unfolded rapidly on Friday morning as heavier-than-forecast rain drove river waters rapidly to as high as 29 feet.\n\n\n\nOnlookers survey damage along the Guadalupe River after a flash flood swept through the area. Source: AAP / Eric Gay/AP \"We know that the rivers rise, but nobody saw this coming,\" said Kerr County judge Rob Kelly, the top local official in the region.\n\n\n\n\n\nKerr County sheriff Larry Leitha said eight of the confirmed dead, including three children, had yet to be identified.\n\n\n\n\n\nTexas lieutenant governor Dan Patrick said an unknown number of visitors had come to the area for an Independence Day celebration by the river.\n\n\n\n\n\n“We don't know how many people were in tents on the side, in small trailers by the side, in rented homes by the side,\" he said on Fox News Live.\n\n\n\n\n\nCamp Mystic had 700 girls in residence at the time of the flood, according to Patrick. Another girls' camp, Heart O' the Hills, said on its website that co-owner Jane Ragsdale had died in the flood but no campers had been present as it was between sessions.\n\n\n\nThe Camp Mystic Christian summer campsite was completely destroyed. Source: AP / Julio Cortez Videos posted online showed bare concrete platforms where homes used to stand and piles of rubble along the banks of the river. Rescuers plucked residents from rooftops and trees, sometimes forming human chains to fetch people from the floodwater, local media reported.\n\n\n\n\n\nLocal officials said the extreme flooding struck before dawn on Saturday (AEST) with little or no warning, precluding authorities from issuing advance evacuation orders as the Guadalupe River swiftly rose above major flood stage in less than two hours.\n\n\n\n\n\nUS homeland security secretary Kristi Noem said a \"moderate\" flood watch issued the previous day by the National Weather Service did not accurately predict the extreme rainfall and said the Trump administration was working to upgrade the system.\n\n\n\n\n\nThe administration has cut thousands of jobs from the National Weather Service's parent agency, the National Oceanic and Atmospheric Administration, leaving many weather offices understaffed, said former NOAA director Rick Spinrad.\n\n\n\n\n\nHe said he did not know if those staff cuts factored into the lack of advance warning for the extreme Texas flooding, but said they would inevitably degrade the agency's ability to deliver accurate and timely forecasts.\n\n\n\n\n\n\"People's ability to prepare for these storms will be compromised. It undoubtedly means that additional lives will be lost and probably more property damage,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/dont-look-back-in-anger-fans-rejoice-as-oasis-plays-first-show-in-16-years/s9u7ajeea",
        "title": "Don't look back in Anger: Fans rejoice as Oasis plays first show in 16 years",
        "publish_date": "Sat, 5 Jul 2025 04:20:07 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nBold, brash, and unapologetic, Noel and Liam Gallagher are back on stage for what some say is the most highly anticipated reunion tour of the century.\n\n\n\n\n\nThe British brothers from Manchester are once again fronting Oasis, the band responsible for major hits 'Wonderwall' and Don't Look Back in Anger' and ranked among the best selling groups of all time.\n\n\n\n\n\nTheir reunion comes sixteen years after Noel left the group, saying he could no longer work with his brother Liam.\n\n\n\n\n\nNow, with the hatchet seemingly buried, the pair are performing their first comeback show at Cardiff's Principality Stadium.\n\n\n\n\n\nForming in 1991, Oasis emerged as the face of a new cultural moment in the UK.\n\n\n\n\n\nThe moment was marked by the election of Tony Blair, the rise of UK artists like Damien Hirst, and UK models Kate Moss and Naomi Campbell ruling the fashion runways.\n\n\n\n\n\nWith an unpolished and at times insolent charisma, the Gallagher brothers captured the mood of a generation.\n\n\n\n\n\nRolling Stone UK reporter Nick Reilly says their success was, in part, fueled by what they represented.\n\n\n\n\n\n\"I think the 90s generally was a period of optimism. You kind of speak of Cool Britannia and the fact that Noel was so closely aligned to Tony Blair. And I think, you know, that there was a sense of optimism in the air and Oasis were a massive part of that. So I think that that optimism and that kind of joy that they offered in their music was part of it, but also the swagger, the kind of old rock and roll spirit like you mentioned the 60s. I think in many ways this was the first time we'd seen a band since perhaps like The Stones or The Who that had that sense of swagger in British music and that sense of like unrepentant rock and roll lifestyle.\"\n\n\n\n\n\nThe band's story was always volatile, marked by repeated clashes between the brothers even before their split in 2009.\n\n\n\n\n\nThe first public clash was in 1994, when a gig in Los Angeles turned ugly after Liam flung insults at the band and chucked a tambourine at his brother.\n\n\n\n\n\nIn 1995, an interview with the brothers found its way onto a vinyl entitled Wibbling Rivalry, cementing the brothers explosive reputation in the public mind.\n\n\n\n\n\nNoel: Not at all. Not at all. Not at all. What I'm saying is, what I'm saying is you think...\"\n\n\n\n\n\nLiam: \"You get into situations...\"\n\n\n\n\n\nNoel: \"No...you think it's rock'n'roll to get thrown off a ferry, and it's not.\"\n\n\n\n\n\nLiam: \"I don't think it's rock'n' roll.\n\n\n\n\n\nNoel: You f**king...that was your quote, you prick!\"\n\n\n\n\n\nLiam: \"No it weren't\"\n\n\n\n\n\nThere were numerous public clashes between the brothers in the nineties and early 2000's.\n\n\n\n\n\nThen, in 2009, after a show in Paris ended in a backstage fight, the group announced their split.\n\n\n\n\n\nNick Reilly says after so much animosity between them, many fans never thought a reunion was possible.\n\n\n\n\n\n\"And there's so many people that are in their 40s and 50s now that will remember that as one of the key milestones of their early years. So now, if we're speaking 16 years after they split up and suddenly the fans are given a chance to relive that one more time and have this band back together, when many thought it would be impossible given how acrimonious that split was in 2009. It's natural that there will be like a clamour of those fans who will want to see them again. But also I think that there's a certain timelessness with Oasis.\"\n\n\n\n\n\nBut even in 2011, Noel Gallagher told reporters he had regrets about how things went down that night in Paris.\n\n\n\n\n\n\"I regret it really because we only had two gigs left. If I had my time again, I would've gone back and done the gigs. That gig would have been dreadful because he was out of his mind. I would have done that gig and done the next gig and we'd have all gone away and we could've probably discussed it, what we were going to do. We may never have split up, we may just have just taken a hiatus and we could have all gone and done our other thing. Liam always said he would bring down Armageddon in the end. That's the way he kind of likes things to be, you know.\"\n\n\n\n\n\nOver the next few years, the brothers both launched solo careers, but Liam was adamant he would never return to Oasis.\n\n\n\n\n\nThen in 2018, through a series of tweets, Liam changed his tune - finally raising the possibility of a reunion.\n\n\n\n\n\nHe told reporters in 2019 that he was serious about the idea.\n\n\n\n\n\n\"The most important thing is about me and him being brothers. I've got another brother who he doesn't speak to. It would be nice if all three of us would be together. Obviously, our mum is still alive, so she gets upset by it. But he thinks I'm desperate to get the band back together for money. But I didn't join the band to make money. I joined the band to have fun and get off my head and go and see the world. I'd do it for nothing if everyone else is doing it for nothing.\"\n\n\n\n\n\nWhen Oasis officially announced a reunion tour in August last year many were in disbelief.\n\n\n\n\n\nLuke Mounteney was around nine years old when the band split, he says he was certain he'd never get this chance.\n\n\n\n\n\n‘’No, I thought. No, I don't think anyone of us really truly thought it would ever happen. I'd sort of committed that my life, I would never get to see Oasis because I haven’t seen before. So when it came about that it was a real thing, I don't think my heart rate dropped for a good while until I got tickets. And I remember I sat just crying with pure, genuine joy that I'd got a ticket and it was just an unbelievable moment for life, yeah.’’\n\n\n\n\n\nWhile fans had been pleading for the group to reunite for years, website issues and controversial dynamic pricing brought outrage, with many failing to secure a spot.\n\n\n\n\n\nWhile tickets were initially shown at one price, around $300, once fans reached the front of the digital queue, many found that basic tickets were rebranded as 'in demand' and double the price.\n\n\n\n\n\nFor some fans though, no price was too high.\n\n\n\n\n\n''Kind of what I expected it to be honest you know, it's their reunion they haven't been together for literally decades at this point. So I'd be willing to pay anything to, you know, see the reunion, especially first night as well. It's incredible.''\n\n\n\n\n\nFollowing Cardiff, Oasis will tour the UK throughout July, August and September.\n\n\n\n\n\nThe group will then head to Japan, South Korea, South America, Australia and North America.\n\n\n\n\n\nFor 48-year-old Matt Hobman, this tour is not just about the music.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-actor-julian-mcmahon-has-died-aged-56/qy1pz45xa",
        "title": "Australian actor Julian McMahon has died, aged 56",
        "publish_date": "Fri, 4 Jul 2025 23:55:01 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Australian actor Julian McMahon has died at the age of 56, after a private battle with cancer.\n\n\n\n\n\nMcMahon's wife Kelly confirmed his death in a statement to US entertainment outlet Deadline.\n\n\n\n\n\n\"With an open heart, I wish to share with the world that my beloved husband, Julian McMahon, died peacefully this week after a valiant effort to overcome cancer,\" she said.\n\n\n\n\n\n\"Julian loved life. He loved his family. He loved his friends. He loved his work, and he loved his fans. His deepest wish was to bring joy into as many lives as possible.\n\n\n\n\n\n\"We ask for support during this time to allow our family to grieve in privacy. And we wish for all of those to whom Julian brought joy, to continue to find joy in life. We are grateful for the memories.”\n\n\n\nAmong the Australian actor's best known roles was in the television series FBI: Most Wanted. Source: Getty / CBS Photo Archive Locally, McMahon was known for playing Ben Lucini in the television soap opera Home and Away.\n\n\n\n\n\nHe also starred in the US series Charmed and Profiler and was nominated for a Golden Globe for best actor in a small screen series for his work on Nip/Tuck.\n\n\n\n\n\nMcMahon appeared opposite Kylie Minogue and Guy Pearce in the 2018 Australian comedy movie Swinging Safari.\n\n\n\n\n\nHis most recent work included mystery miniseries The Residence, which screened on Netflix earlier this year, and Stan Original series The Surfer, co-starring Nicolas Cage, released in May.\n\n\n\nJulian McMahon (left) pictured with The Surfer co-stars Nicolas Cage and Justin Rosniak in 2024. Source: Getty / Daniele Venturelli/WireImage McMahon was the son of Sir William \"Billy\" McMahon, a Liberal, who became Australia's 20th prime minister in 1971.\n\n\n\n\n\nHis mother, Lady Sonia McMahon, was an heiress, socialite and fashion icon.\n\n\n\n\n\nMcMahon was married briefly to singer and actor Dannii Minogue in the 1990s after they met on the set of Home and Away.\n\n\n\n\n\nHe married Baywatch star Brooke Burns in 1999, with the couple welcoming daughter Madison in 2000 before separating in 2001.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/us-big-bill-scrapes-through-its-going-to-be-a-tsunami-of-need/8zxf0favq",
        "title": "US Big Bill scrapes through: 'It's going to be a tsunami of need'",
        "publish_date": "Fri, 4 Jul 2025 22:46:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/inside-the-growing-cohort-of-queensland-parents-who-never-planned-to-homeschool/1amyaasob",
        "title": "Inside the growing cohort of Queensland parents who never planned to homeschool",
        "publish_date": "Fri, 4 Jul 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA former primary school teacher, Clarissa Valentine never planned to home-school her twin 12 year old boys.\n\n\n\n\n\n\"Over Covid, a lot of things that were habitual and just part of life changed because we were locked down, and there were a lot of things that I then had never questioned that I started to question. And I am a primary school teacher, I love rules and boxes, and you do this and that. And then everything was kind of stripped back.\"\n\n\n\n\n\nBut Melbourne's lockdowns and vaccine mandates during the height of the COVID pandemic, prompted a lifestyle change, and a move to the Sunshine Coast.\n\n\n\n\n\n\"And I think moving here, starting again, with that mindset, I thought okay now's the time to, let's create an intentional life, and these are the things I'm going to put in that life. Nothing is perfect, and the education system is not perfect, but I think taking yourself out of it allows you to step back a little bit. Doing that caused me to see it wasn't ideal and I could do it differently.\"\n\n\n\n\n\nClarissa is among thousands of families across the country who transitioned to homeschooling from the onset of the pandemic - some 45,000 children registered for homeschooling in Australia.\n\n\n\n\n\nBut Queensland in particular saw the highest spike in numbers, a trend that has continued years after the pandemic lockdowns.\n\n\n\n\n\nQueensland's Department of Education reports a 163% increase in homeschooling from 2020 to 2024, bringing the most recently updated number of homeschooling students in Queensland to more than 11,000.\n\n\n\n\n\nDr Rebecca English, Senior lecturer in Education at Queensland's University of Technology, says the reasons for Queensland's dramatic uptick are unclear.\n\n\n\n\n\n\"I'm not really sure why it's Queensland, but Queensland has a long history of quite a fractious relationship with state schooling. And that data seemed to suggest the same things we keep seeing in research that parents feel that the school is not the appropriate environment for that young person. I think when you look at the Brisbane area and the Sunshine Coast area and you look at other elements of maybe not going along with mainstream higher rates of non vaccination in around Brisbane and the Sunshine Coast. So maybe it's correlated with that.\"\n\n\n\n\n\nBut many parents, like Sunshine Coast-based Clarissa, say parents are encouraged to make the switch thanks to a vibrant homeschooling community.\n\n\n\n\n\n\"I think that once the community starts to grow a little, then other people get more confidence to join that community. If you were at home homeschooling and you didn't really know anyone, it can be really isolating. And I think that would be really hard for the parent and for the children. But if you've got other groups of people that are homeschooling, there are park, there are so many things on the Sunshine Coast in particular that you could participate in that you could be busy all day every day. And I think that brings confidence.\"\n\n\n\n\n\nSomething parents find helpful, when the choice to homeschool is typically unplanned.\n\n\n\n\n\nDr English says around 85% of homeschooling students are school refusers, or those who found mainstream schooling didn't work for their child - while the other 15% are ideologically opposed.\n\n\n\n\n\n\"So often there is a strong correlation between the choice of homeschooling and school can't or school refusal in Australia... and I think that's something we really need to look at, how can we better meet the needs of particularly neurodiverse children in our classrooms.\"\n\n\n\n\n\nAfter a year of trying mainstream schooling, Sunshine Coast residents Danika and Joel resorted to homeschooling their eight-year-old son Ben two years ago, after his school refusal and anxiety reached a tipping point.\n\n\n\n\n\n\"He was four, turning five the year that he started prep. And for him to come home in tears saying school's not for me, just him being able to communicate and articulate, that was quite overwhelming for us as parents. We thought what's happening in the school grounds that's making him feel this way? But there was no particular incidents. He just didn't feel safe and secure mentally. And he was just this little 5 year old boy whose heart had been broken, spark had been put out... and it was not the school's fault, it was just the sheer volume of everything on such a little human being.\"\n\n\n\n\n\nIn Queensland, parents who home-school do not have to adhere to the Australian curriculum.\n\n\n\nThe previous state government had sought to enforce it, sparking a campaign against the move.\n\n\n\n\n\nThe Free2Homeschool campaign gathered more than 21,000 signatures and more than 2000 submissions opposing the former Queensland government's attempts to enforce the Australian curriculum on home-schoolers.\n\n\n\n\n\nBrisbane-based Patricia Fitzgerald is Campaign Manager.\n\n\n\n\n\n\"The freedom that we have now is a lot of why we choose homeschooling. So if we're going to take that away, our children may as well be in school. We put up a campaign to make sure that the government heard what we needed and understood us. So a lot of it was around educating them so that we could show that that level of restriction on us was not going to help educate our children.\"\n\n\n\n\n\nThe current Queensland government tabled new legislation in March 2025, still under review, which removed all the homeschooling reforms opposed to by stakeholders.\n\n\n\n\n\nQueensland's Education Minister John-Paul Langbroek told SBS it's a parent's right to choose the type of education that suits their family, but safety must always be a priority - adding the government are working to implement all accepted recommendations of an independent review into home schooling.\n\n\n\nA separate 2024 review by the Queensland Family and Child Commission also called for better information-sharing between government departments to ensure child safety.\n\n\n\n\n\nIn a random sample of 500 home schooled students, it found 35 children were considered to be living in a high risk home environment between August 2021 and August 2023.\n\n\n\n\n\nCommissioner Luke Twyford says there needs to be greater visibility of children registered in the home education system.\n\n\n\n\n\n\"So our review was very careful to try and not suggest that it is homeschooling parents that are at risk. That's absolutely not the case. What we are mostly concerned about is that the registration system in homeschooling isn't always picking up risk factors that other government departments are identifying.\"\n\n\n\n\n\nExperts stressing the needs of the child must always come first.\n\n\n\n\n\n\"And we need to be responsive to that young person as well. So if they say, mum, dad, I really want to go back to school, or I really want to try school, then maybe we need to really look at the reasons for that young person saying they'd like to go to school.\"\n\n\n\n\n\nWhile still acknowledging the importance of alternative learning, for children like Ben.\n\n\n\n\n\n\"Like normal school, I made it up to grade one and it was a bit hard for me. Some of the questions were a bit hard for me, but with homeschooling you get to solve so many things at your own pace. I am able to solve some pretty complex math questions now and I took my time.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/meet-the-indigenous-chef-stirring-change-in-australias-80-million-native-food-industry/xkqa6vyfz",
        "title": "Meet the Indigenous chef stirring change in Australia’s $80 million native food industry",
        "publish_date": "Fri, 4 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nStanding at a small outdoor grill in Brisbane, Koori chef Chris Jordan is showing a group of trainees how to smoke sea mullet. It’s all part of his broader purpose\n\n\n\n\n\n“Really important to pass down this knowledge to a younger generation, especially working in the food industry as there isn't much of a representation of First Nations chefs using First Nations food.”\n\n\n\n\n\nWatching on, 19-year-old apprentice Kaylee Rose Tsoumbris Davies\n\n\n\n\n\n‘It makes me feel connected. It is just a really nice feeling to get to know something that I didn't know my whole life growing up, that was a big struggle for me.”\n\n\n\n\n\nFor Mr Jordan, passing on knowledge is very personal. Growing up in Northern NSW, he learned little about his Aboriginal heritage or his connections to Kamilaroi country.\n\n\n\n\n\n“Speaking to my grandmother, they were told if anyone asks ‘tell someone that you're Italian’. And there was a lot of shame in the family. It is amazing in my lifetime to see that shift and my family, my extended family, um be proud of who they are.”\n\n\n\n\n\nFamily means a lot to Mr Jordan, who named his catering business in memory of his father Joseph … a refugee from former-Yugoslavia, who died when he was a baby.\n\n\n\n\n\n“I don't have any memories of him at all. And that's part of the reason why I named my business Three Little Birds was his favourite song by Bob Marley as a message of positivity in our family.”\n\n\n\n\n\nAfter a stint in London, Mr Jordan returned to Australia in 2017, determined to learn about his heritage. And he found an Aboriginal mentor who changed his life forever.\n\n\n\n\n\n“The biggest part for me getting sober was meeting Auntie Dale. She has been in the bush food industry for 35 years now. She's an amazing chef, an amazing educator.”\n\n\n\n\n\nBorn at Dirranbandi (Deer-an-bandy) in south-west Queensland Aunty Dale Chapman is well known for cooking with native foods. She is pleased to have supported Mr Jordan’s progress.\n\n\n\n\n\n“I'm extremely proud! He's taken Australian native ingredients to another level, and being able to share it with the young people is so important because they are ultimately our future.”\n\n\n\n\n\nFor Mr Jordan, securing the future also means sourcing sustainable bush foods and supporting Indigenous growers. Australia’s bush food industry is valued at more than 80 million dollars annually, according to Sydney University research. Yet few of the profits go back to Indigenous growers.\n\n\n\n\n\n“Less than 3% of the Bush food industry is Aboriginal and Torres Strait Islander owned, and I think that really needs to shift. Making sure that the money goes back to community and we've collaborated with a lot of different restaurants and cafes.”\n\n\n\n\n\nOne supplier is the Food Connect Shed in Brisbane -a community-owned hub focusing on sustainable food systems. Its CEO is Robert Pekin ( PRON Peekin).\n\n\n\n\n\n“it's owned by 540 odd people. Most of them are locals. One of our big long-term objectives is we need to get First Nations food into our diets in a mainstream way.”\n\n\n\n\n\nTeaching respect for native ingredients and their traditional uses is also a growing focus at universities across the country. Dr Frances Wyld teaches Aboriginal Studies at the University of South Australia.\n\n\n\n\n\n“They are the foods that have sustained Aboriginal people for 60,000 years. They also require less care, such as more water, more pesticides, because they belong here, they grow here.”\n\n\n\n\n\nIt’s information that Mr Jordan shares in school classrooms and at cooking workshops in juvenile detention. He also supports young people who’ve had contact with the justice system.\n\n\n\n\n\n“A huge percentage of our First Nations youth are incarcerated. It’s really important to have that connection to culture and have the opportunity for employment. For me personally, leaving home at a young age and going down a path where I ended up having to get sober and really clean my life up, introducing native ingredients really helped me. Yeah it’s really, really powerful.”\n\n\n\n\n\nWhether showcasing bush foods to the public or teaching young trainees, for Mr Jordan it’s about inspiring change beyond the plate.\n\n\n\n\n\n“So, passing it down through food and sharing my experience and how it saved my life, I think it's a really strong message.”\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-homeschooling-is-becoming-more-popular-in-australia/s1veh8gt4",
        "title": "'It just didn't feel right': Why this former primary school teacher opted to homeschool her kids",
        "publish_date": "Fri, 4 Jul 2025 20:44:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "As a former primary school teacher, Clarissa Valentine never pictured homeschooling her twin 12-year-old boys. From when they were six years old, they had been enrolled at their local school in a leafy north-eastern suburb of Melbourne.\n\n\n\n\n\nBut in March 2022, following multiple lockdowns as a result of the COVID-19 pandemic, Valentine made the snap decision to move the family interstate to Queensland.\n\n\n\n\n\nHer boys Owen and Miles were nine at the time, and Valentine was craving a sea change.\n\n\n\n\n\nShe set her sights on the Sunshine Coast, with its relaxed, family-friendly lifestyle and pristine beaches — a far cry from Melbourne's rolling lockdowns and vaccine mandates.\n\n\n\n\n\n\"Pausing and stopping, I saw that all those things that maybe I thought were important weren't important, and the most important thing was just our little family unit,\" she tells SBS News.\n\n\n\n\n\nThe twins had been remote learning in Melbourne from grade one for around two years, but Valentine decided then she would homeschool the twins.\n\n\n\nClarissa helps Miles with some schoolwork. Credit: SBS Valentine says she was also motivated by the vaccine mandate imposed in schools.\n\n\n\n\n\n\"I had some family members that worked at the school [on the Sunshine Coast] that I thought I'd put my kids in, and they lost their jobs because they wouldn't get immunised,\" Valentine recalls.\n\n\n\nIt just didn't feel right to then put my kids in that system.\n\nValentine is one of a growing number of parents in Queensland who are opting to homeschool their children — a trend that is outstripping rates in other Australian states and territories.\n\n\n\n\n\nAs daily habits and routines changed during the pandemic, Valentine says she reflected on her family lifestyle and decided the school system \"wasn't ideal\", and that she \"could do it differently\".\n\n\n\n\n\n\"Nothing is perfect and the education system is not perfect, but I think taking yourself out of it allows you to step back a little bit and have a little bit of a look at the reality of what's happening,\" she says.\n\n\n\nGrowing trend towards homeschooling\n\nClarissa is among thousands of Australian parents who homeschooled their children during the peak of the COVID-19 pandemic from 2020, and statistics show some have continued to.\n\n\n\n\n\nThe number of children registered in home education nationally is estimated to be around 92 per cent higher in 2024 compared with 2020.\n\n\n\n\n\nThis data is based on home registration figures from state and territory home education departments, compiled by Vivienne Fox, president of the Sydney Home Education Network.\n\n\n\n\n\nIt shows that Queensland has experienced the biggest rise in homeschooling across all states and territories, increasing by 163 per cent since 2020.\n\n\n\nQueensland has experienced the most significant increase of homeschooling students, rising by 163% from 2020. Credit: Supplied/Vivienne Fox Dr Rebecca English, a senior lecturer in education at Queensland University of Technology, says while homeschooling rates had been slowly increasing prior to COVID-19, numbers ballooned at the onset of the pandemic.\n\n\n\n\n\nIt gave parents a deeper insight into classrooms via remote learning, which was imposed during periods of the pandemic. English says this led some to believe they are better equipped to educate their children.\n\n\n\n\n\n\"Parents looked at that and said, 'I'm already at home anyway, maybe I can do just as good of a job as the teacher is'.\n\n\n\n\n\n\"And they were seeing how that neurodiverse person, or that child who had reported they were bullied, was coping with that learning environment\".\n\n\n\nWhy has Queensland seen the biggest growth?\n\nEnglish says the reason behind Queensland's pronounced uptick in homeschooling rates is unclear, but that the state has a complex history with mainstream schooling.\n\n\n\n\n\n\"I'm not really sure why it's Queensland, but Queensland has a long history of quite a fractious relationship with state schooling,\" she says.\n\n\n\n\n\nAccording to English, lower vaccination rates and opposition to vaccine mandates in Queensland may also play a role.\n\n\n\n\n\n\"I think [that's possible] when you look at the Brisbane area and the Sunshine Coast area and you look at other elements of maybe not going along with [the] mainstream, [and] higher rates of non-vaccination in [and] around Brisbane and the Sunshine Coast.\"\n\n\n\nDr Rebecca English is a senior lecturer in education at Queensland University of Technology. Credit: QUT/Anthony Weate Parents also attribute the popularity of homeschooling to its vibrant community mindset, particularly in the Sunshine Coast, which Valentine says encourages families to consider alternative education.\n\n\n\n\n\n\"I think that once the community starts to grow a little, then other people get more confidence to join that community,\" she says.\n\n\n\n\n\n\"There are so many things on the Sunshine Coast in particular that you could participate in that you could be busy all day, every day\".\n\n\n\nThe 'school refusal' cohort\n\nDespite the potential motivations of parents, the primary driver for homeschooling in Australia comes from students.\n\n\n\n\n\nEnglish says that while around 10 or 15 per cent of people are \"ideologically opposed to schooling\", the main reason people opt for homeschooling is school refusal.\n\n\n\n\n\nThis is typically as a result of bullying, social anxiety or because a child is neurodivergent and unsuited to the mainstream school environment, English explains.\n\n\n\n\n\n\"The increase in that 85 per cent [is] these accidental homeschoolers — they didn't set out to homeschool [but] they find that this is the only choice. That is where the real research interest lies,\" she says.\n\n\n\nEight-year-old Ben started homeschooling two years ago after experiencing school refusal. Credit: Danika / Supplied After a year of trying mainstream schooling, Sunshine Coast residents Danika and Joel resorted to homeschooling their eight-year-old son Ben, after his school refusal and anxiety reached a tipping point.\n\n\n\n\n\n\"Homeschooling sort of chose us,\" Danika says,\n\n\n\n\n\n\"It was something that we as a family decided for Ben's mental health, [that it] was a better option to try homeschooling just because of how school was making him feel.\"\n\n\n\n\n\nBen was experiencing \"a lot of separation anxiety\", and was arriving home in tears as he voiced to his parents daily that school wasn't for him. Danika says this initially \"derailed\" her and Joel, who had both had a positive school experience.\n\n\n\n\n\n\"He just was this little five-year-old boy whose heart had been broken, spark had been put out and it was not the school's fault, it was just the sheer volume of everything on such a little human being,\" she says.\n\n\n\n\n\n\"And then we peeled back the layers, and the neurodiverse aspect in a mainstream school was quite overwhelming.\"\n\n\n\nDanika, Ben and Milly learning together at home. Credit: Supplied Ben has since been diagnosed with ADHD, which Danika says contributed to his school refusal.\n\n\n\n\n\nWhile she doesn't blame the school or teachers, she says public school resourcing isn't designed to support all children, especially those who are neurodivergent.\n\n\n\n\n\nShe says Ben felt he was being punished for his \"neurodiverse idiosyncrasies\", which was \"quite shameful\" for him.\n\n\n\n\n\n\"We thought: 'What's happening in the school grounds that's making him feel this way?' But there [were] no particular incidents. He just didn't feel safe and secure mentally\".\n\n\n\nShortcomings of mainstream schooling\n\nRemote learning during the peak of the pandemic caused many parents to question traditional schooling, according to Queensland Family and Child Commissioner Luke Twyford.\n\n\n\n\n\nHe says increasing rates of homeschooling indicate parents are being \"very conscious of the wellbeing of their children\" and choosing homeschooling as a \"positive outcome\".\n\n\n\n\n\n\"I think there's a change in our society around questioning traditional schooling methods,\" Twyford says.\n\n\n\nI've certainly seen increases in adolescent mental health and 'school can't' and 'school refusal' movements.\n\nEnglish says it's important to reassess the psychosocial care limitations of state-based school systems, given the main driver of homeschooling results from school refusal.\n\n\n\n\n\n\"I think that's something that we really need to look at: How can we better meet the needs of particularly neurodiverse young people in our classrooms?\"\n\n\n\nCalls for more regulation in home schooling\n\nThe former Queensland government was unsuccessful in attempts to pass legislation last year that would enforce homeschooling parents to follow the Australian curriculum, among other reforms.\n\n\n\n\n\nThat was largely thanks to the Free2Homeschool movement, led by homeschooling parents, who gathered more than 21,000 signatures and more than 2,000 submissions in opposition to the bill.\n\n\n\n\n\n\"So the freedom that we have now is a lot of why we choose homeschooling,\" campaign manager Patricia Fitzgerald tells SBS News.\n\n\n\n\n\n\"So, if we're going to take that away, our children may as well be in school, but we didn't want that\".\n\n\n\n\n\nThe current Queensland government introduced new legislation in March this year, which is still under review, removing clauses that homeschooling parents had objected to, such as enforcing the Australian curriculum and removing provisional registration options that parents argue allow for more flexibility to commence homeschooling.\n\n\n\n\n\nThe legislation does maintain a reform to change the eligibility age range for homeschool students, lifting the cut-off age from 17 to 18, which is a move that has been advocated for by homeschooling parents.\n\n\n\nPatricia Fitzgerald and Amanda Bartle started the Free2Homeschool campaign seeking to protect caregivers' ability to meet the specific education needs of homeschooled students. Credit: Patricia Fitzgerald Queensland's Family and Child Commission conducted a report last year into Queensland's home education system, in response to concerns raised by the Child Death Review Board in their 2022-2023 report.\n\n\n\n\n\nThe December 2024 report into Queensland's home education system \"affirmed a parent's right to choose the most suitable learning environment for their child\", but called for improved information-sharing between state government departments to ensure child safety.\n\n\n\n\n\n\"What we are mostly concerned about is that the registration system in homeschooling isn't always picking up other risk factors that other government departments are identifying,\" Twyford says.\n\n\n\n\n\nQueensland Education Minister John-Paul Langbroek told SBS News that the department is considering the findings of a separate independent home education review and \"will work with families, Child Safety, and other agencies to implement all accepted recommendations of the report\".\n\n\n\n\n\n\"It's a parent's right to choose the type of education that best suits their family, but safety must always be the priority,\" Langbroek says.\n\n\n\nChanging lifestyles and greater flexibility\n\nThe growing trend towards homeschooling also raises questions about the future structures of work, education and family life.\n\n\n\n\n\nOne of the key changes could be a more tailored approach to education, says English.\n\n\n\nHomeschooling is much more child-centred and I would expect to see that schools will adopt more of that child-centred learning.\n\nValentine has seen the advantages of homeschooling firsthand and says she appreciates the time she shares with her two sons.\n\n\n\n\n\n\"It allows me to spend quality time with my kids every day, and I've really seen the benefits of that in terms of our closeness and our relationship, [which] is beautiful,\" she says.\n\n\n\nValentine says there are so many varying learning opportunities afforded by the flexibility of homeschooling. Credit: Supplied She says her family feels part of a \"bigger community\".\n\n\n\n\n\n\"It's a beautiful thing to be able to go out into the world and be able to talk to different people. Everywhere we go is a learning opportunity\".\n\n\n\n\n\nEnglish says the rise in homeschooling has also coincided with greater numbers of people working from home since the start of the pandemic, which could offer greater flexibility for families.\n\n\n\n\n\n\"I think homeschooling does offer parents an opportunity to balance that work, family life, school situation,\" she says.\n\n\n\n\n\n\"And homeschooling offers families the opportunity to spend more time with that young person.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/some-millionaires-pay-no-tax-in-australia-but-they-may-not-be-the-worst-tax-dodgers/b31sowxu2",
        "title": "Not just millionaires: Australia's worst tax dodgers could surprise you",
        "publish_date": "Fri, 4 Jul 2025 20:43:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Avoiding tax can almost seem like a national sport in Australia, but is it ever fair for our richest residents to pay no tax at all?\n\n\n\n\n\nLast week, the Australian Taxation Office (ATO) released data showing 91 people who reported a total income or loss of more than $1 million in 2022-23 paid no tax.\n\n\n\n\n\nExperts say there are legitimate reasons why high-income earners may be paying no tax, but it does raise questions around whether the system could be fairer — especially for those who don't have the same opportunities to benefit from tax deductions.\n\n\n\nWhy some people don't pay tax\n\nIndependent economist Saul Eslake says there could be several reasons why people earning substantial incomes are not paying tax.\n\n\n\n\n\nFor example, those who earn income generated overseas may have already paid tax in a foreign country. Australia has treaties with most countries, so residents don't pay double tax.\n\n\n\nOf the 91 individuals who paid no tax in 2022-23, at least 28 reported $14.8 million in foreign-source income.\n\n\n\n\n\nLottery wins in Australia are also not taxed.\n\n\n\n\n\n\"Personally, I think [lottery wins] should be subject to tax, but they're not,\" Eslake says.\n\n\n\n\n\nSuperannuation earnings in the draw-down or retirement phase are also not taxed, something that has been described by former federal treasury secretary Ken Henry as \"stupid\".\n\n\n\n'Unfair' system that disadvantages wage and salary earners\n\nAnn Kayis-Kumar, associate professor of accounting at UNSW Business School, says while tax planning is allowed in Australia and laws around deductions are relatively generous, they don't benefit everyone equally.\n\n\n\n\n\nShe says business owners are much more likely to be able to claim deductions and reduce their tax to zero than Australians who are earning a wage or salary.\n\n\n\n\n\nA study by UNSW found high-income taxpayers were best able to mitigate their tax liability because they were more likely to have access to different business structures.\n\n\n\nFor someone [earning] salary and wages ... there aren't any sophisticated structures that we can use.\n\nGreg Jericho, chief economist at The Australia Institute, says wage earners often find it difficult to claim tax deductions for expenses such as work clothes.\n\n\n\n\n\n\"As soon as you're either a sole trader or small business, suddenly things become business expenses and you're able to claim them,\" he says.\n\n\n\n\n\n\"There's a lot of carrying forward losses from previous years and things like that, which just doesn't happen for someone who is on an income.\"\n\n\n\n\n\nAn ATO spokesperson says employees generally can't claim a deduction for conventional clothes and this also applies to business owners.\n\n\n\n\n\nBut if a business purchases and provides conventional clothing for its owner or other employees for wear during their employment or provides them with an allowance for this, the business may be entitled to a deduction.\n\n\n\n\n\n\"A business can claim a tax deduction for most expenses they incur in carrying on your business if they are directly related to earning your assessable income.\"\n\n\n\nBusiness owners are able to claim tax deductions easier than wage and salary earners. Source: Getty / Krisanapong Detraphiphat Eslake says income from capital gains, dividends, partnerships, trusts and superannuation funds is also taxed at lower rates than wages and salaries.\n\n\n\n\n\nAround 82 per cent of the income earned by those in lower tax brackets is gained through wages and salaries. This drops to just 58 per cent among those in the top tax bracket.\n\n\n\n\n\nAmong the 91 individuals who did not pay tax, just 18 reported $4.7 million in income earned from salary or wages.\n\n\n\n\n\nBut they reported $430.4 million in capital gains, which are profits from the sale of investments such as property, shares and crypto assets.\n\n\n\nSomething that's fundamentally unfair about the tax system is that it does discriminate against wage and salary earners.\n\nEslake says the system also benefits people aged over 65 because they rely less on wages and salaries, although many receive a pension.\n\n\n\n\n\n\"There's an awful lot of capital gains, dividends and partnership income that people over 65 earn, and they don't pay the same rate of tax as you would if you were earning it in wages and salaries, it's lower,\" he says.\n\n\n\n\n\n\"Personally, I think that's unfair between rich and poor, and it's also unfair between old and young.\"\n\n\n\nSalary and wages make up a small portion of the $52.4 million in income reported by 91 individuals who paid no tax in 2022-23. Source: SBS News\n\nThe worst offenders when it comes to tax avoidance\n\nWhile attention is often focused on high-income earners, Eslake says small businesses are believed to be the worst offenders when it comes to avoiding tax.\n\n\n\n\n\nEslake is part of an expert advisory panel run by the ATO, which has estimated the difference between the amount of tax collected in categories such as personal tax, company tax, and customs and excise duty, and what would be collected if there were full compliance with the law.\n\n\n\n\n\nHe says the ATO estimates small business discrepancies make up around 40 per cent of the tax gap, amounting to $17.7 billion of the $44.5 billion gap in 2021-22.\n\n\n\nThey don't put a lot of resources into making sure small businesses comply because there are so many of them.\n\nIn contrast, Eslake says the ATO invests significant resources in ensuring that high net worth individuals and companies are compliant.\n\n\n\n\n\n\"The tax office would know who those people are, they will have gone over their affairs with a pretty fine-tooth comb and if they're not paying tax, it would be for a good reason,\" he says.\n\n\n\nHigh-income earners better able to take advantage of tax deductions\n\nGifts or donations to charity make up a significant portion of the tax deductions claimed by the 91 individuals who paid no tax in 2022-23.\n\n\n\n\n\nBut Jericho says one of the more interesting aspects of their deductions is how much the group is spending on managing their tax affairs.\n\n\n\n\n\n\"It really highlights that the millionaires who avoid paying tax are spending a lot of money on fairly high-priced accountants and tax lawyers to find every loophole to enable them to get their taxable income below the tax-free threshold [of $18,200 a year].\"\n\n\n\n\n\nOn average, the 91 individuals spent around $51,000 each on expenses such as accountancy fees and litigation costs.\n\n\n\n\n\nThe group reported a total income of $461.8 million, but their deductions came to $390.3 million. One person claimed $8 million in dividend deductions alone.\n\n\n\nSome of the tax deductions claimed by 91 individuals in Australia who paid no tax in 2022-23. Source: SBS News But the results for this group are likely to differ this financial year, as they are set to lose a significant source of deductions.\n\n\n\n\n\nIn 2022-23, they claimed $63 million for the cost of managing their tax affairs, but the overwhelming majority of this money ($58 million) was for interest charged by the ATO for late payment of taxes and penalties.\n\n\n\nChanges announced by the Albanese government in 2023 mean the general interest charge (GIC) and shortfall interest charge (SIC) will no longer be tax-deductible from 1 July this year.\n\n\n\n\n\n\"The change is designed to ensure that taxpayers who do the right thing and pay their tax in full and on time are not disadvantaged relative to those who do delay payment,\" an ATO spokesperson says.\n\n\n\n\n\nEslake supports the change and says there's no reason these interest charges should be tax-deductible.\n\n\n\n\n\n\"It's not an expense necessarily incurred in producing accessible income — like interest on a loan taken out to purchase an investment property or the cost of cleaning work clothes such as a uniform — and it is not a policy purpose, such as donations to registered charities … so it shouldn't be a tax deduction,\" he says.\n\n\n\n'National hobby' in Australia to avoid paying tax\n\nJericho says most millionaires do pay tax and most of them (24,164 individuals) even remained in the top tax bracket in 2022-23.\n\n\n\n\n\nOverall, 860,021 individuals in the highest tax bracket paid $106.4 billion in tax. This equates to 38 per cent of the total income tax collected, even though this group only makes up 5.3 per cent of taxpayers.\n\n\n\n\n\nJericho says many tax concessions, such as the capital gains tax discount and negative gearing, are viewed as legitimate and this encourages people to change their behaviour to avoid paying tax.\n\n\n\nIt almost seems sometimes that one of the national hobbies is trying to find ways to avoid tax.\n\nJericho says if some of these incentives were removed, there would be less pressure to increase taxes.\n\n\n\n\n\nSeeing wealthy individuals avoid taxes can also erode people's faith in the system.\n\n\n\n\n\n\"[It] almost implicitly encourages people to try and think that avoiding tax is legitimate and a worthwhile thing to pursue, and we really should not be encouraging that kind of activity,\" Jericho says.\n\n\n\n\n\n\"We should have people feeling that paying taxes is a good thing because it delivers all our services.\"\n\n\n\nTaxes fund our roads, schools and other services Australians rely on. Source: AAP / Luke Costin Kayis-Kumar says Australia has an over-reliance on personal income tax and former treasury secretary Ken Henry has warned about the intergenerational unfairness of the system.\n\n\n\n\n\n\"This is a really important conversation to be having about income inequality and wealth inequality, and how can we use tax policy and design to mitigate the effects rather than [tinker] on the sidelines,\" Kayis-Kumar says.\n\n\n\nWhat changes could be made?\n\nWhile some wealthy individuals may have legitimate reasons for paying no tax, Jericho says this raises the question of whether a minimum rate of taxation on total income — instead of taxable income — should be considered.\n\n\n\n\n\nLimiting the amount of money someone can claim as a deduction for managing tax affairs to around $3,000 might also help.\n\n\n\n\n\n\"It would put a bit of a crimp on these people who are spending huge amounts of money on tax lawyers and tax accountants to avoid paying tax,\" he says.\n\n\n\n\n\nA study led by Kayis-Kumar looked at capping deductions for managing tax affairs to $3,000 — something Labor proposed in 2019 — and found it could be effective in reducing the exploitation of tax professional services as a means of reducing tax for high-income earners.\n\n\n\n\n\nBut a second study found the ability for individuals to direct deductions between personal and corporate income may dampen the effectiveness of such a change.\n\n\n\nKayis-Kumar says Australia's system makes it relatively easy to apply deductions across different income categories.\n\n\n\n\n\n\"The top rate of personal income tax [47 per cent] is higher than the corporate income tax [30 per cent], so you've immediately got that incentive,\" she says.\n\n\n\n\n\n\"It's more attractive to put income into pots where the tax rate's lower, and to put deductions into pots where the tax rate is higher.\"\n\n\n\nSupport needed for changes\n\nChanging the system is also difficult due to unintended consequences and knock-on effects, Kayis-Kumar says.\n\n\n\n\n\nFor example, if Australia reduced the number of deductions available and lowered tax rates simultaneously, most people wouldn't get much of a refund at the end of the financial year.\n\n\n\nIn Australia, especially, we love our tax refund culture, so it's really hard to unpick all of that in a way that will get everyone on board.\n\nThese types of changes may also not solve the bigger problem, as high-income earners may still find ways to plan around the rules, particularly because there may still be differences in how business or overseas income is taxed.\n\n\n\n\n\nKayis-Kumar says it may be necessary to look more broadly at the taxation of other assets, rather than changes to income tax.\n\n\n\n\n\n\"A broad-based land tax has been described as a really effective way to solve that puzzle around why we have this over-reliance on personal income tax.\"\n\n\n\n\n\nThe taxing of super profits — for example, the above-normal profits of mining companies — could also be reviewed.\n\n\n\n\n\nEslake says reducing capital gains tax discounts, negative gearing and changing how trusts are taxed could be other ways to make the system fairer.\n\n\n\n\n\nAustralia could also tax capital, investments and business at a flat rate of around 25 to 30 per cent with no tax-free threshold.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/slater-speaks-after-death-of-cameron-munsters-father-20250706-p5mcuv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Slater speaks after death of Cameron Munster's father",
        "publish_date": "Sun, 06 Jul 2025 12:20:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Slater speaks after death of Cameron Munster's father\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/around-the-clubs-nrl-round-19-20250706-p5mcul.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin team rocked by tragic death",
        "publish_date": "Sun, 06 Jul 2025 12:02:22 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Queensland captain Cameron Munster has left Origin camp after the death of his father Steven, but plans to return and lead the Maroons in Wednesday’s decider.\n\nMunster learned of his father’s death overnight in Queensland camp on the Sunshine Coast, with coach Billy Slater confirming the news in a statement on The Sunday Footy Show.\n\nCameron Munster is set to play the Origin decider. Credit: Getty Images\n\n“Unfortunately we woke to the sad news of the passing of Cameron Munster’s father Steven Munster overnight,” Slater said on Sunday morning.\n\n“Cam will exit camp to be with his family before rejoining his team for the game on Wednesday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/home-tech-upgrades-to-splash-your-tax-refund-on-20250702-p5mbw6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Home tech upgrades to splash your tax refund on",
        "publish_date": "Sun, 06 Jul 2025 12:01:00 +1000",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "Where other mixers and my weak kneading skills fail, the Ooni delivers. Ooni Halo Pro Spiral Mixer – $1100 I have mixers at home and have never felt the need to invest in an overly fancy or expensive model. When I heard that a mixer from Ooni — maker of home pizza ovens — had sold out in Australia within six hours, I wasn’t sure what the fuss was about. But after trying it, I see it’s a simple but novel concept; this is a massive professional-style spiral mixer, just shrunk down for your bench. I don’t use many $1000+ mixers, but all the mixers I have used simply will not handle bread or pizza dough. It will get clagged up on the hook, or won’t mix properly, or get too hot, or just literally stop the mixer from turning. But the spiral hook and breaker bar on this machine do a consistently excellent (and hypnotic) job, and since nobody has to knead the dough we’ve been making a lot more yeast bread, sourdough and pizza at home, with great results. The mixer has a dial and a simple display on the top so you can set the speed, and there’s also a timer for both mixing and proving so you don’t have to babysit the machine; it will turn off when the mixing’s done and play a sound when it’s ready. I also like the included splash guard that has a little funnel and a door for adding liquid or ingredients mid-mix.\n\nThe Halo Pro is explicitly designed for dough, but it can work as a more general stand mixer as well. The head tilts up, and you can remove the breaker bar and spiral to insert another attachment for whisking or beating. The new model is the lightest ever Surface Laptop. Surface Laptop 13-inch – $1360+ Microsoft’s latest portable computers are a little smaller than usual, and a little less expensive, so as expected they also have some light compromises. But unlike the often-hard-to-recommend Surface Laptop Go, the new 13-inch Surface Laptop feels intentionally and thoughtfully small. Of course, that’s not to say it’s exactly like full-fat 7th Edition Surface Laptop – its screen is limited to the standard 60Hz, it has a mechanical trackpad rather than a haptic one, and it doesn’t have any high-speed Thunderbolt 4 ports – but the new model carries over the most important elements of its siblings.\n\nThe keyboard feels great, the metal construction is solid and satisfying, there’s a nice bright touchscreen, and you get a clean version of Windows 11 with all the Copilot+ PC AI-powered trimmings. Loading Overall the laptop stands up really well as Microsoft’s answer to Apple’s MacBook Air, and that’s especially true in the battery department. I was able to get through an entire day of work without charging, even with some heavy Photoshop involved, and the device happily went for two days if I was just writing. It’s powered by a Snapdragon X Plus chip, which is plenty fast enough for productivity tasks and packs a powerful AI processor, and it’s generally a joy to work on. I had no issue with any of my work apps, and I even lent it to a less-technical person to work on, and they loved it. But I am compelled to mention that since this is an ARM chip there are apps designed for Intel x86 chips that do not work. So if there’s a less-common program you vitally need, it’s worth checking that there’s an ARM version available, or that it works with Windows’ compatibility layer. It’s becoming difficult to clock the incremental improvements LG makes to the C-series each year, but it’s still one of the best on the market.\n\nLG C5 OLED TV – $2200+ LG’s C4 was my favourite all-rounder TV of last year and, as expected, the C5 is just a little bit better. The C-series has frequently been my go-to recommendation for OLEDs because it hits every high-end feature you need, without any gimmicks or esoteric features that demand a higher price tag. Plus, you don’t lose any features if you go for a smaller size; the 42-inch model has the same processor, the same full-speed HDMI ports, the same 144Hz refresh, the same low-latency gaming mode and the same accuracy-focused film modes as the 83-inch. So what’s new with the C5? It’s brighter, which is great if your loungeroom has a lot of glare from windows during the day, but also makes for more impactful scenes in HDR content. Upscaling of older low-resolution content is also improved, so while you won’t magically get more detail from a 25-year-old DVD, it will be sharp and artefact-free. Otherwise, things haven’t changed too much. You still get a fantastic experience out of the box just by changing to one of the pre-calibrated or filmmaker picture modes, and you won’t find a better screen for watching movies in the C5’s price class. The 55- and 65-inch models are sold for $1000 less than some models that provide a very similar core experience. The C5 is also one of the best on the market for gaming, with support for all kinds of variable refresh rate, and 4K at up to 165Hz through all four HDMI ports.\n\nThere are only two areas where the C5 has arguably taken a step backwards; it has dropped support for passing through DTS sound (which will impact few people since the large majority of movies have Dolby mixes, but it seems a pointless removal), and I don’t like the new smaller remote. The numbers were useful for shortcuts, and there is now no dedicated input button, despite buttons being given to the TV guide, help, and voice search. The Area-51 looks great, runs relatively quietly, uses mostly off-the-shelf parts for upgradability, and easily ran all the new games I tested at their most ridiculous settings. Alienware Area-51 PC Desktop – $5520+ If you’re looking for the most graphically powerful Windows machine you can get, you want it to be built for you, and you don’t mind that it’s several times more expensive than the priciest games console, this is the machine for you.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/smith-whacked-on-dodgy-finger-20250706-p5mcu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smith whacked on dodgy finger",
        "publish_date": "Sun, 06 Jul 2025 11:23:29 +1000",
        "category": "finance",
        "authors": [],
        "text": "Smith whacked on dodgy finger\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/smith-green-pull-aussies-out-of-strife-20250706-p5mcu2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smith, Green pull Aussies out of strife",
        "publish_date": "Sun, 06 Jul 2025 10:39:12 +1000",
        "category": "finance",
        "authors": [],
        "text": "Smith, Green pull Aussies out of strife\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/kenyan-superstar-breaks-her-own-1500m-world-record-20250706-p5mcu0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kenyan superstar breaks her own 1500m world record",
        "publish_date": "Sun, 06 Jul 2025 10:34:08 +1000",
        "category": "sports",
        "authors": [],
        "text": "Kenyan superstar breaks her own 1500m world record\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/young-gun-clinches-astonishing-come-from-behind-win-20250706-p5mctv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young gun clinches astonishing come-from-behind win",
        "publish_date": "Sun, 06 Jul 2025 10:18:57 +1000",
        "category": "finance",
        "authors": [],
        "text": "Young gun clinches astonishing come-from-behind win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/i-didn-t-want-to-leave-tupou-confirms-move-to-paris-20250706-p5mcs6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I didn’t want to leave’: Tupou confirms move to Paris",
        "publish_date": "Sun, 06 Jul 2025 09:40:00 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Wallabies tighthead prop Taniela Tupou confirmed that he played his last game for the Waratahs after the 21-10 loss to the British and Irish Lions in Sydney.\n\nTupou will move to play for Racing 92 next season, the former club of South Africa’s World Cup winning Siya Kolisi and current Lions squad member Owen Farrell.\n\nFarrell was in the crowd at Allianz Stadium and like Kolisi lasted just one season at Racing 92 to return to their homelands early. Tupou is hoping for a longer stay in Paris after joking that he hoped the English playmaker had left some money for him at the club.\n\n“It’s a big move for me, I wasn’t sure, I didn’t want to leave (Australia), that’s the honest truth,” Tupou said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/musk-declares-new-america-party-is-formed-after-trump-s-bill-passes-20250706-p5mct4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Musk declares new America Party ‘is formed’ after Trump’s bill passes",
        "publish_date": "Sun, 06 Jul 2025 09:33:25 +1000",
        "category": "finance",
        "authors": [
            "Sam Kim"
        ],
        "text": "Elon Musk said a new political party he has been threatening to start up “is formed”, a day after US President Donald Trump signed a tax-cut and spending bill that the billionaire Tesla chief executive officer has denounced.\n\nMusk made the announcement on his X social network after posting the results of a poll on the platform that he said showed 65 per cent of respondents in favour of creating an America Party.\n\nElon Musk had previously threatened to launch a political party the day after “this insane spending bill passes”. Credit: Getty Images\n\n“You want a new political party and you shall have it!” he said on Saturday (Sunday AEST). “Today, the America Party is formed to give you back your freedom.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/you-pinch-yourself-wallabies-veteran-set-to-realise-childhood-dream-against-lions-20250704-p5mcnl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You pinch yourself’: Wallabies veteran set to realise childhood dream against Lions",
        "publish_date": "Sun, 06 Jul 2025 09:32:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "He scored the opening try against them on tour, and now, evergreen halfback Nic White is ready to realise a childhood dream by wearing the green and gold against the British and Irish Lions in a Test match.\n\nAt 35, and with 71 Tests under his belt, the veteran has pretty well been there, done that, but one box that remains unticked is representing his country against the Lions, who venture Down Under once every 12 years.\n\nHe missed out in 2013, after suffering a shoulder injury while playing for the Brumbies in Super Rugby, and realises the three-Test campaign that kicks off in Brisbane on November 19 represents his last chance.\n\nHe has already observed the Lions at close quarters, during the tour opener in Perth, when he scored the only try for Western Force in a 54-7 defeat.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/entrepreneurship/celebrities-are-putting-the-a-list-in-capitalist-like-never-before-20250704-p5mcl1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Celebrities are putting the ‘A-list’ in capitalist like never before",
        "publish_date": "Sun, 06 Jul 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "The Economist"
        ],
        "text": "Celebrities are venturing beyond the billboard and the big screen – and into big business. Hailey Bieber, a model married to Justin, recently sold Rhode, her make-up brand, in a deal valued at as much as $US1 billion ($1.5 billion).\n\nSkims, a shapewear label founded by Kim Kardashian, a reality-TV star, makes $US1 billion in annual sales and is expected to list on the stockmarket soon. Rihanna is now a billionaire not directly because of her music, but thanks to Fenty Beauty, her make-up label. Ryan Reynolds, a Hollywood actor, is active in everything from telecoms to online privacy. Surprisingly, many of these superstar businesses have become a source of innovative new consumer products.\n\nHailey Bieber, Rihanna and Ryan Reynolds are among a new cohort of celebrity entrepreneurs proving there’s a new type of star power in town. Credit: Sydney Morning Herald/Chris Fowler\n\nCelebrities have long used their fame to peddle things. Michael Jordan, a basketball player, is thought to have made over $US1.5 billion ($2.3 billion) from his partnership with Nike over the past 40 years. Nespresso has reportedly paid George Clooney more than $US40 million ($61 million) to have his mug selling its coffee. Two decades ago Hulk Hogan, a professional wrestler, helped market the “Hulkster” cheeseburger, pre-cooked and frozen for your convenience.\n\nThe practice continues. This week President Donald Trump launched “Victory 45-47″, a line of fragrances for men and women priced at $US249 ($379), having launched “Fight Fight Fight” ($US199, $303) last year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/demon-advances-daria-drops-out-20250706-p5mctc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Demon advances, Daria drops out",
        "publish_date": "Sun, 06 Jul 2025 09:15:10 +1000",
        "category": "finance",
        "authors": [],
        "text": "Demon advances, Daria drops out\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/meghan-markle-flaunts-sold-out-as-ever-spread-20250706-p5mct0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan Markle flaunts sold-out As Ever spread",
        "publish_date": "Sun, 06 Jul 2025 08:33:42 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan Markle flaunts sold-out As Ever spread\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/pm-anthony-albanese-shares-subtle-message-about-us-relations-20250706-p5mcsu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PM Anthony Albanese shares subtle message about US relations",
        "publish_date": "Sun, 06 Jul 2025 08:13:45 +1000",
        "category": "finance",
        "authors": [],
        "text": "PM Anthony Albanese shares subtle message about US relations\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/smith-and-green-rise-to-the-occasion-as-australia-pile-pressure-on-west-indies-20250706-p5mcse.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Smith and Green rise to the occasion as Australia pile pressure on West Indies",
        "publish_date": "Sun, 06 Jul 2025 07:58:54 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "St George’s: It was as if Steve Smith and Cameron Green looked at each other on an overcast third morning of the second Test in Grenada and made a pact that enough was enough.\n\nAustralia’s top order has been the subject of enough scrutiny and ridicule on this West Indies tour that it was time for two players at very different stages of their career to rise to the occasion when it mattered most.\n\nBy stumps on Saturday (Sunday morning AEST) at Grenada’s National Cricket Stadium, Australia had rallied from 2-4 late on day two to 7-221, with a healthy 254-run lead, thanks to potentially match-defining contributions from Green (52) and Smith (71).\n\nTheir hard-fought partnership of 93 runs was the highest they’ve shared in Tests and surpassed their previous best of 81 against Pakistan in Rawalpindi in 2022.",
        "source": "TheAge"
    }
]