[
  {
    "url": "https://www.9news.com.au/national/amazon-haul-online-marketplace-hopes-to-compete-with-shein-temu/d3123f41-c5aa-4b17-af49-a32451fd89f3",
    "title": "Amazon unveils new marketplace to stave off growing threat from Temu, Shein",
    "publish_date": "Fri, 22 Aug 2025 21:02:48 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Amazon has unveiled a cheap new online marketplace in Australia as billionaire boss Jeff Bezos hopes the \"trustworthy\" brand can compete against the exploding popularity of Shein and Temu.\n\nAmazon Haul was rolled out in﻿ Australia late last week, offering hundreds of thousands of products under $25 that are being coupled with enticing promotions and sales. ﻿\n\n\"Australians seek out value and convenience when they shop online, and we're excited to provide more options through the shopping app they already know and love,\" Amazon Marketplace Australia Manager Amit Mahto said.\n\nREAD MORE: ﻿ Mysterious debris balls wash up on NSW beaches again\n\nAmazon has entered the ring with a cheap new online marketplace in Australia as billionaire boss Jeff Bezos hopes the \"trustworthy\" brand can compete against the exploding popularity of Shein and Temu. (Amazon Haul )\n\nHaul items are not eligible for Amazon Prime delivery and are shipped within about two weeks with a 15-day return window.\n\nAmazon is running several promotional sales to successfully launch Haul in Australia, like limited-edition $1 flash deals, an up to 80 per cent off sale and an under $5 category.\n\nAccording to ﻿Swinburne consumer expert Bo Pang, Amazon is trying to compete against the rise of cheap online marketplace giants Shein and Temu.\n\n\"They're actually getting a lot of momentum in terms of getting new customers in,\" he said.\n\n\"But if you look at the models, Amazon is doing this traditional platform, but Temu and Shein are competing with the ultra-low-cost products, so they're actually targeting different audiences﻿.\"\n\nRoy Morgan research from last year found that two million Australians purchased at least once from Shein, and 3.8 million Australians purchased at least once from Temu. ﻿\n\n\"I can't think of another retailer that has seen a hike of 30 per cent in customers in such a short time, especially now, other than Amazon, who is already mounting a fight back against these platforms at the global level,\" Roy Morgan Head of Retail Research and Social and Consumer Trends Laura Demasi said at the time.\n\nPages from the Shein website, left, and from the Temu site. Both companies say they will increase prices due to US tariffs. (AP Photo/Richard Drew, File) (AP)\n\nRoy Morgan research in May, however, found a growing distrust of the brands.\n\nTemu was the ﻿seventh most distrusted brand among Australians, while Shein was the 15th most distrusted brand.\n\nAmazon has attempted to differentiate Haul, branding it as a \"trustworthy shopping experience\".\n\n\"All products on Haul go through all relevant Amazon checks so customers can be confident they'll receive products that are safe and compliant with all applicable regulations and Amazon policies﻿,\" Amazon said.\n\n﻿The federal government regulates companies operating in Australia to ensure they meet the consumer protection and product safety rules.\n\nBut for companies that have third-party sellers directly shipping items to individuals, Pang said compliance becomes virtually non-existent.\n\n\"It's going to be shipped out from somewhere in China, and then they get shipped here in Australia, so it's going to be really hard for regulators to apply all these compliance checks,\" he said.\n\nConcerns have also been raised about the negative environmental impacts of cheap plastic products, which Pang said are usually thrown away within three months and accumulate in landfills.\n\nREAD MORE: ﻿ Major dam expected to spill 15 billion litres a day after huge rain\n\nTemu is also looking to be a signatory to the ACCC's voluntary online product safety pledge.﻿ (Adobe Stock)\n\nPang, however, believes Amazon's brand could help raise the standards across other cheap online marketplaces.\n\n\"﻿I think they're going to leverage from their own brand image, which is reliable, which is getting good customer service, and they can hopefully introduce some level of compliance in terms of product quality,\" he said.\n\n\"I think the end game here is not competing with price, rather than competing with value for money. So reasonably priced, but good quality.\"\n\nShein and Temu said they require their sellers to comply with local laws and standards.\n\nA Shein spokesperson said the site also has a code of conduct. If any non-compliant products are discovered, Shein removes them from the website while the company investigates.\n\nA Temu spokesperson said it has a quality assurance system that includes vetting sellers and product listings, physical spot checks, monitoring and enforcement action. ﻿\n\nTemu is also looking to be a signatory to the ACCC's voluntary online product safety pledge.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/adelaide-airport-flights-delayed-as-heavy-fog-blankets-city/a9ce313e-11cf-47ee-a1a4-9a35230414ab",
    "title": "Flights delayed in Adelaide as heavy fog blankets city",
    "publish_date": "Sat, 23 Aug 2025 00:17:25 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "A thick blanket of fog ﻿over Adelaide has caused delays for travellers.\n\nHeavy fog has impacted multiple domestic and international flights trying to leave and arrive at the airport.\n\nNearly every flight scheduled to arrive at the airport this morning was delayed by at least 30 minutes, with some pushed back by an hour and a half, according to the airport's website.\n\nREAD MORE:﻿ Man charged after five people allegedly assaulted on Sydney train\n\nHeavy fog has impacted multiple domestic and international flights trying to leave and arrive at the airport. (Nine)\n\nThe fog has also impacted departure times.\n\nQantas flight QF674 from Adelaide to Melbourne was scheduled to leave at 8.00am, but is now estimated to take off at 9.45am.﻿\n\nAir Asia flight QZ421 from Adelaide to Denpasar has been delayed by more than four hours, first scheduled to leave at 7.05am it will now leave at 11.10am.\n\nDozens of other flights have also been impacted. ﻿\n\nDelays appear to be reducing as the morning continues, but people picking up travellers arriving at the airport are urged to stay up to date with ﻿the latest arrival information. (Nine)\n\nDelays appear to be reducing as the morning continues, but people picking up travellers arriving at the airport are urged to stay up to date with ﻿the latest arrival information.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/ultra-violette-sunscreen-pulled-from-shelves-lean-screen-spf-testing-discrepancy/55852597-16f6-463f-a22f-4a7e9fe98c96",
    "title": "Popular sunscreen brand pulls product off the shelves",
    "publish_date": "Fri, 22 Aug 2025 03:30:34 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "A﻿ustralian sunscreen brand Ultra Violette has pulled one of its products from shelves and is offering customer refunds over \"concerning discrepancies\" in SPF testing results.\n\nIt comes just months after a Choice report alleged ﻿its Lean Screen SPF 50+ Mattifying Zinc Skinscreen returned an SPF rating of 4.\n\nAt the time, ﻿Ultra Violette disputed the Choice findings and vowed to pursue additional testing.\n\nREAD MORE: Millions facing days of flood risk as torrential rain eases\n\nUltra Violette's Lean Screen SPF 50+ Mattifying Zinc Skinscreen has been pulled from shelves over SPF testing concerns. (Instagram/@ultravioletteau)\n\nNow founders Rebecca Jefferd and Ava Matthews issued a statement apologising that the product had \"fallen short of the standards we pride ourselves on\".\n\n\"As a sunscreen brand, our responsibility has always been to prioritise your safety, protection and skin health above all else,\" it read.\n\n\"It remains the basis for every decision we make, which is why when you heard from us last, we made a commitment to you that we would continue to investigate a concerning discrepancy in SPF testing results of our Lean Screen.\"\n\nJefferd and Matthews stated that the product underwent testing at multiple independent labs to confirm the products's efficacy.\n\nResults from those tests returned varying SPF ratings of ﻿4, 10, 21, 26, 33, 60, 61, and 64.\n\n\"That wasn't good enough for us, and it isn't good enough for you,\" they said.\n\n\"We are deeply sorry that one of our products has fallen short of the standards we pride ourselves on and that you have come to expect of us.\"\n\nThe first half of the Ultra Violette Lean Screen statement. (Instagram/@ultravioletteau)\n\nIn response to the inconsistency in testing, Ultra ﻿Violette announced it would be withdrawing the Lean/Velvet Screen from the market \"effective immediately\".\n\nThe brand will also be ﻿offering refunds to customers, \"regardless of where it was purchased\".\n\nLean Screen SPF 50+ Mattifying Zinc Skinscreen has been sold at major retailers like Sephora and Adore Beauty.\n\nUltra Violette ﻿said it will no longer be making any of its Skinscreen products with the third-party manufacturer that created the Lean Screen.\n\nIt claimed Lean Screen was the only sunscreen that manufacturer made for the brand.﻿\n\nThe brand also announced it will be cutting ties with the original testing lab that vetted the Lean Screen product and will be working with new testing facilities﻿ going forward.\n\nIt also vowed to increase the frequency of product testing to every 18 months.﻿\n\nUltra Violette insisted the SPF discrepancies only affected the Lean Screen product.\n\n\"Additional testing on all Ultra Violette products has reinforced our confidence in the rest of our line.\"\n\nThe second half of the Ultra Violette Lean Screen statement. (Instagram/@ultravioletteau)\n\nChoice CEO Ashley de Silva said Lean Screen being pulled from shelves over discrepancies in SPF testing results \"confirms there is a clear problem with how sunscreen is regulated and tested in Australia\".\n\n\"In a country where two in three people will be diagnosed with skin cancer, people deserve to trust that the SPF ratings on sunscreen are accurate and reliable,\" she said in a statement.\n\n\"Without CHOICE's investigation, Ultra Violette's Lean Screen would still be on shelves, despite the fact that it does not provide anywhere near the amount of sun protection it claims to.\"\n\nDe Silva called on the Therapeutic Goods Administration to provide an update on its investigation into the the Choice report on sunscreen SPF.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/woman-charged-after-baby-found-in-perth-drain/b7dd4a1b-5edb-4498-992c-4447edcceec8",
    "title": "Mother of baby found in Perth drain charged",
    "publish_date": "Fri, 22 Aug 2025 10:59:25 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/nsw-central-coast-debris-balls-wash-up-on-beaches/f4fd705c-bd6c-421d-b971-eeaf0ec3543e",
    "title": "Mysterious debris balls wash up on NSW beaches again",
    "publish_date": "Fri, 22 Aug 2025 02:40:36 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Debris balls have washed up on several NSW ﻿beaches again, but authorities are unsure whether they are related to the ones that were previously found along dozens of Sydney beaches.\n\nThe Central Coast Council confirmed the balls were found at The Entrance Beach, Grant McBridge Baths, Blue Bay, Toowoon Bay, North Shelly Beach, Shelly Beach and Blue Lagoon Beach.\n\nThe Grant McBride Baths have been temporarily shut.\n\nDebris balls have washed up on several beaches on NSW's Central Coast. (Central Coast Council )\n\nBeachgoers are advised to avoid going to the affected sites and not to touch the debris.\n\nThe debris balls are grey-coloured, ranging in size from one to four centimetres.\n\n﻿The NSW Environment Protection Authority (EPA) was first notified by a beachgoer who stumbled upon the balls at North Shelly Beach.\n\nCouncil has since cleared all visible balls from that beach. ﻿﻿\n\nSamples have been collected for testing, but the composition and source of the material are not yet known and could be from a variety of sources, like stormwater, sewerage or ships.\n\nAccording to council, it is unclear whether these debris balls are related to the ones that washed up on Sydney beaches from October to January.﻿\n\nInvestigations and clean-up are currently ongoing.\n\nCouncil is managing the matter, but the EPA has offered to help if needed. ﻿\n\n\"Council also advised they will continue monitoring beaches and will send samples of the debris balls for testing,\" an EPA spokesperson said. ﻿\n\n\"Further actions will be considered once test results are received.\"\n\nREAD MORE: ﻿ Major dam expected to spill 15 billion litres a day after huge rain\n\nThe debris balls could be from a variety of sources, like stormwater, sewerage or ships. ﻿ (Central Coast Council )\n\nBlack-coloured debris balls first appeared in Coogee, in Sydney's east, in October before dozens more started popping up along the coastline up until January. ﻿\n\nThe EPA investigated and found the likely source of these balls was Sydney Water's land-based sewage treatment network.\n\nThe definite source ﻿still has not been determined.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/balingup-medieval-festival-king-and-queen/105672968",
    "title": "King of medieval 'Woodstock' explains enduring appeal of Dark Ages",
    "publish_date": "Sat, 23 Aug 2025 01:34:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "As a boy growing up in Scotland, Alpin Grant dreamed of being a knight.\n\nThe idea took root as he watched a Viking ship run aground on the shores of Arbroath, at a medieval festival.\n\n\"These guys … jump out of the ship, have a fight in the water and on the beaches,\" he recalled.\n\n\"Then they would drag the boat up to be burned later that night.\"\n\nAlpin Grant attended medieval festivals as a boy in Scotland. (Supplied: Alpin Grant)\n\nThe re-enactment lit a fire in him and, unlike most people who shed their childhood fantasies as they get older, Mr Grant leaned in.\n\nBy day, the 32-year-old works for a mining company in Western Australia, but the rest of the time, he can be found doing \"medieval things\" and running the South West's only medieval social group with his wife, Laura.\n\nThe Kingdom of Athera meets weekly on their farm in Dardanup, south of Perth, which has a fighting arena, a tavern and a mead hall.\n\nThe group specialises in sword combat, leather crafting, painting, woodcarving, brewing and blacksmithing.\n\n\"I always say it takes a special kind of stupid to get in the ring and hit each other with swords,\" he said.\n\n\"It's the passion that comes with it — you get to live out your kid fantasy of being a knight in shining armour and hitting each other.\n\n\"And I provide a space for that. It's really my thing.\"\n\nAlpin Grant has embraced the medieval scene in WA since moving from Scotland. (ABC South West WA: Bridget McArthur)\n\nMr Grant is under no illusions about the historical realities of Dark Ages living, but relishes being able to \"pick and choose the best bits\".\n\n\"There is nothing more adrenaline pumping than hearing that sword clang right in front of your face,\" he said.\n\n\"Smelling that burning steel two inches from your nose and knowing that could have been my head if I didn't block that.\"\n\nThe Grants were brought together by their mutual fascination with the Dark Ages and have since been crowned King Wülfhammer and Queen Revna of the annual Balingup Medieval Carnivale.\n\nThey were originally approached by the festival committee to help breathe new life into the event, which is now in its 30th year and features market stalls, sparring, archery and a blazing dragon.\n\nLoading...\n\n\"I said I'd do it on the condition that I got to be king. I thought that was a pretty good deal,\" he said.\n\n\" People usually ask me if I'm a real knight. Well not really, but in this world, yeah, sure I am. \"\n\n'Woodstock of medieval festivals'\n\nRos Benson started the Balingup Medieval Carnivale in 1995, and has seen it grow from a small, \"quirky\" festival for locals to a major celebration.\n\n\"It was just an event for Balingup to celebrate our creativity and wackiness,\" she said.\n\n\"Now it's probably the biggest income earner for Balingup.\"\n\nThe Balingup Medieval Carnivale is known for its \"quirkiness\". (ABC South West WA: Bridget McArthur)\n\nMs Benson said local residents were still the beating heart of the festival, something she is keen to preserve.\n\n\"Because we're such a little town it means everybody who is able is volunteering,\" she said.\n\n\"We can't get too much bigger without growing to a bigger town ourselves, which we don't really want.\"\n\nMr Grant said the carnival was the \"benchmark\" event and people planned their yearly costumes around it.\n\n\"The effort that goes in is sometimes astonishing,\" he said.\n\n\" It's basically our Woodstock. It's pretty much the event of the year for us medieval enthusiasts. \"\n\nAlpin Grant says some people plan their yearly costumes around the Balingup Medieval Carnivale. (ABC South West WA: Bridget McArthur)\n\nIn an era where the nine-to-five grind dominates most people's day-to-day lives, Mr Grant said the festival was a source of escapism and camaraderie.\n\nHe said he had been particularly pleased to see more young people joining in.\n\n\"Groups of teenagers, young adolescents [are] just going out for the day and getting out there, enjoying something new and exciting with their friends,\" he said.\n\n\"It's a nice breath of fresh air … something so flamboyant, drums and loud costumes and all of that does wake you up.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/nrl-harry-grant-suspended-stephen-crichton-bunker-drama/105689008",
    "title": "Storm skipper Grant suspended as Bunker drama leaves Dogs puzzled",
    "publish_date": "Sat, 23 Aug 2025 01:21:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "The imminent return of Jahrome Hughes has been soured by the suspension of Storm captain Harry Grant, who faces an enforced two-week break after Melbourne's hard-fought win over Canterbury.\n\nThe Storm moved four points clear of the third-placed Bulldogs on the back of the 20-14 victory in Melbourne, with Canberra in the box seat to claim the minor premiership after downing Penrith in golden point earlier on Friday.\n\nOn Saturday morning, skipper Grant was given a three-week suspension, reduced to two weeks with an early plea, for a shoulder charge on Canterbury's Harry Hayes.\n\nMelbourne still has two tough top-eight encounters to complete its regular season. The Storm host the Sydney Roosters next Friday night before a Thursday clash against the Broncos in Brisbane.\n\nBut with their points difference 144 better than the Bulldogs, they would need to suffer two monumental losses to lose their top-two spot.\n\nJahrome Hughes has not played since suffering a shoulder injury against the Roosters on July 24. (AAP: Dan Himbrechts)\n\nCameron Munster has carried a heavy load in recent weeks with his halves partner Hughes sidelined after a shoulder dislocation.\n\nInitially forecast to return in week one of the finals, Hughes is confident about being available for the Broncos match as he continues his rehabilitation on his shoulder that he hurt against the Roosters in late July.\n\nThe Storm have only had their first-choice spine on the park for eight matches this season, with fullback Ryan Papenhuyzen also missing a number of games through injury.\n\n\"I don't think he needs to play as far as combinations and things like that, but just, I suppose, for his confidence, and having confidence in the shoulder,\" Bellamy said of Hughes.\n\n\"I'd hate for him to go into a final with a bit of doubt.\n\n\"So if we could take that doubt out of it by playing him in our last round, we'll look to do that, as long as the physios and the medical people think he's 100 per cent right to play.\"\n\nCiraldo questions Bunker ruling after disallowed try\n\nBulldogs coach Cameron Ciraldo voiced his frustrations after the loss to the Storm following a disallowed try to Stephen Crichton.\n\nThe Bulldogs captain thought he had scored in the final minute off a Matt Burton bomb, but the Bunker ruled it to be a knock-on, chalking off the try.\n\n\"The whole kick contest again, that's really confusing. You touch him when they're in the air and it's a penalty and then you're allowed to put your arm out and stop them going for a catch,\" Ciraldo said regarding the incident.\n\n\"I actually don't know. I don't get a great look at it but I'll probably send it in [to the NRL] during the week.\n\nStephen Crichton thought he had gotten the Bulldogs in position to level the scores in the dying seconds before being denied by the Bunker. (Getty Images: Graham Denholm)\n\n\"I sent a heap in last week and it doesn't really help, but at least we can try and educate our players on what you're actually looking for, I suppose.\"\n\nDespite the disallowed try, Crichton was impressed by his side's performance.\n\n\"It will give us confidence coming back if we do end up coming back here and playing the first semi-final here,\" the burly centre said.\n\n\"There's so many lessons that we can take out of it, but the bright side is we know that we can go up against the top four teams and have a chance of winning, and it means as a footy team we can get together and believe that as well.\"\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/kalgoorlie-super-pit-aims-to-be-australias-biggest-gold-mine/105638634",
    "title": "Record gold price spurs renaissance of 'super' 3,500km tunnel mine",
    "publish_date": "Sat, 23 Aug 2025 00:41:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "From the public viewing platform overlooking Kalgoorlie's Super Pit gold mine, Greg Hewitt reflects on a four-decade career as an underground miner.\n\nHe spent 25 years lugging around a heavy rock drill, known as an air-leg, chasing rich gold deposits at what was once considered the richest square mile on Earth.\n\nThe 80-year-old calls it a \"dying trade\" due to the difficult, dangerous nature of the work and the \"calculated risks\" he took every day.\n\n\"There are plenty of blokes in the cemetery … they would be in stunned disbelief,\" he said of the 4.5 kilometre-long, 1.5km-wide and 600 metre-deep Super Pit, which is so big it is visible from space.\n\n\"They just wouldn't believe the effort and time that's been put in for that elusive bit of gold … I didn't think it [the Super Pit] would last, no way mate.\"\n\nLoading...\n\nAs a teenager, Mr Hewitt got his start in the surveying office at the Lake View and Star mine on Kalgoorlie's famous Golden Mile.\n\nGenerations of miners like \"Pecker\", as he is affectionately known, apparently due to a \"large nose\", have worked the ground since 1893.\n\n\"In 1965, a fellow miner got killed by a slab of rock and I replaced him,\" he said.\n\n\" The shift boss came along and said, 'Hey, young Pecker — do you want to go on the air-leg?' I said, 'Oh shit yeah', because I'd been learning off a few of the older blokes. \"\n\nGreg Hewitt worked for decades as an air-leg miner but says it is a dying trade. (ABC Goldfields: Jarrod Lucas)\n\nIt was hard work, lugging the more than 30-kilogram drill and other equipment up and down ladders and over rocks in stifling underground conditions.\n\nMr Hewitt worked at Lake View and Star from 1961 to 1970, a period when Australia swapped the pound for a decimal currency and the gold price was fixed at $31.25 an ounce, before it was freely floated in 1971.\n\nAfter switching to nickel mining when low gold prices shut all but one mine, he returned for another two years on the North Kalgurli mine from 1984.\n\n\"Nickel saved a lot of the miners their jobs … the Golden Mile was kaput,\" he said.\n\nThe fortunes of both commodities have flipped again, with WA's nickel industry collapsing and gold prices trading at record highs above $5,000 an ounce, ensuring the Golden Mile enjoys another renaissance.\n\nA miner at work in 1961 at the North Kalgurli mine on the Golden Mile. (Supplied: National Archives of Australia)\n\nHistory of Golden Mile\n\nAccording to the Eastern Goldfields Historical Society, the history of the Golden Mile dates back to August 30, 1893, when prospectors William Brookman and Samuel Pearce rode into Coolgardie to register the Great Boulder lease.\n\nThey were acting for a South Australian syndicate, and during the remainder of 1893, the pair went on to peg and register a total of 19 leases.\n\nThe term Golden Mile became popular around 1899 and was originally used to describe the mines on the Ivanhoe, Great Boulder, Golden Horseshoe, Chaffers, Hannan's Star and Boulder Main Reef leases.\n\nHaul trucks operating in Kalgoorlie's Super Pit gold mine. (ABC Goldfields: Jarrod Lucas)\n\nIn the 1980s, the late Perth magnate Alan Bond launched a buying spree to consolidate ownership of the Golden Mile leases via a complex series of deals.\n\nBy 1989, Kalgoorlie Consolidated Gold Mines (KCGM) had been formed to mine the Super Pit, then under a joint venture between Homestake and Normandy Mining.\n\nBy 1992, Mr Bond was Australia's biggest bankrupt and the former America's Cup hero was later jailed.\n\nSince open-pit mining began, the Super Pit has swallowed many of the old workings, which comprise more than 3,500km of underground tunnels and shafts.\n\nThe Mt Charlotte mine with the massive Super Pit waste stockpiles in the background. (ABC Goldfields: Jarrod Lucas)\n\nPit wall failure fixed\n\nIn 2017, KCGM — then under ownership of Canada's Barrick Gold and American giant Newmont — poured its 20 millionth ounce of gold.\n\nBut barely a year later and the future of the Super Pit was in jeopardy after two separate rockfall incidents totalling more than 1 million tonnes.\n\nHindsight shows the wall failure was a catalyst to bring the Super Pit into full Australian ownership for the first time in its history.\n\nIn late 2019 and early 2020, Saracen Mineral Holdings and then Northern Star Resources bought 50 per cent shares for more than $1.1 billion each.\n\nAfter less than a year of joint ownership, in which they committed to a cutback to remediate the east wall, the companies completed a $16 billion merger in early 2021.\n\nSimon Jessop says it took 55 months to remediate the Super Pit east wall failure. (ABC Goldfields: Jarrod Lucas)\n\nNorthern Star's chief operating officer Simon Jessop said more than 35 million tonnes were mined during the east wall remediation, which took 55 months until it was completed this year.\n\n\"It was the catalyst for the sale and ultimately, we've just opened up the next decades of mining, so it's massively significant,\" he said.\n\n\"This mine will be going beyond 2050 … in 50 years' time, KCGM will still be in operation.\n\n\"It might be a different operation, it could be a bigger pit again or it could be the underground growth … that's where we see huge life.\"\n\nNick Strong in front of Fimiston Mill, which is set to be commissioned next year. (ABC Goldfields: Jarrod Lucas)\n\nExpansion nearly complete\n\nAccording to Melbourne-based gold consultancy Surbiton Associates, the best year on record for the Super Pit was 2011, when the mine produced 796,000 ounces.\n\nThe mine's peak production for a single quarter was in the March 2010 quarter, with production of 206,000 ounces.\n\nBut Northern Star, which ranks as Australia's biggest gold miner and banked a $1.4 billion net profit last financial year, is eyeing off a much bigger prize.\n\nBy this time next year, the company plans to turn on its new Fimiston Mill after a three-year, $1.5 billion project to replace the old plant, which has churned out gold bars since 1989.\n\nNick Strong has been overseeing the three-year, $1.5 billion upgrade to Fimiston Mill. (ABC Goldfields: Jarrod Lucas)\n\nAbout 600 construction workers have been on site during peak periods, with the new plant to more than double the processing capacity from 12 million tonnes a year currently to 27 million tonnes a year.\n\n\"We know we've got a 30-year mine life ahead of us, or thereabouts, so we're building this plant for the next 30 years — it's a high-quality build,\" KCGM general manager Nick Strong said.\n\nPost-commissioning, the Super Pit is forecast to hit production rates of 900,000 ounces a year during the 2028–29 financial year, and then maintain that rate for the next 10 years.\n\nThat would ensure the Super Pit reclaims its crown as Australia's biggest-producing gold mine, currently held by the Boddington mine in WA's South West after producing 574,000 ounces last financial year.\n\nThe way Northern Star intends to achieve unprecedented production rates is by drawing on 144 million tonnes of low-grade ore stockpiles, which are estimated to contain $10 billion of gold at current prices.\n\nSeven new underground portals have been cut inside the Super Pit. (ABC Goldfields: Jarrod Lucas)\n\nHeading back underground\n\nMining of the Golden Mile has now come full circle, heading back below the surface since the first underground access portal was established on the western wall of the Super Pit in 2021.\n\nAnother seven portals, named after old mining leases such as Croesus, Union Jack and Drysdale, have been installed in the past 12 months.\n\nUnderground exploration is cheaper than drilling deeper holes from the surface, with geologists finding more than 1.2 million ounces in the past year alone.\n\nOf the estimated 14.4 million ounces of reserves yet to be mined at KCGM, 8.3 million ounces are in the open pit and 3.2 million ounces are from underground sources.\n\nDaniel Howe says new underground drilling platforms will allow testing for extensions. (ABC Goldfields: Jarrod Lucas)\n\nNorthern Star's chief geologist Daniel Howe said some of the areas drilled have never been tested, despite more than a century of mining.\n\n\"As we've drilled those areas, we've identified a number of new lodes we didn't know about,\" he said.\n\n\"Obviously there's a big future at the south for the pit, but we certainly see the opportunity in the northern area being underground … and there's plenty more to be had with further drilling.\"\n\nGeologist Gemma Leftley and mining engineer Brianna Reid. (ABC Goldfields: Jarrod Lucas)\n\nNine drill rigs are currently turning underground at the Super Pit and the adjacent Mt Charlotte mine, which has been operating continuously since 1963.\n\n\"We've currently got about nine rigs operating around the clock,\" geologist Gemma Leftley said.\n\n\"At the end of the 2026 financial year, we're probably looking at 14.\"\n\nIt speaks to the level of exploration investment, which this financial year is budgeted at $48 million, while long-term there are plans to realign a 25km-long section of the Trans Australian Railway Line around the Super Pit.\n\n\"We believe there's geological continuity … so move the railway and I'll tell you how much gold's there,\" Northern Star's managing director Stuart Tonkin quipped.\n\nStuart Tonkin says the Super Pit is being set up for the next 30 years. (ABC Goldfields: Jarrod Lucas)\n\nMiner has no regrets\n\nIt is part of a strong belief by many that there is plenty of gold left to be found near the historic Golden Mile, where Mr Hewitt is \"bloody proud\" of his contribution.\n\nBut it came at a significant personal cost.\n\nMany friends died on the job, and there was forced early retirement at 58 with two steel knees, a reconstructed shoulder and severe neck pain evidence of a life on the tools.\n\nGreg Hewitt spent more than a decade as a miner on Kalgoorlie's Golden Mile. (ABC Goldfields: Jarrod Lucas)\n\n\"We went hell for leather every moment of the day,\" he said.\n\n\"When you got out of the cage, you would throw your crib bag up where the cockroaches couldn't get at it and away you'd go to do your job.\"\n\nHe recalls old miners' folklore about a secret tunnel to the cellar of the Boulder Block Hotel, which was famously sold for a reported $7 million to make way for the Super Pit's expansion.\n\nThe other part of that folklore was miners would exchange stolen gold for cash or beer.\n\n\"But I wouldn't know anything about that, cobber — that's just what I was told,\" he said.\n\nGreg Hewitt has become a keen prospector since retiring from mining. (ABC Goldfields: Jarrod Lucas)\n\nThis year's record gold prices have spurred on Australia's big gold miners and small prospectors like Mr Hewitt.\n\nJust before leaving the Super Pit lookout, he reached into his wallet and pulled out a small nugget shaped like a rabbit.\n\n\"And this is what they're chasing,\" he said with a big grin.\n\n\"I could tell you where I found it, but then I'd have to kill you.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/spirit-of-tasmania-iv-arrives-in-hobart-from-scotland/105685256",
    "title": "'She's beautiful': New Spirit of Tasmania ferry arrives in Hobart",
    "publish_date": "Fri, 22 Aug 2025 23:51:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of the new Spirit of Tasmania ships has arrived in Hobart, but it is more than a year away from being ready to ferry passengers and freight between Tasmania and Victoria.\n\nSpirit of Tasmania IV and V have greater capacity for passengers and vehicles than the two aging ships currently in operation.\n\nSpirit IV arrived in Hobart today following a 27,515-kilometre voyage from Scotland, where it had been docked since the completion of construction in Finland.\n\nSpirit of Tasmania IV will have a final fit-out done while in Hobart. (ABC News)\n\nWhile in Hobart, the ships will undergo a final fit-out, which will include Tasmanian-made mattresses, tabletops and artwork.\n\nThe Tasmanian government said Spirit V would remain in Finland until November, when it will need to be moved to another location in Europe to avoid sea ice in Finland.\n\nThe government said the ship would then head to Tasmania in the first half of next year for a final fit-out.\n\nSpirit of Tasmania IV has arrived in Hobart from Finland. (Supplied)\n\nCelebration in Devonport for Spirit IV's arrival\n\nThe new ships require a bigger dock, which is currently being built in Devonport.\n\nBut construction is not expected to be completed until October 2026, meaning the ships cannot operate until then.\n\nSpirit IV near Devonport's Mersey Bluff on its way to Hobart. (ABC News: Meg Fergusson)\n\nOn its way to Hobart on Friday afternoon, Spirit IV stopped off the coast of its future home.\n\nLocals from across north-west Tasmania flocked to Devonport to see the ship.\n\n\"It's costing us so much money and it's come so far, that we really hope it will lift our state and bring plenty of visitors in and pay for itself,\" Chresley Elphinstone said.\n\n\" It's been a shambles, really, but I just hope they've got it all right now — but that port should have been ready a long time ago. \"\n\nKerry Morgan and Chresley Elphinstone of Wynyard watched Spirit IV sail past Devonport. (ABC News: Meg Fergusson)\n\n'Hurricane-force' winds caused new Spirit ships to come loose Photo shows Spirit V resting against tugboat Severe winds have caused one of the two new Spirit of Tasmania vessels to break loose from its outfitting quay at a shipyard in Finland, but the extent of damage is yet to be determined.\n\nDevonport Mayor Alison Jarman was ecstatic to finally see the ship.\n\n\"She's beautiful,\" she said.\n\n\"To see her come out of the mist and be real and for everyone to have a bit of ownership now to say 'she's ours.'\"\n\nFor Ms Jarman, it was a bright moment amid the political turmoil.\n\n\"There's been a lot of angst over the drama of the Spirits,\" she said.\n\n\"This is a real positive, the people are here to celebrate that beautiful ship that is going to make a huge difference to Tasmania.\"\n\n\" Everyone's here, it's a party. \"\n\nSpirit IV will not be operational until a new berth in Devonport is ready, which is expected to be in October next year. (ABC News: Meg Fergusson)\n\nSpirit of Tasmania IV ferry arrives in Scotland Photo shows A news anchorwoman at the start of a package on the Spirit of Tasmania with the words 'Ferry Fiasco' behind her. It'll cost at least $47,534 a week, plus costs, for the Spirit of Tasmania IV to berth in Scotland under a 30-day deal struck by the Tasmanian government.\n\nThe bungled rollout has caused political turmoil in Tasmania, with the infrastructure minister who oversaw the project losing his job over it.\n\nIt was also one of the reasons listed by the Labor opposition for moving a no-confidence motion in Premier Jeremy Rockliff, which led the state to an early election that ultimately saw the re-election of the Liberal government.\n\nLoading...\n\nShip 'beautifully' handled rough journey to Australia\n\nRear Admiral Steve Gilmore, one of the directors of TT-Line, spoke to the ABC over the phone from Spirit of Tasmania IV.\n\n\"We had a real test of the ship and its sea-keeping as we came across the Great Australian Bight in winter,\" he said.\n\n\"She handled it beautifully.\"\n\nFrom Spirit IV, he watched crowds come out in Devonport to catch a glimpse of the ship.\n\n\"What we can see through binoculars is cars parked everywhere, and that's just fantastic,\" he said.\n\n\"Very excited about bringing this ship home.\"\n\nSpirit of Tasmania IV docked in Fremantle en route to Tasmania. (Supplied: TT-Line)\n\nThe government has been trying since 2017 to build the new ships, which were initially slated for completion in 2021.\n\nAmid the delays, costs have skyrocketed. The Devonport berth was originally costed at $90 million but has blown out to $493 million.\n\nBecause the new berth was not ready when the construction of Spirit IV finished, it had to be stored in Scottland — costing Tasmania $4.3 million as of April, which includes fuel, crew and port costs.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/womens-rugby-world-cup-england-united-states-wrap/105688818",
    "title": "England 'will get better' after scoring 11 tries in World Cup opener",
    "publish_date": "Fri, 22 Aug 2025 23:31:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "England might have scored almost 70 points in thrashing the United States in the Women's Rugby World Cup opener, but coach John Mitchell warned there was much more to come from his top-ranked team.\n\nHost nation England's women lived up to their top billing in an 11-try performance, scoring seven of them after the break to win 69-7 over the US in front of a record crowd at Sunderland's Stadium of Light.\n\nThey went over for their first try inside the opening 10 minutes and were comfortably 28-7 ahead at the break, but Mitchell said he asked for more.\n\n\"We challenged them around lifting the intensity in the second half, and I thought we lifted it well,\" he told reporters.\n\nThe Americans did not get close to the England try line after the break as wave after wave of home attack emphasised why they are the team to beat at the tournament.\n\nTheir forward play was powerful, and their backs showed plenty of pace and skill.\n\n\"There is a common saying in rugby that a 'forward decides who's going to win the match, and the backs decide by how much,' and I think the forwards definitely took that approach today in their stride,\" said winger Abby Dowd, who scored one of the 11 tries.\n\n\"The key to a successful team is a platform, and the forwards provided us with that,\" she added.\n\nOminously, former All Blacks coach Mitchell warned: \"There is so much growth to come. We will get better. The tournament will get harder, but we have so much left in us.\"\n\nThe margin of victory, plus the standard of play, will have thrilled the 42,723-strong crowd, which surpassed the previous record of 42,579 at the last World Cup final in Auckland, where England last lost a game.\n\n\"The girls got to experience a brilliant home crowd,\" said Mitchell.\n\n\"It's only the first game. We have set a standard, but also the fans have set a standard, and that is something that we are going to rise to and get bigger and better,\" added fullback Ellie Kildunne, who scored two tries and won the best player award.\n\n\"It's a really good start, and it is just the start,\" she said.\n\nReuters",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/abc-quote-quiz-august-23/105688802",
    "title": "ABC Quote Quiz: Who said it, and what were they on about?",
    "publish_date": "Fri, 22 Aug 2025 23:07:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "They said it. We published it. Can you guess it?\n\nThis week, we farewelled a film star, revisited an Aussie banger and had a close encounter on a golf course.\n\nFrom the jaw-dropping to the eyebrow-raising to the mildly confusing, here are some of the best quotes in the news this week.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/rugby-league-star-returns-after-serious-illness/105643706",
    "title": "Football star returns to field after tackling rare autoimmune disorder",
    "publish_date": "Fri, 22 Aug 2025 22:52:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "At one point, Cameron Vazzoler was recognised as the best rugby league player in regional New South Wales.\n\nHaving won the best and fairest award in the Group 7 Rugby League competition in 2018, the Kiama Knights halfback was named the Country Player of the Year in 2019.\n\nBut just three years later, at the age of 24, his career seemed over after the shock diagnosis of rare autoimmune disorder, Guillain-Barre syndrome.\n\n\"It's a neurological disorder which basically [is] your immune system attacking your nerves which causes in mild cases weakness of the muscles, and in severe cases being paralysed,\" Vazzoler said.\n\nCameron Vazzoler moved to Bega after winning a title in 2019. (Supplied: Kiama Knights)\n\n\" I was in hospital for a week or so, and once I got out of there, I was in a wheelchair. \"\n\nFor the next 18 months he not only stopped playing football but also had to learn to walk again.\n\nA unique comeback\n\nThe diagnosis was shattering for a man used to winning premierships.\n\nCameron Vazzoler raises the premiership shield in 2022. (Supplied: Bega Roosters)\n\nHe played a starring role in breaking Kiama's 34-year Group 7 First Grade title drought in 2019, then moved to Bega in search of more success.\n\nHe led that club to its first title in eight years in 2022, before confronting the reality that his career might be over.\n\n\"It's such a rare and unique disorder, so there was not too much information on it,\" he said.\n\n\"It was hard to get clear answers off physios and doctors on how long the recovery would be because it was such a unique thing.\n\n\"Obviously being quite young, that was tough down there, but I got through it with the support of my family and friends.\"\n\nVazzoler approached his recovery with a simple goal in mind and returned to the field for the Bega Roosters last season.\n\nCameron Vazzoler has returned to the game after recovering from a serious autoimmune disease. (ABC Illawarra: Tallon Smith)\n\n\"[It] took time and a lot of hard work, but I'm just grateful to be where I'm at now,\" he said.\n\nCoach praises recovery\n\nThree years after his diagnosis, Vazzoler is back at his old club in Kiama, and eyeing another premiership.\n\nKiama first grade coach Matt O'Brien said it was pleasing to see his playmaker back on the field.\n\nVazzoler's Kiama Knights are second on the Group 7 ladder. (ABC Illawarra: Tallon Smith)\n\n\"I think firstly it's just good to see him back happy and healthy, regardless of how he is playing at the moment, he seems pretty settled [and] enjoying it, that's probably the main thing,\" O'Brien said.\n\n\"If it's something you have done all your life and you've had a lot of success doing … to have that taken away from you, I would imagine would fuel even more competitiveness in him to get back being at a level where he's able to enjoy it.\n\n\"Footy's always been a part of his life, and this is a new chapter of it.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/wa-community-groups-slams-feedback-report-for-burswood-racetrack/105408378",
    "title": "Burswood racetrack row deepens amid public feedback 'spin' accusations",
    "publish_date": "Fri, 22 Aug 2025 22:37:31 +0000",
    "category": "sports",
    "authors": [],
    "text": "A community group has accused the WA Government of \"spinning\" the results of public feedback on a proposed community hub and racetrack in Burswood, contradicting the government's claims it has \"significant\" public support.\n\nThe $217 million development is set to include a 20,000-seat music bowl, function centre and motorsport circuit at Burswood Park and was a pre-election commitment.\n\nA press release marking the end of the first part of the public consultation period claimed \"76 per cent of all contributions provided positive ideas towards the project\".\n\nBut Save Burswood Park Alliance co-chair Dr Robyn Harvey said that was a disingenuous framing of the data.\n\nShe said the feedback form offered no option for rejecting the development, instead asking for ideas.\n\nRobyn Harvey said the results were not an accurate reflection of community sentiment. (ABC News: Courtney Withers)\n\n\"The online feedback did not allow you to simply say 'no' … so [the public] were saying things like 'more trees', 'look after the wildlife', 'we want an urban forest',\" Dr Harvey said.\n\n\"So yes, there were lots of positive comments, but they certainly didn't feed into the idea that we wanted a motor racing track.\n\n\" They're spinning it. \"\n\nShe said data collected by her group suggested an overwhelming majority of people were against the new development.\n\nSome of the feedback provided during the community drop-in sessions. (ABC News: Courtney Withers)\n\n\"We took photographic evidence and screenshots of the online and drop-in feedback every day … 85 per cent of respondents on the online feedback said 'no racetrack',\" she said.\n\n\" At the drop-in centres it was even more, it was 98 per cent of post-it notes said 'no racetrack'. \"\n\nAccording to the government's Perth Entertainment and Sporting Precinct report, there were 672 contributions via the online consultation platform.\n\nThe state government said the racetrack would only be used once a year. (Supplied: WA Labor)\n\n\"In summary, stakeholders offered significant support for the PESP with the majority recognising opportunity for their industry, association or group and identifying with the wider vision for the precinct,\" the report said.\n\n\"Opposition to the development centred around the use of the precinct for motorsport.\"\n\nResponse 'quite positive'\n\n'Rita's racetrack' divides opinion Photo shows WA Premier Roger Cook smiles as he sits in a racing car. The WA government's controversial $217 million plan to build a street motorsport circuit at Perth's Burswood Park has incurred the wrath of many — and don't dare call it a motorplex.\n\nParliamentary secretary to the Premier, Daniel Pastorelli, who has been involved in community drop-in sessions about the proposal, said the \"positive ideas\" received complemented the government's proposal.\n\nThese included support for more hospitality venues, an urban forest and more trees.\n\n\"Things like more hospitality venues on the peninsula, things like an urban forest, people definitely want more trees in the park area,\" Mr Pastorelli told ABC Radio Perth.\n\n\" Overall, the response that we've received has been quite positive. \"\n\n\"Obviously, some of the local residents are concerned about the motorsport element of the project, there's no doubt about that, and we understand that completely.\"\n\nMr Pastorelli said initial public concerns about the project were due to \"misconceptions\" the motorsport track would be used frequently, but he said it would only host a \"one-off annual event\".\n\nThe proposal has faced pushback from residents and advocates of green space, and from the WA Liberal leader Basil Zempilas, who has previously labelled the project a \"wasteful\" use of taxpayer dollars.\n\nBasil Zempilas described the proposal as \"wasteful\". (ABC News: Phoebe Pin)\n\nDr Harvey said she was opposed to the destruction of an inner-city green space.\n\n\"Even if they're not racing on it [the race track], it destroys the park,\" she said.\n\n\" The urban forest that they suggest is something they will look at, there is no room for it, where will it go? \"\n\nBut Mr Pastorelli insisted the consultation had been \"a constructive process\" with many ideas advanced \"that may be added to the project as we progress\".\n\nA submission for the project is due to be made to the Environmental Protection Authority in coming weeks, and site investigations were underway.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/josh-willie-tasmanian-labor-policy-position-analysis/105686092",
    "title": "Long road back for Tasmanian Labor under Willie must start now",
    "publish_date": "Fri, 22 Aug 2025 22:16:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listening to Labor Leader Josh Willie's first media interviews, you'd be forgiven for thinking little had changed.\n\nJobs are the main item of the day, he does not want to budge on salmon or greyhound industries — and he's still keen on the controversial Macquarie Point stadium.\n\nBut there are subtle shifts in his language that suggest a change in the party's direction.\n\nWho is Josh Willie, new leader of Tasmanian Labor Photo shows A man smiling in a suit, walking into a room full of people. Joshua Barton Willie, a 41-year-old former primary school teacher, is the new leader of Tasmanian Labor — tasked with trying to engineer a party comeback after yet another election loss to the Liberals.\n\nFirstly, the number of times Mr Willie said something along the lines of \"we've just had one of the worst results in our history\".\n\nUntil now, Labor has barely acknowledged how badly it lost the last election. Rather than taking a look in the mirror, it picked back up and decided to have another shot at government.\n\nThis time, instead of trying to woo voters, Labor set its eyes on the crossbench.\n\nThe result was the same — a resounding rejection.\n\nMr Willie knows that, and he wants Tasmanians to know he knows.\n\nAfter all, you can't be serious about changing if you're not acknowledging there is a problem.\n\nJosh Willie (standing) has been careful not to criticise his predecessor Dean Winter (seated at left). (ABC News: Ebony ten Broeke)\n\nFor the record, in his first interview since losing the leadership, Dean Winter said he took \"full responsibility\" for the outcome of the election, acknowledging it wasn't good enough.\n\nBut back to Mr Willie.\n\nNew Labor leader Josh Willie outlines party vision Photo shows A man and a woman in an outdoor environment. New Labor Leader Josh Willie says his party needs to \"pause and reflect\" on its historically bad election result and \"do the hard work to earn Tasmanians' trust\".\n\nHe might not have gone as far to suggest that the first no-confidence vote — that ultimately led to an early election and Mr Winter's demise — was a mistake.\n\nBut when asked if it was a mistake, he simply said, \"there is no shortcut to government\".\n\nA lot could be read into the lack of defence.\n\nHe gave that same answer when asked if he would move another no-confidence motion.\n\nWhile he might not be ruling it out, it seems that one is not on the cards anytime soon.\n\nWas Labor Liberal-lite?\n\nSo, where does Mr Willie think Labor went so wrong?\n\nWhile he has been careful not to criticise his predecessor, Mr Willie was quick to say the party needs to \"differentiate ourselves from the Liberals\".\n\nTasmanians weren't ready for this election. Neither were their leaders Photo shows Two men at press conferences wear suits and stand outside. With the fourth election in seven years almost upon Tasmania, one thing is certain — more is needed from politicians to ensure good government is the norm, not the exception.\n\nIt is a criticism that was thrown at Dean Winter's Labor by the crossbench; that it is Liberal-lite, that it was just backing in the Liberals and it was the crossbench that was the \"true opposition\".\n\nThese criticisms were largely related to the party's support of the stadium.\n\nThe crossbench appeared to overlook the fact it was Labor that introduced industrial manslaughter laws and backed in various pieces of Greens' legislation.\n\nStill, it seems Mr Willie may feel some of that criticism is warranted.\n\n\"We need to do the policy work to present a viable alternative that is different to the Liberals,\" he said.\n\n\" There is a lot of work to be done there. \"\n\nMr Willie has flagged a return to focusing on Labor's traditional core issues such as health, housing, cost of living and education. (ABC News: Luke Bowden )\n\nJobs, jobs, jobs\n\nLabor, under Mr Winter, reasserted itself as the party of jobs; something Mr Willie said was the right thing to do.\n\nIt spent most of the time talking about said jobs, the economy and the Spirit of Tasmania debacle.\n\nThe latter was a true triumph. Labor deserves all due credit for uncovering one of the state's biggest infrastructure stuff-ups and keeping the government accountable.\n\nLabor targeted the government over its handling of the Spirit ships replacement project, but it wasn't enough to sway voters. (Supplied: TT-Line)\n\nThose jobs it talked about, though, were jobs in the mining industry, salmon, forestry, construction, etc, echoing 1960s-era Labor.\n\nThat is something Mr Willie has acknowledged without quite being that harsh.\n\nHe has been careful to say that, yes, Labor does stand for \"traditional\" jobs, but it is the party for all workers.\n\n\"We need to make sure we're doing both,\" he said.\n\n\"We can talk about the economy, the opportunities, we can recognise the Tasmanians who are contributing in their jobs across the economy and we've always supported traditional industries. That's not going to change.\n\n\"But there are many people in service industries, in healthcare, education or people working in our Tasmanian success story, which is tourism and hospitality or new industries like startup and IT.\n\n\"You'll see me talking a lot across the economy and recognising the contributions of Tasmanians.\"\n\nMr Willie also seems aware that until the election, Labor spent little time talking about its core issues of health, housing, cost of living and education, only to try and reclaim them during the election.\n\nThe fact he has been regularly bringing those areas up as things he wants to focus on suggests he's aware they did not get the love they needed until too late.\n\nIndependent Kristie Johnston (centre) was scathing of Labor's unwillingness to work with the crossbench. (ABC News: Ebony ten Broeke)\n\nA will to work with the crossbench\n\nAfter Labor successfully passed its bill to introduce Industrial Manslaughter Laws last year — against the Liberal government's wishes — it seemed like the floodgates might open.\n\nThere was a world in which Labor, and a largely progressive crossbench, combined to bring in a lot of their own legislation. It is worth noting, some won't view this as ideal given their limited resources.\n\nBut Mr Winter was very clear that he did not want to govern from opposition.\n\nCrossbenchers Peter George and Craig Garland also spoke of their frustrations with Dean Winter-led Labor's intransigence. (ABC News: Ebony ten Broeke)\n\nMinority Tasmanian Liberals watch on as Greens, Labor get bills up Photo shows A man with grey hair seated in parliament looks sad Chinks in Tasmania's minority government armour are appearing, as The Greens and Labor passed two consecutive bills through the lower house against the government's wishes.\n\nIndustrial manslaughter was the last Labor bill the 51st parliament saw, although Labor did go on to support several pieces of Greens legislation.\n\nMr Willie has pointed out that by refusing to support its motion of no confidence in Liberal Premier Jeremy Rockliff — and confidence in Labor's Dean Winter — it chose a Liberal government by default and they \"have to take some ownership\".\n\nHowever, he also said there were opportunities to collaborate with the crossbench on issues where they have common ground. Pointing to integrity and transparency, in particular.\n\nIt seems whether the Liberals want it or not a stronger Integrity Commission might be on the way. Though the problem of funding is one only the government can address.\n\nThere is certainly an argument for not \"governing from opposition\".\n\nThere's also the limited resources and lack of access to treasury.\n\nIn the previous parliament, Mr Willie was tasked with attacking the Liberals' budgets. (ABC News: Jake Grant)\n\nAnother argument is the risk the public might feel they can have it both ways, with the Liberals in charge and Labor still getting progressive reforms through.\n\nOn the other hand, if Labor is trying to reassert itself as more progressive than the Liberals who passed a few pieces of progressive legislation that they were not so keen on, it may serve as a reminder that (greyhounds and salmon aside) Labor's core values are far more progressive than the Liberals.\n\nEven under Mr Rockliff.\n\nFinding a way to win back the voters\n\nLoading...\n\nOn his first day out as leader, Mr Willie said Labor needed to \"pause and reflect\" to understand why people aren't voting for them.\n\nSo, don't expect the party to be rushing out with new policies any time soon.\n\nSome people might be after a more drastic shift.\n\nMaybe that will happen in time, but if it's serious about earning back the trust of Tasmanians, it would do better to take stock, listen and learn, to make sure those shifts are the right ones.\n\nThe election result alone shows there are a lot of lessons to be learnt.\n\nLabor did learn and change after the 2024 election, but it seems that change was not the one the electorate wanted.\n\nForestry remains a contentious issue in Tasmania. (Supplied)\n\nStuck between traditional industries and voters who would like to see the end of things, like native forestry and greyhound racing, the party is always going to have a tough time.\n\nBut while majority government may not be in its future any time soon — given Hare-Clark and the many progressive independents and parties eating into its vote — it should be able to improve and pick up seats.\n\nThis time around, it seems, Labor wants to play the long game.\n\nIt will once again try to redefine who it is, but maybe after getting it a little wrong for far too long, the party will find that sweet spot and get it right.\n\nFor now though, what right is, is unclear.\n\nThat's up to Mr Willie to figure out.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/australian-black-truffles-fetch-3500-dollar-per-kilo-price-tag/105657814",
    "title": "Demand for truffles continues to climb despite $3,500 per kilo price tag",
    "publish_date": "Fri, 22 Aug 2025 22:12:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "There is no doubt that truffles can be expensive, selling for up to $3,500 per kilogram.\n\nBut the price has not put customers off, with producers experiencing heavy demand this season.\n\nThe rare fungus that grows among the roots of certain trees is prized by chefs worldwide for its distinctively earthy, musky aroma and rich umami flavour.\n\nThey are usually sold by the gram and typically shaved paper-thin over dishes like pasta, risotto and eggs.\n\nAnthea Harrison and truffle-sniffing dog Odin look for truffles on their farm near Mount Gambier. (ABC South East SA: Elsie Adamo)\n\nDespite their black lumpy appearance, growers say their expense comes from their rarity and limited fruiting season.\n\n'Every truffle is a miracle'\n\nAnthea Harrison has grown black truffles at Echo Farm on the outskirts of Mount Gambier for the past three seasons.\n\nWhile the first two seasons were fruitful, ongoing dry conditions across South Australia this year have resulted in truffles being harder to find.\n\n\"Every truffle is a miracle … and it's times like this that make you really appreciate that miracle,\" Ms Harrison said.\n\nShe said truffles required a delicate balance of factors to grow, including good-quality soil, warm summers, cold winters, and the right amount of rain and winter frost.\n\nAnthea Harrison checks her orchard's soil for the scent of truffles. (ABC South East SA: Elsie Adamo)\n\nAnd even then, the fungi can still be temperamental.\n\n\"A farmer can put their heart and soul, and they usually do, into preparing the orchard and doing everything right … and even when you do all that, there is no guarantee,\" Ms Harrison said.\n\nThe business has not unearthed enough truffles this season to sell and will need to rely on profits from the previous year, along with other business activities, to get by.\n\n\"If there's any takeaway from this year it's that the price of truffle is justified,\" Ms Harrison said.\n\nPricing truffles\n\nWhile they are a sought-after delicacy, the luxury produce is also priced at a premium due to the high overhead involved.\n\nIt is also a costly business to get into, which limits the supply of truffles, according to truffle grader and expert Simon Friend.\n\nManufactured truffle flavour 'misleading' Photo shows A man and woman hold dogs in their arms As demand for truffle flavour grows, the industry fears most people are not getting the real deal.\n\n\"The pricing of truffles in the world today is predicated largely by supply and demand,\" he said.\n\nInitial costs can enter the hundreds of thousands of dollars to buy inoculated trees and prepare the soil, often with many tonnes of agricultural lime.\n\nOngoing management is also costly, with close and regular management required throughout the year.\n\nAnd you cannot find any truffles without a specially-trained truffle-sniffing dog, which can cost up to $30,000.\n\nEcho Farm saved money on hiring or buying a truffle dog by training their resident dog Odin to sniff out the treasures. (ABC South East SA: Elsie Adamo)\n\n\"The capital outlay is significant before you even think about getting your first truffle,\" Mr Friend said.\n\nThe high overheads, combined with the aroma, freshness, size and taste of the produce, are what Mr Friend considers when pricing truffles.\n\nThey are best used within days after being purchased before they lose their quality.\n\n\"They are worth their price because they're unique and they're fleeting,\" he said.\n\nStrong demand\n\nAdelaide Hills truffle farmer and Australian Truffle Industry Association president Katherine Faull said, unlike Ms Harrison, she had experienced a more successful season, even harvesting a record crop.\n\nThe most commonly grown truffle in Australia is the French Black variety grown in WA, SA, Vic, Tas, NSW and the ACT. (ABC Central West: Emily Middleton)\n\nDue to South Australia's ongoing drought conditions, Ms Faull's orchard relied on precision monitoring and irrigation this season.\n\nDespite premium prices for buyers, Ms Faull said demand for her truffles had been \"through the roof\".\n\n\"We have, to an extent, struggled to keep up with demand,\" she said.\n\n\"It's becoming more common for South Australian chefs to put truffle on their menu because they know that they can source truffles locally now, which is really exciting.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/shortage-of-male-teachers-impacting-classroom-diversity/105673820",
    "title": "In a male teacher drought, Ryan is an endangered breed",
    "publish_date": "Fri, 22 Aug 2025 22:08:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ryan Brown never saw primary school teaching as even a remote career path, but now believes he's found his \"calling\".\n\n\"I can't express how fun it is, how rewarding it is,\" he said.\n\n\"I've found something I'll do for the rest of my life, and having done a bunch of other jobs, I'm so glad I found it.\"\n\nBut Mr Brown is a rare breed — one of just two male classroom teachers at his Canberra primary school.\n\nFor the majority of his Year 5 students, it's the first time they have ever been taught by a man.\n\nFor many of his students Ryan Brown is the first male teacher they've ever had. (ABC News: Lily Nothling)\n\n\"This is not an easy option for a job as a male — you really have to be able to relate to children … and I think sometimes men struggle to be vulnerable,\" he said.\n\nThe proportion of male educators in Australia has been falling for decades.\n\nMen now represent just 17.6 per cent of primary school teaching staff, and 38.5 per cent of high school teachers.\n\nWithout steps to remedy the disparity, researchers say those numbers will continue to dwindle.\n\nWhat's driving the decline?\n\nEducation researcher Kevin McGrath from the Australian Catholic University said the declining trend was the result of two key forces.\n\n\"Firstly, there is a large economic factor, and that is, on average and compared to women, men can earn more in other industries,\" Dr McGrath said.\n\n\"Second, there are social expectations around who belongs in the teaching profession — teaching is often associated with stereotypical traits of being caring and nurturing.\"\n\nRyan Brown says teaching can be a challenging job for men if they struggle being vulnerable. (ABC News: Lily Nothling)\n\nAnd there are fears that recent explosive allegations of abuse within the childcare sector will also act as a deterrent for male educators.\n\n\"A female teacher can hug their students for comfort,\" Mr Brown said.\n\n\"[In my class] you're not allowed to hug Mr Brown — high-fives only.\n\n\"The relationships are different.\"\n\nMen now represent just 17.6 per cent of primary school teaching staff, and 38.5 per cent of high school teachers. (ABC News: Lily Nothling)\n\nAssociate Professor Matthew Brown from the University of Canberra's education faculty said the pervasive undervaluing of teachers also played a major part.\n\n\"If you've got society basically not rewarding and not recognising the value of teaching as a profession, then young people, men, boys, will be thinking, 'Well, I'll go into another profession',\" he said.\n\nThat rings true for Ben Weir, who is accustomed to people questioning his decision to become a high school maths and science teacher.\n\n\"Particularly to men … [it's seen as] a lesser career, one that you're choosing by sacrificing other careers you could be having,\" the Canberra student said.\n\nTeaching student Ben Weir says he's used to people asking why he decided to become a high school maths and science teacher. (ABC News: Lily Nothling)\n\n\"That was really something that was prominent in my undergraduate degree — 'you have all this potential and you're only using it to teach'.\"\n\nWhy we should care\n\nExperts agree that having more diversity in the classroom benefits both students and staff.\n\nAs schools grapple with staff shortages, Dr McGrath said finding ways to attract more men into the profession should be part of the solution.\n\n\"It's unlikely that we can address the teacher shortage that we experience here in Australia while such a significant portion of the population fails to see teaching as a suitable career choice,\" he said.\n\nDr Kevin McGrath says attracting more men to teaching should be part of the solution to school staff shortages. (ABC News: Simon Avery)\n\nHe said Australia's failure to address the decline of male teachers was a glaring gap in its gender equality goals.\n\n\"Boys and girls have both told us in research that they would like to be taught by both men and women,\" Dr McGrath said.\n\n\"For boys, it's important that they see teachers who they perceive understand them.\n\n\"For girls … they tell us that having male teachers is important for them because the absence of male teachers actually contributes to their anxieties around interacting with men more broadly.\"\n\nHe said research also showed job satisfaction among female teachers was higher in schools with a greater gender balance.\n\nAssociate Professor Brown says the pervasive undervaluing of teachers plays a major part in the male teacher shortage. (ABC News: Lily Nothling)\n\nAssociate Professor Brown said it was important for students to be exposed to more men in both caring and leadership roles.\n\n\"We need more men in the teaching workforce so that we can allow children and young people to see positive role models for men,\" he said.\n\nCan the trend be reversed?\n\nDr McGrath said a range of initiatives to attract men to teaching, including scholarships and gender targets, had been floated or trialled over the years.\n\n\"These have either been blocked by union groups or dropped when there has been no progress or no quick wins that have been made,\" he said.\n\nHe said it was time to revisit those ideas — and commit to them long-term.\n\n\"Scholarships for people considering a career in teaching are actually the single most effective recruitment initiative that we could use,\" he said.\n\nIn a statement, Australian Education Union president Correna Haythorpe said the union supported scholarships, placements and development opportunities for \"all aspiring teachers\".\n\nAustralian Education Union president Correna Haythorpe says the union supports scholarships, placements and development opportunities for \"all aspiring teachers\". (ABC News: Sean Warren)\n\n\"We have a teacher shortage crisis and fixing the underlying issues in the profession is the best way to improve diversity and bring more men, and more people generally, into teaching,\" Ms Haythorpe said.\n\n\"Reducing excessive workloads, ensuring competitive pay and conditions, providing high-quality professional development, and guaranteeing appropriate mentoring and career support are some of the changes that will encourage more people — including men — to consider teaching as a long-term career.\"\n\nAssociate Professor Brown said there was no quick fix to increasing the number of male teachers, but said reframing the conversation was essential.\n\nAssociate Professor Brown says there's no quick fix to resolve the male teacher shortage. (ABC News: Lily Nothling)\n\n\"This particular problem took decades to create and it's going to take some time, possibly decades, to repair,\" he said.\n\n\"If we value teaching, men will come back to teaching.\n\n\"It's not that we need fewer women — we need the same number of women, if not more women. And now we need more men.\"\n\nRyan Brown says the shortage of male educators means boys are less likely to see teaching as a potential career path for their future. (ABC News: Lily Nothling)\n\n'Maybe I would have found it sooner'\n\nBack in the classroom, Ryan Brown said his situation was a simple case of you cannot be what you cannot see.\n\n\"It took me so long to figure out I wanted to be a teacher, whereas if it had been more common or if more people had stated this was an option for me, maybe I would have found it sooner,\" he said.\n\n\"Some of my students — and it's very sweet — talk about how they want to be teachers, and I don't know if the boys would've said that before they had me as a teacher.\"\n\nTeaching student Ben Weir says he's eager to start his full-time teaching career. (ABC News: Lily Nothling)\n\nBen Weir is eager to start working in the classroom full-time next year as he completes his teaching program.\n\n\"Through the work I'm doing as a learning support assistant, you're really seeing how a male role model for these students is really important,\" he said.\n\n\"[I want to be] someone they can talk to and relate to and see how being a male in a community or a society, you should really conduct yourself and treat others.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/cricket-jess-jonassen-four-sixes-the-hundred-ellyse-perry/105688752",
    "title": "Jonassen creates cricket history with power-hitting display in The Hundred",
    "publish_date": "Fri, 22 Aug 2025 21:39:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jess Jonassen has produced a sensational display of six-hitting, the Australian all-rounder becoming the first woman to hit four maximums in a single five-ball \"over\" in England's premier white-ball competition, The Hundred.\n\nWith a supreme all-round display, as she also snaffled three wickets with her spin, the player-of-the-match heroics from Jonassen also finally gifted the struggling Welsh Fire their first win of the campaign and ended the hopes of Ellyse Perry's Birmingham Phoenix to reach the play-offs.\n\nFellow Aussie star Perry finally found some form after a disappointing campaign by her lofty standards as she fired her first half-century of the tournament, but it was nowhere near enough to eclipse the brilliance of 32-year-old Jonassen, whose 44 off 17 deliveries and 3-24 off 20 balls set up the Fire's 36-run win.\n\nJonassen has lost her place in the international team but has shown in the Fire's last two matches just why she is still such a force in the women's game with her big hitting and crafty bowling.\n\nHer big moment came with 10 balls left of the Fire's innings when she took a fancy to the spin of Hannah Baker.\n\nAfter Hayley Matthews (34 not out) had taken a single off the first of the five-ball set, the Australian clouted the next four for sixes, the first two of which saw her nearly caught on the boundary.\n\nThe 25 runs off Baker's set was a record in the women's Hundred.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Can't say I'd be on the top of anyone's list to achieve that,\" smiled Jonassen of her landmark feat, though those who watched her clean hitting for Brisbane Heat in their WBBL final near-miss might beg to differ.\n\n\"Not too bad to be fair. I got a little bit of luck with the bat, kind of muscled a few, but I'm really pleased we finally got some points on the board,\" she added, reflecting on her narrow escapes.\n\n\"I just really wanted to take the game on, particularly in those last 10 balls — and it doesn't matter how far over the rope they go!\"\n\nAnother Australian international, Megan Schutt, finally got her out but Jonassen's late impetus, with three fours to go with her quartet of sixes, dragged the Fire to 3-150 after Sophia Dunkley had kicked off their innings with a half-century.\n\nPerry's Phoenix had to win to keep their tournament hopes alive but Jonassen struck the key blow to bamboozle and bowl her charging compatriot Georgia Voll, who had raced to 29 off 18 balls.\n\nPerry had to effectively play a lone hand with her 55 off 43 balls, featuring seven fours and a six, but it proved to be in vain.\n\nThe defeat sent Phoenix to the bottom of the table as the Fire leapfrogged them. \"She's been amazing the last couple of games — with 4-10 in her last game nearly dragging us back into it, and now such a great show of hitting,\" said Fire captain Tammy Beaumont of Jonassen's display.\n\nAAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/vic-calls-for-beveridge-station-as-population-grows/105688064",
    "title": "'Deliver it now': Outer suburbs councils call for new stations to ease choked roads",
    "publish_date": "Fri, 22 Aug 2025 21:36:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "The mayor of an outer Melbourne community is calling on the state government to urgently fund a train station in his growing community, where just 1.2 per cent of people regularly catch public transport.\n\nBeveridge, at the northern edge of Melbourne’s growth boundary, is set to boom.\n\nCouncil data shows the area is already home to about 11,000 people, and that's expected to double in the next five years.\n\nEarlier this month, the state government also approved plans for a new suburb, Beveridge North West, which will see a further 47,000 residents move in by 2052.\n\nBut Mitchell Shire Mayor, John Dougall, is scathing of the level of infrastructure investment he sees from the state government to support his growing community.\n\n\"We’re still waiting for the basics,\" he told a forum of Outer Melbourne Councils in South Morang.\n\nCouncil data shows just 1.2 per cent of people who live in Beveridge catch public transport.\n\n\"And it’s not because they don’t want to, it’s because they can't,\" he said.\n\nHe urged the state government to fund a train station at Beveridge, where the Seymour Vline train passes land that is \"shovel-ready\" for the station.\n\n\"This is our chance to get it right,\" he said, urging the state government to build the station now, before more residents move in.\n\nBeveridge resident Scott Reid says he doesn't trust public transport to get him to work on time. (Supplied)\n\n\"Beveridge station is a test: deliver it now, not in 10 to 15 years,\" he said.\n\nScott Reid is one of the 98.8 per cent of Beveridge residents who don’t regularly use public transport.\n\n\"I try to avoid PT like the plague just because I’ve heard far too many stories about services being cancelled,\" he said.\n\nHe said the daily commute to work in Clifton Hill takes about 40 minutes if there’s no traffic, but it can take up to an hour and a half, if the Hume Freeway is busy.\n\n\"We’re funnelling people into a car park,\" he said.\n\nHe recently went to pick up the kids from school, but got stuck in traffic at the freeway overpass.\n\n\"It took me half an hour to go 2 kilometres,\" he said.\n\n\"I was fuming. I could walk faster.\"\n\nHe said the state government should fund a train station in Beveridge, to give people options.\n\n\"It’s well and truly overdue, having a decent method for myself and my kids to get in and out of the city, in and out of Wallan, proper infrastructure in place,\" he said.\n\nOnce developed, Beveridge North West is expected to add 47,000 residents to the region. (ABC News: Kyle Harley)\n\nCalls to improve outer suburban public transport\n\nCongested roads and a lack of reliable public transport options were common themes of the meeting of Outer Melbourne Councils in South Morang, in Melbourne’s outer north.\n\nMayor of the Yarra Ranges Shire, in the outer east, Jim Childs, called on the government to build an extra train station between Mooroolbark and Lilydale, where a new development at Kinley will create an extra 3,000 homes.\n\nThat would mean duplicating the tracks between the two existing stations, which were first built in the 1890s.\n\n\"We’ve got to get this infrastructure correct,\" Cr Childs said.\n\n\"The infrastructure is not there to get all the cars off the roads.\"\n\nPopulation boom puts pressure on transport\n\nIn the city’s west, Melton is the fastest-growing local government area in Australia, with an annual growth rate of 6.5 per cent, well above the state average of 1.9 per cent.\n\nThe council’s manager of city strategy, Travis Conway, said access and transport is the number one issue people raise with the council.\n\n\"We have a population growing day by day, and using largely one road – the Western Highway,\" he said.\n\nThat was illustrated this week in Thornhill Park, where a road upgrade means the only local road connecting the community to high schools and the train station will be shut until December – forcing locals onto the freeway for every school drop-off and pick-up, adding up to 45 minutes each way.\n\nJust to the south, Wyndham’s population is growing at 4.3 per cent a year, making it the sixth fastest growing area in Australia.\n\nDean Ellis, Wyndham’s coordinator of transport planning, said electrifying the train line should be a priority, so commuters aren’t relying on Vline diesel trains.\n\n\"Six-to-nine car trains don't cut it when it comes to growth corridors,\" he said.\n\nHe pointed out Tarneit train station is the second-busiest Vline station in Victoria, with nearly 1.5 million annual entries.\n\nMelbourne’s Southern Cross tops the list with nearly 6 million entries, while Geelong station recorded 969,600 annual entries.\n\n\"People can't get on the train,\" he said.\n\nIn Melbourne’s north-east, Nillumbik Shire is not predicted to grow as much as other outer councils, but mayor John Dumaresq said the area still struggles with access to transport, particularly buses.\n\n\"Right now, transport gaps are closing down peoples' lives,\" he said.\n\nHe said increasing access to public transport, particularly for young people and the elderly, is critical to connecting communities and keeping roads free from congestion.\n\n\"There's thousands of trips being made in cars that don't need to be made,\" he said.\n\nMitchell Shire Mayor, John Dougall, says his community would catch public transport if it was available.\n\nPresident of the Public Transport Users Association, Tony Morton, said increasing the frequency of bus services is critical.\n\n\"We have a lot of examples of lines on a map for bus lines that sometimes only come every hour or every half-hour,\" he said.\n\n\"That's when you get people looking at the service and saying, 'this is not providing a viable alternative to my car'.\"\n\nParliamentary Secretary for Transport, Josh Bull, told the forum the government is delivering \"a long list of projects\" that will help ease congestion in Melbourne, including the Metro Rail Tunnel, due to open later this year.\n\n\"It’s about unlocking a rapidly growing city and state,\" he said.\n\nHe added big projects, like the Suburban Rail Loop, take time.\n\n\"I wouldn't want to be standing here in 30 years' time and saying, 'if only we'd done that',\" he said.\n\nThe opposition's Richard Welch said Victoria is \"already behind schedule\" when it comes to infrastructure planning.\n\n\"The population is growing on the fringes, and you do not have the infrastructure,\" he said.\n\nBack in Beveridge, John Dougall said the community is still angry the state government approved a quarry as part of the new precinct structure plan.\n\nHe said, along with a new sports field, a train station would be one way to give back to the community.\n\n\"The quarry has pushed the community in Beveridge to the edge,\" he said.\n\n\"For us, Beveridge train station would be an appropriate return for underpinning that infrastructure development.\"\n\nThe ABC has contacted the Victorian government for comment.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-23/tennis-destanee-aiava-qualifies-us-open-main-draw/105688720",
    "title": "Stirring scenes as Aussie qualifier Aiava books US Open spot in thriller",
    "publish_date": "Fri, 22 Aug 2025 21:28:45 +0000",
    "category": "sports",
    "authors": [],
    "text": "Destanee Aiava's breakthrough tennis year has reached another peak, with the battling Australian making it through US Open qualifying, ensuring she will play in the main draw for the second year in a row.\n\nWhile teenage hope Emerson Jones again found the going too hot in her final-round qualifying match at Flushing Meadows, 25-year-old Melburnian Aiava came through a deciding match tiebreak to defeat rising German Emma Seidel 5-7, 6-1, 7-6 (10-6).\n\nIn an absorbing two-and-a-half-hour duel, Aiava was left emotional after making it to her third grand slam of the year.\n\nShe was up against it in her third match of the week, facing the 20-year-old world number 105 Seidel, who was 63 places higher on the WTA computer and looked poised to confirm her rankings superiority after taking the first set.\n\nBut Aiava responded to reel off five straight games to take the second set and, when the decider proved a tight affair, she twice served successfully to stay in the match.\n\nAiava then held her nerve better in the decisive first-to-10-points breaker, serving down her 10th ace before Seidel double-faulted to gift her third three-set victory of the week.\n\nIt was another hugely encouraging moment for the woman who had earned such admiration in Melbourne in January when she talked of how she had to battle with borderline personality disorder (BPD) on her way to her best-ever grand-slam display.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nShe eventually bowed out in the second round there after giving feisty 10th seed Danielle Collins plenty of trouble in another three-setter.\n\nEarlier, 17-year-old Jones, who had also failed to get through the final round of qualifying at Wimbledon, had found Andorran world number 132 Victoria Jiménez Kasintseva too tough a hurdle as she succumbed 7-5, 7-6 (9-7).\n\nThe Gold Coast youngster, currently the world's number two junior and now up to 199 in the rankings, had her chances, having led 5-3 in the opening stanza before also battling back to earn four set points in the second-set breaker.\n\nBut the 20-year-old Andorra held tough to win from 6-3 down in the breaker.\n\nPriscilla Hon also advanced to the main draw, defeating Belgium's Hanne Vanderwinkel 6-3, 6-3. However, James Duckworth and Jason Kubler were both eliminated.\n\nAAP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/no-you-re-not-imagining-it-that-round-shiny-thing-in-the-sky-is-the-sun-20250821-p5morn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "No, you’re not imagining it. That round shiny thing in the sky is the sun",
    "publish_date": "Sat, 23 Aug 2025 11:10:45 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "There’s a saying, mostly attributed to the Germans, that goes “there’s no such thing as bad weather, just inappropriate clothing”.\n\nI was contemplating this last week when, in my harried preparations to leave the house for the office, I reached for my gumboots. “Ha,” I thought, “I’ve got this wet weather thing sorted.”\n\nLike most Sydneysiders, I’m glad to see the back of this “rain event” which, the Bureau of Meteorology reports, has resulted in four or five times the usual dump of water for this time of year. Instead of an average of 80 millimetres for the month, we’ve had 370 millimetres as of last Friday. It’s a relief to see the sun.\n\nFun in the sun on Bondi Beach as the rainy weather lifts on Saturday. Credit: Flavio Brancaleone\n\nSenior bureau meteorologist Angus Hines says we’re in for a week of clear, sunny skies. Rather than rain, though, it will be windy.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-august-23-2025-20250823-p5mp75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Age photos of the week, August 23, 2025",
    "publish_date": "Sat, 23 Aug 2025 11:05:24 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "2/21\n\nNam Le has written a poem about the “ghosts” of the convent, which is being set to music at a concert later this month. Pictured with Lili Stephens Timothy O’Malley. Credit:Simon Schluter",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/sleepspot-founder-reveals-the-truth-about-napping-20250823-p5mp6z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sleepspot Founder reveals the truth about napping",
    "publish_date": "Sat, 23 Aug 2025 10:01:48 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Sleepspot Founder reveals the truth about napping\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/heavy-fog-interrupts-flights-in-adelaide-20250823-p5mp6y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heavy fog interrupts flights in Adelaide",
    "publish_date": "Sat, 23 Aug 2025 09:55:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Heavy fog interrupts flights in Adelaide\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 1
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/shoulder-charge-puts-grant-in-sin-bin-20250822-p5mp5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shoulder charge puts Grant in sin bin",
    "publish_date": "Sat, 23 Aug 2025 09:54:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "Shoulder charge puts Grant in sin bin\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/celebrity/how-to-have-a-5-star-saturday-like-shelley-craft-20250821-p5mone.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How to have a 5 star Saturday like Shelley Craft",
    "publish_date": "Sat, 23 Aug 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Shelley Craft"
    ],
    "text": "I love the buzz of The Block life and the thrill of live events, but when I’m off the clock, I’m all in on quality time. There are no cameras and no call sheets, but there’s still plenty to fill my cup, like delicious family dinners out on the town or a restorative girls’ trip up the coast.\n\nThere’s a lot of power in saying “no”, says Shelley.\n\nWhile the rest of the household appreciates a sleep-in, my two Rhodesian ridgebacks don’t know Saturday from Tuesday, so it’s still an early start for me. I’ll go for a walk before 7am and then head home for a sauna and ice bath. I really like to savour the start of my Saturday. Even if the day ends up full, those first few mindful minutes — whether it’s a quiet coffee, some journaling or just standing in the morning sun — make all the difference.\n\nFind what fuels you\n\nAlthough my morning is structured, the afternoon is totally freestyle. If the sun’s out, we’re outside enjoying the beach, the backyard, our bikes — whatever. After a week of schedules, it’s important to let the day unfold.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/can-the-wallabies-beat-south-africa-again-yes-if-they-do-these-five-things-20250822-p5mp02.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Can the Wallabies beat South Africa again? Yes – if they do these five things",
    "publish_date": "Sat, 23 Aug 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "While last week’s historic win at Ellis Park was followed by Wallabies scarves and jerseys being pulled out from cupboards across the country, every Australian rugby fan is bracing for a Springboks response in Cape Town this weekend after a performance in Johannesburg labelled as “dogshit” by coach Rassie Erasmus.\n\nHistory suggests the Wallabies face an even greater challenge on Saturday (kick-off 1:10am Sunday, AEST). The last time they recorded back-to-back wins over the Springboks was Brisbane (2021) and the Gold Coast (2022).\n\nThe Wallabies haven’t beaten the Springboks twice in South Africa in a calendar year since 1963. The last time Australia opened a Rugby Championship campaign with two straight wins was in 2015.\n\nAs for back-to-back away victories in the tournament? You have to go back to 2000 (Wellington and Durban), when John Eales was captain.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/emotional-aiava-qualifies-for-us-open-20250823-p5mp6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Emotional Aiava qualifies for US Open",
    "publish_date": "Sat, 23 Aug 2025 09:25:14 +1000",
    "category": "sports",
    "authors": [],
    "text": "Emotional Aiava qualifies for US Open\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/kid-gets-two-quick-goes-at-spectacular-crowd-catch-20250822-p5mp3d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kid gets two quick goes at spectacular crowd catch",
    "publish_date": "Sat, 23 Aug 2025 09:09:13 +1000",
    "category": "sports",
    "authors": [],
    "text": "Kid gets two quick goes at spectacular crowd catch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw2-west-ham-vs-chelsea-20250823-p5mp6q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW2: West Ham vs Chelsea",
    "publish_date": "Sat, 23 Aug 2025 09:00:46 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW2: West Ham vs Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/why-a-wallaroos-star-didn-t-tell-her-parents-she-was-debuting-for-australia-20250822-p5mozs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why a Wallaroos star didn’t tell her parents she was debuting for Australia",
    "publish_date": "Sat, 23 Aug 2025 09:00:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Adiana Talakai’s dad Petani was always her biggest supporter, but there was a time when she didn’t want him at her games. Specifically, the day Talakai made her debut for the Australian women’s rugby side, the Wallaroos, in a Test match in 2022.\n\nFor reasons she now struggles to explain, the NSW hooker decided she wouldn’t tell her father - and her whole family - that she’d been picked to play for the Wallaroos against Fiji in Brisbane. It’s just a camp, she fibbed.\n\n“I was scared that I was going to waste their time,” Talakai said. “I value what my parents have put into me. So I didn’t want to waste any more time and sacrifice that they have to. I didn’t want to disappoint them.\n\n“And yes, it was the dumbest thing I’ve ever done in my entire life.”",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/alleged-machete-attack-at-house-party-in-melbourne-20250823-p5mp6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Alleged machete attack at house party in Melbourne",
    "publish_date": "Sat, 23 Aug 2025 08:14:59 +1000",
    "category": "finance",
    "authors": [],
    "text": "Alleged machete attack at house party in Melbourne\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/lifestyle/meghan-markle-shares-video-of-husband-prince-harry-surfing-20250823-p5mp6m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Meghan Markle shares video of husband Prince Harry surfing",
    "publish_date": "Sat, 23 Aug 2025 08:14:42 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Meghan Markle shares video of husband Prince Harry surfing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/chalobah-seals-it-for-chelsea-20250823-p5mp6l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chalobah seals it for Chelsea",
    "publish_date": "Sat, 23 Aug 2025 08:00:11 +1000",
    "category": "finance",
    "authors": [],
    "text": "Chalobah seals it for Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/national/proteas-spinner-on-a-hat-trick-after-scalping-carey-20250823-p5mp6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Proteas spinner on a hat-trick after scalping Carey",
    "publish_date": "Sat, 23 Aug 2025 07:59:36 +1000",
    "category": "finance",
    "authors": [],
    "text": "Proteas spinner on a hat-trick after scalping Carey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-theres-only-one-covid-vaccine/fby4h6mju",
    "title": "Australians can only access one COVID-19 vaccine right now. Experts say that's a problem",
    "publish_date": "Sat, 23 Aug 2025 01:00:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "People seeking a booster shot of the COVID-19 vaccine may have noticed that there is only one option available: Pfizer Comirnaty JN.1.\n\n\n\n\n\nAccording to the latest figures from the Department of Health, Pfizer has been the only vaccine brand administered to Australians since the start of the year .\n\n\n\n\n\nWith two COVID-19 variants circulating across the country, and only 1.9 million Australians having received a vaccine in the past six months, experts say choice is important when it comes to encouraging Australians to get the jab.\n\n\n\n\n\nSo why is there only one vaccine currently available?\n\n\n\nPfizer's Comirnaty JN.1 vaccine is the dominant vaccine brand in Australia. Source: AAP / Jenny Kane\n\nWhat happened to the other vaccines?\n\nThe main mRNA alternative to Pfizer is Moderna. Both companies have produced vaccines targeting the Omicron variant JN.1, which was dominant across Australia for much of 2023 and 2024.\n\n\n\n\n\nModerna's JN.1 vaccine was approved for use in Australia in late 2024 by the Therapeutic Goods Association (TGA), the body responsible for approving medical products in Australia.\n\n\n\n\n\nHowever, despite approval, in 2024 the Australian government decided not to replenish its supply.\n\n\n\n\n\n\"The Commonwealth has sufficient supplies of alternative COVID-19 vaccine brands for 2024,\" a Department of Health spokesperson told SBS News at the time .\n\n\n\n\n\nThis could change next year, however, as a newly built Moderna Technology Centre at Monash University in Melbourne is aiming to locally produce 100 million vaccines per year for COVID-19, influenza, and respiratory syncytial virus. It is expected to start production in late 2025.\n\n\n\nREAD MORE Why a popular COVID-19 vaccine has been withdrawn worldwide\n\nAnother mRNA vaccine, AstraZeneca, was recalled globally in 2024 after the company admitted it could cause adverse side effects.\n\n\n\nWhy isn't Novavax available?\n\nOne mRNA alternative also not on our shelves is Novavax.\n\n\n\n\n\nIn 2020, Novavax was one of the first batches of vaccines to bought by Australia. Its original COVID-19 vaccine, Nuvaxovid, was available for Australians from early 2022 .\n\n\n\n\n\nIts updated vaccine, Nuvaxovid XBB.1.5, did not receive TGA approval in Australia.\n\n\n\n\n\n\"It wasn't that approval was revoked with any specific safety or efficacy concerns. It was just that the amount of data required for that approval to be met just wasn't achieved,\" Dr Paul Griffin, infectious diseases physician and clinical microbiologist at Brisbane's Mater Health Services, said.\n\n\n\nNovavax withdrew its updated vaccine for TGA approval in 2024 but says it is committed to making its vaccine available to Australians. Source: AAP / Matthias Bein Novavax told SBS News it is committed to making the vaccine available to Australians and are working with the TGA to determine the best path forward. However, according to the TGA, Novavax withdrew its registration on 21 May 2024.\n\n\n\n\n\nProfessor Adrian Esterman, chair of biostatistics and epidemiology at the University of South Australia, said that low uptake in Australia may have been a factor in the company deciding not to renew its registration.\n\n\n\n\n\n\"It's not so much that the vaccine doesn't work, but it's simply not commercially viable for them,\" he said.\n\n\n\n\n\n\"Since then, they've developed a JN.1 vaccine which has been approved in several other countries, but they haven't bothered with Australia.\"\n\n\n\n\n\nEsterman said this is not good news for people who relied on Novavax as an alternative to mRNA offerings.\n\n\n\nWhy do some people prefer Novavax?\n\nNovavax is a protein subunit vaccine. Esterman said it's made by taking the genetic material of the virus, the DNA, and putting it into the cells of a moth. This makes the moth produce spike proteins.\n\n\n\n\n\n\"They then add to that what they call an adjuvant, which is a substance they get from a soapbark tree, and that helps the body react to these spikes ... and that's what they inject in you,\" he said.\n\n\n\n\n\nAn mRNA vaccine, by contrast, tells your body to make the spike proteins. Griffin said Novavax is preferred by some people who have had reactions to mRNA vaccines in the past.\n\n\n\n\"There are a whole host of people who have had reactions to mRNA vaccines, things like myocarditis, for example, and it's thought that perhaps that's a lower risk with Novavax. Or people who just don't like the thought of a vaccine based on the mRNA technology.\"\n\n\n\nWhy choice matters\n\nEsterman explained that having a variety of vaccine options is about making sure you have the right tools for the job.\n\n\n\n\n\n\"It's best to have several tools in your tool case. You wouldn't have one type of hammer; what if it doesn't work? You need something different. So it's good to have a variety of vaccines, and most countries do that.\"\n\n\n\n\n\nIt can also impact overall vaccination uptake, which both Griffin and Esterman say is currently low among vulnerable populations.\n\n\n\nExperts say the perception of choice when it comes to vaccine brands can help stimulate vaccine uptake among vulnerable populations. Source: AAP / Joan Mateu July figures from the Department of Health indicate that only 35 per cent of Australians aged 75 and over received a vaccination in the last six months, dropping to 22 per cent for those aged 65 to 74. Only 3 per cent of people between 18 and 64 received a vaccine this year. While these figures are slightly higher than previous months, overall rates of vaccination are lower than experts would like .\n\n\n\n\n\n\"There's certainly a lot of people that aren't opposed to being vaccinated who just don't want, or can't have, an mRNA vaccine, and so are likely to remain unvaccinated, which is a huge issue,\" Griffin said.\n\n\n\n\n\n\"If we could get a proportion of those people to be boosted, it would certainly be beneficial. So I'd really like to see there be an option for an alternative.\"\n\n\n\nAre we still catching COVID-19?\n\nIn short: yes.\n\n\n\n\n\nGenerally speaking, there are two COVID-19 waves each year: summer and winter. A recent winter peak is subsiding after an outbreak across more than 200 aged facilities.\n\n\n\nREAD MORE Has COVID changed in five years? What to know as winter looms\n\nThe current dominant strain in Australia is NB.1.8.1 or the Nimbus variant. Another variant, XFG or Stratus, is growing in dominance overseas, with high rates of infection in India, Spain, the United Kingdom, and the United States.\n\n\n\n\n\nGriffin warned that there are still risks between the waves, and it is important not to be complacent.\n\n\n\n\n\n\"Between those waves we see significant numbers of cases, and still see people in hospital from COVID-19...and that's why we really need to keep the highest risk people regularly vaccinated to keep them protected.\"\n\n\n\n\n\nThe Australian government recommends those in high-risk groups, such as the over-75s, aged care residents, or the immunocompromised, receive a booster shot every six months. For lower-risk groups, a booster shot every 12 months should suffice.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/famine-declared-in-gaza-city-morning-news-bulletin-23-august-2025/x08ay1bas",
    "title": "Famine declared in Gaza City | Morning News Bulletin 23 August 2025",
    "publish_date": "Fri, 22 Aug 2025 20:43:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "TRANSCRIPT\n\n\n\nFamine officially declared in Gaza City by a UN-backed group.\n\nThe Coalition has welcomed progress towards improving safety in Australia's childcare system.\n\nAnd in the NRL, the Storm defeat the Bulldogs in AAMI Park in Melbourne.\n\n----\n\n\n\n\n\nFamine has been confirmed in Gaza for the first time.\n\n\n\n\n\nA UN-backed group responsible for monitoring food security says 514,000 people - nearly a quarter of Palestinians in Gaza - are experiencing famine.\n\n\n\n\n\nIn its latest report, the Integrated Food Security Phase Classification Famine Review Committee says that number is expected to rise to 641,000 by the end of September.\n\n\n\n\n\nIsrael has rejected the report, with Prime Minister Benjamin Netanyahu calling it an “outright lie.”\n\n\n\n\n\nThe IPC, says famine is happening in Gaza City, home to hundreds of thousands of Palestinians, and could spread south to Deir al-Balah and Khan Yunis by the end of next month.\n\n\n\n\n\n----\n\n\n\n\n\nUnited States President Donald Trump says that in two weeks he should know whether progress is possible in his bid to end Russia's invasion of Ukraine and he again raised the prospect of imposing sanctions on Moscow.\n\n\n\n\n\nMr Trump says he's not happy with any aspect of the effort to find peace.\n\n\n\n\n\nA week ago Trump held talks in Alaska with Russian President Vladimir Putin and has been unable thus far to coax him into a meeting with Ukraine President Volodymyr Zelenskyy.\n\n\n\n\n\n\"I think in two weeks we'll know which way I'm going. Because I'm going to go one way or the other, and they'll learn which way I'm going. And it's going to be a very important decision. And that's whether or not it's massive sanctions or massive tariffs or both. Or do we do nothing and say 'it's your fight'?\"\n\n\n\n\n\n----\n\n\n\n\n\nThe Coalition has welcomed progress towards improving safety in Australia's childcare system, but says the test for governments will be how quickly action is taken.\n\n\n\n\n\nA meeting of state, territory and federal ministers on Friday agreed to a series of changes that will be implemented in stages over the coming months.\n\n\n\n\n\nThis includes plans to establish a national register for childcare workers by February, and a ban on mobile phones due to come into effect this September.\n\n\n\n\n\nMore mandatory training and spot checks at centres will also be rolled out, alongside a trial of CCTV at hundreds of childcare centres from December.\n\n\n\n\n\nOpposition spokesperson for education and early childhood learning, Jason Duniam says privacy protections will be an important part of using CCTV.\n\n\n\n\n\n\"So of course, we need to get it right. The trial I think is a very good step in the right direction. I accept that there are going to be privacy concerns, and we know for a fact that, sadly, those who prey on our most vulnerable, on children, have utilised CCTV and other systems to their own ends, which is something we need to guard against. So, this trial, informed by law enforcement officials and cyber experts in partnership with the child care sector will be about getting it right. We support that.\"\n\n\n\n\n\n----\n\n\n\n\n\nFive bodies have been exhumed from shallow graves in Kenya, near a site where more than 400 bodies of followers of a doomsday cult were recovered two years ago.\n\n\n\n\n\nGovernment pathologist Dr Richard Njoroge says 10 human body parts were also recovered, scattered in nearby thickets about two kilometres from the site of the Shakahola cult.\n\n\n\n\n\nHe says these are just a handful of 27 suspected grave sites that homicide detectives and forensic experts are continuing to investigate.\n\n\n\n\n\n\"At the commencement of this exercise we had 27 suspected graves. So, today we managed to exhume 6. Of the six graves, we found five bodies. So we had remaining 21 graves, for which the exercise will continue.\"\n\n\n\n\n\nIn 2023, more than 400 bodies were exhumed from shallow graves in the Shakahola area, where pastor Paul Mackenzie instructed his followers to starve themselves to death in order to \"meet Jesus.\"\n\n\n\n\n\nHe was arrested and charged with murder and is in custody awaiting trial.\n\n\n\n\n\n----\n\n\n\n\n\nIn rugby league,\n\n\n\n\n\nMelbourne have locked down a top-two ladder position with two rounds to play after holding out Canterbury in their blockbuster NRL showdown.\n\n\n\n\n\nThe Storm were forced to work hard for a 20-14 win over a much-improved Bulldogs outfit.\n\n\n\n\n\nThe AAMI Park victory put Melbourne four points clear of third-placed Canterbury, but they have a far superior points differential.\n\n\n\n\n\nMeanwhile, a dramatic golden-point victory by Canberra over Penrith has put the Raiders in prime position to claim the minor premiership.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/darce-wants-to-play-aussie-rules-but-they-say-its-culture-makes-them-feel-unsafe/0f8cbi9oz",
    "title": "Darce cried in the shower after Aussie rules games. They're pushing for the sport to change",
    "publish_date": "Fri, 22 Aug 2025 20:34:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "Darce always loved Australian rules football. They played sports their entire life, dabbling in hockey, cricket, and footy since they were a kid.\n\n\n\n\n\nBut now, they feel physically sick if they hear the whirl of the AFL siren or pass an Aussie rules field.\n\n\n\n\n\nThe 32-year-old is non-binary and typically played in local women's leagues. But they say that because of their physical presentation, they've been subject to transphobic and homophobic slurs and physical abuse — something they say has ramped up in the last few years.\n\n\n\n\n\n\"I've had people just yell slurs from the sidelines while I'm trying to play a game — people who don't even know me. It's really alienating and terrifying,\" Darce told SBS News.\n\n\n\n\n\nSBS News has chosen not to publish these slurs.\n\n\n\n\"I remember playing a game and I could hear the coach just referring to me as 'he' … then these players come and they play on you with the mindset that they're playing on a man, so they start tackling you really hard and hurting you,\" Darce said.\n\n\n\n\n\nDarce says that the last game they played, they were tackled so violently that it led to a concussion. They say an unsafe culture is embedded in local leagues, adding that many of their gender-diverse and queer friends have also been subject to physical and verbal discrimination under the guise of competition and routine sledging.\n\n\n\n\n\n\"Players will get called slurs and it's treated like a very minor thing [by the league],\" they said said. \"Any kind of diversity or deviation from what is considered the norm of 'who plays footy' is targeted.\"\n\n\n\nNow, they have stopped playing in their local league and have stopped attending official AFL matches.\n\n\n\n\n\n\"I was taking off so much work after games because I’d be crying in the shower all night, and I wouldn’t be able to sleep. And this is even just local footy,\" they said.\n\n\n\n\n\n\"I miss the sport so much and I miss my friends, but I'm at the point where I haven't physically been able to go to a game since then. Even when I hear the umpire's whistles at the park around the corner, I get anxiety.\n\n\n\n\n\n\"It was something I really loved and it was causing me so much harm that I had to step away entirely.\"\n\n\n\nAdelaide Crows player Izak Rankine has been hit with a four-match suspension for the use of a \"highly offensive homophobic slur\" against a Collingwood opponent. Source: AAP / Matt Turner\n\nDoes AFL have a culture of homophobia and transphobia?\n\nThe sport's stated aim of stamping out homophobia at the top level to the grassroots was under a spotlight this week.\n\n\n\n\n\nAdelaide Crows player Izak Rankine was sanctioned on Thursday for using a homophobic slur against an unnamed Collingwood opponent last Saturday night.\n\n\n\n\n\nThe AFL hit Rankine with a five-match suspension, which was later downgraded to four matches, citing \"compelling medical submissions\". SBS News has contacted the AFL for comment on what those medical submissions were.\n\n\n\n\n\n\"Rankine rang the Collingwood player to personally apologise and he fully cooperated with the subsequent investigation by the AFL Integrity Unit including by admitting the use of the homophobic slur and being remorseful for it,\" the AFL said in a statement.\n\n\n\n\n\nAFL general counsel Stephen Meade said: \"The language used was offensive, hurtful and highly inappropriate. Our players have a very clear understanding of what is acceptable on the football field. Importantly, in this instance it was called out by players and acknowledged by Izak himself as wrong — and that reflects the standards we expect and demand in our game.\"\n\n\n\n\n\nAFL CEO Andrew Dillon said \"inclusion and respect are key priorities for the AFL\" and acknowleged that there was \"much more work to do\".\n\n\n\n\n\n\"I know people in the LGBTQI+ community are hurting when an incident like this happens,\" Dillon said on Thursday.\n\n\n\n\n\nOn Monday, Adelaide captain Jordan Dawson denied the incident was a sign of a wider cultural issue in the AFL.\n\n\n\nDr Robert Boucaut, a lecturer in media at the University of Adelaide, however, said the incident was a \"symptom of a broader problem\" and wasn't just an isolated incident.\n\n\n\n\n\n\"In team sports, you are often prioritising and valuing traits around hyper-masculinity and aggression — and looking towards methods to undermine opposing teams on those levels,\" Boucaut told SBS News.\n\n\n\n\n\n\"Homophobia, misogyny, queerphobia and transphobia all plays into that culture of sledging in the game,\" he said. \"The language used on-field and, more than likely behind the scenes, is one of exclusion, one of ostracisation, and othering.\"\n\n\n\n\n\nHe says it \"threatens the safety and viability of diverse communities being able to participate in sport\".\n\n\n\nRankine is the sixth AFL-listed player banned for a homophobic slur against an opponent in the past 16 months.\n\n\n\n\n\nBoucaut says there has been an uptick in reporting these incidents since 2023, which may indicate a slight cultural shift. But he says the way these incidents are tackled still \"misses the bigger picture of a culture of institutional homophobia\".\n\n\n\n\n\n\"The AFL is unique amongst the world’s elite sporting codes in never having had an openly gay male player — that itself supports this picture of the AFL being an unsafe and unsupportive environment.\"\n\n\n\n\n\nDarce says the incident sends the message that Aussie rules is not a safe place for queer people like them: \"It's very clearly saying that we're not safe playing footy and that we’re not welcome.”\n\n\n\n\n\n\"The AFL tried to brush it off as a single incident, not that it's a cultural issue.\"\n\n\n\nThe 'tip of the iceberg'\n\nDr Ryan Storr from the Sport Innovation Research Group at Swinburne University of Technology is a co-author of the Free to Exist research paper, published last year.\n\n\n\n\n\nIt found that 53 per cent of young LGBTQIA+ people have witnessed discrimination, and 40 per cent have experienced discrimination — mostly through verbal vilification.\n\n\n\n\n\nStorr says gay men were the largest group to report discrimination, with 76 per cent hearing or witnessing homophobia.\n\n\n\nHe's not surprised by Darce's experience. \"In the last couple of years, in particular with the rise of right-wing conservatism, the Trump effect, and what we've seen in the UK in changing the definition of a woman, there's been an increase in anti-LGBTQIA+ sentiment.\"\n\n\n\n\n\n\"Unfortunately, trans and gender diverse people have been copping this.\n\n\n\n\n\n\"This is just the top of the iceberg.\"\n\n\n\n\n\nHe says the environment has led to an increase in body policing — something that Darce has experienced: \"In men’s sports and the men’s football, anything that’s seen as feminine — whether it be having longer hair or painting your nails — there's this assumption of your sexuality that this person might be gay and that’s somehow not masculine.\"\n\n\n\n\n\n\"In the women’s comp, it’s less homophobia you face and it’s more transphobia you get,\" they said. \"If your hair is too short or you’re too tall or your voice is a bit deep, there’s this assumption that, 'oh, you mustn’t be a girl then'.\"\n\n\n\nBut Storr is cautious to place the blame entirely on politics, saying the AFL needs to take ownership of the culture it has created.\n\n\n\n\n\n\"Sport is a reflection of society, but I think sometimes it can be heightened,\" he said.\n\n\n\n\n\n\"In the Izak Rankine case, if you had said this in a work setting, you're not getting a slap on the wrist — you'd be fired. Sport seems to be immune to this.\"\n\n\n\nFlow on for community sports\n\nBut instances like Rankine's don't just take place at Adelaide Oval. It can also have devastating flow-on effects in community spaces and online.\n\n\n\n\n\n\"Every time an incident like this happens, you get maybe four or five days afterwards of just online commentary — and it's often quite negative,\" Storr said.\n\n\n\n\n\n\"Ultimately, what you have is overt homophobia in online environments … it sends the message that LGBTQIA+ people aren't welcome in sport.\"\n\n\n\n\n\nHis research has also led to him speaking to local clubs, with one club manager explaining that incidents like these can lead to a rise in homophobic language on the field.\n\n\n\nAFL CEO Andrew Dillon said \"inclusion and respect are key priorities for the AFL\", adding that \"people in the LGBTQI+ community are hurting when an incident like this happens\". Source: AAP / Joel Carrett \"The large percentage of community clubs and sport volunteers have mentioned that homophobic language is very prevalent and a problem. One club said that the last time this happened, discussion of and use of homophobic language increased,\" Storr says.\n\n\n\n\n\nBoucaut adds that larger cultural attitudes in the AFL can trickle down into local, community, and junior leagues.\n\n\n\n\n\n\"The flow-on effects to communities would be disheartening,\" he said.\n\n\n\n\"If the elite spaces of AFL aren’t leading the charge, it puts community clubs in a stymied position, because it gives a pass for those behaviours to trickle down — to be seen as just part of the game.\"\n\n\n\n\n\nFor Storr, that's particularly worrying.\n\n\n\n\n\n\"When they hear their role models say it, it gives these young boys ammunition to do that.\"\n\n\n\n\n\n\"The main perpetrators of homophobia are young teenage boys in groups — that's why sport is rife for this and it's an area that promotes it, unfortunately.\"\n\n\n\n'We're not problems to be fixed'\n\nAs for what that change might look like, it's difficult to envision.\n\n\n\n\n\nStorr advocates for a \"multi-pronged\" approach, including education, to get to the core of the problem.\n\n\n\n\n\n\"A band-aid solution of giving a ban is not working,\" he said. \"Culture change and attitudinal change takes a long time, but they need to realise this is a problem and have a carefully curated plan and strategy.\"\n\n\n\n\n\nBoucaut says systemic homophobia and queerphobia can't simply be fixed through match bans, sanctions, or pride education.\n\n\n\n\n\nInstead, he urges to shift the conversation away from punishment and look at more holistic efforts to enhance queer representation in the league, especially in the commentary space.\n\n\n\n\n\n\"There is space for the sport and the code to change. The game has made many adaptations over its existence — this can be another adaptation they choose to make,\" Boucaut said.\n\n\n\nBut for Darce, dreams are as simple as wanting to kick a footy safely.\n\n\n\n\n\n\"Queer people are treated as an outside problem to be solved or worked out or tolerated, rather than people who are part of the sport and have every right to simply be included and belong without our existence being questioned,\" Darce said.\n\n\n\n\n\n\"The queer community has had such immeasurably positive impacts for the good of Australian sports and society — it's insulting that the conversation seems to be around treating queer people like they're the problem, when they are the ones that should be receiving the most support right now.\"\n\n\n\n\n\n\"Everyone should be comfortable playing sports. We're not problems to be fixed.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-aunty-donna-went-from-a-two-star-comedy-review-to-landing-a-netflix-series/ssq4uaa40",
    "title": "How Aunty Donna went from a two-star comedy review to landing a Netflix series",
    "publish_date": "Fri, 22 Aug 2025 20:34:10 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "In 2014, Aunty Donna's promising comedy career was on a knife-edge.\n\n\n\n\n\nAfter being nominated for the prestigious Golden Gibbo award for their first live show, the then-four-person sketch comedy crew were down a member and questioning whether they could work as a trio.\n\n\n\n\n\nTo add salt to the wound, the venue they'd been put in for the Melbourne International Comedy Festival was on the fringes of the CBD, far away from all the action.\n\n\n\n\n\n\"It was an impasse where it's like: this is either going to fall apart or gain momentum,\" Broden Kelly says of how he and the other two performing members of the group were feeling at the time.\n\n\n\nIn the early years of their comedy career, Aunty Donna performed as a quartet. Credit: Isabelle Clara Mason After \"white-knuckling it\" to create a show they were really proud of, SBS Comedy gave them a less-than-favourable review.\n\n\n\n\n\n\"They hated it,\" Mark Samual Bonanno recalls.\n\n\n\n\n\n\"We had a sit-down on Lygon Street and we went around a circle and said something we like about each other — that's how much it affected us.\"\n\n\n\n\n\nWhile that two-star review knocked their confidence, Zachary Ruane credits it with being \"a very important step in our journey\".\n\n\n\nREAD MORE The funny side of grief: What the fear of dying young taught Michelle Brasier about life\n\n\"The big lesson that we got out of it was that we might work really hard to get on that stage and to make a good thing, but when people come and watch us, they've just worked hard at probably something that matters a lot more than what we do,\" he says.\n\n\n\n\n\n\"They don't come to us to see us working hard; they come to us to forget about the hard work they've just done, to forget about their struggles … so we need to just get up there and have fun.\n\n\n\n\n\n\"That kind of conversation and that realisation, I think, informed so much of what we do.\"\n\n\n\nFinding non-traditional pathways to success\n\nA decade on, and Aunty Donna — made up of writers and performers Bonanno, Kelly, and Ruane, along with head writer and stage director Sam Lingham, director Max Miller, and composer Thomas Zahariou — have toured all over the world, created two TV shows, released a studio album, worked with the likes of Shaun Micalleff, Tony Martin and Weird Al Yankovic, and published a colouring book.\n\n\n\n\n\nMuch of that success is thanks to the loyal following they built online through their YouTube channel, which boasts more than 639,000 subscribers, their self-titled podcast and their Patreon.\n\n\n\n\n\n\"When we were starting, there were three or four people at festivals and networks that had to like what you did, and if they didn't like what you did, then good luck to you,\" Ruane says.\n\n\n\n\n\n\"We were kind of the first generation that were then able to go: 'Well, you don't like us, but we'll go find an audience'.\"\n\n\n\nWith 2018's Always Room for Christmas Pud, a largely improvised sketch that is perhaps Aunty Donna's most well-known, they had their first taste of something approaching virality.\n\n\n\n\n\nThe original upload has amassed over 4.3 million views on YouTube and Pud has also become a running gag and annual cultural celebration amongst their fans, spawning a pannettone version (a nod to Bonanno's Italian heritage), a family-friendly version, a picture book, and a mockumentary about the making of the sketch.\n\n\n\nWhile the group's vast body of work is varied in its themes and tone, their brilliance lies in their ability to take a universal experience — like dealing with horrible real estate agents, forgetting to take your reusable bags to the shops, trying to have a picnic as an adult, and offloading cake at the end of a party — and add an absurdist and oftentimes dark edge to it.\n\n\n\n\n\nOne thing Aunty Donna generally steers clear of is being overtly political.\n\n\n\nBut Kelly rejects the idea that they're \"never saying anything\".\n\n\n\n\n\n\"I really struggle with that because I think everything that we are doing is really saying something really simple, and that is that 'If you're a man, it's okay to look silly or to be stupid. It's okay to be weird',\" he says.\n\n\n\n\n\n\"The world I lean into now with footy [Kelly hosts an AFL podcast] as well, there's so much negativity and putting down and just sort of tropes that are masculine, and just trying to reaffirm by setting the example that it doesn't have to be that way.\n\n\n\n\n\n\"We do that a lot with our stuff — but I think if things are too didactic or too instructional, you do lose a lot of people, when you could be getting them.\"\n\n\n\nGiven how many Australian references are littered throughout Aunty Donna's work (everything from Hey, Hey, it's Saturday to Eagle Boys Pizza), it's perhaps surprising that global streaming giant Netflix was willing to give them their own show before any local TV networks.\n\n\n\n\n\nAunty Donna's Big Ol' House of Fun, which was co-produced by Office star Ed Helms' company Pacific Electric Picture Company, was also the only time they were given free rein to make the show they wanted.\n\n\n\n\n\n\"Every other time, it was very heavily: 'You can't just do what you want to do. It has to be this, it has to tick all these boxes,' Bonanno says.\n\n\n\n\n\nKelly adds: \"Often we've seen in places we've made shows before that the shows they make need to be for everyone at one time, and there's an argument that's not the best representation of diversity … maybe it's giving chances to diverse people to represent what they want to represent, as opposed to putting a square peg in a round hole.\"\n\n\n\nAunty Donna's Coffee Café, the TV series they produced for the ABC, featured a long list of guest start including Rake star Richard Roxburgh (centre) and Matt Doran (second from left), who played Mouse in The Matrix. Source: Supplied / ABC Asked if they felt they needed to make it overseas to be taken seriously back home, Aunty Donna doesn't pull any punches.\n\n\n\n\n\n\"It's almost like we don't need to answer that question; the world answered the question for us,\" Ruane says.\n\n\n\n\n\nBonanno adds: \"That is Australia. That's music, that's TV, that's comedy, that's all the arts in Australia is. We don't tend to lift people up until overseas says 'This is great'.\"\n\n\n\nBuilding a 'mini Netflix for Australian comedy'\n\nThe risk-averse nature of the local screen industry has prompted Aunty Donna to invest their own money in nurturing talent that doesn't necessarily fit a mainstream mould, through their production company Haven't You Done Well and comedy network Grouse House.\n\n\n\n\n\n\"We kind of entrepreneurially just saw that there was a hole in the market and that every network in the country was not doing their job in platforming really good people,\" Kelly says.\n\n\n\n\"We just thought: 'Let's see if we can build something that can eventually compete,' so we've hired a whole team around us who are building this platform and building out shows and rollouts, and it's really fun to watch.\"\n\n\n\n\n\nWhile they're starting small by funding comedians they've worked with in the past, including Demi Lardner and Greg Larsen, they hope in the long-term that Grouse House can become a \"mini Netflix for Australian comedy\".\n\n\n\n\"We see these people that are really, really good … they just need that opportunity,\" Ruane says of their desire to help other Australian comedians create sustainable careers.\n\n\n\n\n\n\"As we grow that community out and fold more people in, hopefully, eventually we get to a place where [people say] 'Well, if Grouse House is doing it, then it's good'.\n\n\n\n\n\n\"The goal would be that there are fans of Grouse House in five years' time that have never heard of Aunty Donna, they just love that brand.\"\n\n\n\nThe end of an era\n\nNever ones to rest on their laurels, Aunty Donna are back out on the road with DREM, their first live show in two years.\n\n\n\n\n\nThe show promises to be as silly and energy-filled as audiences have come to expect from the group, while also offering something new.\n\n\n\n\n\n\"I would argue that DREM is our freest show when it comes to the ideas that are in it and how we've kind of put the show together. Production-wise, I'm the most excited about [it] because we are doing stuff that we have never done before,\" Bonanno says.\n\n\n\nAunty Donna's live shows are known for being a high octane, assault on the senses — in the best kind of way. Source: Getty / Roberto Ricciuti It's also the first time in their career that they don't have any plans about when they'll tour again.\n\n\n\n\n\n\"We're kind of okay with the idea we won't be touring after this for a little bit because, for me at least, it feels like a real bookmark of this era where we learned all these lessons about how to make audiences laugh,\" Kelly says.\n\n\n\n\n\nRuane adds: \"It's nice to just have a bit of ambiguity there. We haven't had that for a long time.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/video/indian-australian-filmmaker-debuts-video-installation-at-darwin-festival/t94apy14s",
    "title": "Indian Australian filmmaker debuts video installation at Darwin Festival",
    "publish_date": "Fri, 22 Aug 2025 10:07:19 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Indian Australian filmmaker debuts video installation at Darwin Festival\n\nPublished 22 August 2025, 9:18 am\n\nOne of the Northern Territory's largest cultural festivals is happening in Darwin, featuring more than 700 local and international artists. Among the artists is Naina Sen, whose installation involved the input of hundreds of women from Australia's Indian diaspora to reconstruct the meaning of their female identity.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/zelenskyy-returns-to-the-white-house-netanyahu-torches-albanese-xi-visits-tibet/iar43mh8n",
    "title": "Zelenskyy returns to the White House, Netanyahu torches Albanese & Xi visits Tibet",
    "publish_date": "Fri, 22 Aug 2025 08:13:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-guzman-y-gomezs-steven-marks-on-results-future-sales-inflation-ai-and-taco-bell/czkzx9dqp",
    "title": "CEO Series: Guzman Y Gomez's Steven Marks on results, future sales, inflation, AI and Taco Bell",
    "publish_date": "Fri, 22 Aug 2025 07:14:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/autism-stakeholders-welcome-new-government-commitment-but-are-perplexed-they-werent-consulted/kiiuulbjy",
    "title": "Autism stakeholders welcome new government commitment - but are perplexed they weren't consulted",
    "publish_date": "Fri, 22 Aug 2025 06:29:34 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe government's announcement of a new approach to autism funding caught many by surprise - including service providers, parents and autism advocates.\n\n\n\n\n\nJenny Karavolos is co-chair of the Australian Autism Alliance.\n\n\n\n\n\n\"We're a little bit perplexed. We definitely welcome that there is a commitment to children's development but we haven't had any consultation, so we're a little concerned about what this actually means for autistic children and their families.\"\n\n\n\n\n\nShe's referring to a new program called Thriving Kids, announced by federal Health Minister Mark Butler on Wednesday.\n\n\n\n\n\nWith an initial cost of $2 billion, its goal is to re-direct children diagnosed with what the minister calls \"mild to moderate\" autism away from the National Disability Insurance Scheme.\n\n\n\n\n\nMr Butler says the number of children entering the NDIS with developmental delay or autism diagnoses is growing at an unsustainable pace.\n\n\n\n\n\n\"I think most Australians would be alarmed to know that one out of every 10 6-year-olds are in the NDIS, including 16 per cent of 6-year-old boys. // Tens and tens of thousands of young children with mild to moderate developmental delay or autism are on a scheme set up for permanent disability.\"\n\n\n\n\n\nUnder the Thriving Kids plan, the government aims to improve and strengthen access to existing support networks, such as GPs and other community health.\n\n\n\n\n\nIt would include bulk-billed developmental checks for 3-year-olds, and improved training for health professionals.\n\n\n\n\n\nWhere further support is needed, the minister says Medicare could fund access to occupational therapy, speech pathology or psychosocial therapy.\n\n\n\n\n\n\"Individualised plans and budgets make sense for people with lifelong disability – giving them more choice and control over the support they receive. But families with a young child who’s missing some milestones are not best helped by receiving a budget of $10, $20 or $30,000 and being expected to work out themselves how to spend it. And, frankly, many of those children are then being over-serviced.\"\n\n\n\n\n\nThe minister also suggests the government could scale up drop-in support at community centres, and create a nationally consistent online information service - like 1800-MEDICARE or the Carer Gateway.\n\n\n\n\n\nEarly childhood education providers and schools would also play an increased role.\n\n\n\n\n\n\"Mental Health in Primary Schools – or MHiPS – is just one example of a more broad-based approach to supporting young children with a range of needs, including autism and ADHD. Developed by the Murdoch Children’s Research Institute, this program has been delivered already across Victorian schools and is now being piloted in Queensland and South Australia.\"\n\n\n\n\n\nMark Butler says the state governments have collectively agreed to match the federal government's $2 billion commitment to the scheme.\n\n\n\n\n\nBut Victorian Premier Jacinta Allan says several states are still catching up.\n\n\n\n\n\n\"Like many states and territories we heard about the proposed changes from the federal government when the Minister made his address. We stand ready to work constructively to go through the detail, and I think that's particularly important when we know that there are many families today who have got many questions.\"\n\n\n\n\n\nKatie Koullas runs Yellow Ladybugs - a charity supporting autistic girls, women and gender-diverse people.\n\n\n\n\n\nShe describes the announcement as \"heartbreaking”.\n\n\n\n\n\n\"I'm autistic and I've got two autistic teen girls. We would be considered mild as per the minister's statements, but what's damaging about that is that our experience isn't mild at all. And so, when you use those kind of descriptions, you are not fully understanding the internalised experiences. There is such a cost to masking, growing up in a world which isn't built for us. So there is a lot of impact on mental health, and in our community there's a lot of self-harm, and eating disorders and 'school can't'. And that's the real cost we start to see throughout the life stages of families like ours.\"\n\n\n\n\n\nA joint statement released by People with Disability Australia on behalf of 11 organisations says they are disappointed the government hasn't yet engaged with the autism community on the plan.\n\n\n\n\n\nIt also cautions against a \"one-size-fits-all approach\" which lacks the choice and control around supports afforded by the NDIS.\n\n\n\n\n\nMaguy lives in Sydney with her three children.\n\n\n\n\n\nHer son Nicolas, now 18, a has moderate intellectual disability and autism.\n\n\n\n\n\nShe says the supports funded by the NDIS were life-changing for her family, but it doesn't matter what program the funding comes from.\n\n\n\n\n\nWhat is crucial, she maintains, is that children receive early intervention.\n\n\n\n\n\n\"The intervention works. We've seen the data, we've seen the evidence. What the ideal picture is, that when they are younger the receive that intensive intervention. And so that parents are trained to work with their child, and they understand their child, and the child also learns to communicate more effectively, and so their chances of finding employment when they're older and their chances of actually having a happier life because they're able to communicate more effectively are going to be much greater.\"\n\n\n\n\n\nThe cost of the NDIS is growing at around 22 per cent per year, eclipsing growth in Medicare, Defence and Aged Care spending, and threatening the viability of the scheme.\n\n\n\n\n\nFollowing an independent review in 2023, the government resolved to bring that growth down to eight per cent in the short-to-medium term, before further reining it in.\n\n\n\n\n\nThe Coalition, for now, is withholding support from the new changes.\n\n\n\n\n\nOpposition Social Services Spokesperson Amanda Ruston says more detail is needed.\n\n\n\n\n\n\"We still don't know what's happening with Foundational Supports, which was another change to the NDIS program last year. So we've got another announcement with no details and no certainty, and no pathway through which the Minister has announced that he's actually going deliver what he said.\"\n\n\n\n\n\nThe Thriving Kids program is intended to roll out from July next year and be fully implemented by July 2027.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australias-productivity-problem-what-came-out-of-the-three-day-summit-in-canberra/97gs4txzt",
    "title": "Australia's productivity problem: What came out of the three-day summit in Canberra?",
    "publish_date": "Fri, 22 Aug 2025 06:00:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe government's long-awaited economic roundtable has drawn to a close.\n\n\n\n\n\nSome called it a talkfest, others a waste of time, but to the Treasurer, this was an opportunity to build the momentum needed to place Australia's sliding productivity back on a path of growth.\n\n\n\n\n\nAfter over 900 submissions, 40 preliminary roundtables, five interim reports, and 29 hours of closed-door discussions, Jim Chalmers says consensus was reached in several areas.\n\n\n\n\n\n\"There were clear and broad areas of consensus, probably more than I was anticipating in the breadth and depth of the views that people shared - and where those views connected.\"\n\n\n\n\n\nWrapping up the three-day summit, Dr Chalmers announced ten reform directions the government intends to pursue.\n\n\n\n\n\n\"Our progress towards a single national market, which is how we improve the Federation, modernis e the Federation. The second one is about simplifying trade and reforming tariffs. The third one was better regulation and how we cut the clutter when it comes to reg. The fourth one was speeding up approvals in national priority areas. The fifth one was building more homes more quickly. The sixth one was how we make artificial intelligence a national priority for Australia. Seven was attracting capital and deploying investment. Eight was building a skilled and adaptable workforce. Nine was a better tax system, and 10 was modernising government services.\"\n\n\n\n\n\nReforms in these ten areas, according to the Treasurer, will help achieve what he says is the holy grail outcome: higher productivity and, in turn, higher living standards.\n\n\n\n\n\nLet's take a look back at the three-day summit and hear from some of the key stakeholders, to get a glimpse into how this agenda was formed.\n\n\n\n\n\nOn day one, discussions centered around creating a resilient and dynamic economy.\n\n\n\n\n\nWith skills and training on the agenda, early tensions emerged between the Business Council - which represents employers - and union groups, which represent employees.\n\n\n\n\n\nUnion leaders, like ACTU Assistant Secretary Liam O'Brien, were calling for a new 1.5 per cent payroll levy on businesses with a turnover of above $500,000 to fund worker training.\n\n\n\n\n\n\"I think there is an acknowledgment that we have a problem in this country when it comes to employer investment in training. There is absolutely disagreement about how we get to the solution. Our movement firmly believes that the way in which we do that is to drive that transformation within businesses with a levy. That is the sort of thing that will require employers to make those necessary investments in skills and education.\"\n\n\n\n\n\nThe chief executive of the Business Council of Australia, Bran Black, says employers don't agree.\n\n\n\n\n\nHe says the government should incentivise training investment rather than tax companies for it.\n\n\n\n\n\n\"From business perspective, we just don't see that taxing the business community is the right way to deliver the outcome that Australia needs.\"\n\n\n\n\n\nDay one of the summit also focused on improving economic resilience amid global trade challenges.\n\n\n\n\n\nShiro Armstrong, a professor of economics at ANU, addressed the roundtable on how to deal with the domestic impacts of global uncertainty.\n\n\n\n\n\nHe told Sky News there was a consensus around removing more nuisance tariffs.\n\n\n\n\n\n\"These are tariffs that are very low already. They're not protecting any industries, but they cost more in compliance than they bring in revenue. So they're just an inefficiency in the economy that is important to get rid of.\"\n\n\n\n\n\nOn day two, talks turned to regulatory red tape and artificial intelligence.\n\n\n\n\n\nOne key productivity barrier identified by the Productivity Commission was the number of regulatory barriers they say are delaying progress on new project approvals.\n\n\n\n\n\nFaced with the challenge of removing burdensome regulations while protecting communities and the environment, Dr Chalmers opened day two, promising some win-wins.\n\n\n\n\n\n\"How can we quicken the pace of approval, so that we can build more of the stuff that we all want to see in our economy? Important focus today on competition and dynamism in the context of the Federation, as well. Making the Federation work more effectively in the interest of the states and territories and the Commonwealth and the national economy. I think there should be a lot of win-wins there.\"\n\n\n\n\n\nAlso under scrutiny was the progress on achieving the national target to increase housing supply by building 1.2 million new homes by 2029 [[what's called the National Housing Accord.\n\n\n\n\n\nA barrier identified was the expanding list of minimum requirements for buildings in Australia - under the National Construction Code.\n\n\n\n\n\nHousing Minister Clare O'Neil says there is broad support over the need for a pause to the code until mid-2029.\n\n\n\n\n\nChanges to the code that deal with safety issues, such as fireproofing, would be exempt from a pause.\n\n\n\n\n\nMs O'Neil says the government must understand which regulatory barriers are doing more harm than good.\n\n\n\n\n\n\"One of the really big problems that we know we can find in housing is this absolute impenetrable thicket of red tape that's faced by builders. I talked to a builder the other day who said to me, you know, Clare, back in the day, the hard part was building a home. Now it's getting the approvals, getting through the delays in the bureaucracy.\"\n\n\n\n\n\nThere was broad agreement about the need for better regulations around construction, but not all were on board with the idea of pausing the code.\n\n\n\n\n\nAustralian Council of Social Service chief executive Cassandra Goldie raised concerns that it could lead to poorer quality in the homes built.\n\n\n\n\n\n\"The last thing we should be doing is building houses that are uninsurable, or at real risk of becoming so within a few years.\"\n\n\n\n\n\nDay two also saw some consensus about reform to Australia's main environmental law - the Environment Protection and Biodiversity Conservation Act - which protects nationally significant animals, plants, habitats or places against the impacts of any new developments.\n\n\n\n\n\nCritics say the legislation is seen as outdated and ineffective.\n\n\n\n\n\nKelly O’Shanassy, the Australian Conservation Foundation chief, says there was more agreement on the need for change than she had anticipated.\n\n\n\n\n\n\"Whilst there's certainly some things I disagree with the minister on, he very clearly said today we need national environmental standards, we need a national regulator, and we need to have better, more efficient processes with the states. And I agree with all of that and really, so did everyone else around the table.\"\n\n\n\n\n\nArtificial Intelligence was also top of mind, with business and union leaders holding diverging views.\n\n\n\n\n\nAhead of the summit, Productivity Commission head Danielle Wood told the National Press Club that AI could lift the average worker’s income by $4,300 per year over the next decade.\n\n\n\n\n\nShe did concede some jobs will be lost to AI, but she says that's why investing in reskilling the workforce is also crucial for growth.\n\n\n\n\n\n\"We have new research from Jobs and Skills Australia that says probably the biggest impact on the labour market will be job augmentation, us working with the AI and changing the nature of our jobs, as opposed to job loss. But there invariably will be some job losses. I think, really importantly - and what we should have learned from pathways of reform - is that you can't leave people behind.\"\n\n\n\n\n\nBacking a more worker-centric approach, ACTU boss Sally McManus says it has to be everyday people who benefit from the technology.\n\n\n\n\n\nShe says a breakthrough was made on day two, with a consensus reached on the need for a fair model for AI in the workplace, one that protects workers.\n\n\n\n\n\n\"A big outcome of the roundtable is the fact that there is agreement that we are going to give this a real good go at coming up with a model to make sure that people are actually paid for what they produce. So, that's a big thing.\"\n\n\n\n\n\nWhen building a skilled and adaptable workforce, the government has also been urged to address the high rates of skilled-migrants working below their skill level.\n\n\n\n\n\nResearch* by Deloitte Access Economics found that almost half (44 per cent) of permanent migrants in Australia - that's 620,000 people - work below their skill level.\n\n\n\n\n\nNon-profit Settlement Services International commissioned the research.\n\n\n\n\n\nThe group says they have built bridges across sectors, to back the Activate Australia's Skills campaign, which proposes one national governance system for all overseas skills and qualifications recognition, overseen by an ombudsman.\n\n\n\n\n\nDane Moores is the head of strategic relations at Settlement Services International and the campaign manager for Activate Australia's Skills.\n\n\n\n\n\n\"It's stopping qualified people from working to their full potential and filling skills shortages. Due to barriers that are not related to their skills. So the current system, it's really expensive, it's slow, incredibly confusing. For some professions it can cost tens of thousands of dollars to go through the application process and it can take months, if not years, to get an outcome.\"\n\n\n\n\n\nAllegra Spender, the only Independent invited to the roundtable, says it's something that must be addressed.\n\n\n\n\n\n\"I've met these people in my constituency, where people come up and say, I got a skilled visa, and then I can't actually work. I have to go back and be apprentice, even though I've been qualified in the UK.\"\n\n\n\n\n\nThe final day saw discussion held on tax reforms, budget sustainability, and reforms to the care economy.\n\n\n\n\n\nThe federal opposition spokesman on treasury affairs, Ted O'Brien, says the government should commit to time-bound targets to reduce regulation, and introduce rules to contain spending and support budget repair.\n\n\n\n\n\nHe also raised questions around the cost of Australia's energy policy.\n\n\n\n\n\n\"My recommendation to the government is that it should do something it's never done before, which is a total system cost analysis to find the cheapest pathway possible to have an electricity grid that it can manage that has to be reliable and decarbonise over time. I am concerned that the government is going to double down on an energy policy which is already failing.\"\n\n\n\n\n\nAhead of talks on budget sustainability, the government announced that some children with autism will be moved off the NDIS and into a separate program called Thriving Kids.\n\n\n\n\n\nThe NDIS is the budget's third-largest expense and is set to cost taxpayers more than $52 billion in the financial year ending June 30, 2026.\n\n\n\n\n\nDisability Minister Mark Butler says the changes are needed to ensure the sustainability of the NDIS.\n\n\n\n\n\nBut opposition health spokesperson Anne Ruston says more clarity is needed for the parents and families impacted.\n\n\n\n\n\n\"It's created great uncertainty for families of these children. It creates great distress. So we're asking the Minister to come out and provide that level of certainty, because we can't be sure that these programs are right or otherwise unless we have that sort of detail.\"\n\n\n\n\n\nAmong the immediate reforms announced, Dr Chalmers says he will also progress a road user charge, amid concern in some quarters that electric vehicle drivers aren't captured by the fuel excise tax.\n\n\n\n\n\nA list of options for a model for the road user charge will be developed by state and territory treasurers by September 5.\n\n\n\n\n\nDr Chalmers also says Labor will introduce a long-awaited overhaul to national environmental laws before Christmas, with agreement on an expedited process.\n\n\n\n\n\nOn tax reforms, the Business Council's Bran Black says the government must act on the goodwill from the summit and implement the reforms raised in the roundtable.\n\n\n\n\n\nTreasurer Chalmers says he wants to address tax reform to ensure the system is fair and equitable across different generations.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/ultra-violettes-lean-screen-sunscreen-removed-from-shelves/xufwv9n7j",
    "title": "Ultra Violette pulls Lean Screen sunscreen from shelves after SPF tests show 'inconsistency'",
    "publish_date": "Fri, 22 Aug 2025 04:51:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Ultra Violette's Lean Screen SPF 50+ had performed the worst in consumer group Choice's testing earlier in the year.\n\nThe company continued to sell the product while undertaking its own testing, which returned significant inconsistency.\n\nUltra Violette's co-founders said in a statement they were \"deeply sorry\" one of their products had fallen short.\n\nOne of the sunscreen products identified by consumer group Choice earlier this year as failing to meet its marketed sun protection factor (SPF) ratings has been pulled from shelves.\n\n\n\n\n\nA Choice investigation into sunscreens earlier this year found 16 of 20 products from a range of popular Australian sunscreen brands failed to meet their claims.\n\n\n\n\n\nSunscreen brand Ultra Violette's Lean Screen SPF 50+ Mattifying Zinc Skinscreen had returned the worst results of all the sunscreens tested by the consumer advocacy group, returning an SPF of four.\n\n\n\n\n\nOn Friday, Ultra Violette posted a statement on social media saying it had investigated the \"concerning discrepancy in SPF testing results\" and decided to withdraw Lean Screen from the market, effective immediately.\n\n\n\n\n\nWhen Choice released its findings publicly in June, Ultra Violette co-founder Ava Chandler-Matthews defended her company's testing methods.\n\n\n\n\n\nThe new statement from the brand's co-founders said independent lab testing had returned results showing samples of the product returned widely varying SPF data.\n\n\n\n\"This week, we received results from those tests that demonstrated significant and, candidly, atypical variability. Across eight different tests, Lean Screen has now returned SPF data of 4, 10, 21, 26, 33, 60, 61, and 64.\"\n\n\n\n\n\nUltra Violette said, unlike the majority of its range, the product had been created by a third-party manufacturer, and it would no longer be working with that company.\n\n\n\n\n\nIt said it would be taking steps for more thorough testing, including working with a wider network of facilities, no longer working with the original testing laboratory of Lean Screen, and increasing the frequency of retesting.\n\n\n\nChoice chief executive officer Ashley de Silva said when its sunscreen test results were released earlier this year, it was done in the interest of the public.\n\n\n\n\n\n\"In a country where two in three people will be diagnosed with skin cancer , people deserve to trust that the SPF ratings on sunscreen are accurate and reliable,\" he said\n\n\n\n\n\n\"Today’s announcement from Ultra Violette confirms there is a clear problem with how sunscreen is regulated and tested in Australia.\n\n\n\n\n\n\"Without Choice's investigation, Ultra Violette's Lean Screen would still be on shelves, despite the fact that it does not provide anywhere near the amount of sun protection it claims to.\"\n\n\n\n\n\nChoice has called on the Therapeutic Goods Administration (TGA) to urgently provide an update on its investigation into the matter.\n\n\n\n\n\n\"Ultra Violette's product may not be the only product that is affected, and consumers deserve to know whether they can continue to trust SPF claims in Australia,\" de Silva said.\n\n\n\n\n\nUltra Violette has offered refunds for those who had purchased the product and committed to more rigorous SPF testing of its products.\n\n\n\nREAD MORE Why the TGA is recommending some sunscreen products be 'reformulated'\n\nOn Thursday, the TGA said its investigation was ongoing.\n\n\n\n\n\nIn a statement on its website, the TGA said it was undertaking a \"comprehensive review and analysis of the high volume of data received from sponsors\", but pointed out that \"given the complexity and scale of the material involved, this process will take time\".\n\n\n\n\n\nThe TGA acknowledged there were known issues with the method of testing currently used to determine SPF \"due, in part, because it relies on human subjects and a visual estimation of individual skin responses\".\n\n\n\n\n\nThe TGA is currently reviewing existing SPF testing requirements and considering whether alternative testing methods may be more reliable.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 2
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-may-have-made-an-ai-policy-breakthrough-but-how-does-it-compare-globally/ejj1gqfyi",
    "title": "Australia may have made an AI policy 'breakthrough', but how does it compare globally?",
    "publish_date": "Fri, 22 Aug 2025 01:44:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Treasurer Jim Chalmers doubled down on a promise this week to conduct another review into artificial intelligence (AI) regulation, to determine whether the technology needs new laws or can fit into existing ones.\n\n\n\n\n\nThe government will accelerate a national development plan around how Australians can use the technology, Chalmers said at the government's productivity roundtable on Thursday.\n\n\n\n\n\nAI could boost Australia's labour productivity by more than 4 per cent, but an expert warns the benefits may not be shared evenly, as Australia's peers around the world navigate the same challenges.\n\n\n\n\n\nAustralian Council of Trade Unions (ACTU) secretary Sally McManus said at the economic summit she was not calling for \"over-regulating\" AI, but argued for a worker-centric approach to rolling out the transformative technology.\n\n\n\n\n\nRegulation of AI proved a major dividing line between employers and unions heading into the talks.\n\n\n\n\n\nThe ACTU called for the government to force employers to consult with staff before introducing new AI tools, while business groups warned that additional regulation could stifle adoption and reduce productivity gains.\n\n\n\nIn a major development, unions and the tech sector struck a deal to design a model that would see Australian creatives paid for their work when it is used to train AI.\n\n\n\n\n\nMcManus described the agreement with Tech Council chairman Scott Farquhar as a \"breakthrough\".\n\n\n\n\n\n\"There's agreement that we’re going to give this a real good go at coming up with a model that makes sure that people are actually paid for what they produce. So that’s a big thing,\" McManus said.\n\n\n\n\n\nBusiness leaders also acknowledged that the risks of AI extend beyond job losses.\n\n\n\n\n\n\"I made the point that there’s risk not just for workers. Business owners are looking at their own future or extinction,\" said Australian Industry Group chief executive Innes Willox.\n\n\n\nA Productivity Commission report released earlier this month estimated AI could add $116 billion to Australia’s economy over the next decade, but only if the government avoids stifling the technology with heavy-handed regulation.\n\n\n\n\n\nThe government has previously said it's working with industry to develop a National AI Capability Plan due by the end of the year, which will set out how to boost investment, grow industry capability, improve AI skills, including retraining workers.\n\n\n\nAustralia's cautious approach\n\nThe Productivity Commission has recommended the government hold off on introducing new AI-specific laws.\n\n\n\n\n\nInstead, it says existing frameworks such as consumer protection, privacy, and anti-discrimination laws should be adapted first.\n\n\n\n\n\nAccording to its Harnessing Data and Digital Technology interim report, the commission states AI-specific regulations should only be considered as a last resort.\n\n\n\n\n\nThe report also urges the government to pause its work on mandatory guardrails for high-risk AI until these gaps in existing law are fully understood.\n\n\n\n\n\nIt further stresses specific regulation should only be introduced if those frameworks cannot be adapted and if technology-neutral approaches are not workable.\n\n\n\nThe 'high stakes' of AI\n\nAccording to the report, AI has the potential to lift labour productivity growth by 4.3 per cent over the next decade, but experts caution the benefits may be uneven, and warn that sidelining human oversight could undermine good governance.\n\n\n\n\n\nDaniel Popovski, AI policy and advocacy lead at the Governance Institute of Australia, told SBS News the stakes are high with the rise of so-called 'agentic AI' — autonomous systems that act with little human oversight.\n\n\n\n\"Agentic AI is not just about producing content like chatbots do. These are autonomous systems run on very little human oversight. That raises new and urgent questions about accountability, transparency, and workplace governance that cannot be ignored,\" Popovski said.\n\n\n\n\n\nPopovski said the conversation around AI is too often framed as one of job losses, overlooking its growth potential — provided there is a clear strategy in place.\n\n\n\n\n\n\"In reality, there is enormous potential for growth and augmentation if the transition is managed well. The challenge is making sure Australians are prepared and supported through these changes so that AI works for people, not against them,\" he said.\n\n\n\n\"We need a national AI strategy that sets out how the government will manage these challenges and opportunities.\n\n\n\n\n\n\"Good governance should be human-centric. It should support organisations that adopt AI responsibly and make sure the gains flow to all workers,\" Popovski said.\n\n\n\nHow the global landscape compares\n\nAround the world, governments are taking different paths to manage the rise of AI. Some are prioritising protections for workers through up-skilling, while others are moving ahead with binding rules.\n\n\n\n\n\nChina is pushing for global cooperation, and the United Kingdom and New Zealand are aligning oversight with existing laws.\n\n\n\n\n\nUnited States\n\n\n\n\n\nThe US AI action plan directs its labour department to fund rapid retraining for workers who lose jobs due to AI and to guide states on upskilling workers at risk of future displacement.\n\n\n\n\n\nEuropean Union\n\n\n\n\n\nThe EU is proceeding with the AI Act. Obligations for general-purpose AI models started on 2 August, with high-risk system requirements due in August 2026. A voluntary code of practice is already available to help companies prepare.\n\n\n\n\n\nChina\n\n\n\n\n\nAt the 2025 World AI Conference in Shanghai, China released a Global AI Governance Action Plan that calls for stronger international cooperation, inclusiveness and attention to environmental sustainability.\n\n\n\n\n\nUnited Kingdom\n\n\n\n\n\nThe UK government has said it will consult the public on AI legislation and is aiming for a proportionate approach that works with existing laws, following its pro-innovation framework.\n\n\n\nNew Zealand\n\n\n\n\n\nNew Zealand has published its first national AI strategy. It aligns with OECD principles and encourages responsible use while aiming to accelerate private sector adoption and innovation.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/no-you-re-not-imagining-it-that-round-shiny-thing-in-the-sky-is-the-sun-20250821-p5morn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "No, you’re not imagining it. That round shiny thing in the sky is the sun",
    "publish_date": "Sat, 23 Aug 2025 11:10:45 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "There’s a saying, mostly attributed to the Germans, that goes “there’s no such thing as bad weather, just inappropriate clothing”.\n\nI was contemplating this last week when, in my harried preparations to leave the house for the office, I reached for my gumboots. “Ha,” I thought, “I’ve got this wet weather thing sorted.”\n\nLike most Sydneysiders, I’m glad to see the back of this “rain event” which, the Bureau of Meteorology reports, has resulted in four or five times the usual dump of water for this time of year. Instead of an average of 80 millimetres for the month, we’ve had 370 millimetres as of last Friday. It’s a relief to see the sun.\n\nFun in the sun on Bondi Beach as the rainy weather lifts on Saturday. Credit: Flavio Brancaleone\n\nSenior bureau meteorologist Angus Hines says we’re in for a week of clear, sunny skies. Rather than rain, though, it will be windy.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-august-23-2025-20250823-p5mp75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Age photos of the week, August 23, 2025",
    "publish_date": "Sat, 23 Aug 2025 11:05:24 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "2/21\n\nNam Le has written a poem about the “ghosts” of the convent, which is being set to music at a concert later this month. Pictured with Lili Stephens Timothy O’Malley. Credit:Simon Schluter",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/sleepspot-founder-reveals-the-truth-about-napping-20250823-p5mp6z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sleepspot Founder reveals the truth about napping",
    "publish_date": "Sat, 23 Aug 2025 10:01:48 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Sleepspot Founder reveals the truth about napping\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/heavy-fog-interrupts-flights-in-adelaide-20250823-p5mp6y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heavy fog interrupts flights in Adelaide",
    "publish_date": "Sat, 23 Aug 2025 09:55:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Heavy fog interrupts flights in Adelaide\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 1
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/shoulder-charge-puts-grant-in-sin-bin-20250822-p5mp5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shoulder charge puts Grant in sin bin",
    "publish_date": "Sat, 23 Aug 2025 09:54:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "Shoulder charge puts Grant in sin bin\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/can-the-wallabies-beat-south-africa-again-yes-if-they-do-these-five-things-20250822-p5mp02.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Can the Wallabies beat South Africa again? Yes – if they do these five things",
    "publish_date": "Sat, 23 Aug 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "While last week’s historic win at Ellis Park was followed by Wallabies scarves and jerseys being pulled out from cupboards across the country, every Australian rugby fan is bracing for a Springboks response in Cape Town this weekend after a performance in Johannesburg labelled as “dogshit” by coach Rassie Erasmus.\n\nHistory suggests the Wallabies face an even greater challenge on Saturday (kick-off 1:10am Sunday, AEST). The last time they recorded back-to-back wins over the Springboks was Brisbane (2021) and the Gold Coast (2022).\n\nThe Wallabies haven’t beaten the Springboks twice in South Africa in a calendar year since 1963. The last time Australia opened a Rugby Championship campaign with two straight wins was in 2015.\n\nAs for back-to-back away victories in the tournament? You have to go back to 2000 (Wellington and Durban), when John Eales was captain.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/emotional-aiava-qualifies-for-us-open-20250823-p5mp6v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Emotional Aiava qualifies for US Open",
    "publish_date": "Sat, 23 Aug 2025 09:25:14 +1000",
    "category": "sports",
    "authors": [],
    "text": "Emotional Aiava qualifies for US Open\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/kid-gets-two-quick-goes-at-spectacular-crowd-catch-20250822-p5mp3d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kid gets two quick goes at spectacular crowd catch",
    "publish_date": "Sat, 23 Aug 2025 09:09:13 +1000",
    "category": "sports",
    "authors": [],
    "text": "Kid gets two quick goes at spectacular crowd catch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw2-west-ham-vs-chelsea-20250823-p5mp6q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW2: West Ham vs Chelsea",
    "publish_date": "Sat, 23 Aug 2025 09:00:46 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW2: West Ham vs Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/why-a-wallaroos-star-didn-t-tell-her-parents-she-was-debuting-for-australia-20250822-p5mozs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why a Wallaroos star didn’t tell her parents she was debuting for Australia",
    "publish_date": "Sat, 23 Aug 2025 09:00:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Adiana Talakai’s dad Petani was always her biggest supporter, but there was a time when she didn’t want him at her games. Specifically, the day Talakai made her debut for the Australian women’s rugby side, the Wallaroos, in a Test match in 2022.\n\nFor reasons she now struggles to explain, the NSW hooker decided she wouldn’t tell her father - and her whole family - that she’d been picked to play for the Wallaroos against Fiji in Brisbane. It’s just a camp, she fibbed.\n\n“I was scared that I was going to waste their time,” Talakai said. “I value what my parents have put into me. So I didn’t want to waste any more time and sacrifice that they have to. I didn’t want to disappoint them.\n\n“And yes, it was the dumbest thing I’ve ever done in my entire life.”",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/alleged-machete-attack-at-house-party-in-melbourne-20250823-p5mp6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Alleged machete attack at house party in Melbourne",
    "publish_date": "Sat, 23 Aug 2025 08:14:59 +1000",
    "category": "finance",
    "authors": [],
    "text": "Alleged machete attack at house party in Melbourne\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/lifestyle/meghan-markle-shares-video-of-husband-prince-harry-surfing-20250823-p5mp6m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Meghan Markle shares video of husband Prince Harry surfing",
    "publish_date": "Sat, 23 Aug 2025 08:14:42 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Meghan Markle shares video of husband Prince Harry surfing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/chalobah-seals-it-for-chelsea-20250823-p5mp6l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chalobah seals it for Chelsea",
    "publish_date": "Sat, 23 Aug 2025 08:00:11 +1000",
    "category": "finance",
    "authors": [],
    "text": "Chalobah seals it for Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/national/proteas-spinner-on-a-hat-trick-after-scalping-carey-20250823-p5mp6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Proteas spinner on a hat-trick after scalping Carey",
    "publish_date": "Sat, 23 Aug 2025 07:59:36 +1000",
    "category": "finance",
    "authors": [],
    "text": "Proteas spinner on a hat-trick after scalping Carey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/national/new-york-tour-bus-crashes-on-highway-multiple-dead-20250823-p5mp6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "New York tour bus crashes on highway, multiple dead",
    "publish_date": "Sat, 23 Aug 2025 07:25:34 +1000",
    "category": "finance",
    "authors": [],
    "text": "New York tour bus crashes on highway, multiple dead\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 42
  },
  {
    "url": "https://au.news.yahoo.com/elaborate-illegal-cubby-in-prime-location-costs-aussie-council-thousands-of-dollars-005824343.html",
    "title": "'Elaborate' illegal cubby in prime location costs Aussie council thousands of dollars",
    "publish_date": "2025-08-23T00:58:24Z",
    "category": "finance",
    "authors": [],
    "text": "A Perth council has been forced to fork out thousands after an illegal cubby caused extensive damage.\n\nAn illegal cubby constructed earlier this month in Point Resolution Reserve, Perth, caused thousands of dollars worth of damage. Source: POST Newspapers\n\nAn Aussie council has been forced to fork out some serious cash after an “elaborate” illegal cubby constructed in a prime location caused thousands of dollars of damage.\n\nThe bushland hideout with spectacular views of the Swan River was built earlier this month in Point Resolution Reserve, just metres away from luxury homes in Dalkeith — one of Perth’s most affluent suburbs.\n\nThe cubby, which featured a large hole to shield from the wind and an awning strung from nearby trees, was reported to authorities by an annoyed resident at the beginning of last week, prompting a quick response from City of Nedlands council workers.\n\nAfter arriving in the area, rangers were informed by locals that a group of teens riding e-scooters were responsible for crafting the makeshift camp littered with milk crates, a spokesperson for the city told Yahoo News.\n\nADVERTISEMENT\n\n“They were estimated between 12 and 15-years-old…and there was quite a few of them,” they explained, noting that two of the kids were reportedly seen being dropped off in a Porsche. “So my guess is that they were local,” the spokesperson added.\n\nNumerous bamboo stakes supporting new plants were removed from the area around the cubby. Pictured are similar stakes the City of Nedlands installed a few years ago. Source: City of Nedlands/Google\n\nIllegal cubby costs council thousands of dollars\n\nWhile it’s not uncommon to see such hideouts constructed around the river, this one in particular was “quite elaborate”.\n\n“It’s always been a popular haunt for kids to put cubby houses,” the spokesperson said. “The difference with this one is they caused damage.”\n\nNumerous bamboo stakes placed throughout the area to support new plants were removed. “Plus, there was a whole bunch of milk crates in it, and they had to be stolen from somewhere,” the spokesperson told Yahoo. It’s believed they were later returned to a nearby IGA.\n\nADVERTISEMENT\n\nThe cubby has since been removed and the stakes have been returned to their respective places.\n\n“It caused thousands of dollars in damage — that’s reached by how many stakes were pulled out, but also the time and energy needed by not only the rangers, but the parks and gardens crew as well having to go down rehabilitate,” the spokesperson said.\n\nThe kids responsible could face littering fines, however a lack of photographic evidence makes their involvement hard to prove.\n\nLocal real estate agent pokes fun at 'newly built bushland retreat'\n\nWhile residents were clearly not pleased by the youths’ actions, a local real estate agent has taken the opportunity to poke fun at the latest ‘property’ to hit the market.\n\nADVERTISEMENT\n\n“Why settle for four walls when you can have nature’s open plan?” Jamie Harrington with Hub Residential said, according to the POST, a locally-owned newspaper.\n\n“This newly built bushland retreat features industrial-style seating, no strata fees, year-round alfresco dining and uninterrupted water views!\n\n“With just a few compromises, this would be a lifestyle hard to beat!”\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 43
  }
]