[
    {
        "url": "https://www.9news.com.au/national/rba-surcharges-proposal-nsw-pub-owner-says-customers-will-pay-more/ede51b8d-a09c-436d-912b-776a012c8a99",
        "title": "You might pay more for a beer under proposed surcharge ban",
        "publish_date": "Wed, 16 Jul 2025 00:16:54 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "A﻿ regional pub owner has warned the RBA's proposed card surcharge ban could drive up the price of a beer as publicans are forced to pass the fee back onto customers.\n\nThe Reserve Bank wants to end debit and credit card surcharges for Eftpos, Mastercard, and Visa in Australia, a ban which it claims would save customers a combined $1.2 billion per year.\n\nPub, cafe, restaurant and other hospitality owners are now worried they will foot the bill and will need to hike up prices to ease this fresh wave of financial strain if the ban goes through.\n\nREAD MORE: Backpacker killer Bradley John Murdoch takes deadly secret to his grave\n\nCobargo Hotel and Motel owner David Allen. (Supplied)\n\nPub owner David Allen, who owns Cobargo Hotel and Motel in regional south-east NSW, told 9news.com.au it could cost him up to $1500 more per month per terminal if the surcharge ban is implemented next year.\n\n\"We're on a very good rate and there are some businesses that aren't on those good rates, but it's still costing us about $1500 a month in surcharges and a fee each month to hire the terminal,\" Allen said.\n\n\"We've got five terminals here. So, it's about $20,000 a year.\"\n\nAllen said many hospitality venues are already feeling a huge strain after the rate decision last week and an ever-persisting cost-of-living crisis.﻿\n\nHe predicts the proposal could lift the price of things like coffee, a parmigiana and even beer.﻿\n\nThe pub owner doesn't want his regional customers to fork out more for a simple pleasure, but it could be reality by next year.﻿﻿\n\n\"We're around that $9-$9.50 mark for beer and that's a psychological barrier already,\" he said.\n\n\"We just wouldn't be able to afford to cop that whole $20,000.\n\n\"If we couldn't pass it on to the customer, we'd have to put prices up.\n\n\"There's just no fat left on the animal.\"\n\nAllen predicts the proposal could lift the price of things like coffee, a pub meal and even beer.﻿ (Supplied)\n\nAllen said the surcharge ban, combined with higher wages and superannuation changes, are stretching businesses to breaking point.\n\n\"We're just getting squeezed at both ends, that's the reason why there's so many hospitality businesses that keep going under,\" he added.\n\n\"It's not rocket science, you just can't keep doing it.\"\n\nAround 90 per cent of Australian businesses are estimated to be better off under the proposed policies, the RBA said yesterday.\n\nHowever, Australian Hotels Association CEO Stephen Ferguson said the proposed ban doesn't make much sense if the guise of saving customers money in surcharges results in higher prices.\n\nHe said the bigger vendors may be able to wear the cost, but smaller businesses like the pub in Cobargo are going to \"really hurt\".\n\n\"﻿In the hospitality sector, the really small guys, coffee vendors and small cafes operate on a margin of 3 to 5 per cent,\" he told 9news.com.au.\n\n\"The bigger scale hotels will operate maybe up to 10 per cent, but [the smaller ones] can't afford that one per cent coming out of their profit, and they'll just pass that cost on.\"\n\nThe price of beer is already edging towards $10 in the regional pub. (Getty)\n\nThe RBA has also proposed more transparency around fees by requiring providers to display their wholesale charges clearly.\n\nFerguson said this isn't enough to ensure business owners get the best deal.\n\n\"It's just more convenient to stick with what you know and deal with one bank instead of dealing with multiple,\" he said.\n\n\"It's a big leap of faith to say everyone's going to have this magic epiphany and everyone's going to start finding the lowest cost.\"\n\nA feedback window on the proposals is open until August 26 this year, before the reforms are finalised.\n\nView the full consultation paper online here .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/american-idol-music-supervisor-and-husband-both-found-dead-at-la-home/e5200bc4-fcee-4d0c-9135-9884fc7f7c2a",
        "title": "'American Idol' music supervisor and husband found dead at LA home",
        "publish_date": "Tue, 15 Jul 2025 23:49:39 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "\"We are devastated to hear of Robin and her dear husband, Tom's, passing. Robin has been a cornerstone of the\n\nIdol\n\nfamily since 2009 and was truly loved and respected by all who came in contact with her,\" a representative for\n\nAmerican Idol\n\ntold CNN in a statement.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/weight-loss-medication-online-telehealth-subscription-services-eating-disorder-risk/e4edb39b-5a43-41e6-bd69-986639ce90a1",
        "title": "Ease of buying weight loss drugs online worrying doctors",
        "publish_date": "Tue, 15 Jul 2025 22:01:49 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Fill out a questionnaire, send a few photos, answer a call﻿ from a doctor.\n\nFor some Australians, that's all it takes to get weight loss drugs delivered straight to their door – and it's making experts nervous.\n\nA rising number of telehealth companies are offering ﻿prescription medications like Wegovy (similar to Ozempic), Saxenda and Mounjaro online without customers ever having to meet a medical professional face-to-face.\n\nSome Australians are getting Wegovy and Mounjaro online without ever having to meet a medical professional face-to-face. (Getty)\n\nMany of these companies say their goal is to help Australians who don't have the time to wait for a GP appointment to access weight loss treatment in a more convenient way.\n\nBut these low-touch telehealth models could in some instances make it easier for Australians who may not need weight loss drugs to get their hands on them.\n\nIncluding millions living with or at risk of an eating disorder.\n\nWeight loss drugs available online﻿\n\nA number of telehealth companies currently operating in Australia offer prescriptions for brand name weight loss drugs ﻿based on information that can be easily faked.\n\nProspective customers are typically required to fill out an ﻿online questionnaire about their physical health and medical history, and submit photos of their body.\n\nThis information is used to decide if they are eligible for weight loss treatment.\n\nBut there's nothing preventing customers from lying about their health or submitting digitally altered photos of their bodies.\n\n﻿If deemed eligible, customers are connected with a prescribing doctor via phone or video call for additional assessment before being approved.\n\nIf approved, they can order the prescribed medication online and have it delivered to their home through a telehealth subscription model.\n\n\"Patients know about these medications and are seeking them.\" (Getty)\n\nA number of telehealth companies offering weight loss drugs state on their websites that they adhere to rigorous eligibility criteria and work with expert practitioners to ensure they approve patients who qualify for treatment.\n\nMany also say they highlight information about common side-effects associated with weight loss drugs and offer ongoing support from medical professionals and health coaches.﻿\n\nThese services are pricier than going to the GP for a ﻿weight loss prescription and getting it filled at a pharmacy but some Aussies are willing to pay for the convenience.\n\nOr ﻿for the lack of scrutiny, suggests Head of Communications and Engagement at The Butterfly Foundation Melissa Wilton.\n\n\"Anecdotally, we have heard of people exaggerating their weight to access these medications,\" she said.\n\n\"We have also heard reports of people photoshopping or editing their bodies to appear larger than they really are.\"\n\nEating disorders on the rise﻿\n\nAn estimated 1.1 million Australians currently live with an eating disorder, a figure which has increased by more than 20 per cent over the last decade.\n\nMore than one in 10 Aussies will experience an eating disorder in their lifetime but fewer than one third get treatment or support.\n\nExperts fear these telehealth services make it easier for those affected to access weight loss drugs when it's not appropriate for their physical or mental health.\n\n\"Patients know about these medications and are seeking them,\" dietitian and RACGP Obesity Management chair Dr Terri-Lynne South told 9news.com.au.﻿\n\n\"And they know how to fudge the results to any questions that are asked, if they're asked.\"\n\nThere's nothing preventing patients from lying when asked about eating disorders as part of the telehealth screening and without access to a patient's health records, it can be difficult for medical professionals to pick up on warning signs over the phone.\n\nREAD MORE: One Aussie state looks to add two new public holidays\n\nThe Butterfly Foundation advocates for video call screening as an absolute minimum standard, but encourages in-person assessments wherever possible.\n\n\"It's essential that people seeking weight loss medications receive comprehensive psychological and medical assessments, including reviewing history of eating disorders or disordered eating concerns, as well as potential risk,\" Wilton said.\n\nThis is especially important because eating disorders are very complex psychological and physical illnesses that don't always present in the number on a scale.\n\n﻿Many Australians who experience eating disorders do so in larger bodies but weight loss drugs shouldn't be seen as a \"band aid\" solution for them either.\n\nThe ethics of advertising weight loss drugs\n\nMany of these telehealth companies ﻿employ direct-to-consumer marketing﻿ via social media, where some have tens of thousands of followers.\n\nThe Therapeutic Goods Advertising Code and other ﻿advertising standards ban them from naming the weight loss drugs they sell.\n\nSome ﻿advertise weight loss drugs as a \"quick fix\" and fail to highlight the risks and side-effects, others use shame-based messaging and stigmatising imagery.\n\n\"We have noticed an increase in companies skirting the law, often specifically targeting people with body insecurities, which can increase body dissatisfaction,\" Wilton said.\n\n﻿South added these advertisements, which often include before and after photos and language that glorifies weight loss, \"just smack of how weight-centric our society still is\".\n\nMany of these telehealth companies ﻿employ direct-to-consumer marketing﻿ via social media. (Getty)\n\nButterfly and other organisations in the Eating Disorder Alliance are advocating for tighter regulations and increased governance around advertising and prescribing weight loss medications, especially for telehealth businesses.\n\nThey're calling for comprehensive medical assessments before prescribing, ﻿measures to ensure telehealth providers are accountable to a safe standard of practice, increased awareness about the risks associated with weight loss medications (especially for individuals with or at risk of eating disorders) and stricter marketing regulations.\n\nSouth added that ﻿GPs must be equally careful about how and when they prescribe weight loss drugs to patients in-clinic.\n\n\"There is a lot of pressure on on GPs to do what they call 'six minute medicine' [and] that leaves no time to do some of the more appropriate checks and balances,\" she said.\n\nFor confidential and free support for eating disorders call the Butterfly National Helpline on 1800 ED HOPE (1800 33 4673) or visit www.butterfly.org.au to chat online or email.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/video-of-three-dogs-lands-australian-business-owner-in-trouble/31660896-e2f8-4def-a79e-1d03169ffd6c",
        "title": "The three-second Instagram video that saw a business owner's account suspended",
        "publish_date": "Tue, 15 Jul 2025 06:03:54 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "An innocent video of three dogs looking out a window has landed an Australian business owner in trouble with Meta.\n\nRochelle Marinato, the owner of a pilates equipment supplier, posted the footage to her personal Instagram account and said she received an email from the social media giant that her account had been suspended for \"breaching community guidelines around child sexual exploitation, abuse and nudity\".\n\nAn AI moderator appeared to have detected an issue with the image and mistaken it for an image of children.\n\nREAD MORE: PM brushes off concerns of Chinese retaliation as port showdown looms\n\nThe video of three dogs landed the Australian business owner in trouble. (Supplied)\n\nMarinato told Nine's 2GB radio she received an email to her business account where she promotes her products and was advised that account had been suspended as well.\n\nShe said she was told it was associated with an account which breached community guidelines.\n\nShe appealed the decision multiple times and sent more than 22 emails to Meta but she had no help.\n\n\"I had no idea that by putting up this little three-second video of the dogs…\" she said.\n\n\"Even when I received the original email from Meta saying my account was suspended, I thought this will be fine, I'll get it back shortly.\n\n\"But then I received the email about my business account and I was a little more worried but it does give you an option to appeal at first, so I appealed.\n\n\"Immediately, my appeal was also assessed by AI and they were denied, so from then my business account was permanently disabled.\"\n\nREAD MORE: Rescued backpacker reveals why she abandoned car\n\nA Meta spokesperson said Marinato's case was investigated by the company and restored following an appeal.\n\n\"We take action on accounts that violate our policies, and people can appeal if they think we've made a mistake,\" the spokesperson said.\n\nBefore her account was restored, Marinato said she went through the process of paying a third party.\n\n\"This is someone my kids actually found on TikTok and their account doesn't exist anymore,\" she said.\n\n\"This seems to be what they do.\n\n\"The problem is so widespread and I'd heard of people paying to get their accounts back.\"\n\nThe business owner has spent the last three weeks researching how to get her account back.\n\n\"Our revenue dropped by 75 per cent,\" she said.\n\n\"With losing that account, all of my Instagram advertising was gone as well, because I advertise quite heavily on Meta.\n\n\"It was a really significant impact on the business because we rely so heavily on social media, especially in the fitness space.\n\n\"We lost everything.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/rescued-german-backpacker-carolina-wilga-reveals-she-dropped-12kg-while-lost-in-the-wa-outback/5c7f14f8-ac73-435e-ad20-32f5a98cd11b",
        "title": "Backpacker reveals brutal toll of outback ordeal",
        "publish_date": "Tue, 15 Jul 2025 02:25:50 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "Wilga was picked up on the side of the road on Friday after she flagged down\n\nstation owner Tania Henley\n\nsome 24km from the site where she crashed her van 12 days earlier.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/landmark-torres-strait-island-climate-change-case-reaction/105536756",
        "title": "Torres Strait Islanders invite PM to witness climate harms firsthand",
        "publish_date": "Wed, 16 Jul 2025 02:10:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Two Torres Strait traditional owners at the heart of a landmark climate case against the Australian government have invited the prime minister to their islands after they lost in the Federal Court.\n\nUncle Paul Kabai and Uncle Pabai Pabai from the remote low-lying islands of Saibai and Boigu, just kilometres from Papua New Guinea, have spent four years fighting for the government to be found negligent when it comes to its emissions reduction targets and adaptation measures.\n\nUncle Pabai was one of the applicants in the case arguing that the government had failed in its duty of care. (ABC News: Baz Ruddick)\n\nOn Tuesday, Federal Court Judge Michael Wigney found the government did not owe them a duty of care.\n\nBut the Guda Maluyligal traditional owners said their home and cultural connection was too important for them not to keep up the fight.\n\nUncle Paul Kabai says the judge's decision was a \"shock\". (ABC News: Baz Ruddick)\n\n\"It is overwhelming for me and Uncle Pabai as we have gone through this journey since 2021 and for us, it is emotional,\" Uncle Paul told ABC News Breakfast.\n\n\"We're not going to stop here.\"\n\nFrom Cairns, hundreds of kilometres from his ancestral home of Saibai, he called on all Australians to \"battle together and give a strong voice to the government\".\n\n\" Sea level is rising and our communities — Boigu and Saibai — they are about 1.3 metres above sea level, so we are sinking. \"\n\n\"It's time now for us to keep knocking at the government's door.\"\n\nTorres Strait Islander dancers performing a traditional ceremony outside the court. (ABC News: Baz Ruddick)\n\nThe judgement\n\nOn Tuesday, Justice Wigney said that while the Torres Strait Islanders' case had proven many of its factual allegations, the law currently did not provide an \"effective legal avenue\" to claim damages for harm \"as a result of government decisions and conduct\".\n\nHe said he was bound by the previous decisions of appellate courts.\n\n\"That will remain the case unless and until the law in Australia changes either by the incremental development or expansion of the common law by appellate courts, or by the enactment of legislation,\" he said.\n\n\"Until then, the only real avenue available to those in the position of the applicants and other Torres Strait Islanders involves public advocacy and protest, and ultimately, recourse via the ballot box.\"\n\nThe applicants are concerned about the impact the decision could have on future generations. (ABC News: Baz Ruddick)\n\nThe judge said that without urgent action, the Torres Strait Islanders' worst fears would be realised.\n\n\"Unless something is done to arrest global warming and the resulting escalating impacts of climate change, there is a very real risk that the applicant's worst fears will be realised and they will lose their islands, their culture and their way of life, and will become, as it were, climate refugees.\"\n\nWhere to from here?\n\nThe Grata Fund's Isabelle Reinecke says the decision was \"bittersweet.\" (ABC News: Buz Ruddick)\n\nThe Grata Fund financed the case, which was modelled on a successful case from the Netherlands.\n\nIts executive director and founder, Isabelle Reinecke, said they were \"just getting started\".\n\n\"Last night I think [there] was a lot of defiance and anger and grief and I now just actually feel a strong sense of hope,\" she told the Indigenous Affairs Team.\n\n\"We've seen outpourings of solidarity from around the country and I know the community are feeling strong and this is just the beginning of the next chapter.\"\n\nShe said the court made \"strong statements of fact\".\n\n\"I also have hope, because the court did not say that accountability is impossible under the law, it just said that it is not ready yet and so I have a lot of hope that the law will and can develop,\" she said.\n\n\"The findings of the court were extraordinarily strong on the facts and the uncles are still considering an appeal, so that journey is not yet over.\"\n\nShe said the fact that legal change could be slow was evidenced by the Mabo case, led by Meriam man Eddie Koiki Mabo, which spent 10 years in the courts.\n\nShe said the team was pleased to see the government's response to Tuesday's decision included a commitment to \"adapting to climate impacts\", and she called for the government to commission a study into what those adaptation measures could be.\n\nThe judge was highly critical of climate targets set by the Coalition in 2015, 2020 and 2021, finding they did not \"engage with or give real or genuine consideration to the best available science\".\n\nShadow Minister for Energy and Emissions Reduction Dan Tehan defended the previous government's record and said in a statement that in 2021–22 \"emissions were down 28 per cent on 2005 levels, exceeding our international commitments.\"\n\n\"Labor is yet to explain credibly how they will achieve their targets and how much it will cost, without fudging the numbers,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/peruvians-mining-in-kalgoorlie-goldfields/105501928",
        "title": "Young Peruvians in Kalgoorlie hope to learn from 'mining superpower'",
        "publish_date": "Wed, 16 Jul 2025 01:38:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Food is the biggest thing mining student Roberto Huapaya Montes misses from home.\n\nFive months ago, the Peruvian national moved to Kalgoorlie.\n\n\"I don't have the magic to make my Peruvian food,\" he said.\n\n\"I have to adapt.\"\n\nAlmost 600 kilometres from Perth in WA’s outback, the red dirt town might seem worlds apart from his Latin American home.\n\nThe similarities between Peru and Kalgoorlie are not immediately obvious, but Mr Huapaya Montes said there were lots to be found.\n\n\"I also come from a mining country, so it's pretty familiar, but at the same time different,\" he said.\n\nMr Huapaya Montes is one of a handful of Peruvian students studying at the Western Australian School of Mines.\n\nKalgoorlie-Boulder is home to one of Australia's largest open-cut gold mines. (ABC Goldfields-Esperance: Jarrod Lucas)\n\nHe was keen to explore a new culture after completing his undergraduate degree in the country's capital, Lima.\n\nIt was the mining on Kalgoorlie's doorstep that made it an attractive place to study for Mr Huapaya Montes.\n\n\"You go with your work uniform and you go to the street, you go to the supermarket,\" he said.\n\n\"It's more the identity.\"\n\nPeru and Australia both boast positions as global leaders in mining exports.\n\nMining accounts for around 63 per cent of Peru's total exports, led by copper, gold, zinc and iron.\n\nA visit from the embassy\n\nPeru's ambassador Vitaliano Gallardo Valencia said the South American country looked to learn a lot from Australian mining processes.\n\nHoping to strengthen the ties with Western Australia's mining industry, the ambassador made a stop in Kalgoorlie-Boulder on a recent trip to the state.\n\n\"Like the technology sector, you can have the impression you are in the centre of the industry in Silicon Valley,\" Mr Gallardo Valencia said.\n\n\" Visiting Kalgoorlie, I am feeling likewise. I am in the centre of the world mining superpower, the Australian mining superpower. \"\n\nVitaliano Gallardo Valencia took a seven-hour train journey to visit Kalgoorlie. (ABC Goldfields-Esperance: Katrina Tap)\n\nMr Gallardo Valencia said greater connectivity with the world had made Western Australia an incentive for more Peruvians to travel to the state.\n\n\"The journey to arrive in Australia was more of a tourist stop,\" he said.\n\n\"You leave Lima by plane, you stop in Santiago, and from Santiago to Easter Island, from Easter Island to Tahiti, from Tahiti to Sydney, from Sydney to Perth.\n\n\"You can't perceive how important changes in connecting our countries have been.\"\n\nEconomic partnerships in the Pacific\n\nThe relationship between the two countries is also underpinned by a free trade agreement signed in 2020.\n\nIn times of global trade uncertainty, Mr Gallardo Valencia said maintaining strong partnerships in the Pacific was at the forefront.\n\n\"This is the moment when you see who your partners are,\" he said.\n\n\"We need to be a reliable source of critical minerals, and we need to be open as a country with an open market economy to ensure the flow of rare earth minerals to the rest of the globe.\"\n\nAustralian Mining Equipment Services and Technologies (METs) were set to be among the benefits of a zero-tariff agreement with Peru.\n\nIn 2017, METs were Australia's top export to Peru, according to the Department of Foreign Affairs and Trade, valued at close to $77 million.\n\nMr Gallardo Valencia said modern mining required an increasingly diverse set of skills.\n\n\"You sometimes think that the only point of connection is geology, metallurgy, mining engineering,\" he said.\n\nHe said Peru was looking to Australia for innovation in areas such as AI, environmental sustainability, working with First Nations communities, and encouraging more women to enter the mining industry.\n\nMr Huapaya Montes would like to see more sustainable mining practices in his country.\n\nHe hoped to take what he had learnt from Australia back to Peru once he graduated.\n\n\"Now we have to be aware we have to give the next generation what we've been given,\" Mr Huapaya Montes said.\n\nRoberto Huapaya Montes has enjoyed meeting people from around the world while studying in WA. (ABC Goldfields: Katrina Tap)\n\nWhile he might miss Peruvian food, Mr Huapaya Montes has found a community of other Latin Americans who like to cook together on the weekends.\n\nHe has enjoyed sharing his culture with other students at his university.\n\n\"We danced salsa, and then an Aussie was teaching us how to dance,\" he said.\n\n\"It's a really good community.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/australian-rules-football-legend-barrie-robran-dies/105537228",
        "title": "Breaking: Australian rules football legend Barrie Robran dies aged 77",
        "publish_date": "Wed, 16 Jul 2025 01:15:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian rules football champion and Hall of Fame legend Barrie Robran has died at the age of 77.\n\nRobran is widely regarded as one of the greatest footballers South Australia has produced.\n\nHis list of honours includes three Magarey Medals and two SANFL premierships, and he was a seven-time North Adelaide best-and-fairest winner.\n\nRobran played 201 games for North Adelaide from 1967 to 1980 and 17 matches for South Australia's state side, including as captain.\n\nRobran was famed for his aerial ability and powerful marking. (Supplied: North Adelaide Football Club)\n\nNorth Adelaide has paid an emotional tribute to Robran, describing him as \"certainly the most revered son of our beloved Roosters\", and an \"an icon, a mentor, and a true gentleman whose presence enriched everyone around him\".\n\n\"It is with profound sadness and heavy hearts that we share the devastating news of the sudden passing of North Adelaide Football Club legend, Barrie Robran,\" the club said in a statement.\n\n\"Barrie was, without doubt, in our view the greatest ever to play the game.\n\n\" His unparalleled skill, quiet humility, and unwavering dedication left an indelible mark on our club and the broader community. \"\n\nA statue depicting him leaping for a mark was unveiled outside Adelaide Oval in 2014.\n\nHe is survived by his wife Taimi and two sons, Jonathon and Matthew.\n\nRobran was born in 1947 in Whyalla where he attended Whyalla South Primary School and Whyalla Technical High School.\n\nAt age 17, he began work for BHP which then ran the regional city's shipyards and steelworks.\n\nHe showed early sporting prowess not just as a footballer, but also as a cricketer, basketballer and table tennis player.\n\nHe was playing A-grade football for North Whyalla in the Spencer Gulf League when he was recruited by North Adelaide, making his senior debut against Sturt in 1967.\n\nRobran rides in a parade after winning the 1968 Magarey Medal. (Supplied: North Adelaide Football Club)\n\nRobran achieved his Magarey Medals in 1968, 1970 and 1973, and it was during that time that he played an instrumental role in North Adelaide's premiership seasons in 1971 and 1972.\n\n\"Barrie was more than just a footballer; he was the embodiment of everything North Adelaide stands for – excellence, humility, and unwavering loyalty,\" North Adelaide president Kris Mooney said.\n\n\"His legacy will forever inspire us, and his quiet grace touched everyone he met. We are incredibly proud to call him one of our own.\"\n\nRobran (left) with fellow South Australian football icon Russell Ebert, who died in 2021, and renowned commentator Bruce McAvaney. (Supplied: Jordan Bianchini PAFC )\n\nAmong many stand-out games was his best-on-ground performance during the Championship of Australia match against Carlton in 1972.\n\nTwo years later, while captaining South Australia, Robran sustained a career-altering knee injury in an incident involving Leigh Matthews that \"cruelly curtailed\" his playing days.\n\nRobran is said to have turned down repeated offers to play in the VFL and his 2001 elevation to legend status within Australian Football Hall of Fame was accompanied by a citation acknowledging that he was \"regarded as the best player never to play at AFL level\".\n\n\"Robran had speed, agility, lightning reflexes, a magnificent leap and an uncanny ability to read the game better than those around him,\" the North Adelaide website states.\n\n\"Those who were lucky enough to see him play were awestruck by his brilliant performances.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/pew-research-shows-global-view-of-china-improves-as-us-worsens/105536860",
        "title": "Australians now favour economic ties with China over the US, survey finds",
        "publish_date": "Wed, 16 Jul 2025 00:56:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "A majority of Australians say it is more important to have strong economic ties with China than with the United States, according to new research from the Washington-based Pew Research Centre.\n\nPew's latest survey of 24 countries found that opinion towards the US and its president, Donald Trump, had deteriorated, while views of China and its president, Xi Jinping, had improved in many countries worldwide.\n\nMore than half — 53 per cent — of Australians surveyed said they favoured placing more importance on economic ties with China, a large increase from 39 per cent in 2021.\n\nOnly 42 per cent of Australians said it was more important to prioritise economic ties with the US — a drop from 52 per cent who said the same thing in 2021.\n\nStill, Australian views of China and Mr Xi remained largely negative.\n\nSome 76 per cent of Australians reported having an unfavourable view of China overall, compared to just 23 per cent who said they viewed China favourably.\n\nOnly 17 per cent of Australians reported having confidence in Mr Xi to \"do the right thing regarding world affairs\", compared with 77 per cent who had \"no confidence\".\n\nPew found the US was viewed more favourably than China in eight countries, China was viewed more favourably in seven, and the two were viewed about equally in the remainder.\n\nDonald Trump's political opponents in the US accuse him of ceding global influence to China. (AP: Evan Vucci)\n\nPew did not provide definitive explanations for the shifts, but Laura Silver, associate director of research, said it was possible that views of a country may change when those of another superpower shift.\n\n\"As the US potentially looks like a less reliable partner and people have limited confidence, for example, in Trump to lead the global economy, China may look different in some people's eyes,\" Dr Silver said.\n\nAlso, China's human rights policies and its handling of the pandemic — which were related to negative views of the country in the past — may not weigh as much this time, she said.\n\nRich countries sour on US except in Israel\n\nA group of Democratic senators this week accused the Trump administration of ceding global influence to China by shuttering foreign aid programs, imposing tariffs on allies, cracking down on elite universities, and restricting visas for international students.\n\nChina was the big disruptor in our region. Now the US is determined to take that title Photo shows Prime Minister Anthony in China Just as Australia is asserting that its national interests are different from those of both China and the United States, it seems the US may force us into a choice we don't want to make.\n\nIn the Pew findings, 35 per cent of those in 10 high-income countries surveyed consistently — including Canada, France, Germany and Italy — have favourable opinions of the US, down from 51 per cent from last year.\n\nBy comparison, 32 per cent of them have positive views of China, up from last year's 23 per cent.\n\nAnd 24 per cent of them say they have confidence in Mr Trump, compared with 53 per cent last year for then-US president Joe Biden.\n\nMr Xi scored a slight improvement: 22 per cent of those in these rich countries say they have confidence in the Chinese president, up from last year's 17 per cent.\n\nHowever, people in Israel have far more favourable views of the US than of China: 83 per cent of Israelis like the US, compared with 33 per cent who say they have positive views of China.\n\nSome 69 per cent of Israelis said they had confidence in Mr Trump, while only 9 per cent expressed confidence in Mr Xi.\n\nMr Trump is a popular figure among Israelis. (Reuters: Leah Millis)\n\nPew surveyed more than 30,000 people across 25 countries — including the US, which was excluded from the comparison — from January 8 to April 26, 2025.\n\nThe margins of error for each country ranged from plus or minus 2.5 to plus or minus 4.7.\n\nChina's economy grows robustly despite trade war\n\nThe Chinese economy slowed slightly in the last quarter as Mr Trump's trade war escalated, but it still expanded at a robust 5.2 per cent pace, officials said on Tuesday (Beijing time).\n\nThat compares with 5.4 per cent annual growth in January-March.\n\nStrong exports have kept China's economy afloat. (Reuters: Go Nakamura)\n\nChinese authorities said that in quarterly terms, the world's second-largest economy expanded by 1.1 per cent.\n\nIn the first half of the year, the Chinese economy grew at a 5.3 per cent annual pace, the official data show.\n\nHowever, some analysts said actual growth may have been significantly slower.\n\nZichun Huang of Capital Economics noted that investments in fixed assets such as factory equipment rose only 2.8 per cent in the first half of the year, implying 2.9 per cent annual growth in May and a mere 0.5 per cent increase in June.\n\nThe 5.2 per cent growth rate overstates the pace of expansion by about 1.5 percentage points, she said.\n\nCapital Economics' activity proxy shows growth in China's gross domestic product, or GDP, at less than 4 per cent year-on-year in April and May, Dr Huang said, forecasting annual growth of 3.5 per cent for full-year 2025.\n\n\"The economic outlook for the rest of the year remains challenging,\" she wrote in a report.\n\nDr Huang added, though, that \"political pressure to meet annual growth targets, even if only on paper, means that published GDP growth will be much higher\".\n\nLoading...\n\nA key factor behind the latest upbeat data was strong exports.\n\nOn Monday, China reported that its exports accelerated in June, rising 5.8 per cent from a year earlier, up from a 4.8 per cent increase in May.\n\nProduction of high-tech products, vehicles and electrical machinery and equipment rose by about 10 per cent or more from a year earlier.\n\nA reprieve on painfully high tariffs on Chinese exports to the US prompted a rush of orders by companies and consumers as the two sides resumed trade talks.\n\nChinese companies also have expanded exports to and offshore manufacturing in other countries such as Vietnam, helping to offset the impact of higher tariffs imposed by the Trump administration.\n\nWhat Xi Jinping's private lunch with Anthony Albanese really means Photo shows A man in a black suit and pink tie shake the hand of a man in a dark blue suit and blue tie The prime minister's visit to Beijing featured an unusual one-on-one meal with China's most powerful man. It's significant in more ways than one.\n\nBut a 0.1 per cent decline in consumer prices in the first half of 2025 showed continuing weakness in domestic demand, a long-term challenge for the ruling communist party as the Chinese population declines and ages.\n\nThose troubles deepened during and after the COVID-19 pandemic.\n\nFalling property prices and slowing retail sales were also of concern, said Lynne Song of ING Economics.\n\nPrice cutting by Chinese manufacturers to help compete in overseas markets is adding to deflationary pressures that ultimately erode their competitiveness, Louise Loo of Oxford Economics said in a report.\n\nChinese leaders have set a growth target of 5 per cent for this year, in line with last year's growth.\n\nA resumption of US tariffs of up to 245 per cent if Washington and Beijing fail to meet an August 12 deadline for a new trade deal could derail the recovery in exports, a major driver of growth and employment.\n\nABC/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/tuberculosis-vaccination-via-lungs-may-be-more-effective/105535198",
        "title": "Researchers on brink of breakthrough in tuberculosis protection",
        "publish_date": "Wed, 16 Jul 2025 00:09:03 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A research team from north Queensland has found delivering the tuberculosis (TB) vaccine directly to the lungs could create stronger protection against the world's deadliest infectious disease.\n\nThere is one available vaccine to protect against TB, developed in 1921, with little known about why the vaccine sometimes stops offering protection in adolescence.\n\nDoctors Harindra Sathkumara and Andreas Kupz are part of the research team. (Supplied: JCU)\n\nWorld Health Organization data revealed 10.8 million new TB infections globally in 2023 and 1.3 million deaths.\n\nThe team from James Cook University found that administering a stronger strain of the only existing Bacille Calmette-Guérin vaccine, or BCG, generated an effective immune response in the lungs.\n\n\"This link between how the body repairs the lung after minor injury and how that can lead to better protection against tuberculosis is really what this study is about,\" associate professor Andreas Kupz, who led the study, said.\n\nTB is primarily spread through the air when a person with active tuberculosis disease coughs, sneezes or speaks.\n\nAndreas Kupz from the Australian Institute of Tropical Health and Medicine. (Supplied: JCU)\n\nDr Kupz said high global rates of TB were in part due to the limited efficacy of the only licensed vaccine, developed to protect adults in 1921 via a shot to the arm.\n\n\"Because it is delivered as an injection after birth, it often doesn't produce long-term protection against respiratory infections,\" he said.\n\nDr Kupz said the team's research could hold several important implications for the development of a more effective TB vaccine, eventually saving lives.\n\nTB not a 'historic disease'\n\nTB has largely been eradicated from Australia, but is more common in northern Australia, particularly in Cape York and Torres Strait Islands.\n\nThe latest available Queensland Health data shows the state treated 189 people for TB infections in 2023.\n\nDr Kupz said Cape York and the Torres Strait Islands were most susceptible because of their proximity to Papua New Guinea, which experiences high rates of infection.\n\n\"Papua New Guinea is actually a hotspot for tuberculosis globally, not just in terms of the numbers of TB they have, but also drug-resistant strains,\" he said.\n\n\" There are actually quite a few cases of TB being treated in the Cairns hospital that have come in from Papua New Guinea or the Torres Strait Islands. \"\n\nCommon in nearest neighbours\n\nPort-Moresby-based health advocate Anne Clarke said the 45,000 TB cases recorded in Papua New Guinea in the past year were a significant strain on the health system and economy.\n\n\"The exposure of the wider community to this infectious disease agent is about 100 per cent in this town,\" Dr Clarke said.\n\n\"Everybody is affected.\"\n\nDr Kupz said he hoped his team's research would eventually lead to more effective protection against infections.\n\n\"Pending ethical approvals, we hope to see it go to human trial by the end of 2026 or early 2027,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/xi-jinping-meeting-anthony-albanese-signals-diplomatic-reset/105536022",
        "title": "Xi Jinping has Beijing singing to his tune on Anthony Albanese",
        "publish_date": "Tue, 15 Jul 2025 23:56:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's increasingly clear that Chinese President Xi Jinping's preferred Western leader is Anthony Albanese.\n\nThe evidence?\n\nA six-day trip across China. A private lunch with Xi.\n\nThe decision to prioritise Albanese over the foreign ministers of India and Russia, and more than 4 minutes of prime-time coverage of his visit on the 7pm CCTV News — China's most influential and tightly controlled state media news bulletin.\n\nPew survey finds Australians now favour China economic ties over US Photo shows Xi Jinping in a navy suit and red tie clapping his hands and smiling slightly Pew Research Centre's latest survey of 24 countries found that opinion towards the US and its president, Donald Trump, had deteriorated, while views of China and its president had improved.\n\nIn Chinese political theatre, every action is deliberate.\n\nThere's no doubt that the message now filtering through every level of the Chinese political system is this: a re-elected Australian prime minister is friendly to China, and the Communist Party chief wants the country to do business with him.\n\nThe fact this message is being actively broadcast across such a complex and opaque system is telling.\n\nXi rarely engages Western democracies on equal footing. But Albanese's trip showed something different: respect, caution and optimism.\n\nThe two leaders made it clear that mutual respect is now the foundation for deeper engagement, at least for the second decade of a comprehensive strategic partnership.\n\nThat's no small thing when you're talking about Xi Jinping, one of the most powerful men in the world.\n\nAlbanese's diplomatic balancing act\n\nIf there's one thing other countries can learn from Albanese's China approach, it's the line he has used repeatedly since taking office:\n\n\" We will cooperate where we can, disagree where we must, and engage in our national interest. \"\n\nIt's more than a slogan — it's a carefully balanced playbook for all sides.\n\nFor those in Canberra wary of Beijing's intentions, it says: we won't be naive.\n\nFor those in Beijing who remember the volatility of previous Australian governments, it says: we're here to talk, not to fight.\n\nAnthony Albanese hosted a number of meetings with business and industry leaders during his time in China. (Supplied: X/AlboMP)\n\nThis is what made Albanese's message land. Chinese leadership values consistency. Saying this out loud to Xi Jinping, on Chinese soil, was a display of diplomatic maturity.\n\nFew Western leaders manage that. Some hedge, others grandstand. Albanese was direct and it worked.\n\nWhy was it effective? Because the message echoes a phrase by Zhou Enlai, China's first premier, who in 1955 at the Bandung Conference, said: \"Seek common ground while reserving differences.\"\n\nIt became a cornerstone of China's diplomatic approach to both enemies and neighbours.\n\nAlbanese's message, though delivered in democratic terms, resonates with that same logic.\n\nXi makes it personal\n\nIn China's political structure, Xi is the only real decision-maker.\n\nWhen he chose to host Albanese and his fiancee, Jodie Haydon, personally, bypassing the traditional role of the premier, it wasn't just a three-course meal.\n\nIt was a display of serious personal and political investment.\n\nThat gave Albanese a rare opening, a chance to raise hard issues directly with the one man who can actually deliver. No filters. No bureaucratic hedging.\n\nThat kind of access is hard-won and Australia shouldn't underestimate its significance.\n\nLoading...\n\nIt also signals something else: Xi values the connection. He's looking to build rapport.\n\nThis is how top-down trust works in China. When Xi wants progress, the system follows.\n\nIn Canberra, trust flows from the public, through lobbying, into parliament, then to the top.\n\nChina calls for greater economic ties with Australia amid global turmoil Photo shows Li Qiang and Anthony Albanese walk down a red carpet in front of ceremonial guards holding guns. Prime Minister Anthony Albanese meets with China's Premier Li Qiang, who takes a thinly veiled swipe at Donald Trump's tariff policies while calling for greater economic ties between Australia and China.\n\nBoth governments now face the challenge of reconciling these different systems in discussions on trade, diplomacy, tourism, education, climate change and more.\n\nBut while Beijing may have reset with Albanese, the Australian public hasn't necessarily followed.\n\nAccording to a new Pew Research Center report, only 23 per cent of Australians hold favourable views of China, rising from 14 per cent since last year.\n\nPew's findings underscore the challenge ahead — public sentiment will take far longer to repair than diplomatic channels.\n\nDespite warm smiles and shared meals, Australians remain deeply sceptical of Beijing's long-term intentions.\n\nThat's the tightrope Albanese is walking — between Chinese favour and domestic suspicion.\n\nWhether this reset holds will depend not just on diplomacy, but on results.\n\nLoading\n\nChinese Australians in the spotlight\n\nOne certain outcome of Albanese's grand trip is that Chinese tour groups are coming back. Visa waivers for Australians remain in place.\n\nBut for Australians to feel safe in China again, especially in remote western regions, one unresolved issue looms large: the fate of Australian citizen Yang Hengjun, who is currently under a suspended death sentence.\n\nHis continued detention undermines the softening tone of the visit.\n\nYang Hengjun thanks Australia as health declines Photo shows A photo of a Chinese-Australian man Yang Hengjun, sitting on an outside table, wearing a navy polo shirt with a red collar. The Australian government continues to lobby for Dr Yang, who is imprisoned in China and has a cyst on one of his kidneys.\n\nFor Canberra, it remains a test of good faith. If China wants to shift Australian public opinion — especially among families considering study, travel or investment — this must be resolved, no matter how polished the propaganda.\n\nThere was, however, a notable moment of inclusion. In his remarks to Premier Li Qiang, Albanese highlighted the 1.4 million Australians of Chinese descent.\n\n\"That is a benefit to both of our countries because they provide a very real personal link between us,\" he said.\n\nIt was a reminder that the relationship wasn't just bilateral, it was human. But trust, again, must go both ways.\n\nFor Beijing, trust is top-down.\n\nFor Australia, it must embrace its own Chinese Australian citizens, many of whom still face suspicion and political scrutiny in both countries.\n\nLoading...\n\nIf Canberra wants to rebuild ties with China, it must also build trust with Chinese communities at home.\n\nThey are not a liability.\n\nThey are a strength that helps the Australian society to understand China.\n\nA different kind of alignment\n\nThere's no doubt that Beijing wants an independent Canberra that doesn't echo Washington.\n\nOne thing is also clear in Xi's message — Australia doesn't need to choose between China and the US. It needs to engage with clarity, consistency and confidence.\n\nAustralia's ability to engage China confidently depends on its internal capacity and, right now, that's underdeveloped.\n\nChina was the big disruptor in our region. Now the US is determined to take that title Photo shows Prime Minister Anthony in China Just as Australia is asserting that its national interests are different from those of both China and the United States, it seems the US may force us into a choice we don't want to make.\n\nMany of Australia's public institutions, especially in the security and intelligence sectors, still rely heavily on American frameworks and analysis when it comes to understanding China.\n\nThis dependence has left Australia with only a narrow space for independent expertise and at times, a lack of clarity in forming its own China policy.\n\nAt the same time, academic and policy research into China faces chronic funding shortages, political pressure, and limited freedom to explore complex or sensitive issues.\n\nScholars say they are often sidelined or silenced, creating a knowledge vacuum at a time when understanding China has never been more urgent.\n\nIf Australia wants to chart its own path between Washington and Beijing, it must invest in its own capacity — not just in diplomacy and defence, but in language, history, politics and society.\n\nWithout that, Australia risks being reactive rather than strategic.\n\nIt was Gough Whitlam, after all, who recognised Beijing before Richard Nixon.\n\nThat legacy shows where Australia once stood in the race — not where it is now.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/southern-ocean-surf-reef-transforms-albany-wa/105530202",
        "title": "'High-performance' artificial reef transforms town's surf scene",
        "publish_date": "Tue, 15 Jul 2025 23:33:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "As he stands at a lookout overlooking the rugged beauty of King George Sound, on the south coast of Western Australia, Peter Bolt's eyes are drawn to something in the water.\n\nIt's a perfect left-hand wave, reeling towards Middleton Beach as a stiff offshore breeze whips spray from its crest.\n\nThe sight is one to behold, especially for a lifelong surfer in Bolt who grew up riding the waves near Albany, a port town 420 kilometres south of Perth.\n\nBut it wasn't always this way.\n\nIn fact, until very recently, the sight of perfect waves breaking at Middleton Beach as clean Southern Ocean swells wrapped into the sound was largely a fantasy inside the minds of the town's many surfers.\n\nPeter Bolt has been a long-time surfer and advocate for the Albany surf reef. (ABC News: Daniel Mercer)\n\nMiddleton Beach for most of the year — and for practically all of every winter — was the scene of almost unsurfable close-outs.\n\nFor Bolt, however, this is no dream.\n\nIt is the realisation of an endeavour that started when he moved back to Albany with a young family more than 30 years ago.\n\n\"I think I came back to Albany in 1990,\" Bolt said.\n\n\"And we started working on a feasibility study for the artificial surf reef at Middleton Beach.\n\n\" We just felt that's where we needed the juniors to have something decent to surf … in town where they can get access to it. \"\n\n'Peaks and troughs'\n\nFor decades, Bolt and a band of fellow advocates, some of whom died before their vision could become a reality, faced a litany of obstacles and setbacks.\n\nForemost among them was the cost.\n\nConstruction of the Albany surf reef required precision engineering. (Supplied)\n\nSurf reefs don't come cheap.\n\nBolt said those pushing for the reef were almost invariably locked in an uphill battle to convince politicians and other potential donors that the money would be worth it.\n\nThere were also concerns about how a reef might affect the coastline and environment at Middleton Beach, the town's main tourist drawcard.\n\nThen there was the chequered history of artificial reefs themselves, which had been prone to failure and disappointment elsewhere in the world.\n\n\"There was no money or desire to do anything beyond that [original feasibility study],\" he said.\n\n\"And in some ways that was a positive thing because the design was around using geo-textile bags and historically, when they have been used to build reefs or protect shorelines, they failed because they split, they settle, they move and that would have been a failed reef, another failed reef.\n\n\"So it was not bad timing in some ways, looking back in hindsight.\"\n\nGreg Stocks set the funding ball in motion when campaigning for the 2017 state election. (ABC Great Southern: Andrew Chounding)\n\nThose advocating for the Southern Ocean Surf Reef caught a break in 2017 when both the major parties at a state level pledged $5 million to make it a reality.\n\nThe pledges also included financial help from the City of Albany and other sources, including a local quarry.\n\n'A series of breaks'\n\nThe final break came in 2022 when the federal parties came on board, both pledging $5 million to get the reef over the line.\n\nSoon enough, Bolt said expressions of interest were sought, tenders were called and contracts were signed.\n\nAs a result, a specialist marine engineering crew from New Zealand spent close to six months in Albany building a high-class wave.\n\nTo do so, they used precision geospatial equipment to spread 70,000 tonnes of granite rock graded into three layers.\n\nBolt said the results were there for all to see.\n\nThe Albany surf reef is already drawing crowds. (ABC News: Daniel Mercer)\n\n\"It's a bit more challenging than expected,\" he said.\n\n\"We were aiming for an intermediate wave, which it is when the swell is smaller.\n\n\"But as it gets bigger, it breaks out there and it's fairly shallow. So it's intermediate-to-advanced on most days.\"\n\nIt's a view echoed by other surfers.\n\nLike Bolt, Cameron Warburton is a local who's surfed the waves around Albany for most of his life.\n\nAnd, like Bolt, he says the artificial surf reef has eclipsed his expectations.\n\n\"It's the power of the wave,\" Warburton said.\n\n\"We don't have many waves around here where you've got a really punchy top-to-bottom take-off wave.\n\n\" And this wave is that — it's a really high-performance wave. \"\n\nMore than a wave\n\nCameron Warburton says the reef is transforming the town's surf scene. (ABC News: Daniel Mercer)\n\nWarburton said the reef was already transforming Albany's surf scene.\n\nMiddleton Beach, near the heart of the town, had traditionally been overlooked by most surfers because of its second-rate waves most of the time.\n\nBut he said the reef was becoming a surf destination, drawing the crowds and generating a buzz.\n\n\"We've never really had the opportunity to grab a surf and a coffee or grab a surf and head down to the new brewery and have a beer,\" he said.\n\n\" I think it's just creating a culture around town that's really good. \"\n\nA clean wave breaks on the Albany surf reef. (ABC News: Daniel Mercer)\n\nBolt said the aim was for the reef to generate surfable waves 41 per cent of the time, but the actual figure was far higher than this.\n\nHe said he had \"not surfed Middleton Beach so much in all my life, certainly at this time of the year\".\n\nWhile the reef had come with an up-front cost, Bolt said it was a one-off spend that would draw waves, surfers and the money they and their families spent for a hundred years or more.\n\nMore importantly, he said the reef was set to breed future generations of surfers who may not have otherwise taken up the sport.\n\n\"I get stoked every time we come down here,\" Bolt said.\n\n\"When I see the kids come down here before school, in the dark, to get a wave before they go to school, and then they zip down here again after school, I go, 'Yeah, that's it.'\n\n\"That's what this was all about.\"\n\nThe Southern Ocean Surf Reef officially opens today.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/what-is-the-point-of-it-all-says-scheffler-ahead-of-open-quest/105536402",
        "title": "'What is the point?' Scheffler questions golfing success ahead of The Open",
        "publish_date": "Tue, 15 Jul 2025 22:23:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "One would imagine three-time major champion Scottie Scheffler is eager to continue American dominance at The Open and lift the Claret Jug for the first time this week at Royal Portrush.\n\nThe 29-year-old is the bookmakers' favourite after a stunningly consistent season, including winning the PGA Championship, and during his pre-tournament press conference on Tuesday, local time, he spoke of his growing love for links golf.\n\nBut when asked how long he celebrated his victories, an introspective Scheffler veered off into questioning what was even the point of being the best golfer in the world.\n\n\"It feels like you work your whole life to celebrate winning a tournament for like a few minutes,\" Olympic champion Scheffler said. \"It only lasts a few minutes, that kind of euphoric feeling.\n\n\"To win the Byron Nelson Championship at home, I literally worked my entire life to become good at golf to have an opportunity to win that tournament.\n\n\"You win it, you celebrate, hug my family, my sister's there, it's an amazing moment. Then it's like, OK, what we eating for dinner? Life goes on.\"\n\nScheffler has been world number one for 112 consecutive weeks and has earned more than $US87 million ($134.93 million) in prize money on the PGA Tour, not counting bonuses and endorsements, and says he loves living out his dreams.\n\nBut he admits he has a daily wrestle with what it all means.\n\n\"Is it great to be able to win tournaments and to accomplish the things I have in the game of golf? Yeah, it brings tears to my eyes just to think about,\" Scheffler said.\n\n'Tough pill to swallow': Rahm rues missed opportunity as Scheffler claims major Photo shows GettyImages-2215786872 Jon Rahm says he is a \"little bit embarrassed\" after faltering late in a stunning PGA Championship comeback, as Scottie Scheffler claimed victory.\n\n\"That kind of sense of accomplishment is a pretty cool feeling. But at the end of the day, I'm not out here to inspire the next generation of golfers. I'm not out here to inspire someone to be the best player in the world because what's the point? This is not a fulfilling life.\n\n\"It's fulfilling from the sense of accomplishment, but it's not fulfilling from a sense of the deepest places of your heart.\n\n\"There's a lot of people that make it to what they thought was going to fulfil them in life, you get to number one in the world, and they're like, 'What's the point?' I really do believe that, because what is the point?\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's like showing up at the Masters every year; it's like, why do I want to win this golf tournament so badly? Why do I want to win The Open Championship so badly?\n\n\"I don't know because, if I win, it's going to be awesome for two minutes. I'm kind of sicko; I love putting in the work. I love the practice, living out my dreams. But at the end of the day, sometimes I just don't understand the point.\"\n\nScheffler has a 14-month-old son, Bennett, with his wife, Meredith, and said they remain more important than any golf accolades.\n\n\"I'm blessed to be able to play golf, but if my golf ever started affecting my home life or it ever affected the relationship I have with my wife or my son, that's going to be the last day that I play out here for a living,\" he added.\n\n\" This is not the be-all and end-all. This is not the most important thing in my life. That's why I wrestle with, 'Why is this so important to me?' I'd much rather be a great father than I would be a great golfer. \"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/house-sitting-helped-me-save-money-and-buy-my-own-home/105521184",
        "title": "How I house-sat my way to solo home ownership at 42",
        "publish_date": "Tue, 15 Jul 2025 22:06:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "I'm a 42-year-old divorced stand-up comic. This isn't a cry for help — I'm merely putting my life in context.\n\nI'm allergic to working in the corporate world despite an MBA and multiple burnouts to prove my eligibility as a capitalist stooge.\n\nAnd I'm also approaching one of the most vulnerable groups of people at risk of homelessness: single women over the age of 45.\n\nAfter my favourite uncle passed away in Pakistan, I was forced to confront the fragility of life and how I wanted to live; that I wanted to be of service while also being a creative. And lay down my roots, find my ground.\n\nAt the time, I was bouncing between sublets because I didn't want to rent a shoebox for $2,000 a month, nor live in a share house.\n\nIt's bad enough doing stand-up comedy in my middle ages, let alone being part of a share-house gang. I don't like chore charts.\n\nProperty ownership has always been a strange concept to me, but the older I get, the more I understand that without it, I'm at the mercy of others to not evict me. But there's the catch-22 of trying to save money while renting in the current market.\n\nA friend told me about a Victorian housing scheme where the government contributes up to 25 per cent of the property price for a share of the property — which you buy back over time.\n\nBut first, I'd need to qualify for this scheme and a bank loan.\n\nSo my task became to find a meaningful, stable job, save a deposit — and not live in a share house until I had bought my own place.\n\nFirst: finding a job\n\nIn my previous life, I was a market research consultant in the corporate sector. That was until I couldn't take the soul-crushing, profits-focused approach anymore.\n\nThen I tried surviving on an array of casual gigs: Urdu translator, mental health support provider, medical typist.\n\nGoing back to a more stable role, I wanted to have an actual career that worked for me.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nLuckily, after a few months of job hunting, I landed a social policy adviser role at a not-for-profit that I genuinely loved.\n\nIt's not as lucrative as my former corporate roles but it's fulfilling and it's sustainable.\n\nHouse-sitting started with a friend's cats\n\nTo avoid living in a share house as I waited to buy my own place, I turned to house-sitting.\n\nLuckily, my first experience with a cat's claws was followed by many other more pleasant interactions. (Supplied: Amna Bakhtiar)\n\nI'd previously forayed into this nomadic lifestyle when I'd quit a high-paying corporate job to do my personal Eat Pray Love journey around Australia.\n\nThis time, in Melbourne, I started with looking after a friend's three cats for a month.\n\nIt was lovely until the fattest jumped on my bare back and dug its claws in for grip.\n\nThen I minded another friend's cat for a couple of weeks whose sweetness restored my faith in the feline race.\n\nAnd so it continued.\n\nI joined some house-sitting Facebook groups, which led to more gigs. Pretty soon, I was going from house-sit to house-sit; cat to dog.\n\nMy house-sits ranged from a week to several months. In between, I stayed with generous friends and was able to line up house-sits in a way that I didn't overstay my welcome with them.\n\nAs an introvert, house-sitting suited my need for space and the pets kept me from being lonely. (Supplied: Amna Bakhtiar)\n\nThe good and the bad of long-term house-sitting\n\nMost people, upon finding out I house-sat for 18 months, express awe bordering on disbelief.\n\nNo-one was more surprised than my family in Pakistan, where you have security guards to make sure no-one gets inside your house, while in Australia people freely give you their key.\n\nOver the 18 months, I sampled a buffet of accommodation types and suburbs: from CBD flats to suburban homes. The collection of books and music were varied from place to place, as was the spice collection; some people don't even have salt while others have imported saffron.\n\nIt helped me discover the kind of place I wanted to live in; the type of suburb that was right for me and the kitchen gadgets I could no longer live without (hello air fryer!).\n\nOne of my charges having a puppuccino. (Supplied: Amna Bakhtiar)\n\nThe main challenge was the lack of stability and not knowing where I'd live next.\n\nThe memory foam pillow in a new home would take a couple of days to take note of my skull and I'd get used to the animals, only to repeat this cycle in a few weeks.\n\nNot to mention, there are only so many wardrobe combinations of three pants and five tops that come with this lifestyle.\n\nWas it better than sharing? Having a place to myself was helpful as a creative introvert and it never got isolating because of the cute pets.\n\nPlus, house-sitting and a frugal lifestyle allowed me to save almost $60,000.\n\nHave you chosen a particular lifestyle as a way to save money or make life more affordable? We'd love to hear from you. Share with us here.\n\nBuying my own home\n\nWhen I qualified for the housing scheme, I started property-hunting.\n\nAfter six weeks of crowded inspections, I viewed a sunny two-bedroom unit with a courtyard and decided this was it. Good location, good size, good price. I promptly sent my offer and fortunately, the owner accepted.\n\nAfter 18 months of house-sitting I moved into my own home. (Supplied: Amna Bakhtiar)\n\nNow I've a job I love — that I would probably never have found had I not decided on this goal — and a property I'm stoked about.\n\nAnd thanks to saving on rent for 18 months, even after the deposit, I have a healthy offset account that I hope will allow me to pay off my mortgage by retirement age, despite buying at 42.\n\nWould I house-sit again? Yes, but just on holidays and in the meantime, I'll get a cat — and a house-sitter when I go away.\n\nAmna Bakhtiar is a stand-up comic and writer from Pakistan living in Naarm/Melbourne.You can find her on Instagram.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/club-world-cup-in-trumps-america-reveals-fifa-hosting-problems/105524690",
        "title": "Empty seats and big delays mean World Cup issues will trouble Trump's America",
        "publish_date": "Tue, 15 Jul 2025 22:02:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "The FIFA Club World Cup, called \"the undisputed pinnacle of global club football\" by the governing body's president, came to a close after weeks of poor ticket sales, empty seats and significant weather delays.\n\nDespite Gianni Infantino's claims the tournament showcased \"a world-class stage\" for football, the test run for the 2026 FIFA World Cup at times appeared to underwhelm.\n\nAlmost four in every 10 seats across the cup's 11 host cities weren't filled by fans.\n\nEngland's Chelsea won the 2025 FIFA Club World Cup after beating Paris Saint-Germain 3-0. (Reuters: Kai Pfaffenbach)\n\nThe US will co-host the 2026 FIFA World Cup with neighbours Canada and Mexico, with 104 matches played across 16 cities between June 11 and July 19.\n\nWith less than 12 months until the first ball is kicked, FIFA's plans for the tournament face potential challenges as it invites professional footballers into a United States governed by the uncertainty of politics and life under Donald Trump.\n\nSo, what does that do to the viability of America's key role in what many argue is the world's biggest sporting event? Let's break it down.\n\nWhat is the FIFA Club World Cup?\n\nThe modern, global FIFA Club World Cup has existed — in one form or another — since the year 2000. Back then, it was known as the FIFA Club World Championship and was designed to pit the club footballing champions of each continental knockout competition against each other.\n\nThe tournament has been played 20 times since, but in 2025 it was revamped to become a quadrennial event described as \"a powerful demonstration of club football's global appeal\".\n\nThe 21st edition this year boasted its largest-ever format, expanding from just seven teams when it was last played in 2023 to 32 teams representing 20 countries.\n\nIt's a feat Infantino has also sought to achieve in next year's nations-based World Cup, which will include teams from 48 countries — the tournament's first expansion since the adoption of 32 teams in 1998.\n\nThe Club World Cup's logistical headaches\n\nWhen the Club World Cup began in mid-June, stadiums of monumental capacity awaited rowdy crowds at venues located across the US — including in heavyweight cities like New York, Los Angeles, and Miami.\n\nWhat came next for various games were rows and rows of empty seats — broadcast around the world — as fans simply didn't show up.\n\nFewer than 4,000 fans attended the Group F match between Ulsan HD and Mamelodi Sundowns in Orlando. (AP: John Raoux)\n\nThe club tournament simply isn't as popular as the World Cup, where players compete for their countries rather than for a domestic team.\n\nThe costs — both for games and travel — also kept some fans away, while for others there were lingering concerns of potential US Immigration and Customs Enforcement (ICE) raids at matches amid Mr Trump's crackdown on illegal immigration.\n\n\"It's like playing football during lockdown,\" observed one fan on social media during the June 18 Ulsan HD vs Mamelodi Sundowns FC match.\n\nFor days afterwards, FIFA didn't register the attendance of that game on its website. That was because the official number at the 25,500-seat Inter&Co Stadium in Orlando, Florida came out to be 3,412 by the final count — fewer than 14 per cent of seats had been filled.\n\nThere were similar scenes eight days later when Japan's Urawa Red Diamonds played Mexico's CF Monterrey at LA's famous 89,702-seat Rose Bowl Stadium, where fewer than 14,500 fans showed up.\n\nOn June 18, 11,974 people entered Seattle's Lumen Field to watch Argentina's River Plate play Urawa but more than 82 per cent of the seats stayed empty.\n\nA handful of other early fixtures at various venues also managed to fill less than a third of the total seating capacity.\n\nThere were some notable exceptions — which FIFA has chosen to focus on, instead.\n\n\"The total attendance across the group stage of 1,667,819 — at an average of 34,746 fans per match — shows just how the most inclusive global club competition ever has captured the imagination of supporters,\" a statement said.\n\nStadiums across the US were less than packed during various FIFA Club World Cup games. (AP: Brynn Anderson)\n\nMonday's final between Chelsea and Paris Saint-Germain (PSG) understandably topped the attendances list, with more than 81,000 people at New Jersey's MetLife Stadium.\n\nAnother 80,619 fans went to the Rose Bowl to watch PSG play Atlético Madrid in the groups, while 76,611 watched Real Madrid face Borussia Dortmund in New York.\n\nThe Palmeiras vs Chelsea match in Philadelphia attracted 65,782 spectators, while Bayern Munich and Boca Juniors played in front of 63,587 in Miami.\n\nDespite those figures, analysis conducted by the ABC of all of the Club World Cup fixtures shows that while almost 2.5 million people attended games, on average, 38.93 per cent of the total seating capacity of all host venues remained unfilled.\n\nThere was not a single sell-out throughout the cup. The LA PSG vs Atlético Madrid fixture fell just short of the 84,163 who watched the English FA Cup final at Wembley Stadium and was well above the 64,327 attendance for the Champions League final — European club football's biggest match.\n\nMore than 68 per cent of the Mercedes-Benz Stadium in Atlanta was unfilled for Chelsea's opening match against Los Angeles FC. (AP: Mike Stewart)\n\nAt the 2022 FIFA World Cup in Qatar, there was an average attendance of just under 50,000 per game for the opening week.\n\nDavid Zdrilic, an ex-Socceroo, former assistant coach with the Chicago Fire in the US-based Major League Soccer (MLS) competition and current Perth Glory head coach in the A-League, says he believes the empty seats could be attributed to the freshness of the Club World Cup as an international tournament format.\n\nHe also says he expects next year's World Cup to generate far higher levels of fan interest, as it has over previous decades.\n\n\"It's not so much a United States thing, it's more the Club World Cup is a new concept — and you're not just selling it to the United States, you're selling it to the rest of the world,\" he told the ABC.\n\n\"It's the first time we've seen anything like it.\n\n\" The World Cup's the biggest tournament in the world, in any sport… last time they played in the US [in 1994], the fans came out. \"\n\nExtreme summer heat and storms play havoc\n\nEmpty stadiums, however, were not the only obstacle faced by FIFA in the US over the past two months.\n\nGuardiola blasts Club World Cup Photo shows Pep Guardiola gives directions to Rodri as a referee watches Pep Guardiola believes playing at the Club World Cup has the potential to leave Manchester City players \"destroyed\" when it comes to the upcoming Premier League season.\n\nPlayers were expected to take to the field during extreme heat, which FIFPRO — the federation representing professional footballers — says will likely pose an even bigger issue next year.\n\nDue to football's popularity in Europe, many Club World Cup matches were played in the middle of the day so fans overseas could watch in real time at night.\n\nThe cup was also played during a time typically known in the US for intense summer thunderstorms, which saw more than six games suspended for periods of up to two hours.\n\nThose lengthy delays sparked concerns over player welfare and supporter disinterest after stadiums quickly emptied out once teams left the field to seek shelter.\n\n\"I can understand that for security reasons, you have to suspend the game,\" Chelsea manager Enzo Maresca said after the club's June 29 match against SL Benfica was halted.\n\n\" If you suspend seven, eight games, that means that probably is not the right place to do this competition. \"\n\nMultiple Club World Cup games experienced weather delays of up to two hours due to lightning from nearby storms. (AP: Seth Wenig)\n\nThose criticisms highlighted a sentiment also shared by former Liverpool manager Jürgen Klopp.\n\n\"[The] Club World Cup is the worst idea ever implemented in football,\" he said last month.\n\n\"People who have never had anything to do with day-to-day business are coming up with ideas… perhaps not everyone has recognised the real problem yet, that next season players will suffer injuries they've never had before.\n\n\"If not this season, then it will happen at the World Cup or afterwards.\"\n\nZdrilic says that while weather delays can be a point of frustration for players and staff involved in the game, they're unavoidable.\n\n\"It's not ideal … It can totally reset the game in one direction or the other,\" he said.\n\n\"I don't think it's going to be a massive problem. [The US] had a World Cup before, it was very successful in terms of getting things right.\n\n\"The US are built for big stadiums, big crowds, they've got great infrastructure… there's a lot of positives.\"\n\nCould Trump's politics hurt the FIFA World Cup?\n\nYes, according to Dr Emma Shortis, director of The Australia Institute's international and security affairs program.\n\nShe says Donald Trump's aggressive illegal migration crackdown and ongoing ICE raids are already impacting the desirability of travelling to the US for international visitors.\n\n'Cops in the form of alligators': Trump's threat to unauthorised migrants Photo shows Donald Trump inspects beds behind fencing. Donald Trump is threatening to send unauthorised migrants to a prison camp surrounded by alligators in his latest move to expel \"illegal aliens\" from the US.\n\n\"We already have evidence for that in that travel to the US is down by international tourists,\" Dr Shortis said.\n\n\"There's been a downturn in the industry generally and revenue for the industry because people are reconsidering travelling to the US in direct response to what the Trump administration is doing.\n\n\"That uncertainty is only going to increase.\n\n\"People's legitimate concerns about travelling to the US — not just as athletes but as spectators — are only going to deepen in the next couple of years in the lead up to the World Cup next year and then the [2028 Los Angeles] Olympics.\"\n\nZdrilic, however, pointed to the political and welfare concerns raised prior to the 2018 FIFA World Cup in Russia, which he says ultimately did not create any turbulence during the tournament.\n\n\"World Cups always find a way to break all those sort of boundaries [that] are put up,\" he said.\n\n\"There's always a political background to almost any event that's been put out there, especially in the time that we live now, but when they're putting on such a big event, surely they have to make accommodations to allow for the people to come watch.\"\n\nDr Shortis says the case of members of the Senegalese women's basketball team being denied visa entries into the US last month contradicts that and highlights a point of potential concern for the 2026 World Cup.\n\nThe visa denials came amid a push by the Trump administration to have countries improve vetting travellers or face a ban on their citizens visiting the US.\n\nThe Trump administration announced a sweeping travel ban on visitors from 12 countries on June 4, with US authorities later suggesting they were considering adding at least 36 other nations to the list.\n\nSenegal wasn't on that initial list of countries and it was not immediately clear why the visas were denied.\n\nIran, however, is among the banned nations — and the Middle Eastern country has already qualified to participate in next year's World Cup.\n\n\"They've said there'll be exemptions for the World Cup, but of course, there cannot be any trust placed in the Trump administration's willingness to stick by its own rules,\" Dr Shortis said.\n\n\"It has arbitrarily revoked visas already, it's deporting people in the United States legally without giving them access to due process and so, it's almost inevitable that this will spill over into those big events.\n\n'It's entirely possible a big incident where someone of high stature is denied entry or treated poorly at the border, which has already happened to citizens of other countries — including Australia, that could cause another international incident for the Trump administration.\n\n\" It wouldn't be surprising if in response to what the Trump administration is doing that some high-profile players or coaches decide not to come, either because the risk is significant or in protest at what the Trump administration is doing. \"\n\nThe US will host 78 of the 104 matches at next year's World Cup, including the knockout rounds and the final, to be played at MetLife Stadium, near New York City.\n\nABC/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/gladstone-central-queensland-property-prices-rebound/105532926",
        "title": "The seaside Queensland city where families are buying bigger for less",
        "publish_date": "Tue, 15 Jul 2025 22:00:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Proximity to beaches, a bigger house and a pool, without the premium city price tag.\n\nThat was what inspired Brisbane mortgage broker Stevie Gera to pack up her family and move to the industrial city of Gladstone in central Queensland.\n\n\"To achieve that anywhere remotely close to Brisbane, we would be needing to increase the mortgage by a good $300–400,000 to get what we wanted, and we weren't willing to do that,\" Ms Gera said.\n\nStevie Gera and her sons enjoy bike riding at the Gladstone Marina. (Supplied: Stevie Gera)\n\nThe median house price in Gladstone, a city known for its boom-and-bust cycles, has risen by more than 74 per cent in the past five years, according to Cotality data supplied to the Real Estate Institute of Queensland (REIQ).\n\nIts most recent quarterly data from March revealed the annual median house price was $520,000, while units now fetched $335,000.\n\nThat is an increase of more than 97 per cent for units since 2020.\n\nStevie Gera and her husband enjoy living close to the Tannum Sands beach. (Supplied: Stevie Gera)\n\nBoom, bust, recovery\n\nIn 2012, Gladstone was undergoing an LNG (liquefied natural gas) construction boom, and property prices soared.\n\nBut the work dried up, and by 2018 most homes were selling at a loss.\n\nThere are three gas plants on Curtis Island, offshore of Gladstone. (ABC Capricornia: Erin Semmler)\n\nIt fuelled the perception of Gladstone as a boom-and-bust city, and some banks still consider it a high-risk lending location, subjecting borrowers to stricter lending conditions.\n\nHowever, Ms Gera said she had noticed through her work as a broker that this was shifting.\n\n\"A lot of them [lenders] have taken Gladstone off that high-risk postcode register and they just see it as any other location,\" she said.\n\n\" It's a little bit of a hidden gem. \"\n\nAlicia Williams has sold homes in the region for more than a decade.\n\n\"Gladstone's always been a boom-and-bust town, until I would say just before COVID it started to find its own feet and it started to find a sustainable path forward,\" she said.\n\n\"We've got a lot of different industry now, which has been diversified over the years.\"\n\nGladstone has a power station, alumina refinery, aluminium smelter and major shipping port. (ABC Capricornia: Jasmine Hines)\n\nMs Williams said in her agency in June, the average four-bedroom two-bathroom home was selling for about $580,000.\n\nShe said in the past two years, there was also significant interest from interstate investors, especially from Sydney and Melbourne.\n\nREIQ zone chair for Gladstone Celina Solis is a fourth-generation local who lived through the region's tumultuous crash.\n\nCelina Solis is the director of a real estate agency in Gladstone. (Supplied: Celina Solis)\n\nShe said seeing the area thriving once more was heartwarming.\n\n\"We're absolutely recovered from that bust … people are coming to the area because the value for money and property is great,\" Ms Solis said.\n\nIt is a similar situation in other regional centres across Queensland, with significant growth in Bundaberg, Rockhampton and Townsville.\n\n\"All these regional cities are going so well because more people are realising, 'Hey, I can come here and work and get a really good job … get a property with a shed, pool, four or five bedrooms for a reasonable price point,'\" Ms Solis said.\n\nShe said for Gladstone, people were attracted to the family-friendly lifestyle and the draw of well-paid jobs.\n\nHeavy industry is a jobs drawcard in Gladstone. (ABC News: Emilia Terzon)\n\nSlower pace, but not for everyone\n\nMs Gera and her husband chose Gladstone because they already had an investment property there, so they had visited before and liked the region.\n\nHer three children, aged six, eight and 16, were initially apprehensive, but she said the slower pace and larger family home had been life-changing.\n\nStevie Gera's son likes the Gladstone East Shores water park. (Supplied: Stevie Gera)\n\nHowever, Ms Gera said prospective buyers should consider their health care needs before moving.\n\n\" I thought, 'Oh there's a hospital [in Gladstone], it'll be fine', but I didn't realise specialist care, they don't have that here … you have to go to Brisbane. \"\n\nSouth Gladstone resident Tracey Mullens agreed.\n\nShe bought in the city after finding it impossible to find a rental in Brisbane with a yard for her children and wheelchair accessibility for her husband.\n\n\"We started looking and the circle kept getting bigger and bigger until we got to Gladstone,\" Ms Mullens said.\n\nShe said while moving was a necessity at the time, her family struggled to find reliable support workers, and it was a challenge to travel for health care.\n\nMs Mullens said she planned to move back to outer Brisbane when it was financially possible.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-16/childcare-workers-wage-theft-pressure-research/105532898",
        "title": "Childcare workers struggling to care for children over 'non-contact' tasks",
        "publish_date": "Tue, 15 Jul 2025 21:51:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Unsustainable expectations on childcare workers are leading to \"massive burnout\" and compromising child safety, according to a first-of-its-kind Australian study.\n\nIt also found widespread wage theft across the sector, with more than 70 per cent of educators working an average of 7–9 hours of unpaid work each week.\n\nThe research from the University of Sydney comes amid a crisis of confidence in the industry following revelations about poor child safety standards at some centres and allegations of child sexual abuse by a worker in Victoria.\n\n\"Over 70 per cent of our educators say that they are working unpaid hours every single week and for those educators, they're reporting an average of 9 unpaid hours each week — we end up with massive burnout,\" said lead researcher Dr Erin Harper from Sydney University.\n\nDr Erin Harper lead the national research. (ABC News: Chris Taylor)\n\nThe study was based on a survey of almost 600 educators.\n\n\"Another significant finding was educators' concerns around workload and how that is then interfering with their ability to provide quality education and care,\" she said.\n\nSurvey key findings More than 70 per cent of childcare workers reported performing unpaid work every week.\n\nFor these workers, the average amount of unpaid work each week was between 7 and 9 hours.\n\nAlmost 25 per cent reported working no unpaid hours.\n\nMounting toll of 'non-contact' tasks for educators\n\nFormer early childhood teacher Yingzhao Zhu has worked across some 50 centres over a decade and said staff were struggling, not just with caring for the children but with the hours of administration, cleaning and even taking out the rubbish — tasks known in the industry as \"non-contact\" time.\n\n\"To be very honest, doing all of those things in a day and over the weeks, it's pretty hard,\" Ms Zhu said.\n\n\" Sometimes the days are gone by so fast and so, so busy that educators sometimes even forget to, for example, drink water. \"\n\nYingzhao Zhu has worked in dozens of centres and says administration tasks made it difficult for staff. (Supplied)\n\nDr Harper's research found the mounting toll of those tasks being spread between too few workers meant staff were only spending 2.5 hours of quality time with children every day.\n\n\"In our study, over 70 per cent of educators are telling us they are concerned that children are not getting enough of their time,\" Dr Harper said.\n\n\"And over 70 per cent are specifically identifying non-contact workload as detracting from quality within their service.\"\n\nHow workers reported spending their day University of Sydney findings break down an 8-hour day for childcare workers with degrees or diplomas.\n\nFive-and-a-half hours were spent working with children and of that time, only 2.5 hours were considered \"quality time\".\n\nThe rest is spent on \"non-contact\" hours and breaks, with workers facing increasingly large \"low-value\" administrative workloads.\n\nPenny* is a childcare worker at a not-for-profit provider, who spoke to ABC News on the condition her identity be protected to allow her to speak freely about problems at her workplace.\n\nChildcare workers like Penny are required by law to have a number of \"non-contact\" hours to design lessons and materials for the children.\n\nShe said the centre continually pushing to enrol more children meant she was often forced to complete this work in her own time, with implications for the children in her care.\n\n\"I engage students throughout the whole day but when I have those stressful situations, it affects my work even though I don't want to show it,\" Penny said.\n\nDo you have a story to share? Email Specialist.Team@abc.net.au\n\nUse of casual workers increases risk of accidents, educator says\n\nShe said the centre was forced to rely on casual workers to complete required administrative work or to fill staffing holes, which increased the risk of accidents because they did not have a relationship with the children.\n\n\"When you change with another educator and then an accident occurs, it's frustrating because if I was there, because of the relationship, it might be avoided,\" she said.\n\nThat dynamic put pressure on her to put the children first, which meant completing administrative work unpaid and out of hours.\n\nCarolyn Smith from the United Workers Union says workers are being exploited. (ABC News: Patrick Stone)\n\nCarolyn Smith from the United Workers Union said employers were taking advantage of staff who were often intrinsically motivated to work in the sector to care for children.\n\n\"Educators are being exploited for the care that they have for the children that they're caring and educating,\" Ms Smith said.\n\n\"It's impacting educators, it's impacting children and it's certainly impacting quality and safety of care.\"\n\nMs Zhu says workers sometimes forgot to drink water because their days are so busy. (Supplied)\n\nDr Harper would like her research to lead to a stocktake of all the tasks childcare workers are required to complete, which often includes providing lengthy updates for parents.\n\nThat would allow a more realistic appraisal of the number of staff required and better-quality care.\n\nChild educators sound safety alarm over understaffing Photo shows A woman of south asian background with long black hair and a pink shirt sitting on a couch More concerns have been raised about safety at childcare centres, with three quarters of workers telling a survey their place of work was operating below minimum staffing levels at least weekly.\n\n\"When we look at educators' paid hours, then non-contact workload accounts for about 25 per cent of their time,\" Dr Harper said.\n\n\"But when we account for the entirety of their work hours, so including those unpaid hours, it increases to about 40 per cent.\"\n\nIn a statement, Minister for Early Childhood Education Jess Walsh said the findings of the report were \"troubling\".\n\n\"The foundation of quality in early education is supporting a stable and dedicated workforce,\" Ms Walsh said.\n\n\"That's why the Albanese Government is rolling out a 15 per cent pay rise to early educators so they can afford to stay in the sector to provide quality education and care.\"\n\nMs Walsh said advertised vacancies had fallen by a little more than 25 per cent this year.\n\n*Name changed to protect identity.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/humpback-whale-puts-on-a-show-in-sydney-harbour-20250716-p5mfcw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Humpback whale puts on a show in Sydney Harbour",
        "publish_date": "Wed, 16 Jul 2025 12:10:48 +1000",
        "category": "finance",
        "authors": [],
        "text": "Humpback whale puts on a show in Sydney Harbour\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/qantas-passengers-stranded-in-singapore-for-days-after-mechanical-issues-20250716-p5mf9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Qantas passengers stranded in Singapore for days after mechanical issues",
        "publish_date": "Wed, 16 Jul 2025 12:01:02 +1000",
        "category": "finance",
        "authors": [
            "Felicity Caldwell",
            "Chris Zappone"
        ],
        "text": "Hundreds of Qantas passengers will be stranded in Singapore for days after their flight to Sydney was repeatedly delayed, complicated by the earlier damage to another Qantas plane.\n\nAnd it was not the only Qantas flight disrupted – the QF2 due to leave Singapore at 7.30pm on Wednesday for Sydney was cancelled, and the QF82 from Singapore to Sydney leaving 8.45pm on Wednesday would be delayed four hours, while the QF81 leaving Sydney at 10.20am on Wednesday had been delayed almost six hours.\n\nRecovery options for Singapore passengers have been complicated by the damage to another A380 at the weekend.\n\nA Qantas Airbus A380 at Sydney Airport. Credit: Wolter Peeters\n\nAn aerobridge rammed into a Qantas A380 superjumbo engine at Sydney Airport, delaying a long-haul flight to Johannesburg by 21 hours for hundreds of passengers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/unique-opportunity-brad-scott-searches-for-positives-amid-bombers-injury-crisis-20250716-p5mfbc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Unique opportunity’: Brad Scott searches for positives amid Bombers’ injury crisis",
        "publish_date": "Wed, 16 Jul 2025 12:00:59 +1000",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "Essendon coach Brad Scott confirmed his club was planning reallocate resources to prevent “a perfect storm of injuries” from happening again next season.\n\nScott admitted the Bombers were frustrated following their disastrous loss to Richmond at the weekend and their extensive injury list, which grew to 15 players with Nate Caddy, Nic Martin, Will Setterfield and Ben Hobbs all coming out of the team that lost to the Tigers for Thursday’s game against Greater Western Sydney.\n\nBrad Scott has a number of his best players unavailable. Credit: AFL Photos\n\n“It’s incredibly frustrating for everyone involved, but particularly the players,” Scott on Wednesday before the team’s training session at the Hangar.\n\n“I mean, it’s hard not to be really frustrated, almost exasperated, just devastating seeing players like Nic Martin and Will Setterfield suffer really serious injuries … so that’s on an individual level, but it’s been a perfect storm of a whole range of different injuries all coming together at once.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-is-misleading-the-american-people-20250716-p5mf9c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump is misleading the American people",
        "publish_date": "Wed, 16 Jul 2025 12:00:39 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The US sharemarket, which fell 0.4 per cent, and US bond yields, which rose, say that investors understood the data better than Bessent or his president. The odds on an early rate cut from the Fed have been lengthened, not shortened, by the data. Bessent should know better than to claim victory at this point in the rollout of Trump’s tariffs, given his central role in that process. While some tariffs were announced in February and Trump’s “Liberation Day” baseline and “reciprocal” tariffs on April 2, most of those tariffs were deferred for 90 days until July 9 and then, again, until August 1. They’re not even in place yet and, given Trump’s history – what Wall Street has dubbed the “TACO” trade, or “Trump Always Chicken out” – there is no certainty that they will be on August 1. Given that US importers started front-loading their inventories in anticipation of the tariffs and continue to do so – they’ll have had at least four or five months to build their stocks before the bulk of the more punitive tariffs cut in next month, assuming they aren’t deferred again – the full impact of Trump’s trade war on the rest of the world won’t be known until, at the earliest, late this year.\n\nApart from the stockpiling, it can take a month from the point they are ordered to ship goods from Asia to the US and goods on the water before the tariffs come into effect are exempt from them. There are a lot of lags, some of them now considerable, before tariffs announced in April actually flow through to consumer prices and the inflation rate. Separate to the reciprocal tariffs, the 30 per cent rate Trump has threatened to impose on imports from the European Union and Mexico, the 50 per cent tariff on Brazil, the 50 per cent tariff on copper and more sectoral tariffs on pharmaceuticals, timber and semiconductors are also yet to come. US consumers are starting to see a rise in prices on everyday goods. Credit: Bloomberg The Yale Budget Lab says that, once those tariffs announced so far are implemented, including the tariffs on the EU and Mexico, the overall effective average tariff rate will be 20.6 per cent, the highest since 1910. Prices would rise by 2.1 per cent in the near term, equivalent to an average per household loss of income of $US2800 (about $4300).\n\nThe Yale researchers also say that the tariffs announced to date will raise $US2.5 trillion through to 2035. While Trump repeatedly (and falsely) claims that the revenue is coming from the exporting countries, Goldman Sachs economists says US consumers will end up paying about 70 per cent of the increased costs to importers. The exporters might shave their margins, as might the importing companies who actually pay the increased customs duties when the goods pass through the US border, but the overwhelming majority of the cost of Trump’s tariffs will be a tax on US households’ consumption. Loading That’s why Trump’s claim that his tariffs will raise billions of revenue (which they will), while having no impact on inflation or the economy (they will have an impact) only makes sense if you believe him when he says the exporters will pay the tariffs (which they won’t). The Yale Budget Lab says the tariffs to date will reduce US GDP by 0.9 percentage points initially and 0.5 percentage points thereafter, or about $US135 billion a year in 2025 dollars.\n\nHigher inflation rates and lower economic growth equates to stagflation, which would be the Fed’s worst nightmare. It would be forced to either target the inflation rate with higher interest rates or rising unemployment with lower rates but even higher inflation. That’s why, despite Trump’s verbal assaults on the Fed and its chair, Jerome Powell, the Fed is sitting on its hands and will continue to do so until there is a clearer picture of the likely effects of the tariffs. Wall Street seems to be counting on Trump to back down. Credit: AP Trump and the Republicans have been stepping up their attacks on Powell, with the director of Trump’s national economic advisers, Kevin Hassett, saying this week that the administration is still looking for the grounds to fire him. Trump really wants a rate cut. Republicans have seized on costs blow-outs in the renovation of the Fed’s ageing and asbestos-riddled Washington headquarters to target Powell and to try to develop the grounds to fire him “for cause,” the only legitimate way a Fed chair can be removed.\n\nBessent, who says the administration has started a formal process to identify Powell’s successor when his term as chair expires next May, also says Powell should step down as a Fed governor at that point. His term as a board member doesn’t end until 2028. The administration’s current strategy appears to be that it will appoint a chair-elect in January, when term of another governor, Adriana Kugler, ends. That would undermine Powell’s authority before he vacates the chair, although it might also see the incoming chair isolated by the rest of the board. Those sectors that are most tariff-exposed – fresh fruit and vegetables, household appliances and furniture, toys, clothing and sporting goods – all experienced prices increases. Trump has made it clear that a precondition of the new chair’s appointment will be their willingness to lower rates, with the most likely candidates – Hassett, Bessent, former governor Kevin Warsh and current governor Christopher Waller – all currently auditioning for the role by trying to demonstrate their rate-cutting credentials. If, as the new chair takes Powell’s seat at the Fed’s board table, inflation is spiking because of Trump’s tariffs, the Fed will be in an invidious position, with its independence and credibility – and the stability of America’s bond and sharemarkets and its currency – at risk if it doesn’t respond with higher rates.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/new-cast-members-and-first-looks-revealed-as-harry-potter-tv-series-begins-production-20250716-p5mf9k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New cast members and first looks revealed as Harry Potter TV series begins production",
        "publish_date": "Wed, 16 Jul 2025 11:50:55 +1000",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Wands at the ready, wizards and witches. Production has officially begun on the new Harry Potter television series, nearly 14 years to the day since the final Harry Potter film landed in cinemas.\n\nHBO announced on Tuesday it had started filming the highly anticipated TV adaptation at the Warner Bros. Studios Leavesden in the UK – the same area where the eight original films were shot.\n\nThe new Harry Potter has officially landed at Hogwarts. Credit: HBO via AP\n\nThe network also released its first photo of Dominic McLaughlin as the new Harry Potter, replete with the classic Hogwarts uniform and cape, shaggy black hair, round-rim glasses and signature lightning bolt scar. At a glance, the 11-year-old appears the spitting image of Daniel Radcliffe when he starred in Harry Potter and the Philosopher’s Stone nearly 24 years ago.\n\nSo, now that production is well and truly under way, and we’re one step closer to re-entering the magical world of witchcraft and wizardry, let’s take a look at exactly what we can expect from the upcoming series.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/the-monster-australian-rugby-helped-build-leinster-lions-return-to-haunt-the-wallabies-20250714-p5metg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The monster Australian rugby helped build: Leinster Lions return to haunt the Wallabies",
        "publish_date": "Wed, 16 Jul 2025 11:47:15 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "The British and Irish Lions’ plans to defeat the Wallabies will rely on a system built in Dublin and shaped by a series of coaches steeped in Australian rugby.\n\nFourteen Lions have now been called up from Leinster, Ireland’s dominant province. Coach Andy Farrell has long leaned on the team while coaching Ireland, and is now doing the same with the Lions. The Leinster machine, which surged under Michael Cheika and was then refined by now Wallabies coach Joe Schmidt, will be decisive in this series.\n\nFive of the seven head coaches over the past 25 years at Leinster have had an Australian rugby background: Matt Williams, Gary Ella, Cheika, Schmidt and Matt O’Connor.\n\nFormer Waratahs coach Williams points out that he cannot take any of the credit for the later success at Leinster. That goes largely to Cheika, who won the club’s first European title in 2009, and was followed by Schmidt in 2010 and 2012, before later success under former Ireland international Leo Cullen.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/where-should-the-bad-luck-bombers-look-to-find-a-cure-for-their-injury-curse-20250715-p5mf6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where should the bad-luck Bombers look to find a cure for their injury curse?",
        "publish_date": "Wed, 16 Jul 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "Essendon’s injury toll isn’t just bad – it’s close to unprecedented. Every club faces battles with injury, and right now, the Bombers are deep in the trenches. They’re not alone – plenty of clubs have endured tough stretches. This just happens to be Essendon’s turn.\n\nAs of round 18, the Bombers have used 41 players, lost over 149 games to injury, and had up to 14 players unavailable in some weeks. That’s nearly a third of their list impacted — making it one of the most severe injury runs in recent AFL memory, both in volume and type.\n\nEssendon have had a major injury crisis in season 2025, with the large number of injured players including (from left) Mason Redman, Kyle Langford and Sam Draper. Credit: Photos: AFL Photos. Artwork: Marija Ercegovac\n\nThey’ve already debuted 12 players, the most of any AFL team this year – and that number is set to grow. With Liam McMahon and Rhys Unwin expected to debut, they’ll have used at least 43 players from a list of 47. Of the few who haven’t featured, Nik Cox has missed the entire season with ongoing concussion issues.\n\nBut it’s not just the numbers — it’s the players and the reasons behind it. Core members like Sam Draper, Jordan Ridley, Kyle Langford, Zach Reid, Mason Redman, and Darcy Parish have all missed significant time, often for extended periods. These are the pillars of Essendon’s best 22. Nate Caddy and Ben Hobbs are the latest to join the injury list.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/lara-lloyd-and-richards-called-into-emergency-talks-after-west-indies-disaster-20250716-p5mf8a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lara, Lloyd and Richards called into emergency talks after West Indies disaster",
        "publish_date": "Wed, 16 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: A full-blown cricket crisis has erupted in the Caribbean following a humiliating batting collapse against Australia in Kingston, with Cricket West Indies president Dr Kishore Shallow calling an emergency meeting involving three of the game’s most iconic batsmen in Sir Vivian Richards, Brian Lara and Sir Clive Lloyd.\n\nThe West Indies endured one of the darkest days in their cricketing history when they were rolled for just 27 in 14.3 overs in the third Test, with seven players making ducks.\n\nMitchell Starc finished with extraordinary figures of 6-9, while Scott Boland became just the 10th Australian man to claim a Test hat-trick.\n\nIn a statement released on Tuesday - a day after West Indies slumped to their third consecutive Test defeat in the Frank Worrell Trophy - Shallow said the result was unacceptable.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/this-nsw-house-sold-for-347-it-came-with-a-catch-20250710-p5me18.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This NSW house sold for $347. It came with a catch",
        "publish_date": "Wed, 16 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "Character-filled homes in the Northern Rivers are selling for as low as $347, with bidding starting at just $1. They’re a bargain and savvy investors and first home buyers are snapping them up – but there’s a catch.\n\nHundreds of flood-affected homes in the region are expected to go up for auction, but buyers will need to bring their own land.\n\nThis Kyogle home sold for just $347. Credit: Reconstruction Authority\n\nAfter some blocks of land in Lismore and other flood-prone areas of the Northern Rivers were deemed too dangerous to live on after the 2022 floods, the Reconstruction Authority bought back 670 houses from flood-affected owners.\n\nSome of those homes are going up for auction, selling for less than the average home deposit in NSW. The catch is, within 12 months the buyer is expected to move the house to their own, non-flood zone land.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/i-didn-t-set-out-to-make-a-diverse-film-i-wanted-to-create-a-hero-20250714-p5mero.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I didn’t set out to make a ‘diverse’ film. I wanted to create a hero",
        "publish_date": "Wed, 16 Jul 2025 11:30:00 +1000",
        "category": "entertainment",
        "authors": [
            "John Jarratt"
        ],
        "text": "There’s a particular kind of magic that happens when you see yourself on screen. Not just someone who looks like you, but someone who feels like you. Someone whose story rings familiar – not because it’s perfect, but because it’s true.\n\nThat magic is still far too rare.\n\nGerard O’Dwyer in a scene from What About Sal.\n\nFor decades, the stories we’ve consumed on screen have followed a narrow path: familiar faces, familiar arcs, familiar settings. We were taught to believe that these stories were universal. That if they resonated with the mainstream, they must be enough. But enough for whom?\n\nAs a filmmaker, I’ve seen firsthand how the industry is slowly, sometimes painfully, waking up to the power of diversity – not just as a checkbox, not just as a quota, but as the lifeblood of meaningful storytelling.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-my-cousin-frank-20250709-p5mdr0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This play makes performers step on stage without knowing the script. Does it work?",
        "publish_date": "Wed, 16 Jul 2025 11:29:10 +1000",
        "category": "entertainment",
        "authors": [
            "Vyshnavee Wijekumar"
        ],
        "text": "Joining us remotely on screen, the playful presence of the playwright (and his wife, Shirin, and their dog, Echo) makes it feel less like a solo show than a digital duet, bridging time and distance. And whatever tensions the “cold read” format throws up live, a spirit of generosity underlies proceedings. A Persian carpet increases in value the more it is trodden upon by guests, as Soleimanpour reminds us. Loading Ancient and glorious Persian literature hovers in the background – tantalising glimpses of the playwright’s father reading the ghazals of the poet Hafez, say – but this is a work more invested in new possibilities of live connection through performance than tradition. ECHO’s elaborate interplay between the mediated and the immediate, while different every night, should make audiences reflect on truth under authoritarianism in an age of deepfakes and generative AI, on shadows of exile and regret, and on the indomitable spirit of the Iranian diaspora.\n\nReviewed by Cameron Woodhead\n\nTHEATRE\n\nStill: Late Works by Samuel Beckett ★★\n\nTheatre Works Explosives Factory, until July 26 Samuel Beckett’s late works draw force from a continual winnowing of possibility. Death and decrepitude haunted the artist’s writing for decades, and as he grew older, Beckett seemed to approach his own ageing as a creative opportunity – the loss of ability and the relieving of potential were a chance to distil mordant negations, the compressed contradictions of language, life itself. Robert Meldrum in Still: Late Works by Samuel Beckett. Credit: Darren Gill As he wrote to the poet and translator Franz Wurm in 1980, almost in self-parody: “I try to think, with what mind remains, that now is the time at last, the chance at last, in these remains, with those remains, though think is not the word, at last is not the word.” Gallows humour seeps into Beckett’s appreciation of the inevitable slipperiness of language in the face of death: “Ineffable departure,” he once wrote of his impending demise, “nothing left but try and eff it.”\n\nMore comedy would certainly be welcome in Still – a staged suite of six short prose works from the twilight of Beckett’s career. Director Richard Murphet and actor Robert Meldrum do have past form with late Beckett. They collaborated on an impressive stage adaptation of Worstward Ho in 2023, though this follow-up doesn’t have the same quiet meticulousness or verbal command, nor does Meldrum’s performance this time around cleave to restraint or allow Beckett’s words to do most of the heavy lifting. This suite of works by Samuel Beckett is rarely performed. Credit: Darren Gill Brief vignettes such as Fizzle Still and Stirrings Still, Heard in the Dark and One Evening are presented end to end, as a kind of theatrical meditation on dying. Beckett’s characteristic linguistic playfulness is evident. It’s very like him to land repeatedly on the auto-antonym “still” – denoting persistence in a continuous present, and to isolate or remove from the flow of time, as in a still-life. Fragmented memories are the “still-lifes” in these works, and before they can fully lay nostalgia traps for the speaker, they run into the implacability of what they apprehend, and the impossibility of trying to express it without failure\n\nAll of that could have been stronger with less angst, and a greater emphasis on Beckett’s dry humour. There’s trouble too in having these shorts concertinaed into one another, which seems to generate a desire to go bigger to distinguish each piece, cutting against the minimalist aesthetic and leaving Meldrum – a fine actor at his best – overexposed. Still, late Beckett is a difficult pleasure. It’s good these rare works are being staged, even if they’re not performed with the clarity or restrained intensity that might have transfigured them or made them easier to bear.\n\nReviewed by Cameron Woodhead MUSICAL\n\nAnnie ★★★★\n\nPrincess Theatre, Until October 26 As usual, I went to Annie the musical expecting to be annoyed. Amanda Lea LaVergne, Isabella Hayden and Anthony Warlow in Annie. Credit: Eddie Jim\n\nLet’s face it: the high-wattage optimism of the plucky preteen heroine would be delusional in almost anyone else. It’s so insanely irrepressible it bewitches rough-sleepers into frolicking about carefree, melts the heart of a billionaire industrialist, and even inspires Franklin Roosevelt’s New Deal in the Oval Office, shepherding America towards global economic supremacy. Not bad going for an 11-year-old orphan. Debra Krizak, Keanu Gonzalez and Makenzie Dunn as Miss Hannigan, Rooster and Lily, scheming to swindle Daddy Warbucks. Credit: Eddie Jim The truth is, though, that despite the silliness of it all, I’m typically less irritated than I think I’ll be, and the juvenile cast always plays an outsized role in winning me over. There’s nothing little about the talents of the little girls in this show. Isabella Hayden was terrific as Annie on opening night, in a starring role shared over the season with Dakota Chanel and Lilleth McIntosh. Hayden brought the sunshine with her wherever she went, whether she was belting out the signature earworm Tomorrow with a dog in tow, knocking about among fellow orphans – all singing their hearts out and dancing in athletic synchrony – during It’s A Hard Knock Life, or holding her own in duet opposite Anthony Warlow’s “Daddy” Warbucks.\n\nWarlow has of course played Warbucks on Broadway. Gruff, briskly sketched comedy and Warlow’s still-marvellous voice make for a magnetic performance, though the creepiness of a plutocrat temporarily housing an orphan in his mansion to improve his public image? Well, it leaves a weird aftertaste, especially given the current trajectory of US politics. Just look at who they’re calling “daddy” over there now. Loading Anyone allergic to toxic positivity will find its true antidote, however, in the show’s cynical villains. Debra Krizak as Miss Hannigan, the alcoholic head of the orphanage, gives a performance that everyone will love to hate, adding vaudevillian charm and a dash of slapstick to the mix when she teams up with her con artist brother Rooster (Keanu Gonzalez), and his partner in crime Lily (Mackenzie Dunn), to swindle Warbucks. The vibrant, cartoonish quality brought to the fore in these performances is sustained, too, by the supporting ensemble, who play everything from the high-class regiment of a billionaire’s domestic staff to dishevelled have-nots in the shantytowns of Depression-era New York.\n\nWith high production values and an excellent cast spearheaded by the show’s child performers, Annie is an enduring musical worth taking kids along to see. As for adult audiences, we know too well that optimism is hardly the vibe in America right now, and that complicates, without detracting from the talent on display, how this rags-to-riches fantasy might be received.\n\nReviewed by Cameron Woodhead MUSIC\n\nFaye Webster | Underdressed at the Symphony Tour ★★★\n\nForum, July 12 The sound of foaming water fills the room. Bubbles are projected onto a backdrop of washing machines at a laundromat. Faye Webster arrives on stage with her band and the crowd cheers when the spotlight hits her. Faye Webster performs at Forum Melbourne on July 12, 2025. Credit: Richard Clifford\n\nShe starts singing “I want to sleep in your arms but not kiss” in her signature sweet, delicate tone. These are the opening lyrics to But Not Kiss, a song that tries to unknot complicated feelings about a breakup. There’s a yearning in her voice, yet she seems resolute. The 28-year-old American singer-songwriter, who hails from Atlanta, returns to Australia after her Laneway Festival debut in 2024. Initially announcing two headline shows in Melbourne and Sydney, two additional dates were added due to popular demand, with all shows selling out. Faye Webster is headlining a series of sold-out Melbourne shows. Credit: Richard Clifford Despite previously having a profile — Webster was listed in Barack Obama’s wrap-up of favourite songs in 2020 — her popularity rose significantly when her tracks Kingston and I Know You went viral on TikTok. There’s an aloofness to Webster as she barely interacts with the audience other than the occasional platitude. She’s five songs deep (about 25 minutes into the show) before she utters: “What’s up Melbourne?” Her fans respond with adulation.\n\nWebster lulls you into a dreamy state with her mellow tone; the crowd sways along. She switches between playing guitar and keys with ease, sometimes even within the same song. A few fans remark that her live vocals sound just like her record. Loading Her music has a melancholic country/folk sensibility, amplified by musician Matt “Pistol” Stoessel’s live accompaniment on pedal steel guitar. She professes vulnerable truths about love with a touch of humour, particularly in A Dream with a Baseball Player, from 2021 album I Know I’m Funny Haha that details the crush she developed towards Atlanta Braves outfielder, Ronald Acuna Jr. She repeats the chorus “how did I fall in love with someone I don’t know” like it’s a foolish confession. Her keyboardist Annie Leeth is a multi-talented instrumentalist who plays the violin and saxophone as well. This talent is exercised during Jonny, where Leeth’s crooning sax brings a jazzy vibe. Webster recites a spoken-word piece to the crowd as part of it, which features in her orchestral re-recording Suite: Jonny for her EP, Car Therapy Sessions. It feels experimental, though a little out of step with the rest of the show, but is still an enjoyable gear shift.\n\nWebster returns to the stage for an encore to perform bedroom-pop track Feeling Good Today without her band. She introduces her best friend Lulu, who accompanies her on vocal harmonies like previous live shows for this track. A vocoder is introduced, adding a warbling effect on Webster’s melodic vocals. Ending the set on Kingston, Webster utters a quick “thank you so much” before swiftly exiting the stage with her band. It feels abrupt and unexpected, yet the crowd still pours out of the theatre singing her praises.\n\nReviewed by Vyshnavee Wijekumar MUSIC\n\nYinya Dana: Lighting the Path ★★★★\n\nMelbourne Symphony Orchestra, Hamer Hall, July 11 In 1975, it would have been inconceivable that the Melbourne Symphony Orchestra should, half a century later, devote an entire concert to the music of a single Indigenous composer, and that composer a woman. Deborah Cheetham Fraillon with the Melbourne Symphony Orchestra. Credit: Nico Keenan\n\nHappily, in celebrating 50 years of NAIDOC Week, that is exactly what the MSO has done: featuring the music of its First Nations creative chair, Deborah Cheetham Fraillon, in truly festive style. Large instrumental and vocal forces, including Dhungala Children’s Choir, the MSO Chorus and the Consort of Melbourne were helmed by Aaron Wyatt. In full orchestral dress, Long Time Living Here, the MSO’s customary acknowledgement of Country, featured the clear, attractive soprano of Lillie Walker making her MSO debut. William Barton performs at Yinya Dana: Lighting the Path. Credit: Nico Keenan Several works responded to the COVID years. Nanyubak (To Dream), the dark first movement of a viola concerto, was illuminated by the committed advocacy of soloist Christopher Moore, while Ghost Light (referring to the single stage light left burning in a darkened theatre) effectively projected angst and nostalgia. The sweet lyricism of the Long Night Chorale from Parrwang Lifts the Sky, enhanced by Walker and mezzo-soprano Jess Hitchcock, contrasted with the stark historical reckoning found in two movements from Eumeralla: A War Requiem for Peace. Exuberant playing occasionally left some orchestral and vocal elements out of balance.\n\nBaparripna (Dawn) was a well-orchestrated vehicle for showcasing the exceptional talents of didgeridoo virtuoso William Barton. Dutala (Star Filled Sky), a companion to Beethoven’s Symphony No. 9, had its own grandeur, as did Earth, an accompaniment to Holst’s The Planets – this finale conducted by Nicolette Fraillon, Cheetham Fraillon’s wife. A large, enthusiastic audience affirmed this celebration of achievement and hope under the title Yinya dana or lighting paths. With the driving force of artists like Cheetham Fraillon, paths for Indigenous classical musicians towards the next 50 years shine with optimism.\n\nReviewed by Tony Way THEATRE\n\nMy Cousin Frank ★★★\n\nArts Centre Melbourne, until July 12 Step into the ring with Rhoda Roberts this NAIDOC week, and you’ll see the proud Widjabul Wia-bal woman onstage, ducking and weaving through family history. My Cousin Frank is a free-flowing solo show, and a remarkable feat of live storytelling, tied to the history of Aboriginal boxing and the much bigger fight for Aboriginal justice. Rhoda Roberts Credit: Tiff Garvie\n\nIt celebrates the life of Frank Roberts, dubbed “Honest Frank”. Almost four decades before Cathy Freeman lit the flame in Sydney and blazed her way to Olympic gold, Frank was the first Indigenous Olympian signed to represent Australia, at the 1964 Olympic Games in Tokyo. Aboriginal people weren’t regarded as Australian citizens at the time and the young boxer was thrown onto bureaucratic ropes, including the insult of having to obtain a British passport to compete. My Cousin Frank is a remarkable feat of live storytelling. Credit: Tiff Garvie Sobering reminders of racism and discrimination shadow Frank’s story, but the spotlight is squarely on remembrance and respect, and the resilience and resistance of Aboriginal leaders who punched above their weight in a fight rigged against them. Indigenous contribution to the sport of boxing was significant. Aboriginal athletes constituted an estimated 15 per cent of national champions in the early 20th century, and the Roberts clan itself counted many professional boxers among its ranks.\n\nPreachers provided the other main career path in the family. Rhoda freely admits having inherited that line. Her father and grandfather were both pastors, and the performer’s charisma and rhetorical skills can’t be denied. There’s something moving and deeply impressive about a spirituality that connected and reconciled Aboriginal lore with Christian belief. Religion met political and practical action in the founding of Cubawee, the self-governing Aboriginal reserve on the outskirts of Lismore where “Honest Frank” grew up. Loading The history of Cubawee is a highlight. It became a vital locus in the struggle for self-determination for the people of the Bundjalung Nation. Complete with archival photography, Rhoda Roberts charts generations of activism in the face of a paternalistic culture which exploited and abused the very people it was supposed to protect. Righteous anger at injustice is tempered by love and mourning and generosity of spirit. My Cousin Frank can be quite funny and charming while channelling a deep moral and human authority. Inspiring theatre drawn from the annals of First Nations sport – joining the likes of Black Cockatoo, 37, and Sunshine Super Girl – it’s also connected to a living tradition of oral history spanning many tens of thousands of years.\n\nReviewed by Cameron Woodhead",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/could-it-be-meningococcal-australia-approaches-the-high-risk-diseases-peak-season/a1zvk3b4k",
        "title": "Could it be meningococcal? Australia approaches the high-risk disease's peak season",
        "publish_date": "Tue, 15 Jul 2025 21:30:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nTwo years ago, Jacob Blackwell was a fit tradesman with a love of sports - until a devastating bout of meningococcal disease turned his life upside down.\n\n\n\n\n\nWithin two days he went from feeling lethargic to experiencing delusions.\n\n\n\n\n\nIn hospital, doctors put him in an induced coma and saved his life.\n\n\n\n\n\nBut he suffered severe long-term complications, losing the ability to do even basic tasks.\n\n\n\n\n\n\"Everything I had to learn to do again, so eating, talking - back to square one. Think of it as an 18-month-old, just learning to do everything again.\"\n\n\n\n\n\nHis mother Chelsea Blackwell remembers her shock on seeing the illness take hold of her son.\n\n\n\n\n\n\"I actually couldn't comprehend what I'd seen. I opened the door, I looked and I was just like hmmm. Jacob didn't look like Jacob because his brain had already been swollen so his eyes were protruding and his skin was breaking a little bit. So they actually thought initially he had been assaulted.\"\n\n\n\n\n\nMeningococcal disease is caused by bacteria, called neisseria meningitidis, which most people carry in the back of their throat at some point in their lives.\n\n\n\n\n\nBut when that bacteria turns invasive it can enter the brain or the bloodstream, causing potentially life-threatening infection.\n\n\n\n\n\nGeneral Practitioner Dr Sam Hay says the disease can progress dangerously quickly.\n\n\n\n\n\n\"It often starts with a flu-like illness, bit of a cold, bit of a runny nose, a bit of a cough. But then it progresses, fevers and (the patient) becomes very, very sick after that. People can go downhill within 24 to 48 hours.\"\n\n\n\n\n\nAs Australia enters peak season for meningococcal, there's a national campaign ((launched Monday)) to raise awareness of the disease which primarily affects young adults and children.\n\n\n\n\n\nDoctors say the illness is on the rise, with 56 cases already reported this year - 18 of those in New South Wales.\n\n\n\n\n\nDr Sam Hay says infections can have devastating consequences.\n\n\n\n\n\n\"One in 10 people who get the invasive meningococcal can unfortunately pass away. One in five get these significant side-effects, complications, that could be brain damage, loss of limbs, hearing loss, and the list goes on.”\n\n\n\n\n\nParalympic swimmer and bronze medallist Jay Dohnt contracted meningococcal when he was in high school.\n\n\n\n\n\nAfter feeling sick and developing a rash, he went to see a GP.\n\n\n\n\n\nJust 24 hours after developing symptoms, he was in intensive care.\n\n\n\n\n\n\"The ambulance was still in precautionary mode, they didn't even put the lights on to take me to a hospital. At the hospital, it was a different story. They all met me out in the carpark, and took it very seriously. That evening (I was) hooked up to everything in the intensive care unit and given a 97 per chance of dying, or a 3 per cent chance of living. I wasn't conscious for the first two weeks, and I don't remember much from the first two months of a five-and-a-half month hospital stay. But this is essentially the end result - a bilateral knee amputee. Missing my patella (kneecap) in my left leg, lost four fingers on my right hand as well. So very life-changing for a teenager who loved sport.\"\n\n\n\n\n\nIt's these life-altering impacts that lead Karen Quick, CEO of Meningitis Centre Australia, to stress the importance of early detection, urging parents to push for answers.\n\n\n\n\n\n\"It's really important as parents that we're aware of all the signs and symptoms, that we trust our instincts and we get help straight away. Go straight to the hospital, straight to the doctor, and ask the question - could it be meningococcal?\"\n\n\n\n\n\nDr Sam Hay warns people not to wait until they have developed a rash as by then, it could be already too late.\n\n\n\n\n\n\"When it gets into the blood stream, that's when you get the septicaemia and that then goes on to the rash. But the problem is that the rash, while it is dangerous, it happens late. And if you are looking for that, things have gone too far.\"\n\n\n\n\n\nTwo years after his brush with meningococcal, Jay Blackwell is still working on his recovery.\n\n\n\n\n\nInspired by Paralympian and fellow survivor Jay, he has taken up swimming and says, despite many challenges, the future is looking bright.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-pros-and-cons-of-ai-in-parenting/pf0i25dtn",
        "title": "The pros and cons of AI in parenting",
        "publish_date": "Tue, 15 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\nTRANSCRIPT\n\n\n\nVerity Tuck: Let's be hopeful that the machines can do all of the grunt work while we can be creative and have our feet in the soil.\n\n\n\n*music*\n\n\n\nSB: The incoming generations are expected to live in an era where artificial intelligence and automation are commonplace in everyday life. From education and workplaces to healthcare and entertainment. In this episode of the Beta Blueprint, I’ll be chatting with Verity Tuck and Mike Fraser. Life partners and business partners, they’re raising two young kids while also building an AI-assistant for parents.\n\n\n\n*music*\n\n\n\nSB: Welcome Verity and Mike. Let's start with the AI assistant you're developing - can you tell me a bit about it?\n\n\n\nVerity: So we have created an app called Goldie. It's I guess at a top line, it's an AI assistant for very busy families. In today's age, families are strung out. They've got multiple children, sometimes even just one child that has multiple extracurriculars, they go to school, you get six to 10 emails a week from school sometimes, birthday party invites, sporting fixtures. It's almost like you're their PA as a parent like you are running their schedule. Typically the mother of the family takes on the burden of a lot of this planning, organising in their head. So it puts it out there for the other partner or what we call copilot to get involved as well and be a lot more across all those things that you churn through at night and feel a little bit alone with. So what Goldie does is it takes those, the abundance of communications like school emails, WhatsApp messages, birthday party invites, and it summarises it in the app using AI and it puts it into a schedule for you automatically. And then between us, we can assign accountability or responsibility for each event. You can also add reminders and tasks associated to events. So it's really there to take out all of that middle part of reading all the school newsletters, like processing it in your brain, then actioning things that need to be actioned in terms of the admin and reminders.\n\n\n\nSB: Ok, so you’re both clearly in a position where you are interested in adopting new technologies, what draws you to them?\n\n\n\nVerity: We've both come from a background of digital marketing and digital advertising. So I think maybe we're more on the end of early adopters, but we're both very, I guess I don't think we're out there. We are not risky people. We as parents, we want the safety of our kids and our data to be forefront in anything we use. So I think if you go in with those cornerstones covered of safety for parents, I think they're more likely to adopt it. But yes, we're definitely on a curve of, we're needing to do more education for parents to explain, it's not out there to get you.\n\n\n\nSB: So for those who are a bit unsure or hesitant about some of these emerging technologies - can you explain how they're mainly being used at the moment?\n\n\n\nVerity: The biggest adoption has been in enterprise level. So in businesses, so a lot of people may have seen it being used in corporate spaces where they work, and this is all about chopping out the mundane, repetitive tasks. A lot of software that businesses use now have it just built in, but a lot of the work that AI, the big large language models, a lot of it's done in the background. Some of it you just don't see, which is kind of the beauty of it. We're seeing more and more come through in Google search. Everything's summarised at the top with AI pulling the best bits from everywhere. I think you start to see it bubble up in lots of places, especially if you're on a computer day to day doing your work. If you're not then I think you won't as much right now. What do you think?\n\n\n\nMike: Yeah, I think it's been around a lot longer than everybody knows. Definitely in the enterprise space there's a lot more use for it, especially repetitive tasks. Recommendation engines on the most used platforms around the world have probably been using it.\n\n\n\nVerity: Customer service as well.\n\n\n\nMike: So yeah, I think it's been around a lot longer. Like we touched on before that I think those use cases for the everyday person of being few and far between and probably why we're seeing such an aggressive growth now is because all the big players are sort of coming out with new utilities, tools to harness it for en masse as a customer.\n\n\n\nSB: With that aggressive growth, are there any risks associated with AI that people need to be aware of?\n\n\n\nVerity: I think it's having a healthy level of skepticism generally of these products always going to be healthy, I think. So anything or anyone taking your data or anything that you are writing out there, you just knowing the facts around how that data's being stored and how it's being used, whether it's being used to train engines and things like that, whether you've opted into that. I think a lot of us have gotten used to not reading terms and conditions. So if you're concerned, definitely I would urge you to read terms of service.\n\n\n\nMike: Yeah, I think we both try to think about, hope that the people who are developing it always have the sort of best intentions at the forefront. Undoubted, it would be naive to think that even from some of the stuff that we've seen with image manipulation, video, it's pretty advanced and we'll only get more advanced in the future and it's happening at a speed that's pretty unprecedented I think in terms of learning and generating content that may or may not be true. So I think always have to be careful using LLMs and tools that are well tested, more universal I think is a good start. Making sure privacy and your data is always being either removed once you've finished with it. It's also not being used to train other AIs, I think, unless you've asked it to . But yeah, I hope the majority of use cases are really about helping us rather than the negative sides of it.\n\n\n\nSB: And you’ve got two children aged five and eight. I’ve heard of companies developing smart toys like AI-enabled robots, have you introduced them to anything like that?\n\n\n\nVerity: No, no toys, no tech as much as any parent we struggle with the general rules around screen time. But that was a big part of the moving from big city to coastal regional life was trying to slow it all down in their childhood because yeah, it does from what we can see, tween and teen life just gets more and more complicated with these sorts of things, more pressures because a lot of their peers are using it and that's just having a device. So I guess our kids probably won't know a world that is different to the one with AI in it. So whilst we're seeing the big change ourselves now, it would just be there and already doing all of that hard, mundane, repetitive work. And I'm hopeful that, that means they'll have more time, space, to be a human as well. The reason machines do that stuff is because they don't have feelings and empathy and things like that. And we're on this earth basically for connection and to create connections with other humans. So maybe it will mean less time at a screen and more time in nature. Let's be hopeful that the machines can do all of the grunt work, while we can be creative and have our feet in the soil, I am a bit hopeful that it won't just keep grinding them down into more and more screen time.\n\n\n\nMike: There's no doubt, I was thinking about this the other day. It's probably the kids growing up not knowing a world without AI I think is kind of interesting when you think about it historically, where we were with the internet, and I don't want to sort of labour on my age, but it is one of the, it's the next big moment where we grew up not knowing a world without the internet and a mobile phone that could kind of do everything. Whereas our parents before that probably had none of that, colour TV was probably an exciting change and I think that will bring a load of positives and just like anything, a load of challenges that we need to be really careful of. I also hope that we don't lose our creative spark. I think there is, relying on a system like AI to help us is great, but when it sort of overtakes the creative process and takes the fun out of building something and learning something, hopefully that will just get deeper and deeper as opposed to forgetting a whole way of thinking. Hopefully.\n\n\n\nSB: Well you've both described your AI assistant as a way to free up mental space, I guess to be more creative, do you expect other products like yours to be popping up?\n\n\n\nVerity: Definitely the crossover of parenting and AI, it's a no-brainer in many respects and we're seeing competitors pop up everywhere. In terms of kids, I'm not sure, maybe I'm just nostalgic and want to keep some of that real innocence in the way they play and open-ended play and outdoor play. I hope not. I hope not. Especially around the toy, early development stages. I hope they can go to nature programs and all of that. But I think for adults especially, it's a safer place. They can understand the implications and what they're hopefully getting out of it and also what data they're putting into it.\n\n\n\nMike: Yeah, I think for us we felt like parents were a bit of a forgotten user base in terms of where technology had focused. Obviously huge focus in SaaS, enterprise and potentially broader consumer markets. People probably think that parents are niche in terms of an audience, but actually huge. So we see a good opportunity for us to play a role in their lives and no doubt, as Ver said, there are other products doing some really interesting things and we hope to play a small part of parents' lives in the future.\n\n\n\nSB: And we spoke a bit before about how AI is being used and some of the risks associated with it, do you have any other advice for people who are interested in adopting some of these new tools?\n\n\n\nVerity: I think we've got to be careful and I would say just know what you are giving up and how much control you would like in your schedule, in your household and anything that you adopt I guess as a parent in terms of running your family or having anything around the kids as well is understanding what data you're giving and what you're getting back or what the benefits are.\n\n\n\nMike: Yeah, take baby steps into the world of AI and let it grow and mature as you grow and mature in the knowledge as well.\n\n\n\nVerity: As businesses providing an AI service, we also have a job to do to manage customer's expectations. So with all this emerging technology and a lot of talk around it, you can all of a sudden expect so much from it. AI and in particular LLM, so large language models, they're still relatively novel tools and depending on your familiarity with them, everyone's expectations are different. So some people expect a hundred per cent accuracy of what's going to come back and that's not necessarily how the tech works. And because we're so nuanced as human beings and we understand all the gray areas, whereas machines don't necessarily. So that's an interesting point. I think as part of what Mike said in terms of learning and growing with this technology is just the expectation around what it can do for you. Just I guess tempering that.\n\n\n\nSB: Yeah I think that’s important. I know of friends, for example, who are using things like Chat GPT essentially as a search engine now despite that room for error.\n\n\n\nVerity: You've still got to use your own filter as a human being.\n\n\n\nMike: It's a really prevalent example of how our creativity can quite quickly and the truth can quite quickly be manipulated just by not fact checking the source. And I think that I would be unsurprised if a lot of people aren't applying the same logic of moving from a search engine to Chat GPT for example. Because I mean that's kind of how it's marketed too, is that it is a replacement of that. The question is just where is that information coming from? So I think that's when we talk about creativity in our children, there is something exciting about doing it from scratch and not using anything no matter what you're doing, whether it's finding out the truth about penguins or how to build the most incredible Lego, those two experiences will be quite different in the future I think. And so some of the magic of just not knowing and discovering it yourself can then be applied to so many other components of your life. Whereas if maybe you are supplementing that with AI, you kind of lose the magic of and the struggle of solving it yourself. So hopefully we don't lose that magic and struggle of life is hard, it's meant to be and that some of the greatest sort of wins you'll have in your life are going through the pain of solving a problem.\n\n\n\nSB: And just quickly, before we wrap up, for people who are wanting to learn more, what would you suggest they do?\n\n\n\nOh, there's loads of great podcasts on it. So it depends what kind of format you like to listen to. But there's lots of little 20 minute excerpts of, can machines have empathy and stuff, which is quite interesting topics to think about. Depends how deep you want to go, how technical, but if you're more like me, I like to just have a play with things. So a lot of these apps like Goldie, they have free trials, no credit cards needed. Go and have a play with it, see what it's capable of doing and just have a bit of fun. It is meant to be, it obviously is meant to solve a problem, but with Chat GPT, you can have a bit of fun asking about itineraries for travelling and jokes and things like that. I would just say experiment is always the best way to learn.\n\n\n\nSB: That was Verity Tuck and Mike Fraser. I’m Sophie Bennett and you’ve been listening to the Beta Blueprint.\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/winter-warning-meningococcal-ases-rising-as-experts-urge-vigilance/773hnghq5",
        "title": "Winter warning: Meningococcal cases rising as experts urge vigilance",
        "publish_date": "Tue, 15 Jul 2025 19:40:41 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Jacob Blackwell was once a fit tradie with a love of sports. But a devastating brush with meningococcal disease turned his life upside down.\n\n\n\n\n\nHe was used to feeling tired after work, but one Monday, he said he had \"full chronic pain\". At first, he thought it was the flu.\n\n\n\n\n\nBy Wednesday, he had lost consciousness and was rushed to hospital. When he woke up, the 23-year-old was told he had meningococcal disease and spent 230 days in hospital, where he had to relearn basic bodily functions — even blinking.\n\n\n\n\n\n\"Everything, I had to learn how to do again,\" Blackwell said. \"Eating, talking, all that — it's back to square one.\"\n\n\n\n\"Think of it as an 18-month-old learning to do everything again,\" Blackwell said.\n\n\n\n\n\nThe diagnosis was just the beginning of a long road to recovery — both for Blackwell and his family.\n\n\n\n\n\nHis mother, Chelsea Blackwell, said when she found Jacob, he didn't look like himself.\n\n\n\n\n\n\"His brain had already been swollen, so his eyes were protruding and his skin was breaking a little bit. I initially thought he'd been assaulted,\" she said.\n\n\n\n\n\nThe diagnosis came as a shock.\n\n\n\n\n\n\"I never thought for a second [it was] bacterial meningitis. I never thought for a second that meningococcal had anything to do with this,\" she said.\n\n\n\nChelsea Blackwell was stunned to learn her son Jacob had meningococcal disease, especially since he showed no sign of the common rash linked to the illness. Source: Supplied\n\nWhat is meningococcal disease?\n\nAs Australia enters its peak season, experts are warning young adults and parents of young children to be aware of early symptoms of the disease.\n\n\n\n\n\nThe bacterial infection can strike without warning and accelerate rapidly, often causing death or leading to life-changing complications.\n\n\n\n\n\nEven with treatment, up to one in 10 people may die, and one in three survivors may be left with long-term complications or a disability.\n\n\n\n\n\n\"That can be brain damage. It can be a loss of limbs. The list goes on,\" said general practitioner Dr Sam Hay. \"These are life-altering effects ... leading to calls for early detection.\"\n\n\n\nWhat are the signs of meningococcal disease?\n\n\"Early symptoms can look like the flu, including fever, headache, drowsiness and vomiting, which is why recognising the signs and acting quickly is so critical,\" Hay said.\n\n\n\n\n\n\"This is especially important as cases rise over winter.\n\n\n\n\n\n\"It often starts with a flu-like illness. A bit of a cold, a bit of a runny nose, a bit of a cough. But then it progresses with fevers and people become very, very sick after that.\"\n\n\n\n\n\nHe said people deteriorate within 24 to 48 hours. \"It really can happen that fast,\" he said.\n\n\n\nChelsea said her son didn't show one of the most common symptoms of meningococcal — a rash with red and purple spots — but even so, it can be one of the last to appear.\n\n\n\n\n\n\"Unfortunately, if you see a rash, it's going to be too late,\" Hay warned.\n\n\n\n\n\nThe bacterium can spread through droplets from the nose and throat of an infected person.\n\n\n\n\n\nIt's not easily transmitted, usually requiring close, prolonged contact, such as living in the same household or kissing.\n\n\n\nAustralia enters peak meningococcal season\n\nLike the flu, meningococcal disease is seasonal, with cases typically peaking in winter and early spring.\n\n\n\n\n\nAlready this year, 56 cases of meningococcal infection have been reported across Australia.\n\n\n\n\n\nThat includes 18 in NSW, 14 in Queensland, 10 in Victoria, seven in Western Australia, five in South Australia, and two in Tasmania.\n\n\n\nKaren Quick, CEO of Meningitis Centre Australia, said understanding the signs and symptoms of the disease is crucial.\n\n\n\n\n\n\"Infectious disease experts tell us that every 20 minutes, your child will continue to get worse. If they continue to get worse, you'll know that something's not right,\" she said.\n\n\n\n\n\n\"What we're finding is parents don't know what the signs and symptoms are.\n\n\n\n\n\n\"It camouflages itself as a virus.\"\n\n\n\n\n\nAll children aged 12 months receive the vaccinations for the A, W, Y and C strains of meningococcal, under the National Immunisation Program (NIP).\n\n\n\n\n\nWhile only Aboriginal and Torres Strait Islander children under two years old and people at increased risk due to specific medical conditions are eligible for a free B vaccine under the NIP. South Australia, Queensland, and the Northern Territory have state-funded vaccination programs to protect more children and teenagers against the B strain.\n\n\n\nREAD MORE Brayden died suddenly at 23. His mum had no idea a vaccine could have saved his life\n\n\"Early detection can make a massive difference. Aussie parents need to understand that it can start with a cold or a flu, but it can rapidly progress,\" Hay said.\n\n\n\n\n\n\"If your kids are getting very sick very quickly, that's when you need to seek help as soon as possible.\"\n\n\n\n\n\nAs Blackwell readjusts to his new life, he's taking each day as it comes.\n\n\n\n\n\n\"As hard as it has been, I kind of like to take every day as my glass half full.\n\n\n\n\n\n\"I used to do sport, work, driving — things we take for granted that get taken away from you.\n\n\n\n\n\n\"You kind of adapt to the life you live now.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/rba-wants-to-scrap-surcharge-fees-says-consumers-would-save-1-2-billion/febshls3v",
        "title": "RBA wants to scrap surcharge fees, says consumers would save $1.2 billion",
        "publish_date": "Tue, 15 Jul 2025 09:48:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "RBA wants to scrap surcharge fees, says consumers would save $1.2 billion\n\nPublished 15 July 2025, 8:53 am\n\nThe Reserve Bank of Australia wants to end surcharging on Eftpos, Mastercard and Visa cards. The fees were first introduced in 2003 to discourage people from using credit cards, but now they cost Australians more than $1 billion dollars a year.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/anthony-albanese-talks-trade-and-defence-with-chinas-leaders/59x0bbg7r",
        "title": "Anthony Albanese talks trade and defence with China’s leaders",
        "publish_date": "Tue, 15 Jul 2025 09:36:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese talks trade and defence with China’s leaders\n\nPublished 15 July 2025, 8:52 am\n\nAustralia has raised the Chinese live firing drills directly with Chinese President Xi Jinping in a critical high level meeting in Beijing. While Anthony Albanese said the contentious policy to return the Chinese leased port of Darwin was not raised in the hour-long meeting with the president, defence and security did feature. The lengthy engagement involved repeated reference to free and open trade, a veiled reference to Washington DC's tariffs, which are already affecting China's economic growth forecasts with flow on impacts for Australia.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/bullying-yelling-sexual-harassment-underpaid-study-finds-1-in-3-young-workers-are-ripped-off-by-employers/adl9otfgr",
        "title": "'Bullying, yelling, sexual harassment, underpaid': study finds one in three young workers are ripped off",
        "publish_date": "Tue, 15 Jul 2025 09:01:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nDeshal Patel moved to Australia from India for higher education, and sought part-time work to get through her studies.\n\n\n\n\n\nHer first job at a jewellery store paid well below the minimum wage.\n\n\n\n\n\n\"I was getting paid $13 an hour. I was getting paid in cash, obviously there was no superannuation or penalty rates when I worked over the weekends. My other co-workers were also getting paid the same rate and we didn't have any formal contract or anything like that.\"\n\n\n\n\n\nIn total, Ms Patel says she worked seven jobs where she was underpaid, and in some cases, mistreated.\n\n\n\n\n\n\"Bullying, harassment or your employers yelling at you. I also experienced sexual harassment at some of the workplaces, and my experience is not an isolated incident. I know a lot of my friends, peers and co-workers have experienced something very similar. I hear the story again and again, so I would say this is a widespread problem and not an isolated experience.\" Ms Patel is among the one in three young workers who have been ripped off by employers, according to a new study.\n\n\n\n\n\nIts co-author is Professor John Howe from Melbourne University's Law School.\n\n\n\n\n\nHe says young migrants are among the most vulnerable to workplace exploitation.\n\n\n\n\n\n\"So if you're on a visa, then you might be worried, whether rightly or not, about losing that visa if you make a complaint. In the case of people from a non-English speaking background, if their English is not great, they may not understand their rights or may not feel confident enough to raise an issue let alone make a complaint.\"\n\n\n\n\n\nIn a survey of more than 2,800 workers under 30, the study found a third of respondents were paid $15 per hour or less.\n\n\n\n\n\n36 per cent weren't allowed to take breaks they were entitled to, while a similar number, 34 per cent, weren't paid for trial shift work.\n\n\n\n\n\nAs many as 60 per cent had to pay for work-related uniforms, equipment and training.\n\n\n\n\n\n\"The report's damning but certainly not surprising.\"\n\n\n\n\n\nYolanda Robson is director of the Melbourne-based Young Workers Centre, which has spoken to more than 65,000 young people during outreach programs.\n\n\n\n\n\n\"If you are a person who identifies as young or queer or coming from a migrant background, then we know you're inherently more at risk of workplace exploitation. That is just fact, that you are over-represented and more likely to be injured at work, taken advantage of, bullied, discriminated on the job. We see it all the time at the Young Workers Centre.\"\n\n\n\n\n\nAnd for young people who have recently entered the workforce, she has this message:\n\n\n\n\n\n\"Getting taken advantage of doesn't build resilience. What builds resilience is knowing what your rights are and actually going about asserting them with your fellow co-workers. That's what builds resilience, not being exploited.\"\n\n\n\n\n\nDesha Patel says migrants like her are particularly vulnerable, and she's calling for greater action to stop workplace exploitation.\n\n\n\n\n\n\"I really hope to see some systemic changes where these employers are held accountable and we can actually prevent wage theft and harassment in the first place. The onus shouldn't be on workers to hold these employers accountable. We already have these laws. I wish the government and other agencies work together to better implement these laws.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/love-will-keep-driving-us-torres-strait-islander-in-shock-after-landmark-climate-case-dismissed/wtsftgfws",
        "title": "Love will keep driving us: Torres Strait Islander 'in shock' after landmark climate case dismissed",
        "publish_date": "Tue, 15 Jul 2025 08:49:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"I thought that the decision would be in our favour, I’m in shock. This pain isn't just for me, it’s for all people Indigenous and non-Indigenous who have been affected by climate change.\"\n\n\n\n\n\nThat's Uncle Paul Kabai, expressing the heartbreak now felt by many of Australia's Indigenous peoples on the frontlines of climate change.\n\n\n\n\n\nThe Federal Court has delivered a heavy blow to the hopes of Torres Strait Islanders and climate activists in dismissing a landmark climate case.\n\n\n\n\n\nThe case, first brought by Traditional Owners Uncle Pabai Pabai and Uncle Paul Kabai in 2021, argued the government held a duty of care to the islanders and alleged its failure to adequately reduce greenhouse gas emissions brought harm to their communities.\n\n\n\n\n\nJustice Michael Wigney delivered the Federal Court's ruling that Australia has no such duty in this case.\n\n\n\n\n\n\"The applicants have not succeeded in making their primary case in negligence. The Commonwealth did not and does not owe Torres Strait Islanders the duty of care alleged by the applicants in support of their primary case. The decisions involved in the setting and communication of Australia's greenhouse gas emissions reduction targets, pursuant to its international obligations or otherwise, are highly political in nature and almost self-evidently involve matters of high or core government policy. They are accordingly not properly subjected to common law duty of care of the sort alleged by the applicants.\"\n\n\n\n\n\nIt comes as climate experts say the clock is ticking for the Torres Strait Islands – also known as Zenadth Kes – a collection of 200 islands stretching from Cape York to Papua New Guinea.\n\n\n\n\n\nUncle Paul Kabai tells NITV after living on these islands for thousands of years, Torres Strait Islanders are now watching sea levels flood their homes, destroy their crops and dislodge sacred burial sites\n\n\n\n\n\n\"We've lost everything. Gardens. How can we teach our kids that this is the right season to plant banana trees, when to plant sweet potato, when to plant taro? All those things are gone. There are no more garden beds, too much salt.\"\n\n\n\n\n\nWith sea levels rising twice the speed as the global average, the court heard evidence that communities on Boigu and Saibai in the Torres Strait could have less than 30 years left before their islands become uninhabitable.\n\n\n\n\n\nJustice Wigney says he sympathised with the alarming evidence, emphasising that his findings on this matter should not be construed as a dismissal of the unfolding devastation to Torres Strait communities.\n\n\n\n\n\n\"The findings I have made cannot and should not be construed as somehow sanctioning or justifying the unquestionably modest and unambitious greenhouse gas emissions reduction targets that were set by the Commonwealth in 2015, 2020 and 2021. The Torres Strait Islands and their traditional inhabitants are quite literally at the very frontline of climate change and its devastating impacts. Unless something is done to arrest global warming and the resulting escalating impacts of climate change, there's a very real risk that the applicants' worst fears will be realised and they will lose their islands, their culture and their way of life and will become - as it were - climate refugees.\"\n\n\n\n\n\nBut for those hoping for a ruling that would compel the government to act to further reduce emissions to help ensure the world doesn't exceed the global temperature target - of 1.5 degrees Celsius above pre-industrial levels - they will be disappointed by the result.\n\n\n\n\n\nThe historic case was filed in the Federal Court in 2021 with the two Torres Strait Islander men arguing the government had not done enough to protect their people and islands from climate change.\n\n\n\n\n\nA year later in 2022, the United Nations Human Rights Committee ruled that Australia's failure to act on the climate crisis had breached the rights of Torres Strait Islanders.\n\n\n\n\n\nIsabelle Reinecke is the Founder and Executive Director of Grata Fund, a not-for-profit litigation company which supported the Federal Court case.\n\n\n\n\n\nShe says it was modelled on a previous case by a Dutch environmental group (Urgenda Foundation) which led to the Netherlands being found legally-obliged to reduce emissions to protect the human rights of its citizens.\n\n\n\n\n\n\"It really is a landmark and is being watched around the world, and it's modelled on the most successful global climate case in history out of the Netherlands where the Dutch people successfully sued their government for similar climate negligence.\"\n\n\n\n\n\nAfter the disappointing outcome for the Indigenous leaders, Ms Reinecke says the fight is far from over for Torres Strait Islanders, who will continue to advocate for the protection of their communities.\n\n\n\n\n\n\"The communities and the elders that I'm working with are so clear and determined they know what they're up against and they believe that they will keep fighting with what comes next. I really believe that today is just the beginning of the next chapter in what will be a long-term fight for many Australians to really hold the government accountable for its harms and to really ensure that we're all taken care of in the way that we need to be.\"\n\n\n\n\n\nUncle Pabai Pabai says he is heartbroken but love for his community will keep him fighting on.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/rba-proposes-end-to-card-surcharge-china-gdp-surprise/h2fakn16f",
        "title": "RBA proposes end to card surcharge & China GDP surprise",
        "publish_date": "Tue, 15 Jul 2025 08:33:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/anthony-albanese-urged-to-avoid-being-weak-push-china-to-release-detained-australian/a5yjvd0iv",
        "title": "Anthony Albanese urged to avoid being 'weak', push China to release detained Australian",
        "publish_date": "Tue, 15 Jul 2025 06:06:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "A friend of detained Australian writer Yang Hengjun has called on Anthony Albanese to move past \"weak\" efforts in advocating for the release of his friend, as the prime minister meets with the Chinese president in Beijing.\n\n\n\n\n\nAhead of his fourth meeting with Xi Jinping in Beijing, Albanese is facing pressure to advocate for Yang's release.\n\n\n\n\n\nYang, who has been detained since 2019, was handed a two-year suspended death sentence in February 2024 over charges of espionage. He maintains his innocence.\n\n\n\n\n\nYang's friend and his PhD supervisor in Australia, associate professor Feng Chongyi, said Albanese was focusing entirely on trade during the six-day trip, which he said came at the expense of Australian values around human rights.\n\n\n\n\n\nFeng told SBS News lobbying efforts by Albanese and Foreign Minister Penny Wong to secure his friend's release were \"not working\" and had been \"too weak, too soft\".\n\n\n\nYang Hengjun wrote about Chinese democracy and US politics online as a high-profile blogger and also penned a series of spy novels. Credit: AP Feng said the approach \"actually invites bullying from the CCP [Chinese Communist Party] regime\".\n\n\n\n\n\n\"It is only lip service, rather than put a very harsh demand that you have to release Dr Yang,\" he said on Tuesday.\n\n\n\n\n\n\"Otherwise, we will not normalise trade. Australia will not normalise relations with China unless you stop bullying Australian citizens like that.\"\n\n\n\n\n\nFeng suggested Australia leverage mineral resources — iron ore, natural gas and lithium — to broker a deal with Xi.\n\n\n\n\n\nHe said Yang's life was in \"danger\" as his health continued to deteriorate.\n\n\n\nREAD MORE Health scare could threaten life of Australian author detained in China\n\nFeng said Yang has been \"habitually tortured\" and suffers from constant pain, is malnourished and unable to get treatment for a 10cm cyst on his kidney.\n\n\n\n\n\n\"Sometimes Chinese authorities even deny his right to accept the extra money sent by his relatives to buy additional food, including dried beef or milk powder,\" he said.\n\n\n\n\n\n\"So he's catching a cold all the time and he has fainted many times in prison. It's quite a serious concern for me and his family members.\n\n\n\n\n\n\"What I expect from Prime Minister Albanese is that he insist on the immediate release of Hengjun back to Australia, because this is unacceptable.\"\n\n\n\n\n\nSpeaking to reporters after meeting with Xi, Albanese said he had raised the case.\n\n\n\n\n\n\"You wouldn't expect there to be an immediate outcome, and that is not the way things work,\" he said.\n\n\n\n\n\n\"The way it works is by that patient, calibrated advocacy — what Australians do, what my government does — and I point to the record of my government when it comes to these issues.\"\n\n\n\nWhen asked directly about Feng's comments to SBS News, Albanese said it would be \"inappropriate and insensitive\" to respond.\n\n\n\n\n\n\"I understand the pressures on people when a loved one has been incarcerated,\" he said.\n\n\n\n\n\n\"What we will do, though, is put forward our views in a diplomatic way in order to try to maximise an outcome, and I point towards the outcomes where Australians here in China, in Myanmar, in Vietnam, in Indonesia, the US and the UK have all received outcomes that, at the least, could be called satisfactory.\n\n\n\n\n\n\"And we will continue to do that to achieve outcomes and that is what our objective is.\"\n\n\n\nYang's letter to Albanese from prison\n\nIn a handwritten letter sent to Albanese earlier this year from prison, Yang thanked him for his support.\n\n\n\n\n\n\"Dear Prime Minister Albanese, words are now failing me. Tears blur my vision. I can only use a silent voice to thank you and all the people who care for and love me,\" the letter, written in January, reads.\n\n\n\n\n\n\"I know you and the Australian government endeavour to do your utmost to bring me home for medical care and reunification with my family.\n\n\n\n\n\n\"Let peace win, let humanity gain, let love prevail, let freedom ring.\"\n\n\n\n\n\nBoth Albanese and Wong have repeatedly said they continue to advocate for Yang's \"interests and well-being at every opportunity\".\n\n\n\n\n\n— With additional reporting from AAP\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-15-july-2025/uqxt6j02o",
        "title": "SBS News in Easy English 15 July 2025",
        "publish_date": "Tue, 15 Jul 2025 04:16:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA review by the Reserve Bank has recommended an end to debit and credit card surcharges in Australia.\n\n\n\n\n\nThe central bank has recommended the fees be scrapped on EFTPOS, Mastercard and Visa card transactions as they don't help people make more efficient payment choices.\n\n\n\n\n\nThe changes would fall under the central bank's existing powers and would not require legislation to take effect.\n\n\n\n\n\nThe commencement date for the changes is July next year following a period of consultation.\n\n\n\n\n\nExperts are warning young adults and parents of young children to be aware of early symptoms of meningococcal disease, as Australia enters its peak season.\n\n\n\n\n\nSymptoms include fever, headache, stiff neck, and a rash of red or purple spots or bruises that don't fade when pressed.\n\n\n\n\n\nDoctors say 56 cases have already been reported this year - 18 in New South Wales prompting a national campaign to raise awareness of the disease.\n\n\n\n\n\nKaren Quick, the CEO of Mengingitis Centre Australia, says early detection is crucial.\n\n\n\n\n\n\"It's really important as parents that we're aware of all the signs and symptoms, we trust our instincts and we get help straight away. Go straight to the hospital, straight to the doctor, and ask the question, could it be meningococcal?\"\n\n\n\n\n\nWestern Sydney University says it will use a grant from the Gates Foundation to research how health professionals can improve their understanding of heavy menstrual bleeding and related health issues.\n\n\n\n\n\nHMB is one of the most underdiagnosed reproductive health conditions globally, with estimates suggesting it affects up to one in four women. It is frequently associated with treatable underlying conditions and can impose serious physical, emotional, and social burdens.\n\n\n\n\n\nIn cricket, Mitchell Starc has produced one of the all-time great opening spells and Scott Boland took a hat-trick, as Australia bowled West Indies out for 27 to win the third Test.\n\n\n\n\n\nOn a historic day in Jamaica, Australia's quicks helped to deliver a 176-run victory and claim a 3-nil series sweep in the fight for the Frank Worrell Trophy.\n\n\n\n\n\nStarc told ESPN, he is proud to have contributed to the team's overall result.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/anthony-albanese-joins-premier-li-qian-in-beijing-midday-news-bulletin-15-july-2025/w0tvvc8ql",
        "title": "Anthony Albanese joins Premier Li Qiang in Beijing | Midday News Bulletin 15 July 2025",
        "publish_date": "Tue, 15 Jul 2025 02:32:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAnthony Albanese joins Premier Li Qiang at business roundtable in Beijing...\n\nAn end to debit and credit card surcharges in Australia announced...\n\nAustralia defeat the West Indies to win the Frank Worrell Trophy.\n\n\n\n\n\nThe chief executive of the Business Council says the eighth Australia-China CEO Roundtable in Beijing represents an important opportunity to further two-way economic growth.\n\n\n\n\n\nPrime Minister Anthony Albanese and Premier Li Qiang will be at the roundtable, alongside senior business leaders from Australia and China.\n\n\n\n\n\nIt is the first time the roundtable has been held in Beijing since 2016 - and comes as the Chinese-Australian free trade agreement passes its 10th anniversary.\n\n\n\n\n\nBusiness Council of Australia CEO Bran Black says the event is an important chance to identify areas of growth.\n\n\n\n\n\n\"It sends a signal that partnership and engagement as between Australia and Chinese businesses is not only something to be welcomed, but something that we should actively encourage. Secondly, what we're pleased by is that we will have the opportunity today to engage directly with Chinese businesses in relation to a number of key areas where we see scope to further enhance relationship. In areas like agribusiness, professional services, financial services.\"\n\n\n\n\n\nA review by the Reserve Bank has recommended an end to debit and credit card surcharges in Australia - in a move that would save consumers and businesses $1.2 billion a year.\n\n\n\n\n\nThe central bank reviewed merchant card payment costs and has recommended the fees be scrapped on EFTPOS, Mastercard and Visa card transactions as they don't help consumers make more efficient payment choices.\n\n\n\n\n\nIt also calls for lowering the cap on what's called the interchange fees paid by businesses.\n\n\n\n\n\nThe fee is paid by a business to a customer's card issuer when a transaction occurs.\n\n\n\n\n\nThe changes would fall under the central bank's existing powers and would not require legislation to take effect.\n\n\n\n\n\nThe commencement date for the changes is July next year following a period of consultation.\n\n\n\n\n\nTraditional Owner Uncle Pabai Pabai says a lot of weight is being placed on the outcome of a Federal Court case that will be handed down this afternoon.\n\n\n\n\n\nAt risk of becoming Australia's first climate refugees, Uncle Paul Kabai and Uncle Pabai Pabai filed the landmark case against the government in the Federal Court in 2021.\n\n\n\n\n\nThey claim it failed to protect their homelands among the Torres Strait Islands from climate change.\n\n\n\n\n\nThey are seeking orders from the court that would require the government to take steps to prevent harm to their communities, including cutting greenhouse gas emissions in line with the best available science.\n\n\n\n\n\nThe court heard evidence communities on Boigu and Saibai - in the Torres Strait - could have less than 30 years left before their islands become uninhabitable.\n\n\n\n\n\nUncle Pabai Pabai says after four years, it will be important to hear the outcome.\n\n\n\n\n\n\"We will be feeling emotion because I believe that this is my legacy to my people. Not only to myself to the future generations. This is what is being handed down. We - at this stage now - this is my majority of the case to be done - to win for the people of the younger generation.\"\n\n\n\n\n\nWestern Sydney University says it will use a prestigious grant from the Gates Foundation to research how health professionals can improve their understanding of heavy menstrual bleeding and related health issues. Professor Robert Gorkin from the Translational Health Research Institute will lead a project to better manage the condition, helping to reduce stigma and confusion for those affected, while significantly improving quality of life for women worldwide.\n\n\n\n\n\nHMB is one of the most underdiagnosed reproductive health conditions globally, with estimates suggesting it affects up to one in four women. It is frequently associated with treatable underlying conditions and can impose serious physical, emotional, and social burdens.\n\n\n\n\n\nIn cricket, Mitchell Starc has produced one of the all-time great opening spells and Scott Boland took a hat-trick, as Australia bowled West Indies out for 27 to win the third Test.\n\n\n\n\n\nOn a historic day in Jamaica, Australia's quicks helped to deliver a 176-run victory and claim a 3-nil series sweep in the fight for the Frank Worrell Trophy.\n\n\n\n\n\nBoland is only the 10th Australian to claim a Test hat-trick.\n\n\n\n\n\nStarc is the fourth Australian to take 400 wickets amid the fastest five-wicket haul in Test history.\n\n\n\n\n\nHe told ESPN, he is proud to have contributed to the team's overall result.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/pm-says-paul-kelly-was-played-during-meeting-with-xi-jinping-20250716-p5mfd1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PM says Paul Kelly was played during meeting with Xi Jinping",
        "publish_date": "Wed, 16 Jul 2025 12:20:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "PM says Paul Kelly was played during meeting with Xi Jinping\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/pollock-spirit-rubbing-off-on-lions-20250716-p5mf9x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pollock spirit rubbing off on Lions",
        "publish_date": "Wed, 16 Jul 2025 12:20:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Pollock spirit rubbing off on Lions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/humpback-whale-puts-on-a-show-in-sydney-harbour-20250716-p5mfcw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Humpback whale puts on a show in Sydney Harbour",
        "publish_date": "Wed, 16 Jul 2025 12:10:48 +1000",
        "category": "finance",
        "authors": [],
        "text": "Humpback whale puts on a show in Sydney Harbour\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/qantas-passengers-stranded-in-singapore-for-days-after-mechanical-issues-20250716-p5mf9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Qantas passengers stranded in Singapore for days after mechanical issues",
        "publish_date": "Wed, 16 Jul 2025 12:01:02 +1000",
        "category": "finance",
        "authors": [
            "Felicity Caldwell",
            "Chris Zappone"
        ],
        "text": "Hundreds of Qantas passengers will be stranded in Singapore for days after their flight to Sydney was repeatedly delayed, complicated by the earlier damage to another Qantas plane.\n\nAnd it was not the only Qantas flight disrupted – the QF2 due to leave Singapore at 7.30pm on Wednesday for Sydney was cancelled, and the QF82 from Singapore to Sydney leaving 8.45pm on Wednesday would be delayed four hours, while the QF81 leaving Sydney at 10.20am on Wednesday had been delayed almost six hours.\n\nRecovery options for Singapore passengers have been complicated by the damage to another A380 at the weekend.\n\nA Qantas Airbus A380 at Sydney Airport. Credit: Wolter Peeters\n\nAn aerobridge rammed into a Qantas A380 superjumbo engine at Sydney Airport, delaying a long-haul flight to Johannesburg by 21 hours for hundreds of passengers.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/unique-opportunity-brad-scott-searches-for-positives-amid-bombers-injury-crisis-20250716-p5mfbc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brad Scott identifies ‘unique opportunity’ for injury-hit Bombers; Cyril Rioli to make Marvel return",
        "publish_date": "Wed, 16 Jul 2025 12:00:59 +1000",
        "category": "sports",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "“It’s incredibly frustrating for everyone involved, but particularly the players,” Scott on Wednesday before the team’s training session at the Hangar.\n\nScott admitted the Bombers were frustrated following their disastrous loss to Richmond at the weekend and their extensive injury list, which grew to 15 players with Nate Caddy, Nic Martin, Will Setterfield and Ben Hobbs all coming out of the team that lost to the Tigers for Thursday’s game against Greater Western Sydney.\n\nEssendon coach Brad Scott confirmed his club was planning to reallocate resources to prevent “a perfect storm of injuries” from happening again next season.\n\n“I mean, it’s hard not to be really frustrated, almost exasperated, just devastating seeing players like Nic Martin and Will Setterfield suffer really serious injuries … so that’s on an individual level, but it’s been a perfect storm of a whole range of different injuries all coming together at once.”\n\nThe Bombers lost Setterfield to a Lisfranc foot injury which requires surgery, while Martin is to undergo a knee reconstruction next week after tearing his ACL. Despite the circumstances, Scott said Martin was remaining resilient.\n\n“I’m an eternal optimist, but it doesn’t mean I don’t get flat at times,” he said. “And Marto [Martin] is a good example for us. Like, yes, he’s optimistic, but he’s also had some pretty dark moments. But he’s been there before, and he knows the way out.”\n\nWhen asked how the Bombers could avoid such a mammoth injury list next year, Scott said he was focused on the short term, but said the club would look at improvements.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-is-misleading-the-american-people-20250716-p5mf9c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump is misleading the American people",
        "publish_date": "Wed, 16 Jul 2025 12:00:39 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The US sharemarket, which fell 0.4 per cent, and US bond yields, which rose, say that investors understood the data better than Bessent or his president. The odds on an early rate cut from the Fed have been lengthened, not shortened, by the data. Bessent should know better than to claim victory at this point in the rollout of Trump’s tariffs, given his central role in that process. While some tariffs were announced in February and Trump’s “Liberation Day” baseline and “reciprocal” tariffs on April 2, most of those tariffs were deferred for 90 days until July 9 and then, again, until August 1. They’re not even in place yet and, given Trump’s history – what Wall Street has dubbed the “TACO” trade, or “Trump Always Chicken out” – there is no certainty that they will be on August 1. Given that US importers started front-loading their inventories in anticipation of the tariffs and continue to do so – they’ll have had at least four or five months to build their stocks before the bulk of the more punitive tariffs cut in next month, assuming they aren’t deferred again – the full impact of Trump’s trade war on the rest of the world won’t be known until, at the earliest, late this year.\n\nApart from the stockpiling, it can take a month from the point they are ordered to ship goods from Asia to the US and goods on the water before the tariffs come into effect are exempt from them. There are a lot of lags, some of them now considerable, before tariffs announced in April actually flow through to consumer prices and the inflation rate. Separate to the reciprocal tariffs, the 30 per cent rate Trump has threatened to impose on imports from the European Union and Mexico, the 50 per cent tariff on Brazil, the 50 per cent tariff on copper and more sectoral tariffs on pharmaceuticals, timber and semiconductors are also yet to come. US consumers are starting to see a rise in prices on everyday goods. Credit: Bloomberg The Yale Budget Lab says that, once those tariffs announced so far are implemented, including the tariffs on the EU and Mexico, the overall effective average tariff rate will be 20.6 per cent, the highest since 1910. Prices would rise by 2.1 per cent in the near term, equivalent to an average per household loss of income of $US2800 (about $4300).\n\nThe Yale researchers also say that the tariffs announced to date will raise $US2.5 trillion through to 2035. While Trump repeatedly (and falsely) claims that the revenue is coming from the exporting countries, Goldman Sachs economists says US consumers will end up paying about 70 per cent of the increased costs to importers. The exporters might shave their margins, as might the importing companies who actually pay the increased customs duties when the goods pass through the US border, but the overwhelming majority of the cost of Trump’s tariffs will be a tax on US households’ consumption. Loading That’s why Trump’s claim that his tariffs will raise billions of revenue (which they will), while having no impact on inflation or the economy (they will have an impact) only makes sense if you believe him when he says the exporters will pay the tariffs (which they won’t). The Yale Budget Lab says the tariffs to date will reduce US GDP by 0.9 percentage points initially and 0.5 percentage points thereafter, or about $US135 billion a year in 2025 dollars.\n\nHigher inflation rates and lower economic growth equates to stagflation, which would be the Fed’s worst nightmare. It would be forced to either target the inflation rate with higher interest rates or rising unemployment with lower rates but even higher inflation. That’s why, despite Trump’s verbal assaults on the Fed and its chair, Jerome Powell, the Fed is sitting on its hands and will continue to do so until there is a clearer picture of the likely effects of the tariffs. Wall Street seems to be counting on Trump to back down. Credit: AP Trump and the Republicans have been stepping up their attacks on Powell, with the director of Trump’s national economic advisers, Kevin Hassett, saying this week that the administration is still looking for the grounds to fire him. Trump really wants a rate cut. Republicans have seized on costs blow-outs in the renovation of the Fed’s ageing and asbestos-riddled Washington headquarters to target Powell and to try to develop the grounds to fire him “for cause,” the only legitimate way a Fed chair can be removed.\n\nBessent, who says the administration has started a formal process to identify Powell’s successor when his term as chair expires next May, also says Powell should step down as a Fed governor at that point. His term as a board member doesn’t end until 2028. The administration’s current strategy appears to be that it will appoint a chair-elect in January, when term of another governor, Adriana Kugler, ends. That would undermine Powell’s authority before he vacates the chair, although it might also see the incoming chair isolated by the rest of the board. Those sectors that are most tariff-exposed – fresh fruit and vegetables, household appliances and furniture, toys, clothing and sporting goods – all experienced prices increases. Trump has made it clear that a precondition of the new chair’s appointment will be their willingness to lower rates, with the most likely candidates – Hassett, Bessent, former governor Kevin Warsh and current governor Christopher Waller – all currently auditioning for the role by trying to demonstrate their rate-cutting credentials. If, as the new chair takes Powell’s seat at the Fed’s board table, inflation is spiking because of Trump’s tariffs, the Fed will be in an invidious position, with its independence and credibility – and the stability of America’s bond and sharemarkets and its currency – at risk if it doesn’t respond with higher rates.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/new-cast-members-and-first-looks-revealed-as-harry-potter-tv-series-begins-production-20250716-p5mf9k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New cast members and first looks revealed as Harry Potter TV series begins production",
        "publish_date": "Wed, 16 Jul 2025 11:50:55 +1000",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Wands at the ready, wizards and witches. Production has officially begun on the new Harry Potter television series, nearly 14 years to the day since the final Harry Potter film landed in cinemas.\n\nHBO announced on Tuesday it had started filming the highly anticipated TV adaptation at the Warner Bros. Studios Leavesden in the UK – the same area where the eight original films were shot.\n\nThe new Harry Potter has officially landed at Hogwarts. Credit: HBO via AP\n\nThe network also released its first photo of Dominic McLaughlin as the new Harry Potter, replete with the classic Hogwarts uniform and cape, shaggy black hair, round-rim glasses and signature lightning bolt scar. At a glance, the 11-year-old appears the spitting image of Daniel Radcliffe when he starred in Harry Potter and the Philosopher’s Stone nearly 24 years ago.\n\nSo, now that production is well and truly under way, and we’re one step closer to re-entering the magical world of witchcraft and wizardry, let’s take a look at exactly what we can expect from the upcoming series.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/the-monster-australian-rugby-helped-build-leinster-lions-return-to-haunt-the-wallabies-20250714-p5metg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The monster Australian rugby helped build: Leinster Lions return to haunt the Wallabies",
        "publish_date": "Wed, 16 Jul 2025 11:47:15 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "The British and Irish Lions’ plans to defeat the Wallabies will rely on a system built in Dublin and shaped by a series of coaches steeped in Australian rugby.\n\nFourteen Lions have now been called up from Leinster, Ireland’s dominant province. Coach Andy Farrell has long leaned on the team while coaching Ireland, and is now doing the same with the Lions. The Leinster machine, which surged under Michael Cheika and was then refined by now Wallabies coach Joe Schmidt, will be decisive in this series.\n\nFive of the seven head coaches over the past 25 years at Leinster have had an Australian rugby background: Matt Williams, Gary Ella, Cheika, Schmidt and Matt O’Connor.\n\nFormer Waratahs coach Williams points out that he cannot take any of the credit for the later success at Leinster. That goes largely to Cheika, who won the club’s first European title in 2009, and was followed by Schmidt in 2010 and 2012, before later success under former Ireland international Leo Cullen.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/where-should-the-bad-luck-bombers-look-to-find-a-cure-for-their-injury-curse-20250715-p5mf6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where should the bad-luck Bombers look to find a cure for their injury curse?",
        "publish_date": "Wed, 16 Jul 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [],
        "text": "Essendon’s injury toll isn’t just bad – it’s close to unprecedented. Every club faces battles with injury, and right now, the Bombers are deep in the trenches. They’re not alone – plenty of clubs have endured tough stretches. This just happens to be Essendon’s turn.\n\nAs of round 18, the Bombers have used 41 players, lost over 149 games to injury, and had up to 14 players unavailable in some weeks. That’s nearly a third of their list impacted — making it one of the most severe injury runs in recent AFL memory, both in volume and type.\n\nEssendon have had a major injury crisis in season 2025, with the large number of injured players including (from left) Mason Redman, Kyle Langford and Sam Draper. Credit: Photos: AFL Photos. Artwork: Marija Ercegovac\n\nThey’ve already debuted 12 players, the most of any AFL team this year – and that number is set to grow. With Liam McMahon and Rhys Unwin expected to debut, they’ll have used at least 43 players from a list of 47. Of the few who haven’t featured, Nik Cox has missed the entire season with ongoing concussion issues.\n\nBut it’s not just the numbers — it’s the players and the reasons behind it. Core members like Sam Draper, Jordan Ridley, Kyle Langford, Zach Reid, Mason Redman, and Darcy Parish have all missed significant time, often for extended periods. These are the pillars of Essendon’s best 22. Nate Caddy and Ben Hobbs are the latest to join the injury list.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/lara-lloyd-and-richards-called-into-emergency-talks-after-west-indies-disaster-20250716-p5mf8a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lara, Lloyd and Richards called into emergency talks after West Indies disaster",
        "publish_date": "Wed, 16 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: A full-blown cricket crisis has erupted in the Caribbean following a humiliating batting collapse against Australia in Kingston, with Cricket West Indies president Dr Kishore Shallow calling an emergency meeting involving three of the game’s most iconic batsmen in Sir Vivian Richards, Brian Lara and Sir Clive Lloyd.\n\nThe West Indies endured one of the darkest days in their cricketing history when they were rolled for just 27 in 14.3 overs in the third Test, with seven players making ducks.\n\nMitchell Starc finished with extraordinary figures of 6-9, while Scott Boland became just the 10th Australian man to claim a Test hat-trick.\n\nIn a statement released on Tuesday - a day after West Indies slumped to their third consecutive Test defeat in the Frank Worrell Trophy - Shallow said the result was unacceptable.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/this-nsw-house-sold-for-347-it-came-with-a-catch-20250710-p5me18.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This NSW house sold for $347. It came with a catch",
        "publish_date": "Wed, 16 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "Character-filled homes in the Northern Rivers are selling for as low as $347, with bidding starting at just $1. They’re a bargain and savvy investors and first home buyers are snapping them up – but there’s a catch.\n\nHundreds of flood-affected homes in the region are expected to go up for auction, but buyers will need to bring their own land.\n\nThis Kyogle home sold for just $347. Credit: Reconstruction Authority\n\nAfter some blocks of land in Lismore and other flood-prone areas of the Northern Rivers were deemed too dangerous to live on after the 2022 floods, the Reconstruction Authority bought back 670 houses from flood-affected owners.\n\nSome of those homes are going up for auction, selling for less than the average home deposit in NSW. The catch is, within 12 months the buyer is expected to move the house to their own, non-flood zone land.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/i-didn-t-set-out-to-make-a-diverse-film-i-wanted-to-create-a-hero-20250714-p5mero.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I didn’t set out to make a ‘diverse’ film. I wanted to create a hero",
        "publish_date": "Wed, 16 Jul 2025 11:30:00 +1000",
        "category": "entertainment",
        "authors": [
            "John Jarratt"
        ],
        "text": "There’s a particular kind of magic that happens when you see yourself on screen. Not just someone who looks like you, but someone who feels like you. Someone whose story rings familiar – not because it’s perfect, but because it’s true.\n\nThat magic is still far too rare.\n\nGerard O’Dwyer in a scene from What About Sal.\n\nFor decades, the stories we’ve consumed on screen have followed a narrow path: familiar faces, familiar arcs, familiar settings. We were taught to believe that these stories were universal. That if they resonated with the mainstream, they must be enough. But enough for whom?\n\nAs a filmmaker, I’ve seen firsthand how the industry is slowly, sometimes painfully, waking up to the power of diversity – not just as a checkbox, not just as a quota, but as the lifeblood of meaningful storytelling.",
        "source": "TheAge"
    }
]