[
    {
        "url": "https://www.9news.com.au/national/optus-fined-100-million-for-allegedly-pressuring-customers-into-buying-services-they-didnt-want-or-need/360fa3a2-e07f-4a39-84f3-dc2f032c4317",
        "title": "Optus fined $100 million, subject to court approval, over sales tactics to vulnerable customers",
        "publish_date": "Wed, 18 Jun 2025 01:12:58 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Australia's consumer watchdog will fine Optus $100 million after the telecommunications company was found to have engaged in unconscionable conduct by selling products that consumers did not want or need.\n\nAustralia's consumer watchdog will fine Optus $100 million after the telecommunications company was found to have engaged in unconscionable conduct by selling products that consumers did not want or need.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trump-will-grant-tiktok-another-90day-extension-in-enforcement-of-sale-or-ban-law/d3aeea66-bf7e-4112-a81c-31bc9fd8d9c7",
        "title": "Trump will grant TikTok another 90-day extension in enforcement of sale-or-ban law",
        "publish_date": "Wed, 18 Jun 2025 00:34:33 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "TikTok just got another lifeline from the White House, with President Donald Trump set to delay enforcement of the sale-or-ban law by another 90 days.\n\n\"President Trump will sign an additional Executive Order this week to keep TikTok up and running,\" Karoline Leavitt, White House press secretary, said in a statement.\n\n\"As he has said many times, President Trump does not want TikTok to go dark.\n\nREAD MORE: Teen girl disappears in Queensland town overnight\n\nTikTok just got another lifeline from the White House, with President Donald Trump set to delay enforcement of the sale-or-ban law by another 90 days. (Nine)\n\n\"This extension will last 90 days, which the Administration will spend working to ensure this deal is closed so that the American people can continue to use TikTok with the assurance that their data is safe and secure.\"\n\nCNN has reached out to ByteDance and TikTok for comment.\n\nIt's been about five months since a law requiring TikTok to be banned in the United States unless it's sold off by its China-based parent company technically went into effect.\n\nBut thanks to Trump's promises not to enforce the law, neither of those things have happened, aside from an approximately 14-hour blackout in January.\n\nThe announcement marks Trump's third extension of the ban.\n\nThe announcement means that the app will remain accessible for its 170 million American users despite the legislation that passed last year with bipartisan support over concerns that TikTok's Chinese ownership poses a US national security risk.\n\nAnd it comes as both the United States and China seek leverage in tense trade talks, in which TikTok appears to have become a bargaining chip.\n\nTuesday's announcement marks Trump's third extension of the ban. (AP)\n\nThe TikTok sale-or-ban law went into effect on January 19 after it was signed by former President Joe Biden last year.\n\nTikTok briefly took itself offline, sparking outcry from creators, but quickly came back after Trump signed an order delaying the ban's enforcement by 75 days.\n\nIt was one of his first acts as president, made in hopes of reaching a deal to keep the app \"alive\".\n\nIn April, a deal that would have transferred majority control of TikTok's US operations to American ownership was nearly finalised.\n\nBut it fell apart after Trump announced additional tariffs on China, forcing the president to announce another 75-day delay to keep the app operational in the US.\n\n\"There are key matters to be resolved. Any agreement will be subject to approval under Chinese law,\" TikTok parent company ByteDance said after Trump's tariff policy stalled progress on the deal in April.\n\nThat pause was set to expire on June 19.\n\nTrump's latest enforcement delay raises questions about the status of a deal that could secure TikTok's long-term future in the United States.\n\nIn April, a deal that would have transferred majority control of TikTok's US operations to American ownership was nearly finalised. (AP Photo/Richard Vogel)\n\nThe Chinese government has offered little public indication that it would be willing to approve a sale beyond suggesting that any deal could not include TikTok's \"algorithm\", which has been called the app's secret sauce.\n\nThe announcement comes after the US and China agreed on a framework to ease export controls, a move that's expected to ease tensions and prevent further escalation of export and other restrictions between the two countries.\n\nIt's not clear whether a TikTok deal is included in the framework, but cooperation between the two sides could make an agreement to transfer control of the app to a US buyer more likely.\n\nEarlier on Tuesday, Trump told reporters that a TikTok deal would \"probably\" require approval by the Chinese government and said, \"I think we'll get it.\"\n\n\"I think President Xi will ultimately approve it, yes,\" the US president added.\n\nThe deal that had been in the making earlier this year would have involved several American venture capital funds, private equity firms and tech giants investing in a company that would control TikTok's US operations.\n\nThe TikTok sale-or-ban law went into effect on January 19 after it was signed by former President Joe Biden last year. (AP)\n\nTikTok's China-based owner, ByteDance, would have retained a 20 per cent stake in the spinoff company — a key stipulation of the law.\n\nSeveral other high-profile bidders had also put their hands up to acquire the platform, including a group led by billionaire Frank McCourt and Shark Tank -famous investor Kevin O'Leary, Amazon, AI firm Perplexity and a separate group of investors that included YouTube and TikTok star Jimmy Donaldson, known online as MrBeast.\n\nIt was Trump who first tried to ban TikTok during his previous administration, but he has said he changed his mind after he \"got to use it\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/worlds-most-liveable-cities-2025-sydney-melbourne-and-adelaide-make-top-10/2efacdf3-1661-4798-b8c8-c98c01ca04a9",
        "title": "The world's top 10 most liveable cities ranked",
        "publish_date": "Tue, 17 Jun 2025 20:07:19 +0000",
        "category": "finance",
        "authors": [
            "June"
        ],
        "text": "1 of 11 Attribution: 9News\n\nT﻿he world's most liveable cities for 2025 have been revealed.\n\nThe Economist Intelligence Unit (EIU), a sister organisation to the economist, has ranked a number of cities around the world based on a number of factors including health care, culture and environment, stability, infrastructure, and education.\n\nThis year the list includes three Australian cities.﻿\n\nThese are the cities that made the top 10.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/adriana-smith-baby-delivered-from-braindead-woman-on-life-support-in-georgia-usa/b6c1736a-509d-4525-af6a-edf82a47254c",
        "title": "Baby delivered from brain-dead woman on life support in US",
        "publish_date": "Tue, 17 Jun 2025 16:51:08 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "The baby of a woman in Georgia, USA who was declared brain-dead and has been on life support since February was delivered early on Friday morning, her mother said.\n\nApril Newkirk told WXIA-TV that 31-year-old Adriana Smith's baby was born prematurely by an emergency cesarean section early on Friday, the Atlanta station reported on Monday night.\n\nShe was about six months into her pregnancy. The baby, named Chance, weighs about 1 pound and 13 ounces (822 grams) and is in the neonatal intensive care unit.\n\nThe baby of a woman in Georgia who was declared brain dead and has been on life support since February was delivered early on Friday morning, her mother said. (WXIA-TV)\n\n\"He's expected to be okay,\" Newkirk told the TV station.\n\n\"He's just fighting. We just want prayers for him.\"\n\nNewkirk said her daughter had intense headaches more than four months ago and went to Atlanta's Northside Hospital, where she received medication and was released.\n\nThe next morning, her boyfriend woke to her gasping for air and called 911 (Triple Zero).\n\nEmory University Hospital determined she had blood clots in her brain and she was declared brain-dead. She was eight weeks pregnant, according to WXIA.\n\nNewkirk said Smith would be taken off of life support on Tuesday (Wednesday AEST).\n\nEmory University Hospital determined Smith had blood clots in her brain and she was declared brain-dead (AP Photo/Brynn Anderson)\n\nThe Associated Press reached out to Emory on Tuesday for comment. It is unclear why Emory decided to deliver the baby. The Associated Press has also tried to contact Newkirk.\n\nSmith's family said Emory doctors told them they were not allowed to remove the devices keeping her breathing because state law bans abortion after cardiac activity can be detected — generally around six weeks into pregnancy.\n\nGeorgia Republican Attorney General Chris Carr later issued a statement saying the law did not require medical professionals to keep a woman declared brain dead on life support.\n\n\"Removing life support is not an action 'with the purpose to terminate a pregnancy,'\" Carr said.\n\nNewkirk said Smith (pictured) loved being a nurse at Emory. She also has a seven-year-old son (pictured). (WXIA-TV)\n\nNewkirk said Smith loved being a nurse at Emory. She also has a seven-year-old son.\n\nHer family celebrated her 31st birthday Sunday with several advocacy groups. Newkirk did not speak at the event.\n\n\"I'm her mother,\" Newkirk told WXIA.\n\n\"I shouldn't be burying my daughter. My daughter should be burying me.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/super-boost-for-millions-of-australians/1980b070-203f-4393-b77b-6e0350e5df6c",
        "title": "Millions of Aussies to be thousands of dollars better off from next month",
        "publish_date": "Tue, 17 Jun 2025 02:05:04 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Nearly 10 million Australians will get an automatic boost to their super from July 1, a change that will mean thousands of dollars more in retirement savings, according to the Super Members Council.\n\nThe super funds peak body said the superannuation guarantee rate would on that day rise from 11.5 per cent to 12 per cent, meaning an extra $317 in super for the average Australian worker in the 2025-2026 financial year.\n\nYoung Australians and low-income earners will be the biggest winners.﻿\n\nMillions of Aussies will get a super boost from next month. (Getty Images/iStockphoto)\n\nThe SMC said the increase could see a \"typical\" 30-year-old retire with an extra $22,000 in super.﻿\n\nAnd together with the full increase from nine per cent to 12 per cent in the past decade, it could add up to $132,000 in extra super by retirement.\n\nMore than half of the people getting the increase are under 40 years old – and more people in their 30s will get a boost to their retirement savings than any other age bracket.\n\nREAD MORE: Trump taking on Apple with his own phone company\n\nAlmost a third of the people getting the increase earn less than $50,000 per year and about 70 per cent of those getting the increase earn less than $100,000 a year.\n\nThe average West Australian will get an extra $344 this year, the highest average super boost of the States.\n\nThe lowest average gain will be seen in Tasmania, at $284.\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nSuper Members Council CEO Misha Schubert said the super rate increases were key to delivering a good life in retirement.\n\n\"This boost to retirement savings will help fund the things that matter most – more help with paying the bills, spending time and making memories with the family, trips away and financial security,\" she said.\n\n\"When you know that a 30-year-old today will be more than $130,000 better off in retirement, it underlines why the safeguards that protect super for retirement are so important for all Australians.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/australias-immigration-policies-debate-abc-radio-perth/105429104",
        "title": "Live: Is immigration to blame for WA's growing pains? An expert panel weighs in",
        "publish_date": "Wed, 18 Jun 2025 02:05:05 +0000",
        "category": "finance",
        "authors": [
            "Emma Wynne"
        ],
        "text": "The population of Western Australia is set to officially tip over 3 million people this week.\n\nWhenever ABC Radio Perth reports on the pressure points in WA — the housing crisis, stretched public hospitals and traffic congestion — listeners are quick to blame one thing: immigration.\n\nThey say too many people are coming into WA and the state simply can't cope.\n\nOthers argue without sustained immigration, the state would be critically short of essential workers, including staff in hospitals, aged care and the building industry.\n\nToday we're aiming to get a better understanding of the issue in an expert panel discussion hosted by Nadia Mitsopoulos on ABC Radio Perth.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/state-of-origin-billy-slater-apology-paul-green-reference/105431102",
        "title": "Billy Slater 'deeply and genuinely sorry' for Paul Green reference in emotional presser",
        "publish_date": "Wed, 18 Jun 2025 01:48:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Billy Slater has issued a public apology after linking late Queensland coach Paul Green to a comment made by former NSW prop Aaron Woods.\n\nSlater was asked to respond to being called a \"grub\" by Woods on Sydney radio, and was visibly emotional when making a reference to Green, who died in 2022.\n\nHowever, the 41-year-old called a snap press conference on Wednesday morning in Perth ahead of game two of the State of Origin series, and apologised for referencing Green.\n\n\"Yesterday I wrongly made the link between Paul Green's death and the stress and pressures of coaching, which wasn't accurate and nor was it appropriate,'' he said.\n\n\"I feel terrible about what I said and I spoke to (Green's wife) Amanda Green this morning and apologised for any hurt it may have caused her or her family.\n\n\"I just want to say this, Paul had CTE (chronic traumatic encephalopathy), that is a different disease to what I was referring to.\n\n\"I am deeply and genuinely sorry.''\n\nPost-mortem scans on Green's brain revealed he had a severe form of CTE.\n\nLoading",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/obituary-pianist-alfred-brendel-dies-aged-94/101845758",
        "title": "Intelligent, insightful and lyrical: Concert pianist Alfred Brendel has died aged 94",
        "publish_date": "Wed, 18 Jun 2025 01:30:50 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "His was perhaps the most famous wrinkled brow in classical music, framing the bespectacled eyes of a pianist who penetrated to the very heart of the Austro-Germanic tradition like few others have ever done.\n\nNow, following his death at the age of 94, Alfred Brendel leaves behind a peerless recording legacy and a style of intelligent, insightful, and, above all, lyrical piano playing that continues in the work of his successful students.\n\nA peerless recording catalogue\n\nBorn in Moravia, now part of the Czech Republic, and spending his formative years mainly in Graz and Vienna, Alfred Brendel was destined to become a master of the Central European piano classics.\n\nHis discography on Vox, Decca and Philips among other major labels, says it all.\n\nHe recorded three sets of the Beethoven sonatas and concertos, two each of Schubert's later piano works and the Brahms concertos, one of the complete Mozart concertos, with plenty of Haydn, Liszt and Schumann thrown into the mix.\n\nBuilding a formidable career out of a late musical start\n\nA man of conspicuous intellectual acumen, Alfred Brendel's journey toward his stellar musical career was unusual, coming as he did from a not-especially-musical family and effectively having few real piano lessons beyond his mid-teens.\n\nLegends: Exploring the lives of classical music icons Photo shows Legends program graphic Experience the lives, inspirations and iconic recordings of the classical music legends. Tuesdays at 6pm and any time on the ABC listen app.\n\nBut his was an individual voice from the start, helped by an early interest in composition. At his professional recital debut at the age of 17 in Graz, he performed his own Piano Sonata which included a fearsome double fugue.\n\nThat youthful interest in composition informed his later piano playing, giving him what he called \"musical understanding\". It also helped him to establish his trademark desire to eschew personal glory in the interests of getting to the heart of what composers wanted and the music itself demanded.\n\nAlfred Brendel's recording career began inauspiciously in the early 1950s, when he was handed a reel-to-reel tape recorder and asked to perform the Prokofiev Fifth Piano Concerto, which he didn't know, with a modestly-credentialed orchestra.\n\nFrom then on, he became such a prodigious recording artist that modern listeners are still just as familiar with his sound as his contemporaries were.\n\nA unique performance and teaching style\n\nAlfred Brendel conducts a masterclass for the ABC's Half-hour program in 1966. (ABC Archive: Pearson)\n\nThe Brendel piano style featured remarkable finesse, a majestic sense of control and penetrating intelligence, imparting a sense of definitiveness to his interpretations.\n\nJust as with the man himself, some sensed a kind of aloof austerity in his performances, but both the man and the musician were far from that.\n\nFilled with wide-eyed curiosity and with interests that went well beyond music (poetry, painting and philosophy were lifelong passions), Brendel was also an inspiring teacher.\n\nModern British pianist Paul Lewis who, along with Imogen Cooper, studied with Brendel, recalls: \"Alfred was never interested in pianism for pianism's sake. For him, the piano was always a means to an end.\"\n\n\"In his own way he was very exacting as a teacher, but he was never interested in anything technical,\" Lewis says.\n\nBrendel lived in North London during the second half of his life but never lost his Central European accent.\n\nHaving played in all the world's great concert halls and with all the major orchestras over a 60-year-plus career, he gave up performing on the professional concert stage in 2008.\n\nBrendel continued to appear as a public-speaker, lecturer, and commentator. His writings on music have been justly lauded.\n\nMarried twice, he has four children, including cellist Adrian Brendel, co-founder of the Plush Music Festival in Dorset, where Alfred Brendel kept a country home.\n\nGet the latest classical music stories direct to your inbox",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/tennis-aryna-sabalenka-apology-coco-gauff-unprofessional-call/105430780",
        "title": "Sabalenka writes to Gauff apologising for 'completely unprofessional' comments",
        "publish_date": "Wed, 18 Jun 2025 01:23:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "Aryna Sabalenka says she has written to Coco Gauff to apologise for the \"unprofessional\" comments she made following her loss to her American rival in the final of the French Open.\n\nSpeaking to Eurosport Germany, the top-ranked Sabalenka said her remarks after her 6-7 (5), 6-2, 6-4 loss to Gauff at Roland-Garros this month were a mistake.\n\nIn her post-match press conference in Paris, Sabalenka had suggested that the result was more due to her own errors than to Gauff's performance.\n\n\"That was just completely unprofessional of me,\" Sabalenka said.\n\n\"I let my emotions get the better of me. I absolutely regret what I said back then.\n\nGauff dedicates French Open title to 'Americans who look like me' Photo shows Coco Gauf kisses the French Open trophy, with orange clay court in the background Coco Gauff continues a spectacular season for American women at the grand slams, battling from a set down to topple world number one Aryna Sabalenka in the French Open final.\n\n\"You know, we all make mistakes. I'm just a human being who's still learning in life. I think we all have those days when we lose control. But what I also want to say is that I wrote to Coco afterward — not immediately, but recently.\"\n\nSabalenka hit 37 winners but finished the final with 70 unforced errors — compared to Gauff's 30.\n\nShe said she wrote to Gauff to apologise and \"make sure she knew she absolutely deserved to win the tournament and that I respect her\".\n\n\"I never intended to attack her,\" Sabalanka added.\n\n\"I was super emotional and not very smart at that press conference. I'm not necessarily grateful for what I did. It took me a while to go back and think about it, to approach it with open eyes, and to understand. I realised a lot about myself. Why did I lose so many finals?\"\n\nSabalenka was overcome with emotion in France after losing her second straight grand slam final to start the year. (Getty Images: Robert Prange)\n\nSabalenka, a three-time major champion, also lost to Gauff in the 2023 US Open final, where she also won the first set.\n\n\"I kept getting so emotional,\" Sabalenka added.\n\n\"So I learned a lot. Above all, one thing: I'm the one who always treats my opponents with great respect, whether I win or lose. Without that respect, I wouldn't be where I am today. So it was a tough but very valuable lesson for me.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nSabalenka's apology comes after Gauff said she was \"a little bit surprised\" by the reaction of the Belarusian superstar.\n\n\"At the end of the day, what happened, happened. I won because I earned that win,\" she told ESPN's First Take.\n\n\"We both had to play in the wind, we both had to deal with those conditions. I didn't feel great on the court at all.\n\n\"I went down 4-1 and I thought I was playing the worst tennis of the tournament, but the difference was, I was able to recognise that and find a different way to try and win that match.\n\n\"She's probably emotional about it, so I'm not going to take it too [personally]. I do hope people give her a little bit of slack too.\"\n\nGauff and Sabalenka will both be in action at Wimbledon among the top seeds in the ladies' singles draw.\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/blazeaid-hay-transport-victorian-farmers-drought/105425920",
        "title": "Charity foots bill to truck hay to desperate Victorian farmers",
        "publish_date": "Wed, 18 Jun 2025 01:07:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Road trains laden with hay are travelling thousands of kilometres to keep livestock alive in southern Australia amid ongoing feed shortages.\n\nDrought-stricken farmers are transporting fodder from as far north as Bundaberg in Queensland to feed their animals.\n\nBut Victorian farmer and BlazeAid founder Kevin Butler said freight costs were prohibitive.\n\n\"It's doubled in price and it's still skyrocketing even further … the big issue is freight,\" he said.\n\nHay is being transported from Queensland to the southern states. (Supplied: John Davison)\n\nBlazeAid is offering to cover the fodder freight bills for cattle farmers doing it tough.\n\nThe disaster relief charity is helping to organise the loads of hay and farmers are encouraged to arrange collection points in their area.\n\nThe Victorian government has announced a range of support options for drought-affected farmers but has not committed to subsidising fodder.\n\nFarmers in 'dire straits'\n\nAgriculture Minister Ros Spence told the Victorian Country Hour earlier this month that \"fodder subsidies don’t work.\"\n\n\"The first thing that happens is they drive up price and then that doesn’t help farmers' cash flow,\" she said.\n\nBut Mr Butler said farmers were in \"dire straits\" and that freight assistance made sense.\n\n\"So if the government won't do it, then BlazeAid will do it,\" he said.\n\nA load of hay is delivered to appreciative farmers in Central Victoria. (Supplied: John Davison)\n\nMr Butler said feeding animals was the biggest concern at the moment.\n\n\"[Farmers] are just not going to sleep at night because they know their cows are starving and they don't know where the next bale of hay is going to come from,\" he said.\n\n\"I just can't sit by and hear about all these [breeding animals] getting their heads chopped off and I certainly can't sit by and see my fellow farmers going broke.\"\n\nJohn Davison says recent rain has helped but feed shortages continue. (Supplied: John Davison)\n\nGreen grass, low stocks\n\nRecent rain has turned brown paddocks green across many of the drought-affected areas, but feed for animals is still scarce.\n\nJohn Davison, who runs an agriculture business and small farm at Sugarloaf Creek near Seymour, is coordinating the BlazeAid freight support.\n\nWhy this drought is different Photo shows A male ABC presenter stands behind a table in a hay shed. He's wearing headphones and is hoping a microphone. The Victorian Country Hour tours drought affected parts of south-west Victoria to hear from farmers and communities about how they're coping.\n\nHe said livestock owners would have to truck hay in well into spring.\n\n\"It's nice to keep the moisture in the soil, but because of the cold temperatures we won't get growth,\" Mr Davison said.\n\n\"What we can classify this now [as] is a green drought.\n\n\"The paddocks may look green … but you won't get any higher than an inch [of grass].\n\n\"There's so many ongoing issues now — farmers are selling their breeding stock.\n\n\"If you think you're living in the metropolitan areas and it doesn't affect you, eventually it will, when you start to go buy lamb and beef and see the prices go up.\n\n\"It will take a couple of years to get back up to the [breeding stock] level we're at now.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/accc-optus-admit-unconscionable-conduct-100m-penalty/105430714",
        "title": "Optus faces $100m penalty for unconscionable conduct",
        "publish_date": "Wed, 18 Jun 2025 01:05:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Optus has admitted to engaging in unconscionable conduct and has agreed to a $100 million penalty for selling customers phones and contracts they did not want or need.\n\nThe consumer watchdog sued the telco in October over the practices, which affected hundreds of vulnerable customers.\n\nThe Australian Competition and Consumer Commission (ACCC) said many of the affected consumers were vulnerable or experiencing disadvantage, including living with disability, being unemployed or having English as a second language.\n\nMany of the consumers were First Nations Australians from regional, remote and very remote parts of Australia, the ACCC said.\n\nOptus has admitted that its sales staff acted unconscionably when selling products and services to more than 400 consumers at 16 different stores across Australia between August 2019 and July 2023.\n\n\"I would like to sincerely apologise to all customers affected by the misconduct in some of our stores,\" Optus chief executive Stephen Rue said, describing it as \"inexcusable and unacceptable\".\n\n\" Optus failed these customers, and the company should have acted more quickly when the misconduct was first reported. \"\n\nThe ACCC and Optus will jointly ask the Federal Court to impose a total penalty of $100 million on the telco for breaching the Australian Consumer Law.\n\nThe regulator said it was a matter for the Court to decide whether the penalty was appropriate and to make other orders.\n\n'Simply unacceptable'\n\nThe misconduct included pressuring customers into purchasing large numbers of products, including expensive phones and accessories, that they did not want or need, could not use or could not afford.\n\nSales staff also failed to explain relevant terms and conditions, did not consider whether customers had Optus coverage where they lived, selling products customers could not afford and misleading people into thinking goods were free or part of a bundle at no additional cost.\n\nIn addition to the penalty, Optus has signed an undertaking to compensate affected customers and improve its systems.\n\n\"Impacted customers are receiving refunds as part of a remediation approach which is informed by financial counsellors and industry partners to make sure it is fair and reasonable,\" the telco said in a statement.\n\nACCC deputy chair Catriona Lowe described the conduct as \"simply unacceptable\".\n\n\"Many of these consumers who were vulnerable or experiencing disadvantage also experienced significant financial harm. They accrued thousands of dollars of unexpected debt and some were pursued by debt collectors, in some instances for years,\" Ms Lowe said.\n\n\"It is not surprising, and indeed could and should have been anticipated, that this conduct caused many of these people significant emotional distress and fear.\n\n\"We are particularly concerned that Optus engaged debt collectors to pursue some of these consumers after it had launched internal investigations into the sales conduct.\"\n\nAt the now-closed Mount Isa store, the ACCC said Optus pursued debts even though senior management knew they related to contracts that were, or may have been, created without the knowledge of the affected customers.\n\n\"The majority of whom were First Nations Australians from Mount Isa and the Northern Territory,\" the regulator's statement said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/red-cross-loosens-rules-for-lgbtqia-plasma-donation/105430414",
        "title": "Australian Red Cross loosens rules around LGBTQIA+ people donating plasma",
        "publish_date": "Wed, 18 Jun 2025 00:55:21 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Restrictions around sexually active gay and bisexual men donating blood and plasma are being loosened in a new world-leading move by Australian Red Cross Lifeblood.\n\nUnder current rules, gay and bisexual men, and transgender women who have sex with men, cannot donate blood or plasma if they have had sex in the past three months.\n\nBut from July 14, in the first set of rule changes, Lifeblood will remove most restrictions on donating plasma related to sexual activity.\n\nIt has called this world-first the \"plasma pathway\", and says it will mean \"most people, including gay and bisexual men, and anyone who takes PrEP, will be able to donate plasma without a wait period, providing they meet all other eligibility criteria\".\n\nLoading...\n\nPrEP stands for pre-exposure prophylaxis and involves HIV-negative people taking antiretroviral medication to protect them and prevent infection.\n\n\"Extensive research and modelling show that there will be no impact to the safety of the plasma supply with this change,\" Lifeblood said in a statement.\n\nLifeblood chief medical officer Jo Pink said plasma was now the donation Australians needed the most, and the change would allow more than 600,000 extra people to give blood.\n\n\"We're excited to be able to welcome more people from across the community into our donor centres from next month,\" Dr Pink told News Breakfast.\n\n\"We now anticipate an extra 24,000 donors and 95,000 extra donations of plasma to be made each year.\"\n\nDash Heath-Paynter, the CEO of Health Equity Matters, said the change \"potentially unlocks thousands of donations of life-saving plasma\".\n\n\"Members of the LGBQTIA+ community members can now help those whose lives depend on plasma donations without a donation deferral period,\" Mr Heath-Paynter said.\n\nPlasma is now the donation that is most needed by Australians. (Supplied: Australian Red Cross Lifeblood)\n\nChanges to blood donations coming\n\nAlongside the changes to plasma donation rules, Lifeblood is working towards making changes to blood and platelet donation eligibility.\n\nLifeblood said the Therapeutic Goods Administration (TGA) had approved a submission to remove gender-based sexual activity rules.\n\nIt will mean that all donors will be given the same questions about sexual activity, regardless of gender or sexuality, once the changes come into effect.\n\nMen will no longer be asked if they have had sex with another man before they donate blood.\n\nChanges to blood donation rules could come into effect next year. (AAP: Angela Brkic, file photo)\n\nOn top of that, people in a sexual relationship of six months or more with a single partner will be able to donate blood and most people with new or multiple partners will also be able to donate if they have not had anal sex in the past three months.\n\nLifeblood has not given a date for when the changes will come into effect, but Dr Pink is hopeful of it being from early next year.\n\n\"There are many steps that Lifeblood needs to take before we can implement the new gender-neutral assessments, including working with state and territory governments to change the donor questionnaire,\" Dr Pink said.\n\nThese changes to blood- and plasma-donating rules will \"make it easier for more people in the LGBTQIA+ community to donate\" Dr Pink added.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/materialists-celine-song-dakota-johnson-pedro-pascal/105426250",
        "title": "It may look like a rom-com, but Materialists is not a first-date movie",
        "publish_date": "Wed, 18 Jun 2025 00:45:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "After the wistful, what-if heartache of 2023's Past Lives, Celine Song has now set her sights on the zero-sum game of dating.\n\nFast Facts about Materialists What: A love triangle between a New York matchmaker, her ex and a wealthy, seemingly perfect suitor. Directed by: Celine Song Starring: Dakota Johnson, Chris Evans, Pedro Pascal Where: In cinemas now Likely to make you feel: Surprised\n\nMaterialists slyly presents as a glossy 2000s rom-com, a milieu well suited for the writer-director's elegant dialogue and her eye for luminous New York backdrops. There was every expectation that this anticipated follow-up — with its heftier budget and an A-list cast — would take a crowd-pleasing turn.\n\nInstead, Song takes on the genre with a contemporary cynicism. Her glamorous cosmopolitan setting is host to a trio of deluded, self-loathing characters, its Cinderella fantasy joylessly reduced to its class components.\n\nSpeaking to the ABC's Screen Show, Song outlines the film's primary tension: \"None of us are merchandise; we're people. So why is it that we treat ourselves, and each other, like we're merchandise?\"\n\nAt the centre of Materialists' love triangle is Lucy (a wry Dakota Johnson), a matchmaker whose craft revolves around a ruthless calculus of compatible incomes, ages, weights and heights between New York's elite. Dating is taken as a capitalist enterprise, with clients being assigned market value, then traded accordingly.\n\n\"I really wanted to work with Celine. I loved Past Lives. I loved meeting her even more. I loved the way she spoke about movies and people and feelings,\" Johnson told Elle. (Supplied: Sony)\n\nSong recalls her own experience in that profession, in which intimate desire and needs were defined by terms that felt more relevant to an insurance company or a morgue.\n\n\"That's the kind of language that they were using to describe the person who has to be the love of your life. The gap between that and what I knew about love, and what I know about love, felt so vast.\n\n\"That really fascinated and stressed me out, it's really the reason why I wanted to make this movie.\"\n\nTaking after Richard Gere in Pretty Woman, Pedro Pascal plays an old-money private equity investor, Harry, who's all too familiar with the rules of the game. He's the perfect suitor for Lucy, whose sole, immutable criterion for a mate — having watched her parents torn apart by financial hardship — is independent wealth. Beyond preventing a future of bickering over bills, Harry's considerable largesse makes her feel valued.\n\n\"Marriage used to be a business deal. It was like, my father wants your cows and whatever. But now... we expect our partner to fulfill every single aspect of our needs,\" Johnson told AP. (Supplied: Sony)\n\nLucy's ex-boyfriend, John (Chris Evans), is a struggling actor on the opposite end of New York's economic strata, still confined to the cramped apartment of his 20s. When they reunite at a wedding for one of Lucy's clients, he's working a side gig as a cater waiter, which barely keeps him afloat. Lucy playfully suggests they may be soulmates — but above all, he's a bad financial decision.\n\nIn screenings, Song found that the reveal of Harry's $12 million apartment could be relied upon to induce an audible response, no matter the audience.\n\n\"Wealth is the most seductive thing; it is the greatest drug that is possible in modern society,\" Song says.\n\n\"When you think about the Victorian romances, we have not come very far from talking about marriage and love only in relation to how much it's going to secure your life.\"\n\nPast Lives: review Photo shows A Korean man with short dark hair, in a navy shirt, and a Korean woman with dark bob, in a white shirt, are in a subway carriage Past Lives explores the past loves and missed connections that can haunt us.\n\nMaterialists is bracingly honest, even cruel, in its depiction of Lucy's world. Her myopic outlook has the underlying logic of pick-up artistry, in which sexual attraction can be distilled into formula, and courtship is merely bartering. She can only treat Harry's romantic proposition with an intense disbelief; why would a \"unicorn\" like him settle for someone like her?\n\nSong has a disarming way of testing the audience's own beliefs, in part because our engagement with dating apps and social media seems to affirm that same impoverished mindset. You won't see another film this year that so openly discusses the romantic odds for shorter men, which feels serendipitously timed with the recent announcement of Tinder's height filter.\n\nWhen Lucy describes a problem client, Sophie (Zoë Winters), as being a \"nice girl\" who's ultimately \"not competitive\", it's easy to relate to her thinking: dating apps are flooded with people whose best qualities are not on their surface.\n\nIt can be hard to see Chris Evans as a down-on-his-luck working-class man. (Supplied: Sony)\n\n\"Social media is contributing rapidly and very negatively towards the commodification of human beings … it just all becomes about expressing a value,\" the director says.\n\nThe more we buy into that system, the more we have to lose. \"Your whole life is going to be about modifying not just each other, but also yourself.\"\n\nThe messy, unsparing drama of Materialists doesn't always cohere with its knowing deployment of rom-com tropes. Passion is kept at a minimum while misery is laid on thick, with precious few jokes peeking through. Lucy's spiritual rot is broadened into staggering obliviousness, particularly in a subplot that indelicately handles the darker implications of her work.\n\nWhile Lucy's chemistry with Harry (or rather, Harry's assets) is deliberately distant, John doesn't quite inspire the kind of longing to work as a counterbalance — or perhaps there's an inherent disconnect between watching a star as bright as Chris Evans playing someone so downtrodden, even if his own acting career has been in the doldrums as of late.\n\nDakota Johnson told AP that Lucy's main question is: \"Do you fight for the thing that you think you want, or do you fight for that thing that you know you need?\" (Supplied: Sony)\n\n(Naturally, Johnson is perfect at playing a character whose own aloofness seems to keep her at a distance from the human race, and relishes in dithering put-downs when the film calls for it.)\n\nMaterialists may well be a hostile viewing experience for unsuspecting audiences — it's certainly not recommended as a first-date movie. But the piercing clarity of Song's approach holds up once the shock wears off, and lays bare the inadequacies of how we negotiate romance.\n\n\"I'm always trying to depict a business deal of some kind; sometimes love is on the table, and sometimes it isn't.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/cfmeu-high-court-loses-against-federal-government/105430240",
        "title": "Former CFMEU officials fail to overturn federal government takeover",
        "publish_date": "Wed, 18 Jun 2025 00:28:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Former CFMEU officials have lost a High Court challenge to changes to the Fair Work Act which forced the construction arm of the union into administration.\n\nThe takeover was announced in August last year with immediate effect, removing 270 union officers, mostly from volunteer positions, and 11 from paid jobs after allegations were raised about bullying, corruption, and criminal infiltration.\n\nThe union went straight to the High Court claiming the law which allowed for the administration was unconstitutional, that it infringed on the implied freedom of political communication, and was an acquisition of property on other than just terms.\n\nToday in a unanimous decision, the High Court threw out the case, clearing the way for the administration to continue.\n\nConstruction workers protested the federal government's take over on the steps of South Australian parliament last year. (ABC News: Che Chorley)\n\nThe changes to the law came after allegations were aired in July last year that outlaw motorcycle gangs had infiltrated the union's branches.\n\nMedia reports alleged bikies had been appointed as delegates on major projects, amid wider claims of bullying, intimidation, and corrupt conduct.\n\nWeeks later the Fair Work Commission applied to the Federal Court to put the union in administration.\n\nIn the meantime, the federal government said if the union fought the administration, it would introduce the new laws adjusting the Fair Work Act, which it did.\n\nVictorian barrister Mark Irving KC was appointed as administrator.\n\nIn his first report to parliament in February, he said the High Court challenge had disrupted the process.\n\n\"Uncertainty about whether the former leadership is returning to power has, in some cases, impeded the Administration in obtaining full and frank disclosures from complainants.\" Mr Irving said.\n\n'A strong democratic, member-controlled Union'\n\nCFMEU generic (Graeme Powell)\n\nThe union made four arguments as to why the law should be struck down.\n\nCentral to its case was whether parliament had the power under the Constitution to make the law at all.\n\nThe government had argued the union was a trading organisation — since it collected membership fees — meaning it came under section 51(xx) of the Constitution.\n\nThere was also the question of whether the decision to put the union into administration was a punishment, and therefore an overreach of the executive government's powers.\n\nThe government argued nothing in the law infringed on \"human life, bodily integrity, or liberty\" and thus was not punitive.\n\nThe union argued the changes were an \"impermissible\" burden on the implied freedom of political communication.\n\nThat was because, by removing its officers, members are not represented by their chosen representatives, and are not free to engage in political activity with each other unless permitted by the administrator.\n\nGovernment strikes deal to pass CFMEU administration laws Photo shows A black sign with 'CFMEU Victoria' written on it, hanging on a construction site. The CFMEU will be forced to accept an administrator, as the federal government strikes a deal with the Coalition to pass laws to take control of the troubled construction union.\n\nThe Commonwealth told the High Court any burden was justified.\n\n\"It rationally advances [the] legitimate purpose, by taking control of the Division away from those who have failed to ensure its lawful, effective operation, and temporarily giving it to an Administrator charged with rectifying that in members' interests,\" the Commonwealth argued.\n\nThe final issue was whether the administration amounted to an acquisition of property on other than just terms.\n\nThe government rejected that, arguing in its submissions: \"It would be incongruous to require just terms to the CFMEU for the Administrator's work in cleaning up the [Construction] Division.\"\n\nThe Administrator, Mark Irving KC, has welcomed the decision, and what he described as the High Court's \"rejection of the attack on the legitimacy of the Administration\".\n\n\"The Administration is committed to returning the union to the membership as a strong democratic, member-controlled Union, enduringly free of corruption and criminal influence as soon as possible,\" he said.\n\nAmanda Rishworth, Minister for Industrial Relations has welcomed the court's decision. (ABC News: Nick Haggarty)\n\nIn a statement, Workplace Relations Minister Amanda Rishworth said the federal government welcomed the court's decision.\n\n\"Construction workers deserve a union free from criminality, corruption and violence,\" Ms Rishworth said.\n\n\"The Administrator and his team can now move forward with confidence and continue their essential work in cleaning up the Construction and General Division of the CFMEU.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-18/afl-mcg-bans-warwick-capper-inappropriate-behaviour-grand-final/105430406",
        "title": "Warwick Capper banned from MCG and all AFL matches",
        "publish_date": "Wed, 18 Jun 2025 00:13:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former Sydney and Brisbane forward Warwick Capper has been banned from attending AFL matches after alleged inappropriate behaviour at last year's grand final.\n\nThe AFL confirmed on Wednesday morning that Capper had been issued a \"banning notice\". The MCG has also been banned him from all events at the ground. Both bans are understood to be for five years.\n\nLoading...\n\nCapper's manager, Tony Marks, said the ex-football star had made a \"light-hearted joke\" to a female while attending the grand final.\n\n\"No doubt there's a few inappropriate things said in the caricature that is Warwick Capper and playing the class clown, but five years from every AFL venue, including no cricket, concerts … that stinks,\" Marks told News Corp.\n\n\"He did make a light-hearted joke to somebody in the room, but not with any ill will. He definitely didn't walk up and say it directly to her.\n\nCapper was Sydney's leading goalkicker on four separate occasions during the 1980s and was one of the most recognisable figures in the VFL. (Getty Images)\n\n\"There's a generation of people who didn't grow up with Warwick but for 95 per cent of people in that room he was being the joking Warwick Capper, an entertainer.\n\n\"He knows he needs to pull his socks up with some of his jokes, but under no circumstances would he want anyone to be offended. He was making a joke and it was overheard and offence was taken.\"\n\nCapper played 124 games for the Swans and Bears between 1983 and 1991, kicking a total of 388 goals. He was Sydney's leading goal kicker on four separate occasions and took the mark of the year in 1987.\n\nSince retiring, Capper has appeared on a number of television shows as a guest such as The AFL Footy Show, Celebrity Big Brother and The Celebrity Apprentice Australia. He has also been known to do celebrity guest appearances at various functions.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/theatre/write-what-you-know-play-school-presenter-mines-real-life-family-drama-20250618-p5m8ei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Write what you know: Play School presenter mines real-life family drama",
        "publish_date": "Wed, 18 Jun 2025 12:01:35 +1000",
        "category": "finance",
        "authors": [
            "Nicole Elphick"
        ],
        "text": "Despite being a Korean-Australian adoptee herself, actor and now freshly minted playwright Michelle Lim Davidson had not been planning to explore the topic in her debut play. In 2023, she was part of the Griffin Studio program, a creative lab for early career playwrights, and was planning a piece about K-pop, but after a post-pandemic trip to South Korea, the work’s direction shifted.\n\n“I was going back to see my Korean family. It was my second trip back after meeting them,” says Lim Davidson. “I thought maybe as a playwright I should attempt to write what I know. So I came back and said, okay, the K-pop is still strangely relevant, but I am going to write about what happens after the [adoption reunion] Hollywood moment.\n\n“After the hugging and the crying, how do you establish a relationship with somebody that you barely know? How do you bridge that emotional, cultural and physical distance? I felt it’s not an experience people have had much insight into, and that’s why I thought, well, I’ll give it a go.”\n\nMichelle Lim Davidson has written a new play, Koreaboo, based on her own adoption story. Credit: Dominic Lorrimer\n\nThe resulting play is Koreaboo. The two-hander stars Lim Davidson as Korean-Australian adoptee Hannah, who is visiting her birth mother in Seoul hoping to spend the summer connecting, but the reality doesn’t live up to her initial expectations.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/this-new-cli-fi-novel-envisages-a-more-hopeful-apocalypse-20250611-p5m6lc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This new cli-fi novel envisages a more hopeful apocalypse",
        "publish_date": "Wed, 18 Jun 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Jack Cameron Stanton"
        ],
        "text": "FICTION\n\nSalvage\n\nJennifer Mills\n\nPicador, $34.99\n\nIn Salvage, Jennifer Mills lets the billionaires escape our dying planet on a space station with a VIP list. And then she leaves them there to rot.\n\nThis is Mills’ first, fully fledged science-fiction novel to portray the before and after of ecological apocalypse, but it continues her merging of the uncanny or speculative with her artistic instinct for spatial and psychological choreography. In other words, Mills’ novels begin by asking: what kind of world is this? But the focus is always on what it feels like to inhabit these unusual worlds.\n\nThe Airways, Mills’ previous novel, was ostensibly a queer fabulist horror story about a ghost seeking revenge. But this hook was masquerading a second, more experimental desire to assign a new form of language to this state of being. Dyschronia, which was short-listed for the 2019 Miles Franklin prize, ventured into weird fiction, imagining the desolation after the shore receded from an Australian coastal town, converting it overnight into a location of dark tourism – much to the chagrin of the few inhabitants who refused to leave. Taken all together, Mills’ fiction continually returns to hauntings; her works explore how spectres from the past are eternally resurrecting in the present.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/a-haunting-tribute-to-the-bonds-between-humans-and-animals-20250612-p5m70q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A haunting tribute to the bonds between humans and animals",
        "publish_date": "Wed, 18 Jun 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Candida Baker"
        ],
        "text": "YOUNG ADULT\n\nThe Foal in the Wire\n\nRobbie Coburn\n\nHachette, $19.99\n\nHow many of us as children have suffered from the onslaught of our family unhappiness? How many of us have blamed ourselves for things that went “wrong”, that were never our fault, and how many of us have reached out for something to help us feel safe in our troubled world?\n\nIn the chaos of alcoholism, affairs and mayhem that constituted my childhood, I reached out for horses, and it seems as if Robbie Coburn, a Melbourne-based poet and recently published YA author, had a similar experience. When I reviewed Coburn’s 2024 book Ghost Poetry, I was stunned by its visceral, haunting beauty, and now hot on its heels, or hooves, comes The Foal in the Wire, a verse novel about the potential power of the relationship between horses and humans to transform a troubled life.\n\nAfter my review, Coburn and I made contact to discuss the profound effect horses have had on our lives. I knew he was writing a YA verse novel, and wondered how he would transition to that specific and complex genre. But Coburn is nothing if not versatile.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/billionaire-barry-diller-married-to-diane-von-f-rstenberg-comes-out-in-new-memoir-20250617-p5m807.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billionaire Barry Diller - married to Diane von Fürstenberg - comes out in new memoir",
        "publish_date": "Wed, 18 Jun 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Nathan Smith"
        ],
        "text": "A former CEO of Paramount Pictures, Diller hid his sexual orientation for decades, despite persistent rumours to the contrary. A high-profile marriage to fashion designer Diane von Fürstenberg helped quell some speculation but the threat of being outed was still like an “anvil hanging … over my head”.\n\nPublic figures still sometimes save weighty admissions about their lives for their autobiographies. Barry Diller, the billionaire media mogul and chairman of Expedia, has used his to do just that: come out of the closet.\n\nIn Who Knew, the 83-year-old publicly acknowledges his sexuality for the first time. Diller admits that he has long known that he is gay but hid the truth to preserve his career ambitions and avoid public shaming. As for wife von Fürstenberg, she remains a rare romantic outlier and the lasting “bedrock of my life”.\n\nThe memoir now reveals this hidden personal history and also shares his business acumen with other aspiring entrepreneurs.\n\nDiller, who reveals in his new memoir that he is gay, with Diane Von Furstenberg, to whom he’s been married for 24 years. Credit: Bloomberg\n\nDiller was born of privilege but suffered a dysfunctional family life, one where his mother would dispense sleeping tablets and a heroin-addicted brother beat him. The basement of talent agency William Morris was a sanctuary where its cabinets of archived correspondence were a way to “read … through the history of show business”.\n\nGood fortune, as it happens, was often looking out for the eager student of Hollywood’s history. First, a lucrative posting at the television network ABC to help program films for the small screen. An enterprising thinker, Diller believed networks should make films for the tube too, soon transforming the station’s profile thanks to his successful made-for-TV movies.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/optus-to-pay-100-million-fine-over-sales-to-vulnerable-customers-20250618-p5m8fp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Optus to pay $100 million fine over sales to vulnerable customers",
        "publish_date": "Wed, 18 Jun 2025 11:57:10 +1000",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Optus has agreed to pay $100 million in penalties after landmark legal action from the consumer watchdog over “unconscionable conduct” related to selling vulnerable customers products they could not afford or use.\n\nOn Wednesday, the Australian Competition and Consumer Commission and Optus announced they would now jointly ask the federal court to impose a total penalty of $100 million for breaching the consumer law, after the telco admitted its sales staff acted unconscionably when selling phones and contracts between August 2019 and July 2023.\n\nOptus had agreed to pay a $100 million penalty after ACCC legal action.\n\nAs part of the penalty agreement, Optus has also signed an undertaking that it will compensate affected customers and improve its internal system, with the federal court to make orders on the amount. The company will also make a $1 million donation to an organisation that helps foster digital literacy among First Nations Australians.\n\nThe ACCC launched the legal action against Optus in October, and while the allegations included 429 customers across 16 stores, the telco acknowledged Indigenous Australians were the majority of those affected, primarily at its two Darwin locations and its Mount Isa store.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-trade-war-is-starting-to-bite-china-s-economy-20250618-p5m8b2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s trade war is starting to bite China’s economy",
        "publish_date": "Wed, 18 Jun 2025 11:56:20 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "It pulled forward US imports and retail spending in March, with an associated bump in China’s exports to America, which have since fallen away. US retail sales declined in April and May and China’s exports to the US plunged 34 per cent last month. The fallout from the trade war also shows in China’s economic numbers, with the tariff uncertainty hitting private investment hard. There was zero growth last month compared to May last year and foreign investment was down 13.4 per cent. It could cost China the golden chance that Trump’s “America First” assault on trade and geopolitical alliances and multilateral institutions has created. The growth in fixed asset investment overall in China slowed from the 4 per cent in the first four months of the year to 3.5 per cent in the five months to end-May, even though manufacturing investment was up 8.5 per cent and public investment rose 5.9 per cent. The unusual feature of the May data was the unexpectedly strong growth in retail sales, which grew 6.4 per cent year-on-year, an acceleration from the 5.1 per cent rate experienced in April.\n\nThat’s a reflection of Beijing’s limited attempts to stimulate consumption via its subsidies for trade-ins of household appliances. Their sales soared 53 per cent, while mobile phones and other communication devices – also covered by the trade-in policy – jumped 33 per cent. The surge in exports to the US in March was driven by “front-loading,” or a scramble by US importers to grab stock before the tariffs cut in. Donald Trump and China’s President Xi Jinping: While Trump has backed away from the 145 per cent tariff rate on China, the trade relationship remains unresolved. Credit: AP The retail sales splurge in China could be seen as analogous. The budget for the trade-in subsidies is capped, with some regional governments having already used up their quotas. The subsidies will have drawn forward spending, which makes the spike in sales a one-off event – once a household has bought a new washing machine, it’s unlikely to be in the market for another for some time.\n\nThere may also have been some impact from an earlier-than-usual annual online shopping event, which may also have attracted forward spending from June. Loading In both economies, consumer confidence remains brittle – in the US because of the uncertainties generated by Trump’s erratic trade policies and in China because of the continuing deterioration of its ravaged property markets, the repository for estimated 60 to 70 per cent of its middle-class wealth. Property prices continued to fall in May. After the market had appeared to stabilise earlier in the year following a range of policies introduced late last year aimed at shoring up the market, prices in April and May have started sliding again. Consumer confidence and spending will continue to remain weak until it is clear that the property market has bottomed out.\n\nFor China, with the stimulus funding budgets to tail off in the second half of the year and the impact of Trump’s tariffs likely to show up more materially as the year progresses, it will be a challenge to achieve Beijing’s target of 5 per cent GDP growth this year. Exports have been booming, partly because of the front-loading of sales to the US but also because China’s exporters have scrambled to diversify their markets. Some exports will inevitably have been re-routed to countries with lower tariffs, providing a backdoor entry to the US market. Others are displacing domestically produced goods in other economies, with the growth of exports to South-East Asia, Latin America and Europe causing increasing trade frictions and pushback from those economies, who face having their domestic manufacturing bases hollowed out if China’s former export volumes to the US are diverted to their markets. China’s broad strategy over the past decade – encouraging and subsidising exports while trying to create a self-sufficient domestic economy, one that doesn’t rely on imports, by subsidising domestic companies, particularly those engaged in advanced manufacturing – isn’t sustainable in the new trade environment.\n\nLoading Whatever the final shape of the trade relationship with the US, China’s exports to the US will be lower than what they were before Trump regained the presidency, and China will experience increasing resistance from its other trade partners to any attempt to compensate for lost US volumes by redirecting those exports to their markets. In the longer term, China will have to do something about the excess capacity in its domestic manufacturing base, which reflects wasteful and increasingly unproductive over-investment, even if that means a lower economic growth rate. It will have to accept lower export volumes and do more to stimulate domestic consumption or face increased friction with all its trade partners that could create an existential threat to its current economic model. It could also cost China the golden chance that Trump’s “America First” assault on America’s traditional trade and geopolitical alliances and multilateral institutions has created – the opportunity to diminish America’s dominance and elevate its own role in global affairs.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-next-sydney-suburbs-in-line-for-18-storey-apartment-blocks-20250617-p5m841.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The next Sydney suburbs in line for 18-storey apartment blocks",
        "publish_date": "Wed, 18 Jun 2025 11:51:54 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "Two Sydney suburbs are set to be transformed as low-rise homes make way for buildings up to 18 storeys tall under a controversial council plan to deliver 4000 new dwellings.\n\nCanterbury-Bankstown City Council has voted to endorse its alternative plan to the state government’s transport-oriented development (TOD) scheme for Wiley Park and Punchbowl.\n\nAn artist’s impression of future Wiley Park under council’s housing proposal. Credit: Canterbury-Bankstown City Council\n\nThe council had been required to allow at least 1600 new homes in those suburbs under the government’s TOD plans. Instead, it more than doubled the target.\n\nUnder the council’s alternative, up to 4000 new homes could be built and high-density rezoning extended to 800 metres from Wiley Park and Punchbowl metro stations. Low-density streets would be transformed, with buildings of between four and 18 storeys.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/glass-houses-to-a-glass-jaw-why-slater-went-too-far-in-the-origin-theatre-20250618-p5m8ff.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Glass houses to a glass jaw: Why Slater went too far in the Origin theatre",
        "publish_date": "Wed, 18 Jun 2025 11:50:28 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "The first victim of State of Origin is context.\n\nFor all the record ratings that the marquee series is able to generate come kick-off, it can be difficult to move the needle beforehand. The current series has been a hard sell for the beat reporters struggling to manufacture clicks.\n\nThe players we most want to hear from, Latrell Mitchell and Spencer Leniu, have slapped media bans on themselves; the opening encounter, at least as a spectacle, was not a patch on the absolute blockbuster finale that decided last year’s series; and NSW basing themselves in the Blue Mountains has made the squad less accessible to a media contingent attempting to find some flames to fan.\n\nThe Blues’ recent domination, coupled with limited access, is another contributing factor to making the Perth clash a tough sell.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/slater-apologises-for-green-reference-20250618-p5m8fz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Slater apologises for Green reference",
        "publish_date": "Wed, 18 Jun 2025 11:50:06 +1000",
        "category": "finance",
        "authors": [],
        "text": "Slater apologises for Green reference\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/origin-ii-our-experts-make-the-call-on-who-will-win-and-why-20250617-p5m83m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin II: Our experts make the call on who will win and why",
        "publish_date": "Wed, 18 Jun 2025 11:40:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Origin II: Our experts make the call on who will win and why\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-goes-green-in-council-tax-avoidance-scheme-20250617-p5m82b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "$50 levy for ‘free’ green bins: Brisbane residents slugged in ‘tax-avoidance scheme’",
        "publish_date": "Wed, 18 Jun 2025 11:32:03 +1000",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt",
            "Felicity Caldwell"
        ],
        "text": "Brisbane residents will be charged an extra $50 waste levy to cover the cost of rolling out green bins across the city as part of a council “tax-avoidance scheme”, whether they choose to have a green bin or not.\n\nBrisbane City Council is introducing an opt-out green waste program for about 170,000 households and is scrapping surcharges in favour of the levy.\n\nUnder the changes, the waste levy for all Brisbane households is set to increase by almost $50 from August – making waste charges for all residents a universal fee of $512.96 a year.\n\nBrisbane Lord Mayor Adrian Schrinner: “Every house will get a green bin, and that will be part of the business as a usual service.” Credit: Brisbane City Council\n\nLord Mayor Adrian Schrinner said the scheme was a “large-scale tax-avoidance scheme” that would help the council avoid the state government’s “bin tax”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/oconnor-eyes-fairytale-farewell-20250618-p5m8fy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "O'Connor eyes fairytale farewell",
        "publish_date": "Wed, 18 Jun 2025 11:30:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "O'Connor eyes fairytale farewell\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/i-feel-terrible-under-fire-slater-apologises-to-paul-green-s-family-20250618-p5m8e8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I feel terrible’: Under-fire Slater apologises to Paul Green’s family",
        "publish_date": "Wed, 18 Jun 2025 11:28:54 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Billy Slater has been forced to apologise to the family of Paul Green after referencing the late Queensland coach during an emotional State of Origin press conference on Tuesday.\n\nSlater has come under fire after referencing Green on Tuesday during a press conference in Perth, when answering a question about being called a “grub” by former NSW forward Aaron Woods in the lead-up to Wednesday’s second game.\n\nSlater implied Green had taken his own life in 2022 as a result of the pressures of coaching and public criticism, which prompted a strong backlash on Wednesday morning.\n\nGreen’s family insisted the 49-year-old suffered with chronic traumatic encephalopathy.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/whats-changing-from-1-july-wages-super-centrelink-payments-and-more/ewjslfpiw",
        "title": "What's changing from 1 July: Wages, super, Centrelink payments and more",
        "publish_date": "Tue, 17 Jun 2025 19:43:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia’s lowest-paid workers will receive a pay boost from 1 July, with the national minimum wage increasing by 3.5 per cent.\n\n\n\n\n\nThe new rate will be $24.95 per hour, or $948 per week, based on a 38-hour week. The Fair Work Commission decision, handed down earlier this month , affects more than 2.6 million Australians and will apply from the first full pay period on or after 1 July.\n\n\n\n\n\nMillions of Australians will also see a boost to their Centrelink payments, with a 2.4 per cent increase to help ease the rising cost of living.\n\n\n\n\n\nFor families receiving Family Tax Benefit (FTB) Part A, the maximum rate of payment for children aged under 13 will increase to a new rate of $227.36 a fortnight. For children aged 13 or over, the rate will increase to $295.82 a fortnight.\n\n\n\n\n\nThe maximum rate of Family Tax Benefit Part B will increase to $193.34, and for families with a youngest child aged five or over, the rate will increase to $134.96 a fortnight.\n\n\n\nREAD MORE Super on top of paid parental leave: How new scheme will work and who will benefit\n\nThe FTB has been increased annually since its introduction in 2000, under both Labor and Coalition governments.\n\n\n\n\n\nSocial Services Minister Tanya Plibersek said in a statement the payments were essential for helping families manage the cost of raising children and that indexation is one way the government is making sure support keeps up with inflation.\n\n\n\nSuper increase\n\nThe superannuation guarantee, which is the minimum amount employers must contribute to their employees’ super, is set to rise from 11.5 per cent to 12 per cent.\n\n\n\n\n\nThe new rate applies to all salary and wages paid on or after 1 July, even if the work was performed before that date.\n\n\n\n\n\nAlong with the increase, the federal government will start paying superannuation on its paid parental leave scheme for the first time.\n\n\n\n\n\nThe paid parental leave superannuation contribution will apply to parents receiving government-funded parental leave pay on or after 1 July.\n\n\n\nPaid parental leave overhaul\n\nFrom 1 July, Australian families will benefit from a more generous paid parental leave scheme, with the amount of government-funded leave increasing from 20 to 22 weeks.\n\n\n\n\n\nThis is part of the federal government’s plan to progressively expand the scheme to 26 weeks by July 2026, the equivalent of six months of paid leave. Once fully rolled out, families will receive around $24,000 in total support following the birth or adoption of a child.\n\n\n\n\n\nThe policy is designed to give parents more time at home with their newborns and greater flexibility in how leave is taken. Parents can choose to take leave separately or at the same time, and spread it across two years, allowing for a staggered return to work or shared caregiving.\n\n\n\nImmigration changes for skilled workers\n\nThe government has made changes to Australia’s skilled visa system in an effort to reduce worker exploitation and attract talent.\n\n\n\n\n\nA new Core Skills Occupation List will replace the existing Skilled Occupation List, focusing on roles with genuine shortages.\n\n\n\n\n\nEmployers will have to meet stricter criteria, including offering market salary rates and proving they’ve advertised the job locally.\n\n\n\n\n\nThe Department of Home Affairs also announced that income thresholds for skilled visas will increase by 4.6 per cent.\n\n\n\n\n\nThis change will not apply to existing visa holders and nominations lodged before 1 July 2025.\n\n\n\nRoad rules get tougher\n\nNSW will introduce harsher penalties for drivers using their mobile phones.\n\n\n\n\n\nFrom 1 July, those caught using their phone behind the wheel, even while stationary at traffic lights, can be fined up to $1,209 and lose five demerit points.\n\n\n\n\n\nIn Victoria, the road rule requiring drivers to slow down to 40 km/h for emergency responders will now include tow truck, roadside assistance and incident response workers.\n\n\n\n\n\nQueenslanders will see a 3.4 per cent hike in vehicle registration fees as well as traffic fines.\n\n\n\n\n\nNationally, AI-powered surveillance cameras capable of detecting mobile phone use will be rolled out, as governments crack down on distracted driving.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/when-serhii-arrived-in-australia-all-he-had-was-a-blue-suitcase-now-he-has-a-place-to-call-home/tmkdldeqv",
        "title": "When Serhii arrived in Australia all he had was a blue suitcase, now he has a place to call home",
        "publish_date": "Tue, 17 Jun 2025 11:56:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/almost-1-million-australians-work-multiple-jobs-under-cost-of-living-pressure/b2g44nw8w",
        "title": "Almost 1 million Australians work multiple jobs under cost-of-living pressure",
        "publish_date": "Tue, 17 Jun 2025 11:39:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Almost 1 million Australians work multiple jobs under cost-of-living pressure\n\nPublished 17 June 2025, 10:57 am\n\nRecord numbers of Australians are supplementing their income with side hustles and multiple jobs according to the Australian Tax Office, who is now reminding people to include any extra income in their tax return. The side hustle – a passion project, or an additional job to earn extra cash – has become a vital income stream for some, but means some Australians are sacrificing rest, health and family time to survive financially.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australia-post-reveals-parcel-only-post-office-plans/sxnw3y5ij",
        "title": "Australia Post reveals parcel-only post office plans",
        "publish_date": "Tue, 17 Jun 2025 11:29:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia Post reveals parcel-only post office plans\n\nPublished 17 June 2025, 10:57 am\n\nAustralia Post is ramping up efforts to modernise its parcel deliveries service as more Australians turn to online shopping. It's looking to boost the customer experience by opening two parcel-only post offices in Sydney and Melbourne, prior to the End of Financial Year sales period.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/oil-jitters-and-the-world-competitiveness-rankings/feylrykga",
        "title": "Oil jitters and the world competitiveness rankings",
        "publish_date": "Tue, 17 Jun 2025 08:01:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/most-liveable-city-in-the-world-revealed-with-australian-capitals-among-top-10/f1c95c9k6",
        "title": "Revealed: World's most liveable city — and Australia's showing in the top 10",
        "publish_date": "Tue, 17 Jun 2025 06:34:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Denmark's capital Copenhagen has topped the list of the world's most liveable cities, edging out Vienna and Zurich in this year's rankings, compiled by the Economist Intelligence Unit's 2025 Global Livability Index.\n\n\n\n\n\nThe list grades cities based on criteria such as healthcare, education, and infrastructure, assigning each a score out of 100, which is then ranked.\n\n\n\n\n\nFor the first time since 2021, Vienna was knocked from the top spot, trailing behind Copenhagen in terms of stability, culture, and environment.\n\n\n\n\n\nThe publication attributed Austria's capital's fall in the ranking to a decline in its stability score, following a bomb threat to Taylor Swift's concert in 2024 .\n\n\n\n\n\nThe 173 cities on the list were not assessed on affordability.\n\n\n\nCopenhagen ranked second in both the 2023 and 2024 rankings. Source: AP / Linda Kastrup\n\nThree Australian cities in the top 10\n\nMelbourne ranked fourth for the second consecutive year, achieving perfect scores in both healthcare and education.\n\n\n\n\n\nSydney rose one place from 2024, coming in at sixth place this year, while Adelaide moved into the top 10, ranking ninth. Both cities also had perfect scores for healthcare and education, but were lower than Melbourne in terms of culture and environment.\n\n\n\nMelbourne, Sydney, and Adelaide have made the top 10, coming in at numbers four, six, and nine, respectively. Source: SBS News The average liveability across all surveyed cities was a score of 76.1 out of 100, with stability dropping slightly, offset by rising scores for education, healthcare, and infrastructure.\n\n\n\n\n\nThe city that showed the greatest improvement is Al Khobar in Saudi Arabia, climbing to 135th place, where scores for healthcare and education increased significantly, resulting in a 13-spot boost in its position.\n\n\n\n\n\nCalgary, Canada, experienced the steepest decline in the rankings, dropping from fifth to 18th place. Vancouver is now the only Canadian city remaining in the top ten.\n\n\n\n\n\nThree cities in the United Kingdom — Manchester, London, and Edinburgh — were also among the most notable decliners due to a drop in their stability ratings.\n\n\n\nAt the opposite end of the spectrum, Damascus in Syria remains the least livable of the 173 cities surveyed, with Tripoli in Libya ranked just above it.\n\n\n\n\n\nDespite last year's change in leadership, Syria's capital continues to bear the impact of prolonged civil conflict and has shown no progress in terms of livability.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/albanese-trump-meeting-cancelled-as-us-president-departs-g7-early/33k8yu2zo",
        "title": "Albanese-Trump meeting cancelled as US president departs G7 early",
        "publish_date": "Tue, 17 Jun 2025 06:33:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-much-superannuation-do-australians-need-to-retire/oqzzpz6a3",
        "title": "How much super do Australians need to retire? It could be less than you think",
        "publish_date": "Tue, 17 Jun 2025 05:13:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians on a median wage will be able to retire in a good financial position, according to the peak body for the superannuation industry.\n\n\n\n\n\nThe Association of Superannuation Funds of Australia (ASFA) projects a 30-year-old with a super balance of $30,000, earning the median wage of $75,000 until retiring at age 67, should accumulate $610,000 in super.\n\n\n\n\n\nThis exceeds the figure ASFA says is needed for a \"comfortable\" retirement, which it estimates requires $595,000 in super for a single person living in their own home.\n\n\n\n\n\nA homeowner couple needs $690,000 in superannuation to reach the same level of financial security,\n\n\n\n\n\nIt is the first time the body has predicted that someone on the median wage will reach that financial goal, since its reporting started in 2004.\n\n\n\n\n\nBut experts say it may take even less in superannuation to have a secure retirement, especially if you own your own home.\n\n\n\nWhat do the numbers show?\n\nThe ASFA retirement standard breaks down the cost of retirement, examining health insurance, basic living expenses, and other essential costs.\n\n\n\n\n\nAccording to estimates for the March 2025 quarter, a household with a 'comfortable lifestyle' — including a reasonable car, health insurance and an overseas trip — spends $73,875 per year for a couple who own their home and about $52,383 for a single homeowner.\n\n\n\nIn contrast, those living a 'modest lifestyle', the estimated annual budget was approximately $15,000 lower for singles than for couples living in their own home, typically spending less on health insurance, cars, and taking fewer holidays, among other expenses.\n\n\n\n\n\nWhile for renters living a 'modest lifestyle', a couple was estimated to have spent $64,259 and a single person $46,663 annually.\n\n\n\n\n\nSomeone on the age pension is estimated to spend $29,024 per year, and a couple $43,753, with both figures including supplements.\n\n\n\nAccording to estimates for the March 2025 quarter, a household with a 'comfortable lifestyle' spends $73,875 per year for a couple who own their home and about $52,383 for a single homeowner. Source: SBS News ASFA CEO Mary Delahunty attributed the rise in retirement affordability to higher super contributions.\n\n\n\n\n\nFrom July, employers will be required to pay 12 per cent of their employees' wages in superannuation, an increase of 0.5 per cent.\n\n\n\n\n\n\"With the 12 per cent super guarantee coming in, we can now say that the system foundations are cemented for young, working people to have a comfortable retirement. It's a moment all Australians should be proud of,\" Delahunty said.\n\n\n\nREAD MORE How a 'game-changing' new superannuation move will affect you\n\nHomeowners better off than renters\n\nJoey Moloney, the deputy director of the housing and economic security program at the Grattan Institute, told SBS News the real cost of retirement could be even lower, as retirees typically spend less once they stop working.\n\n\n\n\n\n\"When you look at people's spending habits from pre-retirement to post-retirement, what you see is that people spend less in retirement and increasingly so as retirement goes on,\" he said.\n\n\n\n\n\n\"Pensioners benefit from a bunch of discounts on council rates, electricity, medicines and other benefits that add up to an implicit income of thousands of dollars a year.\"\n\n\n\nFor people who have paid off their mortgage, they could have an extra 30 per cent of their income freed up rather than going into repayments, Moloney said.\n\n\n\n\n\nHe said most people who own their own homes would have a secure retirement, but the situation is different for renters.\n\n\n\n\n\n\"What the data shows is that renters in retirement are actually typically doing it tough. Poverty rates are pretty high, and levels of reported financial stress are pretty high.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-17-june-2025/xf6pqtr77",
        "title": "SBS News In Easy English 17 June 2025",
        "publish_date": "Tue, 17 Jun 2025 04:13:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAnthony Albanese will not meet with U-S President Donald Trump as planned.\n\n\n\n\n\nWhite House Press Secretary Karoline Leavitt posted on X that President Trump had a great day at the G-7, but will be leaving earlier than planned - right after dinner tonight ((local time)) with world leaders.\n\n\n\n\n\nIn a statement, a spokesperson for Mr Albanese says the cancellation of the meeting is understandable, considering what is occuring in the Middle East.\n\n\n\n\n\n+++\n\n\n\n\n\nMr Albanese has welcomed remarks from his British counterpart that the UK is determined to proceed with the AUKUS deal.\n\n\n\n\n\nBritish Prime Minister Keir Starmer says the UK Labour government had a review of AUKUS last year as a matter of procedure, and there are clear benefits.\n\n\n\n\n\n\"Yep, we're proceeding with that. It is a really important deal to both of us. I think the (US) president is doing a review. We did a review when we came into government. So that makes good sense to me.\"\n\n\n\n\n\nHe was standing alongside US President Donald Trump when he spoke, after the pair met and formalised a deal to limit the impact of US tariffs on the UK.\n\n\n\n\n\nThe deal would reduce tariffs on UK cars being shipped to the US from a proposal of 25 per cent, but a 10 per cent levy would still apply to most UK goods - including cars - imported into the US.\n\n\n\n\n\n+++\n\n\n\n\n\nAustralia's government says plans are being made to evacuate Australians from Israel and Iran once airline options become available.\n\n\n\n\n\nForeign Minister Penny Wong says so far around 300 Australians in Israel have registered their interest in leaving the country, another 350 want help to leave Iran.\n\n\n\n\n\nAerial attacks have continued for a fourth day, with Iran's state broadcaster briefly knocked off air when an Israeli strike hit buildings in Tehran.\n\n\n\n\n\nSlovakia's Interior Minister, Matúš Šutaj-Eštok says everything is being done to evacuate their foreign nationals from the region, with a plane departing from Jordan.\n\n\n\n\n\n(Slovak* then translated into English): \"The role of the state is to take care of its citizens, to take care even if they are outside the territory of the Slovak Republic, whether they are already in danger due to various problems during calamities or even in cases where this is done even in the immediate aftermath of a military conflict.\"\n\n\n\n\n\n+++\n\n\n\n\n\nThe police officer who was shot dead at a rural property while delivering a home repossession order has been formally identified.\n\n\n\n\n\n57-year-old constable Keith Anthony Smith was killed on Monday [[16 June]] as he approached the house at North Motton in Tasmania's northwest.\n\n\n\n\n\nA 46-year-old man, the resident of the property, remains under police guard in hospital, but is yet to be charged.\n\n\n\n\n\nTasmania Police says Mr Smith had a 25-year career with the force - and his death is being mourned by his colleagues and the wider community.\n\n\n\n\n\n+++\n\n\n\n\n\nIn cricket, Ellyse Perry has re-signed with the Big Bash League's Sydney Sixers for the next three seasons.\n\n\n\n\n\nThe 34-year-old all-rounder is one of Australia's greatest-ever female athletes, having won eight Cricket World Cups across various formats and a Commonwealth Games Gold Medal, and previously representing Australia in football as well, playing for the Matildas at the 2011 World Cup.\n\n\n\n\n\nShe's the second-highest run scorer in Big Bash League history, and was named captain of the league's Team of the Decade last year.\n\n\n\n\n\nPerry says she's particularly excited to re-unite with Matthew Mott at the Sixers this season.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/victoria-to-open-australias-second-permanent-pill-testing-site/skrbwn24t",
        "title": "Victoria to open Australia's second permanent pill testing site",
        "publish_date": "Tue, 17 Jun 2025 03:03:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nHere at the Hardmission festival, they like to party - just as the sign says.\n\n\n\n\n\nThe popular event at Werribee Racecourse in Melbourne's south-west was one of several sites selected as part of a pill testing trial in the state, after nine people were hospitalised from suspected overdoses in 2024.\n\n\n\n\n\nVictorian Premier Jacinta Allan said at the time she was well aware that some festival goers included drugs in their party experience - and the government wanted to keep them safe.\n\n\n\n\n\n“We know that if a young person has a pill in their hand, they're at a music festival, they're intending to use it. Young people are also entitled to have access to health focused supportive advice about what is in that pill, and get the health advice that can then be wrapped around that young person.\"\n\n\n\n\n\nThe state government says the pill testing trials have been a roaring success, with almost 1400 samples checked.\n\n\n\n\n\nMDMA, ketamine, and cocaine were the main drugs detected - but an estimated 11 percent of samples were not what the potential users expected their drugs to be.\n\n\n\n\n\nOn the back of that trial, the Allan Labor Government has now named the location of Victoria’s first fixed pill testing site in the inner north Melbourne suburb of Fitzroy.\n\n\n\n\n\nDirector Sarah Hiley has told Channel 9 it's going to be free and confidential when it opens in August.\n\n\n\n\n\n\"In this space, we'll actually have a private consultation room, the sample drop-off room. The lab is up at the end.\"\n\n\n\n\n\nThe service will offer testing for most pills, capsules, powders, crystals, and liquids - and act as an early detection point for authorities on the lookout for highly dangerous synthetic opioids such as fentanyl and Nitazenes, which can be mixed with other drugs.\n\n\n\n\n\nMental Health Minister Ingrid Stitt says it's about saving lives, not softening the government's stance on drugs.\n\n\n\n\n\n\"None of this means that it's legal to have drugs on you... This is a known drug use part of our city. So all those factors meant that this was a really good location.\"\n\n\n\n\n\nThe announcement means Victoria joins the ACT in being the only two jurisdictions in Australia with a fixed pill testing site.\n\n\n\n\n\nEarlier this year, Queensland decided not to renew contracts for their own permanent testing sites at Brisbane's Bowen Hills and Burleigh Heads on the Gold Coast, despite extremely potent synthetic opioids being found in Australian wastewater for the first time, substances up to 40 times more powerful than fentanyl.\n\n\n\n\n\nThe Queensland Mental Health Commission has been tasked instead with developing an overdose monitoring system.\n\n\n\n\n\nThe decision prompted Australian Medical Association Queensland president Dr Nick Yim to issue a statement that said without an early warning system like pill testing, he feared the closures would lead to higher rates of harm.\n\n\n\n\n\n\"It is disappointing the Crisafulli government, who was elected on a promise that they would listen to the experts, has once again dismissed the evidence supported by doctors... Without regulated testing, already vulnerable community members remain exposed to these hidden dangers.\"\n\n\n\n\n\nHealth Minister Tim Nicholls has stood by the decision to rip up the clinic contracts, citing the Liberal National Party's stance against drugs.\n\n\n\n\n\nThat's been backed by others in the government like small business minister Steve Minnikin.\n\n\n\n\n\n\"We don't believe there is any safe way to actually undertake illegal drugs. We will not be going down the pill testing path.\"\n\n\n\n\n\nBut in other states, like New South Wales, pill testing sites are still not off the table.\n\n\n\n\n\nThere's a 12 month trial currently underway at music festivals across the state that Premier Chris Minns has previously said will run their course.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-sussan-ley-on-gaza-misogyny-and-escaping-the-novelty-of-being-a-woman-leader/qsaffzmnz",
        "title": "INTERVIEW: Sussan Ley on Gaza, misogyny and escaping the 'novelty' of being a woman leader",
        "publish_date": "Tue, 17 Jun 2025 01:01:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/theatre/write-what-you-know-play-school-presenter-mines-real-life-family-drama-20250618-p5m8ei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Write what you know: Play School presenter mines real-life family drama",
        "publish_date": "Wed, 18 Jun 2025 12:01:35 +1000",
        "category": "finance",
        "authors": [
            "Nicole Elphick"
        ],
        "text": "Despite being a Korean-Australian adoptee herself, actor and now freshly minted playwright Michelle Lim Davidson had not been planning to explore the topic in her debut play. In 2023, she was part of the Griffin Studio program, a creative lab for early career playwrights, and was planning a piece about K-pop, but after a post-pandemic trip to South Korea, the work’s direction shifted.\n\n“I was going back to see my Korean family. It was my second trip back after meeting them,” says Lim Davidson. “I thought maybe as a playwright I should attempt to write what I know. So I came back and said, okay, the K-pop is still strangely relevant, but I am going to write about what happens after the [adoption reunion] Hollywood moment.\n\n“After the hugging and the crying, how do you establish a relationship with somebody that you barely know? How do you bridge that emotional, cultural and physical distance? I felt it’s not an experience people have had much insight into, and that’s why I thought, well, I’ll give it a go.”\n\nMichelle Lim Davidson has written a new play, Koreaboo, based on her own adoption story. Credit: Dominic Lorrimer\n\nThe resulting play is Koreaboo. The two-hander stars Lim Davidson as Korean-Australian adoptee Hannah, who is visiting her birth mother in Seoul hoping to spend the summer connecting, but the reality doesn’t live up to her initial expectations.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/this-new-cli-fi-novel-envisages-a-more-hopeful-apocalypse-20250611-p5m6lc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This new cli-fi novel envisages a more hopeful apocalypse",
        "publish_date": "Wed, 18 Jun 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Jack Cameron Stanton"
        ],
        "text": "FICTION\n\nSalvage\n\nJennifer Mills\n\nPicador, $34.99\n\nIn Salvage, Jennifer Mills lets the billionaires escape our dying planet on a space station with a VIP list. And then she leaves them there to rot.\n\nThis is Mills’ first, fully fledged science-fiction novel to portray the before and after of ecological apocalypse, but it continues her merging of the uncanny or speculative with her artistic instinct for spatial and psychological choreography. In other words, Mills’ novels begin by asking: what kind of world is this? But the focus is always on what it feels like to inhabit these unusual worlds.\n\nThe Airways, Mills’ previous novel, was ostensibly a queer fabulist horror story about a ghost seeking revenge. But this hook was masquerading a second, more experimental desire to assign a new form of language to this state of being. Dyschronia, which was short-listed for the 2019 Miles Franklin prize, ventured into weird fiction, imagining the desolation after the shore receded from an Australian coastal town, converting it overnight into a location of dark tourism – much to the chagrin of the few inhabitants who refused to leave. Taken all together, Mills’ fiction continually returns to hauntings; her works explore how spectres from the past are eternally resurrecting in the present.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/a-haunting-tribute-to-the-bonds-between-humans-and-animals-20250612-p5m70q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A haunting tribute to the bonds between humans and animals",
        "publish_date": "Wed, 18 Jun 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Candida Baker"
        ],
        "text": "YOUNG ADULT\n\nThe Foal in the Wire\n\nRobbie Coburn\n\nHachette, $19.99\n\nHow many of us as children have suffered from the onslaught of our family unhappiness? How many of us have blamed ourselves for things that went “wrong”, that were never our fault, and how many of us have reached out for something to help us feel safe in our troubled world?\n\nIn the chaos of alcoholism, affairs and mayhem that constituted my childhood, I reached out for horses, and it seems as if Robbie Coburn, a Melbourne-based poet and recently published YA author, had a similar experience. When I reviewed Coburn’s 2024 book Ghost Poetry, I was stunned by its visceral, haunting beauty, and now hot on its heels, or hooves, comes The Foal in the Wire, a verse novel about the potential power of the relationship between horses and humans to transform a troubled life.\n\nAfter my review, Coburn and I made contact to discuss the profound effect horses have had on our lives. I knew he was writing a YA verse novel, and wondered how he would transition to that specific and complex genre. But Coburn is nothing if not versatile.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/billionaire-barry-diller-married-to-diane-von-f-rstenberg-comes-out-in-new-memoir-20250617-p5m807.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billionaire Barry Diller - married to Diane von Fürstenberg - comes out in new memoir",
        "publish_date": "Wed, 18 Jun 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Nathan Smith"
        ],
        "text": "A former CEO of Paramount Pictures, Diller hid his sexual orientation for decades, despite persistent rumours to the contrary. A high-profile marriage to fashion designer Diane von Fürstenberg helped quell some speculation but the threat of being outed was still like an “anvil hanging … over my head”.\n\nPublic figures still sometimes save weighty admissions about their lives for their autobiographies. Barry Diller, the billionaire media mogul and chairman of Expedia, has used his to do just that: come out of the closet.\n\nIn Who Knew, the 83-year-old publicly acknowledges his sexuality for the first time. Diller admits that he has long known that he is gay but hid the truth to preserve his career ambitions and avoid public shaming. As for wife von Fürstenberg, she remains a rare romantic outlier and the lasting “bedrock of my life”.\n\nThe memoir now reveals this hidden personal history and also shares his business acumen with other aspiring entrepreneurs.\n\nDiller, who reveals in his new memoir that he is gay, with Diane Von Furstenberg, to whom he’s been married for 24 years. Credit: Bloomberg\n\nDiller was born of privilege but suffered a dysfunctional family life, one where his mother would dispense sleeping tablets and a heroin-addicted brother beat him. The basement of talent agency William Morris was a sanctuary where its cabinets of archived correspondence were a way to “read … through the history of show business”.\n\nGood fortune, as it happens, was often looking out for the eager student of Hollywood’s history. First, a lucrative posting at the television network ABC to help program films for the small screen. An enterprising thinker, Diller believed networks should make films for the tube too, soon transforming the station’s profile thanks to his successful made-for-TV movies.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/optus-to-pay-100-million-fine-over-sales-to-vulnerable-customers-20250618-p5m8fp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Optus to pay $100 million fine over sales to vulnerable customers",
        "publish_date": "Wed, 18 Jun 2025 11:57:10 +1000",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Optus has agreed to pay $100 million in penalties after landmark legal action from the consumer watchdog over “unconscionable conduct” related to selling vulnerable customers products they could not afford or use.\n\nOn Wednesday, the Australian Competition and Consumer Commission and Optus announced they would now jointly ask the federal court to impose a total penalty of $100 million for breaching the consumer law, after the telco admitted its sales staff acted unconscionably when selling phones and contracts between August 2019 and July 2023.\n\nOptus had agreed to pay a $100 million penalty after ACCC legal action.\n\nAs part of the penalty agreement, Optus has also signed an undertaking that it will compensate affected customers and improve its internal system, with the federal court to make orders on the amount. The company will also make a $1 million donation to an organisation that helps foster digital literacy among First Nations Australians.\n\nThe ACCC launched the legal action against Optus in October, and while the allegations included 429 customers across 16 stores, the telco acknowledged Indigenous Australians were the majority of those affected, primarily at its two Darwin locations and its Mount Isa store.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-trade-war-is-starting-to-bite-china-s-economy-20250618-p5m8b2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s trade war is starting to bite China’s economy",
        "publish_date": "Wed, 18 Jun 2025 11:56:20 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "It pulled forward US imports and retail spending in March, with an associated bump in China’s exports to America, which have since fallen away. US retail sales declined in April and May and China’s exports to the US plunged 34 per cent last month. The fallout from the trade war also shows in China’s economic numbers, with the tariff uncertainty hitting private investment hard. There was zero growth last month compared to May last year and foreign investment was down 13.4 per cent. It could cost China the golden chance that Trump’s “America First” assault on trade and geopolitical alliances and multilateral institutions has created. The growth in fixed asset investment overall in China slowed from the 4 per cent in the first four months of the year to 3.5 per cent in the five months to end-May, even though manufacturing investment was up 8.5 per cent and public investment rose 5.9 per cent. The unusual feature of the May data was the unexpectedly strong growth in retail sales, which grew 6.4 per cent year-on-year, an acceleration from the 5.1 per cent rate experienced in April.\n\nThat’s a reflection of Beijing’s limited attempts to stimulate consumption via its subsidies for trade-ins of household appliances. Their sales soared 53 per cent, while mobile phones and other communication devices – also covered by the trade-in policy – jumped 33 per cent. The surge in exports to the US in March was driven by “front-loading,” or a scramble by US importers to grab stock before the tariffs cut in. Donald Trump and China’s President Xi Jinping: While Trump has backed away from the 145 per cent tariff rate on China, the trade relationship remains unresolved. Credit: AP The retail sales splurge in China could be seen as analogous. The budget for the trade-in subsidies is capped, with some regional governments having already used up their quotas. The subsidies will have drawn forward spending, which makes the spike in sales a one-off event – once a household has bought a new washing machine, it’s unlikely to be in the market for another for some time.\n\nThere may also have been some impact from an earlier-than-usual annual online shopping event, which may also have attracted forward spending from June. Loading In both economies, consumer confidence remains brittle – in the US because of the uncertainties generated by Trump’s erratic trade policies and in China because of the continuing deterioration of its ravaged property markets, the repository for estimated 60 to 70 per cent of its middle-class wealth. Property prices continued to fall in May. After the market had appeared to stabilise earlier in the year following a range of policies introduced late last year aimed at shoring up the market, prices in April and May have started sliding again. Consumer confidence and spending will continue to remain weak until it is clear that the property market has bottomed out.\n\nFor China, with the stimulus funding budgets to tail off in the second half of the year and the impact of Trump’s tariffs likely to show up more materially as the year progresses, it will be a challenge to achieve Beijing’s target of 5 per cent GDP growth this year. Exports have been booming, partly because of the front-loading of sales to the US but also because China’s exporters have scrambled to diversify their markets. Some exports will inevitably have been re-routed to countries with lower tariffs, providing a backdoor entry to the US market. Others are displacing domestically produced goods in other economies, with the growth of exports to South-East Asia, Latin America and Europe causing increasing trade frictions and pushback from those economies, who face having their domestic manufacturing bases hollowed out if China’s former export volumes to the US are diverted to their markets. China’s broad strategy over the past decade – encouraging and subsidising exports while trying to create a self-sufficient domestic economy, one that doesn’t rely on imports, by subsidising domestic companies, particularly those engaged in advanced manufacturing – isn’t sustainable in the new trade environment.\n\nLoading Whatever the final shape of the trade relationship with the US, China’s exports to the US will be lower than what they were before Trump regained the presidency, and China will experience increasing resistance from its other trade partners to any attempt to compensate for lost US volumes by redirecting those exports to their markets. In the longer term, China will have to do something about the excess capacity in its domestic manufacturing base, which reflects wasteful and increasingly unproductive over-investment, even if that means a lower economic growth rate. It will have to accept lower export volumes and do more to stimulate domestic consumption or face increased friction with all its trade partners that could create an existential threat to its current economic model. It could also cost China the golden chance that Trump’s “America First” assault on America’s traditional trade and geopolitical alliances and multilateral institutions has created – the opportunity to diminish America’s dominance and elevate its own role in global affairs.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-next-sydney-suburbs-in-line-for-18-storey-apartment-blocks-20250617-p5m841.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The next Sydney suburbs in line for 18-storey apartment blocks",
        "publish_date": "Wed, 18 Jun 2025 11:51:54 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "Two Sydney suburbs are set to be transformed as low-rise homes make way for buildings up to 18 storeys tall under a controversial council plan to deliver 4000 new dwellings.\n\nCanterbury-Bankstown City Council has voted to endorse its alternative plan to the state government’s transport-oriented development (TOD) scheme for Wiley Park and Punchbowl.\n\nAn artist’s impression of future Wiley Park under council’s housing proposal. Credit: Canterbury-Bankstown City Council\n\nThe council had been required to allow at least 1600 new homes in those suburbs under the government’s TOD plans. Instead, it more than doubled the target.\n\nUnder the council’s alternative, up to 4000 new homes could be built and high-density rezoning extended to 800 metres from Wiley Park and Punchbowl metro stations. Low-density streets would be transformed, with buildings of between four and 18 storeys.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/glass-houses-to-a-glass-jaw-why-slater-went-too-far-in-the-origin-theatre-20250618-p5m8ff.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Glass houses to a glass jaw: Why Slater went too far in the Origin theatre",
        "publish_date": "Wed, 18 Jun 2025 11:50:28 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "The first victim of State of Origin is context.\n\nFor all the record ratings that the marquee series is able to generate come kick-off, it can be difficult to move the needle beforehand. The current series has been a hard sell for the beat reporters struggling to manufacture clicks.\n\nThe players we most want to hear from, Latrell Mitchell and Spencer Leniu, have slapped media bans on themselves; the opening encounter, at least as a spectacle, was not a patch on the absolute blockbuster finale that decided last year’s series; and NSW basing themselves in the Blue Mountains has made the squad less accessible to a media contingent attempting to find some flames to fan.\n\nThe Blues’ recent domination, coupled with limited access, is another contributing factor to making the Perth clash a tough sell.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/slater-apologises-for-green-reference-20250618-p5m8fz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Slater apologises for Green reference",
        "publish_date": "Wed, 18 Jun 2025 11:50:06 +1000",
        "category": "finance",
        "authors": [],
        "text": "Slater apologises for Green reference\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/origin-ii-our-experts-make-the-call-on-who-will-win-and-why-20250617-p5m83m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin II: Our experts make the call on who will win and why",
        "publish_date": "Wed, 18 Jun 2025 11:40:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Origin II: Our experts make the call on who will win and why\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-goes-green-in-council-tax-avoidance-scheme-20250617-p5m82b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "$50 levy for ‘free’ green bins: Brisbane residents slugged in ‘tax-avoidance scheme’",
        "publish_date": "Wed, 18 Jun 2025 11:32:03 +1000",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt",
            "Felicity Caldwell"
        ],
        "text": "Brisbane residents will be charged an extra $50 waste levy to cover the cost of rolling out green bins across the city as part of a council “tax-avoidance scheme”, whether they choose to have a green bin or not.\n\nBrisbane City Council is introducing an opt-out green waste program for about 170,000 households and is scrapping surcharges in favour of the levy.\n\nUnder the changes, the waste levy for all Brisbane households is set to increase by almost $50 from August – making waste charges for all residents a universal fee of $512.96 a year.\n\nBrisbane Lord Mayor Adrian Schrinner: “Every house will get a green bin, and that will be part of the business as a usual service.” Credit: Brisbane City Council\n\nLord Mayor Adrian Schrinner said the scheme was a “large-scale tax-avoidance scheme” that would help the council avoid the state government’s “bin tax”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/oconnor-eyes-fairytale-farewell-20250618-p5m8fy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "O'Connor eyes fairytale farewell",
        "publish_date": "Wed, 18 Jun 2025 11:30:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "O'Connor eyes fairytale farewell\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/600000-aussies-to-benefit-amid-major-blood-donation-overhaul-about-bloody-time-012703283.html",
        "title": "600,000 Aussies to benefit amid major blood donation overhaul: 'About bloody time'",
        "publish_date": "2025-06-18T01:27:03Z",
        "category": "lifestyle",
        "authors": [],
        "text": "Australia is tearing down outdated blood donor barriers — lifting bans that have excluded LGBTQI+ people, and rewriting rules with fair, gender-neutral screening.\n\nAustralia is making significant strides in modernising its blood and plasma donation policies to be more inclusive and evidence-based. Source: Getty\n\nIn a world-leading move, Australia is lifting restrictions that have long prevented many gay, bisexual and transgender people from donating plasma, with historic changes to blood donation screening set to follow next year amid critical shortages.\n\nFrom July 14 most sexual activity-based wait times will be removed for plasma donation, including for people taking PrEP [a tablet to prevent HIV infection], allowing tens of thousands more people to donate.\n\nInclusive, gender-neutral rules for blood donation have also been approved and are expected to be implemented in 2026, bringing an end to gendered screening questions and marking a major shift in how all donors are assessed. That means any person, regardless of their sexual orientation, will have to follow the same criteria to donate, removing specific questions targeting gay, bisexual and trans women who have sex with men.\n\nSpeaking to Yahoo News Australia on Wednesday morning, a Lifeblood spokeswoman said the changes were a long time in the making.\n\nADVERTISEMENT\n\n\"It's a rigorous process when any changes happen in the health system, but we've gotten there,\" she said. \"So from the 14th of July, restrictions are lifted on plasma — meaning gay, bi, trans and PrEP users can donate plasma without a wait time — that includes sex workers and some other groups.\n\n\"The estimate, done by the Kirby Institute, is that this change could affect around 600,000 people. The only restriction that remains in place is if you have HIV, or if you have a partner with HIV.\"\n\nInclusive, gender-neutral rules for blood donation have also been approved and are expected to be implemented in 2026. Source: Getty\n\nHow do blood donations work in Australia?\n\nAustralia’s donated blood is rigorously tested at every stage — including screening for blood type, antibodies, HIV, hepatitis B and C, syphilis and bacterial contamination — performed in TGA‑licensed labs to ensure only safe blood reaches patients, with any positive samples destroyed immediately.\n\nADVERTISEMENT\n\nBlood is made up of several components, including red blood cells, white blood cells, platelets, and plasma. Plasma is the clear, yellowish liquid portion that carries these cells, along with nutrients, hormones, and proteins, throughout the body. While whole blood donations include all components, plasma donations collect only the liquid part, which can be processed and used to treat a variety of medical conditions, such as immune disorders and clotting problems.\n\nUnder the new system, people in a sexual relationship of six months or more with a single partner will be eligible to donate blood. Those with new or multiple partners may also be eligible, provided they haven’t had anal sex in the past three months.\n\nImportantly, men will no longer be singled out and asked if they’ve had sex with another man — a major step toward a more inclusive and stigma-free donation process. \"Questions for all donors will instead be replaced with: 'Do you have a new partner?' and 'Have you been having anal sex in the last three months with this new partner?\" the spokeswoman explained.\n\n\"That will mean a wait time if you have, but if it’s a monogamous relationship and it’s not a new partner, then you’ll be able to donate. And men and women will both be asked the same questions.\"\n\nNow, Australia is at the forefront globally in modernising blood and plasma donation policies to be more inclusive and evidence-based. We now join a small but growing group of countries prioritising safety while reducing stigma for LGBTQ+ donors.\n\nADVERTISEMENT\n\nSimilar gender-neutral donation systems have been implemented in countries like the United Kingdom and Italy, where questions focus on individual sexual behaviour rather than identity, allowing more people to donate safely. However, Australia’s move to eliminate wait times for plasma donation among PrEP users and men who have sex with men places it among the world leaders in progressive, scientifically informed donor eligibility.\n\nLGBTQI+ campaigners have long championed such a change, with advocates welcoming the announcement on Wednesday.\n\n\"About bloody time! Gay and bisexual men have some of the highest levels of sexual health practice and literacy, and I look forward to joining gay and bisexual men across Sydney and Australia in donating blood,\" Member for Sydney Alex Greenwich said.\n\nSafety for donors remains Lifeblood's 'top priority'\n\nLifeblood’s Chief Medical Officer, Dr Jo Pink, said given that the plasma is the donation type most needed by Australian patients, the change couldn't come at a better time. Pink said the safety and well-being of patients who receive donations remains, as always, at the forefront in decision-making.\n\nADVERTISEMENT\n\n“With more than 600,0000 people estimated to be covered by the previous wait times, we now anticipate an extra 24,000 donors, and 95,000 extra donations of plasma to be made each year,\" she said. \"There are many steps that Lifeblood needs to take before we can implement the new gender-neutral assessments, including working with state and territory governments to change the donor questionnaire. We hope to be able to implement this part of the change next year.\n\n\"Blood safety is and always will be our top priority, but we know the current donation rules have been very difficult for many people in the LGBTQIA+ community. While they were put in place to ensure a safe blood supply in the past, we know that they’ve contributed to the stigma faced by the community.\n\n\"We hope as we move through the process of seeking to have both these changes introduced, this will be a turning point for both Lifeblood and the LGBTQIA+ community.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussies-warned-as-brain-worm-spike-detected-following-extreme-weather-event-212603739.html",
        "title": "Aussies warned as brain worm spike detected following extreme weather event",
        "publish_date": "2025-06-17T21:26:03Z",
        "category": "lifestyle",
        "authors": [],
        "text": "The spike in animal cases could be bad news for humans, as the unthinkable spread of rat lungworm continues.\n\nWhile rat lungworm infections are on the increase in dogs, it's uncommon for humans to ingest it by eating salad in Australia. Source: Getty/University of Sydney\n\nA tiny parasite that can infect human brains has the potential to change our way of life in Australia, threatening not only our health but what we eat. Originally from Southeast Asia, rat lungworm is now established along our east coast, with infections found as far south as Jervis Bay.\n\nUniversity of Sydney research has linked spikes in infections of the worm in animals to heavy rainfall, because the worm is commonly found in slugs and snails that proliferate during wet weather. A study of 93 dog infections in Sydney and Brisbane found 32 occurred directly after a single rain event, which were likely triggered after pets came into contact with common garden molluscs. The researchers found risk was elevated for between two and 10 months after heavy rain.\n\nThe study's senior author, Jan Šlapeta from the Sydney School of Veterinary Science, told Yahoo News it's unclear how far south the parasite will spread. But with the world's weather becoming warmer and wetter, it's possible it could one day make its way down to Melbourne.\n\n\"It has the potential to spread further. An indicator is that 20 or 30 years ago, we did not talk about it in America or Europe. Now it's in the southern states of the United States, it's creeping into Europe, it's in Spain,\" he said.\n\nADVERTISEMENT\n\n\"I think climate change is very much helping this parasite spread further.\"\n\nNew invasive species could 'dramatically' increase infections\n\nInteractions with slugs and snails are the most common way for people to become infected, either by accidentally or intentionally eating them, or by consuming unwashed salad they’ve had contact with. In 2010, a Sydney man died after he ate a slug following a dare.\n\nIt's unusual for anyone in Australia to eat an infected snail because of their large size, but that could change if there's a similar biosecurity breach to what has occurred in Hawaii.\n\nIt's on the Big Island that a tiny semi-slug, Parmarion martensi, has invaded the landscape. It's so small that it's easy to accidentally consume when eating salad greens and fresh fruit and vegetables.\n\nADVERTISEMENT\n\n\"You can't wash them off or see them. The number of human cases [of rat lungworm] have increased dramatically,\" Šlapeta said. \"In Australia we do not have this semi-slug. Is there a potential? We can't yet tell. But we have areas up north that are similar to Hawaii. I don't want to be an alarmist, but this parasite could create more havoc.\n\n\"If this semi-slug comes in, then it might end up on the veggies that people have got in their backyards. And that would change the landscape of this disease completely, like it changed in Hawaii.\"\n\nThe semi-slug would complete a cocktail of invasive species that Šlapeta doesn't want to see become established in Australia.\n\n\"The parasite is invasive, the rat is invasive, the European slugs that we see in the backyards of Sydney are invasive, but if we bring in the semi-slug... it could change the way we grow greens and behave in restaurants,\" he said.\n\nRat lungworm originated in Southeast Asia, but it's now found in Australia. Source: University of Sydney\n\nThe first sign rat lungworm has reached your city\n\nThe first sign the worm has reached a city is usually that animals in its zoo have become sick, with curious primates often picking up slugs inside their cage and then becoming sick. Reports made by wildlife rescue volunteers are also useful in monitoring its spread, as tawny frogmouths and possums often get sick in large numbers.\n\nADVERTISEMENT\n\nSince rat lungworm, also known as Angiostrongylus cantonensis, was first detected in Brisbane in the 1970s, at least six people have been infected, two of whom have died.\n\nWhen it comes to infections in people, most are asymptomatic, and many cases likely aren't diagnosed.\n\nWhy do people become sick from rat lungworm?\n\nDuring its first phase of life, rat lungworm larvae hatch in the lungs of rats and is then passed through the animal as faeces. Slugs and snails consume that faeces and the worms grow inside of them. Rats then eat the slugs and snails and the process begins again.\n\nADVERTISEMENT\n\nThe process is relatively harmless to slugs, snails and rats, but in other hosts like humans, dogs or native birds and mammals, the body can overreact and try to kill the parasite. On rare occasions, it causes an infestation in the brain that triggers an immune response that causes inflammation. Symptoms normally set on between one and three weeks after a slug or snail is eaten, and include headaches, nausea, vomiting, a stiff neck, pain in the skin and fever.\n\nWhat can we do about the spread of rat lungworm?\n\nThe University of Sydney study on rat lungworm infections in dogs advocates for a One Health approach to combating the parasite.\n\nThis concept means recognising that animals and humans live in the same environment and are therefore interconnected. But how best to respond to the problems it's causing is something that's left Šlapeta stumped.\n\n\"That's the million dollar question. The parasite is moving wherever it wants,\" he said. \"We can't eliminate rats, we can't eliminate slugs, so we just have to be more vigilant around the clinical signs in our pets and ourselves.\n\n\"But there's not much we can do about tawny frogmouths. They will keep looking for some sort of food, and if the slug or snail is infected then they will become infected too.\"\n\nThe lead author of the study into rat lungworm in dogs was Sydney University's Phoebe Rivory. The research was published in the Journal of Infectious Diseases.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    }
]