[
    {
        "url": "https://www.9news.com.au/national/prime-minister-albanese-uk-visit-king/3a0b60ce-429c-4a20-8f54-794453459963",
        "title": "Albanese meets with King Charles at Balmoral",
        "publish_date": "Sat, 27 Sep 2025 22:16:59 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Prime Minister Anthony Albanese has visited Balmoral Castle for a private meeting with King Charles III.\n\nAlbanese and fiance Jodie Haydon flew to Scotland overnight for the face-to-face visit, which the prime minister described as a privilege and a \"great honour\".\n\nThe King only two weeks ago praised the AUKUS defence pact between Australia, the US and Britain during Donald Trump's state visit to the UK.﻿\n\nKing Charles III during an audience with Australian Prime Minister Anthony Albanese at Balmoral Castle. (Getty)\n\nThe prime minister will tomorrow speak at the UK Labour Party conference in Liverpool before travelling to the United Arab Emirates.﻿\n\nEarlier, Albanese joined the British Prime Minister Sir Keir Starmer in discussing defence, security, trade and the economy.\n\nTop of the agenda was how to protect the AUKUS pact from being unpicked by Donald Trump's America First agenda.\n\nThe US President's unique brand of populism has been matched in Britain by Nigel Farage's Reform party which is leading the UK polls.\n\nFarage is riding a wave of anti-immigration sentiment helped along by rallies stoked by far-right activists .\n\nMarch for Australia protests have also been held in major cities over the past few weeks.﻿\n\n\"That sends shivers through the spines on many of our communities,\" Starmer said.\n\n\"I don't want to see the rise of populist organisations,\" Albanese added.\n\nPrime Minister Anthony Albanese and Jodie Haydon arrives for an informal meeting with Prime Minister of the United Kingdom and Lady Victoria Starmer, the Prime Minister of Canada and Madam Diana Fox Carney and Mette Frederiksen, Prime Minister of Denmark at 10 Downing Street. (Dominic Lorrimer)\n\nThe British Prime Minister hosted his Australian counterpart at Number 10.\n\nAlbanese said: \"We share values and today more so than ever really.\"\n\nLater, he was seen heading into the famous door with some Aussie-brewed beers with partner Haydon.\n\nHe clutched a four-pack of his own Albo brew by Willie The Boatman﻿ in Sydney.\n\nREAD MORE: Man dies after plane owned by skydiving business crashes\n\nBritish Prime Minister Keir Starmer (L) welcomes Australian Prime Minister Anthony Albanese to 10 Downing Street. (Getty)\n\nAlbanese and Starmer are both from the progressive side of politics.\n\nAlbanese scored a thumping re-election in May.\n\nThe other is facing an early reckoning just 14 months after winning power.\n\nThe British public is increasingly concerned about illegal migrants, with many crossing the English Channel in boats.\n\nThe British PM has announced a mandatory digital ID in a bid to stamp out illegal workers.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/ashraf-mahrous-egypt-guinness-world-record-pull-ship-teeth/40d0d59f-5816-4b87-8a95-004e4decd01b",
        "title": "Egyptian wrestler pulls 700-ton ship with his teeth",
        "publish_date": "Sun, 28 Sep 2025 01:45:07 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": "With nothing but grit, muscle and an iron jaw, a hugely popular Egyptian wrestler geared up for an extraordinary challenge yesterday: pulling a 700-ton ship across the water with a rope held only by his teeth.\n\n“Today, I have come to break the world record,” Ashraf Mahrous said in an interview in Egypt’s Red Sea resort of Hurghada after the challenge.\n\nIt was no easy task but Ashraf Mahrous, also known by his nickname Kabonga, has dazzled before with his astonishing strength. Earlier this year, he pulled a train. He has also singlehandedly pulled a locomotive and four years ago, a truck.\n\nMahrous in action whilst a Guinness Book of World Records official watches on. (AP)\n\nWith each achievement, his popularity has soared — children run after him in the streets, where he's known simply as “strong man.”\n\nWith the ship pull, Mahrous, a 44-year-old native of the port city of Ismalia, hopes to get yet another recognition from the Guinness World Records.\n\nA triumph by the Red Sea\n\nThe scene was set at the shore in Hurghada. Mahrous first pulled a 700-ton ship, and to affirm his challenge he pulled two ships weighing approximately 1150 tons together.\n\n“I pulled them both, thanks to God, to prove to my friends and the whole world that God blessed me by being the strongest man in the world,” Mahrous said.\n\nHe said the current Guinness World Record is a 614-ton ship set in 2018.\n\nMahrous said he will send videos and photos of his attempt to Guinness World Records to be evaluated.\n\nMahrous celebrating his feat. (AP)\n\nIn preparation for the feat, Mahrous followed a protein- and iron-rich diet, consuming at least a dozen eggs, two whole chickens, and 5 kilograms of fish every day — all while training for two hours, three times a day.\n\nIt wasn't his first ship pull. Six years ago, he tried for two hours before he managed to pull a 4000-ton ship in the water, a rope strapped to his shoulders, for about 30 metres. The event was caught on video.\n\n″I grunted and yelled as I pulled the ship, and I spoke to it, saying ‘It’s either me or you today,’\" he told The Associated Press recently at his local gym in Cairo, where he trains daily.\n\nMahrous believes that speaking with the object he pulls beforehand helps him establish a connection and is key to his success. “It’s important for me to treat the object that I will pull as part of my body that moves along with my heart beat,” he said.\n\nAn extraordinary child\n\nMahrous, 190 centimetres tall and weighing 155 kilograms, said his strength emerged early.\n\nAs a child, he would carry his friends for fun and haul heavy loads, several gas cylinders at once on a wheelbarrow. He was nine when his father lost his job as a contractor in Iraq and after that, Mahrous began knocking on doors, offering to lift heavy items for some cash.\n\nOnce, he accidentally broke a friend’s arm when he tried to pull him as they played. He helped people move bricks, sandbags and other heavy materials — and he was fast. He loved sports and trained in kung fu, kickboxing and even established a wrestling team in Cairo.\n\nIt was only when his friends saw him easily flip giant tires 10 times in a row in a deserted courtyard at their gym and push a car using only a finger that they encouraged him to go for a world record.\n\n“I was inspired by people who broke records and felt like they are no better than me,” he said. Now he's less fearful of injuries and more concerned about failing to accomplish a pull.\n\nMahrous was supported by a crowd of people on the shores of the Red Sea. (AP)\n\nPast recognitions\n\nIn March, he was formally recognised by Guinness World Records for the heaviest rail pull: He pulled a train weighing 279 tons with a rope held by his teeth for a distance of nearly 10 metres. At the time, he received two other certificates, for the heaviest locomotive pull and for the fastest 100-metre road vehicle pull.\n\nMahrous, who is also president of the Egyptian Federation for Professional Wrestlers, was previously recognised by Guinness in June 2021, for pulling a 15,730-kilogram truck with his teeth. And in February 2024, the international franchise recognised him for cracking and eating 11 raw eggs in 30 seconds.\n\nHe wears a mouthguard during pulling events but says he has no concerns about his teeth. Instead of going to a dentist, he uses a miswak — a traditional teeth-cleaning twig rich in anti-bacterial compounds that help prevent decay.\n\nHe says he takes no supplements but eats, sleeps and works out at least twice every day.\n\nHis ambitions are far from over. Next, he plans to send a request to the Egyptian presidency for permission to pull a 263,000-ton submarine.\n\nHe also hopes someday to pull a plane using only his eyelid muscles.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/agent-buys-cutprice-home-of-retiree-with-alzheimers/418bb1f6-4dbf-4310-bc58-8d4c2ce0e190",
        "title": "Real estate agent buys cut-price home of retiree with Alzheimer's",
        "publish_date": "Fri, 26 Sep 2025 03:18:37 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A real estate agent who believed she was doing the \"right thing\" by buying a vulnerable retiree's property at $500,000 below market value has had her licence suspended.\n\nRachelle Carmen Nohra took advantage of the 82-year-old with alcohol problems and symptoms of Alzheimer's by purchasing his Sydney home for $600,000.\n\nShe offered this price despite knowing his property had a similar value to one sold next door for $1.1 million.\n\nNohra, who is the director of Eser Property in Greystanes, purchased the man's home at a \"significant undervalue\" in a personal capacity in April 2023, a tribunal decision published yesterday revealed.\n\nShe promised that the retiree - known for legal reasons as Mr A - could remain living at the property for the rest of his life.\n\nHowever, their subsequent tenancy agreement allowed him to be evicted with 90 days' notice, the NSW Civil and Administrative Tribunal found.\n\nNohra did not appear to understand there was a conflict between her own interests and the retiree's when she bought his property or that he was vulnerable to be taken advantage of, the tribunal said.\n\n\"(Her) lack of insight into such basic matters is of serious concern to the tribunal,\" senior member Lachlan Bryant wrote.\n\nNohra had approached the tribunal seeking to overturn a decision by the Commissioner for Fair Trading suspending her licence for a year, imposing a $11,000 fine and directing her to undertake further training.\n\nShe contended that she was still a \"fit and proper person\" to act as a real estate agent.\n\nInstead, Bryant found she had taken advantage of the 82-year-old by purchasing his property without giving him the chance to get financial or legal advice.\n\n\"Subject to the costs of the sale, the applicant stood to gain a windfall from the sale of around $500,000, on her own estimates, and upon its completion was enriched to (the retiree's) detriment,\" he wrote.\n\nHer actions were \"sufficiently closely connected to her profession\" to warrant reprimand and punishment, the tribunal found.\n\n\"(Nohra's) belief that purchasing (his) property in the circumstances was the right thing to do is of serious concern,\" Bryant said.\n\n\"(Her) conduct may put the real estate industry into disrepute and falls short of the community's expectations of a licence holder.\"\n\nShe had failed to repay further money to the retiree or take steps to ensure his tenancy at the property was secure over the long-term, Bryant noted.\n\nHowever, he declined to impose a higher penalty sought by Fair Trading - including cancelling her licence completely and banning her from acting as a real estate agent for three years.\n\nThat was \"too harsh\", he found.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/old-electrical-appliances-made-to-be-fixed-and-still-performing/105791190",
        "title": "Retro gadgets stand test of time in an era of disposable tech",
        "publish_date": "Sun, 28 Sep 2025 01:30:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Ron Coald has loved film since he was young and has amassed a significant collection since then.\n\n\"I used to collect old movie film from the projector box in the Katanning cinema,\" he said.\n\n\"It built up from that; I bought my first camera when I was a schoolboy.\"\n\nThe community's love of old appliances is keeping an Albany repairer busy. (ABC Great Southern: Rosemary Murphy)\n\nAt his home in Albany on WA's south coast, his collection of all things film contains cameras, film and players from throughout the ages.\n\n\"I've still got a H16 16-millimetre … it's a magic looking camera and I used to cover the Avon Descent with that,\" he said.\n\n\"I've also got the first video camera that came in; you had the camera in your hand, and on your shoulder you had the recording part of it.\"\n\nThe equipment, however, requires some upkeep.\n\nAnd that's where Neil Harrison comes in.\n\nSentimental value\n\nNeil Harrison says televisions are a common items for repair. (ABC Great Southern: Rosemary Murphy)\n\nThe Albany repairer is kept busy with jobs from people like Mr Coald who are choosing to get their older electrical appliances fixed rather than throwing them out and buying new.\n\n\"We mainly used to concentrate on audio-visual gear, but we're finding there's a lot of other stuff out there that does require repair,\" Mr Harrison said.\n\n\"Sometimes it's sentimental value, sometimes it used to work well and people want it to work well again.\"\n\nNeil Harrison says older electrical equipment was made to be fixed. (ABC Great Southern: Rosemary Murphy)\n\nHe has worked on some interesting audio systems.\n\n\"The old radiograms from the 40s, perhaps 50s, 60s and so forth — a lot that's been handed down and it was their parents or grandparents,\" Mr Harrison said.\n\n\" Vinyl … records have made a miraculous comeback, so we're doing a lot of that repair.\"\n\nRon Coald's collection ranges from stereoscopes through to DVDs and video cassette players. (ABC Great Southern: Rosemary Murphy)\n\nMade for repair\n\nMr Harrison said there was a difference between older electrical gear and more modern equipment.\n\n\"The older stuff was always designed to be repaired and designed to be repaired at component level,\" he said.\n\n\"Modern electronics, sometimes that can be done, but most of the time it's almost like replacing circuit boards.\n\n\"Everything has become very miniaturised, surface mounted, and it can be a little bit tricky to actually repair at component level.\"\n\nElaine Johnson continues to use a mixer she bought in the 1970s. (Supplied: Rebecca Johnson)\n\nAt Quairading in WA's Wheatbelt, Elaine Johnson's kitchen holds evidence that old electronics were made to last.\n\nShe still uses the electric mixer she purchased shortly after she was married in 1972.\n\n\"I was a young police woman on duty in the Hay Street Mall and I saw it being demonstrated,\" Ms Johnson said.\n\n\" It's still going strong and I've used it for lots of catering for CWA. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/act-car-dealers-public-servants-by-day-pro-wrestlers-by-night/105824272",
        "title": "Canberra car dealers and public servants by day, pro wrestlers by night",
        "publish_date": "Sun, 28 Sep 2025 01:11:24 +0000",
        "category": "sports",
        "authors": [],
        "text": "By day, public servant Del Goncalves works in a typical office and wears typical office clothes, but come nightfall, she dons a bunny costume and trades her office for a wrestling ring.\n\nShe's among a growing cohort of Canberrans who have fallen in love with pro wrestling — a sport where pain and injury are a given.\n\n\"I always get asked if it hurts — it does,\" Ms Goncalves said.\n\n\" Being someone who couldn't even throw a ball … it was a big surprise how much I fell in love with this. \"\n\nWrestling competitions are now happening in Canberra as the sport grows in popularity. (Supplied: Dan Dwyer)\n\nPopularised by the likes of Hulk Hogan, John Cena, and Dwayne \"The Rock\" Johnson, pro wrestlers rehearse choreographed stunts before performing matches against opponents for live audiences.\n\nThough the sport has a small base in Australia, it has developed a cult following in Canberra after the launch of a local wrestling academy and the Slam! Pro Wrestling league.\n\nJoining the academy after watching a local show in 2022, Ms Goncalves said the sport was about testing her limits, putting on a show and taking on an alter ego.\n\nDel Goncalves says wrestling has given her a new sense of confidence. (ABC News: Emily Anderson)\n\n\"During the day I'm quite an introverted person … but once I get into the ring and I go from Del to Moshpit Bunny,\" she said.\n\n\"All of a sudden loud, I'm larger than life, I've got confidence that daytime me doesn't have.\"\n\nAn appetite for a fight\n\nThe sport's popularity in Canberra has come as a surprise for academy co-founder Dan Dwyer who, when he isn't in the ring, works as a car salesman.\n\nDan Dwyer goes by the stage name Dan Archer when he's competing. (Supplied)\n\n\"You'll see me in a nice suit or polo pants,\" Mr Dwyer said.\n\n\"[Then] Saturday rolls around and we're into the tights and the big gold belts.\n\n\" I think the haircut and the gigantic muscles gives it away a little bit. \"\n\nKnown by his stage name Dan Archer, the Canberra man began wrestling when he was 16 years old after being inspired by video games and World Wrestling Entertainment (WWE).\n\nSince then, he has competed around Australia, but said he wanted to create a local championship to support local and national talent.\n\n\"I'd often find myself travelling up and down the highways to Sydney and parts of New South Wales to be able to wrestle in front of audience,\" Mr Dwyer said.\n\n\"But now [Canberra] has become quite a hotbed where we've got people travelling from all around the country.\"\n\nCanberra car salesman Dan Dwyer in character as Dan Archer for pro wrestling. (ABC News: Mark Moore)\n\nThe wrestling performances have drawn crowds of up to 2,400, which Mr Dwyer said was the largest he's experienced for an all-Australian event.\n\nHe said it's the atmosphere of the crowd that hooks people in.\n\n\"You've got hundreds of people cheering for you or booing for you wanting to see you get hurt or see you succeed,\" Mr Dwyer said.\n\n\"There's no other feeling you can get from other sports or hobbies.\"\n\nBattered and bruised\n\nThough athletes practice moves hundreds of times before taking them to the performance stage, injuries are part and parcel of wrestling.\n\nIt's something childhood educator Mia Fisher found out the hard way 18 months ago during a match against a fellow Canberra wrestler.\n\nMia Fisher didn't notice her injury until she'd left the arena and the adrenaline had started to wear off. (ABC News: Emily Anderson)\n\n\"Adrenaline is a wonderful thing. The match got called, I grabbed my arm, I straightened it out and I went out the back and I said, 'I broke my arm',\" Ms Fisher said.\n\nNine months, two titanium plates and 13 screws later, her character \"Kitten Mask\" returned to the stage.\n\n\"I love how you constantly put your body on the line to entertain an audience,\" Ms Fisher said.\n\nThousands attended the wrestling competition in Canberra. (ABC News: Emily Anderson)\n\nDespite the injury, she said wrestling is a hobby that she wants to continue doing for the rest of her life and hopes that she can inspire generations to take on the ring.\n\n\"I like to think I have little kids looking up at me and thinking maybe they could do that one day too,\" she said.\n\n\"I'm so grateful that I get to perform in front of all these people.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/afl-grand-final-lions-cats-analysis/105827470",
        "title": "Lions show why they're the complete team with second straight flag",
        "publish_date": "Sun, 28 Sep 2025 01:03:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "The age-old adage is a team of champions will beat a champion team.\n\nOften, we get seduced by the stars of the game, those referred to in mononyms.\n\nThink Buddy, Nat, Danger, Harley, Bont or Trac.\n\nThe Lions have broken the other way.\n\nThey are the complete team, with contributors across the board. For the second straight year, they have come together as more than the sum of their parts to tear a seemingly competitive grand final to shreds.\n\n\"I think in the fullness of time, when you sort of sit back and you think about the quality of team that beat us in this grand final, it might ease the pain a little bit,\" Geelong coach Chris Scott said after the match.\n\nThe 2025 Lions were a slightly different beast to the side from last year. Their centrepiece forward, Joe Daniher, walked off into the sunset after winning his elusive flag.\n\nGeelong's superpower fails its biggest test Photo shows Jeremy Cameron crouched and nursing an arm injury during the Cats' AFL grand final against the Lions. It is the cruel irony of sport that what is usually the ace up Geelong's sleeve proved to be its downfall in the loss to the Brisbane Lions in the season decider.\n\nOne of their most important defenders, Jack Payne, was ruled out early in the year. Their established tall forward, Eric Hipwood, was sidelined on the cusp of finals after playing most of the year with a partially torn ACL.\n\nOther key contributors, such as Jarrod Berry, Lincoln McCarthy, Keidean Coleman and Noah Answerth, missed the biggest game of the year.\n\nThe Lions fielded six players in the 2025 grand final that did not touch the field in last year's triumph over Sydney.\n\nOscar McInerney cruelly missed out on last year's success after dislocating his shoulder the week before. Levi Ashcroft saw his brother be feted across the nation while he waited in the wings at the ground.\n\nAll six — McInerney, Ashcroft, Bruce Reville, Sam Marshall, Ty Gallop and Darcy Gardiner — stood up when it mattered most on Saturday.\n\nHow Lions' win unfolded\n\nLike many grand finals, the early going was a slog, a physical test of wills.\n\nThe first six minutes and 30 seconds saw 15 stoppages. Both sides looked unwilling to take risks.\n\nSuggesting it was a cagey start would be an understatement. The Lions wasted some chances on goal early, while the Cats did not make the most of their significant territorial advantage.\n\nOften this type of start is the first step of a classic to come. At half-time everything was level. Not just the scores at 36 apiece, but also the kicks and handballs were dead level.\n\nHowever, the inside 50s and clearances slightly leaned to the Lions.\n\nThere was a clue to what would happen in the match later on.\n\nGeelong was committed to forcing the ball to the wings in the first quarter, actively avoiding the middle of the ground.\n\nThe Cats were throwing defenders on the edges of the corridor, forcing the Lions to either take risks inboard or to safely kick the ball boundary-side. This took much of the pace out of the contest for both sides, and forced it into Geelong's preferred intercept-heavy game.\n\nThis all changed in the second quarter. The Lions took the game on more through the middle and enjoyed some success. This stretched Geelong's defence out and allowed other avenues to goal as the match progressed.\n\nThe Lions only had one disposal in the centre square when transitioning the ball from defence in the first quarter.\n\nThey managed 15 more across the rest of the match, with the balance happening in the second and third quarters. The Cats only used the corridor out of defence once across the match.\n\nBut the pay-off on the scoreboard was not immediate, and the teams went into half-time all locked up, the first time a grand final had been level at half-time since 1909.\n\nSomething entirely different unfolded, though, after the long break.\n\nThe visitors from up north heralded a scoring procession in the second half, one that rivalled the Demons in the 2021 season decider.\n\nThe Lions kicked nine goals to one to set the match alight and crush Geelong's hopes.\n\nThe insertion of inspirational co-captain Lachie Neale also changed the tone of the grand final. Suddenly, the Lions' strong clearance game picked up, leaving the Cats with more questions than answers.\n\nThe Lions won the clearance count by 15 in the second half and made that difference count on the scoreboard as well.\n\nThe Cats outscored the Lions from clearances 108 to 65 in their previous three encounters this season.\n\nThe Lions flipped the script in the grand final, outscoring the Cats 73 to 29 points. With the final margin being 47 points, those 44 hard-won points were the big difference in the match.\n\nWhere in the first half there had been no space to operate for either side, the Lions found plenty. They found targets streaming into space every time they went forward.\n\nCharlie Cameron, deployed in his old role of deepest forward, had a field day with the impeccable supply from those higher up the ground. He finished with four goals, his most productive return since round 10 in 2024.\n\nThe Lions locked the ball in their front half of the ground after half-time, with the game being played on their territory.\n\nThe Cats could not capitalise when they occasionally managed a foray forward, with their attacking worries exacerbated by the injury sustained by Coleman medallist Jeremy Cameron.\n\nPatrick Dangerfield said he heard Cameron's arm crack in the incident.\n\nBy the time the Cats kicked their second goal of the second half, the grand final was all but over.\n\nAshcroft claims second 'Norm'\n\nThere have only been five winners of more than one Norm Smith Medal, with the exclusive club growing on Saturday.\n\nWill Ashcroft joined Andrew McLeod, Gary Ayres, Dustin Martin and Luke Hodge in winning at least two Norm Smith Medals as best on ground in a grand final.\n\nAshcroft, 21, has long been considered one of the best young players in the game. The word \"young\" can now be removed from that description.\n\nThe Queenslander has established himself as one of the finest big-game players of the current era. He is the youngest to win two Norm Smith Medals in the award's storied history.\n\nAshcroft was everywhere in the victory. He managed career-high figures in clearances, inside 50s, tackles and metres gained.\n\nHe not only won the hard ball for the Lions, but also moved it forward dangerously while defending with aplomb.\n\nAshcroft wins Norm Smith Medal Photo shows Will Ashcroft poses with his Norm Smith Medal and AFL premiership medal. Will Ashcroft claims back-to-back Norm Smith Medals after playing a starring role in the Brisbane Lions' grand final win over Geelong.\n\n\"From top to bottom, everyone puts in so much work. We keep turning up and battling through adversity,\" Ashcroft said during the medal presentation.\n\nAshcroft was far from a lone hand for the Lions.\n\nCo-captain Harris Andrews produced one of the finest displays of his career, controlling the match from down back.\n\nHe acted as a one-man aerial defence system, with five intercept marks forcing the Cats to avoid his part of the ground.\n\nHugh McCluggage also had a day out, gaining more territory than he did in any other match this year. The Allansford product kicked four goals while also providing excellent delivery by foot.\n\n'A bitter pill to swallow'\n\nAs ecstatic as the Lions and the city of Brisbane are now, those down the M1 in Geelong will be disappointed.\n\nThe Cats managed to make the grand final, despite the chips being against them at different stages of the season.\n\n\"To be perfectly frank, there were times [this season] where it just seemed unlikely that we would be able to overcome those obstacles to give ourselves a chance today,\" Scott said.\n\n\"Even without those things, I'd still be really proud of the way our club and our players in particular just keep fronting up.\n\n\"(It) Is a bitter pill to swallow because I think we'd shown that our best footy was going to challenge anyone.\"\n\nThe Cats will have the off-season to reflect on their loss to the Lions. (AAP: Joel Carrett)\n\nThe Cats will be there or thereabouts next year, as they always tend to be.\n\nBrisbane's future looks as bright as it did after last year.\n\nThe Lions are expected to have another highly rated Academy product, Daniel Annable, join the club in the draft.\n\nThey are set to add Sam Draper and Oscar Allen to their tall stocks, strengthening their list even further.\n\nBut for now, the focus is on celebrating their hard-earned achievement before looking at doing it again.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/albanese-offer-trump-critical-minerals/105825654",
        "title": "Albanese coy on critical minerals offer ahead of meeting with Trump",
        "publish_date": "Sun, 28 Sep 2025 00:50:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese won't divulge whether he will take an offering to his long-awaited one-on-one meeting with Donald Trump next month, like other world leaders, but flagged that there will be upcoming negotiations over access to Australia's critical minerals stockpiles.\n\nThe government had previously signalled plans to ramp up the mining and processing of the valuable critical minerals, with the hope it could be leveraged to negotiate exemptions from the Trump administration's trade tariffs.\n\nBut on Sunday, the prime minister would not say exactly what Australia's critical minerals offer to the United States included — nor whether it was exclusive to the Trump administration, after he discussed the issue with his British counterpart.\n\nOther world leaders have gone into their meetings with Mr Trump armed with a significant gesture. British Prime Minister Sir Keir Starmer, for example, went bearing an invitation from the king for a state visit.\n\n\"We will have those negotiations with President Trump in person,\" Mr Albanese told ABC's Insiders on Sunday.\n\nKing Charles and Anthony Albanese during a royal audience engagement at Balmoral Castle. (Supplied: Instagram / @Albomp)\n\n\"Australia has everything that is in demand, almost the entire periodic table, and whether you're looking at lithium, with the reserves that we have, or cobalt, or copper, or vanadium, we have great resources.\"\n\nCritical minerals could end up being part of the AUKUS deal with the US and UK, Mr Albanese said, because the minerals will be required to build defence equipment.\n\n\"One of the things that we want to do is to make sure that we don't just dig things up, our resources, export them, watch someone else value-add, and then import them back at greater prices,\" he said.\n\n\"What we're talking about here is not giving anything to anyone — even our friends. What we are talking about is making sure that we maximise the return to Australia of that.\"\n\nAfter a \"splendid\" lunch with King Charles at Balmoral Castle in Scotland, Mr Albanese also ruled out holding a referendum to make Australia a republic while he is in office.\n\n\"I have made it clear that I wanted to hold one referendum while I was PM and we did that … so one referendum the entire time you are prime minister, we did that,\" he said.\n\nAlbanese to sit down with Trump next month\n\nThe prime minister is scheduled to sit down for his first formal meeting with Mr Trump on October 20, after an earlier attempt on the sidelines of the G20 summit fell over when the president departed early amid the conflict with Iran.\n\nThe pair then had a brief catch-up during a function for world leaders in New York last week, with a smiling selfie from the encounter posted to social media.\n\nBut off the back of the meet and greet, Mr Albanese was coy on what would be discussed when he returns to the US.\n\n\"I need to treat him with the respect that the president of the United States deserves, and I expect that to be returned,\" he said.\n\nDonald Trump imposes 100 per cent tariff on pharmaceuticals from October 1 Photo shows Prescription medicines The United States will impose a 100 per cent tariff on imports of branded or patented pharmaceutical products from October 1, unless a pharmaceutical company is building a manufacturing plant in the US.\n\n\"And certainly, the indications are — we've had five either phone conversations or greetings in person now — and they've all been warm, constructive, positive and optimistic.\"\n\nHe also would not offer his views on Mr Trump's address to the United Nations, in which he urged European nations to follow his lead in cracking down on migration and told leaders, \"your countries are going to hell\".\n\n\"It's not my job to give a critique of other leaders. My job is to govern in Australia's national interest. And part of what we've done is to be strong on borders without being weak on humanity,\" he said.\n\n\"The truth is, that around the world, including in Australia, people want borders to be controlled. They want control over their migration system.\n\n\"That's a way that you build support for migration as well.\"\n\nThe Coalition has accused the prime minister of dropping the ball by failing to meet with the president sooner, and blamed the government for failing to negotiate an exemption to the Trump administration's worldwide trade tariffs.\n\n\"I want to know what Mr Albanese is going to be doing in relation to that, to secure something better for Australians and protect Australian jobs,\" Shadow Foreign Affairs Minister Michaelia Cash told Sky News on Sunday.\n\n\"The relationship in Washington is not strong, and because it's not strong, Mr Albanese is not able to pick up the phone, like other world leaders are able to do, and speak directly to the US president about the impact of his announcements on Australia.\"\n\nMr Trump on Thursday announced a 100 per cent tariff on imports of branded or patented pharmaceutical products from October 1, unless a pharmaceutical company is building a manufacturing plant in the US.\n\nPharmaceutical products are one of the top export markets for Australia to the US, worth about $1.6 billion in 2023-24.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/barramundi-stocking-concerns-at-barra-bash-in-kununurra/105815558",
        "title": "Big barra comp kicks off as leaders seek lake restocking solution",
        "publish_date": "Sun, 28 Sep 2025 00:09:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "On every menu in the town of Kununurra, 3,200 kilometres north of Perth, you will find barramundi, and in every store, you will find fishing supplies.\n\nFishing is the lifeblood of the remote Kimberley town and is put on show every year with the Barra Bash competition.\n\nThe event is Western Australia's largest recreational fishing competition, with more than 1,200 registrations on the first day of this week's event.\n\nDecades of barramundi stocking at Lake Kununurra has led to increased fish sizes. (ABC News: Kelsey Reid)\n\nKeen anglers have four days to reel in the biggest barramundi across the catchment zone, with last year's winning catch coming in at 1.4 metres.\n\nCompetitors are hoping to trump that, with predictions this year's event could see barramundi exceeding 1.5m.\n\nAs the wet season approaches, temperatures routinely push 40 degrees Celsius, and according to event organiser Aaron Macnamara, the barramundi are biting.\n\n\"The only tip I can say is, you gotta be in it to win it,\" he said.\n\n\" If you don't have your line in the water, you've got no chance. \"\n\nAaron Macnamara says the barramundi are biting. (ABC News: Kelsey Reid)\n\nWhy such big barra?\n\nWhen part of the upper Ord River was separated into a man-made freshwater reservoir called Lake Kununurra in 1963, fish migration paths were disrupted and fish stocks gradually declined.\n\nA grassroots campaign in the late 1990s and the newly formed Lake Kununurra Fish Stock Enhancement Group drove plans to reintroduce barramundi into the ecosystem, with hopes recreational fishing would benefit the town.\n\nJuvenile barramundi, known as fingerlings, were bred and introduced into the lake, where the rich environment of warm temperatures and an abundance of food aid rapid fish growth.\n\nSome anglers say the East Kimberley is Australia's premier barramundi fishing region. (ABC News: Kelsey Reid)\n\nOne million juveniles have been introduced into Lake Kununurra in the past decade.\n\nBut the state government cut funding for the fish restocking program in 2023, when Broome's North Regional TAFE aquaculture program and the hatchery which grew the fingerlings shut down.\n\nLake Kununurra Barramundi Restocking Group head Damien Thomas said Lake Kununurra had not been restocked since then, raising concerns about the long-term future of fishing.\n\nDamien Thomas wants to see the restocking program relaunched. (ABC News: Kelsey Reid)\n\nHe said the remoteness of the area made sustaining the restocking program challenging.\n\n\"The Kimberley's twice the size of Victoria, and there's only 40,000 people here, so it's very remote,\" he said.\n\n\"We're just volunteers — we don't have the money stick or the bank account, so really the money's got to come through a joint venture through RecFishWest and the state government.\"\n\nSeeking a stocking solution\n\nIn August, seafood giant Tassal launched a new hatchery in Broome, using it to stock its farm north of Derby.\n\nRecFishWest chief executive Andrew Rowland said he had been speaking with Tassal about supporting barramundi restocking at Lake Kununurra.\n\n\"They're [Tassal] not quite ready to scale up to support the program at this point, but have noted they will be likely to have that conversation in the future,\" he said.\n\nAndrew Rowland wants more state government funding for barramundi stocking. (ABC News: Kelsey Reid)\n\nTassal corporate affairs manager Tom Middleton told the ABC in August that the company would be \"really excited\" to come on board with the program, but that it would require a \"team effort\" from government and stakeholders.\n\nMr Rowland said he had been looking further afield to secure a barramundi supply.\n\n\"We know there's an opportunity to supply barramundi fingerlings out of the Northern Territory, there's a couple of hatcheries there, and we know that the government's gone and had a chat to them, but we are still none too wiser about the results of what's next,\" he said.\n\nWA Fisheries Minister Jackie Jarvis said in a statement the Department of Primary Industries and Regional Development would continue to work with RecFishWest and aquaculture bodies to explore ongoing support of the stocking program.\n\nAustralia's Barra-dise?\n\nShire of Wyndham-East Kimberley planning and management director Nick Allen said the East Kimberley was a top fishing destination and the solitude the area offered was like nowhere else.\n\nNick Allen promotes East Kimberley fishing. (ABC News: Kelsey Reid)\n\n\"Here you can go out and spend three or four days and not see a single boat or camp on a riverbank and not see anyone,\" he said.\n\n\"The quality of fish on offer here is fantastic.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/great-train-rides-rail-journeys-holidays-australia/105808486",
        "title": "Australia's top rail journeys for tourists wanting to take it all in",
        "publish_date": "Sat, 27 Sep 2025 23:46:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Far from the hustle and bustle of the daily commute, Australia's luxury rail journeys take a different, more romantic track.\n\nIt is rail to be enjoyed rather than tolerated: savoured for the trip itself rather than endured between one appointment and the next.\n\nSome of these train adventures are living artefacts which transport their passengers back in time as they shuttle from one heritage station to the next.\n\nOthers are the cross-country equivalent of a luxury ocean cruise, complete with fine dining.\n\nThe Great Southern operates across four states. (Supplied: Stephen Whitaker, Trains Camera Action)\n\nSelf-styled rail fan Stephen Whitaker said rail tourism offered a gentle, relaxed and underrated alternative to air travel for those in no particular hurry to get anywhere.\n\n\"I think the idea of train travel stems back to a time when we weren't necessarily rushed to get to places,\" he said.\n\n\"There was more of an adventure in what we were doing.\n\n\"People refer to it as the romantic period of rail when you had steam trains and the idea of going from Melbourne to Cairns, from a time when the world was less connected.\"\n\nStephen Whitaker is self-confessed train fan. (Supplied: Stephen Whitaker)\n\nMr Whitaker said the social aspect of rail travel was sometimes overlooked by travellers who jetted from one place to the next.\n\n\"It's always been a mode of transport that's very social.\n\n\"In part, that's because you can move around. It's harder to move around an aeroplane and impossible in a car or a coach.\n\n\" You add things like dining carriages and lounge cars and it takes it to a whole new level. \"\n\nThe platinum-level sleeping accommodation offered by the Indian Pacific and The Ghan. (Supplied: Journey Beyond Rail)\n\nBlast from the past\n\nMr Whitaker said rail fans, or trainspotters, had an affection for all forms of rail transport, even the humble suburban commuter types.\n\n\"Don't get me wrong, my friends and I regularly [ride the commuter network] … and you can find a level of enjoyment,\" he said.\n\nHowever, rail for pleasure, whether heritage rail or luxury rail, remained his passion and the predominant interest among his network of rail fans.\n\n\"Almost every state has heritage railways.\n\n\"Commonly, they're run by a bunch of volunteers who've managed to acquire an old steam or diesel locomotive from the railways, spend all their time restoring it and then running it for the joy of it.\n\nPart of the appeal of the Pichi Richi Railway is its diverse fleet of locomotives. (Supplied: Kane Stevenson, Kane's Trains)\n\n\"Some of these run on the main lines, but then you have dedicated heritage groups that have their own tracks. Puffing Billy is a perfect example of that where they run 13.5 kilometres of their own track.\"\n\nThen there is the appeal of long-distance rail like The Ghan or the Indian Pacific, both operated by Journey Beyond Rail.\n\nThe Indian Pacific is considered a sister train of The Ghan. (Supplied: Railfan Network)\n\n\"I think there was a period in Australia where railway companies thought they could compete with air travel, and the reality is you can't really have a train going 800 kilometres per hour,\" Mr Whitaker said.\n\n\" If you look at The Ghan or the Indian Pacific, it's a total experience. It's your hotel, it's your restaurant and it's also your mode of travel. \"\n\nNannette Holliday thinks travel is better on a train than a plane — if you have the time. (Supplied: Nannette Holliday)\n\nFirst-class travel\n\nFreelance international travel writer Nannette Holliday said luxury rail was back in fashion as an alternative to air travel, with most passages booked out well in advance.\n\nShe said Australia's long-distance services were a match for any of the world's great rail journeys.\n\n\"Last year, when I went on the Eastern and Oriental Express when it started up again from Singapore to Malaysia, I compared it with The Ghan,\" Ms Holliday said.\n\n\"The Ghan, the Indian Pacific, the Great Southern: each is a different experience, and you learn about the regions you travel through, not just through the sights and the stops, but also the food and wine you have on board.\n\nLuxury rail services such as The Ghan feature on-board dining. (Supplied: Journey Beyond Rail)\n\n\"If you have a week or so up your sleeve and you want to relax, you are much better off [on a train than a plane].\n\n\"You could be sitting on a train, looking out at the landscape passing by as you are holding a sparkling wine in your hand, chatting to the new friends you have made. It's hard to find anything else like that in Australia.\"\n\nStephen Whitaker's guide to Australia's great railway rides\n\nIndian Pacific\n\nAustralia's longest rail service by distance is the mighty Indian Pacific. (Supplied: Stephen Whitaker, Trains Camera Action)\n\n\"Potentially the most well-known long-distance train in Australia, the Indian Pacific spans the width of Australia, running from Sydney in the east to Perth in the west, with a stop in Adelaide. There's so much to see on this trip, from the run through the Blue Mountains to the wide, open plains of central Australia.\"\n\nThe Ghan\n\nThe Ghan is arguably Australia's most famous train. (Supplied: Kane Stevenson, Kane's Trains)\n\n\"Often thought of as the sister train to the Indian Pacific, The Ghan runs the length of Australia, from Adelaide in the south to Darwin in the north. Running outside the tropical-north wet season, the train is one of contrasts, taking you from the fertile south, through the arid centre, including a stop in Alice Springs, to the tropical north.\"\n\nGreat Southern\n\nThe Great Southern operates between Brisbane and Adelaide. (Supplied: Stephen Whitaker, Trains Camera Action)\n\n\"My favourite train in Australia, by far, is the Great Southern. It only operates over 10 to 12 weeks in summer and is the only passenger train to operate across four states, between Brisbane and Adelaide. This means you'll see all kinds of Australian scenery, from the beaches near Coffs Harbour, the Adelaide Hills and the bright lights of Sydney and Melbourne.\"\n\nPuffing Billy\n\nPuffing Billy Railway was built in 1900 and is a major tourist attraction. (Supplied: Puffing Billy Railway)\n\n\"Probably one of the best known and resourced heritage tourist railways in Australia. It provides a 13.5km journey along dedicated heritage railway through scenic Victorian countryside.\"\n\nSteamrail Victoria\n\nSteamrail Victoria's A2 986 locomotive in outer suburban Melbourne. (Supplied: Anthony Evans, Railtown Productions)\n\n\"Steamrail Victoria operates regular heritage steam, diesel and electric trains across the Victorian rail network. The breadth and quality of its fleet is a credit to this volunteer organisation.\"\n\nTransport Heritage NSW\n\nLocomotive pair 3265 Hunter and 3526 Nanny hard at work between Tamworth and Armidale. (Supplied: Anthony Evans, Railtown Productions)\n\n\"One of the best government-supported heritage programs, operating regular tours throughout the Sydney area.\"\n\nVintage Rail Journeys\n\nVintage Rail Journeys visits part of the mainline network not usually accessible to passenger trains. (Supplied: Stephen Whitaker, Trains Camera Action)\n\n\"Operates regular multi-day tours across regional New South Wales on a restored set of Southern Aurora carriages (the train that used to run between Sydney and Melbourne), hauled by heritage diesel locomotives.\"\n\nKuranda Scenic Railway\n\nA Kuranda Scenic Railway train passing through the Great Dividing Range. (Supplied: Stephen Whitaker, Trains Camera Action)\n\n\"Arguably the most scenic railway in Australia, the trip from Cairns to Kuranda ascends the Great Dividing Range through the Wet Tropics World Heritage Area. The line is over 100 years old and includes many bridges and tunnels.\"\n\nXPT\n\nThe XPT crossing the Nambucca River near Coffs Harbour. (Supplied: Stephen Whitaker, Trains Camera Action)\n\n\"The XPT (Express Passenger Train) services the regional NSW network, travelling as far as Brisbane and Melbourne. These are regular regional services but offer on-train sleeping accommodation.\"\n\nThe Overland\n\nThe Overland travels the 828km line between Melbourne and Adelaide. (Supplied: Railfan Network)\n\n\"The Overland runs once a week in each direction between Melbourne and Adelaide and offers the ability to travel on an all-daylight train between the two cities.\"\n\nPichi Richi Railway\n\nThe Pichi Richi heritage train in outback South Australia. (Supplied: Kane Stevenson, Kane's Trains)\n\n\"The Pichi Richi Railway operates regular steam train services along part of the original Ghan route between Port Augusta and Quorn in South Australia. The railway has an extensive fleet of locomotives and rolling stock.\"\n\nSpirit Of Queensland\n\nThe Spirit of Queensland covers the 1,600km trip from Brisbane to Cairns. (Supplied: Stephen Whitaker, Trains Camera Action)\n\n\"The replacement for the famous Sunlander, operating between Brisbane and Cairns. It is formed by a Diesel Tilt Train which can reach speeds of 160kph. A ride on the Spirit of Queensland is a great way to see the variety of coastal cities and towns.\"\n\nInlander/Westlander/Spirit Of The Outback\n\nThe Westlander is operated by Queensland Rail on its Main and Western lines. (Supplied: Stephen Whitaker, Trains Camera Action)\n\n\"Other long-distance services operated by Queensland Rail. The Inlander runs the 977km between Townsville and Mount Isa, the Westlander tracks the 777km between Brisbane and Charleville, while the Spirit of the Outback travels 1,325km between Brisbane and Longreach.\"\n\nGulflander/Savannahlander\n\nThe Gulflander operates between Normanton and Croydon. (Supplied: Stephen Whitaker, Trains Camera Action)\n\n\"The Gulflander is billed as a journey from 'nowhere to nowhere'. These two similar services tour north Queensland's Gulf and Savannah country.\"\n\nWest Coast Wilderness Railway\n\nWest Coast Wilderness Railway's Abt locomotive. (Supplied: Mikhala Graham, Railfan Network)\n\n\"A uniquely Tasmanian heritage experience through the stunning Tasmanian World Heritage Wilderness Area.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/where-to-watch-movies-tv-for-free/105809908",
        "title": "No more streaming fees, these films and TV series are free to watch",
        "publish_date": "Sat, 27 Sep 2025 23:38:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Last year Aussies spent on average $63 per month on streaming services, according to Deloitte's Media and Entertainment Consumer Insights report.\n\nIn the months since that report dropped, streamers Apple+, Netflix, Stan, Kayo and Disney+ have all hit subscribers with a fee hike.\n\nBut there is a better way.\n\nThere is a whole treasure trove of film and TV streaming right now that you can access FOR FREE — if you know where to look.\n\nWe've done the hard yards, sifting through three free Australian streaming services — iview, SBSonDemand and Brollie — to bring you the cream of the crop.\n\nFamily\n\nLooney Tunes Back in Action The human and cartoon characters in Looney Tunes: Back in Action ( ) Watching this wacky live-action/animation 20 years from its release date is a wildly entertaining experience. Carrying the spirit of Who Framed Roger Rabbit, get ready to see peak action hero-era Brendan Fraser as a flailing stuntman paired with Bugs and Daffy to save the world from money-grubbing ACME CEO Mr Chairman (Steve Martin at peak silliness). None of it makes a huge amount of sense but that's the beauty of Looney Tunes! Back in Action is a goofy, absurd and wonderfully funny way to spend an afternoon. Trailer Where to watch: iview Paddington & Paddington 2 British actor Ben Whishaw provides the voice for Paddington in the theatrical films. ( ) This is the perfect double feature to keep the family enthralled and happy for at least three hours. Paddington could have been a capitalisation of a beloved brand, but it resulted in a sweet, smart, heartwarming adaptation under the deft guidance of director and co-writer Paul King (also the director behind all of The Mighty Boosh). Then, against all the traditional sequel expectations, King went and one-upped himself with Paddington 2, due to the inclusion of the ultimate cartoon villain and Paddington foil, Phoenix Buchanan (Hugh Grant, in one of his finest performances). For a couple of years, Paddington 2 was the most positively reviewed film on Rotten Tomatoes — ranking even higher than revered films like Citizen Kane. So really, you're doing yourself and your family a favour by appreciating these modern classics. Trailer Where to watch: iview Gremlins The mogwai of 1984 Christmas horror/comedy Gremlins may look cute... but don't feed them after midnight! ( ) If you have a sprog that's ready to dip their toe into the world of horror, then look no further than this 80s classic. Helmed by legendary director Chris Columbus (Home Alone, Harry Potter 1 & 2), Gremlins sees a dad give his kid a mysterious furry friend for Christmas. Mogwais are cute and cuddly but break one of their rules of care and watch them turn into scaly monsters. With just the right amount of fright to ignite the fire of any young horror lover, you don't have to wait until the festive season to tear into Gremlins. Trailer Where to watch: SBSonDemand\n\nComedy\n\nYour Monster Film still from Your Monster (2024) featuring Tommy Dewey ( ) From fishmen to zombies, women have been falling in love with film \"monsters\" for decades but none of them have been quite as fun and cathartic as Caroline Lindy's Your Monster. Timid Laura (Melissa Barrera) is forced to move back to her childhood home following a cancer diagnosis and a brutal, mid-treatment dumping from her dirtbag director boyfriend. Upon her return, she discovers Monster (Tommy Dewey, plastered in prosthetics) is taking up residence in the closet. Instead of devouring her whole, Monster teaches Laura how to harness her anger and their relationship turns romantic. Electrified by Barrera's stand-out performance, Your Monster is the Beauty and the Beast re-telling you never knew you needed. Trailer Where to watch: SBSonDemand Game Night Jason Bateman and Rachel McAdams in Game Night ( ) This 2018 gem suffers from bad title syndrome, as Game Night doesn't accurately describe the twisty hijinks that are expertly executed by directors John Francis Daley and Jonathan Goldstein. Max (Jason Bateman) and Annie (Rachel McAdams) are a couple connected by their love of charades and trivia. Their game night group is thrown into disarray when a treasure hunt created by Max's showboating brother goes awry. There are lots of incredible comedic performances but Jesse Plemons, more recognisable for his dramatic work in films like Alex Garland's Civil War, absolutely runs away with the show as monotonous cop, Gary. Trailer Where to watch: iview Ghosts The cast of UK sitcom Ghosts. ( ) This UK sitcom is such a winner that it's been replicated in five different countries (including an Australian version to be released very soon!). After a donk on the head, Alison (Charlotte Ritchie) is able to see the many ghosts that haunt her recently inherited country mansion — and the ghosts are just so excited to have someone new to talk to. Created by and starring comedy collective Them There (you might know them as the team behind Horrible Histories), Ghosts is one of the finest ensemble casts of the 21st century, just don't be surprised if you shed a few sentimental tears between the roaring laughter. Trailer Where to watch: iview\n\nAustralian\n\nSweetie Karen Colston in Jane Campion's debut feature film Sweetie. ( ) Anyone who has had to overcome extreme frustration to keep the family unit chugging along will relate to the interpersonal drama in Sweetie. When Dawn, nicknamed somewhat sarcastically by her family as Sweetie, returns home, her mother, father and sister's lives are thrown even more into dysfunction as they attempt to placate Sweetie's swinging outbursts. Jane Campion's debut feature sets in motion the New Zealand filmmaker's focus on complex and misunderstood female protagonists. It's thrilling to see Campion's mysterious and sometimes surreal visual taste, which would see her win two Oscars, bubble through in her first stab at a feature film. Trailer Where to watch: iview Big Backyard Quiz Hosts and contestants on Big Backyard Quiz ( ) Gather the fam, there's a FULL 10-EPISODE season of Big Backyard Quiz to spark the competitive urges. Following on from the last year's delightful NITV special, BBQ is expertly helmed by presenter Narelda Jacobs and comedian/poet Steven Oliver who crackle wonderfully together as co-hosts. A revolving door of Australia's best comedians, actors and artists are put to the test on their knowledge on First Nation's history and food in between interactive games. Two teams are captained by Indigenous stars like Shari Sebbens, Dave Woodhead and even Ernie Dingo, allowing for some hilarious back and forth between the hosts and the non-Indigenous contestants. Funny AND educational, what more could you want? Trailer Where to watch: SBSonDemand Sweat Heath Ledger in Sweat ( ) Can we interest you in a little hardcore Australian nostalgia courtesy of one-season-wonder sports drama Sweat? Over 26 episodes, viewers are invited into the high-pressure world of Sports West Academy, an extremely competitive school for the most talented burgeoning athletic stars. The full season is very consumable in a binge-watch format due to the combination of hot people and soap opera-level drama. But the real hook is getting to watch a then-unknown teenage Heath Ledger act his little heart out as country-boy cyclist Snowy Bowles (yes, really), who must grapple with coming out to his teammates. Filmed in and around some of Perth's most recognisable landmarks, Sweat harks back to the golden days of Australian teen melodrama. Trailer Where to watch: Brollie\n\nSurprise me",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/10-year-old-mini-bull-rider-competes-at-world-finals-in-utah-us/105817314",
        "title": "Small bull rider with a 'big heart' takes on the world's best",
        "publish_date": "Sat, 27 Sep 2025 23:02:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "In a huge dark hat and shining belt buckle, this 10-year-old kid from Kowanyama knows what he loves.\n\nFrom one of Queensland's most remote towns, on the west coast of Cape York, Carl Douglas Jr has heard the enticing roar of a rodeo crowd in Utah in the west of the United States.\n\nThe pint-sized champion loves riding mini bulls, and he can now say he has done it in front of the world.\n\nStarting in the sport only two years ago, he quickly proved himself a talent in the ring, winning medals around the Queensland circuit.\n\nCarl placed third in the junior IMBA World Finals and seventh overall. (Supplied: Curtis Jensen, Bullseye Imaging)\n\nIt was at one of these regional rodeos that Carl was spotted and chosen to represent Australia on the global stage at the International Mini Bull Riding Association World Finals.\n\nWith the support of his town, Carl and his parents made the long journey from their home, 600 kilometres north-west of Cairns, to Utah earlier this month.\n\nHis father, Carl Douglas Snr, was a bronco rider himself back in the day, and said it was an incredible experience not just for his family but for the eight other children chosen to compete from across the country.\n\n\"In Australia it's small, but when you get over there on the other side of the world, the things are bigger, there's more riders … it was eye-catching,\" he said.\n\nLoading...\n\n'He can ride these American bulls'\n\nCarl Jr is a softly spoken but confident boy who knows just what pose to strike with his cowboy shirt and shades.\n\nHe said the US rodeo scene was \"strange\" to him, but he still found it easy to focus.\n\nCarl's parents, Valma Beatrice Lawrence and Carl Douglas Snr, travelled with him to Utah. (ABC Far North: Holly Richardson)\n\n\"Much more crowded and more riders,\" he said.\n\n\" [I] could feel everybody shouting. \"\n\nHis mother, Valma Beatrice Lawrence, said despite watching Carl Jr enter the ring many times, the American bulls made her nervous.\n\n\"My heart was pounding and I didn't know what to do and I just sort of sat there and I prayed for him while I was sitting there,\" she said.\n\n\"Then when I saw him come out on this bull, I thought, 'Oh, he can ride these American bulls', and he did … he did really well.\"\n\nCarl placed third in the International Mini Bull Riding Association's junior finals and seventh overall.\n\nCarl was one of nine Australian children who travelled to Utah to compete. (ABC Far North: Holly Richardson)\n\nJumping on with a big heart\n\nThe love of the sport also bonded Carl with other kids from around the world.\n\n\"It was something very special for us to see, and it was heart-touching,\" Ms Lawrence said.\n\nShe said the kids would see each other every day and share yarns about bulls and life back home.\n\nThe Kowanyama community threw a welcome-home parade for Carl. (Supplied: Kowanyama Council)\n\nAside from the rides and games at the championship, Carl Jr said meeting the other competitors and building his passion for the sport were highlights on the trip.\n\n\"I felt good, just got to focus on riding and jump on with a big heart,\" he said.\n\n\"I told them I was from Australia and I'm a bull rider … I love riding bulls.\"\n\nWhen he returned to Kowanyama, his hometown put on a welcome parade.\n\nAnd Carl is already looking forward to the next time he is back in the ring.\n\n\"I'll do it for the rest of my life.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/oasis-morning-glory-30-years-anniversary-review-reunion/105816312",
        "title": "Oasis's 'biblical' reunion is largely thanks to this blockbuster album",
        "publish_date": "Sat, 27 Sep 2025 23:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Unless this is your first day on the internet, you've no doubt noticed Britpop-era icons Oasis are back together, playing their first shows in 16 years.\n\nThe tour has already netted an estimated £400 million ($815 million) before arriving in Australia in late October.\n\nContemporaries like Blur, Pulp, Suede, and Supergrass have all experienced their own revivals or remained active, but few seem to have captured the current moment quite like Oasis.\n\n\"Biblical\", as the band and their fans would put it.\n\nIt is a successful comeback that has drawn much excitement. But also, derision.\n\nReappraisal of Oasis's legacy has caused some to wonder if they were really all that great to begin with, largely amounting to 'What if The Beatles were football hooligans?'\n\nAn op-ed in The Guardian called them \"the most damaging pop cultural force in recent British history\", blaming the Gallagher brothers' \"knuckle-dragging ideas on sexuality and politics\" for the crime of setting back social attitudes, presaging Brexit and conservative nationalism.\n\nThe Gallagher brothers at the first Oasis reunion concert on Friday, July 4, 2025, in Cardiff. (AP: Scott A Garfitt/Invision )\n\nIndeed, the brothers' droll, foul-mouthed way with words was glamorised by tabloids, earning a reputation as large as their chart-busting songs that helped define the '90s.\n\nOf all the reasons people are so ecstatic about an Oasis reunion, a good number of them can be found on the group's best-selling second album, (What's The Story) Morning Glory?, released 30 years ago this week.\n\nThere is, of course, the inescapable Wonderwall, the epic Champagne Supernova, the swaggering Roll With It, and swooning Don't Look Back In Anger — an instant classic inspired by a snippet of John Lennon conversation and a nod to his famous solo single.\n\n\"Aren't those two chords the same as Imagine? No shit,\" Noel Gallagher once remarked, engaged in a mock exchange with an imaginary cynic.\n\n\" 'You can't do that!?' I can and I will. And I have. And you'll buy it, so f*** off. \"\n\nLove him or loathe him, he was absolutely right.\n\nA Britpop blockbuster\n\nDespite a muted reaction from the music press, decrying the follow-up to 1994's raw debut Definitely Maybe as generic, laddish, lazy, and \"phoney Beatlemania\", Morning Glory was hugely popular.\n\nIt wasn't just a hit. It was the fastest-selling album in the UK since Michael Jackson's Bad, eventually shifting more than 23 million copies worldwide.\n\n\"There was that moment where … we were number one in the singles [and] albums charts, consecutively for weeks,\" said Noel Gallagher.\n\n\" That was the kind of shit I dreamt about when I was at school, do you know what I mean? \"\n\nOasis's Noel Gallagher performing live in front of 40,000 fans on April 27, 1996, in Manchester. (Reuters)\n\nThe album spent five weeks atop the Australian charts and has since gone eight-times Platinum, its influence audible in Australian acts ranging from Jet and The Superjesus to DMA'S and Middle Kids.\n\n\"Nobody had any f***ing idea what was going to happen. I wrote the songs; I was more surprised than anyone,\" remarked Gallagher.\n\n\"I've said it many, many times, but if I had known then what I know now about just what Wonderwall would become, or Don't Look Back In Anger, I'd never finish those songs. I'd still be fiddling around with it.\"\n\nIf anything, the guitarist-songwriter was anticipating a poor reception from critics, who chastised the pivot towards beer-y balladry and big, pop-friendly choruses.\n\n\" It didn't get one good review … We were kind of waiting for that because most people, our record company included, were expecting Definitely Maybe Part Two. \"\n\nThe outcome was an added surprise for British media, who only a few months earlier had fuelled a rivalry between Oasis and Blur, capitalising on 'Cool Britannia' and updating the 'Rolling Stones vs Beatles' chart face-off for the '90s.\n\nDubbed the 'Battle of Britpop', it saw London's artsy, middle-class Blur pitted against Manchester's working-class Gallagher brothers, each releasing singles from their respective upcoming albums on the same day: August 14, 1995.\n\nBlur's Country House would beat Roll With It to number one. Oasis may have lost the battle, but (What's The Story) Morning Glory? won them the war.\n\nBigger and better\n\nDefinitely Maybe introduced Oasis as the most exciting British band of the '90s, a Manchester quintet using rock'n'roll as their ticket out of their ordinary existence.\n\n(What's The Story) Morning Glory? made them massive worldwide. An unapologetic pitch for global domination stocked with stadium-sized anthems with mass appeal that drew on familiar sources.\n\nAs Gallagher noted in a 1996 interview with Rolling Stone:\n\n\" The first album is about dreaming of being a pop star in a band. The second album is about actually being a pop star in a band. \"\n\nMorning Glory has the vitality and attitude of its predecessor, but the gestures are grander, with a wide-screen sonic sensibility that capitalised on Noel Gallagher's blossoming abilities as a songwriter, expanding into more intricate arrangements and surprisingly sensitive territory.\n\nThe melancholy Cast No Shadow features some of his most elegant and vulnerable lyrics, inspired by The Verve's Richard Ashcroft (who opened Oasis's comeback shows in the UK and Ireland) and riffing on chords from Pink Floyd's Wish You Were Here.\n\nThe cello-assisted yearning of Wonderwall and piano-led Don't Look Back In Anger possessed a timeless quality. Sure enough, 30 years on, they're both deathless hits.\n\nLoading Instagram content\n\nBeyond the over-saturated singles, the rest of Morning Glory can still thrill.\n\nThe title track is a reminder that Oasis could rock — a maelstrom of wailing guitars signalled by a helicopter before Liam Gallagher's delivery of one of the great couplets about cocaine power fantasies ever penned:\n\n\" All your dreams are made/When you're chained to the mirror and the razor blade. \"\n\nRoll With It and the whimsical She's Electric are perfect examples of Beatles songs \"played with the attitude of The Rolling Stones and the volume of The Who,\" as ABC writer Matt Neal put it.\n\nMeanwhile, The Jam frontman and Modfather himself, Paul Weller, played harmonica on the stormy Swamp Song instrumental interludes, and searing guitar histrionics on the epic curtain-closer Champagne Supernova.\n\n\"Thank God he did,\" Noel Gallagher reflected. \"It was crying out for a guitar solo because mine was a shocker.\"\n\nHe had held a similarly self-deprecating streak towards his songwriting abilities.\n\n\"Everything that I do is a nod to something or other. I'm not a genius. I'm a fan of music. Paul McCartney's a genius, and Morrissey and Bob Dylan. I'm just fans of theirs.\n\n\" I've got a good knack of putting shit together but I'm not a snob about where it comes from. I'll tell you. Nothing is original, there's only 12 notes anyway. \"\n\nThat self-awareness belies Gallagher's talent for siphoning decades of British rock fanaticism — from The Kinks through to The Smiths and The Stone Roses — into a proverbial sonic trifle that was at once familiar but boasted a distinctive flavour.\n\nSibling chemistry\n\nResponding to his elder brother's growth, Liam Gallagher upped the ante on his already commanding vocal sneer.\n\nLiam Gallagher's vocals were \"f***ing on another level on that record,\" his brother Noel remarked in 2020. (Dave Hunt, file photo: AAP)\n\nHis instantly recognisable mix of unimpeachable bravado, charisma and yearning resulted in some of the most memorable rock vocal performances of his, or anyone's career.\n\nEspecially on Wonderwall, its name taken from a lesser-known George Harrison album and originally dedicated to Noel's ex-wife, Meg Matthews.\n\nWho else could bring such conviction and sense of drama to lyrics whose own author was quick to dismiss as meaningless?\n\n\"You know, people have said that to me down the years, 'What does 'slowly walking down the hall faster than a cannonball mean?'\" Noel Gallagher said in his Take 5 with Zan Rowe, illuminating an important comparison between Champagne Supernova and I Am The Walrus by The Beatles.\n\n\"I'm like 'take enough drugs you'll know what it means'. Sitting on a cornflake? Yeah, I've sat on many a cornflake.\"\n\nBeyond the hedonism, Gallagher's songwriting is less about meaning than it is about mood and magnetic simplicity.\n\nLoading Instagram content\n\nDon't Look Back In Anger, Some Might Say, Wonderwall, Champagne Supernova — these songs feel pregnant with importance, even if ultimately, they're apocryphal.\n\nThey gesture at something thoughtful without being profound, which, for better or worse, has proven to resonate with a broad audience.\n\nJust ask the band's resident 'man on the street', Liam Gallagher: the boorish, extroverted yin to Noel's relatively understated yang.\n\nDespite their in-fighting, he clearly relished his elder brother's bar stool philosophy and bulletproof melodies that played to his strength as a vocalist.\n\nRecording a classic\n\nHaving already recorded and released Some Might Say in April 1995 (which topped the charts months before the 'Battle of Britpop'), in May, Oasis decamped to Rockfield Studios, a former dairy farm situated in the Welsh countryside of Monmouth.\n\nThey were booked in for six weeks but ended up finishing the album in less than half that time.\n\n\"We worked hard. I think it was 12 business days,\" Noel Gallagher remembers.\n\nHe'd been boasting to journos as early as Definitely Maybe's release that he'd already written songs for a follow-up. In truth, there was the makings of half an album.\n\nOasis (from left): Liam Gallagher, Paul McGuigan, Paul \"Bonehead\" Arthurs, Alan White, Noel Gallagher in November 1995 outside Earls Court, London, touring (What's The Story) Morning Glory? (Oasis: Facebook)\n\n\"Half the songs have got a second verse — they were all written before I got [there]. And the rest of the songs, it's just the first verse twice,\" he recalls. \"That was me getting in here and going 'oh well, f*** it'.\n\n\"You're just working on instinct because you don't second-guess anything when you're young.\"\n\nThat sense of vigour and audacious machismo was all over the album, which reunited the band with producer Owen Morris.\n\n\"In the first five days we'd recorded Roll With It, Hello, Wonderwall, Don't Look Back In Anger and Champagne Supernova,\" he told Q Magazine in 2011.\n\nThe most productive week in Britpop history?\n\nWhy we still love Wonderwall Photo shows Liam Gallagher looks at the camera in a black jacket A quarter century after its release, why does Wonderwall still speak to so many people?\n\nA feat made more remarkable considering the band hit the decks only a week after recruiting drummer Alan White (replacing Tony McCarroll), who swiftly found his place in the group dynamic.\n\n\"I soon cottoned on,\" White told Q Magazine. \"I was the Cockney c**t and they were the Manc f***ers. As a kind of family unit, it felt really good.\"\n\nThe same can't be said for the Gallaghers, whose infamous sibling rivalry inevitably reared its head and temporarily brought sessions to a grinding halt.\n\nWhereas Noel was laser-focused on overcoming difficult second album syndrome, staying up late working on mixes, and nailing the perfect take, Liam would quickly hammer out his vocal takes and become bored.\n\n\"There was loads of pubs in town that we'd heard were good,\" he said in a 2020 Rockfield documentary.\n\n\" It was like 'get in there and f***in' smash it out and then f***in' pub'! \"\n\nThe night that nearly broke Oasis\n\nAfter one particularly heavy drinking excursion, Liam invited a 20-strong entourage — \"a load of f***ing idiots back from the local village,\" according to Noel — for a party back at the studio's on-site accommodation.\n\nThat included members of British grunge band Cable, who began winding Liam up. Things turned sour, and drunken fisticuffs ensued, which only escalated once Noel returned from recording to the scene.\n\nLiam remembers his brother's fury: \"'What you doing bringing people back when we're working?!' And I get it but …\n\n\"My argument would be: What are you doing f***ing taking 900 f***ing takes to f***ing do one guitar when you should be in the f***ing pub with me? You know what I mean? Entertaining me?\"\n\nThe ensuing brawl involved air rifles, a cricket bat, a tossed rubbish bin, £800 in property damage, and Liam shouting obscenities after Noel as White drove him back to London.\n\nThe future of the band, let alone the album, was uncertain.\n\n\"Me and our kid [Noel] had a bit of a scuffle,\" Gallagher junior told Q Magazine in 2011.\n\n\"I went home with a broken arm, broken leg and a shotgun on me shoulder, and me mum goes 'What kind of f***in' music are you making down there!?'\n\nThe brothers didn't show up at the studio the following week.\n\n\"People felt they might not finish the album, for sure,\" Oasis photographer Michael Spencer Jones told BBC. \"It was a serious falling out … on another level.\"\n\nIt's widely regarded as one of the worst conflicts in a very long list of volcanic Gallagher clashes.\n\nBut that same tension is deeply intertwined with what many consider Oasis's finest musical hour, a toxic chemistry that's, weirdly, also a winning formula.\n\n\"That's the story of the band's life really. It'd sort of be good one minute and then it'd be chaotic the next,\" says Liam.\n\nAfter almost 10 days, and some delicate behind-the-scenes diplomacy, the Gallaghers decided not to look back in anger.\n\nThe band reconvened at Rockfield and finished off recording She's Electric, Cast No Shadow, Hey Now, and Morning Glory.\n\n\"That second session was the best, easiest, least fraught, most happily creative time I've ever had in a recording studio,\" Morris recalled.\n\nNoel Gallagher was \"furious\" when he first saw the cover for (What's The Story) Morning Glory? It was shot in London's Berwick Street. (Oasis: Michael Spencer Jones)\n\nOasis ended up having songs to spare, recording several B-sides that — in Noel Gallagher's own estimation — were \"good enough to launch any band's career.\"\n\nAcquiesce, Talk Tonight, Headshrinker, Rockin' Chair, Underneath The Sky, and The Masterplan: all fan favourites that featured on a compilation, also titled The Masterplan, that many consider ranks alongside the first two studio albums as Oasis's best work.\n\nIn retrospect, Gallagher believes it was his most fruitful creative period.\n\n\"The Masterplan' might've been the last of the f***in' great culturally significant songs that I wrote,\" he said in 2020.\n\nLive forever\n\nIn 1996, Oasis headlined two historic concerts at Knebworth, England, to more than 250,000 fans — some of the biggest concerts in British history.\n\n\" Nothing was ever the same after that,\" remarks Gallagher. \"Then the money came in and all f***ing hell broke loose. \"\n\nBe Here Now, the band's third album, was released in August 1997 to rave reviews (from critics who'd learned to save face after slagging off its predecessor). It became Britain's fastest-selling album ever, but swiftly denounced as a disappointment.\n\nThe long, indulgent \"sound of five men in the studio, on coke, not giving a f***,\" as Noel Gallagher put it in the 2003 Britpop documentary Live Forever.\n\nLoading...\n\nLiam, on the other hand, thought \"it was f***ing great, and I still think it's great. It just wasn't Morning Glory.\"\n\nIndeed. Be Here Now was considered rock-bottom because Morning Glory is credited as being Britpop's pinnacle, the barometer by which Oasis was subsequently measured.\n\nTheir 2000s records contained flashes of brilliance but began to sound tired, bloated, and struggling to reach the rarefied heights of their earlier output.\n\nOasis always acted as if they were invincible, but (What's The Story) Morning Glory? marked the point they were legitimately unstoppable.\n\n\"We'd made it, we got to the top of the mountain and we were treated like The Jam and The Beatles,\" reflected Gallagher.\n\nNow, 30 years later, Oasis is enjoying the fairytale rock narrative the Fab Four never got to: the reunion.\n\nAs polarising as the Gallaghers and their graceless public personas could be, the music they made as Oasis possessed a magnetism that brought audiences together.\n\nJust ask the social media users sharing in the opposite of Schadenfreude in seeing the long-feuding Gallaghers seemingly enjoying each other's company on stage again.\n\nWitness the crowds of people singing along word for passionate word. And it isn't just aging Millennials in football jerseys and bucket hats but younger fans belting out classics that have outlived their '90s origins.\n\nIs this collective evidence that Oasis really is the long-touted 'People's Band' after all? Not maybe. Definitely.\n\n\"The people that made [the greatest] records, they're not making them for journalists,\" Noel Gallagher remarked around Morning Glory's 25th anniversary.\n\n\"They're making them for the people, and the people decide what's hot [and] what is not. And that's it, the end.\"\n\nListen to Double J's Classic Albums for more stories behind the best records of all time.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/world-para-swimming-championships-australia-wins-relay-gold/105825652",
        "title": "Aussies ice World Para Swimming Championships with relay gold",
        "publish_date": "Sat, 27 Sep 2025 22:54:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia has claimed its ninth gold medal at the World Para Swimming Championships on the final day of competition in Singapore.\n\nLex Leary, Rowan Crothers, Chloe Osborn and Callum Simpson teamed up to claim victory in the mixed 4x100 metres freestyle relay (34 points), setting a world record in the process.\n\nThe Australian quartet stopped the clock in 3 minutes and 58.40 seconds, finishing ahead of China and France.\n\nThe triumph meant Australia claimed 26 medals across the world titles, having also won nine silver and eight bronze medals.\n\nAustralia finished seventh on the medal tally.\n\n\"Singapore was a successful campaign, especially by our measure of success for individual performance,\" Australia's head coach, Mel Tantrum, said.\n\n\"In comparison, Manchester 2023 was our most successful world champs campaign in a decade, in terms of individual gold medals with eight, and we have equalled that.\n\n\"We have a good mix of youth and experience, and our performance measures are being met.\"\n\nAustralia also won three silver medals and a bronze on the final day of competition.\n\nLeary and Osborn finished second in the respective women's 50m (S9) and 100m freestyle (S7) events, while Thomas Gallagher was runner-up in the men's 100m backstroke (S10).\n\nRachael Watson collected the bronze in the women's 100m freestyle (S3).\n\nSimpson left the meet with three golds, one silver, and a bronze.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/jindabyne-short-term-rentals-high-prices-tourism-snow/105761672",
        "title": "Snow town struggles as high housing prices force residents out",
        "publish_date": "Sat, 27 Sep 2025 22:42:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Charlie Steinbacher knows how his town changes in winter, when crowds of avid snow goers flock to the ski slopes.\n\n\"Winter versus summer is like chalk and cheese,\" the born-and-raised Jindabyne resident said.\n\n\" Our population grows almost tenfold. \"\n\nJindabyne is the base town of the New South Wales ski resorts.\n\nIt has a population of about 4,000 people but explodes with tourists during winter.\n\nMost of the tourists travelling to Jindabyne are chasing the snow season. (ABC South East NSW: Floss Adams)\n\nMore than 380,000 people travelled to the Snowy Mountains region between July and September in 2024 alone, according to Destination NSW.\n\nAbout one-quarter of Jindabyne's 2,900 homes are short-term rental accommodation.\n\nMr Steinbacher, who runs an indoor rock-climbing business in Jindabyne, said he had been priced out of town.\n\nCharlie Steinbacher says the dream of owning a home is challenging to achieve. (ABC South East NSW: Floss Adams)\n\n\"Everyone would love to own a home in Jindabyne where we all grew up, but it's just not really viable,\" he said.\n\n\" There's a lot of houses that just sit vacant for most of the year because they can make so much money through the winter. \"\n\nLocals priced out\n\nMr Steinbacher moved to Berridale, 30 minutes away, last year, joining a cohort of young locals.\n\nThe average house in Jindabyne is on the market for more than $1.1 million and median unit rents have increased by nearly 85 per cent in the past five years.\n\nThe median house price has increased by $300,000 since 2020 and is now double that of 15 years ago, according to housing data analysts Cotality.\n\nUnit prices have nearly tripled since 2010.\n\nNancy Gant-Thompson has lived in Jindabyne since the 1980s. (ABC South East NSW: Floss Adams)\n\nNancy Gant-Thompson owns her home but hosts a ski instructor as a boarder each winter to afford heating.\n\n\"I really couldn't survive winter here if I didn't have some additional income,\" she said.\n\n\"It's either a choice of downsizing … or sharing your accommodation and your home with people.\"\n\nNancy Gant-Thompson takes on a boarder every winter to afford to heat her home. (ABC South East NSW: Floss Adams)\n\nMs Gant-Thompson said she knew of many older people who moved to Canberra because of Jindabyne's high prices.\n\nIt is a regular source of conversation at Country Women's Association meetings.\n\n\"There's not a lot of places available for rent,\" member Dale Whitfield said.\n\n\" I know there's quite a lot of families whose kids have had to move away from the area. \"\n\nDale Whitfield and Toni Clarke talk about housing struggles at the CWA. (ABC South East NSW: Floss Adams)\n\nThe NSW government announced in 2019 that it would create the Snowy Mountains Special Activation Precinct, a 40-year plan to grow year-round tourism and housing stock in the region.\n\nThe Department of Primary Industries and Regional Development told the ABC the government acquired land in Jindabyne near the Southern Connector Road corridor in 2024 that could \"offer an additional 500 dwellings\" over the next 20 years.\n\nIt said the \"masterplan\" for the future of Jindabyne would aim \"to increase the variety of housing available\" and improve supply and affordability.\n\nShort-term rental review\n\nThe state government is reviewing short-term rental accommodation.\n\nSnowy Monaro Regional Council made a submission to the review, raising concerns about the impacts of short-term rentals on housing affordability but noting tourism benefits.\n\n\"It is essential for the continued growth and vitality of the town that Jindabyne continues to provide tourist accommodation,\" the council submission read.\n\nJindabyne has one of the highest rates of short-term rentals in NSW. (ABC South East NSW: Floss Adams)\n\nThe government said it was investigating the submissions ahead of proposing sector reforms.\n\nIt comes a year after it implemented a 60-day cap on short-term rentals in Byron Bay to increase the supply of long-term rentals.\n\nProperty manager and real estate agent Joan Bird said she did not think the cap system would work in Jindabyne, as owners used the properties as holiday homes themselves.\n\n\"They want to be able to use those properties themselves, be it summer or winter, and the way to help up-front those costs is on short-term rentals,\" she said.\n\nJoan Bird says people should not be discouraged from hosting accommodation. (ABC South East NSW: Floss Adams)\n\n'Location, location, location''\n\nMs Bird called on the nearby snow resorts to develop more worker accommodation to alleviate pressure on the rental market.\n\nThe resorts combined bring in thousands of workers each winter season, many of whom stay in Jindabyne.\n\nHundreds of thousands of tourists travel to the Snowy Mountains each winter. (ABC South East NSW: Floss Adams)\n\nThredbo Resort told the ABC it hired 900 seasonal staff for the winter period and leased 270 beds in Jindabyne \"which are sourced both privately and through local real estate agencies\".\n\nIt purchased a property within the resort to expand staff housing in 2023, adding 60 beds to its stock.\n\nPerisher said it offered staff accommodation on the mountain, at dedicated staff accommodation in Jindabyne, and \"in limited volumes of private accommodation\" in the region.\n\nThe company did not disclose specific staffing or property details or figures.\n\nJindabyne is the most expensive location in the NSW Snowy Mountains. (ABC South East NSW: Floss Adams)\n\nMr Steinbacher said despite being priced out of Jindabyne, his business kept him committed to the area.\n\n\"I have made a pretty big investment in the area, and I just hope that things change and that maybe one day I can afford to buy a home here,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/rod-barwick-daffodil-breeder-glenbrook-bulb-farm/105803774",
        "title": "A daffodil cross that 'wasn't meant to be achieved' made Rod Barwick famous",
        "publish_date": "Sat, 27 Sep 2025 22:21:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Growing up in Hobart's northern outskirts, Rod Barwick felt he did not fit in with his own family.\n\n\"I was not the person that my family would have dreamed of. I was not the person that many of the local community would have expected,\" Mr Barwick said.\n\n\"I realised that I would probably need to find another life for myself.\"\n\nThat life soon became one of daffodils, a passion that has never left him.\n\nRod Barwick's passion for daffodils started in the 1970s. (ABC News: Loretta Lohberger)\n\nAs a 19-year-old, Mr Barwick was working in an office at the then-Electrolytic Zinc Company (EZ) in Lutana.\n\n\"On the way on the train each day I used to buy a garden magazine and for me, in many ways, that was a move into the fantasy,\" he said.\n\n\"From a garden magazine, at the beginning of 1972, I bought some collections of daffodils — that is now 54 years ago — and those bulbs grew well for me.\"\n\nRod Barwick says the most important thing is to enjoy growing flowers. (ABC News: Loretta Lohberger)\n\nDaffodil crosses named after detectives\n\nThree years after buying his first bulbs, Mr Barwick started reading about plants and plant breeding.\n\n\"I actually did a cross that wasn't meant to be able to be achieved in daffodil breeding — I crossed a winter flowering white hoop petticoat with a spring flowering yellow hoop petticoat,\" he said.\n\nSmarple, one of Rod Barwick's first crosses. (ABC News: Loretta Lohberger)\n\n\"And from that cross I raised four daffodils that have become internationally famous.\n\n\"Because the cross wasn't meant to be achieved … I thought I was a bit of a botanical detective, so I used detective names for the flowers that I raised and I named them 'Smarple' as in Miss Marple and 'Spoirot' as in Hercule Poirot, et cetera.\n\n\"And they have gone on to achieve international recognition with Dutch nurseries propagating them in huge scale.\"\n\nThere are 36 species of daffodil, and more than 26,000 cultivated varieties, according to the the Royal Botanic Gardens, Kew.\n\nA drawing by Rod Barwick included in the Glenbrook Bulb Farm catalogue of 2015. (Supplied)\n\n'An artist with the pollen brush'\n\nCultivars from Mr Barwick's Glenbrook Bulb Farm have consistently won prizes at local, interstate and international flower shows.\n\nMr Barwick has been showing flowers for the past 50 years.\n\nIn 1985, he and his sister Anne started a spring flower show at Claremont in Hobart's northern suburbs.\n\nRod Barwick has been showing flowers for 50 years. (ABC News: Loretta Lohberger)\n\nThis year the show celebrated its 40th anniversary.\n\nOne of the judges was Richard Perrignon, an Australian member of the Bulb Expert Group of the Royal Horticultural Society in London.\n\nMr Perrignon described Mr Barwick as \"an artist with the pollen brush\".\n\n\"And he's very ambitious in his art,\" he said.\n\n\"There's no-one I know in Australia who has been so successful in breeding the kind of daffodils that he breeds.\n\n\"What he is famous for is miniature daffodils, and he was one of the first in Australia to realise how valuable they were.\"\n\nRichard Perrignon says Rod Barwick is \"an artist with the pollen brush\". (ABC News: Loretta Lohberger)\n\nMr Perrignon said while standard daffodils have been bred in England and in Australia since the 19th century, it was not until after World War II that people started to become aware of 'species daffodils'.\n\nNarcissus cyclamineus and narcissus bulbocodium drawn by Rod Barwick in his 2004-05 Glenbrook Bulb Farm catalogue. (Supplied)\n\n\"[Species daffodils] are tiny little things like the hoop petticoat daffodils and one we can narcissus cyclamineus,\" he said.\n\n\"In England it was Alec Gray who first really bred with them.\n\n\"It was Rod who introduced that interest to Australia … in the 70s and 80s, and really he has done at least as well as Alec Gray ever did for Britain and Europe — so he's a very important man in the daffodil world.\"\n\nRod Barwick was one of the first in Australia to realise how valuable minature daffodils are. (ABC News: Loretta Lohberger)\n\nIn 2023, Mr Barwick was the recipient of the Peter Barr Memorial Cup, presented by the Royal Horitcultural Society, for his breeding work in daffodils.\n\n\"Rod is one of only four Australians ever to have been awarded that,\" Mr Perrignon said.\n\nNext generation learning to love flowers\n\nThroughout his career Mr Barwick has been encouraging others to enjoy growing and showing their flowers, including his niece, Janelle Noble.\n\n\"I would see a lot of his seedlings come up and be inspired in the way that I wanted to do my own … and he would encourage me in the way that he would give me the right advice on what I could cross with what and how to enhance the best attributes of a flower,\" Ms Noble said.\n\nJanelle Noble says she's been inspired by her uncle's seedlings and, with his encouragement, started to dabble in daffodil breeding. (ABC News: Loretta Lohberger)\n\nShe also shares Mr Barwick's love of miniature daffodils.\n\n\"They're truly enchanting,\" she said.\n\nFor many years, Mr Barwick sold bulbs via catalogues to growers and gardeners around the country. The catalogues featured his drawings and snippets of life at Glenbrook.\n\nArtwork by Rod Barwick on the Glenbrook Bulb Farm catalogue from 1993. (Supplied)\n\nIn his 25th annual catalogue, which was for the 2004-05 season, he wrote:\n\n\"Looking back, it seems remarkable to me that I have been able to live the last quarter of a century always working here on the property that was home to my parents and grandparents before — making a living by growing bulbs, plants and flowers and surrounded by birds, animals and the hills of Claremont … I guess I must be one of the luckiest people in the world!\"\n\nHoop petticoat daffodil, narcissus bulbocodium, which is native to southern and western France, Portugal and Spain, growing at Glenbrook. (ABC News: Loretta Lohberger)\n\nHe went on to describe himself as living \"pretty much the life of an eccentric, aging would-be recluse\".\n\nDespite his many successes, Mr Barwick said the most important thing was to enjoy growing.\n\n\"In the culture in which I was brought up, winning was terribly important — to be a success, to be a winner, whatever.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/afl-grand-final-brisbane-lions-chris-fagan-lachie-neale/105825616",
        "title": "How Fagan avoided looking 'like a total idiot' with inspired Neale sub call",
        "publish_date": "Sat, 27 Sep 2025 22:04:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Brisbane Lions coach Chris Fagan admits he took a punt by naming Lachie Neale as the sub ahead of their stunning win over Geelong in Saturday's grand final.\n\nNeale thought his season was over after injuring his calf in the Lions' qualifying final loss to the Cats earlier this month.\n\nBut 22 days later, the two-time Brownlow medallist was holding a second premiership cup aloft with Lions co-captain Harris Andrews.\n\nThe 32-year-old had an instant impact when he was subbed into the match for teenager Sam Marshall at the start of the third quarter at the MCG.\n\nNeale finished with 17 disposals, seven clearances and one famous goal in a second half that will go down in grand final folklore.\n\n\"I was lying in bed last night thinking, 'I'm either going to look like a total idiot or a total genius,'\" Fagan said after the Lions' 47-point win.\n\n\"If we had lost, and he'd (Neale) only played a half, we'd probably be bemoaning the fact we went about it that way.\n\n\"The bottom line was Lachie was fit to play. But how much game time could he play?\n\n\"Because basically, he'd played one game in 56 days, and coming into a grand final, I was a little bit worried about his ability to see the whole game out if he had to actually start.\"\n\nLachie Neale produced an inspired performance when he came on as the Lions' sub. (Getty Images/AFL Photos: Robert Cianflone)\n\nNeale said he was the \"most nervous\" he had ever been in his career before coming on for the Lions.\n\nHaving been the sub in Fremantle's 2013 grand final loss, Neale had not performed that role since round one in 2014.\n\n\"I haven't done it (play as a substitute) in about 11 years, so I was pretty nervous knowing I was coming on to be the sub in the third,\" Neale said.\n\n\"Probably the most nervous I've ever been just sitting there waiting and knowing if the game was in the balance, they were going to sub me on.\"\n\nThe decision to play Neale, coming in for injured teammate Jarrod Berry, was deemed a major risk because his initial injury assessment had him sidelined for six weeks.\n\nNeale was able to tell Fagan he was right to go at Thursday's main training session, but Berry selflessly made the call to pull out of contention for the grand final.\n\nGeelong's superpower fails its biggest test Photo shows Jeremy Cameron crouched and nursing an arm injury during the Cats' AFL grand final against the Lions. It is the cruel irony of sport that what is usually the ace up Geelong's sleeve proved to be its downfall in the loss to the Brisbane Lions in the season decider.\n\nNeale himself had declared his season over on social media, but now conceded he \"looks like a goose\".\n\nBut the Lions and Neale were always adamant he would be fit to play, and he was confirmed as the surprise sub on Saturday.\n\nHe knew he was going to be right to go after a gruelling running session before the Lions' preliminary final against Collingwood.\n\n\"You hear a bit of the noise and question yourself, but I've got great people around me who told me to delete all the apps off my phone, which I did,\" Neale said.\n\n\"[I decided to] Listen to those close to me and block out the outside noise.\n\n\"I was confident in the calf, it was more about if I could run out the game, full stop.\n\n\"It's a bit of a master stroke, it looks good now. I'm glad I made a bit of an impact.\"\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-28/bowie-daly-returns-to-surfing-weeks-after-shark-attack/105788210",
        "title": "Nine-year-old surfer returns to the water weeks after shark attack",
        "publish_date": "Sat, 27 Sep 2025 21:22:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Bowie Daly has returned to surfing weeks after surviving a frightening shark attack on the NSW far south coast.\n\nThe nine-year-old was at Tathra Beach on August 7 when a shark grabbed his surfboard.\n\nThe shark let go and a group of nearby surfers, including Bowie's father, helped him get to shore.\n\nBowie sustained some bruising and scratches, a hole in his wetsuit and a broken board.\n\nBowie Daly had scratches, bruises, a ripped wetsuit and a broken board from the attack. (ABC South East NSW: Floss Adams)\n\nIt's only taken Bowie a matter of weeks to get back into the water — at first swimming near the shore before moving to boogie boarding and then surfing.\n\nHe said he was glad to be back, but the shark encounter played on his mind.\n\n\"If it's murky water and there's no-one out, I'm a bit scared,\" he said.\n\n\"If it's clear water and there's a few people out, then I'm fine.\n\n\" Sometimes I'm scared, sometimes I'm not. \"\n\nBowie (right) has been surfing again, including with his friend Ollie. (Supplied: Simon Daly)\n\nBowie said he was thinking more about what could happen when he was surfing, but that being accompanied by friends or family while in the water put him more at ease.\n\nHis father, Simon Daly, said he had noticed changes in his son.\n\n\"If there's no-one in the water, he turns to me and says, 'I'm thinking about it again', and I am too, to be honest,\" he said.\n\n\"I think it will be something that over time will lessen.\"\n\nOne day at a time\n\nMr Daly said his son's attack was a harrowing experience, but their stance on sharing the ocean with sharks had not changed.\n\n\"I've always rested really comfortably with surfing and sharing the same environment as sharks,\" he said.\n\n\"We're out there in the sharks' environment and they're doing their thing, and we're doing our thing.\n\n\"That's why we cohabitate so well.\"\n\nSimon Daly says his views on sharing the ocean with sharks has not changed. (ABC South East: Keira Proust)\n\nNot long after the attack, Bowie set a goal of getting back in the water within a couple of weeks.\n\nHe then became an ambassador for Surfaid's Make a Wave challenge in which he had to surf every day for the month of September.\n\nIt motivated him to get back into the water daily and raise funds to provide clean water and health care to remote surfing villages.\n\n\"It's been a bit hard, but I can do it,\" Bowie said.\n\nBowie Daly has been swimming daily as part of the Make a Wave challenge. (ABC South East NSW: Floss Adams)\n\nMr Daly said the challenge \"dovetailed\" with his son's own drive to get back into the surf.\n\n\"Each day, he still definitely has his little battles, which I would as well,\" Mr Daly said.\n\n\"The connection to the ocean is always there for him … but it is a delicate thing getting back in.\n\n\" This goal of being in the ocean for 30 days is a big part of that. \"\n\nVictim blaming takes toll on animal attack survivors Photo shows A woman sits on a couch against a wall that has many photo frames. News of dangerous animal encounters tend to travel very fast in Australia, but sometimes what follows can compound the mental anguish of survivors.\n\nNot alone\n\nBowie's recovery has not gone unnoticed.\n\nDave Pearson was severely injured in 2011 when he was bitten by a three-metre bull shark during an afternoon surf on the NSW Mid North Coast.\n\nHe founded Bite Club, a group for people who have lived through similar experiences and were looking for support.\n\nYounger surfers who survived shark attacks were usually more resilient than adults when it came to getting back into the water, he said, adding that he admired their strength.\n\n\"They're so great at getting back in,\" Mr Pearson said.\n\n\" I wish we could take some of that youthful innocence or whatever it is from them, and give it back to us oldies a bit because they are so good at it. \"\n\nDave Pearson admires people who get back in the water after an attack. (ABC: Anthony Scully)\n\nMr Pearson said he was still \"spooked\" when he was in the water, and was a \"bit more careful\" before heading out for a surf.\n\nHe said it took time for survivors, as well as their loved ones, to fully recover from a shark attack.\n\nHe recommended surfing with people to mentally cope.\n\n\"It's going to be every time they paddle out, he's going to think about sharks, but they'll get through it.\n\n\"The more people that go out with them, the better it's going to be for him.\n\n\"Make it a massive deal and a massive celebration.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-grand-final-celebrations-live-updates-brisbane-lions-the-toast-of-the-town-geelong-cats-commiserate-after-2025-afl-decider-20250927-p5mydk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL grand final celebrations live updates: Brisbane Lions the toast of the town, Geelong Cats commiserate after 2025 AFL decider",
        "publish_date": "Sun, 28 Sep 2025 11:57:19 +1000",
        "category": "sports",
        "authors": [
            "Ashleigh Mcmillan"
        ],
        "text": "Few were savouring the jubilant atmosphere in Fitzroy North on Sunday more than cult favourite Bruce Reville.\n\nThe Papua New Guinea-born midfielder has had a unique pathway into the AFL. Moving to Queensland when he was seven, his teen years comprised eight-hour round trips to get to footy training from his then home of Hervey Bay.\n\nTo finance his dreams of making the AFL while rehabbing long-term injuries, Reville worked in an abattoir and later at Bunnings driving a forklift.\n\nBruce Reville and his family. Credit: via Getty Images\n\nAfter being bundled out of the Lions premiership journey last year by injury, Reville said to be able to contribute to the club going back-to-back was a “special thing”.\n\n“I reckon it will sink in over the next few weeks, but right now, it’s just surreal,” he said.\n\n“I didn’t know if winning a premiership would be on the cards for me, but always knew I wanted to play AFL football and to be able to tick that off – and now the ultimate success in this – it’s pretty special.”\n\nWhat advice would Reville give to other kids who love their footy but might not have a straightforward path into the AFL?\n\n“Just put 110 per cent into it. You’re gonna have some setbacks on the way, but that’s all part of the journey, so just keep in there and things will start unfolding,” he said.\n\n“I’m just so grateful for everyone that’s helped me on my journey.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/tubby-pays-tribute-to-dickie-bird-20250928-p5mygg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tubby pays tribute to 'Dickie' Bird",
        "publish_date": "Sun, 28 Sep 2025 11:35:07 +1000",
        "category": "finance",
        "authors": [],
        "text": "Tubby pays tribute to 'Dickie' Bird\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/my-first-fashion-show-anna-wintour-meets-the-devil-20250928-p5myfx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘My first fashion show’: Anna Wintour meets the Devil",
        "publish_date": "Sun, 28 Sep 2025 11:32:37 +1000",
        "category": "lifestyle",
        "authors": [
            "Colleen Barry"
        ],
        "text": "The Devil wore Dolce & Gabbana on Saturday, with Meryl Streep taking a front-row seat at the designing duo’s Milan theatre in character as Miranda Priestly for The Devil Wears Prada sequel.\n\nStreep wore Priestly’s customary sunglasses and a Dolce & Gabbana vinyl trench coat as she entered the theatre escorted by security and trailed by Stanley Tucci, who plays her art director in the film.\n\nStanley Tucci and Meryl Streep at the Dolce & Gabbana spring summer 2026 collection in Milan, Italy, on Saturday. Credit: AP\n\nThroughout the runway show Streep’s character consulted with Tucci, their eyes casting up and down the runway as models passed.\n\nThe Dolce & Gabbana press office confirmed that the scene was filmed for inclusion in the sequel, which has been shooting in Milan.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/entrepreneurship/ex-f45-fitness-founders-having-a-crack-at-luring-pilates-toughest-crowd-men-20250915-p5mv44.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ex-F45 fitness founders having a crack at luring Pilates’ toughest crowd: men",
        "publish_date": "Sun, 28 Sep 2025 11:16:56 +1000",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "Three hundred metres of rowing, 10 glute bridges, eight tricep push-ups. Repeat, until the 12-minute circuit is over. There’s nothing gentle about this so-called warm-up set at Strong Pilates, one of Australia’s fastest-growing boutique fitness franchises eyeing a global empire of 300 studios in four years.\n\nThere’s also nothing especially girly or feminine about the studio – which is black and white and sleekly backlit by LED lights – nor its founders, Michael Ramsey and Mark Armstrong.\n\nStrong Pilates co-founders Michael Ramsey (left) and Mark Armstrong.\n\nEarly adopters of F45, the fitness centre franchises, the duo decided to sell their six thriving, profitable Melbourne studios in 2019, just as the hype around the functional training brand was reaching fever pitch.\n\n“It was highly, highly, highly competitive, and we were like, we don’t want to play in this space any more ... it’s too saturated,” Ramsey said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-poodle-went-pretty-well-20250928-p5myg6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'The Poodle went pretty well'",
        "publish_date": "Sun, 28 Sep 2025 11:03:55 +1000",
        "category": "finance",
        "authors": [],
        "text": "'The Poodle went pretty well'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-prism-20250926-p5my6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An elusive Melbourne band took on Fed Square – and made a packed crowd feel like family",
        "publish_date": "Sun, 28 Sep 2025 10:59:01 +1000",
        "category": "entertainment",
        "authors": [
            "Kelsey Oldham",
            "Andrew Fuhrmann"
        ],
        "text": "Before ECSR hit the stage, local Afro disco duo Wrong Way Up and New York DJ/MC Edan primed the crowd. While not the line-up one would have expected at an ECSR gig 20 years ago, the eclectic programming (no doubt the handiwork of music consultant Woody McDonald, formerly of Triple R and Meredith Music Festival) was perfect for the occasion.\n\nLike many fans, my attempts to see this elusive band have been impeded by COVID cancellations and sold-out secret shows. Yet it was worth the decades-long wait to finally see the legendary Melbourne garage-punk outfit in this special setting.\n\nWhile Snoop Dogg’s appearance at the AFL grand final was surely the most talked-about musical performance of this long weekend, a free gig from Eddy Current Suppression Ring (ECSR) at Fed Square was the main event for Melbourne music lovers.\n\nDads danced with their embarrassed kids, leather-jacketed women boogied together, and baffled punters tried to comprehend exactly what the DJ dressed as a wizard was doing with his turntables. As a high-energy flashmob joined him onstage, the atmosphere was joyous.\n\nThen it was time for the headliner. As ECSR singer Brendan Huntley (aka Suppression) donned his iconic black gloves and the band eased into Memory Lane, it felt like we were about to witness something special. Pacing, stagediving and climbing, Huntley worked the crowd like this was an intimate show in a dark band room and not a performance to thousands in the open air. By the time the band launched into Which Way to Go, he had whipped the audience into a frenzy.\n\nEddy Current Suppression Ring are one of Melbourne’s most elusive bands. Credit: Richard Clifford\n\nTo my surprise, the kids, teens and parents remained in the heaving mosh. My neighbour even informed me that the small woman at the barrier having the time of her life was Huntley’s mum. It felt like everyone was family. As the band wound down their generous 70-minute set with the hypnotic Rush to Relax, their deep connection was obvious. The complex mastery of musical repetition is the backbone of ECSR’s deceptively simple songs.\n\nThe quality of Fed Square’s free gigs is changing the game in terms of music accessibility – this year alone has seen Kneecap, Caribou and Sun Ra Arkestra perform in the space. While there were thousands of die-hard ECSR fans in the audience, I wonder how many people accidentally found themselves watching one of the most beloved bands in Australian music history.\n\nReviewed by Kelsey Oldham",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/lloyd-unpacks-geelongs-biggest-mistake-20250928-p5myg5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lloyd unpacks Geelong's biggest mistake",
        "publish_date": "Sun, 28 Sep 2025 10:53:55 +1000",
        "category": "finance",
        "authors": [],
        "text": "Lloyd unpacks Geelong's biggest mistake\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/harris-andrews-responds-to-bailey-smith-shove-20250928-p5myg3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Harris Andrews responds to Bailey Smith shove",
        "publish_date": "Sun, 28 Sep 2025 10:48:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Harris Andrews responds to Bailey Smith shove\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/blaize-talagi-played-through-pain-of-a-punctured-lung-his-mum-may-have-saved-his-life-20250927-p5mycb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Blaize Talagi played through pain of a punctured lung. His mum may have saved his life",
        "publish_date": "Sun, 28 Sep 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Had the playmaker not come in that night, the injury could have proved fatal. “Yeah, 100 per cent,” Byron said. “It was lucky he didn’t wait until the next morning, if you know what I mean. It’s lucky we came in when we did. Blaize Talagi has made the Penrith No.6 jumper his own. Credit: Getty Images “When he got there they put the drain through and drained the fluid out. We have come through the other side. He was pretty lucky. “Anything could have happened. You know what kids are like, they try to brush things [off]. I’m just glad that mum knows the kids so much.”\n\nEven Talagi himself, with the benefit of hindsight, can appreciate his good fortune. “Thinking back to it, it was a pretty scary time,” Talagi said. “A punctured lung, it’s definitely not to be taken lightly. It was a pretty hard period for me being in hospital for two weeks. Blaize talagi at the Panthers’ academy earlier this week. Credit: KATE GERAGHTY “I got off the field and the doctor there said it was just a stitch. I didn’t want to go to hospital, didn’t want to go to the doctor or anything like that. It just got to a point where it got too bad, and my mum was like, ‘We’re going.’ I’m lucky we did. “It was pretty serious, so I’m very grateful that we got it sorted out. I’m glad to move on from that, and I’m feeling good.”\n\nThere is every reason for Talagi to feel good about life at the moment. After a breakout debut NRL season at Parramatta, he has come of age at Penrith, playing in the halves alongside Nathan Cleary at a team attempting to win its fifth consecutive title. It has been a successful shift, but one that also took its toll. The 20-year-old played most of his junior football for the Eels and was promised Clint Gutherson’s No.1 jersey. Deciding to instead accept an offer from arch-rivals Penrith was not a decision he made lightly. “I felt for Blaize going through all that,” Byron said. “It wasn’t easy for him. Not so much the attention, he felt he didn’t want to let Parra down. They gave him an opportunity, putting other people before him. We are blessed to have good people around us to go through the pros and cons. “We’ve got our own circle and Blaize values everyone’s opinion, but ultimately, it’s his call. He chose to go and learn, which is the best thing for him. At this time in his career, it’s all about learning. He’s at the right place.” There were some challenges to overcome on arriving at the foot of the mountains: a shoulder injury that required surgery resulted in an interrupted off-season, and when the season proper commenced he began it in reserve grade.\n\nLoading It was a step backwards for a youngster who had burst onto the NRL scene while still in his teens. When he eventually got the opportunity to pull on the No.6 jersey that Jarome Luai had made his own, the Panthers were on a losing streak that resulted in them sitting in last spot after 12 rounds. “It wasn’t always sunshine and rainbows, but we’re in a good place,” Talagi said. However, the move has been beneficial for all parties, with the Panthers eyeing a sixth consecutive grand final if they can defeat Brisbane at Suncorp Stadium on Sunday. And of course, there’s the chance to play with and learn from Cleary.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/don-t-blame-the-ref-sloppy-wallabies-need-to-look-at-themselves-20250928-p5myez.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Don’t blame the ref: Sloppy Wallabies need to look at themselves",
        "publish_date": "Sun, 28 Sep 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The Wallabies’ 33–24 loss to the All Blacks at Eden Park looked like two Test teams playing under the illusion that they would be refereed the same way that they are in Super Rugby Pacific.\n\nThat was never going to be the case, and both sides must take their share of responsibility for an ill-disciplined clash that never hit any great heights.\n\nMaligned whistleblower Andrea Piardi’s lack of action against Jordie Barrett for a tip tackle was problematic, but frankly, at least one-third of the Wallabies’ penalties were obvious and avoidable — offside at the ruck, no-arms tackles, and playing the man at the lineout, to name but three.\n\nWe know the Wallabies’ discipline has been an issue in recent years — it undermined Dave Rennie’s tenure — and there are clearly some deep-rooted bad habits that even Joe Schmidt is finding hard to break. What is allowed to pass in Super Rugby Pacific isn’t tolerated in the Test arena, and the Wallabies need to correct their course before the end-of-year tour of Europe.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nine-out-of-10-aussies-admit-to-distracted-driving-20250928-p5myfn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nine out of 10 Aussies admit to distracted driving",
        "publish_date": "Sun, 28 Sep 2025 09:28:27 +1000",
        "category": "finance",
        "authors": [],
        "text": "Nine out of 10 Aussies admit to distracted driving\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/pm-meets-with-the-king-20250928-p5myff.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PM meets with the King",
        "publish_date": "Sun, 28 Sep 2025 09:13:15 +1000",
        "category": "finance",
        "authors": [],
        "text": "PM meets with the King\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw6-chelsea-vs-brighton-20250928-p5myfb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW6: Chelsea vs Brighton",
        "publish_date": "Sun, 28 Sep 2025 09:07:51 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW6: Chelsea vs Brighton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw6-crystal-palace-vs-liverpool-20250928-p5myfd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW6: Crystal Palace vs Liverpool",
        "publish_date": "Sun, 28 Sep 2025 09:07:42 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW6: Crystal Palace vs Liverpool\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw6-brentford-vs-man-utd-20250928-p5myfc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW6: Brentford vs Man Utd",
        "publish_date": "Sun, 28 Sep 2025 09:06:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW6: Brentford vs Man Utd\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw6-spurs-vs-wolves-20250928-p5myf9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW6: Spurs vs Wolves",
        "publish_date": "Sun, 28 Sep 2025 09:05:42 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW6: Spurs vs Wolves\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-we-are-family-we-should-work-together-palau-presidents-challenge-to-australia/mcmwdac58",
        "title": "INTERVIEW: 'We are family, we should work together': Palau President's challenge to Australia",
        "publish_date": "Sat, 27 Sep 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/republican-albanese-meets-the-king-as-opposition-questions-taxpayer-bill-for-uk-trip/l61hmhwc6",
        "title": "Republican Albanese meets the King, as Opposition questions taxpayer bill for UK trip",
        "publish_date": "Sat, 27 Sep 2025 21:24:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "King Charles has hosted Anthony Albanese and his fiancée Jodie Haydon at the sprawling Balmoral Castle grounds in the Scottish Highlands.\n\n\n\n\n\nAt the same time, the Opposition is questioning the use of taxpayer funds for the prime minister to travel to Liverpool tomorrow to deliver a speech at a UK Labour conference, supporting British Prime Minister Keir Starmer, who is trailing in the polls.\n\n\n\n\n\nOpposition leader Sussan Ley says Albanese is in the UK as the nation's prime minister, \"not the leader of the Australian Labor Party\".\n\n\n\n\n\n\"He shouldn't be swanning around on the taxpayer dollar at Labour political conferences hanging out with his left-wing mates,\" she said.\n\n\n\n\n\n\"I met with Kemi Badenoch yesterday,\" Albanese said, referring to London talks with the UK Opposition leader to defend against claims of partisanship.\n\n\n\nAlbanese also maintains that, given the Australia-UK free trade deal and the AUKUS agreement , it's important to engage with various members of the ministry.\n\n\n\n\n\nHe told SBS World News he would be meeting with the UK defence minister and home affairs minister while in Liverpool.\n\n\n\nA royal and a republican\n\nAlbanese also took a day trip from London to take up the audience with Australia's monarch as part of his trip to the UK.\n\n\n\n\n\nThe prime minister is a staunch republican — he even appointed an assistant minister for the republic when he was first elected to the top job — but he said there was no appetite for a republic referendum in this term of parliament.\n\n\n\n\n\n\"I have always supported an Australian as our head of state,\" the prime minister told SBS World News.\n\n\n\n\n\n\"But the existing arrangements are in place. We have, I think, a very respectful relationship, and we have a Monarch, His Majesty, who's very passionate in the interests about Australia, interested about world affairs and the future, and the opportunity to engage with him constructively is one that I will always take up.\"\n\n\n\n\n\nAustralian tourist Deb Miller was travelling in Scotland and came to see Balmoral Castle when she noticed a convoy of cars arriving at the gates.\n\n\n\nPrime Minister Anthony Albanese and partner Jodie Haydon arrive at the gate to Balmoral Castle for an audience with King Charles III. Source: AAP / Lukas Coch Initially, she thought a member of the royal family may have been approaching.\n\n\n\n\n\n\"It would have been nice if he stopped and said g'day,\" she said of the prime minister's arrival — gliding through the gates in a car with darkened windows.\n\n\n\n\n\nAlbanese travelled to the remote part of Scotland and entered the gates at Balmoral.\n\n\n\n\n\nMiller had arrived at the castle hoping to sight-see, but it was closed to the public today, so seeing her prime minister on the other side of the world had to suffice for a tourist experience.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-footballer-fandi-ahmad-is-a-singaporean-sporting-legend-we-find-out-why/o9g54fzkl",
        "title": "INTERVIEW: Footballer Fandi Ahmad is a Singaporean sporting legend: We find out why",
        "publish_date": "Sat, 27 Sep 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/afraid-of-ai-replacing-you-here-are-jobs-that-may-be-future-proof/g84ryofgy",
        "title": "Afraid of AI replacing you? Here are jobs that may be future-proof",
        "publish_date": "Sat, 27 Sep 2025 05:44:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "Nearly every job in Australia will be transformed by technological change, with some roles becoming obsolete, new research has found.\n\n\n\n\n\n\n\nThe report by investment bank Barrenjoey found only one in 1,000 Australian jobs will likely remain untouched by technology and artificial intelligence (AI), marking the \"most comprehensive workforce transformation\" in modern history.\n\n\n\n\n\nJohnathan McMenamin, head of economic forecasts at Barrenjoey and one of the report's authors, said the numbers were \"incredibly significant\".\n\n\n\n\n\n\"That means that it's very broad base. It's going to affect the way we work right across the workplace,\" he told SBS News.\n\n\n\nSome jobs will change, some will 'fade'\n\nTo examine the role of AI and technology in the workplace, the report analysed their impacts on two areas: skills and tasks that can be substituted by technology and those that can be augmented by it.\n\n\n\n\n\nMcMenamin said augmentation was when technology contributed to better outcomes and productivity.\n\n\n\n\n\nThe report found one in two jobs face \"medium-to-high augmentation\", while one in three face the risk of being replaced by technology.\n\n\n\n\n\n\"That means that we are more geared towards augmentation than we are towards substitution,\" McMenamin said.\n\n\n\n\n\n\"We think that the threat to the workforce isn't through a mass unemployment phase. This isn't a doomsday piece of research that you might have seen in some other instances, but it's a more balanced outcome that we're expecting for the workforce.\"\n\n\n\nLISTEN TO Industries at risk of technology and AI & big dividend day SBS News 21:09 English\n\nThe results align with a federal government report in August, which found generative AI is likely to augment the way we work rather than replace jobs.\n\n\n\n\n\nWhile about 30 per cent of the workforce have jobs with high exposure to augmentation, the August report found only 4 per cent of jobs are at risk of being automated by generative AI.\n\n\n\n\n\nThe Barrenjoey report indicated that nearly 10.9 per cent of the workforce still faces a high risk of replacement, while 22.3 per cent are at medium risk.\n\n\n\n\n\nJust over seven per cent of the workforce is highly exposed to augmentation, while an additional 38.4 per cent has medium exposure.\n\n\n\n\n\n\"What will happen is those substitutable occupations, they will either completely transform in terms of what they look like, or you'll see their role in the workforce just fade over time,\" McMenamin said.\n\n\n\n\n\n\"It won't be an immediate overnight thing, but they will fade.\"\n\n\n\nJobs with the most and least risks\n\nGenerally, labourers, machine operators, sales workers and general clerks are the jobs most at risk of substitution and obsoletion, according to the report.\n\n\n\n\n\nThe research also reveals that consumer staples retail has the highest substitution risk among Australian Securities Exchange (ASX) industries, with more than 125,000 checkout operators and 560,000 sales assistants nationwide still performing tasks that could be automated.\n\n\n\n\n\nCommercial cleaners, sales assistants in broadline retail and specialty stores, kitchen-hands, couriers and postal carriers, truck drivers, and structural steel and welding trades workers are the next groups most at risk.\n\n\n\nThe diversified consumer services sector, which includes jobs such as tax preparation, legal advice, education, and home security, had the lowest substitution rating.\n\n\n\n\n\nThe life sciences tools and services sector, which includes medical and laboratory scientists, was the next lowest.\n\n\n\n\n\nThe report also indicated that workers employed by a real estate investment trust generally had less exposure to technology compared to employees in other industries.\n\n\n\n\n\n\"The things that are most substitutable are those things that are very routine. These are tasks and skills that we've been replacing for a long period of time,\" McMenamin said.\n\n\n\n\n\nThe report found the five industries with the highest share of highly substitutable workers were insurance, hotels and restaurants, beverages, consumer staples and food products.\n\n\n\nWhich jobs are going to transform?\n\nOn the other hand, McMenamin says the jobs that are likely to be augmented by technology are \"tasks or areas of the workplace that haven't typically been disrupted by technology in the past\" and often \"cognitive\".\n\n\n\n\n\n\"Now professionals are more exposed to technology, whereas previously it was machine operators and labourers and clerical people, and now it's moving into a newer group,\" he said.\n\n\n\n\n\nThe top five ASX industries that stand out for augmentation potential include:\n\n\n\nInsurance\n\nHealth care technology\n\nSoftware\n\nInteractive media and services\n\nIT services\n\nMcMenamin said the key takeaway from the findings was that workers \"have to adapt\".\n\n\n\n\n\n\"This is a general-purpose technology, one that will change the way that we work across the workforce, just like when computers came in or when the internet was invented,\" he said.\n\n\n\n\n\n\"Everyone thinks doomsday, but I think ultimately what we know is that productivity drives increasing living standards.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-autism-disinformation-misinformation-tylenol-vaccines/zvsep8k5i",
        "title": "Trump isn't the first to push an unproven claim about autism. Why are they so pervasive?",
        "publish_date": "Sat, 27 Sep 2025 01:01:18 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When United States President Donald Trump said there was an association between mothers taking Tylenol (paracetamol) and \"a very increased risk of autism\" in children, he added fuel to a fire of mis- and disinformation that has been raging for years.\n\n\n\n\n\nTrump, flanked by his health secretary Robert F Kennedy Jr and TV-physician-turned-healthcare-administrator Mehmet Oz, said taking paracetamol was \"not good\" and suggested without evidence that autism does not appear in communities where it was not widely used.\n\n\n\n\n\nTrump's comments came just a few months after Kennedy, who is widely considered a vaccine sceptic though has disputed he is \"anti-vaccine\", had vowed to find the \"cause\" of autism by September. That pledge took many by surprise, given that decades of research have not established a singular cause for the neurodevelopmental condition.\n\n\n\n\n\nUnsurprisingly, Trump's comments were met with strong pushback from doctors and other members of the medical community. The World Health Organization (WHO) said on Wednesday there was no conclusive scientific evidence that confirmed a possible link between autism and the use of paracetamol during pregnancy.\n\n\n\nThere is no evidence of a causal link between the use of paracetamol in pregnancy and the development of autism or ADHD in children. Source: AAP / AP / Jae C. Hong In Australia, the link was firmly rejected by the Therapeutic Goods Administration and chief medical officer Michael Kidd.\n\n\n\n\n\n\"Robust scientific evidence shows no causal link between the use of paracetamol in pregnancy and autism or ADHD, with several large and reliable studies directly contradicting these claims,\" the medicines regulator said in a statement on Tuesday.\n\n\n\n\n\nThe US Federal Drug Administration guidance that Trump was announcing was also more restrained in its language than that of the US president. It said it was alerting physicians about studies suggesting a correlation between acetaminophen use during pregnancy and subsequent diagnosis of conditions like autism and ADHD (attention deficit hyperactivity disorder).\n\n\n\n\n\nBut it noted that while an association between acetaminophen and neurological disorders had been described in studies, a causal relationship had not been established, and there were contrary studies.\n\n\n\n\n\nAndrew Whitehouse, the deputy director of research and a professor of autism research at The Kids Research Institute Australia, said Trump's claims were \"at best, a misreading of science\" and \"at worst, a total misuse of science\".\n\n\n\n\n\n\"There are absolutely studies out there that have shown that taking paracetamol during pregnancy is associated with an increased chance of the offspring of that pregnancy and being diagnosed with autism. But there are also studies that show no association, and even studies that show the opposite,\" he told SBS News.\n\n\n\n\n\n\"But what not a single one of those studies have shown is any kind of causal link in any way, shape or form.\"\n\n\n\nREAD MORE ADHD and autism: Experts urge caution as social media blurs diagnostic boundaries\n\nA major 2024 Swedish study, considered one of the most high-quality on the matter, found no association between use of paracetamol in pregnancy and risk of autism, ADHD or intellectual disability. The study looked at nearly 2.5 million children born in the country between 1995 and 2019, with nearly 186,000 children exposed to paracetamol during pregnancy.\n\n\n\nWhy are non-evidence-based claims about autism so common?\n\nTrump is far from the first person to push an unproven causal link for autism, a neurodevelopmental condition that affects how a person's brain develops and functions, and is often characterised by atypical patterns of activities and behaviours and differences in processing and communicating sensory information.\n\n\n\n\n\nAccording to the WHO, people with autism can experience some degree of difficulty with social interaction, and the abilities and needs of autistic people vary and can evolve over time. It said that while some people with autism live independently, others experience severe disability and require lifelong care and support.\n\n\n\n\n\nFor decades, there have been attempts to find a simplistic answer for why some people experience autism, despite the widespread acceptance in the scientific and medical community that a complex, multi-factoral combination of genetic and environmental factors contributes.\n\n\n\n\n\nThe 1950s gave rise to the since widely discredited 'refrigerator mother' theory: that a lack of warmth from one's parents — and in particular their mothers — could explain an autism diagnosis. Such a theory has been largely abandoned since the 1970s, with subsequent studies linking diagnosis to genetics.\n\n\n\nMore recently, anti-vaccine activists have spread disinformation falsely linking autism with vaccination in an attempt to discourage their use, or suggest without evidence that they have a nefarious use.\n\n\n\n\n\nBoth Trump and Kennedy are among the public figures who have promoted the theory — contrary to scientific evidence — that childhood vaccines are a cause of autism. That idea stems from a since-debunked study from British researcher Andrew Wakefield in the late 1990s that connected a rise in autism diagnoses with widespread use of the measles vaccine.\n\n\n\n\n\nNo rigorous studies have found links between autism and vaccines or medications, or their components such as thimerosal or formaldehyde.\n\n\n\n\n\nThe causes of autism are still relatively unclear, but there is widespread speculation among scientists that its neurological characteristics may develop in utero.\n\n\n\n\n\nResearch suggests genetic factors account for up to 80 per cent of the likelihood of developing autism, and a growing area of investigation focuses on epigenetics — the interactions between genetic and environmental factors.\n\n\n\n\n\nSo why does autism appear so susceptible — perhaps more than any other condition — to claims about its causes that are not grounded in concrete evidence? Why do some reach for easy answers about a condition that is, in many ways, still a mystery to us?\n\n\n\n\n\nWhitehouse says there are two reasons. First is the \"sheer high emotion\" surrounding autism, particularly when it comes to children.\n\n\n\n\n\n\"There's a much-wanted, much-loved, much-valued and cherished child. The parents watch that child develop differently, and there's no very simple reason to describe and explain why that has happened,\" he said.\n\n\n\nAndrew Whitehouse said an \"information void\" had allowed non-evidence-based claims and conspiracy theories around autism to flourish. Source: Supplied That provides ample room, Whitehouse said, for people to push misinformation that attributes a single cause for the development of autism — some well-meaning, others who are \"out-and-out charlatans\".\n\n\n\n\n\n\"The second reason is because we've allowed it to happen. There is no other area of health and medicine that would allow such low-standard claims to not just exist but flourish without a very strong push against it,\" he said.\n\n\n\n\n\n\"But in the area of autism, there historically have not been the high standards of evidence required to make such claims. It's only going to get better if we expect and not only accept higher levels of standard science in the area of autism.\"\n\n\n\n\n\nWhitehouse said a lack of proven, simplistic explanation, paired with a generally low standard for evidence, had created an \"information void\" that allowed non-evidence-based claims and conspiracy theories to flourish.\n\n\n\n\n\nStephen Robson, an honorary professor at the ANU School of Medicine and Psychology, similarly said autism is a condition we still \"don't completely understand\", leading people to try and fill in gaps.\n\n\n\n\n\n\"The conspiracy theorist looks at the gap and [sees] some mal-intent or something nasty going on,\" he said. \"The researcher sees the gap and says, can I find out what it is? I think that's the fundamental difference.\"\n\n\n\n'Nothing wrong' with being autistic\n\nAmong the rhetoric that surrounds autism and its causes, it's important to keep in mind that autism is not an abstract concept, but a condition that impacts the lives of tens of millions of people around the world, their families and supporters.\n\n\n\n\n\nTrump's latest remarks recall in some part the 'refrigerator mother' theories of decades ago — that autism is not a developmental condition but a parental, and specifically maternal, misstep.\n\n\n\n\n\nThat kind of framing is \"inherently sexist\", David Tonge, CEO of support organisation Amaze, told SBS News earlier this week, ahead of Trump's announcement. \"This is an insidious line of discussion that is hurtful to mums,\" he said.\n\n\n\nRobson said Trump's comments had \"amplified\" two layers of stigmatisation: first, the notion that parents of children who had been diagnosed with a neurodevelopmental condition like autism had \"done something wrong\" in their parenting.\n\n\n\n\n\nWhitehouse noted mothers in particular often had \"a whole layer of societal guilt placed around that early developmental phase\".\n\n\n\n\n\nAny attempts to validate that guilt without evidence were \"horrifying\", Whitehouse said, adding that in the days since Trump's comments, he had been contacted by multiple families who were very distressed by the remarks.\n\n\n\n\n\nThe other level of stigmatisation that comes with attempts to find a singular reasoning or \"cure\" for autism is the perception that there is anything inherently wrong with being autistic.\n\n\n\n\n\nThat notion is one many in the autism community reject: that it is not their condition that is disabling, but the neurotypical societal structures and harmful attitudes that surround them.\n\n\n\nLISTEN TO Donald Trump walks his own path on autism research. Health experts say claims don't stack up SBS News 05:17 English\n\n\"When you hear the president say, 'I'd fight like hell not to take [paracetamol]', it suggests that autism in itself is a bad thing, and that it's something you have to fight,\" Robson said.\n\n\n\n\n\n\"I think for the community of people affected by autism, for those who love them and care for them, this is yet another stigmatisation. You have one of the most powerful people in the world saying that what you have is something that should be fought against, and that is awful for people.\"\n\n\n\n\n\nAustralian activist Grace Tame, who is autistic, responded to Trump's comments in a video posted to Instagram shortly after they were made.\n\n\n\n\n\n\"[Autism] can't be prevented, augmented or cured, and it doesn't need to be. There's nothing inherently wrong with being autistic.\n\n\n\n\n\n\"It is a difference in receiving, processing and communicating sensory information that can be disabling depending on external factors.\n\n\n\n\n\n\"Whilst we can't change an autistic person, we can change their environment to better support their needs.\"\n\n\n\n\n\n— With additional reporting by Reuters.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/beer-diplomacy-and-warnings-about-far-right-populism-dominate-albanese-london-trip/v450k88es",
        "title": "Six-pack diplomacy: Albanese joins Starmer and Carney for high-stakes talks",
        "publish_date": "Fri, 26 Sep 2025 22:19:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese has stepped into 10 Downing Street, the UK prime minister's official residence, carrying a six pack of Australian beer after a day of diplomatic talks spanning the rise of far-right populism and global steps towards peace in the Middle East.\n\n\n\n\n\nThe dinner was a group event, with Sir Keir Starmer hosting Albanese and his partner Jodie Haydon, along with Canadian leader Mark Carney and his wife Diana.\n\n\n\n\n\nEarlier in the day, the three leaders made a joint appearance at a left-wing political conference where they shared the stage, alongside Iceland's Prime Minister, Kristrún Frostadóttir.\n\n\n\n\n\nStarmer is under intense political pressure in the UK, flagging in the polls and facing the surging popularity of the far-right Reform UK party led by Nigel Farage.\n\n\n\nThe recent election victories by centre-left parties in Australia and Canada were held up as examples to emulate during the event.\n\n\n\n\n\nStarmer announced a digital identification card policy at the conference, under which all adults would be required to hold a digital ID should they wish to work in the UK.\n\n\n\n\n\nIt's a bid to address voter concerns about migration, one of Reform UK's major campaign platforms.\n\n\n\n\n\n\"I know working people are worried about the level of illegal migration into this country. A secure border and controlled migration are reasonable demands, and this government is listening and delivering,\" Starmer said.\n\n\n\n\n\nThe UK leader also called for progressive politicians to counter \"lies\" told by populists.\n\n\n\n\"Now is the time for social democrats to confront directly some of the challenges and some of the lies, frankly, that have taken root in our societies.\"\n\n\n\n\n\nAlbanese was asked at his press conference whether Australia's immigration and economic policies were keeping the far right at bay.\n\n\n\n\n\n\"What I'd say is that, in Australia, we have a strong position, and that's been important,\" Albanese said.\n\n\n\n\n\n\"People are concerned about elements of the far-right rising in various countries. What our job is to do is to make sure that people continue to have faith in the system. That's something that my government's very focused on.\"\n\n\n\n\"The last election campaign saw one side of politics speak about grievance without putting up any solutions over that period.\"\n\n\n\n\n\n\"I felt that there wasn't any alternative policy work or constructive discussion, and I think they paid a price for that on the third of May .\"\n\n\n\nAlbanese praises Tony Blair amid speculation over Gaza role\n\nAustralia, the UK and Canada are also among a group of Western countries that have recognised Palestinian Statehood during the United Nations leader's week in New York.\n\n\n\nFormer UK Labour leader Tony Blair has been floated as a potential leader of a transitional authority to run Gaza for a number of years.\n\n\n\n\n\nIt's a potential appointment backed by the White House, though yet to be confirmed. But it's drawn some criticism from Arab states because of Blair's history leading the UK into the 2003 Iraq War.\n\n\n\n\n\nThe prime minister met with Tony Blair in London this morning, where the conflict in the Middle East was raised.\n\n\n\n\"There was an opportunity to be briefed by Mr Blair on some of what he has undertaken and the discussions that he's had. I don't want to pre-empt those processes, but it was an important opportunity to be informed,\" Albanese said.\n\n\n\n\n\n\"Tony Blair is someone who's always played a constructive role. He's someone who does look for solutions. He's someone who has been involved in the Middle East issues for some period of time, and I'm sure that he will always play a constructive role, because that's the nature of Tony Blair.\"\n\n\n\n\n\nAlbanese also said he remained confident about the future of the AUKUS nuclear-powered submarine deal forged between Australia, the UK and the US.\n\n\n\nThe US Department of War is reviewing the agreement and during the US president's trip to London last week both Starmer and King Charles were publicly backing the agreement.\n\n\n\n\n\n\"There is no indication that I've seen of anything other than support for AUKUS going forward,\" the prime minister said.\n\n\n\n\n\n\"It is in the interests of all three nations.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-grand-final-celebrations-live-updates-brisbane-lions-the-toast-of-the-town-geelong-cats-commiserate-after-2025-afl-decider-20250927-p5mydk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL grand final celebrations live updates: Brisbane Lions the toast of the town, Geelong Cats commiserate after 2025 AFL decider",
        "publish_date": "Sun, 28 Sep 2025 11:57:19 +1000",
        "category": "sports",
        "authors": [
            "Ashleigh Mcmillan"
        ],
        "text": "Few were savouring the jubilant atmosphere in Fitzroy North on Sunday more than cult favourite Bruce Reville.\n\nThe Papua New Guinea-born midfielder has had a unique pathway into the AFL. Moving to Queensland when he was seven, his teen years comprised eight-hour round trips to get to footy training from his then home of Hervey Bay.\n\nTo finance his dreams of making the AFL while rehabbing long-term injuries, Reville worked in an abattoir and later at Bunnings driving a forklift.\n\nBruce Reville and his family. Credit: via Getty Images\n\nAfter being bundled out of the Lions premiership journey last year by injury, Reville said to be able to contribute to the club going back-to-back was a “special thing”.\n\n“I reckon it will sink in over the next few weeks, but right now, it’s just surreal,” he said.\n\n“I didn’t know if winning a premiership would be on the cards for me, but always knew I wanted to play AFL football and to be able to tick that off – and now the ultimate success in this – it’s pretty special.”\n\nWhat advice would Reville give to other kids who love their footy but might not have a straightforward path into the AFL?\n\n“Just put 110 per cent into it. You’re gonna have some setbacks on the way, but that’s all part of the journey, so just keep in there and things will start unfolding,” he said.\n\n“I’m just so grateful for everyone that’s helped me on my journey.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/tubby-pays-tribute-to-dickie-bird-20250928-p5mygg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tubby pays tribute to 'Dickie' Bird",
        "publish_date": "Sun, 28 Sep 2025 11:35:07 +1000",
        "category": "finance",
        "authors": [],
        "text": "Tubby pays tribute to 'Dickie' Bird\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/my-first-fashion-show-anna-wintour-meets-the-devil-20250928-p5myfx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘My first fashion show’: Anna Wintour meets the Devil",
        "publish_date": "Sun, 28 Sep 2025 11:32:37 +1000",
        "category": "lifestyle",
        "authors": [
            "Colleen Barry"
        ],
        "text": "The Devil wore Dolce & Gabbana on Saturday, with Meryl Streep taking a front-row seat at the designing duo’s Milan theatre in character as Miranda Priestly for The Devil Wears Prada sequel.\n\nStreep wore Priestly’s customary sunglasses and a Dolce & Gabbana vinyl trench coat as she entered the theatre escorted by security and trailed by Stanley Tucci, who plays her art director in the film.\n\nStanley Tucci and Meryl Streep at the Dolce & Gabbana spring summer 2026 collection in Milan, Italy, on Saturday. Credit: AP\n\nThroughout the runway show Streep’s character consulted with Tucci, their eyes casting up and down the runway as models passed.\n\nThe Dolce & Gabbana press office confirmed that the scene was filmed for inclusion in the sequel, which has been shooting in Milan.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/entrepreneurship/ex-f45-fitness-founders-having-a-crack-at-luring-pilates-toughest-crowd-men-20250915-p5mv44.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ex-F45 fitness founders having a crack at luring Pilates’ toughest crowd: men",
        "publish_date": "Sun, 28 Sep 2025 11:16:56 +1000",
        "category": "finance",
        "authors": [
            "Jessica Yun"
        ],
        "text": "Three hundred metres of rowing, 10 glute bridges, eight tricep push-ups. Repeat, until the 12-minute circuit is over. There’s nothing gentle about this so-called warm-up set at Strong Pilates, one of Australia’s fastest-growing boutique fitness franchises eyeing a global empire of 300 studios in four years.\n\nThere’s also nothing especially girly or feminine about the studio – which is black and white and sleekly backlit by LED lights – nor its founders, Michael Ramsey and Mark Armstrong.\n\nStrong Pilates co-founders Michael Ramsey (left) and Mark Armstrong.\n\nEarly adopters of F45, the fitness centre franchises, the duo decided to sell their six thriving, profitable Melbourne studios in 2019, just as the hype around the functional training brand was reaching fever pitch.\n\n“It was highly, highly, highly competitive, and we were like, we don’t want to play in this space any more ... it’s too saturated,” Ramsey said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-poodle-went-pretty-well-20250928-p5myg6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'The Poodle went pretty well'",
        "publish_date": "Sun, 28 Sep 2025 11:03:55 +1000",
        "category": "finance",
        "authors": [],
        "text": "'The Poodle went pretty well'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-prism-20250926-p5my6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An elusive Melbourne band took on Fed Square – and made a packed crowd feel like family",
        "publish_date": "Sun, 28 Sep 2025 10:59:01 +1000",
        "category": "entertainment",
        "authors": [
            "Kelsey Oldham",
            "Andrew Fuhrmann"
        ],
        "text": "Before ECSR hit the stage, local Afro disco duo Wrong Way Up and New York DJ/MC Edan primed the crowd. While not the line-up one would have expected at an ECSR gig 20 years ago, the eclectic programming (no doubt the handiwork of music consultant Woody McDonald, formerly of Triple R and Meredith Music Festival) was perfect for the occasion.\n\nLike many fans, my attempts to see this elusive band have been impeded by COVID cancellations and sold-out secret shows. Yet it was worth the decades-long wait to finally see the legendary Melbourne garage-punk outfit in this special setting.\n\nWhile Snoop Dogg’s appearance at the AFL grand final was surely the most talked-about musical performance of this long weekend, a free gig from Eddy Current Suppression Ring (ECSR) at Fed Square was the main event for Melbourne music lovers.\n\nDads danced with their embarrassed kids, leather-jacketed women boogied together, and baffled punters tried to comprehend exactly what the DJ dressed as a wizard was doing with his turntables. As a high-energy flashmob joined him onstage, the atmosphere was joyous.\n\nThen it was time for the headliner. As ECSR singer Brendan Huntley (aka Suppression) donned his iconic black gloves and the band eased into Memory Lane, it felt like we were about to witness something special. Pacing, stagediving and climbing, Huntley worked the crowd like this was an intimate show in a dark band room and not a performance to thousands in the open air. By the time the band launched into Which Way to Go, he had whipped the audience into a frenzy.\n\nEddy Current Suppression Ring are one of Melbourne’s most elusive bands. Credit: Richard Clifford\n\nTo my surprise, the kids, teens and parents remained in the heaving mosh. My neighbour even informed me that the small woman at the barrier having the time of her life was Huntley’s mum. It felt like everyone was family. As the band wound down their generous 70-minute set with the hypnotic Rush to Relax, their deep connection was obvious. The complex mastery of musical repetition is the backbone of ECSR’s deceptively simple songs.\n\nThe quality of Fed Square’s free gigs is changing the game in terms of music accessibility – this year alone has seen Kneecap, Caribou and Sun Ra Arkestra perform in the space. While there were thousands of die-hard ECSR fans in the audience, I wonder how many people accidentally found themselves watching one of the most beloved bands in Australian music history.\n\nReviewed by Kelsey Oldham",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/lloyd-unpacks-geelongs-biggest-mistake-20250928-p5myg5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lloyd unpacks Geelong's biggest mistake",
        "publish_date": "Sun, 28 Sep 2025 10:53:55 +1000",
        "category": "finance",
        "authors": [],
        "text": "Lloyd unpacks Geelong's biggest mistake\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/harris-andrews-responds-to-bailey-smith-shove-20250928-p5myg3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Harris Andrews responds to Bailey Smith shove",
        "publish_date": "Sun, 28 Sep 2025 10:48:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Harris Andrews responds to Bailey Smith shove\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/blaize-talagi-played-through-pain-of-a-punctured-lung-his-mum-may-have-saved-his-life-20250927-p5mycb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Blaize Talagi played through pain of a punctured lung. His mum may have saved his life",
        "publish_date": "Sun, 28 Sep 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Had the playmaker not come in that night, the injury could have proved fatal. “Yeah, 100 per cent,” Byron said. “It was lucky he didn’t wait until the next morning, if you know what I mean. It’s lucky we came in when we did. Blaize Talagi has made the Penrith No.6 jumper his own. Credit: Getty Images “When he got there they put the drain through and drained the fluid out. We have come through the other side. He was pretty lucky. “Anything could have happened. You know what kids are like, they try to brush things [off]. I’m just glad that mum knows the kids so much.”\n\nEven Talagi himself, with the benefit of hindsight, can appreciate his good fortune. “Thinking back to it, it was a pretty scary time,” Talagi said. “A punctured lung, it’s definitely not to be taken lightly. It was a pretty hard period for me being in hospital for two weeks. Blaize talagi at the Panthers’ academy earlier this week. Credit: KATE GERAGHTY “I got off the field and the doctor there said it was just a stitch. I didn’t want to go to hospital, didn’t want to go to the doctor or anything like that. It just got to a point where it got too bad, and my mum was like, ‘We’re going.’ I’m lucky we did. “It was pretty serious, so I’m very grateful that we got it sorted out. I’m glad to move on from that, and I’m feeling good.”\n\nThere is every reason for Talagi to feel good about life at the moment. After a breakout debut NRL season at Parramatta, he has come of age at Penrith, playing in the halves alongside Nathan Cleary at a team attempting to win its fifth consecutive title. It has been a successful shift, but one that also took its toll. The 20-year-old played most of his junior football for the Eels and was promised Clint Gutherson’s No.1 jersey. Deciding to instead accept an offer from arch-rivals Penrith was not a decision he made lightly. “I felt for Blaize going through all that,” Byron said. “It wasn’t easy for him. Not so much the attention, he felt he didn’t want to let Parra down. They gave him an opportunity, putting other people before him. We are blessed to have good people around us to go through the pros and cons. “We’ve got our own circle and Blaize values everyone’s opinion, but ultimately, it’s his call. He chose to go and learn, which is the best thing for him. At this time in his career, it’s all about learning. He’s at the right place.” There were some challenges to overcome on arriving at the foot of the mountains: a shoulder injury that required surgery resulted in an interrupted off-season, and when the season proper commenced he began it in reserve grade.\n\nLoading It was a step backwards for a youngster who had burst onto the NRL scene while still in his teens. When he eventually got the opportunity to pull on the No.6 jersey that Jarome Luai had made his own, the Panthers were on a losing streak that resulted in them sitting in last spot after 12 rounds. “It wasn’t always sunshine and rainbows, but we’re in a good place,” Talagi said. However, the move has been beneficial for all parties, with the Panthers eyeing a sixth consecutive grand final if they can defeat Brisbane at Suncorp Stadium on Sunday. And of course, there’s the chance to play with and learn from Cleary.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/don-t-blame-the-ref-sloppy-wallabies-need-to-look-at-themselves-20250928-p5myez.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Don’t blame the ref: Sloppy Wallabies need to look at themselves",
        "publish_date": "Sun, 28 Sep 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The Wallabies’ 33–24 loss to the All Blacks at Eden Park looked like two Test teams playing under the illusion that they would be refereed the same way that they are in Super Rugby Pacific.\n\nThat was never going to be the case, and both sides must take their share of responsibility for an ill-disciplined clash that never hit any great heights.\n\nMaligned whistleblower Andrea Piardi’s lack of action against Jordie Barrett for a tip tackle was problematic, but frankly, at least one-third of the Wallabies’ penalties were obvious and avoidable — offside at the ruck, no-arms tackles, and playing the man at the lineout, to name but three.\n\nWe know the Wallabies’ discipline has been an issue in recent years — it undermined Dave Rennie’s tenure — and there are clearly some deep-rooted bad habits that even Joe Schmidt is finding hard to break. What is allowed to pass in Super Rugby Pacific isn’t tolerated in the Test arena, and the Wallabies need to correct their course before the end-of-year tour of Europe.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nine-out-of-10-aussies-admit-to-distracted-driving-20250928-p5myfn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nine out of 10 Aussies admit to distracted driving",
        "publish_date": "Sun, 28 Sep 2025 09:28:27 +1000",
        "category": "finance",
        "authors": [],
        "text": "Nine out of 10 Aussies admit to distracted driving\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Take The Age quiz",
        "publish_date": "Sun, 28 Sep 2025 09:15:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "WHERE AM I?\n\nWhere is this eye-catching building located? Credit: ARM\n\nNicknamed “The Dome”, this grotto-like building has been likened to an eggshell and giant brain. The $45.5 million structure contains a number of public spaces, including a cafe and exhibition space, and celebrates its 10th birthday this year. What is it, and where is it located? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? The Williamstown Timeball Tower is located at Point Gellibrand Coastal Heritage Park, Williamstown.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/pm-meets-with-the-king-20250928-p5myff.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "PM meets with the King",
        "publish_date": "Sun, 28 Sep 2025 09:13:15 +1000",
        "category": "finance",
        "authors": [],
        "text": "PM meets with the King\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw6-chelsea-vs-brighton-20250928-p5myfb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW6: Chelsea vs Brighton",
        "publish_date": "Sun, 28 Sep 2025 09:07:51 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW6: Chelsea vs Brighton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw6-crystal-palace-vs-liverpool-20250928-p5myfd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW6: Crystal Palace vs Liverpool",
        "publish_date": "Sun, 28 Sep 2025 09:07:42 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW6: Crystal Palace vs Liverpool\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw6-brentford-vs-man-utd-20250928-p5myfc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW6: Brentford vs Man Utd",
        "publish_date": "Sun, 28 Sep 2025 09:06:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW6: Brentford vs Man Utd\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/albo-huge-call-aussie-republic-234237590.html",
        "title": "Albo’s huge call on Aussie republic",
        "publish_date": "2025-09-28T00:58:54Z",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese has declared he will not hold a referendum on a republic while he is prime minister after meeting with King Charles.\n\nThe King hosted the Prime Minister at Balmoral Castle on Saturday for a “rather wonderful lunch”, as Mr Albanese described it to the ABC.\n\nIn an interview aired on Sunday, he was asked if he had raised the idea of an Australian republic with the monarch.\n\n“No, and I think I’ve made it clear that I wanted to hold one referendum while I was prime minister, and we did that,” Mr Albanese told the national broadcaster, referencing his failed referendum on a Voice to Parliament.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We did that, and I think we’re concentrating on cost of living, and on making a real practical difference to people’s lives.”\n\nPrime Minister Anthony Albanese has met with King Charles at Balmoral Castle. Picture: Andrew Milligan / Pool / NewsWire\n\nAsked if he thought it “strange” that he had had to venture to Scotland to “visit the King of Australia”, Mr Albanese said, “Of course,” adding that King Charles “is fully aware that I support an Australian as our head of state”.\n\n“But I also respect the decisions which have been made and our system of government, and I think that’s important,” he said.\n\n“If you look at the way that I conduct myself, I always support the institutions which are there.”\n\nPressed further on the role of the Royal Family in modern Australia, he said he thought they still held a “great deal of respect” in the country.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Their majesties, when they visited Australia recently, King Charles and Queen Camilla were very well received,” Mr Albanese said.\n\n“They work hard. They’re interested in our place in the world.\n\n“They’re very interested in the Commonwealth … and I think they are respected.”\n\nThe question of whether to do away with the monarchy has loomed over Australia for nearly 200 years.\n\nIdeas of a republic were bandied about well before federation, inspired, in part, by the American Revolution.\n\nBut they were not taken seriously, with the 15-minute long battle for the Eureka Stockade in 1854 the closest semblance of a revolution Australia has ever had.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAppetite for a republic grew in the 1990s and a referendum was held in 1999.\n\nBut Australians rejected a republic, with just 45.13 per cent backing it.\n\nPolling in recent years has also shown the bulk of Australians would prefer to stick with the Royal Family.\n\nDuring the King’s visit last year, a Roy Morgan poll found 57 per cent of Australians surveyed believed Australia should stay a constitutional monarchy, while 43 per cent said Australia should become a republic with an elected president.\n\nA YouGov poll in 2023 also showed Australians were not in a rush ditch the Crown.\n\nMeanwhile, the Australian Republican Movement has claimed up to 92 per cent of Australians “are open to becoming a republic”.\n\nMore to come.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-mums-trick-to-growing-lots-of-food-in-tiny-suburban-backyard-secret-weapon-002905216.html",
        "title": "Aussie mum's trick to 'growing lots of food' in tiny suburban backyard: 'Secret weapon'",
        "publish_date": "2025-09-28T00:29:05Z",
        "category": "finance",
        "authors": [],
        "text": "It all started with a 30x40cm veggie patch.\n\nHoping to provide some entertainment for her then six-year-old son, Breanna Parker placed a capsicum plant and a couple of carrots in the “very, very tiny” structure in the backyard of her suburban Melbourne home during Covid.\n\n“I thought he might get excited to see some veggies grow,” the primary school teacher, who was pregnant and on maternity leave at the time, told Yahoo News Australia on Thursday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHowever, in a surprising twist of events, it was the 33-year-old who ended up enjoying playing in the soil the most, igniting a “green thumb” that had been passed down in her family for generations. Now, Breanna’s small 400-square-metre block is teeming with vegetables, fruit and native flowers — appearing like an oasis in the midst of a sea of synthetic turf and concrete.\n\n“I grew up around nature and greenery,” she said, explaining that her grandmother created veggie patches at her country homestead in Victoria, where she also had chickens. Breanna’s mum also “loves” her ornamental garden.\n\n“The concept of going to nurseries and being around plants has always been in my background,” the teacher told Yahoo, noting that she wasn’t really old enough at the time to appreciate her grandmother’s efforts.\n\n“Now, I look back and can see and understand the things that she used to do, and I guess try to replicate that in my own very, very tiny way.”\n\nSmall suburban yards can grow a lot of food, Aussie mum says\n\nSeeking “quality food” to feed her growing family, Breanna decided to embrace her newly ignited passion and transform her suburban backyard into an edible garden, and filled the front with an array of native plants, reflecting a growing trend across Australia.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I remember people telling me ‘there’s no space’. I would keep being told you can’t fit that. So I was like well, watch this,” she said, adding she’s always been a “bit of a rule breaker”.\n\nDetermined, the 33-year-old “set out to prove that even tiny gardens can grow a lot of food”. With research, and a lot of trial and error, Breanna’s dream soon became a reality and her backyard is now brimming with seasonal fruits, vegetables and herbs — all of which are thriving in raised plant beds, pots or grow bags, which help her make the most of the small space.\n\n“I played around a lot with positioning, where different things can and can’t grow, because I found that a lot of labels [on seed packets] don’t reflect what you can really do in a small space,” Breanna said. “A lot of things that might say full sun, which typically people associate with eight to 10 hours of full sun, can actually tolerate less.”\n\nThe transformation has not only brought her joy, but has helped cut down on her family’s grocery bill. Source: Supplied\n\nGardener reveals 'secret weapon' to tiny garden growing\n\nThe mum said one of her “little secret weapons” is interplanting — a technique where two or more kinds of plants are grown together to maximise space and soil.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“That is the method of growing I found most successful for a little garden. By intensive interplanting, everything is mixed up, jumbled up and crammed in together, and you’re creating a little mini ecosystem within your garden bed,” she explained.\n\n“When a plant finishes or is harvested, it needs to come out, I then just plug that hole with something else. So I always have things in my garden, it’s never completely blank, start again.”\n\nHer front yard is now a habitat garden for native bugs, critters and birds, which help her control pesky pests across the entire property.\n\n“The front garden feeds nature and the back garden feeds us,” Breanna, who is now teaching others how to do the same on their residential properties through her new business Tiny Garden Growing, said. Recently, she even consulted with a woman about how to make the most of her balcony.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Our blocks of land are getting smaller and smaller, and our lives are getting busier and busier, so I think we need to find another way to have people still prioritising their health and the food that they eat,” she added.\n\n“It would be amazing to get to a point where we could veggie swap, and then we wouldn’t have to rely on supermarkets as much.”\n\nThe transformation has not only brought her joy, but has helped cut down on her family’s grocery bill, with the mum now checking her yard instead of her pantry before heading to the shops.\n\nBreanna says her native front garden (right) helps keep bugs at bay in her backyard. She has also utilised the strip of land along the side of her house (left). Source: Supplied\n\nBreanna's top tips for growing food in your garden\n\nThe biggest challenge of a suburban garden is sun, not space — think about where the sun is and how it moves through the garden. Using pots and grow bags not only help you manage small spaces, but also allows you to easily move the plants so they can chase the sun.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPrioritise soil health — I make sure that my soil is really rich and nutrient dense to begin with. Healthy soil means healthy plants. And then when you intensively interplant everything, it really does look after itself.\n\nIgnore the plant labels — if you look at the label on a plant that you buy from the shops, it’ll say this broccoli needs 80 centimetres of space. Well, that’s not really practical to somebody who only has one square meter of growing space. The spacing recommendations are there for commercial farming. You don’t need to have things spaced apart so they’re not touching.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    }
]