[
  {
    "url": "https://www.9news.com.au/national/super-industry-apologies-for-systemic-failures-that-caused-grieving-aussies-genuine-suffering/50912d75-f711-4901-badf-69f801e666de",
    "title": "Super industry apologies for systemic failures that caused grieving Aussies 'genuine suffering'",
    "publish_date": "Mon, 31 Mar 2025 01:19:03 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "The superannuation industry has apologised for systemic failures that left Australians grieving the death of a loved one with added distress.\n\nThe Australian Securities and Investments Commission (ASIC) released its landmark death benefit claims handling report today which investigated 10 trustees — Australian Retirement Trust, Avanteos, Brighter Super, Commonwealth Superannuation Corporation, HESTA, Hostplus, NM Super, Nulis, Rest and UniSuper — over the two years to March 31, 2024.\n\nIt found that none of the trustees, which together represent 38 per cent of all member benefits in super, monitored or reported on their end-to-end times for handling claims or performance.\n\nRear view of casually clothed senior couple going over paperwork at home (Getty)\n\nThe report also identified that 78 per cent of claims that were reviewed in the two-year period were delayed due to processing issues within the trustees' control, with members living in First Nations postcodes experiencing even greater delays. ﻿\n\nOf those claims, 27 per cent were met with poor customer service including phone calls not being returned, queries dismissed and claimants asked for unreasonable information.\n\n\"Many of the complaints we read were distressing. We saw deep grief, vulnerability, frustration and genuine suffering,\" ASIC Commissioner Simone Constant said.\n\nIn one case, a trustee took more than 500 days to pay a $100,000 death benefit to a woman grieving the loss of her husband but still has not received the payment.\n\nThe report found the trustee had failed to respond to her concerns about financial hardship and did not support her when she struggled to navigate the claims process. ﻿\n\nASIC Chair Joe Longo and ASIC Commissioner Simone Constant. (Louie Douvis)\n\nIn another instance, a wife whose husband of more than 20 years had died from cancer, received the $600,000 death benefit payment three weeks later than she should have.\n\nShe also faced poor customer service after several months of frustrating interactions, including when it took two months and two follow-ups to receive a response to a query.\n\nASIC called on the super industry to immediately review and address ﻿death benefit claims handling deficiencies by adopting its 34 recommendations, including streamlined processes and procedures, better guidance and training for staff and removing barriers for First Nations members.\n\n\"Grieving Australians should not have to suffer further stress because of the failure of superannuation trustees to approach claims in a timely, clear, and respectful manner,\" Constant said.\n\n\"At the heart of this issue is leadership that doesn't have a grip on the fund's data, systems and processes — and ultimately it is the customers who suffer for it,\" ASIC chair Joe Longo added.\n\n\"This kind of disconnect is unacceptable in any area of corporate Australia, but in the superannuation sector it is particularly serious, because super affects everyone from the boardroom to the living room.\"\n\nThe Association of Superannuation Funds of Australia (ASFA) has welcomed the report and apologised for the problems plaguing the sector.\n\n\"The superannuation sector knows we have let down some of our members and their families at a time when they needed us, and we are sorry,\" ASFA chief executive Mary Delahunty said.\n\n\"As a sector, we are committed to keep working until we get it right.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/nsw-glen-innes-home-11-month-old-boy-dies-in-suspicious-circumstances/b1782b59-a4b3-413f-ba7b-79719f6c7893",
    "title": "Baby boy dies in suspicious circumstances at regional NSW home",
    "publish_date": "Mon, 31 Mar 2025 01:03:51 +0000",
    "category": "sports",
    "authors": [
      "Mar"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/actor-richard-chamberlain-known-for-dr-kildare-dead-aged-90/69df9a43-82fc-444d-b171-3a327d00a25a",
    "title": "Actor Richard Chamberlain, known for 'Dr Kildare', dies aged 90",
    "publish_date": "Sun, 30 Mar 2025 22:35:27 +0000",
    "category": "entertainment",
    "authors": [
      "Mar"
    ],
    "text": "Richard Chamberlain, an actor who got his start playing a hunky TV doctor and went on to become a miniseries maestro, has died, according to his publicist. He was 90 years old.\n\nChamberlain died last Saturday in Hawaii of complications following a stroke, publicist Harlan Boll said in a statement. The award-winning Thorn Birds star would have turned 91 on Monday.\n\nChamberlain, a three-time Golden Globe winner, wore many hats over the years – actor, singer, soldier, painter, author – but he first rose to prominence and cemented his heartthrob status playing a handsome young physician in the 1960s series, Dr Kildare .\n\nREAD MORE: Sydney suburb rocked as three children and woman found stabbed\n\nActor Richard Chamberlain has died aged 90. (Photo by Matt Sayles/Invision/AP, file) (MATT SAYLES/INVISION/AP)\n\nThe series aired in the US on NBC between 1961 and 1966. In 1963, Chamberlain won a Golden Globe for best male TV star for his performance as Dr Kildare.\n\n\"It took right off all around the world, as a matter of fact,\" Chamberlain said in a 2021 interview. \"I was getting all of this attention and stuff and it was my absolute, total dream come true. I was so happy with it.\"\n\nChamberlain also had a thriving film career. In 1970, he played Octavius Caesar in Julius Caesar , alongside Charlton Heston and Jason Robards, and appeared in 1973's The Three Musketeers alongside Raquel Welch and Oliver Reed. In 1974, he had a role in the Oscar-winning film The Towering Inferno .\n\nIn the 1980s, Chamberlain also became known as the \"king of the mini-series,\" according to the Associated Press. And it's clear to see how he earned the moniker.\n\nHe starred in the hit miniseries' Shōgun in 1980 and The Thorn Birds in 1983. Each earned him a Golden Globe. In 1996, he reprised his Thorn Birds role of Father Ralph de Bricassart in the TV movie The Thorn Birds: The Missing Years .\n\nRichard Chamberlain achieved stardom with his portrayal of a handsome doctor in the US television series Dr Kildare. (Nine)\n\nChamberlain also played the role of Jason Bourne in the first on-screen iteration of the Bourne Identity franchise, appearing in the TV mini-series in 1988. He later went on to star in several films and TV movies throughout the 1990s including Birds of Prey and The Lost Daughter.\n\nThrough the aughts, Chamberlain appeared as a guest star on many modern-day sitcoms and TV comedies, including Will and Grace , The Drew Carey Show and Desperate Housewives .\n\nHis final credit on his IMDb page is for the 2019 drama-mystery Finding Julia .\n\nIn addition to a brief career as a recording artist, Chamberlain took several memorable stage roles over the years, including a run as Henry Higgins in My Fair Lady and a brief stint on Broadway opposite Mary Tyler Moore in Breakfast at Tiffany's, which closed in previews.\n\nActor Richard Chamberlain had a stint in theatre during the 1990s, starring in the stage version of My Fair Lady. (AP Photo/ Jan Bauer, file) (AP)\n\nBorn in Los Angeles, California, Chamberlain grew up in Beverly Hills with his parents and older brother Bill before earning a bachelor's degree in arts from Pomona College, Boll's statement noted.\n\nAfter graduating, Chamberlain joined the US Army and served 16 months in Korea, where he earned the rank of sergeant.\n\nChamberlain is survived by his longtime partner Martin Rabbett.\n\n\"Our beloved Richard is with the angels now. He is free and soaring to those loved ones before us,\" Rabbett told CNN in a statement Sunday. \"How blessed were we to have known such an amazing and loving soul.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/orbital-rocket-crashes-seconds-after-takeoff-in-rare-european-spaceport-launch/4be0b009-b463-4258-8837-d9048bf644be",
    "title": "Orbital rocket crashes seconds after take-off in rare European spaceport launch",
    "publish_date": "Sun, 30 Mar 2025 20:28:14 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "A German start-up's orbital rocket spun out and crashed seconds after take-off Sunday, in a rare European test flight that the makers said \"met its set goals.\"\n\nThe flight, from a spaceport in northern Norway, marked the first time a rocket capable of reaching orbit was launched from continental Europe excluding Russia, manufacturer Isar Aerospace said.\n\nThe rocket, called Spectrum, was airborne for only around half a minute before dramatically falling into the chilly Norwegian Sea.\n\nREAD MORE: How the teals and other independents could shape the federal election\n\nOrbital rocket crashes seconds after take-off in rare European spaceport launch (Isar Aerospace via AP via CNN Newsource)\n\nIsar Aerospace and other European start-ups are scrambling to seize a segment of a rapidly expanding space race, currently dominated by companies and government-owned entities in the United States and China.\n\nAnd the company framed Sunday's launch as a step toward that goal, saying in a statement: \"Isar Aerospace met its set goals: After ignition of its first stage, Spectrum successfully lifted off … for its first test flight lasting approximately 30 seconds. This allowed the company to gather a substantial amount of flight data and experience to apply on future missions.\"\n\n\"As a company with European roots, we are proud to have shown that Europe has an enduring capacity for bold thinking and grand achievements,\" Daniel Metzler, the company's chief executive and co-founder, said in the statement.\n\n\"We will be able to serve customers from around the world to bring their satellites into space and to help Europe solve a major blind spot in its security architecture: access to space.\"\n\n'Wow': Inside Jeff Bezos' first flight into space View Gallery\n\nThe European Space Agency, which is made up of 23 member nations, has already launched rockets into orbit, as have companies such as the French-run ArianeGroup. But both have launched flights from outside Europe, mainly at spaceports in the Americas.\n\nLeaders in the space industry include Elon Musk's SpaceX, which has launched hundreds of rockets into orbit.\n\nEurope has historically lagged behind, both in the initial space race of the 1960s and 1970s and the subsequent rush by commercial companies to reach orbit.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/daylight-savings-time-2025-when-does-it-end-australia-do-clocks-go-back-forward-april-explainer/6178bb32-e46c-453e-a9de-16a0d863bd07",
    "title": "When does Daylight Saving end? Your questions answered",
    "publish_date": "Sun, 30 Mar 2025 21:11:27 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "As the month of April approaches, so does the end of daylight saving.\n\nMost states and territories will turn their clocks back an hour next month to make better use of daylight hours during autumn and winter.\n\nHere's everything you need to know.\n\nREAD MORE: ﻿ How to access cyclone recovery payment\n\nThe clocks will go back this April as Daylight Saving ends. (Getty)\n\nWhen does daylight saving time (DST) end?\n\n﻿Daylight saving time ends on April 6, 2025 for those in NSW, Victoria, South Australia, Tasmania and ACT.\n\nThe clocks in these states will turn back at 3am in the current time (DST), meaning the clocks will read 2am (AEST) again when it turns to 3am.\n\n﻿ Do we lose or gain an hour of sleep?\n\nMany people forget which way the clocks turn in April and ﻿again in October.\n\nDaylight saving time (DST) ends in April, when the days become shorter and there is less daylight to conserve in the evenings, while the mornings become darker.\n\nTherefore, the clocks turn back by an hour in April, allowing residents in states and territories affected to sleep in longer through the darker mornings, and to enjoy the daylight while it lasts. ﻿\n\nThousands of NSW fish deaths expected due to cyclone 'blackwater' View Gallery\n\nWhat is the time difference between states and territories?\n\nAll Australian states and territories except for Queensland, the Northern Territory and Western Australia observe daylight saving. ﻿\n\nThis means that NSW, Victoria, Tasmania and ACT will be running on the same time as Queensland, Australian Eastern Standard Time, when daylight saving ends. ﻿\n\nThese areas are currently one hour ahead of Queensland, and have been since last October when daylight saving started.\n\nREAD MORE: Millions of Australians to receive boost to Centrelink payments\n\nSouth Australia is singled out - although it does observe daylight saving, it will remain, as it always is, 30 minutes behind AEST, to account for its position geographically. This means it will change from Australian central daylight time (ACDT) to Australian central standard time (ACST).\n\nMeanwhile, Western Australia will continue to run on its two time zones - Australian western standard time (AWST) ﻿which covers Perth and the west coast, and Australian central western time (ACWT), which is 45 minutes ahead of AWST.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/maternity-leave-paternity-cancelled-after-baby-loss/cecd4eb1-4c42-4709-a0b7-afa147018a3d",
    "title": "'Horrific and inhumane': Mum grieving baby's death forced back to work",
    "publish_date": "Sun, 30 Mar 2025 08:01:42 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "When Chris Breen and his wife lost their baby when she was just six weeks old, they needed time to grieve.\n\nBut while Breen was still able to take his planned three months of parental leave, his wife, who didn't want her name published, was forced back to work.\n\nThat's because her planned paid maternity leave was cancelled by her employer.\n\nWhen Chris Breen and his wife lost their baby when she was just six weeks old, they needed time to grieve.But while Breen, 55, was still able to take his planned three months of parental leave, his wife, who didn't want her name published, was forced back to work. (Nine)\n\n\"Priya's mum was devastated,\" Breen told 9News.\n\n\"It was so unfair.\n\n\"When she was back at work, crying, I was at home.\n\n\"It made a big difference to me just having the space to deal with those emotions.\n\n\"It's just an unfair situation.\"\n\nBreen, a high school teacher employed by the NSW government, said they lost Priya, his wife's first baby, last July.﻿\n\nPriya had been in the NICU as she was born prematurely, and was doing well.\n\nBut she died a few weeks later from an unrelated condition.﻿\n\nWhen her mum told her work, the ﻿employment services company informed her she wouldn't be able to take her planned paid maternity leave.\n\nREAD MORE: More salads recalled by Coles over spinach contamination fears ﻿\n\nInstead it gave her personal leave for four weeks, which didn't even cover the time her daughter was alive.\n\nShe did get government entitlements but Breen said when they contacted the Fair Work Ombudsman, they were told the firm did nothing wrong. It was allowed to cancel her planned paid paternity leave.\n\nPriya had been in the NICU as she was born prematurely, and was doing well. (Nine)\n\nThe Ombudsman says if a baby is stillborn or dies in the first 24 months, an eligible employee is still entitled to take parental leave up of to 12 months - but unpaid.\n\nNow the the inner-west Sydney couple are calling for change.\n\nThey want to see a law change to offer \"humane\" rules that don't force people back to work after such losses.\n\nA petition ﻿they started calling for an end to \"cancelling maternity leave for infant death or stillbirths\" has more than 10,000 signatures\n\n\"The law is silent on whether they can cancel paid leave - it differs company to company,\" Breen said.\n\nHis wife said since they started the petition other mothers who lost their babies had contacted her.\n\nSome have been allowed their full paid maternity leave but others have also had to return to work.﻿\n\n\"It is just horrific and inhumane,\" she said.\n\n\"I want the government to change the Fair Work laws and not let employers in the private sector be given the onus of whether they want to give leave, and if so how much.\"\n\nDr Giuseppe Carabetta, associate professor of employment law with the University of Technology Sydney Business School, said the rules varied for government support too.\n\n\"In the awful situation where a baby is stillborn, the employee is barred from taking what's referred to as unpaid special parental leave under our national provisions; however there is provision for unpaid parental leave, as well as compassionate leave,\" he said.\n\n﻿In 2021 Labor introduced a bill to change the law on paid parental leave for stillbirths.\n\nDespite emotional discussions, including details about a woman forced back to work 11 days after the loss of her baby, it lapsed at the end of parliament.\n\nAsked by 9News, Federal Minister for Employment and Workplace Relations Murray Watt said he would put the issue to the National Workplace Consultative Council with a view to closing any gap.\n\nA spokeswoman for Fair Work Australia issued a statement to 9News.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/federal-budget-2025-influencer-controversy-backlash-hannah-ferguson/e0697abc-cbcd-438d-a39d-37cab53d83d7",
    "title": "'Silly young woman': Backlash against budget 'influencers' rooted in sexism, one says",
    "publish_date": "Sat, 29 Mar 2025 19:16:30 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "Hannah Ferguson knew her presence in Parliament House's budget lock-up on Tuesday night would ruffle feathers, as it was the first time in history that influencers, content creators and podcasters had been invited into the annual event.\n\nThe 26-year-old believes that is due, in part, to the fact that most of them are young women.\n\nREAD MORE: All the winners and losers from the 2025 federal budget\n\nHannah Ferguson faced backlash for her attendance and has no doubt it's because she's a young woman. (Graphic: Polly Hanning)\n\nAs co-founder and chief executive of Cheek Media Co. and co-host of its biggest podcast, Big Small Talk , Ferguson has a monthly audience of more than 3 million Australians and a vested interest in how the budget would affect them.\n\nDespite that, she and her peers - including FSG licensed finance creator Natasha Etschmann (@tashinvests) and youth mental health charity founder Milly Rose Bannister - were reduced to 'influencers' and 'Instagram stars' by some media outlets.\n\n\"They should feel embarrassed about their willingness to attack me and try to make me look like a silly young woman,\" she told 9news.com.au of the backlash.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\n\"Why is it that someone creating content that educates the everyday voter - how does that make someone self-obsessed?\n\n\"Is it because I'm a young woman with an Instagram account that has a following? That sort of dialogue would never be projected onto a man.\"\n\nSeveral outlets referred to Bannister as an 'activewear ambassador', highlighting her partnership with Lululemon before her advocacy and charity work.\n\nSome outlets also included young female journalists from Women's Agenda and Missing Perspectives on their lock-up 'influencer' lists, including Tarla Lambert-Patel and Angela Priestley , and Alicia Vrajlal and Phoebe Saintilan-Stocks respectively.\n\nMissing Perspectives reporters Phoebe Saintilan-Stocks and Alicia Vrajlal were included on some outlets' lists of 'influencers' invited to the lock-up. (Instagram/@missingperspectives)\n\n\"That sort of dialogue would never be projected onto a man,\" Ferguson said.\n\n\"They'd never call Mark Bouris, who also primarily operates on social media and through podcasts just like me, an influencer or self obsessed. It's singularly reserved for young women.\"\n\nAnd while reports that the Labor party covered some attendees' travel costs will muddy the waters around how﻿ influencers fit into the media landscape, Ferguson confirmed she paid her own way.\n\nSeveral other new media attendees told 9news they also covered their own costs.\n\nFerguson is adamant that she and her peers wouldn't have been targeted in the same way if they were not young women with majority female audiences.\n\n﻿Through Cheek Media, she seeks to break down complex political and other issues in a way that is accessible to the millions of Gen Z and Millennial women who will be going to the polls on Saturday, May 3 for the 2025 Federal Election.\n\nFerguson breaks down complex political issues in a way that is accessible to Gen Z and Millennial women. (Instagram/@hannahferguson___)\n\nMany Australian women - especially young women - have reported feeling underrepresented in or downright excluded from our nation's political and media landscape.\n\nFerguson and the other female new media figures invited to Canberra next week are the key to changing that.\n\nWhether it's explaining how a preferential voting system works, breaking down what the Federal Budget means for women's health, or summarising ﻿key election issues, they speak directly to Australian voters who have disengaged from mainstream news.\n\nAnd it looks like those voters are listening; Cheek Media currently reaches more than 3 million Australians each month and Ferguson predicts that number will climb﻿ as the election approaches.\n\nIn pictures: The federal budget newspaper front pages View Gallery\n\n\"What I'm trying to do is speak to young women, who for a long time felt excluded and uninvited into this space,\" Ferguson said.\n\n\"[And] ensure that the stuffy, complicated language of politics and power systems is broken down and communicated through social media in such a way where people feel that they can make an informed choice about their vote.\"\n\nIt's not just Gen Z and Millennials turning to new media for their news either.\n\nThe ﻿ Digital News Report: Australia 2024 found that almost half of Australians use social media to access news, about 30 per cent of Ferguson's audience are aged ﻿45 to 54, and she has more over-60s following her than under-20s.\n\nIt should come as no surprise, then, that Labor and other political parties are turning to new media to help them connect with voters as the election looms.﻿\n\nBig Small Talk podcast co-hosts Ferguson and Sarah-Jane Adams with Prime Minister Anthony Albanese. (Instagram/@hannahferguson___)\n\nUS politicians have already shown the world how it's done, with US President Donald Trump and former Vice President Kamala Harris both taking advantage of social media and podcasts to boost their election campaigns in 2025.\n\nNow it seems Australian parties are poised to follow suit with the help of many young, female new media personalities.\n\n\"The way to maintain relevance with the Australian public and to reach them in new ways, especially low engagement voters, is through social media﻿,\" Ferguson said.\n\n'\"It's time to adapt. New media is here and I believe that now we've blasted through the door, especially with the budget, it marks a huge turning point in Australian media.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/labor-coalition-power-price-modelling-reputex/105116056",
    "title": "Labor and Coalition coy on power prices, with modelling kept at arm's length",
    "publish_date": "Mon, 31 Mar 2025 01:53:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Labor and Liberal leaders are both playing coy on how much their energy policies will cut power prices — if at all — as campaigning on the cost of living continues.\n\nElectricity costs soared early in Labor's term, as the outbreak of war in Ukraine and a global reordering of energy supply forced up power prices.\n\nIt also thwarted a promise Labor made at the last campaign that its plans to ramp up wind and solar power would cut power bills by $275 — a failed promise the Coalition has not been shy in reminding people.\n\nLabor maintains electricity bills are several hundred dollars cheaper than they would have been without the government's interventions and bill rebates.\n\nBut Prime Minister Anthony Albanese is distancing himself from the original RepuTex modelling that predicted power prices would fall by $275 by 2025, with the government previously arguing that the world had experienced the biggest energy crisis since the 1970s in the period since it was commissioned.\n\nAsked in 2022 whether he thought the price promise was achievable, Mr Albanese responded: \"I don't think, I know. I know because we have done the modelling.\"\n\nThat modelling also predicted prices to be $378 lower by 2030 — which Labor is not holding itself to, saying more recent forecasts by the Australian Energy Market Operator and others are more robust.\n\nAsked about that modelling again today, Mr Albanese kept it at arm's length.\n\n\"Our energy policy offering is all out there. RepuTex modelling was RepuTex modelling that they put out,\" he said today.\n\nModelling wars\n\nIn the Coalition camp, Opposition Leader Peter Dutton is also facing questions on the details of his promise to force the gas giants to divert more supply into the domestic market.\n\nMr Dutton says modelling by Frontier Economics for its gas plan says adding an extra 50 to 100 petajoules into the domestic market (roughly a 20 per cent increase) would reduce the wholesale price from $14 to $10 a gigajoule — and that would flow onto consumers and businesses.\n\nThat modelling has not yet been released.\n\nIn the absence of it, Mr Dutton has not spelled out exactly by how much or when he expects his gas reservation plan to bring down prices, insisting there will be more detail available once the modelling is published.\n\nThe opposition leader insists \"it will deliver lower gas and electricity prices\", though it is unclear whether that will be in comparison to current prices, or what power prices would otherwise be projected to be.\n\n\"We're not going to make the same mistake that Anthony Albanese did before the last election,\" Coalition campaign spokesman James Paterson said on Sunday.\n\nClimate Change Minister Chris Bowen said the Coalition was trying to \"hide\" the true cost of its plan to build a domestic nuclear industry.\n\n\"They don't want to talk about a plan that is riddled with fundamental errors. Their so-called modelling is a con,\" Mr Bowen said.\n\n\"His supposed gas 'plan' is nothing but an attempt to distract from [nuclear].\"\n\nWhat's happening with prices?\n\nThe energy regulator recently announced benchmark power prices would increase by between 5 and 9 per cent for some households on Australia's east coast and in South Australia from July.\n\nThose price increases will only affect about a tenth of customers directly, who are not on more competitive arrangements — but it also sets a price direction for the energy retailers.\n\nAre energy retailers profiteering? Profit results from AGL and Origin have prompted calls for more to be done to reduce electricity and gas prices.\n\nLabor is promising a one-off extension to power rebates of $150 that will be delivered over two instalments in the back half of this year.\n\nThose rebates, which would be the third tranche offered by under Mr Albanese, have helped to artificially suppress electricity prices and their full impact on inflation.\n\nThe Australian Bureau of Statistics in December estimated without those and similar state rebates, electricity prices would be more than 40 per cent higher than they are today.\n\nThe Australian Energy Market Commission late last year suggested residential prices could be around 13 per cent lower in a decade \"if renewable and energy and infrastructure development proceeds as expected\".\n\nBut with nothing to replace the Commonwealth rebate at the end of this year, household energy bills would be expected to rise again.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/in-vitro-interview-talia-zucker-will-howarth/105099024",
    "title": "The Aussie couple who made a clone thriller, featuring a Succession star",
    "publish_date": "Mon, 31 Mar 2025 01:11:32 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "The filmmakers behind In Vitro didn't set out to make a sci-fi film centred on coercive control against the spectre of ecological destruction.\n\nCo-writer and lead actor Talia Zucker, whose brainchild the film is, simply envisioned a couple living remotely with an unhealthy, hidden tension bubbling beneath the surface between them.\n\nFast facts about In Vitro What: An unsettling, tense tale of mistruths and betrayal set in a world ravaged by climate change and ecological disasters. Directed by: Will Howarth, Tom McKeith Starring: Talia Zucker, Ashley Zukerman, Will Howarth When: In cinemas now Likely to make you feel: On the edge of your seat\n\nSet in an unspecified future where there are no insects or birdsong, the new Australian ecological thriller catapults us into a world where environmental disasters have wreaked havoc on livestock production, among other things.\n\nExperimenting with animal cloning biotechnology on an isolated cattle property, husband-wife duo Jack (Ashley Zukerman of Succession and Apple Cider Vinegar fame) and Layla (the film's co-writer Zucker and Lake Mungo lead) are facing issues in their production line — all of which are compounded by the sudden incursion of an unexplained presence on their property.\n\nCo-writer and co-director Will Howarth (who also plays a farmhand named Brady) says the sci-fi aspect of the film came about organically.\n\n\"Whether it's sci-fi or horror or a psychological thriller, I like it when a big concept is representative of something else,\" he says.\n\n\"Climate change and ecological collapse certainly informed the setting, the breakdown of the outside world and the isolated experience Jack and Layla have, but it wasn't something we set out to make a film about. These themes came naturally into it, and we thought they'd be interesting to explore.\"\n\nLayla (Zucker) is isolated on the remote farm and kept in the dark by her husband. (Supplied: Madman)\n\nPolymathic trio Howarth, Zucker and Tom McKeith, have crafted an unsettling, tense tale of mistruths and betrayal set in a world that looks familiar but holds portents of danger.\n\nPartners in real-life, as well as in their creative pursuits, Zucker and Howarth started working on the idea when they were living together in LA. The film was developed through the Sundance Screenwriters Lab, supported by Screen Australia and Screen NSW, and has already picked up an accolade in the form of the prestigious Dark Matters Jury Award at the Austin Film Festival.\n\n\"Tom, Will and I worked together for such a long time on the script and we did so much development work together,\" Zucker says.\n\n\"We workshopped every scene in the film, acted them out to see if they worked, and pre-shot the entire film on our iPhones just to see if the scenes were working as we hoped.\"\n\nBut the execution of Zucker's original idea — which initially took its inspiration from taut, contained psychological thrillers like Ex Machina — looks very different to its previous form.\n\n\"The original story was told from the male perspective,\" Zucker says. \"It was quite a different feeling. And then one of us had the idea to flip the perspective and tell it from Layla's point of view, which is when it started to feel like a thriller — more tense and much scarier.\n\n\"Because Layla doesn't know what's going on, the genre element of the film started to become more apparent as we developed the story further and told it from her perspective.\"\n\nAustralian-American actor Ashley Zukerman is the lead in this film, after starring as Clive in Apple Cider Vinegar and Nate in Succession. (Supplied: Madman)\n\nZukerman was always who the trio had in mind for the subtly menacing and inscrutable character of Jack.\n\n\"Ash had his own take on Jack and brought this quiet intensity that I wasn't expecting,\" Howarth says.\n\n\"There are certain points in the film — and this isn't a huge spoiler — where Jack isn't telling the truth to his wife. I remember shooting these scenes and getting lost. Ash, in his portrayal of Jack, was so convincing when he was lying to his wife that we couldn't even tell if he was telling the truth or not.\"\n\nA different take on Australian apocalypse\n\nUsing old-timey technology in a futuristic setting, the production values of In Vitro have a touch of Severance to them — enhanced by the aesthetic vision of sound designer Matt Perrott and production designer Alexi Wilson.\n\n\"Matt had to carefully strip out every bird chirp and every insect sound to make the landscape feel dead. His approach to how the technology in the movie sounded was to go as far back as he could go,\" Howarth says.\n\n\"And then Alexi had such a good idea about the vehicles on-set. She was like, 'What if it looks like everyone's driving old utes, but they're actually EVs?'\"\n\nAlthough an ecological thriller, the state of the relationship between Jack and Layla makes up a lot of the tension in this film. (Supplied: Madman)\n\nThe desolation of Jack and Layla's existence is set against the breathtakingly beautiful backdrops of Cooma in the Snowy Monaro region of New South Wales and Goulburn, adroitly captured under the eye of cinematographer Shelley Farthing-Dawe.\n\nHowarth says the gothic elements of the landscape — the dead trees, the vast open plains — complemented the horror undertones of the film.\n\n\"The reason we shot in these locations is because we didn't want the film to feel like other Australian apocalyptic future worlds that we've seen before; that burnt red dirt, burnt out sky look that's famous from other films like Wake in Fright or Mad Max.\n\n\"We wanted to do something that felt like it could be anywhere in the world. And we also wanted the landscape to feel uneasy and inherently eerie; it's an unfamiliar version of Australia.\"\n\nNew cloning techniques are used to supply meat \"for a growing population, still hungry for the real thing\". (Supplied: Madman)\n\nFittingly for the film, Zucker recalls shooting it in the summer of 2022 amid the most tumultuous weather, which they tried to bring into the final edit.\n\nZucker and Howarth say they hope to wear fewer hats on their next film project, but they can't wait to see what Australian film-goers think of their debut feature effort: a sci-fi film that joins the pantheon of crime thrillers and horrors Australia is especially known for.\n\n\"In the last few years, there's been so many interesting films being made in this lower-budget range and it would be great if that continued to happen,\" says Zucker.\n\nHowarth agrees that the future of filmmaking in Australia is exciting.\n\n\"We want to keep making films in Australia. We moved back from the US to do just that.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/richard-norton-actor-martial-artist-choreographer-dies/105116222",
    "title": "Actor Richard Norton dies aged 75",
    "publish_date": "Mon, 31 Mar 2025 01:00:31 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian actor, stunt man, and choreographer Richard Norton has died, aged 75.\n\nNorton was involved in more than 80 films since the 1970s, and worked alongside some of the biggest names in Hollywood.\n\nHis wife Judy Green confirmed Norton died at home in Melbourne in an Instagram post on Sunday.\n\n\"I am numb and devastated, I have no words I have lost my everything,\" Ms Green said.\n\n\"I know there is, and will be lots of love and shock that we have lost this incredible human being.\"\n\nLoading Instagram content\n\nA mainstay of martial arts films\n\nNorton was born in Croydon, Sydney in 1950 and began studying martial arts as a child in the 1960s, training in judo and karate before picking up work as a security guard on live tours.\n\nHe trained under experts such as the Machado brothers and Chuck Norris over his lifetime and was a master in various martial arts, including Muay Thai, aikido, and Brazilian jiu-jitsu.\n\nHe was known for running fitness and training sessions for his security clients, who included ABBA, the Rolling Stones, and James Taylor.\n\nNorton and action star Chuck Norris met when Norris came to Australia in 1976, and they would go on to duke it out in 1980s action flick The Octagon.\n\nThe two struck up a friendship which would continue as Norton moved to the United States and into the realm of fight choreography.\n\nHe was hired as the fight coordinator on Norris's television show Walker, Texas Ranger in 1993, and appeared in guest roles in eight episodes of the show.\n\nAction star Chuck Norris paid tribute to friend Richard Norton in an Instagram post. (Instagram: Chuck Norris)\n\nNorton was also a mainstay in the Hong Kong action scene, appearing in such films as Twinkle Twinkle Lucky Stars and Millionaire's Express, opposite icon Sammo Hung.\n\nIn a post on Instagram, Norris said he was heartbroken by the loss of his \"friend and brother\".\n\n\"The wonderful memories we shared will forever be cherished in my heart,\" he said.\n\n\" Richard, you made me not only a better martial artist but a better person. \"\n\nIn recent years Norton passed on his martial arts knowledge to a range of modern movie stars, including Margot Robbie and Will Smith on 2016's Suicide Squad and Charlize Theron for Mad Max: Fury Road in 2015, where he also had a brief role as the Prime Imperator.\n\nNorton also had an impact on a smaller scale, taking part in a fundraising event in 2017 for a family who lost a father to suicide.\n\nA pair of sais — small forked swords — used by Norton in a fight against Norris in The Octagon pulled in more than $3,500 for the auction, which raised more than $15,000 for the man's wife and two children.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/morning-after-pill-to-be-made-free-in-england-pharmacies/105116292",
    "title": "Morning-after pill to be made free in England pharmacies",
    "publish_date": "Mon, 31 Mar 2025 00:54:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "The morning-after pill is set to be made available over the counter for free in pharmacies in England this year, the UK government says.\n\nCurrently, women can get the emergency contraception pill for free from sexual health clinics run by the National Health Service (NHS) and most GP surgeries.\n\nHowever, the pill can cost up to £30 ($62) at pharmacies in the UK.\n\nStarting this year, the pill will be available for free at pharmacies, aiming to \"reduce inequalities\", according to a Department of Health and Social Care (DHSC) statement.\n\nThe move will also help free up GPs by reducing the need for women to make appointments to access the pill, the DHSC said.\n\n\"Equal access to safe and effective contraception is crucial to women's healthcare and a cornerstone of a fair society,\" Health Minister Stephen Kinnock said.\n\nThis initiative is part of a wider push to improve pharmacy's services in the UK. (Reuters: Sarah Silbiger)\n\n\"Women across England face an unfair postcode lottery when seeking emergency contraception, with access varying dramatically depending on where they live,\" Mr Kinnock added.\n\nThe National Pharmacy Association said the announcement represented \"good news for patients and pharmacies alike\".\n\nHowever, it made clear that the NHS \"fully reimburses\" pharmacies for time taken to conduct consultations required before pills can be dispensed.\n\nThe government will announce additional details on Monday local time as part of a \"package of investment and reform\" for community and retail pharmacies.\n\nOther plans include offering patients suffering depression convenient support at pharmacies when they are prescribed antidepressants, and cutting red tape and bureaucracy to give patients easier access to consultations.\n\nThe government said it would also boost financial incentives for pharmacists to identify patients with undiagnosed high blood pressure.\n\nABC/AFP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/sam-kerr-matildas-captaincy-football-australia/105116314",
    "title": "Kerr eligible to return as Matildas skipper after FA board meeting",
    "publish_date": "Mon, 31 Mar 2025 00:33:08 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sam Kerr is eligible to be considered for the Matildas captaincy role after meeting with the Football Australia (FA) board.\n\nKerr will link up with teammates in a non-playing capacity in Sydney this week after addressing her recent UK court case, where she was found not guilty on one charge of racially aggravated harassment of a police officer.\n\nShe has not played since tearing her ACL during a Chelsea training camp in January last year.\n\nSteph Catley has captained the Matildas in Kerr's absence.\n\nKerr spoke of her \"regret\" for the incident involving the police officer, with the FA board concluding it warranted no further action.\n\n\"I want to express my sincere regret for how events unfolded,\" Kerr said in an FA statement.\n\nSam Kerr says she can put 'challenging period' behind her after being found not guilty of racial harassment Photo shows A woman with dark hair pulled back in a ponytail looks emotional away from the camera walking next to a tall man The Australian soccer start has been on trial for calling Constable Stephen Lovell \"stupid and white\" amid a dispute about a taxi ride in January, 2023.\n\n\"It was an incredibly difficult period for me, my family, my club, my teammates, and especially for the fans whose support means so much to us.\n\n\"I recognise that leadership means being mindful of our actions both on and off the pitch.\n\n\"I'm proud of the Matildas, the role I have played as a member of that team, and everything we stand for, and I'm committed to learning from this experience.\"\n\nKerr's return to the Matildas is being eased through before their next coach is appointed.\n\nTony Gustavsson's permanent replacement is expected to be in place by mid-year.\n\nInterim coach Tom Sermanni, who debuted Kerr, 31, as a 15-year-old in 2009, will oversee the striker's first camp since February's high-profile court case.\n\nKerr was charged after an hour-long altercation at Twickenham police station in the early hours of January 30, 2023.\n\nThat followed a taxi journey where a drunk Kerr vomited out of the window.\n\nKerr has not played for the Matildas since 2023. (Getty Images: Visionhaus/Joe Prior)\n\nFA were blindsided when Kerr's charge came to light in early 2024.\n\nOn Monday, FA noted the incident had \"implications\" in relation to its code of conduct, but stopped short of saying Kerr had committed a breach.\n\nFA chair Anter Isaac said the incident should not overshadow Kerr's contribution to the game.\n\nMatildas 'can't wait' for Kerr to be back on pitch Photo shows Sam Kerr waves Matildas player Ellie Carpenter is throwing her arms around Sam Kerr as the Australian captain nears a return to full fitness.\n\n\"Knowing how Sam (Kerr) feels about the events, along with the additional context we've learned, has added vital perspective that the general public may not be aware of,\" Isaac said.\n\n\"Setting aside those difficulties, this one incident should not offset the incredible contributions she has made, both publicly and privately, on and off the field — for more than 15 years.\"\n\nAs part of her return-to-play program, Kerr has joined the Matildas for the March 31-April 8 international window.\n\nGranted leave by Chelsea, she will continue her rehabilitation under the supervision of the Matildas' performance support team.\n\nKerr has not yet been cleared for competitive football.\n\nBut the Matildas will be hopeful she is available to face Argentina in Melbourne on May 30 and Canberra on June 2.\n\nAAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/andrew-krakouer-former-afl-player-dies-aged-42/105116150",
    "title": "Former Magpies and Tigers AFL player Andrew Krakouer dies aged 42",
    "publish_date": "Mon, 31 Mar 2025 00:06:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former Collingwood and Richmond AFL player Andrew Krakouer has died in Perth aged 42.\n\nKrakouer played 137 games across the two teams between 2001 and 2013, winning Mark of the Year in 2011 for the Magpies.\n\nThe son of former Kangaroos and Saints player Jim Krakouer, the West Australian goalsneak died of a suspected heart attack in Perth on Sunday.\n\nKrakouer debuted for Richmond in 2001 after being drafted with pick 41 in the 2000 national draft.\n\nHe was delisted at the end of 2007, returning to Perth to play for Swan Districts in the WAFL.\n\nIn June 2008, Krakouer was found guilty of assault with intent to cause bodily harm and was sentenced to four years in jail. He was released on parole in August 2009 and rejoined Swan Districts for the 2010 season.\n\nKrakouer played a starring role for the team that season, winning the club's best and fairest, the league's best and fairest, and was named best on ground in Swan Districts' one-point grand final win over Claremont.\n\nIn 2011, he was signed by Collingwood and made an immediate impact for the reigning premiers, kicking 35 goals on the way to the AFL grand final, where he booted three majors as the Magpies went down to Geelong.\n\nKrakouer was delisted at the end of 2013 after suffering recurring leg injuries, returning to Western Australia to play for West Perth.\n\nAfter his football career, Krakouer worked on the television program Yokayi Footy and had been on special comments for Fox Footy covering the AFLW.\n\nSpeaking on SEN moments after hearing the news, former Collingwood captain and coach Nathan Buckley paid tribute to Krakouer.\n\n\"What a brilliant footballer,\" Buckley, who was assistant coach when Krakouer joined the Magpies before becoming head coach in 2012, said.\n\n\"He was just a genius. He was just a player who could do the special things — like the hanger he took in 2011 at Marvel [Docklands], was just elite.\n\n\"He just loved the game, found a way to impact and could do things other players couldn't do. He was exceptional.\"\n\nBuckley described him as a calm and quiet teammate and said he made the most of his opportunities.\n\n\"He went through a bit in his life … he probably had the worst of it and the best of it and showed real grit to fight back and do what he did in his career,\" he said.\n\n\"That's tragic stuff. So young at 42.\"\n\nIn April 2022, Former Collingwood player Héritier Lumumba claimed he, Krakouer and Leon Davis had terminated all communications with Collingwood.\n\nThe former Magpies teammates had been in 15 months of dialogue with the club to address a string of racist incidents documented in the Do Better report published in 2021.\n\nKrakouer was remembered by former Richmond teammate Matthew Richardson as \"a beautiful man who was loved by all his teammates\".\n\nEx-Tigers chief executive Brendon Gale said Krakouer was \"deeply loved\" and a \"special talent\".\n\nKrakouer is survived by his four daughters and partner, Barbara Garlett.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/boyne-burnett-inland-rail-trail-benefits/105098736",
    "title": "Tiny towns jump on plan to create Southern Hemisphere's largest rail trail",
    "publish_date": "Sun, 30 Mar 2025 23:46:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tourists are discovering inland Queensland and staying longer in small rural towns as communities capitalise on the success of rail trails.\n\nTourism bodies in Queensland's Boyne Burnett region are reporting hundreds of visitors are exploring its rail trail each month, including up to 200 people a week at its Barrimoon location.\n\nThe Burnett Inland Economic Development Organisation (BIEDO) said its popularity has led to tourists staying longer to explore more parts of what the towns have to offer.\n\nOne of the state's 26 walking, cycling and horse-riding tracks, the Boyne Burnett Inland Rail Trail (BBIRT) in the Wide Bay region, is en route to become the longest in the southern hemisphere at 271 kilometres.\n\nThe rail corridor stretches from Taragoola, near Gladstone, to Gayndah. (ABC News)\n\nThe small town of Monto, almost 500 kilometres north of Brisbane, is the halfway point on the trail.\n\nOnce known for its dairy industry, the town of just 1,100 people, has already seen a boost from rail trail tourism and just a quarter of the track is operational.\n\nThe traditional tourism season has extended to 10 months from February to November as visitors are drawn to the region to explore the rail trail, said Melinda Jones, the North Burnett deputy mayor and BIEDO vice president.\n\n\"The tourism season has increased, and also the number of visitors has increased with the opening of the rail trail, with also the art trail work that's been going on as well,\" Ms Jones said.\n\nMelinda Jones says the tourism season in Monto is running for longer. (ABC Wide Bay: Grace Whiteside)\n\n'Champions along the way'\n\nSince 2021, three sections totalling 66.5 kilometres have been opened, with a fourth currently underway.\n\nOnce fully connected, the BBIRT will stretch from Taragoola near Gladstone, south to Gayndah, taking in the entire North Burnett and the Boyne Valley in the Gladstone region.\n\nJennifer and Kevin Roth said the rail trail has \"enormous\" tourism potential. (ABC Wide Bay: Nikki Sorbello)\n\nMs Jones said the benefits of the rail trail will continue as more sections of the corridor are connected.\n\nShe said they hoped the entire trail would be opened within five to 10 years.\n\nIn Queensland, rail corridors are managed under a perpetual lease by the Department of Transport and Main Roads which also offers financial support for projects, trail development and annual maintenance.\n\nThree sections of the Boyne Burnett Inland Rail Trail have been opened. (ABC Wide Bay: Nikki Sorbello)\n\nBBIRT president Desley O'Grady said completing the trail was reliant on volunteers and funding.\n\n\"We've got champions along the way in each of the towns that support the trail and tell us what they need in their section,\" Ms O'Grady said.\n\nThinking outside the box\n\nJennifer and Kevin Roth put their love of cycling into opening their \"retirement\" business, offering tours and supported rides on the BBIRT.\n\n\"We haven't had a lot of international visitors, but they are starting to hear about us and they are starting to make moves to start planning trips,\" Ms Roth said.\n\n\"It's not just about us, it's about the entire region working together to create just an enormous tourism potential.\"\n\nMs Roth said it would revitalise smaller communities across the length of the ride.\n\nThe Boyne Burnett Inland Rail Trail, when fully connected, will be the longest rail trail in the Southern Hemisphere at 271km. (ABC Wide Bay: Nikki Sorbello)\n\n\"Those smaller towns probably have the most to gain, where at the moment there are a cluster of houses, but in time to come there could be a general store and a cafe and accommodation,\" she said.\n\n\" There's going to be huge openings for people to think outside the box of what they might have, and what they can bring to the trail too. \"\n\nEconomic opportunity\n\nAdventure-based tourism is an area of growth and opportunity says Vikki Schaffer, a senior lecturer in School of Business and Creative Industries at the University of Sunshine Coast.\n\nVikki Schaffer says tourists are looking for a meaningful adventure. (Supplied: University of Sunshine Coast)\n\n\"A lot of adventure tourism visitors are looking for something that's meaningful, that's authentic, that gives them the opportunity to have self-actualisation, to be able to say, 'I did that, I participated in that particular activity',\" she said.\n\nDr Schaffer said estimated economic values of rail trails varied from $50 to $483 a day depending on what was on offer along the rail trail.\n\nTourism numbers and the tourism season are increasing as the rail trail becomes more popular. (ABC Wide Bay: Nikki Sorbello)\n\nBut aside from the economic value, Dr Schaffer said there was an opportunity for regenerative tourism.\n\n\"A lot of these rail tails have adjoining areas they pass through that are key for flora and fauna,\" she said.\n\n\"So here's an opportunity to conserve and preserve unique environments that run parallel with rail trails as well.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/limestone-coast-sa-population-growth-2051/105092568",
    "title": "Mount Gambier is tipped to boom, but leaders say infrastructure is lacking",
    "publish_date": "Sun, 30 Mar 2025 23:13:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "South Australia's Limestone Coast would increase its population by 18,000 people by 2051, requiring more than 8,500 new homes, under a new state government plan.\n\nThe Limestone Coast Regional Plan is out for public consultation and outlines expected population, housing and employment growth in the region.\n\nIt covers Mount Gambier, SA's largest regional city, and other major population centres including Naracoorte, Millicent, Penola, Keith, Bordertown and Robe.\n\nMore than 8,500 new homes are expected to be built in the region in the next 25 years, with the majority in Mount Gambier. (ABC South East SA: Bec Whetham)\n\nThe region's population is currently about 68,000 people, with about 30,000 people living in Mount Gambier and the surrounding districts.\n\nUnder the plan, the region's population is expected to grow to 86,500 people, with 57 per cent of that growth projected for Mount Gambier.\n\nPlanning Minister Nick Champion said the state government was planning for high population growth across the state.\n\n\"The past 30 years we've had a pretty low population growth. We've exported a lot of people to the eastern states,\" he said.\n\nNick Champion says the state government is planning for high growth around the state. (ABC News: Carl Saville)\n\n\"We've now got a growing economy, a really strong regional economy, so it means people stay and it attracts people too.\n\n\" We've got a great quality of life, whether that's the Limestone Coast, other regions, or the city itself. \"\n\nMount Gambier housing boom\n\nTo house the expected population growth, the plan calls for 8,610 additional homes to be built.\n\nMore than 70 per cent of those new homes would be in Mount Gambier.\n\nOuter-lying areas of the city, including Mil-Lel, Worrolong and Compton, along with urban infill, are set to be hot spots for development.\n\nTroy Bell says investors need more confidence in Mount Gambier's infrastructure. (ABC South East SA: Bec Whetham)\n\nIndependent Mount Gambier MP Troy Bell said a major civil infrastructure spend was needed in Mount Gambier to meet the current demand for new homes.\n\nHe said Mount Gambier in the future would resemble \"more of a city\" with three- or four-storey buildings and a more walkable environment.\n\n\"I think there's a large percentage of professionals and people looking to downsize in their later years who are quite happy to have smaller blocks and smaller upkeep,\" Mr Bell said.\n\nIndependent MacKillop MP Nick McBride said the plan lacked detail and the population forecast could be greater and spread out across the region.\n\nHe said investment and infrastructure for the region's existing industries was currently insufficient.\n\n\"These investments, whether they be Kimberly-Clark at Millicent, Teys at Naracoorte and JBS at Bordertown, they're not even being catered for today,\" Mr McBride said.\n\nNick McBride says the Limestone Coast Regional Plan lacks the detail needed to overcome growth barriers. (Supplied: Nick McBride)\n\n\"Let alone trying to bring in more investments which will require a greater workforce and greater housing.\n\n\" The plan highlights those great opportunities, but it doesn't say when we're going to address them, when we're going to fix them and how we're going to get there. \"\n\nMr Champion said the state government would need to invest in public infrastructure to promote housing growth.\n\n\"People are not going to subdivide blocks or do the civil work for housing development if they don't know if they have a water and sewer connection,\" he said.\n\nConcerns over farming land\n\nForestry, agriculture, fishing and healthcare are the top employers in the Limestone Coast, with the regional plan also outlining ways to protect and grow those industries.\n\nIt also outlines new initiatives in the region expected to drive growth, including a possible rare earths mine around Wrattonbully and a battery storage park north of Mount Gambier.\n\nThe Limestone Coast produces a third of SA's agricultural produce, despite only making up 2 per cent of its land area. (ABC South East SA: Sam Bradbrook)\n\nWrattonbully farmer and Limestone Coast Sustainable Futures chair Todd Woodward said plans for the future should be focused on primary production.\n\nHe said projects, like the proposed rare earths mine, put agriculture at risk.\n\n\"For the past 40 years farmers have been producing food for a world that's doubled in size,\" he said.\n\n\"We're doing that with less available farmland through either desertification or urbanisation.\"\n\nIn the plan, supporting the primary production centre to adapt to new technology, minimising the loss of farmland and managing the use of farmland with other land uses our outlined as long-term strategic objectives.\n\nPublic consultation is open on the SA government's YourSay website.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/vic-eddie-mcguire-deepfake-video-financial-scam/105115764",
    "title": "'Impossible to get taken down': Eddie McGuire responds to deepfake scams",
    "publish_date": "Sun, 30 Mar 2025 23:04:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Scammers have tried to deepfake high profile football and media personality Eddie McGuire in an advertisement on YouTube.\n\nMcGuire has confirmed the advertisement, which the ABC has seen, used footage from a commercial television appearance with a voiceover impersonating him.\n\nIt claims to offer a lucrative investment opportunity, with a QR code appearing on the screen.\n\nThe voice wavers in and out of an American accent, sometimes sounding more authentic before veering back into a US-style voiceover.\n\n“It looks to be something where you put up your phone to a QR code, and then they'll get access to your phone, so it's quite sophisticated,” McGuire told ABC Radio Melbourne.\n\nThe quality of the deepfake video differs, from sometimes looking and sounding like the real deal, to being more obviously manipulated. (Supplied)\n\nHe said people who saw the video on their mobile phones or small screens might be caught out by the scam.\n\n“The voice is reasonable,” he said.\n\n“I've got a reasonably distinctive voice, you know, Glasgow parents and Irish parents out of Broadmeadows, very hard to take me off at times but, yeah, they've done a pretty good job on it and you could see how some people could tumble in.”\n\nBut he said a closer examination would also reveal the voice was not completely synced up with the movement of his mouth.\n\nYouTube's parent company Google has been contacted for comment.\n\nMcGuire said it was not the first time he had been used in a deepfake scam.\n\nHe said an added disturbing element was the difficulty he had encountered trying to get the videos removed from social media channels like Facebook.\n\n“It's basically impossible to get taken down,\" he said.\n\nInside the scams stealing the identities of celebrities Photo shows A hand holds an iphone showing a Facebook ad showing a photoshopped image of David Koch. The words emblazoned across the ads are dramatic, and they're usually accompanied by a photoshopped or AI-generated image of an Australian celebrity being arrested. It's an attempt to take your money.\n\n“Just about any on-air person there for a little while was being used [for deepfake scams], and it doesn't matter, they just ignore you.”\n\nDeepfake videos are created by scammers using artificial intelligence to impersonate real people — often celebrities — to steal money and personal information.\n\nFormer Sunrise host David Koch has also been used in previous scams, along with Hugh Jackman, Robert Irwin and even Prime Minister Anthony Albanese.\n\nDeepfakes become easier to make, but also easy to spot, expert says\n\nAbhinav Dhall is an associate professor in the Department of Data Science and AI at Monash University.\n\nHe said there were now so many software programs and apps to make deepfake videos that almost anyone could do it.\n\n\"Given that there are so many open source tools available and now there are these apps which can be used for swapping a face or taking a picture and then making a video out of it where one is shown to speak something, it's fairly easy now,\" Dr Dhall said.\n\nLoading...\n\nHe said given the ease of creation, social media companies had a responsibility to stop fake videos making it onto their sites.\n\n\"As the technology in generative AI is progressing, so is the technology in deepfake detection,\" Dr Dhall said.\n\n\"As and when deep fake detection is added to the social media platforms, I hope that these videos would be detected at the point of upload itself, and hence the spread of misinformation would be controlled.\"\n\nBut he said users of social media also had a role to play.\n\n\"If we come across a video or audio which just doesn't sound right or look 100 per cent accurate … then we should not just share it without verifying if it is correct or not.\"\n\nDr Abhinav Dhall says both social media companies and users have a responsibility not to share deepfakes. (ABC News: Luke Stephenson)\n\nDr Dhall said there were telltale signs for whether a video was fake.\n\nHe said details on the face in the Eddie McGuire deepfake were a giveaway.\n\n\"If we notice around the lip region, there are a few misses, right? So it's not a very high quality deep fake.\"\n\nDr Dhall said AI also struggled to recreate the mouth area on human faces, including the teeth, tongue and lips, and sometimes could not accurately synchronise speech to lip movements.\n\nHe said eye movements could also be off.\n\n\"We blink naturally in a very smooth fashion but some of the deep fake generation softwares, they fail at having the generation of eye movement very smoothly.\n\n\"Sometimes one eye would be closed for longer, or it could be that the person doesn't blink at all.\"\n\nDr Dhall said voices could also appear robotic, or lacking a natural pitch and tone.\n\nScamwatch urged people not to take investment advice from social media and to check the Australian Securities and Investment Commission to see whether an investment scheme is linked to a licensed operator.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/racing-workers-raise-safety-concerns-of-drugged-horses/105023946",
    "title": "Routine drugging of race horses 'disaster waiting to happen'",
    "publish_date": "Sun, 30 Mar 2025 22:46:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Workers in the racing industry across Australia say horses are being routinely drugged for track work at the peril of rider and horse safety in a malpractice which could breach nationwide racing rules.\n\nThe ABC has spoken to a number of people who worked in the industry in New South Wales, Western Australia, Victoria, and the ACT who spoke on the condition of anonymity.\n\nThese workers say some horse trainers across the country are giving their horses tranquillisers on an almost daily basis, including a substance called acepromazine, as a quick safety fix for training and as a cost-cutting measure.\n\nRacing Australia chief executive Paul Eriksson said the organisation had \"recently become aware\" of the use of acepromazine for track work.\n\nHe said the authority had begun collecting data about the practice, but it had not been made aware of any complaints or concerns.\n\nSimply referred to as \"ace\", the prescription medicine can be administered by oral gel or injection and is advertised as a way to calm an excitable or nervous horse that may be hard to handle during transport or veterinary procedures.\n\nDirections for an acepromazine product in United Kingdom are clear — \"do not, in any circumstances, ride horses within the 36 hours following administration of the product\".\n\nBut according to workers in Australia's industry the pharmaceutical is being abused by some horse trainers, risking the safety of riders, handlers, and the horse itself.\n\n'Disaster waiting to happen'\n\nOne worker, who previously worked in regional Victoria, said she held grave concerns for the safety of riders on drugged horses as the animal was more likely to trip and fall.\n\n\"It's just a disaster waiting to happen,\" she said.\n\nThis worker said she was tasked with administering the drug to horses, which she said was common practice in the industry.\n\nThe ABC has viewed work sheets that show horses being routinely sedated before track work at that regional Victorian stable.\n\nSome workers say racehorses aren't adequately trained, meaning trainers resort to drugging their horses. (AAP)\n\nAnother worker, also from regional Victoria, said drugging horses for track work should be banned.\n\n\"If a horse needs to be sedated to go out on the track then it shouldn't be out there,\" she said.\n\n\"It's too risky for the horse, the rider, and anyone else out on the track at the time.\"\n\nOne worker, who had been a track rider for two decades throughout New South Wales and the ACT, told the ABC she rode many sedated horses during her time in the industry.\n\n\"I've ridden horses that are nearly going to fall over with every stride, which is terrifying,\" she said.\n\n\"You can feel they've had too much [acepromazine] in them.\n\n\" You're riding a compromised horse. It just takes one trip for a horse to come down and kill a rider. \"\n\nShe said some trainers would automatically give ace to their horses under the belief it made the horses easier to handle and ride, with some riders refusing to get on a horse that had not been drugged.\n\nBut she disagreed with the approach saying it masked \"the underlying problem\" that horses were broken in too young and not adequately trained, leaving them akin to a car with \"no steering [and] no brakes\".\n\nShe said ace was commonly used on Monday mornings after the horses were confined to their stalls all day Sunday without being let out for exercise and still being fed a high-energy diet.\n\n\"By Monday morning they're off their head,\" she said.\n\nDrug use could breach racing rules\n\nThe Australian Veterinary Association guidelines state acepromazine is classed as a regulated medicine that can only be prescribed by a vet for a specific treatment.\n\nThe drug should be stored in a secure place where only authorised persons can access it and records kept on how and when it was administered, the guidelines said.\n\nIt said sedatives for uses such as shoeing and dentistry should only be dispensed for use in horses under the care of the prescribing veterinarian and in doses suitable for the immediate need.\n\nIt also listed horse-breaking as a potential use for the substance.\n\n\"Hazards of sedation to the horse and operator should be explained,\" the guidelines said.\n\nSedatives like acepromazine are a regulated medicine. (ABC Rural: Kim Honan)\n\nEquine Veterinarians Australia president Laura Hardefeldt said the organisation supported vets in prescribing the medication in accordance with racing regulations and veterinary prescribing laws in their respective jurisdiction.\n\n\"Veterinarians are best positioned to work with owners and trainers to make informed decisions in the best interest of each horse and its rider,\" Dr Hardefeldt said.\n\nMr Eriksson said Racing Australia was collecting data across the country through each state's racing body's chief veterinary officer to \"understand whether the practice is prevalent and the processes involved in the administration of acepromazine\".\n\nHe said the use of sedatives in horses, prescribed by a vet for veterinary purposes, was not necessarily a safety risk.\n\n\"Under the rules of racing a horse cannot be presented to compete in a race or official trial with acepromazine or any other sedative present as it falls under the list of prohibited substances in those circumstances,\" Mr Eriksson said.\n\n\"If acepromazine was not prescribed by a veterinarian, and its use not in accordance with a veterinarian's instructions and/or not appropriately recorded, then that would, prima facie, breach the Australian Rules of Racing,\" he said.\n\nLack of horse and rider training\n\nOne track rider who worked in Western Australia for three decades said the wide use of acepromazine had become more common in recent years due to the high rate of employee turnover in the industry, and the lack of time and expertise put into training horses.\n\n\"It's really, really common. I know of stables over here where every single horse is sedated every single day,\" the track rider said.\n\nShe said it was expensive for stables to hire competent riders who could train horses and that backpackers with no prior experience riding horses were often hired to work in stables.\n\nShe said racehorses were often broken in, or trained to be ridden, during a two-week period, compared to other equine pursuits where horses received basic handling and riding training over a period of months or years.\n\n\"There such a rush to get a horse broken in and into the races,\" she said.\n\nAn insider says restricting the use of tranquillisers like acepromazine would cause mayhem in the industry. (ABC Rural: Lydia Burton, file photo)\n\nShe said bolting, rearing, or other problematic behaviour was due to the horse being fearful or inadequately trained.\n\n\"The horse isn't misbehaving, it's expressing itself as a horse. A horse will only do what it feels it needs to do to survive,\" she said.\n\n\"They've got hundreds of thousands of years of evolution behind them that says that they need to move about 30 kilometres a day, grazing the entire time.\n\n\"We lock them up in a stable for 23 hours a day and then expect them to behave at the moment they walk out the door.\"\n\nShe said restricting the use of tranquillisers like acepromazine would cause mayhem in the industry because it had become too reliant on the use of the substances.\n\n\"It's considered a routine part of training,\" she said.\n\n\" You would have a lot of upset trainers. You would have a lot of injured people and you'd have no workers. \"\n\nShe said a better understanding of equine psychology was needed in the industry.\n\nThe worker said horses kept in paddocks rather than stables were less likely to be given sedatives.\n\n\"These horses are in a paddock the entire time. They can have a run around and buck and roll and play as they need to get rid of the excess energy,\" she said.\n\nShe said racehorses needed better welfare conditions, including light exercise in the morning and afternoons, as well as feeding on more hay and less grain.\n\nMore regulations needed\n\nProfessor Paul McGreevy of the Sydney School of Veterinary Science at the University of Sydney said the practice stemmed from the way racehorses were kept in confinement.\n\n\"You've got this animal that's been bred to run [and] what we're seeing is an inability to handle, lead, and ride these horses safely,\" he said.\n\n\" The way that horses are managed creates this apparent need for tranquillisation. \"\n\nHe said regulation is needed on vets administering the product.\n\n\"The sustainability of racing depends on improving horse welfare as much as possible and a bandaid solution is not the answer,\" Professor McGreevy said.\n\nHelle Erhardsen of the Coalition for the Protection of Racehorses called for the practice to be outlawed, in addition to strengthening welfare regulations, including keeping horses in an open paddock with other horses.\n\n\"Let the horses live like horses. Don't set them up to become a ticking time bomb. You would not need to sedate them at all,\" Ms Erhardsen said.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/rba-reserve-bank-of-australia-meeting-interest-rates/105108894",
    "title": "When is the next RBA meeting? Will we be getting another interest rate cut?",
    "publish_date": "Sun, 30 Mar 2025 22:09:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Reserve Bank of Australia (RBA) is due to meet for the second time in 2025 this week.\n\nWhen the RBA Board met in February, it cut the cash rate target by a quarter of a percentage point.\n\nHowever most banks don't expect a repeat of that decision during this next meeting.\n\nWhen is the next RBA meeting?\n\nMonday and Tuesday.\n\nThe board's decision about whether to cut interest rates is released 2:30pm AEDT on Tuesday.\n\nWhat is the cash rate target?\n\nCurrently, the cash rate target is 4.1 per cent.\n\nThe cash rate is the interest rate set by the RBA, which influences how much commercial banks charge customers for borrowing money.\n\nBut when the RBA changes the cash rate target, interest rates for mortgages don't automatically change — the individual banks decide that.\n\nWhen will interest rates go down?\n\nNo-one knows that for sure.\n\nSo we have to rely on educated guesses from economists and banking industry professionals.\n\nHere's when the major banks think rates will go down:\n\nANZ: August\n\nCommonwealth Bank: May\n\nNAB: This quarter — so either this week or the May meeting\n\nWestpac: The June quarter\n\nWhen will the RBA next cut rates?\n\nAgain, that's anybody's (educated) guess.\n\nHere's how many more rate cuts the big four banks are expecting after this week's meeting:\n\nANZ: One more cut — which won't be until August , when the bank forecasts a 3.85 per cent cash rate\n\ncut — which won't be until , when the bank forecasts a cash rate Commonwealth Bank: Two more cuts — expecting it to get down to 3.35 per cent in December\n\ncuts — expecting it to get down to NAB: At least three more cuts this year — expecting it to get down to 3.35 per cent in December\n\nAt least cuts this year — expecting it to get down to Westpac: Three more cuts this year — expecting it to get down to 3.35 per cent in November\n\nWhen did we last have this cash rate?\n\nIn October, 2023.\n\nIt was 4.1 per cent for four months.\n\nHere's a graph that tracks the cash rate target over the past three decades:\n\nThe red line tracks the RBA's cash rate target over the past 35 years. (Reserve Bank of Australia)\n\nWhat are the RBA's 2025 meeting dates?\n\nThe RBA meets eight times this year — so after this week's meeting, there will be six meetings left for the year.\n\nHere are the dates listed on the Reserve Bank's website:\n\nFebruary 17 and 18\n\nMarch 31 and April 1\n\nMay 19 to 20\n\nJuly 7 and 8\n\nAugust 11 and 12\n\nSeptember 29 and 30\n\nNovember 3 and 4\n\nDecember 8 and 9\n\nHowever, the RBA told reporters late last year that some of those meeting dates may shift.\n\nThat may include the November meeting, so it doesn't clash with Melbourne Cup Day on November 4.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/golf-min-woo-lee-wins-houston-open-us-pga/105115646",
    "title": "Lee holds nerve to claim Houston Open title for first PGA Tour win",
    "publish_date": "Sun, 30 Mar 2025 22:08:56 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's Min Woo Lee has broken through for his first PGA Tour victory following a tense finish at the Houston Open.\n\nLee led by a stroke over world number one Scottie Scheffler and 2019 US Open champion Gary Woodland as he headed to the tee on the 18th hole at Memorial Park.\n\nHis second shot missed the green, but a clutch putt got the West Australian only inches from the hole.\n\nLee held his nerve for a tap-in par to avoid a play-off and clinch a one-shot victory, completing the tournament on 20-under-par.\n\n\"It's unbelievable,\" Lee said.\n\n\"I mean, it was a big mental grind and I'm very proud.\n\n\"Looking around, the Houston crowd was awesome obviously, and Scotty was there and it was nerve-wracking.\"\n\nScheffler, world number two Rory McIlroy and a swag of other heavyweights stormed home to put pressure on Lee, who also has professional wins on the European, Asian and Australasian tours.\n\nAfter extending his four-shot lead after the third round to five at one point on the final day, Lee's buffer was slashed to one stroke down the back nine.\n\nHe found the water off the tee on the par-five 16th hole and Scheffler reeled off four successive birdies.\n\nLee sunk a tap-in putt to clinch his one-stroke triumph. (Getty Images: Kenneth Richmond)\n\nBut Lee recovered from his first bogey in 41 holes to par the last two to secure the most significant win of his career.\n\nHis scrambling par at the 72nd hole — from 54 feet and off the green to inside a foot — symbolised the 26-year-old's grit.\n\nLee eventually carded a 3-under 67.\n\nScheffler finished with a superb 7-under 63 to share second with Woodland.\n\nLee held a four-stroke lead heading into the final round. (AP: Ashley Landis)\n\nWoodland had set the clubhouse lead at 19-under with a tournament-record-equalling 62, a brilliant round matched by Finland's Sami Valimaki, who was outright fourth at 17-under.\n\nAfter starting the day eight shots back, McIlroy had to settle for a tie for fifth at 15-under after conjuring a birdie and six eagles in a round of 64.\n\nBut the day and the spoils belonged to Lee, who was stoic and scintillating in equal measures as he warmed up beautifully for the Masters, the year's first major starting at Augusta National in 11 days' time.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/ipswich-gym-remains-silent-over-sexual-discrimination-claims/105103480",
    "title": "Gym allegedly told queer man his dancing made others 'uncomfortable'",
    "publish_date": "Sun, 30 Mar 2025 20:52:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "World Gym Ipswich has refused to respond to allegations it discriminated against one of its clients on the basis of his sexual orientation.\n\nThe complaint was made by Brisbane man Damien McClean.\n\nMr McClean said the gym told him to stop dancing between exercise sets, as he was making other gym-goers \"uncomfortable\".\n\nLGBTQI+ community support services Photo shows Hand with rainbow light reflecting on it for list of queer and LGBTIQ support numbers and websites in Australia ABCQueer has compiled this list of national and state-based support services relevant to LGBTQI+ people, their families and friends.\n\nThe 44-year-old said the gym told him several gym users had complained he was \"putting them off\" with his behaviour.\n\nHe said none of the people who complained had done so to him directly.\n\nMr McClean said he felt he was being shamed for his sexual expression, as a person with \"openly queer mannerisms\".\n\n\"I don't censor my queerness wherever I go, but it's like they're trying to force me back in the closet,\" he said.\n\nMr McClean said his dancing was not sexual or inappropriate in nature.\n\n\"I have a right to be queer in this space,\" he said.\n\n\"I'm not hurting anybody, I'm not getting in anybody's way.\"\n\nWorld Gym's Ipswich branch and national head office did not respond to ABC Radio Brisbane's repeated requests for comment.\n\nDamien McClean needs to attend the gym regularly for rehabilitation. (ABC Radio Brisbane: Kenji Sato)\n\n'Last bastion of toxic masculinity'\n\nBrisbane Pride president James McCarthy said these reports were concerning.\n\n\"In 2025, people — however they identify — should feel safe to express themselves without fear of being marginalised or excluded, just for being their authentic selves,\" he said.\n\nJames McCarthy says queer people have a right to sexual self-expression. (ABC Radio Brisbane: Kenji Sato)\n\nMr McClean said he had chosen to go public with his complaint as a matter of principle.\n\nHe said many gay men felt the need to censor themselves in gyms to avoid contempt, disgust and ridicule.\n\nMr McClean said he believed that gym culture was still less tolerant than Australian culture as a whole.\n\n\"I think the gym is going to be the last bastion of toxic masculinity in our society and culture,\" he said.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/ipl-cricket-mitchell-starc-pat-cummins-travis-head/105115552",
    "title": "Starc takes five-wicket haul in IPL showdown with Cummins and Head",
    "publish_date": "Sun, 30 Mar 2025 20:44:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Mitchell Starc has starred with the ball for Delhi Capitals in their seven-wicket victory over a Sunrisers Hyderabad team captained by Pat Cummins in the Indian Premier League (IPL).\n\nStarc dismantled the top order of Sunrisers' normally formidable batting line-up, dismissing Travis Head (22) among a trio of early wickets in Visakhapatnam.\n\nHe then returned to mop up the tail and dismiss Sunrisers for 163, claiming his first five-wicket haul (5-35) in the IPL.\n\nVictorian Jake Fraser-McGurk made 38 off 32 balls as Delhi chased down the target with four overs to spare.\n\nStarc now has eight wickets in two matches for his new IPL team.\n\nHe joined Delhi after being released by Kolkata Knight Riders (KKR), despite being player-of-the-match when taking 2-14 for KKR in last year's final against Sunrisers.\n\n\"It's been a good day,\" Starc said.\n\n\"All round, we were fantastic. I've played for long enough, so I know what to do.\n\nCA releases summer schedule Photo shows Pat Cummins and Usman Khawaja appeal to the umpire, with their arms outstretched Cricket Australia confirms its line-up of international matches for the 2025/26 season, avoiding a repeat of last year's disjointed scheduling for its Test players.\n\n\"You've got to think outside the box, even as an older player you have to bowl different balls.\"\n\nHyderabad opted to bat first but lost Abhishek Sharma (1) to a run-out after a mix-up with Head.\n\nStarc then stepped up and reduced Hyderabad to 4-37 in 4.1 overs, with Head — caught behind by KL Rahul — the third of his wickets.\n\nIt was the sixth time Starc had dismissed Head in eight T20 innings at a cost of 34 runs.\n\nCummins could only make 2, caught by Fraser-McGurk off the bowling of Kuldeep Yadav.\n\nStarc later finished Hyderabad off in the 19th over with the wickets of Harshal Patel (5) and Wiaan Mulder (9).\n\nIn reply, Fraser-McGurk and Faf du Plessis (50 off 27) put on 81 in nine overs and though Zeehan Ansari (3-42) dismissed both in the 10th over, Delhi cruised to victory.\n\nCummins returned the figures of 0-27 from two overs.\n\nAAP",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-31/gender-euphoria-research-transgender-day-of-visibility/105098958",
    "title": "Researchers take a more positive approach to trans identity",
    "publish_date": "Sun, 30 Mar 2025 20:32:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Trans advocate Max Pick remembers the first time they experienced gender euphoria.\n\n\"[It's] like being able to breathe without having to think about it, when — maybe for years — you had to think about every single breath,\" they say.\n\n\"It is quite simply the feeling of being seen for who you are in ways that have not always been granted [to you].\"\n\nTrans advocate Max Pick (right) found affirming their trans masculine identity a life-changing experience. (Supplied: Max Pick)\n\nMax, who affirmed their trans masculine identity later in life says the feeling of finally being comfortable in their own skin was life-changing.\n\n\"I felt gender euphoria when I got the embarrassing bum fluff of a 14-year-old boy at the age of 36,\" they say, \"and when 'madam' started to change to 'sir', and especially, when my T-shirts could fit on me … because I finally have the flat chest returned to me that I used to have.\"\n\nMax runs a not-for-profit clothing brand that raises funds for people looking to undergo gender-affirming surgery. So, they know the positive impacts experiencing gender euphoria can have for others.\n\n\" Gender euphoria feels like the rawest, most connecting joy you could ever experience. \"\n\nThe opportunity for other trans and gender-diverse (TGD) people to experience the joy Max describes is at risk, with a wave of anti-trans policies being introduced here and abroad.\n\nBut Australian researchers are offering a glimmer of hope.\n\nIn a world first, researchers from Swinburne University of Technology and Murdoch Children's Research Institute have come up with a way to measure gender euphoria, which may have significant implications for the mental health of trans and gender-diverse (TGD) adolescents and adults.\n\n\"Right now, the global environment [for TGD people] is truly scary,\" says Max. \"Positive experiences and focusing on gender euphoria have the power to reframe how we see ourselves.\"\n\nWhat is gender euphoria?\n\nTara Laursen, chair of TGD charity Transcend Australia, describes gender euphoria as a profound sense of joy, confidence and comfort that comes from feeling \"right\" in your gender and having other people recognise that.\n\n\"Gender euphoria is a key component of mental and emotional wellbeing for TGD people,\" says Tara.\n\nChair of Transcend Australia, Tara Laursen. (Supplied)\n\n\"Research has shown that experiencing gender euphoria is associated with lower levels of psychological distress and suicidal ideation.\n\n\"When trans people are affirmed in their gender — whether through supportive relationships, healthcare, and/or self-expression — it fosters resilience, confidence and a greater sense of belonging.\"\n\nExperiencing gender euphoria can come about in myriad ways, including changing your hairstyle, wearing different clothes, being referred to by your preferred pronouns, to hormone therapy or gender-affirming surgeries.\n\nMax and other members of the trans and gender-diverse community walking down Enmore Road in Sydney.\n\nMax says gender euphoria can also be found in not being singled out for their transness.\n\n\"Gender euphoria can simply be a moment of invisibility in a crowd,\" they say. \"A moment when eyes are not on you, because feeling eyes on you is exhausting.\n\n\"In a world that tries to make 'being trans' the entirety of our being, we deserve to enjoy the complex, multi-layered identities that all of us have, without being locked and frozen on any one part of us.\n\n\"Gender euphoria can come from small moments every day or national events. It can come from a passing moment with a stranger, or life-changing policies at the highest level of governments.\"\n\nWhat did the study involve?\n\nResearchers from Swinburne University of Technology, Murdoch Children's Research Institute and the University of Melbourne interviewed more than 700 trans Australians aged between 16 and 79.\n\nThe participants were selected from the TRANSform study, a trans-led project run by the Trans Health Research Group, and then were asked a series of questions about their past experiences of gender euphoria.\n\nCommon experiences in the participants' responses were then used to formulate 26 items that made up the Gender Euphoria Scale. These were based around three core themes: social affirmation, self-affirmation and community connection.\n\nSwinburne PhD student and Murdoch Children's Research Unit researcher in transgender health, Charlotte Blacklock. (Supplied)\n\nSwinburne PhD student and MCRI researcher in transgender health, Charlotte Blacklock, says the scale has the potential to significantly advance our understanding of positive gender-related experiences.\n\n\"There is growing recognition of the need to broaden understandings of gender diversity by exploring and highlighting the joyful aspects of trans people's lives,\" she says.\n\n\"We have created the first ever scale to assess gender euphoria, a concept that arose from within the trans community to describe positive feelings associated with being trans.\"\n\nCo-author of the study Dr Simone Buzwell from Swinburne says the scale could be used to improve mental health treatment for the TGD community by focusing on how to help people experience gender euphoria.\n\n\"The gender euphoria scale could be used to help clinicians focus on assisting clients to experience positive aspects of gender identity, rather than focusing on eliminating gender dysphoria,\" she says.\n\nPsychologist and study co-author Simone Buzwell.\n\nTara believes the scale will also allow advocacy groups, like Transcend, to better support TGD people.\n\n\"By understanding what drives gender euphoria, we can advocate for policies and services that maximise these affirming experiences, ensuring that TGD individuals can thrive, rather than just survive,\" she says.\n\nWhy this matters now more than ever\n\nThe recent decision from Queensland Health Minister Tim Nicholls to deny access to hormone treatment for new trans and gender-diverse patients under 18 serves as a stark reminder of the power governments wield over TGD people's ability to experience gender euphoria.\n\nThe controversial decision triggered a nationwide day of protests and forced federal Health Minister Mark Butler to announce a review of the national standards of care and treatment guidelines for TGD children and adolescents.\n\nMax also knows the positive impact government decisions can have on everyday lives: last year, the New South Wales parliament passed a bill allowing TGD people to change the gender on their birth certificates without undergoing surgery.\n\n\"When [the Equality Bill] passed that allowed me to update my ID documents … I felt gender euphoria. I felt it pass through me like a wave from the whole trans community, like we could all breathe collectively.\n\n\"[It's a very] human experience that we are after,\" they say. \"A feeling of belonging to ourselves.\n\nThe need for a positive approach to trans and gender-diverse identities\n\nTGD people experience disproportionately high rates of mental ill health, self-harm, and suicide due to a range of factors including discrimination, vilification, gender dysphoria, and being ostracised from social support networks.\n\nDespite the seriousness of these challenges, trans advocates say it is essential to also focus on the positive aspects of being TGD.\n\n\"Recognising and measuring gender euphoria is essential in shifting the narrative away from solely focusing on challenges and the impacts of discrimination and vilification, and instead highlighting these positive markers of wellbeing and the life-affirming aspects of trans experiences,\" says Tara.\n\n\"For too long, research and public discourse have centred around the challenges and distress associated with being trans, often reinforcing a deficit-based perspective.\"\n\nWhile it's important to address issues like discrimination and dysphoria, she says a strengths-based approach is more empowering.\n\n\"It shifts the focus to what is working, what brings joy, and what enhances wellbeing.\n\n\"This research is an important step in recognising that trans experiences are not just about overcoming challenges, but also about thriving, celebrating identity, and feeling affirmed.\"\n\nThe hope is that the scale will become widely adopted by clinicians, researchers and policymakers to reframe the way trans healthcare and wellbeing is approached.\n\nMax embraces two other members of the trans and gender-diverse community.\n\nThe need for a more positive approach to trans identity is echoed by Max.\n\n\"Trans people, especially young trans people, need to see images and experiences of other trans people in a state of joy, in a state of peace,\" they say.\n\n\"The trans people I know who regularly experience gender euphoria are some of the most open-hearted, kind, contributing, and brave people I know.\n\n\"It's not just the trans community who need people like that. The world needs people like that right now.\"",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/exclusive-chrishelle-stause-on-finding-her-soulmate-g-flip-20250331-p5lnwg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Exclusive: Chrishelle Stause on finding her 'soulmate' G Flip",
    "publish_date": "Mon, 31 Mar 2025 12:58:14 +1100",
    "category": "finance",
    "authors": [],
    "text": "Exclusive: Chrishelle Stause on finding her 'soulmate' G Flip\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/athletics/trying-to-arrest-the-decline-the-52-million-plan-to-put-a-record-number-of-paralympians-on-the-podium-20250331-p5lnt1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Trying to arrest the decline’: The $52 million plan to put a record number of Paralympians on the podium",
    "publish_date": "Mon, 31 Mar 2025 12:49:53 +1100",
    "category": "sports",
    "authors": [
      "Angus Delaney"
    ],
    "text": "Victoria has established its first dedicated unit to discovering and developing the next generation of Paralympians with a funding boost after the 2024 Paris Paralympics, in which Australia recorded its lowest medal tally in more than three decades.\n\nOn Monday, the Victorian Institute of Sport launched the new ParaUnit, which is designed to make it easier for aspiring athletes to start or progress in para-sport. It is funded with $1.66 million from the federal government – part of a larger $54.9 million investment in the Paralympics made by the government in June last year.\n\nWheelchair rugby player Shae Graham. Credit: Simon Schluter\n\nParalympian and Paris bronze medallist Shae Graham said barriers faced by emerging para-athletes included a lack of specialist coaches, the cost of equipment and a lack of pathways for progression.\n\n“I did a lot of Googling and a lot of searching to try and work out just where to go to give wheelchair rugby a go. So, [the] first barrier being like available information,” said Graham, who has been part of two Paralympics in wheelchair rugby.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/brumby-jack-falls-violently-ill-20250331-p5lnw3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brumby Jack falls violently ill",
    "publish_date": "Mon, 31 Mar 2025 12:42:43 +1100",
    "category": "finance",
    "authors": [],
    "text": "Brumby Jack falls violently ill\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/players-ejected-after-mass-nba-brawl-20250331-p5lnw4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Players ejected after mass NBA brawl",
    "publish_date": "Mon, 31 Mar 2025 12:42:38 +1100",
    "category": "sports",
    "authors": [],
    "text": "Players ejected after mass NBA brawl\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/baker-of-things-20250331-p5lnuy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Baker of Things",
    "publish_date": "Mon, 31 Mar 2025 12:34:23 +1100",
    "category": "finance",
    "authors": [
      "Emily Holgate"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nFor fresh sourdough loaves and baguettes, plus cakes, pastries and other specialty snacks.\n\n1 / 4 Koulouri, a traditional Greek baguette shaped like a ring. Supplied 2 / 4 Zesty citrus layer cake created by rolling cake sponge like a Swiss roll. Supplied 3 / 4 The koulouri bread is one of the most popular items. Supplied 4 / 4 Citrus layer cake at Baker of Things. Supplied Previous Slide Next Slide\n\nBakery$$$$\n\nAfter years of supplying baked goods to Maker Coffee across its five outposts, Maker owners John and Stephanie Vroom have found a bricks-and-mortar home for their wholesale label, Baker of Things, inside an industrial warehouse-style shopfront on Burnley Street.\n\nHeaded by ex-Beatrix staffer Zoe Pearce, the Richmond bakery is serving fresh-baked sourdough loaves and baguettes from Wednesday through to Sunday, plus an assortment of pastries, cakes, sandwiches and other specialty snacks.\n\nPopular items include the moreish olive, chilli and anchovy baguette twist, or the zesty citrus layer cake made by rolling cake sponge like a Swiss roll with layers of lemon, lime and orange zest atop a fine layer of lemon curd. The ring-shaped, traditional Greek koulouri baguette is also worth a try (and great for sharing).\n\nBe sure to arrive early to get your hands on a coveted sourdough Neighbourhood Loaf or smaller-sized Loaf For You (they’re often sold out by mid-morning). Maker coffee is on the menu, too, naturally.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-fall-as-wall-street-tumbles-20250331-p5lnq4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Miners, bank slump as ASX tumbles; Todd Sampson to exit Qantas",
    "publish_date": "Mon, 31 Mar 2025 12:31:38 +1100",
    "category": "finance",
    "authors": [
      "Gemma Grant"
    ],
    "text": "The Australian sharemarket has slumped on Monday, with heavy losses from the banks and mining giants coming after more volatility on Wall Street.\n\nThe S&P/ASX 200 index fell by 118.5 points, or 1.5 per cent, to 7,863.5 points as of 12.15pm AEDT. All the eleven industry sectors were retreating, with losses led by miners and information technology.\n\nQantas has announced that Todd Sampson will stand down from the airline’s board. Credit: Joe Armao\n\nThe materials sector was performing poorly shortly after midday, with the sharemarket’s largest company BHP sinking by 3.1 per cent. Fortescue (down 2.8 per cent) and Rio Tinto (down 3.4 per cent) also dropped.\n\nThe financials sector was a sea of red at lunchtime, with the nation’s largest lender Commonwealth Bank shedding 0.6 per cent – a slight improvement from their share price when the markets opened. ANZ (down 2.2 per cent), Westpac (down 1.7 per cent) and NAB (down 0.8 per cent), all saw losses, dragging the ASX lower.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/federal/victoria-s-hot-seats-live-updates-the-electorates-that-will-gauge-the-nation-s-mood-on-big-issues-during-the-2025-federal-election-20250330-p5lno1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria’s hot seats LIVE updates: The electorates that will gauge the nation’s mood on big issues during the 2025 federal election",
    "publish_date": "Mon, 31 Mar 2025 12:26:07 +1100",
    "category": "finance",
    "authors": [
      "Clay Lucas",
      "Cara Waters",
      "Rachael Dexter",
      "Charlotte Grieve"
    ],
    "text": "Hi, over the next five weeks, I’ll be blogging about the seat of Wills as the 2025 federal election unfolds.\n\nI’m normally an investigative reporter for The Age – investigative reporters never miss an opportunity to push their stories, so please read my most recent reporting on Australia’s $4 billion cosmetic injectables industry here. But during the federal election, I’ll follow full-time Labor MP Peter Khalil, the Greens’ Samantha Ratnam, Liberal Jeff Kidney, Socialist Sue Bolton, and all of the other candidates in this northern suburbs seat.\n\nVictorian Labor MP Peter Khalil. Credit: Alex Ellinghausen\n\nWills covers progressive northern suburbs like Brunswick and Coburg and Labor-leaning areas like Pascoe Vale, Fawkner, Oak Park and Glenroy. But a redistribution has added some of Australia’s most green booths — in North Fitzroy and North Carlton — to Wills for the first time.\n\nThis will likely hand Ratnam and the Greens an advantage. However, as I moved around the seat in the last week, preparing for the launch of this blog today, I noticed plenty of Peter Khalil signs on house fences in both North Carlton and North Fitzroy. Maybe that advantage, like so many Greens predictions of victory here, will be an illusion again: it’s been a phenomenon in this seat for more than a decade that the Greens talk up their chance of snatching Wills from Labor and then ultimately a win fails to materialise.\n\nAt the 2022 election, I spent six fascinating weeks in the seat of Chisholm, roaming its suburbs which include Box Hill, Burwood, Glen Waverley and Mount Waverley. There, it was clear a few weeks out that Liberal MP Gladys Liu would struggle to hold the seat from Labor’s Carina Garland. Ultimately, Garland won easily with a 7 per cent swing to her and Labor. So far in Wills, it’s hard to tell whether the Greens’ talk of this being a potential win is just that – talk – or if the voters of this economically and ethnically diverse seat will finally turn out for them. Or will they back Khalil and the status quo? Ratnam has stood in Wills against Khalil before, in 2016. Then, she came close to ending the party’s near-continuous hold on the seat since its creation in 1949. Ratnam secured 45 per cent of the vote that year. Khalil ultimately won but had to rely on preferences from other parties. Since then, no Greens candidate has come near Khalil, who has expanded his majority in the seat on a two-party preferred basis to 9 per cent.\n\nLoading\n\nKhalil, 52, was born in Melbourne to Egyptian parents and grew up in public housing. Ratnam, 47 and born to Sri Lankan parents who left that country because of civil war, is a strong candidate in her own right. In the nine years since she last ran, Ratnam’s profile has grown and grown – first as the mayor of Moreland (now Merri-bek) Council, and then as the state leader of the Greens in Victoria. Wills, famously represented by former Labor Prime Minister Bob Hawke from 1980 until his retirement in 1992, is named after William John Wills who, alongside Robert O’Hara Burke, perished on their ill-fated expedition from Victoria to the Gulf of Carpentaria.\n\nAt the centre of Wills is Bell Street, the major arterial road which once acted as the so-called hipster proof fence in previous elections, with Labor voters to the north and Greens voters to the south. But rising house prices punched a hole in that fence, with younger, Greens-voting progressives increasingly settling in suburbs such as Pascoe Vale and Coburg North. The big issues here, like everywhere in Australia right now, are housing, the cost of living, health policy and particularly whether people can afford it.\n\nBut the vicious politics over Israel and Palestine is the really significant factor in this suburb – just like it is in many of Sydney’s most ethnically diverse seats. Ten per cent of Wills was Muslim at the 2021 Census, so Palestine is sure to be a big focus. The first time I chatted to both of the campaign teams for either side, they talked up what I can only assume is their hoped-for outcome on this issue. Labor argues Israel-Palestine is of vastly less importance to most voters in this seat than the more mainstream issues like health and the cost of living. The Greens say Israel-Palestine is the first thing many residents talk about when Ratnam and her team doorknock homes here. So we will see.\n\nIt’s going to be an exciting five weeks. Please send any tips you’ve got relating to this seat, to any of the candidates, or really anything a voter in Wills might be interested in, to my email, clucas@theage.com.au, my Proton mail, claylucas@protonmail.com, or via Signal on +61439828128. This really will be one of the most fascinating battles in Australian politics in 2025 – I hope you will follow it with me.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/min-woo-lee-survives-water-and-trees-to-win-first-us-pga-tournament-20250331-p5lnrh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I was freaking out’: Min Woo Lee survives water and trees to win first US PGA tournament",
    "publish_date": "Mon, 31 Mar 2025 12:25:06 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Rising Australian golf star Min Woo Lee held his nerve to break through for his first win on the American PGA Tour in a tense finish to the Houston Open, his cool demeanour in the final three holes hiding his jagged emotions.\n\n“I was freaking out inside,” Lee said after the win. “It was tough. Props to the guys who win week-in, week-out. It is very hard.”\n\nLee had to make par on the final hole to hold off world No.1 Scottie Scheffler – who shot four consecutive birdies on the back nine – and major winner Gary Woodland. The pair drew within one shot of forcing a play-off when they shot eight and seven under respectively on the final day to whittle away Lee’s lead to the narrowest margin.\n\nIt took a brilliant putt from just off the green by Lee, who is coached by Ritchie Smith, to seal the title as he put the ball within centimetres of the 18th hole for a tap-in par to make a final round 67 and finish 20 under for the tournament. He had made a bogey at 16 after going into the water.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/world/asia/trump-s-usaid-cuts-hobble-earthquake-response-in-myanmar-20250331-p5lntc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "China and Russia already have boots on the ground in Myanmar. The US is nowhere to be seen",
    "publish_date": "Mon, 31 Mar 2025 12:21:03 +1100",
    "category": "finance",
    "authors": [
      "Hannah Beech",
      "Edward Wong"
    ],
    "text": "The employees who received lay-off notices were told they should go home that afternoon. Some had been co-ordinating with aid missions in Bangkok, the Thai capital, and Manila, capital of the Philippines, which handle disaster response in Asia. Two of the employees in Washington had expected to move this winter to Yangon, in Myanmar, and to Bangkok to work as humanitarian assistance advisers out of the US missions there. But those positions were cut. Had they not been, the two employees would have been on the ground to organise urgent responses to the earthquake. After the disaster hit on Friday, the US embassy in Yangon, Myanmar’s largest city, sent a cable to USAID headquarters in Washington to start the process of evaluating aid needs and getting help out the door. And the next day, a Trump administration political appointee in USAID, Tim Meisburger, held a call with officials from national security agencies to discuss a plan. But Meisburger said that while there would be a response, no one should expect the agency’s capabilities to be what they were in the past, a person with direct knowledge of the call said.\n\nA USAID spokesperson did not reply to a request for comment. The agency typically has access to food and emergency supplies in warehouses in Dubai, United Arab Emirates and Subang Jaya, Malaysia. But the big question now is how quickly, after being almost fully dismantled, it can get goods from those places into Myanmar. The goods include medical kits that can each serve the healthcare needs of 30,000 people for more than three months. Russian search-and-rescue teams with their dogs in Myanmar. Credit: Russia Emergency Ministry press service via AP Apart from career diplomats, the ranks of the agency’s Bureau for Humanitarian Assistance have included crisis specialist contractors who live around the world and can deploy quickly in what are called Disaster Assistance Response Teams. Many of those contractors have been fired, and the infrastructure to support them in Washington and other offices – people who can book flights and manage payments, for instance – was crippled by cuts over the past two months. The agency would also usually put certified search-and-rescue teams in Virginia and Southern California on alert for possible deployment to the disaster zone, but transportation contracts for those teams had been cut, a former aid agency employee said.\n\nUSAID’s annual allocations for Myanmar were about $US320 million last year. About $US170 million of that was for humanitarian work, while the rest was for development initiatives such as democracy building and health. Only a few million dollars’ worth of projects remain operational, though some of those programs, including one for maternal and child health, have not received funding despite being told the initiatives are not being closed down. Before the cuts, the annual costs of total US foreign aid were less than 1 per cent of the federal budget. Russian and Chinese rescuers free a woman who had been lying under piles of concrete for two days. Credit: AP At a news conference in Jamaica last week, US Secretary of State Marco Rubio said the United States would continue foreign aid work, though in drastically reduced form. He said the aim was to provide aid “that is strategically aligned with our foreign policy priorities and the priorities of our host countries and our nation states that we’re partners with”. On Friday, Tammy Bruce, a US State Department spokesperson, said crisis teams stood ready to deploy to Myanmar.\n\nThe United States’ ability to provide lifesaving aid has been hampered not just by budget cuts but by obstacles in Myanmar itself. Since grabbing power in 2021, Myanmar’s military junta has closed off the country from Western influences. Myanmar is now embroiled in civil war, with a loose coalition of opposition forces having wrested control of more than half the country’s territory. Loading The United States and other Western nations have responded to the junta’s brutal human rights record with sanctions, and the military chief who orchestrated the coup, Senior General Min Aung Hlaing, has railed against the West, thanking China and Russia for ideological and economic support. Nevertheless, in the hours after the earthquake struck, Min Aung Hlaing said he welcomed outside disaster relief aid – and not just from countries with friendly relations with the military regime. Myanmar experts say they are concerned that some of the aid that goes through the junta could be diverted to the armed forces. The Myanmar military is underfunded and short on morale as it fights resistance forces on many fronts.\n\nIn Mandalay, residents said they were upset to see soldiers lounging around the sites of collapsed buildings. Some played video games on their phones, while locals used their hands to pry bricks from the rubble. Still, Chinese and Russian search-and-rescue teams, outfitted in orange and blue uniforms, were digging through the wreckage in Mandalay on Sunday, and a Belgian squad was making its way north. People watch rescuers work at the Sky Villa Condo that collapsed in Mandalay. Credit: AP A good chunk of USAID funding had been dedicated to areas of the country not under junta control. US assistance has gone to healthcare and schooling for internally displaced people. It has supported local administrations that are trying to form mini-governments in conflict areas. And it has tried to provide emergency relief to civilians battered by junta airstrikes. In the region of Sagaing, a stronghold of resistance against the junta, Myanmar military jets carried out two rounds of airstrikes on Nwel Khwe village hours after the earthquake destroyed buildings there, adding more terror to residents’ lives.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/pellegrini-finishes-stunning-moana-try-20250329-p5lnjm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pellegrini finishes stunning Moana try",
    "publish_date": "Mon, 31 Mar 2025 12:11:32 +1100",
    "category": "finance",
    "authors": [],
    "text": "Pellegrini finishes stunning Moana try\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/property/news/their-first-brisbane-house-flip-nets-melbourne-couple-3-55-million-20250331-p5lnsv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Their first Brisbane house flip nets Melbourne couple $3.55 million",
    "publish_date": "Mon, 31 Mar 2025 12:04:27 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Melbourne couple have almost doubled their money on a Wilston Queenslander that sold for $3.55 million under the hammer on Saturday.\n\nThe five-bedroom home, 46 Angliss Street, last sold for $1.885 million in 2022, with the couple giving it a cosmetic glow-up before selling to buyers who inspected it just minutes before bidding began.\n\nFor the vendors, it was their first Brisbane flip after relocating to the Queensland capital for a lifestyle shift, with the pair pulling off a revamp that included a new kitchen, bathroom, paint and carpet.\n\nAccording to Domain’s latest House Price Report, Wilston has clocked some of the steepest price growth over the past year, with house medians soaring 25 per cent to $1.9 million.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/business/markets/the-trump-fire-is-burning-on-wall-street-20250331-p5lnrs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trump fire is burning on Wall Street",
    "publish_date": "Mon, 31 Mar 2025 11:58:03 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "American consumer sentiment is plunging, consumers expect inflation to surge, and the US sharemarket is tanking. And all that is before this week’s “Liberation Day,” when President Donald Trump will reveal his “reciprocal” tariffs.\n\nThe US sharemarket fell 2 per cent on Friday – it’s down more than 9 per cent since Trump announced his plan for reciprocal tariffs in the middle of last month – with the tech-heavy Nasdaq market down 2.7 per cent and the “Magnificent Seven” mega-tech stocks down 3.5 per cent.\n\nWall Street appears jittery on the outlook for the economy in Trump’s second term. Credit: Getty\n\nThe already jittery market’s end-of-week selloff on Friday was a response to hotter-than-anticipated inflation data and a University of Michigan survey which showed a 12 per cent fall in the index of consumer sentiment in March to its lowest level since 2022 and an 18 per cent fall in expectations of the economy’s future.\n\nThose surveyed expect inflation to reach 5 per cent over the next year and be more than 4 per cent over the next five years. Two-thirds of them expect unemployment to rise over the next 12 months.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/hip-drop-tackles-are-a-blight-on-the-game-and-rugby-bosses-need-to-stamp-them-out-20250331-p5lnr6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hip-drop tackles are a blight on the game and rugby bosses need to stamp them out",
    "publish_date": "Mon, 31 Mar 2025 11:40:00 +1100",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "Loading\n\nIf Max Jorgensen misses the British and Irish Lions series with the ankle injury he sustained against the Hurricanes on Saturday, Rugby Australia will have every right to feel very aggrieved.\n\nThere is a lot of debate about what actually constitutes a “hip drop” tackle, but common sense tells you that when any defender uses his own body weight to drag a player to the ground, therefore putting all the force through the ball carrier’s lower limbs, there is risk involved.\n\nWhat will annoy the Waratahs is that Hurricanes No.6 Brayden Iose used the same technique on Jorgensen just two phases before the injury occurred. It was an incident waiting to happen, and rugby bosses need to get on the front foot, because it took them far too long to deal with croc rolls when they started creeping into the game.\n\nWaratahs to face another Australian talent that got away",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/property/news/mosman-local-beats-six-others-for-16-1-million-knockdown-at-auction-20250331-p5lns6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mosman local beats six others for $16.1 million ‘knockdown’ at auction",
    "publish_date": "Mon, 31 Mar 2025 11:32:41 +1100",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "Seven buyers hoping to turn a Mosman deceased estate into a trophy home registered at auction on Saturday, pushing the sale price to $16.1 million.\n\nThe three-bedroom house at 13 Stanley Avenue appealed for its elevated position on the Balmoral slopes with uninterrupted views.\n\nFour Mosman locals took part indoors while rain fell on the ocean outside.\n\nBidding opened at $10 million, and after some $500,000 bids quickly soared past the $11.5 million reserve, which was in line with similar sales in the area.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/sport/afl/the-psychology-degree-cripps-hopes-can-help-the-blues-overcome-winless-start-20250331-p5lnrn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The psychology degree Cripps hopes can help the Blues overcome winless start",
    "publish_date": "Mon, 31 Mar 2025 11:30:04 +1100",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Carlton captain Patrick Cripps is studying psychology and says he is using his degree to help keep the players together, as the under-fire Blues attempt to overcome a winless start to the season.\n\nThe Blues are under enormous pressure heading into Thursday night’s blockbuster against Collingwood at the MCG.\n\nHistory suggests their September dreams may already be over; only four of 54 teams since 2007 that have started 0-3 have recovered to make the finals.\n\nMind games: Carlton captain Patrick Cripps is studying psychology. The Blues hope to turn their season around against the Magpies on Thursday. Credit: AFL Photos\n\nAt the annual Peter Mac Cup breakfast, Cripps revealed his post-graduate degree was helping his captaincy.",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-31-march-2025/ehonptiph",
    "title": "Midday News Bulletin 31 March 2025",
    "publish_date": "Mon, 31 Mar 2025 01:00:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Newspoll shows Labor has narrow lead on Coalition\n\nReserve Bank expected to hold cash rate at 4.1%\n\nAustralian golfer wins his first PGA tournament\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nOpposition leader Peter Dutton is promoting the Coalition's energy plan during a visit to Newcastle in regional New South Wales.\n\n\n\n\n\nHunter is a key seat in the upcoming federal election, held by Labor with a 4.8 per cent margin.\n\n\n\n\n\nThe Hunter Valley is also a traditional coal mining area and been identified as a site for one of seven nuclear power plants under the Opposition's nuclear policy.\n\n\n\n\n\nMr Dutton was asked by a reporter how the region feels about nuclear energy.\n\n\n\n\n\nThe Liberal leader says the plan will create jobs for the local community.\n\n\n\n\n\n\" Have a look at Collie, where we've just had state election. We've just had a 20 per cent plus swing to the Liberal party in Collie, where we've just said that, on that coal mining site, at the end of its use, we will site one of the nuclear power stations there. So, I think in the Hunter and elsewhere to be honest, if there is not a replacement industry for coal, then these jobs go. \"\n\n\n\n\n\nMr Dutton was also asked how much how much electricity and gas prices will drop under the Coalition’s plan to increase domestic gas reserves, but he was unable to provide a figure, saying more detail will be released later.\n\n\n\n---\n\n\n\n\n\nA survey by Newspoll indicates the government's popularity has risen following the federal budget.\n\n\n\n\n\nThe survey published in The Australian newspaper [[late Sunday]] has Labor leading the Coalition 51 per cent to 49 per cent on a two-party-preferred basis, less than five weeks before the election.\n\n\n\n\n\nThe survey of over 1,200 voters was conducted from Thursday to Saturday, after the federal budget and budget-in-reply speech from Opposition Leader Peter Dutton.\n\n\n\n\n\nIt showed primary support for Labor lifted from 32 to 33 per cent since a Newspoll in March, while the Coalition recorded a drop of two percentage points to 37 per cent.\n\n\n\n\n\nThe Greens remained at 12 per cent, while support for Pauline Hanson's One Nation dropped from seven per cent to six.\n\n\n\n\n\nNational Senator Matt Canavan has told Channel Nine he isn't worried about the latest poll.\n\n\n\n\n\n“I'm just glad he's finally called the election; he’s been running scared all year. Now people have their choice. What the polls have shown for ages now is that this is very, very close. Anthony Albanese is up by one point this week, a couple of weeks ago he was down by one point. That's all within the statistical margin of error. What it shows is that people the listening have the choice here.\"\n\n\n\n\n\n\n\nThe polling is the third major survey to show the government gaining ground after Resolve and YouGov polls also reported support swinging Labor's way.\n\n\n\n\n\nAnthony Albanese is in Perth to unveil a $355 million upgrade to a Perth hospital.\n\n\n\n--\n\n\n\n\n\nMortgage holders are likely to see repayments hold steady, when the Reserve Bank board delivers it's cash rate decision tomorrow.\n\n\n\n\n\nThe bank's board is meeting in Sydney today to discuss the decision and will include two new members, following recent government reforms to the RBA structure.\n\n\n\n\n\nBut the cash rate is not expected to change - with economists tipping it will remain at 4.1 per cent, following a 25-point basis cut last month.\n\n\n\n\n\nInflation data released last week showed price growth tracking within the Reserve Bank's target range.\n\n\n\n\n\nBut RBC Capital Markets chief economist Su-Lin Ong told AAP, the board will want confirmation of that positive trend in next month's figures -particularly against the backdrop of global protectionism triggered by United States tariffs.\n\n\n\n\n\nShe also says she expects the board will want to keep a low profile during the election campaign.\n\n\n\n\n\nShare markets are rating the chance of a cut at less than 10 per cent.\n\n\n\n---\n\n\n\nThe death toll from a major earthquake in Myanmar is expected to rise, as residents and communities struggle to access clean water and food.\n\n\n\n\n\nThe 7.7 magnitude quake that struck the central city of Mandalay has left more than 1,700 people dead, with more than 300 still missing.\n\n\n\n\n\nIndia, China and Thailand are among countries that have sent relief materials and teams, along with aid and emergency workers from Malaysia, Singapore and Russia.\n\n\n\n\n\nBut some residents in Mandalay and Sagaing are reporting international aid has not arrived, as concerns grow about a severe shortage of food, electricity and water.\n\n\n\n\n\nAround 3 and a half million people in Myanmar have already been displaced by civil war.\n\n\n\n\n\nThe Red Cross and Red Crescent report humanitarian needs are growing by the hour.\n\n\n\n\n\nUNICEF's Sai Han Lynn Aung says the country needs urgent assistance.\n\n\n\n\n\n“While we are still conducting rapid needs assessment, we know that this is an absolute catastrophe for children and families across Mandalay. Many homes have been destroyed, roads and bridges damaged, many children and families are still missing and traumatised. We need urgent assistance, especially for children who often suffer the most in this kind of situation.”\n\n\n\n\n\nIn Thailand, at least ten people have been killed in the quake, most of them in the collapse of a Bangkok office tower.\n\n\n\n---\n\n\n\n\n\nAnd in sport, Australian golfer Min Woo Lee has won his first PGA Tournament in a dramatic finish at the Houston Open in Texas.\n\n\n\n\n\nLee shot a final-round \"3-under-par 67\" with a magnificent putt from off the green on the final hole.\n\n\n\n\n\nIn doing so, he held off World Number One and Two, Scottie Scheffler and Gary Woodland, who both finished a stroke back.\n\n\n\n\n\nThe 26-year-old described the tournament as a \"big mental grind\" and said the win was \"unbelievable. \"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/sam-kerr-matildas-captaincy-court-case/6dn2c67u8",
    "title": "Sam Kerr clear to keep Matildas captaincy after not-guilty verdict in harassment case",
    "publish_date": "Mon, 31 Mar 2025 00:17:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "The path is clear for Sam Kerr to retain her Matildas captaincy after meeting with the Football Australia board.\n\n\n\n\n\nThe Matildas and Chelsea striker will link up with teammates in a non-playing capacity in Sydney this week after addressing her recent UK court case, where she was found not guilty on one charge of racially aggravated harassment of a police officer.\n\n\n\n\n\nKerr, who hasn't played since tearing her ACL during a Chelsea training camp in January last year, spoke of her \"regret\" for the incident, with the FA board saying they would take no further action over it.\n\n\n\nKerr expresses 'sincere regret'\n\n\"I want to express my sincere regret for how events unfolded,\" Kerr said in an FA statement.\n\n\n\nREAD MORE Sam Kerr found not guilty of racially harassing London police officer\n\n\"I recognise that leadership means being mindful of our actions both on and off the pitch.\n\n\n\n\n\n\"I'm proud of the Matildas, the role I have played as a member of that team, and everything we stand for, and I'm committed to learning from this experience.\"\n\n\n\nWhat has Football Australia said?\n\n\"Knowing how Sam feels about the events, along with the additional context we've learned, has added vital perspective that the general public may not be aware of. Setting aside those difficulties, this one incident should not offset the incredible contributions she has made, both publicly and privately, on and off the field — for more than 15 years.\" — Anter Isaac, Football Australia chairman.\n\n\n\nKerr found not guilty last month\n\nKerr was charged after calling a police officer \"f---ing stupid and white\" late in an hour-long altercation at Twickenham police station in the early hours of 30 January 2023.\n\n\n\n\n\nThat followed a taxi journey that went sour when Kerr vomited out of the window.\n\n\n\n\n\nThe altercation with police turned heated after it became clear the officers did not believe Kerr and fiancée Kristie Mewis' telling of events.\n\n\n\n\n\nFootball Australia said they were blindsided when Kerr's charge came to light in March 2024.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 11
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-salad-products-being-pulled-from-supermarket-shelves-over-contamination-fears/rs9wwfpkk",
    "title": "The salad products being pulled from supermarket shelves over contamination fears",
    "publish_date": "Sun, 30 Mar 2025 05:36:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Supermarket giant Coles became the most recent retailer to pull more than a dozen products from their shelves across much of Australia over bacterial contamination concerns.\n\n\n\n\n\nColes recalled spinach products sold between 20 March and 29 March — with use by dates up to and including 9 April — due to a potential microbial (STEC) contamination.\n\n\n\n\n\nSTEC is a strain of E. coli ( Escherichia coli ) bacteria, and food products contaminated with STEC can cause gastroenteritis, or \"gastro\", resulting in serious illness.\n\n\n\n\n\nThe pre-packed spinach was included in 17 items sold across Victoria, Tasmania, Queensland, NSW and the ACT, as well as some products in South Australia and the Northern Territory.\n\n\n\n\n\n\"Customers should not eat these products,\" Coles said in a statement.\n\n\n\nREAD MORE What Labor's proposed price gouging ban could mean for your grocery bill\n\n\"Any customers concerned about their health should seek medical advice.\"\n\n\n\n\n\nWoolworths, Aldi and Metcash Australia, which runs IGA and Drakes supermarkets, have also issued recalls in recent days.\n\n\n\nWhat are the affected products?\n\nThe recalled products by the supermarkets include pre-packaged spinach, stir fry and salad mixes, as well as ready-to-eat bowls and snacks.\n\n\n\n\n\nThe products recalled by Coles are:\n\n\n\nColes Spinach 60g, 120g, 280g, 400g\n\nColes Family Mix Stir Fry 400g\n\nColes Spinach and Kale 300g\n\nColes Spinach and Rocket 60g, 120g\n\nColes Beetslaw 320g\n\nColes 4 Leaf Blend 200g\n\nColes 4 Leaf Mix 120g\n\nColes Kitchen Pesto Risoni 190g\n\nColes Kitchen Egg and Spinach 100g\n\nColes Baby Leaf & Beet Blend 150g\n\nColes Baby Leaf Blend 300g\n\nColes Mixed Leaf Garden Salad 180g\n\nColes Mediterranean Style Bowl 185g\n\nColes Beetslaw Bowl 180g\n\nColes Sweet Potato Superfood Bowl 180g\n\nColes Roasted Pumpkin, Feta and Walnut Salad 265g\n\nColes Kitchen Green Goddess Salad 300g\n\nColes said customers can return the products for a full refund.\n\n\n\n\n\n\"We apologise to our customers for any inconvenience,\" the retailer said.\n\n\n\nREAD MORE Supermarkets respond to watchdog report as Labor faces fresh calls for breakup powers\n\nThe products recalled by IGA and independent grocers (Metcash Trading Limited Australasia) are:\n\n\n\nCommunity Co Aussie Salad Mix 110g\n\nCommunity Co Fine Cut Stir Fry 335\n\nCommunity Co Baby Leaf Salad Mix 260g\n\nCommunity Co Leaf Mix 160g\n\nCommunity Co Baby Spinach 100gCommunity Co Baby Spinach 260g\n\nCommunity Co Baby Spinach and Rocket 100g\n\nCommunity Co Garden Salad Bowl 180g\n\nThe prdoucts recalled by Woolworths include:\n\n\n\nWoolworths Mixed Leaf 120g (use by date 26 March)\n\nWoolworths Cook Stir Fry Kit with Teriyaki Sauce 400g (use by date 26 March and 27 March)\n\nWoolworths Cook Stir Fry Mix Rainbow Vegetables 400g (use by date 26 March and 27 March)\n\nWoolworths Kale & Spinach 300g (use by date 26 March)\n\nWoolworths Spinach and Rocket 120g (use by date 26 March)\n\nWoolworths Spinach and Rocket 60g (use by date 26 March)\n\nWoolworths Spinach 60g (use by date 26 March and 27 March)\n\nWoolworths Honey Mustard Salad Kit 285g (use by date 26 March and 27 March)\n\nWoolworths Spinach 280g (use by date 30 March and 31 March)",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-labors-price-gouging-ban-could-mean-for-your-grocery-bill/hco5wcixg",
    "title": "What Labor's proposed price gouging ban could mean for your grocery bill",
    "publish_date": "Sun, 30 Mar 2025 05:33:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Supermarkets would be banned and face heavy fines for price gouging under a new Labor government election pledge.\n\n\n\n\n\nPrime Minister Anthony Albanese has promised to make excessive pricing illegal if re-elected for a second term.\n\n\n\n\n\n\"We will introduce legislation making price gouging illegal by the end of this year,\" he said on ABC's Insiders program on Sunday morning.\n\n\n\n\n\n\"What we want to make sure is that they (supermarkets) know that they're being watched. They know that the government is prepared to take strong action and crack down.\"\n\n\n\n\n\nThe prime minister later said that supermarkets are \"taking the piss of Australian consumers\".\n\n\n\n\n\nSo, what's Albanese promised — and is price gouging even happening? Here's what you need to know.\n\n\n\nREAD MORE Watchdog unveils proposal to end supermarket price-gouging, shrinkflation\n\nWhat has Albanese promised on supermarket price gouging?\n\nAlbanese said that if Labor wins the 3 May federal election, supermarkets found to be price gouging would receive \"heavy fines\".\n\n\n\n\n\n\"Australians deserve a fair go at the checkout, and my government will hold the big supermarket chains to account,\" he said.\n\n\n\n\n\nFinance Minister Katy Gallagher added during a Canberra press conference that the new plans aim to combat rising cost of living pressures.\n\n\n\n\n\n\"The Anthony Albanese government is focused on responding to those cost of living pressures. We have heard Australians are under pressure.\n\n\n\n\n\n\"We know prices at the supermarket have hit household budgets, and that's why this government, for the last three years, has been focused on doing what we can to take pressure off households without adding to inflation.\"\n\n\n\nAnthony Albanese and Finance Minister Katy Gallagher speaking to reporters in Canberra. Source: AAP / Lukas Coch Laws to protect customers from companies engaging in price gouging already exist in the UK, European Union, and dozens of states in the US.\n\n\n\n\n\nLabor would first implement recommendations from the Australian Competition and Consumer Commission's (ACCC) supermarket inquiry report to improve transparency about prices, promotions, and loyalty programs.\n\n\n\n\n\nA task force would be set up to advise on introducing an excessive-pricing regime for supermarkets to be policed by the consumer watchdog.\n\n\n\n\n\nThe group would include Treasury, the ACCC and other experts who would consult and report to the federal government within six months.\n\n\n\nAre big supermarkets price gouging? It's complicated\n\nAustralia's consumer watchdog released its final report after a year-long supermarket inquiry, finding the dominance of Woolworths and Coles had an \"oligopolistic\" effect on the broader industry.\n\n\n\n\n\nBut the ACCC resisted calls for it to be granted powers to break up the two major corporations, saying there was no \"silver bullet\" to fixing the supermarket sector.\n\n\n\n\n\nThey also said it was \"very difficult\" to tell whether price gouging was actually happening in supermarkets.\n\n\n\n\n\n\"We didn't reach that [price gouging] conclusion, and part of the reason is the complexity of making that when you look at the range of products and the different margins that they have, and the fact that they change pricing almost on a weekly basis,\" ACCC deputy chair Mick Keogh said.\n\n\n\nREAD MORE Supermarkets respond to watchdog report as Labor faces fresh calls for breakup powers\n\n\"It's very difficult to get to the bottom of that. The profitability figures do give you some very broad picture of what's happening, but the issue of price gouging isn't one we were able to engage in too closely.\"\n\n\n\n\n\nThe ACCC found that between 2018 and late 2021, grocery prices increased largely in line with wages, but by the end of 2022 and start of 2023, grocery prices were increasing at more than twice the rate of wage growth.\n\n\n\n\n\nSupermarket profits have increased in that time, but the major companies claim it is not a \"dramatic\" rise.\n\n\n\n\n\nThe report also didn't seek to determine whether the prices of profit margins at big supermarkets were \"excessive\", as ACCC regulates supermarket conduct — and running a business at a profit isn't illegal.\n\n\n\nColes, Woolworths reject Albanese's proposal\n\nOn Sunday, Coles, Woolworths and peak retail body the Australian Retailers Association (ARA) responded to the prime minister announcing plans to outlaw price gouging.\n\n\n\n\n\nA spokesperson for Coles rejected claims that the supermarket giant engaged in price gouging and argued their margins are comparable to their peers in countries including Canada, the UK and the US.\n\n\n\n\n\n\"Despite a 12-month inquiry into supermarkets, neither the government or the ACCC found evidence of price gouging,\" they said in a statement to SBS News.\n\n\n\n\n\n\"What's needed are measures that tackle the real factors driving higher grocery prices, which are rising costs such as energy, fuel, labour, insurance, production, freight and distribution.\"\n\n\n\n\n\nIn a separate statement, Woolworths echoed Coles' comment that the ACCC's final report found no evidence of price gouging, and said it had taken steps towards fulfilling many of the ACCC's recommendations.\n\n\n\nARA chief industry affairs officer Fleur Brown similarly said that repeated inquiries have \"failed to find any evidence of supermarket price gouging\".\n\n\n\n\n\n\"The ACCC's findings clearly state that grocery inflation has been driven higher by the cost of wages, energy and fuel,\" she said.\n\n\n\n\n\n\"Yet, instead of hearing how the government will address these issues, which significantly affect all Australian retailers and consumers, we unfortunately see more taxpayer-funded deflection.\n\n\n\nOpposition leader Peter Dutton spoke at Austral brickworks in Sydney on the second day of campaigning. Source: AAP / Mick Tsikas\n\nWhat is the Coalition promising on supermarkets?\n\nOpposition leader Peter Dutton said Albanese couldn't \"stand up to the supermarkets\".\n\n\n\n\n\n\"I would say that the prime minister is weak as water, I really would. The supermarkets know it and Australians know it. I think you've got a prime minister who can't stand up to the supermarkets.\n\n\n\n\n\n\"We have said to the supermarkets, you rip off Australian consumers, and you continue to believe that your market share gives you power in the market that should be exploited, I will act as prime minister, and this prime minister has demonstrated that he won't.\"\n\n\n\n\n\nDutton says the Coalition's policy is divestiture, a supermarket commissioner and \"significant fines that start at $10 million\".\n\n\n\n\"Prices are up at supermarkets at the moment because of Anthony Albanese. That's the predominant reason.\"\n\n\n\nWhat about the Greens?\n\nIn early March, the Greens announced that a priority for their party would be making price gouging illegal by the middle of this year.\n\n\n\n\n\nTheir proposal would create a 'prices commission' to monitor supermarkets for price gouging, with corporations that unreasonably increased prices being subject to massive fines or divestiture. That commission would start operating in July.\n\n\n\n\n\nLast year, the Greens introduced a bill to ban supermarket price gouging, which was voted against by both Labor and the Liberals.\n\n\n\nREAD MORE Does Woolworths Metro or Coles Local cost you more? The supermarkets have answered\n\nOn Sunday, Greens leader Adam Bandt took credit for inspiring Labor's proposal, saying on X: \"After adopting most of our plan to see the GP for free, Labor has now followed the Greens' plan to make supermarket price gouging illegal.\"\n\n\n\n\n\nGreens senator Nick McKim, the party's economic justice spokesperson, added: \"While Mr Albanese is browsing the Greens' website looking for policy ideas, he should also copy and paste our plan to get dental into Medicare and end native forest logging.\"\n\n\n\n\n\nBandt reiterated that the policies should go one step further than fines, and that supermarket companies that abuse their market power should face the prospect of divestiture and face serious penalties.\n\n\n\n\n\n\"These supermarkets are making billions of dollars of profits. The fines do need to be high to make sure that the supermarkets listen,\" he said.\n\n\n\n\n\n\"But even more than that, what the Greens want to see is the supermarkets know that they could be broken up as well if they keep on abusing shoppers and abusing their market power, that's where the penalty should be.\"\n\n\n\nWill a price gouging ban make groceries cheaper?\n\nWhile there are hopes that a mission to stamp out price gouging may lead to better grocery prices, not everyone is convinced.\n\n\n\n\n\n\"The widely popular narrative of 'stamping out price gouging' by dragging supermarket chief executives into public hearings and threatening them with jail time might have inferred such inquiries would lead to lower food prices,\" Gary Mortimer, professor of marketing and consumer behaviour at Queensland University of Technology, wrote in The Conversation earlier this month.\n\n\n\n\n\n\"In isolation, they have not.\"\n\n\n\n\n\nWhile supermarkets face scrutiny, it's unclear if consumers will feel the difference at the checkout.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/measles-warning-amid-global-case-rise/7w88ypzo9",
    "title": "Australia 'ripe for an outbreak': Measles warning amid global case rise",
    "publish_date": "Sun, 30 Mar 2025 04:09:29 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A measles outbreak in the United States has claimed two lives, as hundreds of people have been infected and large numbers of children hospitalised with complications.\n\n\n\n\n\nAuthorities say the best way to prevent outbreaks is through vaccination.\n\n\n\n\n\nBut some doctors have reported patients are sceptical of immunisation and that there are large pockets of unvaccinated communities in the US.\n\n\n\n\n\nIn fact, experts say there's been a decline around the world and not just the US, because of issues with access to vaccines — and rising suspicion and mistrust in them.\n\n\n\n\n\nAs the US grapples with a resurgence of the disease, is there a risk anti-vaccine messaging could take hold in Australia?\n\n\n\nWhat does the US measles outbreak look like?\n\nThe number of confirmed cases this year has already surpassed the total of 285 recorded in 2024.\n\n\n\n\n\nSome 17 states have recorded more than 370 cases of measles, according to the US Centers for Disease Control and Prevention, with 64 hospitalisations and two deaths. The majority of cases are in children who are either unvaccinated or whose vaccination status is known.\n\n\n\n\n\nThree outbreaks (defined as three or more related cases) have been reported this year so far, with 90 per cent of confirmed cases (341 of 378) being outbreak-associated.\n\n\n\nREAD MORE Robert F Kennedy Jr announces major slashing of US public health agencies\n\nMeasles was once considered eliminated in the US, thanks to the MMR vaccine and high immunisation rates.\n\n\n\n\n\nBut it's a highly contagious disease and experts say at least 95 per cent of a community must be vaccinated to stop outbreaks. That's not the case in the US.\n\n\n\n\n\nVaccination rates have declined nationwide in the US since the COVID-19 pandemic, and most states are below the vaccination threshold for kindergarteners.\n\n\n\nA child receives an MMR vaccine in the US state of Texas on 1 March, where cases are on the rise. Source: Getty / Jan Sonnenmair\n\nInternational outlook\n\nLast week, Mexico's government said it would step up a measles vaccination campaign after cases surged in an area bordering the US.\n\n\n\n\n\nMexico had confirmed 43 measles cases, 39 of which were recorded in the northern state of Chihuahua and linked to imported infections.\n\n\n\n\n\nIn Vietnam, a recent statement from the World Health Organization (WHO) said a measles outbreak there was \"still very much ongoing\". Some recent media reports say the country has recorded about 40,000 suspected cases since the start of the year.\n\n\n\nIn Europe, measles cases doubled in Europe in 2024 to a 25-year high, according to the WHO.\n\n\n\n\n\nLast year, 127,350 cases of measles and 38 deaths were registered in the WHO's European region, which counts 53 countries and includes central Asia.\n\n\n\n\n\nHalf of the European cases required hospitalisation, the WHO said, noting that 40 per cent of cases involved children under the age of five.\n\n\n\n\n\nVictoria's chief health officer recently warned case numbers were rising in Thailand, India, Africa, and the Middle East.\n\n\n\nMeasles in Australia\n\nThe Department of Health's National Notifiable Disease Surveillance System has reported 37 infections in Australia this year.\n\n\n\n\n\nIn 2024, 57 cases were registered, up from 26 in 2023.\n\n\n\n\n\nThe WHO declared measles eliminated from Australia in 2014, but the virus can still enter the through international travel. This year's confirmed cases are primarily returned travellers and their close contacts, and the majority of them have been in NSW and Victoria.\n\n\n\n\n\nAustralia is below the World Health Organization's measles vaccination target rate of a 95 per cent, according to the health department.\n\n\n\nVaccine access, and scepticism, in Australia\n\nAssociate Professor Frank Beard is with the National Centre for Immunisation Research and Surveillance, which reports every year on vaccination rates across the country.\n\n\n\n\n\n\"Vaccination coverage has been creeping down over the last few years since the COVID-19 pandemic ... So (a) modest decrease, but it is concerning because before the pandemic, coverage had been pretty steadily increasing for the previous eight years or so,\" he said.\n\n\n\n\n\nPaediatrician Margie Danchin, from the University of Melbourne and the Murdoch Children's Research Institute, said the decrease had especially been seen in particular communities and age groups.\n\n\n\nShe said childhood vaccine coverage rates at ages one, two and five have been steadily declining in Australia since 2020.\n\n\n\n\n\n\"The biggest decline has actually been in First Nations children around that one-to-two-year time point, particularly in the Northern Territory, for example,\" she said.\n\n\n\n\n\n\"We have a big issue in Australia, and we're also ripe for a measles outbreak in this country, not just in the Asia-Pacific region.\"\n\n\n\nMeasles is caused by a virus and presents as a highly infectious itchy rash with a fever. It mainly affects children, but one infection usually gives life-long immunity. Credit: KATERYNA KON/SCIENCE PHOTO LIBRA/Getty Images/Science Photo Libra Danchin said there were also clearly defined geographical areas in Australia that had lower vaccine coverage.\n\n\n\n\n\n\"In general, measles vaccination coverage is reasonably high. Of course, that very much depends geographically ... We do have quite big pockets of low vaccine coverage around Australia, for example, in the Northern Rivers region in New South Wales, but also in inner city Melbourne and Sydney,\" she said.\n\n\n\n\n\nIf suspicion and mistrust of vaccines were behind lower vaccination rates in the US, that's not the case for Australia, Danchin said.\n\n\n\nWhile there are vaccine sceptics, access is the major issue.\n\n\n\n\n\n\"There are practical barriers to vaccination. So, not being able to make an appointment or pay for the appointment. Not being able to travel to get an appointment if a mother has lots of kids, or get time off work, for example,\" she said.\n\n\n\n\n\nBeard said there was concern about local outbreaks because of gaps in vaccination coverage, and unvaccinated people bringing measles back with them after overseas travel.\n\n\n\n\n\n\"Australia was certified by the World Health Organization as having eliminated local measles transmission here back in 2014. Since then we have had some cases and outbreaks, and they've almost always been linked to unvaccinated people,\" he said.\n\n\n\n\n\n\"Australians going overseas and then coming back with measles; or tourists from overseas with measles. And so there have been a lot of measles outbreaks over the last couple of years overseas that increases the risk that measles will be imported into Australia.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/live-blog/federal-election-2025-campaign-day-two-as-it-happened/iyhtdsn55",
    "title": "Cost of living takes centre stage on campaign day two — as it happened",
    "publish_date": "Sat, 29 Mar 2025 21:57:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Coles and peak retail body the Australian Retailers Association (ARA) have responded to the prime minister announcing plans to outlaw price gouging this morning.\n\nA spokesperson for Coles rejected claims that the supermarket giant engaged in price gouging.\n\n\"Despite a 12-month inquiry into supermarkets, neither the government or the [Australian Competition and Consumer Commission] found evidence of price gouging,\" they said in a statement.\n\n\"What's needed are measures that tackle the real factors driving higher grocery prices, which are rising costs such as energy, fuel, labour, insurance, production, freight and distribution.\"\n\nREAD MORE Supermarkets respond to watchdog report as Labor faces fresh calls for breakup powers\n\nARA chief industry affairs officer Fleur Brown similarly said that repeated inquiries have \"failed to find any evidence of supermarket price gouging\".\n\n\"The ACCC's findings clearly state that grocery inflation has been driven higher by the cost of wages, energy and fuel,\" she said.\n\n\"Yet instead of hearing how the government will address these issues, which significantly affect all Australian retailers and consumers, we unfortunately see more taxpayer-funded deflection.\n\n\"The ARA calls on [the] government to focus on policies that drive down the cost of doing business in Australia, which will have a direct impact on grocery prices and the cost of living for Australian families. We need measures that reduce red tape, increase productivity or drive down costs.\"\n\nREAD MORE Watchdog unveils proposal to end supermarket price-gouging, shrinkflation\n\nWhat did the ACCC's report find?\n\nEarlier this month, Australia's consumer watchdog, the ACCC, released its final report after a year-long supermarket inquiry.\n\nWhile it did not release definitive evidence of price gouging, it found the market dominance of Woolworths and Coles had an \"oligopolistic\" effect on the broader industry and that the pair are among the most profitable supermarket businesses in the world.\n\nIt found that between 2018 and late 2021, grocery prices increased largely in line with wages, but by the end of 2022 and start of 2023, grocery prices were increasing at more than twice the rate of wage growth. Supermarket profits have increased in that time, but the major companies claim it is not a \"dramatic\" rise.\n\nWhen it released its report, ACCC deputy chair Mick Keogh said it was \"very difficult\" to tell whether price gouging was happening in supermarkets.\n\n\"The profitability figures do give you some very broad picture of what's happening, but the issue of price gouging isn't one we were able to engage in too closely.\"\n\n— Alex Gallagher",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/trauma-casts-a-long-shadow-for-immigration-detainees/kgtm0dphr",
    "title": "Trauma casts a long shadow for immigration detainees",
    "publish_date": "Sat, 29 Mar 2025 21:16:22 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMostafa Azimitabar is still haunted by memories of his six years detained on Manus Island.\n\n\n\n\n\n\"I'm not going to escape from it because it's like a shadow. Trauma for me is like a shadow. If I escape from it, it will follow me. The best way is to deal with the pain - that it happened, it's a part of me.\"\n\n\n\n\n\nThe Kurdish refugee says he still struggles to unpack his trauma from that time - which was followed by over a year detained in two Melbourne hotels, after being transferred to Australia to treat severe asthma and mental illness.\n\n\n\n\n\n\"It's like I'm holding maybe a knife and I'm carving the words on my skin, it's so difficult... that's why sometimes I feel not at the moment, I have to be patient. It will be okay, it's not the time.\"\n\n\n\n\n\nA 2020 report in the British Journal of Psychology that looked at refugees resettling in high-income countries found one in three globally have experienced some form of mental illness.\n\n\n\n\n\nNow a new study from the University of New South Wales has found those who have experienced offshore detention, or prolonged onshore detention, are more likely to experience post-traumatic stress disorder compared to other refugees.\n\n\n\n\n\nDr Philippa Specker was the lead researcher on the British Journal of Psychology report, and says individuals are more likely to experience PTSD when they feel unsafe.\n\n\n\n\n\n\"People who experience detention might be witnessing or experiencing further traumatic or adverse events that add to their mental health burden, and might make them even more at risk of having mental health problems, even years after joining the community.\"\n\n\n\n\n\nDr Specker says not all detention experiences carry the same risk for mental illness.\n\n\n\n\n\nIndividuals who spend time in offshore detention are 20 times more likely to develop PTSD compared to those who spent less than six months in onshore detention.\n\n\n\n\n\nThose in prolonged onshore detention, or for longer than six months, were almost 17 times more likely to report PTSD.\n\n\n\n\n\n\"There seems to be something about being detained in a facility offshore that puts someone at especially high risk. I think when we consider what this experience might feel like for someone who's come to Australia seeking asylum, they arrive in Australia seeking asylum and are then relocated to a third country by the very government, they're asking to give them safety and support. So it's understandable that this might undermine people's sense of security and certainty about the future.\"\n\n\n\n\n\nBeyond Blue's chief executive Georgie Harman says this is a situation where mental health literacy comes into play.\n\n\n\n\n\nThe New South Wales Mental Health Commission says this type of literacy is about people's knowledge of health care systems, and their ability and confidence in accessing and understanding them.\n\n\n\n\n\nMs Harman says for culturally and linguistically diverse people generally, mental health literacy is far lower.\n\n\n\n\n\n\"People from CALD communities access mental health support often when they're in extreme distress or crisis. We also know that they don't seek support at the same rates as the rest of the general population. And again there are a whole range of reasons for that: language barriers, confusion about the system, which is really confusing for most of us.\"\n\n\n\n\n\nThis resonates for Reshma Manandhar, who migrated from Nepal to Australia 20 years ago and believes she struggled with post-natal depression after the birth of her first child, despite not having the language for what she was experiencing.\n\n\n\n\n\n\"I think the big mental health issue for me was when I had my son, and I think I had post-natal depression but I wasn't aware of it. It was a very difficult time for me - having a kid here, being in a completely different environment, not the support that I'm used to.\"\n\n\n\n\n\nBeyond Blue has formed a new partnership with settlement agency AMES that it hopes will improve mental health awareness in migrant and refugee communities.\n\n\n\n\n\nThe partnership looks to reach people in community, offering mental health training to AMES staff, and providing easy English support resources.\n\n\n\n\n\nAMES CEO Cath Scarth says reaching people in a culturally safe environment is essential.\n\n\n\n\n\n\"For us at AMES, we have, I suppose, four key determinants that we think are critical for successful settlement. The obvious ones, education, speaking, English, safe, secure housing, obviously employment. But the fourth critical pillar is really about health and wellbeing, and mental health is a critical part of that.\"\n\n\n\n\n\nReshma now works as a coordinator in community engagement for AMES.\n\n\n\n\n\nShe hopes her experiences will help others.\n\n\n\n\n\n\"In my community, most of us, we've come from Nepal and we are facing similar challenges. And when we talk about it, it makes it normal. It normalises it. And then when you say, oh, there is a help available, you can seek help, or, oh, I have gone to see someone, and that really helped. That opens up and that makes it normal. And that sort of says to other people that, yes, you can access help. It is all right to seek help. It is all right to say, you know what, I have a problem in the first place. Sometimes we don't even admit to ourselves that we have problem.\"\n\n\n\n\n\nFor Mostafa, he says professional support has failed him so far - and that psychologists must be skilled to navigate this unique trauma.\n\n\n\n\n\n\"I see they try to engage with what I am talking about, but they don't understand it because they were not in detention. It's very complicated. It's not easy when I share this. It's not something simple. Someone was in detention for a decade and comes out and go to another room. Okay, I'm going to share what happened to me with a psychologist. The psychologist should have the qualification of dealing with high level of trauma. Otherwise, the trauma becomes much bigger to the person.\"\n\n\n\n\n\nIt's a battle Mostafa is still navigating after he lost an appeal in a 2022 High court case, which found Australia's hotel detention is legal but 'lacked human decency'.\n\n\n\n\n\nA current case is arguing against an asylum seeker's removal to Nauru detention under the government's new powers to deport anyone without a visa to third countries.\n\n\n\n\n\nSBS contacted the Department of Home Affairs for comment who have not yet responded.\n\n\n\n\n\nMeanwhile, still living in limbo on a bridging visa, Moz has turned to art, produced with some unusual tools.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/can-the-oceans-help-in-slowing-climate-change/ebqvdpc0o",
    "title": "Can the oceans help in slowing climate change?",
    "publish_date": "Sat, 29 Mar 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"For this to work, carbon dioxide removal has to go from something that most people have never heard of to the largest thing that humanity has ever done in a really short time.\"\n\n\n\n\n\nThat was David Ho, a professor of oceanography at the University of Hawaii, talking about a new potential underwater solution to climate change.\n\n\n\n\n\nThe United Nations says the ocean is the biggest carbon sink currently available, absorbing at least a quarter of the world's emissions.\n\n\n\n\n\nOcean Scientist Will Burt says this provides a unique opportunity to reduce emissions from elsewhere.\n\n\n\n\n\n\"The problem, of course, at its root is that we’ve got too much carbon dioxide in the air and the logical storage place for some of that excess carbon is going to be the biggest reservoir by far that exists. And that reservoir is the ocean.\"\n\n\n\n\n\nSeveral companies are testing a new theory that the carbon dioxide currently in the ocean can be reduced by changing it from a gas to a solid.\n\n\n\n\n\nWill Burt is the chief ocean scientist at one of those companies.\n\n\n\n\n\nHis workplace, Planetary Technologies, has been using magnesium oxide to try to lock away carbon dioxide for centuries.\n\n\n\n\n\n\"You add an alkaline or a basic mineral to the ocean and that mineral is essentially an antacid. It neutralises acid the same way an antacid neutralises acid in your stomach. This alkaline mineral neutralises carbon dioxide acid in the ocean.\"\n\n\n\n\n\nSome companies are using other items such as rocks or nutrients to try to produce the same effect, while others use seaweed and algae to absorb carbon similar to the way plants do it on land.\n\n\n\n\n\nTesting from Planetary Technologies has found no risk to marine ecosystems from magnesium oxide so far.\n\n\n\n\n\nHowever, some are still concerned.\n\n\n\n\n\nMeghan Lapp, who works at fishing company SeaFreeze, says there are environmental protection concerns.\n\n\n\n\n\n\"You don't dump poison on your farmland. You don't dump poison in the ocean. And, you know, back in the 1970s we created the Clean Water Act to ensure that we have clean water and we're not dumping chemicals into the ocean. And now to be doing that in the name of carbon capture to me is just irresponsible.\"\n\n\n\n\n\nTo achieve its full impact, carbon dioxide removal needs to occur on a much larger scale than it currently does.\n\n\n\n\n\nProfessor Ho is also the co-founder of non-profit business C-Worthy, which focuses on using the seas to fight climate change.\n\n\n\n\n\nThe group is developing technology to assess the impact of marine carbon removal.\n\n\n\n\n\n\"The experiments that are being done now and the scale at which they're being done, it's pretty safe. The question is what happens when you scale it up to billions of tons every year? And that's still to be determined.\"\n\n\n\n\n\nHe explains further challenges will arise with the growth in scale.\n\n\n\n\n\n\"There's a challenge in the amount of energy that's needed, the amount of stuff we need to move around, the infrastructure that's needed. And there's also the challenge of who's going to pay for it because it's going to cost trillions of dollars every year.\"\n\n\n\n\n\nDebates continue in the industry over how to balance the potential benefits to the environment and the risks of adding new materials to the ocean.\n\n\n\n\n\nAs tests are conducted from the waters of North America through to New Zealand, developments in the understanding of marine carbon removal are likely to continue.\n\n\n\n\n\nWhile there are problems still to be solved, Planetary's Chief Scientist Will Burt says there is no time to delay.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-30-march-2025/jviop8k5v",
    "title": "Morning News Bulletin 30 March 2025",
    "publish_date": "Sat, 29 Mar 2025 20:01:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nInternational aid arrives in Myanmar as death toll exceeds 1,600\n\nOpposition leader Peter Dutton pushes gas plan to cut energy bills but offers few details\n\nAustralian sprint star Gout Gout edged out by Lachlan Kennedy at the Maurie Plant Meet\n\nThe death toll in Myanmar has surpassed 1,600, after a 7-point-7 magnitude earthquake struck near the city of Mandalay on Friday - the country's ancient capital.\n\n\n\n\n\nThe military junta says another 3,408 people have been injured.\n\n\n\n\n\nTeams have arrived from neighbouring China and India to assist with rescue efforts, with more international aid on the way.\n\n\n\n\n\nA magnitude 6-point-7 aftershock was also felt across the region – in China, Vietnam and Thailand.\n\n\n\n\n\nIn Bangkok, at least 10 people have died - and more than 100 others remain unaccounted for, after the earthquake caused a high-rise building under construction to collapse.\n\n\n\n\n\nRelative of missing Thai construction workers, Chanpen Kaewnoi, says she's waited day and night to see her loved ones.\n\n\n\n\n\n\"My mother and my sister were working on the 5th floor (of collapsed building), my sister ran back to call out for my mum and both of them together with their co-workers ran down. But seems like my mother tripped and fell, my sister tried to help her up and that's when they couldn't make it out.\"\n\n\n\n\n\n**\n\n\n\n\n\nVoters still don't know how much less they will be paying for power under the opposition's gas plan - and Opposition leader Peter Dutton can expect to be pressed for more detail on day two of the campaign.\n\n\n\n\n\nBoth major parties were selling their cost-of-living blueprints to voters on Saturday, with the prime minister talking about cheaper healthcare and the opposition leader focused on energy prices.\n\n\n\n\n\nTouring a brewery in Brisbane, Mr Dutton says high energy prices are putting businesses under serious financial strain and promoted his gas plan as the answer.\n\n\n\n\n\n\"Groceries are up by 30 per cent. I want to make sure with our east coast gas reservation, we can bring down the price of gas - not just for consumers but because it is a big part of business manufacturing; and the production of electricity as well. And we can have an economy-wide benefit.\"\n\n\n\n\n\nUnder the plan unveiled in his budget reply speech on Thursday, Mr Dutton has promised to lower domestic gas prices by forcing exporters to divert uncontracted gas to local users.\n\n\n\n\n\n**\n\n\n\n\n\nCommunities across three states are on high alert for flooding, after days of heavy rain.\n\n\n\n\n\nA severe weather warning is in place for multiple regions in New South Wales, while communities in Western Australia are contending with Cyclone Dianne.\n\n\n\n\n\nBut it is Queensland that is bearing the brunt, with the state's worst flooding in more than 50 years expected to take weeks to clear.\n\n\n\n\n\nMeteorologist Jonathan How at the Bureau of Meteorology says it is the state's southeast that will be the most impacted.\n\n\n\n\n\n\"Across Queensland there is a lot of tropical moisture across the state. And this will drive widespread rain and storms for much of eastern and central parts. Heavy falls are possible. These are really focused around southeastern parts of the state. As well as the northeast and along the inland New South Wales border. For inland parts of the state (Queensland), rainfall is easing back to showers. But right across Queensland, we are seeing much cooler temperatures than usual for this time of year.\"\n\n\n\n\n\n**\n\n\n\n\n\nIsrael has begun ground operations in Rafah’s al-Janina neighbourhood, amid escalating violence across Gaza.\n\n\n\n\n\nIsrael's military has issued two more evacuation directives overnight for western Gaza.\n\n\n\n\n\nUN spokesperson Stephane Dujarric says hostilities continue to intensify across the Strip, causing deaths and injuries while severely limiting humanitarian access.\n\n\n\n\n\n\"Our humanitarian colleagues tell us that the situation continues to rapidly worsen. Intensified hostilities continue across the Strip, killing and injuring people and severely constraining the ability of humanitarian workers to provide lifesaving support. As we mentioned earlier this week, since the ground operation commenced in Rafah on Sunday, several ambulances belonging to the Palestinian Civil Defence, as well as the Palestine Red Crescent were hit while trying to rescue the wounded and their crew became trapped in the area.\"\n\n\n\n\n\nAccording to the UN, at least 1.9 million people – or about 90 per cent of the population – across the Gaza Strip were displaced during the war.\n\n\n\n\n\nMany have been displaced repeatedly, some 10 times or more.\n\n\n\n\n\n**\n\n\n\n\n\nAuthorities say a strong synthetic opioid - called nitazenes - have been detected in fake oxycodone tablets in New South Wales.\n\n\n\n\n\nThe state's Poisons Information Centre Medical Director Dr Darren Roberts says nitazenes are extremely potent synthetic opioids which are more likely to suppress or stop breathing compared with other opioids, and can stay in the body longer than other drugs.\n\n\n\n\n\nThe fake tablets are round and green in colour, and marked with O-C on the front and 80 on the reverse.\n\n\n\n\n\nNew South Wales Health says this packaging is different to genuine branded oxycodone tablets that are sold under the brand name of Oxycontin.\n\n\n\n\n\nFor support and information on drug and alcohol problems, contact the Alcohol and Drug Information Service on 1800 250 015. This is a 24/7 service offering confidential and anonymous telephone counselling and information.\n\n\n\n\n\n**\n\n\n\n\n\nIn athletics, Lachlan Kennedy has edged out national record-holder Gout Gout to win the Peter Norman Memorial 200-metre event at the Maurie Plant Meet in Melbourne.\n\n\n\n\n\n21-year-old Kennedy achieved a personal best time of 20.26 seconds, ahead of Gout on 20.30 seconds.\n\n\n\n\n\nThe race was Gout's first since he clocked 19.98 seconds to become the first Australian ever to run a sub-20-second 200-metres.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/exclusive-chrishelle-stause-on-finding-her-soulmate-g-flip-20250331-p5lnwg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Exclusive: Chrishelle Stause on finding her 'soulmate' G Flip",
    "publish_date": "Mon, 31 Mar 2025 12:58:14 +1100",
    "category": "finance",
    "authors": [],
    "text": "Exclusive: Chrishelle Stause on finding her 'soulmate' G Flip\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/athletics/trying-to-arrest-the-decline-the-52-million-plan-to-put-a-record-number-of-paralympians-on-the-podium-20250331-p5lnt1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Trying to arrest the decline’: The $52 million plan to put a record number of Paralympians on the podium",
    "publish_date": "Mon, 31 Mar 2025 12:49:53 +1100",
    "category": "sports",
    "authors": [
      "Angus Delaney"
    ],
    "text": "Victoria has established its first dedicated unit to discovering and developing the next generation of Paralympians with a funding boost after the 2024 Paris Paralympics, in which Australia recorded its lowest medal tally in more than three decades.\n\nOn Monday, the Victorian Institute of Sport launched the new ParaUnit, which is designed to make it easier for aspiring athletes to start or progress in para-sport. It is funded with $1.66 million from the federal government – part of a larger $54.9 million investment in the Paralympics made by the government in June last year.\n\nWheelchair rugby player Shae Graham. Credit: Simon Schluter\n\nParalympian and Paris bronze medallist Shae Graham said barriers faced by emerging para-athletes included a lack of specialist coaches, the cost of equipment and a lack of pathways for progression.\n\n“I did a lot of Googling and a lot of searching to try and work out just where to go to give wheelchair rugby a go. So, [the] first barrier being like available information,” said Graham, who has been part of two Paralympics in wheelchair rugby.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/brumby-jack-falls-violently-ill-20250331-p5lnw3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brumby Jack falls violently ill",
    "publish_date": "Mon, 31 Mar 2025 12:42:43 +1100",
    "category": "finance",
    "authors": [],
    "text": "Brumby Jack falls violently ill\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/players-ejected-after-mass-nba-brawl-20250331-p5lnw4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Players ejected after mass NBA brawl",
    "publish_date": "Mon, 31 Mar 2025 12:42:38 +1100",
    "category": "sports",
    "authors": [],
    "text": "Players ejected after mass NBA brawl\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/baker-of-things-20250331-p5lnuy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Baker of Things",
    "publish_date": "Mon, 31 Mar 2025 12:34:23 +1100",
    "category": "finance",
    "authors": [
      "Emily Holgate"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nFor fresh sourdough loaves and baguettes, plus cakes, pastries and other specialty snacks.\n\n1 / 4 Koulouri, a traditional Greek baguette shaped like a ring. Supplied 2 / 4 Zesty citrus layer cake created by rolling cake sponge like a Swiss roll. Supplied 3 / 4 The koulouri bread is one of the most popular items. Supplied 4 / 4 Citrus layer cake at Baker of Things. Supplied Previous Slide Next Slide\n\nBakery$$$$\n\nAfter years of supplying baked goods to Maker Coffee across its five outposts, Maker owners John and Stephanie Vroom have found a bricks-and-mortar home for their wholesale label, Baker of Things, inside an industrial warehouse-style shopfront on Burnley Street.\n\nHeaded by ex-Beatrix staffer Zoe Pearce, the Richmond bakery is serving fresh-baked sourdough loaves and baguettes from Wednesday through to Sunday, plus an assortment of pastries, cakes, sandwiches and other specialty snacks.\n\nPopular items include the moreish olive, chilli and anchovy baguette twist, or the zesty citrus layer cake made by rolling cake sponge like a Swiss roll with layers of lemon, lime and orange zest atop a fine layer of lemon curd. The ring-shaped, traditional Greek koulouri baguette is also worth a try (and great for sharing).\n\nBe sure to arrive early to get your hands on a coveted sourdough Neighbourhood Loaf or smaller-sized Loaf For You (they’re often sold out by mid-morning). Maker coffee is on the menu, too, naturally.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-fall-as-wall-street-tumbles-20250331-p5lnq4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Miners, bank slump as ASX tumbles; Todd Sampson to exit Qantas",
    "publish_date": "Mon, 31 Mar 2025 12:31:38 +1100",
    "category": "finance",
    "authors": [
      "Gemma Grant"
    ],
    "text": "The Australian sharemarket has slumped on Monday, with heavy losses from the banks and mining giants coming after more volatility on Wall Street.\n\nThe S&P/ASX 200 index fell by 118.5 points, or 1.5 per cent, to 7,863.5 points as of 12.15pm AEDT. All the eleven industry sectors were retreating, with losses led by miners and information technology.\n\nQantas has announced that Todd Sampson will stand down from the airline’s board. Credit: Joe Armao\n\nThe materials sector was performing poorly shortly after midday, with the sharemarket’s largest company BHP sinking by 3.1 per cent. Fortescue (down 2.8 per cent) and Rio Tinto (down 3.4 per cent) also dropped.\n\nThe financials sector was a sea of red at lunchtime, with the nation’s largest lender Commonwealth Bank shedding 0.6 per cent – a slight improvement from their share price when the markets opened. ANZ (down 2.2 per cent), Westpac (down 1.7 per cent) and NAB (down 0.8 per cent), all saw losses, dragging the ASX lower.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/federal/victoria-s-hot-seats-live-updates-the-electorates-that-will-gauge-the-nation-s-mood-on-big-issues-during-the-2025-federal-election-20250330-p5lno1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria’s hot seats LIVE updates: The electorates that will gauge the nation’s mood on big issues during the 2025 federal election",
    "publish_date": "Mon, 31 Mar 2025 12:26:07 +1100",
    "category": "finance",
    "authors": [
      "Clay Lucas",
      "Cara Waters",
      "Rachael Dexter",
      "Charlotte Grieve"
    ],
    "text": "Hi, over the next five weeks, I’ll be blogging about the seat of Wills as the 2025 federal election unfolds.\n\nI’m normally an investigative reporter for The Age – investigative reporters never miss an opportunity to push their stories, so please read my most recent reporting on Australia’s $4 billion cosmetic injectables industry here. But during the federal election, I’ll follow full-time Labor MP Peter Khalil, the Greens’ Samantha Ratnam, Liberal Jeff Kidney, Socialist Sue Bolton, and all of the other candidates in this northern suburbs seat.\n\nVictorian Labor MP Peter Khalil. Credit: Alex Ellinghausen\n\nWills covers progressive northern suburbs like Brunswick and Coburg and Labor-leaning areas like Pascoe Vale, Fawkner, Oak Park and Glenroy. But a redistribution has added some of Australia’s most green booths — in North Fitzroy and North Carlton — to Wills for the first time.\n\nThis will likely hand Ratnam and the Greens an advantage. However, as I moved around the seat in the last week, preparing for the launch of this blog today, I noticed plenty of Peter Khalil signs on house fences in both North Carlton and North Fitzroy. Maybe that advantage, like so many Greens predictions of victory here, will be an illusion again: it’s been a phenomenon in this seat for more than a decade that the Greens talk up their chance of snatching Wills from Labor and then ultimately a win fails to materialise.\n\nAt the 2022 election, I spent six fascinating weeks in the seat of Chisholm, roaming its suburbs which include Box Hill, Burwood, Glen Waverley and Mount Waverley. There, it was clear a few weeks out that Liberal MP Gladys Liu would struggle to hold the seat from Labor’s Carina Garland. Ultimately, Garland won easily with a 7 per cent swing to her and Labor. So far in Wills, it’s hard to tell whether the Greens’ talk of this being a potential win is just that – talk – or if the voters of this economically and ethnically diverse seat will finally turn out for them. Or will they back Khalil and the status quo? Ratnam has stood in Wills against Khalil before, in 2016. Then, she came close to ending the party’s near-continuous hold on the seat since its creation in 1949. Ratnam secured 45 per cent of the vote that year. Khalil ultimately won but had to rely on preferences from other parties. Since then, no Greens candidate has come near Khalil, who has expanded his majority in the seat on a two-party preferred basis to 9 per cent.\n\nLoading\n\nKhalil, 52, was born in Melbourne to Egyptian parents and grew up in public housing. Ratnam, 47 and born to Sri Lankan parents who left that country because of civil war, is a strong candidate in her own right. In the nine years since she last ran, Ratnam’s profile has grown and grown – first as the mayor of Moreland (now Merri-bek) Council, and then as the state leader of the Greens in Victoria. Wills, famously represented by former Labor Prime Minister Bob Hawke from 1980 until his retirement in 1992, is named after William John Wills who, alongside Robert O’Hara Burke, perished on their ill-fated expedition from Victoria to the Gulf of Carpentaria.\n\nAt the centre of Wills is Bell Street, the major arterial road which once acted as the so-called hipster proof fence in previous elections, with Labor voters to the north and Greens voters to the south. But rising house prices punched a hole in that fence, with younger, Greens-voting progressives increasingly settling in suburbs such as Pascoe Vale and Coburg North. The big issues here, like everywhere in Australia right now, are housing, the cost of living, health policy and particularly whether people can afford it.\n\nBut the vicious politics over Israel and Palestine is the really significant factor in this suburb – just like it is in many of Sydney’s most ethnically diverse seats. Ten per cent of Wills was Muslim at the 2021 Census, so Palestine is sure to be a big focus. The first time I chatted to both of the campaign teams for either side, they talked up what I can only assume is their hoped-for outcome on this issue. Labor argues Israel-Palestine is of vastly less importance to most voters in this seat than the more mainstream issues like health and the cost of living. The Greens say Israel-Palestine is the first thing many residents talk about when Ratnam and her team doorknock homes here. So we will see.\n\nIt’s going to be an exciting five weeks. Please send any tips you’ve got relating to this seat, to any of the candidates, or really anything a voter in Wills might be interested in, to my email, clucas@theage.com.au, my Proton mail, claylucas@protonmail.com, or via Signal on +61439828128. This really will be one of the most fascinating battles in Australian politics in 2025 – I hope you will follow it with me.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/min-woo-lee-survives-water-and-trees-to-win-first-us-pga-tournament-20250331-p5lnrh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I was freaking out’: Min Woo Lee survives water and trees to win first US PGA tournament",
    "publish_date": "Mon, 31 Mar 2025 12:25:06 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Rising Australian golf star Min Woo Lee held his nerve to break through for his first win on the American PGA Tour in a tense finish to the Houston Open, his cool demeanour in the final three holes hiding his jagged emotions.\n\n“I was freaking out inside,” Lee said after the win. “It was tough. Props to the guys who win week-in, week-out. It is very hard.”\n\nLee had to make par on the final hole to hold off world No.1 Scottie Scheffler – who shot four consecutive birdies on the back nine – and major winner Gary Woodland. The pair drew within one shot of forcing a play-off when they shot eight and seven under respectively on the final day to whittle away Lee’s lead to the narrowest margin.\n\nIt took a brilliant putt from just off the green by Lee, who is coached by Ritchie Smith, to seal the title as he put the ball within centimetres of the 18th hole for a tap-in par to make a final round 67 and finish 20 under for the tournament. He had made a bogey at 16 after going into the water.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/world/asia/trump-s-usaid-cuts-hobble-earthquake-response-in-myanmar-20250331-p5lntc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "China and Russia already have boots on the ground in Myanmar. The US is nowhere to be seen",
    "publish_date": "Mon, 31 Mar 2025 12:21:03 +1100",
    "category": "finance",
    "authors": [
      "Hannah Beech",
      "Edward Wong"
    ],
    "text": "The employees who received lay-off notices were told they should go home that afternoon. Some had been co-ordinating with aid missions in Bangkok, the Thai capital, and Manila, capital of the Philippines, which handle disaster response in Asia. Two of the employees in Washington had expected to move this winter to Yangon, in Myanmar, and to Bangkok to work as humanitarian assistance advisers out of the US missions there. But those positions were cut. Had they not been, the two employees would have been on the ground to organise urgent responses to the earthquake. After the disaster hit on Friday, the US embassy in Yangon, Myanmar’s largest city, sent a cable to USAID headquarters in Washington to start the process of evaluating aid needs and getting help out the door. And the next day, a Trump administration political appointee in USAID, Tim Meisburger, held a call with officials from national security agencies to discuss a plan. But Meisburger said that while there would be a response, no one should expect the agency’s capabilities to be what they were in the past, a person with direct knowledge of the call said.\n\nA USAID spokesperson did not reply to a request for comment. The agency typically has access to food and emergency supplies in warehouses in Dubai, United Arab Emirates and Subang Jaya, Malaysia. But the big question now is how quickly, after being almost fully dismantled, it can get goods from those places into Myanmar. The goods include medical kits that can each serve the healthcare needs of 30,000 people for more than three months. Russian search-and-rescue teams with their dogs in Myanmar. Credit: Russia Emergency Ministry press service via AP Apart from career diplomats, the ranks of the agency’s Bureau for Humanitarian Assistance have included crisis specialist contractors who live around the world and can deploy quickly in what are called Disaster Assistance Response Teams. Many of those contractors have been fired, and the infrastructure to support them in Washington and other offices – people who can book flights and manage payments, for instance – was crippled by cuts over the past two months. The agency would also usually put certified search-and-rescue teams in Virginia and Southern California on alert for possible deployment to the disaster zone, but transportation contracts for those teams had been cut, a former aid agency employee said.\n\nUSAID’s annual allocations for Myanmar were about $US320 million last year. About $US170 million of that was for humanitarian work, while the rest was for development initiatives such as democracy building and health. Only a few million dollars’ worth of projects remain operational, though some of those programs, including one for maternal and child health, have not received funding despite being told the initiatives are not being closed down. Before the cuts, the annual costs of total US foreign aid were less than 1 per cent of the federal budget. Russian and Chinese rescuers free a woman who had been lying under piles of concrete for two days. Credit: AP At a news conference in Jamaica last week, US Secretary of State Marco Rubio said the United States would continue foreign aid work, though in drastically reduced form. He said the aim was to provide aid “that is strategically aligned with our foreign policy priorities and the priorities of our host countries and our nation states that we’re partners with”. On Friday, Tammy Bruce, a US State Department spokesperson, said crisis teams stood ready to deploy to Myanmar.\n\nThe United States’ ability to provide lifesaving aid has been hampered not just by budget cuts but by obstacles in Myanmar itself. Since grabbing power in 2021, Myanmar’s military junta has closed off the country from Western influences. Myanmar is now embroiled in civil war, with a loose coalition of opposition forces having wrested control of more than half the country’s territory. Loading The United States and other Western nations have responded to the junta’s brutal human rights record with sanctions, and the military chief who orchestrated the coup, Senior General Min Aung Hlaing, has railed against the West, thanking China and Russia for ideological and economic support. Nevertheless, in the hours after the earthquake struck, Min Aung Hlaing said he welcomed outside disaster relief aid – and not just from countries with friendly relations with the military regime. Myanmar experts say they are concerned that some of the aid that goes through the junta could be diverted to the armed forces. The Myanmar military is underfunded and short on morale as it fights resistance forces on many fronts.\n\nIn Mandalay, residents said they were upset to see soldiers lounging around the sites of collapsed buildings. Some played video games on their phones, while locals used their hands to pry bricks from the rubble. Still, Chinese and Russian search-and-rescue teams, outfitted in orange and blue uniforms, were digging through the wreckage in Mandalay on Sunday, and a Belgian squad was making its way north. People watch rescuers work at the Sky Villa Condo that collapsed in Mandalay. Credit: AP A good chunk of USAID funding had been dedicated to areas of the country not under junta control. US assistance has gone to healthcare and schooling for internally displaced people. It has supported local administrations that are trying to form mini-governments in conflict areas. And it has tried to provide emergency relief to civilians battered by junta airstrikes. In the region of Sagaing, a stronghold of resistance against the junta, Myanmar military jets carried out two rounds of airstrikes on Nwel Khwe village hours after the earthquake destroyed buildings there, adding more terror to residents’ lives.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/pellegrini-finishes-stunning-moana-try-20250329-p5lnjm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pellegrini finishes stunning Moana try",
    "publish_date": "Mon, 31 Mar 2025 12:11:32 +1100",
    "category": "finance",
    "authors": [],
    "text": "Pellegrini finishes stunning Moana try\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/property/news/their-first-brisbane-house-flip-nets-melbourne-couple-3-55-million-20250331-p5lnsv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Their first Brisbane house flip nets Melbourne couple $3.55 million",
    "publish_date": "Mon, 31 Mar 2025 12:04:27 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Melbourne couple have almost doubled their money on a Wilston Queenslander that sold for $3.55 million under the hammer on Saturday.\n\nThe five-bedroom home, 46 Angliss Street, last sold for $1.885 million in 2022, with the couple giving it a cosmetic glow-up before selling to buyers who inspected it just minutes before bidding began.\n\nFor the vendors, it was their first Brisbane flip after relocating to the Queensland capital for a lifestyle shift, with the pair pulling off a revamp that included a new kitchen, bathroom, paint and carpet.\n\nAccording to Domain’s latest House Price Report, Wilston has clocked some of the steepest price growth over the past year, with house medians soaring 25 per cent to $1.9 million.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/business/markets/the-trump-fire-is-burning-on-wall-street-20250331-p5lnrs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trump fire is burning on Wall Street",
    "publish_date": "Mon, 31 Mar 2025 11:58:03 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "American consumer sentiment is plunging, consumers expect inflation to surge, and the US sharemarket is tanking. And all that is before this week’s “Liberation Day,” when President Donald Trump will reveal his “reciprocal” tariffs.\n\nThe US sharemarket fell 2 per cent on Friday – it’s down more than 9 per cent since Trump announced his plan for reciprocal tariffs in the middle of last month – with the tech-heavy Nasdaq market down 2.7 per cent and the “Magnificent Seven” mega-tech stocks down 3.5 per cent.\n\nWall Street appears jittery on the outlook for the economy in Trump’s second term. Credit: Getty\n\nThe already jittery market’s end-of-week selloff on Friday was a response to hotter-than-anticipated inflation data and a University of Michigan survey which showed a 12 per cent fall in the index of consumer sentiment in March to its lowest level since 2022 and an 18 per cent fall in expectations of the economy’s future.\n\nThose surveyed expect inflation to reach 5 per cent over the next year and be more than 4 per cent over the next five years. Two-thirds of them expect unemployment to rise over the next 12 months.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/hip-drop-tackles-are-a-blight-on-the-game-and-rugby-bosses-need-to-stamp-them-out-20250331-p5lnr6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hip-drop tackles are a blight on the game and rugby bosses need to stamp them out",
    "publish_date": "Mon, 31 Mar 2025 11:40:00 +1100",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "Loading\n\nIf Max Jorgensen misses the British and Irish Lions series with the ankle injury he sustained against the Hurricanes on Saturday, Rugby Australia will have every right to feel very aggrieved.\n\nThere is a lot of debate about what actually constitutes a “hip drop” tackle, but common sense tells you that when any defender uses his own body weight to drag a player to the ground, therefore putting all the force through the ball carrier’s lower limbs, there is risk involved.\n\nWhat will annoy the Waratahs is that Hurricanes No.6 Brayden Iose used the same technique on Jorgensen just two phases before the injury occurred. It was an incident waiting to happen, and rugby bosses need to get on the front foot, because it took them far too long to deal with croc rolls when they started creeping into the game.\n\nWaratahs to face another Australian talent that got away",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/property/news/mosman-local-beats-six-others-for-16-1-million-knockdown-at-auction-20250331-p5lns6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mosman local beats six others for $16.1 million ‘knockdown’ at auction",
    "publish_date": "Mon, 31 Mar 2025 11:32:41 +1100",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "Seven buyers hoping to turn a Mosman deceased estate into a trophy home registered at auction on Saturday, pushing the sale price to $16.1 million.\n\nThe three-bedroom house at 13 Stanley Avenue appealed for its elevated position on the Balmoral slopes with uninterrupted views.\n\nFour Mosman locals took part indoors while rain fell on the ocean outside.\n\nBidding opened at $10 million, and after some $500,000 bids quickly soared past the $11.5 million reserve, which was in line with similar sales in the area.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/sport/afl/the-psychology-degree-cripps-hopes-can-help-the-blues-overcome-winless-start-20250331-p5lnrn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The psychology degree Cripps hopes can help the Blues overcome winless start",
    "publish_date": "Mon, 31 Mar 2025 11:30:04 +1100",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Carlton captain Patrick Cripps is studying psychology and says he is using his degree to help keep the players together, as the under-fire Blues attempt to overcome a winless start to the season.\n\nThe Blues are under enormous pressure heading into Thursday night’s blockbuster against Collingwood at the MCG.\n\nHistory suggests their September dreams may already be over; only four of 54 teams since 2007 that have started 0-3 have recovered to make the finals.\n\nMind games: Carlton captain Patrick Cripps is studying psychology. The Blues hope to turn their season around against the Magpies on Thursday. Credit: AFL Photos\n\nAt the annual Peter Mac Cup breakfast, Cripps revealed his post-graduate degree was helping his captaincy.",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://au.news.yahoo.com/woolworths-silent-on-bizarre-trolley-robot-as-workers-union-responds-to-footage-005331086.html",
    "title": "Woolworths silent on bizarre trolley robot as workers' union responds to footage",
    "publish_date": "2025-03-31T00:53:31Z",
    "category": "finance",
    "authors": [],
    "text": "Despite some backlash online, a union spokesperson told Yahoo News the technology could be in the interest of workers.\n\nThe retail workers' union has responded to panic over the sighting of a Woolworths robot in a Brisbane car park. Source: TikTok/Indians_in_brisbane_est & Associated Press\n\nFootage of a Woolworths robot appearing to collect a long row of supermarket trolleys and returning them to the bay in a store car park has left Aussies questioning if the technology will replace staff. However, a retail union secretary told Yahoo News the emergence of such technology is likely a good thing for the workforce.\n\nThe robot in question appeared to have a flashing safety light and was covered in Woolworths branding as it pushed the trolleys back towards the bay. It is unclear whether the person behind the camera capturing the video in Brisbane was a shopper or worker, however, they joked the supermarket giant has now \"hired R2-D2\" and paid tribute to the workers who used to do the job of collecting stray trolleys from the premises.\n\nThere was a mixed response from shocked shoppers online, with many concerned the technology will make it increasingly more difficult for \"desperate job seekers\".\n\n\"We are going to have so many problems with these,\" one person commented online, while another worried they be taking jobs away. However some Aussies applauded the apparent introduction of the technology, believing it will help ease workers' load.\n\nADVERTISEMENT\n\nHowever not much is known about the mysterious Woolworths-branded bot. Yahoo News reached out to the company to ask about the robot on Friday last week, but the supermarket giant has not provided any information.\n\nSupermarket union supports 'tool of the trade'\n\nDespite some panic over what the implications of this will be on supermarket workers, the secretary of the Retail and Fast Food Workers Union (RAFFWU), Josh Cullinan, told Yahoo News he doesn't believe the technology will replace staff — at least not while they are being controlled by workers via a device.\n\n\"It looks like a human controlled device that pushes the trolleys and assists the worker, not that it is working autonomously,\" Cullinan told Yahoo News.\n\nADVERTISEMENT\n\nThis \"tool of the trade\" will likely help workers, rather than threaten their jobs, as the laborious task of collecting and pushing heavy trolleys across the car park will now be left to the robot.\n\n\"It's not dissimilar to electric pallet jacks being introduced. Basic pallet jacks were just these things on wheels, and moving stock into trucks was horrendous because any bump or slope would risk everything toppling [over], but electric pallet jacks have been a big benefit for workers.\n\n\"If it's a device to help control and push trolleys and it takes the weight off a human being, then that is something we support,\" he said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 42
  },
  {
    "url": "https://au.news.yahoo.com/more-expensive-road-fines-coming-for-millions-of-aussie-drivers-within-months-215808667.html",
    "title": "More expensive road fines coming for millions of Aussie drivers within months",
    "publish_date": "2025-03-30T21:58:08Z",
    "category": "finance",
    "authors": [],
    "text": "Starting from the next financial year, traffic fines in Queensland will increase again to new all time highs.\n\nFines handed down on Queensland's roads are set to rise in the coming months. Source: Getty/Reddit\n\nDrivers caught breaking the law on the road will soon cop even heftier fines in one state as the country's harshest government is again set to increase penalties for motorists.\n\nQueensland's state government fines are scheduled to rise by 3.5 per cent starting next financial year, meaning anyone caught speeding up to 10 kilometres per hour over the speed limit will cop a $333 fine — a rise of $11 from last year.\n\nThe increase will mean anyone caught wearing their seatbelt incorrectly or using their phone behind the wheel will face a $1,250 infringement, up $42.\n\nIn 2024, the former Labor government hiked up infringements by 4.2 per cent for the 2024-25 financial year. While in 2023, they rose 7.7 per cent.\n\nADVERTISEMENT\n\nThe annual increase in state government fines in Queensland is tied to a default rate of 3.5 per cent to ensure penalties maintain their deterrent effect over time. By law, the government can only raise fines by the default rate unless Treasurer David Janetzki approves a different increase by the end of March.\n\nJanetzki confirmed fines will be capped at 3.5 per cent this coming financial year. The rate is built into legislation to provide a consistent and predictable framework for fine adjustments without requiring frequent government intervention.\n\nFrom the start of the next financial year, fines in Queensland will rise by 3.5 per cent. Source: TfNSW\n\nHow much are road fines rising by in Queensland?\n\nThe Treasurer’s decision, typically made before the end of March each year, takes into account factors such as cost-of-living pressures, revenue needs and the effectiveness of fines in promoting compliance with laws. \"Any change will be applied in accordance with the process under the Penalties and Sentences Act 1992,\" a statement from Janetzki to the ABC read.\n\nADVERTISEMENT\n\nThose who disobey stop signs or fail to give way to a pedestrian will face a $500 fine, increasing by $17 from the last financial year. Drivers who are travelling more than 40km/h over the speed limit will cop a massive $1,918 fine, increasing by $65 from current rates.\n\nThe increase in fines and forfeitures is anticipated to generate $912m in the 2025-26 budget, according to the report. Last year’s budget had flagged revenue of $794m in the 2024-25 financial year, increasing from the $741m the year before.\n\nIn 2021, the state government introduced advanced detection cameras across Queensland, which have led to a large increase in the number of infringements handed out to drivers.\n\nPrior to installing the hi-tech cameras – which target drivers using their phones and those not wearing seatbelts – the State Penalties Enforcement Registry was chasing $8.7m in unpaid fines. That figure has since jumped to $110m, with the SPER hunting down more than 100,000 unpaid fines.\n\nADVERTISEMENT\n\nThere is also approximately $51m worth of unpaid seatbelt-related fines on the books.\n\nYahoo News Australia has contacted the Queensland Treasurer's office for comment.\n\nwith NCA Newswire\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 43
  }
]