[
    {
        "url": "https://www.9news.com.au/national/optus-triple-zero-outage-email-notification-wrong-address/9e012423-d5ff-440f-b650-d1727e46aea8",
        "title": "Optus sent triple-zero outage notification to wrong email address",
        "publish_date": "Wed, 08 Oct 2025 01:23:48 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Optus notified the government about its major triple-zero outage last month that led to the deaths of three people by sending two emails to the wrong address, a parliamentary committee has been told.\n\nAddressing Senate estimates this morning, Deputy Secretary James Chisholm said Optus sent two emails about the outage on September 18 – the first at 2.45pm when it was detected, and the second seven minutes later when it was fixed — were sent to an old, out-of-date address.\n\nThe inbox wasn't monitored, so it wasn't until the next afternoon that the department found out about the outage.\n\nOptus notified the government about its triple-zero outage by sending two emails to the wrong address. (AP Photo/Mark Baker)\n\n\"We have systems in place for notification. That requires information being sent to the right place,\" Chisholm said.\n\n\"That email was not even sent to the right place.\"\n\nThis was despite Optus using the correct email address before the outage.\n\n\"Optus had, indeed, regularly been sending outage notifications to the correct outage notification email address in all instances other than the incredibly significant outage of the 18th of September,\" First Assistant Secretary Samual Grunhard said.\n\nThe hearing was told the telecommunications industry had been told which address to use, and that the correct one is publicly listed on the Australian Communications and Media Authority's (ACMA) website.\n\n9news.com.au has contacted Optus for comment.\n\nOptus CEO Stephen Rue didn't inform the public about the outage until more than a day after it had been resolved. (Sitthixay Ditthavong)\n\nThe damning revelation comes after telco bosses, including Optus chief executive Stephen Rue, were summoned to a meeting with Communications Minister Anika Wells yesterday as she unveiled new triple-zero watchdog laws.\n\nIt also coincided with a visit to parliament by Lawrence Wong, the prime minister of Singapore, the home of Optus' parent company, Singtel.\n\nFollowing a meeting with Prime Minister Anthony Albanese, Wong said he expected the companies to fully cooperate with the investigation into the outage.\n\n\"I understand fully the anger, frustration and outrage at what happened… I've extended my condolences to those impacted by the outage, including the family members and loved ones of those who lost their lives, which is tragic,\" he told reporters.\n\n\"All I can do is to say, from a government's perspective, we expect our companies to act responsibly.\"\n\nSingapore Prime Minister Lawrence Wong said he expected Singtel and Optus to fully cooperate with the investigation into the outage. (Dominic Lorrimer)\n\nOptus had already faced heavy criticism for its handling of and response to the outage, particularly its communication about it.\n\nThe telco had initially told ACMA that it had only impacted 10 calls, and it wasn't until the day after the outage, late on Friday, September 19, that the public was informed about the issue.\n\nRue also admitted Optus received at least five calls to its customer service line about the outage before it was fixed.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gold-prices-gold-to-become-australias-second-richest-resource-export-as-prices-skyrocket-in-uncertain-world/7115c64c-a272-43b7-bf50-6fb867c949b0",
        "title": "The world is anxious and it's fuelling a new Australian gold rush",
        "publish_date": "Tue, 07 Oct 2025 19:23:15 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "The world is anxious and it's fuelling a new Australian gold rush.\n\nRecord prices for the rare material investors flock to amid global uncertainty are expected to push gold past gas to become our second most valuable resource export.\n\nGold futures are up about 50 per cent since the start of 2025, bursting through the $US4000 ($6071) per ounce mark for the first time ever this morning.\n\nThree 1kg gold bullion bars lie on the counter in a gold dealers in the jewellery quarter in Birmingham, England. (Photo by Christopher Furlong/Getty Images/File)\n\nGold is expected to pull in an extra $13 billion for Australia's resources and energy exports revenue this financial year compared to 2024-25, because many of the other big hitters are plunging.\n\nAnd that's a good thing because the Department of Industry, Science and Resources expects the country to make $16 billion less from these exports this financial year, even with the golden boost.\n\nGold exports are predicted to surge from $47 billion in 2024–25 to $60 billion this year before remaining almost steady next year, according to the September 2025 Resources and Energy Quarterly, published yesterday.\n\nBut it's only able to surpass gas because liquid natural gas prices are falling rapidly in the face of lower oil prices and more LNG supply from the US and Qatar.\n\nThe department expects a drop from $65 billion to $48 billion this year, amid five years of falling prices.\n\nEven iron ore, the undisputed gold medallist of the sector with $116 in exports last year, is expected to take a hit, raking in $3 billion less this year and falling another $10 billion in 2026-27.\n\nEven iron ore, the undisputed gold medallist of the sector with $116 in exports last year, is expected to take a hit. (Alex Ellinghausen)\n\nEven though miners will be digging up more (1.4 per cent) of the material the world relies on to make steel every year, prices are expected to drop thanks to more supply from Africa and other regions.\n\n\"The discovery of gold helped build this nation and gold mining is still creating wealth and jobs for our economy today,\" Minister for Resources and Northern Australia Madeleine King said.\n\n\"Australia's resources and energy sector remains strong, with gold and critical minerals playing an increasingly important role in our export mix.\"\n\nGold hit a record high today. (Sven Hoppe / dpa/picture alliance / Getty)\n\nWhy are prices going up?\n\nGold sales can rise sharply when anxious investors seek secure investments for their money.\n\nThe asset has seen wide gains over the past year, particularly with US President Donald Trump's barrage of tariffs plunging much of the world into economic uncertainty.\n\nOther precious metals, such as silver, have also raked in gains. S\n\nilver futures are up about 60 per cent, trading at close to $US48 per troy ounce on Tuesday.\n\nMuch of the recent economic turmoil has spanned from Trump's trade wars, which have pushed costs higher and weakened the US job market.\n\nGold sales can rise sharply when anxious investors seek secure investments for their money. (AP Photo / Frank Franklin II)\n\nThe current US government shutdown has added to anxieties among consumers and bosses.\n\nUBS Global Wealth Management commodity analyst Giovanni Staunovo also points to continued weakness of the US dollar and renewed rate cuts from the Federal Reserve Bank.\n\nSince mid-January, the US dollar has fallen 9 per cent against a basket of currencies, a rare and steep decline, to its lowest level in three years.\n\nInvestors traditionally dump Aussie dollars during global uncertainty but it's up more than 6 per cent against its US counterpart since the same time, while having fallen more than 6 per cent against the euro and almost 4 per cent against the pound sterling.\n\nGold prices have surged to a record high. (Getty)\n\nIs gold worth the investment?\n\nAdvocates of investing in gold call it a \"safe haven\", arguing the commodity can serve to diversify and balance your investment portfolio, as well as mitigate possible risks down the road.\n\nSome also take comfort in buying something tangible that has the potential to increase in value over time.\n\nStill, experts caution against putting all your eggs in one basket.\n\nAnd not everyone agrees gold is a good investment.\n\nCritics say gold isn't always the inflation hedge many say it is – and that there are more efficient ways to protect against potential losses.\n\nThe Commodity Futures Trade Commission previously warned precious metals could be highly volatile, saying \"when economic anxiety or instability is high, the people who typically profit from precious metals are the sellers\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/google-ai-mode-search-giant-launching-most-powerful-ai-search-experience-yet-in-australia/08b9f298-2e32-4c84-a68e-c169a3487682",
        "title": "Google hopes this one little tab is about to change the way you search",
        "publish_date": "Tue, 07 Oct 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "An artificial intelligence injection that's been dubbed the biggest change to Google Search in years is coming to Australia , allowing users to ask more complex questions.\n\nThe search giant this morning announced it would be rolling out AI Mode, its \"most powerful AI search experience yet\", in Australia and more than 40 other countries this week.\n\nIt's just one small tab on your computer or smartphone search page but the company says it will make a big difference to search, offering something that's different to both traditional internet scouring and new chat-based AI tools.\n\nAn artificial intelligence injection that's been dubbed the biggest change to Google Search in years is coming to Australia, allowing users to ask more complex questions. (Google)\n\nVice president of product management Hema Budaraju said Australian users would start seeing a new tab called AI Mode alongside their standard search options.\n\n\"Once you click into that, you should be able to ask any question, literally any question on your mind, and then receive a predictable AI response that has got many ways to engage with the web, as well as the ability to ask a follow-up,\" she told 9News.\n\nShe used examples such as figuring out which clubs someone just starting out in golf should buy or how to handle a weird error message thrown up by a washing machine.\n\n\"How might you be able to just take a picture of that and ask, 'Hey, is this a normal error? What should I do? Can I fix this by myself? Do I need to call technician?',\" she said.\n\n\"Now, remember in a world where it was very keyword driven, this would have been many, many searches and hours of agony, and now you can literally just take a picture and ask for information.\"\n\nAI Mode uses what Google calls a query fan-out, meaning it analyses your natural-language or image query and breaks it off into many different queries that it knits back into an answer the company says can be both broader and deeper than a traditional search, but still accompanied by links.\n\nGoogle vice president of product management Hema Budaraju. (Google)\n\nGoogle gave the example of creating yourself a walking tour around Melbourne to check out specialty coffee shops, galleries and street art, then asking where you could stop for lunch and dinner along the way.\n\nBudaraju said people were \"not looking just for an AI response\" but also wanted to be connected to web results they could use in a \"very intuitive, simple, frictionless manner\".\n\nAI Mode is based on Google's Gemini AI models and real-time information from the search engine and can search using text, voice or photos but users can still opt for traditional searches.\n\nBudaraju said it was distinct from the Gemini chatbot, which she said might offer more creative answers while AI Mode was more focused on finding information.\n\nAI Mode uses what Google calls a query fan-out, meaning it analyses your query and breaks it off into many different queries that it knits back into an answer the company says can be both broader and deeper than a traditional search, but still accompanied by links. (Google)\n\nShe said more than 100 million people in the US and India had used the new search option since it rolled out there earlier this year.\n\nAlthough Google's parent company Alphabet has its finger in everything from online video and email to mobile phones and self-driving cars, Search is its baby, raking in almost $US200 billion ($303 billion) a year.\n\nThat means there's a lot riding on even small changes to a product that's used trillions of times a year by billions of people.\n\nBut Google Search is facing increasing competition from large-language-model AI competitors. According to market research firm SparkToro, Google still powers 210 times more searches than ChatGPT, but the use of LLMs is growing.\n\nAn Apple executive testified earlier this year that Google searches on Apple devices' Safari browser fell for the first time in 20 years.﻿\n\nWhile Google says it's put in a lot of work to make the new search feature as accurate as possible, it still warns people to double-check information for important topics.\n\n\"As with any early-stage AI product, we won't always get it right, but we are committed to continuous improvement,\" Budaraju wrote in a blog post published this morning.\n\nThere are also some unanswered questions around electricity and water usage and the impact AI search is having on the web.\n\nThere are also some unanswered questions around electricity and water usage and the impact AI search is having on the web. (Jessica Shapiro/AFR)\n\nIn August this year, Google said the median text-based Gemini query used about 0.00024kWh, eight times more than the commonly cited figure for a normal Google search. But that figure is from 2009 so some researchers suggest it could be much much lower thanks to advancements in computing efficiency.\n\n\"The per-prompt energy impact is equivalent to watching TV for less than nine seconds,\" Google said in a blog post.\n\n\"At the same time, our AI systems are becoming more efficient through research innovations and software and hardware efficiency improvements.\n\n\"For example, over a recent 12 month period, the energy and total carbon footprint of the median Gemini Apps text prompt dropped by 33x and 44x, respectively, all while delivering higher quality responses.\"\n\nIt's unclear how much AI Mode uses compared to a normal search or a Gemini prompt.\n\nIn terms of the web, many online publishers have reported seeing their traffic drop alongside the introduction of Google's AI Overviews, raising the spectre of a \"Google zero\" future where searches no longer send any clicks to the websites that rely on them.\n\nGoogle claims people are \"visiting a greater diversity of websites\" from AI overviews and says the people who click through them are more likely to spend more time on the sites they visit.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/surfer-survives-shark-attack-off-kangaroo-island/b2b4efb3-6ad9-483f-a7d1-de9e57e3c2d5",
        "title": "Surfer twice bitten by shark chasing seal off Kangaroo Island",
        "publish_date": "Tue, 07 Oct 2025 19:39:49 +0000",
        "category": "sports",
        "authors": [
            "Oct"
        ],
        "text": "A surfer who survived a shark attack off South Australia's Kangaroo Island drove himself to hospital after being bitten.\n\nFootage believed to be of the attack about 1.30pm yesterday captures the moment chaos unfolded near a popular surf break, known as The Sewer, at D'Estrees Bay.﻿\n\nAccording to Shark Watch SA, a community shark monitoring site, the predator, believed to be a bronze whaler, was chasing a seal in the lead-up to the incident.\n\nFootage believed to be of the attack about 1.30pm yesterday captures the moment chaos unfolded near a popular surf break (Nine)\n\nD'Estrees Bay on Kangaroo Island. (Wikipedia)\n\nIt was reported the seal used the surfer as a decoy before the man was bitten.\n\n﻿The surfer, aged in his 50s, was bitten twice and suffered non-life-threatening injuries.\n\nBronze whaler sharks can grow to a maximum weight of ﻿300kg and up to 3.3m in length.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/geelong-cats-fined-by-afl-over-third-party-disclosures/105866216",
        "title": "Geelong Cats fined by AFL over third-party disclosures",
        "publish_date": "Wed, 08 Oct 2025 01:46:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "The AFL has fined Geelong tens of thousands of dollars after an audit into six years' worth of player payments.\n\nThe league said the audit relating to the total player payment (TPP) limit and the soft cap limit from 2019 through 2024 found the club did not breach the TPP or player movement rules.\n\nBut it did find \"a series of non-disclosures and/or late disclosures of arrangements with club associates and third parties, that were required to be reported to the AFL\".\n\nThe Cats have been fined $77,500, with $40,000 of it suspended for two years, pending that no future disclosure breaches are found.\n\nLoading",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/sam-kerr-matildas-return-mary-fowler-asian-cup/105864112",
        "title": "Kerr finally set for Matildas return, Fowler on track for Asian Cup",
        "publish_date": "Wed, 08 Oct 2025 01:10:07 +0000",
        "category": "sports",
        "authors": [],
        "text": "After two long and trying years, Sam Kerr will finally return to the pitch for the Matildas, for this month's friendlies against Wales and England in the UK.\n\nMatildas coach Joe Montemurro has all but confirmed she will be included in the squad, which will be named on Friday.\n\nKerr's comeback from the ACL injury she sustained in January 2024 kicked off three weeks ago for her club side Chelsea.\n\nShe's played limited minutes in her four consecutive WSL matches off the bench, and Montemurro said she will be eased back into international football.\n\n\"It's great to see her back. I've had a few discussions with her and I think the great thing is that she's really got an enthusiasm and a real passion back for the game,\" he said.\n\n\"We'll definitely do the right thing by her in terms of integrating her.\n\nKerr in action recently for Chelsea, on the comeback trail from an ACL injury. (Getty Images/Chelsea FC: Harriet Lander )\n\n\"She hasn't played 90 minutes yet. So we'll just see getting closer to camp what sort of minutes we believe is gonna be the best for her so that we make this return perfect both from a football and a mental perspective.\"\n\nThe 32-year-old's last appearance for the Matildas was in November 2023, and it has been an eventful period for the team and her personally since then.\n\nShe missed the Australians' underwhelming Paris Olympics campaign that ended at the group stage, was found not guilty of racially harassing a police officer, and welcomed a baby with partner Kristie Mewis.\n\nThe West Australian trained with the squad during the last two camps at home, but is yet to play under Montemurro, who started his tenure in June.\n\nAnd he has not decided whether she will reclaim the captaincy from Steph Catley.\n\nKerr has trained with the Matildas in their last two camps this year. (Getty Images: Paul Kane)\n\n\"Integrating her is the first and foremost thing and to be honest I haven't had a discussion about it,\" he said.\n\n\"The focus has been getting the squad to a point where we want and everyone's on board with that. The captaincy will be assessed once we get closer to the first game.\"\n\nMary Fowler on track\n\nMary Fowler's recovery from her own ACL injury, sustained in April, continues to take massive strides.\n\nMary Fowler recently re-signed with Manchester City until 2027. (Manchester City)\n\nWhile Kerr was sidelined for 20 months, the 22-year-old Manchester City forward is targeting a return in less than half that time, with March's Asian Cup in Australia the firm focus.\n\n\"Hopefully at the end of the year we'll see her getting some game time at City,\" Montemurro said.\n\n\"They're at that crucial point now where they're probably starting to push her a little bit more [in her recovery], which is great.\n\n\"I'll be going to visit actually next week. But she's travelling really well and fingers crossed the Asian Cup is looking really, really positive from that perspective.\"\n\nTime for stabilising\n\nMontemurro is using the UK games as an \"identification camp\", aiming to virtually finalise his Asian Cup squad ahead of the last international window of the year in November.\n\n\"I still wanna have a look at whether they fit the way we wanna play and how we're gonna approach the Asian Cup,\" he said.\n\nMontemurro has a short time to get the team ready for the Asian Cup. (Getty Images: Darrian Traynor)\n\n\"But I will be stabilising a lot of the the ideas in terms of in terms of patterns, the way we want to play.\"\n\nWhile most of the Matildas' top talent is based overseas and the A-League women's season kicking off at the end of October, Montemurro has assured that domestic players will be given due consideration.\n\n\"I don't want to punish anyone because they've decided to stay in the A-League and the national team is far away,\" he said.\n\n\"I don't wanna take that attitude. The attitude is what's best for the Matildas to go forward and obviously what's best for the athlete to be at their best.\n\n\"And whether it's staying in the A-League or going overseas, I just say be in the best high performance situation that you could be.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/ironwoman-world-championship-hawaii-australian-competitor/105845064",
        "title": "Outback athlete shares journey to ironman world championship",
        "publish_date": "Wed, 08 Oct 2025 00:59:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Broken Hill nurse Bella Kolinac is one of 35 Australian women headed to Hawaii to compete in the Ironman World Championship — Women on October 11.\n\nThe course involves a 3.8-kilometre swim along the Kona coastline, a 180-kilometre bike ride through lava fields, finishing with a 25.6-kilometre run.\n\nThe idea first came to the 23-year-old years earlier when she first met her partner.\n\nIsaac Sullivan, 30, had been throwing around the idea of entering a triathlon, and Kolinac wanted to go a step further.\n\n\"Originally, I said I wanted to start with a full Ironman. He thought that was insane,\" she said.\n\nBella Kolinac is representing Australia at the Ironman World Championship — Women. (ABC Broken Hill: Coquohalla Connor)\n\nMr Sullivan instead implored her to work towards the goal over smaller increments, which she managed to do while working full-time.\n\n\"I trained an average of 16 hours a week and then the last couple of weeks I did a 20-hour week. I was getting up at 4am and doing crazy hours,\" Kolinac said.\n\nDespite a packed training schedule, Kolinac did not believe she would qualify for the Ironman competition and remembered feeling shocked when she realised she had made it through.\n\nKolinac qualified for the international competition in May in Port Macquarie, where she placed second, securing the 31st qualifying position for Kona.\n\nBella Kolinac rides for hours at a time, often with no music. (ABC Broken Hill: Coquohalla Connor)\n\nMr Sullivan remembered feeling a bit hesitant at first, but he quickly became Kolinac's biggest supporter.\n\n\"You can be that person that tears someone's dreams down and be negative, but with Bells, seeing her passion and drive … [it made me] actually look at it and go, 'All right, how do we do this? How do we make this happen?'\" he said.\n\nSince qualifying in May, Kolinac switched from full-time work to casual so she could dedicate more time to training, and also hired a trainer.\n\nBella Kolinac recently rode to Menindee and back. (Supplied: Bella Kolinac)\n\nHer training changes from week to week, with her trainer timetabling her long runs, rides, swims and rest.\n\n\"Saturday is usually like my long brick session day, so I'll do a six-hour ride with a one-hour run. Then on Sunday will be a long run, usually two to three hours, with a swim or a ride,\" she said.\n\nThe weather in Broken Hill can be hampering.\n\nIn recent weeks, when Kolinac was ramping up her training, high winds with raised dust caused a bit of a road bump, including when she rode her bike to Menindee, a 224-kilometre round trip.\n\n\"It was 35 kilometres per hour winds, and it was all cross winds, so it was just hitting me, and I'm literally burned from all the half side of me,\" she said.\n\nOnce Bella Kolinac gets into the zone, there is no stopping her. (Supplied: Bella Kolinac)\n\nWhen the weather is particularly bad, she spends hours on her stationary bike at home.\n\n\"The recent couple of 6-hour rides that I've had I've done on the trainer indoors because the weather has been shocking,\" she said.\n\n\"I've done it with no music, no TV or anything, it's just me staring at a wall.\"\n\nCrossing the line\n\nKolinac said she was not too worried about the course distances in Hawaii, but the weather and the possibility of a flat tyre ruining her chances were front of mind.\n\n\"I think it's going to be crazy hot. I'm so stressed about that,\" she said.\n\n\"[When] I did Western Sydney, the half Ironman, I got three flat tyres. I was literally on the side of the road crying.\"\n\nBella Kolinac competed in the Western Sydney Triathlon in September. (Supplied: Bella Kolinac)\n\nKolinac said she was up for the challenge and eager to connect with other competitors.\n\n\"The vibe from everybody watching, it's just so nice,\" she said\n\nMr Sullivan said he was emotional just thinking about her crossing the finish line.\n\n\"You see a lot of people break down on the line, they've given it their all,\" he said.\n\nBella Kolinac celebrates her achievements with Isaac Sullivan. (Supplied: Bella Kolinac)\n\nAfter Kona, Kolinac said she was planning to take a break before warming up for her next challenge.\n\n\"I want to get back to having fun with it, and then maybe next year I'll look at doing the T100 race, which is in the Gold Coast,\" she said.\n\nMr Sullivan said he was eager for Kolinac to have a rest first.\n\n\"It's super fatiguing ... not just physically, but mentally as well,\" he said.\n\n\"She's not a stopper type of person, so she will not stop, but she'll definitely take it back from a 20-hour week, probably down to about a four-hour week.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/glencore-copper-queensland-smelter-refinery-open/105462262",
        "title": "Mining giant gets $600m worth of taxpayer funds to keep refinery open",
        "publish_date": "Wed, 08 Oct 2025 00:52:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian taxpayers will fund a multi-million-dollar rescue package for mining giant Glencore to keep copper processing facilities operational in Queensland until the end of 2028.\n\nGlencore has accepted $600 million in financial bridging support for its Mount Isa Copper Smelter, and adjoining Townsville Refinery, from the state and federal governments.\n\nThe Swiss multinational warned the copper assets would transition into care and maintenance mode without government support to rebrick the smelter infrastructure, triggering nearly five-month-long negotiations.\n\n50 per cent cost share\n\nFederal Minister for Industry and Innovation Tim Ayres confirmed the package was a 50 per cent cost share between the Commonwealth and state governments.\n\n\"The package has a two-year component which is two lots of $200 million, and the third year will be delivered contingent on all of the parties to this arrangement complying with their obligations,\" Mr Ayres said.\n\nGlencore Metals Australia interim chief operating officer Troy Wilson said the agreement provided a short-term lifeline for the copper smelter and refinery.\n\n\"[It] comes after Glencore had already stepped up to absorb significant financial losses to maintain operations and jobs while working on a solution with government,\" Mr Wilson said.\n\n\"On behalf of Glencore and our workers, I would like to express thanks to the Australian and Queensland governments for backing the region and these strategic assets with a critical support package.\"\n\nRobbie Katter says the package \"is a start\". (Supplied: Katter's Australian Party)\n\nKatter says 'more needed'\n\nState Member for Traeger Robbie Katter said the funding was good news, but there was still work to be done.\n\n\"Let's be clear, we're only at half time. There's no champagne and celebrations at half time, just a rev up from the coach to go out and finish the job in the premiership half,\" Mr Katter said.\n\n\"The federal government in particular have recognised the strategic importance of keeping the smelter operating, and we need them to remain at the negotiating table to reform the smelter operations, not just continually save it and leaving it in the hands of the one owner.\"\n\nMolten copper being poured into an anode at the Mount Isa Mines Copper Smelter. (Supplied: Glencore)\n\nRegion relieved\n\nThe Mount Isa smelter processes Glencore and third-party copper-concentrate, which is transported by rail and exported through the Townsville port via the Townsville refinery.\n\nThe Townsville refinery processes up to 300,000 tonnes of pure copper cathode each year — a raw material used for copper wire and cabling.\n\nThe Mount Isa Copper Smelter requires rebricking every four years, with 60,000 refractory bricks replaced, which was due in 2026.\n\nThe last multi-million-dollar rebrick was completed in 2022, and in 2016, the then Labor state government invested $15 million, out of the $30 million required, to rebrick the infrastructure.\n\nGlencore said it directly employed about 600 workers across the Townsville refinery and Mount Isa smelter.\n\nBut peak-economy lobby group Townsville Enterprise (TEL), said the company was tied to thousands more jobs indirectly.\n\nThe outback mining town of Mount Isa is more than 1,800 kilometres north west of Brisbane. (ABC North West Qld: Meghan Dansie)\n\n\"There are about 17,000 jobs at risk if these operations were to cease,\" TEL Chair Kevin Gill said.\n\n\"The by-product from the smelter — sulphuric acid — is transported to the Phosphate Hill fertiliser plant, which is sent on the railway from Mount Isa to the Port of Townsville and shipped out of the port.\"\n\nHe said the Mount Isa smelter was the only facility in Australia that could process third-party copper-concentrate.\n\n\"There is a lot of copper that second and third-tier miners are keen to mine, and they do rely on this smelter as well as the refinery and port.\"\n\nCopper costs\n\nIn its bid for government support, Glencore said its smelter and refinery were strategically important assets for Australia, but were uneconomic for the company.\n\nIt said refining charges had dropped dramatically as China and Indonesia built their smelting capacity.\n\nGlencore said energy costs in Queensland's north-west were double or more than those in India, China, Canada and the United States.\n\nAbout 60,000 of the smelter's bricks were replaced over six weeks in 2022. (Supplied: Mount Isa Mines)\n\nThe Australian Strategic Policy Institute's (ASPI) Northern Australia lead Dr John Coyne said government support for Glencore should be a hand-up, rather than a handout.\n\n\"At the end of the day, the long-term predictions for copper are great, demand will increase,\" Dr Coyne said.\n\n\"Competition in the market is being distorted, with smelters in China being given cheap loans and access to inexpensive power.\n\n\"Finally, if we don't protect at least some of our industry, we will lack the ability to support ourselves, in terms of national resilience.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/minjee-lee-eyeing-spot-in-end-of-season-rankings/105865746",
        "title": "Minjee Lee chases more prizes in Asian golf swing",
        "publish_date": "Wed, 08 Oct 2025 00:48:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian golf superstar Minjee Lee returns to LPGA Tour action for the all-important Asian swing chasing a swag of prestigious awards including one rare golden double.\n\nAfter a runner-up showing at the Hana Financial Group Championship in Korea, Lee will tee it up at this week's Buick LPGA Shanghai with much at stake heading towards next month's rich season finale in Florida.\n\nHaving already wrapped up major player-of-the-year honours, Lee is sitting second behind Thailand's world number one Jeeno Thitikul in the overall player-of-the-year race with seven tournaments remaining.\n\nThe world number four has thrust herself into contention for the stellar double after capturing a third career major at the Women's PGA Championship in June while also finishing tied for third behind fellow Australian Grace Kim at the Evian Championship three weeks later in France.\n\nLee is bidding to become the first Australian since the great Karrie Webb in 1999 and 2000 to be crowned international women's golf's player of the year.\n\nThe 29-year-old also tops the LPGA Tour's official money list with $US3,629,430 ($5.51 million) in season earnings — some $US490,000 ($744,343) ahead of Thitikul — after boasting a super consistent six top-five finishes, seven top 10s and 14 top 20 results from 19 events in 2025.\n\nIn addition to more awards on offer, Lee is also well positioned in the mega-money, season-long Race to CME Globe standings.\n\nThe Perth ace is second behind Thitikul, with the top 60 qualifying for the season-ending Tour Championship in Naples from November 20-23.\n\nThe winner of the Tour Championship will pocket $US4 million ($6.08 million), the biggest prize in women's golf history.\n\nAfter nabbing her maiden major this year, Kim is running 29th on the points list, while fellow Australian Steph Kyriacou (44th) is also on track to qualify for the $US11 million ($16.71 million) season showpiece.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAfter a lean season, world number 17 Hannah Green is in 54th spot, with LPGA Tour rookie Cassie Porter (58th) and Gabriela Ruffels (65th) needing a strong next month to secure spots at the Tour Championship.\n\nKyriacou, Porter, Ruffels and Thitikul all join Lee in this week's field in Shanghai, where China's world number seven Ruoning Yin is the defending champion.\n\nLee, Thitikul and Yin will play the first two rounds together on Thursday and Friday.\n\nOther Australians featuring are Robyn Choi (67th in the points race), Karis Davidson (82nd), Hira Naveed (112th).\n\nWorld number two Nelly Korda and number three Lydia Ko are sitting out the event.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/record-for-bibbulmun-track-broken-twice-in-a-week/105862894",
        "title": "Bibbulmun Track record broken twice in one week",
        "publish_date": "Wed, 08 Oct 2025 00:45:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Bibbulmun Track is one of the world's longest walking trails, winding 1,000 kilometres through Western Australia, from Albany on the south coast to Kalamunda in the Perth Hills.\n\nAaron Young ran about 110 kilometres each day, averaging 3 hours' sleep, to break the record for completing the track in the fastest time, in 9 days, 3 hours and 22 minutes.\n\n\"You have high moments where you're feeling alright and you're running well,\" Mr Young said.\n\n\"Throughout the process there are low moments where you feel like taking the next step is pretty difficult, but you just … keep moving forward.\"\n\nAaron Young is one of two men who broke the record for running the Bibbulmun Track just days apart. (Supplied: Aaron Young)\n\nMajor achievement\n\nBut less than two days later, Mr Young's time was beaten by Mackenzie Burgoyne, who finished the track in 8 days, 20 hours and 44 minutes.\n\nMr Burgoyne is now awaiting his record time to be ratified.\n\nBoth were focused on beating the previous record of 10 days and 18 hours, set in 2021.\n\n\"Having Aaron start that couple of days before me was something that added a little bit of tension, I won't lie,\" Mr Burgoyne said.\n\n\"We were roughly hitting 110 [kilometres] a day, some were up a little bit, some were down a little bit, but the final push, knowing that Aaron had finished so quick, was 150km a day, over about 26 hours.\"\n\nDespite the competition, there was also a sense of shared achievement after months of preparation.\n\nThe Bibbulmun Track stretches 1,000 kilometres from Kalamunda in Perth's east to Albany in the Great Southern. (Datawrapper)\n\n\"We both got to achieve something that we've been working towards for a long time, and the entire WA running community came together for both of us to achieve these goals, which was an incredible experience to be a part of,\" Mr Burgoyne said.\n\n\"We didn't have a prior relationship, but got to know each other quite well throughout this journey over the last few months in preparation and I think now it's safe to say have tremendous respect for one another.\"\n\nThat was also seen on the track.\n\n\"I actually went to see Mac on the trail not long before he finished to wish him well for the last little bit,\" Mr Young said.\n\nMackenzie Burgoyne says the two men have developed mutual respect for each other after completing the feat. (Supplied: Mackenzie Burgoyne)\n\nNext challenge\n\nMr Young decided to take on the challenge to raise funds for mental health charity This is A Conversation Starter after experiencing his own challenges.\n\n\"In 2016, I tore my ACL [anterior cruciate ligament] in my left knee and over the next … 15 months, while I was waiting for surgery and then during the rehab, I found myself in a situation where my mental health was in the toilet,\" he said.\n\n\"It was when I actually reached out to someone and got a bit of help that I started to get myself back on the right track, and it led me back down the path of fitness.\"\n\nHe already has his eye on another major run.\n\n\"I've got a friend of mine who I'm planning to run the Heysen Trail with in South Australia,\" Mr Young said.\n\nAaron Young raised funds for a mental health charity. (Supplied: Aaron Young)\n\n\"That's a 1,200km trail that runs from … central SA, down past Adelaide and along the coast there.\"\n\nIn the meantime, Mr Young was back at TAFE a day after the feat, studying for his carpentry apprenticeship.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/kangaroo-island-brewer-boycotts-sealink-ferry-over-fare-prices/105861274",
        "title": "Brewer stages beer boycott over Kangaroo Island ferry's 'ridiculous' fares",
        "publish_date": "Wed, 08 Oct 2025 00:30:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "The owner of Kangaroo Island Brewery will no longer supply beer to Sealink ferries to protest the high cost of travelling to and from the popular tourism destination.\n\nMike Holden said he made the decision after continually hearing from tourists that they could not afford to revisit the island, located off the southern coast of South Australia.\n\n\"All those conversations — they say, 'Kangaroo Island's amazing but I'm not going to come back again' or 'I can't come back because it's simply too expensive,'\" he said.\n\n\"This is what we hear over and over and over again.\"\n\nMr Holden said he believed the cost of more than $800 for a return ferry journey for a family of five with a vehicle was too much for many people.\n\nHe said while he did not not have a problem with Sealink \"as a company\", he no longer wanted to be aligned with them.\n\nThe new ferries expected in 2026 will have 150 metres of additional vehicle space. (ABC South East SA: Caroline Horn)\n\nMr Holden said the whole system needed to be changed and that having a private company in charge of ferry services was \"not working\".\n\n\"We are spending so much on freight, so much on just moving around this 15-kilometre stretch of water, that it's becoming ridiculous and untenable,\" he said.\n\n\"It's hard for everyone to stick their head up and have a bit of a crack at Sealink because no one wants to bite the hand that feeds you.\"\n\nA Sealink spokesperson told the ABC they valued the Kangaroo Island business community and were \"naturally disappointed\" by Mr Holden's decision.\n\nBut the company said it would continue to work closely with many businesses on the island to promote the region and showcase its experiences and products.\n\nMayor calls for subsidies\n\nKangaroo Island Mayor Michael Pengilly said while he doubted the state government would ever take over the running of the ferry service, the council had long called for the implementation of subsidies similar to those available to people travelling to Tasmania.\n\nMichael Pengilly says the council had been lobbying for years funding subsidies for ferry fares. (ABC South East SA: Caroline Horn)\n\nUnder the federal government's Bass Strait Passenger Vehicle Equalisation Scheme, passengers can claim rebates of up to $550 per car and $1,104 for cars and caravans.\n\nAround $53.9 million was spent under the scheme in the 2024/25 financial year.\n\n\"Unfortunately for us, Tasmania's got a heap of federal seats and federal senators … we're part of a federal seat and a state seat and have only got a population of 4,500,\" Mr Pengilly said.\n\nTwo-year ferry delay\n\nSealink was awarded the contract to continue to provide ferry services to the island until at least 2039 in 2021.\n\nAt the time, it announced plans for two new ferries, with 150 metres more vehicle space each, to be operating by 2024.\n\nThat date was later revised to June 2025, with the ferries being built in an Indonesian shipyard.\n\nBut the ferries are yet to arrive.\n\nThe two new ferries are being constructed in Indonesia. (Supplied: Sealink)\n\nInfrastructure and Transport Minister Emily Bourke announced last week that work on the $73 million upgrades to the wharves at Cape Jervis and Penneshaw were complete.\n\nThe work was undertaken to accommodate the larger ferries.\n\nShe said the delay to the delivery of the new ferries was \"disappointing\" but that Sealink had guaranteed they would be operating by June 1, 2026.\n\nCheaper fares for locals will also be in place from November, along with additional daily crossings until the new ferries and their schedules are in place.\n\nSealink said it expected the first of its new ferries to be delivered to Port Adelaide by the end of year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/rental-prices-surge-almost-44-per-cent-review-finds/105865000",
        "title": "Increasing rent driving people away from employment",
        "publish_date": "Tue, 07 Oct 2025 23:25:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian renters are paying on average an extra $204 per week to keep a roof over their heads compared to five years ago, representing an increase of nearly 44 per cent.\n\nPacked inspections, skyrocketing rents and a fear of price hikes are leaving renters intimidated as vacancy rates plummet to record lows, a report shows.\n\nThe median cost to put a roof over your head in a capital city has surged 44 per cent in five years to top $700 per week for the first time, Cotality (formerly CoreLogic) says in its Quarterly Rental Review.\n\nOnly 1.47 per cent – or roughly one in every 68 properties – are available to lease, which is less than half the pre-COVID average.\n\nLimited listings and packed inspections are pressuring renters to apply for unsuitable properties or to outbid to get their foot in the door, according to Leo Patterson Ross of the Tenants' Union of NSW.\n\nLeo Patterson Ross says rental prices are driving people away from their jobs and communities. (ABC News: Greg Bigelow)\n\n\"With these large groups trying to inspect the same place, it's very intimidating,\" he said.\n\n\" So people are being kind of pushed out further and further away from employment, from their communities, and all of that is very disruptive. \"\n\nRenters fear repair requests\n\nMr Patterson Ross said many renters were not reporting repair needs due to fears landlords would bump rents further.\n\nAustralia's $127,000 housing affordability question Photo shows Man looking at for sale sign for apartment. The national project to fix housing affordability is off to a slow start but the reasons are complex.\n\n\"You're trying to avoid a rent increase or having to move house in a really competitive market, so it all puts pressure on throughout the tenancy experience,\" he said.\n\nReforms to ban no-cause evictions and limit the frequency of rental hikes have been broadly implemented across Australian jurisdictions, but only the ACT has developed an \"excessive rent increase\" guideline linked to the consumer price index (CPI).\n\n\"In other essential areas, like water or energy, we put in pricing structures to make sure that the community is getting a fair deal,\" Mr Patterson Ross said.\n\n\"We haven't done that in renting.\"\n\nRoughly one in three Australian households rent their home, according to census figures.\n\nSydney remains the most unaffordable city to live in, with a median price of $807 a week, followed by Perth ($729) and Brisbane ($696).\n\nHobart was the least expensive at $584 per week, the Cotality report found.\n\nDarwin rental prices in Darwin rose by almost eight per cent, or an extra $49 to $687 per week at the median, which was the nation's largest increase.\n\nMelbourne recorded the slightest increase at 1.4 per cent to a median price of $615.\n\nRegional rents were comparatively more affordable at $591 per week but were up by 5.9 per cent in the year to September compared with 3.7 per cent in the capitals and 4.3 per cent nationally, Cotality economist Kaytlin Ezzy said.\n\nKaytlin Ezzy says rising rents could impact interest rates. (Supplied: Cotality)\n\n\"Limited supply continues to be a major catalyst in rising rents, with the number of rental listings tracking approximately 25 per cent below the previous five-year average nationally for this time of year,\" she said.\n\nMs Ezzy said price growth was easing for certain goods but surging rents could complicate the outlook for further interest rate cuts.\n\n\"With 'rents paid' a key component of the CPI, the increased pace of rental value growth seen in recent months could push inflation higher,\" she said.\n\n\" This renewed momentum in rents may lead to inflation exceeding RBA forecasts, which could keep the cash rate elevated for longer. \"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/federal-government-pulls-support-art-gallery-alice-springs/105864926",
        "title": "Federal support for national Aboriginal art gallery in Alice Springs in doubt",
        "publish_date": "Tue, 07 Oct 2025 23:01:24 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The Northern Territory treasurer says the federal government will not support the proposed multi-million-dollar Aboriginal and Torres Strait Islander Art Gallery of Australia (ATSIAGA) in Alice Springs in its current design and location.\n\nTreasurer and infrastructure minister Bill Yan told ABC Alice Springs that without the federal government's financial support the project would be untenable.\n\nThe federal government had promised $80 million towards the ATSIAGA, with the NT government contributing $69 million.\n\nBill Yan has given the federal government a deadline of close of business on Wednesday to decide whether it will maintain its funding commitment. (ABC News: Michael Franchi)\n\n\"If the Commonwealth don't put up their $80 million and are not going to support it, then effectively, it's dead in the water,' Mr Yan said.\n\n\"I can't go to the territory taxpayer and say I'm going to have to borrow … to deliver on this project.\"\n\n\" This was always a partnership between us and the Commonwealth. \"\n\nMr Yan said he wrote to the federal minister for regional development, Catherine King, Tuesday night asking for a decision by close of business today about whether the funding commitment would be honoured.\n\nThe ABC has contacted the federal government for comment.\n\nWhat happened with the gallery plans?\n\nThe project was first announced in 2017 by the former NT Labor government and was set to be built on Anzac Oval.\n\nIt was the subject of intense debate over its location, on what traditional owners said was a sacred site.\n\nThe Labor government was also criticised for ignoring advice from a committee it set up in 2017 that concluded the gallery should be built out of the town centre, at the Desert Park.\n\nDespite this, the design for the gallery at Anzac Oval was released in 2023, with its open layout and four-level atrium structure touted as its key features.\n\nLoading...\n\nHowever, in November last year the new CLP government revealed plans to almost halve the size of the art gallery and said it would be moved to the Wills Terrace car park.\n\nThe CLP released the new design for the gallery in late July, drawing criticism from residents and federal member for Lingiari Marion Scrymgour as being poorly located and too small to host a gallery of national significance.\n\nOn Wednesday, Mr Yan said Ms Scrymgour had been advocating for the project to be moved to a location \"south of The Gap\" in Alice Springs.\n\n\"The benefit then to the CBD and the investment in the CBD effectively disappears … and honestly I can't see the benefit in that.\"\n\nThe new designs of the Aboriginal and Torres Strait Islander Art Gallery of Australia released in July 2025. (Supplied.)\n\nAlice Springs tourism 'gutted'\n\nTourism Central Australia CEO Danial Rochford said he was \"gutted\" to hear the gallery may not go ahead.\n\nMr Rochford said the loss of the proposed gallery would be devastating for local business and tourism.\n\nDanial Rochford says the potential loss of the proposed gallery will have a huge negative impact on Alice Springs tourism. (ABC News: Xavier Martin )\n\n\"This is a project that the tourism industry has seen as a beacon of light, a beacon of opportunity, something that many people have been making decisions in preparation for,\" he said.\n\n\"To hear the news today, words just cannot describe the emotions that we're feeling.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/outback-life-kids-cystic-fibrosis/105843356",
        "title": "Why outback life is the best thing for these kids with cystic fibrosis",
        "publish_date": "Tue, 07 Oct 2025 23:00:10 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Connie Lacey, 4, and Sienna Machin, 10, are like sisters, but they are not allowed to be near each other for long.\n\n\"We're supposed to stay away from each other but we're friends, so it's hard,\" Sienna said.\n\n\"If we're really close to each other, we might get sick.\"\n\nConnie and Sienna have a special bond. (ABC Western Qld: Grace Nakamura)\n\nBoth girls have cystic fibrosis (CF) and live in the outback community of Longreach, population 3,647.\n\nTheir families have known each other for years so it was bittersweet when Connie was diagnosed with CF, a few years after Sienna.\n\n\"We were the only people that the [Laceys] knew that were on the same journey,\" Sienna's mother, Brooke Machin said.\n\n\"We are grateful to have someone else to understand that is close by — it can feel very lonely otherwise.\"\n\nBrooke Machin travels with Sienna to Brisbane for her treatments. (ABC Western Qld: Grace Nakamura)\n\nMore people with CF staying rural\n\nDespite being 1,200 kilometres from the Queensland Children's Hospital, both families say they would not dream of relocating to Brisbane.\n\n\"Living out here, people think it impacts our access to health care but that's definitely not been the case,\" Ms Machin said.\n\nLongreach is 1,177 kilometres away from Brisbane. (Datawrapper: Grace Nakamura)\n\nCystic fibrosis is a chronic genetic condition that primarily affects the lungs, pancreas, and digestive system.\n\nIt is a complex and incurable life-limiting disease.\n\nHowever, Cystic Fibrosis Queensland CEO Petrina Fraccaro said advancements in treatments had allowed more people with CF to live in rural and regional areas.\n\n\"People used to have to attend clinic appointments four to five times a year, and any hospitalisation could be from one to four weeks in duration,\" Ms Fraccaro said.\n\n\"Now, people only have to come to clinic once, maybe twice, a year.\n\n\" That's reduced a lot of the burden of the disease … which is wonderful news for allowing families to remain in their local communities. \"\n\nOutback air and care\n\nThe fresh country air has almost been a treatment itself for the girls.\n\n\"City smog\" can be problematic for people with CF, who are more susceptible to lung infections.\n\nStarlight's Lookout, a popular view of the outback horizon outside Longreach. (ABC Western Qld: Hannah Walsh)\n\n\"The air is dry, there's no humidity, it's a really safe place for Connie to be,\" Ms Lacey said.\n\nShe said the care they received from medical services in Longreach had been \"second to none\".\n\n\"We have … regular telehealth [appointments], plus the Queensland Children's Hospital and Cystic Fibrosis Queensland ensure we still receive the same gold standard of care as if we were living closer to the city,\" Ms Lacey said.\n\nConnie with her nebuliser that helps her to breathe. (ABC Western Qld: Grace Nakamura)\n\nMs Machin agrees.\n\n\"If we need to go to Brisbane, we jump on a plane and they prioritise us because they know we only have one plane a day,\" she said.\n\nTravel to Brisbane 'a huge impost'\n\nDespite the benefits, living so far from the capital city has some drawbacks.\n\nTravel from Longreach to Brisbane is expensive and time-consuming.\n\nMs Machin said they received an allowance from the Patient Travel Subsidy Scheme (PTSS), but the amount has not changed in years.\n\n\"Having to go away already has an emotional impact, so that's just an added stress if you have to book accommodation and the price has hiked up,\" she said.\n\nSienna Machin travels from Longreach to Brisbane several times a year for her cystic fibrosis. (Supplied: Brooke Machin)\n\nThe current PTSS provides $70 a day for accommodation and 34 cents per kilometre travelled, a figure that has not changed since 2013.\n\nIn September, Health Minister Tim Nicholls pledged to review the scheme's allowance in next year's state budget.\n\nMs Fraccaro said the minister's promise was \"beyond too little, too late\".\n\n\"I was very disheartened that he felt this wasn't an urgent matter,\" she said.\n\n\"The provisions covered by that particular subsidy don't even touch the sides of the full cost of a trip to Brisbane for clinic duration.\"\n\nImprovements over time\n\nFor the past 35 years, the Longreach community has turned up for an annual mini marathon to raise funds for cystic fibrosis research.\n\nHorse-riders setting off for the annual Meagan Walker Mini Marathon in Longreach for cystic fibrosis. (Supplied: Meagan Walker Mini Marathon)\n\nThe event is named for another local woman, Meagan Walker, who had cystic fibrosis and died at the age of 23.\n\nHer aunt and uncle, Rosemary and Warwick Champion, have been organising the event ever since.\n\n\"These little people, Connie and Sienna, have a lot better quality of health than Meagan could ever have dreamt of,\" Ms Champion said.\n\nShe said it gave her hope for continuing improvements in the treatment and quality of life for people with CF.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/rio-tinto-bhp-continue-to-invest-in-pilbara-iron-ore-mining/105862166",
        "title": "Iron ore mining shows no signs of slowing despite price drop concerns",
        "publish_date": "Tue, 07 Oct 2025 22:58:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mining giants Rio Tinto and BHP are continuing to expand their iron ore foot print in the Pilbara, despite projections indicating long-term demand for the mineral is waning.\n\nOn Tuesday, Rio confirmed a $1.1 billion investment for mining new deposits at its West Angelas operations, extending the mine's life \"for years to come\".\n\nIn June it opened a new $2.4 billion iron ore mine near Paraburdoo, and confirmed its investment in mining another major ore deposit with Gina Rinehart's Hancock Prospecting.\n\nRio Tinto has invested billions of dollars in developing new mining areas in the Pilbara this year. (ABC News: Rachel Pupazzoni)\n\nA day after Rio's West Angelas announcement, WA's environmental watchdog recommended approving a major expansion to BHP's Jimblebar mine.\n\nThe investment wave comes at an uncertain time for Australia's iron ore industry, with some industry analysts suggesting the region's title as the world's biggest iron ore supplier could be under threat in the longer term.\n\nThose predictions are being driven by a slowdown in China's building industry, and the emergence of new mines in Brazil and Africa, containing higher-grade iron ore deposits than the Pilbara.\n\nBut mining investments consultant Phillip Kirchlechner said the situation was more complicated.\n\n\"There's certainly an argument for increasing production [in the Pilbara] as well,\" he said.\n\n\"China has new pillar industries, wind turbines and electric vehicles for example.\n\n\" China wants to essentially destroy the German car industry … and so this will constitute, possibly, additional demand for steel in the future that would come out of China. \"\n\nDigging deeper\n\nMr Kirchlechner, who had worked for both Rio Tinto and Fortescue Metals Group, said there was another reason the major miners were looking for new ore deposits.\n\nAfter 60 years of mining, the Pilbara's highest-grade deposits are gone.\n\nPhillip Kirchlechner says companies are digging deeper to access the Pilbara's highest-grade iron ore deposits. (ABC News: Mietta Adams)\n\n\"The low-hanging fruit is already taken, so increasingly you have to mine deeper,\" Mr Kirchlechner said.\n\n\"So there is a scenario of increasing risk as well by having to process the impurities in the iron ore, which are increasing.\"\n\nMine rehabilitation scrutiny grows\n\nAs the footprint of the Pilbara iron ore industry grows, so too does the environmental scrutiny of their operations.\n\nThe WA Environmental Protection Agency's (EPA) approval of the Jimblebar expansion included a comment raising concerns about mining rehabilitation.\n\nWhen new mines are approved in WA, the companies must commit to returning the impacted areas into a state as close to their original condition as possible.\n\nBut the EPA report said there was \"limited evidence\" that proponents had successfully rehabilitated areas that had been subject to large-scale mining.\n\nTodd Erickson says new methods were needed to improve mining rehabilitation. (Supplied: Todd Erickson)\n\nThe EPA said it would renew its focus on rehabilitation when assessing future mining proposals.\n\nUniversity of Western Australia senior research fellow Todd Erickson said the commentary was surprising.\n\nThe plant ecologist has helped lead multiple rehabilitation projects with both BHP and Rio Tinto, with some small-scale success.\n\nHe acknowledged the low rates of rehabilitation were \"pretty hard to swallow\".\n\n\"Any mine rehabilitation in a dry hot desert is quite complex, just because of the given environment,\" Dr Erickson said.\n\nRehabilitation includes re-planting natives like the Mulla Mulla in areas cleared for mining operations. (ABC News: Mietta Adams)\n\n\"If mining companies continue to use old practices, they'll most likely get less of a result back.\"\n\nIn a statement, a BHP spokesperson noted the EPA's warning.\n\n\"Last financial year, our WAIO [Western Australian Iron Ore] progressive rehabilitation programme completed more than 1,000 hectares of land rehabilitation, with the majority delivered by Traditional Owner rehabilitation contractors,\" it said.\n\nTo date, 14 per cent of the 149,700 hectares of land disturbed by BHP's mining operations has been rehabilitated.\n\nRio Tinto chose not to comment on the EPA's statement.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/womens-champions-league-arsenal-lose-to-lyon/105865154",
        "title": "Mistakes costly for Arsenal as trio of Matildas feature in Champions League",
        "publish_date": "Tue, 07 Oct 2025 22:51:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Two individual errors have led to Arsenal's Women's Champions League title defence getting off to a losing start in a 2-1 defeat at home to eight-time winners Lyon.\n\nArsenal's Australian trio of Steph Catley, Caitlin Foord and Kyra Cooney-Cross all featured for the hosts, with Catley playing a full game at Meadow Park and fellow Matildas Foord and Cooney-Cross entering as second-half substitutes.\n\nGunners goalkeeper Daphne van Domselaar rushed her attempted pass out from the back and picked out Melchie Dumornay just outside her penalty area and the Champions League young player of the year for the last two seasons rolled the ball home at the second attempt.\n\nVan Domselaar also had a hand in the visitors' second in the 23rd minute, although Mariona Caldentey had to shoulder most of the blame.\n\nThe goalkeeper rolled the ball out to the Spain midfielder who turned straight into trouble and lost possession, and when Katie Reid's weak header dropped to Dumornay on the edge of the area she fired home.\n\nThat undid the ideal start given to them by Alessia Russo in only the seventh minute of this repeat of last season's semifinal.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nCaldentey tried to redeem herself with a 25th-minute volley when the ball dropped to her 20 yards out but her effort was well saved low down by Christiane Endler.\n\nLyon had the best chance of the second half when Marie-Antoinette Katoto stabbed wide from close range at the near post as Arsenal, who lost their opening game a year ago to Bayern Munich before going on to win the title, struggled to test Endler.\n\nElsewhere on Tuesday night, Bayern were thrashed 7-1 by three-time champions Barcelona with Ewa Pajor and Claudia Pina scoring doubles.\n\nCecilia Salvai also bagged a brace for Juventus including an 86th-minute winner at home against Benfica, while European debutants Oud-Heverlee Leuven fought back from two goals down to draw 2-2 at Paris FC.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/PA",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/how-to-read-more-books-when-reading-rates-are-declining/105857550",
        "title": "I've read 63 books so far this year. Here's how I did it",
        "publish_date": "Tue, 07 Oct 2025 22:44:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "There's a Japanese word that describes your pile of unread books: tsundoku. It dates back to the 1800s but feels especially relevant today — after all, we're reading less than we used to.\n\nEvery demographic has experienced a decline in reading since 2012, according to data from the Household, Income and Labour Dynamics in Australia (HILDA) survey.\n\nAnother Deakin University study reveals 29 per cent of Australian teens don't read for fun.\n\nABC Radio National's Top 100 Books of the 21st Century Top 100 Books is Radio National's new annual countdown where we hand over the reins to you to vote for your favourite books. Celebrate the Top 100 with us in a big weekend broadcast on October 18 and 19!\n\nIt's not just an Australian phenomenon: recreational reading is at a 20-year low for Americans, while 40 per cent of Britons haven't finished a book in the past year.\n\nLosing your reading mojo\n\nI knew the slump was bad when an author — during their memoir-promoting tour, no less — admitted their reading had tailed off significantly.\n\n\"This is not good material for somebody trying to sell a book,\" they told me.\n\nI can relate: I've gone through reading droughts throughout my life. I was a voracious bookworm when I was younger but as I aged, I found myself reading less and less.\n\nThe pressure to conquer classics and zip through Zeitgeist-capturing books was still there — without the kid-like luxury of losing myself in chapters for endless hours.\n\nKnowing I wouldn't finish every literary masterpiece written only amplified the anxiety.\n\nI once was so overwhelmed by reading choices, I limited myself to what was released in the past 12 months. Even then, I only finished four books a year.\n\nFreelance journalist Lee Tran Lam listens to audiobooks at 2x speed. (Supplied: Will Reichelt)\n\nOnly during Christmas holidays (when the to-do list was clear) did I speed through reading streaks. It turns out you can finish a book in a day if you literally have nothing else to do.\n\nThese commitment-free conditions are hard to replicate throughout the rest of the year, though. Who has endless days for turning pages when work deadlines surface and bills need paying?\n\nBefore I knew it, I was in another reading slump.\n\nHow to make reading a habit\n\nI broke one such reading drought with Charles Yu's Interior Chinatown in 2020. I breezed through the entire audiobook in one apartment-cleaning afternoon: a 4-hour blitz that recharged my love of novels instantly.\n\nInterior Chinatown is an inspired exploration of Hollywood Asian stereotypes like Kung Fu Guy, Background Oriental Male and Generic Asian Man. It became one of my favourite books of the year (not that there was much competition).\n\nIt was galvanising, too: I could conquer a book in a day and didn't even have to wait until Christmas. I added more audiobooks to my diet.\n\nHow to read more Pick up a book before you pick up your phone in the morning — even if it's for five minutes\n\nLean into shorter formats like graphic novels and poetry collections\n\nTrack the books you read using an app or a spreadsheet\n\nListen to audiobooks at 1.5x or 2x speed\n\nJoin the library to access free audiobooks and eBooks, as well as old-fashioned paper books\n\nOver time, I've steadily increased my reading volume (even lifting my released-this-year-only restriction) and worked my way through more titles as a result.\n\nI started listing everything I finished in a spreadsheet, a handy reference when friends asked for recommendations. Adding another publication to the \"finished\" column was a satisfying achievement.\n\nOther people prefer book-tracking apps (like StoryGraph or Bookshelf) or triumphantly post completed stacks on Instagram or TikTok.\n\nWith social media's algorithmic pull becoming ever stronger, I try to counteract the empty-calorie sensation of \"feeling too online\" by turning to books instead.\n\nI start each morning with 5 minutes of something, maybe an eBook on my phone or audiobook on my iPad, and flick through pages of a physical volume later in the day.\n\nAnd this year, without trying, I've finished more books than ever in a single year: 63 so far in 2025.\n\nUse your library card\n\nYes, I've turned to short volumes of poetry (Mosab Abu Toha's unshakeable Forest Of Noise) and graphic novels (Venice, Jiro Taniguchi's nostalgic 128-page travel novella).\n\nBut what's truly turbocharged my reading is my library card and its 24/7 access to free apps like Libby and BorrowBox.\n\nMy reading appetite had previously been held back by my book-buying budget (which is much smaller than I'd like), but thanks to the library, I'm now more voracious and adventurous with what I seek out.\n\nMy audiobook-consuming tempo is now a step faster (1.5-2.0 speed at most, fast but not chipmunk-level of unintelligible squeaking).\n\nAnd instead of tuning into another aimless celebrity podcast, I opt for tightly written memoirs (like the Grammy-winning audiobook version of Viola Davis's autobiography Finding Me, elevating her to EGOT status for good reason).\n\nSeptember's best books Photo shows A composite image of eight book covers pictured on a green background Wondering what to read next? This month's best books include the latest from literary giant Ian McEwan and Buckeye, a multigenerational family saga set in America's Midwest.\n\nI love that reading is a passport to experiencing countless new perspectives, from Katie Goh's memoir told through the history of oranges (Foreign Fruit) to Patrick Bringley's life as a New York museum guard (All the Beauty in the World).\n\nThe time pressure of needing to return library books also fast-tracks my reading: I bought Hua Hsu's Stay True in paperback three years ago, but only finished it after checking out the audiobook on BorrowBox in August.\n\nMy reading can sometimes lag (it's taken me four months to read 92 pages of Samantha Harvey's Orbital), but rewiring my doomscrolling reflex has made a difference.\n\nYes, I'm as susceptible to cat memes and viral clips as anyone else, but turning reading into a progressively habitual pastime has led to more completed books.\n\nAnd the pay-off? It only takes one page to be transported elsewhere.\n\nTune into ABC Radio National on October 18 and 19 to listen to the Top 100 Books countdown.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/kotoni-staggs-tribute-after-death-of-david-orange/105864876",
        "title": "Neighbour pays tribute to Broncos star Staggs after family heartbreak",
        "publish_date": "Tue, 07 Oct 2025 22:19:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Kotoni Staggs says an NRL premiership ring is proof that good things come to kind people, and the Brisbane centre has been showing plenty of kindness to a heartbroken family in his neighbourhood.\n\nOnly days before Staggs and his fiancee Britt moved into their new home in 2023, tragedy had struck the family next door as father David Orange died suddenly and unexpectedly.\n\nThe fit-and-healthy local business owner was only 38, and left behind wife Kerry and seven-month old daughter, Eylea.\n\nIn the family's darkest hour, their new next door neighbour became a shining light.\n\nStaggs often buys the family groceries, drives them places and babysits young Eylea among other acts of kindness, never asking anything in return.\n\n\"When somebody needs help and I'm around, and obviously I bump into people like that, I'll do it straight away,\" Staggs said after the Broncos' 26-22 grand final win over Melbourne.\n\nStaggs with partner Brittany Becht at the 2025 Dally M awards. (Getty Images: Mark Metcalfe)\n\n\"I'll go through struggles sometimes but someone else is always going through a bigger struggle than what I am. If I can be there for them and put a smile on their face, that's what I'll do.\n\n\"I'll take my shirt off and give it to them. If I had my last hundred dollars, I'd do the same thing. I'm a giver.\"\n\nKerry Orange didn't know of Staggs' football career, nor had she even watched an NRL game before meeting him.\n\nThrough his generosity, she has come to think of Staggs as a member of the family.\n\n\"In the early, fragile days of grief, when even getting through the day felt impossible, Kotoni quietly became a steady and loving presence,\" Orange said.\n\n\"Without being asked, he stepped into our lives like an uncle to Eylea, offering support in the gentlest, most selfless ways.\n\n\"He gave both of us something I thought we had lost forever: a sense of peace, moments of comfort and even glimpses of joy in the midst of heartbreak.\n\n\"I will be forever grateful for the love and support he's given us.\"\n\nThe 26-year-old Staggs credits his late grandmother, Dawn, for instilling his desire to give back to others.\n\nStaggs did not meet his father until his early 20s and was estranged from his mother for parts of his childhood, so Dawn was his guardian growing up in the NSW town of Wellington.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHe still wears her name on strapping tape on his wrist during games and has a photo of the two of them on his bedside table.\n\n\"Without my grandmother, I don't think I'd be walking around here right now. I'd probably be on the streets with no money (or) I'd be locked up,\" Staggs said.\n\n\"She was my everything and she made sure we had food, we had everything on the table. She did what she did and I turned out to be an all right kid.\"\n\nAs Staggs does his best to carry on Dawn's legacy through acts of kindness, good things have begun to happen.\n\nHe played centre in the Broncos' first grand final win since 2006 on Sunday night and has since earned selection in Kevin Walters' Kangaroos squad for the Ashes tour.\n\n\"I love giving back to people and I love helping out people,\" he said.\n\n\"At the end of the day, when you do good things, good things come in return. This (grand final win) is what happens.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/taylor-swift-wears-paolo-sebastian-dress/105864738",
        "title": "Taylor Swift shines in Australian-designed dress in lead single",
        "publish_date": "Tue, 07 Oct 2025 22:16:41 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Pop superstar Taylor Swift has worn Adelaide-based label, Paolo Sebastian, in her latest music video, The Fate of Ophelia.\n\nFounder and designer Paul Vasileff told ABC News Breakfast the label had been approached by Swift's team \"a while ago\".\n\n\"I'm just so grateful and so excited to think that something that was made in Adelaide and something that we handcrafted is then seen on a world stage,\" he said.\n\nThe Paolo Sebastian dress from A Lover's Kiss Collection was worn by Taylor Swift in her music video for The Fate of Ophelia. (instagram@paul_vasileff / Paolo Sebastian)\n\nThe dress was one of many outfits featured in the newly released music video for The Fate of Ophelia, which is the lead single of Swift's twelfth studio album, The Life of a Showgirl.\n\nMr Vasileff said he found out about Swift wearing the dress from Paolo Sebastian's 'A Lovers Kiss Collection' when the rest of the world did.\n\n\"I was getting onto a plane to come here to Dubai as we found out, and I think I saw the images in the video for like an hour or so and then jumped on the plane and was completely disconnected from everything,\" he said.\n\n\"I was kind of sitting there for 12 hours going, 'I want to see more. I want to know what's going on'.\"\n\nTaylor Swift wore Adelaide label Paolo Sebastian in her new music video. (Instagram: @taylorswift)\n\nMr Vasileff is no stranger to dressing celebrities, with people like Kim Kardashian, Katy Perry and recently Rachel Zegler and Anya Taylor-Joy having donned the label.\n\nJust last year, actress Jessica Alba wore one of Mr Vasileff's dresses to the White House — a black French chantilly lace creation draped onto a corset bodice, spraying out into a skirt.\n\nSpeaking from Dubai, Mr Vasileff said he was proud to be able to keep the work in SA, and show it off to the world.\n\n\"Couture and hand making garments, it's a dying art form, so I'm really proud that it's something that we've been able to keep in South Australia,\" he said.\n\n\"Growing up, I was told to be successful, you're going to have to move overseas or you're not going to be able to do it out of Adelaide.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/surging-wool-price-restores-grower-confidence-in-aussie-merino/105845730",
        "title": "Confidence returns to fickle Australian wool industry as prices surge",
        "publish_date": "Tue, 07 Oct 2025 22:12:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "After being hit by drought and rising feed and production costs in recent years, some wool growers have been leaving the industry, concerned about their viability.\n\nFor those who stuck it out, like Condobolin grower Gabby Neale, the recent sustained run of rising wool prices amid strong demand has given them a reason for optimism.\n\n\"There's just so much potential that I think it's worth sticking around,\" Ms Neale said.\n\nGabby Neale says the recent Nanjing Wool Market Conference in China was an eyeopener. (Supplied: Nanjing Wool Conference)\n\nMs Neale grew up on a wool farm in Condobolin and is now the founder and creative director of Merino clothing label Intact.\n\nShe said she had always seen great potential for wool beyond traditional knitwear and wanted to ensure consumers continued to find benefit in the homegrown fibre.\n\n\"Future success, in any business, comes from innovation through efficiencies and design,\" Ms Neale said.\n\nRepresentatives of the Australian wool industry at the AWI Future Wool Industry Leaders tour in China. (Supplied: Kristen Frost)\n\nRecently arriving back from an Australian Wool Innovation (AWI) Future Wool Industry Leaders tour to China, Ms Neale has renewed optimism for the wool sector.\n\nShe said being able to see firsthand the value overseas customers put on Australia's wool product was reassuring.\n\n\"The biggest takeaway for me was the level of scale and investment the Chinese have put into the industry and how much value they place on Australian wool,\" she said.\n\n\"We all walked away from the trip with the same sentiment that it's not something that's going to go away.\"\n\nLongest winning run since 80s\n\nChina is the largest consumer of Australian wool, buying about 85 per cent of production.\n\nThe continued demand for Australian wool at a time when production has been forecast to drop to its lowest level in 100 years has resulted in sustained price increases on the auction floor.\n\nThe Australian wool industry's Eastern Market Indicator (EMI) has climbed for 11 consecutive weeks, which is the longest run of price rises since 1987.\n\nWool industry slump Photo shows A woman in a hat and white shirt stands in a sheep yard. Wool production is forecast to drop to its lowest level in 100 years, but young farmers remain optimistic about the future.\n\nIn the NSW New England region, Walcha growers Hugh and Felicity Nivison achieved the top auction price so far this season — an outstanding $190 per kilo.\n\nMr Nivison said his family's farm had seen many ups and downs across its 90-year history.\n\n\"I know a lot of people have decided there's not enough money in merinos and they're getting out and it's nice to see a bit of confirmation that maybe staying in them isn't a bad idea,\" he said.\n\nMr Nivison is encouraging more growers to consider staying in the industry, with more diversification.\n\n\"You don't really want to follow all the lemmings off the cliff,\" he said.\n\n\"I think there's a solid outlook there for the moment and I think if we keep on producing good wool and be efficient at it and be productive, then I think there's a good reason for staying in them as part of your business.\"\n\nHarold Manttan with the Nivison family's wool clip that has fetched the highest price for the season so far. (Supplied: Harold Manttan)\n\n'Swings and roundabouts' normal in industry\n\nDistrict wool manager for Elders Dubbo, Lindsay Brown, is another young industry member buoyed by the latest developments.\n\n\"From where it's been for the last 12 to 24 months, it's been a real sugar hit for us,\" Mr Brown said.\n\n\" For those people who are still in the game, who have stuck around, I think they'll get rewarded in due course. it just fills you with a bit of confidence with where the market's at. \"\n\nLindsay Brown says the wool industry has always seen highs and lows. (Supplied: Kristen Frost)\n\nHe said wool markets had always ebbed and flowed.\n\n\"I guess with anything, it always swings and roundabouts with any commodity in any industry,\" Mr Brown said.\n\nAnalyst urges caution as costs remain high\n\nAmid the optimism, wool analyst Matt Dalgleish warned it was too early to say the sector had turned a corner.\n\nHe said costs remained high and production was continuing to fall significantly.\n\n\"That to me is a signal of industry in distress and contracting rather than a huge growth in demand for wool somehow globally that's underpinning these stronger prices,\" Mr Dalgleish said.\n\nHowever, Australian Wool Network's northern NSW and Queensland regional manager, Harold Manttan, said he was confident the uptick in auction room prices would continue.\n\n\"Listening to the trade, I'd say it's got some forward motion yet,\" he said.\n\n\" In my 40 years in the game, I haven't seen anything like this really. \"\n\nThere has been an expected correction to the market this week, with falls seen in southern wool markets at the time of publication.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/afl-trade-period-day-3-live-updates-merrett-curnow-petracca/105862940",
        "title": "Live: Suns close in on Petracca deal after nabbing prized draft pick",
        "publish_date": "Tue, 07 Oct 2025 21:50:51 +0000",
        "category": "sports",
        "authors": [
            "Dean Bilton"
        ],
        "text": "I'd be VERY surprised if Ryley Sanders leaves the Bulldogs for the Crows. He's very at home with us, and we utilise him a lot. But would be keen to hear your thoughts... - Doggies fan\n\nRyley Sanders' position at the Bulldogs has always been interesting to me.\n\n(Getty Images)\n\nThe Dogs were so keen on him in his draft year, but I don't think he's fully won them over with his performances since then. Not enough that they will actively be wishing him out the door, but enough that they wouldn't hang up on Adelaide immediately.\n\nThe Dogs would have a couple of thoughts about all this. One is the need for a key defender, which could see Jordan Butts (and picks, of course) be of interest from the Crows. The other is next year's Zak Butters chase, which could see them move for some future picks if Sanders was to leave.\n\nFor what it's worth, I really like Sanders and think there's a lot more to come from him. I wouldn't be entertaining trading him if I were at the Dogs, at least not until Tassie come knocking in a couple of years. His value would likely be much higher by then.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-08/players-concerned-over-shanghai-heat-as-novak-djokovic-col/105864786",
        "title": "'Do you want a player to die?' Heat dominates tennis events in China",
        "publish_date": "Tue, 07 Oct 2025 21:45:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "Holger Rune has renewed calls for a universal heat rule and Novak Djokovic required treatment as players fought through brutal conditions at the Shanghai Masters on Tuesday.\n\nRune, the world number 11, was heard to ask \"do you want a player to die on court?\" during his victory over Ugo Humbert on Sunday, 6-4, 6-7 (7), 6-3 victory over Giovanni Mpetshi Perricard.\n\n\"We can handle a certain amount of heat, because we're strong, and mentally strong as well, but there is always a limit,\" he told reporters after the match.\n\n\" It's also important to take care of your health. We need to survive. \"\n\nDjokovic, 38, had to take a medical timeout after picking up a leg injury during the first set of an encounter against Jaume Munar that stretched to two hours and 41 minutes.\n\nDjokovic won 6-3 5-7 6-2, but struggled with the heat.\n\nMedics checked his vital statistics at one point as the temperature stayed near 30 degrees Celsius and humidity hovered at about 80 per cent.\n\nNovak Djokovic needed treatment for a leg injury, and heat stress, in Shanghai. (Getty Images: Lintao Zhang)\n\nThe Serbian vomited during his match against Yannick Hanfmann on Sunday and world number two Jannik Sinner retired due to cramps.\n\n\"It's the same for every player out on the court, but it's brutal,\" Djokovic said after beating Hanfmann 4-6, 7-5, 6-3.\n\n\"It's brutal when you have over 80 per cent of humidity day after day, particularly for the guys when they're playing during the day with heat, with sun, it's even more brutal.\"\n\nLoading...\n\nFourth seed Djokovic, who had got the first break of the match to go 3-1 up in the opening set before he hurt his leg, could not break Munar's serve during the second set, which the world number 41 won after a 75-minute battle.\n\nThe 24-time grand slam winner bent over in exhaustion and needed more medical attention before clinching the decisive third set with two well-timed breaks.\n\nDjokovic collapsed on the court after winning the match.\n\nHe is set to face Zizou Bergs in the last eight.\n\nEarlier on Tuesday, Emma Raducanu retired from her Wuhan Open match against Ann Li after struggling with exhaustion and having her blood pressure checked on a hot and humid afternoon.\n\nIga Świątek couldn't hide from the heat in China this week. (Getty Images: Robert Prange)\n\nIga Świątek enjoyed a 6-1 6-1 rout of Marie Bouzková, but noted that conditions the day prior would have been \"too much for most of the players\".\n\n\"I hope the other matches will be scheduled at a time where girls can compete, rather than just die on the court,\" Swiatek said.\n\nThe ATP said it would consider introducing a formal heat rule, as was the case at the Australian Open and other grand slams.\n\n\"Every player would agree,\" that a heat rule should be implemented, Rune said.\n\nIn a statement, the ATP said player safety was its highest priority and that on-site medical teams monitored the conditions.\n\nDe Minaur focuses on 'surviving'\n\nMeanwhile, seventh-seeded Alex De Minaur defeated Kamil Majchrzak 6-1, 7-5 in humid conditions for his tour-leading 36th win on hard courts this year.\n\nThe 26-year-old broke Majchrzak's serve five times to reach the Masters 1000 fourth round for the seventh time this season.\n\nTwo of the breaks came after he dropped serve to trail 4-3 in the second set.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I came into this week knowing how tough the conditions were going to be,\" De Minaur said.\n\n\"So the mindset, ultimately, is surviving, finding ways and getting ready for battles every time you step out on the court.\n\n\"There is no such thing as easy matches, especially in these conditions, so I'm glad I was able to compose myself in the second set, get the break back, and finish it off in two.\n\n\"If we had gone into a third, it would have been very physical.\"\n\nDe Minaur will next face Nuno Borges, who defeated Shang Juncheng 7-6 (5), 4-6, 6-3.\n\nAnother win for De Minaur would see him hit 50 tour-level victories in a season for the first time.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nWires/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/john-foreman-launches-special-christmas-pops-orchestra-event-20251008-p5n0zc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "John Foreman launches special Christmas pops orchestra event",
        "publish_date": "Wed, 08 Oct 2025 12:50:49 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "John Foreman launches special Christmas pops orchestra event\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/chicken-tikka-skewers-with-crunchy-coconut-potatoes-is-dinner-on-a-stick-20250923-p5mxc3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chicken tikka skewers with crunchy coconut potatoes is dinner on a stick",
        "publish_date": "Wed, 08 Oct 2025 12:48:10 +1100",
        "category": "lifestyle",
        "authors": [
            "Jessica Brook"
        ],
        "text": "Step 1 Preheat the oven to 200C fan-forced (220C conventional). Prepare a large baking tray by lining it with non-stick baking paper.\n\nStep 2 Place the potatoes in a saucepan, just covered with cold salted water, over high heat. Bring to a boil, then reduce the heat and cook for 10 minutes or until barely tender.\n\nStep 3 Meanwhile, add the yoghurt and curry paste to a bowl, season with salt and pepper and mix well to combine. Add the chicken, and toss to coat. Set aside to marinate.\n\nStep 4 Drain the potatoes and chop them into halves. Place the coconut oil, flaked coconut, fennel and cumin seeds and turmeric in a bowl, season well with salt and pepper, and stir to combine. Add the potatoes and toss to coat.\n\nStep 5 Spread the potatoes out on the prepared baking tray and press to squash slightly. Bake for 18 minutes, then add the curry leaf sprigs and cook for a further 2 minutes, or until the leaves are crisp, and the potatoes are golden.\n\nStep 6 Divide the chicken pieces among 8 metal skewers. Heat a chargrill pan over high heat. Brush each skewer with oil and cook, turning, for 10-12 minutes, or until lightly charred and cooked through.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-fire-ban-won-t-be-extended-in-brisbane-schrinner-cashes-in-on-bet-with-victorian-mayor-20251007-p5n0ls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Fire ban won’t be extended in Brisbane | Schrinner cashes in on ‘bet’ with Victorian mayor | Plans for huge build-to-rent development in South Brisbane",
        "publish_date": "Wed, 08 Oct 2025 12:46:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "A run-down South Brisbane motel could be replaced by a 41-storey tower, including 35 levels of rental units, in the latest development to take advantaged of relaxed zoning laws on the Kurilpa peninsula.\n\nIf approved and built, Pellicano Living would provide 570 new rentals to Brisbane’s inner-city market, including 205 studios, 320 one-bedroom and 45 two-bedroom units.\n\nThe site, at 55 Boundary Street, was formerly a low-rise motel. Property records show Pellicano Living bought the site in 2023 for $22 million.\n\nPellicano Living’s plans for a 41-storey build-to-rent development at 55 Boundary Street, South Brisbane. Credit: MAS Architecture\n\nBeneath the units would be a podium, including a wellness centre, a food and drink tenancy and 2173 square metres of available office space.\n\n“It offers a centralised building management, and a high-quality resident experience distinct from traditional strata,” town planning firm Property Projects Australia says in its assessment report, submitted to Brisbane City Council on Pellicano’s behalf.\n\n“This proposal reflects the demand for flexible and affordable housing with a high level of amenity that directly addresses the increasing concern regarding housing affordability and supply constraints.”\n\nLike ICD Property’s planned $2 billion riverside precinct at nearby West End, Pellicano’s proposal will be assessed through the Kurilpa temporary local planning instrument, a short-term override of the Brisbane City Plan Act to “facilitate housing supply, affordability and diversity” in the area.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-trades-day-three-live-oliver-s-brutal-demons-swipe-merrett-s-hard-task-20251007-p5n0s5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL trades day three LIVE: Butters’ Blues training connection, Saints land Flanders, McVee heads west",
        "publish_date": "Wed, 08 Oct 2025 12:43:09 +1100",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Melissa Coulter Ryan"
        ],
        "text": "An AFL investigation has found that Geelong did not breach salary cap rules but the club has been fined almost $80,000, half of which is suspended, for administrative errors.\n\nThe league released a statement on Wednesday in which it said the Cats had not broken salary cap or player movement rules, following a review of the period from 2019 to 2024.\n\n“The extended audit found, on the basis of the information obtained and reviewed by the AFL, that the club did not breach the AFL TPP limit nor the AFL player movement rules in any season within the timeframe assessed,” the statement said.\n\nHowever, the audit discovered a series of non-disclosures and/or late disclosures of deals with club associates and third parties.\n\n“In respect of the AFLW program, the non-disclosures identified were found to be administrative errors and do not amount to material breaches of the TPP rules or player movement rules,” the AFL said.\n\nThe Cats were fined $77,500, with $40,000 suspended for two years, and handed a set of extra requirements to comply with.\n\n”The AFL acknowledges the club’s cooperation in voluntarily agreeing to the conduct of the extended audit process and the manner of its participation in that process.”\n\nThe Cats said they accepted the AFL’s sanctions for the “disclosure errors”.\n\n“The Club and its personnel have fully cooperated throughout the audit process and worked closely with the AFL and EY to transparently provide access, documentation and information as required,” Cats chief Steve Hocking said.\n\n“We acknowledge the outcome of the audit has confirmed the Club has not breached AFL TPP limits nor the AFL player movement rules.\n\n“We also acknowledge the audit identified a number of non-disclosure items over the six-year period. We accept the AFL’s sanctions for these errors and will strengthen our education and governance processes moving forward.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nfl-coach-hits-star-after-huge-blunder-20251008-p5n0yz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NFL coach hits star after huge blunder",
        "publish_date": "Wed, 08 Oct 2025 12:36:07 +1100",
        "category": "sports",
        "authors": [],
        "text": "NFL coach hits star after huge blunder\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/pat-cummins-out-of-perth-test-may-miss-full-ashes-20251008-p5n0yj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pat Cummins out of Perth Test, may miss full Ashes series",
        "publish_date": "Wed, 08 Oct 2025 12:21:50 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Australia’s captain Pat Cummins is set to miss the start of the Ashes and may miss the whole series after a fresh round of scans revealed his back stress problem had not yet healed.\n\nCummins, who had previously expressed confidence that he would be able to take a significant part in the series, is no chance for the opener in Perth, starting on November 21, and may even miss all five Tests, leaving Steve Smith as the likely stand-in skipper to face Ben Stokes’ England team.\n\nAustralian skipper Pat Cummins’ injury is worse than first thought. Credit: Getty Images\n\nAccording to two sources with knowledge of confidential discussions but not authorised to speak publicly, 32-year-old Cummins had the update scan last week to clarify his progress ahead of the Test summer and was told that while the stress “hot spot” was healing, it has not yet cleared up enough for him to bowl.\n\nThe update will likely set back his return to play to the last few weeks of the year, making it very hard for him to get up to speed in time to take part in a tightly scheduled Ashes series. Cricket Australia declined to comment.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/optus-sent-triple-zero-outage-notification-to-wrong-email-address-20251008-p5n0ym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Optus sent triple-zero outage notification to wrong email address",
        "publish_date": "Wed, 08 Oct 2025 12:20:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "Optus sent triple-zero outage notification to wrong email address\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/the-mcg-to-get-2-billion-upgrade-under-bold-new-plan-20251008-p5n0yn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The MCG to get $2 billion upgrade under bold new plan",
        "publish_date": "Wed, 08 Oct 2025 12:20:38 +1100",
        "category": "finance",
        "authors": [],
        "text": "The MCG to get $2 billion upgrade under bold new plan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victorians-to-ride-public-transport-for-free-on-weekends-for-two-months-20251008-p5n0yl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victorians to ride public transport for free on weekends for two months",
        "publish_date": "Wed, 08 Oct 2025 12:20:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "Victorians to ride public transport for free on weekends for two months\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-october-20251006-p5n0cw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Important for our sport’: Broncos keen to revive World Club Challenge",
        "publish_date": "Wed, 08 Oct 2025 12:18:47 +1100",
        "category": "sports",
        "authors": [
            "Adrian Proszenko",
            "Dan Walsh"
        ],
        "text": "Brisbane is open to participating in the World Club Challenge clash as the NRL hopes to resurrect the concept.\n\nThe match was scrapped in 2025 due to scheduling commitments, given that NRL premiers Penrith were already committed to playing in Las Vegas.\n\nBroncos chief executive Dave Donaghy confirmed the 2026 champions are keen to take on their Super League counterparts after their epic 26-22 win over Melbourne.\n\n“We’ll have those discussions with the NRL later this week,” Donaghy said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/cyclist-dies-after-collision-in-melbournes-north-20251008-p5n0yf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cyclist dies after collision in Melbourne's north",
        "publish_date": "Wed, 08 Oct 2025 12:14:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Cyclist dies after collision in Melbourne's north\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/perth-football-club-booted-over-distasteful-silly-sunday-costume-20251008-p5n0ws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Perth football club booted over ‘distasteful’ Silly Sunday costume",
        "publish_date": "Wed, 08 Oct 2025 12:13:44 +1100",
        "category": "sports",
        "authors": [
            "Holly Thompson"
        ],
        "text": "A local football club in Perth’s north has had its lease cancelled after a player allegedly dressed as the late physicist Stephen Hawking for the club’s end of year celebrations.\n\nThe costume included Hawking’s wheelchair and electronic communication system, and displayed a fake pornography site on the system’s screen.\n\nThe player dressed as the late physicist at the club’s end-of-season celebrations. Credit: Sebastian Costanzo\n\nThe City of Stirling ended the Osborne Park Football Club’s lease at its Tuart Hill clubhouse after finding out about the costume – created for its “Silly Sunday” event in August – but said it was a matter for the Perth Football League whether the club could continue playing.\n\nOn Tuesday evening, the football club posted a statement to its Facebook page to “address a very serious matter that has brought the future of our club into question”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/waerea-hargreaves-missed-30-nrl-matches-due-to-suspension-he-may-now-miss-a-grand-final-20251007-p5n0k0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Grand finale back on track: Roosters legend beats high-tackle ban",
        "publish_date": "Wed, 08 Oct 2025 12:05:05 +1100",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Christian Nicolussi"
        ],
        "text": "Former Roosters NRL star Jared Waerea-Hargreaves is free to challenge for one last piece of silverware after overturning a suspension that threatened to ruin his career swansong.\n\nWaerea-Hargreaves will line up for Hull KR in Sunday’s Super League grand final against Wigan after successfully appealing what had initially been a three-week ban for hitting St Helens winger Jon Bennison high last weekend.\n\nJared Waerea-Hargreaves risks missing the Super League grand final for this tackle. Credit: Super League\n\nThe Kiwi legend won three premierships with the Sydney Roosters during his 16 years in the NRL, but was also charged a whopping 38 times and missed a total of 30 games through suspension.\n\nAfter performing strongly in what will be his only season of Super League, Waerea-Hargreaves had faced an ignominious end to a career as one of rugby league’s last true enforcers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/amid-dark-clouds-of-global-debt-and-dysfunction-gold-s-glitter-grows-20251008-p5n0v4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Amid dark clouds of global debt and dysfunction, gold’s glitter grows",
        "publish_date": "Wed, 08 Oct 2025 12:00:08 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Gold’s remarkable run this year is sending a number of troubling signals about the state of the world, and the United States in particular.\n\nThe gold price broke through $US4000 an ounce for the first time overnight, having soared more than 50 per cent this year and more than doubled over the past two years.\n\nThere’s no single reason for its surge, but rather a whole raft of them, within a loose envelope of concerns about global debt levels, political dysfunction, conflicts, monetary policies and the debasement of major currencies.\n\nGold has soared to records, trading near $US4000 an ounce now. Credit: Getty\n\nThere might also be some effective hedging against the risk of a record US sharemarket, with concerns mounting about the artificial intelligence boom that has driven that market since the launch of ChatGPT in late 2022, about the way AI is now being financed and the vast amounts of low to no-returning capital being sunk into the sector.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/theatre/this-play-is-about-death-but-it-s-also-warm-witty-and-life-affirming-20251002-p5mzm8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This play is about death, but it’s also warm, witty and life-affirming",
        "publish_date": "Wed, 08 Oct 2025 12:00:00 +1100",
        "category": "entertainment",
        "authors": [
            "John Bailey"
        ],
        "text": "Actors might joke about dying on stage, but Genevieve Morris’ latest play actually has her preparing for the great hereafter. She’s the star of MTC’s one-woman show, Dying: A Memoir, adapted by writer Benjamin Law from Cory Taylor’s masterful last book. The play’s subject is right there in the title, and it’s had cast and crew thinking hard about the inevitable.\n\n“One of the dramaturges and I made a pact that by the end of this season, we’ll have both done our wills. We’ve both got children. I’ve been through two bouts of cancer and treatment and I don’t have a will. How ridiculous,” says Morris.\n\nWriter Benjamin Law and actor Genevieve Morris, who say Dying: A Memoir pays homage to those you’ve lost. Credit: PENNY STEPHENS\n\nTaylor was an Australian writer whose two novels, Me and Mr Booker and My Beautiful Enemy, drew great acclaim. They were only written after Taylor was diagnosed with melanoma, however, and just five years on from the publishing of her debut novel, she died surrounded by family in Brisbane. Her death didn’t come as a surprise: indeed, she spent the last period of her life writing a book about her experience of dying that was, thanks to extraordinary efforts of her publishers, released while she was still alive.\n\nLaw was a friend of Taylor’s. They met while both were studying for a PhD in screenwriting, and later he would admire her taste when she visited the Brisbane bookshop in which he worked. “We became kindred spirits fast,” he says.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/optus-sent-triple-zero-outage-notification-to-the-wrong-email-address-department-says/51cqm1wqr",
        "title": "Optus sent triple-zero outage notification to the wrong email address, department says",
        "publish_date": "Wed, 8 Oct 2025 01:15:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government only learned about Optus' deadly triple-zero outage the day after it happened because the telecommunications provider sent a notification email to the wrong address.\n\n\n\n\n\nOptus was required by regulation to notify the Department of Communications about the emergency call 18 September outage, which has been linked to three deaths.\n\n\n\n\n\nThe Singapore-owned telco sent two emails to the department on the day, one at 2.45pm notifying about the outage and another at 2.52pm advising the matter had been resolved, department deputy secretary for communications and media James Chisholm said.\n\n\n\n\n\nBut the emails were sent to a redundant address, meaning the department didn't learn about the outage until it was called by the Australian Communications and Media Authority (ACMA) at 3.30pm on Friday, more than 36 hours after the outage began.\n\n\n\n\n\n\"That communication ... was sent to the wrong address, which we have told industry a number of times is not to be used as a source for notification,\" Chisholm told a Senate Estimates hearing in Canberra on Wednesday.\n\n\n\nLISTEN TO Government fast-tracks legislation to strengthen 000 call system SBS News 05:33 English\n\n\"We were not notified of the outage properly, and in this case, it was by the regulator (ACMA), until the Friday afternoon.\"\n\n\n\n\n\nThe outage was caused by a routine firewall upgrade to the Optus network and prevented more than 600 triple-zero calls from connecting in South Australia, the Northern Territory, Western Australia and some parts of NSW.\n\n\n\n\n\nThe calls also failed to redirect to another functioning network in the area, even though they are legally required to do so.\n\n\n\n\n\nOn Tuesday, Communications Minister Anika Wells met with Optus chief executive Stephen Rue and introduced legislation ratcheting scrutiny on the sector by enshrining a triple-zero watchdog into law.\n\n\n\nAs the Senate hearing was ongoing, the Opposition launched a push in the House of Representatives for an inquiry into the outage, arguing that a review being conducted by ACMA was insufficient.\n\n\n\n\n\nOpposition communications spokesperson Melissa McIntosh said the government had displayed \"disgraceful\" behaviour in refusing scrutiny on the triple zero network by not calling an independent inquiry.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/revelations-optus-e-mailed-the-wrong-address-about-000-outage-midday-news-bulletin-8-october-2025/ghyku2j9d",
        "title": "Revelations Optus e-mailed the wrong address about 000 outage | Midday News Bulletin 8 October 2025",
        "publish_date": "Wed, 8 Oct 2025 01:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA senior government official says Optus emailed the wrong address when it notified the Department of Communications about a major triple-zero outage on September 18.\n\n\n\n\n\nThe department's deputy secretary, James Chisholm, made the disclosure during Senate Estimates, amid scrutiny of the government's response.\n\n\n\n\n\nCommunications Minister Anika Wells has said she was not notified of the outage until September 19, more than 24 hours after it first began.\n\n\n\n\n\nMr Chisholm also says the Optus email didn't make clear the extraordinary nature of the outage, which affected 600 calls.\n\n\n\n\n\n\"We receive a number of notifications about outages that are resolved very quickly. I think Mr Grunhard can confirm if we were talking to the office about every outage, it would probably be all day. So in this case, we were notified that there had been an outage, and as I said in the statement, within seven minutes that had been resolved. We heard nothing more, until 3.30 the next day from the regulator that there had been a very significant outage.\"\n\n\n\n\n\n+++\n\n\n\n\n\nAustralia and Singapore have announced an enhanced partnership.\n\n\n\n\n\nTen years on from the start of the Comprehensive Strategic Partnership between the two nations, Prime Minister Anthony Albanese and his Singaporean counterpart, Lawrence Wong, have launched a second version of it after meeting in Canberra.\n\n\n\n\n\nMr Albanese says it will be based around defence, economic stability, climate change, pandemic preparedness and research into emerging tech.\n\n\n\n\n\n+++\n\n\n\n\n\nThe Tasmanian government says the state will suffer immense reputational damage and fail future generations if the proposed AFL stadium on the Hobart waterfront is not built.\n\n\n\n\n\nThe state's planning commission's formal report recently recommended against building the stadium.\n\n\n\n\n\nIn its formal response to the report, the government says the stadium would create jobs, investment, and long-lasting benefits that cannot be exactly quantified, such as community pride.\n\n\n\n\n\nThe government is not bound by the commission's recommendation, but must pass legislation in order to build the stadium, which is forecast to cost more than one billion dollars.\n\n\n\n\n\nThe opposition Labor Party has pledged support for the stadium, but getting the legislation through the upper house is far from certain.\n\n\n\n\n\n+++\n\n\n\n\n\nThe federal government is expected to announce a major taxpayer bailout of a smelter in Queensland, in order to save around 1,100 jobs.\n\n\n\n\n\nFederal Industry Minister Tim Ayres is expected to make the announcement in Mount Isa, the site of the smelter, owned by Swiss mining giant Glencore.\n\n\n\n\n\nThe company has threatened to close both the Mount Isa smelter and its Townsville copper refinery, due to running costs.\n\n\n\n\n\nIt forecast a 2.2 billion dollar loss for the facilities over the next seven years.\n\n\n\n\n\nThe Queensland government will contribute to the bailout.\n\n\n\n\n\nThe Mount Isa smelter contributes about half of Australia's copper smelting facilities.\n\n\n\n\n\n+++\n\n\n\n\n\nThe European Union is making another appeal to Afghanistan's Taliban government to improve the status of women in the country, as it announces it has provided more than 350 million dollars in humanitarian support.\n\n\n\n\n\nMost international aid to Afghanistan, including that from the U-S, has been suspended since the Taliban re-took power in 2021.\n\n\n\n\n\nThe hardline Islamist Taliban has placed severe restrictions upon women in Afghanistan.\n\n\n\n\n\nDenmark's Minister for European Affairs, Marie Bjerre, has told the European parliament that these need to be lifted to help the delivery of aid to the Afghan people, especially after the recent earthquake.\n\n\n\n\n\n\"We need to make the voices of Afghan women heard again. We have heard the critical voices in Afghanistan about the Taliban response to the earthquake, including the lack of female doctors and the need for trained female professionals. We will continue calling on the Taliban to guarantee that all aid workers, including all female staff, can continue their aid delivery and have access to the entire territory.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn football, Arsenal's defence of their women's European Champions League title, featuring three Matildas, has started badly.\n\n\n\n\n\nThey've lost, two goals to one, in London to eight-time champions, French side Lyon.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-afps-new-commissioner-krissy-barrett/3bm6lw2eg",
        "title": "INTERVIEW: The AFP's new commissioner, Krissy Barrett",
        "publish_date": "Tue, 7 Oct 2025 21:51:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/uefa-approves-ac-milans-historic-serie-a-match-in-perth-with-fifas-final-green-light-expected-soon/47wuhe8au",
        "title": "UEFA approves AC Milan’s historic Perth Serie A match; FIFA approval pending",
        "publish_date": "Tue, 7 Oct 2025 11:32:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/gps-struggle-to-cope-with-demand-for-emergency-level-care/nxj9fek37",
        "title": "GPs struggle to cope with demand for emergency-level care",
        "publish_date": "Tue, 7 Oct 2025 09:47:09 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "GPs struggle to cope with demand for emergency-level care\n\nPublished 7 October 2025, 7:08 am\n\nAn annual survey of GPs has found most are seeing patients who would normally be treated in hospital emergency departments. The Royal Australian College of General Practitioners says doctors are struggling to meet the increasing demand for their services.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/telco-chiefs-face-questions-over-emergency-network-failures/520vwd1ly",
        "title": "Telco chiefs face questions over emergency network failures",
        "publish_date": "Tue, 7 Oct 2025 09:20:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Telco chiefs face questions over emergency network failures\n\nPublished 7 October 2025, 7:08 am\n\nThe embattled CEO of Optus has been hauled into parliament with other telco executives over repeated failures in the triple zero system. But the communications minister is also facing increasing questions over her response, today fast-tracking legislation to safeguard the emergency network.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asic-approves-asx-listing-market-competitor-is-ai-in-a-bubble-and-gold-approaches-us-4-000/15pn8lg7y",
        "title": "ASIC approves ASX listing market competitor; is AI in a bubble? and gold approaches US$4,000",
        "publish_date": "Tue, 7 Oct 2025 06:33:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/gp-snapshot-reveals-why-the-job-has-become-more-complicated/qpql0lgde",
        "title": "GP snapshot reveals why the job has become more complicated",
        "publish_date": "Tue, 7 Oct 2025 06:07:02 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"As a female GP who sees many patients with complex care needs, particularly mental health conditions, the consultations are quite long. That's not a complaint, that's actually a good thing - it helps to improve patient outcomes.\"\n\n\n\n\n\nMeet Dr Ramya Raman, a GP based in Western Australia and the Vice President of the Royal Australian College of General Practitioners.\n\n\n\n\n\nHer experience of longer and more complicated consultations with patients is at the centre of this year's industry survey, known as the Heart of the Nation report.\n\n\n\n\n\nIt's found the average appointment time for most GPs has become longer, clocking in at just under 20 minutes - an increase of around a minute that College President Dr Michael Wright says is not surprising.\n\n\n\n\n\n\"This year some important findings include that 99 per cent of Australians said they could see a GP when they needed to - but what we're seeing is that complexity of care is increasing.\"\n\n\n\n\n\nAs Dr Raman's experience suggests, mental health is at the heart of this complexity.\n\n\n\n\n\nDr Wright says 71 per cent of GPs have nominated mental health - most commonly anxiety and depression - as a top reason for patient presentations, an increase of ten per cent since the survey began in 2017.\n\n\n\n\n\nBut there are also growing rates of chronic disease and issues that arise as more people get older.\n\n\n\n\n\nGP: \"Morning Nic, please come in. Nice to see you.\n\n\n\n\n\nPATIENT: \"Hello, how are you.\"\n\n\n\n\n\nGP: “Please take a seat.\"\n\n\n\n\n\nThe Health of the Nation report says there has been a slight increase in the number of people delaying a visit to the doctor due to the cost of treatment - but there's some good news in the report in terms of being able to find a GP.\n\n\n\n\n\nWhile only 12 per cent of GPs say they can afford to bulk-bill all of their patients, the report has found fewer people are waiting longer than what is considered acceptable to see their doctor than in previous years.\n\n\n\n\n\nDr Raman says access continues to be important because it can help avoid a much larger crisis down the line.\n\n\n\n\n\n\"When patients are able to see their GP and spend time with their GPs, it actually means that they don't end up in hospital. So best to see their GP rather than walking into the hospital.\"\n\n\n\n\n\nBut that's complicated by the nature of the conditions that GPs are confronted with.\n\n\n\n\n\nThe Health of the Nation report says 86 per cent of GPs are managing health issues they'd typically expect specialists to treat, with diabetes and cardiovascular issues the two most common for GPs, besides mental health.\n\n\n\n\n\nIndependent MP Sophie Scamps - herself a former GP - says a lack of access to specialist care means GPs must absorb that demand.\n\n\n\n\n\nDr Scamps says that is significant because prevention and early management is sometimes the best medicine.\n\n\n\n\n\n\"We know that up to 40 per cent of the disease burden in Australia is entirely preventable. And GPs are best placed to be able to provide that preventative care. Yet in Australia we only invest only two per cent of our health budget in prevention, which is far less than other comparable countries.\"\n\n\n\n\n\nCollege President Dr Wright offers a familiar prescription to treat these issues.\n\n\n\n\n\n\"We need to fix Medicare funding so that patients can spend more time with their GP when they need to. We know that's important for their health and also for the health of their community.\"\n\n\n\n\n\nChange is already on the way to address some of the issues in the report.\n\n\n\n\n\nThe government's election promise of more funding for bulk-billing is due to come into effect on November the 1st, and there will also be a change to item numbers in Medicare that cover reviews of mental health treatment plans.\n\n\n\n\n\nThe idea is to streamline consultations and reduce the administrative burden for GPs - but Dr Wright says it's still not enough.\n\n\n\n\n\n\"General practice is doing amazing things, and we're doing it with the same amount of funding that we've had for the past decade, despite increasing complexity of care, despite increasing administration.\"\n\n\n\n\n\nThe report has also taken a closer look at discrimination, finding almost one third of GPs have witnessed racism towards patients in the health system in the past year.\n\n\n\n\n\nTwo in 10 GPs have also personally experienced racism from a patient within their practice.\n\n\n\n\n\nDr Karen Nicholls is the chair of the College's Aboriginal and Torres Strait Islander Health Council, and says racism can have severe consequences.\n\n\n\n\n\n\"It means that patients tend to want to avoid care, and they may not seek help when they need it. It also means that if they're anticipating they might experience racism from their health care provider, they can - it's quite stressful, so it might trigger their fight or flight response which can increase blood pressure, increase heart rate - and again, that can lead to chronic diseases.\"\n\n\n\n\n\nThe College of GPs has taken steps to address the issue, including introducing an Aboriginal and Torres Strait Islander training framework.\n\n\n\n\n\nDr Wright says the organisation is all too aware that more needs to be done.\n\n\n\n\n\n\"We've been asking our members how common that is, and we've got some strategies for reducing the impact of that for our patients and for our GPs, many of whom did their medical degrees in other countries.\"\n\n\n\n\n\nDr Nicholls is glad to hear it.\n\n\n\n\n\n\"There's been lots of discussions over the years about the impacts of racism, and whilst it has been a long time coming it is very welcome, and any opportunity to actually highlight it and address it is to be applauded.\"\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/how-a-sport-program-is-helping-yazidi-refugees-find-community/o0xcq3mjk",
        "title": "How a sport program is helping Yazidi refugees find community",
        "publish_date": "Tue, 7 Oct 2025 05:00:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "How a sport program is helping Yazidi refugees find community\n\nPublished 7 October 2025, 4:24 am\n\nThe Queensland city of Toowoomba has become home to thousands of Yazidi refugees. A local hockey program is aiming to develop confidence and language skills for this community, with the help of retired locals on the field.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/federal-government-admits-handballing-truth-telling-process-as-only-half-a-person-employed/6yvl7nghg",
        "title": "Federal government admits handballing truth-telling process as only 'half a person' employed",
        "publish_date": "Tue, 7 Oct 2025 03:12:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government has appeared to have quietly abandoned a federal truth-telling commission, admitting it is keeping tabs on state progress instead.\n\n\n\n\n\nWhen he was elected as prime minister in 2022, Anthony Albanese committed to the Uluru Statement from the Heart in full.\n\n\n\n\n\nWhile the Voice to Parliament referendum failed, the government had previously committed to a Makarrata Commission to oversee truth-telling and treaty-making, allocating $5.8 million in funding for its establishment last year.\n\n\n\n\n\nHowever, it now admits that \"we are not working on a specific proposal around a Makaratta Commission\".\n\n\n\nGreens leader Larissa Waters has questioned whether the Albanese government is making progress towards its truth-telling committment. Source: AAP / Lukas Coch Greens leader Larissa Waters quizzed the National Indigenous Australians Agency (NIAA) about the status of the funding in Senate estimates on Tuesday morning.\n\n\n\n\n\nThe NIAA revealed that much of the funding had been drawn into a contingency fund, with the agency financing a part-time salary to monitor progress in other states.\n\n\n\n\n\nIt came after Waters questioned whether the NIAA had made a budget submission for renewed funding or for other truth-telling mechanisms.\n\n\n\n\n\n\"So you've gone from $5.8 million for the Makaratta truth telling to now half a person looking at what other jurisdictions are doing,\" Waters responded.\n\n\n\n\n\nThe NIAA said it was aware of a \"range of jurisdictions that have activities related to truth-telling\". In Victoria, that progress goes as far as treaty legislation , which will be debated in parliament next week.\n\n\n\n\"Primarily, the work the branch is doing is looking at what's going on around other jurisdictions,\" NIAA acting deputy CEO Deborah Fulton told the committee.\n\n\n\n\n\n\"Half a person?\" Waters asked.\n\n\n\n\n\nFulton replied: \"Essentially, yes.\"\n\n\n\n\n\nFulton said the organisation was administering other programs, like the Stolen Generations Redress Scheme, which provides financial compensation and healing to support Aboriginal and Torres Strait Islander people removed from their families.\n\n\n\n\n\nAhead of this year's Garma Festival, Yolngu leader and chair of the Yothu Yindi Foundation Djawa Yunupingu told SBS News that truth-telling at a national level was a top priority.\n\n\n\n\n\nHowever, Albanese did not endorse support for a broad truth-telling process during his speech at Garma, instead praising Victoria's progress.\n\n\n\n\n\n\"As a nation, we are still coming to terms with the full truth and toll of this exclusion,\" he said while acknowledging the work of Victoria's Yoorrook Justice Commission.\n\n\n\nIn July, the nation's first truth-telling inquiry handed down its final report, containing 100 recommendations for urgent change.\n\n\n\n\n\n\"Even as we continue on the long journey of understanding our past, we must meet our responsibility to the future,\" Albanese said.\n\n\n\n\n\nAlbanese instead used his Garma address to focus on \"economic sovereignty\" through the establishment of new partnerships between government and Aboriginal and Torres Strait Islander organisations.\n\n\n\n\n\nSBS News understands the Greens will reintroduce their Truth and Justice Commission bill in this term of parliament, but the exact timing is unclear.\n\n\n\n'The government should stick to its promise'\n\nIndependent senator Lidia Thorpe called on the government to \"stick to its promise\" and establish a national commission within this term, telling SBS News that truth-telling \"is how this country can finally see the truth of history with open eyes — without it, we’ll never mature as a nation.\"\n\n\n\nIndependent senator Lidia Thorpe said the truth-telling commission should have royal commission powers. Source: AAP / Mick Tsikas \"The Prime Minister was full of praise for Yoorrook at Garma, but he refuses to act nationally,\" she said in a statement. \"He can’t hide behind the failed Voice referendum.\"\n\n\n\n\n\nTruth-telling must come first, Thorpe said, \"so people in this country can learn the true history. Until that happens, we’ll keep seeing racism and misinformation spread about First Peoples\".\n\n\n\n\n\nA government spokesperson told SBS News: \"The Albanese government remains committed to the principles of the Uluru Statement from the Heart — including truth-telling.\"\n\n\n\n\n\n\n\n\"We support the work being done in states and territories, particularly Victoria.\"\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/john-foreman-launches-special-christmas-pops-orchestra-event-20251008-p5n0zc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "John Foreman launches special Christmas pops orchestra event",
        "publish_date": "Wed, 08 Oct 2025 12:50:49 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "John Foreman launches special Christmas pops orchestra event\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/chicken-tikka-skewers-with-crunchy-coconut-potatoes-is-dinner-on-a-stick-20250923-p5mxc3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chicken tikka skewers with crunchy coconut potatoes is dinner on a stick",
        "publish_date": "Wed, 08 Oct 2025 12:48:10 +1100",
        "category": "lifestyle",
        "authors": [
            "Jessica Brook"
        ],
        "text": "Step 1 Preheat the oven to 200C fan-forced (220C conventional). Prepare a large baking tray by lining it with non-stick baking paper.\n\nStep 2 Place the potatoes in a saucepan, just covered with cold salted water, over high heat. Bring to a boil, then reduce the heat and cook for 10 minutes or until barely tender.\n\nStep 3 Meanwhile, add the yoghurt and curry paste to a bowl, season with salt and pepper and mix well to combine. Add the chicken, and toss to coat. Set aside to marinate.\n\nStep 4 Drain the potatoes and chop them into halves. Place the coconut oil, flaked coconut, fennel and cumin seeds and turmeric in a bowl, season well with salt and pepper, and stir to combine. Add the potatoes and toss to coat.\n\nStep 5 Spread the potatoes out on the prepared baking tray and press to squash slightly. Bake for 18 minutes, then add the curry leaf sprigs and cook for a further 2 minutes, or until the leaves are crisp, and the potatoes are golden.\n\nStep 6 Divide the chicken pieces among 8 metal skewers. Heat a chargrill pan over high heat. Brush each skewer with oil and cook, turning, for 10-12 minutes, or until lightly charred and cooked through.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-fire-ban-won-t-be-extended-in-brisbane-schrinner-cashes-in-on-bet-with-victorian-mayor-20251007-p5n0ls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Fire ban won’t be extended in Brisbane | Schrinner cashes in on ‘bet’ with Victorian mayor | Plans for huge build-to-rent development in South Brisbane",
        "publish_date": "Wed, 08 Oct 2025 12:46:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "A run-down South Brisbane motel could be replaced by a 41-storey tower, including 35 levels of rental units, in the latest development to take advantaged of relaxed zoning laws on the Kurilpa peninsula.\n\nIf approved and built, Pellicano Living would provide 570 new rentals to Brisbane’s inner-city market, including 205 studios, 320 one-bedroom and 45 two-bedroom units.\n\nThe site, at 55 Boundary Street, was formerly a low-rise motel. Property records show Pellicano Living bought the site in 2023 for $22 million.\n\nPellicano Living’s plans for a 41-storey build-to-rent development at 55 Boundary Street, South Brisbane. Credit: MAS Architecture\n\nBeneath the units would be a podium, including a wellness centre, a food and drink tenancy and 2173 square metres of available office space.\n\n“It offers a centralised building management, and a high-quality resident experience distinct from traditional strata,” town planning firm Property Projects Australia says in its assessment report, submitted to Brisbane City Council on Pellicano’s behalf.\n\n“This proposal reflects the demand for flexible and affordable housing with a high level of amenity that directly addresses the increasing concern regarding housing affordability and supply constraints.”\n\nLike ICD Property’s planned $2 billion riverside precinct at nearby West End, Pellicano’s proposal will be assessed through the Kurilpa temporary local planning instrument, a short-term override of the Brisbane City Plan Act to “facilitate housing supply, affordability and diversity” in the area.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-trades-day-three-live-oliver-s-brutal-demons-swipe-merrett-s-hard-task-20251007-p5n0s5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL trades day three LIVE: Butters’ Blues training connection, Saints land Flanders, McVee heads west",
        "publish_date": "Wed, 08 Oct 2025 12:43:09 +1100",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Melissa Coulter Ryan"
        ],
        "text": "An AFL investigation has found that Geelong did not breach salary cap rules but the club has been fined almost $80,000, half of which is suspended, for administrative errors.\n\nThe league released a statement on Wednesday in which it said the Cats had not broken salary cap or player movement rules, following a review of the period from 2019 to 2024.\n\n“The extended audit found, on the basis of the information obtained and reviewed by the AFL, that the club did not breach the AFL TPP limit nor the AFL player movement rules in any season within the timeframe assessed,” the statement said.\n\nHowever, the audit discovered a series of non-disclosures and/or late disclosures of deals with club associates and third parties.\n\n“In respect of the AFLW program, the non-disclosures identified were found to be administrative errors and do not amount to material breaches of the TPP rules or player movement rules,” the AFL said.\n\nThe Cats were fined $77,500, with $40,000 suspended for two years, and handed a set of extra requirements to comply with.\n\n”The AFL acknowledges the club’s cooperation in voluntarily agreeing to the conduct of the extended audit process and the manner of its participation in that process.”\n\nThe Cats said they accepted the AFL’s sanctions for the “disclosure errors”.\n\n“The Club and its personnel have fully cooperated throughout the audit process and worked closely with the AFL and EY to transparently provide access, documentation and information as required,” Cats chief Steve Hocking said.\n\n“We acknowledge the outcome of the audit has confirmed the Club has not breached AFL TPP limits nor the AFL player movement rules.\n\n“We also acknowledge the audit identified a number of non-disclosure items over the six-year period. We accept the AFL’s sanctions for these errors and will strengthen our education and governance processes moving forward.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nfl-coach-hits-star-after-huge-blunder-20251008-p5n0yz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NFL coach hits star after huge blunder",
        "publish_date": "Wed, 08 Oct 2025 12:36:07 +1100",
        "category": "sports",
        "authors": [],
        "text": "NFL coach hits star after huge blunder\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/pat-cummins-out-of-perth-test-may-miss-full-ashes-20251008-p5n0yj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pat Cummins out of Perth Test, may miss full Ashes series",
        "publish_date": "Wed, 08 Oct 2025 12:21:50 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Australia’s captain Pat Cummins is set to miss the start of the Ashes and may miss the whole series after a fresh round of scans revealed his back stress problem had not yet healed.\n\nCummins, who had previously expressed confidence that he would be able to take a significant part in the series, is no chance for the opener in Perth, starting on November 21, and may even miss all five Tests, leaving Steve Smith as the likely stand-in skipper to face Ben Stokes’ England team.\n\nAustralian skipper Pat Cummins’ injury is worse than first thought. Credit: Getty Images\n\nAccording to two sources with knowledge of confidential discussions but not authorised to speak publicly, 32-year-old Cummins had the update scan last week to clarify his progress ahead of the Test summer and was told that while the stress “hot spot” was healing, it has not yet cleared up enough for him to bowl.\n\nThe update will likely set back his return to play to the last few weeks of the year, making it very hard for him to get up to speed in time to take part in a tightly scheduled Ashes series. Cricket Australia declined to comment.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/optus-sent-triple-zero-outage-notification-to-wrong-email-address-20251008-p5n0ym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Optus sent triple-zero outage notification to wrong email address",
        "publish_date": "Wed, 08 Oct 2025 12:20:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "Optus sent triple-zero outage notification to wrong email address\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/the-mcg-to-get-2-billion-upgrade-under-bold-new-plan-20251008-p5n0yn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The MCG to get $2 billion upgrade under bold new plan",
        "publish_date": "Wed, 08 Oct 2025 12:20:38 +1100",
        "category": "finance",
        "authors": [],
        "text": "The MCG to get $2 billion upgrade under bold new plan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victorians-to-ride-public-transport-for-free-on-weekends-for-two-months-20251008-p5n0yl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victorians to ride public transport for free on weekends for two months",
        "publish_date": "Wed, 08 Oct 2025 12:20:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "Victorians to ride public transport for free on weekends for two months\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-october-20251006-p5n0cw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Important for our sport’: Broncos keen to revive World Club Challenge",
        "publish_date": "Wed, 08 Oct 2025 12:18:47 +1100",
        "category": "sports",
        "authors": [
            "Adrian Proszenko",
            "Dan Walsh"
        ],
        "text": "Brisbane is open to participating in the World Club Challenge clash as the NRL hopes to resurrect the concept.\n\nThe match was scrapped in 2025 due to scheduling commitments, given that NRL premiers Penrith were already committed to playing in Las Vegas.\n\nBroncos chief executive Dave Donaghy confirmed the 2026 champions are keen to take on their Super League counterparts after their epic 26-22 win over Melbourne.\n\n“We’ll have those discussions with the NRL later this week,” Donaghy said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/cyclist-dies-after-collision-in-melbournes-north-20251008-p5n0yf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cyclist dies after collision in Melbourne's north",
        "publish_date": "Wed, 08 Oct 2025 12:14:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Cyclist dies after collision in Melbourne's north\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/perth-football-club-booted-over-distasteful-silly-sunday-costume-20251008-p5n0ws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Perth football club booted over ‘distasteful’ Silly Sunday costume",
        "publish_date": "Wed, 08 Oct 2025 12:13:44 +1100",
        "category": "sports",
        "authors": [
            "Holly Thompson"
        ],
        "text": "A local football club in Perth’s north has had its lease cancelled after a player allegedly dressed as the late physicist Stephen Hawking for the club’s end of year celebrations.\n\nThe costume included Hawking’s wheelchair and electronic communication system, and displayed a fake pornography site on the system’s screen.\n\nThe player dressed as the late physicist at the club’s end-of-season celebrations. Credit: Sebastian Costanzo\n\nThe City of Stirling ended the Osborne Park Football Club’s lease at its Tuart Hill clubhouse after finding out about the costume – created for its “Silly Sunday” event in August – but said it was a matter for the Perth Football League whether the club could continue playing.\n\nOn Tuesday evening, the football club posted a statement to its Facebook page to “address a very serious matter that has brought the future of our club into question”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/waerea-hargreaves-missed-30-nrl-matches-due-to-suspension-he-may-now-miss-a-grand-final-20251007-p5n0k0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Grand finale back on track: Roosters legend beats high-tackle ban",
        "publish_date": "Wed, 08 Oct 2025 12:05:05 +1100",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Christian Nicolussi"
        ],
        "text": "Former Roosters NRL star Jared Waerea-Hargreaves is free to challenge for one last piece of silverware after overturning a suspension that threatened to ruin his career swansong.\n\nWaerea-Hargreaves will line up for Hull KR in Sunday’s Super League grand final against Wigan after successfully appealing what had initially been a three-week ban for hitting St Helens winger Jon Bennison high last weekend.\n\nJared Waerea-Hargreaves risks missing the Super League grand final for this tackle. Credit: Super League\n\nThe Kiwi legend won three premierships with the Sydney Roosters during his 16 years in the NRL, but was also charged a whopping 38 times and missed a total of 30 games through suspension.\n\nAfter performing strongly in what will be his only season of Super League, Waerea-Hargreaves had faced an ignominious end to a career as one of rugby league’s last true enforcers.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/amid-dark-clouds-of-global-debt-and-dysfunction-gold-s-glitter-grows-20251008-p5n0v4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Amid dark clouds of global debt and dysfunction, gold’s glitter grows",
        "publish_date": "Wed, 08 Oct 2025 12:00:08 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Gold’s remarkable run this year is sending a number of troubling signals about the state of the world, and the United States in particular.\n\nThe gold price broke through $US4000 an ounce for the first time overnight, having soared more than 50 per cent this year and more than doubled over the past two years.\n\nThere’s no single reason for its surge, but rather a whole raft of them, within a loose envelope of concerns about global debt levels, political dysfunction, conflicts, monetary policies and the debasement of major currencies.\n\nGold has soared to records, trading near $US4000 an ounce now. Credit: Getty\n\nThere might also be some effective hedging against the risk of a record US sharemarket, with concerns mounting about the artificial intelligence boom that has driven that market since the launch of ChatGPT in late 2022, about the way AI is now being financed and the vast amounts of low to no-returning capital being sunk into the sector.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/theatre/this-play-is-about-death-but-it-s-also-warm-witty-and-life-affirming-20251002-p5mzm8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This play is about death, but it’s also warm, witty and life-affirming",
        "publish_date": "Wed, 08 Oct 2025 12:00:00 +1100",
        "category": "entertainment",
        "authors": [
            "John Bailey"
        ],
        "text": "Actors might joke about dying on stage, but Genevieve Morris’ latest play actually has her preparing for the great hereafter. She’s the star of MTC’s one-woman show, Dying: A Memoir, adapted by writer Benjamin Law from Cory Taylor’s masterful last book. The play’s subject is right there in the title, and it’s had cast and crew thinking hard about the inevitable.\n\n“One of the dramaturges and I made a pact that by the end of this season, we’ll have both done our wills. We’ve both got children. I’ve been through two bouts of cancer and treatment and I don’t have a will. How ridiculous,” says Morris.\n\nWriter Benjamin Law and actor Genevieve Morris, who say Dying: A Memoir pays homage to those you’ve lost. Credit: PENNY STEPHENS\n\nTaylor was an Australian writer whose two novels, Me and Mr Booker and My Beautiful Enemy, drew great acclaim. They were only written after Taylor was diagnosed with melanoma, however, and just five years on from the publishing of her debut novel, she died surrounded by family in Brisbane. Her death didn’t come as a surprise: indeed, she spent the last period of her life writing a book about her experience of dying that was, thanks to extraordinary efforts of her publishers, released while she was still alive.\n\nLaw was a friend of Taylor’s. They met while both were studying for a PhD in screenwriting, and later he would admire her taste when she visited the Brisbane bookshop in which he worked. “We became kindred spirits fast,” he says.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/agriculture-boss-paid-900k-upon-012936202.html",
        "title": "Agriculture boss paid out $900k upon 'amicable' exit",
        "publish_date": "2025-10-08T01:29:36Z",
        "category": "finance",
        "authors": [],
        "text": "The former head of Australia's agriculture department was paid out nearly $900,000 upon his sudden departure, as the government insists he left on amicable terms.\n\nAgriculture Minister Julie Collins announced department secretary Adam Fennessy would leave his role in September, two years into a five-year term.\n\n\"I wish Mr Fennessy all the best with his future endeavours,\" Ms Collins said on September 4, crediting him for stabilising the department during a transitional period.\n\nJustine Saunders will be the acting head of Australia's agriculture department for now. (Mick Tsikas/AAP PHOTOS)\n\nDuring a Senate estimates hearing in Canberra on Wednesday, acting secretary Justine Saunders said Mr Fennessy was paid out $899,620, or one year's salary minus superannuation.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nChanges in executive roles across government departments were not unusual, Ms Saunders insisted.\n\n\"Both the minister and Mr Adam Fennessy, on his departure, made very clear that Mr Fennessy left under amicable circumstances,\" she said.\n\nNationals Senator Matt Canavan asked whether Mr Fennessy was fired, given that he was compensated under a particular clause in the Public Service Act that deals with the termination of department heads.\n\nIt was the department of prime minister and cabinet that oversaw the end of Mr Fennessy's role, not the agriculture department, assistant minister Anthony Chisholm said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"They're not issues that we were directly involved with,\" Senator Chisholm told the hearing.\n\n\"I don't think it's helpful to speculate, particularly when we are talking about an individual that has been impacted by this.\"\n\nMr Fennessy, who previously led primary industries, environment, water and planning departments for the Victorian government, said he was proud of his work to shake-up the federal portfolio during a Senate hearing in 2024.\n\n\"My focus ... continues to be leading an efficient and focused department that delivers on Australian government priorities and, importantly, the needs of the Australian agriculture, fisheries and forestry sectors,\" he said in November.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Our significant departmental transformation program is continuing. We have engaged staff internally to lift our capabilities across a range of areas, and the department is on a sustainable financial footing.\"\n\nMs Saunders would act in the role for three months, while recruitment for Mr Fennessy's permanent replacement continued.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aldi-denies-major-checkout-change-after-controversial-move-in-us-stores-012640085.html",
        "title": "Aldi denies major checkout change after controversial move in US stores",
        "publish_date": "2025-10-08T01:26:40Z",
        "category": "finance",
        "authors": [],
        "text": "Aldi Australia has revealed it has no plans to remove self-checkouts across its supermarket network, after it emerged that several of its international stores would no longer be offering the service.\n\nAcross the US, Aldi customers reported that a number of stores had gradually been reducing self-serve kiosks, with some locations now not offering them at all. In Australia, self-checkouts are widespread across the country's biggest retailers, including supermarkets Woolworths, Coles and Aldi, as well as other heavyweights like Bunnings and Big W.\n\nThe kiosks have been credited with speeding up the payment process, which would otherwise rely on staff members individually processing and bagging customers' groceries. Opponents, on the other hand, say they come at the cost of jobs, while also increasing instances of theft.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSome have also pointed out that the self-checkout lanes can reduce store efficiency, as user errors often require staff intervention, and staff performance is, in many cases, timed and evaluated for speed on every task they handle.\n\nIn recent months, posts to social media across the US soared from disgruntled shoppers, questioning where the self-serve had gone at their local stores. In response, Aldi in the US said that while the checkouts \"will remain available at many stores\", they had been indefinitely scrapped in others.\n\n\"We continually test and refine our in-store technologies and checkout options to better address customer needs and enhance operational efficiency,\" an Aldi spokesperson told US outlet Axios Chicago. The supermarket did not state how many stores will lose or have already lost their self-checkout kiosks, but online theories suggest theft could be the true driver behind the move.\n\nSpeaking to Yahoo News this week, an Aldi Australia spokesperson confirmed the supermarket would be keeping self-checkouts across its stores. It did not directly respond to questions on whether it planned to reconsider or revise its strategy in light of overseas removals.\n\nAldi offers self-serve counters across the country. Source: Reddit\n\nSupermarkets respond amid soaring reports of checkout theft\n\nIf Aldi were to remove any kiosks in future, it wouldn't be the first time a supermarket had done so in Australia. The IGA in the inner Brisbane suburb of Greenslopes shut down its self-serve checkouts last year, with a sign citing a \"significant increase in shoplifting\" as the reason behind the move.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhile Woolworths and Coles haven't yet gone as far as doing the same, each has rolled out several anti-theft initiatives in recent years in response to what both describe as soaring levels of theft.\n\nIn Australia, QUT retail expert Gary Mortimer said shoplifting was costing retailers about $9 billion each year, and was impacting all kinds of businesses.\n\n\"It's unsurprising to see more and more retailers implementing technology to reduce crime,\" he had earlier told Yahoo. \"Retail theft can happen anywhere within a store, at the self-service area, or in quiet locations around the perimeters of a store.\"\n\nThe US scale-back comes after other major American retailers, such as Walmart and Dollar General, also removed large numbers of self-checkouts, as well as the UK grocery chain Booths.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/difference-between-hot-sweat-cold-011718463.html",
        "title": "What’s the difference between hot sweat and cold sweat?",
        "publish_date": "2025-10-08T01:17:18Z",
        "category": "lifestyle",
        "authors": [],
        "text": "Imagine two scenarios. In the first, you’re hiking uphill on a warm day, beads of sweat rolling down your forehead. In the second, you’ve just remembered you have an exam tomorrow and now the palms of your hands are cold and damp.\n\nBoth involve sweating but the causes and implications are different.\n\nOne scenario produces hot sweat, the other cold sweat. So what’s the difference?\n\nWhat is hot sweat?\n\nThis type of sweat is also called thermoregulatory sweat. It’s the body’s natural response to increased core body temperature, which most often comes from physical exertion. As sweat evaporates from the skin, it cools down the body to help prevent overheating.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhen you’ve been exercising, or are outside on a hot day, your body warms up, then sends a message to the hypothalamus region of your brain.\n\nYour hypothalamus likes to keep your body in an optimum temperature range. So to reduce heat stress it sends signals down the spinal cord and into peripheral nerves (nerves outside the spinal cord and brain). This stimulates secretion of sweat from the eccrine glands in your skin.\n\nHumans have millions of eccrine glands, which are packed at a density of 250–550 glands per square centimetre on the palms of the hands and soles of the feet. Places where you have hair (such as the face, trunk and limbs) have a lower density of eccrine glands.\n\nSweat from eccrine glands is mostly water and salt.\n\nWhat is cold sweat?\n\nCold sweat is also called psychological sweat. It appears when you’re experiencing stress, anxiety, fear or pain.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThese activate the amygdala, the brain region that helps you feel and respond to emotions. The amygdala then activates the hypothalamus.\n\nThe hypothalamus performs multiple functions simultaneously. It sends signals down the spinal cord and into peripheral nerves to stimulate eccrine glands in the skin.\n\nIt also sends a message to the adrenal glands sitting above the kidneys to release norepinephrine (also called noradrenaline) and epinephrine (adrenaline) hormones. These hormones travel through the blood and affect a different type of sweat gland in the skin, the apocrine glands.\n\nApocrine glands are mainly in the armpit, breasts, face and perineum (where the external genitalia are). Sweat from apocrine glands contains lots of lipids (fats), proteins, sugar and ammonia.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAs cold sweat triggers eccrine and apocrine glands, you can sweat all over your body.\n\nWhich type smells more?\n\nSweat itself – whether hot or cold – does not smell. But when bacteria on your skin feed on sweat, this produces volatile organic compounds. And it’s these that smell. Blame bacteria such as Corynebacterium, Staphyloccocus and Cutibacterium.\n\nA small study from Japan showed stress, not exercise, triggered unpleasant body odours in people who normally don’t have body odour.\n\nThat’s probably because bacteria prefer the cold sweat from apocrine glands. It’s a tasty meal, full of fat, protein and sugars.\n\nAnother study analysed the results of 26 earlier studies involving 1,652 people. This showed that when we’re frightened, we give off specific smells via our sweat.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSo yes, fear and stress really do have a distinctive smell that should warn others to stay away.\n\nIn a nutshell\n\nThe terms hot and cold sweat don’t refer to the temperature of the sweat itself. The fluid released is always at body temperature.\n\nProducing hot sweat is normal and an effective way for your body to lose heat. Cold sweat signals to others that you’re distressed in some way.\n\nIf you’re concerned about your sweating, see your GP. This is especially important if you start sweating more, less, or differently on either side of your body, without changing your lifestyle.\n\nThis article is republished from The Conversation. It was written by: Amanda Meyer, James Cook University and Monika Zimanyi, James Cook University\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nRead more:\n\n\n\nAmanda Meyer is affiliated with the American Association for Anatomy and the Global Neuroanatomy Network.\n\nMonika Zimanyi does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
        "source": "Yahoo"
    }
]