[
    {
        "url": "https://www.9news.com.au/finance/australia-money-health-insurance-extras-disappear/cc141f2b-167e-41e9-bdef-bf99789672ee",
        "title": "Why millions of Aussies could lose thousands by the end of the year",
        "publish_date": "Sun, 30 Nov 2025 21:03:38 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "This means 15 million Aussies with health insurance only have a month to use up these extras, and a survey by\n\nMoney.com.au\n\nrevealed up to 40 per cent of Aussies didn't even realise they have unclaimed extras that could disappear by the end of this month.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/government-to-unveil-defence-department-overhaul/106086340",
        "title": "Government set to overhaul defence department amid delays, blowouts",
        "publish_date": "Mon, 01 Dec 2025 02:12:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government is about to unveil a sweeping overhaul of the defence department as it struggles to fight cost blowouts and major project delays while ramping up spending on the military.\n\nThe government has long flagged the restructure, with Defence Minister Richard Marles criticising the department's performance in June, declaring \"everything was on the table\" when it came to reform.\n\nThe ABC has confirmed that three groups within Defence — the Capability Acquisition and Sustainment Group, the Naval Shipbuilding and Sustainment Group and the Guided Weapons and Explosive Ordnance Group — are set to be rolled into one entity.\n\nDefence must get better at managing big, expensive projects, chief says As AUKUS looms, Admiral David Johnston told the ABC his organisation needs to manage money better.\n\nIt is not yet clear if any senior defence department officials or ADF top brass will be axed, or whether positions will be abolished through natural attrition because of the restructure.\n\nBut the government has repeatedly made it clear that it wants more \"accountability\" from top defence officials when it comes to delivering sophisticated military capabilities and platforms, with Defence Industry Minister Pat Conroy flagging last week the government would make new announcements \"shortly\".\n\nIn June, Mr Marles bemoaned that there were \"28 different projects running a combined 97 years over time\" when Labor first came to office.\n\n\"Now that did represent a failure of leadership on the part of the former Coalition in government, but it also says something about the challenge which is in front of us now to ensure that the defence establishment is fit for purpose to achieve this delivery outcome,\" he said.\n\nDefence currently has a budget of almost $60 billion a year but that figure is set to rise to about $100 billion annually by 2034 as China continues to rapidly build up its military and the Trump administration presses allies such as Australia to ramp up defence spending.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/traditional-healers-of-central-australia-ngangka%E1%B9%9Fi-book/106044308",
        "title": "Aboriginal healers seek to share power of 'open hands' with Western doctors",
        "publish_date": "Mon, 01 Dec 2025 01:55:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Josephine Mick wrapped her fingers around the wrist of her interpreter, gently demonstrating a traditional ngangkaṟi healing technique to draw out illness.\n\nSpeaking in fluent Pitjantjatjarra interpreted to English, she explained her hands were like a magnet.\n\n\"Ngangkaṟi has what we call literally an opening, open hands, and using that hand they place it on the person,\" she said.\n\nJosephine Mick played a key role in bringing ngangkaṟi together to share their knowledge. (Supplied: Rhett Hammerton)\n\n\" The poison or toxins, or whatever the bad thing is inside [the person] that's causing them illness, is drawn out by that ngangkaṟi's hand. \"\n\nNgangkaṟiis a word for traditional Aboriginal healers in the Ngaanyatjarra, Pitjantjatjara and Yankunytjatjara (NPY) lands of the Central Australian desert.\n\nMen, women, children and even babies can be ngangkaṟi, but it's not known exactly how many there are.\n\nMs Mick said people in communities know who the ngangkaṟi were, because they watched who gave treatment and who had powers.\n\n\"A western doctor has training and they might do a lot of their training by reading textbooks and things like that, but a ngangkaṟi learns by actually doing it, it's in their spirit,\" she said.\n\n\"It's working really closely with the spirit and spiritual wellbeing.\"\n\nSome ngangkaṟi performed an inma, or dance, for the launch of the book's second edition. (Supplied: Rhett Hammerton)\n\nPrimary source of information\n\nThe firsthand accounts of about 30 traditional healers, including Ms Mick, have been recorded in the second edition of Traditional Healers of Central Australia: Ngangkaṟi.\n\nThe NPY Women's Council launched the book in November.\n\nThe second edition of Traditional Healers of Central Australia: Ngangkaṟi was launched in November. (ABC Alice Springs: Victoria Ellis)\n\nThe first edition of the book, published in 2013, sold more than 17,000 copies worldwide, according to NPY ngangkaṟi program manager Angela Lynch.\n\n\"[The ngangkaṟi] wanted to be treated as equals with the Western-trained doctors and nurses, and they really wanted people to know how much work they do and how much help they give,\" she said.\n\n\"They decided the best way to do it was to educate the workers in the Western health system about what ngangkari's do and that's where the idea for the book came from.\"\n\nAngela Lynch says the ngangkaṟi wanted to write a book to show people their role in Aboriginal health. (Supplied: Rhett Hammerton)\n\nThe NPY Women's Council recorded the stories of a number of ngangkaṟi and their answers were translated to English for the book.\n\n\"They said it and we translated it directly — we didn't shape it in any other way,\" Ms Lynch said.\n\n\"They made it very clear that they wanted to speak about ngangkaṟi work in their own way or in their own voices.\n\n\" They didn't want someone talking about them, they wanted to talk about it themselves, so it's a primary source or document. \"\n\nThe second edition of Traditional Healers of Central Australia: Ngangkaṟi was launched in November. (Supplied: Rhett Hammerton)\n\nWestern medicine and ngangkaṟi working together\n\nThe book recorded traditional Aboriginal culture and history, but Ms Mick said the stories also showed people how ngangkaṟis worked.\n\n\"For people who are suffering from ill health, they can see that there is hope in being treated in this way,\" she said.\n\n\"There's a lot of doctors who know about their craft … (but) they want to know about what our skills are and how we do treatments as well.\"\n\nNgangkaṟi want to work collaboratively with Western medicine, according to Josphine Mick. (Supplied: Rhett Hammerton)\n\nThe burden of disease for Aboriginal and Torres Strait Islander people is more than double that of non-Indigenous Australians, but Ms Mick said together Western medicine and traditional healing could improve Indigenous health outcomes.\n\nMs Lynch said the ngangkaṟis wanted \"to see the Western health system and ngangkari working together in a collaborative way\".\n\nNgangkaṟi Iluwanti Ken addressing guests at the launch. (Supplied: Rhett Hammerton)\n\nTradition staying alive\n\nThe ngangkaṟi program has been running for 27 years.\n\nMs Lynch said it was one of the few programs in Australia that supported traditional healing.\n\n\"It's only lasted that long because the ngangkaris have run it their own way,\" she said.\n\nJosephine Mick played a key role in bringing ngangkaṟi together to share their knowledge. (Supplied: Rhett Hammerton)\n\nMs Mick said she was glad to see the ancient traditions continued in the next generation.\n\n\"It just makes me so happy to see the strength of the women's council now and to see all the young people, our descendants, coming through and taking on the roles that we and others used to do in the past,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/south-east-queensland-population-growth-2032-olympics/106085290",
        "title": "Brisbane property prices rise by almost 13pc in 12 months as population booms",
        "publish_date": "Mon, 01 Dec 2025 01:17:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "South-east Queensland's population is set to reach 4.5 million by the time Brisbane hosts the 2032 Olympics, new analysis shows, despite rising property prices driven by a lack of supply.\n\nAnalysis of Australian Bureau of Statics data by KPMG reveals the population in the south-east corner has grown by as much as 2.2 per cent over the past five years, above the national average of 1.5 per cent.\n\n\"You've got people coming from expensive Sydney or dreary Melbourne or those small cities around the country, and also it's pulling people from places like Darwin and Cairns,\" KPMG urban economist Terry Rawnsley said.\n\nThe analysis forecasts the south-east Queensland population will be as high as five million by 2036.\n\nNew report details Brisbane economic boom The economy has tipped over $200b as population and employment continues to grow.\n\nBut not everyone is flocking to Brisbane, with more than half of the growth happening outside the state capital.\n\nIn the last five years, 68,000 new residents called the Gold Coast home, 61,000 in Logan and Beaudesert, 51,600 in Ipswich, and 47,500 more on the Sunshine Coast.\n\n\"What we are seeing in Brisbane over a long time is the inner-city suburbs have got more and more expensive, and more and more people are being pushed out to those growth areas in Ipswich and Logan,\" Mr Rawnsley said.\n\nTrinity and James McNicol have moved from Brisbane to Ipswich with space for horses and a larger house.\n\nTrinity and James McNicol made the move from the Brisbane suburb of Newmarket to Purga in Ipswich in 2021, swapping a small Queenslander for a four-bedroom house and 100 acres of farm land for a comparable price.\n\n\"We can combine what we love outside of work, still have our jobs in the city with a reasonable commute distance, but have a bit more space,\" she said.\n\n\"You have got everything at your fingertips. It is the perfect combination of having the space, the lifestyle, a bit more peace and quiet, but still having absolutely everything you need.\"\n\nInterstate migration is also driving unprecedented growth, with more than 22,000 people moving to the south-east from other cities.\n\nHowever, Mr Rawnsley said the flow of people moving from Sydney to Brisbane had started to slow over the last three years as Queensland's property prices caught up.\n\nBrisbane prices rise by almost 13pc in 12 months\n\nData from Cotality reveals unit prices in Brisbane rose by 2.2 per cent in November and house prices grew by 1.8 per cent, while property prices rose 12.8 per cent in 12 months.\n\nThe city's median home value has reached $1,015,767, which is the second highest in the country behind Sydney.\n\nHead of research Eliza Owen said the price growth was partly due to affordability and investor demand, as well as low supply levels.\n\n\"Unit values are up by about 5 per cent in the past 12 months against an 8 per cent increase in house values, so that tells us that Brisbane is a bit unique,\" she said.\n\n\"Maybe with more buyers looking to the unit market because they can get more for their money in terms of location.\"\n\nEleanor Creagh says property prices will continue to rise but at a slower rate. (Supplied)\n\nREA Group senior economist Eleanor Creagh said while prices were continuing to rise, the \"silver lining\" for those trying to buy a house was that the pace of growth was no longer accelerating relative to the same time last year.\n\n\"The supply of new housing is certainly not keeping up with the demand at the moment,\" she said.\n\n\"As a result, we are seeing that those fundamental drivers remain in play with continued upward pressure on home prices.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/loreto-college-bus-crash-brett-russell-trial-sentencing/106085408",
        "title": "Truck driver who crashed into Victorian school bus jailed",
        "publish_date": "Mon, 01 Dec 2025 00:39:22 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A truck driver who crashed into the back of a Victorian school bus and severely injured students on board has been sentenced to 12 years and 9 months in jail.\n\nThe court heard Brett Russell was towing two heavily loaded trailers east along the Western Freeway as it approached Bacchus Marsh, a town north-west of Melbourne, about 3.15am on September 21, 2022.\n\nWith the road wet from rain, Russell reached a steep descent in the road where traffic was backed up due to roadworks, and the speed limit had been reduced from 110kph to 40kph.\n\nKnowing the brakes on his truck and trailers were defective and that he was unable to stop, Russell attempted to manoeuvre around the traffic at high speed.\n\nInstead, the truck careened into the back of a school bus, pushing it through a roadside barrier and down an embankment, where it rolled onto its passenger side.\n\nThe bus was forced through a guardrail and plunged 50 metres down an embankment before rolling onto its side. (ABC News)\n\nLife-changing injuries sustained by students\n\nInside the bus were students from Loreto College Ballarat, who had departed their school in the early hours of the morning for a school trip.\n\nBrett Russell, now aged 63, pleaded guilty to 12 charges, including 10 counts of negligent driving causing serious injury.\n\nDuring the trial, prosecutors listed the injuries sustained by students in the crash, including broken bones, cognitive impairment, lacerated organs, post-traumatic stress disorder and long-term back and neck issues.\n\nAmong the most severely injured was a student, aged 15 at the time, who had to undergo a life-altering surgery.\n\nMany of the students involved in the crash, some of whom sustained severe injuries, provided victim impact statements during the trial.\n\n\"The accident has changed our lives in ways we will never fully understand,\" one victim's family told the court in their victim impact statement.\n\nAnother student, who suffered multiple bone fractures requiring surgeries, said her injuries continued to \"haunt my body every day\".\n\nDriver knew brakes were faulty\n\nThe court heard that Russell was well aware that his brakes were faulty after conversations with his workplace, and had tried testing them during the drive.\n\nWhen asked by investigators following the crash why he decided to drive despite knowing the brakes were faulty, Russell replied, \"I thought, I'll still be right.\"\n\nWhen asked what motivated him to make the trip, Russell told investigators he was \"trying to do the right thing\".\n\n\"Every night in hospital, I've thought about this. It's the only thing I can honestly say,\" he told investigators.\n\n\"The right thing, I know now, would have been not to drive the trailers.\"\n\nThe truck Brett Russell was driving eventually came to rest 400 metres from the site of the crash. (ABC News)\n\nJudge Michael O'Connell noted Russell's remorse, co-operation with investigators, and significant personal injuries sustained in the crash including a full hip replacement.\n\nHowever, he said the sentence he handed down reflected the gravity of the crimes, and the impact on the victims.\n\nRussell has already spent 230 days in pre-sentence detention, and faces a non-parole period of eight years.\n\nBorn in New Zealand, Russell will be deported upon his release.\n\nThree year saga draws to a close for students and families\n\nLoreto College principal Michelle Brodrick was one of several people connected to the school who attended the County Court on Monday to watch the sentencing.\n\nDuring the sentencing, Judge O'Connell acknowledged the immense strain on Ms Brodrick, as one of the main representatives for the victims and their families.\n\n\"[Ms Brodrick] has been the person who has had the ultimate responsibility over these last three years, to listen, to relive and to care for those involved. That has been a lot to bear,\" he said.\n\nWhen leaving court, Ms Brodrick told reporters it was an emotional and strange end to the incident.\n\n\"It's a been a long process, it's been over three years and I'm glad now that our families and our students can move on,\" she said.\n\n\"I think it will stay with me for a very long time.\"\n\nMichelle Brodrick is the principal at Loreto College in Ballarat. (ABC News)\n\nShe said the last of the students involved in the crash had now graduated Year 12, and were moving on to their next chapter in life.\n\nMs Brodrick also acknowledged the remorse of Russell following the crash.\n\n\"I do know that it's really important that truck drivers do take responsibility, and I was really glad that Brett Russell did take responsibility for what he had done from the very beginning,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/how-councils-are-preparing-for-wind-farms-renewables-boom/106073420",
        "title": "Councils in wind farm information race as shift to renewables ramps up",
        "publish_date": "Mon, 01 Dec 2025 00:30:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Councils are in a race to educate themselves about wind farms as more large-scale projects are set for Australian soil.\n\nPlans for projects worth billions of dollars have been lodged in regional Western Australia, leaving local governments \"working overtime\" to understand what the future looks like for their communities.\n\nOne leader in the Wheatbelt said working to better understand renewables was taking up most of her time.\n\nRegional councils are weighing up projects worth billions of dollars. (ABC: Stuart Stansfield)\n\nWA 'a number of years behind'\n\nAbout 150 kilometres north east of Perth, the rural shire of Victoria Plains is home to 800 people.\n\nGreen Wind Renewables and Aula Energy are in the early stages of developing four large-scale wind farms expected to cost about $5 billion, two of which are in the shire of Victoria Plains.\n\nRecently, Victoria Plains shire president Pauline Bantock was part of a state-government-funded taskforce learning more about renewables at a regional leaders summit in New South Wales.\n\n\"We noticed the timeline of this [renewable energy] transition is different right across Australia … and WA does seem to be a number of years behind,\" she said.\n\nPauline Bantock attended a Regional Leaders Summit in Newcastle as part of a state government funded taskforce. (Supplied: Pauline Bantock)\n\nMs Bantock said other state governments offered greater support to regional councils, such as ensuring shires had more staff for project developers liaison.\n\n\"[Our CEO] understands what's ahead, but it is consuming a heck of a lot of time of our senior management,\" she said.\n\n\"We'd like the state government to connect with the federal government … and resource the local governments so that we can help with this transition and end up in the best possible solution.\n\n\" It's a daunting process. This is new, and when communities are faced with change, it often makes us all feel a bit nervous. \"\n\nCarnamah in WA's Midwest has been highlighted as an ideal spot for wind farms due to the wind quality. (ABC News: Chloe Henville)\n\n'Once in a lifetime reshaping'\n\nThe WA Local Government Association (WALGA) has worked with the state government and shires to draft a Community Benefits Scheme to create safeguards for councils.\n\nWALGA president Karen Chappel said across WA, local governments were experiencing a \"once-in-a-lifetime reshaping\" with many challenges to consider.\n\n\"There will be housing pressures, impacts on roads and infrastructure, and workforce challenges,\" Ms Chappel said.\n\nKaren Chappel says renewables has been a key focus this year. (ABC News: Jack Stevenson)\n\nShe said the state government's final community benefits guideline, yet to be published, would hopefully document how proponents would give back to communities.\n\n\"We're supporting a lot of local governments to ensure they have the right framework to know they're following the right process in dealing with these applications,\" Ms Chappel said.\n\nThe state government department Powering WA was also established to support councils with their needs throughout the transition.\n\nMs Chappel said renewable energy was a key focus of WALGA, and it would advocate for local governments to rate large-scale renewable energy facilities.\n\n\"Rating will enable local governments to cover the costs of impacts on road and infrastructure,\" she said.\n\n\"It's critical local government, industry and community all work together ensuring everyone comes along on this journey.\"\n\nBenefits for communities\n\nThe shire of Carnamah, about 285km north east of Perth, and home to 600 people, is the proposed site for what could become the state's largest wind farm.\n\nThe $4.5 billion Tathra wind farm would see development of up to 140 turbines, with a capacity of about 1,000 megawatts.\n\nShire chief executive Stuart Taylor said it could boost the local economy and bring new workers to town.\n\nStuart Taylor says most of the community is positive about the benefits large scale projects could bring. (ABC Midwest Wheatbelt: Piper Duffy)\n\n\"We could potentially have a thriving opportunity to develop businesses, and for families to come to Carnamah and be a support for the industry,\" Mr Taylor said.\n\n\" There's a really good opportunity for local government and community to set something up that benefits the whole community. \"\n\nSmall regional shires in WA are seeing a growing number of large scale proposals. (ABC Midwest Wheatbelt: Chloe Henville)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/tennis-emerson-jones-james-duckworth-aus-open-wildcards/106085686",
        "title": "Jones thrilled with 'nice bonus' after netting Aus Open wildcard",
        "publish_date": "Mon, 01 Dec 2025 00:10:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Emerging star Emerson Jones and veteran James Duckworth have earned wildcards into next month's Australian Open main draw.\n\nThe pair enjoyed stand-out performances across the new-look Australian Pro Tour Wildcard Points Race held in Brisbane, Sydney and Adelaide in November.\n\nJones, the number three seed in Playford, secured the women's AO wildcard after a consistent three-week campaign that included a finals appearance in Sydney and a win in South Australia.\n\nKyrgios's Australian Open wildcard bid heats up with Kooyong entry Nick Kyrgios's Australian Open wildcard campaign is on in earnest after the former Wimbledon runner-up was announced in the Kooyong Classic exhibition field.\n\nAt just 17 years of age, the Queenslander becomes one of the youngest Australians to earn an Open main-draw wildcard.\n\nReflecting on the level of competition across the three events, Jones said the battle for top spot remained wide open until the final week.\n\n\"No-one really knew who was going to win it,'' she said.\n\n\"It was a bit up and down. I was just trying to win the tournament, but this is definitely a nice bonus.\"\n\nAfter sealing Australia's path through to next year's Billie Jean King Cup qualifiers with a key role in last month's play-offs in Hobart, Jones cannot wait to experience another Australian Open.\n\nABC Sport will live blog every day of the 2026 Australian Open from January 18-31.\n\nThe teenage sensation debuted last year after becoming Australia's first female world number one junior since Jelena Dokic in 1998.\n\n\"It feels great. I'm going to have such a great time playing it and I'm really excited,\" Jones said.\n\n\"I played it last year and it was so fun. It was such a great experience for me to get to know the level.\"\n\nOn the men's side, top-seeded Duckworth secured his wildcard after emerging as the leading Australian performer across the three-week race.\n\nJames Duckworth has a chance to continue his career via a wildcard for next month's Australian Open. (Getty Images: Zhizhao Wu)\n\nThe 33-year-old capped off a strong swing with his ranking rising to world number 87, earning his return to the AO main draw after narrowly missing direct entry.\n\n\"I'm really excited to be back playing the main draw of the Australian Open,\" Duckworth said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It was nice to secure a spot through this great new initiative from Tennis Australia in those last three weeks.\n\n\"It's my favourite tournament by far in the world. The home crowd support is unreal at Melbourne Park.\n\n\"I get to play in front of friends and family and I'm really looking forward to all the support, and I can't wait to get out there.\"\n\nOther Open wildcard recipients so far are China's Yunchaokete Bu and Kazakhstan's Zarina Diyas, who earned the Asia Pacific entries, and Americans Patrick Kypson and Elizabeth Mandlik, who qualified under Tennis Australia's reciprocal arrangement with the USTA.\n\nNick Kyrgios will be a frontline contender for a wildcard if he gets through a series of exhibition matches this month in the US and Dubai.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/how-to-ward-off-bad-weather-on-your-wedding-day/106055572",
        "title": "Bridal parties employ witches and bury sausages hoping for good weather",
        "publish_date": "Mon, 01 Dec 2025 00:02:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Engaged Australian couples nervous about their wedding day are resorting to superstitious acts to ward off wet and windy weather.\n\nOne of the acts includes burying a sausage in your garden in the lead-up to your special day, a European superstition that has gained traction in Australia thanks to social media.\n\nLoading...\n\nWhy bury a snag?\n\nThe exact origin of burying a sausage in an attempt to control the weather is not exactly clear.\n\nSome have linked the ritual to the United Kingdom and central Europe.\n\nThe rules of the burial are similarly vague; some say a raw sausage is required, others opt for cooked.\n\nThe type of sausage also appears to have no bearing on the protein's ability to impact meteorological conditions.\n\nA last resort\n\nNewlyweds Jack and Jess Luxton buried a sausage with their bridal party the night before their wedding.\n\nIt was in an attempt to thwart a torrential storm destined for their Adelaide Hills ceremony.\n\n\"One of my friends sent me a couple of TikToks and asked me if I'd heard about the trend, which I hadn't at the time,\" Ms Luxton said.\n\n\"We thought it was so funny, we had to do it.\n\n\"As we got closer and closer to the wedding, the weather forecast got worse and worse.\"\n\nJack and Jess Luxton's wedding day became the fifth wettest day of the year in the area. (Supplied: Luke John Photography)\n\nThe group ended up burying a raw sausage and then stood in a circle and chanted \"rain away\" in the style of a similarly-named Enya song.\n\n\"We eventually got to the point where we're like, well, we'll try anything,\" Mr Luxton said.\n\n\"We'd thought it's not going to work, but if we don't do this, we'll always be wondering what if we'd just buried the sausage?\"\n\nThe Luxtons had a beautiful wedding, despite the rain. (Supplied: Luke John Photography)\n\nUnfortunately for the couple, their plans for sunny skies hit a snag, and 22.2 millimetres of rain fell on their wedding day.\n\nPaying an Etsy witch\n\nNot to be outdone in their ambitions, other bridal parties have opted for an online option to keep the wild weather at bay.\n\nMany have sought out the powers of Etsy witches.\n\nThe website Etsy allows people to ask witches to cast a spell for favourable weather. (Supplied: Etsy.com)\n\nIt is a service where people pay others on the website etsy.com to cast a spell for them, for good or perfect wedding day weather.\n\nKira Larkin said her sister-in-law grew increasingly concerned about wind in the lead-up to her wedding day, and in desperation, paid an Etsy witch $32.\n\n\"For the week leading up, she was checking the weather every day, every couple of hours, and I think it was two or three days before the wedding when she reached out,\" Ms Larkin said.\n\n\"We were going to do the burying of the sausage, we'd heard about that.\n\n\"But when she told us that she'd paid for the Etsy witch, we were like, oh, there's no point in burying the sausage then.\"\n\nThe Etsy witch sent a personalised message after the good weather spell was cast. (Supplied: Etsy.com)\n\nMs Larkin's sister-in-law received a message from the Californian-based witch, telling her the necessary preparations had been made.\n\nMs Larkin said the spell worked, and her wedding \"wasn't that windy\".\n\nNo surprises for celebrant\n\nPam Nelson has been a celebrant for more than 15 years and officiated close to 600 weddings.\n\nShe said both Etsy witches and burying the sausage were things she had heard of recently, and expected they would come to Australia after becoming popular overseas.\n\n\"Look, social media has a lot to answer for,\" Ms Nelson said.\n\nPam Nelson says social media has a lot to answer for, and nothing surprises her anymore. (Supplied: Miss Moody Photography)\n\n\"Anything goes now, there's no real rules other than the stuff that's in the legislation, and the 100 to 150 legal words.\"\n\nWhile she has enjoyed officiating quirky weddings, including when a pet ferret accompanied a bride in her walk down the aisle, she has noticed a rise in pop culture and social media references.\n\n\"Nothing surprises me anymore,\" she said.\n\n\"I've got dressed up in Star Wars outfits, I've done a nude wedding. I wasn't naked, but everyone else was.\"\n\nShe said increasingly common trends include the Married At First Sight turnaround moment, the Ellen selfie, leaving empty seats for deceased loved ones, and switching the positions of the bridesmaids, groomsmen, and even which side the couple's family and friends sit on.\n\nMs Nelson said many couples no longer abide by the tradition for the groom not to look at the bride before the ceremony, and many are stepping away from having a father walk the bride down the aisle.\n\n\"People need to pick a trend based on their preference and their interests, and if it makes sense. Because a lot of trends don't make any sense at all,\" she said.\n\n\"I'm happy to go along with anything as long as both in the couple are happy with it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/world-athletics-awards-nicola-olyslagers-bruce-mcavaney/106085566",
        "title": "Olyslagers and broadcast legend McAvaney honoured at World Athletics Awards",
        "publish_date": "Sun, 30 Nov 2025 23:54:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "High jumper Nicola Olyslagers has become only the second Australian athlete to be honoured at the World Athletics Awards.\n\nLegendary Australian broadcaster Bruce McAvaney has also been recognised for his contribution to athletics.\n\nOlyslagers was named the female field athlete of the year at a gala event in Monaco.\n\nThe award capped off a superb 2025 season in which Olyslagers won the women's high jump at both the world outdoor and indoor championships.\n\nShe also lifted the Diamond League crown in Zurich, when she broke the national and Oceania record with a clearance of 2.04 metres.\n\nNicola Olyslagers pictured with her World Athletics award in Monaco. (Reuters: Manon Cruz)\n\nThe 28-year-old is the first Australian to be recognised at the annual awards since hurdler Sally Pearson was voted overall women's athlete of the year in 2011.\n\n\"When we were flying over to Monaco, I reflected in my journal of when I was 20 years of age,\" Olyslagers said.\n\n\"I was working in a cafe, washing dishes in the back, saving money to try and get some flights to compete internationally and I was so far away from being competitive.\n\n\"But in the back of that cafe, I would dream.\n\n\"I'd dream about places where I would try and compete if I could, and I would dream about what I would say to people if I could ever reach that level.\n\n\"Now standing eight years later on this stage and in front of each one of you, I want to say that it has sustained me back then in washing dishes and it's sustaining me now on top of the world.\"\n\nBruce McAvaney was recognised by World Athletics for his contribution to the sport. (AAP: Scott Barbour)\n\nMcAvaney, 72, was honoured with the President's Award, which recognises and honours exceptional service to athletics.\n\n\"His drive for knowledge, combined with the ability to recognise performance in a historical context … has led him to be acknowledged as one of Australia's greatest sports commentators,\" World Athletics president Sebastian Coe said.\n\nAccepting the honour, McAvaney said: \"To be honoured in this way, and by someone I have such enormous admiration for in Sebastian Coe, is truly one of the highlights of my career.\"\n\nSydney McLaughlin-Levrone of the United States was named women's world athlete of the year following a season that included her stunning victory in the 400m at September's world titles in Tokyo.\n\nMcLaughlin-Levrone, a two-time Olympic 400m hurdles champion, was also voted women's track athlete of the year.\n\nSwedish pole vault great Mondo Duplantis was named men's world athlete of the year, while also taking out the men's field events award.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/coldest-december-1-day-in-victoria-since-1996/106085336",
        "title": "Victoria shivers through coldest start to summer in almost 30 years",
        "publish_date": "Sun, 30 Nov 2025 23:05:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Melburnians are shivering through what is forecast to be the coldest summer day in nearly 30 years, while there is snow in Victoria's Alpine region as a cold snap hits the state.\n\nThe Bureau of Meteorology (BOM) said maximum temperatures across Victoria today would be 8 to 12 degrees Celsius below the December average.\n\nDuty forecaster Michael Ephron said today's high of 15C would be Melbourne's coldest start to summer since 1996, and it would feel colder thanks to the wind chill.\n\n\"That wind from the south-west can be quite strong and gusty at times. It will actually make the 'feels like' temperature around 8 or 9 degrees for much of the day,\" he said.\n\n\"For those Alpine centres, we're looking at top temperatures of around 1 or 2 degrees in places like Mt Baw Baw, Falls Creek, Bulla and Mt Hotham.\n\n\" A wintry blast for the first day of summer. \"\n\nThe BOM said snow could fall as low as 1,100 metres in Alpine areas.\n\nIn addition to the cold weather, there will be extensive showers in southern and mountain areas and the risk of thunderstorms.\n\nThe good news for those who like summer to feel like summer is that it is forecast to be a short-lived cold snap, with showers easing on Tuesday and temperatures rising to 29C on Wednesday and 32C on Thursday.\n\nA blanket of snow fell on Mt Buller in Victoria's Alpine region. (Supplied: Mt Buller Alpine Resort)\n\n\"We are expecting a return to more normal conditions as we head into the rest of December and through into next year as well,\" Mr Ephron said.\n\n\"We are likely to see maximum temperatures during summer a little bit above average and also a slightly increased chance of wetter conditions as well.\n\n\" We're certainly not expecting to see these wintry conditions continuing throughout the rest of the season. \"\n\nMelburnians were rugged up on Monday morning as summer got off to a cold start. (ABC News)\n\nThe cold start to the day took some people walking the streets of Melbourne by surprise.\n\n\"It's my first time in Melbourne and I was not expecting this cold weather,\" one man said.\n\nA woman visiting from Western Australia said the frosty weather was not a great advertisement for Victoria.\n\n\"It's way too cold for an Australian summer. We're going back to where it's warm tomorrow, back to Perth,\" she said.\n\nThe BOM also said Victoria experienced its wettest November since 1992, recording 128 millimetres of rainfall.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/energy-grid-not-ready-eraring-coal-aemo/106085200",
        "title": "Energy grid not ready for Eraring coal plant's closure, AEMO says",
        "publish_date": "Sun, 30 Nov 2025 21:35:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "The energy grid is not ready for the closure of the Eraring coal plant, the energy operator has warned, raising the threat of widespread blackouts in eastern Australia.\n\nThe Hunter Valley coal plant's life had already been extended from a planned closure of 2025 to 2027, at a cost to taxpayers of up to $225 million a year.\n\nThe Australian Energy Market Operator (AEMO) has warned, however, that while there are enough renewables in the pipeline to cover its closure, supporting infrastructure to keep the grid stable is not expected to be ready.\n\n\"Coal-fired power stations are retiring, and this is not new news. Ten have retired since 2012, and the remaining fleet are getting old,\" AEMO chief executive Daniel Westerman told AM.\n\n\"[And] there are 4 million homes out there with rooftop solar that have been the driving force of the energy transition. Sometimes the flood of that power from rooftops can create a bit of a challenge for how the system operates.\n\n\"We need to make sure that the grid has a steady heartbeat.\"\n\nMr Westerman said AEMO had been warning of the need for investment into infrastructure to stabilise the grid since 2021.\n\nThe flood of daytime power from rooftop solar poses a risk to the grid without supporting infrastructure. (ABC News: Matt Roberts)\n\nBut he said necessary technology like synchronous condensers, which help to absorb reactive power and keep the grid stable, is not due to be installed until after Eraring's closure.\n\nWithout them, there is a risk of system failures that, while deemed low probability, could have \"cascading\" impacts.\n\n\"The period of infrastructure renewal and technology change in the [National Energy Market] presents a heightened risk profile for system security,\" the report reads.\n\n\"AEMO may be forced to intervene to maintain system security at times when the market does not provide sufficient system security. These interventions may include contracts, directions and, if required, more severe measures.\n\n\"Such interventions may come at a considerable cost to consumers.\"\n\nHowever, Mr Westerman said the report laid out \"extreme events\", but the government, Origin Energy and Transgrid were working collaboratively to ensure there was no disruption to consumers.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/eight-ways-to-drink-less-during-christmas-party-season/106078790",
        "title": "Want to drink less this Christmas? You don't have to rely on willpower alone",
        "publish_date": "Sun, 30 Nov 2025 21:05:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"We must have a drink before the end of the year!\"\n\nDecember is a perfect storm for anyone trying to cut back on drinking. Between end-of-year deadlines, work parties, family gatherings and school events, alcohol is suddenly everywhere.\n\nIt can make drinking feel not just normal, but expected.\n\nBut if you want to drink less (or not at all) this silly season, you don't have to rely on willpower alone. Having a plan can help.\n\nSome evidence suggests when goals are focused on how you'll approach something — such as a not-drinking strategy — rather than what you'll avoid (alcohol), it's easier to follow through.\n\nSo here are some simple strategies, backed by evidence.\n\n1. Make a plan\n\nWhen making decisions, our brains tend to prioritise immediate goals over long-term ones. Scientists call this \"present bias\". This means it's harder to keep your long-term goal (cutting back on alcohol) in mind when confronted by the chance for immediate gratification (having a drink).\n\nBut if you plan when you will and won't drink in advance, you reduce the need to make this decision in real time — when alcohol is in front of you, your willpower may be lower and you're more driven by emotion.\n\nLook ahead at your calendar and choose your drinking and non-drinking days deliberately. Committing to the plan ahead of time reduces the chance of opportunistic drinking when social pressure is high.\n\nTips for moderating your alcohol intake A recent poll shows 44 per cent of Australians who drink alcohol want to drink less or stop altogether. There are strategies to help.\n\n2. Track your drinks\n\nTracking when and how much you drink is one of the most effective and well-supported strategies for reducing alcohol use and staying motivated.\n\nYou may be surprised how much tracking alone can change your drinking, simply by being more mindful and helping you understand your patterns.\n\nIt doesn't matter how you do it — in an app, a notebook or even on your phone calendar. Writing it down is better than trying to remember. And doing it consistently works best. Aim to record drinks in real time if you can.\n\nThere are lots of free, evidence-based apps, such Drink Tracker, that can help you track your drinking and drink-free days.\n\n3. Try zero-alcohol drinks\n\nFor many people, the rise of alcohol-free beer, wine and spirits has made it much easier to enjoy the ritual of drinking at social events, without the intoxication.\n\nBut they're not for everyone — particularly those who find the look, smell and taste of alcohol triggering. Know yourself, see what works, and don't force it if it's not helping reach your goals.\n\n4. Slow the pace\n\nIf your aim is to cut back, try alternating each alcoholic drink with something non-alcoholic.\n\nWater is best, but zero, low or non-alcoholic drinks can still reduce how much you drink overall — and as a bonus, they can also help you stay hydrated, which may reduce the chance of a hangover.\n\nEating something healthy and filling before and during drinking is also a good idea. It prevents rapid spikes in blood alcohol levels, as well as slowing the absorption of alcohol into your system. This means your body has a better chance of metabolising the alcohol.\n\nEating well can also help calm the cravings for sugary, fried and salty foods that are often triggered by alcohol.\n\n5. Beware of an all-or-nothing approach\n\nDon't fall into the \"goal violation\" trap (sometimes called the abstinence violation effect). That's when slipping up makes you abandon your plan altogether.\n\nMaybe someone talks you into \"just a splash\" — or one drink somehow becomes five — and you tell yourself: \"Oh well, I've blown it now.\"\n\nBut a slip is just a slip — it doesn't mean you have to give up on your goals. You can reset straight away, at the next drink or the next day.\n\n6. Set up accountability\n\nLetting a friend or partner know that you are trying to drink less helps you stay accountable and provides support — even better if they join you.\n\n7. Have responses ready\n\nPeople may notice you're not drinking or are drinking less. They may offer you a drink. Try a simple \"I'm good\" or \"I'm pacing myself tonight\". Work out what feels OK to you — you don't need to give long explanations.\n\n8. Be kind to yourself\n\nWhen you're making a big change, it won't always go smoothly. What matters is how you respond if you slip up. Shame and guilt often lead to more drinking, while self-compassion supports longer-term behaviour change.\n\nInstead of seeing a slip as failure, treat it as information: What made it hard to stick to your goals? What could help next time?\n\nDecember doesn't have to derail your goals\n\nChange comes from consistent small steps, even during the busiest month of the year. Focus on developing a relationship with alcohol that you are in control of, not the other way around.\n\nIf you are trying to make changes to your drinking, talk to your GP or check out free evidence-based resources such as Hello Sunday Morning, SMART Recovery and the Alcohol and Other Drug Hotline.\n\nKatinka van de Ven is an alcohol and other drug specialist at UNSW Sydney and Nicole Lee is an adjunct professor at the National Drug Research Institute at Curtin University. This piece first appeared on The Conversation.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-01/opticomm-free-to-air-television-internet-outages/106018424",
        "title": "Thousands of Australians losing free-to-air TV access and facing internet issues",
        "publish_date": "Sun, 30 Nov 2025 20:59:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Leah Wray and her family moved into a new suburb on the outskirts of Darwin in 2023, she was sold on the promise of it being a \"smart community\" with top-of-the-line underground technology.\n\nBut two years later and Ms Wray says \"ultimately it was the opposite of that\", with reports of regular internet outages and recently, the loss of free-to-air television.\n\nAnd she's not alone, with tens of thousands of residents across Australia — typically living in greenfield suburbs — experiencing similar issues.\n\nLeah Wray lives in Bellamack, where private company Opticomm owns the fibre-optic network. (ABC News: Marcus Kennedy)\n\nDecommissioning free-to-air TV technology\n\nIn Ms Wray's suburb of Bellamack and in more than 500,000 other properties across Australia, the fibre-optic network is owned by a private company called Opticomm, as opposed to the publicly owned network most Australians are familiar with — the National Broadband Network (NBN).\n\nUnlike the NBN, Opticomm not only provides the infrastructure for internet connectivity, but also the technology for each home to receive free-to-air (FTA) television over the fibre-optic network.\n\nLeah Wray says the loss of free-to-air television is \"unbelievable\". (ABC News: Marcus Kennedy)\n\nHowever, in September, Opticomm sent a letter to a subset of their customers — about 10 per cent according to Opticomm — telling them that free-to-air television would \"no longer operate over our network\".\n\nThe letter advised residents to either transition to streaming services using free-to-air apps or investigate whether they could install an antenna — both at their own cost.\n\n\"We shouldn't have been required to have any other additional costs to get our free-to-air on,\" Ms Wray said.\n\n\" We bought into this suburb knowing we would have access to free-to-air television and then suddenly its gone. \"\n\nLeah Wray says not long after receiving Opticomm's letter she came to find her television could no longer access free-to-air channels. (ABC News: Marcus Kennedy)\n\nWhile Ms Wray was eventually able to install an antenna on her home's roof for about $600, the process is not that simple for everyone.\n\nApartment residents 'left in the lurch'\n\nMike Thomas who lives with his wife in a multi-storey retirement village in Yeronga, Brisbane also received the letter from Opticomm.\n\n\"The situation that they have presented us with is very poor, and it's just not good enough,\" Mr Thomas said.\n\n\"There's a lot of people who were really left in the lurch.\"\n\nMike Thomas says Opticomm's removal of free-to-air television has been a huge blow to residents, particularly at such short notice. (ABC News: Mark Leonardi)\n\nVillage Retirement Group general manager Ryan Knowles explained that as a multi-storey apartment building with senior residents, the options provided by Opticomm were not ideal.\n\nMr Knowles said installing an antenna would require the re-cabling of the entire apartment building at a huge cost.\n\n\"From people we've spoken to, it would be running into the couple hundred thousand dollars to re-cable it,\" Mr Knowles said.\n\nRyan Knowles says residents at two of his villages have lost access to free-to-air television over Opticomm's fibre-optic network. (ABC News: Mark Leonardi)\n\nAs for streaming apps, Mr Knowles noted that \"not everyone in our villages has the digital acumen to handle digital tv\".\n\nTo make matters worse, despite Opticomm's letter stating the decommissioning of free-to-air would begin on October 1 with a full-shut down on February 1 2026, most residents in Yeronga and another village lost access on September 27— the day of the AFL grand final.\n\n\"To lose that at the AFL grand final afternoon was very devastating and very upsetting for the majority of residents,\" Mr Thomas said.\n\nMike Thomas describes himself as an \"avid\" watcher of sport. (ABC News: Mark Leonardi)\n\nIn a statement, an Opticomm spokesperson told the ABC the \"equipment used to receive free-to-air television\" in these communities was \"reaching end-of-life\" and \"interfering\" with other upgrades to the network.\n\nThe spokesperson said Opticomm would \"extend the availability of FTA television services\" in the NT until July 1 2027, but did not respond to the ABC's questions about what would happen to customers who had already lost access and those outside the NT.\n\nIn a statement, the Australian Communications Media Authority (ACMA) confirmed that rules around statutory infrastructure providers (SIP) such as Opticomm did \"not apply\" to the supply of FTA television, which it said was \"ultimately a commercial matter\".\n\nRegular internet issues and limited regulations\n\nBoth Mr Thomas and Ms Wray said they had issues with Opticomm's internet services, from dealing with regular \"glitches\" and loading delays to waiting four months to be connected.\n\nDozens of customers have told the ABC they too have had issues with Opticomm, including regular and lengthy outages sometimes lasting from two days to two weeks.\n\nDozens of Opticomm customers told the ABC they have experienced significant issues with their internet. (ABC News: Randi Dahnial)\n\nAn Opticomm spokesperson said in the NT the company was \"actively investing in infrastructure to improve the resilience of the network\", but did not respond to the ABC's questions about whether it was doing the same in other parts of Australia.\n\nMany customers said they have complained to their internet service provider and the Telecommunications ombudsman, but with limited success.\n\nRMIT University associate professor in engineering Mark Gregory said because the current legislation did not include \"performance standards\" for infrastructure providers, including Opticomm, ultimately regulators had \"very limited powers\" when there were \"large numbers of outages\".\n\nDr Gregory said he believed that needed to change, and a September 2025 report from the Telecommunications Industry Ombudsman (TIO) showed he was not the only one.\n\nCynthia Gebert says Statutory Infrastructure Providers (SIP) should be held to service quality standards, just like internet service providers are. (Supplied: TIO)\n\nIn its report, the TIO called on the federal government to develop \"service quality standards\" for statutory infrastructure providers (SIP) \"as a matter of priority\".\n\nIn a statement to the ABC, Telecommunications Ombudsman Cynthia Gebert added: \"It's not enough for a statutory infrastructure provider to have obligations to a retailer – we need clear service quality standards consumers can rely on.\"\n\nThe ABC sent questions to Federal Minister for Communications Anika Wells, who did not respond by deadline.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/watch-the-official-trailer-for-stranger-things-season-5-20251201-p5njua.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Watch the official trailer for Stranger Things Season 5",
        "publish_date": "Mon, 01 Dec 2025 13:23:55 +1100",
        "category": "finance",
        "authors": [],
        "text": "Watch the official trailer for Stranger Things Season 5\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/out-of-the-zone-pokies-in-nsw-to-be-switched-off-in-danger-hours-20251201-p5njrv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Out of the zone’: Pokies in NSW to be switched off in danger hours",
        "publish_date": "Mon, 01 Dec 2025 13:20:45 +1100",
        "category": "finance",
        "authors": [
            "Alexandra Smith"
        ],
        "text": "Almost 700 pubs and clubs in NSW will be told to switch off their poker machines between 4 and 10am, ending a 20-year loophole that has allowed some venues to be pre-dawn gaming dens.\n\nHowever, it is unclear whether the NSW Labor government will change the legislation to permanently axe the exemption provisions, with an appeal process to remain in place.\n\nHundreds of clubs have pleaded financial hardship to enable their poker machines to stay operating in the mandated shutdown period. Credit: Flavio Brancaleone\n\nVenues claiming financial hardship or boosted tourism benefits have been able to apply for a shorter shutdown period than the mandatory 4 to 10am, and those that had pokies before 1997 can also be allowed different shutdown hours.\n\nMore than 670 venues have had varied shutdown periods over the past two decades, despite research showing the early hours of the morning to be the danger time for problem gamblers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/an-indoor-outdoor-bar-with-daily-happy-hour-prices-and-pizzas-until-3am-20251201-p5njt0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An indoor-outdoor bar with daily happy hour prices and pizzas until 3am",
        "publish_date": "Mon, 01 Dec 2025 13:15:42 +1100",
        "category": "finance",
        "authors": [],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nAt Franklin’s Bar in Thornbury, get $10 pints and $15 cocktails (almost) every day.\n\n1 / 9 Franklin’s Bar in Thornbury is found behind a warehouse-looking frontage. Supplied 2 / 9 Signature cocktails include the Franklin spritz, espresso martini and negronis are $15 at happy hour. Supplied 3 / 9 Sourdough pizzas by local bakery Billy Cart Bread Co. are served until closing time every day. Supplied 4 / 9 Head inside for cocktails, pizzas and DJ sets. Supplied 5 / 9 Vinyl DJs spin until late every Friday and Saturday. Supplied 6 / 9 Outdoor dining. Supplied 7 / 9 Cocktails at Franklin’s. Supplied 8 / 9 Outside the Thornbury venue. Supplied 9 / 9 There is space for 40 diners. Supplied Previous Slide Next Slide\n\nBar snacks$$$$\n\nThe warehouse frontage can look a bit foreboding, but it’s all smiles once you come inside and explore the indoor-outdoor spaces. The house cocktails are all about fun spins on classics − for example, the pandan colada which includes coconut-washed dark rum and toasted pineapple cordial.\n\nDrinkers need ballast: ciabatta-style sourdough pizzas by local bakery Billy Cart Bread Co. have classic toppings you can jazz up with hot sauce. Plus, they’re available right until closing time daily (that’s 3am on Fridays, Saturdays and Sundays!).\n\nGood to know: Late-night happy hour (including $10 pints and $15 cocktails) runs every Monday to Thursday from 8 to 10pm, while all-day happy hour prices extend from 4 to 10pm on Sundays.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/khawaja-on-the-importance-of-gratitude-20251201-p5njtq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Khawaja on the importance of gratitude",
        "publish_date": "Mon, 01 Dec 2025 12:45:04 +1100",
        "category": "finance",
        "authors": [],
        "text": "Khawaja on the importance of gratitude\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/roots-eye-catching-net-session-20251201-p5njtk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Root's eye-catching net session",
        "publish_date": "Mon, 01 Dec 2025 12:35:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "Root's eye-catching net session\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/outrageous-fireworks-display-cancels-dutch-league-game-20251201-p5njtl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Outrageous' fireworks display cancels Dutch league game",
        "publish_date": "Mon, 01 Dec 2025 12:34:47 +1100",
        "category": "sports",
        "authors": [],
        "text": "'Outrageous' fireworks display cancels Dutch league game\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-edge-higher-wall-street-extends-winning-streak-20251201-p5njnm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX dips as investors contend with system glitch",
        "publish_date": "Mon, 01 Dec 2025 12:29:58 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket has slipped into the red after an eventful start to the session, with a technical issue disrupting trading this morning.\n\nThe S&P/ASX 200 was down 24.5 points to 8589.6 just after midday, while market operator ASX continues to look into an issue with publishing market-sensitive announcements. A number of companies have been placed in a trading halt due to the problem.\n\nWall Street edged higher to extend its winning streak. Credit: AP\n\nAn ASX spokesperson said the market operator was investigating an issue affecting the publication of announcements.\n\n“As at midday, we understand approximately 80 companies had price sensitive announcements. Halted securities will only resume trading once the associated announcement has been published,” the spokesperson said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/sydney-eating-out/from-cornwall-to-coogee-rick-stein-s-new-restaurant-showcases-his-most-loved-dishes-20251128-p5nj8r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From Cornwall to Coogee: Rick Stein’s new restaurant showcases his most loved dishes",
        "publish_date": "Mon, 01 Dec 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Erina Starkey"
        ],
        "text": "Advertisement\n\nEating outJust open From Cornwall to Coogee: Rick Stein’s new restaurant showcases his most loved dishes His first Sydney venue opens today, with views to the sea, and on the menu is Cornish-style fish and chips and fish pie, French-style lobster thermidor and a heady Singapore blue swimmer crab. Erina Starkey December 1, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nRick Stein first encountered oysters Charentaise while travelling near La Rochelle off the west coast of France. “It was a dish of raw oysters with hot, small, spicy sausages,” the British celebrity chef recalls. “What I love about it is the sequence of tastes: the cold raw oyster, followed by a bite of the spicy sausage, then a sip of cold Muscadet.” Sarah and Rick Stein have just opened Rick Stein at Coogee Beach. Jack Fenby It’s one of many dishes that Stein has collected over years of eating and cooking abroad, now making an appearance on the menu at his new Sydney restaurant, Rick Stein at Coogee Beach, which opens today, December 1. The 220-seat restaurant and bar is in the InterContinental hotel, just steps from the shoreline. “They’re all dishes that I have discovered and fallen in love with on my travels around the world,” he says. Like Stein himself – who has dozens of food and travel cookbooks and TV shows to his name – the menu roams widely, from a heady Singapore chilli crab to a Sri Lankan pumpkin curry with mango chutney, and a French-style lobster thermidor in a white wine cream sauce.\n\nAdvertisement\n\n1 / 9 Singapore blue swimmer crab. Jack Fenby 2 / 9 An artwork by Bridgit Thomas in the main dining room. Jack Fenby 3 / 9 Fruits de mer platter stocked with lobster, crab, mussels and clams. Jack Fenby 4 / 9 The prawn cocktail is made with Coffs Harbour prawns. Jack Fenby 5 / 9 Red-braised Kurobuta pork belly with Asian greens. Jack Fenby 6 / 9 One of two semi-private dining rooms. Jack Fenby 7 / 9 Twice-baked crab souffle. Jack Fenby 8 / 9 “The Snug” is another semi-private dining room. Jack Fenby 9 / 9 Black forest trifle. Jack Fenby Previous Slide Next Slide What also ties the menu together is a liberal use of seafood, sourced through Get Fish at the Sydney Fish Markets. “We work closely with Frank Theodore, who I know well – he hand-selects our produce,” Stein says. An ice bar displays Pambula, Port Stephens and Merimbula rock oysters, alongside fillets of salmon, kingfish, tuna and scallops, ready to be sliced and arranged on Stein’s sashimi plate. Blue swimmer crab, rock lobster, and mussels are piled high on a fruits de mer platter, served with fresh lemon and a mustardy Breton mayonnaise. Stein’s sashimi platter made with salmon, kingfish, tuna and scallops from the ice bar. Jack Fenby Stein’s Cornish-style fish and chips are expected to be the bestseller – no surprise given the restaurant’s position overlooking the beach. They’re cooked in the traditional British way, in beef dripping, with chunky chips and a scoop of mushy peas. Stein is using hapuka fish. “It’s a large, deep fish closely related to seabass, which is very popular in Cornwall. I like a good thick fillet of fish in fish and chips,” he says.\n\nAdvertisement\n\nWhile tallow has recently become NSW’s trendiest way to fry chips (find it at Olympic Meats and Rosie’s), Stein has been doing it this way for decades. “My original enthusiasm came from a trip to Harry Ramsden’s famous emporium in Guisley near Leeds in Yorkshire. I was struck by the enticing aroma that reminded me of roast beef, and I now consider dripping to be the traditional (and best) way of deep-frying.” The Cornwall-style fish and chips are cooked in beef dripping. Jack Fenby Stein currently spends around three to four months of the year in Australia, dividing his time between Sydney, London and Padstow – the holiday town on Cornwall’s north coast where he runs his flagship venue, The Seafood Restaurant, along with a more casual bistro, cafe, and fish-and-chip shop. On a day-to-day basis, the Sydney kitchen is run by head chef Colin Chun, a former executive chef at Hilton and Accor hotels. Stein’s wife and business partner, Sarah (Sass) Stein, worked with Kate Greenwood of Studio Aria on the interiors, which carry the seafood theme into the soft furnishings. Large coastal artworks by Bridgit Thomas feature on the walls and menus, while blue patterned-style floor tiles and woven texture give the space the light, relaxed feel of a scene from Stein’s Mediterranean Escapes. The main dining room and bar at Rick Stein Coogee Beach. Jack Fenby\n\nAdvertisement\n\nStein’s favourite place to sit is the 10-seat kitchen table. “I like a bit of theatre, and often go for bar stool-style seating, in this case, by our Ice Bar, where I can watch the chefs in action.” He’s equally fond of “The Snug”, the semi-private dining nook beside the bar, which displays some of his best-selling cookbooks and his Coves of Cornwall ceramics, all available to buy. The dining room is fronted by glass bi-fold doors that open in good weather, bringing diners even closer to the beach. Open Mon to Thu 6pm until late; Fri, Sat and Sun 12pm until late. Rick Stein at Coogee Beach, 242 Arden Street, Coogee, ricksteinatcoogeebeach.com.au. Related Article The Sydney cafe Rick Stein swears by, plus his favourite spots for yum cha and a schooner\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-magic-pudding-is-a-very-bad-recipe-20251201-p5njp0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s ‘magic pudding’ is an awful recipe",
        "publish_date": "Mon, 01 Dec 2025 11:59:12 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "His Thanksgiving Day comments to the military were, however, greeted deliriously (and taken very seriously) by his MAGA followers on social media. And they weren’t contradicted by the senior economic officials in his cabinet, despite the reality that the numbers make both his tariff dividends and the replacement of income taxes with tariffs nonsensical. Depending on the cut-off points for the dividend cheques, for instance, they would cost between about $US300 billion and $US600 billion a year. Trump’s MAGA supporters shouldn’t hold their breath awaiting his tariff dividends or the removal of income taxes. Credit: Bloomberg Again depending on how they were targeted (Trump has previously said taxes for those earning less than $US200,000, or about 90 per cent of US taxpayers, would initially benefit), abolishing income taxes for that group could cost something approaching $US700 billion, while completely removing individual income taxes (if it included the payroll taxes deducted from employees’ wages) would cost about $2.6 trillion a year. Whatever the number might be, it would be big.\n\nUnhappily for Trump, and US taxpayers, the tariff numbers aren’t as big. Loading So far this year, US Customs and Border Protection has collected about $US195 billion of tariff revenue, of which about $US118 billion relates to Trump’s new tariffs. The Yale Budget Lab has estimated that, between 2026 and 2035, revenue from those tariffs will be a net $US2.3 trillion, or about $US230 billion a year. That wouldn’t cover Trump’s tariff dividends, let alone replace the lost revenue from taxes. Nor would the tariff revenue, as Trump has boasted it would, help to reduce US deficits and government debt, which has blown out from $US36.2 trillion to $US38.1 trillion in the 11 months since Trump regained the White House – and will blow out even more once all the measures in his One Big Beautiful Bill Act, including $US4.5 trillion of tax cuts over a decade, primarily for the wealthy, are in place from next year.\n\nWhether it’s his tariff dividend, or income tax cuts, they would add (and add substantially) to US deficits and debt, not subtract from them. The rate of the tariffs could, of course, be raised to increase revenue. The average effective rate of the tariffs to date is about 17 per cent, or nearly seven times their level when Joe Biden was in the White House. The problem with that is that the higher the tariff rate, the more it is likely to discourage imports (and the tariff revenue they generate). To replace all income taxes paid by those earning below $US250,000, the average effective tariff rate on all imports would have to be about 25 per cent. To replace all individual taxes (about half of all government revenue), the rate would need to exceed 70 per cent. There’d be few, if any, imports – or tariff revenue – at that point. The other challenge to the maths is that the headline amounts of revenue being collected from tariffs overstates their net benefit to the government’s income.\n\nContrary to Trump’s assertion (his economic spokespeople tend to prevaricate when questioned on this subject), tariffs are paid for by US companies, and ultimately by US consumers. They are a tax on businesses and consumption and, by reducing the incomes available to businesses, their shareholders or households, the tariffs also shrink the tax base. The US Tax Foundation says that tariff revenue should be discounted by between 23 and 25 per cent. Because they flow through to US companies and ultimately households via higher prices for goods (most estimates are that exporters, once the regime settles, will absorb only between about 5 and 15 per cent of their cost), they are also highly regressive. Contrary to Trump’s assertion, tariffs are paid for by US companies – and ultimately by US consumers. Credit: Bloomberg Lower income households spend more of their income on necessities than wealthy households.\n\nThe US income tax system is progressive, albeit that its tax rates are far lower than in most developed economies, so its tax system would be switching from one that is progressive to one where the lower income households shouldered most of the burden of funding the government. Higher income households, already set to benefit massively from the One Big Beautiful Bill, would be even better off if tariff revenues were substituted for at least some of their income tax. Trump’s promises disappear as their impossibility becomes clear to him and a cabinet which, while generally unwilling to challenge anything Trump says or does, has at least one or two who can probably add up. Trump’s proposed abolition of income taxes (while handing out tariff dividends and slashing government debt) is, of course, a fantasy. Either he doesn’t know that (just as he doesn’t seem to know that tariffs on China’s exports aren’t paid by China) or he is deliberately and cynically misleading his MAGA base for political gain, with his cabinet and congressional Republicans happy to go along with him.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/the-400-million-reasons-behind-cricket-australia-s-big-bash-sale-20251201-p5njqb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The 400 million reasons behind Cricket Australia’s Big Bash sale",
        "publish_date": "Mon, 01 Dec 2025 11:58:52 +1100",
        "category": "finance",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Up to $400 million of the total raised from the prospective sale of stakes in the eight Big Bash League clubs may be used to repair Cricket Australia’s budget and reinvest in the game’s lower levels around the country.\n\nSlowly but surely, Australian cricket is moving towards a decision to inject private capital into the BBL, and while the ultimate value of the sell-off remains to be seen, CA and the states are closing in on consensus on where money is most urgently needed.\n\nDavid Warner in action for Sydney Thunder. Credit: Getty Images\n\nEstimates of the value of a sale - based around the concept of selling 49 per cent stakes in six clubs and 100 per cent stakes in one each of the two Melbourne and Sydney-based teams - have ranged between $600 and $800 million.\n\nBut the strategic imperative of budget repair ahead of the next round of domestic broadcast deals in five years’ time has been a key focus of negotiation between CA chief executive Todd Greenberg, the state associations and the players.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/netball/chaz-mostert-still-processing-supercars-title-victory-20251201-p5njso.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chaz Mostert 'still processing' Supercars title victory",
        "publish_date": "Mon, 01 Dec 2025 11:48:36 +1100",
        "category": "sports",
        "authors": [],
        "text": "Chaz Mostert 'still processing' Supercars title victory\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/crackdown-on-dark-patterns-to-stop-australians-being-trapped-by-hidden-fee-subscriptions/0ycwj85nz",
        "title": "Government to target 'dark patterns' behind hidden fees and subscription traps",
        "publish_date": "Sun, 30 Nov 2025 23:02:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Dodgy business practices that trap consumers into hard-to-escape subscriptions or hit shoppers with hidden fees are a step closer to being weeded out.\n\n\n\n\n\nLegislation outlawing the manipulative tactics known as drip pricing and subscription traps will be introduced by the end of next year, the federal government has announced as it ramps up efforts to prevent consumers from being ripped off.\n\n\n\n\n\nIn recent years, firms have increasingly used \"dark patterns\" in online shopping to benefit themselves at the expense of consumer understanding, Assistant Minister for Competition Andrew Leigh will say in a speech in Canberra on Monday.\n\n\n\n\n\nBy tweaking digital user interfaces, hiding essential information in places shoppers rarely look, and exploiting increased understanding of consumer behaviour, businesses have tilted the market against consumers.\n\n\n\n\n\n\"The result was an environment in which consumers were not simply deciding, but being steered,\" he will say.\n\n\n\nConsultation on drafting new laws will start in early 2026, with the aim of introducing a ban on unfair trading practices that harm consumers by manipulating or distorting their decision-making.\n\n\n\n$46 million lost to subscription traps each year\n\nResearch estimates Australians are losing $46 million each year as a result of subscription traps.\n\n\n\n\n\nTo level the playing field, businesses will be required to disclose key terms before sign-up, provide timely reminders at critical points and make it as easy to walk out of a subscription as it is to sign up.\n\n\n\n\n\nBusinesses will also be required to disclose all unavoidable fees early and upfront in a transaction, making it easier for consumers to compare offers for purchases such as concert or plane tickets before hidden fees, such as booking and baggage fees, blow out the price.\n\n\n\nAs part of the changes, the government will seek to expand consumer protections to small businesses to shield them from unfair conduct by larger firms.\n\n\n\n\n\n\"In construction, we have heard complaints that large businesses discourage smaller businesses from exercising their legal rights by ominously suggesting adverse commercial consequences,\" Leigh will say.\n\n\n\n\n\n\"In food production, we have heard of retailers threatening to de-list suppliers in retaliation for seeking price increases to which they are contractually entitled.\"\n\n\n\nLISTEN TO Have you ever struggled to cancel a subscription? Turns out you're not alone SBS News 06:22 English\n\nLeigh's missive comes as the Black Friday-Cyber Monday shopping bonanza, during which businesses try to lock shoppers into subscriptions with enticing discounts, draws to a close.\n\n\n\n\n\nThe Australian Retailers Association expects Australians to spend a record $6.8 billion over the four-day sales period — an increase of 4 per cent from 2024.\n\n\n\n\n\nThe shopping fixture has grown in importance for retailers in recent years, with data showing households are increasingly putting off spending during the rest of the year.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cotality-finds-soaring-home-prices-erase-benefits-of-recent-interest-rate-cuts/iisjp84go",
        "title": "Soaring home prices erase benefits of recent interest rate cuts",
        "publish_date": "Sun, 30 Nov 2025 20:08:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Home prices rose one per cent in November, lifting Australia’s median dwelling value to $888,941.\n\nThree interest rate cuts since February raised borrowing power by about $55,000, but home values have risen $60,000.\n\nRenters also face worsening affordability, with the national rental index up five per cent in a year.\n\nSurging home prices have wiped away the benefits of three interest rate cuts to new buyers, new data reveals.\n\n\n\n\n\nAcross Australia, home values grew by one per cent in November with the median dwelling now worth $888,941, property analytics firm Cotality reported on Monday.\n\n\n\n\n\nThat follows a blistering result in October, when prices rose at 1.1 per cent, and 0.8 per cent in September.\n\n\n\n\n\nHowever, Cotality research director Tim Lawless said the slightly reduced November figure could signal a shift in momentum.\n\n\n\n\n\n\"It really looks to be a very mixed result, two-speed market that's starting to emerge once again,\" Lawless said.\n\n\n\nOn a monthly basis, growth in Sydney slowed from 0.7 per cent to 0.5 per cent, while Melbourne fell from 0.9 per cent in October to 0.3 per cent in November.\n\n\n\n\n\nMeanwhile, the mid-sized capitals picked up.\n\n\n\n\n\nBrisbane became the second Australian city to break the $1 million median home price barrier, up 1.9 per cent to $1,015,767, with Adelaide up by the same amount and Perth accelerating to 2.4 per cent.\n\n\n\n\n\nPrice growth in Canberra, Hobart and Darwin also grew up by 1 per cent, 1.2 per cent and 1.9 per cent, respectively.\n\n\n\nREAD MORE See the list: The Aussie suburbs where home prices more than doubled in five years\n\nThe housing price rises come at the same time as a resurgence in inflation, dashing hopes the Reserve Bank will cut interest rates again.\n\n\n\n\n\nEconomists and bond traders are increasingly predicting that the central bank could even hike rates next year.\n\n\n\n\n\n\"You'd have to argue Sydney's affordability and serviceability challenges will be shining through here and probably putting a natural ceiling on how high prices can go,\" Lawless said.\n\n\n\n\n\n\"This may be the first sign that the markets are starting to respond to this renewed acceptance that interest rates aren't likely to fall further from here, at least over the next six months.\"\n\n\n\nAlready, the impact of 0.75 percentage points of cash rate cuts since February are wearing out.\n\n\n\n\n\nLawless calculated the cuts increased the borrowing capacity of a median-income household by $55,000, but home values have since risen by $60,000.\n\n\n\n\n\nFor renters, the outlook continues to be one of worsening affordability.\n\n\n\n\n\nRents are rising across every capital city, with the national rental index five per cent higher over the past 12 months — the highest annual rate of growth in a year.\n\n\n\n\"It's definitely bad news for renters, and it comes at a time when vacancy rates are just holding around that 1.5 per cent mark, which is virtually at record lows,\" Lawless said.\n\n\n\n\n\nAustralia faces an ongoing supply shortfall, and feasibility constraints for developers are hampering government policies to boost the stocks of social and affordable housing and build-to-rent.\n\n\n\n\n\nDemand is expected to soften somewhat as migration levels normalise and renters increasingly form larger household sizes or stay in the family home longer to accommodate higher rents.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/will-australia-have-another-christmas-covid-wave-this-year/lprxvr8vq",
        "title": "Expert view: Will Australia have another Christmas COVID wave this year?",
        "publish_date": "Sun, 30 Nov 2025 01:16:20 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "As Australians prepare for Christmas and holiday plans, COVID-19 might make a quiet comeback.\n\n\n\n\n\nPaul Griffin, an infectious disease physician and clinical microbiologist from the University of Queensland, says while COVID-19 remains unpredictable, it is fairly likely we'll see another wave relatively soon, on the balance of probability.\n\n\n\n\n\n\"It's not necessarily predictable just yet, but we certainly should be prepared because it would seem likely,\" Griffin told SBS News.\n\n\n\n\n\nSince the start of the pandemic, Australia has experienced an increase in COVID-19 cases during the summer and winter months.\n\n\n\n\n\nData from the Critical Health Resources Information System (CHRIS) show that, since 2022, the number of COVID-19 cases in intensive care units historically has increased from December to January. CHRIS monitors intensive care unit activity.\n\n\n\nSeveral factors are behind Australia's COVID-19 summer waves, including the winter in the northern hemisphere and Christmas travellers.\n\n\n\nCOVID-19 travelling from northern hemisphere\n\n\"Transmission is more likely when the conditions suit, as in winter. But on our side of the world, if the transmission increases on the other side of the world, we see an increase in cases here as well,\" Griffin said.\n\n\n\n\n\n\"While we can't necessarily predict a wave, it is likely that, due to those factors, we will see an increase at some point in the not-too-distant future.\"\n\n\n\n\n\nHowever, data shows the recent COVID-19 summer wave in Australia was not as severe as the previous ones.\n\n\n\n\n\nDuring a surge of cases in January 2023, the highest weekly average of ICU cases reached 113. In January 2025, this number decreased by 34 during the same period, according to CHRIS.\n\n\n\n\n\n\"We certainly shouldn't get complacent and assume that's going to continue to be the case ... We do need to make sure we continue to be prepared and not just to assume that it's going to be something that gets milder and milder,\" Griffin said.\n\n\n\nSome other experts believe the current COVID-19 pattern will continue.\n\n\n\n\n\nCatherine Bennett, chair in epidemiology at Deakin University, told SBS News the COVID-19 situation in the previous summer was \"one of the least detectable waves\".\n\n\n\n\n\n\"There was a bit of a rise over the summer period, that probably coincided with some people travelling to the northern hemisphere, where they were going through a winter wave,\" she told SBS News.\n\n\n\n\n\nAs of 27 November, 6,524 COVID-19 cases had been reported in November, according to the National Notifiable Disease Surveillance System, an almost 11 per cent decrease from October.\n\n\n\n\n\nBennett said she thinks Australia could see more COVID activity but it \"thankfully won't be like our winter waves\".\n\n\n\n\n\n\"It's probably, hopefully, going to be like last year [where] there's no distinct wave where suddenly there's a lot more people sick, but there's just signs of more activity.\"\n\n\n\nBennett said the COVID-19 summer waves in Australia have faded away somewhat over time.\n\n\n\n\n\n\"A lot of it's to do with our natural immunity maturity,\" she said.\n\n\n\n\n\n\"With the virus circulating in the community without getting really sick, people are still boosting their immunity.\"\n\n\n\nPeople with health conditions should be prepared\n\nBut with a new COVID-19 wave or just increased activity, experts agree vulnerable people should be better prepared for the holiday season.\n\n\n\n\n\nAccording to the Department of Health, people aged 65 or older, pregnant women, and those with specific conditions such as a weakened immune system, neurological disease, chronic lung disease, heart disease, obesity, diabetes and chronic kidney disease are at \"a higher risk of becoming very sick from COVID-19\".\n\n\n\n\n\nPeople over 75 are recommended to receive two booster doses per year, and those over 18 with a weakened immune system can consider a second dose.\n\n\n\n\n\nBennett said now is the time these people should be considering a second dose due to the increase in activities over the summer.\n\n\n\n\n\n\"Having a dose now and then, having another one, in May before we go into the winter wave, which is usually a bit more substantial, that's probably the timing that will give them the best benefit,\" she said.\n\n\n\nRemaining home while having symptoms and wearing masks remain inseparable ways of fighting COVID-19, Bennett said.\n\n\n\n\n\n\"If you're unwell at Christmas and the whole family's getting together, all the generations, it's better for the family if you don't go,\" she said.\n\n\n\n\n\n\"Putting on a mask just helps you not ruin someone else's Christmas or worse, pass the virus onto someone else who might be more vulnerable to severe illness.\"\n\n\n\nFlu on the rise\n\nWhile the next days and weeks will determine the situation of the COVID-19 cases in Australia, another respiratory disease is at unseasonably elevated levels in some parts of the country.\n\n\n\n\n\nFrom 1 January until this week, the National Notifiable Disease Surveillance System reported 1,713 Australians per 100,000 were infected with the flu, making it the highest year on record.\n\n\n\n\n\nAs of Thursday, over 456,000 Australians have been diagnosed with flu, and more than 52,000 of those infections were in kids under four.\n\n\n\n\n\nGriffin said this is \"definitely not usual\".\n\n\n\n\"We saw high numbers of interseasonal flu cases at the start of the year, and we continue to see more flu than we might expect, given that we're past the peak period that we normally see in the cooler time of the year,\" Griffin said.\n\n\n\n\n\n\"This year, we're going to probably surpass all records for flu cases and maybe even exceed 500,000 cases.\"\n\n\n\n\n\nEarlier this month NSW health authorities said: \"Influenza is stable at a moderate level of activity and is driven predominantly by influenza A. This sustained activity is unusual for this time of year.\"\n\n\n\n\n\nThe Royal Australian College of General Practitioners reports this year, only 25 per cent of Australian children aged six months to five years received vaccinations — the lowest level since 2021.\n\n\n\n\n\nAnd at least 60 per cent of those aged 65 and over were vaccinated, marking the lowest level since 2020.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/childcare-centres-to-be-given-more-time-for-safety-training-midday-news-bulletin-30-november-2025/fzmj9fidq",
        "title": "Childcare centres to be given more time for safety training | Midday News Bulletin 30 November 2025",
        "publish_date": "Sun, 30 Nov 2025 01:07:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nChildcare centres allowed to close early to enable mandatory safety training\n\nNew Metro Tunnel rain line opens in Melbourne\n\nNorth Melbourne wins the A-F-L-W grand final for the second year running.\n\nChildcare centres across Australia will now be able to close early five days of the year for safety training, as part of reforms to tighten regulation after recent scandals exposed gaps in the system.\n\n\n\n\n\nFederal Early Childhood Education Minister Jess Walsh says it's a sensible to way to enable mandatory new training, and Nationals Leader David Littleproud has backed the move - although both agreed it would be an inconvenience for parents.\n\n\n\n\n\nAmanda Rose, founder of the consultancy group Western Sydney Women, told Channel Nine the government should allow retired childcare workers to return to work tax-free, to increase the number of experienced staff.\n\n\n\n\n\n\"I would like to throw into the mix that they introduce the ability for people that are on a pension to be able to earn more money. So, mature-age women that want to earn a bit more money tax free to go back into - so retired childcare professionals - go back into the system, because having that maturity and that wisdom in a facility, they can spot signs and they can train up people and mentor people.\"\n\n\n\n\n\nThe government is also trialling the use of CCTV in centres and introducing a national register of childcare workers.\n\n\n\n\n\nEarlier this year, Melbourne childcare worker Joshua Brown, who worked at 24 centres, was charged with sexually abusing eight children under the age of two.\n\n\n\n\n\nQueensland's Liberal National Party has claimed victory in the Hinchinbrook by-election in North Queensland, with a large swing against the incumbent Katter's Australia Party.\n\n\n\n\n\nWith most of the first preferences counted, the LNP's Wayde Chiesa has more than 40 per cent of the vote.\n\n\n\n\n\nThe Katter Australia Party had 30 per cent, and One Nation just over 13 per cent.\n\n\n\n\n\nThe by-election was triggered by the resignation of Nick Dametto, who left parliament to successfully contest the Townsville mayoral race.\n\n\n\n\n\nMore than 200 firefighters are working to contain a massive blaze at a waste facility factory in Sydney's west.\n\n\n\n\n\nA huge fire ball erupted, sending flames up to 150 metres into the sky above the St Mary's site, as flames took hold around 11pm last night [[Saturday]].\n\n\n\n\n\nA large chemical tank was also blown into the air.\n\n\n\n\n\nFire Rescue New South Wales Commissioner, Jeremy Fewtrell, says firefighters have been doing an amazing job.\n\n\n\n\n\n\"We've got 50 fire trucks here of various types. We've got lots of fire engines and other specialist vehicles. We've got five aerial appliances at work, and so they're the water towers working above and across the scene and putting large volumes of water on to the fire.\"\n\n\n\n\n\nThe cause of the fire is unknown but it's expected to burn for most of the day.\n\n\n\n\n\nThousands of people have paid their respects for the victims of an apartment complex fire in Hong Kong, marking the start of three days of official mourning.\n\n\n\n\n\nPeople gathered to lay flowers at a small park near the burnt remains of Wang Fuk Court in Tai Po to honour at least 128 people killed when the fire broke out and spread to seven towers.\n\n\n\n\n\nForty people remain in hospital, 19 in a critical condition. ]]\n\n\n\n\n\nAuthorities have now arrested 11 people in connection to renovation work at the towers, with suggestions foam boards and bamboo scaffolding accelerated the fire's spread.\n\n\n\n\n\nTifa Cheng's mother lost her home in the blaze, and says residents tried to warn authorities of the risks.\n\n\n\n\n\n“In the end, it’s really frustrating because we felt something was wrong from the start, but it seemed no one listened to us. And now this incident happened, costing the lives of residents. It’s infuriating. For now, we’ll wait for the neighbors to settle things. I don’t know if there will be further investigations or follow-ups.”\n\n\n\n\n\nAfter more than a decade of planning and construction, Melbourne's $15 billion Metro Tunnel rail line opens today.\n\n\n\n\n\nThe service will stop at five new underground stations that feature platform screen doors and shops.\n\n\n\n\n\nThe 9 kilometre twin tunnels will open to limited services from today in an initial \"soft start\", with train fanatics and curious locals queuing to ride its maiden trip.\n\n\n\n\n\nAnd in sport\n\n\n\n\n\nNorth Melbourne have won the AFLW grand final with a massive 40-point win over the Brisbane Lions, becoming the first team to win back-to-back premierships.\n\n\n\n\n\nAsh Riddell starred in the Kangaroos' 56 to 16 triumph at Melbourne's Ikon park with 39 disposals, the highest tally ever recorded in a season-decider.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/a-new-values-test-for-temporary-visa-holders-wont-hurt-david-littleproud-says/h2bmk9med",
        "title": "A new values test for temporary visa holders 'won't hurt', David Littleproud says",
        "publish_date": "Sun, 30 Nov 2025 00:53:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Opposition leader Sussan Ley says the Coalition's forthcoming immigration policy will include \"issues around language and values\", as her Nationals colleague signalled a values test for temporary visa holders from \"challenged parts of the world\" will ensure they live up to Australian values.\n\n\n\n\n\nCuts to migration levels are reportedly set to form part of a Coalition policy to be unveiled by Ley in the coming weeks.\n\n\n\n\n\nSpeaking to reporters in Tasmania on Sunday, Ley also signalled it will mention \"language and values\".\n\n\n\n\n\n\"You don't have to wait very long, and those principles will be clearly enunciated,\" she said on Sunday..\n\n\n\n\n\n\"Unsurprisingly, issues around language and values form part of that conversation.\n\n\n\nValues test for those from 'challenged parts of the world'\n\nEarlier, Nationals leader David Littleproud was asked what he thought about the prospect of a values test for those on temporary visas on the ABC's Insiders program.\n\n\n\n\n\nHe said a values test would \"demonstrate the value of citizenship\" and \"principles of freedom\".\n\n\n\n\n\n\"I don't think it hurts,\" Littleproud said.\n\n\n\n\n\n\"I think there is a risk that we as Australians can't import the hate that permeates in some other parts of the world.\n\n\n\n\n\n\"It's important we make sure that when we do bring people from those challenged parts of the world, that they understand they are coming here with responsibility, a responsibility to live up to the values and principles that our great country has been built on.\"\n\n\n\n\n\nTemporary and permanent visa applicants are required to agree to an Australian Values Statement as part of their application. The statement points to values including freedom of the individual, freedom of religion, commitment to the rule of law, and equality. Permanent applicants have an additional statement regarding a commitment to learning the English language.\n\n\n\nEnglish language tests under scrutiny\n\nSeparately, one of the men in charge of formulating the Coalition's policy, opposition home affairs spokesman Jonno Duniam, said it could include a new test.\n\n\n\n\n\n\"We are looking at how best to assess someone's commitment to our country … and there are a range of ways of doing that, and it may be that, of course, a condition on a visa might be one of those things that we inquire about, or revisiting the citizenship test,\" he told News Corp on Sunday.\n\n\n\n\n\nHe also reportedly flagged the strengthening of English language requirements for foreign students, if the Coalition won the next election.\n\n\n\n\n\n\"I think the requirements, the standards of these tests, do need to be improved,\" he said.\n\n\n\n\n\nLey would not confirm the statements from Duniam when asked by Sky News, but flagged the party policy would be unveiled before the end of the year.\n\n\n\nFeeding racism: Greens senator criticises values test idea\n\nGreens senator Mehreen Faruqi criticised a proposed values test, saying it was \"the ultimate dog whistle.\"\n\n\n\n\n\n\"You can't say migrants aren't a problem and then call for a values screening test to demonise and other them,\" she said on Sunday.\n\n\n\n\n\n\"This is what is feeding the rising racism in this country.\"\n\n\n\nThe Coalition faced criticism earlier this year after comments made by Northern Territory senator Jacinta Nampijinpa Price.\n\n\n\n\n\n\"My criticism of this government around migration policy is … not a criticism of any migrant or migrant community,\" Ley said earlier on Sunday..\n\n\n\n\n\n\"There's a massive failing of governments to build the infrastructure that our communities need, and they're rightly concerned about that.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/watch-the-official-trailer-for-stranger-things-season-5-20251201-p5njua.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Watch the official trailer for Stranger Things Season 5",
        "publish_date": "Mon, 01 Dec 2025 13:30:24 +1100",
        "category": "finance",
        "authors": [],
        "text": "Watch the official trailer for Stranger Things Season 5\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/out-of-the-zone-pokies-in-nsw-to-be-switched-off-in-danger-hours-20251201-p5njrv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Out of the zone’: Pokies in NSW to be switched off in danger hours",
        "publish_date": "Mon, 01 Dec 2025 13:20:45 +1100",
        "category": "finance",
        "authors": [
            "Alexandra Smith"
        ],
        "text": "Almost 700 pubs and clubs in NSW will be told to switch off their poker machines between 4 and 10am, ending a 20-year loophole that has allowed some venues to be pre-dawn gaming dens.\n\nHowever, it is unclear whether the NSW Labor government will change the legislation to permanently axe the exemption provisions, with an appeal process to remain in place.\n\nHundreds of clubs have pleaded financial hardship to enable their poker machines to stay operating in the mandated shutdown period. Credit: Flavio Brancaleone\n\nVenues claiming financial hardship or boosted tourism benefits have been able to apply for a shorter shutdown period than the mandatory 4 to 10am, and those that had pokies before 1997 can also be allowed different shutdown hours.\n\nMore than 670 venues have had varied shutdown periods over the past two decades, despite research showing the early hours of the morning to be the danger time for problem gamblers.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/an-indoor-outdoor-bar-with-daily-happy-hour-prices-and-pizzas-until-3am-20251201-p5njt0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An indoor-outdoor bar with daily happy hour prices and pizzas until 3am",
        "publish_date": "Mon, 01 Dec 2025 13:15:42 +1100",
        "category": "finance",
        "authors": [],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nAt Franklin’s Bar in Thornbury, get $10 pints and $15 cocktails (almost) every day.\n\n1 / 9 Franklin’s Bar in Thornbury is found behind a warehouse-looking frontage. Supplied 2 / 9 Signature cocktails include the Franklin spritz, espresso martini and negronis are $15 at happy hour. Supplied 3 / 9 Sourdough pizzas by local bakery Billy Cart Bread Co. are served until closing time every day. Supplied 4 / 9 Head inside for cocktails, pizzas and DJ sets. Supplied 5 / 9 Vinyl DJs spin until late every Friday and Saturday. Supplied 6 / 9 Outdoor dining. Supplied 7 / 9 Cocktails at Franklin’s. Supplied 8 / 9 Outside the Thornbury venue. Supplied 9 / 9 There is space for 40 diners. Supplied Previous Slide Next Slide\n\nBar snacks$$$$\n\nThe warehouse frontage can look a bit foreboding, but it’s all smiles once you come inside and explore the indoor-outdoor spaces. The house cocktails are all about fun spins on classics − for example, the pandan colada which includes coconut-washed dark rum and toasted pineapple cordial.\n\nDrinkers need ballast: ciabatta-style sourdough pizzas by local bakery Billy Cart Bread Co. have classic toppings you can jazz up with hot sauce. Plus, they’re available right until closing time daily (that’s 3am on Fridays, Saturdays and Sundays!).\n\nGood to know: Late-night happy hour (including $10 pints and $15 cocktails) runs every Monday to Thursday from 8 to 10pm, while all-day happy hour prices extend from 4 to 10pm on Sundays.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/khawaja-on-the-importance-of-gratitude-20251201-p5njtq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Khawaja on the importance of gratitude",
        "publish_date": "Mon, 01 Dec 2025 12:45:04 +1100",
        "category": "finance",
        "authors": [],
        "text": "Khawaja on the importance of gratitude\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/roots-eye-catching-net-session-20251201-p5njtk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Root's eye-catching net session",
        "publish_date": "Mon, 01 Dec 2025 12:35:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "Root's eye-catching net session\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/outrageous-fireworks-display-cancels-dutch-league-game-20251201-p5njtl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Outrageous' fireworks display cancels Dutch league game",
        "publish_date": "Mon, 01 Dec 2025 12:34:47 +1100",
        "category": "sports",
        "authors": [],
        "text": "'Outrageous' fireworks display cancels Dutch league game\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-edge-higher-wall-street-extends-winning-streak-20251201-p5njnm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX dips as investors contend with system glitch",
        "publish_date": "Mon, 01 Dec 2025 12:29:58 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket has slipped into the red after an eventful start to the session, with a technical issue disrupting trading this morning.\n\nThe S&P/ASX 200 was down 24.5 points to 8589.6 just after midday, while market operator ASX continues to look into an issue with publishing market-sensitive announcements. A number of companies have been placed in a trading halt due to the problem.\n\nWall Street edged higher to extend its winning streak. Credit: AP\n\nAn ASX spokesperson said the market operator was investigating an issue affecting the publication of announcements.\n\n“As at midday, we understand approximately 80 companies had price sensitive announcements. Halted securities will only resume trading once the associated announcement has been published,” the spokesperson said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/sydney-eating-out/from-cornwall-to-coogee-rick-stein-s-new-restaurant-showcases-his-most-loved-dishes-20251128-p5nj8r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From Cornwall to Coogee: Rick Stein’s new restaurant showcases his most loved dishes",
        "publish_date": "Mon, 01 Dec 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Erina Starkey"
        ],
        "text": "Advertisement\n\nEating outJust open From Cornwall to Coogee: Rick Stein’s new restaurant showcases his most loved dishes His first Sydney venue opens today, with views to the sea, and on the menu is Cornish-style fish and chips and fish pie, French-style lobster thermidor and a heady Singapore blue swimmer crab. Erina Starkey December 1, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nRick Stein first encountered oysters Charentaise while travelling near La Rochelle off the west coast of France. “It was a dish of raw oysters with hot, small, spicy sausages,” the British celebrity chef recalls. “What I love about it is the sequence of tastes: the cold raw oyster, followed by a bite of the spicy sausage, then a sip of cold Muscadet.” Sarah and Rick Stein have just opened Rick Stein at Coogee Beach. Jack Fenby It’s one of many dishes that Stein has collected over years of eating and cooking abroad, now making an appearance on the menu at his new Sydney restaurant, Rick Stein at Coogee Beach, which opens today, December 1. The 220-seat restaurant and bar is in the InterContinental hotel, just steps from the shoreline. “They’re all dishes that I have discovered and fallen in love with on my travels around the world,” he says. Like Stein himself – who has dozens of food and travel cookbooks and TV shows to his name – the menu roams widely, from a heady Singapore chilli crab to a Sri Lankan pumpkin curry with mango chutney, and a French-style lobster thermidor in a white wine cream sauce.\n\nAdvertisement\n\n1 / 9 Singapore blue swimmer crab. Jack Fenby 2 / 9 An artwork by Bridgit Thomas in the main dining room. Jack Fenby 3 / 9 Fruits de mer platter stocked with lobster, crab, mussels and clams. Jack Fenby 4 / 9 The prawn cocktail is made with Coffs Harbour prawns. Jack Fenby 5 / 9 Red-braised Kurobuta pork belly with Asian greens. Jack Fenby 6 / 9 One of two semi-private dining rooms. Jack Fenby 7 / 9 Twice-baked crab souffle. Jack Fenby 8 / 9 “The Snug” is another semi-private dining room. Jack Fenby 9 / 9 Black forest trifle. Jack Fenby Previous Slide Next Slide What also ties the menu together is a liberal use of seafood, sourced through Get Fish at the Sydney Fish Markets. “We work closely with Frank Theodore, who I know well – he hand-selects our produce,” Stein says. An ice bar displays Pambula, Port Stephens and Merimbula rock oysters, alongside fillets of salmon, kingfish, tuna and scallops, ready to be sliced and arranged on Stein’s sashimi plate. Blue swimmer crab, rock lobster, and mussels are piled high on a fruits de mer platter, served with fresh lemon and a mustardy Breton mayonnaise. Stein’s sashimi platter made with salmon, kingfish, tuna and scallops from the ice bar. Jack Fenby Stein’s Cornish-style fish and chips are expected to be the bestseller – no surprise given the restaurant’s position overlooking the beach. They’re cooked in the traditional British way, in beef dripping, with chunky chips and a scoop of mushy peas. Stein is using hapuka fish. “It’s a large, deep fish closely related to seabass, which is very popular in Cornwall. I like a good thick fillet of fish in fish and chips,” he says.\n\nAdvertisement\n\nWhile tallow has recently become NSW’s trendiest way to fry chips (find it at Olympic Meats and Rosie’s), Stein has been doing it this way for decades. “My original enthusiasm came from a trip to Harry Ramsden’s famous emporium in Guisley near Leeds in Yorkshire. I was struck by the enticing aroma that reminded me of roast beef, and I now consider dripping to be the traditional (and best) way of deep-frying.” The Cornwall-style fish and chips are cooked in beef dripping. Jack Fenby Stein currently spends around three to four months of the year in Australia, dividing his time between Sydney, London and Padstow – the holiday town on Cornwall’s north coast where he runs his flagship venue, The Seafood Restaurant, along with a more casual bistro, cafe, and fish-and-chip shop. On a day-to-day basis, the Sydney kitchen is run by head chef Colin Chun, a former executive chef at Hilton and Accor hotels. Stein’s wife and business partner, Sarah (Sass) Stein, worked with Kate Greenwood of Studio Aria on the interiors, which carry the seafood theme into the soft furnishings. Large coastal artworks by Bridgit Thomas feature on the walls and menus, while blue patterned-style floor tiles and woven texture give the space the light, relaxed feel of a scene from Stein’s Mediterranean Escapes. The main dining room and bar at Rick Stein Coogee Beach. Jack Fenby\n\nAdvertisement\n\nStein’s favourite place to sit is the 10-seat kitchen table. “I like a bit of theatre, and often go for bar stool-style seating, in this case, by our Ice Bar, where I can watch the chefs in action.” He’s equally fond of “The Snug”, the semi-private dining nook beside the bar, which displays some of his best-selling cookbooks and his Coves of Cornwall ceramics, all available to buy. The dining room is fronted by glass bi-fold doors that open in good weather, bringing diners even closer to the beach. Open Mon to Thu 6pm until late; Fri, Sat and Sun 12pm until late. Rick Stein at Coogee Beach, 242 Arden Street, Coogee, ricksteinatcoogeebeach.com.au. Related Article The Sydney cafe Rick Stein swears by, plus his favourite spots for yum cha and a schooner\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-magic-pudding-is-a-very-bad-recipe-20251201-p5njp0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s ‘magic pudding’ is an awful recipe",
        "publish_date": "Mon, 01 Dec 2025 11:59:12 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "His Thanksgiving Day comments to the military were, however, greeted deliriously (and taken very seriously) by his MAGA followers on social media. And they weren’t contradicted by the senior economic officials in his cabinet, despite the reality that the numbers make both his tariff dividends and the replacement of income taxes with tariffs nonsensical. Depending on the cut-off points for the dividend cheques, for instance, they would cost between about $US300 billion and $US600 billion a year. Trump’s MAGA supporters shouldn’t hold their breath awaiting his tariff dividends or the removal of income taxes. Credit: Bloomberg Again depending on how they were targeted (Trump has previously said taxes for those earning less than $US200,000, or about 90 per cent of US taxpayers, would initially benefit), abolishing income taxes for that group could cost something approaching $US700 billion, while completely removing individual income taxes (if it included the payroll taxes deducted from employees’ wages) would cost about $2.6 trillion a year. Whatever the number might be, it would be big.\n\nUnhappily for Trump, and US taxpayers, the tariff numbers aren’t as big. Loading So far this year, US Customs and Border Protection has collected about $US195 billion of tariff revenue, of which about $US118 billion relates to Trump’s new tariffs. The Yale Budget Lab has estimated that, between 2026 and 2035, revenue from those tariffs will be a net $US2.3 trillion, or about $US230 billion a year. That wouldn’t cover Trump’s tariff dividends, let alone replace the lost revenue from taxes. Nor would the tariff revenue, as Trump has boasted it would, help to reduce US deficits and government debt, which has blown out from $US36.2 trillion to $US38.1 trillion in the 11 months since Trump regained the White House – and will blow out even more once all the measures in his One Big Beautiful Bill Act, including $US4.5 trillion of tax cuts over a decade, primarily for the wealthy, are in place from next year.\n\nWhether it’s his tariff dividend, or income tax cuts, they would add (and add substantially) to US deficits and debt, not subtract from them. The rate of the tariffs could, of course, be raised to increase revenue. The average effective rate of the tariffs to date is about 17 per cent, or nearly seven times their level when Joe Biden was in the White House. The problem with that is that the higher the tariff rate, the more it is likely to discourage imports (and the tariff revenue they generate). To replace all income taxes paid by those earning below $US250,000, the average effective tariff rate on all imports would have to be about 25 per cent. To replace all individual taxes (about half of all government revenue), the rate would need to exceed 70 per cent. There’d be few, if any, imports – or tariff revenue – at that point. The other challenge to the maths is that the headline amounts of revenue being collected from tariffs overstates their net benefit to the government’s income.\n\nContrary to Trump’s assertion (his economic spokespeople tend to prevaricate when questioned on this subject), tariffs are paid for by US companies, and ultimately by US consumers. They are a tax on businesses and consumption and, by reducing the incomes available to businesses, their shareholders or households, the tariffs also shrink the tax base. The US Tax Foundation says that tariff revenue should be discounted by between 23 and 25 per cent. Because they flow through to US companies and ultimately households via higher prices for goods (most estimates are that exporters, once the regime settles, will absorb only between about 5 and 15 per cent of their cost), they are also highly regressive. Contrary to Trump’s assertion, tariffs are paid for by US companies – and ultimately by US consumers. Credit: Bloomberg Lower income households spend more of their income on necessities than wealthy households.\n\nThe US income tax system is progressive, albeit that its tax rates are far lower than in most developed economies, so its tax system would be switching from one that is progressive to one where the lower income households shouldered most of the burden of funding the government. Higher income households, already set to benefit massively from the One Big Beautiful Bill, would be even better off if tariff revenues were substituted for at least some of their income tax. Trump’s promises disappear as their impossibility becomes clear to him and a cabinet which, while generally unwilling to challenge anything Trump says or does, has at least one or two who can probably add up. Trump’s proposed abolition of income taxes (while handing out tariff dividends and slashing government debt) is, of course, a fantasy. Either he doesn’t know that (just as he doesn’t seem to know that tariffs on China’s exports aren’t paid by China) or he is deliberately and cynically misleading his MAGA base for political gain, with his cabinet and congressional Republicans happy to go along with him.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/the-400-million-reasons-behind-cricket-australia-s-big-bash-sale-20251201-p5njqb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The 400 million reasons behind Cricket Australia’s Big Bash sale",
        "publish_date": "Mon, 01 Dec 2025 11:58:52 +1100",
        "category": "finance",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Up to $400 million of the total raised from the prospective sale of stakes in the eight Big Bash League clubs may be used to repair Cricket Australia’s budget and reinvest in the game’s lower levels around the country.\n\nSlowly but surely, Australian cricket is moving towards a decision to inject private capital into the BBL, and while the ultimate value of the sell-off remains to be seen, CA and the states are closing in on consensus on where money is most urgently needed.\n\nDavid Warner in action for Sydney Thunder. Credit: Getty Images\n\nEstimates of the value of a sale - based around the concept of selling 49 per cent stakes in six clubs and 100 per cent stakes in one each of the two Melbourne and Sydney-based teams - have ranged between $600 and $800 million.\n\nBut the strategic imperative of budget repair ahead of the next round of domestic broadcast deals in five years’ time has been a key focus of negotiation between CA chief executive Todd Greenberg, the state associations and the players.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/netball/chaz-mostert-still-processing-supercars-title-victory-20251201-p5njso.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chaz Mostert 'still processing' Supercars title victory",
        "publish_date": "Mon, 01 Dec 2025 11:48:36 +1100",
        "category": "sports",
        "authors": [],
        "text": "Chaz Mostert 'still processing' Supercars title victory\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]