[
    {
        "url": "https://www.9news.com.au/national/melbourne-metro-tunnel-to-open-in-december/4a0bc049-1da1-4bdc-a475-9b90406a63d6",
        "title": "When Melbourne's Metro Tunnel will open after decade-long wait",
        "publish_date": "Tue, 07 Oct 2025 00:05:18 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "M﻿elbourne's long-awaited Metro Tunnel is slated to open to the public in early December after years of construction, delays and cost blowouts.\n\nVictorian Premier Jacinta Allan today announced the tunnel is scheduled to be complete and ready for passengers﻿ by the start of summer following eight years of construction.\n\nThe new tunnel will service trains every 20 minutes between Westall and West Footscray from 10am until 3pm Monday to Friday for an initial \"Summer Start\" period.\n\nMelbourne Metro Tunnel will officially open in December. (Supplied)\n\nWeeke﻿nd services trains will run every 20 minutes from 10am until 7pm, extending to East Pakenham every 40 minutes and Sunbury every hour.\n\n﻿Metro Tunnel services will stop at five new underground stations: Arden, Parkville, State Library, Town Hall and Anzac.\n\nA network-wide timetable for the new tunnel is scheduled to start on February 1 next year.﻿\n\nLabelled \"The Big Switch\"﻿, this major timetable overhaul is set to add 1000 new weekly services to the network.\n\nFrom this point, trains will run at least every 10 minutes from 6am until 10pm between Watergardens and Dandenong.\n\nThe new tunnel will service trains every 20 minutes between Westall and West Footscray. (Joe Armao)\n\n﻿Metro Tunnel services will stop at five new underground stations: Arden, Parkville, State Library, Town Hall and Anzac. (Supplied)\n\nThe services will increase to every three to four minutes during rush hour.﻿\n\nFrankston Line services are also expected to return to Melbourne's City Loop from February 1.\n\nAllan said it was crucial to trial a smaller number of services first before integrating the big timetable switch.\n\n﻿The premier could not confirm an exact date for the tunnel's opening and would only confirm it as \"early December\".\n\nVictorian Premier Jacinta Allan did not divulge the exact date in December the Metro Tunnel would open. (Luis Enrique Ascui)\n\n\"Christmas is coming early for everyone on the Pakenham, Cranbourne and Sunbury lines, who'll have hundreds of new services every week from the start of December,\" Allan said.\n\n﻿\"What an incredible moment for our state – Victorians have patiently waited for this tunnel to get built underneath their feet and behind big sheds, and now they'll be able to use it.\"\n\nThe Melbourne Metro Tunnel was first announced in 2015.\n\nConstruction work began in 2017, including lengthy and complex work on Town Hall station which ﻿needed excavation as deep as a five storey building.\n\nIn September last year, t﻿he Allan government announced an $837 million cost blowout on the project.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/dangerous-drivers-put-posties-at-risk-on-the-roads-australia-post-national-australia/4df59460-bc89-4049-b4fa-9bb5053e6762",
        "title": "New footage highlights growing problem for posties",
        "publish_date": "Mon, 06 Oct 2025 23:59:11 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Posties around Australia are being injured by unsafe drivers at least five times a week.﻿\n\nAustralia Post has released footage of some of the terrifying accidents after it was revealed ﻿more than 280 posties have been injured in the past financial year.\n\nInjuries have ranged from broken limbs and concussions to lacerations and serious trauma.﻿\n\nPosties around Australia are being injured by cars at least five times a week.﻿ (Australia Post)\n\nThe injuries have required posties to undergo hospital treatment, take time off work and manage ongoing psychological trauma.\n\nAustralia Post general manager of safety Russell Munro said the figures were concerning.\n\n\"Every day our team members are out in communities delivering for Australians, but increasingly, they're also being put at risk by unsafe driver behaviour,\" Munro said.\n\nInjuries have ranged from broken limbs and concussions to lacerations and serious trauma.﻿ (Australia Post)\n\n\"We are taking comprehensive measures, such as reducing our motorcycle fleet, expanding the deployment of electric delivery vehicles, and implementing upgraded telematics systems, including video and data monitoring across thousands of vehicles. ﻿\n\n\"Our data shows that the severity of injury to a postie when involved in a motor accident is reduced when operating an electric delivery vehicles.\n\n\"In some instances, our team have walked away from the accident with only minor injuries.﻿\"\n\nMore than 280 posties have been injured in the past financial year. (Australia Post)\n\nPosties have been involved in accidents when drivers have failed to give way, not left enough space to stop safety and cut corners.\n\nDrivers have also put posties at risk by overtaking on the wrong side of the road, driving distracted while using a mobile phone and not looking on footpaths when using scooters and bikes.﻿\n\n\"Our priority is to deliver for all Australians whilst ensuring the safety of our team members, so they return home to their families safely each day,\" Munro said.\n\n\"However, road safety is a shared responsibility, and we urge all drivers to keep an eye out for our posties.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/work-from-home-summer-rules-exclusive-poll/708a8e0e-9ab4-4559-9fa6-c75d08bb91d5",
        "title": "Half of Aussies think it's OK to commit this 'risky' WFH breach",
        "publish_date": "Mon, 06 Oct 2025 21:01:54 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Exclusive: ﻿ Australian employees may be more lax about work from home (WFH) expectations in summer, according to a nine.com.au reader poll.\n\nMore than half of the 515* respondents think it's OK to clock off early to hit the beach during the warmer months.\n\nOne in four also ﻿said it's fine to take longer breaks to enjoy good weather while WFH in summer.\n\nMore than half of Aussie employees think it's OK to clock off early or take longer breaks when WFH in summer. (Getty Images/iStockphoto)\n\nNearly 40 per cent want ﻿companies to introduce more relaxed WFH rules in summer, like allowing staff to work half days on Fridays.\n\nOne third said ﻿employees should be allowed to work more days from home during summer.\n\nThe same amount said it's fine for Aussie employees to work from the beach or another outdoor location when WFH.\n\n\"As long as the work is being done why does it matter where it is done?\" one respondent said.\n\nSome respondents noted that these privileges should ﻿only be extended to workers who have proven they're reliable and get all their work done on time and to a high standard.\n\nBut Associate Professor of workplace and business law at the University of Technology, Sydney Giuseppe Carabetta said these habits raise practical and legal concerns.\n\n\"For employees working under traditional arrangements, it's risky to assume such freedom without prior approval,\" he told 9news.com.au.\n\n\"If the location compromises productivity or confidentiality, it could breach a company policy or even your employment contract.\"\n\nHe added that though ﻿flexible work arrangements are increasingly common, \"employees generally can't unilaterally change their schedule\".\n\nSo clocking off early or taking a longer break in summer isn't wise.\n\n\"For employees with set hours, clocking off early without approval could be considered time theft or a behavioural breach,\" Carabetta said.\n\n﻿\"For your typical salaried or award-regulated employees, longer breaks without approval could be seen as a breach of workplace expectations.\"﻿\n\nBut he wouldn't be surprised to see more Australian workplaces experimenting with or embracing \"seasonal flexibility\" in the future.\n\n﻿That could look like summer hours of increased WFH allowances in the warmer months to boost morale and retention.\n\nSuch approaches would likely only be introduced in ﻿sectors where productivity isn't tied to physical presence.\n\nBut not everyone is on board.\n\nA significant number of Aussies said that taking liberties with WFH policies in summer is tantamount to \"stealing company time\".\n\nOf the 515 users surveyed, 35 per cent were against workers clocking off early in summer and almost 60 per cent said taking longer breaks was never OK.\n\n﻿More than 45 per cent also said WFH rules shouldn't change with the weather.\n\nAnd 54 per cent said it's never OK for Aussie employees to work from the beach or another outdoor location while WFH.\n\nAn additional 57 per cent said it would be inappropriate for workers to take ﻿work video calls or attend virtual meetings while working outdoors.\n\n\"Work means at work, not at the beach or some other location simply because of the day of the week or the season of the year,\" one said.﻿\n\nA number of respondents said working from public locations like a beach or park could raise privacy concerns, depending on the work being done.\n\nCarabetta agreed.\n\n\"Confidentiality is a cornerstone of professional conduct, and outdoor locations—whether it's a beach, café, or park - can pose risks,\" he said.\n\n﻿\"If you're dealing with confidential material, it's best to stick to secure, private locations.\"\n\nREAD MORE: Masked attackers set UK mosque on fire with people inside\n\nMore than 50 per cent of Aussies said employees should never work from the beach or another outdoor location while WFH. (Getty)\n\nIt's always better to ask for permission than forgiveness when it comes to WFH arrangements, even at relaxed workplaces.\n\n﻿\"Acting without approval could lead to disciplinary action or erode trust,\" Carabetta said.\n\n\"That said, many employers are open to flexibility - especially if approached transparently and respectfully and both parties are on the same page.\"\n\n*The nine.com.au poll, which runs once a fortnight, canvases the views of the nine audience on 9Nation, which is an online community of our readers and viewers.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/james-kirchick-how-to-deal-with-donald-trump/d53ed5b9-faf5-44a5-8cdf-972309361c16",
        "title": "'Flatter him': The plan PM should follow in meeting with Trump",
        "publish_date": "Mon, 06 Oct 2025 19:16:18 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "If those who rule us are not lying awake at night thinking about this, they should be: what do you do about a problem called Trump ?\n\nWith an unpredictable, abrasive, threatening and manipulative president of the United States, world leaders need masterclasses in Donald management or their countries may suffer.\n\nSo, as our PM packs the plane to head to his first real meeting with Mr Trump, he needs a plan.\n\nHere's one strategy from a respected American commentator who has been analysing Trump for years.\n\nFirst, flatter him.\n\nSecond, bow the head and treat him like the royalty he admires.\n\nThird, recognise that traditional ties no longer exist.\n\nAnd fourth, he's a salesman, always remember that.\n\nDonald Trump: \"Unpredictable, abrasive, threatening and manipulative.\" (AP)\n\nJames Kirchick, a commentator whose work appears in the New York Times and Wall Street Journal, says although Trump admires strength, he responds best to a strategy of admiration and subservience.\n\nHe says the fact Anthony Albanese is a left-wing prime minister will not help.\n\n\"Flatter him. Do something special for him. The Brits gave him this huge state dinner and the King was there. He loves royalty. He loves being treated like that.\n\n\"I wish we had a president who understood that regardless of which leader is in power our allies are our allies for reasons that go beyond that.\n\n\"Even though you have a left-wing prime minister it should not inhibit a positive relationship with the United States but unfortunately it does.\"\n\nAnthony Albanese will need a game plan before he faces Donald Trump, an expert commentator says. (Getty)\n\nAnthony Albanese clearly gives some thought to managing these leaders.\n\nHe turned up at 10 Downing Street with a four-pack of Albo Ale as a gift.\n\nLet's hope Kevin Rudd and the diplomatic team don't let that happen at the White House.\n\nTrump doesn't drink.\n\nHe lost his brother to alcohol addiction and won't go near it.\n\nRegardless of the gift, it's a crucial meeting with so much uncertainty about relations between the two countries: tariffs, the submarine deal, the defence alliance, and Chinese expansion all need to be discussed.\n\nThey are due to meet on October 20.\n\nIt has taken too long to organise, which shows where Australia sits on the US agenda.\n\nBut the game has changed in many ways for a nation we still see as our defender.\n\nKirchick spoke on my podcast, Neil Mitchell Asks Why.\n\n\"Democratic allies need to understand that simply being a liberal democracy, which used to mean you were an ally because you had the same values, doesn't mean anything anymore.\n\n\"The Trump administration doesn't care about those airy fairy romantic things like democracy and liberal values and historical ties.\n\n\"The don't care about that. They care about, 'Let's make a deal. What's good for us?'\"\n\nJames Kirchick is a journalist, author and commentator. (James Kirchick)\n\nBefore he's branded as a left-wing part of the \"fake news\" conspiracy, it must be said Kirchick is seen in the US as a conservative commentator, although he admits voting Democrat recently.\n\nHe loathes Nazis and what they stand for but says they have the right to march in the streets.\n\nHe is critical of immigration levels.\n\nAnd he says the people must be armed in case they need to protect themselves from a \"tyrannical and authoritarian\" government.\n\nBut back to Trump management.\n\nKirchick says:\n\nHe is hugely inconsistent. After there was political violence, he said the country must come together, then soon after called for the destruction of the left.\n\nHe primarily believes in himself.\n\nHe has a deep need for approval.\n\nHe is contradictory – he admires strength but seeks subservience.\n\nHe wants to be remembered for \"making America strong\" and respected.\n\nAnd China, which is expanding in the Pacific, lustfully eyeing Taiwan and both duchessing and spying on Australia.\n\nWill the US step in if needed?\n\nKIRCHICK: \"Well, he responds to strength in the way that, if you saw the Israeli attack on the Iranian nuclear sites, which was successful in its initial stage, and then he decided, all right, I want to be a part of this. I want to be able to claim credit for it.\n\n\"So if you're ever in some kind of spat with the Chinese in the Pacific, you better damn make sure you're doing well.\n\n\"If you're not doing well, then he's not going to come in and save you. I mean, he's just not.\n\nMITCHELL: Really? That's frightening to Australia. It is frightening.\n\nKIRCHICK: Look, I was maybe being a little facetious. I would hope in a situation like that, that Donald Trump has people around him, who would be telling him, 'Mr President, it's very important for the United States that we support our allies in this situation. It's good for us. It'll make us look strong. It'll make us respected. And it'll send a message to the Chinese. Don't f--- with us.'\"\n\nSo are the tantrums and absurdly extreme statements tactical or genuine? What do we believe?\n\n\"He's a salesman and he always has been. If you look at where his money came from, it's from selling things.\n\n\"Like many salesmen, he makes big, grand promises. That's just part of his nature, that's part of his personality.\n\n\"And I do think to some extent in his negotiating strategy and he's very open about this, he puts it on the table and his opening offer will be something outrageous, you know, just something totally outrageous.\"\n\nFinally, although it makes the left shudder, does he really want the Nobel Peace Prize?\n\n\"I think he absolutely wants it. He's been saying for a long time that he deserves the Nobel Peace Prize.\n\n\"And by the way, I would say he deserves it a lot more than Barack Obama did.\n\n\"Barack Obama got it eight months into his presidency.\n\n\"He didn't do anything.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/wage-theft-in-australia-worst-sectors-jobs-revealed/8a86cf05-6f8f-4195-996d-61c873c6222d",
        "title": "Aussies have been repaid $1.76 billion in lost wages - who are the worst offenders?",
        "publish_date": "Mon, 06 Oct 2025 00:59:58 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Wage theft has more than doubled in Australia in the past five years, according to a new analysis of data from the Fair Work Ombudsman.\n\nSoftware company Reckon published the report , which also detailed the worst sectors for wage theft.\n\nOverall, in the financial years from 2019-2020 to 2023-2024, more than 16,700 investigations into wage theft were completed, with 9401 businesses (56 per cent) found to be non-compliant.\n\nAustralians have been repaid $1.76 billion in lost wages in recent years. (Getty Images/iStockphoto)\n\nMore than $1.76 billion was repaid to workers in that time, with penalties increasing sharply.﻿\n\nDuring the past five financial years, the public administration and safety sector recorded the highest rate of wage non-compliance in Australia, with 932.3 non-compliant businesses per 100,000.\n\nThis led to more than $270,000 being repaid to workers within the sector.\n\nThe accommodation and food services industry ranked second, but surpassed the public administration and safety sector in both number of requests for assistance, or RFAs (11,369 to 1390) and number of non-compliant businesses (2553 to 163).\n\n\"Our research reveals that wage theft continues to be a significant issue across Australia, with over 16,700 investigations completed and more than 9400 businesses found non-compliant over the past five financial years,\" Reckon chief executive Sam Allert said.\n\n\"The scope of this issue is highlighted by the $1.76 billion that was repaid to workers, emphasising the far-reaching consequences for businesses that fail to comply.\"\n\nREAD MORE: Masked attackers set UK mosque on fire with people inside\n\nMining workers were one of the workforces most affected. (Getty)\n\nThe other industries that landed in the top 10 worst wage theft offenders - judged by how many businesses per 100,000 Reckon found to be non-compliant - included administrative and support services (281.8); other services (221.2); retail trade (199.6); electricity, gas, water, and waste services (199.3); transport, postal, and warehousing (198.2); arts and recreation services (195.5); manufacturing (179.8); and mining (177.8).\n\nMining was at the top spot in terms of the average amount of money recovered per non-compliant business, at more than $4.5 million.\n\nThat was followed by the utilities service sector at more than $2.5 million.﻿\n\nThe report also found wage theft levels differed state to state, with the Northern Territory the worst offender in relative terms, followed by Tasmania, Queensland, South Australia, the ACT, Victoria, New South Wales, and Western Australia.\n\nThe data also appeared to show most wage theft inquiries were initiated by employees rather than self-reported by employers - though an RFA is not a per se indicator of any discrepancy in remuneration.﻿\n\n\"Businesses can protect themselves by regularly reviewing payroll systems, staying informed about industry-specific regulations, and promptly addressing any discrepancies,\" Allert said.\n\n\"By implementing robust compliance frameworks, investing in ongoing training, and utilising technology, businesses can not only avoid the costly consequences of non-compliance but also build a strong level of trust with their employees, ensuring a fairer and more sustainable work environment.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/queensland-fires-floods-storm-seasonemergency-season-prep/105860906",
        "title": "Dozens of fires burn across Queensland as severe weather season looms",
        "publish_date": "Tue, 07 Oct 2025 01:33:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Just a day after crews contained an out-of-control bushfire — and with 60 fires currently burning across the state — Queenslanders are being urged to prepare for an impending severe weather season.\n\nParts of the state are still reeling from last season's flooding, storms and rainfall, with the majority of council areas disaster-declared already.\n\nLoading...\n\nA blaze on Moreton Island — believed to have been sparked on Saturday by a campfire while an active fire ban was in place — burnt 2,300 kilometres before it was brought under control.\n\nElsewhere, two fires are continuing to burn in the Bundaberg region with both at watch and act levels.\n\nA fire ban across Central Queensland has been extended until October 10, while a fire ban remains in place for the state's south-east.\n\nLarge swathes of Queensland are also experiencing above-average temperatures, with about 60 fires burning on Tuesday.\n\nIn some places, recovery is sitll underway from events like ex-Tropical Cyclone Alfred. (ABC News: Syan Vallance)\n\nQueensland Fire Department Commissioner Steve Smith said the fire season was looking \"average\", but high fuel loads from multiple recent wet seasons was a risk.\n\n\"As we've seen over the last week, we'll have these bursts of severe activity,\" he said.\n\nCommissioner Smith said the frequency and intensity of bushfires had increased in recent years, and it was \"frustrating\" to have to respond to fires like the one on Moreton Island, which was believed to have been entirely avoidable.\n\nCommunities still reeling\n\nSpeaking on Tuesday morning, Emergency Services Minister Ann Leahy said many communities were still feeling the impacts of extreme weather.\n\nBetting on the weather emerges as a solution as insurance costs skyrocket Photo shows Two woman stand in a burnt building with masks on Amid more extreme weather events, parametric insurance — described as a bet on the weather —is on the rise. It is now being touted as a possible solution for Australians, who have some of the highest insurance losses in the world.\n\nShe said 73 of 77 local council areas were already disaster-declared, following flooding and storms from last season.\n\n\"We still have places that are recovering from the events of this year,\" she said.\n\nState Disaster Coordinator Christopher Stream said Queensland experienced some \"record-breaking\" events last disaster season, and was the most impacted by disasters in the country.\n\n\"We know that Queensland is experiencing more disasters, more intense disasters,\" he said.\n\nNot just fire\n\nFire bans are in place across a large swathe of Queensland. (ABC News: Molly Slattery)\n\nThe Bureau of Meteorology's (BOM) long-range forecasts are predicting above-average rainfall for the state's south-east and far north between now and January.\n\nSevere storms are also expected, while an average of three to four tropical cyclones cross Australia's coast each season.\n\nFlooding from Tropical Cyclone Jasper caused extensive damage. (Supplied: Transport and Main Roads Queensland)\n\nBrisbane Lord Mayor Adiran Schrinner said residents needed to be ready for \"quite violent storms\".\n\n\"Every summer ... we want to make sure that people are aware that it can be any kind of natural disaster that comes our way,\" he said.\n\n\" We started this year with a cyclone that no-one expected, we've just had, over the weekend, bushfires raging. \"\n\nParts of Brisbane are experiencing \"unseasonable\" temperatures. (ABC News: Curtis Rodda)\n\n'Unseasonable' warmth in Brisbane and the south-east\n\nAbove-average temperatures being experienced around Brisbane and parts of the state's south-east are forecast to remain throughout the coming week, according to the Bureau of Meteorology.\n\nSpring heatwave increases fire risk as scores of blazes burn in Queensland Photo shows A crowded beach in front of a city skyline. Temperatures could soar to almost 10 degrees above average this week, increasing the risk of bushfires that are already burning across the state.\n\nBOM senior meteorologist Harry Clark said temperatures of between 32 and 35 degrees Celsius being experienced throughout the region were roughly five degrees above average.\n\nOn Saturday, temperatures are expected to hit a \"quite unseasonable\" top of high 30s.\n\nMr Clarke said the \"phenomenal October heat\", which was being driven by a low-pressure trough funnelling warm winds over the region, would peak over the weekend.\n\nThere is also a chance of rainfall over the weekend, but Mr Clarke said that prediction was \"fairly hit and miss\".\n\nA total fire ban remains in place for south-east Queensland until 11:59pm on Tuesday, while fire bans in the state's central region — including the South Burnett, Bundaberg, Gladstone and Gympie areas — have been extended until October 10.\n\nHigh fire danger along the south-east coast is expected to drop back to moderate from Wednesday to Friday, although smoke haze is expected to linger throughout the coming days, Mr Clarke said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/nt-government-school-truancy-plan-backlash-education/105856318",
        "title": "NT parents referred to income management if kids fail to attend class",
        "publish_date": "Tue, 07 Oct 2025 01:15:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Parents in the Northern Territory who frequently fail to send their children to school without a valid reason will be referred to the Commonwealth for income management, under a new NT government policy.\n\nPreviously, the NT Department of Education and Training had the power to issue $370 fines and compliance notices to those parents, but only child protection officers could make referrals.\n\nThe policy, which comes into effect today, adds to the enforcement powers granted to officers last year as part of the NT government's broader strategy to improve dwindling school attendance rates.\n\nJo Hersey is the NT's education minister. (ABC News: Xavier Martin)\n\n'Get your kids to school'\n\nOn Monday, NT Education and Training Minister Jo Hersey said parents of \"chronically disengaged children\" would be considered for an income management arrangement on a \"case-by-case\" basis.\n\n\"We are making sure that we are not only getting back to basics, boosting literacy and numeracy in schools, but we want kids to actually attend school,\" she said.\n\n\" If you don't want to be income managed, and if you don't want a fine, get your kids to school. \"\n\nMs Hersey could not say how much of a parent's income would be quarantined under the scheme, or how it would be managed, calling those details \"operational issues\"\n\nShe claimed the Country Liberal Party (CLP) had \"returned 328 students to classrooms\" since it came to power in August 2024.\n\nIndigenous advocates say the plan will disproportionately impact remote communities. (Supplied: Facebook/NT Department of Education)\n\nPeople on income management in the Northern Territory have some of their Centrelink payment quarantined into a separate account which can only be spent on essentials.\n\nThe new policy effectively removes a step from the NT government's previous process to recommend income management for parents of children who fail to attend school.\n\nLast year, Ms Hersey said the NT Department of Education could refer parents who failed to pay $370 truancy fines to the federal government for income management, based on NT provisions already in place.\n\nConcern policy may 'stigmatise families'\n\nJustine Davis says the move could create more stigma and access barriers. (ABC News: Dane Hirst)\n\nIndependent MLA Justine Davis said income management was not effective at addressing social issues and suggested the CLP was taking the \"lazy\" approach by punishing families.\n\n\"Multiple evaluations have shown it doesn't improve child outcomes, doesn't increase school attendance, and doesn't reduce disadvantage,\" she said.\n\n\" What it does do is stigmatise families, create barriers to accessing services, and add administrative burden without addressing the root causes of non-attendance. \"\n\nIn a statement, a spokesperson for human rights group Justice Not Jails said parents should be supported rather than punished when their children weren't going to school.\n\nThe group said there were \"many reasons why children may not feel they want to be at school\" and cited a 2024 NT Children's Commissioner report which found up to 80 per cent of children in the Northern Territory had experienced or observed racism at school.\n\nJustice not Jails also characterised the policy as \"a hark back to the paternalism of The Intervention\", \"whose humiliating policies undermined the autonomy and self-determining capacities of families and communities\".\n\nMarion Scrymgour says the federal government will decide if parents are involuntarily put on income management. (ABC News: Chris Murrkarany Fitzpatrick)\n\nNorthern Territory federal MP Marion Scrymgour questioned whether a \"punitive\" use of income management would improve outcomes and suggested the new referral pathway could instead be used as an opportunity to provide families with other government supports.\n\n\"This doesn't compel people to change their behaviour. We need to ask, how do we get better outcomes here?\",\" she said.\n\n\"Let's use this as an opportunity to work with those families, but also with the NT government, so that we can turn around these really bad outcomes that we have in our school system.\"\n\nMs Scrymgour said the Commonwealth had the final say on whether an individual was involuntarily placed on income management.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/boyer-pulp-mill-power-security-meeting/105860990",
        "title": "Future of Australia's last paper mill hangs in balance ahead of key energy talks",
        "publish_date": "Tue, 07 Oct 2025 01:11:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's last paper mill and supplier of newsprint remains locked in negotiations for power security, with owner David Marriner saying Tasmanian government-owned energy retailer Aurora has knocked back his offer for compromise.\n\nAs one of Tasmania's major industrials, the Boyer pulp and paper mill in New Norfolk is also one the state's largest power users.\n\nAurora Energy is seeking a $7 million bank guarantee to cover energy costs for the mill as it looks to electrify and move away from its coal-powered boilers.\n\nThe state-owned power business says credit security requirements are \"entirely consistent with the treatment of all other large electricity users in Tasmania\".\n\nAurora said it had been engaged in discussions since June this year, which had been \"constructive and flexible with Boyer management on the timing and parameters of credit security\".\n\n\"When it comes to large customer electricity bills, it is critical that Aurora Energy operates commercially and manages its financial risk, given 90 per cent of its dividend is returned to the Tasmanian people.\"\n\nDavid Marriner says Aurora's request for a $7 million guarantee is \"obscene\". (ABC News: Sophie Jaggers)\n\nMelbourne businessman David Marriner, who purchased the facility in February, said the proposal was unreasonable.\n\n\"It's just an insane, an obscene request,\" Mr Marriner said.\n\nThe Boyer Mill, which is currently Tasmania's fourth-largest carbon emitter, is working to convert its coal boilers to electric after years of energy concerns.\n\nLoading...\n\nKey negotiations to take place today\n\nA meeting about the power agreement is scheduled for Tuesday afternoon, with representatives from the mill, Aurora and the Tasmanian government set to take part.\n\nAhead of the meeting, Mr Marriner said his company's reply proposal of a $2.5 million guarantee and more frequent payments had not been accepted by Aurora.\n\n\"I certainly hope commonsense prevails [at the meeting] and I'm hoping that there is goodwill at the table at the present,\" Mr Marriner said.\n\nEnergy Minister Nick Duigan urged the two parties to negotiate in good faith. (ABC News: Ebony ten Broeke)\n\nMr Marriner, who is also scheduled to meet with the facility's 300 staff today, said his company was \"absolutely committed\" to securing the best outcome.\n\n\"I know what it's like to see a factory close down. Once that happens, it's never likely to reopen,\" he said.\n\n\"We're there to make sure we can secure the ongoing future of the mill, secure the future of their jobs.\n\n\"These are people who have an enormous responsibility to carry on an 80-year legacy.\n\n\"I will be in the trenches with them to see that their job is continued, and certainly do the best that we can possibly do.\"\n\nThe paper mill is Tasmania's fourth-largest carbon emitter. (ABC News: Ebony ten Broeke)\n\nTasmania's energy minister, Nick Duigan, urged both parties to continue negotiating in good faith.\n\n\"Aurora must always act in the best interests of Tasmanians taxpayers,\" he said.\n\n\"We encourage the new owner of Boyer to invest in the business.\"\n\nPower will be cut if negotiations fail, owner says\n\nThe mill is Australia's last paper mill and producer of newsprint, which is used for newspapers, and the uncertainty of its operations comes at a time that print media is also in decline.\n\nPaper mill owner told no spare energy for electric conversion Photo shows Building with thick white steam coming out Australia's only paper mill uses coal-fired boilers, which its new owner wants to convert to electric. But he says he has been told there is not enough local power in the Tasmanian grid to support this.\n\nIts boiler, installed in 1991, consumes about 88,000 tonnes of coal from New South Wales each year.\n\nMr Marriner wants to change that by going electric — as the previous owners, Norwegian company Norske Skog, had also explored.\n\nBut supplier Hydro Tasmania has consistently pushed back on this — arguing there is not enough power in Tasmania's grid to supply the facility.\n\nThe mill would instead need to import electricity from Victoria.\n\nMr Marriner said he was told power to the mill would be cut if negotiations fail at today's meeting.\n\nThe union says generations of families have worked at the mill. (ABC News: Luke Bowden )\n\nThe Australian Manufacturers Union's state secretary, Jacob Batt, said workers were \"incredibly concerned\" about the direction of negotiations.\n\n\"It really puts a lot of pressure on the company and on the jobs,\" Mr Batt said.\n\n\"Some of the workers at the mill, generations of their family, have been working at the Boyer Mill since it started.\n\n\"There's a long history of families in the Derwent Valley that have worked at the mill. Some of the workers there themselves have been working there for over 40 years.\n\nMr Batt said along with the mill's 300 employees, there were 1,000 indirect jobs connected to the mill, including timber workers.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/neighbours-fans-rush-to-find-props-donated-to-melbourne-op-shops/105858078",
        "title": "'It's a storyline from Neighbours': Op shops serve up a slice of TV history",
        "publish_date": "Tue, 07 Oct 2025 01:00:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Rebecca Brewin dropped into her local op shop in Melbourne's east a few days ago, she had no idea she was just a footstep away from some pieces of Australian television history.\n\n\"I go in there a lot and I've developed a bit of a friendship with Michelle, the manager,\" Ms Brewin said.\n\n\"She said 'oh come out the back, I've just had the weirdest donation.'\"\n\nFake drivers licences and Medicare cards were found inside Dr Karl Kennedy's medical bag donated to a Forest Hill op shop. (Instagram: becbrewinthrift)\n\nOut the back of the This N That Community Op Shop in Forest Hill, amongst piles of ornaments, table lamps and other homewares were Erinsborough High school bags, fake licences, fake Medicare cards, keys on a Lassiters Spa key ring and a familiar looking bag.\n\nLoading Instagram content\n\n\"She showed me this briefcase which turned out to be Dr Karl's medical bag.\"\n\nThree weeks ago, Michelle (who asked that her surname not be used) was approached by someone who had three van loads of donations.\n\n\"They said 'oh it's from the set of Neighbours,'\" Michelle said.\n\n\"I was like 'oh, that's pretty cool.'\"\n\nMs Brewin asked Michelle if she could post a video of the donations on her social media channels.\n\n\"They went to so much detail,\" Ms Brewin said.\n\n\"I had no idea that they would have created fake drivers licences, fake IDs, fake bank cards for all these characters.\"\n\nMichelle confesses to being more of a Home and Away fan and said she did not expect what happened after Ms Brewin posted her video.\n\n\"Over the weekend, we opened at 10am and we had a line of people out the front, we were just inundated.\"\n\nShe said she had phone calls from the UK, New Zealand and around Australia.\n\n\" We're just a little op shop that didn't expect this to blow up and go this viral. \"\n\nFrom the small screen to a suburban second-hand store\n\nJust like when any family moves, all the possessions no longer needed to create the homes of the fictitious residents of Ramsay Street have been donated to op shops around Melbourne.\n\nAfter four decades, filming of the Australia television show has come to an end — for a second time.\n\nOnly a footstep away Photo shows A man and a woman embrace, while looking at the camera. After nearly 9,000 episodes, 63 weddings, 20 births and 68 deaths, Neighbours is coming to an end.\n\nStreaming service Amazon announced earlier this year that it was ceasing production of the internationally-renowned soapie after throwing the axed show a lifeline in 2022.\n\nAll the sets have been dismantled and decades of props, furniture and clothing have been given away, including to a number of unsuspecting thrift stores.\n\nMichelle said she had to knock back the furniture because her op shop was too small to hold it.\n\nBut she did accept pallets of mostly homewares and bags.\n\nLamps that once sat on a table of a restaurant in Neighbours are now up for sale at the op shop. (ABC News: Daryl Torpy)\n\nSome from the famous Kennedy household or the fictitious Lassiters Hotel have already been sold.\n\n\"People are like 'this was in the Kennedys' house!' and I'm like 'oh, I don't know,'\" she said.\n\n\" I would put things for $10 because I'd be like 'oh who wants this?' \"\n\nAndrew James does.\n\nMr James is in Melbourne from the UK, and arrived at the shop on Monday after visiting Pin Oak Court in the neighbouring suburb of Vermont South — the street where the show was filmed.\n\nHe said he had been a fan all his life and, after seeing the social media post, hoped to pick up a memento.\n\n\"I'd treasure it,\" he said.\n\n\"My mother will tell you that when I was a baby, the Neighbours theme tune used to stop me crying so it's been a big part of my life.\"\n\nNeighbours fan Andrew James went to the Forest Hill store to hunt memorabilia. (ABC News)\n\nMr James said he moved to Australia after becoming intrigued by the characters' lifestyle on the show.\n\n\"You'd see the characters in the sunshine, going out in the pool, things like that.\n\n\"I'm not looking to buy lots of things, just a small keepsake.\"\n\nSienna Macalister inspects a picnic basket used as a prop on Neighbours. (ABC News: Daryl Torpy)\n\nSienna Macalister was hoping to snap up a backpack, school dress or another prop from Erinsborough High.\n\nThe attire was more familiar to them than their own school uniform after they worked dozens of times as an extra in school scenes when they were a child.\n\n\"I was there when the school burnt down, when there was a school camp,\" they recalled.\n\nMore recognisable Neighbours props, like this Erinsborough High backpack, will be sold at a special evening organised by the Forest Hill op shop. (ABC News: Daryl Torpy)\n\n\"I was there very, very frequently to the point where my school turned around and said 'you can't do it anymore' because I was missing too much schooling.\n\n\"We changed schools so I could keep going.\"\n\nMs Macalister described their time on set as magical and said it had inspired them to pursue a career as an actor and writer.\n\nThey said they was relieved when Amazon saved Neighbours only to be disappointed by its second axing.\n\n\"I just think it's so important and such a crucial training ground for Australia, and also it's just such a fantastic show. It should continue.\"\n\nMuseum or op shop: Fans disagree on fate of props\n\n\"I recognised it! I can't remember which house it is from now, but …\"\n\nSarah Jones scored an ornament from the long-running soap.\n\nSarah Jones snapped up an ornament that she recognised from Neighbours. (ABC News: Daryl Torpy)\n\nShe went to the Forest Hill op shop to try to \"rescue\" some items to send to Neighbours fans in the UK.\n\n\"It's a bit upsetting really that they would just dump some of this stuff that people would really treasure,\" Ms Jones said.\n\n\"A lot of people have said it should go into a museum or something.\n\n\"Things like this, it's just a little cheap ornament, but some of the things there like the scripts and characters' iconic costuming, it's just kind of a bit disrespectful to the show really.\"\n\nFellow Neighbours fan Michael Drake disagrees.\n\n\"Karl's briefcase should be in a museum, I reckon, or on display saying 'not for sale,'\" he said.\n\n\"[But] in a way, I don't think it is disrespectful. It's sort of giving fans of Neighbours a chance to own a piece of the show.\"\n\nMichael Drake says Neighbours was life-changing for him. (ABC News: Daryl Torpy)\n\nMr Drake drove across Melbourne to see what he could find.\n\nHe said the show played an important role in his life.\n\n\"It's saved me through so many things growing up,\" he said\n\n\"I struggled with my identity in a way and when they introduced the first gay character, Chris, years ago, I still remember it.\n\n\" That just helped me accept my myself and let me enjoy life a bit more. \"\n\nHe said he was glad the memorabilia had been donated to a small community store instead of the larger op shop.\n\nMatthew Myers found a vase that had been used in Neighbours. (ABC News: Daryl Torpy)\n\nMatthew Myers runs a website featuring celebrity interviews and reviews.\n\nHe thinks the props ending up in op shops is fitting.\n\n\"It's kind of like a story that would be on Neighbours!\" Mr Myers exclaimed.\n\n\"It would have made a great story for Dr Karl to come in here and find his attache case.\"\n\nNot good friends — lawyers make demands after donation\n\nThe volunteer-based op shop is linked to the Lutheran church, and manager, Michelle, said the money goes to helping people in the community with things like hospice care and children's camps.\n\nA Medicare card prop from Neighbours was found inside a wallet amongst the donations. (Instagram: becbrewinthrift)\n\n\"We're very community based, we'll help people like single mums and people leaving domestic violence and things,\" she said.\n\nCostumes from Neighbours were donated to a Fitzroy op shop. (ABC News: Shannon Schubert)\n\nMore iconic props, including Karl Kennedy's briefcase, the school bags and umbrellas with the Neighbours logo remained in storage to be sold off at a special, invitation-only event.\n\nThe details, including the date and whether it would take the form of an auction or another type of sale, were yet to be confirmed.\n\nBut what Michelle could say was that it would not include donated scripts of episodes yet to be aired.\n\nLate on Monday morning, she got a phone call from lawyers demanding she destroy the scripts, which she said she would do.\n\nMeanwhile, more props have been spotted at other op shops in and around Melbourne, including clothing at the Sacred Heart Mission store in Fitzroy.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/midlife-loneliness-rises-canberra-as-cost-of-living-bites/105860924",
        "title": "Midlife loneliness on the rise in Canberra as financial pressures bite",
        "publish_date": "Tue, 07 Oct 2025 00:55:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Loneliness is rising fastest among Canberrans in their 30s and 40s, with new research showing this cohort is now more likely than younger people to report feeling lonely.\n\n\n\nThe University of Canberra's latest Living Well in the ACT Region report, released this week by the Health Research Institute, found that one in five respondents — or 18.8 per cent — aged 30 to 49 reported feeling lonely \"often\" or \"always\".\n\nThe result marks a shift from last year, when 18 to 29 year olds reported the highest rates of loneliness in the ACT.\n\n\n\nDrawn from a survey of more than 3,100 ACT residents conducted in late 2024, the findings also point to a broader decline in wellbeing across the population.\n\nAbout 31.2 per cent of all respondents reported low levels of wellbeing — the highest since the survey began in 2019 — echoing trends seen in national wellbeing and happiness data.\n\nUniversity of Canberra Associate Professor Jacki Schirmer says the rise in the cost of living led to the shift. (ABC News: Mark Moore)\n\nLead researcher Associate Professor Jacki Schirmer said financial pressure and time scarcity were compounding social disconnection.\n\n\"Particularly people aged 30 to 49 — you've got kids at home, they might have a big mortgage,\" Associate Professor Schirmer said.\n\n\" We're seeing a lot of stress in that group that wasn't there a few years ago. \"\n\nAssociate Professor Schirmer said the cost-of-living crisis was impacting people's social expenditure.\n\n\"A bit over two in five Canberrans said they've cancelled one or more social events in the last year because they were struggling financially. So they couldn't afford the coffee at the cafe, the restaurant dinner or to bring something to the BBQ,\" she said.\n\n\"These things are really intersecting. We already had some challenges with social connection, and it's become bigger as people struggle financially and experience those cost-of-living pressures.\"\n\nCommunity connection rebounds — for some\n\nDespite worsening loneliness for midlife adults, the report found that community participation had improved overall.\n\nThe share of ACT residents regularly taking part in community activities rose to 66.4 per cent by the end of 2024 from 55 per cent in early 2023.\n\nIn Canberra, community-led organisations were helping drive that shift.\n\n\n\nFormer Brumbies and Wallabies player Ben Alexander co-founded Running for Resilience nearly six years ago with Matthew Breen, after being approached by the young Brumbies fan to host a social run. Mr Breen had recently lost his father to suicide and his mother had just received a cancer diagnosis.\n\n\"We thought this was just a one-off run to try and get people active,\" Alexander said.\n\n\" But over the years, we've realised social connection is probably almost more important for mental health than exercise, which was a huge shock to me and made me realise I was incredibly lonely in the years after retiring. \"\n\nBen Alexander says he has realised the importance of social connection in recent years. (Hannah Johnston)\n\nWhat began as a small run followed by a free beer at The Dock in Kingston, has since developed into a registered charity that now hosts up to 16 weekly events across Canberra, including running, walking, yoga, and pickleball sessions.\n\n\"People come to get fit, but they stay for the connection,\" Alexander said.\n\n\"We're really trying to make it so easy for anyone to rock up, do some exercise, and have a chat with someone and make a friend.\"\n\nChoir offers connection through music\n\nIn north Canberra, another group finding strength in shared connection is the LGBTQIA+ community choir QWire.\n\nConvenor Erin Pynor said membership had grown from fewer than 100 to about 150 singers in the two years since she joined, with many new members aged 30 to 49.\n\n\"We're seeing people use [QWire] as a way to meet others — some are into music, some just love the queerness, the community, the connection they're getting here,\" they said.\n\nErin Pynor has found a sense of community by singing with Canberra Qwire.\n\nThe choir rehearses weekly in Lyneham and performs regularly at community events and concerts.\n\n\"I fit firmly into the [30–49] cohort myself and joined [QWire] to find community when I moved back to Canberra after a period away,\" Erin Pynor said.\n\n\"It really was just like a life-transforming kind of thing.\n\n\" I now have someone who sells eggs and I get them every week, someone else nearby who I carpool with, and another who has small children — we have play dates and things like that. \"\n\nOver-65s 'doing pretty well'\n\nThe survey shows that while loneliness remains a concern for many Canberrans, older adults, particularly those aged 65 and higher, are reporting notably high levels of wellbeing.\n\n\"They're doing pretty well,\" Associate Professor Schirmer said.\n\n\"Even some of the groups that typically have very high wellbeing saw a little bit of a loss, but that 65-and-over demographic — if you're in a good relationship and own your home — then you've got a much higher likelihood of having good levels of wellbeing than a lot of other groups.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/ac-milan-to-play-in-perth-as-uefa-says-it-is-regrettable/105861238",
        "title": "UEFA makes 'regrettable' decision to allow Italian Serie A match in Perth",
        "publish_date": "Tue, 07 Oct 2025 00:16:24 +0000",
        "category": "sports",
        "authors": [],
        "text": "Seven-time European champions AC Milan are heading to Perth to play an Italian league game in a historic but controversial first.\n\nThe Union of European Football Associations (UEFA) has \"reluctantly\" agreed to allow a regular Serie A match between Milan and Como to be staged in the West Australian capital in February.\n\nEuropean football's governing body also said on Monday it would permit Barcelona and Villarreal to play their December Spanish league clash in Miami.\n\nHowever, UEFA said it disapproved of clubs taking matches overseas and would work to prevent this setting a precedent.\n\nFédération Internationale de Football Association (FIFA), the international governing body, must also assent to the games, but that is expected to be a formality.\n\nSpain's La Liga has been pursuing a transatlantic vision for almost a decade, emulating the strategy employed by the NFL and NBA to establish themselves in other markets.\n\nSpain and Italy have already held Super Cup matches overseas.\n\nThe Premier League considered the concept 17 years ago but shelved it due to supporter opposition.\n\nGermany's Bundesliga has said it has no plans to take games abroad.\n\nMilan decided to move its game after learning the San Siro stadium would be unavailable while the city and venue prepared to host the Winter Olympics opening ceremony on February 6.\n\nPerth has been chosen, in part, as the club has been cultivating links with Australia for many years, not least due to the huge Italian diaspora present.\n\nMilan played Roma in Perth in 2024 and the Glory in July this year.\n\nThe Roma match was at Perth Stadium, drawing 56,522 fans, and it is anticipated that the Rossoneri will play Como at the same venue.\n\nBesides its continental success, the club has won 19 domestic titles, most recently in 2022.\n\nThe current squad includes former Real Madrid star Luka Modric, of Croatia, Christian Pulisic from the US, and Portugal's Rafael Leao.\n\nComo, coached by ex-Arsenal, Chelsea and Barcelona star Cesc Fabregas, has Spain's Alvaro Morata and Brazil's Diego Carlos in its ranks.\n\n'It is regrettable'\n\nFor decades, many notable foreign clubs have played friendlies in Australia, but this will be the first major competitive club game involving overseas teams.\n\nUEFA's hand appears to have been forced by a court case successfully brought by an American promoter, who wanted to stage matches in the US.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nFIFA withdrew from a legal action brought by Relevent in a Manhattan court 18 months ago and subsequently formed a working group, including UEFA lawyers, that is yet to report.\n\nIronically, Relevent has since become a key commercial partner of UEFA.\n\n\"League matches should be played on home soil; anything else would disenfranchise loyal match-going fans and potentially introduce distortive (sic) elements in competitions,\" UEFA president Aleksander Ceferin said in a statement.\n\n\"While it is regrettable to have to let these two games go ahead, this decision is exceptional and shall not be seen as setting a precedent.\n\n\"Our commitment is clear: to protect the integrity of national leagues and ensure that football remains anchored in its home environment.\"\n\nSerie A president Ezio Simonelli took a different view.\n\n\"For us, a contingency due to the unavailability of San Siro stadium has turned into an opportunity to satisfy the many fans of Italian football, who will have the chance to watch the match live in Perth,\" he said.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/northern-food-bowl-dream-struggles-amid-climate-change/105847668",
        "title": "Farmer says northern food bowl a 'pipe dream' amid changing climate",
        "publish_date": "Tue, 07 Oct 2025 00:01:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Abundant water, wide stretches of undeveloped land, and proximity to Asia once positioned northern Australia as the nation's next big food bowl.\n\nBut that dream has largely wilted under the weight of economic pressures, logistical challenges, and a changing climate.\n\nParker Poynt Packhouse founder Quentin Parker has lived in the Ord Valley for nearly 40 years — home to the highest average temperature of any mango-growing region in the north, and about 3,000 kilometres from Perth.\n\nNow retired, he still maintains about 460 mango trees on his property, though they yield little fruit.\n\nQuentin Parker says the productivity of his trees has dropped significantly. (ABC Kimberley: Jess Baker)\n\nHe said business was booming for a time, but things changed after 2011.\n\n\"[2011] was the biggest year. I did 123,500 trays that year,\" he said.\n\n\"And then, the following year, I think it was 70,000-odd.\n\n\"I thought my throat had been cut.\"\n\nSince then, the number of trays processed through his business has fallen by about 10,000 each year.\n\nIn 2024, he processed just 2,500 trays.\n\nThis year, he expects to hand-pack only 500.\n\nMr Parker suspects changing climate patterns may be partly to blame, but admits it is hard to say for sure.\n\n\"I don't know, we're doing something wrong with the world,\" he said.\n\nThe mango trees on Quentin Parker's property yield little fruit nowadays. (ABC Kimberley: Jess Baker)\n\nMr Parker described the idea of northern Australia becoming a food bowl as a \"pipe dream\".\n\n\"Unless we can attract a whole new generation of pioneers here, probably we're not going to see it,\" he said.\n\nBig vision, harsh reality\n\nCentral to the food bowl vision were Lake Argyle and Lake Kununurra in Western Australia's East Kimberley region.\n\nThe lakes were formed by damming the Ord River in the 1960s and 70s and diverting it into the Ord River Irrigation Scheme, enabling large-scale farming near Kununurra.\n\nEarly plans envisioned the scheme would turn the remote north into a major food-producing region, growing crops such as cotton, sugarcane, and rice.\n\nLake Argyle was formed in 1973 to supply water to the Ord River Irrigation Area. (ABC Rural: Matt Brann)\n\nBut not everyone agreed with that vision, even within government.\n\nIn 2014, then-agriculture minister Barnaby Joyce dismissed the idea that Australia could feed Asia's growing population.\n\n\"We only produce about one per cent of the agricultural product of the world and to start saying that this country … is going to be a predominant player on the global stage is not correct,\" he told ABC News Breakfast at the time.\n\n\"We couldn't even feed half of Indonesia … stop talking about 'we're going to feed the whole of Asia.'\"\n\nFormer agriculture minister Barnaby Joyce talked down claims Australia could 'feed the whole of Asia'. (AAP: Lukas Coch)\n\nClimate risk rising\n\nThe federal government's newly released National Climate Risk Assessment predicts northern Australia will face increasing hazards as global temperatures rise.\n\nCentral Queensland University adjunct professor of environmental geography Steve Turton said the region was nearing its \"thermal limits\" for cropping and cattle, effectively ending the food bowl dream.\n\n\"[If] we don't take the right course, then I do believe that it's dead and buried,\" he said.\n\n\"We are near the top of thermal limits for a couple of important tree crops like mangoes and avocados.\n\n\"[They're] not getting enough cool nights in the winter when they need to flower or have fruit set.\"\n\nA new role for the north\n\nCooperative Research Centre for Developing Northern Australia chief scientist Allan Dale said the food bowl dream was outdated.\n\n\"About 10 years ago, the idea of the north being the biggest, best food bowl for the wider south-east Asian region and beyond was really modified,\" he said.\n\n\"There was a shift in language from the north being the food bowl to the north being a very targeted, very powerful agricultural development opportunity.\"\n\nThe Ord Valley is known for diverse agriculture, particularly cotton, grains, and horticultural crops. (ABC Kimberley: Alys Marshall)\n\nDr Dale said the region had a crucial role to play, particularly as southern Australia faced increased drought risk.\n\n\"We know we're going to have greater drought risk in the south, and if northern Australia gets its agricultural development right, then it actually becomes extremely important for Australia's overall climate resilience,\" he said.\n\nDr Dale emphasised the need for strong collaboration across governments, industries, communities, and traditional owners to realise the region's potential.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/lebron-james-teases-second-decision-retirement-speculation/105860846",
        "title": "LeBron James teases 'Second Decision', prompting retirement speculation",
        "publish_date": "Mon, 06 Oct 2025 23:51:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "LeBron James has once again got the eyes of the NBA world on him, and he did it with a 10-second clip on social media.\n\nHeading into his 23rd NBA season, James posted to his accounts a mysterious video of himself walking to a chair across from an unknown interviewer in the middle of a basketball court.\n\nThe video is accompanied by the phrase \"The decision of all decisions\", with the full reveal apparently set for 1am Wednesday AEDT.\n\nNaturally, speculation immediately began that it was a retirement announcement.\n\nJames will turn 41 on December 30, two months into the 2025/26 season, when he will play his second season alongside son Bronny with the Los Angeles Lakers.\n\nWhen he turns out for his first game, presumably in the Lakers' season opener against Golden State on October 22, he will break the record for the most seasons played in the NBA.\n\nIf he plays 50 games he will pass former Chicago and Boston centre Robert Parrish for the most games played in the league.\n\nSo a retirement announcement would not be unreasonable and would afford him a season-long farewell tour.\n\nThe title card of \"The Second Decision\" is an allusion to his infamous 2010 special The Decision, when he stunned the league with a free-agency move from Cleveland to the Miami Heat, where he formed a big three with Dwyane Wade and Chris Bosh to ultimately win two title championships.\n\nHe even appears to be wearing a similar checked shirt in both shoots.\n\nThe Decision sparked criticism of LeBron James and turned public opinion against him. (Larry Busacca: Getty Images)\n\nBut part of what made that moment in NBA history so shocking was the surprise.\n\nAlmost no-one knew exactly what was happening until James sat down with Jim Gray on a court at the Boys and Girls Club in Greenwich, Connecticut and the special aired on ESPN.\n\nIt was perhaps the first major scandal of James's career after being drafted by the Cavaliers straight out of high school in 2003, with the NBA superstar criticised for drawing out the announcement that he would \"take [his] talents to South Beach\" until half an hour into the program.\n\nLeBron and Bronny share NBA court Photo shows LeBron James and Bronny James walk onto the court together in an LA Lakers NBA game. LeBron James and Bronny James check into the Lakers' season opener together, becoming the first father-son duo to play together in an NBA game.\n\nIt stunned the Cavaliers and the rest of the NBA, which is why the tease this time has raised some eyebrows.\n\nJames is a savvy operator, with a production company of his own and any number of business interests and endorsements.\n\nOne of those, Uninterrupted, replied to the video on Instagram with: \"All eyes on this moment.\"\n\nThe interviewer in the clip does not appear to be a well-known personality and it would be bold for James, who worked so hard to rehabilitate his reputation after the first Decision, to hearken back to it in announcing the end of his career 15 years later.\n\nThat prompted questions from many on social media about whether this was a fake-out that would turn out to actually be an advertisement.\n\nJames pulled a similar trick in June for what turned out to be an Amazon promotion, although that time he did hashtag \"ad\" in the post.\n\nAs was the case in the middle of the year, Jeff Bezos's retailing goliath has another promotional event set to start on the same day of James's announcement.\n\nNBA content creator Molly Morrison summed up the vibe on X, writing: \"we live in such strange times because either this is an ad or the sports world will be turned upside down.\"\n\nBut that hasn't stopped fans rushing to buy tickets for what could be the last game of an NBA legend.\n\nTicket seller TickPick reported that prices skyrocketed for seats at the Lakers' last regular-season game against the Utah Jazz, the same team against whom Kobe Bryant finished his career with a famous 60-point outing.\n\nSeats had been selling for $85 but the cheapest available seat blew out to over $400 in the wake of his announcement.\n\nA poll on their X profile had hundreds of respondents with almost two-thirds predicting it would turn out to be an ad.\n\nRegardless of what happens, a retirement decision cannot be too far away for the 40-year-old.\n\nHe is a four-time NBA champion with three teams (Miami 2012-13, Cleveland 2016, LA 2020), being named Finals MVP in all those campaigns, as well as regular season MVP four times. He is also the highest point scorer in league history.\n\nLast season he fulfilled what was perhaps his last stated goal, playing alongside Bronny after the Lakers drafted him late in the second round of the 2024 draft.\n\nBronny turned 21 the same day of LeBron's post.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/france-political-chaos-explainer-fifth-pm-in-two-years/105860746",
        "title": "Why has France gone through five prime ministers in two years?",
        "publish_date": "Mon, 06 Oct 2025 23:50:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "The sudden resignation of France's prime minister — the country's fifth in two years — has put President Emmanuel Macron in a bind.\n\nSébastien Lecornu resigned on Monday, just 14 hours after unveiling his new cabinet and less than a month after he was appointed PM.\n\nIt's become the latest saga in a period of almost ceaseless political uncertainty since Mr Macron dissolved the National Assembly in June 2024, triggering legislative elections that stacked the parliament's lower house with his opponents.\n\nHere's a closer look at the unprecedented political drama that's been roiling France since then.\n\nA 14-hour government collapses\n\nWhen Mr Lecornu tendered his resignation on Monday morning, he pulled the rug from under the new cabinet that he'd named less than 14 hours earlier.\n\nAgnès Pannier-Runacher, the newly reappointed Minister for Ecology and one of Mr Macron's loyal supporters, posted on X: \"I despair of this circus.\"\n\nMacron gives French PM two days to salvage administration after snap resignation Photo shows A man in a suit holds a press conference with a concerned expression. Mr Lecornu stepped down just 14 hours after naming his Cabinet, plunging France into another political crisis.\n\nWith ministers out of a job before they'd even had a chance to settle in, the collapse was a bad look for Mr Macron.\n\nIt reinforced the impression the French leader — who famously described himself as \"the master of the clocks,\" firmly in control, on his way to winning the presidency for the first time in 2017 — is no longer in command of France's political agenda.\n\nPerhaps more damaging for Mr Macron were the reasons Mr Lecornu gave for his resignation.\n\nHe explained that the job he was given less than a month ago, after the previous prime minister was tossed out by a National Assembly vote, had proven to be impossible.\n\nFrancois Bayrou was ousted as prime minister in September. (AP: Christophe Ena)\n\nMr Lecornu said three weeks of negotiations with parties from across the political spectrum, unions and business leaders had failed to build consensus behind France's top domestic priority: agreeing on next year's budget.\n\n\"Being prime minister is a difficult task, doubtless even a bit harder at the moment, but one cannot be prime minister when the conditions aren't fulfilled,\" Mr Lecornu said.\n\nWhy does France have a president and a prime minister?\n\nFrance has a semi-presidential system of government, with power shared between the president and prime minister.\n\nEvery five years, the French people elect a president, who then appoints a prime minister — which also requires the parliament's approval.\n\nLoading...\n\nWhile the president's domain is foreign policy and defence, the prime minister handles domestic affairs.\n\nLuc Rouban, a political science researcher at Sciences Po University in Paris, says it's unlikely Mr Macron will resign despite the internal instability.\n\n\"The central institution remains the president of the Republic ... he remains the leader on international affairs,\" he said.\n\nNo tradition of coalitions\n\nWhen the snap 2024 legislative elections called by Mr Macron backfired and delivered a hung parliament, he believed his centrist camp could continue to govern effectively.\n\nWith no stable majority, they needed to build alliances in the National Assembly.\n\nBut the 577-seat chamber has broadly been split into three main blocs — left, center and far-right — and none with enough seats to form a government alone.\n\nFrance has been in political turmoil since the June 2024 elections, which resulted in a divided lower house. (AP: Christophe Ena)\n\nFrance, unlike Germany, the Netherlands and some other countries in Europe, doesn't have a tradition of political coalitions governing together.\n\nMr Macron's political opponents, particularly those on the far-left and far-right, have repeatedly teamed up against the president's prime ministers despite their own ideological differences.\n\nThe French leader's minority governments have toppled one after another, with Gabriel Attal, Michel Barnier, François Bayrou and now Mr Lecornu falling since September 2024.\n\nAny successor Mr Macron chooses could be on similarly shaky ground.\n\nAnother dissolution possible\n\nThe alternative for Mr Macron would be dissolving parliament again, ceding to pressure from the far-right in particular for another unscheduled cycle of legislative elections.\n\nMr Macron has previously ruled out resigning himself, vowing to see out his second and last presidential term to its end in 2027.\n\nBut new elections for the National Assembly could be fraught with risk for the French leader.\n\nAnother election could result in more seats for far-right leader Marine Le Pen's party. (Reuters: Stephanie Lecocq)\n\nThe far-right National Rally party of Marine Le Pen, already the largest single party, could come out on top, an outcome that Mr Macron has long sought to avoid.\n\nMr Macron's unpopularity could also deliver a crushing defeat to his centrist camp, giving him even less sway in parliament than he has now.\n\nOr France could get more of the same political deadlock and turmoil.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/mystery-road-first-nations-writing-room-erica-glynn/105803594",
        "title": "Mystery Road: Origin screenwriter Erica Glynn has only ever written with mob",
        "publish_date": "Mon, 06 Oct 2025 23:13:53 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "It felt \"pretty amazing\" when Kaytetye woman Erica Glynn first walked into the writers' room for season two of ABC TV's Mystery Road: Origin.\n\nIt was the first time the series had an all-Blak writers' team, and it inspired an all-too-important level of trust for the screenwriter and director, known for Redfern Now and Black Comedy.\n\nThat trust was necessary considering the weight of the subject they were taking on: the Australian healthcare system, and the disparity between how it treats Indigenous and non-Indigenous people, as well as the part it played in colonial policies, like assimilation.\n\nIt was a \"tricky\" subject to tackle, Glynn admits.\n\n\"We're all dependent on a fairly luxurious national health system … but there are flaws, particularly in remote areas, and it's a fact of life,\" she says.\n\n\"Things go awry and things bugger up, and that's the truth.\"\n\nMary and Detective Jay Swan return for the second season of Mystery Road: Origin. (Supplied: Bunya Productions)\n\nIn season two of Mystery Road: Origin, junior Aboriginal detective Jay Swan (Mark Coles Smith), and his wife Mary (Tuuli Narkle) have moved from Jay's hometown of Jardine (the setting of season one) to the fictional town of Loch Iris.\n\nIt's around the time of the Sydney 2000 Olympics, and the couple are preparing for the birth of their first child. But their lives are disrupted when another child goes missing.\n\nPast Jay stories — including the original 2013 movie, Mystery Road, starring Aaron Pedersen — have seen the steely detective take on the justice system through an Aboriginal lens. But in season two of Mystery Road: Origin, Jay finds himself up against medical institutions.\n\nGlynn and her fellow writers — Steven McGregor, Jada Alberts, Gary Hamaguchi and Samuel Nuggin-Paynter — were all intimately familiar with how Australia's medical system can fail Indigenous people, whether from their own experiences or those of their loved ones.\n\nOn the set of drama miniseries True Colours, which Glynn co-wrote and directed. (Supplied: Bradley Patrick)\n\nThat informed the writing of season two of Mystery Road: Origin.\n\n\"Often, you're talking about very fragile, personal stuff [in a writers' room],\" says Glynn.\n\n\" So, there was a level of trust around all of that sharing and getting to the guts of what is quite a prickly subject for our nation. \"\n\nWriting with mob\n\nAn award-winning screenwriter and director, Glynn cut her teeth working at the Central Australian Aboriginal Media Association (CAAMA) over three decades ago, and more recently co-created the crime drama series True Colours.\n\nHaving originally trained as a director, she initially came to screenwriting out of frustration.\n\n\"No-one was writing the scripts that I wanted to make as a director, so I had to start writing and found this whole new realm of creativity that I really, really love,\" she says.\n\nNow, Glynn does more screenwriting than anything else. And, as a fan of the series, was \"thrilled\" when she found out there was a spot for her on Mystery Road: Origin.\n\nIndigenous directors Wayne Blair (left) and Jub Clerc (right) on location with Mark Coles Smith. (Supplied: David Dare Parker)\n\nBut this wasn't the first time she's worked with an entirely Blak writing team. In fact, throughout her career, Glynn has exclusively written with mob.\n\n\"I've never been in a story room where it isn't all Blak,\" she says.\n\n\"That's either because I haven't done enough or because I'm lucky enough to be chosen to go into all these Blak story rooms.\"\n\nWriting enigmatic characters\n\nComing to such an established character was a challenge for Glynn. After all, Jay has been at the centre of two movies and two TV series.\n\nWhile the older Jay is guarded and weighed down with trauma, the detective of Origin believes justice is possible and can be a force for good.\n\nYet he's still enigmatic; his thoughts and feelings are rarely on the surface, even as he becomes more disillusioned with the systems in which he works.\n\nThat made him \"difficult\" to write.\n\nGlynn feels \"bloody good\" about herself for having cracked such a character as Jay (pictured). (Supplied: David Dare Parker)\n\n\"You've got to give him emotional intelligence without a lot of dialogue,\" she explains.\n\nThere were writers in the room who knew Jay \"very, very, very, very, very well\", which was both a huge positive, and a barrier of sorts.\n\n\"Even talking about him in the story room was frustrating for me because Steven McGregor — who's written on all of the series and is the lead Blak writer — would go: 'No, Jay Swan wouldn't do that',\" Glynn says.\n\nBut on the other side of that frustration came moments of breakthrough and \"feeling bloody good about yourself\" for having cracked the character.\n\nTelling authentic stories\n\nOne of the best things about having an all-Blak writing team is the variety of perspectives and experiences on the stories and themes in the show, Glynn says.\n\nThis was particularly important when writing about Swayze (Aswan Reid; The New Boy), a young boy who is first introduced when the car he's driving swerves into Jay's path.\n\nFeeling safe in an all-Blak writers' room meant Glynn could explore Swayze's (left) trauma. (Supplied: Bunya Productions)\n\nSwayze \"has fear in his heart\" and at times it's unclear whether his fear is a manifestation of his trauma or grounded in something more immediate.\n\n\"Getting inside [Swayze's] mindset was fresh turf for me and difficult,\" Glynn says.\n\n\"Particularly with a subject like this, it was just absolutely crucial that it was all Blackfellas doing it.\n\n\"Also, I felt safe in all of that to be able to express what I needed to express or to be dumb and not know stuff.\"\n\nShe says they could even laugh about some of it.\n\n\"Not the tragedy of it all, but just to be able to be light when we needed to have light. It can be a pretty dark subject matter.\"\n\nMore than anything else though, Glynn wants people to enjoy the mystery at the heart of the story and \"all those beautiful Blak faces on screen\".\n\n\"I want them to do that, but I also want them to be able to ponder something deeper about the state of our nation.\"\n\nStream the new season of Mystery Road: Origin free on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/asx-markets-business-live-news-october-7/104980306",
        "title": "Live: Gold hits record high, local markets open lower",
        "publish_date": "Mon, 06 Oct 2025 22:41:39 +0000",
        "category": "finance",
        "authors": [
            "Gareth Hutchens",
            "Nassim Khadem",
            "Emily Stewart"
        ],
        "text": "The latest ANZ-Roy Morgan consumer sentiment survey is also out today. It says consumer confidence fell 1.2 points last week:\n\nIt found \"weekly inflation expectations\" ticked up 0.1 percentage points.\n\nConfidence in financial and economic conditions weakened:\n\nMid-term economic confidence fell 0.6 points:\n\nAnd time to buy a major household item declined 1.6 points:\n\nAll-in-all, it seems like Australians are feeling a bit more pessimistic about the immediate future.\n\nANZ economist Sophia Angala explains things this way:\n\nThe RBA Board held the cash rate at 3.60% last week, with the post-meeting commentary a little more hawkish than we expected. This was likely a factor in the week’s 1.2pt fall in ANZ-Roy Morgan Australian Consumer Confidence.\n\nOn a four-week moving average basis, weekly inflation expectations are at their highest level since late January. This may have been influenced by the RBA’s post-meeting statement noting that Q3 inflation may come in higher than RBA expectations. We now expect a 0.9% q/q increase in trimmed mean (underlying) inflation in Q3, which suggests the RBA will hold the cash rate for the remainder of the year.\n\nWe now expect the RBA to cut the cash rate by 25bp in February 2026, and for the cash rate to then stay at 3.35% for an extended period.\n\nThe absence of a widely anticipated rate cut later this year could see a slowing of the consumer recovery.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/israel-premier-tech-cycling-team-changes-name-amid-protests/105860878",
        "title": "Israel Premier Tech cycling team changes name amid ongoing protests",
        "publish_date": "Mon, 06 Oct 2025 22:30:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Israel Premier Tech is changing its name and moving away from its national identity, the cycling team has announced.\n\nThe decision to drop \"Israel\" from its name comes less than two weeks after the team was excluded from a race in Italy over concerns about pro-Palestinian protests, and less than a month after the Spanish Vuelta was repeatedly disrupted by protests against Israel Premier Tech.\n\n\"With steadfast commitment to our riders, staff and valued partners, the decision has been made to rename and rebrand the team, moving away from its current Israeli identity,\" the team said in a statement on its website.\n\n\"In sport, progress often requires sacrifice, and this step is essential to securing the future of the team.\"\n\nSylvan Adams has decided to step back from the day-to-day running of the team. (Getty Images: Amir Levy)\n\nIt said co-owner Sylvan Adams, an Israeli-Canadian billionaire, had \"chosen to step back from his day-to-day involvement\" and would \"no longer speak on behalf of the team, instead focusing on his role as president of the World Jewish Congress, Israel.\"\n\n\"Although a new chapter awaits, one that will be revealed soon, the team will remain true to its founding promise: to develop cycling talent from around the world,\" the team said.\n\nPremier Tech is a multinational company based in Quebec, Canada. It had already indicated its intention to rebrand after widespread protests against the team.\n\nOrganisers of the Giro dell'Emilia race excluded Israel Premier Tech over possible disruptions if the team was to participate. During the Spanish Vuelta, several stages were disrupted, with some cut short and others interrupted.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-07/afl-trade-period-day-two-live-updates-merrett-curnow-petracca/105859160",
        "title": "Live: Saints and Suns reach agreement on Flanders deal as Blues nab big man",
        "publish_date": "Mon, 06 Oct 2025 22:07:31 +0000",
        "category": "sports",
        "authors": [
            "Chris De Silva",
            "Marnie Vinall"
        ],
        "text": "rank richmond, north, melbourne, essendon and west cost in whos in the best situation going forward - Josh which bottom 5 team is set up the best for the future - Andy\n\nA couple of questions around the bottom four-five clubs, so I'll answer all at once.\n\nI think out of Richmond, North, Melbourne, Essendon and West Coast, I'd probably be most excited about Richmond over the next five years.\n\nThe Tigers went so hard at last year's draft for a reason and it's going to be exciting to see them grow together. I'd say they're my top option.\n\nI still like North's list as well, I think they're chock full of talent, but I'm not sure whether Alastair Clarkson is the right guy to get that out of them.\n\nDespite all the doom and gloom around Essendon at the moment, I can see a method to what they're doing. They've been very deliberate with this build, and as long as they stay the course, the results should follow.\n\nWest Coast has perhaps the best young player in the comp locked up and could add the likes of Chad Warner in the coming years.\n\nMelbourne is the one I'm worried about, particularly after Max Gawn retires. That cupboard is looking really bare. They did well to add Harvey Langford last year, and need to add more young talent.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-pm-says-october-7-not-a-day-for-demonstrations-gaza-ceasefire-talks-underway-in-egypt-20251007-p5n0ji.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: PM says October 7 ‘not a day for demonstrations’; Gaza ceasefire talks under way in Egypt",
        "publish_date": "Tue, 07 Oct 2025 12:52:03 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Communications Minister Anika Wells is outlining powers the Triple Zero custodian will gain under the new legislation being introduced today.\n\n“From the 1st of November, telecommunications carriers will have to provide real-time reporting of outages to ACMA and to emergency services, they will also have to test Triple Zero during upgrades and maintenance and ensure calls fall back to other networks if needed,” she said.\n\n“Within six months of the commencement of this bill, the custodian, through ACMA, will issue additional performance requirements to telcos to ensure best practice,” Wells told parliament.\n\nCommunications Minister Anika Wells. Credit: Kate Geraghty\n\n“Telco providers know [that] under the law they must provide reliable access to Triple Zero. That is their legal obligation, and that’s why this morning, I met with the CEOs of Optus, Telstra and TPG-Vodafone ahead of the approaching natural disaster season. There are no excuses, and I made that crystal clear today,” she said.\n\nAmendments proposed by the government to the legislation allow ACMA to use directions to carriers to provide information, including technical details of an outage.\n\nACMA would also be able to compel carriers to share information or improve procedures to prevent repeated outages.\n\n“ACMA can compel timely information on the outages, nature, scale, impacts and restoration. Information gathered by ACMA will be provided to the custodian in a timely manner. The custodian will use this material to support its ongoing system-wide oversight of Triple Zero,” Wells said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/planning-and-budgeting/should-i-follow-social-media-gurus-money-advice-20251007-p5n0le.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Should I follow social media gurus’ money advice?",
        "publish_date": "Tue, 07 Oct 2025 12:44:44 +1100",
        "category": "finance",
        "authors": [
            "Paridhi Jain"
        ],
        "text": "I’ve been reading your articles on mindset and I wanted to know your thoughts on manifestation. I’m a pretty practical person. I’ve successfully built and sold a business before and am currently self-employed and make decent money. But I’ve been stuck at a specific income level for a while.\n\nI feel like there must be some ‘mindset blocks’ holding me back and I’ve been trying the manifestation techniques you hear about on social media – like visualising my income goal, ‘acting as if’ I already have it, etc. I’ll admit I haven’t seen many results, so I don’t know if I’m doing it wrong or if it’s all nonsense.\n\nChanging how you think can make you more money – just don’t call it ‘manifestation’. Credit: Simon Letch\n\nFor every finance bro on the internet selling you his secrets to ‘beat the market’ and ‘become a millionaire by 30’, there is a manifestation guru selling you on how to ‘quantum leap’ and ‘manifest your dream life’. So, is it all nonsense?\n\nFirstly, a good question to ask yourself here is: did the person claiming to ‘manifest’ money actually manifest it, or did they sell the idea of manifestation? For example, if they made $X selling a course, e-book, coaching program on manifestation, is that manifestation or is that just marketing and sales?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/the-ai-bubble-just-got-a-little-bigger-and-no-one-knows-when-it-will-burst-20251007-p5n0kb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The AI bubble just got a little bigger and no one knows when it will burst",
        "publish_date": "Tue, 07 Oct 2025 12:35:41 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The last tranche of those warrants can be exercised if AMD’s share price, which leapt more than 23 per cent on news of the deal to $US203.71, hits $US600. If all those warrants could have been exercised immediately, in agreeing to purchase AMD’s GPUs OpenAI would have created $US6.3 billion of value for itself from the $US63.4 billion the announcement added to AMD’s market capitalisation. Generative AI apps are tearing through workplaces and are now increasingly used for coding. Credit: iStock Altman has been engaged in a frenzy of high-stakes deal-making in recent weeks that adds up to mind-boggling sums. Apart from the Nvidia and AMD deals, he has committed to buying $US300 billion of computing power from Oracle and is partnering with Oracle, Microsoft, Softbank, Nvidia and others in the $US500 billion Stargate data centres project. He’s also negotiating with Broadcom to develop custom chips for its next generation of AI models.\n\nOpenAI, via the deals with Nvidia, Oracle, the Stargate partners and AMD, has committed to acquiring the equivalent of about 23 gigawatts of computing power at a cost that it estimates will top $US1 trillion. The Nvidia and AMD deals alone will cost OpenAI about $US800 billion over time. The company that ignited the AI boom has been funding itself by raising equity and debt. It will have revenues of about $US13 billion this year, but will lose money because of the scale of the investments it is making. It expects to be profitable in 2029 – after burning more than $US100 billion of cash. OpenAI has more than 700 million users, but only about five per cent of them pay for its services. That’s reflective of the entire sector, where companies are committing tens of billions of dollars each this year in the hope that eventually there might be a massive commercial return. AI-related investments in the US this year are likely to approach $US400 billion and estimates of the investment required by the end of the decade range from about $US4 trillion to as much as $US7 trillion. The “hyperscalers” – companies like Google’s parent, Alphabet, or Meta Platforms, or Microsoft and Amazon – have the vast cash flows from their existing businesses to fund their investments in data centres and chips, but even they are showing signs of the strain of funding such large non-cash-generating investments.\n\nIt is improbable that all those chasing a position in whatever the AI sectors looks like in future will survive, given the financial stresses involved. The market’s enthusiasm for AI stocks is now being widely compared to the dot-com and telco bubbles a quarter of a century ago. When the dust settled, only a handful of the players survived, but Google and Amazon emerged with the foundations for today’s dominance established. Something similar could be expected if AI is as transformative as it promises to be, although the increasingly incestuous nature of the sector, the exposures to each other’s balance sheets, the need to continually access equity markets for capital consumed in recurrent spending – GPUs have a useful life of between one and three years before they are made redundant by the next generation of chips – and the increasing use of debt makes the whole structure of the sector vulnerable. Open AI and Nvidia are both allies and competitors in the quest for AI at, or superior to, human levels of intelligence. They are now formally linked via OpenAI’s commitment to buy Nvidia’s chips and Nvidia’s shareholding in AI. The deal with AMD, which is developing a chip it believes will rival Nvidia’s next generation of chips, diversifies OpenAI’s supply chain and helps a Nvidia competitor which, in turn, might generate some price competition (Nvidia’s Blackwell chips can cost up to $US70,000 each) and lower OpenAI’s own costs over time.\n\nGood bubble, bad bubble It also, however, highlights the interdependencies that have developed in the sector, which is again reminiscent of what occurred during the dot-com boom and bust. Loading Amazon’s Jeff Bezos recently described the investment boom in AI and the stretched valuations afforded to anything AI-related within the sharemarket as a “good” kind of bubble, saying it was more of an industrial bubble than a financial bubble. He referred to the vast amounts of fibre optic cabling deployed in the 1990s that survived even after most of the companies that laid it didn’t as an example of a good bubble.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/scandalous-revelations-and-sudden-twists-await-in-this-gothic-thriller-20251005-p5n06m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scandalous revelations and sudden twists await in this gothic thriller",
        "publish_date": "Tue, 07 Oct 2025 12:26:46 +1100",
        "category": "entertainment",
        "authors": [
            "Cameron Woodhead"
        ],
        "text": "THEATRE\n\nRebecca ★★★★\n\nMelbourne Theatre Company, Sumner Theatre, until November 5\n\nRebecca is the second gothic fiction from Daphne du Maurier to be adapted for Melbourne’s main stage this year, after The Birds at the Malthouse in May. Both were popular bestsellers made into Hitchcock films, so it’s fair to ask: what can theatre bring to their retelling that film can’t?\n\nNikki Shiels in a scene from Rebecca Credit: Pia Johnson\n\nIn Matthew Lutton’s no-frills adaptation of The Birds, the intimacy of sound predominated. Paula Arundell’s almost conspiratorial storytelling coaxed audiences into the claustrophobic monodrama; audio tech immersed us in the horror of unexplained avian attacks individually, creating a private, and deeply unnerving, soundscape for each spectator.\n\nAnne-Louise Sarks’ Rebecca has frills. This is commercial theatre with elegant production values, poised and atmospheric design, a formidable cast, and a script that allows the seeds of this iconic romantic thriller to bloom into morbid flower.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-ac-milan-to-play-serie-a-match-at-optus-stadium-20251006-p5n0ie.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: AC Milan set to play Serie A match at Optus Stadium",
        "publish_date": "Tue, 07 Oct 2025 12:20:59 +1100",
        "category": "finance",
        "authors": [],
        "text": "WA Premier Roger Cook has just announced Defence West will be transformed into the state’s first standalone defence agency.\n\nIt comes as Western Australia’s defence industry is expected to become the second-largest contributor to the state’s economy on the back of the state’s involvement in the AUKUS agreement.\n\nA US submarine off the coast of Perth in March. Credit: AFP\n\nWA Defence Minister Paul Papalia said that agreement will see WA become the biggest naval maintenance hub in the Southern Hemisphere with a ship building facility at Henderson, and a nuclear submarine base off the coast.\n\n“That is a massive task, which requires a focused effort from a specific agency, from dedicated professionals focused on that task,” he said.\n\nCurrently, Defence West is part of the state’s Department for Jobs, Tourism, Science and Innovation.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/unsafe-drivers-putting-posties-at-risk-on-the-roads-20251007-p5n0o7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Unsafe drivers putting posties at risk on the roads",
        "publish_date": "Tue, 07 Oct 2025 12:12:05 +1100",
        "category": "finance",
        "authors": [],
        "text": "Unsafe drivers putting posties at risk on the roads\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/vandals-target-billboard-and-officeworks-with-pro-hamas-graffiti-20251007-p5n0o2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Vandals target billboard and Officeworks with pro-Hamas graffiti",
        "publish_date": "Tue, 07 Oct 2025 12:10:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "Vandals target billboard and Officeworks with pro-Hamas graffiti\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/haas-foran-named-in-pacific-championships-squads-20251007-p5n0o4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Haas, Foran named in Pacific Championships squads",
        "publish_date": "Tue, 07 Oct 2025 12:10:39 +1100",
        "category": "sports",
        "authors": [],
        "text": "Haas, Foran named in Pacific Championships squads\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/dockers-ruckman-traded-to-blues-20251007-p5n0o3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dockers ruckman traded to Blues",
        "publish_date": "Tue, 07 Oct 2025 12:09:53 +1100",
        "category": "finance",
        "authors": [],
        "text": "Dockers ruckman traded to Blues\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/needs-to-be-better-everest-favourite-s-camp-weigh-in-on-trial-run-20251007-p5n0jy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Needs to be better’: Everest favourite’s camp weigh in on trial run",
        "publish_date": "Tue, 07 Oct 2025 11:57:14 +1100",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "Zac Purton gave Hong Kong superstar Ka Ying Rising a pass mark, but said he needed to be better on Everest day after a solid performance in his only Australian trial heading into the $20 million race.\n\nThe world’s best sprinter, which has firmed into $1.50 (Sportsbet) favourite for the October 18 showpiece, finished third in a dress rehearsal that attracted a crowd not often seen at a midweek city meeting, let alone a trial, at Randwick on a Tuesday.\n\nKa Ying Rising before his trial at Randwick on Tuesday. Credit: Steven Siewert\n\nThe David Hayes-trained headliner that’s on a 13-race winning streak in Hong Kong paraded alone in front of about 200 people before heading out to the track and an even larger crowd. The process was designed to prepare Ka Ying Rising and his handlers for a Randwick race day.\n\nThe winner of more than $10 million in stakes started well from the outside gate in the seven-horse 1000m trial and led alongside Bjorn Baker-prepared Overpass, which will also race in the Everest.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/theatre/you-think-you-look-fabulous-then-you-realise-you-ve-got-knickers-on-your-head-20250927-p5mycr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You think you look fabulous – then you realise you’ve got knickers on your head’",
        "publish_date": "Tue, 07 Oct 2025 11:53:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Cassidy Knowlton"
        ],
        "text": "Born in Canberra, she trained in classical ballet (“in the womb,” she says, “lost in the martini mists of time”) before coming to cabaret. “I like the heightened form of it,” she says. “I think it’s much more true than what we pretend to be every day. I think being heightened is true. And wearing a uniform and pretending to be small is, you know, pretending. Being heightened is honest.”\n\n“It’s for the unexpected,” she says. “And also I can have all these grandiose aspirations, but I’m very aware of my tiny place in the universe, and so it’s struggling with that.”\n\nMeow Meow – or Melissa Madden Gray on her birth certificate – has been in the cabaret game a long time, starting with Perth Festival in 2001. She performs a style of “kamikaze cabaret”, which has been described as “always one step from disaster”. But behind the slips, wardrobe malfunctions and apparent missed cues is a sharp and savvy performer – every purported misstep is, in fact, a meticulously choreographed performance, designed to get the audience laughing and, as she says, slightly terrified.\n\nThis column is called Lunch With, but to be accurate, today it’s Brunch With, in deference to actor-dancer-musician-cabaret artist Meow Meow’s hectic rehearsal schedule. She initially requested that we meet at Brunswick Street institution Mario’s, but as I recently dined with fellow cabaret legend Moira Finucane there , we’ve ended up at Alimentari, two minutes down the road.\n\nShe’s performed everywhere (London, New York, Berlin, Sydney, Monte Carlo, Hollywood) and with everyone (David Bowie, the Berlin Philharmonic, Alan Cumming, Barry Humphries, Taylor Mac). She’s on the road so much that she doesn’t really have a home base – “the world is my home”. Of course that life is glamorous, but it also has a way of grounding a person.\n\nShe was performing a show at Carnegie Hall – “Carnegie Hall, listener!” she says, bending close to my recorder – when a friend convinced her to go back up to the foyer to see her sold-out show poster. “The elevators were broken, so we not only are carrying up all of my suitcases and many mannequins, as I made a fake band, I had a fake massive band on stage with me. The glamour!” She laughs. “Carrying mannequins and suitcases, and we wheel around, and the poster is down. The next one’s up.” It wasn’t the only elevator-related drama for the night, as it turned out; when she returned to her hotel she discovered her band was stuck in the lift. “We spent half the night with the fire department. It was hilarious. And then walking up the stairs in the hotel because I was too worried about the elevator, with a floppy mannequin banging on each step, thunk-thunk-thunk.”\n\nTurkish eggs with labneh, merguez sausage, and pickled peppers and onions. Credit: Penny Stephens\n\nShe returns to this story several times through our brunch, as it’s emblematic of the kind of performer she is – a soaring, serious musician who has played the great concert halls of the world, but who also sees the gut-busting hilarity of dragging a mannequin, corpse-like, up the stairs. “But I think I like the shock of the ridiculousness of your pants being stuck in your knickers because it’s the real things that happen. You think you look fabulous, and then you realise you’ve got a pair of knickers on your head that you used as a scrunchie. Clean knickers, but still. Then you’ve got the audience in a state of slight apprehension, dare I say, and that’s a receptive audience, slightly terrified.”\n\nThere are no knickers on her head today, with Meow looking glamorous and smart in a black velvet tuxedo jacket, her signature wild curls framing her face and her green eyes sparkling beneath fake lashes that reach halfway down her cheeks. “I made an effort!” she laughs. She is slight and extremely beautiful, laughing often, but serious, too, when she talks about art – both hers and other people’s – philosophy, the state of the planet and truly dire state of the performing arts world post-COVID. She loves Alimentari and highly recommends the tuna sandwich for a future lunch. But as this is brunch, we both go for eggs – hers Persian (wilted spinach, shanklish cheese, dukkah, sourdough), mine Turkish (labneh, pickled red onion, aleppo pepper, merguez sausage).",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/are-you-ready-to-pay-the-snapchat-bill-teen-app-sensation-now-comes-at-a-cost-20251007-p5n0kf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Are you ready to pay the Snapchat bill? Teen app sensation now comes at a cost",
        "publish_date": "Tue, 07 Oct 2025 11:45:49 +1100",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "Parents of Snapchat fans could be on the hook for another expensive recurring subscription, as the company behind the app has announced mandatory cloud storage plans for its popular Memories feature.\n\nThe youth-focused social media app has always been free to use, implementing advertisements and in-app purchases for monetisation. But the impending change will mean that storing your previously shared content in the cloud, which is currently free, will come with a monthly fee.\n\nSnapchat will soon charge users for the content stored on its cloud servers. Credit: Aresna Villanueva\n\nSnap said that users will be able to store up to 5GB of Memories for free.\n\nUsers paying $6 per month for Snapchat+ will be able to store up to 250GB, while those paying $16 per month for Snapchat Platinum will be able to store up to 5TB. Snap plans to introduce a lower-cost option that allows 100GB of storage, but has not announced Australian pricing.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/we-already-have-out-of-control-crowds-at-night-the-sydney-home-owners-fighting-a-massive-wedding-venue-20250929-p5myqw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We already have out-of-control crowds at night’: The Sydney home owners fighting a massive wedding venue",
        "publish_date": "Tue, 07 Oct 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "A plan to bring the sound of wedding bells to a new skyscraper under construction in Darling Harbour has instead sparked alarm bells among a group of nearby apartment owners amid fears a new the reception centre could leave them unable to sleep or open their windows at night.\n\nSydney hospitality group Doltone House has lodged a new planning application with the City of Sydney to open a new 1250-person function and wedding centre within a 4200 square metre section of the new Harbourside development currently under construction near Pyrmont Bridge.\n\nDarling Harbour resident Dawn Veloskey who is among locals who aren’t happy about plans by wedding operator Doltone House to open a function centre at the new Harbourside development. Credit: Steven Siewert\n\nThe new indoor centre would add to a growing list of Doltone House venues operating within inner Sydney alongside the Darling Island Wharf, the Sydney Event Centre, Jones Bay Wharf and the recently launched Hay St Market at Paddy’s Markets.\n\nPlanning documents show the venue would be able to be used for events including weddings, live music, exhibitions, corporate lunches, and cocktail events with a capacity for 1250 guests.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/advocates-alarmed-as-major-change-for-autistic-kids-looms/n2rj2ev77",
        "title": "Advocates alarmed as major change for autistic kids looms",
        "publish_date": "Tue, 7 Oct 2025 01:06:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSince its launch more than a decade ago, demand for the National Disability Insurance Scheme has grown far beyond expectations - and it is autism - the primary disability for 45 percent of participants - that has received the lion's share of attention.\n\n\n\n\n\nHealth Minister Mark Butler says the NDIS has been the only option for many families.\n\n\n\n\n\n\"They love their children. They're desperate - absolutely desperate, I know - to get their children diagnosed. Because we've made it the only way their children can get help.\"\n\n\n\n\n\nThe government has now announced an alternative to the NDIS for autistic children, which the Minister hopes will limit growth to the NDIS.\n\n\n\n\n\n\"Thriving Kids - and that is the program I intend to deliver.\"\n\n\n\n\n\nAt the time of the Minister's surprise announcement, there was concern from some groups - like Yellow Ladybugs, led by Katie Koulas - that it would have a negative impact for neurodiverse children.\n\n\n\n\n\n\"This is a one size fits all approach that is not customised. It hasn't had autistic input or approval, so it's actually quite dangerous.\"\n\n\n\n\n\nNow, at a parliamentary committee hearing established by the government to guide the implementation of Thriving Kids - those concerns have only grown.\n\n\n\n\n\nIndependent MP Monique Ryan has told the inquiry that while an initial $2 billion in funding has been committed to the program, to be collectively matched by states and territories, there are still questions about exactly what services will be offered and who will pay for it.\n\n\n\n\n\n\"I guess the concern is that families want, need and deserve certainty. We're in October 2025, and you're talking about rolling a system out from the first of July 2026. But you're not able to give us any certainty around the timeline for firm agreements between the federal and state governments at this point in time.\"\n\n\n\n\n\nThe uncertainty and anxiety has been heightened all the more, because negotiations between the federal and state governments on another much vaunted plank of NDIS reform known as foundational supports appear to have stalled.\n\n\n\n\n\nIt's also unclear what those foundational supports will consist of as well.\n\n\n\n\n\nTo complicate matters, state and territory governments are currently in the middle of negotiations for a new hospital funding agreement, with both New South Wales Labor Premier Chris Minns and Queensland Liberal Premier David Crisafulli among those to complain about federal responsibilities placing pressure on state public health systems.\n\n\n\n\n\nDr Elizabeth Develin is the Deputy Secretary of the Department of Health, Disability and Ageing.\n\n\n\n\n\nShe has told the hearing that while new Thriving Kids initiatives are likely to be delivered within existing services such as community healthcare, GPs, schools and early childhood centres, the key difference is that funding is likely to be attached to the service provider rather than the individual.\n\n\n\n\n\n\"In essence, it's really to provide people, you know, services that may not be there today because of the growth in the NDIS and really leveraging the mainstream services we have in health and education and childcare settings so that families can be served in the natural settings where these children, sort of, you know, play and grow.\"\n\n\n\n\n\nBut for Jenny Karavalos from the Disability Advocacy and Complaints Service of South Australia, families are already faced with a system that is not designed for their needs.\n\n\n\n\n\n\"The voices of our community are very clear. The families and autistic individuals tell us they're exhausted from navigating fragmented systems. Many just can't afford the basics, saving up reach just to see a GP or fill a script when they finally reach a door. Often it is the wrong door or the right door that people behind it simply do not understand about disability. So services exist in theory, but in practice, families face long wait lists, unaffordable gap fees, and supports that are not trauma informed or inclusive.\"\n\n\n\n\n\nPlans for the rollout have also worried some experts like Professor Sharon Lawn, the Executive Director of Lived Experience Australia and the former Mental Health Commissioner for South Australia.\n\n\n\n\n\nShe says children with learning difficulties or autism that are labelled as mild are actually the most in need of consistent, effective support - because their challenges are too often dismissed as a failure to meet milestones, or even personality problems.\n\n\n\n\n\nBut Professor Lawn says children with so-called mild disabilities are the most likely to bounce between service providers or miss out on support completely, especially if they come from low socio-economic or culturally diverse communities.\n\n\n\n\n\n\"Basic stereotyping is the problem in a lot of service systems. So with children who may be presenting, for example, with behavioural issues, particularly the mild group, particularly where a family may experience socio economic disadvantage, it's easier to jump to, oh, this is the cause of the problem. Then it can very quickly get into blame. It can become many other things other than what it actually is as a child that actually has a need for a Thriving Kids program.\"\n\n\n\n\n\nAll of these concerns are amplified for organisations that represent rural and regional Australians with disability.\n\n\n\n\n\nNiki Lehmann is the CEO of the non-profit advocacy group Autism NT, and has told the inquiry that, in order to be effective, supports in the Northern Territory must be both consistent and culturally-sensitive.\n\n\n\n\n\n\"If you go to Alice Springs, you have to come bang on every three months. Like, don't just come when you can. So, if I (a service provider) has funding here and there, they just don't want to see you unless you're going to be committed. You can't just walk into any community and go, hey, we're here. You have to collaborate with other services, people that understand that community. So the remoteness is a huge part, especially trying to get to community, making community understand all our diagnosis.\"\n\n\n\n\n\nMeanwhile, Jeremy Muir from Physical Disabilities Australia has posed questions about what will happen to children who are diagnosed or identified as needing help AFTER the Thriving Kids cut-off age of eight.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/unseen-impact-of-dental-issues/qxmy885wl",
        "title": "The unseen impact of missing or damaged teeth — and the key to addressing it",
        "publish_date": "Mon, 6 Oct 2025 18:41:22 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When your teeth and gums are in good condition, you might not even notice their impact on your day-to-day life. Good oral health helps us chew, taste, swallow, speak and convey emotions.\n\n\n\n\n\nThis means the state of your mouth can affect nutrition, confidence, forming relationships and maintaining overall good health and wellbeing.\n\n\n\n\n\nPeople who have missing or damaged teeth, or other oral health issues such as gum disease, know this all too well.\n\n\n\n\n\nThey may not only live with pain that affects their sleep, speech and ability to enjoy certain foods, but often also face discrimination and stigma.\n\n\n\nSo, why is it so shameful to have missing teeth or gum disease? And what can we do about it?\n\n\n\nThe social and psychological impact\n\nOral health is deeply tied to social status. People who don’t have good teeth often face stereotypes about their health, wealth and even their intelligence.\n\n\n\n\n\nFor example, in one 2010 study from the United Kingdom, researchers showed young people photographs of the same person, modified with different levels of tooth decay.\n\n\n\n\n\nWhenever decayed teeth were visible, participants rated the person lower in intelligence, social skills, confidence, self-esteem and whether they appeared happy — based only on the photo.\n\n\n\nThese stereotypes can lead to bullying and stigma that scar people for life.\n\n\n\n\n\nIn a recent study with colleagues, we looked at nationally representative data on 4,476 children from the Longitudinal Study of Australian Children.\n\n\n\n\n\nWe found losing teeth to decay or injury was relatively common, affecting one in ten children. These children then had a 42 per cent higher risk of being bullied at school.\n\n\n\nThese stigmatising experiences can lead to feelings of shame, embarrassment and low self-esteem. In some cases, they can mean people are less likely to seek dental care, fearing further humiliation or blame that they have neglected themselves.\n\n\n\nDental care is often out of reach\n\nTooth decay and gum disease are the most common oral diseases in Australia and can lead to missing teeth. These conditions can occur at any age, from childhood to adulthood, but they usually worsen with age.\n\n\n\n\n\nYet the government’s Child Dental Benefits Schedule only covers dental care for children aged 17 and under whose parents receive government benefits.\n\n\n\n\n\nSome states and territories also provide oral care for eligible older adults. But long waiting lists show the public system is stretched.\n\n\n\n\n\nThis means oral health care remains inaccessible and unaffordable for many Australians.\n\n\n\nPoor oral health affects everyday life\n\nArguments for improving oral health almost always focus on preventing other physical health conditions. For example, one large study of 172,630 adults in New South Wales found those with missing teeth or poor oral health were more likely to die from heart disease.\n\n\n\n\n\nYet when people can’t afford to fix their own oral health issues or their children's, there can be other serious flow-on effects for their day-to-day life and wellbeing, beyond physical health.\n\n\n\n\n\nResearch shows when people are in pain from tooth decay they are more likely to take days off work and school. This can have long-term negative effects, disrupting education and employment.\n\n\n\nResearch shows when people are in pain from tooth decay they are more likely to take days off work and school. Source: Getty / ArtistGNDphotography Parents may also need to take time off work to take children to the dentist or dental hygienist. They often face financial pressures due to high out-of-pocket costs for dental treatments.\n\n\n\n\n\nResearch shows when people can’t afford dental treatments they may feel powerless to control their circumstances. As a result, they may choose cheaper treatments, such as having a tooth extracted even when it could have been saved.\n\n\n\n\n\nThere has also been a recent surge in people using superannuation to pay for dental treatments, for largely preventable conditions. This will further entrench financial disadvantage.\n\n\n\nSo, what's the fix?\n\nResearch I conducted with colleagues this year found 96 per cent of working-aged adults in Australia believe oral health care is essential.\n\n\n\n\n\nBut there continue to be significant financial barriers in getting required treatment, particularly for people who are unemployed, have low incomes or those with disability.\n\n\n\n\n\nSo, making dental care more affordable and accessible is an important step. This will encourage timely care and make sure check-ups aren’t a luxury for those who can afford them.\n\n\n\n\n\nBut while dental visits are important, they can’t provide sustainable and long-term protection from oral diseases when the social conditions and behaviours that lead to poor oral health stay the same.\n\n\n\n\n\nExperiencing stigma because of poor oral health can be highly personal and feel shameful. But the burden to fix this should not be on individuals.\n\n\n\n\n\nThe main causes of oral diseases are behaviours — such as having a lot of sugar, alcohol and tobacco, or poor oral hygiene — and high levels of stress.\n\n\n\n\n\nWe know these behaviours and stress are more common among people who experience social disadvantage.\n\n\n\n\n\nSo we need broader policies that address the social conditions in which people live, work, age and grow — for example, by making access to nutritious food more accessible and affordable.\n\n\n\n\n\nReducing disadvantage is the key to addressing both tooth decay and gum disease and the stigma attached to these oral health issues.\n\n\n\n\n\nAnkur Singh is the chair of Lifespan Oral Health at the University of Sydney. He receives funding from Australian Research Council DECRA Award and the chair of Lifespan Oral Health position at the University of Sydney is funded by the Rosebrook Foundation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/queenslanders-celebrate-historic-double-victory-in-nrl-and-nrlw-grand-finals/t8q8mqkwp",
        "title": "Queenslanders celebrate historic double victory in NRL and NRLW grand finals",
        "publish_date": "Mon, 6 Oct 2025 09:56:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Queenslanders celebrate historic double victory in NRL and NRLW grand finals\n\nPublished 6 October 2025, 6:34 am\n\nQueenslanders have spent the day celebrating the state's historic double glory, after wins by the Broncos in the NRL and NRLW grand finals. Fans gathered at both Suncorp Stadium and Brisbane airport to welcome the teams home as they brought back the premiership cups.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-study-highlights-ongoing-disparities-in-heart-attack-care-for-women/7od0zo6qo",
        "title": "New study highlights ongoing disparities in heart attack care for women",
        "publish_date": "Mon, 6 Oct 2025 09:43:23 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "New study highlights ongoing disparities in heart attack care for women\n\nPublished 6 October 2025, 6:28 am\n\nA new study has found women are less likely than men to receive life-saving care in the event of a heart attack. Despite improvements in recent years, researchers say the gender gap in care levels won't close for at least another decade.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australia-and-png-sign-historic-defence-treaty/36df19600",
        "title": "Australia and PNG sign historic defence treaty",
        "publish_date": "Mon, 6 Oct 2025 09:20:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/france-prime-minister-resigns/5vwlv0qic",
        "title": "France's new prime minister resigns weeks after his appointment",
        "publish_date": "Mon, 6 Oct 2025 08:26:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "France's Prime Minister Sébastien Lecornu has resigned just hours after forming his cabinet, plunging the European nation further into political deadlock.\n\n\n\n\n\nFrance's President Emmanuel Macron named Lecornu, a former defence minister, to the post last month.\n\n\n\n\n\nBut the largely unchanged cabinet Macron unveiled to work with Lecornu late on Sunday (local time) sparked fierce criticism across the political spectrum.\n\n\n\n\n\nOn Monday, Lecornu said the conditions were not satisfied to allow him to stay in office.\n\n\n\n\n\n\"The conditions were not fulfilled for me to carry out my function as prime minister,\" Lecornu said, denouncing the \"partisan appetites\" of factions who he said had forced his resignation.\n\n\n\nREAD MORE French parliament ousts prime minister, deepening political crisis for Macron\n\nMarine Le Pen, the leader in parliament of the far-right National Rally party, urged snap parliamentary elections after Lecornu's resignation was announced.\n\n\n\n\n\n\"A dissolution (of parliament) is absolutely necessary\", Le Pen said. She added it would be \"wise\" for Macron to resign, a move the president has previously ruled out.\n\n\n\n\n\nLecornu's 27-day stint in office was the shortest ever for a prime minister in modern France.\n\n\n\n\n\nHe had faced the daunting task of finding approval in a deeply divided parliament for an austerity budget for next year.\n\n\n\n\n\nLecornu's two immediate predecessors, François Bayrou and Michel Barnier, were ousted by the legislative chamber in a standoff over the spending plan.\n\n\n\nFrance's public debt has reached a record high, official data showed last week.\n\n\n\n\n\nFrance's debt-to-GDP ratio is now the European Union's third-highest after Greece and Italy, and is close to twice the 60 per cent permitted under EU rules.\n\n\n\n\n\nPrevious governments had rammed the last three annual budgets through parliament without a vote, a method allowed by the constitution but deeply criticised by the opposition.\n\n\n\n\n\nLecornu had promised last week to ensure legislators were able to vote on the bill.\n\n\n\n\n\nLecornu's resignation compounds a political crisis that has rocked France for over a year, after centrist Macron called legislative elections in 2024, which ended in a hung parliament.\n\n\n\n\n\nFrance has been mired in deadlock since Macron gambled on the snap parliamentary elections in the middle of last year in the hopes of bolstering his authority.\n\n\n\n\n\nThe move backfired, leaving the Macron-friendly bloc in the assembly in a minority.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/gold-and-copper-prices-surge-and-why-you-shouldnt-ignore-your-annual-super-statement/ycyf7efc7",
        "title": "Gold and copper prices surge and why you shouldn’t ignore your annual super statement",
        "publish_date": "Mon, 6 Oct 2025 07:45:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/tszyu-fenech-form-aussie-super-team/r1yvyu4ah",
        "title": "Tszyu, Fenech form 'Aussie Super Team'",
        "publish_date": "Mon, 6 Oct 2025 05:34:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tszyu, Fenech form 'Aussie Super Team'\n\nPublished 6 October 2025, 4:00 am\n\nTim Tszyu teams up with Australian boxing legend Jeff Fenech in a bid to get back to 'the big time'. Tszyu is set to jet off in search of a coach in the US, after hiring a new team to help revive his boxing career. While the dust settles on his corner changes, Jeff Fenech and the son of Lester Ellis are getting started on the game plan.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/grassroots-to-greatness-and-glory/gomgrqtkx",
        "title": "Grassroots to greatness and glory",
        "publish_date": "Mon, 6 Oct 2025 05:27:39 +0000",
        "category": "sports",
        "authors": [],
        "text": "Grassroots to greatness and glory\n\nPublished 6 October 2025, 3:59 am\n\nIndigenous Basketball Australia teamed up with NBA, NBL and WNBL talent to support pathways for Aboriginal and Torres Strait Islander basketballers. The coaching clinic is part of the 'NBA x NBL' series of exhibition matches featuring the New Orleans Pelicans - the first NBA team to play in Australia.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-pm-says-october-7-not-a-day-for-demonstrations-gaza-ceasefire-talks-underway-in-egypt-20251007-p5n0ji.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: PM says October 7 ‘not a day for demonstrations’; Gaza ceasefire talks under way in Egypt",
        "publish_date": "Tue, 07 Oct 2025 12:52:03 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Communications Minister Anika Wells is outlining powers the Triple Zero custodian will gain under the new legislation being introduced today.\n\n“From the 1st of November, telecommunications carriers will have to provide real-time reporting of outages to ACMA and to emergency services, they will also have to test Triple Zero during upgrades and maintenance and ensure calls fall back to other networks if needed,” she said.\n\n“Within six months of the commencement of this bill, the custodian, through ACMA, will issue additional performance requirements to telcos to ensure best practice,” Wells told parliament.\n\nCommunications Minister Anika Wells. Credit: Kate Geraghty\n\n“Telco providers know [that] under the law they must provide reliable access to Triple Zero. That is their legal obligation, and that’s why this morning, I met with the CEOs of Optus, Telstra and TPG-Vodafone ahead of the approaching natural disaster season. There are no excuses, and I made that crystal clear today,” she said.\n\nAmendments proposed by the government to the legislation allow ACMA to use directions to carriers to provide information, including technical details of an outage.\n\nACMA would also be able to compel carriers to share information or improve procedures to prevent repeated outages.\n\n“ACMA can compel timely information on the outages, nature, scale, impacts and restoration. Information gathered by ACMA will be provided to the custodian in a timely manner. The custodian will use this material to support its ongoing system-wide oversight of Triple Zero,” Wells said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/planning-and-budgeting/should-i-follow-social-media-gurus-money-advice-20251007-p5n0le.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Should I follow social media gurus’ money advice?",
        "publish_date": "Tue, 07 Oct 2025 12:44:44 +1100",
        "category": "finance",
        "authors": [
            "Paridhi Jain"
        ],
        "text": "I’ve been reading your articles on mindset and I wanted to know your thoughts on manifestation. I’m a pretty practical person. I’ve successfully built and sold a business before and am currently self-employed and make decent money. But I’ve been stuck at a specific income level for a while.\n\nI feel like there must be some ‘mindset blocks’ holding me back and I’ve been trying the manifestation techniques you hear about on social media – like visualising my income goal, ‘acting as if’ I already have it, etc. I’ll admit I haven’t seen many results, so I don’t know if I’m doing it wrong or if it’s all nonsense.\n\nChanging how you think can make you more money – just don’t call it ‘manifestation’. Credit: Simon Letch\n\nFor every finance bro on the internet selling you his secrets to ‘beat the market’ and ‘become a millionaire by 30’, there is a manifestation guru selling you on how to ‘quantum leap’ and ‘manifest your dream life’. So, is it all nonsense?\n\nFirstly, a good question to ask yourself here is: did the person claiming to ‘manifest’ money actually manifest it, or did they sell the idea of manifestation? For example, if they made $X selling a course, e-book, coaching program on manifestation, is that manifestation or is that just marketing and sales?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/the-ai-bubble-just-got-a-little-bigger-and-no-one-knows-when-it-will-burst-20251007-p5n0kb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The AI bubble just got a little bigger and no one knows when it will burst",
        "publish_date": "Tue, 07 Oct 2025 12:35:41 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The last tranche of those warrants can be exercised if AMD’s share price, which leapt more than 23 per cent on news of the deal to $US203.71, hits $US600. If all those warrants could have been exercised immediately, in agreeing to purchase AMD’s GPUs OpenAI would have created $US6.3 billion of value for itself from the $US63.4 billion the announcement added to AMD’s market capitalisation. Generative AI apps are tearing through workplaces and are now increasingly used for coding. Credit: iStock Altman has been engaged in a frenzy of high-stakes deal-making in recent weeks that adds up to mind-boggling sums. Apart from the Nvidia and AMD deals, he has committed to buying $US300 billion of computing power from Oracle and is partnering with Oracle, Microsoft, Softbank, Nvidia and others in the $US500 billion Stargate data centres project. He’s also negotiating with Broadcom to develop custom chips for its next generation of AI models.\n\nOpenAI, via the deals with Nvidia, Oracle, the Stargate partners and AMD, has committed to acquiring the equivalent of about 23 gigawatts of computing power at a cost that it estimates will top $US1 trillion. The Nvidia and AMD deals alone will cost OpenAI about $US800 billion over time. The company that ignited the AI boom has been funding itself by raising equity and debt. It will have revenues of about $US13 billion this year, but will lose money because of the scale of the investments it is making. It expects to be profitable in 2029 – after burning more than $US100 billion of cash. OpenAI has more than 700 million users, but only about five per cent of them pay for its services. That’s reflective of the entire sector, where companies are committing tens of billions of dollars each this year in the hope that eventually there might be a massive commercial return. AI-related investments in the US this year are likely to approach $US400 billion and estimates of the investment required by the end of the decade range from about $US4 trillion to as much as $US7 trillion. The “hyperscalers” – companies like Google’s parent, Alphabet, or Meta Platforms, or Microsoft and Amazon – have the vast cash flows from their existing businesses to fund their investments in data centres and chips, but even they are showing signs of the strain of funding such large non-cash-generating investments.\n\nIt is improbable that all those chasing a position in whatever the AI sectors looks like in future will survive, given the financial stresses involved. The market’s enthusiasm for AI stocks is now being widely compared to the dot-com and telco bubbles a quarter of a century ago. When the dust settled, only a handful of the players survived, but Google and Amazon emerged with the foundations for today’s dominance established. Something similar could be expected if AI is as transformative as it promises to be, although the increasingly incestuous nature of the sector, the exposures to each other’s balance sheets, the need to continually access equity markets for capital consumed in recurrent spending – GPUs have a useful life of between one and three years before they are made redundant by the next generation of chips – and the increasing use of debt makes the whole structure of the sector vulnerable. Open AI and Nvidia are both allies and competitors in the quest for AI at, or superior to, human levels of intelligence. They are now formally linked via OpenAI’s commitment to buy Nvidia’s chips and Nvidia’s shareholding in AI. The deal with AMD, which is developing a chip it believes will rival Nvidia’s next generation of chips, diversifies OpenAI’s supply chain and helps a Nvidia competitor which, in turn, might generate some price competition (Nvidia’s Blackwell chips can cost up to $US70,000 each) and lower OpenAI’s own costs over time.\n\nGood bubble, bad bubble It also, however, highlights the interdependencies that have developed in the sector, which is again reminiscent of what occurred during the dot-com boom and bust. Loading Amazon’s Jeff Bezos recently described the investment boom in AI and the stretched valuations afforded to anything AI-related within the sharemarket as a “good” kind of bubble, saying it was more of an industrial bubble than a financial bubble. He referred to the vast amounts of fibre optic cabling deployed in the 1990s that survived even after most of the companies that laid it didn’t as an example of a good bubble.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/scandalous-revelations-and-sudden-twists-await-in-this-gothic-thriller-20251005-p5n06m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scandalous revelations and sudden twists await in this gothic thriller",
        "publish_date": "Tue, 07 Oct 2025 12:26:46 +1100",
        "category": "entertainment",
        "authors": [
            "Cameron Woodhead"
        ],
        "text": "THEATRE\n\nRebecca ★★★★\n\nMelbourne Theatre Company, Sumner Theatre, until November 5\n\nRebecca is the second gothic fiction from Daphne du Maurier to be adapted for Melbourne’s main stage this year, after The Birds at the Malthouse in May. Both were popular bestsellers made into Hitchcock films, so it’s fair to ask: what can theatre bring to their retelling that film can’t?\n\nNikki Shiels in a scene from Rebecca Credit: Pia Johnson\n\nIn Matthew Lutton’s no-frills adaptation of The Birds, the intimacy of sound predominated. Paula Arundell’s almost conspiratorial storytelling coaxed audiences into the claustrophobic monodrama; audio tech immersed us in the horror of unexplained avian attacks individually, creating a private, and deeply unnerving, soundscape for each spectator.\n\nAnne-Louise Sarks’ Rebecca has frills. This is commercial theatre with elegant production values, poised and atmospheric design, a formidable cast, and a script that allows the seeds of this iconic romantic thriller to bloom into morbid flower.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-ac-milan-to-play-serie-a-match-at-optus-stadium-20251006-p5n0ie.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: AC Milan set to play Serie A match at Optus Stadium",
        "publish_date": "Tue, 07 Oct 2025 12:20:59 +1100",
        "category": "finance",
        "authors": [],
        "text": "WA Premier Roger Cook has just announced Defence West will be transformed into the state’s first standalone defence agency.\n\nIt comes as Western Australia’s defence industry is expected to become the second-largest contributor to the state’s economy on the back of the state’s involvement in the AUKUS agreement.\n\nA US submarine off the coast of Perth in March. Credit: AFP\n\nWA Defence Minister Paul Papalia said that agreement will see WA become the biggest naval maintenance hub in the Southern Hemisphere with a ship building facility at Henderson, and a nuclear submarine base off the coast.\n\n“That is a massive task, which requires a focused effort from a specific agency, from dedicated professionals focused on that task,” he said.\n\nCurrently, Defence West is part of the state’s Department for Jobs, Tourism, Science and Innovation.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/unsafe-drivers-putting-posties-at-risk-on-the-roads-20251007-p5n0o7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Unsafe drivers putting posties at risk on the roads",
        "publish_date": "Tue, 07 Oct 2025 12:12:05 +1100",
        "category": "finance",
        "authors": [],
        "text": "Unsafe drivers putting posties at risk on the roads\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/vandals-target-billboard-and-officeworks-with-pro-hamas-graffiti-20251007-p5n0o2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Vandals target billboard and Officeworks with pro-Hamas graffiti",
        "publish_date": "Tue, 07 Oct 2025 12:10:54 +1100",
        "category": "finance",
        "authors": [],
        "text": "Vandals target billboard and Officeworks with pro-Hamas graffiti\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/haas-foran-named-in-pacific-championships-squads-20251007-p5n0o4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Haas, Foran named in Pacific Championships squads",
        "publish_date": "Tue, 07 Oct 2025 12:10:39 +1100",
        "category": "sports",
        "authors": [],
        "text": "Haas, Foran named in Pacific Championships squads\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/dockers-ruckman-traded-to-blues-20251007-p5n0o3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dockers ruckman traded to Blues",
        "publish_date": "Tue, 07 Oct 2025 12:09:53 +1100",
        "category": "finance",
        "authors": [],
        "text": "Dockers ruckman traded to Blues\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/needs-to-be-better-everest-favourite-s-camp-weigh-in-on-trial-run-20251007-p5n0jy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Needs to be better’: Everest favourite’s camp weigh in on trial run",
        "publish_date": "Tue, 07 Oct 2025 11:57:14 +1100",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "Zac Purton gave Hong Kong superstar Ka Ying Rising a pass mark, but said he needed to be better on Everest day after a solid performance in his only Australian trial heading into the $20 million race.\n\nThe world’s best sprinter, which has firmed into $1.50 (Sportsbet) favourite for the October 18 showpiece, finished third in a dress rehearsal that attracted a crowd not often seen at a midweek city meeting, let alone a trial, at Randwick on a Tuesday.\n\nKa Ying Rising before his trial at Randwick on Tuesday. Credit: Steven Siewert\n\nThe David Hayes-trained headliner that’s on a 13-race winning streak in Hong Kong paraded alone in front of about 200 people before heading out to the track and an even larger crowd. The process was designed to prepare Ka Ying Rising and his handlers for a Randwick race day.\n\nThe winner of more than $10 million in stakes started well from the outside gate in the seven-horse 1000m trial and led alongside Bjorn Baker-prepared Overpass, which will also race in the Everest.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/theatre/you-think-you-look-fabulous-then-you-realise-you-ve-got-knickers-on-your-head-20250927-p5mycr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You think you look fabulous – then you realise you’ve got knickers on your head’",
        "publish_date": "Tue, 07 Oct 2025 11:53:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Cassidy Knowlton"
        ],
        "text": "Born in Canberra, she trained in classical ballet (“in the womb,” she says, “lost in the martini mists of time”) before coming to cabaret. “I like the heightened form of it,” she says. “I think it’s much more true than what we pretend to be every day. I think being heightened is true. And wearing a uniform and pretending to be small is, you know, pretending. Being heightened is honest.”\n\n“It’s for the unexpected,” she says. “And also I can have all these grandiose aspirations, but I’m very aware of my tiny place in the universe, and so it’s struggling with that.”\n\nMeow Meow – or Melissa Madden Gray on her birth certificate – has been in the cabaret game a long time, starting with Perth Festival in 2001. She performs a style of “kamikaze cabaret”, which has been described as “always one step from disaster”. But behind the slips, wardrobe malfunctions and apparent missed cues is a sharp and savvy performer – every purported misstep is, in fact, a meticulously choreographed performance, designed to get the audience laughing and, as she says, slightly terrified.\n\nThis column is called Lunch With, but to be accurate, today it’s Brunch With, in deference to actor-dancer-musician-cabaret artist Meow Meow’s hectic rehearsal schedule. She initially requested that we meet at Brunswick Street institution Mario’s, but as I recently dined with fellow cabaret legend Moira Finucane there , we’ve ended up at Alimentari, two minutes down the road.\n\nShe’s performed everywhere (London, New York, Berlin, Sydney, Monte Carlo, Hollywood) and with everyone (David Bowie, the Berlin Philharmonic, Alan Cumming, Barry Humphries, Taylor Mac). She’s on the road so much that she doesn’t really have a home base – “the world is my home”. Of course that life is glamorous, but it also has a way of grounding a person.\n\nShe was performing a show at Carnegie Hall – “Carnegie Hall, listener!” she says, bending close to my recorder – when a friend convinced her to go back up to the foyer to see her sold-out show poster. “The elevators were broken, so we not only are carrying up all of my suitcases and many mannequins, as I made a fake band, I had a fake massive band on stage with me. The glamour!” She laughs. “Carrying mannequins and suitcases, and we wheel around, and the poster is down. The next one’s up.” It wasn’t the only elevator-related drama for the night, as it turned out; when she returned to her hotel she discovered her band was stuck in the lift. “We spent half the night with the fire department. It was hilarious. And then walking up the stairs in the hotel because I was too worried about the elevator, with a floppy mannequin banging on each step, thunk-thunk-thunk.”\n\nTurkish eggs with labneh, merguez sausage, and pickled peppers and onions. Credit: Penny Stephens\n\nShe returns to this story several times through our brunch, as it’s emblematic of the kind of performer she is – a soaring, serious musician who has played the great concert halls of the world, but who also sees the gut-busting hilarity of dragging a mannequin, corpse-like, up the stairs. “But I think I like the shock of the ridiculousness of your pants being stuck in your knickers because it’s the real things that happen. You think you look fabulous, and then you realise you’ve got a pair of knickers on your head that you used as a scrunchie. Clean knickers, but still. Then you’ve got the audience in a state of slight apprehension, dare I say, and that’s a receptive audience, slightly terrified.”\n\nThere are no knickers on her head today, with Meow looking glamorous and smart in a black velvet tuxedo jacket, her signature wild curls framing her face and her green eyes sparkling beneath fake lashes that reach halfway down her cheeks. “I made an effort!” she laughs. She is slight and extremely beautiful, laughing often, but serious, too, when she talks about art – both hers and other people’s – philosophy, the state of the planet and truly dire state of the performing arts world post-COVID. She loves Alimentari and highly recommends the tuna sandwich for a future lunch. But as this is brunch, we both go for eggs – hers Persian (wilted spinach, shanklish cheese, dukkah, sourdough), mine Turkish (labneh, pickled red onion, aleppo pepper, merguez sausage).",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/are-you-ready-to-pay-the-snapchat-bill-teen-app-sensation-now-comes-at-a-cost-20251007-p5n0kf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Are you ready to pay the Snapchat bill? Teen app sensation now comes at a cost",
        "publish_date": "Tue, 07 Oct 2025 11:45:49 +1100",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "Parents of Snapchat fans could be on the hook for another expensive recurring subscription, as the company behind the app has announced mandatory cloud storage plans for its popular Memories feature.\n\nThe youth-focused social media app has always been free to use, implementing advertisements and in-app purchases for monetisation. But the impending change will mean that storing your previously shared content in the cloud, which is currently free, will come with a monthly fee.\n\nSnapchat will soon charge users for the content stored on its cloud servers. Credit: Aresna Villanueva\n\nSnap said that users will be able to store up to 5GB of Memories for free.\n\nUsers paying $6 per month for Snapchat+ will be able to store up to 250GB, while those paying $16 per month for Snapchat Platinum will be able to store up to 5TB. Snap plans to introduce a lower-cost option that allows 100GB of storage, but has not announced Australian pricing.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/we-already-have-out-of-control-crowds-at-night-the-sydney-home-owners-fighting-a-massive-wedding-venue-20250929-p5myqw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We already have out-of-control crowds at night’: The Sydney home owners fighting a massive wedding venue",
        "publish_date": "Tue, 07 Oct 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "A plan to bring the sound of wedding bells to a new skyscraper under construction in Darling Harbour has instead sparked alarm bells among a group of nearby apartment owners amid fears a new the reception centre could leave them unable to sleep or open their windows at night.\n\nSydney hospitality group Doltone House has lodged a new planning application with the City of Sydney to open a new 1250-person function and wedding centre within a 4200 square metre section of the new Harbourside development currently under construction near Pyrmont Bridge.\n\nDarling Harbour resident Dawn Veloskey who is among locals who aren’t happy about plans by wedding operator Doltone House to open a function centre at the new Harbourside development. Credit: Steven Siewert\n\nThe new indoor centre would add to a growing list of Doltone House venues operating within inner Sydney alongside the Darling Island Wharf, the Sydney Event Centre, Jones Bay Wharf and the recently launched Hay St Market at Paddy’s Markets.\n\nPlanning documents show the venue would be able to be used for events including weddings, live music, exhibitions, corporate lunches, and cocktail events with a capacity for 1250 guests.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/australia-post-issues-urgent-plea-to-drivers-amid-deeply-concerning-road-trend-011045556.html",
        "title": "Australia Post issues urgent plea to drivers amid 'deeply concerning' road trend",
        "publish_date": "2025-10-07T01:10:45Z",
        "category": "finance",
        "authors": [],
        "text": "Australia Post is calling on drivers across the country to pay greater attention to the nation's postal workers on our roads, amid a \"deeply concerning\" spate of accidents in the last 12 months.\n\nThe agency announced to the public that an incredible 280 posties were injured as a result of \"third-party traffic accidents\" in the last financial year — a shocking five incidents per week — with wounds ranging from lacerations to broken limbs, to concussions and even serious trauma. It is a significant increase on the 86 posties injured over the previous financial year.\n\nAs a result, many staff were forced to take time off work for hospital treatment, while others were left with \"ongoing psychological trauma\". The loss of postal workers impacts services, prompting the organisation to take \"comprehensive measures\" to combat the worrying trend.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSpeaking to Yahoo News, an Australia Post spokeswoman encouraged drivers to be on alert for posties, particularly ahead of the festive season. \"The number of posties getting injured on the road has increased, and the numbers are concerning,\" she said.\n\n\"Especially over the next few months as we ramp up deliveries in the lead-up to Christmas, we are asking all drivers to be alert and keep an eye out for our posties.\"\n\nAusPost expands electric vehicle rollout amid increase in unsafe driver behaviour\n\nThe stark figures underscore the urgent need for all motorists to take greater responsibility for road safety, Australia Post General Manager of Safety, Russell Munro, said.\n\n\"Every day, our team members are out in communities delivering for Australians, but increasingly, they’re also being put at risk by unsafe driver behaviour,\" he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe said Australia Post is taking a range of steps to improve safety, including reducing the motorcycle fleet, expanding the rollout of electric delivery vehicles (eDVs), and upgrading telematics systems with video and data monitoring across thousands of vehicles.\n\n\"Our data shows that the severity of injury to a postie when involved in a motor accident is reduced when operating an eDV. In some instances, our team have walked away from the accident with only minor injuries,\" Munro said, noting that these measures help minimise harm when accidents do occur.\n\n\"Our priority is to deliver for all Australians whilst ensuring the safety of our team members, so they return home to their families safely each day. However, road safety is a shared responsibility, and we urge all drivers to keep an eye out for our posties,\" he said.\n\nSome of the most common third-party accidents in the past year included drivers failing to give way to posties at intersections and roundabouts, not leaving enough space to stop safely, cutting corners, overtaking on the wrong side of the road, driving distracted while using a mobile phone, and not paying attention to footpaths when postal workers were on scooters or bikes.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSafety measures for postal workers increased\n\nTuesday's Australia Post announcement comes after it recently ramped up efforts to protect staff from an alarming increase in violent dog attacks. In June, it was revealed that posties would now be equipped with a new deterrent — citronella spray — following the spike across the past six months.\n\nThe national service warned that since November 2024, over 1,150 encounters with a threatening dog had been recorded, with an average of nine posties forced to flee for their safety every day.\n\n\"Despite public awareness efforts and rigorous safety protocols, we continue to see alarming rates of dog-related incidents,\" Munro said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Apart from the normal bites and scratches, we’ve seen posties knocked off bikes. We’ve also seen psychological trauma for our posties following serious dog attacks. Last year, one of our posties had her foot seriously injured when a dog bit through her boot.\"\n\nPosties are now equipped with citronella spray following a spike in violent dog attacks. Source: Australia Post\n\nRoad safety tips from Australia Post\n\n• Put your mobile phone out of reach when driving.\n\n• Slow down when approaching roundabouts.\n\n• Use your mirrors and check your blind spots for motorcycles and cyclists before turning or changing lanes.\n\n• When reversing out of your driveway, toot your horn and move slowly.\n\n• Keep your distance. Leave a large enough gap to the car in front of you so you can stop safely.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n• Do not drive when drowsy.\n\n• Do not drive under the influence of drugs and alcohol.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]