[
    {
        "url": "https://www.9news.com.au/national/qantas-hit-by-cyberattack-six-million-customers-data-potentially-compromised/aa83aada-7774-4921-b39c-038aaeaf0687",
        "title": "Qantas hit by cyberattack, six million customers' data potentially compromised",
        "publish_date": "Tue, 01 Jul 2025 23:53:27 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Millions of customers' data may have been compromised in a cyberattack on Qantas, the airline confirmed in a statement to shareholders this morning.\n\nThe airline said the cyberattack occurred on Monday after a cybercriminal targeted a customer call centre ﻿ and gained access to a third-party customer servicing platform.\n\nQantas said the attack compromised customer data, potentially impacting six million customers who have service records on the system.\n\nLIVE UPDATES: Dozens of flights cancelled at Sydney Airport\n\nThe airline said the cyber attack occurred on Monday after a \"cyber criminal\" targeted a customer call centre ﻿and gained access to a third-party customer servicing platform. (Getty)\n\n﻿\"Qantas can confirm that a cyber incident has occurred in one of its contact centres, impacting customer data. The system is now contained,\" a statement released to shareholders says.\n\n\"We understand this will be concerning for customers. We are currently contacting customers to make them aware of the incident, apologise and provide details on the support available.\n\n\"We are continuing to investigate the proportion of the data that has been stolen, though we expect it will be significant.\"\n\nAffected data includes names, email addresses, phone numbers, birthdays and frequent flyer numbers.\n\nThe company said credit card details, personal financial information and password details were not held in the affected system and have not been compromised.\n\nQantas said frequent flyer accounts were not compromised. ﻿ (Nine)\n\nQantas said frequent flyer accounts were not compromised.\n\nPasswords and PINs were not accessed.\n\n\"We sincerely apologise to our customers and we recognise the uncertainty this will cause,\" Qantas Group chief executive Vanessa Hudson said.\n\n\"Our customers trust us with their personal information and we take that responsibility seriously.\n\n\"We are contacting our customers today and our focus is on providing them with the necessary support.\n\n\"We are working closely with the federal government's National Cyber Security Coordinator, the Australian Cyber Security Centre and independent specialised cybersecurity experts.\"\n\nThe company said it is putting additional security measures in place while conducting its investigation.\n\nThe Australian Cyber Security Centre and the Office of the Australian Information Commissioner have been notified about the incident.\n\nThe cyberattack has also been reported to the Australian Federal Police.\n\n﻿A dedicated customer support line is being set up for customers.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/hands-on-with-donkey-kong-banaza/f2d172b2-3492-4966-b4a2-ca3f0e743f79",
        "title": "Hands-on with Nintendo’s new Donkey Kong game",
        "publish_date": "Tue, 01 Jul 2025 20:38:10 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Donkey Kong Bananza is arguably Nintendo's most important game of 2025.\n\nIt's being crafted by the team that made 2017's sensational Super Mario Odyssey.\n\nThat pedigree comes with great expectations. DK hasn't been the star of a 3D platformer for more than 25 years and there's pressure to maintain momentum after Mario Kart World helped make the Nintendo Switch 2 the fastest selling game console of all time.\n\nLast week, Nintendo invited me to play Donkey Kong Bananza for about four hours.\n\nSO EASY EVEN A MONKEY CAN DO IT\n\nA few things didn't click when I first played Donkey Kong Bananza.\n\nThe camera can get funky when you've burrowed a narrow tunnel and controlling DK isn't as intuitive as running and jumping with Mario.\n\nThe B, Y and X buttons are tied to punching down, forward and up respectively; relegating DK's jump to the A button, which is an odd placement for a Nintendo platformer. After more time with the game I got used to it but every now and then I'd hit the wrong button and punch downward to my death.\n\n\n\nDonkey Kong has a lot more moves than Mario to learn too.\n\nBesides punching, he can rip off chunks of enemies and the environment (ZR), throw those chunks (ZR), aim to throw (by holding ZR), slap his hands together to collect nearby items (R), roll (ZL) and start 'turf surfing' by pressing ZL while holding a piece of terrain.\n\nThat's a lot to wrap your head around. The game does a very good job at teaching you everything but if I struggle with it at times, newer players may find the barrier to entry a little higher than they might expect.\n\nDon't accidentally try to punch down while hanging, you'll fall instead! (Nintendo )\n\nNEW DONK CITIES\n\nMy preview covered four of the game's levels, including: the tutorial area is a monkey mining colony; the game's first level and two levels from later in the game which bring water and poison into the mix.\n\nEach is wonderfully different from the last and, in classic Nintendo style, each has a gimmick which adds to the variety.\n\nIn the poison swamp level, which is very reminiscent of Super Mario Odyssey's Lost Kingdom, there are seeds you can pick up and throw at walls to create an instant bridge between you and the spot you just hit.\n\nThere are also enemies that chomp at you, whose bodies you can use like a bridge if you dodge at the right time.\n\nYou mean Pauline is trapped inside that thing? (Nintendo)\n\nLike Odyssey, levels have a general goal but you're encouraged to explore. It's less about making it to the end and more about how much you can discover along the way.\n\nAnd in keeping with The Legend of Zelda: Tears of the Kingdom, puzzles often have more than one solution thanks to how the world's environment interacts.\n\nMetal is stronger than stone, stone is stronger than dirt, and dirt is stronger than sand. Sand is so soft that you can stack it on top of itself to create makeshift towers or bridges.\n\nThere are also purple-veined explosive materials that can tear everything to shreds.\n\nIt's a level of complexity that is woven into everything from exploration to boss encounters.\n\nMinecarts demand more than timing in DK Bananza. (Nintendo)\n\nThe levels themselves are wonderfully designed with puzzles and challenge areas scattered throughout.\n\nChallenges are often 'locked' behind Void Co tape (the game's villains) which can be removed by Odd-Rock or Pauline's singing (holding down L).\n\nThe ones I played ranged from defeating a number of enemies within a time limit to entire side-scrolling levels which had me blasting through barrels to find the game's main collectable; banana gems called Banandium.\n\nWOULD YOU LIKE TIES WITH THAT\n\nCollectibles are only as fun as what they unlock and, even after a short time with the game, I can tell that DK Bananza's 'economy' is one of Nintendo's best.\n\nCollecting five Banandium gems unlocks a skill point, which you can use to unlock and power up new abilities.\n\nBanandium chips (aka Super Mario Odyssey's purple coins) can be used to buy new outfits for Pauline and DK, and even change the colour of DK's fur.\n\nUnlike Super Mario Odyssey, these outfits actually carry special buffs like swimming faster or taking less damage from poison.\n\nAnd finally, there are a heap of musical tracks to collect and listen to (Mario Kart World take note!).\n\nThat music is both critical to the story of Donkey Kong Bananza and DK's new Bananza power-ups.\n\nOSTRICH KONG?\n\nLookin’ great! (Nintendo )\n\nNintendo has already showed off three Bananza power-ups: Kong, Zebra and Ostrich.\n\nI only got to try the Kong and Ostrich Bananzas in my preview and I'm happy to report they are as fun (and ridiculous) as they sound.\n\nThe Kong Bananza transforms DK into something more like a silverback gorilla and gives him the strength to punch through metal. The Ostrich Bananza transforms DK into (you guessed it) an ostrich with the ability to fly and drop egg bombs, which is another control scheme you'll have to wrap your head around.\n\nYou'll need to collect gold (like Mario's coins) to activate these temporary transformations. I was able to 'cheese' my way through a few puzzles by exploiting the power-ups, which are incredibly overpowered, but nowhere near as overpowered as adding a second player.\n\nFind updrafts to fly higher as Ostrich Kong. (Nintendo)\n\n2P CHEAT CODE\n\nHanding a controller to a friend to control Pauline is effectively a cheat code. The game effectively becomes a third-person shooter with unlimited ammo.\n\nI let my lovely Nintendo rep take over as Donkey Kong so I could blast our way through a few bosses as Pauline and it rendered them useless.\n\nThis isn't the way I'd want to play but it'd probably be a blast for two young siblings. Unlike Super Mario Odyssey and the Galaxy games which gave the secondary players almost zero influence to maintain the integrity of the challenge, DK Bananza just rips the band-aid off and asks what is going to be the most fun?\n\nThe mouse controls work really well but I found it easier to use the gyro controls instead.\n\nPauline's voice attacks appear as words on screen. (Nintendo)\n\nLINGERING QUESTIONS\n\nWe still know little to nothing about DK Banaza's story. I don't play Mario games for their plot, but Nintendo is trying something new here and fans are desperate to know how (or if) a teenage Pauline on a quest to the centre of the earth becomes mayor of New Donk City.\n\nI have no doubt that Donkey Kong Bananza is a fun game. I'm less sure about its performance.\n\nDuring my demo I repeatedly noticed stutters in its frame rate. To my eyes, these slowdowns were more dramatic and far more noticeable than the performance problems The Legend of Zelda: Link to the Past suffered on the original Nintendo Switch.\n\nSmall, distracting artifacts appear at the edges of DK's fur in this opening cutscene. (Nintendo)\n\nDonkey Kong Bananza also doesn't appear to be pushing anywhere close to 4K either. Textures on destructible environments can appear muddy and furry characters (including DK himself) don't look as sharp as they should, which could be the result of AI upscaling.\n\nI wasn't counting pixels and it might have been the TV I was playing on or how close I was sitting to it, but the game wasn't reaching the same heights as Mario Kart World or the Switch 2 Edition of Breath of the Wild, which I've been spending plenty of time enjoying.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/a-quarter-of-drivers-admit-to-falling-asleep-behind-the-wheel/38a9639b-140d-4c89-9502-67d278d08359",
        "title": "A quarter of drivers admit to microsleep behind the wheel",
        "publish_date": "Tue, 01 Jul 2025 23:16:32 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Almost one in four Australians have succumbed to a microsleep while driving, new research from the NRMA has revealed.\n\nThe nationwide index survey of more than 2000 Australians showed that, of the 23 per cent of respondents who had fallen asleep behind the wheel, almost two-thirds said it occurred during the day.\n\nThe shocking figure comes as the national road toll for the past 12 months to May sits at 1337 deaths.\n\nLIVE UPDATES: Thousands without power and some residents told to stay indoors as wild weather hits NSW coast\n\nFatigue is a factor in one in five crashes on Australian roads, the NRMA says. (iStock)\n\nThis is a 4.8 per cent increase from the same time last year, figures from the federal government's National Road Safety Data Hub show.\n\nThe NRMA survey results also found that nearly 40 per cent of drivers are not taking a break at least every two hours when driving longer distances of three hours or more.\n\nWhen planning a road trip, 61 per cent were most concerned about beating the traffic and almost one-quarter left before sunrise, the research showed.\n\nNRMA spokesperson Peter Khoury said too many Australians were losing their lives because they were driving exhausted.\n\n\"Fatigue is a factor in one in five crashes on Australian roads, the road toll this year is already far too high and this unnecessary risk can be removed by taking a break,\" Khoury said.\n\nThe survey results come as many Australians prepare to hit the road for their winter break.\n\nAlmost 70 per cent of Australians planned to stay within the country for their next holiday, and, for those who would be travelling interstate, 45 per cent planned to drive.\n\nKhoury said as more Australians chose to travel domestically for their holidays due to ongoing cost-of-living pressures, it was vital drivers prioritised safety on our roads.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nsw-coast-smashed-by-cyclone-bomb/3e2946f8-61c3-4032-acdc-5a7e0cb2a34d",
        "title": "NSW coast smashed by 'bomb cyclone'",
        "publish_date": "Wed, 02 Jul 2025 00:33:21 +0000",
        "category": "finance",
        "authors": [
            "July"
        ],
        "text": "10 of 12 Attribution: NSW SES\n\nAbout 10,500 customers were left without power, according to AusGrid.\n\nThere were 6500 customers impacted in the Hunter-Newcastle region and another 3000 in the Central Coast.\n\nAt 10am on Wednesday, there were just under 1000 affected customers in Sydney.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/millions-of-aussies-are-about-to-get-a-boost-to-their-super-but-most-are-unaware/791b646f-f3ef-4b80-bc9f-71d5c26f6518",
        "title": "Millions of Aussies unaware of big boost to their financial future",
        "publish_date": "Tue, 01 Jul 2025 05:04:52 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "M﻿illions of Australians are about to get a boost to their super, but most are unaware the cash is headed for their nest egg.\n\nThe super guarantee rate rise means the rate employers pay into﻿ employees' superannuation funds has increased from 11.5 per cent to 12 per cent as of today.\n\nIt will see an extra $317 in retirement fund contributions paid to the average Australian worker ﻿over the next financial year.\n\nThe super guarantee rate rise means an extra $317 in retirement fund contributions will be paid to the average Australian worker ﻿over the next financial year. (Getty Images/iStockphoto)\n\nThe 0.5 per cent increase means an average 30-year-old worker will retire with an additional $22,000 in their nest egg.\n\nSuper will now also be paid on Commonwealth Parental Leave Pay for the first time ever, benefitting millions of families across the country.\n\nIt means women on paid maternity leave will continue to get super contributions.\n\nThe change should help narrow the gender super gap by a quarter, which currently sits at about a $50,000﻿ difference for Australians nearing retirement.\n\nDespite the major changes, most Australians are unaware of ﻿the boost they're about to receive. (Getty Images/iStockphoto)\n\nSuper Members Council CEO Misha Schubert said most Australians are unaware of ﻿the boost they're about to receive.\n\n\"The super guarantee rise and paid super on parental leave are important changes that will boost the retirement savings of millions of Australians, with women and young people the biggest winners,\" Schubert said.\n\n\"The fact so many Australians are still unaware of these changes shows much more work needs to be done to make super front of mind for Australians of all ages, who could be missing out on more money in retirement simply because they haven't checked in on their super for a while.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/audit-details-shire-of-coolgardie-viability-concerns/105482862",
        "title": "Outback council staffer was working from Caribbean island, audit finds",
        "publish_date": "Wed, 02 Jul 2025 01:49:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "An outback shire unfairly dismissed two staff, used restricted funds to cover shortfalls and improperly employed a man working remotely from a Carribean island, Western Australia's government watchdog has found.\n\nThose are just some of the issues identified by a comprehensive audit of the Shire of Coolgardie by the office of WA's Auditor-General, casting significant doubt on the small council's future.\n\nThe audit found that a former employee who questioned former chief executive James Trail about whether he was manipulating the council's tender processes was one of two people involved in unfair dismissal claims that were settled by the shire for a combined $150,000.\n\nJames Trail speaking at the What's Down The Track business forum in Kalgoorlie-Boulder in 2023. (ABC Goldfields: Jarrod Lucas)\n\nThe audit, which covers the 2023-24 financial year, also alleges the council's purchasing policies were not followed in regard to a $1-million housing project.\n\nIt also revealed that a charter airline that sued for $214,203 had no formal agreement with the council.\n\nThe audit confirmed the shire was in dire financial straits months before Mr Trail was suspended on November 14, which eventually led to his resignation on April 17.\n\nThe shire's chief financial officer was also suspended on November 6.\n\nAn investigation by external consultants is ongoing.\n\nRatepayers have been making their feelings about the council known. (ABC Goldfields: Katrina Tap)\n\nWorking from the Caribbean\n\nThe audit revealed that a senior project officer employed by the Shire of Coolgardie from October 2023 to October 2024 was working remotely from the Caribbean island of Montserrat.\n\nThe audit found the recruitment was directly undertaken by the ex-chief executive, bypassing the shire's recruitment and selection policy.\n\nThe staff member, who was not named, was also in breach of a 417 working holiday visa.\n\nMontserrat is approximately 18,000km from the offices of the Shire of Coolgardie. (Supplied)\n\n\"We inquired but did not receive a response from shire management on how the staff member performed their duties efficiently while being in a different jurisdiction with a 12-hour time difference from Perth,\" the audit stated.\n\n\"Additionally, we noted that the staff member is currently working for the government of Montserrat.\n\n\" Shire management at the time advised us that they were not aware of this employment despite it being clearly indicated on the staff member's resume. \"\n\nThe audit stated that the employment contract was terminated on October 2, 2024, but the laptop provided to the staff member had not been recovered.\n\nFinancial viability in doubt\n\nThe audit was publicly released by the shire this week after being referenced in state parliament by Local Government Minister Hannah Beazley, who declared \"shocking mismanagement\" had left the council in a \"financial mess\".\n\nThe audit – certified by the Auditor-General's senior director of financial audit Tim Sanya – showed the shire incurred a net loss of $4.6 million for the 12 months to June 30, 2024.\n\nIt found the council's liabilities exceeded its asset base by $14.2m and that there was $4.8m in overdue payments to vendors.\n\n\"These conditions indicate a material uncertainty that may cast significant doubt about the ability of the shire to continue as a going concern,\" the audit said.\n\nRatepayers protested outside the Shire of Coolgardie offices in April. (ABC Goldfields: Katrina Tap)\n\nThe audit prompted Ms Beazley to hold a meeting on Monday with Kalgoorlie MLA Ali Kent and the Shire of Coolgardie about a potential merger with the neighbouring City of Kalgoorlie-Boulder.\n\n\"It was a really productive meeting … the beginning of those discussions,\" Ms Beazley told the ABC, using the term \"boundary adjustment\" rather than \"amalgamation\".\n\n\" I am really confident that any solution will result in better outcomes for those communities. \"\n\nMalcolm Cullen says it is too close to the council election to discuss an amalgamation. (ABC Goldfields: Jarrod Lucas)\n\nCoolgardie Shire President Malcolm Cullen said the minister's ultimatum came too close to this year's council elections.\n\n\"The three-week time-frame for these discussions provided by the minister does not allow time for genuine and open negotiations,\" Mr Cullen said in a statement.\n\n\"Such a decision deserves careful consideration and should not be made at a time of transition.\"\n\nIn a statement, the City of Kalgoorlie-Boulder said Mayor Glenn Wilson and chief executive Andrew Brien would brief councillors on the meeting's outcomes on Wednesday.\n\nIt declined to comment further.\n\nCouncil policies not followed\n\nThree modular houses built by the Shire of Coolgardie in Kambalda also raised red flags.\n\nThe units were constructed for government regional officer housing (GROH) amid Kambalda's struggle to attract police and teachers.\n\nThe audit found the shire did not undertake any tender process, which was in breach of its purchase policy applied to contracts in excess of $250,000.\n\nA $1m loan from the Commonwealth Bank was obtained in the 2022-23 financial year for the works, but the funds were not used for the purpose they were obtained for, the audit stated.\n\nAs of June 30, 2024 invoices totalling $965,151 were overdue to Modular Proprietary Limited for the construction of the houses.\n\nThere were calls for the Shire of Coolgardie president to resign at protests outside the council offices in April. (ABC Goldfields: Katrina Tap)\n\nThe audit also found there was no formal agreement between the shire and Casair Proprietary Limited, which operated private charter flights into Kambalda.\n\nCasair filed a writ last year for $214,203 for incorrect fees and charges.\n\nIn February shire councillors unanimously agreed to make repayments at a rate of $6.60 per passenger over the next 12 months in order to ensure both parties regained \"trust and a working relationship\".\n\nIn the long-delayed 2023-24 annual report, which was released alongside the audit, Mr Cullen noted the \"less-than-desirable closing balance\".\n\nHe agreed \"wholeheartedly with community sentiment that these results are extremely disappointing\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/tas-liberals-announce-government-owned-tasinsure-insurance/105485156",
        "title": "Breaking: Tasmanian Liberals promise new state-owned insurance company",
        "publish_date": "Wed, 02 Jul 2025 01:44:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Tasmanian Liberals have announced plans to set up a state-owned insurance company, claiming it would save Tasmanian families hundreds of dollars a year in premiums.\n\nWearing a branded TasInsure jacket, Premier Jeremy Rockliff has told reporters that the Motor Accidents Insurance Board (MAIB) will be expanded to create TasInsure if the Liberals win government at this month's state election.\n\nThe proposed state-owned company would offer home, contents, small business and regional insurance, as well as insurance for community groups and events.\n\nMr Rockliff described it as the party's most significant announcement of the campaign.\n\nPromise tracker: What the parties are saying this election Photo shows Thumbnail image for Tasmania state election 2025 promise tracker article. As Tasmanians prepare for a July 19 vote, we keep track of each party's election promises on everything from health and housing, to the stadium.\n\n\"[Insurance premiums] increased by some 35 per cent in the last two years alone. That's an extraordinary increase that's impacting on many Tasmanians,\" he said.\n\n\"We need cheaper, fairer and our own insurance company here in Tasmania.\n\n\"The market nationally has failed Tasmanians and that is evident when you consider that the insurance industry made some $6 billion of profit last year alone.\"\n\nThe Liberal Party estimates Tasmanian households will save $250 a year and small businesses will save 20 per cent off their premiums.\n\nMr Rockliff said Tasmanians should not have to pay higher premiums for \"mainland payouts and profits\".\n\n\"Any profits that will be made by TasInsure will be reinvested to ensure that we keep premiums low in Tasmania,\" he said.\n\n\"Every time there is a major flood, a bushfire, Tasmanians pay for that.\n\n\"The impacts of those communities and the devastation [affects] insurance premiums.\"\n\nRundle's Liberals sold off first Tasmania-owned insurance company\n\nTasInsure would be set up under MAIB using its \"strong balance sheet\", but the Liberals say it would be independently governed.\n\nHe said he had been working on the idea for some time and had previously raised this issue nationally.\n\nMr Rockliff said the Liberals would need to draft legislation to start the new company.\n\nTasmania previously had a state insurer known as the Tasmanian Government Insurance Office (TGIO).\n\nIt was sold off by Tony Rundle's Liberal government in 1993 for $53.5 million.\n\nLoading",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/afl-miles-bergman-port-adelaide-contract-extension/105485172",
        "title": "'We can go a long way': In-demand Port star rejects Victorian rivals to sign new deal",
        "publish_date": "Wed, 02 Jul 2025 01:21:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Port Adelaide utility Miles Bergman has rejected offers from Victorian clubs and signed a fresh contract with the Power.\n\nBergman will remain at Port until the end of 2027 under a new deal struck with the in-demand 23-year-old.\n\nGeelong, St Kilda and the Western Bulldogs were among clubs pitching to lure Bergman from Alberton.\n\nLoading...\n\nBut the Melbourne-born Bergman opted to remain at Power in a contract to take him to free-agency status at the end of the 2027 season.\n\n\"I've loved my time at Port Adelaide since being drafted and the club has continued to give me great opportunities,\" Bergman said in a statement on Wednesday.\n\n\"I feel like we can go a long way over the next few years.\"\n\nBergman's stocks have risen this season with a move into the midfield from his customary defensive role.\n\nThe 98-gamer has been deployed to play on a series of star on-ball opponents with great success.\n\n\"Miles's versatility has been on show this year,\" Port's list manager Justin Cripps said.\n\n\"He has really elevated his game to the point where he is now recognised as one of the league's most exciting young players.\"\n\nBergman, who was pick 14 at the 2019 national draft, had been due to fall off-contract at the end of the season.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/heritage-poultry-auction-naracoorte-feather-fanciers-sa/105469094",
        "title": "Feather fanciers bid for birds as hopes rise for poultry hobby resurgence",
        "publish_date": "Wed, 02 Jul 2025 00:55:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Early on a brisk Sunday morning in the middle of winter, a shed in the Naracoorte Showgrounds in South Australia's south-east is drawing a crowd.\n\nFamilies, children and cage-carrying feather fanciers are ready for a bidding battle to rival any good country clearing sale.\n\nDozens of pens were up for auction at the sale. (ABC South East SA: Sam Bradbrook)\n\nLining the walls of the poultry pavilion are dozens of pens of purebred and heritage chickens; preened, plump and full of plume.\n\nFrom speckle-feathered Anconas to lace-winged Wyandotte, mighty Australorp and sentimental favourites, the White Leghorn, the birds will find their way to new pastures after the last auction hammer falls.\n\n\"These are definitely an upgrade from the common backyard layer,\" Naracoorte Pigeon and Poultry Club (NPCC) president Kim Hebberman said.\n\nKim Hebberman conducting the auction. (ABC South East SA: Sam Bradbrook)\n\n\"As a club, we've been sourcing these heritage hens from across South Australia to promote purebreds and rare breeds with a view to growing numbers and keeping historic breeds alive.\"\n\nA family affair\n\nPoultry and pigeon fancying has been a staple of country shows, something Mr Hebberman wanted the next generation to continue.\n\nMundulla farmer William Peck, who showed chickens when he was growing up, said his 19-year-old daughter Paris had also taken up the hobby.\n\nThey attended the NPPC June sale on Sunday, which attracted buyers and sellers from across the state.\n\nMs Peck said she fell in love with raising chooks as a way to improve her mental health after a period of illness.\n\nParis and William Peck love raising show poultry. (ABC South East SA: Sam Bradbrook)\n\n\"I think they're just very relaxing animals,\" she said.\n\n\"It's been great for stress relief to go out there and watch them and take care of them.\n\n\"I see a few kids at home who go out there and read to their chooks and get right into it, which is good.\"\n\nMr Peck said it was a great experience to share with his daughter and had allowed him to re-enter the showing community.\n\nThe most valuable trio sold for more than $700. (ABC South East SA: Sam Bradbrook)\n\n\"I'm only just getting the bug back again, but definitely there's a little community there,\" he said.\n\n\"A lot of the older breeders are pretty supportive of the younger guys now getting in, setting them up with a good trio and some advice.\n\n\"It's a great hobby for anyone to get into.\"\n\nPigeon and poultry club member Eddie Locke, 17, said he had been involved in poultry showing since he was a kid with the help of his dad.\n\nNaracoorte teen Eddie Locke spends his whole weekends tending to his show poultry. (ABC South East SA: Sam Bradbrook)\n\nHe helped facilitate Sunday's auction.\n\n\"There's so many fancy breeds, so many characteristics and when you breed them and hatch them out, they have a great nature,\" he said.\n\n\"You can spend hours out in the chookyards hanging out with your birds and picking what you want for a show.\n\n\"Even though it's a bit of a strange hobby, you get a lot of enjoyment out of it.\"\n\nBackyard birds on the rise\n\nMr Hebberman ran the auction as seasoned poultry fanciers and backyard enthusiasts placed their bids.\n\nMs Peck said she enjoyed the adrenaline rush.\n\n\"I actually like the nervousness of it all and going along and seeing what they all go for,\" Ms Peck said.\n\nKim Hebberman hopes auctioning off more premium poultry breeds will keep their heritage alive. (ABC South East SA: Sam Bradbrook)\n\nThe highest trio sale of a rooster and two hens reached more than $700, while others grabbed a bargain hoping to cut down on their grocery bill.\n\nWhile egg production is not the main aim of the poultry auction, Mr Hebberman said he expected a number of buyers would be bidding to shore up their own egg supplies.\n\n\"It costs as much to feed an ordinary bird as it does a good one,\" he said.\n\n\"So we see an opportunity for people to get a start in heritage breeds as well as reap the benefits of their laying potential.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/perth-schools-start-teaching-agricultural-atar-subjects/105412620",
        "title": "Schools introduce agriculture subjects amid skills shortage",
        "publish_date": "Wed, 02 Jul 2025 00:27:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Finn Sugars is just one of many year 12 students trying to figure out his next chapter in life before his upcoming graduation.\n\n\"I think I want to go to university, but I want to go into data analytics and finance in agriculture,\" he said.\n\n\" I also see a future in helping farmers with what they should purchase and crop. \"\n\nGuildford Grammar is one of a select number of schools offering ATAR agribusiness courses. (Supplied: Guildford Grammar School)\n\nFinn is enrolled in the recently developed Agribusiness ATAR course at Guildford Grammar, to equip year 11 and 12 students with practical knowledge and technical skills needed for modern careers as the farming workforce ages.\n\n\"So far we've learnt about free-trade agreements with different countries, how Australia sits in international markets, things like that,\" Finn said.\n\nHe added that being surrounded by boarders sparked his curiosity around agriculture, considering he didn't grow up on a farm.\n\n\"I've been able to visit places like Corrigin, to understand more about sheep, the price of them, different types of breeding,\" he said.\n\n\" I find it so interesting seeing how a farm works. \"\n\nStudents visited the Loose Leaf Lettuce Company to learn about food production. (Supplied: Guildford Grammar School)\n\nFilling a gap\n\nAs part of the subject, Guildford students had been given access to local agribusinesses and the chance to engage directly with local producers.\n\nWestern Australia's largest citrus producer Moora Citrus's chief executive officer Shane Kay said his business needed people who could work with technology.\n\n\"Businesses like ours are moving towards using more and more technology; you need those experienced people to run certain aspects of the business,\" Mr Kay said.\n\nGuildford Grammar School visited agribusinesses to explore livestock and cropping supply chains. (Supplied: Guildford Grammar School)\n\n\"There has always been a lack in that middle-management area where you might want irrigation managers or people who understand computers, you need them to be able to run and manage those.\n\n\" When we put job ads out, you rarely get many applicants with the skills you need, so the more ways people can be trained through education — the better. \"\n\nTaking the risk of a new subject\n\nScotch College is another Perth school in the early phases of ATAR agribusiness.\n\nSix job vacancies for every ag grad Photo shows A young woman wearing a work shirt stands in a field of cotton A report has found the number of students graduating from agricultural courses at university falls well short of what is required to address labour shortages in the sector.\n\nTeacher James Rees said there was an increase in students choosing agribusiness at the school.\n\n\"We have 22 students who have enrolled to take the course next year, that's up from nine students this year,\" Mr Rees said.\n\nHe believes the potential of this type of education is limited only by the capabilities and expertise of the teaching staff.\n\n\"I think understanding how primary production works is important. The barrier is finding schools that are willing to take the risk on a new subject and allocate the resources to that,\" Mr Rees said.\n\nOutside of the city\n\nFurther south of Perth, Bunbury Cathedral Grammar is collaborating with the University of WA (UWA) to assist in exploring innovative ways to apply science and technology to support the future of farming.\n\nUWA's Andrew Guzzomi said farming machinery was becoming more sophisticated and would need people to develop and use it.\n\nMatthew O'Brien and Andrew Guzzomi are working to further agricultural education in their curriculum. (ABC South West WA: Kate Forrester)\n\n\"Australia is unfortunately behind in agriculture technology,\" Dr Guzzomi said.\n\n\"I think it is because of a lack of exposure.\n\n\"It's not just me that has noticed this gap. Skills Australia has officially recognised that there is an area lacking in these skills.\n\nHe said their work had received strong support.\n\n\"At the University of Western Australia we are fortunate to have funding from the federal government and the Grains Research Development Corporation to address these needs.\"\n\nBunbury Cathedral Grammar School principal Matthew O'Brien said the school's journey toward greater agricultural engagement began two years ago with the leasing of land to establish a school farm.\n\n\"The business of farming is becoming more complex, we have parents coming to us asking, 'What are we doing as a school to develop this?'\" he said.\n\n\"So we are developing a program to assist with those science and business skills, with the help of Andrew and UWA.\"\n\nBunbury Grammar School students will produce food for the boarding house on the farm. (Supplied: Bunbury Cathedral Grammar)\n\nMr O'Brien said the school had deliberately chosen not to offer ATAR agricultural subjects at this stage, as part of a considered strategic approach.\n\n\"We are wanting to build first the pipeline earlier on so then the students have the desire to do the agricultural ATAR subjects with integrity when we get to that point.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/qantas-cyber-attack-significant-data-stolen/105484720",
        "title": "Qantas says 'significant' portion of 6m customers' data likely stolen",
        "publish_date": "Tue, 01 Jul 2025 23:49:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Qantas is warning a \"significant\" amount of customer data has likely been stolen from its records during a cyber attack.\n\nThe airline has released a statement saying that, on Monday, it detected unusual activity on a third-party platform used by a Qantas airline contact centre.\n\nThe airline said 6 million customers had service records in this platform.\n\nQantas said it was investigating the proportion of the data that had been stolen, though it expected it would be \"significant\".\n\nNames, contact details, birth dates, frequent flyer numbers compromised\n\nAn initial review confirmed the data included some customers' names, email addresses, phone numbers, birth dates and frequent flyer numbers, the airline said.\n\n\"Importantly, credit card details, personal financial information and passport details are not held in this system,\" the statement read.\n\n\"No frequent flyer accounts were compromised nor have passwords, PIN numbers or log in details been accessed.\"\n\nQantas said the system had been quarantined and affected customers would be notified.\n\nChief executive officer Vanessa Hudson apologised to those impacted and recognised the \"uncertainty this will cause\".\n\n\"Our customers trust us with their personal information and we take that responsibility seriously,\" she said in a statement.\n\nThe airline has established customer support lines and says it will also maintain a dedicated page on its website to keep customers updated.\n\nCyber firm says attack has hallmarks of international hacking group\n\nLeading cybersecurity firm CyberCX has been working with Qantas over the past 24 hours to address the incident.\n\nA spokesperson for CyberCX has told ABC News the incident has all the hallmarks of an attack from the so-called Scattered Spider hacker group, which is targeting individual business sectors one by one.\n\nMost recently it has been known for attacks on the financial and insurance sectors. However, over the weekend, US authorities said it expanded its targets to include the airline sector.\n\nIn a statement posted to X, the FBI said the cybercriminal group targetted \"large corporations and their third-party IT providers, which means anyone in the airline ecosystem, including trusted vendors and contractors, could be at risk\".\n\n\"Once inside, Scattered Spider actors steal sensitive data for extortion and often deploy ransomware,\" it said.\n\n\"The FBI is actively working with aviation and industry partners to address this activity and assist victims.\"\n\nQantas would not confirm whether it was the target of Scattered Spider.\n\n\"Qantas has notified the Australian Cyber Security Centre and the Office of the Australian Information Commissioner,\" the airline's statement said.\n\n\" Given the criminal nature of this incident, the Australian Federal Police has also been notified. We will continue to support these agencies as the investigation continues. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/cuba-volleyball-team-blocked-from-entering-usa/105484592",
        "title": "Cuban national volleyball team blocked from US due to new visa restrictions",
        "publish_date": "Tue, 01 Jul 2025 23:47:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Cuban women's national volleyball team has been denied a chance to play in a tournament in Puerto Rico following new visa restrictions imposed by US President Donald Trump.\n\nThe Cuban Volleyball Federation said the team, comprising 12 athletes, a referee and several coaches, had their visa request denied and the team would be unable to attend the tournament later this month.\n\n\"The disappointment is huge because I train every day,\" national team player Laura Suarez said.\n\n\"Every hour of training is leading up to this and I dedicate myself to it.\n\n\"It's really disappointing not to be able to participate in the competition, which is what I've been preparing myself for.\"\n\nLaura Suarez said it was \"disappointing\" to be kept out of the US due to new visa restrictions. (Dax Images: Jose Luis Contreras)\n\nCuba was scheduled to play in the North, Central America and Caribbean Volleyball Confederation (NORCECA) Women's Final Four tournament in Manatí, Puerto Rico.\n\nThe tournament includes Puerto Rico, Mexico and Costa Rica and awards ranking points toward qualification for the Volleyball Nations League.\n\n\"We were focused on the competition because it's right there,\" player Dayana Martínez said.\n\n\"Arriving at the embassy and being denied the visa affects us a lot because that competition gives us points to improve our ranking.\"\n\nThe Cuban team's coach, Wilfredo Robinson, said the decision meant his team was likely to miss out on the Nations League.\n\n\"The competition grants points for each match and at the end it all adds up,\" Robinson said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"In September, we have another tournament and if we get there needing to achieve 80 or 100 points, we are not going to be able to do it.\"\n\nThe United States added Cuba to a list of 12 countries with restrictions for entering the US or its territories, effective from early June.\n\nThe list also includes nationals from Afghanistan, the Republic of Congo, Iran and Venezuela, among other nations.\n\n\"Denial of visas is part of a racist and xenophobic list of visa restrictions,\" Cuban Foreign Minister Bruno Rodriguez wrote on X.\n\nThe US embassy in Cuba said it could not comment on specific cases according to its privacy policies, but said directives were being implemented to secure the borders and protect US communities and citizens.\n\nThe Cuban women's national team won back-to-back world championships in 1994 and 1998. It also won three Olympic golds in a row in Barcelona 1992, Atlanta 1996 and Sydney 2000.\n\nThe US measures are likely to impact many more Cuban athletes who depend on international competitions, including some on American soil, to qualify for major championships.\n\nThe ban could also impact the next Olympics, scheduled to be held in Los Angeles in 2028, and next year's FIFA World Cup.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/centrepay-crackdown-nt-remote-retailers-aboriginal-customers/105478346",
        "title": "Remote retailers facing 'collapse' amid Centrepay crackdown",
        "publish_date": "Tue, 01 Jul 2025 22:51:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Several Northern Territory retailers say their businesses will not survive if they are banned from using a controversial Centrelink payment system, ahead of a federal crackdown expected to take effect in coming weeks.\n\nCentrepay is a system used by more than half-a-million Australians that allows people to pay for goods and services through deductions from their social security payments.\n\nIt was introduced as a way of paying essential bills like rent and power, but has expanded over time to be used in shops selling clothes, whitegoods, phones and speakers.\n\nUnder changes to be rolled out by the federal government, retailers selling those \"household items\" are now set to be booted from the scheme, along with funeral companies and some food providers.\n\nDinesh Lamichhane says while the rules should be tightened, Centrepay can also be \"really important\" as a budgeting tool. (ABC News: James Elton)\n\nThe reforms follow a series of controversies, including two NT clothing stores being ordered to stop using the service over concerns they were putting their mostly Aboriginal customers at financial risk by signing them up to debts they did not fully understand and could not afford.\n\nThe Albanese government announced sweeping changes to the service in December last year, with former minister Bill Shorten saying Centrepay had been \"misfiring\" and \"not working as intended\".\n\n\"Some services being provided through Centrepay were really not appropriate for the vulnerable people on the government's systems,\" he said at the time.\n\nThe reforms are expected to only apply to new businesses at first, with existing Centrepay-enabled businesses in categories slated for removal to be given more time to phase out their use.\n\nShops say they face 'collapse', job losses\n\nIn Katherine, there are five clothing stores using Centrepay, which financial counsellors have previously described as a \"high concentration\" for a town of its size.\n\nThree of them have said their businesses will go broke without access to the scheme.\n\nUrban Rampage, a chain with stores across remote northern Australia, told a tribunal last year an Australian Securities and Investments Commission (ASIC) order to stop using Centrepay would cause its business to \"collapse\" and its staff to be terminated.\n\nUrban Rampage has claimed an ASIC stop order amounts to discrimination against its First Nations consumers. (ABC Alice Springs: Chris Murrkarany Fitzpatrick)\n\nMakalu Fashion, another Centrepay-enabled clothing retailer, has been trading on Katherine's main street for about two years.\n\n\"I don't think my business can survive if Services Australia completely stops Centrepay,\" owner Dinesh Lamichhane said.\n\nMr Lamichhane said while he agreed with stricter regulations, he did not want to see Centrepay taken away altogether.\n\n\"There should be tighter rules,\" he said.\n\n\"I do not hesitate to say this system really encourages the businesses to misuse the money of the Aboriginal customers.\"\n\nIndy C was ordered to stop using Centrepay over concerns it was exposing vulnerable Aboriginal customers to financial risk. (ABC Katherine: James Elton )\n\nBut he said Centrepay was also \"really important\" to his customers as a budgeting tool.\n\n\"[The] majority of customers, they have the habit of not saving the money in their pocket,\" he said.\n\n\"That's why if Centrepay exists, it is really helpful for them to buy their necessities, especially their clothing items and footwear.\"\n\nMr Lamichhane said he believed retail businesses should only be able to draw down a maximum of $50 a fortnight from Centrelink, and customers should only be able to enter into a Centrepay agreement with a single retailer so they did not end up with multiple deductions.\n\n\"I think Services Australia can easily do that,\" he said.\n\nAdvocates welcome changes\n\nThe reforms have been cautiously welcomed by financial counsellors.\n\nKimberley-based Bush Money Mob counsellor Allan Gray said he had no sympathy for retailers that were financially dependent on Centrepay.\n\nHe said many stores were charging \"massive prices to remote Aboriginal people who are living below the poverty line\".\n\n\"I have literally seen hundreds of remote Aboriginal people ripped off by abuse of Centrepay by greedy businesses,\" he said.\n\n\" If you live by the sword, you die by the sword. \"\n\nAllan Gray says addressing credit issues in remote Australia \"feels a bit like Whac-A-Mole\". (ABC News: Andrew Seabourne)\n\nHowever, Mr Gray said he was concerned shops would turn to other forms of credit, like Afterpay or direct debit systems, which could still see financially vulnerable customers ending up with big debts.\n\nHe said while recent tightening of laws that govern buy-now-pay-later services meant advocates had a better chance of protecting customers, they had not removed the risk.\n\n\"It feels a bit like Whac-A-Mole,\" he said.\n\n\"I have no doubt that if someone is greedy and they're determined … [they will] find a new way to take the limited income from remote Aboriginal people, but we now have far more tools at our disposal.\"\n\nVennessa Poelina, a community advocate and Nyikina traditional owner from Broome, said she had seen many remote Aboriginal people get into trouble with Centrepay debts to clothing retailers.\n\nVennessa Poelina says businesses have an obligation not to abuse the trust of Aboriginal customers who \"get hooked into that system of Centrepay\". (ABC News: Andrew Seabourne)\n\nShe said shopkeepers had an obligation not to abuse the trust of Aboriginal customers from remote communities who often \"don't know how to question\" the payment options presented to them.\n\n\"The [shopkeeper] will go 'oh look, we can take money out of your account, you don't have to pay the whole $80!,\" she said.\n\n\"That's how I think people started to get hooked into that system of Centrepay.\"\n\nUrban Rampage banned from Centrepay Photo shows A man pulls up a pallet outside shop Retailer Urban Rampage, whose customers are predominantly First Nations people, is considering a legal challenge against its ban from using Centrepay.\n\nMr Shorten said in December the changes to Centrepay would be \"fully introduced\" by July 1 this year.\n\nBut Services Australia has since confirmed the plan has been delayed, with more details on the changes to be revealed \"in the coming weeks\".\n\nA spokesperson for the Urban Rampage chain of clothing stores said the \"ongoing delay\" was creating a regulatory limbo for its business.\n\nThe company is challenging an ASIC order to stop using Centrepay at the Administrative Review Tribunal, in a move that could prove futile if the changes go ahead as planned.\n\nThe spokesperson confirmed Urban Rampage was offering customers other payment options in the meantime, including Afterpay and direct debits.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/asx-markets-business-news-live-updates/105484434",
        "title": "Live: ASX gains despite Qantas shares dipping on data hack",
        "publish_date": "Tue, 01 Jul 2025 22:16:36 +0000",
        "category": "finance",
        "authors": [
            "Michael Janda",
            "David Taylor",
            "Daniel Ziffer",
            "Emilia Terzon",
            "Stephanie Chalmers",
            "Kirsten Aiken"
        ],
        "text": "Hi team,\n\nJumping in with substantial industrial relations news, after the Fair Work Commission (FWC) ruled 5,000 McDonald's workers in South Australia have the right to bargain together for an enterprise agreement.\n\nOne of the nation's biggest unions, the SDA has won its \"Supported Bargaining Application Authorisation\" bid, which means McDonald's franchises in South Australia will have to negotiate with their workforce and the Union.\n\nThe reason it is big — beyond the fact McDonald's is the largest fast-food chain in the country — is it's a big example of laws passed by the Albanese Government that aimed to improve the power of workers in bargaining.\n\nThe laws were designed to help low-paid workers, with clearly identifiable common interests, access bargaining.\n\nMcDonald's argued in the FWC that their franchises don't share common interests.\n\nHere's SDA South Australian secretary Josh Peak:\n\n\"This is a landmark win for low-paid fast-food workers in Australia. \"The fast-food industry has the highest proportion of award-reliant workers in the country, these workers deserve to be covered by Enterprise Agreements. \"For the first time in six years, this will give Maccas workers the power to have a say on their wages and workplace entitlements. \"This decision sends a clear message: Corporate America can no longer deny their low-paid Australian workers the right to bargain. \"This ruling confirms something that was always obvious — that McDonald's stores share common interests and workers should be able to bargain together.\"\n\nBusiness lobby group the Australian Industry Group called the development \"deeply disappointing\" and said it vindicated concerns it held about the laws.\n\nChief executive Innes Willox says the scope of the supported bargaining laws needs to be reconsidered.\n\n\"The decision highlights the risk for thousands of employers in the fast-food, retail, hospitality and many other sectors, of being dragged into multi-employer bargaining by unions against their will and without the support of the majority of their employees. This includes many small businesses that are struggling to survive in the current difficult trading environment. \"The union-friendly supported bargaining stream was intended to operate in sectors where the employers and employees need a lot of support to bargain, typically because of the Government-funded nature of those sectors. This is the first time that a supported bargaining authorisation has been issued outside of a Government-funded sector. \"Many hundreds of enterprise agreements have been made in the fast-food industry and there is no reason why the main enterprise bargaining laws should not apply, including the requirement for a union to establish that the majority of employees support the negotiation of an enterprise agreement.\"\n\nThis decision could mean other large fast-food retailers will also be dragged to the negotiating table by unions seeking better pay and conditions for workers.\n\nMore to come.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/wa-government-failing-threatened-ecological-communities/105480876",
        "title": "Investigation finds government failing to protect vulnerable WA environment",
        "publish_date": "Tue, 01 Jul 2025 22:11:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than two thirds of Western Australia's threatened ecological communities (TECs) are ineffectively monitored and protected, with an auditor general's inquiry exposing the state's failure to act under its own conservation laws.\n\nThe Department of Biodiversity, Conservation and Attractions (DBCA) has made little progress in monitoring or protecting 72 per cent of TECs, according to the report by Auditor General Caroline Spencer.\n\nRecovery plans were either interim or outdated, with none approved by the environment minister.\n\nThe Bunda Bunda Mound Springs on the Dampier Peninsula are considered a threatened ecological community. (Supplied: Shane Hughes)\n\nThe report also found it would take more than a century, at the current rate, to assess 390 at-risk communities identified as potentially threatened.\n\nIt said 60 of the communities awaiting assessment were in the Kimberley.\n\nMs Spencer said DCBA lacked the resources and planning to meet its obligations.\n\nShe found the department did not have a TEC strategy, and it was unclear if current activities aligned with long-term conservation goals.\n\nCaroline Spencer says DBCA lacks resources to meet its obligations. (ABC News: James Carmody )\n\nThe WA Biodiversity Conservation Act was passed in 2016, coming into effect with regulations in 2019.\n\nIt allowed the environment minister to list a species or ecological community as threatened.\n\nThere have been 65 threatened ecological communities listed across the state.\n\n'Disappointing' outcome\n\nEnvirons Kimberley executive director Martin Pritchard said the government was not prioritising the environment.\n\nMartin Pritchard says the state government needs to take action. (ABC Kimberley: Andrew Seabourne)\n\n\"It's so disappointing the government is choosing not to fund the proper management of these threatened ecological communities to make sure they survive,\" he said.\n\n\"This means we don't know what's happening to these environments.\n\n\"Are they being severely impacted by cattle? Is climate change impacting them? Is the extraction of ground water a major threat to them?\"\n\nMr Pritchard said he was \"shocked\" part of the $2.4 billion operating surplus for 2024-25 could not be used to fund ecological protection.\n\nPoor resourcing\n\nThe Montane Heath and Thicket of the Eastern Stirling Range are listed as critically endangered on the state's south coast.\n\nThe Eastern Stirling Range Montane Heath and Thicket is a threatened ecological community. (Supplied: Clay Taylor)\n\nUniversity of Western Australia botanist Stephen Hopper said it was time to protect \"wonderful natural heritage assets\".\n\n\"It's simply going to decline and get worse, and that is not just a local problem, it's a national and international challenge,\" Professor Hopper said.\n\n\" If we don't care for now, who's going to? \"\n\nHe blamed low state and federal government funding, in part, for limiting the DCBA's ability to effectively do its job.\n\n\"There are well-meaning people in the department trying to do the best they can,\" he said.\n\n\"They're in this invidious position of not even having the resources to be able to monitor whether the conservation status was going up or down with threatened communities.\"\n\nPlanning being finalised\n\nThe DCBA did not confirm whether it had made a formal case for increased funding to implement the Biodiversity Conservation Act.\n\nIn a statement, a department spokesperson said it welcomed the auditor general's review.\n\n\"Recovery actions for TECs and threatened species are built into broader conservation programs by DBCA and supported by State, Commonwealth, and non-government funding,\" they said.\n\n\"Regional conservation planning is being finalised across all nine DBCA regions, ensuring a consistent, prioritised approach to addressing threats to threatened species and ecological communities.\"\n\nThe spokesperson said recovery plans were prioritised when significant complexities in conservation planning arose.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/cleveland-dodd-inquest-coroner-delivers-preliminary-findings/105483386",
        "title": "Coroner's early take on teen's death shows Justice Department on defensive",
        "publish_date": "Tue, 01 Jul 2025 21:37:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "In handing down his early assessment of WA's first recorded death in youth detention, Coroner Philip Urquhart had the opportunity to provide a vote of confidence in how the Department of Justice responded to the tragedy.\n\nWARNING: This story discusses incidents of self-harm and contains the name and image of an Indigenous person who has died.\n\nInstead, he did the opposite, at least in part.\n\nThe department has repeatedly argued the inquest's scope should be limited to only what is directly relevant to Cleveland Dodd's death, which came after he self-harmed inside his cell in a makeshift youth detention facility in 2023.\n\nIn its closing submissions, it said \"the general operation of youth justice in this state\" should be looked into \"at another time and in another place\".\n\nThat was despite Coroner Urquhart describing evidence heard by the inquest as revealing \"youth justice was in a crisis at the time of Cleveland's death and had been for some considerable time\".\n\nCoroner Philip Urquhart did not say whether he would call for Unit 18 to be closed in his final report. (ABC News: James Carmody)\n\nWould it be reasonable to expect the department to bring those broader issues to the attention of those other authorities who it said would be better placed to look into them?\n\n\"I do not consider the department would do so,\" was Coroner Urquhart's assessment.\n\nThe reason was simple.\n\nAt the same time as the department was telling him more fundamental issues should be looked into elsewhere, it was arguing there was no reason to even go looking.\n\nCoroner flags special inquiry into Unit 18 in wake of teen's death in detention Photo shows A young boy sits with an electric guitar. The coroner investigating Western Australia’s first recorded death in youth detention says there is significant evidence the teenager’s needs were not met, and indicated he may call for a wider-ranging inquiry.\n\n\"The department does not consider there is any material to suggest there is any scope for an adverse comment to be made about itself or its employees on most, if not all, of those issues,\" was how Coroner Urquhart summed it up.\n\nBut he has a different view.\n\nTimeframe questioned\n\nThose issues were serious and included problems at Banksia Hill Detention Centre which led to the rushed opening of Unit 18, allegations of \"untruthful or misleading messaging\" about the facility and whether it had been opened \"before it was safe to do so\".\n\n\"There is evidence that has revealed aspects of the manner in which the department did its work which is worthy, in my view, of closer examination in a special inquiry,\" was the polite way he phrased it, pointing to some of the evidence he had heard.\n\nAmong it, testimony from then-corrective services commissioner Mike Reynolds, who had been on leave around the opening of Unit 18, that it was a \"bad decision\" which was \"destined to fail\".\n\nHe also pointed to evidence from Christine Ginbey, who had been in charge of youth detention at the time, saying the three weeks or so her team was given to get Unit 18 ready was \"entirely unreasonable\" and should have been closer to six months.\n\nChristine Ginbey says the timeframe given to open Unit 18 was \"entirely unreasonable\". (ABC News: Andrew O'Connor)\n\nWhile the idea of a special inquiry makes sense — given its scope can be much broader and be less constrained in the findings it could make, especially against public servants — it's hard to see the government willingly submit itself to another inquiry which almost certainly would not paint its work in a positive light.\n\nShattering the veil of secrecy over juvenile detention Photo shows A barbed wire fence pictured through trees against an orange sky For years WA's juvenile detention system has been shrouded in secrecy. That is about to change, as a coronial inquest examines the death of 16-year-old Cleveland Dodd while in the state government's care.\n\n\"I'm not going to add any more in relation to that, it's far too early,\" Corrective Services Commissioner Brad Royce said outside court.\n\nA state government spokesperson said it could not comment \"until the inquest's final report is delivered\".\n\nAction taken\n\nTo its credit, the department has not been waiting for that final report to take action — something Coroner Urquhart did acknowledge.\n\n\"We have had the opportunity throughout this inquest to understand the likely recommendations and we've acted on those,\" Commissioner Royce said.\n\n\"From the time of the start of this coronial process you would see that there have been a lot of changes and I'd like to acknowledge that the staff at Corrective Services and our significant partners have put a lot of effort into the change that you've seen across the estate.\n\nCleveland Dodd was just 16 when he died after self-harming in Unit 18. (Supplied: Family)\n\n\"We acknowledge that we have a lot of work to do and we'll continue to work hard in that space.\"\n\nIt is this change that Cleveland Dodd's family hope has a meaningful impact.\n\n\"If Cleveland had all the right help … maybe he'd be here today with us,\" his grandmother Roslyn Sullivan said outside court.\n\nRoslyn Sullivan says her family do not want another to go through what they have endured. (ABC News: Keane Bourke)\n\n\"All the things he went through, I wouldn't want another child to go through that.\"\n\nNo closer to closure\n\nDespite the department's work, a key request of Cleveland's family — and what the coroner has flagged could be one of his key recommendations — remains just an idea.\n\nSince it opened there have been calls to close Unit 18, the argument being an adult prison will never be suitable to look after the state's most vulnerable youths.\n\nGerry Georgatos, a suicide prevention advocate who at one point worked inside youth detention, said the continued use of the \"concrete nightmare\" of Unit 18 meant all young people in detention were being failed.\n\n\"They have the most pronounced longings and yearnings,\" he said.\n\n\"Do not disown the children who need us most to Unit 18. Instead, invest in seasoned experience.\"\n\nThe government has said it is doing that, but has maintained it cannot close the facility until a replacement is built, because it needs two distinct locations to manage young people in detention, lest the chaos that led to the opening of Unit 18 be repeated.\n\nCoroner Urquhart is still weighing up whether to recommend Unit 18 at Casuarina be closed. (ABC News)\n\nThe government promised to do that in late 2023, the month after Cleveland died.\n\nBut the government is yet to allocate the project more than $11.5 million in last month's state budget — money it announced nearly a year ago for planning and early site works.\n\nThat's not enough to satisfy Cleveland's family and those desperate for change.\n\nWhile not directly addressed by Coroner Urquhart, he did note he is still weighing up whether to recommend Unit 18 be closed when he hands down his final report.\n\n\"Everything must be done to minimise the risk of another death of a child in youth detention in Western Australia,\" he said in closing the inquest's hearings yesterday.\n\n\" I sincerely hope that those responsible for implementing the recommendations I ultimately make will have the resolve and the commitment to make them happen. \"\n\nThe ultimate test for this inquest — and any processes that follow it — is whether they result in real, lasting change in WA's long-troubled youth justice system.\n\nFormer inspector of custodial services Neil Morgan wrote in 2017: \"For the nine years I have been in this job, Banksia Hill has lurched from crisis to partial recovery and then back into crisis.\"\n\nOnly time will tell if that cycle will be broken this time around.\n\nAnd while a specific examination into what went wrong at the department is not essential, it certainly wouldn't hurt efforts to deliver meaningful change.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-02/sean-diddy-combs-racketeering-sex-trafficking-verdict/105484224",
        "title": "Diddy jury reaches partial verdict but deadlocked on racketeering charge",
        "publish_date": "Tue, 01 Jul 2025 21:19:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "The jury at Sean \"Diddy\" Combs's sex trafficking trial has reached verdicts on four of the five counts the music mogul faces, but is deadlocked on the most serious charge of racketeering conspiracy.\n\nThe verdicts have not been revealed.\n\nUS District Judge Arun Subramanian instructed the jury to continue deliberating to try to reach unanimous agreement. The jury has since been sent home for the day and will return on Wednesday, local time.\n\nThe judge said the jury had communicated with him via a note near the end of its second day of deliberations.\n\nThe note said the jury had reached a verdict on two counts of sex trafficking and two counts of transportation to engage in prostitution, the judge said.\n\nBut on the charge of racketeering, he said, the jury note read: \"We have jurors with unpersuadable opinions on both sides.\"\n\nThe judge noted that juries had a right to deliver a partial verdict, but given these jurors only started deliberating a day earlier, he wanted them to continue for now.\n\nJanice Combs, the mother of Sean \"Diddy\" Combs, sat through her son's seven-week trial. (Reuters: Kylie Cooper)\n\nMr Combs had pleaded not guilty to all five counts. The 55-year-old, a former billionaire known for elevating hip hop music in American culture, could face life in prison if convicted of sex trafficking or racketeering.\n\nBefore Judge Subramanian read the jury's note, Mr Combs rubbed his eyes and rested his face against his palm while seated at the defence table with his lawyers huddled around him.\n\nDiddy and Weinstein cases test the limits and legacy of #MeToo Photo shows A composite image of Sean \"Diddy\" Combs and Harvey Weinstein. Two cases in the New York courts have put the city's once-powerful movie and music moguls — and the #MeToo movement — under new scrutiny.\n\nOne defence lawyer, Brian Steel, rubbed Mr Combs's shoulder. Two of Mr Combs's other defence lawyers put their arms around each other. At one point, lead defence lawyer Marc Agnifilo stepped away from the huddle, returned with a piece of paper and handed it to Mr Combs.\n\nMr Combs's mother and several of his children returned to the courtroom after the judge announced the jury had reached a partial verdict.\n\nIt followed a seven-week trial in which two of the music mogul's former girlfriends testified that he physically and sexually abused them.\n\nProsecutors said Mr Combs was charged with racketeering because he used his business empire to force the women to take part in marathon sexual encounters known as \"freak-offs\".\n\nIt is is the most complicated of the charges against Mr Combs because it requires the jury to decide not only whether he ran a \"racketeering enterprise\", but also whether he was involved in committing a range of offences including kidnapping and arson.\n\nFamily and domestic violence support services: If you need help immediately call emergency services on triple-0 1800 Respect National Helpline: 1800 737 732\n\nWomen's Crisis Line: 1800 811 811\n\nMen's Referral Service: 1300 766 491\n\nLifeline: 131 114\n\nThe charge falls under the US's Racketeer Influenced and Corrupt Organizations Act — commonly referred to as \"RICO\" — which is best known for being used in organised crime and drug cartel cases.\n\nGiggles, scuffles and trial by TikTok: The Diddy courtroom circus Photo shows A drawing of Sean Combs, wearing a pale blue jumper, making a heart sign with his hands while standing in court. Disgraced hip-hop mogul Sean \"Diddy\" Combs always knew how to attract attention but he probably never anticipated the circus that now surrounds him at his criminal trial.\n\nDuring the trial, the women said they were pressured to perform with male sex workers in hotel rooms while Mr Combs watched, masturbated and occasionally filmed.\n\nHis lawyers acknowledged that the Bad Boy Records founder, once famed for hosting lavish parties for the cultural elite in luxurious locations like the Hamptons and Saint-Tropez, was at times violent in his domestic relationships.\n\nBut they said the sexual activity described by prosecutors was consensual.\n\nEarlier on Tuesday, the jury requested to review portions of the testimony from the prosecution's star witness, R&B singer Casandra \"Cassie\" Ventura. She had testified about taking part in \"freak-offs\" during her decade-long relationship with Mr Combs.\n\nSexual assault support lines: 1800 Respect National Helpline: 1800 737 732\n\nLifeline (24-hour crisis line): 131 114\n\nFull Stop Australia: 1800 385 578\n\nBravehearts: counselling and support for survivors of child sexual abuse: 1800 272 831\n\nChild Wise: counselling provider: 1800 991 099\n\nABC/wires",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/companies/qantas-s-new-game-changing-airbus-arrives-in-sydney-20250701-p5mbrr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The long-awaited new Qantas plane touches down in Australia",
        "publish_date": "Wed, 02 Jul 2025 11:59:54 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Qantas on Wednesday took delivery of the first of its new Airbus planes which will begin to replace ageing 737s in its domestic fleet.\n\nTorrential rains buffeting Sydney many have diminished the fanfare but the Airbus 321XLR landed in Sydney Airport at 9.45am after departing Bangkok the evening before.\n\nSoggy touch down: The new Qantas Airbus XLR 321 arrives in rainy Sydney. Credit: Qantas\n\nThe arrival of the first 321XLR marks a key moment in the long-awaited refresh of Qantas’ domestic fleet.\n\nThe extra-long range narrow-body plane departed the Airbus factory in Hamburg on Monday and flew direct to Bangkok, showing off the range that Qantas will exploit as more of the 321XLRs are brought online.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-wong-meets-quad-powers-in-washington-musk-s-x-wins-fight-against-esafety-commissioner-trump-s-one-big-beautiful-bill-passed-in-us-senate-20250702-p5mbt9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Trump says Israel has agreed to conditions to finalise 60-day Gaza ceasefire; Wong meets Quad powers in Washington",
        "publish_date": "Wed, 02 Jul 2025 11:54:27 +1000",
        "category": "finance",
        "authors": [
            "Cindy Yin"
        ],
        "text": "The jury at Sean “Diddy” Combs’ sex-trafficking trial has reached a verdict on four of the five counts the music mogul faces, the judge overseeing the case said, without revealing the outcome.\n\nAfter two days of deliberation, the jury reached verdicts on two counts of sex trafficking and two of transportation to engage in prostitution, US District Judge Arun Subramanian announced.\n\nAn illustration of Sean “Diddy” Combs – surrounded by his defence team – as they discuss the jury note regarding verdicts on Tuesday. Credit: AP/Elizabeth Williams\n\nBut the judge said the jury had not been able to reach a verdict on a fifth charge, racketeering conspiracy, because jurors had “unpersuadable opinions on both sides”.\n\nHe instructed the jury to continue deliberating on the racketeering conspiracy count. The jury will resume deliberations at 9am New York time (11pm AEST) on Wednesday.\n\nCombs, 55, had pleaded not guilty to all five counts. If convicted of sex trafficking or racketeering, the former billionaire known for elevating hip-hop in American culture could face life in prison.\n\nThe partial verdict comes after a seven-week trial in which two of Comb’s former girlfriends testified that he physically and sexually abused them.\n\nReuters",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/western-australia/it-s-like-watching-a-test-match-saffioti-whitby-frustrate-zempilas-push-on-bears-deal-20250702-p5mbw5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s like watching a test match’: Saffioti, Whitby frustrate Zempilas’ push on Bears deal",
        "publish_date": "Wed, 02 Jul 2025 11:51:11 +1000",
        "category": "sports",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "Opposition Leader Basil Zempilas has accused the government of passing the buck on transparency around the Perth Bears NRL deal after a frustrating budget estimates session on Tuesday.\n\nTourism Minister Reece Whitby and Sport and Recreation Minister Rita Saffioti passed questions to each other over the course of the day about the modelling of the tourism benefits of the $80 million deal to bring the Bears to Perth.\n\nWA Opposition Leader Basil Zempilas. Credit: Hamish Hastie\n\nIn the morning session, Zempilas grilled Whitby on whether Tourism WA conducted a cost-benefit analysis to establish the Perth Bears NRL team in WA.\n\n“The process and the decision-making around this issue sit very firmly in the sporting division,” Whitby said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/trump-shows-his-impotence-attacking-the-fed-chair-20250702-p5mbum.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump shows his impotence attacking the Fed chair",
        "publish_date": "Wed, 02 Jul 2025 11:50:39 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "“If they were doing their job properly our Country would be saving Trillions of Dollars in Interest Cost. “The board just sits there and watches, so they are equally to blame,” he wrote. On Friday, Trump urged Powell - whose term as chair expires next May - to resign, and said he would only pick a Powell successor who will cut US rates. Trump’s verbal assault on Powell, who he described as a “stubborn mule” – he’s previously said Powell is a bad person, stupid, terrible, a numbskull, an idiot and suffering from Trump derangement syndrome – has intensified since the US central bank chief made it clear after last month’s Fed meeting, that the board would wait for the effects of Trump’s tariffs before making any move on rates.\n\nSo far, there have been only very minor signs that the tariffs are impacting the US inflation rate, but that is to be expected. In place, to date, are the 10 per cent baseline tariff on all imports to the US, along with some specific tariffs on sectors like steel and aluminium. The “big ones” – the “reciprocal” tariffs tailored to individual countries’ exports to the US -- won’t be unveiled until next Wednesday and could take months to show up in inflation data. White House press secretary Karoline Leavitt holding up the note from Trump to Fed chair Jerome Powell written on a list of central bank rates worldwide, during Monday’s press briefing at] the White House, Credit: AP The risk of cutting rates prematurely and then seeing a tariff-driven spike in the inflation rate explains why the Fed has adopted a “wait and see” approach to its monetary policies. The relatively strong US economy and job market at present provide no obvious downside to being patient. Trump is impatient – he wants the Fed to cut its target for the federal funds rate from its current range of 4.25 to 4.5 per cent to between 1 and 2 per cent – because he’s about to inject a debt-funded fiscal boost into the economy.\n\nThe US Senate narrowly approved Trump’s One Big Beautiful Bill Act on Tuesday (thanks to vice president JD Vance’s casting vote) after a marathon 24-hour session. Loading That bill, whose measures and cost might be changed when it returns to the House, would add between $US3.3 trillion ($5 trillion) and $US4 trillion ($6.1 trillion) to US deficits and debt over the next decade. With the interest costs on US government debt already running at about $US1 trillion a year, the new debt generated by that bill will add hundreds of billions more – unless the Fed cuts rates. Hence Trump’s comment that hundred of billions of dollars are being lost because of its inaction. The problem for the Fed, and Trump, is that the central bank’s mandate is to promote price stability and maximum employment, not to enable the US government to borrow more cheaply.\n\nTrump’s attempts to coerce Powell and his fellow board members into cutting rates to help him politically, if they succeeded, would undermine the Fed’s credibility and the trust in it as an institution independent of politics and politicians. Loading That independence is important for the Fed’s ability to influence inflation expectations and guide and reassure financial market participants that its policies are consistent and predictable, which is fundamental to financial stability. The risk for America is that, if investors see the Fed’s independence compromised and its policies driven by political considerations, there’d be an exodus of capital. Given the deluge of US debt that will need to be financed and refinanced in the bond market, that would itself push interest rates up. Confidence in the Fed and other respected central banks rests on their predictability, and a conviction that their monetary policy settings will either be neutral or, when necessary, counter-cyclical to keep inflation rates under control.\n\nPro-cyclical settings – policies influenced by the demands of politicians who face relatively short political cycles and who want growth regardless of the longer-term consequences – would risk igniting inflation. Trump might want a rate-cutter in Powell’s chair but, if that were to eventuate, it would be damaging to the Fed, the bond market and the US dollar, which just experienced its weakest first half of the year in more than half a century. US bond funds have had their biggest net outflows since the pandemic. Trump’s trade wars are being blamed for both. Loading While there has been speculation that Trump will soon appoint a “shadow chair” whose presence (and utterings) could confuse markets and undermine Powell, US Treasury Secretary Scott Bessent has said it is possible that the White House will nominate a candidate to the board in October or November. Powell is in the chair until May and has no plans to vacate until then and Trump, despite continually musing about it, has no power to remove him any earlier. But the term of one of the Fed’s governors, Adriana Kugler, ends in January and Trump’s “shadow” chair could be inserted into the board then.\n\nThe credibility of Powell’s successor would, of course, be compromised if they were seen as a Trump stooge - although Trump’s expectations of the next chair’s influence might be a tad unrealistic. There are 19 members of the Federal Open Market Committee, and 12 voting members. The committee, which actually makes rate decisions, can elect its own chair. One person, even the Fed chair, can’t dictate outcomes and a Fed chair whose public commentary was at odds with the bank’s decisions would only confuse markets and damage the institution. Powell is fortunate that even the US Supreme Court seems to believe Trump can’t force him out of the Fed. President Donald Trump was asked if he wanted to deport Elon Musk: “We’ll have to take a look.” Credit: AP Where Trump can threaten Elon Musk (a naturalised US citizen) with deportation to South Africa, or siccing Musk’s former DOGE colleagues on him, his companies and the billions of dollars of taxpayer support they receive each year, all Trump can do to Powell really is continue to abuse him.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/key-blues-sidelined-in-blow-to-origin-iii-preparations-20250702-p5mbtp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Key Blues sidelined in blow to Origin III preparations",
        "publish_date": "Wed, 02 Jul 2025 11:48:09 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Five NSW players either didn’t train or were on restricted duties in a disrupted session in the Blue Mountains on Wednesday.\n\nPayne Haas (back), Hudson Young (groin) and Brian To’o (knee) watched the session at the Blue Mountains Grammar School at Wentworth Falls from the sidelines, while halves Nathan Cleary (groin) and Jarome Luai (infection) didn’t participate in the wrestling session.\n\nSome key Blues couldn’t participate in the training session. Credit: Wolter Peeters\n\nLocal junior team Katoomba Devils were invited to watch the Blues go through their paces, although the media was asked to leave after 15 minutes.\n\nJacob Kirab, who is on standby for To’o as 18th man, was part of the field session, as were additional players Bradman Best, Brian Kelly, Lindsay Smith, Jack Williams, Isaiah Katoa and Teig Wilton.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/europe-looks-east-to-counter-trump-s-tariffs-and-fear-of-russia-20250702-p5mbsr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Europe looks east to counter Trump’s tariffs and fear of Russia",
        "publish_date": "Wed, 02 Jul 2025 11:45:02 +1000",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "European leaders have turned towards Asia in a bid to form a trading bloc to counter US President Donald Trump’s sweeping tariffs, raising hopes in Australia for a deal to boost trade by $106 billion.\n\nAustralian business leaders welcomed the plans from European Commission President Ursula von der Leyen for closer ties with Asia, seeing it as a step towards cutting trade barriers on cars, food and investment.\n\nEuropean Commission President Ursula von der Leyen. Credit: nna\\KCampbell\n\nThe trade agenda is being shaped by concerns in Europe on the economic conflict with the US over tariffs and the military threats from Russia, leading it to seek stronger alliances with like-minded nations.\n\nIn a clear overture to Asia, the EU president has declared her interest in opening Europe to one of the world’s largest trade blocs, known as the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), which includes Australia, as well as Japan, South Korea and Canada.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/king-charles-in-scotland-20250702-p5mbvu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles in Scotland",
        "publish_date": "Wed, 02 Jul 2025 11:43:30 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles in Scotland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/kasatkina-throws-up-before-wimbledon-match-20250702-p5mbx5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kasatkina throws up before Wimbledon match",
        "publish_date": "Wed, 02 Jul 2025 11:41:08 +1000",
        "category": "sports",
        "authors": [],
        "text": "Kasatkina throws up before Wimbledon match\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/celebrity/celebrities-step-out-at-wimbledon-2025-20250702-p5mbvs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Celebrities step out at Wimbledon 2025",
        "publish_date": "Wed, 02 Jul 2025 11:41:05 +1000",
        "category": "sports",
        "authors": [],
        "text": "Celebrities step out at Wimbledon 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/people-are-fed-up-why-10-news-is-going-back-to-basics-20250701-p5mbp9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘People are fed up’: Why 10 News+ is going back to basics",
        "publish_date": "Wed, 02 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Louise Rugendyke"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size If you read the comments under any story about free-to-air news and current affairs, you will find the same mix of complaints: Untrustworthy, too woke, too left, too right-wing and, inevitably, “bring back The Drum”. So launching a new nightly news program, one that promises in-depth coverage and big-picture reporting, is a tough ask: How do you build trust with an audience that is already side-eyeing how news is delivered? It’s a question journalists Denham Hitchcock and Amelia Brace hope to answer as the hosts of Network 10’s new hour-long nightly news program, 10 News+. “[Building trust] that’s difficult because that requires time,” says Hitchcock. “But what we’re saying from the start is that [trust] is at the core of this program, so you will see that in the reporting and the questioning and the topics that we choose, I think that will change people’s opinions because we won’t just be taking one side, we’ll be questioning both sides equally, and when people see that, I think it will change their opinion.” Brace agrees: “It is just about treating our audience with respect. People are intelligent. They do have their own thoughts and they do have their own opinions. So it’s just about telling both sides of the story and then letting people decide what they think of that, not telling them what they think about it.” Amelia Brace and Denham Hitchcock at the 10 News+ desk at Ten’s studios in Pyrmont. 10 News+ is at the heart of Ten’s bid to reshape its early evening viewing. The state-based local news is broadcast from 5pm, followed by 10 News+ at 6pm, and then game show Deal or No Deal at 7pm. Gone is The Project, which finished last week after a 16-year run. In another bold move, 10 News+ will be broadcast on Spotify, as well as on YouTube and 10Play, in what Ten says is a “world first for commercial TV news”. It is an everything, everywhere all at once approach. And it’s also a sharp U-turn from The Project, which mixed news reporting with light entertainment and comedy.\n\nAdvertisement\n\n“People just want their news straight up,” says Brace. “There’s been, I think, a drift in recent years towards opinion or sensationalism, and in some media even, I think bias. And people kind of leant into that for a while and enjoyed the change, but now people are fed up with it. Denham Hitchcock and Amelia Brace bring a long history of news reporting to 10 News+. Credit: Wolter Peeters “They don’t want to be told what to think or how to think. They just want their information and then they can make up their own minds. People are smart. They don’t need to be told what to think.” So what does that mean in practice? On the basis of Monday night’s first episode, it was an exclusive interview with Debbie Voulgaris, the convicted drug smuggler and Melbourne mother who is currently serving a 15-year prison term in Taiwan, and another interview with Prime Minister Anthony Albanese. Loading Both stories were longer than most standard news segments and, apart from covering a shark attack on the far north coast of NSW, the show steered clear of the kind of local fracas that are grist to the daily news mill. It’s an approach, says Hitchcock, that melds the best of Australia’s big TV news hitters: 7.30 and Four Corners on the ABC, 60 Minutes on Nine and Spotlight on Seven. “Our show is a hybrid of almost all of them,” says Hitchcock. “We’ll see a story in our first two days, I’m pretty sure it’ll be Monday [the Voulgaris story], that will be a story that 60 Minutes, Spotlight or Four Corners would kill for. So we’re hoping viewers will come to us because they’ll get the news of the day, they’ll get the things that matter, but they’ll also see something fresh.”\n\nAdvertisement\n\nBrace, 37, and Hitchcock, 48, come to 10 News+ as familiar faces from Seven and Nine, respectively, where they built their reputations as foreign correspondents, with stints in the US, Europe, Asia and the Middle East. They both began their careers at Seven – Brace in regional Queensland and Hitchcock in Sydney. Brace remembers her first day on the job at Seven, when she was a university student on a competitive internship, which involved covering a fatal bus crash. “I went out shadowing a reporter,” she says. “I kind of really got thrown in the thick of it.” It’s been a wild ride since then, with Brace covering everything from the drought in rural Queensland to being part of a world-record skydive live on air (“It was absolutely terrifying. I cried in my goggles”). In 2020, she won a Walkley Award for her coverage of the protests outside the White House, where she was hit with a baton by police. “You can’t cover these things from a bureau or even from a block back,” says Brace. “Because what is happening to these people is happening on the front line, and you have to be standing there, and you have to sit with your own eyes so you can actually stand up on camera or in Congress, as I had to, and say what happened wasn’t right. Sometimes it’s your job to say, ‘I saw that and that wasn’t OK.’” Hitchcock, meanwhile, got his start in the office of the now defunct current affairs show Today Tonight when he was 18 years old. “I was answering the phones and filling the biscuit barrel,” he says. “But within six months, I was a researcher, and within another three months after that, I was a producer at 18. It was fast, but from there I’ve done almost every job – researcher, producer, editor, reporter, correspondent, all sorts.”\n\nAdvertisement\n\nLike Brace, he’s has the kind of globe-trotting news career that makes great TV – reporting from the frontlines of Syria and Iraq, covering the Sandy Hook Elementary School shooting, and Typhoon Haiyan in the Philippines – but it’s the quieter story of Sharn McNeill, who was only 30 when she was diagnosed with motor neuron disease, that he names as one of his favourites. “It always makes me teary whenever I even describe it to anybody,” he says. “That’s one of those stories of human endurance and positivity that always stays with me.” The team from 10 News+ (from left) 10 NEWS+ Samantha Butler, Brianna Parkins, Angela Bishop, Hugh Riminton, Amelia Brace, Denham Hitchcock, Ursula Heger, Ashleigh Raper, Bill Hogan and Carrie-Anne Greenbank. With so long in business, do either of them see a difference in how news is reported or consumed today? Loading “I don’t see a change in the stories of people interested in, just in the way they consume it and the speed in which they consume it,” says Hitchcock. “Those big stories used to happen and [you] used to be able to chew on it for a whole week. Now it could be the most immense story that you’ve ever seen, and three days later, we’re on to something else.” Brace, meanwhile, thinks people are more overwhelmed than ever before by the “sheer amount of information out there” and this is what leads to the rise in misinformation.\n\nAdvertisement\n\n“It’s just selective reporting when you blatantly just tell one side of a story,” says Brace. “That side is not untrue, but it’s dangerous to do that, I think. I bump into people in real life regularly who say, ‘Did you hear this?’ And I’ll say, ‘But did you hear this?’ And it’s not that I’m on one side or the other. I just get really annoyed when they have no idea that that’s only half the story.” Amelia Brace and Denham Hitchock interview Prime Minister Anthony Albanese on the first episode of 10 News+ on Monday night. The US, famously, is home to Fox News, which proudly wears its bias on its sleeve. Do either of them think there is that type of biased reporting in Australia? “We have more of it than we used to,” says Brace. “I genuinely think that perhaps 10 years ago, we had a really balanced media with very little tolerance for bias. I remember maybe around the Kevin Rudd kind of time – because I’m very politically focused – there started to be some headlines and some things said, and I’d be like, ‘Hm, that’s interesting reporting.’ I just feel like it’s grown over the years, where we now have certain outlets that you just know they’re one side or the other. And I really don’t like that.” Loading Of course, it’s not just bias or misinformation that modern broadcast news has to deal with. The fickle beast that is ratings will probably have more of an effect on 10 News+’s future than any story they choose to do. A dramatic drop in ratings was one of the reasons given for The Project’s axing, so what happens when, say, four weeks from now, 10 News+ isn’t clicking and it’s suggested they start chasing more sensational local stories? “It’ll be a collective decision, the stories that we chase for the day,” says Hitchock. “So that’ll be Dan Sutton, who’s the executive producer, and Martin White, who’s the vice president [of news on Ten]. Those two will be keeping a keen eye on the show, and then Amelia and I, of course, will have heavy input as well.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/we-re-pretty-used-to-it-grundy-dismisses-scg-surface-fears-20250702-p5mbuo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We’re pretty used to it’: Grundy dismisses SCG surface fears",
        "publish_date": "Wed, 02 Jul 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Brodie Grundy has played down concerns about the slippery surface at the SCG, suggesting that Swans players are more used to it than their rivals and expressing confidence it will be in good shape for Sunday’s clash with Fremantle.\n\nThe AFL’s turf experts are overseeing this week’s remediation efforts, focused on the Paddington End of the SCG, which has struggled to recover from the damage left by the stage for an Andrea Bocelli concert on April 3.\n\nThe surface became a national talking point after Friday night’s match between Sydney and the Western Bulldogs, in which players continually lost their footing, prompting the extra scrutiny from the AFL and a broadside from Swans chairman Andrew Pridham, who said it was in an “unacceptable” condition.\n\nPlayers or officials from four different clubs have now expressed their concerns: the Western Bulldogs, Port Adelaide, Greater Western Sydney and Fremantle, whose coach Justin Longmuir was at the Swans-Bulldogs game and later said the SCG appeared to be “unsafe” for players.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/burger-wars-us-fast-food-giant-wendy-s-makes-brisbane-move-20250702-p5mbvr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Burger wars: US fast food giant Wendy’s makes Brisbane move",
        "publish_date": "Wed, 02 Jul 2025 11:26:20 +1000",
        "category": "finance",
        "authors": [
            "William Davis",
            "Jessica Yun"
        ],
        "text": "Famous for its square patties and Frosty shakes, US fast food giant Wendy’s is making a move on Brisbane.\n\nPlans for a Wendy’s outlet at the corner of Adelaide and Albert streets in the CBD have been lodged with Brisbane City Council.\n\nThe development application by Wendy’s Australia shows a blue and red colour scheme – synonymous with the American burger chain – for the vacant building, which was previously occupied by private health insurer Bupa.\n\nAn artist’s impression from Wendy’s development application lodged with Brisbane City Council.\n\nMcDonald’s, KFC, Hungry Jack’s – the Australian iteration of US chain Burger King – and Wendy’s will all be within 120 metres of each other if the plans go ahead.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/marmota-to-kick-off-its-first-drilling-program-at-new-sa-gold-target-20250702-p5mbws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Marmota to kick off its first drilling program at new SA gold target",
        "publish_date": "Wed, 02 Jul 2025 11:23:00 +1000",
        "category": "finance",
        "authors": [
            "Doug Bright"
        ],
        "text": "With ministerial consent to the title transfer under its belt through Half Moon, Marmota now owns 90 per cent of any minerals found at Golden Moon, including gold. The deal excludes opals, iron ore and palygorskite, which is also known as Fuller’s Earth.\n\nUnder the joint venture terms, Half Moon will free carry Coombedown until a decision to mine is made. Marmota will manage the joint venture through Half Moon.\n\nUnlike the extensively drilled Aurora deposit, the Golden Moon ground has been subject to only minimal drilling. It had not been tested for six years until Marmota kicked off its sub-surface probing at Campfire Bore in September last year.\n\nMarmota Limited chairman Dr Colin Rose said: “We are delighted that the title transfers of these core gold deposits/tenements have now been formally completed, ticking off another box on Marmota’s Gawler gold project. The Golden Moon JV heralds a new era of gold exploration and resource growth in the Gawler Craton. Work started on these assets under the guidance of Dominion, which made the discovery of the Challenger gold mine.”\n\nDr Rose said the Golden Moon joint venture has cleared the deck, after some delays, with a clean new structure now completed.\n\nMarmota’s first drilling program at Campfire Bore put in 86 reverse circulation holes for 11,690m by mid-October last year. The company immediately began planning follow-up work after seeing considerable growth potential at the prospect, encouraged by the December discovery of high-grade gold in multiple holes.\n\nCampfire Bore’s best results from its first phase of drilling included an early 4m assaying 16 grams per tonne (g/t) gold from 56m below surface and 16m going 2.7g/t gold from 35m, including 4m running 8.6g/t gold from 42m.\n\nOther results include bonanza grades up to 1m assaying 107g/t gold from 57m depth, five other intersections above 20g/t gold and 13 new intersections exceeding 10 g/t gold, including 5m going 12g/t, 3m at 11g/t and 3m at 10g/t gold.\n\nDuring an internal review of Greenewood’s exploration history, Marmota noted previous third-party drilling results from 2016 and 2017 that include multiple intersections of more than 20g/t gold in six holes close to surface. These include 1m at 53g/t gold from 30m, 1m at 37g/t gold from 48m and 1m at 29g/t from 31m.\n\nA further three holes delivered 1m assaying 23g/t from 24m, 1m at 23g/t from 23m and 1m going 21g/t from 41m.\n\nThe proximity of the Golden Moon joint venture deposits to the company’s Aurora Tank project brings development and logistical synergies and benefits.\n\nAurora Tank is characterised by multiple shallow high-grade hits and exhibits outstanding potential for low-cost, low-capex, open-pit, heap-leach production.\n\nWhile recent drilling has yielded a host of high-grade gold intersections and indicates significant potential for expansion, Marmota is focusing on completing its metallurgical test work and a scoping study and producing a maiden resource in the next six months.\n\nWith promising new ground close to Aurora Tank, the company now has a solid portfolio of gold deposits in the Gawler Craton to follow up.\n\nIt has already identified new high-grade gold extensions in first stage drilling at Campfire Bore. Through Half Moon, Marmota also owns all the Typhoon and Monsoon deposits, which are part of the Western Gawler Craton joint venture project.\n\nIf Marmota’s imminent drilling at Greenewood can replicate its Aurora Tank and Campfire Bore successes, the company will have won a uniqiue trifecta – or something like this\n\nIs your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/lodging-your-tax-return-early-heres-why-that-could-cost-you/1446sc2xn",
        "title": "Lodging your tax return early? Here's why that could cost you",
        "publish_date": "Tue, 1 Jul 2025 19:34:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the new financial year dawns, many Australians are eagerly awaiting some much-needed funds in the form of a tax return.\n\n\n\n\n\nAlmost half of Australia (47 per cent) is expecting a tax refund, according to a survey of 1,015 people from financial comparison site Finder.\n\n\n\n\n\nOf those expecting a refund from the Australian Taxation Office (ATO), more than half (52 per cent) plan to put the extra cash straight into savings.\n\n\n\n\n\nAs the cost of living continues to bite, 19 per cent said they would use the extra funds to pay for household bills.\n\n\n\n\n\nOnly a small portion said they'd use it for discretionary spending like holidays (7 per cent) or shopping sprees (5 per cent), while 6 per cent plan to put it towards their mortgage.\n\n\n\nWant to file your tax return now? Not so fast\n\nWhile many Australians might be eager to get their refunds quickly, it might be better to wait, says H&R Block's director of tax communications, Mark Chapman.\n\n\n\n\n\n\"There are really two reasons [to wait]. First, the ATO isn't even going to process refunds until the second week of tax time,\" Chapman told SBS News.\n\n\n\n\n\n\"Secondly, the pre-filled information which the ATO relies upon to pre-fill your tax return — provided by employers, banks, health funds — is often not available for the first couple of weeks of July.\"\n\n\n\nLISTEN TO Tax time tips & ASX enjoys above average returns in FY25 SBS News 30/06/2025 19:24 English\n\nIf you're completing your tax return by yourself, you may be relying on the ATO's pre-fill function, which automatically inputs things like your income, health insurance, and bank interest.\n\n\n\n\n\n\"But it takes time for all these different organisations to finalise all of their financial statements and report that information to the ATO,\" said Sarah Megginson, personal finance expert at Finder.\n\n\n\n\n\n\"Your employer has until 14 July each year to finalise your payroll data and submit it with the ATO, and without this information, it's really hard to complete your return.\"\n\n\n\nJump the gun, and you'll risk missing important income details.\n\n\n\n\n\n\"If you lodge in the first two weeks, you run a real chance of basically missing income from an employer or bank interest and then having to do an amendment later on,\" Chapman said.\n\n\n\n\n\n\"It's very easy to miss some form of income if you've got three or four bank accounts, all of which will pay interest.\n\n\n\n\n\n\"If you've only got one or two of them on the ATO's pre-fill, it's very easy to miss the other ones — so it's potentially dangerous completing a tax return without that pre-filled information.\"\n\n\n\nSo, when's the best time to file your tax return?\n\nChapman recommends lodging your return in the third week of July, when pre-filled information is usually complete and the ATO has started processing refunds.\n\n\n\n\n\nBut if you're expecting to owe tax, it could be worth holding off until the very last moment — 31 October if you self-lodge, or 15 May next year if you use a tax agent.\n\n\n\n\n\n\"Your tax liability isn't crystallised until your tax return is processed. So the later it's processed, the later your payment is due,\" he said.\n\n\n\nTips for a smooth tax return\n\nDon't rely on pre-filled information. Always use your own records as the primary source, Chapman warned.\n\n\n\n\n\n\"Don't assume the ATO pre-filled data is correct or complete, particularly if you're lodging early,\" he said.\n\n\n\n\n\nHe also advised double-checking the basics.\n\n\n\n\n\n\"Returns routinely get held up at the ATO because there's some kind of data mismatch between what you've reported and what information the ATO has. I'm not talking about tax information — I mean your name or your address.\"\n\n\n\nIf you've moved during the year, changed your name, or updated your bank details, make sure this is reflected with the ATO beforehand.\n\n\n\n\n\nOtherwise, your return could fall into a \"void\" and be delayed, Chapman said.\n\n\n\n\n\nAnd while it should perhaps go without saying, make sure your bank account details are correct if you want to actually receive your refund.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/what-is-the-super-guarantee-and-how-will-it-affect-you/edwinuq22",
        "title": "What is the Super Guarantee, and how will it affect you?",
        "publish_date": "Tue, 1 Jul 2025 09:54:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "What is the Super Guarantee, and how will it affect you?\n\nPublished 1 July 2025, 9:17 am\n\nIt's the start of the new financial year, and there are many new changes coming into effect. Superannuation is a big change — one that affects every working Australian. From today, the Superannuation Guarantee rises for the final time, after gradually increasing annually from 9 per cent to 12 per cent. This is the compulsory contribution your employer must tip into your super fund, and has boosted Austraila 's retirement savings pool into one of the largest in the world.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/fy26-property-hotspots-us-dollar-continues-to-weaken/c3a07pfq2",
        "title": "FY26 property hotspots & US dollar continues to weaken",
        "publish_date": "Tue, 1 Jul 2025 07:59:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/introducing-the-beta-blueprint/gv1h43ust",
        "title": "Introducing: The Beta Blueprint",
        "publish_date": "Tue, 1 Jul 2025 07:30:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-over-a-third-of-this-nations-citizens-want-to-migrate-to-australia/1ksaua61r",
        "title": "Why over a third of this nation's citizens want to migrate to Australia",
        "publish_date": "Tue, 1 Jul 2025 05:39:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than one third of people in Tuvalu want to apply for an Australian visa, as the tiny Pacific nation faces rising sea levels and other impacts of climate change.\n\n\n\n\n\nThe federal government opened an inaugural ballot on 16 June that allows Tuvaluans to register their interest in a special visa program, created under the terms of the Falepili Union treaty between the two countries.\n\n\n\n\n\nThe visa will allow up to 280 Tuvalu nationals each year to live, work and study in Australia.\n\n\n\n\n\nOut of Tuvalu's population of roughly 11,000 people, more than a third have begun the process of applying.\n\n\n\n\n\nAccording to the latest official figures cited by Reuters, 1,124 people have registered as of Sunday, with family members bringing the total to 4,052.\n\n\n\nCommunities facing 'real challenges'\n\nFor some time, scientists have feared climate change may make the Pacific Island nation uninhabitable within 80 years.\n\n\n\n\n\nBy 2050, NASA scientists project daily tides will submerge half the main atoll of Funafuti — home to 60 per cent of Tuvalu's residents, where villagers cling to a strip of land as narrow as 20 metres.\n\n\n\n\n\nTuvalu's mean elevation is just two metres above sea level.\n\n\n\n\n\nIt has experienced a sea level rise of 15cm over the past three decades — one-and-a-half times the global average. It has built seven hectares of artificial land, and is planning more, which it hopes will stay above the tides until 2100.\n\n\n\nREAD MORE Meet the young people who could outlive their own country\n\n'Alopi Latukefu, director of the Global Centre for Social Justice and Advocacy Leadership, said climate change is already being felt across Tuvalu's nine atolls scattered across the Pacific between Australia and Hawaii.\n\n\n\n\n\n\"We are seeing these communities faced with real challenges in the community from the perspective of not just inundation from the sea level rise, but also in terms of food security, water security in these communities, the impact from regular events — whether they be king tides or more serious events — that are creating a very difficult situation,\" he said.\n\n\n\n\n\nHe said it's important to understand that not everyone wants to leave Tuvalu.\n\n\n\n\n\n\"The decision to leave is a very big one and a very important one, and one which is tied to a range of other factors as well to support their families, to provide a pathway for a future, to have access to education, to have access to things that are part of the opportunity that Australia represents.\"\n\n\n\n\n\nBut some may feel they have little choice.\n\n\n\nA 'very generous visa'\n\nProfessor Stephen Howes, director of the Development Policy Centre at the Australian National University, said those selected for the visa will have significant rights to live, work and study in Australia.\n\n\n\n\n\n\"It is a very generous visa,\" he said.\n\n\n\n\n\n\"Most migrants to Australia have to endure a waiting period of several years before they're eligible for benefits. But that's not the case for migrants under this visa.\"\n\n\n\n\n\nHowes said successful applicants would have access to Medicare and others including family benefits and support to study.\n\n\n\nAustralian Prime Minister Anthony Albanese (second from left) and Tuvalu Prime Minister Kausea Natano (right) announcing the Falepili Union treaty in 2023. Source: AAP / Ben McKay Professor Jane McAdam, director of the Kaldor Centre for International Refugee Law at UNSW Sydney, described the Falepili Union treaty as the world's first bilateral agreement that references climate change.\n\n\n\n\n\n\"The visa itself doesn't mention the words climate change at all, but the treaty pursuant to which it was created is framed very much around the existential threat that climate change poses in our region,\" she said.\n\n\n\n\n\n\"It was an element that the government of Tuvalu specifically requested from Australia.\"\n\n\n\n\n\nAnnouncing the treaty in 2023 , Prime Minister Anthony Albanese said the agreement \"reflects Tuvalu's special circumstances as a low-lying nation that's particularly impacted, its very existence, by the threat of climate change\".\n\n\n\n'It's not a climate visa'\n\nThe pact has several elements, including climate mitigation and adaptation, the migration pathway, and security.\n\n\n\n\n\nHowes said while the visa will benefit those selected in the lottery, Australia has also gained some strategic advantages through the Falepili Union.\n\n\n\n\n\n\"What Australia got out of the agreement was a sort of veto power over Tuvalu's security arrangements — or, specifically, security partnerships,\" he said.\n\n\n\n\n\n\"Under the agreement, Tuvalu has to seek Australia's permission before entering into an agreement with the third country in relation to security, and that's clearly aimed at China.\"\n\n\n\nLatukefu welcomed the new visa, but said Australia needs to take stronger action to address climate change.\n\n\n\n\n\n\"It's not a climate visa, let's be very clear about this. It's under the Falepili [Union] treaty ... a treaty of friendship with Tuvalu,\" he said.\n\n\n\n\n\n\"It's often referred to as a climate visa, but it's one that is not framed in that context. That's partly because of Australia's need to not frame things in that context because of our own interests.\"\n\n\n\nLISTEN TO World Bank head sees climate change devastation in Tuvalu SBS News 08/09/2024 04:56 English\n\nLatukefu said it's important that Tuvaluans are supported to maintain their connection to their lands and culture.\n\n\n\n\n\nMcAdam agrees ongoing mobility will be important feature of the new visa.\n\n\n\n\n\n\"I think the proof will be in the pudding in terms of what actually happens when the first, second, third groups of people arrive — how well supported they feel once they're here, how much they are facilitated to create their own cultural facilities and community supports here,\" she said.\n\n\n\n\n\nBallot applications close on 18 July, with an annual cap of 280 visas designed to ensure migration to Australia does not cause brain drain from Tuvalu, officials said when the treaty was announced in 2023.\n\n\n\n\n\n— With additional reporting from Reuters\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-the-dalai-lamas-successor-is-chosen-and-why-the-stakes-are-high/3fuohjvug",
        "title": "How the Dalai Lama's successor is chosen and why the 'stakes are high'",
        "publish_date": "Tue, 1 Jul 2025 05:30:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "At a school in Sydney's northern beaches, the sound of prayer, drums and chatter fills the air.\n\n\n\n\n\nFor months, students at the Tibetan Language and Culture School at Mackellar Girls Campus have been preparing a traditional dance. They're set to perform at NSW parliament to honour the Dalai Lama's 90th birthday this Sunday.\n\n\n\n\n\nPhuntsok Dolma Tentso says it's a chance to connect with their culture and enjoy cultural freedoms.\n\n\n\n\n\n\"Kids in Tibet don't have the opportunity to go to Tibetan schools like us. They're forced into colonial boarding schools and integrated into Chinese lifestyles,\" she told SBS News.\n\n\n\n\n\n\"But here in Australia, we have the opportunity to learn our culture, religion and language, which I think is really important so we can continue the Tibetan cause.\"\n\n\n\nThe Tibetan Language and Culture School students in Sydney rehearse a traditional Tibetan dance. Source: SBS News For Tibetan human rights campaigner Kyinzom Dhongdue, the upcoming celebrations bring \"both hope and urgency\", with the future of Tibetan spiritual leadership remaining uncertain.\n\n\n\n\n\nThe Dalai Lama will address a major three-day gathering of Buddhist religious figures this week, as his followers await details about his succession.\n\n\n\nWho is the Dalai Lama?\n\nHis Holiness the 14th Dalai Lama, Tenzin Gyatso, is the spiritual leader of Tibet.\n\n\n\n\n\nBorn to a farming family on 6 July 1935 in north-eastern Tibet, he was recognised as the \"reincarnation\" of the previous Dalai Lama at the age of two.\n\n\n\n\n\nHe fled Tibet in 1959 after a failed uprising against Chinese communist rule. Since then, he has been living in Dharamshala, in northern India.\n\n\n\n\n\nThe Dalai Lama also traditionally carries political and cultural significance in the region. In 2011, he handed his political role to a democratically elected government, ending a 368-year-old tradition of being both the spiritual and temporal head of Tibetans.\n\n\n\nHow is the Dalai Lama's successor chosen?\n\nTraditionally, the Dalai Lama is identified after death, with senior monks seeking a child believed to be their reincarnation, guided by dreams, visions and ritual tests.\n\n\n\nKevin Carrico, a senior lecturer in Chinese studies at Monash University, said: \"The idea is that after one Dalai Lama passes away, the spirit of that Dalai Lama is reincarnated in a child born within one year of the Dalai Lama's death.\"\n\n\n\n\n\nThis was the practice when Tibetans were able to make their own decisions about reincarnation and succession, Carrico said.\n\n\n\n\n\n\"Since the incorporation of Tibet into the People's Republic of China in the 1950s — despite various guarantees that there would be no interference in the political or religious systems of Tibet — it would be a dramatic understatement to say there has been unprecedented interference in the political and religious systems of Tibet,\" he said.\n\n\n\nWhy is China involved?\n\nZoë Bedford, executive officer of the Australia Tibet Council, said the Tibetan diaspora is \"very anxious\".\n\n\n\n\n\n\"So much depends on His Holiness the Dalai Lama,\" she said.\n\n\n\n\n\n\"The reason for such high anxiety is because we know that the Chinese government is trying to interfere with the reincarnation process for the next Dalai Lama,\" she said.\n\n\n\nLISTEN TO Who will be the next Dalai Lama? SBS News 30/06/2025 07:18 English\n\nIn his memoir released in March, the Dalai Lama stated for the first time that his successor would be born in the \"free world\", signalling a reincarnation outside China's control.\n\n\n\n\n\nHe has previously only said that he could reincarnate outside Tibet, possibly in India, where he lives in exile.\n\n\n\n\n\n\"Since the purpose of a reincarnation is to carry on the work of the predecessor, the new Dalai Lama will be born in the free world so that the traditional mission of the Dalai Lama — that is, to be the voice for universal compassion, the spiritual leader of Tibetan Buddhism, and the symbol of Tibet embodying the aspirations of the Tibetan people — will continue,\" the Dalai Lama stated in his memoir.\n\n\n\n\n\nBut China views the Dalai Lama as a separatist and political exile who has \"no right to represent the Tibetan people at all\", a spokesperson for China's foreign minister said when asked about the book during a news conference.\n\n\n\n\n\nChina insists it will choose his successor, but the Dalai Lama has said any successor named by China would not be respected.\n\n\n\n\n\nChina's foreign ministry has previously said reincarnation of living Buddhas, including the Dalai Lama, \"must comply with Chinese laws and regulations\".\n\n\n\n'The stakes are high'\n\nDhongdue said the Dalai Lama has taken \"proactive steps\" to protect the reincarnation process.\n\n\n\nREAD MORE China says Australia is plagued by racism and hypocritical after Tibet, Xinjiang raised at UN\n\n\"It is a political reality that has forced us to protect the institution and the integrity of this tradition, free from Chinese interference,\" she said.\n\n\n\n\n\n\"While we have complete faith in His Holiness and the Tibetan Buddhist system in managing this challenge … the next few years and decades will be critical for Tibet and the stakes are high — politically, culturally, and spiritually.\"\n\n\n\n\n\nCarrico believes we could be \"looking at the very real possibility of a conflict between a sort of Tibetan-chosen successor and a Chinese-chosen successor\".\n\n\n\n\n\n\"That would obviously create extreme tensions in Tibet and in global society more broadly,\" he said.\n\n\n\n\n\nDhongdue said this would be \"nonsensical and dangerous\".\n\n\n\n\n\n\"Beijing has to know that this is not going to work. The Tibetan people's bond with His Holiness will always remain strong. If Beijing tries to install a fake Dalai Lama … that person will not be accepted by the Tibetan people as well as the global Buddhist community — and neither should the international community,\" she said.\n\n\n\nIn 1995, following the death of the Panchen Lama — the second-highest Tibetan Buddhist figure — the Dalai Lama recognised a six-year-old boy as his reincarnation.\n\n\n\n\n\nHe was taken into what Chinese authorities described as protective custody and has not been seen since. Another child was named the reincarnated.\n\n\n\n\n\nBedford expects \"great concern\" about the safety of any future successor not aligned with China.\n\n\n\n\n\n\"If another person or an adult is chosen to be the successor of the Dalai Lama, there'll be concern about their welfare,\" she said.\n\n\n\nWhat else has the Dalai Lama said?\n\nThe Dalai Lama has previously said the line of spiritual leaders might end with him.\n\n\n\n\n\nHe has not ruled out the possibility of an adult — or a woman — as his successor, controversially saying in a 2019 interview that \"if a female Dalai Lama comes, she should be more attractive\". He later apologised and clarified the remarks.\n\n\n\nThe Dalai Lama will turn 90 on Sunday and has said he would consult senior monks and others at this time to share possible clues on where his successor could be found following his death.\n\n\n\n\n\n\"The rest of my life I will dedicate for the benefit of others, as much as possible, as extensive as possible,\" the Dalai Lama told a gathering of his followers on Monday.\n\n\n\n\n\n\"There will be some kind of a framework within which we can talk about the continuation of the institution of the Dalai Lamas.\"\n\n\n\n\n\nDolma Tsering Teykhang, the deputy speaker of the Tibetan parliament-in-exile in Dharamshala, said it was important for the world to hear directly from the Dalai Lama on the issue.\n\n\n\n\n\n\"China is trying to grab this institution ... for its political purpose,\" she said.\n\n\n\n\n\n\"We want the incarnation of the Dalai Lama to be born not only for the survival of Tibet as a distinct culture, religion and nation, but also for the well-being of the whole humanity.\"\n\n\n\n\n\nThe religious conference this week, being held for the first time since 2019, will be attended by more than 100 Tibetan Buddhist leaders.\n\n\n\n\n\n— With additional reporting by Reuters\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-1-july-2025/09lysaarv",
        "title": "Australia’s east coast pounded by severe storms | Midday News Bulletin 1 July 2025",
        "publish_date": "Tue, 1 Jul 2025 02:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Key Points Emergency crews on standby as east coast storm hits\n\nHigh-risk Australians eligible for free lung-cancer screening\n\nCarlos Alcaraz beats Fabio Fognini at Wimbledon\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhat's called a \"bomb cyclone\" is set to dump more than 100 millimetres of rain in the space of hours on Australia's east coast.\n\n\n\n\n\nMeteorologists say the fast-developing storm Sydney will impact significant stretches of the New South Wales coast today and tomorrow.\n\n\n\n\n\nIt's already sparked heavy rain, strong winds and hazardous surf - and up to 120 millimetres of rain is expected to lash Greater Sydney alone over the next six hours.\n\n\n\n\n\nSES state operations manager Dallas Burnes says emergency calls have already started to come through - as the weather system intensifies.\n\n\n\n\n\nHe says the mid north coast region is an area of concern for emergency services because of the soil is still saturated from the May floods.\n\n\n\n\n\nHelen Reid - from the Bureau of Meteorology - says flash flooding is also a risk for communities.\n\n\n\n\n\n\"There is isolated heavy rainfall, which may lead to flash flooding along the coastal fringe, north of Ulladulla with six-hourly totals between 70-90 millimetres up to 120 millimetres in isolated locations in that six-hour period. Towns impacted include Armidale, Newcastle, Gosford, Sydney, Wollongong, Nowra and Batemans Bay. Locally, destructive wind gusts of 125 kilometres an hour - also possible from midday on Tuesday for exposed coastal areas between Bondi and Wollongong.\"\n\n\n\n---\n\n\n\n\n\nFrom today, Australians at high risk of developing lung cancer can undergo a screening test - free-of-charge through Medicare.\n\n\n\n\n\nAustralia’s first new national cancer screening program in nearly 20 years is being rolled out, targeting people aged between 50 and 70 who have a history of smoking.\n\n\n\n\n\nAboriginal and Torres Strait Islander people are in particular, being encouraged to use the screening program, as lung cancer is the most common cause of cancer death among First Nations Australians.\n\n\n\n\n\nThe CEO of the Lung Foundation Australia, Mark Brooke, says early screening aims to improve the survival rate outcomes.\n\n\n\n\n\n\"Australia stands as leaders globally. We will be one of the first countries in the world to have a National Lung Cancer Screening Program that will look across Australia, and particularly because it's been co-designed with Aboriginal and Torres Strait Islander people, will support those people who have often been forgotten.\"\n\n\n\n---\n\n\n\n\n\nVictorian premier Jacinta Allan says the state's Voice to parliament won't be written into its constitution.\n\n\n\n\n\nThe Premier says it will not require constitutional change, unlike the failed Federal voice proposal.\n\n\n\n\n\nThe government has confirmed the First People's Assembly will be a permanent fixture and will be made up of 33 elected members who will provide advice on laws and policies that affect Indigenous communities in Victoria, from health and education to crime and development.\n\n\n\n\n\nMs Allan says the voice to parliament - as well as ongoing treaty negotiations - aim to enable First Nations people to have a better say in the policies that affect them.\n\n\n\n\n\n\"The treaty process and outcome is grounded in that pretty simple common sense approach, that when you listen to people who are affected by policies and programs, when you involve them in the processes, you get better outcomes.\"\n\n\n\n---\n\n\n\n\n\nThere are renewed calls for a Gaza ceasefire, after another deadly 24 hours in the enclave.\n\n\n\n\n\nLocal officials and medical staff say Israeli attacks have killed at least 72 Palestinians, including 21 people at a crowded seafront rest area near Gaza City.\n\n\n\n\n\nEarlier, Israel's military issued evacuation orders for those in northern Gaza, as it warned of intensifying military activity.\n\n\n\n\n\nUN spokesperson Stéphane Dujarric says there needs to be a swift resolution to end the violence.\n\n\n\n\n\n\"The Secretary-General is alarmed by the new evacuation orders in northern Gaza, which have once again displaced tens of thousands of people. The Secretary-General condemns the continued loss of civilian life resulting from Israeli airstrikes and other attacks. All parties must comply fully with international law at all times. The Secretary-General welcomes the continued efforts by the mediators and reiterates his appeal to the parties to urgently reach a permanent ceasefire.\"\n\n\n\n\n\nMeanwhile, a US official says President Donald Trump will host Israeli Prime Minister Benjamin Netanyahu for talks at the White House next Monday.\n\n\n\n---\n\n\n\n\n\nIn tennis, Carlos Alcaraz has survived Wimbledon's hottest-ever opening day, eventually triumphing against Fabio Fognini in five sets.\n\n\n\n\n\nWith air temperatures soaring to 32 degrees Celsius, the defending champion needed more than four hours to subdue veteran Fognini.\n\n\n\n\n\nOnly two defending men's champions had ever lost in the first round at Wimbledon, but there were moments when Alcaraz looked in danger of joining compatriot Manuel Santana on that short list.\n\n\n\n\n\nThe last set was interrupted, after a spectator became unwell in the heat and required assistance.\n\n\n\n\n\nAlcaraz charmed the crowd by offering his water bottle to the distressed fan.\n\n\n\n\n\nHe says he was nervous before the match - and he is relieved to get through to the next round.\n\n\n\n\n\n\"I've been playing really, really tough matches the last year, the last year in this tournament. Just really proud that I always find a way. Today I did it, even though Fabio was playing a great tennis. Just really proud to overcome the problem, to overcome the tough moments, and found my way.\"\n\n\n\n---\n\n\n\n\n\nMeanwhile, Jordan Thompson is the only Australian to advance to the second round at Wimbledon, after day one of the tournament.\n\n\n\n\n\nThe 31-year-old beat Czech player, Vit Kopriva in a match lasting three hours and 37 minutes.\n\n\n\n\n\nSeven other Australians were eliminated: including Ajla Tomljanovic, Olivia Gadecki, Chris O’Connell, and James Duckworth.\n\n\n\n\n\nAlexei Popyrin lost to English wildcard Arthur Fery - Fery's first win in a grand slam.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/companies/qantas-s-new-game-changing-airbus-arrives-in-sydney-20250701-p5mbrr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The long-awaited new Qantas plane touches down in Australia",
        "publish_date": "Wed, 02 Jul 2025 11:59:54 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Qantas on Wednesday took delivery of the first of its new Airbus planes which will begin to replace ageing 737s in its domestic fleet.\n\nTorrential rains buffeting Sydney many have diminished the fanfare but the Airbus 321XLR landed in Sydney Airport at 9.45am after departing Bangkok the evening before.\n\nSoggy touch down: The new Qantas Airbus XLR 321 arrives in rainy Sydney. Credit: Qantas\n\nThe arrival of the first 321XLR marks a key moment in the long-awaited refresh of Qantas’ domestic fleet.\n\nThe extra-long range narrow-body plane departed the Airbus factory in Hamburg on Monday and flew direct to Bangkok, showing off the range that Qantas will exploit as more of the 321XLRs are brought online.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-wong-meets-quad-powers-in-washington-musk-s-x-wins-fight-against-esafety-commissioner-trump-s-one-big-beautiful-bill-passed-in-us-senate-20250702-p5mbt9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Trump says Israel has agreed to conditions to finalise 60-day Gaza ceasefire; Wong meets Quad powers in Washington",
        "publish_date": "Wed, 02 Jul 2025 11:54:27 +1000",
        "category": "finance",
        "authors": [
            "Cindy Yin"
        ],
        "text": "The jury at Sean “Diddy” Combs’ sex-trafficking trial has reached a verdict on four of the five counts the music mogul faces, the judge overseeing the case said, without revealing the outcome.\n\nAfter two days of deliberation, the jury reached verdicts on two counts of sex trafficking and two of transportation to engage in prostitution, US District Judge Arun Subramanian announced.\n\nAn illustration of Sean “Diddy” Combs – surrounded by his defence team – as they discuss the jury note regarding verdicts on Tuesday. Credit: AP/Elizabeth Williams\n\nBut the judge said the jury had not been able to reach a verdict on a fifth charge, racketeering conspiracy, because jurors had “unpersuadable opinions on both sides”.\n\nHe instructed the jury to continue deliberating on the racketeering conspiracy count. The jury will resume deliberations at 9am New York time (11pm AEST) on Wednesday.\n\nCombs, 55, had pleaded not guilty to all five counts. If convicted of sex trafficking or racketeering, the former billionaire known for elevating hip-hop in American culture could face life in prison.\n\nThe partial verdict comes after a seven-week trial in which two of Comb’s former girlfriends testified that he physically and sexually abused them.\n\nReuters",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/western-australia/it-s-like-watching-a-test-match-saffioti-whitby-frustrate-zempilas-push-on-bears-deal-20250702-p5mbw5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s like watching a test match’: Saffioti, Whitby frustrate Zempilas’ push on Bears deal",
        "publish_date": "Wed, 02 Jul 2025 11:51:11 +1000",
        "category": "sports",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "Opposition Leader Basil Zempilas has accused the government of passing the buck on transparency around the Perth Bears NRL deal after a frustrating budget estimates session on Tuesday.\n\nTourism Minister Reece Whitby and Sport and Recreation Minister Rita Saffioti passed questions to each other over the course of the day about the modelling of the tourism benefits of the $80 million deal to bring the Bears to Perth.\n\nWA Opposition Leader Basil Zempilas. Credit: Hamish Hastie\n\nIn the morning session, Zempilas grilled Whitby on whether Tourism WA conducted a cost-benefit analysis to establish the Perth Bears NRL team in WA.\n\n“The process and the decision-making around this issue sit very firmly in the sporting division,” Whitby said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/trump-shows-his-impotence-attacking-the-fed-chair-20250702-p5mbum.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump shows his impotence attacking the Fed chair",
        "publish_date": "Wed, 02 Jul 2025 11:50:39 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "“If they were doing their job properly our Country would be saving Trillions of Dollars in Interest Cost. “The board just sits there and watches, so they are equally to blame,” he wrote. On Friday, Trump urged Powell - whose term as chair expires next May - to resign, and said he would only pick a Powell successor who will cut US rates. Trump’s verbal assault on Powell, who he described as a “stubborn mule” – he’s previously said Powell is a bad person, stupid, terrible, a numbskull, an idiot and suffering from Trump derangement syndrome – has intensified since the US central bank chief made it clear after last month’s Fed meeting, that the board would wait for the effects of Trump’s tariffs before making any move on rates.\n\nSo far, there have been only very minor signs that the tariffs are impacting the US inflation rate, but that is to be expected. In place, to date, are the 10 per cent baseline tariff on all imports to the US, along with some specific tariffs on sectors like steel and aluminium. The “big ones” – the “reciprocal” tariffs tailored to individual countries’ exports to the US -- won’t be unveiled until next Wednesday and could take months to show up in inflation data. White House press secretary Karoline Leavitt holding up the note from Trump to Fed chair Jerome Powell written on a list of central bank rates worldwide, during Monday’s press briefing at] the White House, Credit: AP The risk of cutting rates prematurely and then seeing a tariff-driven spike in the inflation rate explains why the Fed has adopted a “wait and see” approach to its monetary policies. The relatively strong US economy and job market at present provide no obvious downside to being patient. Trump is impatient – he wants the Fed to cut its target for the federal funds rate from its current range of 4.25 to 4.5 per cent to between 1 and 2 per cent – because he’s about to inject a debt-funded fiscal boost into the economy.\n\nThe US Senate narrowly approved Trump’s One Big Beautiful Bill Act on Tuesday (thanks to vice president JD Vance’s casting vote) after a marathon 24-hour session. Loading That bill, whose measures and cost might be changed when it returns to the House, would add between $US3.3 trillion ($5 trillion) and $US4 trillion ($6.1 trillion) to US deficits and debt over the next decade. With the interest costs on US government debt already running at about $US1 trillion a year, the new debt generated by that bill will add hundreds of billions more – unless the Fed cuts rates. Hence Trump’s comment that hundred of billions of dollars are being lost because of its inaction. The problem for the Fed, and Trump, is that the central bank’s mandate is to promote price stability and maximum employment, not to enable the US government to borrow more cheaply.\n\nTrump’s attempts to coerce Powell and his fellow board members into cutting rates to help him politically, if they succeeded, would undermine the Fed’s credibility and the trust in it as an institution independent of politics and politicians. Loading That independence is important for the Fed’s ability to influence inflation expectations and guide and reassure financial market participants that its policies are consistent and predictable, which is fundamental to financial stability. The risk for America is that, if investors see the Fed’s independence compromised and its policies driven by political considerations, there’d be an exodus of capital. Given the deluge of US debt that will need to be financed and refinanced in the bond market, that would itself push interest rates up. Confidence in the Fed and other respected central banks rests on their predictability, and a conviction that their monetary policy settings will either be neutral or, when necessary, counter-cyclical to keep inflation rates under control.\n\nPro-cyclical settings – policies influenced by the demands of politicians who face relatively short political cycles and who want growth regardless of the longer-term consequences – would risk igniting inflation. Trump might want a rate-cutter in Powell’s chair but, if that were to eventuate, it would be damaging to the Fed, the bond market and the US dollar, which just experienced its weakest first half of the year in more than half a century. US bond funds have had their biggest net outflows since the pandemic. Trump’s trade wars are being blamed for both. Loading While there has been speculation that Trump will soon appoint a “shadow chair” whose presence (and utterings) could confuse markets and undermine Powell, US Treasury Secretary Scott Bessent has said it is possible that the White House will nominate a candidate to the board in October or November. Powell is in the chair until May and has no plans to vacate until then and Trump, despite continually musing about it, has no power to remove him any earlier. But the term of one of the Fed’s governors, Adriana Kugler, ends in January and Trump’s “shadow” chair could be inserted into the board then.\n\nThe credibility of Powell’s successor would, of course, be compromised if they were seen as a Trump stooge - although Trump’s expectations of the next chair’s influence might be a tad unrealistic. There are 19 members of the Federal Open Market Committee, and 12 voting members. The committee, which actually makes rate decisions, can elect its own chair. One person, even the Fed chair, can’t dictate outcomes and a Fed chair whose public commentary was at odds with the bank’s decisions would only confuse markets and damage the institution. Powell is fortunate that even the US Supreme Court seems to believe Trump can’t force him out of the Fed. President Donald Trump was asked if he wanted to deport Elon Musk: “We’ll have to take a look.” Credit: AP Where Trump can threaten Elon Musk (a naturalised US citizen) with deportation to South Africa, or siccing Musk’s former DOGE colleagues on him, his companies and the billions of dollars of taxpayer support they receive each year, all Trump can do to Powell really is continue to abuse him.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/key-blues-sidelined-in-blow-to-origin-iii-preparations-20250702-p5mbtp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Key Blues sidelined in blow to Origin III preparations",
        "publish_date": "Wed, 02 Jul 2025 11:48:09 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Five NSW players either didn’t train or were on restricted duties in a disrupted session in the Blue Mountains on Wednesday.\n\nPayne Haas (back), Hudson Young (groin) and Brian To’o (knee) watched the session at the Blue Mountains Grammar School at Wentworth Falls from the sidelines, while halves Nathan Cleary (groin) and Jarome Luai (infection) didn’t participate in the wrestling session.\n\nSome key Blues couldn’t participate in the training session. Credit: Wolter Peeters\n\nLocal junior team Katoomba Devils were invited to watch the Blues go through their paces, although the media was asked to leave after 15 minutes.\n\nJacob Kirab, who is on standby for To’o as 18th man, was part of the field session, as were additional players Bradman Best, Brian Kelly, Lindsay Smith, Jack Williams, Isaiah Katoa and Teig Wilton.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/europe-looks-east-to-counter-trump-s-tariffs-and-fear-of-russia-20250702-p5mbsr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Europe looks east to counter Trump’s tariffs and fear of Russia",
        "publish_date": "Wed, 02 Jul 2025 11:45:02 +1000",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "European leaders have turned towards Asia in a bid to form a trading bloc to counter US President Donald Trump’s sweeping tariffs, raising hopes in Australia for a deal to boost trade by $106 billion.\n\nAustralian business leaders welcomed the plans from European Commission President Ursula von der Leyen for closer ties with Asia, seeing it as a step towards cutting trade barriers on cars, food and investment.\n\nEuropean Commission President Ursula von der Leyen. Credit: nna\\KCampbell\n\nThe trade agenda is being shaped by concerns in Europe on the economic conflict with the US over tariffs and the military threats from Russia, leading it to seek stronger alliances with like-minded nations.\n\nIn a clear overture to Asia, the EU president has declared her interest in opening Europe to one of the world’s largest trade blocs, known as the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), which includes Australia, as well as Japan, South Korea and Canada.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/king-charles-in-scotland-20250702-p5mbvu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles in Scotland",
        "publish_date": "Wed, 02 Jul 2025 11:43:30 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles in Scotland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/kasatkina-throws-up-before-wimbledon-match-20250702-p5mbx5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kasatkina throws up before Wimbledon match",
        "publish_date": "Wed, 02 Jul 2025 11:41:08 +1000",
        "category": "sports",
        "authors": [],
        "text": "Kasatkina throws up before Wimbledon match\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/celebrity/celebrities-step-out-at-wimbledon-2025-20250702-p5mbvs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Celebrities step out at Wimbledon 2025",
        "publish_date": "Wed, 02 Jul 2025 11:41:05 +1000",
        "category": "sports",
        "authors": [],
        "text": "Celebrities step out at Wimbledon 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/people-are-fed-up-why-10-news-is-going-back-to-basics-20250701-p5mbp9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘People are fed up’: Why 10 News+ is going back to basics",
        "publish_date": "Wed, 02 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Louise Rugendyke"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size If you read the comments under any story about free-to-air news and current affairs, you will find the same mix of complaints: Untrustworthy, too woke, too left, too right-wing and, inevitably, “bring back The Drum”. So launching a new nightly news program, one that promises in-depth coverage and big-picture reporting, is a tough ask: How do you build trust with an audience that is already side-eyeing how news is delivered? It’s a question journalists Denham Hitchcock and Amelia Brace hope to answer as the hosts of Network 10’s new hour-long nightly news program, 10 News+. “[Building trust] that’s difficult because that requires time,” says Hitchcock. “But what we’re saying from the start is that [trust] is at the core of this program, so you will see that in the reporting and the questioning and the topics that we choose, I think that will change people’s opinions because we won’t just be taking one side, we’ll be questioning both sides equally, and when people see that, I think it will change their opinion.” Brace agrees: “It is just about treating our audience with respect. People are intelligent. They do have their own thoughts and they do have their own opinions. So it’s just about telling both sides of the story and then letting people decide what they think of that, not telling them what they think about it.” Amelia Brace and Denham Hitchcock at the 10 News+ desk at Ten’s studios in Pyrmont. 10 News+ is at the heart of Ten’s bid to reshape its early evening viewing. The state-based local news is broadcast from 5pm, followed by 10 News+ at 6pm, and then game show Deal or No Deal at 7pm. Gone is The Project, which finished last week after a 16-year run. In another bold move, 10 News+ will be broadcast on Spotify, as well as on YouTube and 10Play, in what Ten says is a “world first for commercial TV news”. It is an everything, everywhere all at once approach. And it’s also a sharp U-turn from The Project, which mixed news reporting with light entertainment and comedy.\n\nAdvertisement\n\n“People just want their news straight up,” says Brace. “There’s been, I think, a drift in recent years towards opinion or sensationalism, and in some media even, I think bias. And people kind of leant into that for a while and enjoyed the change, but now people are fed up with it. Denham Hitchcock and Amelia Brace bring a long history of news reporting to 10 News+. Credit: Wolter Peeters “They don’t want to be told what to think or how to think. They just want their information and then they can make up their own minds. People are smart. They don’t need to be told what to think.” So what does that mean in practice? On the basis of Monday night’s first episode, it was an exclusive interview with Debbie Voulgaris, the convicted drug smuggler and Melbourne mother who is currently serving a 15-year prison term in Taiwan, and another interview with Prime Minister Anthony Albanese. Loading Both stories were longer than most standard news segments and, apart from covering a shark attack on the far north coast of NSW, the show steered clear of the kind of local fracas that are grist to the daily news mill. It’s an approach, says Hitchcock, that melds the best of Australia’s big TV news hitters: 7.30 and Four Corners on the ABC, 60 Minutes on Nine and Spotlight on Seven. “Our show is a hybrid of almost all of them,” says Hitchcock. “We’ll see a story in our first two days, I’m pretty sure it’ll be Monday [the Voulgaris story], that will be a story that 60 Minutes, Spotlight or Four Corners would kill for. So we’re hoping viewers will come to us because they’ll get the news of the day, they’ll get the things that matter, but they’ll also see something fresh.”\n\nAdvertisement\n\nBrace, 37, and Hitchcock, 48, come to 10 News+ as familiar faces from Seven and Nine, respectively, where they built their reputations as foreign correspondents, with stints in the US, Europe, Asia and the Middle East. They both began their careers at Seven – Brace in regional Queensland and Hitchcock in Sydney. Brace remembers her first day on the job at Seven, when she was a university student on a competitive internship, which involved covering a fatal bus crash. “I went out shadowing a reporter,” she says. “I kind of really got thrown in the thick of it.” It’s been a wild ride since then, with Brace covering everything from the drought in rural Queensland to being part of a world-record skydive live on air (“It was absolutely terrifying. I cried in my goggles”). In 2020, she won a Walkley Award for her coverage of the protests outside the White House, where she was hit with a baton by police. “You can’t cover these things from a bureau or even from a block back,” says Brace. “Because what is happening to these people is happening on the front line, and you have to be standing there, and you have to sit with your own eyes so you can actually stand up on camera or in Congress, as I had to, and say what happened wasn’t right. Sometimes it’s your job to say, ‘I saw that and that wasn’t OK.’” Hitchcock, meanwhile, got his start in the office of the now defunct current affairs show Today Tonight when he was 18 years old. “I was answering the phones and filling the biscuit barrel,” he says. “But within six months, I was a researcher, and within another three months after that, I was a producer at 18. It was fast, but from there I’ve done almost every job – researcher, producer, editor, reporter, correspondent, all sorts.”\n\nAdvertisement\n\nLike Brace, he’s has the kind of globe-trotting news career that makes great TV – reporting from the frontlines of Syria and Iraq, covering the Sandy Hook Elementary School shooting, and Typhoon Haiyan in the Philippines – but it’s the quieter story of Sharn McNeill, who was only 30 when she was diagnosed with motor neuron disease, that he names as one of his favourites. “It always makes me teary whenever I even describe it to anybody,” he says. “That’s one of those stories of human endurance and positivity that always stays with me.” The team from 10 News+ (from left) 10 NEWS+ Samantha Butler, Brianna Parkins, Angela Bishop, Hugh Riminton, Amelia Brace, Denham Hitchcock, Ursula Heger, Ashleigh Raper, Bill Hogan and Carrie-Anne Greenbank. With so long in business, do either of them see a difference in how news is reported or consumed today? Loading “I don’t see a change in the stories of people interested in, just in the way they consume it and the speed in which they consume it,” says Hitchcock. “Those big stories used to happen and [you] used to be able to chew on it for a whole week. Now it could be the most immense story that you’ve ever seen, and three days later, we’re on to something else.” Brace, meanwhile, thinks people are more overwhelmed than ever before by the “sheer amount of information out there” and this is what leads to the rise in misinformation.\n\nAdvertisement\n\n“It’s just selective reporting when you blatantly just tell one side of a story,” says Brace. “That side is not untrue, but it’s dangerous to do that, I think. I bump into people in real life regularly who say, ‘Did you hear this?’ And I’ll say, ‘But did you hear this?’ And it’s not that I’m on one side or the other. I just get really annoyed when they have no idea that that’s only half the story.” Amelia Brace and Denham Hitchock interview Prime Minister Anthony Albanese on the first episode of 10 News+ on Monday night. The US, famously, is home to Fox News, which proudly wears its bias on its sleeve. Do either of them think there is that type of biased reporting in Australia? “We have more of it than we used to,” says Brace. “I genuinely think that perhaps 10 years ago, we had a really balanced media with very little tolerance for bias. I remember maybe around the Kevin Rudd kind of time – because I’m very politically focused – there started to be some headlines and some things said, and I’d be like, ‘Hm, that’s interesting reporting.’ I just feel like it’s grown over the years, where we now have certain outlets that you just know they’re one side or the other. And I really don’t like that.” Loading Of course, it’s not just bias or misinformation that modern broadcast news has to deal with. The fickle beast that is ratings will probably have more of an effect on 10 News+’s future than any story they choose to do. A dramatic drop in ratings was one of the reasons given for The Project’s axing, so what happens when, say, four weeks from now, 10 News+ isn’t clicking and it’s suggested they start chasing more sensational local stories? “It’ll be a collective decision, the stories that we chase for the day,” says Hitchock. “So that’ll be Dan Sutton, who’s the executive producer, and Martin White, who’s the vice president [of news on Ten]. Those two will be keeping a keen eye on the show, and then Amelia and I, of course, will have heavy input as well.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/we-re-pretty-used-to-it-grundy-dismisses-scg-surface-fears-20250702-p5mbuo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We’re pretty used to it’: Grundy dismisses SCG surface fears",
        "publish_date": "Wed, 02 Jul 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Brodie Grundy has played down concerns about the slippery surface at the SCG, suggesting that Swans players are more used to it than their rivals and expressing confidence it will be in good shape for Sunday’s clash with Fremantle.\n\nThe AFL’s turf experts are overseeing this week’s remediation efforts, focused on the Paddington End of the SCG, which has struggled to recover from the damage left by the stage for an Andrea Bocelli concert on April 3.\n\nThe surface became a national talking point after Friday night’s match between Sydney and the Western Bulldogs, in which players continually lost their footing, prompting the extra scrutiny from the AFL and a broadside from Swans chairman Andrew Pridham, who said it was in an “unacceptable” condition.\n\nPlayers or officials from four different clubs have now expressed their concerns: the Western Bulldogs, Port Adelaide, Greater Western Sydney and Fremantle, whose coach Justin Longmuir was at the Swans-Bulldogs game and later said the SCG appeared to be “unsafe” for players.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/burger-wars-us-fast-food-giant-wendy-s-makes-brisbane-move-20250702-p5mbvr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Burger wars: US fast food giant Wendy’s makes Brisbane move",
        "publish_date": "Wed, 02 Jul 2025 11:26:20 +1000",
        "category": "finance",
        "authors": [
            "William Davis",
            "Jessica Yun"
        ],
        "text": "Famous for its square patties and Frosty shakes, US fast food giant Wendy’s is making a move on Brisbane.\n\nPlans for a Wendy’s outlet at the corner of Adelaide and Albert streets in the CBD have been lodged with Brisbane City Council.\n\nThe development application by Wendy’s Australia shows a blue and red colour scheme – synonymous with the American burger chain – for the vacant building, which was previously occupied by private health insurer Bupa.\n\nAn artist’s impression from Wendy’s development application lodged with Brisbane City Council.\n\nMcDonald’s, KFC, Hungry Jack’s – the Australian iteration of US chain Burger King – and Wendy’s will all be within 120 metres of each other if the plans go ahead.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/marmota-to-kick-off-its-first-drilling-program-at-new-sa-gold-target-20250702-p5mbws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Marmota to kick off its first drilling program at new SA gold target",
        "publish_date": "Wed, 02 Jul 2025 11:23:00 +1000",
        "category": "finance",
        "authors": [
            "Doug Bright"
        ],
        "text": "With ministerial consent to the title transfer under its belt through Half Moon, Marmota now owns 90 per cent of any minerals found at Golden Moon, including gold. The deal excludes opals, iron ore and palygorskite, which is also known as Fuller’s Earth.\n\nUnder the joint venture terms, Half Moon will free carry Coombedown until a decision to mine is made. Marmota will manage the joint venture through Half Moon.\n\nUnlike the extensively drilled Aurora deposit, the Golden Moon ground has been subject to only minimal drilling. It had not been tested for six years until Marmota kicked off its sub-surface probing at Campfire Bore in September last year.\n\nMarmota Limited chairman Dr Colin Rose said: “We are delighted that the title transfers of these core gold deposits/tenements have now been formally completed, ticking off another box on Marmota’s Gawler gold project. The Golden Moon JV heralds a new era of gold exploration and resource growth in the Gawler Craton. Work started on these assets under the guidance of Dominion, which made the discovery of the Challenger gold mine.”\n\nDr Rose said the Golden Moon joint venture has cleared the deck, after some delays, with a clean new structure now completed.\n\nMarmota’s first drilling program at Campfire Bore put in 86 reverse circulation holes for 11,690m by mid-October last year. The company immediately began planning follow-up work after seeing considerable growth potential at the prospect, encouraged by the December discovery of high-grade gold in multiple holes.\n\nCampfire Bore’s best results from its first phase of drilling included an early 4m assaying 16 grams per tonne (g/t) gold from 56m below surface and 16m going 2.7g/t gold from 35m, including 4m running 8.6g/t gold from 42m.\n\nOther results include bonanza grades up to 1m assaying 107g/t gold from 57m depth, five other intersections above 20g/t gold and 13 new intersections exceeding 10 g/t gold, including 5m going 12g/t, 3m at 11g/t and 3m at 10g/t gold.\n\nDuring an internal review of Greenewood’s exploration history, Marmota noted previous third-party drilling results from 2016 and 2017 that include multiple intersections of more than 20g/t gold in six holes close to surface. These include 1m at 53g/t gold from 30m, 1m at 37g/t gold from 48m and 1m at 29g/t from 31m.\n\nA further three holes delivered 1m assaying 23g/t from 24m, 1m at 23g/t from 23m and 1m going 21g/t from 41m.\n\nThe proximity of the Golden Moon joint venture deposits to the company’s Aurora Tank project brings development and logistical synergies and benefits.\n\nAurora Tank is characterised by multiple shallow high-grade hits and exhibits outstanding potential for low-cost, low-capex, open-pit, heap-leach production.\n\nWhile recent drilling has yielded a host of high-grade gold intersections and indicates significant potential for expansion, Marmota is focusing on completing its metallurgical test work and a scoping study and producing a maiden resource in the next six months.\n\nWith promising new ground close to Aurora Tank, the company now has a solid portfolio of gold deposits in the Gawler Craton to follow up.\n\nIt has already identified new high-grade gold extensions in first stage drilling at Campfire Bore. Through Half Moon, Marmota also owns all the Typhoon and Monsoon deposits, which are part of the Western Gawler Craton joint venture project.\n\nIf Marmota’s imminent drilling at Greenewood can replicate its Aurora Tank and Campfire Bore successes, the company will have won a uniqiue trifecta – or something like this\n\nIs your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-neighbourhoods-fight-to-save-100-year-old-landmark-behind-derelict-home-060300970.html",
        "title": "Aussie neighbourhood's fight to save 100-year-old 'landmark' behind derelict home",
        "publish_date": "2025-07-01T06:03:00Z",
        "category": "finance",
        "authors": [],
        "text": "Residents argue an application to council to remove two towering trees could change the face of their suburb.\n\nAn Australian council has received an application to removed two “significant” trees growing beside a derelict house. Source: Supplied\n\nTowering above a graffiti-covered timber fence and a grim, boarded-up house is a natural “landmark” a small Aussie community doesn’t want to lose. They’re determined to fight a plan to axe two towering eucalyptus trees that can be seen from almost anywhere in the increasingly urbanised Melbourne suburb of Thornbury.\n\nLocal woman Rebecca Hart has been working to save the twin sugar gums, which are estimated to have grown on the corner block for over a century. “They’re majestic. Looking at them takes you somewhere else. These landmarks have stood tall regardless of all the development that’s happened here,” she told Yahoo News.\n\nTrees of this size are increasingly rare in Australia. And Hart is concerned that approval to axe these two giants could create a precedent which could result in her suburb becoming increasingly denuded of nature.\n\nLooking generally at large tree removal in urban centres, public safety is often a concern, with councils fearing they’ll drop branches on cars or pedestrians. Other times, it’s the residents themselves who want the trees gone – across Sydney’s extravagant waterfront suburbs, there’s a problem with people illegally poisoning them to reap the benefits of an improved view of the ocean.\n\nADVERTISEMENT\n\nBut in the case of the Thornbury trees, it’s a development plan that's putting the trees' future in doubt. Darebin Council confirmed with Yahoo that it has “recently” received an application to remove them and that it's aware of “significant community interest” in the trees.\n\nRelated: 🌳 Toorak resident's $100k tree complaint to council\n\nThe massive trees are filled with small hollows and provide habitat for native animals and birds. Source: Supplied\n\nThe home has sat derelict for years, so it's understandable that its recent sale has resulted in a plan to revamp the site. Anyone wishing to live there could argue they're concerned about the size of the trees on such a small block. Eucalyptus trees are known to drop branches, and living underneath them can be scary when they sway in the wind.\n\nCouncil maintains large trees only removed as 'last resort'\n\nIn an email, council CEO, Michael Tudball, said the full assessment process required to determine the future of the trees is not yet complete, and decisions normally take eight to 12 weeks. “We want to emphasise that removal of significant trees is only ever granted as a last resort where other mitigations aren’t possible,” he added.\n\nADVERTISEMENT\n\nHart would like to see her council introduce a register of significant trees, as was proposed back in 2013. However council maintains one isn’t needed because local laws give trees added protection when they are over 8 metres high and have a circumference of more than 100cm at 1.4 metres above the ground.\n\nThe two tree trunks have a diameter of approximately 3.7 metres and 3.9 metres at their base and reach higher than 8 metres, meaning they qualify under local laws as significant trees, but this doesn’t ensure they will be spared. Looking generally at council guidelines, a case can be made to remove significant trees if they pose an immediate danger to people or property, and there’s a replacement landscaping proposal that’s deemed acceptable.\n\nTrees provide rare shelter for suburb's native animals\n\nHart says the removal of the trees would not only alter the face of her suburb, local wildlife will be robbed of somewhere to live.\n\nADVERTISEMENT\n\nIn Melbourne, hollow-bearing trees are a rarity, and that’s led to localised extinctions of species you regularly see in other cities like the kookaburra.\n\nThe Thurnbury trees are known to have several hollows, and their branches provide shelter for native birds and mammals including ring-tail possums, wood ducks, lorikeets, magpies, butcherbirds, and bees.\n\n“In Thornbury, if you’re looking west they are the most significant part of the skyline,” Hart said. “Last night, the trees were silhouetted with a crescent moon behind them. They’re the biggest, most beautiful thing you can see.”\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    }
]