[
    {
        "url": "https://www.9news.com.au/national/muckatah-minivan-crash-at-least-four-killed-in-regional-victoria/29bbea9a-29ed-4f4f-9073-2ec5181a1d85",
        "title": "Four dead, two children fighting for life after minivan crash in regional Victoria",
        "publish_date": "Tue, 16 Dec 2025 01:28:41 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "The van was driving on Chapel Road in Muckatah, about 250 kilometres north of\n\nMelbourne\n\n, when the driver lost control and crashed into a tree at about 5pm yesterday.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bondi-shooting-fake-hero-edward-crabtree-ai-fake-ahmed-el-ahmed-national-news/6aadb900-9997-47f6-ac96-5c4fb10640f1",
        "title": "The sick trick played on the world hours after Bondi shooting",
        "publish_date": "Mon, 15 Dec 2025 22:27:37 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Reuters reported that thedailyaus.world was registered on December 14, the same day as the attack, according to\n\nwho.is, opens new tab\n\n, a public domain lookup tool that shows when website addresses are registered, changed, and set to expire. thedailyaus.world could not be reached for comment when approached by Reuters.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/australian-farmers-harvesting-the-crop-facebook-group/106143522",
        "title": "Farmers flock to online group to connect during the highs and lows",
        "publish_date": "Tue, 16 Dec 2025 02:03:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Through bumper crops, droughts, and average years in between, a group of 100,000 Australian grain farmers have formed an online community through a Facebook group which aims to share the highs and lows of farming across the country.\n\nThe Harvesting the Crop group was started by South Australian farmer John Gladigau in 2013 as a place for farmers to compare crop notes and share photos, jokes and advice.\n\nJohn Gladigau farmed in SA's Mallee region for many years and is now Grain Producers SA chair. (ABC News: Ben Deacon)\n\nHe said it was the only group he could find dedicated to Australian grain farming on Facebook at the time and it quickly gained a local and global following.\n\nIt has just cracked 100,000 followers with about 20,000 people following from overseas.\n\nDavid Klimpsch placed second in the \"best looking farm dog\" category with this cute crop lurker. (Supplied: David Klimpsch)\n\n\"I think people value it very highly,\" Mr Gladigau said.\n\n\"It's like going to a really good field day or meeting people down at the pub and just sitting around and talking about things, but in a really comfortable environment.\n\n\"I think there's a real source of pride within the group and I think the reason [it's] been so successful is because of the people who are part of the group.\"\n\nThis impressive image of a very stuck header captured first place in \"bogged and busted\". (Supplied: Emma Craft)\n\nLending a hand\n\nLouise Smith runs a mixed farming operation at Maggea in South Australia's Mallee region, an area severely impacted by drought in recent years, and has been following the group for several years.\n\nLouise Smith says the Harvesting the Crop Facebook group has become a great online community for farmers. (ABC Riverland: Amelia Walters)\n\nShe said it had become a source of support for her and her family when they ran into trouble with their farm machinery.\n\n\"We had a breakdown and two days earlier we had seen a post of someone looking for a part for their header and someone piped up and said, 'I have an old header I'm wrecking,'\" she said.\n\n\"The parts on that header actually matched ours. It's a very good page to be following for the little bits you do pick up.\"\n\nLouise Smith's photo of her wheat crop struggling to grow through sand blown onto her property. (Supplied: Louise Smith)\n\nShe shared a startling photo to the group of several heads of wheat buried in sand that had blown onto her property this year as a way to show something \"a bit different\" and the reality of farming in drought.\n\n\"We don't have you-beaut' new headers, new machinery, we're not reaping by any stretch of the imagination a decent crop. But we do have sand,\" she said.\n\nThe \"green and gold\" category went to Libby Meill for this glorious sunset photo. (Supplied: Libby Meill)\n\nLife on the farm\n\nMr Gladigau said he never imagined the group would grow to the size it was and become a place for farmers, who are often isolated in their day to day operations, to find a sense of connection.\n\nThis impressive break time set-up won Kathy Maslin first place in the \"smoko legend\" category. (Supplied: Kathy Maslin)\n\nAfter clocking 100,000 followers he decided to run a photo competition to keep spirits high heading into the current harvest.\n\nThe categories reflected what really goes on day to day on a farm including \"bogged and busted\", \"best looking farm dog\", \"she'll be right\" (bush mechanics), \"fields of green and gold\", \"machinery selfie\" and \"lunch box legend\".\n\nThere were more than 700 entries and about 8,500 people voted on the finalists.\n\nTye Griffiths' emergency pulley replacement earned him first place in the \"she'll be right mate\" category. (Supplied: Tye Griffiths)\n\nEbony Doering farms at Dutton in SA's mid-north region and won the best machinery selfie category of the photo competition.\n\nShe found the group to have a great sense of community and place to share the contribution of farmers to the world.\n\n\"Farmers put in a lot of effort in what they do and a lot of it goes unseen,\" she said.\n\n\"We're producing food for the world and this was one way to show the world what we as farmers do and make that connection.\"\n\nChrstine Schilling posted this entry to the competition of a helicopter flying low over a canola field. (Supplied: Christine Schilling)\n\nMr Gladigau said while he may have started the page he feels it has grown beyond its humble beginnings and has been embraced by Australia's farming community.\n\n\"In some ways I have lost control of it,\" he said.\n\n\"It's now owned by the cropping farmers of Australia as their site, as their group, where they come together to be the Aussie cropping family which I think is fantastic.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/ashes-2025-usman-khawaja-left-out-of-adelaide-test/106149056",
        "title": "Khawaja left out of Adelaide Test as Australia settles on bowling line-up",
        "publish_date": "Tue, 16 Dec 2025 01:39:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Usman Khawaja's Test career could be over, after Australia left the veteran opener out for Adelaide and kept Travis Head at the top alongside Jake Weatherald.\n\nJust two days short of his 39th birthday, Khawaja was a notable omission from Australia's XI for the third Ashes Test when Pat Cummins confirmed it on Tuesday morning.\n\nCummins and Nathan Lyon will return to the bowling attack at the expense of Brendan Doggett and Michael Neser, while the top seven is unchanged.\n\nEverything you need to know about the third Ashes Test at Adelaide Oval The third Ashes Test is upon us and the series is on the line. Here's everything you need to know about the clash in Adelaide.\n\nThat means Josh Inglis will remain in the side at number seven, while Khawaja is not included after missing the Brisbane Test through back spasms.\n\nAustralia can secure a series win at Adelaide Oval this week, and will celebrate the quickest retention of the urn in more than a century if it wins inside four days.\n\nBut for Khawaja, there are now serious question marks over his future.\n\nThe 38-year-old has enjoyed one of the great late-career resurgences since his recall to the Test team at the start of 2022, starring at the top of the order.\n\nHe averaged 58.7 in his first two years back in the side, but has now passed 50 just twice in his past 27 Test innings.\n\nKhawaja batted in Australia's optional net session on Tuesday, but did not face a new ball in a possible sign that any potential return may be more likely in the middle order.\n\nIt came after Australia's coach Andrew McDonald insisted that it would be premature to write Khawaja off, regardless of whether he played in this Test.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\n\"He's had one back injury in his whole career, so I think that's an overreaction to correlate that to the age of the athlete,\" McDonald told SEN on Tuesday morning.\n\n\"His [Sheffield] Shield numbers are incredibly good comparative to everyone else. I think he has the leading Shield average for the past three or four years.\n\n\"Every time he drops back to that level he dominates. Now if that's a determiner of who is the next best or who is next in line, then he is at the top of the pecking order.\n\n\"It feels as though people want to hear an end date from him or us. But we're not that team, we're not going to put end dates on people.\"\n\nMeanwhile, Steve Smith was the first in the nets to bat on Tuesday, after missing Monday's session due to illness.\n\nSmith, who captained Australia in the first two Test victories due to Cummins's absence, is not considered in any doubt to play.\n\nAustralia XI for the third Ashes Test\n\nJake Weatherald, Travis Head, Marnus Labuschagne, Steve Smith, Cameron Green, Alex Carey, Josh Inglis, Pat Cummins, Mitchell Starc, Nathan Lyon Scott Boland.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/ashes-2025-how-to-watch-and-follow-the-adelaide-test/106148302",
        "title": "Everything you need to know about the third Ashes Test at Adelaide Oval",
        "publish_date": "Tue, 16 Dec 2025 00:50:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "The third Ashes Test is upon us, with England facing a mammoth task to get back into the series at Adelaide Oval on Wednesday, December 17.\n\nABC Sport will have you covered on the air and online throughout the series, so make sure to bookmark abc.net.au/news/sport on your phone and computer.\n\nHere is everything you need to know.\n\nWhat time does the Adelaide Test start?\n\nThe third Test starts at 10.30am AEDT on Wednesday, which is 9:30am in Queensland, 7:30am in Western Australia and 10am in South Australia.\n\nHere is the schedule for the remaining Tests:\n\nFourth Test December 26-30, MCG, Melbourne Starts at 10:30am, local time, 9:30am Qld, 10am SA, 7:30am WA Fifth Test January 4-8, SCG, Sydney Starts at 10:30am, local time, 9:30am Qld, 10am SA, 7:30am WA\n\nHow can I watch and follow the Ashes?\n\nABC Sport is live-blogging all the action, every day with every ball, at abc.net.au/news/sport. Join Dean Bilton, Simon Smale, Jon Healy, Chris De Silva and Henry Hanson throughout the series.\n\nABC Sport will also be calling all the action on ABC local radio and on the Listen app, led by Corbin Middlemas with Jim Maxwell, along with former cricket champions Jason Gillespie, Darren Lehmann, Phil Tufnell, Tom Moody and Stuart Clark.\n\nTo keep across all the viral action, make sure to follow ABC Sport on Instagram and give us a like on Facebook.\n\nYou can also listen to all the action via abc.net.au/news/sport by tapping the green \"play live radio\" button in the top right of your browser.\n\nChannel 7 will be broadcasting the Tests live on its channels.\n\nCan I sync the ABC Sport call to the televised coverage?\n\nFor the first time, yes you can sync the ABC Sport call to the live vision without the pesky delay.\n\nJust select the ABC Sport Rapid stream on the ABC listen app by navigating to the sport tab at the top of the app and browse the Live Radio carousel.\n\nWhat is the weather forecast for Adelaide?\n\nWednesday: 35C, clear, no rain\n\nThursday: 39C, clear, no rain\n\nFriday: 32C, partly cloudy, no rain\n\nSaturday: 28C, partly cloudy, 0-1mm of rain\n\nSunday: 25C, shower or two, 0-6mm of rain\n\nWho is in and out of the England and Australia Test teams?\n\nUsman Khawaja has been left out of the Australian team, with Josh Inglis retaining his middle order spot and Travis Head set to open.\n\nPat Cummins and Nathan Lyon return to the bowling line up, with Brendan Doggett and Michael Neser making way.\n\nEngland, meanwhile, is likely to make just one change, with fast bowler Josh Tongue coming in for Gus Atkinson.\n\nHow do I sign up to ABC Sport alerts?\n\nIf you want to be alerted about the start of play and major moments that happen throughout, make sure to download the ABC News app on your mobile phone.\n\nThen head to \"profile and settings\", tap on \"notifications\", then switch on the \"breaking news\" slider and tap \"sport\" under the topics section. You can also sign up for things like business and world news — but we are just here for the cricket.\n\nDoes ABC Sport have a cricket podcast?\n\nWe sure do, and we reckon it is a ripper.\n\nHosted by Corbin Middlemas, who is joined by former Test opener Ed Cowan, the guys will keep you across all the hot takes and talking points from the series. ABC Sport Daily with Patrick Stack and Poppy Penny will also be keeping across the cricket throughout the summer.\n\nCheck it out on the Listen app or give it a listen via the landing page here.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/hellofresh-and-youfoodz-sued-by-accc-for-misleading-consumers/106148656",
        "title": "HelloFresh and Youfoodz sued by ACCC over allegedly misleading consumers",
        "publish_date": "Tue, 16 Dec 2025 00:35:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "The consumer watchdog is suing home meal delivery providers HelloFresh and Youfoodz for allegedly misleading consumers, claiming the companies used what's known as a \"subscription trap\".\n\nThe ACCC claims the high profile meal services broke consumer law by telling customers they could easily cancel subscriptions via online accounts when this wasn’t the case.\n\nInstead, consumers who tried to cancel prior to the first delivery cut-off time were still charged and could only cancel if they spoke with a customer service representative.\n\nThe consumer watchdog has launched two proceedings in the Federal Court.\n\n\"We've brought these two cases because we allege that HelloFresh's and Youfoodz's conduct involved a suite of confusing and unclear subscription practices in breach Australia's consumer laws,\" ACCC Commissioner Luke Woodward said.\n\nHelloFresh which owns both brands has been contacted for comment. (ABC Landline)\n\n\"Despite what HelloFresh and Youfoodz represented to new Australian subscribers, tens of thousands of consumers were charged for their first order, even though they cancelled their subscription before the cut-off date.\"\n\nHelloFresh allegedly engaged in this misleading conduct for more than two years until March this year, while Youfoodz did so between October 2022 and November last year.\n\nDo you have a story to share? Email Specialist.Team@abc.net.au\n\nThis impacted 62,000 HelloFresh customers and 39,000 YouFoodz customers who were charged despite cancelling their subscription before the cut-off date, according to the lawsuits.\n\nHelloFresh required customers to hand over payment details before viewing the full menu but it told customers they, \"would not be charged unless they selected meals from the menu\".\n\nHowever, customers were entered into an ongoing subscription, according to the consumer watchdog.\n\n\"In the case of HelloFresh, many consumers had not even selected meals but were unknowingly subscribed and charged regardless,\" Mr Woodward said.\n\nHelloFresh launched in Australia in 2012 and sells popular meal kits which allow a faster preparation time.\n\nIt advertises heavily and its promotional material features high-profile celebrities like Robert Irwin, TV presenter Sophie Monk and comedian Celeste Barber.\n\nBut customers have long vented their frustration at its subscription practices with online reviews full of complaints about how hard it was to unsubscribe without being hit with unwanted charges.\n\nIn New Zealand, HelloFresh was fined $NZ845,000 for misleading consumers.\n\nThe fine was for cold-calling former customers under the guise of getting feedback but was instead about trying to get people to restart orders with discount vouchers, without it being made clear it could lead to a subscription being restarted — according to New Zealand's Commerce Commission.\n\nHelloFresh which owns both brands has been contacted for comment.\n\nPush against subscription traps The Albanese government is concerned about \"unfair trading practices\" and is looking at introducing legislation to counter it.\n\nConsumer groups have long called for action on \"subscription traps\" where it is easy for customers to start paying a company but very difficult to stop.\n\nThe Albanese government promised in 2023 it would crackdown on subscription traps and other unfair business practices with new consumer laws.\n\nThat push received a major boost in November when states and territories agreed to back its plan to ban \"unfair trading practices\".\n\nAssistant Minister for Competition Andrew Leigh said the government was \"putting an end to sneaky business tricks like subscription traps and hidden fees\".\n\n\"These reforms will stop unfair trading practices that distort consumer choice and drive-up costs, making markets fairer and giving Australians a fair go,\" he said.\n\nThe government said it would draft the new laws and begin consultation next year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/big-bash-shaheen-afridi-pulled-out-of-big-bash-attack/106148124",
        "title": "Umpires sensationally pull Pakistan ODI skipper out of Big Bash attack",
        "publish_date": "Mon, 15 Dec 2025 22:52:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "Big-hitting New Zealand star Tim Seifert has scored his first Big Bash League (BBL) century, leading the Melbourne Renegades to an impressive win over the Brisbane Heat on a chilly Geelong night.\n\nAs Seifert and Ollie Peake ran amok, Shaheen Afridi was sensationally banished from the Heat attack by the umpires in his BBL debut.\n\nThe Pakistan one-day captain bowled two full-toss no balls above waist height in the same over. He had 0-45 from 2.4 overs.\n\nUnder the rules, two full-toss deliveries over waist height from one bowler means the umpires can pull that bowler from the attack for the rest of the match.\n\nAdding to the drama, Seifert was injured while batting — apparently hurting a side muscle — and did not keep wickets on Monday night. Mohammad Rizwan took his place behind the stumps at Kardinia Park.\n\nSeifert smashed 102 from 56 balls, making him only the second Renegades player to score a BBL ton, as Melbourne amassed 5-212.\n\nAfter controversy about the Geelong drop-in pitch, it was the highest score at the venue.\n\nOpener Colin Munro and Jimmy Peirson gave the injury-depleted Heat some hope with half-centuries, but they were kept to 8-198 as Melbourne won by 14 runs.\n\nSeifert said he was rested as a precaution.\n\n\"It was a bit of a tight side … a big tournament ahead, so [we] didn't want to risk anything,\" he said.\n\nPerth won the toss and there was a solemn start to the night as the players and fans observed a moment's silence a day after the Bondi terrorist attack.\n\nSeifert's ton came more than a month after he broke a finger while playing in New Zealand, forcing him out of the T20 series against the West Indies.\n\nHe and Peake, the home-town young gun, put on 121 from 57 deliveries for the fourth wicket.\n\nPeake's 59 from 29 balls made him the second-youngest BBL player after Sam Konstas to score a 50 and it showed again that the 19-year-old is one of Australian cricket's brightest young talents.\n\nSeifert was in blazing form from the start, hitting nine fours and six sixes in his ton.\n\nThe wheels well-and-truly fell off for Brisbane in the 18th over when Afridi's two high full tosses meant he was taken off as acting captain Nathan McSweeney bowled the rest of the over — a nine-ball affair that conceded 22.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nOpening bowler Xavier Bartlett was the standout, taking 1-24 from his four overs.\n\nJack Wildermuth took 3-34, then opened and went for a three-ball duck in the first over.\n\nMunro looked like he might have been building up to something big but was caught in the deep by Hassan Khan off Will Sutherland for 55 from 32 balls.\n\nThat left Brisbane 5-106 in the 13th over.\n\nPeirson belted 50 from 22, with four fours and three sixes, before Sutherland had him caught in the deep for the seventh wicket.\n\nSutherland led the Renegades well in the field, taking 3-33 from four overs.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/nsw-cricketer-banned-after-allegations-of-nude-photos/106148042",
        "title": "Cricketer banned after allegations he sent nude photos to teammates",
        "publish_date": "Mon, 15 Dec 2025 22:27:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "A New South Wales cricketer has been permanently banned from playing after allegations he sent nude photos of himself to at least one young teammate at his grade cricket club.\n\nThe player, who cannot be named for legal reasons, has represented the NSW Blues in the Sheffield Shield and played for a T20 franchise team.\n\nCricket NSW released a statement saying an investigation was ongoing after an emergency board meeting late last week.\n\n\"After being made aware of a serious complaint, the Cricket NSW Board determined to permanently cancel a player's registration effective immediately,\" the statement read.\n\n\"As a result, he is suspended indefinitely from involvement in all cricket-related matters.\n\n\"We cannot comment further on this matter while investigations are ongoing.\"\n\nIt is understood one player made a complaint to the club over the alleged incident, however there are believed to be further allegations from other players.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/hamilton-london-plane-trees-to-be-removed/106143002",
        "title": "London plane trees to be cut down in main street of Victorian city",
        "publish_date": "Mon, 15 Dec 2025 21:59:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "London plane trees will be removed from a south-west Victorian city, as a growing number of councils across the country try to phase out the species.\n\nSouthern Grampians Shire Council has confirmed 25 plane trees are in line for removal in Hamilton, and the future of another 75 trees will be considered.\n\nThe issue came under the spotlight in April, when the council was told older people with mobility issues avoided the town centre because of the trees.\n\nThe streets of Hamilton have warped as the London plane trees have grown. (ABC News: Emily Bissland)\n\nImpact 'cannot be ignored'\n\nThe council organised an advisory committee to help determine the future of the trees.\n\nGroup member Sarah Hope joined after she created a petition to save the trees.\n\nMs Hope said the trees added \"charm\" to the city, and had a positive impact on local climate, biodiversity and mental health.\n\nSarah Hope led a campaign to save the 40-year-old London plane trees. (ABC News: Emily Bissland)\n\nNow Ms Hope accepts that some of the trees need to go, and the group is \"overwhelmingly\" in favour of their removal.\n\n\"We had our first meeting, and we were presented with arborist reports and engineer reports,\" Ms Hope said.\n\n\" The reports were quite damning for [the trees], unfortunately. \"\n\nSouthern Grampians Shire councillor Afton Barber said the decision to remove the trees was hard, but necessary.\n\n\"The trees have long been an iconic fixture within our streets, but their impact cannot be ignored,\" Cr Barber said.\n\n\"We need streets that are safe for residents and visitors of all abilities so they can feel confident to shop and socialise in Hamilton.\"\n\nSouthern Grampians Shire Council has documented root damage to a building on Gray Street. (Supplied: Southern Grampians Shire Council)\n\nKeeping it green\n\nMs Hope said the advisory group would now focus on how greenery and shade protection could be retained on Gray Street.\n\n\"It became incumbent on me and other members of the group who did want to keep the trees to come up with a solution,\" she said.\n\nMs Hope said she wanted another tree to replace the London planes and for vertical gardens to be installed.\n\nThe advisory group will also investigate whether other London plane trees should be removed from the city.\n\n\"This is going to be the next best scenario for those that love a green centre of Gray Street,\" Ms Hope said.\n\n\"This is a test pilot for the rest of the town.\"\n\nLondon plane flowers release pollen, but the trichomes on their leaves are a more common irritant. (ABC News: Emily Bissland)\n\nThe council said it was working on an updated design, including proposals for replacement tree species, greening walls and alternative footpath treatments for Gray Street.\n\nIt will also develop the updated concept designs for further community engagement next year, and consider the removal of about 75 other London plane trees in the city.\n\n'Better to spend the money and have the trees'\n\nUniversity of Melbourne horticulture expert Greg Moore said the removal of London plane trees was common across metropolitan and regional areas.\n\n\"[Councils] see the problems associated with these trees … but they forget the benefits,\" Dr Moore said.\n\n\"When those trees are removed, it will make a huge difference to the streetscape in Hamilton, and it will make a significant difference to temperatures in summer.\"\n\nGreg Moore says the council could face similar issues in the future with different tree species. (ABC News: Darryl Torpy)\n\nMr Moore said there should be stronger investment in maintaining the trees.\n\nHe questioned the council's finding that Gray Street was unsuitable due to its narrowness, given the many plane trees that lined the tight streets of London.\n\n\"The issue here is that they simply don't give them the priority that they should be given,\" Mr Moore said.\n\n\"It's much better to spend the money and have the trees than to lose them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/qld-weather-rain-storms-summer-bom-forecast-brisbane/106146608",
        "title": "Noosa hit with flash flooding after 180mm of rain falls overnight",
        "publish_date": "Mon, 15 Dec 2025 21:55:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Storms and heavy rainfall are again forecast to hit large parts of Queensland today, with temperatures expected to drop across much of the sunshine state.\n\nFlood cameras show some minor flooding in the Noosa region after the area experienced heavy rainfall overnight and throughout the morning.\n\nLoading...\n\nAt Bec Tardent's home in Parklands, things were extremely wet.\n\nMs Tardent said the storm cell appeared to have \"dumped rain\" over Noosa all night and she had moved her outdoor furniture inside while using sandbags to keep the rain out of her home.\n\nLoading...\n\nBureau of Meterology (BOM) data showed Tewantin received 182 millimetres of rain to 9am this morning.\n\nSome rain was lingering in the Noosa region late on Tuesday morning, particularly in coastal areas, Mr Hines said, and more was possible throughout the day and into the afternoon.\n\nSlow-moving storms\n\nBOM senior meteorologist Angus Hines said other areas had also received more than 100 millimetres, including Mount Beerwah, where 166mm fell.\n\nHe said the region had experienced slow-moving storms, which sat in one place and were \"dumping rain basically in the same spot for several hours through last night and into the morning\".\n\nThere were wet roads in the Noosa region on Tuesday morning. (Supplied)\n\nHe did not expect a repeat of rainfall totals in the same \"ballpark\", however.\n\n'We certainly could see another double digit amount of rainfall falling onto this pretty wet part of this the state,\" he said.\n\nElsewhere, south-east Queensland is expected to be cloudy for most of the day, with a chance of rain also possible in Brisbane.\n\nAre hailstorms getting more frequent in south-east Queensland? The region has been hit by another round of storms which brought large and even giant hailstones. Is this the new normal?\n\nBrisbane is expected to hit a maximum of 29 degrees Celsius, while Noosa Heads and Surfers Paradise are set for 27C and 28C.\n\nRockhampton and Mackay are expected to reach 32C, while Cairns could hit 33C and Townsville 34C.\n\nToowoomba is not expected to get hotter than 26C.\n\nShane Kennedy from the BOM said the south-east corner will enjoy a \"few days off\" from the worst of the heat before temperatures ramp back up.\n\n\"As we move towards the end of the week though, those temperatures are back to average and even pushing above average as we move into the weekend,\" he said.\n\nSevere storm warning lifted\n\nElsewhere on Tuesday, the BOM said there was a potential for severe thunderstorms in the southern and central interior, and a low chance of one or two thunderstorms in the south-east.\n\nMr Hines said there could be storms over a large part of central Queensland in the afternoon, including across the Darling Downs.\n\nIf they were to eventuate, he said they would likely also be slow-moving and could potentially dump heavy rain in isolated areas.\n\n\"Quite a typical storm pattern, where not everyone through those broad regions will even see or hear a thunderstorm,\" he explained.\n\n\" Lots of people will get a dry day and a relatively clear day. \"\n\nA severe storm warning was issued by the BOM about 7:30am Tuesday.\n\nAn earlier severe storm warning issued by the BOM about 7:30am for the Sunshine Coast was lifted at 8:30am.\n\nThe BOM warned the redevelopment of severe thunderstorms remained possible, however.\n\nA southerly change stalled inland of the Sunshine Coast, helping to create slow-moving heavy showers and thunderstorm activity.\n\nWindy conditions are also expected across the south east with strong wind warnings for the Sunshine Coast and Gold Coast waters.\n\nResidents are advised to monitor the radar and thunderstorm warnings.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/world-championship-darts-player-cameron-menzies-punches-table/106147904",
        "title": "Darts player left bloodied after punching table following loss",
        "publish_date": "Mon, 15 Dec 2025 21:13:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "A darts player has apologised for briefly turning into a boxer as he lost his cool after a tough loss in the world championship overnight.\n\nCameron Menzies threw uppercuts at a table on the stage at Alexandra Palace in London after losing to Charlie Manby 3-2 in a thrilling first-round match.\n\nA drinks bottle and other items flew off the table. Menzies's right hand was bloodied. Walking off the stage, he raised his hands in apparent apology to jeering fans. He was treated by medics on site.\n\nA second angle of the incident also appears to show Menzies placing his hand on a live firework.\n\nMenzies, from Scotland, was the 26th seed and expected to win his first match. Manby was ranked 166th.\n\nMenzies later said the death of his uncle and the upcoming funeral had been on his mind.\n\n\"I would like to apologise for what happened. I'm sorry that I reacted in the manner that I did,\" Menzies said in a statement.\n\n\"It's not an excuse, but I have had a lot of things on my mind and I suppose it all just became too much at the end.\n\n\"It's not been an easy time for me with my uncle Gary passing away recently. Had I won the game, my second match would have been on the day of Gary's funeral and that hasn't been lost on me.\n\n\"I don't want it to take anything away from Charlie. He played well. This is not how I would like people to view me.\"\n\nIt is the second time in as many years that Menzies has been knocked out in the first round of the worlds. He broke down in tears during and following his loss to Leonard Gates last year.\n\n\"For Cameron Menzies, I think he will regret that for the rest of his life,\" Sky Sports commentator Glen Durrant said of the incident with the table.\n\n\"It wasn't a good watch.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-16/aflw-draft-2025-richmond-takes-olivia-wolmarans-at-number-one/106147828",
        "title": "Suns complete stunning AFLW draft raid as Tigers take power forward",
        "publish_date": "Mon, 15 Dec 2025 20:53:05 +0000",
        "category": "sports",
        "authors": [],
        "text": "Newly-crowned AFLW number one draft pick Olivia Wolmarans wants to repay Richmond's faith by taking the struggling Tigers to the top.\n\nRichmond, who finished 16th and sacked coach Ryan Ferguson, traded for Gold Coast's top pick to have first crack at the cream of the crop in this year's draft.\n\nAfter flirting with picking either Scarlett Johnson (pick number two, GWS) or Chloe Bown (pick number five, Adelaide), the Tigers opted for Perth-based power forward Wolmarans.\n\n\"I think I have that energy for Tigers to bring them up, and hopefully we can win a flag,\" the confident 18-year-old said.\n\n\"It means a lot to me that they did that (traded up), but just having conversations with them, they already backed me in, I could see they could believe in me already as a player.\n\n\"So I'm now going to give it back to them and show them how much I can improve their team and bring them to the top again.\"\n\nWolmarans, who wants to be a police officer in the future, will move east as soon as possible.\n\nShe relishes the prospect of playing alongside star Tiger Monique Conti and veteran Katie Brennan and is ready to stamp herself on the league.\n\n\"I'm always going to have that cheeky grin of mine, but I'm pretty laid back,\" she said.\n\n\"You're going to see me move across the ball with my speed, and also me taking contested marks, so hopefully I take a hanger.\n\n\"I play my own game. I don't really play like anyone. I look for attributes from players, but I think I play my own game.\"\n\nWolmarans was a heptathlete before turning her attention full-time to football, and has no regrets over her career choice.\n\n\"I've always known since I was little that I wanted to play AFLW,\" she said.\n\n\"Seeing the girls on the TV, I just wanted to be just like them.\n\n\"And here I am standing here, pick one, it's amazing, and it's probably my best achievement yet.\"\n\nGeorja Davies, Alannah Welsh, Ava Usher, Sunny Lappin and Dekota Baron were all picked by the Suns at the AFLW draft. (Getty Images: James Wiltshire)\n\nIt was a banner night for wooden-spooners Gold Coast, who had six academy selections inside the top 15 and eight overall.\n\nThe Suns matched bids for Sunny Lappin (4), Ava Usher (7), Georja Davies (9), Alannah Welsh (12), Mikayla Nurse (13) and Dekota Baron (15) in the first round before snagging Bronte Parker (32) and Rhianna Ingram (44).\n\nThe Swans didn't match GWS's bid for Kiera Yerbury at pick 3 but snapped up Alex Neyland at 6 and grabbed Madeleine Quinn at 18.\n\nIt meant three Sydney prospects also landed in the first round, making for 11 academy products in the northern states.\n\n\"It's awesome. It shows that it's definitely a bigger sport than just Victoria,\" Yerbury said.\n\n\"I'm glad that I can play my part in that. It's a great opportunity for people from other states to make their mark in footy.\"\n\nTop 10 2025 AFLW draft picks\n\n1. Richmond — Olivia Wolmarans (Subiaco)\n\n2. GWS Giants — Scarlett Johnson (Northern Knights)\n\n3. GWS Giants — Kiera Yerbury (Sydney Swans academy - bid not matched)\n\n4. Gold Coast — Sunny Lappin (Gold Coast academy - matched bid from Adelaide)\n\n5. Adelaide — Chloe Bown (Oakleigh Chargers)\n\n6. Sydney — Alex Neyland (Sydney Swans academy - matched bid from Collingwood)\n\n7. Gold Coast — Ava Usher (Gold Coast academy - matched bid from Collingwood)\n\n8. Collingwood — Imogen Trengove (Woodville-West Torrens)\n\n9. Gold Coast — Georja Davies (Gold Coast academy - matched bid from Essendon)\n\n10. Essendon — Maggie Johnstone (Greater Western Victoria Rebels)\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/tszyu-in-awkward-staredown-with-opponent-20251216-p5no4z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tszyu in awkward staredown with opponent",
        "publish_date": "Tue, 16 Dec 2025 13:08:10 +1100",
        "category": "finance",
        "authors": [],
        "text": "Tszyu in awkward staredown with opponent\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/cummins-to-return-as-australia-confirms-two-changes-20251216-p5no42.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cummins to return as Australia confirms two changes",
        "publish_date": "Tue, 16 Dec 2025 13:07:57 +1100",
        "category": "finance",
        "authors": [],
        "text": "Cummins to return as Australia confirms two changes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/sydney-busses-battle-it-out-for-best-dressed-20251216-p5no4u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney busses battle it out for best dressed",
        "publish_date": "Tue, 16 Dec 2025 13:03:54 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Sydney busses battle it out for best dressed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/dads-famed-guernsey-used-to-surprise-aflw-darftee-20251216-p5no4p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dad's famed guernsey used to surprise AFLW darftee",
        "publish_date": "Tue, 16 Dec 2025 12:59:37 +1100",
        "category": "finance",
        "authors": [],
        "text": "Dad's famed guernsey used to surprise AFLW darftee\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/sisu-a-lesson-in-gentle-resilience-from-the-world-s-happiest-country-20251209-p5nm8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sisu: A lesson in gentle resilience from the world’s happiest country",
        "publish_date": "Tue, 16 Dec 2025 12:55:32 +1100",
        "category": "lifestyle",
        "authors": [
            "Robyn Willis"
        ],
        "text": "In the context of the challenge she had set herself in New Zealand, it is not so much about the ability to withstand pain, but looking within to find the strength to go on. “Sisu as a word, it literally means when translated insides, the intestines. It is to understand what and who we are,” she says. Key to this is quietening the expectations of the outside world and listening to ourselves. “Sisu is unique as a concept in psychology because in Finnish culture sisu is not just a word that denotes tenacity or this inner resilience and great perseverance, but it also has this flavour of moral correctness and integrity,” Lahti says. “You do something and you do it really well, even when no one is watching.” Despite depictions in popular culture – there was an action film called Sisu released in 2022 – Lahti says true sisu is quiet, contemplative and even gentle. The concept has applications for Australians.\n\nLoading Podcaster Susanna Heiskanen – author of Nordic Lifestyle: Embrace Slow Living, Cultivate Happiness and Know When to Take off Your Shoes – sees many similarities between Australians and Finns. “When I moved [to Australia] in 2008, I was surprised by how similar these two nations really are. After living 10 years in the UK, it was lovely to discover the shared love of nature between Australians and Finns – nature is truly important to both cultures. “The relaxed attitude towards life, people being respectful and kind, always interested in the world around them – these similar traits made me feel at home from the start.” Susanna Heiskanen says she has seen sisu in action in Australia as communities face adversity like natural disasters together. Credit: Brett Hemmings/Getty Images\n\nBut she has also seen the way Australians unknowingly tap into the tradition of sisu, most tellingly when conditions push people to the brink and communities come together to support each other through hard times. “I see a communal spirit here in Australia that mirrors sisu,” Heiskanen says. “Looking at disaster-affected areas, I see sisu in action – people working together towards a common goal, using their inner strength to get through flood or bushfire-ravaged lives, rebuilding their livelihoods and homes.” It’s a philosophy that Finns continue to draw upon to withstand difficulties, apparently against the odds, she says. “Sisu is a collective determination that the nation has in abundance,” she says. “I recently saw a documentary about Finnish preparedness against occupation or war – the underground tunnels and halls that are used daily for sports, parking and children’s activities, but can house more people than the entire population of Helsinki. That’s resilience in action: planning ahead and making sure you’re prepared no matter what. “Sisu is also taught in schools as a concept when discussing history and the meaning of perseverance. We Finns have learned not to give up even when logic says we should. The 1939 Winter War against Russia is a powerful example of this national character.”\n\nLoading Both women talk about the true strength of sisu being not just in the ability to push on, but also to stop. “I don’t think you can ever have too much sisu. It’s your superpower for happiness, and there’s never too much happiness in the world,” Heiskanen says. “That said, true sisu also means knowing when to rest and regroup – it’s sustained strength, not reckless stubbornness.” For Lahti, when pounding the NZ asphalt, the ultimate reckoning came when she listened to what her body was telling her. “It was a Guiness World Record pursuit and people were watching it, so it was a pressure. But there is always a thing of ‘are we listening to the drumbeat outside or is it our own?’ That’s where the whole thing shifted for me and that’s where our sisu becomes sustainable, when we listen to ourselves.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/three-people-rushed-to-hospital-after-unit-fire-in-spring-hill-20251216-p5nnys.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three people rushed to hospital after inner-city unit fire",
        "publish_date": "Tue, 16 Dec 2025 12:50:44 +1100",
        "category": "lifestyle",
        "authors": [
            "Julius Dennis"
        ],
        "text": "Three people, including a man who is fighting for his life, have been rushed to hospital after a fire near the Brisbane CBD.\n\nEmergency services were called to a unit complex on Water Street in Spring Hill at about 3am this morning, with fire crews arriving at 3.05am.\n\nThe fire erupted at an apartment in Water Street, Spring Hill. Credit: Shelley Starling\n\nA man with life-threatening burns was treated at the scene before being taken to the Royal Brisbane and Women’s Hospital, as was a woman with serious burns.\n\nA man with minor burns was taken to the Princess Alexandra Hospital in a stable condition.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/anthony-albanese-visits-bondi-hero-20251216-p5no3s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anthony Albanese visits Bondi hero",
        "publish_date": "Tue, 16 Dec 2025 12:13:36 +1100",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese visits Bondi hero\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/khawaja-overlooked-as-inglis-keeps-ashes-spot-for-adelaide-20251216-p5no1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Khawaja overlooked as Inglis keeps Ashes spot for Adelaide",
        "publish_date": "Tue, 16 Dec 2025 12:11:48 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig",
            "Tom Decent"
        ],
        "text": "Adelaide: Usman Khawaja has been left out of the Australian side despite returning to full fitness, with Josh Inglis to keep his place in the middle order for the Adelaide Ashes Test.\n\nReturning captain Pat Cummins named his XI on match eve, confirming that Travis Head and Jake Weatherald will continue their opening partnership.\n\nUsman Khawaja has been overlooked for the Adelaide Ashes Test. Credit: Getty\n\nThe news is a blow for Khawaja, who had been hopeful of a recall after recovering from the back spasms that affected him during the Perth Test and then ruled him out of the Gabba.\n\nNathan Lyon and Cummins will return to the bowling attack in place of Brendan Doggett and Michael Neser.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/china-s-property-cancer-is-spreading-through-the-rest-of-its-economy-20251216-p5nnz9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "China’s property cancer is spreading through its economy",
        "publish_date": "Tue, 16 Dec 2025 12:01:27 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Four years after property developer China Evergrande defaulted on its sky-high debts and marked the beginning of China’s property crisis, the sector remains a cancer within its economy.\n\nData released by China’s National Bureau of Statistics on Monday shows its economy continues to weaken, with retail sales at their lowest since the pandemic and the country facing its first fall in investment since the late 1980s.\n\nAt the heart of its economic challenges – which saw a 2.6 per cent year-on-year decline in fixed-asset investment in the first 11 months of the year – is the seemingly endless implosion within China’s property market.\n\nChina Evergrande’s collapse has started a property cancer in the nation’s economy, which continues to metastasise. Credit: Getty Images\n\nPrices and sales volumes are continuing to fall – sales have nearly halved since the property crisis gathered momentum in 2021 – and investment in property has plunged 15.9 per cent in the 11 months to the end of November.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/after-345-shows-this-modern-day-musical-genius-brings-his-epic-tour-to-an-end-20251214-p5nnig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "After 345 shows, this modern-day musical genius brings his epic tour to an end",
        "publish_date": "Tue, 16 Dec 2025 11:46:18 +1100",
        "category": "entertainment",
        "authors": [
            "Martin Boulton",
            "Jessica Nicholas"
        ],
        "text": "MUSIC\n\nJacob Collier | Djesse World Tour ★★★★\n\nMargaret Court Arena, December 13\n\nFour brightly coloured trees glowed on stage and amped up a festive mood in the air, as Jacob Collier bounded into view wearing loose-fitting multicoloured pants and a radiant orange jacket. The lanky 31-year-old Londoner barely stopped bouncing about in his bright yellow Crocs for the next two hours, as his five-piece group shifted from silky jazz grooves to funky beats, classical flourishes and Collier’s self-styled gospel harmonies.\n\nMulti-instrumentalist Jacob Collier performs on stage at Margaret Court Arena in Melbourne during his Djesse World Tour on December 13, 2025. Credit: Richard Clifford\n\nIn the 345th and final performance of his epic Djesse World Tour, Collier frequently thanked the audience and showered affection on Melbourne, where he originally played in 2018 – the same year he released the first of four albums in the Djesse series. Along the way, he’s won seven Grammy Awards, been hailed as a modern-day musical genius, and collaborated with the late composer Quincy Jones and Coldplay.\n\nOriginal compositions Wherever I Go from Djesse Vol. 4, and Heaven (Butterflies) from Collier’s new and relatively stripped-back acoustic guitar album The Light For Days were hugely popular among the sold-out crowd.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-what-needs-to-be-done-about-our-gun-laws/vtzajqd2z",
        "title": "INTERVIEW: What needs to be done about our gun laws?",
        "publish_date": "Mon, 15 Dec 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/supermarkets-cheapest-groceries-australia/nzo613bkt",
        "title": "Which supermarket has the cheapest groceries? Choice reveals its latest price check",
        "publish_date": "Mon, 15 Dec 2025 18:36:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Aldi has once again come out on top as the supermarket with the cheapest groceries, according to a new comparison of a basket of products.\n\n\n\n\n\nConsumer group Choice found a basket of 20 items cost $72.41 at Aldi, $98.98 at Woolworths, $100.04 at Coles and $109.25 at IGA, excluding specials.\n\n\n\n\n\nThis represented \"quite a significant gap\" between Aldi and the second-cheapest store, Woolworths, Choice editorial director Mark Serrels said.\n\n\n\n\n\nThe quarterly government-backed supermarket survey focused its latest report on entertaining essentials ahead of Christmas in addition to grocery staples.\n\n\n\nThe basket contained items like milk, Weetbix, dried apples, carrots, bananas, chicken breast fillets, cherry tomatoes, bagged mixed salad, salted peanuts, plus other products for a festive gathering such as mineral water, crackers, camembert, stuffed olives and more.\n\n\n\n\n\nWhen comparing seven items of basics, including apples, bananas, strawberries, carrots, Weetbix, milk, and chicken breast fillets, and excluding specials, Aldi remained the cheapest at $31.41, followed by Woolworths at $32.20, Coles at $33.16, and IGA at $39.20.\n\n\n\nAldi has once again been found to contain the cheapest groceries in Australia, according to the latest supermarket survey by Choice. Source: AAP / Joel Carrett Aldi was still the cheapest when factoring in specials, with the price remaining the same as the basket without specials at $72.41. The Woolworths' specials basket was $93.17, Coles' $100.04, and IGA's $105.38.\n\n\n\n\n\nIt's not entirely a like-for-like comparison, with Choice saying that in order to compare the same products as often as it could, the baskets from Coles, Woolworths and IGA contained more name-brand products than the Aldi basket.\n\n\n\n\n\n\"Buying more home-brand products from these supermarkets would bring the cost down, but we also know that shoppers often choose national-brand products when entertaining,\" Choice said.\n\n\n\nWhere can you get the freshest lettuce?\n\nTo determine which supermarket had the freshest produce, the group also compared the freshness of mixed lettuce two days after buying across all four supermarkets.\n\n\n\n\n\nChoice said it can't answer the question for every item, but looked at lettuce because it shows signs of decay quickly.\n\n\n\nColes came out on top, with 77 per cent of its mystery shoppers saying its lettuce leaves were fresh after two days. Woolworths, IGA and Aldi followed respectively.\n\n\n\n\n\n\"In this survey, there was some evidence of decay in the mixed lettuce purchased at all supermarkets, but Coles ultimately received the highest score for freshness,\" Serrels said.\n\n\n\n\n\nChoice advised shoppers hoping to reduce their costs to shop around, check unit pricing, and opt for cheaper alternatives like meat cuts, frozen fruit and vegetables, and \"imperfect\" ranges.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/hopes-for-the-future-among-great-keppel-island-locals/4ofh4u2b1",
        "title": "Hopes for the future among Great Keppel Island locals",
        "publish_date": "Mon, 15 Dec 2025 05:52:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hopes for the future among Great Keppel Island locals\n\nPublished 15 December 2025, 5:33 am\n\nQueensland's tropical islands have long been a drawcard for tourists. But with the trend away from being a party paradise, some resort islands are looking for a new identity.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-jillian-segal-special-envoy-to-combat-antisemitism/ldm6nl1fw",
        "title": "INTERVIEW: Jillian Segal, Special Envoy to Combat Antisemitism",
        "publish_date": "Mon, 15 Dec 2025 03:55:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/tszyu-in-awkward-staredown-with-opponent-20251216-p5no4z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tszyu in awkward staredown with opponent",
        "publish_date": "Tue, 16 Dec 2025 13:08:10 +1100",
        "category": "finance",
        "authors": [],
        "text": "Tszyu in awkward staredown with opponent\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/cummins-to-return-as-australia-confirms-two-changes-20251216-p5no42.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cummins to return as Australia confirms two changes",
        "publish_date": "Tue, 16 Dec 2025 13:07:57 +1100",
        "category": "finance",
        "authors": [],
        "text": "Cummins to return as Australia confirms two changes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/sydney-busses-battle-it-out-for-best-dressed-20251216-p5no4u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney busses battle it out for best dressed",
        "publish_date": "Tue, 16 Dec 2025 13:03:54 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Sydney busses battle it out for best dressed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/dads-famed-guernsey-used-to-surprise-aflw-darftee-20251216-p5no4p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dad's famed guernsey used to surprise AFLW darftee",
        "publish_date": "Tue, 16 Dec 2025 12:59:37 +1100",
        "category": "finance",
        "authors": [],
        "text": "Dad's famed guernsey used to surprise AFLW darftee\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/sisu-a-lesson-in-gentle-resilience-from-the-world-s-happiest-country-20251209-p5nm8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sisu: A lesson in gentle resilience from the world’s happiest country",
        "publish_date": "Tue, 16 Dec 2025 12:55:32 +1100",
        "category": "lifestyle",
        "authors": [
            "Robyn Willis"
        ],
        "text": "In the context of the challenge she had set herself in New Zealand, it is not so much about the ability to withstand pain, but looking within to find the strength to go on. “Sisu as a word, it literally means when translated insides, the intestines. It is to understand what and who we are,” she says. Key to this is quietening the expectations of the outside world and listening to ourselves. “Sisu is unique as a concept in psychology because in Finnish culture sisu is not just a word that denotes tenacity or this inner resilience and great perseverance, but it also has this flavour of moral correctness and integrity,” Lahti says. “You do something and you do it really well, even when no one is watching.” Despite depictions in popular culture – there was an action film called Sisu released in 2022 – Lahti says true sisu is quiet, contemplative and even gentle. The concept has applications for Australians.\n\nLoading Podcaster Susanna Heiskanen – author of Nordic Lifestyle: Embrace Slow Living, Cultivate Happiness and Know When to Take off Your Shoes – sees many similarities between Australians and Finns. “When I moved [to Australia] in 2008, I was surprised by how similar these two nations really are. After living 10 years in the UK, it was lovely to discover the shared love of nature between Australians and Finns – nature is truly important to both cultures. “The relaxed attitude towards life, people being respectful and kind, always interested in the world around them – these similar traits made me feel at home from the start.” Susanna Heiskanen says she has seen sisu in action in Australia as communities face adversity like natural disasters together. Credit: Brett Hemmings/Getty Images\n\nBut she has also seen the way Australians unknowingly tap into the tradition of sisu, most tellingly when conditions push people to the brink and communities come together to support each other through hard times. “I see a communal spirit here in Australia that mirrors sisu,” Heiskanen says. “Looking at disaster-affected areas, I see sisu in action – people working together towards a common goal, using their inner strength to get through flood or bushfire-ravaged lives, rebuilding their livelihoods and homes.” It’s a philosophy that Finns continue to draw upon to withstand difficulties, apparently against the odds, she says. “Sisu is a collective determination that the nation has in abundance,” she says. “I recently saw a documentary about Finnish preparedness against occupation or war – the underground tunnels and halls that are used daily for sports, parking and children’s activities, but can house more people than the entire population of Helsinki. That’s resilience in action: planning ahead and making sure you’re prepared no matter what. “Sisu is also taught in schools as a concept when discussing history and the meaning of perseverance. We Finns have learned not to give up even when logic says we should. The 1939 Winter War against Russia is a powerful example of this national character.”\n\nLoading Both women talk about the true strength of sisu being not just in the ability to push on, but also to stop. “I don’t think you can ever have too much sisu. It’s your superpower for happiness, and there’s never too much happiness in the world,” Heiskanen says. “That said, true sisu also means knowing when to rest and regroup – it’s sustained strength, not reckless stubbornness.” For Lahti, when pounding the NZ asphalt, the ultimate reckoning came when she listened to what her body was telling her. “It was a Guiness World Record pursuit and people were watching it, so it was a pressure. But there is always a thing of ‘are we listening to the drumbeat outside or is it our own?’ That’s where the whole thing shifted for me and that’s where our sisu becomes sustainable, when we listen to ourselves.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/three-people-rushed-to-hospital-after-unit-fire-in-spring-hill-20251216-p5nnys.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three people rushed to hospital after inner-city unit fire",
        "publish_date": "Tue, 16 Dec 2025 12:50:44 +1100",
        "category": "lifestyle",
        "authors": [
            "Julius Dennis"
        ],
        "text": "Three people, including a man who is fighting for his life, have been rushed to hospital after a fire near the Brisbane CBD.\n\nEmergency services were called to a unit complex on Water Street in Spring Hill at about 3am this morning, with fire crews arriving at 3.05am.\n\nThe fire erupted at an apartment in Water Street, Spring Hill. Credit: Shelley Starling\n\nA man with life-threatening burns was treated at the scene before being taken to the Royal Brisbane and Women’s Hospital, as was a woman with serious burns.\n\nA man with minor burns was taken to the Princess Alexandra Hospital in a stable condition.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/anthony-albanese-visits-bondi-hero-20251216-p5no3s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anthony Albanese visits Bondi hero",
        "publish_date": "Tue, 16 Dec 2025 12:13:36 +1100",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese visits Bondi hero\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/khawaja-overlooked-as-inglis-keeps-ashes-spot-for-adelaide-20251216-p5no1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Khawaja overlooked as Inglis keeps Ashes spot for Adelaide",
        "publish_date": "Tue, 16 Dec 2025 12:11:48 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig",
            "Tom Decent"
        ],
        "text": "Adelaide: Usman Khawaja has been left out of the Australian side despite returning to full fitness, with Josh Inglis to keep his place in the middle order for the Adelaide Ashes Test.\n\nReturning captain Pat Cummins named his XI on match eve, confirming that Travis Head and Jake Weatherald will continue their opening partnership.\n\nUsman Khawaja has been overlooked for the Adelaide Ashes Test. Credit: Getty\n\nThe news is a blow for Khawaja, who had been hopeful of a recall after recovering from the back spasms that affected him during the Perth Test and then ruled him out of the Gabba.\n\nNathan Lyon and Cummins will return to the bowling attack in place of Brendan Doggett and Michael Neser.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/china-s-property-cancer-is-spreading-through-the-rest-of-its-economy-20251216-p5nnz9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "China’s property cancer is spreading through its economy",
        "publish_date": "Tue, 16 Dec 2025 12:01:27 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Four years after property developer China Evergrande defaulted on its sky-high debts and marked the beginning of China’s property crisis, the sector remains a cancer within its economy.\n\nData released by China’s National Bureau of Statistics on Monday shows its economy continues to weaken, with retail sales at their lowest since the pandemic and the country facing its first fall in investment since the late 1980s.\n\nAt the heart of its economic challenges – which saw a 2.6 per cent year-on-year decline in fixed-asset investment in the first 11 months of the year – is the seemingly endless implosion within China’s property market.\n\nChina Evergrande’s collapse has started a property cancer in the nation’s economy, which continues to metastasise. Credit: Getty Images\n\nPrices and sales volumes are continuing to fall – sales have nearly halved since the property crisis gathered momentum in 2021 – and investment in property has plunged 15.9 per cent in the 11 months to the end of November.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/after-345-shows-this-modern-day-musical-genius-brings-his-epic-tour-to-an-end-20251214-p5nnig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "After 345 shows, this modern-day musical genius brings his epic tour to an end",
        "publish_date": "Tue, 16 Dec 2025 11:46:18 +1100",
        "category": "entertainment",
        "authors": [
            "Martin Boulton",
            "Jessica Nicholas"
        ],
        "text": "MUSIC\n\nJacob Collier | Djesse World Tour ★★★★\n\nMargaret Court Arena, December 13\n\nFour brightly coloured trees glowed on stage and amped up a festive mood in the air, as Jacob Collier bounded into view wearing loose-fitting multicoloured pants and a radiant orange jacket. The lanky 31-year-old Londoner barely stopped bouncing about in his bright yellow Crocs for the next two hours, as his five-piece group shifted from silky jazz grooves to funky beats, classical flourishes and Collier’s self-styled gospel harmonies.\n\nMulti-instrumentalist Jacob Collier performs on stage at Margaret Court Arena in Melbourne during his Djesse World Tour on December 13, 2025. Credit: Richard Clifford\n\nIn the 345th and final performance of his epic Djesse World Tour, Collier frequently thanked the audience and showered affection on Melbourne, where he originally played in 2018 – the same year he released the first of four albums in the Djesse series. Along the way, he’s won seven Grammy Awards, been hailed as a modern-day musical genius, and collaborated with the late composer Quincy Jones and Coldplay.\n\nOriginal compositions Wherever I Go from Djesse Vol. 4, and Heaven (Butterflies) from Collier’s new and relatively stripped-back acoustic guitar album The Light For Days were hugely popular among the sold-out crowd.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/popular-aussie-restaurant-chain-fined-2035-for-handing-banned-items-to-customers-014700240.html",
        "title": "Popular Aussie restaurant chain fined $2,035 for handing banned items to customers",
        "publish_date": "2025-12-16T01:47:00Z",
        "category": "finance",
        "authors": [],
        "text": "A popular Australian bubble tea and bakery chain has been slapped with a $2,035 penalty for handing out a banned item to customers. Top Tea is now the first company to be fined for continuing to use plastic straws following the passing of new Victorian regulations in 2023.\n\nThese laws also banned the sale or supply of a number of single-use plastic items, including plates, cutlery, drink stirrers and expanded polystyrene food service items.\n\nThe company’s Swanston Street store in Melbourne’s CBD was fined after several customers dobbed them in to the Environment Protection Authority (EPA).\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt then sent officers to the cafe in October and found not only straws, but stirrers as well.\n\nPlastic ban breach labelled 'disappointing'\n\nThe EPA’s Julia Gaitan called the breach by Top Tea “disappointing”, adding there was no excuse when there was widespread compliance by other retailers.\n\n“The ban was introduced because single-use plastics were making up a third of the litter we see in our environment and were difficult and costly to clean up,” she said.\n\n“They were often only useful for a few minutes before they wound up in landfill, or far worse, in the streets, the bush and our waterways and along our beaches.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMelbourne-based Top Tea has multiple stores around the city, as well as in other states, and has been contacted for comment.\n\nAussie states crack down on problematic plastics\n\nAround the country, state governments have been vying to introduce the “toughest” anti-plastic regulations.\n\nSouth Australia made international headlines after announcing a ban on plastic soy sauce fish, an item that’s commonly littered and too small to recycle.\n\nIn November, the NSW Government published a schedule of single-use plastic bans for the next five years, which also included the pesky fish, but also fruit and vegetable stickers, bread ties and umbrella sleeves.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    }
]