[
    {
        "url": "https://www.9news.com.au/national/qantas-customers-to-recieve-personal-information-about-data-stolen-in-cyber-attack/b62d3b0b-52aa-4a7d-86fb-6a584bacdd45",
        "title": "The email six million Australians should expect from Qantas",
        "publish_date": "Fri, 04 Jul 2025 01:45:44 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Q﻿antas customers can expect to receive details on what data was stolen in a cyberattack on the airline earlier this week.\n\nThe airline said the cyberattack occurred on Monday after a cybercriminal targeted a customer call centre ﻿ and gained access to a third-party customer servicing platform.\n\nData from over six million customers was compromised in the attack.\n\nData from over six million Qantas customers was compromised in the attack. (Getty)\n\nThe airline said today that no one has come forward claiming to have the data, and they were still working with the authorities to investigate the incident.\n\n﻿Qantas said that it would be in a position by next week to update the impacted customers on the types of information that were contained in the system that was accessed.\n\nIt will include ﻿specific data for each person, and it will vary from customer to customer.\n\nThe airline also reaffirmed that ﻿credit card information, frequent flyer numbers and sensitive identification documents like passports were not compromised.\n\n\"We know that data breaches can feel deeply personal and understand the genuine concern this creates for our customers,\" Qantas CEO Vanessa Hudson said.\n\n\"Right now we're focused on providing the answers and transparency they deserve.\n\n\"Our investigation is progressing well with our cybersecurity teams working alongside leading external specialists to determine what information has been accessed.\n\nThe airline also reaffirmed that ﻿credit card information, frequent flyer numbers and sensitive identification documents like passports were not compromised. (AAP)\n\n\"We're finalising a process that will enable us to provide affected customers with more information about their personal information that was potentially compromised.\n\n\"We are treating this incredibly seriously and have implemented additional security measures to further strengthen our systems.\n\n\"Our customers can be assured that we have the right expertise and resources dedicated to resolving this matter thoroughly and effectively.\n\n\"I want to apologise again for the uncertainty this has caused. We're committed to keeping our affected customers informed with regular updates as our investigation progresses.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/mental-health-toowoomba-momentum-closure-public-health-network-funding/b8a8889b-63de-4dec-ac43-ab6bdc65d3a1",
        "title": "Fears for vulnerable Aussies as hub plan leaves mental health provider in limbo",
        "publish_date": "Fri, 04 Jul 2025 01:10:03 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "More than 800 vulnerable Australians are \"in limbo\" as the mental health care provider they rely on for support faces closure.\n\n﻿Momentum Mental Health offers coaching, group programs, bulk-billed psychological therapies and other support to hundreds of locals in Toowoomba and its surrounds.\n\nWith a waitlist of more than 200 people, ﻿Momentum's services are in high demand.\n\nMomentum Mental Health staff supported more than 800 clients last year. (Instagram/@momentummentalhealth1)\n\nBut a recent redistribution of mental health funding has seen the establishment of a $3.6 million integrated mental health hub instead.\n\nDarling Downs and West Moreton Primary Health Network (PHN) manages all aspects of primary health care in the region, including mental health, and tailor services to meet community needs.\n\nLast year, the PHN announced plans for the new hub which would offer a range of mental health services, including clinical care and psychosocial support, in one location.\n\nThe hub would be run by one or more existing providers that would work individually or in partnership to provide these vital services.\n\nInitially, the Momentum team were excited by the prospect.\n\n﻿\"We love the idea of an integrated hub if it works with us to support people in our community,\" chief executive Shirley-Anne Gardiner told 9news.com.au.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nShirley-Anne Gardiner, chief executive at Momentum Mental Health. (Supplied)\n\nTo create the hub, PHN is commissioning existing providers to ﻿deliver services through via an open market tender, meaning any existing providers could apply.\n\nThe providers that are chosen to deliver services through the hub will ﻿remain funded by the PHN.\n\nThose that are not chosen and operate outside the hub \"may need to seek alternative funding\", according to a PHN press release.\n\nUnder this new model, ﻿all of Momentum's current PHN funding would be redirected to the hub.\n\n\"We would be left with a small amount of Queensland Health funding and $200,000 in fundraising a year,\" Gardiner said.\n\n\"But ﻿we can't financially survive. We would have to shut because we can't fundraise $800,000 a year. It's not sustainable.\"\n\nMomentum's only avenue to receive ongoing PHN funding is if ﻿its application to deliver services through the hub is successful.\n\n﻿Successful applicants were supposed to be notified in June, but the number of applications forced PHN to push the date back to late July.\n\nPHN told 9news it will not provide comment until the tender process is finalised.﻿\n\nMomentum and other existing providers are currently operating on short-term funding provided by the PHN to \"support safe client transitions\".\n\nThat funding has already been extended once and will run out at the end of the year.﻿\n\nIf ﻿Momentum has not secured ongoing funding either from the PHN as a hub provider or through alternative channel by then, Gardiner expects it will have to close its doors.\n\n\"It's heartbreaking for us and we're really worried about our clients,\" she said.\n\n\"We have people who have suicidal ideation, we have people with chronic mental health conditions, we have people that suffer from social anxiety or agoraphobia.\n\n\"We have one woman who didn't leave her house for 20 years before she came to Momentum.\"\n\nREAD MORE: Call for national response to alleged childcare sexual assaults\n\nBeing forced to change mental health care providers can be challenging for vulnerable Australians, especially those who have already built trust with a specific provider.\n\nGardiner fears that some clients will struggle with the transition to a new hub and some could fall through the cracks.\n\n﻿In the past, several clients have experienced mental health crises during the one week Momentum closes over Christmas.\n\nSome have even had to go into acute ﻿mental health care because they cannot access the support they rely on.\n\nGardiner fears that if Momentum is forced to close, ﻿some clients who already experience life-threatening mental health concerns could suffer.\n\n\"If we're not around [or] and we can't work alongside them, we're going to see people make some stupid choices because we're not there to help them,\" she said.\n\nThese are the most miserable countries in the world View Gallery\n\nFor now, Momentum's staff and clients are living \"in limbo\" waiting for the PHN ﻿to announce the outcome of the hub tender.\n\nIf Momentum is not successful, ﻿staff will have to begin the process of looking for new jobs and clients will need to prepare to transition to new support services.\n\nIt's a scary prospect and one Gardiner wishes she didn't have to consider.﻿\n\nShe's started a Change.org petition to secure ongoing funding so Momentum can continue providing vital services many Toowoomba locals rely on.\n\n\"There's enough work for an integrated mental health hub and us. It shouldn't be us or them.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/experts-say-july-cash-rate-cut-in-the-bag/8bba4307-c97d-441d-90e3-b7146620815f",
        "title": "Experts say July cash rate cut 'in the bag'",
        "publish_date": "Thu, 03 Jul 2025 21:48:45 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "A﻿ July mortgage rate cut is \"in the bag,\" according to financial comparison experts.\n\nNearly 88 per cent (30 out of 34) of experts and economists who took the Finder's RBA Cash Rate ﻿survey said they believe the Reserve Bank will cut the cash rates in July, bringing it down to 3.60 per cent.\n\nIf the banks pass the rate cut, it would save Aussies with a $500k mortgage around $1613 per year.\n\nAustralians with a mortgage of $1 million will save an average of $269 per month, or $3226 per year. ﻿\n\n﻿Head of Consumer Research at Finder Graham Cooke said another rate cut would give mortgage holders a much-needed confidence boost.\n\n\"We've seen two cash rate cuts already, but homeowners are chomping at the bit for more,\" he said.\n\n\"Inflation is continuing to reduce, which means the RBA is likely to cut and the banks will be under a lot of societal pressure to pass on the full rate cut again in July.\"\n\nREAD MORE: How a meme could land you in hot water at the US border ﻿\n\nAustralians with a mortgage of $1 million will save an average of $269 per month, or $3226 per year. ﻿ (9News)\n\nMatthew Peter from investment firm QIC said \"a July cut is in the bag\".\n\n\"Underlying inflation is within the RBA's target band and falling, consumer spending is disappointing and the market is expecting a rate cut.\n\n\"No reasons for the RBA to wait,\" Peter said.\n\nThe majority of experts who spoke to Finder also said they are predicting another rate cut in August.\n\n﻿Just over half of the experts polled also predicted a rate cut in November.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australians-travelling-to-the-us-immigration-lawyer-explains-rights-at-the-border/93d72716-4010-45a1-b2e4-564883d5f797",
        "title": "How a meme could land you in hot water at the US border",
        "publish_date": "Thu, 03 Jul 2025 20:45:38 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "It's every traveller's worst fear.\n\nYou arrive in a new country after a long flight, line up for hours and present your passport – only to be pulled aside by an immigration officer.\n\nThere have been multiple reports of Australian travellers being refused entry into the United States over seemingly frivolous reasons.\n\nThere have been multiple reports recently of Australian travellers being refused entry into the US. (Anadolu via Getty Images)\n\nSome said they were asked to hand over their phone so officers could download its contents.\n\nOne Norwegian man said he was denied entry because he had an unflattering meme of US Vice President JD Vance on his phone.\n\nAn Australian writer, Alistair Kitchen, reported last month he was sent home after being interrogated about his blogging on political protests.\n\nHe later claimed officials found \"evidence of drug use\" on his phone and he felt coerced into admitting he had tried drugs in the past.\n\nThe threat of being detained and sent back home now lingers for Australians hoping to holiday in the US.\n\nBut are immigration officers really ramping up their efforts to stop Australians and other nationalities from entering the US under the Trump administration?\n\nMelbourne-based immigration lawyer Sherwin Noorian told 9news.com.au US officials were simply flexing a legal muscle that had always existed.\n\nMelbourne-based immigration lawyer Sherwin Noorian, principal lawyer of Globalised Pty Ltd. (Supplied)\n\nBut Noorian said travellers should not feel coerced into admitting prior drug use or their political beliefs to an immigration officer.\n\n\"The US has very strict controlled substances laws for non-citizens who are travelling to the US, so even admitting to using marijuana once in one's home country… they can use that against the traveller and deny them entry,\" Noorian explained.\n\n\"There's a bit of nuance to it and it may not legally stand up, but they can kind of do whatever they want at that point.\"\n\nNoorian's advice is to never \"incriminate yourself\" if you've never been convicted of anything.\n\nHe's also noticed an \"anecdotal\" rise in reported cases of travellers being detained and their phones confiscated.\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nIt's always been done, but he posits the theory that immigration officers could now be using an \"advanced computing system to scan the devices for anything they deem suspicious or of concern\".﻿\n\nHe also said travellers do have a right to refuse a request to give up their phone, but warns this could result in automatic entry refusal.\n\n\"It's a condition of entry, so to speak, that you would hand over that device when asked,\" he added.\n\nNoorian said travellers shouldn't feel coerced into admitting prior drug use or their political beliefs to an immigration officer. (Anadolu via Getty Images)\n\nNoorian said he was aware of reports that travellers were being turned away at the border over phone content that was critical of the Trump administration, including memes or political posts.\n\nHe suspected that travellers who were granted an Electronic System for Travel Authorisation (ESTA) visa waiver could be flagged and interrogated at the border for a variety of reasons and sometimes it was not hard to find one that sticks.\n\n\"That could be used, especially if they're high-profile, as a reason to take someone aside to question them and give them a hard time,\" he said.\n\n\"If they're those types of officers who, and not all of them are like this, but some would be looking for people who are against the administration or against what they deem to be the US interest, they would use that as a reason to question someone and begin that interview.\"\n\nA meme alone wouldn't be enough to deny entry, Noorian said.﻿\n\n\"But through the course of that [interview], they would begin looking for what they can use to build a case to deny entry,\" he added.\n\nREAD MORE: Retirement crisis coming for millions of Australians\n\nNoorian said the ESTA, which most Australians use to enter the US, does not guarantee entry.\n\nThe first time a traveller is genuinely assessed under an ESTA, he said, is once you land on US soil.\n\n\"For most people, they wait until they're in the country and then they say, 'OK, we're going to assess you for your eligibility to enter,'\" he said.\n\n\"I think the Smartraveller advice on this is really quite accurate when they say, be aware that the US authorities have a high level of discretion for visa waiver entries.\n\n\"It means even more for an Australian traveller than someone coming from Canada or the UK.\"\n\nMost Australian travellers enter the US under the ESTA visa waiver. (PA Images via Getty Images)\n\nThe current Smartraveller advice for Australians travelling to the US warns that \"entry requirements are strict\".\n\n\"US authorities have broad powers to decide if you're eligible to enter and may determine that you are inadmissible for any reason under US law,\" the advice reads.\n\nAll hope is not lost for a US holiday if you're denied entry under an ESTA, though.\n\nNoorian said he had cases of clients being refused entry but then able to enter the US through a visitor visa obtained via the US consulate.\n\n\"It's not a lifetime ban, they can reapply, but in this environment, it depends on the circumstances,\" he added.\n\n\"If they admitted to drug use, that could be a big problem.\n\n\"But it can be overcome. We've done that before.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/entertainment/michael-madsen-reservoir-dogs-and-kill-bill-star-dies-at-67/40317a51-1c15-4af7-bd39-8c4e4da28d15",
        "title": "Michael Madsen, 'Reservoir Dogs' and 'Kill Bill' star, dies at 67",
        "publish_date": "Thu, 03 Jul 2025 19:29:08 +0000",
        "category": "entertainment",
        "authors": [
            "Jul"
        ],
        "text": "Michael Madsen, whose menacing characters in “Reservoir Dogs” and “Kill Bill” made him a standout in Quentin Tarantino’s films, has died. He was 67.\n\nMadsen was found unresponsive in his home in Malibu, California, on Thursday morning and pronounced dead, Los Angeles County Sheriff's Department Watch Commander Christopher Jauregui said.\n\nHe is believed to have died of natural causes and authorities do not suspect any foul play was involved. Madsen's manager Ron Smith said cardiac arrest was the apparent cause.\n\nActor Michael Madsen appears at the premiere of \"The Hateful Eight\" in Los Angeles on Dec. 7, 2015. (Chris Pizzello/Invision/AP)\n\nMadsen’s career spanned more than 300 credits stretching back to the early 1980s, many in low-budget films.\n\nBut his most memorable screen moment may have been the sadistic torture of a captured police officer — while dancing to Stealers Wheel’s “Stuck in the Middle with You” — as Mr. Blonde in 1992’s “Reservoir Dogs.”\n\nHe would become a Tarantino regular, appearing in the “Kill Bill” films and “The Hateful Eight.”\n\n“In the last two years Michael Madsen has been doing some incredible work with independent film including upcoming feature films ‘Resurrection Road,’ ‘Concessions and ’Cookbook for Southern Housewives,' and was really looking forward to this next chapter in his life,\" his managers Smith and Susan Ferris and publicist Liz Rodriguez said in a statement.\n\nMichael Madsen and Kathleen York from the TV series Vengeance Unlimited. (Supplied)\n\nThey added that he \"was one of Hollywood’s most iconic actors, who will be missed by many.”\n\nDuring a handprint ceremony at the TCL Chinese Theatre in November 2020, Madsen reflected on his first visit to Hollywood in the early 1980s.\n\n“I got out and I walked around and I looked and I wondered if there were someday some way that that was going to be a part of me. And I didn’t know because I didn’t know what I was going to do at that point with myself,\" he said.\n\n\"I could have been a bricklayer. I could have been an architect. I could have been a garbage man. I could have been nothing. But I got lucky. I got lucky as an actor.”",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/accc-warns-against-ghost-stores-online-businesses-alleged-masquerading-as-local/395bed8b-f5e7-4a29-8c3c-30c413684f2e",
        "title": "ACCC's warning about 'ghost stores' luring customers online",
        "publish_date": "Thu, 03 Jul 2025 03:33:56 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Australians have been warned about shopping at alleged \"ghost stores\", websites which masquerade﻿ as local businesses.\n\nThe ACCC alleges four ghost store operators are harming consumers by presenting themselves as local Australian businesses which are facing imminent closing and claiming to sell high-quality clothing and footwear products.\n\nInstead, the consumer watchdog claims, the stores are based overseas, not closing down anytime soon, and are drop-shipping low-quality products.\n\nREAD MORE: Diddy supporters cover themselves in baby oil after bombshell court verdict ﻿\n\nThe ACCC posted screenshots from suspected \"ghost stores\" online. (ACCC)\n\nThe stores allegedly misrepresent themselves as local purveyors of high-quality goods. (ACCC)\n\nThe stores in question are everly-melbourne.com, willowandgrade-adelaide.com, sophie-claire.com, and doublebayboutique.com.\n\n9news.com.au has contacted each of the outlets regarding the allegations.﻿\n\n\"We are warning Australians about the risks of engaging with these four websites specifically, which we allege are not based in Melbourne, Adelaide or Double Bay, nor are they imminently closing down,\" ACCC deputy chair Catriona Lowe said.\n\n\"We further allege that the operators of these websites are supplying products which are not of the advertised quality.\"\n\nDouble Bay Boutique. (ACCC)\n\nSophie Claire. (ACCC)\n\nThe ACCC's warning follows an increased number of consumer reports to the watchdog in recent months about online ghost stores.\n\nSince the start of 2025, the ACCC estimated it had received at least 360 reports about 60 online retailers, though media reports suggested many more may be in operation.\n\nThere have also been complaints about alleged ghost stores refusing to provide refunds or not responding to complaints.\n\nGhost stores have been known to target consumers through social media ads and also tend to close and rebrand under new names, often using different Australian suburbs, towns or cities in their names to appear \"local\".\n\n\"We urge all Australians to think twice before clicking on ads they see on social media which claim to be from a boutique business based in a local town or city,\" Lowe said.\n\n\"Often ghost stores will share an emotional story on their social media or website that they are a small, locally operated business, needing to close for financial reasons.\n\n\"They will claim they are having a 'closing down sale' as a result, with all stock heavily discounted and available on a very limited basis.\"\n\nGhost stores sometimes use a name that is similar to that of a genuine local boutique, leading to competitive and reputational harm for those businesses.\n\nThe ACCC said ghost stores used targeted paid advertisements on social media sites such as Facebook and Instagram, and often appeared to use the Shopify e-commerce platform to host and operate their webstores.\n\n\"We have written to both Meta Platforms (as the owner of Facebook and Instagram) and Shopify to request they scrutinise and take appropriate action against the operators of ghost stores,\" Lowe said.\n\n\"We want to increase public awareness of these dishonest businesses so that Australians know how to spot them and can avoid being deceived into buying an inferior product.\"\n\nFind out more about how to identify a suspected ghost store at the ACCC website .﻿\n\nCan you pick the Black Friday scam text message? View Gallery",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/visas-australia-south-korean-family-in-melbourne-facing-deportation-over-document-error-plea-to-immigration-minister/fbe7e793-9a9f-4a63-a16a-ed0accae724e",
        "title": "Melbourne family face being deported to South Korea over 'misunderstanding'",
        "publish_date": "Wed, 02 Jul 2025 22:17:50 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Exclusive: Sophia Lee and her family are stuck in a nightmare limbo.\n\nThe 20-year-old has lived in Melbourne for 17 years, is studying to become a nurse on a scholarship and her younger siblings have never known life outside of this country.\n\nBut Sophia, her parents, brother and sister all face the possibility of being deported to South Korea over a \"misunderstanding\" and have waited for nearly three years with no answers.\n\nSophia Lee is studying to become a nurse but has been forced to pause her studies over this ongoing visa issue. (Supplied)\n\n\"Not only have I lived in Australia for 17 years, I grew up with Australian values and culture and I feel like I belong in Australia,\" Sophia told 9news.com.au.\n\n\"It's really difficult to have to go back and start everything from scratch. I'd have to learn the language… I can't even study in a Korean school because I don't know the language.\n\n\"I had planned out everything that I wanted to do with my life here in Australia.\"\n\nThe Lee-Park family were first denied Skilled Regional Visa (Subclass 887) visas in 2019 over a \"misunderstanding\" while trying to prove Sumni, Sophia's mother, had been working full-time in a regional area.\n\nThe 887 visa is a permanent residence visa for skilled provisional visa holders who have lived for at least two years and gained at least 12 months of employment in the specified regional area of Australia.\n\nTheir visa officer never provided a copy of the written refusal decision, Sophia said, leaving the family confused and unsure why they were denied.\n\nSophia has since requested audio of the oral decision.\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nHowever she believes miscommunication and an error in documentation meant officials didn't believe her mother was under full-time employment.\n\n9news.com.au has contacted the Department of Immigration regarding the missing written decision.﻿\n\nSumni and her husband Eun Kyo Lee run an end-of-lease cleaning business in Melbourne.\n\nSophia said her mother Sumni kept full-time hours in accordance with her visa conditions.\n\n\"Mum did fulfil that prerequisite and we had evidence to back it up,\" Sophia said.\n\n\"So now, we're just kind of stuck in limbo.\"\n\nSophia said language barriers and poor translation meant her parents couldn't properly resolve the issue.\n\nThe family claim they provided additional records proving they met the requirements for the visa but their case was not successful.﻿\n\nTheir appeal has been rejected by the Administrative Appeals Tribunal (AAT) several times.\n\nPictured: Eun Kyo Lee, Sumni Park and their three children Sophia, Sehun and Yesol. (Supplied)\n\nDocumentation cited by this masthead shows the AAT last upheld its decision to refuse their visa on August 11, 2022.\n\nA written confirmation of the refusal has not been given to the family due to \"member availability\".﻿\n\nThey have been on bridging visas for three years as they await the final decision.\n\nThe family are now desperately seeking a ministerial review.\n\nNow faced with the possibility of having to drag their family – including 11-year-old Yesol and 17-year-old Sehun – to South Korea, Sophia said her parents are terrified.\n\nThey are carers for Eun Kyo's elderly parents, who have permanent residency in Australia.\n\nThe couple also support their sister's two children with austism, both of whom are Australian citizens\n\nThe Park-Lee family are pleading with Immigration and Home Affairs minister Tony Burke to review their visa denial and grant permanent residency under compassionate grounds.\n\n\"They've invested so much here,\" Sophia said.\n\n\"My dad is really close with my grandparents, and if he has to go back… he can't take care of them or visit them anymore.\"\n\n\"They'd be so heartbroken to see us go.\"\n\n\"After living in Australia for so many years, we are hoping for compassion and fairness so that we can continue our lives here,\" Sumni added.\n\nSophia has been forced to pause her studies and is worried her dream of becoming a nurse is slipping away.﻿\n\nSuekjin Park, a family friend and immigration lawyer, said the Park-Lee family's visa refusal could have been avoided if a simple miscommunication around documents hadn't taken place.\n\nNot only have I lived in Australia for 17 years, I grew up with Australian values and culture and I feel like I belong in Australia.\n\n\"The family's visa refusal appears to centre on Public Interest Criterion 4020, specifically concerning ambiguity in the evidence of full-time work required for a Subclass 887 visa,\" Park said in a statement to 9news.com.au.\n\n\"Importantly, this does not involve any finding of deliberate fraud, but rather a misunderstanding or lack of clarity in documentation – a distinction that is often crucial in PIC 4020 assessments.\n\n\"The applicants later supplied additional records and invoices which, if considered earlier, may have led to a different outcome.\"\n\nPark said she believes the Park-Lee family deserve ministerial consideration under Section 351 of the Migration Act.\n\nThis grants the Australian Immigration Minister the power to substitute a decision made by the Administrative Appeals Tribunal (AAT) with a more favourable one.\n\nThe family have also started a Change.org petition to issue a direct plea to Burke to grant their visas.\n\n9News.com.au has contacted the Department of Immigration for comment.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/star-entertainment-workers-to-strike-in-brisbane/105493372",
        "title": "Star casino workers to strike amid ongoing financial woes",
        "publish_date": "Fri, 04 Jul 2025 01:58:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hundreds of workers at Star's Brisbane casino are set to walk off the job, saying the entertainment group has proposed cutting penalty rates as it faces financial woes.\n\nUnited Workers Union president Jo Schofield said staff would take protected industrial action from 4pm to 6pm after Star failed to bring a \"reasonable offer\" to the bargaining table.\n\n\"They have been forced into this position because of the failure of Star to recognise the cost-of-living pressures [workers] are under, but also the skills, commitment and loyalty workers have shown to the company during what has been an incredibly tumultuous time,\" she said.\n\n\" One of the most insulting things that is on the table from Star is a proposal to cut penalty rates for people working on a Sunday, and this is completely unacceptable to workers. \"\n\nA spokesperson for The Star said they were \"disappointed\" workers were taking industrial action as it would impact visitors.\n\n\"The Star has been doing everything possible to secure a stable financial future that will provide security for its workers, customers, suppliers, investors, and other stakeholders,\" they said.\n\nThe Star opened at Brisbane's Queen's Wharf last year. (ABC News: Christopher Gillette)\n\nThe spokesperson said The Star had been in \"long and challenging\" negotiations with unions in Brisbane.\n\n\"We have been flexible, diligent, and measured in making an offer that adds wage growth for team members whilst absolutely stretching the financials of the business,\" they said.\n\n\"We value all team members and offer excellent employee benefits.\n\n\"We are disappointed that protected industrial action will be taken — as this action impacts all visitors that arrive to The Star Brisbane seeking memorable hospitality experiences.\"\n\nPremier says 'we just want workers to have a job'\n\nThe future of the Brisbane casino has been in doubt for months with Star Entertainment's shares plummeting in February and the company failing to post its financial results in March.\n\nIt entered into a deal with Hong Kong investors in early March, after months of warnings about its financial future.\n\nHowever, on Monday Hong Kong investors Chow Tai Fook Enterprises and Far East Consortium threatened to walk away from an agreement to buy Star's stake in the Queen's Wharf casino and hotel complex for $53 million.\n\nRenewed financial threat for Star as Brisbane casino deal faces collapse Photo shows An intricate golden star shape above capital letters that spell out \"The Star\" advertising a casino. The Hong Kong investors poised to buy Star out of Brisbane's Queen's Wharf development have threatened to walk away.\n\nThe two firms issued Star with a notice to terminate the deal, which will come into effect on Monday unless it is withdrawn within five business days.\n\nLast week, Star shareholders separately approved a $300 million rescue deal backed by US casino giant Bally's and existing investor Bruce Mathieson.\n\nQueensland Premier David Crisafulli said he was worried about Star's operations and would continue to support staff.\n\n\"Whatever iteration it takes in the future, our only concern is that the doors stay open and that people can go to work during that transition of ownership or whatever that looks like,\" he said.\n\n\"We just want workers to have a job.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/wimbledon-attracts-celebrities-and-royal-family-members/105480216",
        "title": "Olivia Rodrigo and Louis Partridge among famous faces at Wimbledon",
        "publish_date": "Fri, 04 Jul 2025 01:38:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Each English summer, there is just as much star power in the royal box and stands at Wimbledon as there is on Centre Court.\n\nThe royal box, which seats about 80 people at the south end of Centre Court, is reserved for members of the royal family and a host of \"illustrious guests\".\n\nThe only way to get a seat is to secure a personal invitation from the club chair, Deborah Jevans.\n\nGuests are treated to tea, lunch, drinks and extravagant gift bags.\n\nAs you can guess by the name, there is an open invitation to members of the royal family, but actors, musicians, athletes, heads of government and tennis stars also frequent the spot.\n\n\"It's so special in the royal box to have those kind of people in there. It definitely adds a bit of pressure, I guess, if you look up and you kind of recognise [them],\" British tennis player Emma Raducanu said in an interview after her match.\n\n\"That's why I try and stay with my eyes on the court as much as possible.\n\n\"Only after, you kind of look up and take it all in, if they're still there.\"\n\nHere are all the famous faces we have seen during the first week of Wimbledon.\n\nDay one\n\nPrincess Beatrice and her mother Sarah Ferguson watch the first-round match between Carlos Alcaraz and Fabio Fognini. (Reuters: Stephanie Lcocq)\n\nOn day one of the championships, Princess Beatrice, took her seat in the royal box alongside her husband Edoardo Mapelli Mozzi and mother Sarah, Duchess of York, to witness reigning champion Carlos Alcarez play on Centre Court.\n\nAlso in the box were English football legend David Beckham and his mother Sandra.\n\nFootballer David Beckham and his mother Sandra wear matching cream blazers. (Reuters: Stephanie Lecocq)\n\nActor Eddie Redmayne, donned in Wimbledon finery, watched the match with his wife Hannah Bagshawe.\n\nEddie Redmayne and his wife Hannah Bagshawe sat behind the Beckhams in the royal box on day one. (Reuters: Geoff Burke-Imagn)\n\nJason Isaacs looked far more relaxed seated at Centre Court than the character he recently played in the latest season of White Lotus.\n\nHarry Potter and White Lotus actor Jason Isaacs. (Getty Images: Karwai Tang)\n\nUp in the stands, actor Jessica Alba had her 17-year-old daughter, Honor Warren, as her plus one.\n\nActress Jessica Alba and daughter Honor Warren attend the first day of Wimbledon for 2025. (Getty: Karwai Tang)\n\nDay two\n\nThe honour accorded every reigning ladies’ singles champion is that they open Centre Court play on Day two.\n\nRecognisable Australians Russell Crowe, Cate Blanchett and Rebel Wilson all watched the match between Barbora Krejčíková and Alexandra Eala.\n\nRussell Crowe and his partner Britney Theriot watch Wimbledon day two from the royal box. (Geoff Burke-Imagn Images via Reuters)\n\nAustralian actresses Rebel Wilson (centre) and Cate Blanchett (right) along with Wilson's wife Ramona Agruma attend a first-round match. (Reuters: Toby Melville)\n\nDay three\n\nIt was a stacked royal box for Carlos Alcaraz and Oliver Tarvet's second-round match on day three.\n\nOlivia Rodrigo and Lewis Partridge. (Getty Images: Karwai Tang)\n\nFresh off her appearance at Glastonbury, singer Olivia Rodrigo took her seat in the royal box in a strawberries-and-cream-coloured dress with her partner, actor Louis Partridge.\n\nSat next to Rodrigo was WWE wrestler-turned-actor John Cena and his wife Shay Shariatzadeh.\n\nWrestler turned actor John Cena and his wife Shay Shariatzadeh match in baby blue outfits as they watch the men's round-two match. (Reuters: Isabel Infantes)\n\nIn front of them was Olympic diver Tom Daley.\n\nOlympic diver Tom Daley takes his seat in the royal box on Centre Court.\n\nMusician Dave Grohl, actor Priyanka Chopra Jonas and Nick Jonas were also spotted.\n\nMusician Dave Grohl with his wife actress Jordyn Blum. (Reuters: Isabel Infantes)\n\nPriyanka Chopra Jonas and husband Nick Jonas attend day three of Wimbledon. (Getty Images: Karwai Tang)\n\nMamma Mia actor Dominic Cooper as well as actress Leslie Mann and her producer husband Judd Apatow were also in attendance.\n\nActor Dominic Cooper watches the second-round match between Aryna Sabalenka and Mari Bouzzkova. (Reuters: Isabel Infantes )\n\nActress Leslie Mann and her husband, director and producer, Judd Apatow join the fans. (Reuters: Isabel Infantes)\n\nDay Four\n\nBritish television presenter and author Bear Grylls swapped his usual survival gear for a suit and sat in the royal box on day four at Centre Court.\n\nBear Grylls and his wife Shara enjoy the royal box during the match between Novak Djokovic and Daniel Evans. (Reuters: Andrew Couldridge)\n\nActress Celia Imrie took her seat in the front row.\n\nBritish actress Celia Imrie watched the day-four match from the royal box. (Getty Images: Karwai Tang)\n\nUp in the stands, Eve Hewson, an actress and daughter to US frontman Bono, chatted to television presenter Dermot O'Leary.\n\nActress Eve Hewson chats with television presenter Dermot O'Leary watch a match on Wednesday. (Getty images: Karwai Tang)\n\nFormer Formula 1 star Daniel Ricciardo and comedian Jack Whitehall were also spotted.\n\nFormer Formula 1 driver Daniel Riccardo celebrated his 36th birthday with his parents at Wimbledon. (Getty Images: Karwai Tang)\n\nComedian Jack Whitehall and English footballer Anthony Gordon were spotted in the stands. (Getty Images: Karwai Tang)\n\nWith nine days of the tournament still to come, there is no doubt plenty more royal and famous faces will be spotted in the box and the stands.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/outback-artists-slam-change-to-regional-nsw-art-gallery-funding/105485252",
        "title": "Outback artists slam regional funding shortfall",
        "publish_date": "Fri, 04 Jul 2025 01:21:17 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Eighteen regional art galleries in New South Wales are facing an uncertain future after missing out on four years' worth of government funding.\n\nBroken Hill City Art Gallery, the oldest regional gallery in the state, is among those that have been overlooked.\n\nThe gallery is run and supported by the Broken Hill City Council, but it also relies on annual funding from Create NSW's Arts and Cultural Funding Program (ACFP).\n\nBroken Hill's gallery is the oldest in regional New South Wales. (ABC Broken Hill: Oliver Brown)\n\nCouncil general manager Jay Nankivell said the gallery had received $100,000 per year in the past through the program and that it was concerning to miss out on the latest round.\n\nGallery advisory committee member and artist Kelly Leonard moved to Broken Hill four years ago to be a part of the Far West's rich art scene.\n\n\"The art gallery really is a centrepiece, a location where we can connect, develop opportunities for each other,\" she said.\n\nBroken Hill has a rich artistic history. (Supplied: Priscilla McIntosh)\n\nMs Leonard said she would need to travel interstate or to Sydney for workshops and professional development if it were not for the gallery.\n\n\"We're only just recovering from the COVID years out here, and to go through something like this, it's extremely frustrating,\" she said.\n\nArtist Wendy Martin said any funding cut would be a major setback.\n\n\"Art plays a major part in the tourism industry and attracts a huge amount of people to our city,\" she said.\n\n\"Lots of artists have been given a career start by having their work displayed in the gallery, including myself, and I have been painting and exhibiting in Broken Hill now for the last 50 years.\"\n\nTracey Callinan says art galleries and communities will suffer if the funding is not restored. (Supplied: RANSW)\n\nNot enough to go around\n\nWagga Wagga, Orange and Armidale were among the other regional centres to miss out on the four-year funding, which Regional Arts NSW chief executive Tracey Callinan said was received by only three galleries.\n\n\"We're now really concerned that those regional galleries across the state are going to struggle to produce good work,\" she said.\n\n\" They'll just put the existing collections on the walls and do as little as possible, because you can't do it with no money. \"\n\nKelly Leonard says the funding shortfall shows a lack of understanding of the importance of art. (ABC Broken Hill: Oliver Brown)\n\nThe funding is offered in two, four and eight-year cycles and Broken Hill council hopes to be named as a recipient of two years' worth of funding in September.\n\n\"The gallery works at least two years ahead on planning for exhibitions, so it really needs that long-term funding support,\" Ms Leonard said.\n\nThe ABC contacted NSW Arts Minister John Graham for comment and received a statement from a Create NSW spokesperson who said the ACFP was highly competitive.\n\n\"The NSW government recognises the significant contributions made by regional art galleries to the arts and culture ecology across regional NSW,\" they said.\n\n\"The full funding profile of support for regional galleries will be available following the assessment of the two-year funding program.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/farmers-adopt-new-technologies-as-labour-costs-rise/105489146",
        "title": "'Work smarter not harder' farmers' savvy practices fight rising labour costs",
        "publish_date": "Fri, 04 Jul 2025 01:10:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "The rapid development of artificial intelligence may have some worried about losing their jobs, but farmers embracing the technology say it could be the answer to their workforce troubles.\n\nAs the minimum wage rises and finding workers gets harder, they are turning to automation to keep costs down while growing the same amount of food.\n\nWhile the creative solutions have the potential to dramatically improve profitability, grower groups say getting it wrong can be an expensive mistake.\n\nTime is money\n\nPreparing the ground and laying irrigation for a cherry tomato crop used to take Jason Gatt's company Sunripe a week.\n\nThey can now prepare 32 hectares in just over two days using autonomous tractors fitted and guided by GPS navigation to create precise rows to exact measurements.\n\n\"We're investing where we think it's going to pay for itself over time and we're seeing the result as it goes,\" he said.\n\n\" Technology is getting better every day. You just have to hunt for it and be willing to try. \"\n\nGPS-guided tractors are gaining popularity on farms as growers streamline operations. (ABC News: Tayla Larsen)\n\nMr Gatt started using the technology 15 years ago and now has more than 20 GPS tractors across his properties.\n\n\"The next step we'll be going to is instead of doing a single row we'll be going to three-row machines,\" he said.\n\n\"Anything we can do to get labour down or get it more efficient we're definitely working towards.\n\n\"People don't realise that it's not just that wage that you're getting, it's also your superannuation and all the other expenses on top of that.\"\n\nThe quiet crisis in Australian farming Photo shows Photo of a man crouching down on a field. Australian farm productivity is in decline, prompting calls for policy reform as experts warn high yields are masking deeper issues.\n\nAround the country more growers like Mr Gatt are investing heavily up-front, exploring automation and simplifying old processes to remain viable.\n\nIn the latest benchmarking report from Level Up Hort — a program funded by grower-owned research corporation Hort Innovation to improve business performance — workforce efficiency was a critical factor in overall profitability.\n\n\"There's been a lot of discussion around labour, increased costs of labour and challenges with securing and retaining labour,\" said project leader Steff Carstairs.\n\n\"In general, labour continues to be a pain point for horticultural businesses, and a major cost.\n\n\"Those who seem to be doing better have greater efficiencies around their labour management.\"\n\nJason Gatt says upgrading farm machinery and technology has cut labour costs. (ABC News: Tayla Larsen)\n\nThe report, which represents businesses producing 5,596 hectares of vegetables and onions across six states, showed the most profitable growers spent the equivalent of about a third of their income on labour.\n\nFor the least profitable farms that figure rose to 51 per cent.\n\nRichard Shannon, the executive officer of the National Farmers Federation's Horticulture Council, said over the past five years business costs had gone up significantly, but grower returns had not.\n\n\"That's across the board — all other inputs have gone up at the same time,\" he said.\n\n\"That's led to a big squeeze across the industry and everyone's feeling the pinch.\"\n\nNot shying away from new solutions\n\nThe latest contribution to the squeeze is the minimum wage which rose by 3.5 per cent from $24.10 to $24.95 per hour on July 1.\n\nRather than an hourly rate, workers covered by the Horticulture Award can be paid a piece rate based on how much they plant, pick, sort and pack fruit and vegetables.\n\nThey are also guaranteed to receive at least the national minimum wage.\n\nFair Work Ombudsman Anna Booth said that meant all workers would be paid more.\n\n\"We obviously apply that to all the awards, and in particular the horticulture awards, so you can see how that works in with the piece rate,\" she said.\n\nMr Shannon urged growers who were looking for creative solutions to reduce their wage bill to do their homework and get advice before making an expensive decision.\n\n\"Ideally visiting other farms, getting on an industry tour, whether that's domestic or overseas, just to get a better idea of what their options are,\" he said.\n\n\"I guess the old adage is to be working more on your business rather than in your business.\n\n\" As business owners and people who are in leadership positions the tendency is to get stuck dealing with day-to-day evolving issues rather than taking that longer look into the medium and longer term, and thinking more strategically. \"\n\nRay Fulcher uses hydroponics to grow figs in a temperature controlled greenhouse. (ABC News: Tayla Larsen)\n\nWhen Bundaberg producer Ray Fulcher transitioned from small crops to custard apples and figs it forced him to take a more strategic look at his growing methods.\n\nIt was a long process to determine the optimal conditions for his figs, which are grown in a greenhouse previously used for roses.\n\n\"It's all temperature controlled and humidity controlled to a degree,\" he said.\n\n\"The irrigation is all hydroponic and it makes life very simple for a grower … but it's very expensive.\n\n\"Those greenhouses when I put them in cost about $2 million and most average people can't afford that.\"\n\nRay Fulcher can control the conditions of his fig greenhouse with the press of a button. (ABC News: Tayla Larsen)\n\nMr Fulcher adapted his workforce too, moving to labour hire contractors to get in a certain number of workers at specific times in the season.\n\n\"We can't find enough good workers,\" he said.\n\n\"To be honest probably young people don't really like that environment that we're in.\n\n\"In winter it's very comfortable working conditions, but in summer it's horrendous.\"\n\nMr Fulcher said growers had to accept labour costs were a part of doing business and should focus on optimising the workforce.\n\n\"You want to do it? You've got to pay the extra cost,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/state-of-origin-comebacks-papalii-langer-fittler-morris/105491044",
        "title": "Winners, losers and legends: A short history of State of Origin comebacks",
        "publish_date": "Fri, 04 Jul 2025 01:07:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Josh Papalii will play his final State of Origin match on Wednesday night as he returns from a three-year representative retirement to try to help lead Queensland to victory in the decider.\n\nPapalii was already a seminal figure in Maroons history and his comeback ensures him a unique piece of history — unless Daly Cherry-Evans plays on and earns a recall next year, Papalii, who made his interstate debut in 2013, will be the last active player from Queensland's legendary eight in a row Origin dynasty.\n\nABC Sport will have live blog coverage of the State of Origin series.\n\nCoach Billy Slater will be looking for inspiration, leadership and muscle up front from the veteran front-rower, who is the latest in a long tradition of Origin stars to return from representative retirement to the game's toughest arena.\n\nComing back into the crucible of representative football is no easy thing, even accounting for Papalii's strong recent form with the Raiders.\n\nHere's how each Origin returnee has fared upon their comeback to interstate football.\n\nAllan Langer — 2001\n\nLanger's return to State of Origin is the stuff of Queensland legend. (AAP)\n\nThe gold standard of Origin comebacks, Langer's selection for the 2001 decider while playing for English club Warrington three years after his last appearance in maroon has become the stuff of legend.\n\nAt 35, Langer's best years were supposed to be well behind him and there were contingencies in place should he turn down the chance at a recall — Maroons coach Wayne Bennett had also sounded out former Parramatta and Canterbury five-eighth Jason Smith, who was also playing in England at the time.\n\nBut Langer opted in and inspired Queensland to a famous 40-14 victory at QEII Stadium, scoring a try on one of his state's most famous nights.\n\nIt kicked off a late-career renaissance for Langer, who returned to the Broncos in 2002 and played all three matches for Queensland again that season.\n\nJust a few weeks shy of his 36th birthday, he earned man of the match honours in that year's drawn Origin decider, which ensured the Maroons would retain the shield.\n\nBrad Fittler — 2004\n\nBrad Fittler scored the final try in the 2004 Origin decider, retiring from representative football with a series win for NSW. (AAP: Mick Tsikas)\n\nLanger's Origin return spoiled the party for New South Wales five-eighth and captain Brad Fittler, who called time on his own representative career after the 2001 decider.\n\nThe Roosters' mainstay continued his excellent form in the seasons to come and in 2004, with the Blues suffering an injury crisis in the halves heading into Game II, Fittler was asked to return by coach Phil Gould and accepted the chance for one more shot at Origin glory.\n\nFittler's return ended in defeat, courtesy of Billy Slater's miracle chip and chase try, but the champion five-eighth returned for the decider in Sydney.\n\nAt 32, and 14 years after he became the youngest ever NSW State of Origin player to that point, Fittler enjoyed a dream farewell by scoring the final try of a 36-14 New South Wales rout to finally go out on a high.\n\nJosh Morris — 2019\n\nMorris made a belated comeback to Origin after three years in retirement. (AAP: Glenn Hunt )\n\nA stone-cold New South Wales legend for his battles with Greg Inglis and his efforts fighting through a serious knee injury in the 2014 series opener, Morris had a low-key representative retirement following the 2016 series.\n\nThree years later, with Brad Fittler short of options at right centre for Game I, he recalled the then 32-year-old Cronulla flyer for his 15th State of Origin appearance.\n\nMorris acquitted himself well, scoring the opening try of the night at Lang Park, but was dumped for Tom Trbojevic following New South Wales's 18-14 loss and never played for the Blues again.\n\nMatt Sing — 2005\n\nSing's Origin retirement lasted just a few months before his return. (AAP: Tony Phillips )\n\nOne of the most underrated Origin players of his time, Sing holds the record for the shortest-lived representative retirement of modern times.\n\nIn 2004, nine years after making his Test and Origin debuts, Sing hung up the boots for Queensland and Australia in an effort to prolong his club career and spend more time with family.\n\nHowever, after a change of heart, Sing made himself available for the 2005 Anzac Test and subsequent Origin series. He played all three matches for the Maroons but gave it up for good following Queensland's loss in the decider.\n\nBraz Izzard — 1991\n\nWhy Queensland's unlikely Origin debutant was always meant to make it Photo shows A man celebrates after scoring a try in an NRL match After putting the journey into journeyman, Gehamat Shibasaki will become one of Queensland's most unlikely Origin debutants and his long road to the decider has taken him right back to where he started.\n\nIzzard's return to State of Origin isn't quite a comeback from representative retirement, but the sheer wait between appearances earns the Penrith stalwart a special mention.\n\nAfter playing all three games for New South Wales in the 1982 series, where he scored two tries, Izzard had to wait another nine years for his second Blues call-up, which came in the 1991 decider.\n\nTo this day, Izzard holds the record for longest gap between Origin appearances, a mark that is unlikely to ever be broken.\n\nCameron Smith and Andrew Johns — the near misses\n\nTwo of the greatest players in their respective states' histories retired from rep football a few years before hanging up the boots, but both came perilously close to backflipping on the decision.\n\nFor Johns, who made a magical return to the Blue jersey in 2005 after missing almost the entire prior 12 months through injury, it came in 2006 when he seriously considered returning for that year's decider before opting out. Queensland went on to secure a dramatic series win that propelled them to their famous eight-in-a-row dynasty.\n\nAs for Smith, who was sounded out more than once after he played his final game for Queensland in 2017, the closest he ever came seems to be 2019 when he was in conversation with Maroons coach Kevin Walters but ultimately decided against returning.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/andy-lee-do-not-watch-this-show-hard-project/105380206",
        "title": "Andy Lee's desperate plea: Do Not Watch This Show",
        "publish_date": "Fri, 04 Jul 2025 00:40:20 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Andy Lee is no stranger to the media sphere, with top-rating projects across TV, radio, podcasting and writing.\n\nBut when it came to turning his best-selling kids' book into a TV show for the ABC, it was a process unlike anything he had experienced.\n\nSo, what made it so challenging?\n\n\"Long, it's so long [to make]!\" Lee said, laughing.\n\n\"I went into a sound booth some time in March last year and, finally, people can see what happened with it when [the show airs] in July this year.\n\n\"To give you perspective, the first book took 40 minutes [to write] on a flight from Sydney to Melbourne.\n\n\"[The show] has been quite the process, but I've loved it, I've absolutely loved it.\"\n\nFor anyone new to the Do Not Open This Book series, Lee wrote and released the first book for his nephew, George, as a birthday present in 2016.\n\nLee created Wizz and the original book in 2016 for his nephew.\n\nHe's since written 10 more, with the next book set to be released before the end of the year.\n\nThe TV adaptation, Do Not Watch This Show, sees the book's main character, a blue monster named Wizz (voiced by Lee), brought to life.\n\nHe takes viewers on fantastical journeys with life lessons along the way, all while imploring them not to watch any further.\n\nWith him on screen are his friends Douglas (also voiced by Lee), Tortoise (Denise Scott), Lime (Joel Creasey), Kiwi (Kura Forrester) and Goblin (Dave Hughes).\n\nJoining Wizz on his adventures is his cast of mentors, friends and semi-foe, Goblin.\n\nAs well as the main cast, expect cameos from other notable Aussie voices, including:\n\nHamish Blake\n\nCarrie Bickmore\n\nTony Armstrong\n\nChrissie Swan\n\nGlenn Robbins\n\nMick Molloy\n\n\"David Hughes being Goblin I find the most fun because I think Hughesy's natural voice does sound like a goblin,\" Lee joked.\n\n\"It was funny when he came in to do it, he was like 'So mate what voice do you want?' and I was like 'Oh man, I want your voice. You know, I didn't hire you because you're an amazing character actor — all due respect — I want Hughesy'.\n\n\"I love the idea of this show [going] international, that Hughesy will be the voice of the goblin next door that's constantly feuding with Wizz.\"\n\nLoading YouTube content\n\nLee's 'big learning'\n\nLee said part of the extra time it took to make the show was crafting hand-drawn expressions or movements for the characters.\n\nWhile the animation used 3D technology to produce Wizz and friends' basic movements, any adjustments Lee or the team wanted were made by hand by illustrator Heath McKenzie.\n\n\"The amount of drawings has been quite incredible,\" Lee said.\n\n\"To give you an idea of just Wizz's expressions, I think we ended up with 60 mouth shapes.\"\n\nThe opportunities to tweak or change the animation were \"endless\". (Supplied)\n\nRetaining creative control was a priority for Lee, and was part of the reason talks with a Hollywood studio for the show didn't come to fruition.\n\nBut Lee himself says being so deeply involved in the show's creation was both a blessing and a curse.\n\n\"The strange thing about making an animation versus a live action is we used to go out and film something and we'd get back into the edit and I'd go 'Oh do we have a shot of that? Oh no, we don't, OK well that's all it is,'\" he said.\n\n\"Now I sit in the edit and go '[It] would've been good if he kind of fell from the ceiling here' and the editor goes 'OK, well let's just draw that in.'\n\n\"The problem is it's endless, you could keep changing things.\n\n\"That was my big learning: 'OK, there has to be a point where you can't creatively keep changing it because otherwise this thing will never get finished.'\"\n\nLuxury of no nerves\n\nGiven the effort it's taken to bring Wizz to life on the screen, is Lee nervous about sharing the show with the world?\n\n\"Not until you said that,\" he joked.\n\n\"No, not really. I suppose I've had the benefit of making them and you watch them back and ... watch every frame and ponder it.\n\n\" At the end of that process, I tend to just be very excited for people to see it. \"\n\nWhile Lee says he's not nervous for the show's release, he admits his measure of success has \"never been a numbers\" game.\n\n\"As I get slightly older — gosh that's an old person thing to say — it's certainly more about how much fun you have,\" he said.\n\n\"It's so hard when you release something, you never know how it's going to go and there's so many things that can dictate how something resonates.\n\n\"It's important not to hang too much on the results because that would be a pretty nerve-wracking game.\"\n\nStream Do Not Watch This Show free on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/khaled-sabsabi-venice-biennale-creative-australia-controversy/105490236",
        "title": "Creative Australia's apology 'does not actually clarify' why it dumped artist",
        "publish_date": "Fri, 04 Jul 2025 00:03:19 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "And so we return to where we began almost six months ago.\n\nFollowing an external review and months of outrage in the arts community, the artist Khaled Sabsabi and curator Michael Dagostino are once again Australia's representatives to the 2026 Venice Biennale, after Creative Australia's latest backflip.\n\nThe February decision to remove the pair — a week after their Biennale selection was celebrated — led to Creative Australia resignations, damaged the funding body's relationship with the arts sector, and sullied the public reputation of an artist.\n\nKhaled Sabsabi reinstated for Venice Biennale Photo shows A man standing in front of a blue painting smiles gently After controversially and suddenly withdrawing Khaled Sabsabi and Michael Dagostino from the 2026 Venice Biennale, Creative Australia has announced it has reversed its decision.\n\nSabsabi and Dagostino said in a statement that having their Biennale selection reinstated \"offers a sense of resolution and allows us to move forward with optimism and hope after a period of significant personal and collective hardship\".\n\nAnd while acting Creative Australia chair Wesley Enoch praised the board's \"very big heart\" for engaging in a review of the decision to scrap Sabsabi \"with integrity and thoughtfulness and mov[ing] forward\", the impacts of the month-long arts scandal will not immediately be forgotten.\n\nNor does Sabsabi's reinstatement mean that the many questions surrounding his Biennale saga are now answered.\n\n\"The [external] review, for all the detail, does not actually clarify the decision-to-cancel process,\" Adelaide Writers Week director and senior arts commentator Louise Adler says.\n\n\"What we do know is that the decision to cancel [Sabsabi and Dagostino] was a reaction to political pressure.\"\n\n\"Though we will be stronger as a sector because of [Creative Australia's review], I know that it's come at a personal cost. Not just to them, but to a whole range of people in the art sector,\" Enoch says. (Supplied: Sydney Festival)\n\nWhy the snap decision?\n\nAfter concerns were raised in February in parliament by senator Claire Chandler and in The Australian newspaper about two of Sabsabi's earlier artworks, Creative Australia's board scheduled an emergency meeting and came to a unanimous decision to withdraw the Venice Biennale commission.\n\nAt a later Senate Estimates, when senator Sarah Hanson-Young asked Creative Australia CEO Adrian Collette why legal advice had not been sought prior to the decision being made, it led to the following exchange:\n\nAdrian Collette — We didn't have time. Sarah Hanson-Young — You didn't have time? AC — No, we didn't have time. SHY — According to who? AC — According to us. We had to make that decision very quickly.\n\nEsther Anatolitis, the editor of Meanjin and former executive director of the National Association for the Visual Arts (NAVA), says it's still unclear why that was the case.\n\n\"The issue really is, what was the hurry? And why did they perceive that as a crisis, when all that happened was that there was one critical and factually incorrect attack on the work which, as Blackhall and Pearl's report says, was capable of being defended by Creative Australia.\"\n\nReinstating Sabsabi and Dagostino \"was the only possible decision\", Anatolitis says. \"It's such an important step for rebuilding all of the trust and confidence that's needed now.\" (Supplied: Sarah Walker)\n\nInstead, the board's decision to drop Sabsabi sparked a massive backlash from the arts community, and a review was commissioned to examine the process, but not the merit, of the decisions that were made.\n\nThe review's report states that Creative Australia was not \"appropriately prepared\" for \"what, inevitably, was going to be a controversial decision\".\n\nThe report notes that the process of selecting Sabsabi and Dagostino was generally the same as it had been for 2024's representative, Archie Moore, who won the Golden Lion for his work at the Biennale.\n\nBut \"the external social and political context, particularly in late January-early February 2025, was profoundly different.\"\n\nIt wasn't Sabsabi's proposal for the Biennale that was contentious, though.\n\nDropped artist Sabsabi speaks out Photo shows Khaled Sabsabi with serious expression looks into camera, which is very close to his face. He has stubble on his chin, cheeks. Artist Khaled Sabsabi has said the decades-old artworks that triggered Creative Australia's decision to dump him have been \"grossly misrepresented\".\n\nInstead, the report notes: \"The source of potential controversy was seen to lie in the fact of selecting any artist with heritage connected to the Middle East at a time when conflict in that region was so emotive and polarising.\"\n\nAdler says it beggars belief that this climate was not sufficiently considered by Creative Australia.\n\n\"There's not an arts organisation in the country that hasn't had to provide their increasingly risk-averse boards with risk assessments.\n\n\"If Creative Australia was blindsided by the complexities of inviting Sabsabi, it suggests either a worrying level of naivety or a political judgement that a Brown artist from the western suburbs will tick a whole lot of boxes.\n\n\" Either rationale suggests that Creative Australia is not fit for purpose. \"\n\nLouise Adler has been vocal in calling out what is, in her view, a prevailing failure of cultural leaders to manage risk. (Supplied: Adelaide Festival)\n\nLattouf parallel\n\nCreative Australia's actions don't exist in a vacuum.\n\nA court found this month that the ABC had unfairly terminated Antoinette Lattouf because of her political opinion. Justice Darryl Rangiah found external pressure from \"pro-Israel lobbyists\" had played a role in the ABC's decision. The ABC's new managing director, Hugh Marks, has since conceded the ABC acted out of turn.\n\nAnatolitis argues that the Lattouf matter is \"a parallel example of a privileged bypassing of a normal rigorous complaints procedure … knowing that it would fail … in order to achieve the outcome that the vexatious complainants intended\".\n\nThe ABC's own goal should be a moment of reflection Photo shows A woman is seen from the shoulders up standing in front of a flag The ABC tried to dodge complaints and attention by firing Antoinette Lattouf. Ironically the broadcaster earned more scrutiny.\n\nAdler also draws a link between the two events.\n\n\"As with the suppression of the names of the \"Lawyers for Israel\" who campaigned for Lattouf's sacking, those who briefed Senator Chandler will probably never be outed,\" Adler says.\n\nA knock-on effect?\n\nShortly after Creative Australia announced it had dropped Sabsabi, Monash University decided to postpone an exhibition curated by Stolon Press at their gallery, MUMA, featuring artwork by Sabsabi.\n\n\"There's no question that Creative Australia's decision to cancel the invitation to Michael and to Khaled influenced Monash's decision to postpone the Stolon Press exhibition,\" Rebecca Coates, the director of MUMA, says.\n\n\"We were dealing with a very singular interpretation of two still images from a very complex moving image artwork that were being used … as a means of progressing an argument.\n\n\" That to me says that this is culture wars, and our art and artists are being used as fuel to promote and promulgate a particular position. \"\n\nIn May, Monash University also backflipped on its decision to \"indefinitely postpone\" its exhibition featuring Sabsabi, and in June the exhibition opened.\n\nCoates believes that has had an influence on the national arts funding body.\n\n\"I think Monash's decision to subsequently proceed with the Stolon Press exhibition, which included Khaled's contribution as a collaborator, was inevitably part of the context in which Creative Australia decided to proceed with Khaled and Michael's representation at Venice,\" she says.\n\nCoates believes Monash University's decision to go ahead with an exhibition featuring Sabsabi's work had national influence. (Supplied)\n\nThe need to be 'more rigorous'\n\nMany within the arts have celebrated Sabsabi and Dagostino's reinstatement.\n\nHowever, opposition to the selection remains. Julian Leeser, shadow minister for the arts, told ABC Radio National Breakfast: \"I think Creative Australia's made the wrong decision. The representative of Australia on the world stage should reflect our values and to reinstate this artist as our representative at Biennale and to give them taxpayers' funds I think flies in the face of those values.\n\n\"Creative Australia has responsibilities to the taxpayer and the broader Australian community. I believe those issues continue to remain and that I believe Creative Australia should not have unmade their decision that they previously made to withdraw Mr Sabsabi from this exhibition at this time,\" he said.\n\nCoates interprets the decision differently; she see it as \"a signal of renewal, growth and connectedness and, I believe, a shared future\".\n\nEnoch has apologised to Sabsabi and Agostino for \"the hurt and pain\" and \"personal cost\" of Creative Australia's decisions. And he acknowledged that risk must, in future, be better considered.\n\n\"Some of these issues are coming up at such a rapid pace that the systems that were relevant to us even two years ago are no longer fit for purpose. And we, as a sector, have to be engaged in much more rigorous conversations around the messaging, the risk assessment, and how we go forward.\"\n\nFor his part, Sabsabi told Nine newspapers in April: \"I'm an artist, not a politician.\n\n\"And my work for over 35 years is about finding ways to converse through complexity.\"\n\nHe may now be in a position to hold that conversation a little more freely.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/shark-bay-seniors-social-housing-solutions-/105487216",
        "title": "Seniors who call Shark Bay home trade caravans for a house",
        "publish_date": "Thu, 03 Jul 2025 23:39:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Nearly everywhere in Australia is grappling with a lack of affordable housing.\n\nThe small West Australian coastal hamlet of Shark Bay, with fewer than 900 residents, is no different.\n\nBronwyn Hook has lived in the area for 11 years in a caravan.\n\n\"There was nowhere else to live … I couldn't afford rent,\" she said.\n\nSo when the state government and Shire of Shark Bay finished construction of 12 social homes for people over 60, Ms Hook could not contain her excitement.\n\n\"I've got a toilet … this shower is more than twice the size of [mine],\" Ms Hook said.\n\n\"I'll be able to stretch my arms and move without hitting the walls.\n\n\"Being able to afford it … it means a lot to the older folks. They don't have to leave town.\"\n\nBronwyn Hook is overjoyed at the idea of moving into her own space. (ABC Pilbara: Lina Elsaadi)\n\nDenham is the main town in the shire, 830 kilometres north of Perth.\n\nAt the time of publication, there were no homes for sale or rent in Denham on any real estate websites.\n\nNew homes 'not enough'\n\nThe 12 homes were constructed and designed for people aged 60 and over with a connection to the town.\n\nThe 12 new properties all sit in the same area, promoting a sense of community. (ABC Pilbara: Lina Elsaadi)\n\nShire of Shark Bay president Cheryl Cowell said the new homes freed up some places for private rentals, but they were not enough to solve the issue.\n\n\"We've certainly got no shortage of new applicants for the remaining units,\" she said.\n\nThe primary reasons people left town were a lack of housing, medical services and education.\n\n\"We really lack medical facilities … we only have a doctor, if we're lucky, one day a week,\" Cr Cowell said.\n\nCheryl Cowell says the shire lacks services. (ABC Pilbara: Lina Elsaadi)\n\nGrowing the town\n\nGrowing the town of Denham has been a balancing act, with a lack of services slowing growth as well as a lack of properties to attract doctors and teachers.\n\nCr Cowell said after 20 years of no new Government Regional Officer Housing (GROH) houses in Denham, they would see six constructed.\n\n\"We'll be looking at more GROH housing if we can get the government funding,\" she said.\n\n\"We were way behind the eight ball.\n\n\"That should open up a great chunk of more rentals for people wanting to come up here.\"\n\nAnother challenge for the shire was being able to get builders to come and stay.\n\n\"Builders are pretty short on the ground. Tradies are so hard to keep,\" Cr Cowell said.\n\nAnd with tourism the biggest industry for the area, the shire had no plans to crack down on holiday home rentals.\n\n\"I'd say probably at least half, maybe a bit more of the people actually own their own property here,\" Cr Cowell said.\n\nShark Bay attracts thousands of people to tourism attractions like the Dolphin Experience in Monkey Mia. (ABC Pilbara: Lina Elsaadi)\n\n\"There are the elements of wanting to move here when they retire, so they're building and renting out in the meantime.\n\n\"We're more than happy to carry on in that regard because we don't really have any other major industries.\"\n\nMs Hook said for many locals, the balancing act had not been reached.\n\n\"There are a lot of houses that are accommodation for tourists,\" she said.\n\n\"It would be good if some of them were more for people who were living here, like families that need accommodation if they're working here.\"\n\nThe homes have been designed for seniors, with grab rails in the shower and toilet. (ABC Pilbara: Lina Elsaadi)\n\nNever leaving\n\nLong-time resident Gloria Whitby also just moved into one of the new social houses.\n\n\"[It's] a little sense of community with all the people in the same place, same phase of life,\" she said.\n\nMs Whitby wanted to stay in Shark Bay for the rest of her life but wanted to see the education shortages addressed so her family could stay as well.\n\n\"That's the only thing I'd like to see. A nice big high school here,\" she said.\n\nGloria Whitby has lived in Shark Bay for more than 40 years. (ABC Pilbara: Lina Elsaadi)\n\nHer granddaughter, Brittany, seriously considered leaving the area because she could not get a rental and she wanted her children to access better education.\n\n\"We did have to almost leave town because it took us a while to get a rental,\" Brittany said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/tasmanian-community-service-providers-on-election-cost-of-living/105457272",
        "title": "Worries Tasmania's cost-of-living policies are just 'tinkering around the edges'",
        "publish_date": "Thu, 03 Jul 2025 23:22:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Bills are going up and wages are sluggish. Money just won't stretch as far as it used to and it's leaving many Tasmanians going without.\n\nThe growing cost-of-living issue in Tasmania has been described by some as a crisis.\n\nNow it's a staple of Tasmania's snap election, with both major parties jostling to prove they are the right ones to ease living costs in the state.\n\nBut there is no magic wand to fix a situation that has been steadily growing worse for years.\n\nAccording to the Tasmanian Council of Social Service (TasCOSS), 120,000 Tasmanians are living below the poverty line, meaning they don't have the resources to meet basic needs.\n\nAccess to housing remains a crucial political issue. (ABC News: Maren Preuss)\n\nOne in five — or 50,000 — Tasmanians are experiencing energy poverty, meaning they can't pay their electricity bills so they ration energy use, go into debt or make cuts to other essentials.\n\nAnd more than 5,000 people are on the social housing waitlist.\n\nThe ABC spoke to several community service organisations about what they wanted to see parties doing to address cost-of-living issues this election.\n\nFundamental shift needed\n\nAs the manager of Goodwood Community Centre, a Neighbourhood House in Hobart, Natham Reynolds is at the coalface.\n\nCan the Albanese government fix the economy? Photo shows Prime Minister Anthony Albanese in front of a crowd after the 2025 federal election The election may be over, but cost of living is still front of mind for Australians. These graphs show how we got here and what the new government has to do to rein in rising prices.\n\n\"Our numbers coming through the door are really huge at the moment,\" Mr Reynolds said.\n\n\"Each week we have more than 1,000 people.\n\n\"We've just had a Christmas in July lunch where we had 70 people here.\"\n\nMr Reynolds has been the manager for more than two years. He says the demand for services increases week on week.\n\nHe also said the work is difficult and challenging but worth it.\n\n\"It really takes a bit of a toll on you,\" he said.\n\n\"You like to leave your work at home, but you're always thinking when you go home, 'Is there any more I can do or where else can we help?'\n\n\"You find you're always trying to think of new ideas or different support systems to help people, even once you finish work.\"\n\nSimone Zell says campaign promises should address the needs of vulnerable Tasmanians. (ABC News: Luke Bowden)\n\nSimone Zell is the chief executive of Neighbourhood Houses Tasmania. She said there needed to be a fundamental shift in how we address cost of living.\n\n\"So that we have priorities that are about supporting people to have access to the basics,\" Ms Zell said.\n\n\" Really making sure we have affordable food and available housing so we can make sure that families are not having to make those really difficult choices about either buying food or paying for their energy. \"\n\nMs Zell said access to earlier intervention when it comes to healthcare was crucial.\n\n\"We need to make sure that people can have access to healthcare where they are so they are not in those more crisis situations and they are not presenting at hospitals,\" she said.\n\nServices funded properly\n\nPromise tracker: What the parties are saying this election Photo shows Thumbnail image for Tasmania state election 2025 promise tracker article. As Tasmanians prepare for a July 19 vote, we keep track of each party's election promises on everything from health and housing, to the stadium.\n\nThe Salvation Army's Amelia Natoli said the issue for many in the community sector was ensuring adequate funding for existing programs.\n\n\"For many of our programs we're on the same level of funding that we might have got five or 10 years ago, and everyone's aware that the cost of doing anything has gone up,\" Ms Natoli said.\n\n\"For us, we're actually not able to deliver the same level of service for the same price as we could five or 10 years ago.\n\n\" Wages and the like have increased and it's making it really difficult for us to continue to provide support to the community as we once have. \"\n\nShe said without increased funding the organisation could not \"keep the lights on\" at its family and domestic violence refuge or at its alcohol and other drugs space.\n\n\"But until we can actually just keep the current services running at the level that they need, it's really hard for us as an organisation to ask, 'Can we have further funding to be able to add another six beds at our family violence refuge?' Because we just don't know that we'll be able to staff it and keep everything running,\" Ms Natoli said.\n\nFood security resourcing\n\nLoaves and Fishes chief executive Andrew Hillier said one-in-five Tasmanians were facing food insecurity, and innovative solutions were needed.\n\nHe said he wanted to see the parties embrace a food-systems approach, bringing together different organisations to deal with issues.\n\n\"From agriculture to hospitality, retail, transport, logistics, all the elements that are involved in making sure that food gets to Tasmanians' tables,\" he said.\n\n\"Organisations like Eat Well Tas that are focused on education, Neighbourhood Houses that distribute food and … farmers who grow and in some cases their food gets rejected.\"\n\nAndrew Hillier says frontline services need continued support. (ABC News: Monte Bovill)\n\nMr Hillier said the Liberal government held a roundtable before the election was called, but it needed to go beyond facilitating discussions — he said the ideas needed resources.\n\n\"[We want to make] sure we've got markets and ways of buying food, creating alternative markets for local, small and medium farmers and producers, so that food can be available at lower cost.\"\n\nHe also said it was essential to support the grassroots community organisations on the frontline delivering support.\n\nWhat are the major parties offering?\n\nLabor has been coming out hard on cost of living, offering everything from a price cap on electricity prices (they won't be able to rise more than 2.5 per cent) to freezing car registrations for a year, which will save the average person $15 a year. Apprentices would be eligible for half-price registrations.\n\nThe party also has a policy to allow people to pay all government-issued bills monthly at no extra charge compared to annual payment, including car registrations.\n\nDean Winter has recently announced a budget repair plan to address the state's spending. (ABC News: Mackenzie Heard)\n\nIt would invest in Loaves and Fishes' food strategy, providing it with $5 million over five years.\n\nThe Liberals have an energy-saver policy in place: the renewable energy dividend. Most recently it resulted in $60 shaved off Tasmanian power bills.\n\nThe Liberals' big cost-of-living promise this campaign is TasInsure, a Tasmanian-owned insurance company the party claims would result in Tasmanians saving up to $250 a year on insurance bills, while businesses would save up to 20 per cent.\n\nThe party has also announced half-price bus fares would be extended for another year.\n\nThe Greens have a whole raft of policies designed to address cost-of-living pressures, including putting a stop to \"unreasonable\" rent rises and introducing means-based fines.\n\nPolicies needed to tackle heart of issue\n\nCommunity sector leaders are generally positive about the policies announced during the campaign so far, but the feeling is most pledges do not go far enough.\n\nMs Zell said some of the policies could be better targeted at vulnerable Tasmanians.\n\n\"We have to be really smart about this and make sure we are investing in people that really need it and making those investments really count,\" she said.\n\nThe Salvation Army's Amelia Natoli said even a $15 discount for those who are struggling would provide relief.\n\nYour Say: Tell us what matters to you this Tasmanian election Photo shows Have your say for the Tasmanian election. We want to know what issues matter most to you and what you want us to find out as Tasmania goes to another election.\n\n\"I do think the impact it would have if it is particularly focused on those individuals that we work with could certainly be quite high,\" she said.\n\n\"We really need to look at how we keep our most vulnerable front of mind.\"\n\nMs Zell said in the end, many of the policies were just \"tinkering around the edges\".\n\n\"I really hope that in these last two weeks [of the election campaign] that we actually see some brave vision around 'let's actually do things differently',\" she said.\n\n\"We do have so many Tasmanians right now really struggling and we're looking at how we can shift that situation so that we can see people's lives being changed.\"\n\nTo see more of the parties' promises to address cost of living and more, go to the ABC's election promise tracker.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/owen-farrell-joins-british-and-irish-lions-squad-in-australia/105493756",
        "title": "Lions veteran Farrell flown to Australia after tour-ending injury to Daly",
        "publish_date": "Thu, 03 Jul 2025 22:56:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former England captain Owen Farrell has been summoned by the British and Irish Lions to replace Elliot Daly on the tour of Australia.\n\nDaly fractured his left forearm on Wednesday in the 52-12 win over the Queensland Reds in Brisbane.\n\nABC Sport will have live blog coverage of the British and Irish Lions' tour of Australia this July and August.\n\n\"It is heartbreaking for the group that Elliot's tour is over,\" Lions coach Andy Farrell said in a statement.\n\n\"He is a Lions legend who has added so much to the group on and off the field over the past few weeks and over the course of three tours.\n\n\"Owen will now come in and add to our options and bring his own Lions experience to the group.\"\n\nElliot Daly suffered a fractured arm against the Queensland Reds in Brisbane. (AAP: Darren England)\n\nFarrell will join his fourth tour, having played 18 times for the Lions, including six Tests across the 2013, 2017 and 2021 tours.\n\nHowever, he has not played an international since leading England at the 2023 Rugby World Cup, after which he took a break from Test rugby. He earned 112 England caps and is the country's all-time points record-holder.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nFarrell has not played any rugby in two months. He was concussed on May 4 while playing for Racing 92 in his last game for the French Top 14 side. He recently signed a new deal to return to his old English club, Saracens.\n\nTadhg Beirne will lead the Lions on Saturday against the NSW Waratahs in Sydney, returning to the second row to partner fellow Ireland lock James Ryan.\n\nFullback Hugo Keenan, wing Blair Kinghorn and reserve scrumhalf Ben White will make their Lions debuts.\n\nKeenan was withdrawn from the Queensland game after falling ill, which prompted Daly's inclusion and ill luck.\n\nKinghorn only joined the Lions this week after helping Toulouse win the Top 14 title last weekend. White arrived this week after the tour-ending injury to Tomos Williams.\n\nNorthampton clubmates Alex Mitchell and Fin Smith are the halves and Scotland duo Sione Tuipulotu and Huw Jones are the centres.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/category-d-funding-approved-for-flood-affected-nsw-farmers/105473920",
        "title": "Business left waiting as flood-affected farmers get $75,000 grants",
        "publish_date": "Thu, 03 Jul 2025 22:37:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "The New South Wales and federal governments are to make grants of up to $75,000 available to farmers affected by record floods that hit the Mid North Coast and Hunter regions in May.\n\nThe decision comes more than five weeks after the natural disaster, the delay prompting protest rallies in Taree and Kempsey.\n\nCategory D funding was approved after New South Wales made an application to the Commonwealth to share the cost.\n\nMacleay Valley dairy farmer Mike Jeffery, who is also chair of the Norco Cooperative, said the announcement came as a relief.\n\n\"I think it's very welcome and there'll be a lot of farmers very pleased to hear that news today,\" he said.\n\n\"It's long overdue, I must say, and a lot of people have been waiting quite a few weeks for some certainty around funding.\n\n\"The mood amongst the farming community was that it was indisputable that category D funding was required for this event, and I think that there was just a lot of frustration as to whether it was forthcoming or not.\"\n\nDairy farmer Mike Jeffery said $25,000 grants were not enough to feed his herd for a week. (ABC Coffs Coast: Claire Simmonds)\n\nMr Jeffery said the $75,000 grants would cover \"just a fraction\" of the losses incurred by many farmers during the disaster.\n\n\"When you consider that it's about $26,000 for a B-double load of hay, it is going to be an important piece of funding, but it's a long way from covering the full costs.\n\n\"We've already spent over $150,000 in the first month after the floods on feed, and the $75,000 will help cover some of those costs we've already incurred.\n\n\"Basically speaking, the $75,000 grant covers three to four weeks of hay for a lot of farms.\"\n\nNot for business\n\nUntil now grants of $25,000 were available for small businesses, primary producers and not-for-profit organisations in the affected regions to help them recover.\n\nFederal Minister for Emergency Management Kristy McBain said today's rollout of extra assistance would give primary producers the support they needed to \"bounce back\" from the disaster, but would not cover flood-affected businesses.\n\n\"New South Wales lead the recovery process here,\" she said.\n\n\"They can make additional requests for support from the federal government and we will work with them on what that looks like, but at this stage, we're talking about primary producers.\"\n\nMacleay Valley cattle have been reliant on hay this winter after flooding destroyed pastures. (ABC Coffs Coast: Claire Simmonds)\n\nThe news has disappointed Darren Sydenham, who employs seven people in his Jabiru Printing business in Kempsey.\n\nHe said the building was under 1.3 metres of water during the May floods.\n\n\"We lost a few of our printing machines that we're not going to be able to afford to replace unless we get help from the government,\" he said.\n\n\"It's very disappointing for us [business and farmers] to be separated into two categories.\n\n\" I don't think it's very fair at all, as we're all one community. \"\n\nNSW Nationals leader Dugald Saunders said he acknowledged the release of much-needed category D funding for primary producers but businesses had been left \"out in the cold\".\n\nPremier Chris Minns visited Taree after the major flood event. (ABC News: Sean Tarek Goodwin)\n\n\"The premier himself stood in an arcade in Taree and said that the flooding disaster that had occurred was worse than Lismore,\" Mr Saunders said.\n\n\"So there was an expectation and a bit of a wink and a nod from the premier that we understand what business needs and the government will back it in.\"\n\nToday, the federal government also doubled disaster recovery grants to $50,000 for small businesses impacted in western Queensland floods earlier this year.\n\n\"We've got exactly the same circumstances in places in New South Wales like Kempsey, Port Macquarie and Taree,\" Mr Saunder said.\n\nDugald Saunders says businesses have been left out in the cold. (ABC News: Emma Siossian)\n\n\"What is NSW as a government doing about supporting our small business, when the federal government is obviously open to supporting them as they've done it for Queensland?\"\n\nMr Saunders said the impacts of the \"worst flooding in living memory\" could mean \"some generational businesses will not be able to restart again\".\n\nA 'tough' wait for grants\n\nFifth-generation Hastings Valley oyster grower David Tunstead lost 10,000 oyster baskets out to sea and much of his lease infrastructure in the floods.\n\nDavid Tunstead says waiting for the category D grants has been tough. (ABC Coffs Coast: Claire Simmonds)\n\nMr Tunstead said the seven-week wait for category D funding \"wasn't ideal at all\".\n\n\" After the Lismore floods was announced in three days and after the 2021 floods it was announced in seven days, this being seven weeks, it was tough on all the farmers. \"\n\n\"It still won't cover what I lost and what a lot of farmers lost, but it will give us some reassurance to rebuild and safeguard for the future.\"\n\nHowever, he foresees some oyster growers will be unable to continue operating, regardless of disaster relief grants, as Sydney rock oysters \"take three years to regrow from a baby oyster to a mature oyster\".\n\n\"Some farmers may still go under, as I was speaking to someone farming on the Macleay [River] yesterday and he was looking at off-lease work in the mines.\"\n\nMr Tunstead said he had plans on how to spend his $75,000 grant if successful in his application.\n\n\"What I'm planning on doing is buying a heap of half-grown oysters with the money so it's only 12 months without an income.\"\n\nWingham Riverside Reserve was badly impacted by the flooding. (Supplied: MidCoast Council)\n\nNSW Minister for Agriculture Tara Moriarty said in a statement that affected farmers should contact the state's Rural Assistance Authority as soon as possible to make an application for extra assistance.\n\n\"We have seen the destructive impact of the floods and talked with dairy, oyster and other farmers who have being doing it tough,\" she said.\n\n\"This decision, with the Commonwealth, again shows our commitment to helping farmers get their businesses back to producing great produce.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/england-trail-by-510-runs-on-day-two-after-gill-makes-history/105493600",
        "title": "England trails by 510 runs on day two after Gill makes history for India",
        "publish_date": "Thu, 03 Jul 2025 22:31:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "England has stumbled to 3-77 to trail India by 510 runs on day two of the second Test, after Indian skipper Shubman Gill scored a record-breaking 269 and their seamers struck early to put the tourists in a commanding position at Edgbaston.\n\nIndia was charged up when Akash Deep picked up two wickets in two balls before Mohammed Siraj also got in on the act to clean up England's top order and leave them tottering at 3-25 on what had been a good batting wicket.\n\nBen Duckett nicked a ball to third slip where Gill took a smart diving catch before Ollie Pope fell the very next delivery for a duck when Deep drew an edge and the ball flew to KL Rahul in the slips.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nDropped catches had cost India the first Test at Headingley but this time they stuck as Siraj drew an edge from Zak Crawley to find Karun Nair at first slip.\n\n\"Fielding was definitely one of those things we spoke about as a team, and it's great to see that come off so far,\" Gill told Sky Sports.\n\n\"This game was all about confidence. We spoke about if we scored 400 again, batting first or batting second, we would be right in the game.\"\n\nHarry Brook (30) survived a review for LBW thanks to the umpire's call but he and Joe Root (18) absorbed the pressure to see out the day with an unbeaten 52-run partnership.\n\nEarlier, Gill became the first Indian to score more than 250 outside the Indian subcontinent, breaking Sachin Tendulkar's record of 241, while he also recorded the highest score by an India captain when he went past Virat Kohli's 254.\n\nGill had hardly put a foot wrong over the first two days of the Test but he briefly lost his concentration after tea when he tried to dispatch a short ball from Josh Tongue, only to find Pope at square leg.\n\nBut the Edgbaston crowd rose to their feet to salute the captain's knock as he walked back to the pavilion, his job done after the Indians found themselves reeling at 5-211 on day one.\n\n\"I worked on a few things before the series that I thought might be important for me going into Test cricket,\" said Gill, who has scored 424 runs in the series.\n\n\"Looking at the results, they are working for me.\"\n\nHaving resumed on an overnight score of 5-310, Jadeja and Gill had built a 203-run stand before the all-rounder fell to a Tongue bouncer but Gill looked completely at ease on a flat track that offered precious little assistance.\n\nAs England's bowling attack toiled under the summer sun, Gill hardly broke sweat and put a high price on his wicket as he showcased his array of elegant drives and well-timed flicks to pile on the runs.\n\nGill made his trademark bow once again after becoming the first India skipper to score a double-hundred in England and soon broke Sunil Gavaskar's 46-year-old record for the highest score by an Indian in England (221 in 1979).\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nHe was soon toying with the attack and the placement of fielders, coolly switching between sublime and unorthodox shots as he dispatched the ball to all corners of the ground.\n\nWith Washington Sundar playing patiently at the other end, Gill was in Twenty20 mode as they cruised past the 500-mark and a rare outside edge went for a boundary to take the captain to 250.\n\nRoot finally broke the seventh-wicket partnership of 144 when a delivery broke through the defence of Sundar as he departed for a well-made 42.\n\nIndia's tail added only 13 runs after Gill's dismissal, but that gave their bowlers 20 overs to take a crack at England's batters on a fruitful day as they look to level the series.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/federal-politics-live-blog-july-4/105493334",
        "title": "Live: Fast-tracked childcare laws to establish power for spot checks of sector",
        "publish_date": "Thu, 03 Jul 2025 22:18:16 +0000",
        "category": "finance",
        "authors": [
            "Courtney Gould",
            "Bethanie Alderson",
            "Patrick Bell"
        ],
        "text": "Nationals senator Bridget McKenzie says the federal government has \"finally woken up\" about the need to support businesses, ahead of a major speech by the prime minister.\n\nAnthony Albanese is set to outline the nation's economic outlook during an event in Sydney this afternoon.\n\nMcKenzie says Labor's strategy needs to focus on \"deep reform\" that reduces red tape and regulation costs for small businesses.\n\n\"It's like the government finally has woken up,\" she told Sky News. \"After spending the first three years smashing small business and our industry base through a raft of industrial relations policies, energy policies and new regulation, they've suddenly realised government jobs don't grow the economy. \"If Labor wants us to be more productive, wants the private sector to grow and prosper, then it needs to look at removing red tape and making the tough decisions that their traditional supporters might not like.\"\n\nTreasurer Jim Chalmers will be holding a productivity roundtable next month, which he's flagged will focus around the three priorities of productivity, budget sustainability and economic resilience.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/what-is-lyssavirus-rare-bat-disease-australia/105489394",
        "title": "What we know about the rare bat disease that has killed another Australian",
        "publish_date": "Thu, 03 Jul 2025 21:57:55 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The rare but deadly lyssavirus has now claimed four lives in Australia.\n\nNew South Wales Health confirmed a man aged in his 50s from the state's north died from the virus on Thursday after being bitten by a bat several months ago.\n\nIt was the first known case in NSW.\n\nHere's what we know about the disease.\n\nThousands of little red flying foxes leave the gardens on dusk in search of food. (Supplied: Jurgen Freund)\n\nWhat is lyssavirus?\n\nLyssavirus is a rabies-like infection transmitted via a bite or scratch from an infected bat to humans and other mammals, such as dogs and cats, or by exposure to an infected animal's saliva through the eyes, nose or mouth.\n\nNSW Health says lyssavirus affects the central nervous system and can take anywhere from weeks to years to present.\n\nThe early symptoms are flu-like and include headache, fever and fatigue.\n\nThe illness progresses rapidly to paralysis, delirium and convulsions.\n\nDeath usually follows within a fortnight.\n\nA tiny proportion of bats carry the virus, but extreme caution is recommended when the animals are present. (ABC Capricornia: Katrina Beavan)\n\nAustralian bat lyssavirus (ABLV) has been found in species of flying foxes, fruit bats and insect-eating microbats, and has been detected in NSW, the Northern Territory, Queensland, Victoria and Western Australia.\n\nThe CSIRO first identified the Australian bat lyssavirus in 1996 after a black flying fox was found displaying nervous symptoms near Ballina in northern NSW.\n\nLater that year a Queensland woman who had recently become a bat handler started to suffer numbness and weakness in her arm before falling into a coma and dying.\n\nIn 1998 and 2013, respectively, a woman and an eight-year-old died after they were bitten or scratched by bats.\n\nAn extremely rare virus\n\nUniversity of Sydney veterinary scientist Alison Peel said bats had coevolved with lyssavirus over a number of years.\n\n\"We know that a large number of bats have been exposed to the virus but not gone on to have clinical signs that they ultimately die of,\" she said.\n\n\"It's a small proportion of bats that go on to develop those clinical signs, whereas in people and other animals it ultimately causes those clinical signs.\n\n\" With any of those animals, once there are clinical signs, then it almost always ends in death. \"\n\nDr Peel said it was yet to be understood why some bats were resistant to the disease and that infected bats often exhibited erratic and aggressive behaviour.\n\nTrish Paterson with a black bat at her home in Rathdowney. (Supplied: Trish Paterson)\n\nTrish Paterson, who ran the Australian Bat Clinic and Wildlife Trauma Centre in Queensland, said less than 0.1 per cent of the Australian bat population was infected with lyssavirus.\n\n\"They catch it from a bite or a scratch from an infected bat, so the bats die from it exactly the same away we do, and it’s nasty, very painful, and can take three to four weeks for an animal to die once they’ve contracted lyssavirus,\" she said.\n\nMs Paterson said being fully vaccinated against rabies was crucial for anyone who handled bats and that it was worrying that another person had died from an infection despite receiving prompt medical attention.\n\n\"If he received treatment and still contracted the virus, that would be a little bit concerning,\" she said.\n\nBats roosting above Trish Paterson's home in Queensland. (Supplied: Trish Paterson)\n\nPost-exposure treatment\n\nThere is no cure for lyssavirus but there are measures that can limit the likelihood of a person developing the disease, including the rabies vaccine.\n\n\"ABLV is closely enough related to rabies that all of the preventative measures developed around the world for rabies, including vaccines and post-exposure treatment, work against ABLV,\" Dr Peel said.\n\nShe said the vaccinations were vital for anyone coming into contact with bats, including carers, veterinarians and wildlife officers.\n\nDr Peel said anyone bitten or scratched by a bat should immediately wash the wound thoroughly for 15 minutes with soap and water and apply an antiviral antiseptic before allowing the affected area to dry.\n\nAnyone who sees a bat in distress is urged not to attempt to come to its aid. (Supplied: Brad Leue)\n\nPost-exposure treatment involves getting a course of the rabies vaccine and potentially a dose of antibodies.\n\n\"You're giving your immune system a head start rather than waiting for it to develop those antibodies,\" Dr Peel said.\n\n\" That just helps to attack the virus straight away. \"\n\nDr Peel said it was rare for post-exposure treatment to fail.\n\nThere is no cure once the disease is detected in the body.\n\nPeople are advised to avoid contact with bats and call WIRES on 1300 094 737 if they find a bat in distress, injured or trapped on the ground.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/five-quick-hits-australia-west-indies-day-one-second-test/105487474",
        "title": "Five quick hits: More Aussie stumbles and Green can't punish fumble",
        "publish_date": "Thu, 03 Jul 2025 21:57:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's middle order rescues the team again as Cameron Green fails to cash in on his best start in a year in Grenada.\n\nHere are five quick hits from the first day of the second Test against the West Indies. Tap here for the full match report and re-live the overnight blog.\n\n1. Konstas came to play\n\nKonstas was bright early on day one in Grenada. (AP: Ricardo Mazalan)\n\nAfter a battling return to the Test team yielded just eight runs in Barbados, young Sam Konstas became something of a personification of the Australian top order's struggles.\n\nThe 19-year-old opener looked unsure at the crease in the opening Test, but there were no such concerns in the opening exchanges at St George's.\n\nKonstas showed plenty of that overused word \"intent\", turning the second ball of the match for a single, then clattering his next delivery (Shamar Joseph's first) over square leg for four with a glorious pull shot.\n\nOne thing was for sure, Konstas was going to take the game on in Grenada.\n\nHe and Usman Khawaja ultimately found the rope six times in the first hour before falling in successive overs.\n\n2. Smith can't prevent another collapse\n\nSmith was dismissed cheaply on his return to the Test arena. (AP: Ricardo Mazalan)\n\nDespite their team securing a 159-run victory, Australia's top four had a disastrous first Test in Barbados, combining for 105 runs from eight underwhelming innings.\n\nHowever, with Steve Smith back in the side for the second Test, there was an expectation the veteran would firm things up in Grenada.\n\nThat's not how it played out.\n\nSmith came to the crease after Khawaja and Konstas had been dismissed in consecutive overs and his idiosyncrasies were on display from ball one, crab walking across the crease and leaving pronouncedly.\n\nBut only six balls into his innings — and just after he had taken a kid moving behind the bowler rather personally — Smith was caught in the deep trying to pull Alzarri Joseph for six.\n\nThe returning vice-captain was out for three and Australia had gone from 0-47 to 3-50.\n\n3. Green gets a life … and wastes it\n\nIn the penultimate over before lunch, Cameron Green lofted a wide Shamar Joseph delivery over cover for four.\n\nFour balls later, he chipped a similar ball to cover, where John Campbell grassed a straightforward chance.\n\nFour after that, he got another look at a wide ball he could have easily left alone, but threw his hands at it instead and this time edged to a sure-handed Roston Chase at gully.\n\nIt was the last ball before lunch no matter what and ended not only his best Test innings in over a year but also cut short a useful recovery effort with Travis Head.\n\n4. Carey's counterpunch\n\nIn a year so far defined by Australian top-order collapses, Alex Carey has quietly come into his own as a counter-attacking middle order batter.\n\nHis calm head and flashing hands have earned him a 2025 average well into the 60s and a strike rate of almost 80.\n\nCarey has been in excellent form so far in 2025. (AP: Ricardo Mazalan)\n\nComing to the crease at 5-110, Carey was positive from ball one in Grenada.\n\nWith Beau Webster struggling for fluency up the other end, Carey pulled authoritatively and drove attractively to put some pressure back on the West Indian bowlers.\n\nIt was another key innings from the Australian wicketkeeper, who combined with the increasingly comfortable Webster for the tourists' best partnership of the day.\n\nCarey cantered to the 11th half century of his Test match career but not before he was dropped by wicketkeeper Shai Hope on 46.\n\nCarey led Australia's fight back on day one in Grenada. (AP: Ricardo Mazalan)\n\nIt was the hosts' eighth, and perhaps most consequential, drop of the series so far.\n\n5. Seeing the funny side\n\nWhen a fast bowler lands a short ball then has a batter bowled off the next delivery, you'd think it was a perfectly executed set-up, but that wasn't exactly the case with the dismissal of Pat Cummins.\n\nYes, Alzarri Joseph's bouncer forced him back in the crease, but the ball that collected stumps was pitched for another rib-tickler and it just refused to get up.\n\nIt ultimately grazed Cummins halfway up his pads before caroming into the stumps, with Joseph and even umpire Richard Kettleborough unable to stifle their chuckles at the ridiculous variable bounce late on day one of a Test match.\n\nAs joyous as it always is getting a wicket, no doubt there were a few West Indian batters grimacing when they saw that one go underground.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-04/bupa-private-health-insurance-customers-denied-claims/105484650",
        "title": "Bupa denies claims for skin cancer, heart and gynaecological surgery",
        "publish_date": "Thu, 03 Jul 2025 21:44:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Health insurer Bupa has been accused of ongoing unscrupulous behaviour towards its customers amid legal action by the competition watchdog.\n\nABC News has been contacted by patients and medical practices from around the country concerned legitimate claims have been denied.\n\nConcerns were also raised about poor communication with patients, problematic billing practices, and lack of education among Bupa staff.\n\nEarlier this week, the Australian Competition and Consumer Commission fined the health insurer $35 million for unlawfully rejecting thousands of claims between May 2018 and August 2023.\n\nBupa in court for 'unconscionable conduct' Photo shows Bupa One of Australia's largest private health insurers has paid back millions of dollars to thousands of members who had hospital claims incorrectly rejected.\n\nBupa rejected claims in full when only part of a procedure was not covered.\n\nThe insurer admitted to engaging in misleading or deceptive conduct.\n\nBut Brisbane woman Tara Manning says she believes poor conduct has not stopped since she experienced difficulty with a claim in April 2025 — about 18 months after the period dealt with by the ACCC.\n\nShe said Bupa tried to reject a claim for laparoscopic surgery to investigate possible ovarian cancer when she went through the pre-surgery eligibility check.\n\nThe mother-of-two had bronze-level cover that included cover for gynaecological surgery. But because one part of the procedure was deemed \"digestive\" by the insurer and the government, the claim was initially rejected in full.\n\nMother-of-two Tara Manning had bronze-level cover with Bupa. (Supplied)\n\nFacing a $14,000 bill, Ms Manning spent weeks calling and messaging BUPA ahead of her surgery and only had her claim approved hours after she submitted a complaint to the Commonwealth Ombudsman.\n\n\"It was an incredibly stressful time trying to get a hold of Bupa with wait times on the phone over an hour,\" she said.\n\n\"I was told very mixed opinions throughout the whole process.\n\n\" I think that behaviour has been really appalling. \"\n\nBupa said it could not comment on individual cases.\n\nIt said the ACCC case related to errors that occurred because of inaccurate or unclear instructions, training or guidance which meant Bupa did not always make correct assessments of these claims and eligibility checks or act quickly enough to fix these issues.\n\n\"We are deeply sorry for our failure to get this right in these instances. We know this isn't good enough and we're committed to doing better.\"\n\nSkin cancer patients facing out-of-pocket expenses despite cover\n\nPlastic surgery clinics also said their bronze cover patients were repeatedly having problems with Bupa when it came to skin cancer removals.\n\nWhen patients needed a cancer surgically removed, they sometimes required a small skin graft or flap to cover the wound which Bupa deemed to be plastic surgery.\n\nPlastic surgery was only covered under silver policies, leaving patients with out-of-pocket expenses of up to $4,500.\n\nJane Griffiths, chief executive officer of peak group Day Hospitals Australia, said private health legislation stated that plastic surgery related to skin surgery was, in fact, covered at bronze level.\n\nShe said their members regularly experienced this from Bupa.\n\n\"You can't leave a patient without a closed skin lesion,\" she said.\n\nDo you have a story to share? Email Specialist.Team@abc.net.au\n\nBupa said this was an industry-wide problem to do with automated billing and patients needed manual overrides.\n\nIt was raised with the federal government in 2021 but recommendations for reform were yet to be implemented.\n\nIn response, medical practices told ABC News other insurers had better processes to override the problem, whereas poorly trained Bupa staff would meet requests for overrides with \"a blanket no\" and the inability to escalate the issue.\n\nMany patients were also unaware of the issue and simply paid the gap, the medical practices said.\n\n\"We are working with hospitals and medical practices to make this process smoother,\" a Bupa spokesperson said.\n\nJane Griffiths is CEO of peak group Day Hospitals Australia. (ABC News: Ben Tessler)\n\nBupa also refused to cover more than one surgical billing item a day, while other insurers would cover two or three, Ms Griffiths said.\n\nThis could be a problem for several types of procedures, including ophthalmology and chemotherapy which involved more than one element, and especially for skin cancers.\n\n\"If the patient needs to be covered for [multiple cancers], you would have to keep bringing the patient in multiple times which of course is not desirable for the patient or for the surgeon,\" Ms Griffiths said.\n\n\" It is a real problem and it's very confusing. \"\n\nBupa said different health insurers took different approaches to funding same-day procedures.\n\nBupa is Australia's second-largest private health insurer.\n\nFigures from the Commonwealth Ombudsman show 2024 complaint numbers were largely in proportion to its market share.\n\nPatient should have declared 'sign' of heart disease\n\nQueensland man David Anderson said he was left with a $48,000 bill for triple bypass heart surgery in 2022 after Bupa denied his claim.\n\nHe said the insurer delved into his medical records and discovered what it deemed a \"sign\" of heart disease and claimed it was a pre-existing condition.\n\nThat was despite three of his treating doctors signing statutory declarations that he was symptom-free prior to taking out the policy.\n\n\"I had climbed a mountain in Canada two months prior to diagnosis,\" he said.\n\nBupa declined to comment on individual cases but said under law those with pre-existing conditions were not covered even if it was discovered after a policy was taken out and the patient was symptom-free.\n\n\"What private health insurers can cover is limited by private health insurance legislation.\"\n\nBupa has reached an agreement with the ACCC on a proposed penalty of $35 million. (ABC News: Nic MacBean)\n\nBupa's market power makes it hard for small operators\n\nMs Griffiths said day hospital operators had a lot of difficulties with Bupa compared to other insurers and \"to some extent\" they were abusing their market power.\n\nShe said Bupa was difficult to deal with in negotiations for their contracts with private hospitals.\n\n\"From the feedback I've had from members, a lot of them have difficulty — particularly very small, specialised units,\" she said.\n\n\"They have difficulty negotiating a reasonable indexation at the end of each contract.\"\n\nBupa said its main aim was a sustainable network across Australia.\n\n\"Bupa has an extensive private hospital network, and our relationships and commercial arrangements with hospital operators are both fair and equitable.\n\n\"Bupa is working closely with our hospital provider partners reach agreements that balance the needs of hospitals, while keeping health insurance affordable for our customers.\"\n\nThe company said it processed about six million hospital and medical claims each year and the overwhelming majority are assessed and paid without issue.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/jewish-children-approached-by-strangers-shouting-heil-hitler-principals-tell-inquiry-20250704-p5mchn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jewish children approached by strangers shouting ‘Heil Hitler’, principals tell inquiry",
        "publish_date": "Fri, 04 Jul 2025 12:03:34 +1000",
        "category": "finance",
        "authors": [
            "Emily Kowal"
        ],
        "text": "Children at Sydney’s Jewish schools are afraid to wear their school uniform and have been approached by strangers shouting “Heil Hitler”, principals have told a parliamentary inquiry into antisemitism.\n\nMoriah College principal Miriam Hasofer told the inquiry on Friday morning that a year 9 girl had been “chased” up Queen’s Park Road near the eastern suburbs school by a woman repeatedly shouting “F--- the Jews” and “free Palestine”.\n\nMoriah College in Queens Park was one of Sydney’s Jewish schools which gave evidence to the inquiry. Credit: Louise Kennerley\n\n“This was a child walking to school. She was terrified,” said Hasofer, adding that “what was once repugnantly un-Australian has become disturbingly routine”.\n\n“The unacceptable has been normalised,” she said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/elon-musk-on-the-nose-in-europe-as-drivers-ditch-tesla-20250704-p5mcg8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Elon Musk on the nose in Europe as drivers ditch Tesla",
        "publish_date": "Fri, 04 Jul 2025 11:59:49 +1000",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "London: Tesla boss Elon Musk has taken another blow from European consumers who are rejecting his company’s electric vehicles, with sales plunging in Germany after similar falls in other countries.\n\nThe latest results reflect gains for Chinese carmakers from the troubles at Tesla, while signalling the dislike for Musk among European voters unhappy at his support for conservative causes.\n\nA Tesla car dealership in Berlin was doused in blue paint in March. Credit: Getty Images\n\nTesla sales slumped 60 per cent in June in Germany compared with the same month last year, according to results from German road traffic agency KBA.\n\nThey fell 58 per cent over the six months to the end of June. But the dramatic shift did not deliver any wins for Germany’s automotive giants, with sales flat or slightly down at Audi, Volkswagen and Mercedes-Benz. Sales rose 3.8 per cent at BMW.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/celebrity/orlando-bloom-and-katy-perry-officially-confirm-they-have-split-20250704-p5mcig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Orlando Bloom and Katy Perry officially confirm they have split",
        "publish_date": "Fri, 04 Jul 2025 11:53:49 +1000",
        "category": "finance",
        "authors": [
            "Chris Hook"
        ],
        "text": "Katy Perry and Orlando Bloom have officially confirmed the end of their almost decade-long relationship with a public statement following weeks of media speculation.\n\nThe pop superstar, 40, and her 48-year-old actor fiancé announced the split in a joint statement to US media.\n\nKaty Perry and Orlando Bloom at this year’s Vanity Fair Oscars Party. Credit: Evan Agostini/Invision/AP\n\n“Due to the abundance of recent interest and conversation surrounding Orlando Bloom and Katy Perry’s relationship, representatives have confirmed that Orlando and Katy have been shifting their relationship over the past many months to focus on co-parenting,” the statement read, per People magazine.\n\n“They will continue to be seen together as a family, as their shared priority is – and always will be – raising their daughter [Daisy Dove, 4] with love, stability and mutual respect.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-davidson-20230608-p5df6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Matt Davidson",
        "publish_date": "Fri, 04 Jul 2025 11:49:53 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Matt Davidson\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/the-konstas-conundrum-when-will-the-golden-boy-of-australian-cricket-come-good-20250703-p5mcf3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Konstas conundrum: When will the golden boy of Australian cricket come good?",
        "publish_date": "Fri, 04 Jul 2025 11:47:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "He got a quarter of the way there - registering his second-highest score in Test cricket - before throwing his hands at an Anderson Phillip delivery on a good length well outside his off stump. A seasoned opener might have recognised the danger in doing so. Trying to powerfully hit a ball on that line and length, given it had been nipping around in the morning, was always going to be fraught with danger. A freeze-frame of Konstas’ caught behind dismissal off the bowling of Anderson Phillip. Credit: X Konstas, with confidence high after hitting a wristy cut/cover drive to the boundary a few minutes earlier, didn’t move his front foot and edged behind, playing away from his body and with his head not in line. Shamar Joseph, who dismissed Konstas in both innings in the first Test, had only just finished his spell. Konstas had faced only two balls from Phillip, and it was evident he wanted to cash in.\n\nSince his remarkable Boxing Day innings against Jasprit Bumrah and India, Konstas has made Test scores of eight, 23, 22, three, five and 25 for a total of 86 runs at 14.33. It is probably a blessing for Konstas that his appearances at the crease in the Caribbean have been in the middle of the Australian night. He polarises opinion enough, let alone under the microscope of a home Australian summer when everyone is glued to their television. But the rusted-on tragics who stayed up until midnight to watch Konstas would have been buoyed when the 19-year-old plundered Shamar Joseph’s first delivery of the Test to the deep square leg boundary. It was a crisp pull shot that showed real intent. Captain Pat Cummins said before the Test he wanted to see more of just that from a struggling top order.\n\nKonstas then looked to pinch singles and get off the strike. He had been encouraged by those close to him to take a more positive mindset into this match. At times, he did that, and is certainly a much better player when he is looking to score. The good players cash in when they make starts. Nearly half of Konstas’ Test innings have been between 22 and 25. Sam Konstas was bowled for 25 in the second Test in Grenada. Credit: AP At the end of the day’s play, Australian all-rounder Beau Webster praised Konstas for being more proactive than he was in his second innings in Barbados. “I thought he looked back to his best today,” Webster said after Australia were bowled out for 286. “He looked like he was really clear and positive in the way he wanted to score and keep out the good balls. Top-order bats are going to find the edge eventually … or the pad.\n\n“He’s going to find his feet.” The performance still wasn’t as fluent an innings as Konstas would like, though. On 10, he nearly chopped a ball onto his stumps from Seales and on 15, was put down by Roston Chase - although it would have been the catch of the century - high to his right at gully. For the third time in his seven Test digs, Konstas has perished in the 12th over of an innings. In the two other innings since his debut Test, he’s been out in the fourth over. Australia’s lack of opening batsmen options on this tour means Konstas will play the third Test in Kingston. He is only going to figure out Test cricket by being out in the middle, but it is imperative for him to get as much cricket as possible leading into the Ashes.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/clear-and-present-danger-the-ticking-time-bomb-in-trump-s-big-beautiful-bill-20250702-p5mc3b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Clear and present danger’: The ticking time bomb in Trump’s big beautiful bill",
        "publish_date": "Fri, 04 Jul 2025 11:45:34 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size New York: Celebrated historian Sir Niall Ferguson calls it “Ferguson’s Law” – a rule of thumb under which “any great power that spends more on debt servicing than on defence risks ceasing to be a great power”. In a February paper for the Hoover Institution at Stanford University, where he is a senior fellow, Ferguson explained that in 2024, for the first time in nearly a century, the United States spent a bigger share of gross domestic product paying interest on its debt (3.1 per cent) than it did on defence (3 per cent). And on present assumptions, the Congressional Budget Office (CBO) projects net interest payments will account for nearly double the defence budget by 2050. President Donald Trump capped an extraordinary two weeks by winning Congressional passage of his “big beautiful bill”, which he will sign on Independence Day. Credit: AP “This unpleasant fiscal arithmetic poses a clear and present danger not merely to the US economy, but also to the position of the United States as the world’s dominant military power,” Ferguson says. “It must be a matter of urgent concern for American policymakers to restore an appropriate relationship between spending on debt service and spending on national security.” Enter Donald Trump and his One Big Beautiful Bill. A grab bag of Trump’s policy priorities, the bill bounced its way through Congress this week to arrive at the president’s desk for signing on Friday, Independence Day (Saturday AEST), in a highly symbolic display of his sway over the Republican Party and indeed the country.\n\nAdvertisement\n\nIt caps an extraordinary two weeks in which Trump bombed Iran, dominated a NATO summit, shepherded a ceasefire between Israel and Iran, won a significant and highly consequential victory in the US Supreme Court, opened a detention centre nicknamed “Alligator Alcatraz” and, now, will ink his signature piece of legislation. The One Big Beautiful Bill Act (OBBB), which is its official title, has at its centre the permanent extension of Trump’s 2017 tax cuts for individuals and businesses, which were due to expire at the end of this year. According to the nonpartisan CBO, those tax cuts contribute the lion’s share to a total increase in the budget deficit of $US3.25 trillion ($4.95 trillion) over the next 10 years – $US3.94 trillion including interest. The libertarian Cato Institute think tank, which advocates limited government, said that under what it called “realistic assumptions” about economic growth, extensions of tax giveaways or delays to spending reform, the bill could actually add more than $US6 trillion to the national debt. Big, beautiful, bonkers? “The debt burdens in this bill are unwelcome and dangerous,” says Judge Block, a senior fellow at the New York-based Manhattan Institute, a conservative think tank. “It’s one of the more expensive pieces of legislation in modern memory.”\n\nAdvertisement\n\nThe Trump administration, and many Republicans, see it differently. In their view, the bill actually reduces debt as it contains savings measures while mostly rolling over existing tax policy. Otherwise, Americans would be hit with an enormous tax increase. The CBO, on the other hand, bases its calculations off existing law, under which taxes revert to their pre-2017 levels. Block said Republicans could largely justify the 2017 Trump tax cuts because they were paired with significant simplifications of the tax code. That is not the case this time, he said, though there were positive aspects to the OBBB, such as immediate tax write-offs for research and development. “To a large extent, most of the debt here is coming from giveaways such as the overtime credit, the tax on tips deduction,” he said. “Those can’t really be justified as tax simplification or a means toward economic growth, which makes their deficit-increasing aspect all the more worrying.” House Republicans join Speaker Mike Johnson to celebrate signing Trump’s bill. Credit: AP Introducing tax deductions for tips and overtime was a major Trump election promise, one he advertised with much fanfare in cities such as Las Vegas. There’s a major catch, though: the policy expires at the end of 2028, when Trump leaves office. As Block points out, there are fairly substantial spending cuts in the bill, which Republicans have not always dared reach for in the past. The biggest is a record $US1 trillion cut to Medicaid, which provides health coverage for low-income adults and families. The CBO estimates this will lead to 11.8 million more people living without health insurance by 2034. The White House maintains there are no “cuts” to Medicaid in the OBBB. Rather, it says the savings come from removing illegal aliens from the program, enforcing work requirements and protecting Medicaid “for the truly vulnerable”.\n\nAdvertisement\n\nMedicaid was a focus of a record-breaking speech by the Democrats’ leader in the House of Representatives, Hakeem Jeffries, who began before dawn on Thursday local time and spoke for nearly nine hours. Languishing without the numbers in either chamber of Congress, and with Trump stamping his authority on every aspect of American life, the listless Democratic Party was hoping to send a signal to angry voters, even if it was only able to delay the inevitable, with the OBBB passing quickly after Jeffries finally sat down. “[Seventeen] million people just lost healthcare,” posted the Democratic governor of California, Gavin Newsom, within minutes of the bill’s passage. “[Eighteen] million kids just lost school meals. Three million Americans just lost food assistance. And $US3.5 trillion was added to the deficit. All for a tax cut for Trump’s billionaire donors.” Newsom called it “the ultimate betrayal”. American debt interest payments now exceed money spent on defence. Credit: AP In New York, young hedge fund manager Spencer Hakimian was also aghast. The 26-year-old, who has built an online following of 150,000 criticising Trump over tariffs, said history had shown debt accumulation is the ruin of empires. “You can’t keep adding debt with no limit. Both parties are wrong about this, it’s a complete fallacy,” he said. And it was facetious for the administration to argue that the tax cuts didn’t really contribute to debt, Hakimian said. The bill lifts the debt ceiling by another $US5 trillion. “Why would they be raising the debt limit if they weren’t adding to the debt?”\n\nAdvertisement\n\nThe feeling on Wall Street is mixed, Hakimian says, but most people are agnostic. Markets are already at all-time highs, with the US economy defying expectations, unemployment staying low and Trump’s tariff threats largely petering out. That matches the assessment of The Economist’s British editor-in-chief Zanny Minton Beddoes, who said the mood among New York financiers at the Aspen Ideas Festival was insouciant, and ambivalent about the debt. “Call me a European grinch, but I felt I had arrived on planet Pangloss,” she told subscribers in a note after the “big, beautiful, bonkers” bill passed. “I worry that Trumponomics 2.0 is eroding the foundations of America’s economy in more fundamental ways than many people are willing to admit.” A trader works on the floor of the New York Stock Exchange on Tuesday. Credit: AP Ticking time bomb Steven Hamilton, an Australian assistant professor of economics at George Washington University, says the debate over how to measure the One Big Beautiful Bill’s impact on debt is moot. The point, he says, is that it presumes current policy can go on forever, and “letting current policy go on forever is nuts”. “Within 10 years, US debt to GDP will be approaching 130 per cent, which is well above any time in US history, well above World War II and beyond the level anyone really thinks is sustainable,” Hamilton says.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/benji-prickles-at-doueihi-questions-20250704-p5mcj8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Benji prickles at Doueihi questions",
        "publish_date": "Fri, 04 Jul 2025 11:43:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "Benji prickles at Doueihi questions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/i-ve-worked-in-childcare-for-50-years-this-is-the-worst-i-ve-seen-it-20250703-p5mc7c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’ve worked in childcare for 50 years. This is the worst I’ve seen it",
        "publish_date": "Fri, 04 Jul 2025 11:41:14 +1000",
        "category": "finance",
        "authors": [
            "Anne Stonehouse"
        ],
        "text": "I have worked for more than 50 years in early education and care as an academic, centre director, writer, consultant, resource developer and consultant with a focus on childcare experiences for birth-to-three-year-olds and partnerships with families. My interest has also been as a parent and a grandparent. I have never been more concerned about the sector than I am now.\n\nRevelations of abuse of children in Melbourne centres has shocked, enraged and sickened us all. We’re all deeply concerned for families who use the centres named. The crisis has also eroded the trust that families have in centres not directly affected. A previously satisfied parent whose children attend an excellent centre told me, “I was OK before, but now I need to be reassured that my child is OK.”\n\nNews of a Melbourne daycare worker being charged with abuse has rocked parents across Australia. Credit: iStock\n\nBut I reject the outdated and inaccurate “I-told-you-so” generalisations from some commentators who say that childcare is not good for young children and should be used only if necessary.\n\nI have had many insightful conversations with families over the years. For example, from the single parent of a child with complex behavioural challenges: “After a hard start to the day at home I can rock up to the centre and say, ‘Here he is, you take him, I’ve had it’, and they don’t judge me.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/that-real-hard-edge-dual-code-prodigy-leads-queensland-s-new-era-of-nrlw-stars-20250703-p5mcav.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘That real hard edge’: Dual-code prodigy leads Queensland’s new era of NRLW stars",
        "publish_date": "Fri, 04 Jul 2025 11:40:35 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Broncos NRLW superstar Tamika Upton has declared Reegan Hicks is in line to produce a breakout campaign, as the club seek to bounce back from their preliminary final exit last year.\n\nUpton, largely regarded as the game’s leading woman, will assume Brisbane’s co-captaincy alongside Ali Brigginshaw in 2025, having cast aside the hip injury that cost her a place in Queensland’s game three State of Origin side.\n\nWhile the former Dally M Medal winner described her time in rehab as a “blessing” in a chaotic year which had included a trip to Las Vegas with the Jillaroos, she kept an eye on the Broncos’ developing talent who loom as the future faces of the game.\n\nTamika Upton has returned to the Broncos for the first time in four years, having moved home after a stint in Newcastle. Credit: Getty Images\n\nHicks – who has been named as 19th woman for the Broncos’ opening round clash with the Tigers – came to the front of Upton’s mind when asked who was set to become an NRLW household name.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/to-be-a-resident-of-rickyland-you-need-to-pick-and-stick-20250626-p5majx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "To be a resident of Rickyland you need to pick and stick",
        "publish_date": "Fri, 04 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Roy Masters"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Ricky Stuart, coach of NRL ladder leaders, Canberra, doesn’t so much win games as avenge wrongs, overcome adversity and triumph over entrenched injustice. While siege mentality is embedded in his DNA, there is some justification for his conviction his club is perpetually under attack. The brand, Raiders, is a misnomer. They are the raided. I spoke to Stuart the day he learned his recruitment officer, Joel Carbone, had been poached by the Sydney Roosters. Carbone has been publicly lauded by Stuart for the recruitment of highly talented five-eighth Ethan Strange and a couple of other promising players yet to play NRL. “It’s so hard losing players,” Stuart says, admitting that after local junior Jack Wighton announced his exit in April 2023, he vowed to resign at the end of that season if Canberra failed to make the semis. The club came eighth. Jack Wighton jumped from Canberra to the Rabbitohs’ carrot. Credit: John Shakespeare “It wears you down losing players you’ve developed and staff you’ve promoted,” he said. “We are a successful club off the field but we don’t have billionaires. We are the raided, as you say.” His nickname is Sticky, a derivative of the reversal, by a house mate, of the first letter of his names: Sticky Ruart.\n\nAdvertisement\n\n“It’s stupid but it stuck,” he says. It’s also accidental nominative determinism because Stuart is a charter member of the pick and stick club. Rickyland is his domain. He staked out its borders long ago: a narrow ridge of volcanic land with outsiders either side. It’s a place where you trust almost no-one from outside the territory but like to be seen as completely trustworthy yourself. It’s a region where he proclaims no-one’s dignity is at risk but foolish errors are punished for only the fool’s eyes to see. “I’ve always been a guy to coach for his players and there have been a number of times where I’ve had to stick by the player but let the player know he’s done the wrong thing privately,” he says, conjuring up images of a guilty player standing in front of Stuart, as children do when telling their father they have wrecked the family car. “Publicly, I protect him, put my arm around him but privately I tell him what was wrong. I’ve always wanted to be that type of coach.”\n\nAdvertisement\n\nSo, if an outsider, such as a journalist, challenges one of his players, you measure Ricky’s blast in megatonnes. For example, when Stuart coached the Roosters to the 2004 grand final and I questioned the effort level of winger Chris Walker ahead of the game, he went on TV suggesting I should address my own “personal problems.” After a careful self-examination of my possible private demons, I did cut back on the schooners. But only that particular evening. Ricky Stuart and Chris Walker face the media in 2003. Credit: Getty Images AsiaPac And it wasn’t long before I was invited onto Rickyland to join his NSW team in the Origin series in 2005. There are those permanently banished from Rickyland, such as Penrith’s Jaeman Salmon whom he called a “weak-gutted dog” and was fined by the NRL. Nick Politis was his chairman when Stuart coached the Roosters to the 2002 title at age 37. Politis’s support extended to paying his fines for criticism of referees. Former NRL chief executive David Gallop recalls, “I fined Ricky and a cheque landed on my desk the following day, a personal one signed by N G Politis, who clearly approved of his comments.” However, Ricky’s comment above about “billionaires” suggests Politis is no longer a paid up member of Rickyland, with the poaching of Carbone affirming this.\n\nAdvertisement\n\nWhen Stuart was the Bulldog’s waterboy while recovering from a knee injury, he refused to give one senior forward a drink. “I don’t remember those days,” he says with a knowing chuckle. “I’m not proud of some of the things I’ve said. I know I’m volatile but it’s a volatile game. I stick up for what I think is right.” The TV cameras have a close view of Stuart on game day because he is the only NRL coach who positions himself on the sideline. When I raised the possibility of his gaining a tactical advantage insofar as his volcanic presence intimidated referees and touch judges, a prolonged pause suggested I was about to be banished from Rickyland. “That’s a load of shit,” he finally said. “Laughable.” But a Storm player claims he copped a Ricky barb within the hearing of the referee and touch judge in the emotion charged final Magic Round match in Brisbane when the Storm took a seven-point lead late in the game, only for the referee to sight a Melbourne breach in a tackle and cancel the field goal. Ricky Stuart celebrates with Brad Fittler after winning a title in 2002. Credit: Craig Golding Later in our interview, Ricky returns to the sideline question, saying, “I hate the cameras on the sideline but it’s where I feel I coach the best. My three coaches – Tim (Sheens), Bozo (Bob Fulton) and Gus (Gould) - all coached from the sideline. I get the feeling of what the players are going through. I can’t get that in a sterile coach’s box. “I like to see the energy and emotion of the player when he comes on and off the field. I like that feel between a coach desperate to win and his players\n\nwanting the same.”\n\nAdvertisement\n\nHe swallows losses as if they were castor oil and would rather chew on balls of alfoil than praise a rival coach he does not like. When a delegation of his players tactfully pointed out Ricky’s negativity following a loss risked becoming contagious, particularly with NRL short turnarounds, he volunteered to disappear. “I had to have a good look at myself,” he said. “I didn’t want to have a beer with my mates and sour the company. So I distanced myself.” He is an old school coach, in this respect. Studying the demeanour of many mentors post match, it’s difficult to know whether their team won, or lost. Again Stuart makes no apology for how he feels, pointing out that being comfortable after a loss will guarantee more losses. “Being sour after losing, is not something I practise,” he says, perhaps tired of having to shadow box his reputation. Stuart has a beer with former Raider teammate and now-Melbourne coach Craig Bellamy after games between their two clubs. He even has a photo on his desk of the pair looking very inebriated in their playing days. But when the Raiders were challenging the Storm for semi-final places 2018-19, Melbourne assistants pointed to stories in a Sydney newspaper highlighting illegal wrestling tactics at Bellamy’s club. Was this Stuart’s super competitiveness in seeding stories, as many top coaches such as Jack Gibson and Fulton, did? Or a journalist seeking to ingratiate himself with the Canberra coach? Still a loyal teammate Bellamy isolated himself from the discussion.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/could-you-eat-60-hot-dogs-in-10-minutes-one-aussie-is-about-to-try-20250703-p5mc8t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could you eat 60 hot dogs in 10 minutes? One Aussie is about to try",
        "publish_date": "Fri, 04 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "He wolfed down 41 hot dogs in ten minutes in his first year. Then 47 hot dogs. Then 52.\n\nOn Saturday morning, Sydneysider James Webb will take to the stage in front of 50,000 people in New York, on US Independence Day, and attempt to smash through 60 hot dogs at their annual Nathan’s Famous Hot Dog Eating Contest.\n\nSydneysider James Webb will be try to eat 60 hotdogs in ten minutes this weekend in the US. Credit: ESPN\n\nWebb has been on the Major League competitive eating circuit the past three years, where he has won more than 20 events.\n\nHe holds several records, including most glazed doughnuts (70 in eight minutes), 276 buffalo wings in 12 minutes, 224 grilled chicken wings in ten minutes, and 350 doughnut holes in eight minutes. There’s also a Guinness World Record for eating 1kg of mozzarella without hands in 1minute 22.59 seconds.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/one-of-brisbane-s-best-sushi-restaurants-is-finally-complete-20250703-p5mc61.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "One of Brisbane’s best sushi restaurants is finally complete",
        "publish_date": "Fri, 04 Jul 2025 11:37:02 +1000",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outFood One of Brisbane’s best sushi restaurants is finally complete It opened in 2021, but not to the owner’s original specifications. Now, there’s a new entrance, dining area and bar. “When you walk in now, there’s that sense of arrival.” Matt Shea July 4, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nSushi Room is complete. What’s now often regarded as Brisbane’s best sushi restaurant may have opened in 2021, but not to owner Simon Gloftis’ original specs. The wrinkle? An existing ground-floor tenant on the Doggett Street side of The Calile. Sushi Room beneath The Calile has reopened with a new bar and dining section and entrance. Markus Ravik It meant a rework, with the intended street-side entrance relocated to a nondescript door just off The Calile lobby. It gave Sushi Room a low-key, hidden vibe, but Gloftis was never entirely happy with it.\n\nAdvertisement\n\n“I always felt it needed a sense of arrival, a place like Sushi Room,” Gloftis says. “It’s a very special room, a really special environment … walking in off The Lobby Bar was OK, but it didn’t feel like you’d arrived anywhere. It felt a bit too easy.” Related Article Expect queues out the door at this hot new King Street patisserie As of late May, though, Sushi Room is a restaurant transformed. The Doggett Street tenant is gone, the former shopfront transformed into a new bar and al fresco dining area that, yes, also acts as the restaurant’s entrance. In charge of the fit-out was regular Gloftis designers Richards & Spence. Compared with the soft moodiness of the restaurant dining room, the Brisbane-based firm has leant the new space a bolder, more approachable design that suits its street-side location, with upholstered booths, a striking marble bar and a mirrored ceiling installation. Outside, brushed-steel furniture lines the sidewalk, while inside a noren curtain leads the way to the original restaurant.\n\nAdvertisement\n\nA noren curtain separates the new bar and dining area from the original restaurant. Markus Ravik The new space is designed to be versatile — diners can use it to start or finish the night, or dine there a la carte — and gives the restaurant more scope to handle walk-ins. “When you walk in there now, there’s that sense of arrival,” Gloftis says. “You go into the bar, through the noren curtain and into the dining room proper, and it’s oriented the right way. You walk in and all the sushi chefs are standing in front of you. “The restaurant deserved that treatment. I couldn’t be happier.” The new dining area features a terrazzo bar, mirrored features and banquette seating. Markus Ravik\n\nAdvertisement\n\nThe central dining room remains much the same: there’s still the 9.3-metre imported enoki dining counter, and still the bright-red private dining room upstairs. The menu remains much the same, and continues to leverage Gloftis’ deep connections with local suppliers and fishers: there’s alfonsino, fatty tuna and vinegared mackerel nigiri; mud crab and tempura prawn hand rolls; and toothfish and Kagoshima A5 rib eye cooked on the hibachi. Guests can order either a la carte or choose a $330 omakase experience. Sushi Room’s central dining room remains much the same, and retains its signature 9.3-metre imported enoki dining counter. Markus Ravik “We’ve had some time off so we’ve improved a couple of little things,” Gloftis says. “We’ve added a beautiful little wakame salad and a couple of other little raw dishes that are really nice, but the bulk of the menu is 90 per cent the same.” Gloftis likes to talk of a meal at Sushi Room as a journey, and reckons the updated restaurant completes that journey.\n\nAdvertisement\n\n“It does,” he says. “The way the restaurant is set out now, people say, ‘It’s totally changed.’ And they look around and you go, ‘No, actually it hasn’t.’ It’s just that you’ve walked in a different door. You’re facing the right way. It just feels right.” Open Tue-Thu 5.30pm-late; Fri-Sat 12pm-2.30pm, 5.30pm-late The Calile Hotel, 48 James Street, Fortitude Valley, (07) 3741 5976 st-albans.com.au/venues/sushi-room\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/why-sydney-s-oldest-home-has-been-stuck-in-a-long-limbo-20250623-p5m9j0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Sydney’s oldest home has been stuck in a long limbo",
        "publish_date": "Fri, 04 Jul 2025 11:34:42 +1000",
        "category": "finance",
        "authors": [
            "Josefine Ganko",
            "Julie Power"
        ],
        "text": "The spokesperson said Heritage was working closely with LGS to ensure the approved conservation works were completed as quickly as possible. This would include the roof, gutters, downpipes and reconstruction of the former chimneys. But Heritage was unaware that all work on the site had been stopped since August 2023, after a stop-work order was issued by the City of Sydney, which has delegated authority on all heritage properties in its local government area. This was issued, the council said, after the owner started work on a verandah awning without consent. Once a construction certificate is issued, the stop-work order will be lifted and works can continue under the approved DA. A spokesperson said: “Council does all it can within its powers to conserve and protect heritage items”.\n\nOn the Cleveland House website, Vincent said the stop-work order came after a member of the public complained. He said it had prevented “urgent and necessary repairs to the roof and exposes the building to potential damages being wrought from the increased weather elements being experienced in our time”. This saga is typical of negotiations between Vincent, who bought the property in 1988, the City and Heritage NSW over the past 15 years. A stop-work order was issued on Cleveland House in Surry Hills in August 2023. Credit: Nick Moir LGS has received two NSW heritage grants for conservation works, the first in 2011-13 and, more recently, a $30,000 heritage grant in the 2023-25 round. Vincent was granted an extension to complete the works funded by the grants because he had obtained the required heritage and construction approvals.\n\nVincent has criticised delays in getting approval on his website and Facebook page. They detail how some applications for remedial work were rejected by Heritage NSW and how other development approvals were also rejected by council. Last October, his website celebrated a win in his bid to build a new toilet block, saying: “Finally, after four years of communications it appears that the outstanding GTAs [General Terms of Approval] relating to the construction of the new toilet block may have been resolved”. Loading Five development applications by LGS Enterprises for works totalling more than $500,000 have been approved by the City of Sydney since 2014. More were lodged before that. Some have timed out because they are older than five years. Other works got the go-ahead from the Heritage Council in 2011. The approvals provide for improvements to the commercial parts of the building, previously used by a publishing company, a new period fence, changes to windows, doors and the verandah. Other approvals relate to heritage materials.\n\nWhen it was listed by the National Trust in 1973, the home was described as an excellent example of colonial Georgian domestic architecture. It had two “curious entrance doors”, a “splendid exterior staircase”, fan-lighted doors, and it was “rich in cedar joinery”. Vincent has repeatedly updated the house’s Facebook page to announce that restoration works would begin imminently, only for those works to stop. The Herald has been asking the owner to comment on the property’s progress since 2022. Vincent has declined to answer, other than saying he could reveal more in “six months”. He often says “sensitive negotiations” are continuing. A Friends of Cleveland House Facebook update said, “The reasons for the slow movements on the restoration of this building are entirely due to the ridiculous heritage and Sydney councils with whom we have been fighting for more than 10 years. We have now obtained (after much headache) approvals for most of what we are planning to restore this beautiful building, so I think you will see some substantial improvements throughout 2024.” In early 2022, an update on the group’s Facebook page said works would be completed in “mid to late 2023”.\n\nLoading In mid-2021, COVID lockdowns were blamed for delays, with a promise that work would continue “when things open again”. This week, he said it was a “delicate period” and he didn’t want to “enter into discussion which may affect the progress forward”. Delays are common in historic properties. These can include unexpected finds – a house in Bellevue Hill found unexploded ordnances, and a major institution discovered its old building didn’t have footings. The planning and approval process is complicated, and work requires specialised trades and is expensive. Locals now hope for a breakthrough. “Everyone is over it,” said a neighbour, declining to be named. “And they realise what a beautiful home it was and how important it is historically, but there doesn’t ever seem to be any progress.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/vera-wang-surprises-nine-year-old-budding-designer-20220314-p5a4jw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Vera Wang surprises nine-year-old budding designer",
        "publish_date": "Fri, 04 Jul 2025 11:32:58 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Vera Wang surprises nine-year-old budding designer\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/papalii-arrives-with-his-future-clouded-but-now-he-can-cement-his-legacy-20250703-p5mccj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Never say never’: Why Maroons’ saviour won’t rule out staying in NRL",
        "publish_date": "Fri, 04 Jul 2025 11:31:40 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Arriving in camp Maroon fresh off celebrating the birth of his son, Josh Papalii admits he remains uncertain of what lies beyond 2025. The veteran enforcer is eager to play on, yet it appears all but certain it will not be for his beloved Canberra Raiders. It has led to suggestions he could embark for a stint in England, but what he did confirm was this would be his final Queensland hurrah. “Overtaking Jason Croker down there with the most games for Canberra Raiders is very special, and that’s how I want to keep it,” Papalii said. “But if the team that you’re playing for is not offering you another contract, and you want to play on, you’ve obviously got to look elsewhere. “I’m still unsure, I feel like I still got a lot to offer as a player and as a mentor and just being an older head. “Never say never. I still feel like I’ve got a lot of footy in me, whether that’s in the NRL or Super League.” Josh Papalii\n\nAdvertisement\n\nBut when Maroons coach Billy Slater dialled his number, there was no uncertainty around Papalii’s decision to end his State of Origin hiatus, having retired from representative rugby league on the eve of the 2023 series. “I missed the first couple of calls because my little fella and my wife were still in hospital at the time and there were a few complications with my little one,” Papalii revealed. Loading “I spoke to Bill when I had that little break, and he asked me one question and said if I had one more game in me. I replied with an ‘F Bomb’ and said yes, I had one more left. “It’s definitely my last … I’m still buzzing just being back in Maroon.” Papalii enters Queensland’s Sunshine Coast camp with an aura the rest of an under siege forward pack is eager to feed off. Despite forcing a decider, the Maroons engine room has been unable to dominate their New South Wales rivals – spearheaded by Broncos’ superstar Payne Haas.\n\nAdvertisement\n\nThose south of the border questioned why Queensland brought a 33-year-old out of the wilderness to match them up front, given he has not experienced the game’s most daunting furnace for three years. According to fellow Maroons prop Tino Fa’asuamaleaui, the doubters could not be more wrong, but they would have to wait for the reason to be revealed. “We’ve just got to wait until Wednesday, that’s all I’ve got to say. They can say whatever they want, but we know what Paps brings to this team, and they obviously don’t know that,” Fa’asuamaleaui said. “He’s one of my idols, he’s in my top five players that I’ve ever played with, if not number one. He just brings that confidence for the whole group. “His aura, he’s a gentle giant, and he loves a laugh, and he just brings everyone together. The aura he has just gives us confidence to do our role, and we just get behind it.” The numbers across the opening two 2025 encounters is telling for the influence and physicality Papalii can inflict in the decider in Sydney.\n\nAdvertisement\n\nThe Blues have run for more post-contact metres (1091 to 856) and tackle busts (80 to 52), while even in their Perth victory Queensland were kept to less than 30 metres per set on average. Even Fa’asuamleaui has been below his best – his 90 running metres a game a complete contrast to 151 he has produced for the Gold Coast. Loading Papalii’s SOS led to the axing of Moeaki Fotuaika, who after copping the brunt of criticism in game one – running for 38 metres from four carries – produced a far more emphatic 23-minute stint. “I think everyone sees the errors that myself and he’s made and think that’s our whole performance,” Fa’asuamaleaui said. “But it’s much bigger than that. Our teammates, our coaching staff, know what we bring. I thought Moe’s been very good, and he was unlucky to miss out on this camp, but he’ll be rooting for us.” Even 321 NRL and 23 Origin games into his career, Papalii has found a way to remain the wrecking ball which made him a Raiders and Maroons legend – with approximately 40 per cent of his total metres this season post-contact.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-do-we-still-flinch-when-someone-cries-at-work/jwd1iueas",
        "title": "Why do we still flinch when someone cries at work?",
        "publish_date": "Thu, 3 Jul 2025 19:37:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "This week, UK chancellor Rachel Reeves made headlines across the world — not for a policy announcement, but for wiping away tears in the House of Commons.\n\n\n\n\n\nImmediately, speculation as to why swirled, with some hypothesising that it had to do with an altercation between her and the lower house speaker.\n\n\n\n\n\nUK Prime Minister Keir Starmer said it had \"nothing to do with politics\" and Reeves' spokesperson said it was a \"personal matter\".\n\n\n\n\n\nIt's not the first time a political figure's tears have made headlines.\n\n\n\nSpeculation about the cause of UK chancellor Rachel Reeves' tears in parliament could reveal larger attitudes about crying in the workplace. Source: AAP / House of Commons/UK Parliament Prime Minister Anthony Albanese has cried in public several times. Julia Gillard teared up during the launch of the National Disability Insurance Scheme (NDIS) and Kevin Rudd cried when resigning from parliament.\n\n\n\n\n\nBob Hawke, Malcolm Fraser and Malcolm Turnbull have also all cried on the job.\n\n\n\n\n\nBut in 2025, we still seem unsure how to feel about tears, especially if they're at work.\n\n\n\n\n\n\"There's still an outdated expectation that leaders must be strong — and that strong means unemotional,\" psychologist Carly Dober told SBS News.\n\n\n\n\n\n\"But crying is one of the body's strongest ways of self-soothing. It's neutral. It helps us recalibrate.\"\n\n\n\nREAD MORE Feeling depleted by work? This is how Melanie beat burnout without quitting her job\n\nThe taboo of tears\n\nDespite how common it is, crying at work still carries a stigma.\n\n\n\n\n\n\"It tends to be seen as a taboo thing to do, but it is quite common,\" says UTS associate professor Robyn Johns, who specialises in human resources, industrial relations and occupational stress.\n\n\n\n\n\n\"It often happens when people feel powerless, stressed, frustrated or in conflict at work.\"\n\n\n\n\n\nDober agrees — and says suppressing those emotional reactions comes at a cost.\n\n\n\n\"Emotional suppression is really taxing on us and quite harmful,\" she says. \"We're not machines. We are emotional and social individuals.\"\n\n\n\n\n\nShe says crying isn't a breakdown, but rather a biologically useful tool for emotional regulation.\n\n\n\n\n\n\"When we cry, amazing chemicals are released … endorphins that help us emotionally recalibrate.\"\n\n\n\nDoes crying at work damage your reputation? That depends\n\nBoth experts say the way tears are received at work depends heavily on the context, including your industry, workplace culture, job title, and even your gender.\n\n\n\n\n\n\"Whether it's accepted really depends on the workplace and what the norms are within that environment or profession,\" Johns says.\n\n\n\n\n\nIn fields that require emotional labour — like teaching, social work or nursing — crying is more likely to be understood as part of burnout or compassion fatigue.\n\n\n\nREAD MORE Fewer Australian women are working part-time. These are the jobs they want instead\n\n\"Burnout often includes emotional exhaustion, and in those professions, we do see crying more frequently as part of that process,\" Johns says.\n\n\n\n\n\nOn the other hand, crying in high-pressure, white-collar workplaces can be seen as a big no-no.\n\n\n\n\n\n\"It might be seen as a sign of weakness and impact your image in a negative way,\" she says.\n\n\n\nThe gender gap\n\nBoth experts say reactions to crying at work are still shaped by outdated — and deeply gendered — assumptions.\n\n\n\n\n\n\"Typically, what we've seen within the gender power dynamics is that women are seen to be weak when they're crying,\" Johns says.\n\n\n\n\n\n\"Men are perceived to be more genuine or courageous or stronger or authentic in being able to display their emotions.\n\n\n\n\n\n\"Whereas a lot of research sees that women are interpreted to be losing control or that they don't have the same emotional intelligence to be able to hold those more senior level roles … it can be quite damaging to their careers.\"\n\n\n\n\"Women can use their brains and they can self-soothe by crying,\" Dober added.\n\n\n\n\n\n\"One doesn't cancel the other out.\"\n\n\n\n\n\nJohns suggests shifting focus away from gender and back to the circumstances of workplace crying.\n\n\n\n\n\n\"Ask instead: what are the triggers — regardless of gender — that have brought somebody to this state?\"\n\n\n\nMaking space for emotion at work\n\nDespite the lingering stigma, both experts say workplaces are starting to change — slowly.\n\n\n\n\n\nApproximately 80 per cent of Australia's top 500 companies have an employee assistance program (EAP) in place, which aims to support employee wellbeing and provide mental health support, according to NSW government data from 2022.\n\n\n\n\n\nBut support, Johns says, also needs to be cultural, not just procedural.\n\n\n\n\n\n\"What we don't want is people who have these emotions to feel like they've absolutely got to bottle them up, otherwise it's going to be a detriment to them in their career,\" she said. \"Because that's also not healthy.\"\n\n\n\nREAD MORE Teaching was my dream job but I was forced to quit\n\nDober says workplace leaders play a key role in shaping emotional norms.\n\n\n\n\n\n\"Culture starts at the top,\" she says. \"If you say it's okay to cry but penalise people when they do, that's not psychologically safe.\"\n\n\n\n\n\nBoth agree it's time to stop treating crying as weakness.\n\n\n\n\n\n\"If you see someone cry at work, check your bias,\" Dober says. \"Crying is neutral. It's a body's way of self-soothing.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/creative-australia-sorry-for-hurt-caused-by-decision-to-dump-artist-khaled-sabsabi-from-venice-biennale/75gixf04l",
        "title": "Creative Australia sorry for hurt caused by decision to dump artist Khaled Sabsabi from Venice Biennale",
        "publish_date": "Thu, 3 Jul 2025 10:07:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/qld-government-announces-new-deal-to-break-ground-on-controversial-olympics-stadium/igxzsoss6",
        "title": "Qld government announces new deal to break ground on controversial Olympics stadium",
        "publish_date": "Thu, 3 Jul 2025 10:02:58 +0000",
        "category": "sports",
        "authors": [],
        "text": "Qld government announces new deal to break ground on controversial Olympics stadium\n\nPublished 3 July 2025, 8:45 am\n\nThe Queensland government has struck a new deal with the Commonwealth on the 2032 Olympic and Paralympic Games. The stadium plans have been controversial with concerns about the site raised by Indigenous groups and local residents.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/diogo-jota-dies-in-car-crash-in-spain/yxjzf72tv",
        "title": "Liverpool's Portuguese forward Diogo Jota dies in car crash in Spain",
        "publish_date": "Thu, 3 Jul 2025 09:34:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Liverpool's Portuguese forward Diogo Jota and his brother Andre Silva died in a car crash in northwestern Spain early on Thursday, when their Lamborghini veered off the road and burst into flames, authorities said.\n\n\n\n\n\nEvidence at the scene of the crash near the city of Zamora suggests Jota's car suffered a burst tyre while overtaking, Spanish police said in a statement.\n\n\n\n\n\nJota, 28, had in late June just married his partner of ten years, with whom he had three children.\n\n\n\n\n\nThe regional fire department of Castile and Leon, where Zamora is located, also confirmed on its website that a car crashed early on Thursday and burst into flames, with two men, aged 28 and 26, found dead.\n\n\n\n\"We have lost two champions. Their deaths represent irreparable losses for Portuguese football, and we will do everything we can to honour their legacy every day,\" the Portuguese Football Federation said of Jota and Silva, who played for Penafiel in the Portuguese second division.\n\n\n\n\n\nPolice said their bodies have been taken to a forensics unit in Zamora where autopsies will be performed.\n\n\n\n\n\n\"The news of the death of Diogo Jota, an athlete who greatly honoured the name of Portugal, and his brother, is unexpected and tragic,\" Portuguese Prime Minister Luis Montenegro said on X. \"I offer my most sincere condolences to his family.\"\n\n\n\n\n\nJota helped Liverpool win the Premier League last season and also won the FA Cup and League Cup with the Merseyside outfit.\n\n\n\n\n\nBorn in Porto, he began his career with local team Pacos de Ferreira before switching to Wolverhampton Wanderers in 2017.\n\n\n\n\n\nJota arrived at Anfield in 2020 and scored 65 goals in 182 appearances for the club in all competitions.\n\n\n\n\n\n\"Liverpool Football Club are devastated by the tragic passing of Diogo Jota,\" the club said on X.\n\n\n\n\n\nHe also made 49 appearances for Portugal, twice winning the UEFA Nations League.\n\n\n\n\n\n\"It is a remarkable achievement for a small guy that came from Gondomar, where I had this dream,\" Jota said on Liverpool’s website of winning the Premier League. \"It's a moment I will cherish forever.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/creative-australia-reinstates-artist-khaled-sabsabi-for-venice-biennale/t68l3l2jj",
        "title": "Creative Australia reinstates artist Khaled Sabsabi for Venice Biennale",
        "publish_date": "Thu, 3 Jul 2025 09:30:46 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nArtistic duo Khaled Sabsabi and Michael Dagostino have been re-invited to represent Australia at the 2026 Venice Biennale - a prestigious event for artists from around the world.\n\n\n\n\n\nThe about-face was triggered by an independent review of Creative Australia's original decision made in February - when they revoked the invite - hoping to avoid what it described as divisive debate.\n\n\n\n\n\nThe move drew wide-spread condemnation from the arts community, many seeing it as limiting artistic freedoms and increasing censorship.\n\n\n\n\n\nPenelope Benton, Executive Director of the National Association for the Visual Arts, welcomes Creative Australia's decision to restore their invitation.\n\n\n\n\n\n\"Artistic freedom and independent decision making are fundamental to the role of a national arts body. And these principles need to be upheld, and I think this marks a turning point in reaffirming our commitment to those principles, and improving practices to ensure this never happens again.\"\n\n\n\n\n\nThe move to rescind the pair's invitation came days after the Coalition questioned why the pair was chosen in the first place, drawing attention to two of Khaled Sabsabi's pieces from nearly 20 years ago, neither of which were submitted to the Venice Biennale.\n\n\n\n\n\nThe first a video and sound installation called 'You', depicting the late leader of Hezbollah, Hassan Nasrallah.\n\n\n\n\n\nThe other 'Thank you very much' - which includes a video of the September 11 attacks.\n\n\n\n\n\nAlex Ryvchin, the co-Chief Executive Officer of the Executive Council of Australian Jewry, says the works make him doubtful Mr Sabsabi is the right choice to represent Australia.\n\n\n\n\n\n\"It's not a matter of he shouldn't be allowed to paint in this way or create art in this way. It's the question of is this the best person to represent Australian art. We have such rich stocks of wonderfully talented artists in this country, the vast majority of whom have never honoured terrorists’ leaders and terrorist events in this way.\"\n\n\n\n\n\nBut Ms Benton says this doesn't recognise the critical perspective Mr Sabsabi is taking in these works.\n\n\n\n\n\n\"There's been a great deal of writing, critique, by art theorists, curators over a long period of time analysing these works and recognising them as commentary on propaganda and mass-media. They were never an endorsement of terrorism.\"\n\n\n\n\n\nThe inquiry found Creative Australia exercised its judgment in accordance with its obligations outlined by federal law, and no single person was to blame, but that there were a series of missteps, assumptions and missed opportunities.\n\n\n\n\n\nCreative Australia's acting chair, Wesley Enoch, told ABC radio the organisation stands by their decision to reinstate the pair as Australia's representatives.\n\n\n\n\n\n\"I want to apologise to them for the hurt they've gone through in this process and though we'll be stronger because of it, I know it's come at a personal cost, not just to them, but also to a whole range of people in the art community. I feel that we as Creative Australia need to help the whole sector learn some of these lessons going forward.\"\n\n\n\n\n\nSara Mansour is a Lebanese Australian lawyer, artist, poet and co-founder of the Bankstown Poetry Slam. She tells SBS Arabic she is relieved by the decision.\n\n\n\n\n\n“Yeah, I am really elated. It’s kind of reinstated my hope in the Australian private sector and creative Australia specifically. It’s illustrated the importance of risk mitigation and risk management procedures. As an artist, I feel like my faith has been restored.”\n\n\n\n\n\nIn a statement the artist Khaled Sabsabi and curator Michael Dagostino said:\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sector-rotation-on-the-asx-is-the-cost-of-living-crisis-over/3isoa8f6j",
        "title": "Sector rotation on the ASX & is the cost of living crisis over?",
        "publish_date": "Thu, 3 Jul 2025 08:00:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/misleading-ghost-stores-haunting-australian-consumers/1athgsojm",
        "title": "Misleading 'ghost stores' trick Australian consumers",
        "publish_date": "Thu, 3 Jul 2025 07:52:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians have been warned to stay alert for \"ghost stores\" as shoppers who fall victim have few avenues for recourse.\n\n\n\n\n\nAt least four such stores have been noted by the Australian consumer watchdog for misleading shoppers into buying low-quality items.\n\n\n\n\n\nThey often claim to be local Australian businesses that are closing down and selling off high-quality goods, when they are actually based overseas and sell poor-quality, drop-shipped clothes and footwear.\n\n\n\n\n\n\"This conduct preys on the empathy of consumers who have a genuine desire to support local businesses,\" Australian Competition and Consumer Commission deputy chair Catriona Lowe said.\n\n\n\nThe commission specifically issued public warning notices about everly-melbourne.com, willowandgrace-adelaide.com, sophie-claire.com and doublebayboutique.com.\n\n\n\n\n\nHowever, the issue appears to be more widespread, with the watchdog receiving at least 360 reports about 60 online retailers since the start of 2025.\n\n\n\n\n\nMany complaints alleged ghost stores were refusing to provide refunds, were offering only partial refunds, or were not responding to complaints at all.\n\n\n\n\n\nNormally, Australians could pursue their consumer rights and go to a local store.\n\n\n\n\n\nBut because so many of the shops operate overseas, the usual consumer guarantees would not apply, Consumer Action Law Centre legal director Stephen Nowicki said.\n\n\n\n\"There's very little you can do,\" he added.\n\n\n\n\n\nThe commission has urged consumers to contact their bank to see if they can reverse the charge or stop the transaction.\n\n\n\n\n\nWhile this can be done when Australians fall victim to scams, the situation with ghost stores is less clear because shoppers still receive a product.\n\n\n\n\n\n\"It becomes harder in these kinds of situations, compared to an outright scam, to know what is a genuine discount versus what someone is presenting as a discount but is something not worth what they are promoting it as,\" Mr Nowicki said.\n\n\n\n\n\nBut there are some potential areas for reform.\n\n\n\n\n\nThough governments could not pass laws that would give consumers jurisdiction against an overseas business, they could try to block and prevent advertising in the first place.\n\n\n\nHow to spot a 'ghost store'\n\nOperators generally target Australians through social media ads on platforms like Facebook and Instagram. They make themselves appear local by closing and then rebranding under new names that use different Australian suburbs, towns or cities.\n\n\n\n\n\nThe competition and consumer commission has written to Meta, which owns both platforms, and e-commerce giant Shopify, which can be used to host and operate ghost web stores. It has also tried to educate shoppers.\n\n\n\n\n\nGhost store domains often end with \".com\" and not \".com.au\", and many use AI-generated images.\n\n\n\n\n\nThey also generally do not provide a physical address or a means of contact beyond an email address, while their Privacy Policy or Terms of Service sometimes refers to international regulations rather than Australian laws.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australians-urged-to-be-on-red-alert-amid-concerns-over-risky-super-switching-schemes/wcec9ux6k",
        "title": "Australians urged to be on 'red alert' amid concerns over risky super-switching schemes",
        "publish_date": "Thu, 3 Jul 2025 01:18:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians have been warned to watch out for pushy salespeople pressuring them to make quick changes to their superannuation provider.\n\n\n\n\n\nThe Australian Securities and Investments Commission (ASIC) has warned Australians to be \"on red alert for high-pressure sales tactics, clickbait advertising and promises of unrealistic returns\".\n\n\n\n\n\nThe corporate watchdog has warned of \"industrial-scale\" schemes encouraging people to move their retirement savings into complex and risky schemes.\n\n\n\n'Industrial scale' schemes\n\nASIC deputy chair Sarah Court said the watchdog is \"increasingly concerned\" about individuals being tricked into putting retirement savings into \"high-risk schemes\", adding that these are often property investments.\n\n\n\n\n\n\"The outcomes are certainly not what those consumers have been expecting,\" she told ABC radio on Thursday.\n\n\n\n\n\n\"We are just increasingly seeing examples on an industrial scale.\"\n\n\n\n\n\nSome people were being told their superannuation balance may be insufficient for retirement before being encouraged to switch to high-risk investments, she said.\n\n\n\nThere are potential benefits to switching and consolidating your super, but that should only happen after careful consideration of the potential risk, ASIC has cautioned.\n\n\n\n\n\nAs of March 2025, financial comparison site Finder reports Australia had 24.7 million superannuation accounts from 112 fund providers, excluding those with fewer than seven members, holding a total of $4.2 trillion in assets.\n\n\n\n\n\nIt says 77 per cent of Australians have a super fund, and 5 per cent plan to open one in future.\n\n\n\n'Big red flags'\n\nWith the start of the new financial year, ASIC recommends that Australians be especially careful when reviewing their super funds.\n\n\n\n\n\n\"When it comes to sales calls about super switching, there are some big red flags people should be alert to — being asked to make a quick decision is one of the most obvious,\" Court said.\n\n\n\n\n\n\"The initial salespeople can be very persuasive, often the underlying schemes are complex or not made clear to the consumer.\"\n\n\n\n\n\nAccording to ASIC, some of these red flags include high-pressure sales tactics, cold calls, offers to find and consolidate lost super for free, poor product disclosure, and unrealistic promises.\n\n\n\n\"It may be very difficult for even experienced investors to spot problems. Once you start on the path it can be hard to get off,\" Court said.\n\n\n\n\n\n\"These calls don’t have the hallmarks of a typical scam. The caller will seemingly have your best interests at heart.\n\n\n\n\n\n\"Consumers should always ask questions about salespeople's connections to funds, particularly in circumstances where a particular fund appears in the pitch, as there may be a commission arrangement.\n\n\n\n\n\n\"If you are unsure or are feeling pressured, just hang up.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/jewish-children-approached-by-strangers-shouting-heil-hitler-principals-tell-inquiry-20250704-p5mchn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jewish children approached by strangers shouting ‘Heil Hitler’, principals tell inquiry",
        "publish_date": "Fri, 04 Jul 2025 12:03:34 +1000",
        "category": "finance",
        "authors": [
            "Emily Kowal"
        ],
        "text": "Children at Sydney’s Jewish schools are afraid to wear their school uniform and have been approached by strangers shouting “Heil Hitler”, principals have told a parliamentary inquiry into antisemitism.\n\nMoriah College principal Miriam Hasofer told the inquiry on Friday morning that a year 9 girl had been “chased” up Queen’s Park Road near the eastern suburbs school by a woman repeatedly shouting “F--- the Jews” and “free Palestine”.\n\nMoriah College in Queens Park was one of Sydney’s Jewish schools which gave evidence to the inquiry. Credit: Louise Kennerley\n\n“This was a child walking to school. She was terrified,” said Hasofer, adding that “what was once repugnantly un-Australian has become disturbingly routine”.\n\n“The unacceptable has been normalised,” she said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/elon-musk-on-the-nose-in-europe-as-drivers-ditch-tesla-20250704-p5mcg8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Elon Musk on the nose in Europe as drivers ditch Tesla",
        "publish_date": "Fri, 04 Jul 2025 11:59:49 +1000",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "London: Tesla boss Elon Musk has taken another blow from European consumers who are rejecting his company’s electric vehicles, with sales plunging in Germany after similar falls in other countries.\n\nThe latest results reflect gains for Chinese carmakers from the troubles at Tesla, while signalling the dislike for Musk among European voters unhappy at his support for conservative causes.\n\nA Tesla car dealership in Berlin was doused in blue paint in March. Credit: Getty Images\n\nTesla sales slumped 60 per cent in June in Germany compared with the same month last year, according to results from German road traffic agency KBA.\n\nThey fell 58 per cent over the six months to the end of June. But the dramatic shift did not deliver any wins for Germany’s automotive giants, with sales flat or slightly down at Audi, Volkswagen and Mercedes-Benz. Sales rose 3.8 per cent at BMW.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/celebrity/orlando-bloom-and-katy-perry-officially-confirm-they-have-split-20250704-p5mcig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Orlando Bloom and Katy Perry officially confirm they have split",
        "publish_date": "Fri, 04 Jul 2025 11:53:49 +1000",
        "category": "finance",
        "authors": [
            "Chris Hook"
        ],
        "text": "Katy Perry and Orlando Bloom have officially confirmed the end of their almost decade-long relationship with a public statement following weeks of media speculation.\n\nThe pop superstar, 40, and her 48-year-old actor fiancé announced the split in a joint statement to US media.\n\nKaty Perry and Orlando Bloom at this year’s Vanity Fair Oscars Party. Credit: Evan Agostini/Invision/AP\n\n“Due to the abundance of recent interest and conversation surrounding Orlando Bloom and Katy Perry’s relationship, representatives have confirmed that Orlando and Katy have been shifting their relationship over the past many months to focus on co-parenting,” the statement read, per People magazine.\n\n“They will continue to be seen together as a family, as their shared priority is – and always will be – raising their daughter [Daisy Dove, 4] with love, stability and mutual respect.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-davidson-20230608-p5df6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Matt Davidson",
        "publish_date": "Fri, 04 Jul 2025 11:49:53 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Matt Davidson\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/the-konstas-conundrum-when-will-the-golden-boy-of-australian-cricket-come-good-20250703-p5mcf3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Konstas conundrum: When will the golden boy of Australian cricket come good?",
        "publish_date": "Fri, 04 Jul 2025 11:47:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "He got a quarter of the way there - registering his second-highest score in Test cricket - before throwing his hands at an Anderson Phillip delivery on a good length well outside his off stump. A seasoned opener might have recognised the danger in doing so. Trying to powerfully hit a ball on that line and length, given it had been nipping around in the morning, was always going to be fraught with danger. A freeze-frame of Konstas’ caught behind dismissal off the bowling of Anderson Phillip. Credit: X Konstas, with confidence high after hitting a wristy cut/cover drive to the boundary a few minutes earlier, didn’t move his front foot and edged behind, playing away from his body and with his head not in line. Shamar Joseph, who dismissed Konstas in both innings in the first Test, had only just finished his spell. Konstas had faced only two balls from Phillip, and it was evident he wanted to cash in.\n\nSince his remarkable Boxing Day innings against Jasprit Bumrah and India, Konstas has made Test scores of eight, 23, 22, three, five and 25 for a total of 86 runs at 14.33. It is probably a blessing for Konstas that his appearances at the crease in the Caribbean have been in the middle of the Australian night. He polarises opinion enough, let alone under the microscope of a home Australian summer when everyone is glued to their television. But the rusted-on tragics who stayed up until midnight to watch Konstas would have been buoyed when the 19-year-old plundered Shamar Joseph’s first delivery of the Test to the deep square leg boundary. It was a crisp pull shot that showed real intent. Captain Pat Cummins said before the Test he wanted to see more of just that from a struggling top order.\n\nKonstas then looked to pinch singles and get off the strike. He had been encouraged by those close to him to take a more positive mindset into this match. At times, he did that, and is certainly a much better player when he is looking to score. The good players cash in when they make starts. Nearly half of Konstas’ Test innings have been between 22 and 25. Sam Konstas was bowled for 25 in the second Test in Grenada. Credit: AP At the end of the day’s play, Australian all-rounder Beau Webster praised Konstas for being more proactive than he was in his second innings in Barbados. “I thought he looked back to his best today,” Webster said after Australia were bowled out for 286. “He looked like he was really clear and positive in the way he wanted to score and keep out the good balls. Top-order bats are going to find the edge eventually … or the pad.\n\n“He’s going to find his feet.” The performance still wasn’t as fluent an innings as Konstas would like, though. On 10, he nearly chopped a ball onto his stumps from Seales and on 15, was put down by Roston Chase - although it would have been the catch of the century - high to his right at gully. For the third time in his seven Test digs, Konstas has perished in the 12th over of an innings. In the two other innings since his debut Test, he’s been out in the fourth over. Australia’s lack of opening batsmen options on this tour means Konstas will play the third Test in Kingston. He is only going to figure out Test cricket by being out in the middle, but it is imperative for him to get as much cricket as possible leading into the Ashes.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/clear-and-present-danger-the-ticking-time-bomb-in-trump-s-big-beautiful-bill-20250702-p5mc3b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Clear and present danger’: The ticking time bomb in Trump’s big beautiful bill",
        "publish_date": "Fri, 04 Jul 2025 11:45:34 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size New York: Celebrated historian Sir Niall Ferguson calls it “Ferguson’s Law” – a rule of thumb under which “any great power that spends more on debt servicing than on defence risks ceasing to be a great power”. In a February paper for the Hoover Institution at Stanford University, where he is a senior fellow, Ferguson explained that in 2024, for the first time in nearly a century, the United States spent a bigger share of gross domestic product paying interest on its debt (3.1 per cent) than it did on defence (3 per cent). And on present assumptions, the Congressional Budget Office (CBO) projects net interest payments will account for nearly double the defence budget by 2050. President Donald Trump capped an extraordinary two weeks by winning Congressional passage of his “big beautiful bill”, which he will sign on Independence Day. Credit: AP “This unpleasant fiscal arithmetic poses a clear and present danger not merely to the US economy, but also to the position of the United States as the world’s dominant military power,” Ferguson says. “It must be a matter of urgent concern for American policymakers to restore an appropriate relationship between spending on debt service and spending on national security.” Enter Donald Trump and his One Big Beautiful Bill. A grab bag of Trump’s policy priorities, the bill bounced its way through Congress this week to arrive at the president’s desk for signing on Friday, Independence Day (Saturday AEST), in a highly symbolic display of his sway over the Republican Party and indeed the country.\n\nAdvertisement\n\nIt caps an extraordinary two weeks in which Trump bombed Iran, dominated a NATO summit, shepherded a ceasefire between Israel and Iran, won a significant and highly consequential victory in the US Supreme Court, opened a detention centre nicknamed “Alligator Alcatraz” and, now, will ink his signature piece of legislation. The One Big Beautiful Bill Act (OBBB), which is its official title, has at its centre the permanent extension of Trump’s 2017 tax cuts for individuals and businesses, which were due to expire at the end of this year. According to the nonpartisan CBO, those tax cuts contribute the lion’s share to a total increase in the budget deficit of $US3.25 trillion ($4.95 trillion) over the next 10 years – $US3.94 trillion including interest. The libertarian Cato Institute think tank, which advocates limited government, said that under what it called “realistic assumptions” about economic growth, extensions of tax giveaways or delays to spending reform, the bill could actually add more than $US6 trillion to the national debt. Big, beautiful, bonkers? “The debt burdens in this bill are unwelcome and dangerous,” says Judge Block, a senior fellow at the New York-based Manhattan Institute, a conservative think tank. “It’s one of the more expensive pieces of legislation in modern memory.”\n\nAdvertisement\n\nThe Trump administration, and many Republicans, see it differently. In their view, the bill actually reduces debt as it contains savings measures while mostly rolling over existing tax policy. Otherwise, Americans would be hit with an enormous tax increase. The CBO, on the other hand, bases its calculations off existing law, under which taxes revert to their pre-2017 levels. Block said Republicans could largely justify the 2017 Trump tax cuts because they were paired with significant simplifications of the tax code. That is not the case this time, he said, though there were positive aspects to the OBBB, such as immediate tax write-offs for research and development. “To a large extent, most of the debt here is coming from giveaways such as the overtime credit, the tax on tips deduction,” he said. “Those can’t really be justified as tax simplification or a means toward economic growth, which makes their deficit-increasing aspect all the more worrying.” House Republicans join Speaker Mike Johnson to celebrate signing Trump’s bill. Credit: AP Introducing tax deductions for tips and overtime was a major Trump election promise, one he advertised with much fanfare in cities such as Las Vegas. There’s a major catch, though: the policy expires at the end of 2028, when Trump leaves office. As Block points out, there are fairly substantial spending cuts in the bill, which Republicans have not always dared reach for in the past. The biggest is a record $US1 trillion cut to Medicaid, which provides health coverage for low-income adults and families. The CBO estimates this will lead to 11.8 million more people living without health insurance by 2034. The White House maintains there are no “cuts” to Medicaid in the OBBB. Rather, it says the savings come from removing illegal aliens from the program, enforcing work requirements and protecting Medicaid “for the truly vulnerable”.\n\nAdvertisement\n\nMedicaid was a focus of a record-breaking speech by the Democrats’ leader in the House of Representatives, Hakeem Jeffries, who began before dawn on Thursday local time and spoke for nearly nine hours. Languishing without the numbers in either chamber of Congress, and with Trump stamping his authority on every aspect of American life, the listless Democratic Party was hoping to send a signal to angry voters, even if it was only able to delay the inevitable, with the OBBB passing quickly after Jeffries finally sat down. “[Seventeen] million people just lost healthcare,” posted the Democratic governor of California, Gavin Newsom, within minutes of the bill’s passage. “[Eighteen] million kids just lost school meals. Three million Americans just lost food assistance. And $US3.5 trillion was added to the deficit. All for a tax cut for Trump’s billionaire donors.” Newsom called it “the ultimate betrayal”. American debt interest payments now exceed money spent on defence. Credit: AP In New York, young hedge fund manager Spencer Hakimian was also aghast. The 26-year-old, who has built an online following of 150,000 criticising Trump over tariffs, said history had shown debt accumulation is the ruin of empires. “You can’t keep adding debt with no limit. Both parties are wrong about this, it’s a complete fallacy,” he said. And it was facetious for the administration to argue that the tax cuts didn’t really contribute to debt, Hakimian said. The bill lifts the debt ceiling by another $US5 trillion. “Why would they be raising the debt limit if they weren’t adding to the debt?”\n\nAdvertisement\n\nThe feeling on Wall Street is mixed, Hakimian says, but most people are agnostic. Markets are already at all-time highs, with the US economy defying expectations, unemployment staying low and Trump’s tariff threats largely petering out. That matches the assessment of The Economist’s British editor-in-chief Zanny Minton Beddoes, who said the mood among New York financiers at the Aspen Ideas Festival was insouciant, and ambivalent about the debt. “Call me a European grinch, but I felt I had arrived on planet Pangloss,” she told subscribers in a note after the “big, beautiful, bonkers” bill passed. “I worry that Trumponomics 2.0 is eroding the foundations of America’s economy in more fundamental ways than many people are willing to admit.” A trader works on the floor of the New York Stock Exchange on Tuesday. Credit: AP Ticking time bomb Steven Hamilton, an Australian assistant professor of economics at George Washington University, says the debate over how to measure the One Big Beautiful Bill’s impact on debt is moot. The point, he says, is that it presumes current policy can go on forever, and “letting current policy go on forever is nuts”. “Within 10 years, US debt to GDP will be approaching 130 per cent, which is well above any time in US history, well above World War II and beyond the level anyone really thinks is sustainable,” Hamilton says.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/benji-prickles-at-doueihi-questions-20250704-p5mcj8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Benji prickles at Doueihi questions",
        "publish_date": "Fri, 04 Jul 2025 11:43:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "Benji prickles at Doueihi questions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/i-ve-worked-in-childcare-for-50-years-this-is-the-worst-i-ve-seen-it-20250703-p5mc7c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’ve worked in childcare for 50 years. This is the worst I’ve seen it",
        "publish_date": "Fri, 04 Jul 2025 11:41:14 +1000",
        "category": "finance",
        "authors": [
            "Anne Stonehouse"
        ],
        "text": "I have worked for more than 50 years in early education and care as an academic, centre director, writer, consultant, resource developer and consultant with a focus on childcare experiences for birth-to-three-year-olds and partnerships with families. My interest has also been as a parent and a grandparent. I have never been more concerned about the sector than I am now.\n\nRevelations of abuse of children in Melbourne centres has shocked, enraged and sickened us all. We’re all deeply concerned for families who use the centres named. The crisis has also eroded the trust that families have in centres not directly affected. A previously satisfied parent whose children attend an excellent centre told me, “I was OK before, but now I need to be reassured that my child is OK.”\n\nNews of a Melbourne daycare worker being charged with abuse has rocked parents across Australia. Credit: iStock\n\nBut I reject the outdated and inaccurate “I-told-you-so” generalisations from some commentators who say that childcare is not good for young children and should be used only if necessary.\n\nI have had many insightful conversations with families over the years. For example, from the single parent of a child with complex behavioural challenges: “After a hard start to the day at home I can rock up to the centre and say, ‘Here he is, you take him, I’ve had it’, and they don’t judge me.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/that-real-hard-edge-dual-code-prodigy-leads-queensland-s-new-era-of-nrlw-stars-20250703-p5mcav.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘That real hard edge’: Dual-code prodigy leads Queensland’s new era of NRLW stars",
        "publish_date": "Fri, 04 Jul 2025 11:40:35 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Broncos NRLW superstar Tamika Upton has declared Reegan Hicks is in line to produce a breakout campaign, as the club seek to bounce back from their preliminary final exit last year.\n\nUpton, largely regarded as the game’s leading woman, will assume Brisbane’s co-captaincy alongside Ali Brigginshaw in 2025, having cast aside the hip injury that cost her a place in Queensland’s game three State of Origin side.\n\nWhile the former Dally M Medal winner described her time in rehab as a “blessing” in a chaotic year which had included a trip to Las Vegas with the Jillaroos, she kept an eye on the Broncos’ developing talent who loom as the future faces of the game.\n\nTamika Upton has returned to the Broncos for the first time in four years, having moved home after a stint in Newcastle. Credit: Getty Images\n\nHicks – who has been named as 19th woman for the Broncos’ opening round clash with the Tigers – came to the front of Upton’s mind when asked who was set to become an NRLW household name.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/to-be-a-resident-of-rickyland-you-need-to-pick-and-stick-20250626-p5majx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "To be a resident of Rickyland you need to pick and stick",
        "publish_date": "Fri, 04 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Roy Masters"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Ricky Stuart, coach of NRL ladder leaders, Canberra, doesn’t so much win games as avenge wrongs, overcome adversity and triumph over entrenched injustice. While siege mentality is embedded in his DNA, there is some justification for his conviction his club is perpetually under attack. The brand, Raiders, is a misnomer. They are the raided. I spoke to Stuart the day he learned his recruitment officer, Joel Carbone, had been poached by the Sydney Roosters. Carbone has been publicly lauded by Stuart for the recruitment of highly talented five-eighth Ethan Strange and a couple of other promising players yet to play NRL. “It’s so hard losing players,” Stuart says, admitting that after local junior Jack Wighton announced his exit in April 2023, he vowed to resign at the end of that season if Canberra failed to make the semis. The club came eighth. Jack Wighton jumped from Canberra to the Rabbitohs’ carrot. Credit: John Shakespeare “It wears you down losing players you’ve developed and staff you’ve promoted,” he said. “We are a successful club off the field but we don’t have billionaires. We are the raided, as you say.” His nickname is Sticky, a derivative of the reversal, by a house mate, of the first letter of his names: Sticky Ruart.\n\nAdvertisement\n\n“It’s stupid but it stuck,” he says. It’s also accidental nominative determinism because Stuart is a charter member of the pick and stick club. Rickyland is his domain. He staked out its borders long ago: a narrow ridge of volcanic land with outsiders either side. It’s a place where you trust almost no-one from outside the territory but like to be seen as completely trustworthy yourself. It’s a region where he proclaims no-one’s dignity is at risk but foolish errors are punished for only the fool’s eyes to see. “I’ve always been a guy to coach for his players and there have been a number of times where I’ve had to stick by the player but let the player know he’s done the wrong thing privately,” he says, conjuring up images of a guilty player standing in front of Stuart, as children do when telling their father they have wrecked the family car. “Publicly, I protect him, put my arm around him but privately I tell him what was wrong. I’ve always wanted to be that type of coach.”\n\nAdvertisement\n\nSo, if an outsider, such as a journalist, challenges one of his players, you measure Ricky’s blast in megatonnes. For example, when Stuart coached the Roosters to the 2004 grand final and I questioned the effort level of winger Chris Walker ahead of the game, he went on TV suggesting I should address my own “personal problems.” After a careful self-examination of my possible private demons, I did cut back on the schooners. But only that particular evening. Ricky Stuart and Chris Walker face the media in 2003. Credit: Getty Images AsiaPac And it wasn’t long before I was invited onto Rickyland to join his NSW team in the Origin series in 2005. There are those permanently banished from Rickyland, such as Penrith’s Jaeman Salmon whom he called a “weak-gutted dog” and was fined by the NRL. Nick Politis was his chairman when Stuart coached the Roosters to the 2002 title at age 37. Politis’s support extended to paying his fines for criticism of referees. Former NRL chief executive David Gallop recalls, “I fined Ricky and a cheque landed on my desk the following day, a personal one signed by N G Politis, who clearly approved of his comments.” However, Ricky’s comment above about “billionaires” suggests Politis is no longer a paid up member of Rickyland, with the poaching of Carbone affirming this.\n\nAdvertisement\n\nWhen Stuart was the Bulldog’s waterboy while recovering from a knee injury, he refused to give one senior forward a drink. “I don’t remember those days,” he says with a knowing chuckle. “I’m not proud of some of the things I’ve said. I know I’m volatile but it’s a volatile game. I stick up for what I think is right.” The TV cameras have a close view of Stuart on game day because he is the only NRL coach who positions himself on the sideline. When I raised the possibility of his gaining a tactical advantage insofar as his volcanic presence intimidated referees and touch judges, a prolonged pause suggested I was about to be banished from Rickyland. “That’s a load of shit,” he finally said. “Laughable.” But a Storm player claims he copped a Ricky barb within the hearing of the referee and touch judge in the emotion charged final Magic Round match in Brisbane when the Storm took a seven-point lead late in the game, only for the referee to sight a Melbourne breach in a tackle and cancel the field goal. Ricky Stuart celebrates with Brad Fittler after winning a title in 2002. Credit: Craig Golding Later in our interview, Ricky returns to the sideline question, saying, “I hate the cameras on the sideline but it’s where I feel I coach the best. My three coaches – Tim (Sheens), Bozo (Bob Fulton) and Gus (Gould) - all coached from the sideline. I get the feeling of what the players are going through. I can’t get that in a sterile coach’s box. “I like to see the energy and emotion of the player when he comes on and off the field. I like that feel between a coach desperate to win and his players\n\nwanting the same.”\n\nAdvertisement\n\nHe swallows losses as if they were castor oil and would rather chew on balls of alfoil than praise a rival coach he does not like. When a delegation of his players tactfully pointed out Ricky’s negativity following a loss risked becoming contagious, particularly with NRL short turnarounds, he volunteered to disappear. “I had to have a good look at myself,” he said. “I didn’t want to have a beer with my mates and sour the company. So I distanced myself.” He is an old school coach, in this respect. Studying the demeanour of many mentors post match, it’s difficult to know whether their team won, or lost. Again Stuart makes no apology for how he feels, pointing out that being comfortable after a loss will guarantee more losses. “Being sour after losing, is not something I practise,” he says, perhaps tired of having to shadow box his reputation. Stuart has a beer with former Raider teammate and now-Melbourne coach Craig Bellamy after games between their two clubs. He even has a photo on his desk of the pair looking very inebriated in their playing days. But when the Raiders were challenging the Storm for semi-final places 2018-19, Melbourne assistants pointed to stories in a Sydney newspaper highlighting illegal wrestling tactics at Bellamy’s club. Was this Stuart’s super competitiveness in seeding stories, as many top coaches such as Jack Gibson and Fulton, did? Or a journalist seeking to ingratiate himself with the Canberra coach? Still a loyal teammate Bellamy isolated himself from the discussion.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/could-you-eat-60-hot-dogs-in-10-minutes-one-aussie-is-about-to-try-20250703-p5mc8t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could you eat 60 hot dogs in 10 minutes? One Aussie is about to try",
        "publish_date": "Fri, 04 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "He wolfed down 41 hot dogs in ten minutes in his first year. Then 47 hot dogs. Then 52.\n\nOn Saturday morning, Sydneysider James Webb will take to the stage in front of 50,000 people in New York, on US Independence Day, and attempt to smash through 60 hot dogs at their annual Nathan’s Famous Hot Dog Eating Contest.\n\nSydneysider James Webb will be try to eat 60 hotdogs in ten minutes this weekend in the US. Credit: ESPN\n\nWebb has been on the Major League competitive eating circuit the past three years, where he has won more than 20 events.\n\nHe holds several records, including most glazed doughnuts (70 in eight minutes), 276 buffalo wings in 12 minutes, 224 grilled chicken wings in ten minutes, and 350 doughnut holes in eight minutes. There’s also a Guinness World Record for eating 1kg of mozzarella without hands in 1minute 22.59 seconds.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/one-of-brisbane-s-best-sushi-restaurants-is-finally-complete-20250703-p5mc61.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "One of Brisbane’s best sushi restaurants is finally complete",
        "publish_date": "Fri, 04 Jul 2025 11:37:02 +1000",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outFood One of Brisbane’s best sushi restaurants is finally complete It opened in 2021, but not to the owner’s original specifications. Now, there’s a new entrance, dining area and bar. “When you walk in now, there’s that sense of arrival.” Matt Shea July 4, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nSushi Room is complete. What’s now often regarded as Brisbane’s best sushi restaurant may have opened in 2021, but not to owner Simon Gloftis’ original specs. The wrinkle? An existing ground-floor tenant on the Doggett Street side of The Calile. Sushi Room beneath The Calile has reopened with a new bar and dining section and entrance. Markus Ravik It meant a rework, with the intended street-side entrance relocated to a nondescript door just off The Calile lobby. It gave Sushi Room a low-key, hidden vibe, but Gloftis was never entirely happy with it.\n\nAdvertisement\n\n“I always felt it needed a sense of arrival, a place like Sushi Room,” Gloftis says. “It’s a very special room, a really special environment … walking in off The Lobby Bar was OK, but it didn’t feel like you’d arrived anywhere. It felt a bit too easy.” Related Article Expect queues out the door at this hot new King Street patisserie As of late May, though, Sushi Room is a restaurant transformed. The Doggett Street tenant is gone, the former shopfront transformed into a new bar and al fresco dining area that, yes, also acts as the restaurant’s entrance. In charge of the fit-out was regular Gloftis designers Richards & Spence. Compared with the soft moodiness of the restaurant dining room, the Brisbane-based firm has leant the new space a bolder, more approachable design that suits its street-side location, with upholstered booths, a striking marble bar and a mirrored ceiling installation. Outside, brushed-steel furniture lines the sidewalk, while inside a noren curtain leads the way to the original restaurant.\n\nAdvertisement\n\nA noren curtain separates the new bar and dining area from the original restaurant. Markus Ravik The new space is designed to be versatile — diners can use it to start or finish the night, or dine there a la carte — and gives the restaurant more scope to handle walk-ins. “When you walk in there now, there’s that sense of arrival,” Gloftis says. “You go into the bar, through the noren curtain and into the dining room proper, and it’s oriented the right way. You walk in and all the sushi chefs are standing in front of you. “The restaurant deserved that treatment. I couldn’t be happier.” The new dining area features a terrazzo bar, mirrored features and banquette seating. Markus Ravik\n\nAdvertisement\n\nThe central dining room remains much the same: there’s still the 9.3-metre imported enoki dining counter, and still the bright-red private dining room upstairs. The menu remains much the same, and continues to leverage Gloftis’ deep connections with local suppliers and fishers: there’s alfonsino, fatty tuna and vinegared mackerel nigiri; mud crab and tempura prawn hand rolls; and toothfish and Kagoshima A5 rib eye cooked on the hibachi. Guests can order either a la carte or choose a $330 omakase experience. Sushi Room’s central dining room remains much the same, and retains its signature 9.3-metre imported enoki dining counter. Markus Ravik “We’ve had some time off so we’ve improved a couple of little things,” Gloftis says. “We’ve added a beautiful little wakame salad and a couple of other little raw dishes that are really nice, but the bulk of the menu is 90 per cent the same.” Gloftis likes to talk of a meal at Sushi Room as a journey, and reckons the updated restaurant completes that journey.\n\nAdvertisement\n\n“It does,” he says. “The way the restaurant is set out now, people say, ‘It’s totally changed.’ And they look around and you go, ‘No, actually it hasn’t.’ It’s just that you’ve walked in a different door. You’re facing the right way. It just feels right.” Open Tue-Thu 5.30pm-late; Fri-Sat 12pm-2.30pm, 5.30pm-late The Calile Hotel, 48 James Street, Fortitude Valley, (07) 3741 5976 st-albans.com.au/venues/sushi-room\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/why-sydney-s-oldest-home-has-been-stuck-in-a-long-limbo-20250623-p5m9j0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Sydney’s oldest home has been stuck in a long limbo",
        "publish_date": "Fri, 04 Jul 2025 11:34:42 +1000",
        "category": "finance",
        "authors": [
            "Josefine Ganko",
            "Julie Power"
        ],
        "text": "The spokesperson said Heritage was working closely with LGS to ensure the approved conservation works were completed as quickly as possible. This would include the roof, gutters, downpipes and reconstruction of the former chimneys. But Heritage was unaware that all work on the site had been stopped since August 2023, after a stop-work order was issued by the City of Sydney, which has delegated authority on all heritage properties in its local government area. This was issued, the council said, after the owner started work on a verandah awning without consent. Once a construction certificate is issued, the stop-work order will be lifted and works can continue under the approved DA. A spokesperson said: “Council does all it can within its powers to conserve and protect heritage items”.\n\nOn the Cleveland House website, Vincent said the stop-work order came after a member of the public complained. He said it had prevented “urgent and necessary repairs to the roof and exposes the building to potential damages being wrought from the increased weather elements being experienced in our time”. This saga is typical of negotiations between Vincent, who bought the property in 1988, the City and Heritage NSW over the past 15 years. A stop-work order was issued on Cleveland House in Surry Hills in August 2023. Credit: Nick Moir LGS has received two NSW heritage grants for conservation works, the first in 2011-13 and, more recently, a $30,000 heritage grant in the 2023-25 round. Vincent was granted an extension to complete the works funded by the grants because he had obtained the required heritage and construction approvals.\n\nVincent has criticised delays in getting approval on his website and Facebook page. They detail how some applications for remedial work were rejected by Heritage NSW and how other development approvals were also rejected by council. Last October, his website celebrated a win in his bid to build a new toilet block, saying: “Finally, after four years of communications it appears that the outstanding GTAs [General Terms of Approval] relating to the construction of the new toilet block may have been resolved”. Loading Five development applications by LGS Enterprises for works totalling more than $500,000 have been approved by the City of Sydney since 2014. More were lodged before that. Some have timed out because they are older than five years. Other works got the go-ahead from the Heritage Council in 2011. The approvals provide for improvements to the commercial parts of the building, previously used by a publishing company, a new period fence, changes to windows, doors and the verandah. Other approvals relate to heritage materials.\n\nWhen it was listed by the National Trust in 1973, the home was described as an excellent example of colonial Georgian domestic architecture. It had two “curious entrance doors”, a “splendid exterior staircase”, fan-lighted doors, and it was “rich in cedar joinery”. Vincent has repeatedly updated the house’s Facebook page to announce that restoration works would begin imminently, only for those works to stop. The Herald has been asking the owner to comment on the property’s progress since 2022. Vincent has declined to answer, other than saying he could reveal more in “six months”. He often says “sensitive negotiations” are continuing. A Friends of Cleveland House Facebook update said, “The reasons for the slow movements on the restoration of this building are entirely due to the ridiculous heritage and Sydney councils with whom we have been fighting for more than 10 years. We have now obtained (after much headache) approvals for most of what we are planning to restore this beautiful building, so I think you will see some substantial improvements throughout 2024.” In early 2022, an update on the group’s Facebook page said works would be completed in “mid to late 2023”.\n\nLoading In mid-2021, COVID lockdowns were blamed for delays, with a promise that work would continue “when things open again”. This week, he said it was a “delicate period” and he didn’t want to “enter into discussion which may affect the progress forward”. Delays are common in historic properties. These can include unexpected finds – a house in Bellevue Hill found unexploded ordnances, and a major institution discovered its old building didn’t have footings. The planning and approval process is complicated, and work requires specialised trades and is expensive. Locals now hope for a breakthrough. “Everyone is over it,” said a neighbour, declining to be named. “And they realise what a beautiful home it was and how important it is historically, but there doesn’t ever seem to be any progress.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/vera-wang-surprises-nine-year-old-budding-designer-20220314-p5a4jw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Vera Wang surprises nine-year-old budding designer",
        "publish_date": "Fri, 04 Jul 2025 11:32:58 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Vera Wang surprises nine-year-old budding designer\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/papalii-arrives-with-his-future-clouded-but-now-he-can-cement-his-legacy-20250703-p5mccj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Never say never’: Why Maroons’ saviour won’t rule out staying in NRL",
        "publish_date": "Fri, 04 Jul 2025 11:31:40 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Arriving in camp Maroon fresh off celebrating the birth of his son, Josh Papalii admits he remains uncertain of what lies beyond 2025. The veteran enforcer is eager to play on, yet it appears all but certain it will not be for his beloved Canberra Raiders. It has led to suggestions he could embark for a stint in England, but what he did confirm was this would be his final Queensland hurrah. “Overtaking Jason Croker down there with the most games for Canberra Raiders is very special, and that’s how I want to keep it,” Papalii said. “But if the team that you’re playing for is not offering you another contract, and you want to play on, you’ve obviously got to look elsewhere. “I’m still unsure, I feel like I still got a lot to offer as a player and as a mentor and just being an older head. “Never say never. I still feel like I’ve got a lot of footy in me, whether that’s in the NRL or Super League.” Josh Papalii\n\nAdvertisement\n\nBut when Maroons coach Billy Slater dialled his number, there was no uncertainty around Papalii’s decision to end his State of Origin hiatus, having retired from representative rugby league on the eve of the 2023 series. “I missed the first couple of calls because my little fella and my wife were still in hospital at the time and there were a few complications with my little one,” Papalii revealed. Loading “I spoke to Bill when I had that little break, and he asked me one question and said if I had one more game in me. I replied with an ‘F Bomb’ and said yes, I had one more left. “It’s definitely my last … I’m still buzzing just being back in Maroon.” Papalii enters Queensland’s Sunshine Coast camp with an aura the rest of an under siege forward pack is eager to feed off. Despite forcing a decider, the Maroons engine room has been unable to dominate their New South Wales rivals – spearheaded by Broncos’ superstar Payne Haas.\n\nAdvertisement\n\nThose south of the border questioned why Queensland brought a 33-year-old out of the wilderness to match them up front, given he has not experienced the game’s most daunting furnace for three years. According to fellow Maroons prop Tino Fa’asuamaleaui, the doubters could not be more wrong, but they would have to wait for the reason to be revealed. “We’ve just got to wait until Wednesday, that’s all I’ve got to say. They can say whatever they want, but we know what Paps brings to this team, and they obviously don’t know that,” Fa’asuamaleaui said. “He’s one of my idols, he’s in my top five players that I’ve ever played with, if not number one. He just brings that confidence for the whole group. “His aura, he’s a gentle giant, and he loves a laugh, and he just brings everyone together. The aura he has just gives us confidence to do our role, and we just get behind it.” The numbers across the opening two 2025 encounters is telling for the influence and physicality Papalii can inflict in the decider in Sydney.\n\nAdvertisement\n\nThe Blues have run for more post-contact metres (1091 to 856) and tackle busts (80 to 52), while even in their Perth victory Queensland were kept to less than 30 metres per set on average. Even Fa’asuamleaui has been below his best – his 90 running metres a game a complete contrast to 151 he has produced for the Gold Coast. Loading Papalii’s SOS led to the axing of Moeaki Fotuaika, who after copping the brunt of criticism in game one – running for 38 metres from four carries – produced a far more emphatic 23-minute stint. “I think everyone sees the errors that myself and he’s made and think that’s our whole performance,” Fa’asuamaleaui said. “But it’s much bigger than that. Our teammates, our coaching staff, know what we bring. I thought Moe’s been very good, and he was unlucky to miss out on this camp, but he’ll be rooting for us.” Even 321 NRL and 23 Origin games into his career, Papalii has found a way to remain the wrecking ball which made him a Raiders and Maroons legend – with approximately 40 per cent of his total metres this season post-contact.\n\nAdvertisement",
        "source": "TheAge"
    }
]