[
    {
        "url": "https://www.9news.com.au/world/elon-musk-donald-trump-spat-white-house-dispute-us-politics-news/62074944-e753-404a-af28-588d80c39914",
        "title": "Musk could lose billions of dollars depending on how spat with Trump unfolds",
        "publish_date": "Fri, 06 Jun 2025 23:43:12 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "The world's richest man could lose billions in his fight with world's most powerful politician.\n\nThe feud between Elon Musk and Donald Trump could mean Tesla's plans for self-driving cars hit a roadblock, SpaceX flies fewer missions for NASA, Starlink gets fewer overseas satellite contracts and the social media platform X loses advertisers.\n\nMaybe, that is. It all depends on Trump's appetite for revenge and how the dispute unfolds.\n\nREAD MORE: Musk lobs unfounded Epstein accusation at Trump\n\nElon Musk and Donald Trump have had a nasty falling out. (AP)\n\nJoked Telemetry Insight auto analyst Sam Abuelsamid, \"Since Trump has no history of retaliating against perceived adversaries, he'll probably just let this pass.\"\n\nTurning serious, he sees trouble ahead for Musk.\n\n\"For someone that rants so much about government pork, all of Elon's businesses are extremely dependent on government largesse, which makes him vulnerable.\"\n\nTrump and the US federal government also stand to lose from a long-running dispute, but not as much as Musk.\n\nTesla robotaxis\n\nThe dispute comes just a week before a planned test of Tesla's driverless taxis in Austin, Texas, a major event for the company because sales of its EVs are lagging in many markets, and Musk needs a win.\n\nTrump can mess things up for Tesla by encouraging federal safety regulators to step in at any sign of trouble for the robotaxis.\n\nEven before the war of words broke out on Thursday, the National Highway Transportation Safety Administration requested data on how Musk's driverless, autonomous taxis will perform in low-visibility conditions. That request follows an investigation last year into 2.4 million Teslas equipped with full self-driving software after several accidents, including one that killed a pedestrian.\n\nA spokesman for NHTSA said the probe was ongoing and that the agency \"will take any necessary actions to protect road safety.\"\n\nThe Department of Justice has also probed the safety of Tesla cars, but the status of that investigation is unclear. The DOJ did not respond immediately to requests for comment.\n\nThe promise of a self-driving future led by Tesla inspired shareholders to boost the stock by 50 per cent in the weeks after Musk confirmed the Austin rollout. But on Thursday, the stock plunged more than 14 per cent amid the Trump-Musk standoff. On Friday, it recovered a bit, bouncing back nearly 4 per cent.\n\n\"Tesla's recent rise was almost entirely driven by robotaxi enthusiasm,\" said Morningstar analyst Seth Goldstein. \"Elon's feud with Trump could be a negative.\"\n\nREAD MORE: Tesla suffers wipeout as investors walk away\n\nDonald Trump has been trading barbs with Elon Musk. (AP)\n\nCarbon credits business\n\nOne often-overlooked but important part of Tesla's business that could take a hit is its sales of carbon credits.\n\nAs Musk and Trump were slugging it out Thursday, Republican politicians inserted new language into Trump's budget bill that would eliminate fines for gas-powered cars that fall short of fuel economy standards. Tesla has a thriving side business selling \"regulatory credits\" to other automakers to make up for their shortfalls.\n\nMusk has downplayed the importance of the credits business, but the changes would hurt Tesla as it reels from boycotts of its cars tied to Musk's time working for Trump.\n\nCredit sales jumped by a third to A$892.5 million in the first three months of the year even as total revenue slumped.\n\nReviving sales\n\nMusk's foray into right-wing politics cost Tesla sales among the environmentally minded consumers who embraced electric cars and led to boycotts of Tesla showrooms.\n\nIf Musk has indeed ended his close association with Trump, those buyers could come back, but that's far from certain.\n\nMeanwhile, one analyst speculated earlier this year that Trump voters in so-called red counties could buy Teslas \"in a meaningful way.\" But he's now less hopeful.\n\n\"There are more questions than answers following Thursday developments,\" TD Cowen's Itay Michaeli wrote in his latest report, \"and it's still too early to determine any lasting impacts.\"\n\nMichaeli's stock target for Tesla earlier this year was A$582. He has since lowered it to A$495. Tesla was trading Friday at A$450.\n\nTesla did not respond to requests for comment.\n\nTesla Cybertrucks are displayed at the AutoMobility LA Auto Show. (AP)\n\nMoonshot mess\n\nTrump said Thursday that he could cut government contracts to Musk's rocket company, SpaceX, a massive threat to a company that has received billions of federal dollars.\n\nThe privately held company that is reportedly worth A$525 billion provides launches, sends astronauts into space for NASA and has a contract to send a team from the space agency to the moon next year.\n\nBut if Musk has a lot to lose, so does the US.\n\nSpaceX is the only US company capable of transporting crews to and from the space station, using its four-person Dragon capsules. The other alternative is politically dicey: depending wholly on Russia's Soyuz capsules.\n\nMusk knew all this when he shot back at Trump that SpaceX would begin decommissioning its Dragon spacecraft. But it is unclear how serious his threat was. Several hours later — in a reply to another X user — he said he wouldn't do it.\n\nStarlink impact\n\nA subsidiary of SpaceX, the satellite internet company Starlink, appears to also have benefited from Musk's once-close relationship with the president.\n\nMusk announced that Saudi Arabia had approved Starlink for some services during a trip with Trump in the Middle East last month. The company has also won a string of other recent deals in Bangladesh, Pakistan, India and elsewhere as Trump has threatened tariffs.\n\nElon Musk accused Donald Trump of being in the Epstein files. (AP)\n\nIt's not clear how much politics played a role, and how much is pure business.\n\nOn Friday, The Associated Press confirmed that India had approved a key license to Starlink. At least 40 per cent of India's more than 1.4 billion people have no access to the internet.\n\nAd revival interrupted\n\nBig advertisers that fled X after Musk welcomed all manner of conspiracy theories to the social media platform have started to trickle back in recent months, possibly out of fear of a conservative backlash.\n\nMusk has called their decision to leave an \"illegal boycott\" and sued them, and the Trump administration recently weighed in with a Federal Trade Commission probe into possible coordination among them.\n\nNow advertisers may have to worry about a different danger.\n\nIf Trump sours on X, \"there's a risk that it could again become politically radioactive for major brands,\" said Sarah Kreps, a political scientist at Cornell University. She added, though, that an \"exodus isn't obvious, and it would depend heavily on how the conflict escalates, how long it lasts and how it ends.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/breast-cancer-fresh-hope-for-breast-cancer-patients-amid-promising-drug-trial-results/d5c7760c-f234-41fc-8cf6-90f07fde118a",
        "title": "Wendy's cancer might be incurable, but she just wants to help future patients",
        "publish_date": "Fri, 06 Jun 2025 21:08:31 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "When ﻿Wendy Clift went for a routine breast scan in 2007, she got call from her doctors almost immediately.\n\n\"The news wasn't good,\" the widowed grandmother of two from Scone in regional NSW told 9news.com.au.\n\nClift had breast cancer.\n\n﻿Wendy Clift was diagnosed with breast cancer in 2007. (Supplied)\n\nJust days later, she had a mastectomy, followed by more treatment.\n\nWhile it was successful in keeping her in remission for a few years, the cancer has now returned and it has spread.﻿\n\nHowever, Clift, now 72, was invited to be part of a new Australian drug trial.\n\nIt's hoped it could help patients with a certain kind of breast cancer live longer.\n\nThe DIAmOND clinical trial showed adding dual immunotherapy to existing treatments could be promising for some patients with advanced HER2-positive breast cancer.\n\nClift said her cancer appears to be \"pretty stable\" after the trial earlier this year, which she did at Lake Macquarie Private Hospital.\n\nREAD MORE: Australia among highest rate of breast cancer diagnoses globally ﻿\n\nSome of the cancerous lumps she had have even disappeared, though she doesn't know if that's due to the new drug combination.\n\nClift said she didn't have side effects.\n\nShe said taking part in the trial was less about her and more to help future patients.\n\n\"I'm just prepared because whatever happens to me is neither here nor there, but hopefully in years to come it'll help somebody else,\" she said.\n\nImmunotherapy is a treatment that uses a person's immune system to treat certain cancers.\n\n﻿Wendy Clift, pictured with son Joshua and grandchildren Florence and Arthur, says she just wants to help future cancer patients. (Supplied)\n\nThe other drug used alongside this in the trial was trastuzumab, commonly known as Herceptin.\n\nThe trial aimed to see if combining the two could ﻿prolong the amount of time cancer was under control in patients with advanced disease which had become resistant to trastuzumab.\n\nResults differed depending on the kind of cancer each of the 68 trial patients had.\n\n﻿Some had a response rate of up to 63 per cent, while for other kinds it was 27 per cent.\n\nSome patients saw their cancer controlled for more than two years.﻿\n\nThe combination of drugs has been given previously to people with lung cancer.\n\nProfessor Sherene Loi developed and led the trial, which was conducted by the research organisation Breast Cancer Trials.\n\n\"These promising results suggest combining new immunotherapy treatments with trastuzumab may offer a new treatment option for patients with treatment-resistant HER2-positive breast cancer,\" Loi said.\n\n\"These findings provide a compelling case for further exploration and how we can best integrate this treatment combination into clinical practice.\"\n\nREAD MORE: Professor Richard Scolyer reveals brain cancer is advancing after its return ﻿\n\nWhat is ﻿HER2-positive breast cancer?\n\nHER2-positive breast cancer is a type of breast cancer that tests positive for a protein called human epidermal growth factor receptor 2 (HER2).\n\nIt tends to grow faster compared with HER2-negative ones, Breast Cancer Trials says.\n\nHowever, it often responds well to specific treatments.\n\nAround 15-20 per cent of all types of breast cancers are HER2-positive.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/health/health-the-real-number-of-steps-you-need-to-do-to-lose-weight/60f5206d-644d-44a9-b237-546d7b0976b9",
        "title": "The real number of steps you need to do to lose weight",
        "publish_date": "Fri, 06 Jun 2025 21:07:57 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "In today's age of smartwatches and Fitbits, it's hard to go for more than a few hours without taking a sneaky peak at your daily step count.\n\nWhether it's the endorphin rush from the celebratory ping to inform you that you've hit 10,000 steps, or the nagging sense of shame that comes with the realisation you've done less than 2,000 – as happens on some of my busier days glued to my desk – step counts have become part of our lives.\n\nBut they're not just a gimmick.\n\nResearch is increasingly showing that your daily step count, especially when averaged out across months and years, makes a huge difference to your disease risk and how long you can expect to live. (Getty)\n\nResearch is increasingly showing that your daily step count, especially when averaged out across months and years, makes a huge difference to your disease risk and how long you can expect to live.\n\nAnd the case for not moving more makes for sober reading: according to the Government's official statistics, physical inactivity is responsible for one in six otherwise preventable deaths.\n\nMonitoring step counts makes it easier to track whether we're being active or not.\n\nBut while 10,000 is often seen as the magic number, it originates from a Japanese marketing campaign ahead of the 1964 Tokyo Olympics, rather than hard science.\n\nSo how can increasing your step count make a difference to your health and how do different thresholds reduce your disease risk?\n\nAnd, perhaps more importantly, what really is the optimal number you should be aiming to hit a day?\n\nWalk 2000-3000 to reduce your risk of heart disease\n\nTwo years ago, an international scientific collaboration published one of the largest studies so far to examine the long-term relationship between step count and health.\n\nCombining data from more than 111,000 individuals from various electronic health records, it indicated that the lower limit for health benefits lies in the range of 2,000 to 3,000 steps per day.\n\nThis equates to just over a mile of total walking from the moment you wake up to when you go to sleep.\n\nThe benefits appear most acute when it comes to heart health.\n\nPublished in the Journal of The American College of Cardiology , it suggested that between 2,517 and 2,735 steps per day already reduces risk of cardiovascular disease by 11 per cent compared to those who did just 2,000 steps.\n\nWhile 10,000 is often seen as the magic number, it originates from a Japanese marketing campaign ahead of the 1964 Tokyo Olympics, rather than hard science. (Getty)\n\nSimilar findings emerged from another study published last year by researchers at the University of Sydney.\n\nBased on data from more than 72,000 British people in their early 60s, it showed that anything beyond 2,200 steps per day will already make some difference to your heart health and even your short-term risk of dying from another cause.\n\nREAD MORE: Huge eruption in Italy leaves tourists fleeing volcano\n\n\"We ideally would want 8,000 to 10,000 steps a day, but for people who are inactive, that amount may seem like a mountain and unachievable,\" says Matthew Ahmadi, a researcher at the University of Sydney.\n\n\"It's about setting initial targets that are achievable, and then gradually working your way up to more daily steps as you build up your capacity to handle more activity.\"\n\nWalk 4000 steps to reduce your risk of dementia\n\nHitting 4,000 steps a day, based on the Sydney research, can reduce your risk of a premature death from any chronic disease by 20 per cent, particularly if you're middle aged.\n\nBut one of the most crucial things about reaching the 4,000-5,000 daily step count is that it starts to reduce your risk of cognitive decline.\n\nMan armed with plastic bags defies world's biggest army View Gallery\n\nThree years ago, a study of more than 78,000 Britons aged 40 to 79, who were regular smartwatch or Fitbit wearers, showed that 3,800 steps appears to be the minimum daily dose of exercise required to preserve your mental faculties.\n\nPeople who averaged this number of steps each day were found to have a 25 per cent lower risk of dementia compared with those who did less.\n\n\"This step count equates to roughly 35-45 minutes of light to moderate intensity walking per day, depending on your pace, which aligns well with [public health] guidelines,\" says Dr Borja del Pozo Cruz, a scientist at the European University of Madrid, who carried out the study.\n\n\"This is likely because of improved blood flow to the brain, reduced brain inflammation, better metabolism of glucose in the brain, and an increase in beneficial brain chemicals which stimulate neuron growth.\"\n\nWalk 7000 steps to lower your risk of depression\n\nThis seems to be the threshold at which the benefits become even more significant.\n\n7,000 steps are equivalent to just over three miles of walking, and it seems to be highly relevant for mental wellbeing.\n\nA new study published in December – which collated research from 33 different studies, comprising around 100,000 people – found that those who take 7,000 steps per day have a 31 per cent lower risk of depression.\n\n\"7,000 steps is starting to be considered a more active lifestyle, while less than 5,000 steps is a sedentary lifestyle,\" says Dr Bruno Bizzozero Peroni, a researcher at the University of Castilla-La Mancha who authored the study.\n\n\"It definitely seems that somewhere between 7,000 and 10,000 steps has a protective effect against depression, while at the moment there doesn't appear to be any evidence of additional benefits for mental health of doing more than 10,000 steps.\"\n\nAn average of 7,126 steps per day has also been shown to reduce risk of cardiovascular disease by 51 per cent, compared with people who did just 2,000 steps.\n\nSo do you really need to reach 10,000 steps per day?\n\nThis target which equates to around five miles of walking, or an hour and 40 minutes, if you were going to do the full amount of steps in one go can seem somewhat daunting. But as so often is the case in health and medicine, the answer is somewhat complex.\n\nAround 9,800 steps per day has been found in some studies to be the 'optimal dose' of exercise to lower risk of dementia.\n\nBut as with depression, it appears that you can still substantially reduce your risk of various chronic diseases, with a little less.\n\nFor example, some have found that approximately 8,800 steps per day reduces risk of premature death from a whole range of diseases by 60 per cent.\n\n\"More steps means better blood vessel function, less inflammation, and enhanced brain plasticity – the formation of new connections in the brain – which are crucial for cognition,\" says Dr Del Pozo Cruz.\n\nAll this means is that 10,000 steps is not necessarily the magic number after all. It appears that 9,000 is more than sufficient.\n\n7,000 steps are equivalent to just over three miles of walking, and it seems to be highly relevant for mental wellbeing. (Getty)\n\nHow many steps should I do a day to lose weight?\n\nLosing weight requires you to be in calorie deficit, so Dr Ahmadi points out that steps alone aren't sufficient, you also need to cut down on the amount you're consuming.\n\n\"However, what we do know is that activity can improve our cardiometabolic health even if you don't lose weight,\" he says.\n\nWhile research has shown that reaching 10,000 steps per day will increase your chances of losing weight, the more important aspect with weight loss is the intensity of exercise, not the number of steps.\n\nResearchers advise more vigorous intensity exercise but it doesn't have to be jogging or playing sport.\n\n\"You can get to vigorous intensity, just with brisk walking,\" says Catrine Tudor-Locke, a professor at the University of North Carolina at Charlotte. \"It doesn't have to be running.\"\n\nHow many calories will you burn while walking?\n\nWeight 2,000 steps 5,000 steps 7,000 steps 10,000 steps 54kg 50-60 calories 125-150 calories 175-210 calories 250-300 calories 70kg 70-80 calories 175-200 calories 245-280 calories 350-400 calories 84kg 80-90 calories 200-225 calories 280-315 calories 400-450 calories\n\nDoes walking burn a lot of calories?\n\nThis largely depends on your weight, as the more body fat you're carrying, the more calories you're likely to burn, as the body uses up more energy when it comes to moving additional weight stored in the form of fat tissue.\n\nHowever, the below represents a rough guide.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/weather-cold-snap-to-envelop-southeast-states-this-long-weekend/dfaff66f-447b-408d-90e1-5089e0e53173",
        "title": "Thunderstorms, hail and snow to batter states this long weekend",
        "publish_date": "Fri, 06 Jun 2025 05:17:44 +0000",
        "category": "entertainment",
        "authors": [
            "Jun"
        ],
        "text": "An icy combination of thunderstorms, hail and snow is set to envelop the south-eastern states this long weekend.\n\nA low-pressure system is driving a cool blast of air over New South Wales, the ACT, Victoria, South Australia and Tasmania from today through to the King's Birthday public holiday on Monday. ﻿\n\nIt will bring rain and hail ﻿over large parts of the states, according to Weatherzone.\n\nAn icy combination of thunderstorms, hail and snow is set to envelop the south-eastern states this long weekend. (Weatherzone)\n\nThe Bureau of Meteorology forecasts temperatures to fall to sub-zero in Canberra, four degrees in Hobart, six degrees in Adelaide and Melbourne and eight degrees in Sydney.\n\nThe cold weather, coupled with clouds and wind, will leave conditions feeling even cooler than forecast.\n\nIt will lead to some ﻿low-level to heavy snowfall in mainland alpine regions from tomorrow into at least Tuesday, according to Weatherzone.\n\n﻿The system is expected to deliver enough natural snow to start off the ski season in NSW, the ACT and Victoria this winter.\n\nREAD MORE: ﻿ Jury unable to reach verdict for brothers over fatal grand final fight\n\nTourists come across extraordinary sight at Uluru View Gallery\n\nMt Hotham﻿ is forecasting up to 60cm of snow, and Perisher is expecting 2cm.\n\nConditions will pick up in the south-eastern states tomorrow and move north on Sunday before beginning to clear on Monday.\n\nThe remaining states and territories will experience mostly dry conditions over the long weekend.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/playstation-unveils-new-hardware-and-games-at-state-of-play-event/85eadc52-6169-4399-94bb-1c02856bde68",
        "title": "New games and hardware unveiled by PlayStation",
        "publish_date": "Thu, 05 Jun 2025 02:49:55 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Marvel heroes and villains come together for a new tag-team fighter developed by Arc System Works, developers of classic fighting game\n\nGuilty Gear\n\n. Play as Captain America, Spider-Man, Dr Doom and more.\n\nMARVEL Tōkon: Fighting Souls\n\nis coming to PlayStation 5 in 2026.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/pm-insists-biosecurity-is-first-priority-as-beef-tops-agenda-in-upcoming-us-trade-talks/61f0d34b-0310-497f-9397-3a0b527535c4",
        "title": "PM insists biosecurity is 'first priority' as beef tops agenda in upcoming US trade talks",
        "publish_date": "Fri, 06 Jun 2025 11:31:19 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Prime Minister Anthony Albanese has vowed not to compromise biosecurity as trade negotiations over beef are set to top the agenda in crucial talks with US President Donald Trump.\n\nTrump singled out Australia's ban on US beef during a Liberation Day tariff announcement in April , claiming ﻿Australia \"won't take any of our beef\" due to a concern over mad cow disease.\n\nCattle Australia disputes that claim﻿, because a ban on US beef was lifted in 2019, provided the cattle is born, raised and slaughtered in the US.\n\nPrime Minister Anthony Albanese has vowed not to compromise biosecurity as trade negotiations over beef are expected to top the agenda in crucial talks with US President Donald Trump. (9News)\n\nBut concerns over \"mixed herds\" mean beef from the US rarely makes it to Australian plates.\n\nUS exporters are currently unable to prove their herds don't include beef that was born in Mexico and Canada, which are still rated a biosecurity risk, then later slaughtered in the US.\n\n\"We haven't been assured there's a system that allows the appropriate tracing of animals﻿, or appropriate traceback of animals,\" Cattle Australia chief executive Dr Chris Parker said.\n\nA review is underway into whether that should change, which could be used as a bargaining chip for Trump to drop all tariffs against Australia.\n\n\"You shouldn't cut a deal at any cost, and particularly the cost of Australian biosecurity,\" Nationals leader David Littleproud said.\n\n\"This will decimate the agricultural sector if we blink and allow President Trump to be able to roll over us and our biosecurity standards.\"\n\nAlbanese today assured the industry he would not jeopardise biosecurity during upcoming negotiations.\n\nPrime Minister Anthony Albanese has vowed not to compromise biosecurity as trade negotiations over beef are expected to top the agenda in crucial talks with US President Donald Trump. (9News)\n\n\"Our first priority is biosecurity and there'll be no compromise on that,\" he said.\n\n\"If things can be sorted out, in a way that protects our biosecurity, of course, we don't just say no.\n\n\"I deal with ﻿people, whoever they are, in the same respectful way. I expect respect back.\n\n\"I'm the prime minister of Australia, we don't have a subservient relationship to any nation.\"\n\nAlbanese is expected to meet Trump face-to-face within the next two weeks, likely on the sidelines of the G7 meeting in Canada.\n\nThat meeting could make or break ﻿trade negotiations concerning several industries.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/private-japanese-moon-lander-falls-silent/9b07ba6f-aec5-407a-9eae-7fc68a22bddf",
        "title": "Private lunar lander falls silent while attempting a moon touchdown",
        "publish_date": "Fri, 06 Jun 2025 01:15:36 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A private lunar lander from Japan has fallen silent while descending to the moon with a mini rover and its fate was unknown.\n\nThe Tokyo-based company ispace said on Friday its lander dropped out of lunar orbit as planned and everything seemed to be going well. But there was no immediate word on the outcome, following the hour-long descent.\n\nAs the tension mounted, the company's livestream of the attempted landing came to an abrupt end. More than two hours later, ispace said it had yet to establish communication with the spacecraft and was still working to gain contact.\n\nREAD MORE: Musk lobs unfounded Epstein accusation at Trump\n\nThis image provided by Japanese company ispace shows the Resilience lander circling the moon, on Wednesday June 4, 2025. (ispace, inc. via AP) (AP)\n\nTwo years ago the company's first moonshot ended in a crash landing, giving rise to the name Resilience for its successor lander. Resilience carried a rover with a shovel to gather lunar dirt as well as a Swedish artist's toy-size red house for placement on the moon's dusty surface.\n\nLong the province of governments, the moon became a target of private outfits in 2019, with more flops than wins along the way.\n\nLaunched in January from Florida on a long, roundabout journey, Resilience entered lunar orbit last month. It shared a SpaceX ride with Firefly Aerospace's Blue Ghost, which reached the moon faster and became the first private entity to successfully land there in March.\n\nResilience was targeting the top of the moon, a less forbidding place than the shadowy bottom. The ispace team chose a flat area with few boulders in Mare Frigoris or Sea of Cold, a long and narrow region full of craters and ancient lava flows that stretches across the near side's northern tier.\n\nPlans had called for Resilience to beam back pictures within hours and for the lander to lower the piggybacking rover onto the lunar surface this weekend.\n\nREAD MORE: Tesla suffers wipeout as investors walk away\n\nThe founder and chief executive of ispace, Takeshi Hakamada, speaking at mission control on Friday, June 6, 2025. (ispace via AP) (AP)\n\nThe rover, weighing just 5kg, was going to stick close to the lander, going in circles at a speed of less than a couple of centimetres per second. It was capable of venturing up to one kilometre from the lander and should be operational throughout the two-week mission, the period of daylight.\n\nTakeshi Hakamada, chief executive and founder of ispace, considered the latest moonshot \"merely a steppingstone,\" with its next, much bigger lander launching by 2027 with NASA involvement, and even more to follow.\n\nMinutes before the attempted landing, Hakamada assured everyone that ispace had learned from its first failed mission.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/elon-musk-donald-trump-feud-tesla-shares-plunge-amid-fight/0fedbc2c-ba8f-4495-8e47-b706a4767373",
        "title": "Musk suffers historic single-day loss amid vicious war of words",
        "publish_date": "Fri, 06 Jun 2025 00:46:06 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "The world's richest person has lost $US34 billion ($52 billion) from his personal net worth at the end of the day, according to the Bloomberg Billionaires Index.\n\nElon Musk's staggering loss is the second-largest ever in the index's history, according to Bloomberg. It comes in second because the Tesla CEO suffered a bigger dive in November 2021.\n\nBut the loss is a drop in the bucket for the Tesla and SpaceX chief. As of June 5, he was still the richest person in the world, with a net worth of around $US334 billion.\n\nNot long ago, Elon Musk was jumping for joy while standing at Donald Trump's side. Now, he's losing billions of dollars at a rapid pace. (AP)\n\nTesla shares suffer 14 per cent plunge﻿\n\nIt comes after shares of Musk's electric vehicle company plunged more than 14 per cent, knocking about $US150 billion ($230 billion) off Tesla's market valuation as investors fear his dispute with US President Donald Trump will hurt the company.\n\nTesla closed down more than 14 per cent as a disagreement over the US president's budget bill turned nasty.\n\nAfter Musk said that Trump wouldn't haven't gotten elected without his help, Trump implied that he may turn the federal government against his companies, including Tesla and SpaceX.\n\nPresident Donald Trump inspects a Tesla with Elon Musk on the front lawn of the White House earlier this year. (AP)\n\n\"The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon's Governmental Subsidies and Contracts,\" Trump wrote on his social messaging service Truth Social. \"I was always surprised that Biden didn't do it!\"\n\nThe shares tanked earlier this year as Musk's association with DOGE damaged the car company's brand. Shares rallied when he promised in April to focus more on Tesla.\n\nNow, Wall Street is worried about Trump's hitting back at Musk through Tesla.\n\n\"Trump is tit for tat. If Musk tries to mess up Trump's bill, Trump won't be Mr Nice Guy\" when it comes to self-driving cars, which Musk acknowledges are a key to Tesla's future, said Dan Ives of Wedbush Securities.\n\nTesla's heavy losses partially reverse a big run-up in the eight weeks since Musk confirmed that Tesla would test an autonomous, driverless \"robotaxi\" service in Austin, Texas, this month.\n\nInvestors fear Trump might not be in such a rush to usher in a future of self-driving cars in the US, and that could slam Tesla because so much of its future business depends on that.\n\nREAD MORE: Trump says after Xi call that US and China will resume trade talks ﻿\n\nThe president and the richest man in the world together during happier times. (Bloomberg)\n\n\"The whole goal of robotaxis is to have them 20 or 25 cities next year,\" Ives said. \"If you start to heighten the regulatory environment, that could delay that path.\"\n\nTrump's threat to cut government contracts seem targeted more to another of Musk's businesses, SpaceX, his privately held rocket company that received billions of dollars to send astronauts and cargo to the International Space Station, provide launches and do other work for NASA.\n\nThe company is currently racing to develop a mega rocket for the space agency to send astronauts to the moon next year.\n\nA subsidiary of SpaceX, the satellite internet company Starlink, appears to also have benefited from Musk's once-close relationship with the president.\n\nOn a trip with Trump to the Middle East last month, Musk announced that Saudi Arabia had approved his satellite service for aviation and maritime use.\n\nThough its not clear how much politics has played a role, a string of other recent deals for the company in Bangladesh, Pakistan, India and elsewhere has come as Trump has threatened tariffs and sent diplomats scrambling to please the president.\n\nOne measure of SpaceX's success: A private financing round followed by a private sale of shares recently reportedly valued it at $US350 billion, up from an estimated $US210 billion just a year ago.\n\nTesla shares initially got a lift from his support of Trump. In the weeks after Trump was elected, Tesla shares surged, hitting an all-time high on December 17.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/ange-postecoglou-spurs-sacking/105227772",
        "title": "Ange's Spurs sacking the sad reality for awful league campaign",
        "publish_date": "Sat, 07 Jun 2025 01:58:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "The silence had become deafening.\n\nThe absence of any news out of north London creating rumour and intrigue.\n\nWith Ange Postecoglou and Daniel Levy both on holiday, the vacuum created its own ominous void.\n\nAnd yet the longer the gap between that heady night in Spain that ended Spurs' lengthy trophy drought and any news one way or another from the club about the Australian's coaching future, the more it seemed as though Postecoglou's time would be up.\n\n'Mic drop': Ange told you he always wins a trophy in his second season Photo shows Ange Postecoglou holds his hand on his chest When Spurs hired Ange Postecoglou, he was seen as an alternative to the \"winners\" who had gone before him. Now he's backed up his pre-season statement of always winning a trophy in his second season to silence the doubters. Again.\n\nHow can Spurs get rid of a man who has delivered exactly what he said he would?\n\nThe end of Tottenham's trophy drought could and perhaps should have been Postecoglou's ticket to a third season at the helm.\n\nHowever, in the cold light of day, Postecoglou was always going to be hard pressed to keep his job.\n\nYes, the euphoric scenes in Bilbao painted a picture of a team that had suddenly achieved something few thought they would.\n\nAnd yes, the backing of his players in recent weeks had created a deafening roar of ascent amidst the screaming void of nothingness from the boardroom.\n\nBut the facts don't lie.\n\nA brilliant start, a horror finish\n\nAnge Postecoglou was well liked by his players. (Getty Images: Danehouse/Harry Murphy)\n\nThings at Spurs started so well for Postecoglou.\n\nUnbeaten in their first 10 league games of the 2023/24 season, they were five points clear at the top of the Premier League table before a chaotic defeat to Chelsea scuppered their progress.\n\nThat was the best start to a Premier League season by any new manager in the league's history (since 1992) and was Tottenham's best start in the top flight since 1960/61.\n\nThen, Spurs managed just one draw in their next five matches, the worst form of any team in the top division, bringing Postecoglou back down to earth with a bump.\n\nThat Chelsea defeat was more than just the start of a slide though; it epitomised everything that pundits have since claimed has been Postecoglou's problem all along, the stick with which he has been beaten into submission.\n\n\"It is just who we are mate,\" Postecoglou said after his nine-man team was overwhelmed, its high defensive line mercilessly and repeatedly exposed by Chelsea's pacy forwards.\n\nAnge Postecoglou had some superb moments with Spurs, but the trend was going in the wrong direction. (Getty Images: Liverpool FC)\n\nHis stubborn rigidity to his tactical ideals, despite the disruption caused by one of (note, one of, not the) worst injury tolls in the league, saw Spurs tumble back down to earth with an almighty thud.\n\nSpurs finished 17th in the Premier League this season, suffering a whopping 22 defeats, their worst top-flight season since 1976/77.\n\nWith a sizeable playing budget at his disposal — estimated as being the seventh highest in the Premier League — that is simply not good enough.\n\nOver the course of his two-year tenure though, the picture is far rosier.\n\nIf we combine the last two seasons into one 76-match campaign, Spurs would sit eighth.\n\nThe devil though, is in the detail.\n\nAfter the first 19 Premier League games of his time in charge, Spurs were sitting in fifth spot on the Premier League ladder with 11 wins.\n\nThe following 19 games saw Tottenham drop to eighth on the form guide with nine wins.\n\nThe next 19 games, at the start of the 2024/25 season, saw Spurs win just seven games, just good enough for 11th.\n\nThe 19 after that saw just four wins.\n\nAnge Postecoglou had struggled in the league, with a woeful finish of 17th the nadir. (Getty Images: Stu Forster)\n\n\"Following a positive start in the 2023/24 Premier League (PL) season, we recorded 78 points from the last 66 PL games,\" a Spurs statement read, the appalling numbers laid bare.\n\nIf Postecoglou's first 10 games were among the best in Premier League history, that stands all the more glaringly against his final 10 games in charge where he won just a single game, with one draw.\n\nAnge's rise from the failed dream of the NSL to European glory Photo shows Ange Postecoglou holds a trophy In 2008, Ange Postecoglou was a Fox Sports pundit who felt unemployable. Now he's the first Australian football manager to win a major European club trophy.\n\nThat run of four points over the 10-game period was second only to Southampton as the worst in the league.\n\nThis inexorable slide has not gone unnoticed and, despite enjoying the backing of the players, shifting that momentum is always going to be tough and, in the cut and thrust world of the Premier League, there is little room for error.\n\n\"At times there were extenuating circumstances — injuries and then a decision to prioritise our European campaign,\" Spurs said in its statement.\n\n\"It is crucial that we are able to compete on multiple fronts and believe a change of approach will give us the strongest chance for the coming season and beyond.\"\n\nSpurs' late-season form was dire\n\nThe sky had been closing in on Spurs due to their horror league form. (Getty Images: MB Media/Vince Mignott)\n\nPostecoglou said he had thrown everything he had at the Europa League to the detriment of the league. But finishing so low is an appalling reflection of where the club is at.\n\nSpurs managed just 11 wins in the Premier League this season, all but four of those coming against clubs in the bottom half of the table.\n\nOf teams that finished in the top half of the table, only Brentford twice (10th), Aston Villa (sixth) and Manchester City (3rd) were beaten by Spurs, with other victories coming against relegated Southampton (twice) and Ipswich, as well as Everton (13th), Manchester United twice (15th) and West Ham United (14th).\n\nEven digging into these fixtures highlights issues.\n\nEverton were a basket case at the start of the year, which is when Spurs played them, while the away victory over Manchester City came slap bang in the middle of the defending champions' dire run of form where they lost seven games in a row in across competitions.\n\nIn the cups, things were only slightly better.\n\nIt seemed, in the league at least, that Ange Postecoglou had no answers. (Getty Images: Marc Atkins)\n\nNon-league Tamworth were the only team Spurs managed to beat in the FA Cup and even that victory required extra time. While in the League Cup, lower league Coventry, both Manchester clubs and Liverpool were beaten in one-off matches.\n\nEven the Europa League triumph, as giddy and joyous as it appeared in Seville, when looked at in the cold light of day was hardly something to scream at.\n\nSince the restructure of the Champions League, there is no doubt that it has become easier in Europe's second-tier competition.\n\nNo longer are the teams that finish in third place in the Champions League group phase parachuted into the competition, making the overall standard that much lower.\n\nWins over Qarabağ, Ferencváros, AZ, Elfsborg and Hoffenheim should have, in truth, been expected given Tottenham's far superior resources.\n\nVictory over Eintracht Frankfurt, which finished in third place in the Bundesliga, over two legs in the quarterfinal was impressive.\n\nBut Bodø/Glimt? As tough as it is to play on an artificial pitch north of the Arctic Circle, the budget disparity between the two clubs makes David's biblical contest against Goliath look like a reasonable piece of matchmaking.\n\n\"Whilst winning the Europa League this season ranks as one of the Club's greatest moments, we cannot base our decision on emotions aligned to this triumph,\" Spurs said, revealing its cold-hearted pragmatism.\n\n\"This has been one of the toughest decisions we have had to make and is not a decision that we have taken lightly, nor one we have rushed to conclude.\n\n\"We have made what we believe is the right decision to give us the best chance of success going forward, not the easy decision.\"\n\nWhat next for Ange?\n\nAnge Postecoglou will likely be in demand as a top-level coach. (Getty Images: Justin Setterfield)\n\nIt should not and cannot be understated how impressive it is that Postecoglou won a trophy.\n\nTo boldly state that you always win something in your second season and then deliver on that promise is the ultimate mic drop.\n\nBanishing Spurs' recent history of choking in the biggest moments has been a feat incapable of some of Europe's biggest-name managers.\n\nAnge breaks his silence Photo shows Ange Postecoglou He has chased his impossible dream across clubs and continents. Now, Ange Postecoglou has made it real by coaching Tottenham to glory in the Europa League.\n\nAnge has, undoubtedly, helped make Spurs less Spursy.\n\n\"[Tottenham is] a club that is trying to break free … [of] this mindset of thinking themselves of as a big club but being the team that everyone else takes the piss out of,\" Sydney Morning Herald football journalist Vince Rugari told ABC's Offsiders last month.\n\n\"They're a joke in England.\n\n\"They've got a manager that 100 per cent recognises what is going on there [at Spurs] and is doing everything he can to break it as well.\n\n\"He's made comments in press conferences, he challenges the narratives that are around about Tottenham Hotspur.\"\n\nGiven the strides Spurs were making, should Postecoglou have been given more time?\n\nAnge Postecoglou has had great success. (Getty Images: AMA/Catherine Ivill)\n\nShould he have been given that chance to test himself against the best in the Champions League?\n\nThe answer to both those questions is probably yes.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAnd that Spurs have thrown away the only manager that has managed to break their trophyless curse to the wayside might well be the most Spursy thing that they could have done after all.\n\nSacking Postecoglou fits with Tottenham's recent reputation of throwing away promising situations and making life uncomfortable — or even torturous — for its supporters.\n\nPostecoglou, as he said repeatedly in his post-match press conference after the Europa League triumph, will be \"fine\".\n\nHe has shown himself to be a winner in every league he has had an extended run in, be it Scotland, Australia, Japan and now England.\n\nPostecoglou's self-confident bullishness counted against him as Tottenham's season descended into the mire, but it is not unfounded.\n\nAny other club will see Postecoglou's availability as a chance for them to pounce on a proven winner.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/mental-health-support-surging-demand-in-esperance/105360058",
        "title": "Community services buckling under demand for mental health support",
        "publish_date": "Sat, 07 Jun 2025 01:57:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "A community service group in regional Western Australia says it and others are buckling under the weight of the town's mental health needs as government service shortages drive severely unwell residents to its doors.\n\nFor more than 20 years, Chris Meyer has led Esperance Care Services (ECS), which provides food relief, help and a safe space for those doing it tough in the region, 700 kilometres south-east of Perth.\n\nBut he has never been so worried.\n\n\"We're under significant pressure at the moment,\" he said.\n\n\" Because we've had a massive increase in the number of clients that come to us for help who have significant mental health issues. \"\n\nMental health support services are in short supply throughout Australia.\n\nAnd in country areas Mr Meyer said people often had nowhere to turn but community service groups who were not equipped to cope.\n\nLynne McCosh says Esperance needs more urgent mental health support. (ABC Esperance: Emily Smith)\n\nHe said ECS was getting three times more requests for assistance than a decade ago, many staff were taking stress leave, and he even had to take out a restraining order against a troubled client.\n\nLynne McCosh, an advocate with ECS, said they had almost nowhere to refer people who needed urgent, immediate help.\n\n\"When we have people presenting that are in an extremely heightened state, what [do] we do with them right in that instant, in that moment?\" she said.\n\nNo regular help\n\nVeronica Lavars, better known as \"Click\", has long sought regular mental health support for her daughter.\n\nVeronica Lavars would love her daughter to have access to regular mental health support. (ABC Esperance: Emily Smith)\n\n\"Our daughter had her very first psychotic episode when she was 17,\" she said.\n\n\"She's now nearly 56 and she lives with us.\"\n\nShe said her daughter often saw a GP and was legally required to see a psychiatrist twice a year, due to her medication.\n\nMs Lavars also wanted her to have more regular appointments with a psychologist or psychiatrist, to form a trusted connection.\n\nBut she said her daughter was recently taken off the waitlist at the state government-run Esperance Community Mental Health facility.\n\n\"They say that they have a lot of people on their books,\" Ms Lavars said.\n\n\"Because our daughter has me as her support person [who is a strong advocate] she no longer needed to be on their books.\"\n\nChris Meyer says they get no support from Esperance Community Mental Health. (ABC Esperance: Emily Smith)\n\nMr Meyer said he often tried to put people in contact with Community Mental Health.\n\n\"If we call Community Mental Health [because] we've got someone who's having an episode, we get all sorts of excuses why they can't help us,\" Mr Meyer said.\n\n\"But we get zero support.\"\n\nWhat's available?\n\nWA Country Health Service's (WACHS) Esperance Community Mental Health facility has two psychiatrists, who visit Esperance up to six days a month from Perth.\n\nTwo full time equivalent WACHS psychologists service the entire Goldfields region, which has almost 60,000 residents.\n\nA small number of psychologists also operate privately in Esperance.\n\nThe town has a range of counselling services, including CentreCare, Hope Community Services, ESCARE and Headspace.\n\nThere is a headspace office on Esperance's main street. (ABC Esperance: Emily Smith)\n\nMr Meyer said the only real option in an emergency was to call the police or take the person to hospital.\n\nBut he said the Esperance Hospital was often not equipped to help.\n\n\"We took someone in there [to hospital] who was very unwell and within 15 minutes she was back out walking down the middle of the road,\" he said.\n\nWACHS said it had around-the-clock access to mental health professionals, via telehealth, who supported emergency department clinicians on treatment and referral options.\n\nVeronica Lavars wants her daughter to have regular appointments with a psychologist or psychiatrist to form trust. (ABC Esperance: Emily Smith)\n\nIn a statement, WA Health Minister Meredith Hammat said she heard the community's concerns.\n\nShe said the Mental Health Commission funded more than $1.4 billion worth of mental health, alcohol and other drug services across the state.\n\nMs Hammat said further funding announcements on mental health for regional West Australians would be made in the state budget, on June 19.\n\n\"We obviously need to continue to make sure that we grow our mental health services right throughout regional Western Australia,\" Premier Roger Cook said.\n\n\" Esperance is no different as part of that mission. \"\n\nFederal Health Minister Mark Butler's spokesperson said it was committed to delivering more than $1 billion for public mental health care and expanding the sector's workforce.\n\nEsperance Care Services staff say they are exhausted by current support needs. (ABC Esperance: Emily Smith)\n\nCall for more local input\n\nAnna Bonney, who works at Esperance Tjaltjraak Native Title Aboriginal Corporation and is a former youth worker, was also worried about First Nations residents, who make up about 4 per cent of the community.\n\nShe said racism remained an issue, which could prompt young Aboriginal people to leave school early and make it difficult for them to secure a job, putting pressure on families and the broader community.\n\n\"The impact and ripple effect from these things is entrenched disengagement.\"\n\nAnna Bonney says health system decision makers should consult with communities about their individual needs. (ABC Esperance: Emily Smith)\n\nMs Bonney said many people who decided to seek mental health help soon lost faith, because of long wait times, being \"tossed between\" different services, or feeling unwelcome.\n\nShe believed health system decision makers, usually based in capital cities, needed to work harder to meet the needs of individual communities.\n\n\"I would like to see those [decision makers] come here to actually see how Esperance works, what is effective,\" she said.\n\nThe smell of fried sausages and onions wafts down the main street as volunteers cook a meal for anyone who needs it. (ABC Esperance: Emily Smith)\n\nMathew Coleman, chair of rural and remote mental health practice at the University of Western Australia, agreed communities should have more control over their mental health systems.\n\n\"Health organisers and people who resource health systems need to be listening to those local people,\" Dr Coleman said.\n\nAddressing underlying causes\n\nDr Coleman said while some mental health issues had a genetic cause, others were due to social factors, stemming from things like access to education and employment, discrimination and distribution of wealth.\n\n\"Often in many places, because of the way that industries set up, there are the 'haves' in town and the 'have nots',\" he said.\n\n\" It's no surprise that it's the people that are 'have nots' … [that] have a disproportionately higher burden of mental health problems. \"\n\nBut he said small communities were well placed to address those factors.\n\nFor example, when a person came out of prison, he said, programs could be set up to prevent them relapsing.\n\nOther programs could be geared at addressing social exclusion.\n\nEvery Friday night Esperance Care Services puts on food for the community. (ABC Esperance: Emily Smith)\n\nEsperance Care Services has long been working hard in that area.\n\nOn a mild Friday night, the smell of fried sausages and onions wafts down the main street, as volunteers cook a meal for anyone who needs it.\n\nA small crowd gathers, pulling up chairs with their pets and children to enjoy the food.\n\nMr Meyer just wishes others could see how critical the need for more support has become.\n\n\"It's probably as hard a time as I've had it in 20 years,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/liam-adcock-wins-diamond-league-long-jump/105389502",
        "title": "Aussie Adcock outleaps Olympic champ in Rome Diamond League win",
        "publish_date": "Sat, 07 Jun 2025 01:11:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Liam Adcock has claimed victory in the men's long jump at the prestigious Rome Diamond League meet.\n\nSitting in third place after five rounds, Adcock leapt a personal best of 8.34 metres with his final attempt.\n\nHe finished ahead of Italy's Mattia Furlani (8.13m) and Greece's two-time Olympic champion Miltiádis Tentóglou (8.1m).\n\nAdcock won bronze behind Furlani at the World Indoor Athletics Championships in Nanjing three months ago.\n\nLachlan Kennedy breaks 10-second barrier in historic 100m race Photo shows sprinter Lachlan Kennedy waves to the crowd after a 100 metre sprint race in nairobi The 21-year-old is the first to achieve the feat since Patrick Johnson's 9.93 Australian record in 2003.\n\n\"I reckon I have a bit of clutch factor so it was great to be able to express that and jump a PB,\" said Adcock, who finished second at April's Diamond League leg in Xiamen.\n\n\"I wasn't feeling that great leading into it, but Furlani got the crowd fired up, obviously a home crowd for him, and it got me going too.\"\n\nFellow Australians Sarah Billings and Abbey Caldwell also impressed in Rome.\n\nThe middle-distance duo both registered career-best times in the women's 1,500m, with Billings taking second in 3:59.24 followed by Caldwell in third (3:59.32).\n\nIreland's Sarah Healy won in 3:49.17.\n\n\"I wanted to be in striking distance in the last lap tonight. I felt really good with 200 metres to go and just told myself to go for it,\" Billings said.\n\nNational record holder Oliver Hoare qualified for Tokyo's World Championships in September, clocking 3:31.15 in the men's 1,500m to finish ninth.\n\nFrance's Azeddine Habz was victorious via a time of 3:29.72.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/nt-darwin-glenti-greek-festival-2025-gets-underway/105381616",
        "title": "Thousands of meatballs and dolmades on menu at Greek GleNTi festival",
        "publish_date": "Sat, 07 Jun 2025 01:08:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Preparing for Darwin's largest annual multicultural festival is no easy feat, with a small army of volunteers having been hard at work for weeks to put on a feast for this year's GleNTi.\n\nThroughout the past week, thousands of meatballs and dolmades have been rolled and tonnes of seafood has been prepared for the major Greek festival.\n\nIt has all been to ensure that the tens of thousands of attendees at the beloved annual event leave full and satisfied.\n\nSince its launch in 1988, GleNTi has grown in size every year to become one of the biggest weekends on Darwin's social calendar.\n\nThe festival celebrates traditional Greek costume. (Supplied: In The Lens Photography)\n\nThese days GleNTi is a two-day extravaganza, with food, dancing, music and plate-smashing filling the busy schedule at Bicentennial Park on the Darwin Esplanade.\n\nMichael Koulianos, president of the Greek Orthodox Community of Northern Australia, which organises GleNTi, said the festival was an annual highlight of Darwin's event calendar.\n\n\"It's a celebration of our Greek heritage, but also of our families, our community and our standing in the NT,\" he said.\n\n\"It brings us all together. It brings friends, families but also the wider community together as well\".\n\nGleNTi includes music and dance. (ABC News: Isabel Moussalli)\n\nVolunteers on a roll\n\nOn Wednesday, members of the Greek community held a working bee to wrap dolmades for the festival.\n\nThe parcels, which are often called \"fylla\" by Darwin's predominantly Kalymnian Greek population, are made of grapevine leaves stuffed with rice, meat, herbs and spices.\n\nKatina Vrodos, who has been making dolmades her whole life, said they were one of the festival's highlights.\n\n\"I started [making dolmades] in Greek school … and have continued all these years,\" she said.\n\nKatina Vrodos is one of many GleNTi volunteers. (ABC News: Marcus Kennedy)\n\nShe keeps a keen eye on the volunteers, ensuring quality standards are upheld.\n\n\"This recipe is mine from more than 40 years ago,\" she said.\n\nThe preparation is a tradition that has been passed down from generation to generation.\n\nHigh school student Anna Koulianos — Mr Koulianos's daughter — was among the young people who pitched in.\n\n\"I have memories sitting at my Yiya's table at her house, her teaching me how to do it from a really young age,\" she said.\n\nShe joked that she felt the pressure of carrying on a tradition so deeply protected by her grandmothers, but also said the practice made her feel \"at home\".\n\nAnna Koulianos carries on the tradition of wrapping dolmades, taught to her by her grandmothers. (ABC News: Marcus Kennedy)\n\nThere were several other workshops held throughout the week, including rolling meatballs, or \"keftedes\", and preparing honey puffs, also called \"loukoumades\".\n\nOrganisers say all up, there will be about 3 tonnes of souvla, 600 kilograms of dolmades, 2 tonnes of octopus and 800kg of calamari — though the true numbers are hard to quantify.\n\nMany hands made light work of the preparations, with the working bees drawing volunteers from beyond the Greek community.\n\n\"We've got Darwin High School, we've got St John [Ambulance] volunteer corps and a lot of other non-profit organisations taking part as well, including the Filipino community,\" Mr Koulianos said.\n\nThe festival is being held at Darwin's Esplanade. (ABC News: Isabel Moussalli)\n\nPoliticians also rolled up their sleeves and got to work, with federal MP Luke Gosling and NT Chief Minister Lia Finocchiaro among the volunteers.\n\n\"We start our preparations in January every year, but the last three months are quite intense,\" Mr Koulianos said.\n\n\"That's when we really gear up, and obviously the last month is sleepless nights to really get everything done.\"\n\nOctopus supply impacted\n\nHowever, not all the preparations for this year's GleNTi have been smooth sailing.\n\nOn Friday, the day before the festival kicked off, an NT Health investigator found one of the GleNTi stallholders, the Kalymnian Brotherhood, had breached food safety standards when preparing their tonnes of octopus.\n\nIn a statement, an NT Health spokesperson said it had deemed the octopus \"unsuitable for consumption\".\n\n\"As a result, Environmental Health Officers have requested the provider dispose of the affected octopus,\" the spokesperson said.\n\nNT Health said the decision would have a \"very minor impact\" on the festival.\n\nThe supply of octopus has been restricted at this year's GleNTi. (Suppled: Adobe Stock)\n\nIn a Facebook post, the Kalymnian Brotherhood denied any wrongdoing and said the investigators made \"false accusations\".\n\n\"We want to make it clear our octopus prep was conducted properly and in the correct manner,\" they said.\n\n\" We consider this to be sabotage and we are very strong believers in due process. \"\n\nThe Kalymnian Brotherhood said in the same post the group would not take part in this year's festival as a result.\n\nMr Koulianos said organisers had found a solution and octopus would still be available.\n\n\"We did stay up all night, rang some suppliers [and] local distributors, and found octopus, so we are definitely going to have octopus this GleNTi,\" he said.\n\n\"I think it's going to be enough, probably about a tonne.\n\n\"Normally we sell about two tonnes over the GleNTi weekend, but it's going to be enough for people to taste it, let's put it that way\".\n\nGleNTi is being held on Saturday and Sunday at the Bicentenial Park on Darwin's Esplanade.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/indigenous-women-changing-firefighting-culture-in-queensland/105376160",
        "title": "How Indigenous women are sparking cultural change in firefighting",
        "publish_date": "Sat, 07 Jun 2025 00:48:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Arlene Clubb and her relatives joined their local volunteer fire brigade in rural Queensland a decade ago, they were not entirely welcomed with open arms.\n\n\"People didn't want us there because we were Indigenous people,\" the Kuku-Thaypan, Kuku Yalanji and Kuku-Possum woman said.\n\n\"[Some members] in a photo, they turned their backs on us, they didn't want to be in the same photo as us and it just sort of made us feel no good.\n\n\"But we didn't let that faze us. If you let people like that affect you, you're not going to go anywhere.\"\n\nArlene Clubb is a member of the Tinaroo Rural Fire Brigade. (ABC Far North: Christopher Testa)\n\nFrom sign-up to second officer\n\nThe reception some gave the Clubb family at the Tinaroo Rural Fire Brigade in the state's far north belied the efforts of first officer and founding member Les Green, who went out of his way to encourage the Wadjanbarra Yidinji traditional owners to join in the first place.\n\nIt started with a conversation about the need to manage a piece of the Atherton Tablelands of great importance to traditional owners.\n\nArlene's sister-in-law Kylee Clubb, who also signed up, is now the Tinaroo brigade's second officer, working to drive cultural change in fire management more broadly.\n\nKylee Clubb (right) and Les Green address firefighters at a training exchange program. (ABC Far North: Christopher Testa)\n\n\"[We] thought about what we wanted to do as a family and what we wanted to do as First Nations people, especially on the lands we've been on up there on the Tablelands,\" she said.\n\n\" I was mainly aiming for women, Indigenous women, to start to step into these spaces. \"\n\n'It's about paying attention'\n\nKylee said the growing number of First Nations firefighters was leading to a greater appreciation within agencies of the importance of cultural burning.\n\nThe practice involves using small fires to benefit the ecology and encourage plant growth, rather than a simple focus on reducing fuel loads.\n\nBut the best time for a cultural burn on the Atherton Tablelands — an ancient landscape shaped by volcanic activity millions of years ago — might clash with statewide fire bans or burning schedules decided elsewhere in the state.\n\nKylee Clubb helped bring the Women-in-Fire Training Exchange to Queensland. (ABC Far North: Christopher Testa)\n\nKylee said the \"conversation is being started\" about moving away from strict burn schedules, to better include Indigenous knowledge of landscapes.\n\n\"At the moment, we've seen heaps of lantana, heaps of different weeds, sicklepods just overtake the forest,\" she said.\n\n\"[It's about] paying attention to what's flowering and what's seasonal.\n\n\"The seeds we have out here need activation from fire.\"\n\nBringing knowledge home\n\nFire management agencies have shown an interest in investing in the leadership skills and expertise of their First Nations personnel too.\n\nWhen the Queensland Fire Department was looking for female firefighters to attend an Indigenous-focused intensive training exchange program in the United States three years ago, Kylee was one of those asked to go.\n\nA firefighter works on a burn during a training exercise at WTREX near Cairns. (Supplied: Queensland Fire Department)\n\nShe and fellow Far North Queenslanders Chloe Sweeney and Alex Lacy found the experience so rewarding, they decided to organise their own version of Women-in-Fire Training Exchange, or WTREX, on home soil.\n\nIt ran over 12 days near Cairns last month, bringing together 40 fire practitioners from across Australia and overseas, most of whom were Indigenous women.\n\nArlene Clubb says Indigenous women bring knowledge of cultural burning to brigades. (ABC Far North: Christopher Testa)\n\nOne of those was Arlene, who said the growing presence of Indigenous women among the ranks of volunteer firefighters was about showing \"we're not just mothers, not just caregivers, not just stay-at-home wives anymore\".\n\n\"[Dispossession] did stop a lot of our cultural burning but it never got lost — the mentality has always been there and all the knowledge we had from our elders is still there,\" she said.\n\nAustralia catching up\n\nLenya Quinn-Davidson, an expert on human connection to fire at the University of California, was one of the founders of WTREX in 2016.\n\nLenya Quinn-Davidson says diverse perspectives are needed to solve our fire problems. (ABC Far North: Christopher Testa)\n\nShe took part in the recent Queensland program, and said it was important to offer Indigenous women a safe place to develop their skills and share knowledge so they could thrive in a traditionally \"male-dominated, very militaristic\" field.\n\n\"The fire issues we have globally are so wicked, they're wicked problems, and we need diverse perspectives to solve them,\" she said.\n\nAussie Megan Currell works in the Canadian province of British Columbia. (ABC Far North: Christopher Testa)\n\nMegan Currell, an Australian-born member of the British Columbia Wildfire Service said a decade ago, \"it felt like Canada was way ahead of Australia\" when it came to relationships with Indigenous peoples.\n\n\"When I come back and visit home, honestly, I see a massive improvement in the relationship and that cultural aspect, starting to get into cultural burns and being a support system for that and forming real partnerships,\" she said.\n\n\"I'd say now they're starting to become neck-and-neck a bit or maybe even Australia is starting to take over.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/eid-al-adha-perth-celebrations-wa-muslims/105385298",
        "title": "Hundreds gather in Perth for Eid al-Adha celebrations with prayer, food and reflection",
        "publish_date": "Sat, 07 Jun 2025 00:11:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Thousands of Muslims across Perth and Western Australia have come together to celebrate the start of one of the biggest holidays on the Islamic calendar.\n\nPraying side-by-side at one of Perth’s largest open spaces, hundreds of worshippers gathered at Whiteman Park to mark Eid al-Adha with a special prayer called Salat al-Eid.\n\nMen kneel on the ground barefoot during Eid al-Adha celebrations. (ABC News: Tabarak Al Jrood)\n\nEid al-Adha, also known as the Festival of Sacrifice, commemorates the act of faith shown by Prophet Abraham, who was willing to sacrifice his son in obedience to God’s commandment.\n\nIt also coincides with the ending of Hajj – the annual pilgrimage to the holy city of Mecca.\n\nThe holiday follows Eid al-Fitr, which was celebrated earlier this year to mark the end of Ramadan, a month of fasting and spiritual reflection.\n\nSheikh Saleh Ibrahim, Imam of the Islamnic Centre of WA, celebrating Eid al-Adha at Whiteman Park. (ABC News: Tabarak Al Jrood)\n\nFrom a handful to hundreds\n\nSheikh Saleh Ibrahim, the imam of the Islamic Centre of WA, has been leading the Eid prayer at the park for years.\n\n“We’ve been doing this for nearly 30 years now, we started at Kings Park with about 50 people but once the community grew, we moved to Whiteman Park,” he said.\n\nAbdul Rahman Mohamed Ali (left) and Mahmoud Abu Geras celebrating Eid al-Adha. (ABC News: Tabarak Al Jrood)\n\n“Now there’s hundreds of people at the park, and that’s besides the many mosques around Perth where more people attend.\n\n“So it’s very important for us a Muslim community to celebrate and enjoy these blessed days.”\n\nSheikh Ibrahim said Eid al-Adha was a time for deep reflection and submission to the will of God, generosity and empathy.\n\nThe festival involves a ritual sacrifice of livestock such as sheep, goats or cows and sharing the meat among family, friends and those less fortunate.\n\nCommunity members prepare food during Eid al-Adha celebrations. (ABC News: Tabarak Al Jrood)\n\nPeople will also mark the occasion by giving gifts, wearing their best clothes and eating sweets.\n\nCommunity festival\n\nFollowing the Eid prayer, the festivities continued with a selection of food trucks, show-rides, lolly bags and charitable donations.\n\nEid al-Adha could mean a lot of barbecues on the weekend Photo shows Beef being cooked on a flaming grill. One of the biggest holidays on the Islamic calendar is happening on Friday. Here's how it's different to a feasting day with a similar name structure.\n\nMahmoud Abu Geras has attended the annual Eid event since he was a child and now brings along his own children.\n\n“It’s a beautiful occasion to spend with family and friends, there’s plenty of food, toys and rides around for the kids,” he said.\n\n“There’s a lot of happy people here today … you’ve got the young, you’ve got the old and it’s just beautiful to have this multiculturalism, this gathering together and celebrating it all as one.”\n\nHis friend also acknowledged how significant the event was in bringing different communities together.\n\nA young boy during Eid al-Adha celebrations. (ABC News: Tabarak Al Jrood)\n\n“It's a beautiful thing seeing different cultures, people from all different backgrounds come together to celebrate the same thing,” Abdul Rahman Mohamed Ali said.\n\n“Regardless if you know someone or not, everybody’s shaking hands, giving each other a hug, embracing and wishing each other Eid Mubarak.”\n\nSadness and suffering recognised\n\nBut for attendees, the day was also about reflecting on their fellow Muslims around the world.\n\n“It is marked by a bit of sadness given what's going on in the world and the suffering that's going on,” community leader Toni Pikos-Sallie said.\n\nDr Toni Pikos-Sallie, community leader, celebrating Eid al-Adha. (ABC News: Tabarak Al Jrood)\n\n“It is a happy time definitely, but we also can't forget that people are suffering.”\n\nThe mother of seven said the community was appreciative of the privilege to practice their faith freely and to celebrate such holy occasions.\n\n“The world is beginning to realise we are all human, we all have a place here and we should be living in peace and harmony,” Dr Pikos-Sallie said.\n\n“On days like this when we are thinking of the needy and those suffering and we’re reflecting on our actions and trying to better ourselves, people are starting to see we are an important part of the community and society.”",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/wa-milk-prices-remain-stable-farmers-disappointed/105384310",
        "title": "WA's dairy farmers on the brink amid 'stagnant' price rises",
        "publish_date": "Sat, 07 Jun 2025 00:07:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "West Australian dairy farmers say they are disappointed by the ongoing stagnation of farmgate milk prices as repeated dry seasons and rising costs take a toll.\n\nProcessors recently published their 2025-26 supply agreements as part of transparency measures in the Dairy Industry Code of Conduct.\n\nFor the third successive year, farmers say WA processors have offered no substantive price increase.\n\nThe disappointment was shared by interstate producers, whose processors have offered slight increases.\n\nDairy farmers in WA's South West have called on local milk processors to review their offers, with one major processor, Bega, already conceding to a two-cent-per-litre rise.\n\nBrunswick dairy farmer Michael Partridge said the initial price offered by Bega was not enough.\n\nMichael Partridge is urging processors to lift farmgate prices. (ABC Rural: Jon Daly)\n\n\"Prices haven't moved for three and a half years; last year was a really hard year for farmers in Western Australia,\" he said.\n\n\"The Dairy Farm Performance Program, which Dairy Australia did, showed 50 per cent of dairy farmers made a loss, and there was an average 2 per cent return on investment, and the prices didn't move, which was extremely disappointing.\"\n\n2 cents pay rise\n\nThough 2-cents-per-litre extra from Bega was not enough, Mr Partridge said it was a start.\n\n\"I was pleased to hear that Bega has announced a 2-cent price rise, but it's not enough to turn the industry around,\" he said.\n\nHe called on other big processors to do the same.\n\nFarmgate milk prices were released earlier this week by Australian processors. (ABC Rural: Jane McNaughton)\n\n\"We really need the other two processors, Brownes and Lactalis, to follow suit, and push it further,\" he said.\n\n\" We've had a terrible start to the season, bugger all rain — and this 2 cents is certainly going to help buy the eight road trains of hay I've needed to get the season on the way. \"\n\nExpecting reasonable increase\n\nWAFarmers Dairy Council president Ian Noakes, who also runs a dairy in the south west of the state, said the stagnation of pricing ignored the fact that production costs had risen substantially for dairies.\n\n\"Anybody in business would know how much costs have increased in business in the past years,\" Mr Noakes said.\n\nMr Noakes said his lobby group was seeking a 5-cent increase to support farmers to be profitable.\n\nHe said WA's average farmgate price ranged between 60-70 cents per litre, and that pricing hadn't materially changed in the last three years.\n\nIan Noakes says it would be good to see Brownes back in Australian hands. (ABC South West WA: Anthony Pancia)\n\nWhile East Coast dairies had access to overseas export markets, WA's dairy farmers were constrained to a comparatively small, local market.\n\nFor that reason, Mr Noakes partially blamed the major supermarkets' low-priced home brand milk ranges for the subdued pricing offered by WA processors.\n\n\"If our supermarkets want to sell the WA dairy industry down the drain, they're doing a good job of it,\" he said.\n\nMr Noakes recently presented to an ACCC inquiry into Australia's major supermarkets, urging the regulator to recognise the damage of home brand milk ranges.\n\nWA dairy producers can only sell to local suppliers. (ABC Rural: Emma Field)\n\nColes responds\n\nThe ABC contacted WA's major dairy processors for comment, of which Coles was the only one to respond.\n\n\"We introduced a direct sourcing model for our own brand milk in 2019 to ensure we could provide fair, competitive and guaranteed farm gate prices to dairy farmers directly,\" a Coles spokesperson said in a statement.\n\n\"Our multi-year agreements for our direct supply dairy farmers aim to support them in longer-term planning, and as part of the process of setting these agreements, we consider a range of factors including supply volumes, customer demand, farm production costs, and dairy market condition,s including commodity prices.\"\n\nHarvey Fresh's parent company, Lactalis, declined to comment, and Brownes and Bega were yet to respond.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-06-07/victoria-drought-causes-pain-farmers-businesses-communities/105376120",
        "title": "Drought devastates farming town desperate for rain relief",
        "publish_date": "Fri, 06 Jun 2025 23:39:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "The effects of drought creep insidiously into every corner of the Edenhope community.\n\nIt is like many towns throughout southern Australia suffering greatly at the whim of the weather.\n\nFarmers, local businesses and sports clubs — none are immune to a prolonged dry as bad as any can recall.\n\nParched paddocks and dry dams mean farmers are spending tens of thousands of dollars buying feed, carting water and sinking bores, or selling off livestock they can not afford to feed.\n\nThe money bucket is not bottomless, and for some, the bottom is already being scraped.\n\nIn a town like Edenhope, almost entirely reliant on surrounding farmers to inject money into the local economy, that means everyone suffers.\n\nThe waters of Lake Wallace at Edenhope are fast-receding. (ABC News: Darryl Torpy)\n\n'She shut off alright'\n\nPaul McDonald farms at Charam, not far from Edenhope.\n\nHe recalled a time in recent, but fading memory, when it was so wet he could not get around his paddocks.\n\n\"November, December 2023 you couldn't drive in the paddocks, so I ended up buying a new motorbike to get around,\" he said.\n\n\"Well, that motorbike is still sitting in the shed with seven kilometres on the clock, unused because of the dry spell we've had since.\n\n\" She shut off alright. \"\n\nPaul McDonald is busy feeding livestock. (ABC Rural: Angus Verley)\n\nHe has measured just 50 millimetres of rain for the first five months of this year.\n\nThe long-term average annual rainfall for his region is about 550mm.\n\nPaddock feed is non-existent and his grain reserves are gone.\n\n\"I've started buying in grain from the next-door neighbour; I had 70 tonnes of grain on hand, but anyway, that's just how the dice rolls I suppose,\" he said.\n\nPaul McDonald prepares to load more grain to feed his sheep. (ABC Rural: Angus Verley)\n\nMr McDonald said the effect on the town was obvious as farmers tightened their belts.\n\n\"A lot of times you'd battle to get a car park out the front of the pub or the department store, but now you can just pull up anywhere,\" he said.\n\n\"The activity's just not there at the moment.\n\n\"You're down to the bare necessities.\"\n\nMr McDonald's sheepdogs are always ready to work by his side. (ABC Rural: Angus Verley)\n\nTightening the belt\n\nNick Brahmbhatt, who has owned the local take-away shop for three years, moved to the town during more prosperous times.\n\n\"When we started here, the lake was full and a lot of people were coming into town and bringing economic activity,\" he said.\n\nLake Wallace's waters have quickly receded in drought. (ABC Rural: Angus Verley)\n\nHe said his income was down by about 20 per cent.\n\n\"When there's no [rain], the farmers are going to hold back spending,\" he said.\n\n\"They're struggling … and everybody just keeps looking at the sky and hoping for rain to come around.\"\n\nNick Brahmbhatt says businesses around town are not as busy as usual. (ABC Rural: Angus Verley)\n\nBut despite the challenges, he said there was no other place he would rather be.\n\n\"We have a very good community and everybody looks after each other, and that helps,\" he said.\n\n'Just talk'\n\nMental health is at the forefront during the drought.\n\nThe Edenhope-Apsley Football Netball Club, where Liz Kealy is president, provides farmers a critical escape from the drudgery of drought.\n\n\"Years like these people need the club more than ever — if they don't have that reason to go out, they won't,\" she said.\n\nLiz Kealy says the club provides a critical social outlet for farmers. (ABC Rural: Angus Verley)\n\n\"For my family, being active and being fit is, first and foremost, getting out and getting those endorphins pumping, being on the field or on the court.\n\n\" And for those who don't partake in the game itself, it's getting down here and just talking. \"\n\nMs Kealy said the conversation about mental health was much more open than during past droughts.\n\n\"My father is a farmer and talks about the '06 drought and the ones before that and there was not as much support as there is now,\" she said.\n\nLike many in small towns, Ms Kealy wears several hats.\n\nShe is also an accountant, working with farmers through the financial impacts of drought.\n\nShe said some of her farming clients were spending $40,000 a week on bought-in feed.\n\nSheep await their next meal of hay or grain. (ABC Rural: Angus Verley)\n\nSome in the area, she said, would be forced to sell land to keep farming.\n\n\"No-one wants to sell, and especially if you're an intergenerational farmer, you don't want to be the one to let that land go,\" she said.\n\nAn aerial perspective of farmland around Edenhope reveals parched paddocks. (ABC News: Darryl Torpy)\n\nBack from the brink\n\nGrampians Health rural outreach worker Murray McInnes works across a region with an elevated suicide rate.\n\nMurray McInnes says he is visiting many farmers in distress. (ABC Rural: Angus Verley)\n\nThere has been a big increase in people referred to him for help, particularly from the farming community.\n\n\"It is heavy because people are finding it difficult to leave their farms — they're isolating themselves because they're busy feeding and doing what they need to do and they're not taking time out,\" he said.\n\n\" They maintain their tractors, they maintain their headers, they do all the things they need to do to keep their farms going, but they're very often reticent to look after themselves. \"\n\nMr McInnes said a break in the drought would not fix everything, but it would certainly help.\n\n\"It's like coming out of winter, the rain will immensely make people in this area a lot happier,\" he said.\n\n'Why would you want to do it?'\n\nOn another farm near Edenhope, Clayton Caldow and his brother Ashley were flat out feeding sheep when ABC Rural stopped by.\n\n\"It's pretty bad, real bad,\" Mr Caldow said.\n\nClayton Caldow says the burdens of drought on his community are immense. (ABC Rural: Angus Verley)\n\nHe is no stranger to tough times — he lost his dad to suicide in 1984, when Clayton was only 17.\n\n\"We never saw it coming … and it's still happening,\" he said.\n\n\" There are a few big factors in suicide and money is right up there. \"\n\nGrief struck his family again in 2016, when his wife Sophie died from breast cancer at 42.\n\n\"The kids were 3, 7, 12 and 14, but I wasn't just going to sell out … we soldiered on and the support from my family and the town was phenomenal,\" he said.\n\nClayton Caldow and his four children lost their wife and mother, Sophie, to breast cancer in 2016. (Supplied: Clayton Caldow)\n\nHe has continued to soldier on, raising his children while battling drought.\n\n\"The youngest one, Poppy, is 11, she's my little gate opener, she asks a lot of questions and she knows how tough it is,\" he said.\n\nHe did not know what the future held for the next generation, and said farming was a tough sell in a drought.\n\n\"You get times this tough — why would you want to do it,\" he said.\n\n\" It's just rain we need, we've just got to wait. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/double-island-great-keppel-keswick-resort-crackdown/105381806",
        "title": "From celebrity hideaway to feral goats: What's next for these island resorts?",
        "publish_date": "Fri, 06 Jun 2025 23:13:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Derelict Queensland island resorts that were once playgrounds for the rich and famous are facing a state government takeover, amid frustrations they have been used for land banking.\n\nPremier David Crisafulli has issued his strongest warning yet to the owners of the crumbling island getaways — some of which have been left to rot, overrun by weeds and feral goats — saying it was now the time to \"use it or lose it\".\n\nThe Queensland government's bid to reclaim what were once the crown jewels of the state's tourism industry is part of a plan to revitalise the sector and double spending on tourism to $84 billion annually by 2045.\n\nMr Crisafulli has accused some operators of \"land banking\" — holding onto prime sites without investing in them, while waiting for land values to rise — and said the Department of Natural Resources had begun issuing notices to those not doing the right thing.\n\nQueensland Premier David Crisafulli has issued a stern warning to the owners of the island resorts. (ABC News: Lucas Hill)\n\n\"These are assets that belong to the people of Queensland. I'm just not comfortable that in many cases, international corporations come in, buy the rights, sit on it, and just see an appreciation in its value,\" Mr Crisafulli said this week.\n\n\" So we are going to take a 'use it or lose it' approach. \"\n\nThe government can cancel or reclaim leases if operators fail to meet their obligations.\n\nAt the top of the government hit list is Double Island off Cairns, once a celebrity hideaway for the likes of actors Jennifer Aniston and Brad Pitt. It has now become an uninhabitable mess.\n\nLast year, the then-Labor state government took the unprecedented step of launching court action to strip a Hong Kong-based developer of the lease, following years of decay and public access disputes.\n\nThe current government is now preparing to sell the 19-hectare island, but it will not simply go to the highest bidder — the state wants a buyer with the financial and managerial muscle to return it to its former glory.\n\nParadise lost\n\nAcross the Great Barrier Reef, once popular tourism destinations are now scarred by dilapidated infrastructure and environmental degradation.\n\nA 2024 parliamentary inquiry found high operational costs, cyclone damage, and a lack of lease compliance enforcement had left several island resorts in disrepair — including those on Great Keppel (Woppa), Hook, South Molle, and Lindeman islands.\n\nLoading...\n\nBrampton Island, near Mackay, was sold to United Petroleum in 2010 for $5.9 million. Today, its oceanfront pool lies unused, filled with sand.\n\nThe 1980s party paradise, Great Keppel (Woppa) Island, off the central Queensland coast, is currently battling a feral goat problem.\n\nResorts, such as that on Great Keppel (Woppa) Island, have been abandoned after years of cyclone damage and neglect. (ABC Capricornia: Katrina Beavan)\n\nThe Double Island resort is among those in the region now marked by dilapidated infrastructure and environmental degradation. (Supplied)\n\nKeswick Island, just off Mackay, has faced stalled development and restricted public access for years.\n\nThe island's lease has been held by Chinese-owned Oasis Forest Ltd since 2019.\n\nResident Adrian Hayne said unreliable access had made life difficult.\n\n\"The ferry is broken down 80 per cent of the time. There's no shops on the island. People rely on the ferry to get food,\" he said.\n\nThe Hayne family own a home on Keswick Island. (Supplied: Adrian Hayne)\n\nMr Hayne said a failed 1990s plan for the island promised a marina, resort and housing.\n\n\"We've had four separate takeovers of the island and all have been failures.\"\n\nMr Hayne said he supported stronger government oversight of island leases.\n\n\"Selling the islands is one thing, but making sure things get done is a whole other ball game.\"\n\nDreamers and 'con artists'\n\nIsland broker Hayley Manville has sold half a dozen tropical islands, including Long Island, Palm Bay, Lindeman and Daydream.\n\nNow she has begun marketing Double Island on behalf of the Queensland government and said interest was at an all-time high.\n\n\"You get a mix [of potential buyers] — billionaires, high-net-worth individuals, offshore investors from Singapore and Dubai, even not-for-profits looking to turn an island into a wellness retreat or rehab centre,\" Ms Manville said.\n\n\"Islands tend to draw in dreamers. We get a lot of inquiries, but a lot of people mix up ambition and ability.\n\n\" We get a lot of con artists. \"\n\nThe Queensland government is watching Double Island, off Cairns. (Supplied: CBRE)\n\nShe said Australian buyers had become more active since the COVID-19 pandemic.\n\n\"Australian investors have realised there's a real shortage of luxury resorts — and those are the ones that tend to thrive on these islands.\"\n\n'These islands belong to Australia'\n\nAustralian businessman Christopher Morris has recently spent tens of millions of dollars reviving run-down resorts in north Queensland and said island tourism was anything but simple.\n\n\"It probably costs double to run a resort on an island compared to the mainland. You've got no utilities. Power, water, waste — everything — has to be generated or brought in,\" he said.\n\nMr Morris bought Pelorus Island near Townsville just over a decade ago and said he had spent upwards of $25 million on refurbishments, including a solar installation and backup generators.\n\nGuests now pay $18,500 a night for the entire island.\n\nHe then bought nearby Orpheus Island in 2017. A night there starts at $2,000.\n\nBillionaire Chris Morris says it takes a huge amount of money to revive islands like these. (Supplied: Morris Group)\n\nMr Morris said it had taken years to see a return.\n\n\"You're probably looking at three years before you make any money. It's about building the brand, getting overseas visitors, and working with travel agents,\" he said.\n\nMr Morris said he linked his properties with private boats, helicopters and other tourism experiences.\n\nThe billionaire said he had his eye on Double Island and had submitted an expression of interest for the site.\n\nHe said the state government could do more to support credible island resort operators and pointed to insurance costs and red tape, such as complex approval processes and infrastructure challenges.\n\nAs the billionaires circle, Keswick Island resident Adrian Hayne said he would like to see the islands remain open for everyone to enjoy.\n\n\"These islands belong to Australia, not just Queensland,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/tasmanian-farmers-record-dry-conditions-worst-in-120-years/105369914",
        "title": "Cattle to wine grapes: Climate change forcing Tasmanian farmers to pivot",
        "publish_date": "Fri, 06 Jun 2025 23:01:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "In the far north-west corner of Tasmania, beef farmer Stafford Ives-Heres has just harvested a bumper crop of wine grapes from his hobby vineyard.\n\nHis hometown of Marrawah is beef and dairy country, relentlessly battered by the Roaring 40s, a powerful band of winds that circle the globe.\n\nTraditionally, it is far too gusty and wet for fussy crops like grapes.\n\nBut despite welcome rain this weekend, the wider region has just experienced its lowest January to April rainfall levels since 1900, creating ideal wine grape growing conditions.\n\nIt is one small hint at a changing climate that could have serious consequences for Australia's food production.\n\nStafford Ives-Heres grows wine grapes in an area known for its beef and dairy farms. (ABC News: Mackenzie Heard)\n\nTransitioning to a 'new normal'\n\nThe dry is likely a result of what climate researcher Tom Remenyi describes as a \"post 2020\" climate system, something scientists have been predicting for decades.\n\n\"All of the modelling kind of suggested that, at about 2020 the globe would move away from a historical climate into a new climate, and all of the evidence is suggesting that that is happening,\" Dr Remenyi says.\n\n\" We're kind of surprised it happened … [at] exactly the moment we were suggesting it would. \"\n\nTom Remenyi says climate scientists have been predicting a \"post 2020\" climate system for decades. (ABC News: Simon Farrell)\n\nFor Mr Ives-Heres, keeping an eye on the changing climate is crucial. He points out a couple of bulls in his paddock worth thousands of dollars, noting the loss of even one of them would be a financial gut punch.\n\nDespite the record dry, his family farm fared relatively well over the summer.\n\nIt was a different story last year, when a more prolonged dry period left his family, along with thousands of other Tasmanians, scrabbling for hay, paying up to $250 a bale.\n\nScam targets farmers looking to buy hay Photo shows Composite image Tasmanian farmers caught by hay scam. These Tasmanian farmers spent thousands of dollars on hay that never arrived. Now, they want to protect other vulnerable people from doing the same.\n\n\"We probably had five really good years on the trot … you can become a bit complacent as farmers,\" he says.\n\n\" But you do adapt to what is becoming the new normal. So, after what happened 12 months ago, we put in a feed budget or a feed plan to cut adequate fodder for the 2024-25 summer. \"\n\nMr Ives-Heres has made sure he has enough fodder to last through the dry season. (ABC News: Mackenzie Heard)\n\nHelp harder to come by\n\nDown the road at Smithton, agricultural contractor Marcus Laing has a truckload of bales to deliver to local farms.\n\nMany farmers he comes across cut enough hay and silage last through spring to carry them through the dry at the start of the year, but are hoping for a dump of rain before the cold sets in.\n\nMarcus Laing says farmers are hoping for heavy rain. (ABC News: Mackenzie Heard)\n\nOver the years, Mr Laing has been involved in charity hay runs to other states, taking bales as far as drought-stricken Moree, about 630 kilometres north-west of Sydney.\n\nThis year, despite devastating floods and droughts across multiple states, that is not looking likely.\n\nHundreds of NSW farmers still dealing with fallout weeks after floods Photo shows A man wearing a blue shirt stands in front of some cows In the weeks since floodwaters ran through the Mid North Coast, some farmers are still struggling to return to normalcy.\n\n\"They've had a hard run up there. They've probably lost crops and lost feed. But yeah, I don't think we're in a position really to help him this year,\" Mr Laing says.\n\n\" Every farmer should be cutting as much grass as they can. If there's spare feed, put it in the conserve feed. \"\n\nCatastrophic floods and droughts across the country means fodder is in short supply. (ABC News: Mackenzie Heard)\n\nAdaptation essential for survival\n\nAs sea and land temperatures rise, westerly rain-bearing fronts from the Southern Ocean that normally soak the state's western coast are being pushed further south between Tasmania and Antarctica, according to Dr Remenyi.\n\nDry conditions in Tasmania proving a challenge for farmers Photo shows Dry conditions on a rural property. Farmers say while there may be patches of green in paddocks, conditions are much drier than usual. In some parts of Tasmania it's been the driest on record since the 1900s.\n\nMeanwhile, easterly systems hitting the other side of the state are travelling down more frequently, but with long, dry spells in between.\n\nAdditionally, warmer temperatures drive evaporation rates up, meaning soil dries out faster than it used to.\n\n\"We end up having longer dry spells everywhere, and then higher intensity rainfall when it does rain.\n\n\"The dry days get drier, and the wet days get wetter,\" Dr Remenyi says.\n\nMontagu River, just 30 kilometres north west of Marrawah has experienced severe flooding in the past. (Supplied: Andrew Kay)\n\nHe says while emissions reduction is important, reframing traditional farming practices will be crucial for Australia's food production.\n\n\"We need to recognise that we committed to this some decades ago, and this change is going to happen,\" he says.\n\n\" We will have to adapt. We need to make sure those farming systems are actually adapted to the climate they're going to experience moving forward. \"\n\nTom Remenyi says farmers need to adapt now in order to survive a changing climate. (ABC News: Kate Nickels)\n\nFor Mr Ives-Heres, who, along with his family, runs beef, a seaweed business and a small vineyard, as well as off-farm jobs, diversity is the key to survival.\n\nRecently he started leasing a paddock in a different location, with hopes a different climate would provide a buffer against future weather events.\n\n\"We already take enough risks as it is in agriculture with Mother Nature, so having off-farm income or diversity within your business is paramount going forward if you're going to be seriously long-term about farming,\" he said.\n\n\" If we haven't got people producing food, we haven't got food. That's the black and white of our scenario. \"\n\nMr Ives-Heres's vineyard in Tasmania's far north-west produced a bumper crop thanks to unseasonably dry conditions. (ABC News: Mackenzie Heard)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/townsville-city-council-community-grants-funding-volunteers/105379096",
        "title": "Events cop funding hit as Queensland council wields budget axe",
        "publish_date": "Fri, 06 Jun 2025 22:53:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Retiree Neil Renison has for seven years had the job of growing Townsville's only orchestra, a task he says suddenly feels impossible.\n\n\"We've been dependent on council funding throughout the life of the orchestra,\" the Barrier Reef Orchestra treasurer said.\n\nThe orchestra received $50,000 from Townsville City Council last year, a quarter of its annual budget.\n\nBut without consultation, the council has capped community grants at $25,000 to stretch available funding.\n\n\"We are going to have to find a considerable amount of money and we may have to curtail some of our activities,\" Mr Renison said.\n\nThe ensemble of 60 volunteering musicians exists to provide rare orchestral experiences for regional Queenslanders.\n\nConductors and directors are paid but musicians are volunteering students, pensioners and professionals.\n\n\"They have other careers but this is what gives them the most joy in their life,\" Mr Renison said.\n\nTownsville City Councillors have been on a year-long mission to cut costs, citing concerns from ratepayers.\n\nSome councillors have raised concerns for the council's own financial liquidity.\n\nSince the beginning of the council term, rates have increased, parking fees doubled and early-bird discounts halved.\n\nAnn-Maree Greaney says the council must make tough budget decisions. (ABC North Qld: Chloe Chomicki)\n\nIn a decision that was later abandoned due to a lack of consultation, the council voted to put parking meters on the city foreshore.\n\nThe grant cuts mean groups that secured $50,000 in 2024 can apply for no more than $25,000 when applications open next month.\n\nLike the Barrier Reef Orchestra, an annual festival celebrating Indian culture received $50,000, as did a Christmas installation and fair.\n\nStable NQ organises an annual Christmas festival. (Supplied: Stable NQ)\n\nThe events have been running for years and have consistently been attended by thousands of residents.\n\nIndia Fest secretary Nick Attam was shattered by the cuts, made just weeks before the August event.\n\n\"We are a not-for-profit, free event, run by volunteers, just to give back to the community,\" he said.\n\n\" We are not ready for this. \"\n\nStable at Riverway is the latest iteration of the Townsville Christmas festival and play. (Supplied: Stable NQ)\n\nAnne Harley, who founded the city's Christmas festival 20 years ago, said she feared for the future of volunteer-run events.\n\n\"I can see a real diminishing of community events,\" the reverend, who wrote to councillors, said.\n\nActing Mayor Ann-Maree Greaney stood by the grant decision and defended not consulting the community.\n\n\"We can't consult on every single thing that comes through council,\" Cr Greaney said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/tasmanian-liberals-rule-out-asset-sales/105388070",
        "title": "'No privatisation': Tasmanian government rules out asset sales",
        "publish_date": "Fri, 06 Jun 2025 22:19:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tasmania's Liberal government has scrapped its controversial plan to explore the privatisation of some publicly owned companies, as it gears up for a very early election.\n\nLabor, members of the crossbench and the Greens passed a motion of no-confidence in Premier Jeremy Rockliff on Thursday afternoon.\n\nOne of the reasons for the motion was the government's hopes to sell of some state-owned companies to pay down Tasmania's growing debt.\n\nWith an election now on the horizon, Mr Rockliff has walked away from those plans.\n\n\"There will be no privatisation under the Tasmanian Liberal government,\" Mr Rockliff said in a statement on Saturday.\n\nThe government had commissioned independent economist Saul Eslake to assess which government business enterprises might be worth selling off.\n\nMr Eslake had already ruled out a number, including Port Arthur and TasRacing, with the government taking his advice on board. It had also ruled out selling Hydro Tasmania and Spirit of Tasmania operator TT-Line.\n\nMr Eslake was due to hand down a further report on June 30.\n\nBut Mr Rockliff said that process was now over, and accused Labor Leader Dean Winter of using a \"scare campaign\" around privatisation to force an early election.\n\n\"It's clear Mr Winter is incapable of having a mature conversation,\" Mr Rockliff said.\n\n\"Given this, we are ceasing that process now.\n\n\"It is over.\n\n\"There will be no privatisation of any government-owned business under our Liberal government.\n\n\"None.\"\n\nMetro Tasmania was one of the government businesses being considered for sale. (ABC News: Maren Preuss )\n\n'Act of a desperate man': Labor leader\n\nIn a statement Mr Winter accused Mr Rockliff of being \"pathetic\".\n\n\"How could you ever believe him? He was talking up his privatisation plan on Thursday then pretending he didn't believe in it on Friday.\n\n\"This is an act of a desperate man who will do anything to cling to power. Tasmanians will never trust him not to sell our assets.\n\n\"He's broken the budget, he'll privatise our assets and our Spirits of Tasmania are still on the wrong side of the world.\n\n\"This is yet another example why Tasmania needs change.\"\n\nYears before he was Labor leader, Mr Winter spoke in favour of having conversations about privatisation, describing them as healthy to have.\n\nMr Rockliff said the government would also be implementing all of Mr Eslake's recommendations from the Independent Review into the State's Finances.\n\nThe exception was those that related to new or increased taxes and reducing infrastructure spending.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-06-07/wine-grape-growers-trial-autonomous-disease-fighting-tech/105374400",
        "title": "Robots roll out as grape growers struggle with disease, rising costs",
        "publish_date": "Fri, 06 Jun 2025 22:00:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Wine grape growers grappling with declining sales and rising expenses hope advancements in autonomous technology can help to safeguard the industry.\n\nGlobal wine consumption has dropped considerably over the last two decades and the increasing cost of chemicals and a labour shortage have put vineyards under pressure.\n\nBut it is hoped technological breakthroughs will provide economic and environmental solutions.\n\nAgri Automation is collaborating with Wine Australia to trial a device that uses a form of ultraviolet (UV) radiation, rather than chemicals, to treat vineyard diseases.\n\nThe method involves a self-driving vehicle travelling between the vines and exposing them to UV-C with an electronic device.\n\nAgri Automation's Cam Clifford says UV-C destroys diseased cells. (ABC Central West: Hamish Cole)\n\nAgri Automation managing director Cam Clifford said UV-C was most effective when applied at night.\n\n\"It works by destroying the DNA of the [diseased] cell, so it will damage it to a point that it can't rebuild itself,\" he said.\n\n\"Once those cells are broken down … they can't rebuild themselves, which essentially controls the disease, as opposed to applying agrochemicals.\n\n\" That has significant benefits for the grower economically, but also from an ecological perspective as well. \"\n\nThe autonomous vehicle allows vignerons to reduce chemical use. (ABC Central West: Hamish Cole)\n\nTraditionally, fungicides, pesticides and herbicides are applied to crops to protect plants and grapes, which requires a number of workers and can take multiple days.\n\nReducing the use of chemicals has been linked with improved outcomes for biodiversity, as well as improved water, soil and food quality.\n\nSimilar technology is being trialled in New Zealand and the United Kingdom.\n\nWelcomed by growers\n\nThe technology has been put on display at the Department of Primary Industries Regional Development research station in Orange, New South Wales.\n\nTamburlaine Organic Wines vineyard manager Boris Ostini says it could have an extremely positive impact for vignerons.\n\n\"It is getting harder to find decent vineyard workers,\" he said.\n\n\"This makes the management of what you are trying to control easier … you can do it when you need to get it done, sometimes in the rain, hail or shine.\n\n\"It will definitely help out with the profitability and the impact of disease.\"\n\nBoris Ostini says the technology could help to attract new customers. (ABC Central West: Hamish Cole)\n\nTamburlaine is certified as an organic winery that does not use fungicides, pesticides and herbicides.\n\nMr Ostini said reducing chemical use created an opportunity to attract new buyers.\n\n\"It will help with the marketing side of things,\" he said.\n\n\" Anything you can do to give yourself an edge or stand out when you market your product is beneficial. \"\n\nAI in the vineyard\n\nGrowers are also using technology to Identify whether vines are diseased and need to be sprayed.\n\nAustralian start-up BioScout has created a device that scans the air in a vineyard for pathogens every 12 hours.\n\nThe data collected is automatically scanned and artificial intelligence is used to identify whether diseases are present in the crop.\n\nVignerons hope autonomous technology will assist with the management of diseases in grapes. ( ABC News: Sophie Johnson)\n\nBioScout's Charles Simons said the system removed the \"guess work\" for growers deciding when to apply chemicals.\n\n\"It gives them the amount of spores and also tells them the severity of the infection, so they can make time decisions on spray applications,\" he said.\n\n\"You look at the environment and you look at the crop and you make the decision on gut-feel … yet you don't know what the pathogens are, which is the missing link.\"\n\nMr Simons said the technology would help to reduce the use of chemicals over time.\n\n\"Vineyards are blanket-spraying applications for powder and downy mildew … that is not very good for the environment,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/quiz-piano-in-pop-culture/105379208",
        "title": "Film to fashion, how well do you know your pianos in pop culture?",
        "publish_date": "Fri, 06 Jun 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "How well do you know your pianos in pop culture?\n\nFrom fashion to film test your knowledge as we celebrate one of the world's most popular instruments, the piano.\n\nAnd if you need more piano in your life, follow the Classic 100: Piano countdown this weekend, counting down Australia's top 100 pieces for the piano on ABC Classic and the ABC listen app.\n\nLoading\n\nStream The Piano free on ABC iview.\n\nCounting down Australia's favourite piano music in the Classic 100: Piano on ABC Classic and the ABC listen app.\n\nGet the latest classical music stories direct to your inbox",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/maud-page-new-head-of-art-gallery-of-nsw-finds-muse-in-politics/105382720",
        "title": "New gallery boss weighs in on dumped artist controversy",
        "publish_date": "Fri, 06 Jun 2025 21:45:52 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Two months into one of the most prized jobs in art, Maud Page has found a muse in the world of politics.\n\n\"I really want the urgency, almost, of a politician,\" Ms Page told the ABC.\n\nThe state's parliament is almost in sight of the institution she has been chosen to lead, the Art Gallery of NSW (AGNSW).\n\nWhile some of her predecessors have enjoyed decades-long tenures (Edmund Capon held the top job for 33 years), the gallery's new director is determined not to waste a moment.\n\nMaud Page has been in the role for two months. (ABC News: Patrick Thomas)\n\n\"I really want to say, 'I've got three years to really make a difference',\" she said.\n\n\"I know that the first few years, even the first couple of weeks and months are really, really crucial in setting the flavour and setting the ambition.\"\n\n'The art world has been a boys' club'\n\nMs Page is the 10th permanent director of the gallery since it was founded in the late 19th century.\n\nShe is also the first woman at the helm.\n\n\"The art world has been a boys' club. But so has every club. Politics has been a boys' club too, so we're not out of step with what's been happening everywhere around the world,\" she said.\n\n\"But I am really pleased that there has been a shift.\"\n\nMs Page is the first woman at the helm of the gallery. (Supplied: Art Gallery of New South Wales/Diana Panuccio)\n\nAs rare as the appointment of a woman, is the promotion of an existing employee to lead the organisation.\n\nMs Page joined AGNSW as deputy director in 2017, working under Michael Brand, who decided to step down late last year.\n\nNew Art Gallery of NSW director announced Photo shows Woman stands against wall with Art Gallery NSW logo, wearing white pant-suit and smiling widely. Current deputy director Maud Page will become the first woman to lead the Art Gallery of NSW in its 154-year history.\n\n\"There is a ceiling to the deputy director [role] and usually deputy directors do not get director jobs,\" Ms Page said.\n\nRecruiters searched the globe for Dr Brand's replacement for a fee of up to $154,000, but ultimately his deputy was deemed the best person for the $509,000-a-year job.\n\n\"The diamond is shinier outside, so I'm really, really pleased that on this occasion the committee chose to look from within,\" Ms Page said.\n\nReports of 'rift' at gallery\n\nMs Page's political skills have been put to the test early in her tenure amid rumblings of tension at the gallery.\n\nMichael Brand decided to stand down late last year. (Supplied: AGNSW/Anna Kučera)\n\nAccording to a report in the Australian Financial Review, two senior executives were believed to have resigned within a fortnight of Ms Page's promotion.\n\nThe newspaper, citing \"sources close to the gallery\", reported that a \"rift\" had emerged in the institution.\n\nWhen ABC's Stateline put the claims to Ms Page, she did not deny the reports but, with the deft communication skills of a politician, explained that change was natural.\n\n\" The newspaper reported a couple of people leaving, and I would hope that that happens too. We're a huge institution, and we need change. \"\n\n\"A creative environment is one where there's strong discussions,\" Ms Page said.\n\nMs Page did not deny the reported rift. (ABC News: Patrick Thomas)\n\nGallery boss praises dumped artist\n\nThe new director was unafraid to weigh in on a recent controversy in the art world — the dumping of artist Khaled Sabsabi as Australia's representative at the 2026 Venice Biennale.\n\nThe Coalition raised concerns in federal parliament in February that some of his old work had glorified terrorism, a representation the artist said was false.\n\nWithin hours, Sabsabi was dropped by Creative Australia, which said his selection posed an \"unacceptable risk to public support for Australia's artistic community\".\n\nMs Page called Khaled Sabsabi \"an extraordinary artist\". (ABC Radio Sydney: Declan Bowring)\n\nMs Page wouldn't say whether she thought the decision undermined artistic freedom, but she did heap praise on the artist.\n\n\"What I can say is that Khaled Sabsabi is an extraordinary artist, and a very thoughtful one, and a very senior artist and very respected,\" she said.\n\n\"Everyone has an opinion about art, so there's interference with art all the time. And so I think it's up to us as institutions and as leaders to make sure we navigate that carefully.\"\n\nFocus on First Nations art\n\nAs for the stamp Ms Page wants to leave on the gallery, she plans to increase the focus on First Nations art, which she said is Australia's \"point of difference when the world looks at us\".\n\n\"Unfortunately, they don't look at all our array of amazing artists, but they do look at the Indigenous because that's never been seen before.\"\n\nShe also plans to ramp up children's programming in a bid to make the gallery feel like a \"second home\" for everyone.\n\n\"I want to make sure that on every single floor there's something for families to do and that it's intergenerational and really exciting when you walk through these doors.\n\n\"I want you to feel it, that it's palpable, that you've got something for you, and that you feel absolutely welcome.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-07/licola-caravan-park-store-lions-club-in-victoria-alpine-park/105374148",
        "title": "Claims of intimidation, threats over big changes in tiny town",
        "publish_date": "Fri, 06 Jun 2025 21:35:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Nestled on the banks of the picturesque Macalister River, Licola is a popular stop for four-wheel drivers, motorcyclists and caravanners heading bush to explore Victoria's rugged Alpine National Park.\n\nBut changes to how the town's store and caravan park will be managed have upset locals and tourists.\n\nLicola is a remote town on the banks of the Macalister River in Gippsland. (Supplied: Middle of Everywhere)\n\nWith a population of about 15, the entire town — including store and caravan park — is privately owned by the Lions Club.\n\nEarlier this year, the Licola Wilderness Village board announced it would not renew the lease held by shopkeeper Leanne O'Donnell.\n\nAnd at the caravan park, guests can no longer pay an annual fee to leave their van year-round.\n\n\"We're trying to keep Licola going,\" board secretary Stephen Boyes said.\n\n\" If we walk away, I worry this place could become a ghost town. \"\n\nMr Boyes said the changes had caused so much anger that staff at a nearby camp run by the Lions Club had been threatened.\n\nThe Licola General Store sells a range of supplies to locals and travellers. (ABC News\" Tavleen Singh)\n\n24-hour fuel, new powered sites\n\nMr Boyes acknowledged the previous operator Leanne O' Donnell had run the shop well, but said the lease had been financially unsustainable for the board.\n\n\"We're on track to lose about $50,000 this year just maintaining that side of the road,\" he said.\n\n\" It is a crappy decision we have had to take, I will be the first to say it. We are not really happy about it. \"\n\nA pin-up board at Licola General Store, displaying photos of vehicles in accidents in the area. (ABC News: Tavleen Singh)\n\nMr Boyes said the change in management would include introducing 24-hour access to fuel at the store.\n\n\"We are looking to put an after-hours card payment in on fuel,\" he said.\n\n\"The operations will be very much the same. Fuel will remain a major part.\"\n\nThe caravan park will temporarily close next year for upgrades, including a new layout for tourist stays, an upgraded power system and a modern camp kitchen.\n\nThere will be 40 powered sites and 10 riverfront camp sites available by early next year, but annual sites will be removed.\n\n\"We will be looking to run it as a tourist caravan park … it wouldn't have annuals in [it]. It would be just for short-term stays,\" Mr Boyes said.\n\n\"We're doing this to improve viability.\n\n\"When sites are permanently taken but not occupied, that limits how many visitors we can actually host.\"\n\nStaff facing threats\n\nLicola is about three hours' drive east of Melbourne and is the only privately owned town in Victoria.\n\nAll of the facilities in Licola were bought by Lions Club New South Wales and Victoria in 1969 to keep the town alive.\n\nThe group established Licola Wilderness Village, a camping site that hosts camps for disadvantaged students, which is separate from the caravan park and sits opposite the shop.\n\nLoading...\n\nMr Boyes said the changes at the general store and caravan park had prompted anger and backlash directed at innocent staff.\n\n\"We have legitimate concerns — some of the tone has been a bit intimidating,\" he said.\n\nMr Boyes said staff at the Licola Wilderness Village camp were getting threats in emails and in person.\n\n\"We are getting close to a point where we think we may have to remove our staff from the village for a while,\" he said.\n\nMs O'Donnell said she learnt from the board that camp staff were getting threats but neither she nor her employees were involved.\n\n\"It's a very passionate community,\" she said.\n\n\"I've not told anybody to do anything like that because that's not who I am.\n\n\"None of my staff do that. My staff know who I am and what I do ... I'm not a mean and nasty person.\"\n\nMr Boyes said he wanted locals to understand the board was working in the best interest of Licola.\n\n\"We have a responsibility under the Corporations Act to act in the best interests of the entity,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-june-7-2025-20250604-p5m4uo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, June 7, 2025",
        "publish_date": "Sat, 07 Jun 2025 12:01:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "17/26\n\nMichael Landy, founder Eagle Financial Solutions, forensic accountant and adviser. Michael Landy says that in all his decades of financial advising he’s never seen as big an example of corporate misconduct as the Lion Property Group matter. He’s helping the investors take legal action against the group and has mapped out the projects on A3 paper. Credit:Wayne Taylor",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/build-up-to-a-blow-up-inside-the-trump-musk-meltdown-20250607-p5m5n8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Build-up to a blow-up: Inside the Trump-Musk meltdown",
        "publish_date": "Sat, 07 Jun 2025 11:27:51 +1000",
        "category": "finance",
        "authors": [
            "Tyler Pager",
            "Maggie Haberman",
            "Jonathan Swan",
            "Theodore Schleifer",
            "Ryan Mac"
        ],
        "text": "This account of the crumbling ties between the president and Musk is based on interviews with 13 people with direct knowledge of the events, all of whom asked for anonymity to describe private discussions. Loading While the relationship had been losing steam over the past several months as Musk clashed with Trump officials, people close to both men said the disagreement over Isaacman accelerated the break-up. Musk had been planning to exit the White House relatively quietly – before Isaacman’s ouster left him feeling humiliated. Now Musk and Trump, who seemed inseparable at one point, are on opposite sides.\n\nMusk suggested Trump should be impeached. Trump has threatened to cancel government contracts with Musk’s companies. And in recent days, Trump has been telling people close to him that he believes Musk is acting “crazy” and must be doing drugs. For Musk, there were few positions across the thousands in the federal government that mattered more to him than the head of NASA, because of its critical importance to SpaceX, his rocket business. So it was of great personal benefit to Musk when Trump chose Isaacman – who has flown to space twice with SpaceX – to oversee the agency. Trump farewells Elon Musk in the Oval Office on May 30, after the latter’s 130-day stint as a special government employee. Credit: AP Isaacman’s donations to Democrats had not always been a problem. While Trump privately told advisers that he was surprised to learn of them, he and his team had been briefed about them during the presidential transition, before Isaacman’s nomination, according to two people with knowledge of the events.\n\nBut by last Friday, when Trump went through the file containing details of the donations, he clearly had changed his mind. Credit: Illustration: Matt Golding Musk barely mounted a defence of his friend. He was anxious about doing so with other people around, including Sergio Gor, director of the presidential personnel office, who had clashed with Musk over other staffing matters. Musk believed that he would be able to talk to Trump at some point after the gathering, privately. But Musk never got a chance to make his case. In the hours after the Oval Office farewell, Trump decided he would withdraw Isaacman from consideration. Musk was stunned by how fast it all happened.\n\nMusk’s allies have argued privately that Isaacman’s recent donations to Democrats were not ideological and made at the encouragement of senator Mark Kelly, a former astronaut. A spokesperson for the Democratic senator for Arizona declined to comment. Loading As Musk dealt with the fallout from the tanked nomination, he spent part of the weekend outside Missoula in Montana, as a guest at “Symposium” – an event for tech executives, investors and startup founders thrown by Founders Fund, the venture capital firm founded by Peter Thiel. He mingled with guests at Paws Up, a high-end resort with glamping tents and luxury cabins set on 15,000 hectares of a historic cattle ranch. There, he had a wide-ranging conversation with Thiel, who could sense no coming feud with the president, according to a person familiar with the talks. OpenAI chief executive Sam Altman, who has been openly feuding with Musk, also attended, though the two did not speak.\n\nFor Musk, the goings-on in Washington were still top of mind. After spending a day in Montana, he turned his attention in earnest to assailing the top domestic priority of Trump: the Republican bill making its way through Congress that would slash taxes and steer more money to the military and immigration enforcement. Privately and publicly, Musk stewed over the bill, believing that its spending would erase the supposed savings of his Department of Government Efficiency (DOGE) and add to the federal deficit. Some Republican lawmakers had tried to assuage Musk’s fears. On Monday, Republican House Speaker Mike Johnson walked the billionaire through the bill and said Congress would try to codify the work done by DOGE.\n\nAfter the call, Johnson told associates that he felt Musk was uninformed about the legislation and the congressional process, but that he had been able reason with the world’s richest man, according to a person familiar with the conversation. On Monday evening, Musk still had concerns. He hinted at them on his social platform X, reposting a chart apparently showing the yearly increase in the national debt. “Scary,” Musk wrote as a caption. Trump did not respond to Musk’s criticisms of the bill and maintained a light public schedule.\n\nThe Trump-Musk alliance fully ruptured on Thursday, six days after the two men put on the collegial display in the Oval Office. Elon Musk attacked Trump in posts on X on Thursday (Friday AEST). Credit: NurPhoto via Getty Images Musk, who had largely focused his attacks on Republicans in Congress, had started directing more ire at the president. So when Trump was asked about Musk’s comments during a meeting with Friedrich Merz, the new German chancellor, the president finally let loose. He said he was “disappointed” in Musk, downplayed the billionaire’s financial support for his presidential campaign and posited that Musk developed “Trump derangement syndrome” after leaving the White House. Musk fired back in real time. Using X, he unleashed a torrent of attacks. He claimed there were references to the president in government documents about Jeffrey Epstein, the sex offender, and indicated his support for the president’s impeachment. He also said Trump’s tariffs would cause a recession by the end of the year.\n\nLoading Later, Trump, using his own social media platform, threatened to cut billions of dollars in federal contracts with Musk’s companies. By Thursday evening, Musk signalled he would be open to de-escalating the fight, while the president seemed to have little interest in an immediate reconciliation. White House officials said Trump had no plans to call Musk. “President Trump is the unequivocal leader of the Republican Party, and the vast majority of the country approves of his job performance as president,” White House press secretary Karoline Leavitt said. “Inflation is down, consumer confidence and wages are up, the jobs report beat expectations for the third month in a row, the border is secure and America is hotter than ever before.” A spokesperson for Musk did not respond to a request for comment.\n\nLoading Musk, his allies and even some White House officials now pin the blame on Gor, believing he sabotaged Isaacman as Musk was on his way out. But some close Trump allies say Gor was being unfairly criticised for a decision that ultimately rests with the president. Gor and Musk clashed several times early in Trump’s second term, including at two cabinet meetings, when Musk questioned how swiftly Gor was moving to fill the top ranks of agencies. Musk’s team and Gor’s team often disagreed over personnel and the amount of power that should be given to aides at DOGE. But Gor’s title – director of the White House Presidential Personnel Office – does not convey the scope of his influence in the president’s orbit. Gor founded a pro-Trump super political action committee during the 2024 presidential election, and co-founded a publishing house with Donald Trump Jr that has published books by the president and his allies. The president’s aides and allies quickly jumped to Gor’s defence on Friday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/the-players-are-so-angry-tottenham-face-revolt-over-postecoglou-sacking-20250607-p5m5na.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The players are so angry’: Tottenham face revolt over Postecoglou sacking",
        "publish_date": "Sat, 07 Jun 2025 11:00:00 +1000",
        "category": "sports",
        "authors": [
            "Matt Law"
        ],
        "text": "Tottenham Hotspur chairman Daniel Levy is facing the threat of a player revolt, having brutally sacked head coach Ange Postecoglou two weeks after winning the Europa League.\n\nPostecoglou’s exit came on the two-year anniversary of his appointment. It is understood that chief football officer Scott Munn, who was one of Postecoglou’s biggest supporters inside Spurs, has also been sacked by Levy.\n\nPostecoglou’s departure has angered a number of Tottenham players, with sources claiming some want to leave the club and that the Australian’s successor will face a huge task to repair the dressing-room damage.\n\nPostecoglou was left in the dark over his future for almost two weeks after the final Premier League game of the season before being told he had been sacked on Friday. A source said: “The players are so angry about what has happened and how it has been handled. The next manager is going to inherit a difficult situation.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-harry-meghan-markle-and-their-children-enjoy-disneyland-20250607-p5m5nc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Harry, Meghan Markle and their children enjoy Disneyland",
        "publish_date": "Sat, 07 Jun 2025 10:05:56 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Harry, Meghan Markle and their children enjoy Disneyland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-2025-afl-teams-and-experts-tips-all-the-changes-for-round-13-20250603-p5m4l9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL teams and round 13 tips: Parish back for Dons, Silvagni returns for Blues",
        "publish_date": "Sat, 07 Jun 2025 09:51:24 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Loading\n\nClick here for the latest episode of the Real Footy tipping podcast.\n\nWESTERN BULLDOGS\n\nB: L.Cleary, J.O’Donnell, R.Gardner\n\nHB: L.Bramble, R.Lobb, B.Dale\n\nC: B.Williams, E.Richards, J.Freijah\n\nHF: R.Sanders, A.Naughton, M.Kennedy\n\nF: L.Vandermeer, B.Khamis, R.West\n\nFOLL: T.English, M.Bontempelli, T.Liberatore\n\nI/C: S.Davidson, J.Dolan, J.Harmes, L.McNeil, A.Treloar\n\nEMG: N.Coffield, C.Hynes, L.Jaques\n\nIN: R.Gardner, J.Dolan, A.Treloar\n\nOUT: O.Baker (omitted), J.Johannisen (illness), T.Duryea (omitted)\n\nHAWTHORN\n\nB: J.Battle, T.Barrass, S.Mitchell\n\nHB: J.Impey, J.Weddle, K.Amon\n\nC: C.Macdonald, C.Nash, H.Morrison\n\nHF: B.Hardwick, S.Butler, D.Moore\n\nF: M.Ramsden, M.Chol, J.Gunston\n\nFOLL: L.Meek, J.Newcombe, J.Ward\n\nI/C: J.Ginnivan, C.Jiath, J.Worpel, M.D’Ambrosio, F.Maginness\n\nEMG: C.Mackenzie, J.Serong, S.Frost\n\nIN: S.Mitchell, S.Butler, M.Ramsden\n\nOUT: J.Sicily (injured), N.Watson (illness), J.Scrimshaw (managed)",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/a-rabbitohs-great-was-the-easy-pick-for-reynolds-300th-game-presentation-20250605-p5m5av.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A Rabbitohs great was the easy pick for Reynolds’ 300th game presentation",
        "publish_date": "Sat, 07 Jun 2025 09:34:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Adam Reynolds said if it wasn’t for a former premiership-winning South Sydney teammate, he probably wouldn’t be celebrating 300 NRL games on Saturday night.\n\nSo it was only fitting that Issac Luke was brought into the Brisbane Broncos’ inner sanctum on Friday morning to present Reynolds with his milestone jersey.\n\nLuke and Reynolds became friends a couple of years before Reynolds debuted in 2012, largely because they were both teenage fathers. Their partners, Tallara and Mickayela, were also close.\n\n“Issac is someone who took me under his wing when I came into first grade. We had kids around the same age, I was shy, but he opened his arms and made me feel really comfortable around the group,” Reynolds said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/ange-sacked-by-spurs-despite-trophy-triumph-20250607-p5m5mz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ange sacked by Spurs despite trophy triumph",
        "publish_date": "Sat, 07 Jun 2025 08:12:01 +1000",
        "category": "sports",
        "authors": [],
        "text": "Ange sacked by Spurs despite trophy triumph\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/ange-will-land-on-his-feet-but-spurs-have-made-an-enormous-mistake-in-sacking-him-20250607-p5m5mo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ange will land on his feet. But Spurs have made an enormous mistake in sacking him",
        "publish_date": "Sat, 07 Jun 2025 07:08:09 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "If that was so crucial, how to explain the cards that Postecoglou was asked to play? Why was he given such a thin squad to take into the season, its lack of depth brutally exposed by those injuries? Why was it that Spurs did not support him with another centre-back in the January transfer window until after their third-choice option in that position went down with a season-ending ACL injury, adding to a crisis which had already ripped the heart out of their domestic campaign? Why was their policy of pursuing talented young players – which, no doubt, will hold them in good stead for the coming years – not also supported with experience that could have enabled them to compete on multiple fronts, when they absolutely have the financial capacity to do both? Postecoglou knew it wasn’t possible this season, so after January, as he explained in his post-Europa League final press conference, he selected one front and focused on it. His staff and playing group backed him in. He made the calculation that ending the club’s trophy drought was the only way of breaking their psychological chains. He said that not everybody at the club agreed with that decision; we can now safely assume that Levy was one of those people. Levy now has the nerve to talk about “emotions” when there was clear logic at play. Tottenham’s motto is Audere est Facere: To Dare is To Do. Postecoglou dared, and he did. “The game is about glory,” the legendary Spurs manager Danny Blanchflower once said. He brought them glory, and his reward was the sack. Postecoglou and Spurs chairman Daniel Levy after the Europa League win. Credit: Getty Images\n\nHe deserved the right to have another crack, but that has been taken away from him. This is the first time Postecoglou has been fired mid-contract. Sure, he was let go by Football Federation Australia at the end of his six-year tenure as Australia’s national youth coach, but that was a little different – his contract was up, and he probably wasn’t going to seek an extension anyway. He has always tried to be the master of his own destiny, but not this time. He will land on his feet. Tottenham’s loss will be another club’s gain. Postecoglou’s reputation has only been enhanced by his time there, his triumph in the Europa League and the way he handled himself throughout. Another team will come for him, and he will win with them. Inter Milan, the beaten UEFA Champions League finalists, could do much worse after their manager Simone Inzaghi decided to take the riches in Saudi Arabia. So could other clubs in Italy, Germany, Spain ... anywhere, really, where they like success. Equally, Postecoglou will feel he has unfinished business in England, and will want to defy the critics who say his brand of football is unsustainable in the Premier League.\n\nAs for Spurs? The hot favourite to take over is Thomas Frank, the Danish manager currently in charge of Brentford. He may prove an excellent fit. Postecoglou has left him an excellent platform to build upon. Loading But Frank has also never won a major trophy in his career. He has never managed a club which has competed in European competitions, or one as big as Tottenham Hotspur. Last season, his team finished 10th in the Premier League, largely due to injuries. He will also have to deal with a playing group that was utterly in Postecoglou’s thrall and reportedly angry with how the club handled his exit. And a board which has made it clear that winning trophies is not enough for them. Tasking him with untying the Gordian knot that is Tottenham Hotspur is a bigger risk than sticking with Postecoglou for a little longer – but that is their call. Good luck with that.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/a-new-boss-his-buddies-and-a-2-6-billion-cash-splash-inside-the-icac-probe-into-school-infrastructure-20250603-p5m4ip.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A new boss, his buddies and a $2.6 billion cash splash: Inside the ICAC probe into School Infrastructure",
        "publish_date": "Sat, 07 Jun 2025 05:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Mcgowan",
            "Lucy Carroll"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Seated in the austere confines of the Independent Commission Against Corruption’s witness box, Mark Scott, the former secretary of the NSW Education Department, remembered Anthony Manning as a popular choice as the first chief executive of a new school-building unit back in 2017. Well-connected from his time working for the equivalent health agency, Manning’s name had been floated as a possible candidate by then-education minister Rob Stokes after a suggestion from PwC partner Amy Brown, and the former premier Mike Baird was among his referees. Health minister Brad Hazzard complimented the appointment at the time, Scott recalled, and senior public servants who had worked with Manning gave Scott the impression of someone viewed as “can-do” and “focused”. “I received no signals of concern or disquiet,” Scott recalled. There were no “red flags”. Former NSW Education Department secretary Mark Scott leaving the ICAC building. Credit: Dean Sewell But, as the ICAC has heard during a month of evidence in its public probe into Manning’s conduct as head of School Infrastructure NSW between 2017 and last year, alarm bells had been ringing among senior public servants in the Education Department for several years after he landed the job. “Somewhere on the spectrum between a bully and completely corrupt,” is how director of strategic governance Sasha Holley remembered describing Manning to a friend in 2023.\n\nAdvertisement\n\nThe watchdog announced in April that it would hold a public inquiry to probe allegations Manning and others at School Infrastructure subverted recruitment practices, improperly awarded contracts and misallocated funds to benefit friends and associates during his time at the agency. It is also probing whether Manning and others engaged in “reprisal action” against staff who raised concerns. The probe came after Manning’s abrupt departure from the role in February last year. The Sydney Morning Herald first reported his referral to the watchdog in July, as well as concerns over an axed $40 million school building contract awarded by the agency. That Manning was in the ICAC’s sights had been a discomforting discovery for successive education secretaries. Georgina Harrisson, who headed the department from 2021 to 2023, said she became “less assertive” in her attempts to track contractor spending in the agency after being notified of “a need not to disrupt things” because of the probe. Former education minister Rob Stokes and then head of School Infrastructure Anthony Manning at North Kellyville Public School in 2018. Credit: Janie Barrett At the heart of the ICAC inquiry are four contractors, and their relationship with the school building boss; Martin Berry, Stuart Suthern-Brunt, Michael Palassis and Kathy Jones. All four were handed millions of dollars in contracts from the agency during Manning’s time as chief executive via their companies, and all four had personal and professional relationships with him.\n\nAdvertisement\n\nManning had known Berry since 2006 and organised his buck’s party. He took spin and yoga classes with Suthern-Brunt, and once described Jones as his “communications fairy godmother”. In 2017, he and Palassis were part of a group trying to develop a “cancer wellness” hospital in China close to the time his company, Paxon, were bidding along with PwC to win a tender with the agency. In total, the four contractors and their associated companies earned some $18 million from NSW taxpayers during Manning’s time in School Infrastructure. But the inquiry has also laid bare a culture in which contingent workers on astronomical wages rode roughshod over the established bureaucracy – some 1,400 contractors were paid more than $344 million between 2017 and 2024, a figure which does not include the sums paid to Manning’s associates – and where officials who raised concerns about breaches of procurement rules were often swept aside. Andrea Patrick appears as a witness at the ICAC. Credit: ICAC It was an agency in which, at least according to some witnesses, the normal rules did not apply. Andrea Patrick, a senior procurement officer at the department who was fired by Manning, alleged that at a meeting in 2017 he “made a comment along the lines of ‘I don’t need you or services or policies’.”\n\nAdvertisement\n\nManning, she claimed, told her he had a “direct line” to ministers and said words to the effect of “if I need to do things different, I just pick up the phone to them, and they’ll sort it”. Running through the inquiry is a sense Manning believed he was brought in to the building unit to shake up a flailing department. Loading With a $2.6 billion funding injection for new school infrastructure coming, there was concern at senior levels of the NSW government that that current leadership wouldn’t be able to get the job done, Scott recalled. Stokes, who was education minister when the agency was set up but is not accused of any wrongdoing, described a feeling of “exasperation” with the department over issues such as a new high-rise school, Arthur Phillip in Parramatta, which was plagued by cost blow-outs and delays. The agency was established in 2017 as the state’s public schools were facing an explosion in enrolments and overcrowding was hitting primary and high schools. At the time Stokes described the new unit as “a centre of excellence for assets and their delivery” in response to “changes around population growth, new ways of teaching and learning, and social change”. But from very early in his tenure, the behaviour which ICAC is now probing began to emerge. Only six weeks into the job, ICAC has heard, Manning spoke to his former boss and friend, Martin Berry, about engaging him and his company, Heathwest Advisory.\n\nAdvertisement\n\nManning and Berry had known each other since about 2006, ICAC has heard, and in his first round of evidence to the commission last week, Berry conceded the two were friends. He gave Manning a job in the Sydney office of consulting firm Turner & Townsend and the two men often socialised together. Manning organised Berry’s buck’s party and attended his wedding, and in text messages dating back to 2015 they bantered about England’s success in the cricket – both are from that country – and arranged to catch up for dinner and drinks near their homes on Sydney’s northern beaches. They also discussed work, and Berry admitted Manning had helped get him a job at Health Infrastructure NSW. But, he also said the men “kept our relationship at a professional level”. “Sorry, just, what do you mean by that?” counsel assisting the inquiry Jamie Darams asked during the examination. “Well, we recognised that there would be occasions where we might be in roles that would need to be seen to be maintaining a professional relationship,” Berry responded. Two weeks after their meeting in 2017, ICAC has heard, Berry sent Manning a “proposed scope of works” to his private email address. The schools’ boss then passed on Berry’s wording to several of his staff – without telling them where it had come from – and a similar document was issued as a “request for quotations” from the agency which Heathwest Advisory went on to win. In other words, as Darams put it, Berry drafted the scope of work put out to a tender that his own company was then awarded, giving it an “obvious advantage” over its competitors.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/they-re-the-best-soccer-team-in-the-bush-but-they-ve-got-nowhere-to-play-20250519-p5m0g1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "They’re the best soccer team in the bush. But they’ve got nowhere to play",
        "publish_date": "Sat, 07 Jun 2025 05:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the middle of practically nowhere - six hours’ drive west of Sydney, five hours’ drive north of Melbourne - lies the best-kept secret in Australian soccer. Maybe Australian sport. Griffith, NSW, is a place that shouldn’t exist. Without irrigation, it would be a desert - dry, flat, and empty. But in 1916, as part of the bold, utopian Murrumbidgee Irrigation Area scheme, it was built from scratch as a planned city, designed by Walter Burley Griffin, the same American architect who laid out Canberra. The early settlers, mostly returned servicemen and British migrants, struggled with the land; it wasn’t until the Italians arrived, bringing with them generations of agricultural know-how and a relentless work ethic, that the region truly began to bloom. Today, around 60 per cent of the city’s 25,000 residents are said to claim some degree of Italian heritage, and it shines through in everything they do. Top-notch Italian eateries line the city’s main drag, Banna Avenue; walking into the famous old La Scala restaurant, down a dingy, dimly lit staircase, was like stumbling into a dinner scene from Goodfellas. The local wine scene is quietly excellent; Yellow Tail, Australia’s leading export brand and a bona fide global phenomenon, is produced in Yenda, which is a 13-minute drive to the east. A tractor transporting harvested grapes through Yarran Wines, Yenda - just east of Griffith. Credit: Destination NSW Season two of Underbelly was also partially set in Griffith, harking back to a darker past that has unfairly coloured the town’s reputation. And then, of course, there’s the soccer.\n\nAdvertisement\n\nThe standard of play at Griffith’s grassroots is surprisingly high given its geographic isolation. The passion for the game is strong, and it has to be, considering the immense obstacles that need to be overcome just to take part. To play at any serious level is to accept many, many hours of driving for hundreds of kilometres just to find an opponent. In football, as in agriculture, Griffith’s best produce ends up elsewhere. If you happen to be decent - like Brisbane Roar youngster Pearson Kasawaya, or former national league players such as Michael Musitano, Eliza Ammendolia or Jordan Jasnos - you eventually have to move to the big smoke to pursue your dreams. ‘A big family affair’ Griffith’s biggest and most successful club is Yoogali Soccer Club, named for the small township on the city’s eastern fringes, towards Yenda. It was formed in 1954 out of the Yoogali Club, one of Australia’s oldest ethnic social clubs, which was where members of Sydney’s Italian community visited for inspiration before founding Club Marconi - though it no longer plays there, having linked up with the Griffith Leagues Club down the road years ago. (That’s why there’s a second team based in Yoogali, known as Yoogali Football Club; the schism between ‘YSC’ and ‘YFC’ would require a whole book to properly explain.) Yoogali has won 34 first-grade titles in various competitions and regularly hosts teams from Sydney for pre-season matches. Tom Sermanni used to bring the Matildas there regularly for training camps during his first two stints as national team boss and spoke at Yoogali’s season launch at the start of this year.\n\nAdvertisement\n\nThe Yoogali Club. Credit: Instagram / @oakbankbecart In an alternate universe, where Griffith is, say, two hours’ drive from Sydney instead of six, it’s not difficult to imagine a club like Yoogali climbing the ranks into the old National Soccer League, back when it had promotion and relegation into the state leagues. Luke Santolin is the current coach of Yoogali’s senior men’s team. His grandfather (or nonno) Noé was one of the club’s founding fathers - the field at the Yoogali Club is named for him - and his father Tony used to coach, and still plays. “They used to play after church with all the Italian immigrants, and it just grew from there,” Santolin says. “Like most football club stories, they were doing everything: they were cutting the grass, they were painting the lines, putting the nets up, all that jazz. It was a big family affair back then. My two boys have just started playing now. It’s really all I’ve ever known.” One of Yoogali’s earliest soccer teams, from the 1950s. Credit: Yoogali SC Yoogali has an itinerant soccer history, through no fault of their own. Far too big for the local league in Griffith, they have spent decades trying to find somewhere to play, only to be consistently rebuffed. They’ve played in Shepparton (twice), Wagga Wagga, a short-lived Regional Premier League involving other Victorian teams, and most notably, in Canberra.\n\nAdvertisement\n\nInvariably, other teams get sick of driving to Griffith and find a way to get rid of them, even though they only have to travel once per year, and Yoogali every fortnight. “We’ve never forfeited a game. Would you believe that? Never,” says Santolin. Griffith’s greatest soccer triumph came in 1971, when a team called Griffith United (an amalgamation of Yoogali and Hanwood FC, their fierce rivals) won the league and cup double in the ACT. They played in front of big, boisterous crowds at home, and then jumped on a bus to Canberra every other weekend to fulfil their away commitments. In that team? Not only Tony Santolin and two Paraguayan brothers, Willie and George Wood, but a 16-year-old Walter Valeri, the father of future Socceroo Carl; his father (Carl’s nonno) was one of Hanwood’s founding members. The Valeris later moved to Canberra for work opportunities. Former Socceroo Carl Valeri (centre) can trace his roots back to Griffith - specifically, to Hanwood FC. Credit: Reuters “The impossible dream came true,” wrote local newspaper The Area News when Griffith United were crowned champions. “They trained hard, travelled long distance and fought tenaciously to give this town an enviable soccer supremacy. They won and thoroughly deserved it.” The next year, they were kicked out for administrative reasons. For the past five years, Yoogali has been competing in Canberra again, as part of the Capital Football system. In 2023, they won promotion to the top-flight NPL - putting them technically just one step below the A-League - and then last year, defied the odds to stay up.\n\nAdvertisement\n\nUnlike their opponents, they don’t pay their players - although they do have a long, proud history of sourcing players from overseas, particularly from Scotland. They don’t get paid either, but the club does cover their airfares and finds them work in Griffith (picking fruit, usually, at first) and a place to live. Some of them never go back. “I remember as a kid growing up, my grandparents had a granny flat at the back of their house where the overseas players would live in,” Santolin says. “I remember going to kick the ball with them and then seeing them play for Yoogali on a Sunday. We got to a level where players were calling us, saying they’d heard from a mutual friend or a contact about our club, and how do they come out? You only get that reputation by conducting yourselves the right way. Some of my best friends ever started off as visa players, and now they’ve got three, four kids, a wife, a business, when originally they just came over to kick a ball. So it’s pretty special.” This year’s team features five members of the Donadel family who, like the Santolins, are Yoogali royalty. Two of them are sons of Sante Donadel, assistant coach, former first-grade coach and a former player for over 50 years. The Donadels moved to Griffith in 1970; Sante’s father played for Yoogali, and made life-long friends at the club, and his uncle was coach of Griffith United when they did the double in ’71. “We’re still learning, as players, coaches and our committee, how to deal with that level of football, the NPL,” Donadel says. “It’s by far the best comp we’ve played in. But it’s been good. We’re one of the only [regional] clubs to have ever done something like this.” Things have been tracking well on the field. They recently smashed last season’s premiers, Gungahlin United, 5-1.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-coach-ange-postecoglou-sacked-from-tottenham-hotspur/q6j8z16kj",
        "title": "Backlash as Australian coach Ange Postecoglou sacked from Tottenham Hotspur",
        "publish_date": "Fri, 6 Jun 2025 23:58:41 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ange Postecoglou's rollercoaster two-year reign at Tottenham Hotspur is over after the North London club sacked their Australian head coach.\n\n\n\n\n\nIt comes despite Postecoglou guiding Spurs to a 1-0 victory in the Europa League final over fellow Premier League (EPL) side Manchester United in Bilbao last month.\n\n\n\n\n\nIt meant the 59-year-old had delivered on his promise of \"always\" winning a trophy in his second season.\n\n\n\n\n\nBut it also came at the end of a dismal EPL campaign in which the club finished in 17th place, just above the relegated trio.\n\n\n\nTottenham confirms sacking\n\nTottenham confirmed the sacking in a statement released overnight, which read: \"Following a review of performances and after significant reflection, the Club can announce Ange Postecoglou has been relieved of his duties.\n\n\n\n\n\n\"We have made what we believe is the right decision to give us the best chance of success going forward, not the easy decision.\n\n\n\n\n\n\"We have a talented, young squad and Ange has given us a great platform to build upon. We should like to express our gratitude to him. We wish him well for the future — he will always be welcome back at our home.\"\n\n\n\n'Something I will never forget'\n\nPostecoglou also issued a statement, saying: \"When I reflect on my time as manager of Tottenham Hotspur, my overriding emotion is one of pride.\n\n\n\n\n\n\"The opportunity to lead one of England's historic football clubs and bring back the glory it deserves will live with me for a lifetime.\n\n\n\n\n\n\"Sharing that experience with all those who truly love this club and seeing the impact it had on them is something I will never forget.\n\n\n\n\n\n\"That night in Bilbao was the culmination of two years of hard work, dedication and unwavering belief in a dream. There were many challenges to overcome and plenty of noise that comes with trying to accomplish what many said was not possible.\"\n\n\n\nREAD MORE Who is Ange Postecoglou? How a Greek immigrant is conquering the football world\n\nTottenham face backlash\n\nPostecoglou's sacking sparked shock and outrage as the football world digested the news that a man who had ended his club's long search for silverware had been shown the door a fortnight later.\n\n\n\n\n\nEngland manager Thomas Tuchel, himself sacked by Chelsea a year after winning the Champions League in 2021, said: \"It just shows you that it is not only about titles, you can survive seasons without titles if your connection, the support and the belief and the trust between the coach and the club is strong then you can overcome seasons without titles.\n\n\n\n\n\n\"If there is slight disbelief, if there are concerns, if the trust is not there anymore, obviously then it is sometimes not even enough to win a trophy after so many years.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-anne-aly-on-australias-multiculturalism/jgghqxp0c",
        "title": "INTERVIEW: Anne Aly on Australia's multiculturalism",
        "publish_date": "Fri, 6 Jun 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nThe establishment of the new office follows concerns about how multicultural issues have been treated by the government, with communities feeling like they're being monitored rather than assisted.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/how-50-years-of-migrant-history-helped-an-australian-street-to-become-the-worlds-coolest/sbu771z3c",
        "title": "How 50 years of migrant history helped an Australian street to become the world’s coolest",
        "publish_date": "Fri, 6 Jun 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhen it comes to traditional Italian treats, Lucchini Cakes in Melbourne’s Preston is a local favourite.\n\n\n\n\n\nThe High Street dining room remains full most days.\n\n\n\n\n\nFor the past 53 years, customers were welcomed by John Menara and his wife Sonia.\n\n\n\n\n\nSonia: \"Food is our passion and it is our passion has always been.\"\n\n\n\n\n\nJohn: \"The new people that come in can't believe that it's still the same family, in the same business.\"\n\n\n\n\n\nThe shelves are filled with sweet treats, continuing a tradition that began in the 1950’s when John’s uncle, Enzo Lucchini, first started out on Melbourne’s Lygon Street.\n\n\n\n\n\n\"He'd be proud that his name is still going on. He would be very proud of that. And he was a very proud man. He came from a very, very wealthy family.\"\n\n\n\n\n\nCommunity is at the heart of this small business.\n\n\n\n\n\nThe Menaras say it’s a place people come to meet and chat and connect with culture.\n\n\n\n\n\nSonia: \"The customers that have come in, they've made friends with people that they didn't know.\n\n\n\n\n\nJohn: \"Greeks, Italians, everyone. Everyone got really well together.\"\n\n\n\n\n\nSpeaking Italian with customers is also appreciated, says Sonia Menara - especially by one older woman.\n\n\n\n\n\n\"She is lovely, and has been a customer for the last 45 years. I'll go up and I speak to her in Italian and she orders her cake. It does make people feel like home and the connection; that they come in here and there is someone that will understand them.\"\n\n\n\n\n\nIt’s ironic that John Menara was born in Australia and has never been to Italy – yet his family business has a cosy European feel.\n\n\n\n\n\n\"It's how I wanted to connect with my ancestry back in Italy. It was to put Italy on the walls with artwork and everything else. It makes me feel good.\"\n\n\n\n\n\nThat sense of culture and community a few of the reasons High Street holds the honour as the world’s coolest – as voted by Time Out Magazine.\n\n\n\n\n\nMelbourne Editor Leah Glynn explains:\n\n\n\n\n\n\"High Street really ticks all the boxes. It's got really epic restaurants, cute hidden bars, great boutiques, and a really wonderful community spirit. It beat out 30 other streets, which is an amazing achievement for High Street in Melbourne on a global scale. And I think it really just goes to show that Melbourne's offerings are truly world-class.\"\n\n\n\n\n\nLocal Historian Emma Russell agrees:\n\n\n\n\n\n\"Because of the diversity, I think it does represent a lot of what's so fantastic about Melbourne. It's not just retail, it's community organisations, community activities that look after people or that provide cultural activities for people from all ranges of backgrounds.\"\n\n\n\n\n\nAnd perhaps nowhere is the diversity of food and cultures more evident than at Preston Market.\n\n\n\n\n\nVendor Sam Virgona has run his market fruit and vegetable store for more than 50 years, since migrating from Sicily in the '60s.\n\n\n\n\n\nHe says for many customers, it’s a place that feels like home.\n\n\n\n\n\n\"They come here and they like to shop in the market. They like to talk to a friend. They enjoy to come here!\"\n\n\n\n\n\nKey to that is making people from all countries and backgrounds feel welcome, says John Zaccharia.\n\n\n\n\n\n\"We are here. A group of us come in and have a coffee, have a chat, and we had a good time. We are very, very polite people. We welcome everybody. If we get a chair open, we're available. We'll let them stay with us. We're talking about gardening, football and everything else. Two things we don't like to talk about, and this is the rule, no politics and no religion.\"\n\n\n\n\n\nThat inclusive spirit also celebrated by second-generation butcher Mark Tolio.\n\n\n\n\n\n\"I grew up in the market from a young age. I would come in, I got to meet many people, many different characters and it's like one big family. And even the people you work with, you get a good relationship. And I love the market.\"\n\n\n\n\n\nBut there’s much more to High Street than markets and cafes, says historian Emma Russell.\n\n\n\n\n\nAlong the two kilometre stretch from Preston, through Thornbury to Northcote, the heritage shopfronts sell everything from vintage records to clothing - their facades plastered with colourful street art.\n\n\n\n\n\n\"It's very eclectic. It's got representation of most of the migrant communities that have come to Melbourne over the last 100 or so years.\"\n\n\n\n\n\nWaves of migration also brought food and flavours from Europe, the Middle East and more recently Asia.\n\n\n\n\n\nIndonesian restaurant Yuni’s Kitchen is run by Matthew and Yuni Kenwrick.\n\n\n\n\n\nYuni: \"So I come to Melbourne my food adventure is more bigger about Indonesian.\n\n\n\n\n\nMathew: \"It's all done from scratch. So that's the part where if you make the curry base from the beginning, chopping every onion up, every chili up, grinding it up, cooking it, and serving it. We get a lot of overseas people, they're very excited to try something wholly different from what they normally get.\"\n\n\n\n\n\nYuni and Matthew Kenwrick say as the urban landscape evolves, everyone is welcome here.\n\n\n\n\n\n\"Whether you are old, young, dressed like a goth, just arrive from overseas, don't speak much English. There's so much opportunity to shop and eat and let people be what they want to be.\"\n\n\n\n\n\nChange is something the Menaras have also embraced over the years.\n\n\n\n\n\nSonia and John are stepping back now, but their children are proud to keep the family business going, as Gianni Menara explains:\n\n\n\n\n\n\"My sister and I are very proud of our history. Taking over the reins from mum and dad. We're very proud and humble as well. And we put our heart and soul pretty much into everything we do.\"\n\n\n\n\n\nIt's a winning recipe the Menara family – and many others – hope will ensure their success for another 50 years at least!\n\n\n\n\n\n\"It's just been a beautiful ride, I've got to say. In these years that we've been here. We're very proud. I mean, we couldn't have done it without each other - and the kids.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/can-australia-find-other-allies-to-rely-on-if-the-us-disappears/g4lolxub3",
        "title": "Can the US be relied on? The 'harsh' defence truth Australia must reckon with",
        "publish_date": "Fri, 6 Jun 2025 20:41:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "For decades, the United States has been a reliable ally to Australia, whose protection has helped to ensure peace in the region.\n\n\n\n\n\nBut US President Donald Trump's unpredictable and tough treatment of his nation's allies has raised questions about whether Australia can still afford to lean so heavily on America as a security partner.\n\n\n\n\n\nOn Tuesday, Prime Minister Anthony Albanese told reporters the government will make decisions in Australia's national interest and fund the defence capability it needs . The comments came after US defence secretary Pete Hegseth requested Australia increase its defence budget to 3.5 per cent of its gross domestic product (GDP) in a conversation with Deputy Prime Minister Richard Marles on the sidelines of the Shangri-La Dialogue in Singapore last weekend.\n\n\n\nREAD MORE Why Xi Jinping is touring Southeast Asia amid rising tariff tensions\n\nAustralia's defence budget makes up roughly 2 per cent of GDP, which the government plans to increase to 2.35 per cent by 2034.\n\n\n\n\n\nWhile most experts do not believe the US will withdraw from the Indo-Pacific, Trump's actions raise questions about whether Australia should be seeking to cooperate more with other nations.\n\n\n\n\n\nIn May, Ursula von der Leyen, President of the European Commission, raised the prospect of a formal defence agreement between the trading bloc and Australia.\n\n\n\n\n\nIn response, Albanese said he would consider the proposal but noted a similar agreement was already in place with other European countries such as Germany.\n\n\n\nThe European Union raised the prospect of a security pact with Australia in May. Source: AAP / Sipa USA Without the US alliance, Peter Dean, director of foreign policy and defence at the United States Studies Centre at The University of Sydney, says Australia would need to massively increase its defence spending or accept it can't defend its own sovereignty.\n\n\n\n\n\n\"If you look at the mismatch between the scale of our territory and the scale of our ability to defend it — it's one of the most glaring mismatches in the world,\" he says.\n\n\n\n\n\n\"[You would] effectively be just hoping for the best.\"\n\n\n\n\n\nDean says Australia needs to work hard to maintain its security and that a \"community of nations\" is necessary to support open and free trade, promote a rules-based international order, and counter the use of coercion, aggression, and military force to achieve political objectives.\n\n\n\n\n\n\"If you don't have that community of nations, the example of what's happening in Ukraine is very poignant to everybody,\" he says.\n\n\n\n[Russia believes] in a 'might is right' world and they believe in a world where they get to shape those rules and that order, and that is not going to be favourable or in Australia's interests ... or for the majority of states in our region.\n\nCan we still rely on America?\n\nDean says Trump is more brutally transactional than previous presidents and an example of the adage in international relations that \"you have no friends, you only have common interests\".\n\n\n\n\n\nAlthough it's not always clear what Trump's interests are, Dean believes there's still a common alignment between Australia and the US, particularly in the Indo-Pacific region, and in the overall aims and objectives of their security policies.\n\n\n\n\n\n\"That simply boils down to — we don't want an Indo-Pacific that's dominated by one particular power — especially China,\" Dean says.\n\n\n\n\n\n\"That is an Australian view clearly articulated in our strategy, and that is a US view, clearly articulated by the US — even under this president.\"\n\n\n\nProfessor Peter Dean says there's a common alignment between Australia and the US, particularly in the Indo-Pacific region, as well as in their overall objectives for security policies. Source: AAP / Tatan Syuflana/AP One of the potential problems with a China-dominated region, Dean says, is its desire to \"rule by law\" and the way in which China would go about setting and enforcing laws.\n\n\n\n\n\n\"China particularly wants a hierarchical order where it sits on top and everyone else sits underneath,\" he says.\n\n\n\nChina has one of the most powerful militaries in the world and is seeking to dominate the Indo-Pacific region. Source: SBS News In contrast, Australia and other like-minded countries support a \"rule of law\" system in which a community of nations jointly sets the rules through treaties, such as the United Nations Convention on the Law of the Sea.\n\n\n\n\n\nBut Sam Roggeveen, the director of the international security program at the Lowy Institute, says the US has done very little to address China's dramatic military modernisation since the end of the Cold War.\n\n\n\nNo matter who's in charge in the US, I don't think that will rescue Australia from having to think much more independently about its security.\n\n\"The harsh truth for Australia and for other allies in the region is that the Americans aren't going to do the heavy lifting for us, and want us to do it ourselves.\"\n\n\n\nDoes Australia need the US?\n\nDean says the alliance with the US is critical for national security, and forming an agreement with other countries would be very difficult.\n\n\n\n\n\nA strategic alliance involves countries committing to help each other out during a crisis, or to act in accord to address a common threat. This would preferably be set out in a treaty.\n\n\n\n\n\nAustralia has an alliance with the US and New Zealand, but despite being part of the British Commonwealth, it does not have a formal agreement with the United Kingdom.\n\n\n\n\n\nGiven the geographical distance, Dean believes military support from the UK would likely depend on what other conflicts are happening in its part of the world.\n\n\n\n\n\nWhen it comes to international alliances, arguably the most important is NATO (North Atlantic Treaty Organization), which commits Europe and North America to protecting each other from any threat.\n\n\n\nLISTEN TO Joe Biden: NATO's time 'has not passed' SBS News 12/07/2024 10:12 Play\n\nRory Medcalf, head of the National Security College at The Australian National University, says there are three crucial elements to establish in alliances. Firstly, there must be clear interests in common. Secondly, the parties must articulate some shared values or political will to provide a foundation for trust.\n\n\n\n\n\n\"If their security is threatened, then you have interests engaged,\" he says.\n\n\n\n\n\nAnd there must also be mutual capability.\n\n\n\n\n\n\"There's not much point being an ally of someone if you bring nothing to the table and they bring everything,\" he says.\n\n\n\n\n\nDean says no other state can replace the size, power and influence of the US, which is the world's number one military power.\n\n\n\nThe US has the most powerful military in the world. Source: SBS News Dean says the US — by partnering with South Korea, Australia, Japan and other states — can aggregate enough power to balance China's influence and there is no \"ready-made state\" that could easily replace it.\n\n\n\n\n\nWithout the US, Medcalf says China would likely seek to dominate countries one by one and break any alliance-like relationships.\n\n\n\n\n\nEven if Australia did more for its own defence, there would still be a good argument for maintaining a close relationship with the US because its military technology is among, if not the best in the world.\n\n\n\n\n\nBut Roggeveen says Australia has to accept the US alliance is going to become less important over time.\n\n\n\n\n\n\"With that in mind, we have to look geographically much closer to home,\" he says.\n\n\n\nBuilding coalitions\n\nWhile forming a new alliance may prove difficult, Medcalf says it would be possible for Australia to build coalitions with other nations to discourage things like coercive behaviour if there was some degree of confidence the US would still back them up.\n\n\n\n\n\n\"It's really about using strategic partnership to make ourselves stronger, rather than building a kind of alliance where we expect to be standing shoulder to shoulder in war,\" he says.\n\n\n\n\n\nAustralia is already part of several small groupings of nations with common interests in the Indo-Pacific, such as The Quad (a diplomatic partnership among the US, India, Japan and Australia) and AJUS (a trilateral partnership among Australia, Japan and the US).\n\n\n\n\n\nDefence cooperation has deepened via AJUS, while the security partnership AUKUS, which exists between Australia, the UK and the US, has laid the groundwork for Australia to acquire nuclear-powered submarines and other advanced capabilities.\n\n\n\nAustralia has also entered into limited bilateral agreements with Indonesia, the Philippines, South Korea, Singapore and others.\n\n\n\n\n\nMedcalf, who is undertaking nationwide consultations to understand Australian attitudes to security, says most of these countries have no prospect of being treaty allies of Australia.\n\n\n\n\n\nBut partnerships with countries like Japan, South Korea, the Philippines and Vietnam may be possible. All of these countries, apart from Vietnam, are already American allies.\n\n\n\n\n\n\"They have different levels of capability that they would bring to the table,\" he says.\n\n\n\n\n\n\"But the ultimate question is how much risk are we all going to take for each other?\"\n\n\n\nAustralian Defence Minister Richard Marles (centre) with Philippine defence secretary Gilberto Teodoro Jr (left) and Australian ambassador to the Philippines Hae Kyong Yu (right) in 2023 prior to a large-scale combined amphibious assault exercise in the Philippines. Source: AAP / Philippine DND Defense Communications Service and AFP Public Affairs Office/AP\n\nShould Australia consider a defence agreement with the European Union?\n\nDue to the number of member states that would need to agree to it, Medcalf suspects an agreement with the EU would likely be quite vague in its language and commitment.\n\n\n\n\n\nIt may focus on increased technology sharing, access to defence industry resources and possibly some intelligence sharing.\n\n\n\n\n\nThere could also be some aspirational statements about the rules-based order, or the intent to discourage and oppose aggressive action.\n\n\n\n\n\n\"But it would fall far short of anything resembling a treaty commitment,\" Medcalf says.\n\n\n\n\n\nDean agrees it's more likely Australia and the EU would support each other diplomatically to uphold rules and standards both in Europe and the Indo-Pacific.\n\n\n\nREAD MORE What is the European Union and what does it do?\n\nMedcalf points out Australia and many northern European countries share common values, including freedom of expression, the rule of law and secularism in politics.\n\n\n\n\n\n\"[Australia's political values] are much closer to countries like Denmark, Sweden and Finland than to any of our neighbours except New Zealand,\" he says.\n\n\n\n\n\nAustralia has previously manufactured a Norwegian-designed naval strike missile and German-designed armoured fighting vehicles. The EU could offer access to other sophisticated capabilities such as warships, drones and sensors.\n\n\n\n\n\n\"The risk is obviously an expectation that Australia becomes more involved in Europe security problems ... obviously that's about confronting Russia,\" he says.\n\n\n\n\n\nWhile Medcalf believes Australia should be helping countries like Ukraine to defend themselves, there are limitations.\n\n\n\nWhat we shouldn't be doing is ever raising the expectation that we could be a frontline military actor on the other side of the world.\n\nMedcalf says Europe is in a different region to Australia, and it would be difficult to deploy troops or aircraft to each other's front lines.\n\n\n\n\n\nBut Europe is highly trade-dependent and large countries like Germany and France, in particular, have an interest in maintaining the security of shipping in the Indian Ocean and the South China Sea, he says, adding that a significant number of shipping companies are also European.\n\n\n\nThe shipping route between Europe and China through the South China Sea. Source: SBS News\n\nIndonesia\n\nRoggeveen says countries in Europe and other parts of Asia are so far away they are never going to share the same vital interests as Australia.\n\n\n\n\n\nBut Indonesia's interests are largely the same as Australia's, given they are neighbours.\n\n\n\n\n\nHe says Indonesia is also predicted to be a great power by the middle of the century and likely the fourth or fifth biggest economy in the world.\n\n\n\n\n\n\"We've never had a great power on our doorstep before, and we want Indonesia to be on our side when that happens,\" he says.\n\n\n\n\n\nPrime Minister Anthony Albanese has already highlighted the importance of the relationship with Indonesia , choosing to travel there for his first overseas visit after winning re-election.\n\n\n\n\n\n\"We have no more important relationship than Indonesia just to our north,\" he told ABC's 7.30 show.\n\n\n\nIndonesia is predicted to be a great power by the middle of the century and it wants to be \"friends to all\". Source: SBS News Other experts are sceptical about the potential for a quasi-alliance with Indonesia.\n\n\n\n\n\nWhile Medcalf agrees Australia should do more with Indonesia — including to help strengthen its navy and air force, and its ability to monitor what's happening in its waters — he notes its policy is to be \"friends to all, enemies to none\".\n\n\n\n\n\n\"Which sounds great but in practice means that Indonesia is working very hard to be as neutral as it can be in future crisis situations.\"\n\n\n\n\n\nHe says Indonesia has not been willing to speak out about China's behaviour in the South China Sea and doesn't have the capability to help Australia build its own defence technology base.\n\n\n\n\n\nAustralia also has to accept that China already has a strong influence in Indonesia, he says.\n\n\n\n\n\n\"If you're looking for a country that can partly fill the gap that the US may leave — I'd be looking to Japan before Indonesia. But if Indonesia ends up getting closer to our point of view, that would be wonderful,\" he says.\n\n\n\nJapan\n\nMedcalf says some experts already characterise Japan's relationship with Australia as a quasi-alliance, and it is the most likely country to form an actual alliance with Australia, although the chances of this happening in the short term remain unlikely.\n\n\n\n\n\nHe says both Japan and Australia share a strong belief in a rules-based system, and have different strengths they could bring to the table.\n\n\n\nThey need the resources that we have. We need their technology, we need their investment.\n\nMedcalf doesn't think Japan's peace constitution — put in place at the end of World War Two to maintain its military for defensive purposes only — would be an impediment because politicians have been reinterpreting it over the last 20 years or so.\n\n\n\n\n\n\"Japan is already moving away from 1 per cent, to 2 per cent of GDP, as its military budget,\" he says, adding that Japanese forces are increasingly training in Australia.\n\n\n\n\n\nHowever, Dean believes legal and cultural barriers still make it unlikely Japan will form an alliance with Australia.\n\n\n\n\n\n\"But I think if the region was to have some type of strategic shock, or it was to really start to deteriorate, that would drive that alignment even closer together,\" he says.\n\n\n\nSome experts consider Japan is already in a quasi-alliance with Australia. Source: SBS News\n\nVietnam\n\nMedcalf says Vietnam is very good at maintaining a balanced relationship with China because it knows how to stand up to China, while also keeping the peace.\n\n\n\n\n\n\"They've been doing both for about 1,000 years,\" he says.\n\n\n\n\n\n\"[Vietnam] can defend itself, but it can also do diplomacy well.\"\n\n\n\n\n\nHowever, Medcalf says the Southeast Asian country would be very reluctant to enter into a treaty-like commitment with Australia, although there is potential for more cooperation in areas such as military training.\n\n\n\nSingapore\n\nSingapore has long been a valuable diplomatic partner for Australia and already cooperates on military training and exchanging information, Medcalf says.\n\n\n\n\n\n\"But Singapore is ultimately a very self-interested and neutral country and I think we would work with them as much as we could without the expectation that either would actually take a risk on the other's behalf.\"\n\n\n\n\n\nHe says he would put Malaysia in a similar camp.\n\n\n\nAustralian and Indonesian army tanks taking part in multi-national military exercises in Indonesia in 2023. Source: AAP / Tatan Syuflana/AP\n\nSouth Korea\n\nSouth Korea is a militarily significant country because it has a lot of capability, Medcalf says.\n\n\n\n\n\n\"They now export defence equipment to Europe,\" he says.\n\n\n\n\n\n\"South Korea is one of the few countries in the world that is genuinely able to do rapid military manufacturing at scale.\"\n\n\n\n\n\nBut the problem is it's overwhelmingly focused on defending itself against North Korea.\n\n\n\n\n\n\"Yes, they're slightly concerned about ensuring that China doesn't dominate the region. Yes, they're a US ally but they would probably be reluctant to project much further beyond the peninsula,\" he says.\n\n\n\n\n\nMedcalf says South Korea also has quite deep-seated political problems domestically, and its politics can be unpredictable.\n\n\n\nIndia\n\nMedcalf says Australia's relationship with India has advanced significantly over the past decade — with each country's navy training together frequently and sharing information. Both countries' air forces jointly monitor the Indian Ocean.\n\n\n\n\n\n\"[India] will probably be — within the next few decades — one of the three biggest powers in the world militarily, alongside the US and China.\"\n\n\n\n\n\nHowever, Medcalf says India is diplomatically very neutral and greatly values its autonomy.\n\n\n\nThey're not going to be forming permanent alliance-like relationships with anyone.\n\nWhile India does not want to witness China dominate the Indian Ocean and would likely align with other countries in the region to balance against China, Medcalf says if it came to war, there would be only very limited circumstances under which it would get involved.\n\n\n\n\n\n\"I guess they would certainly contribute to patrolling the Indian Ocean and potentially limiting China's ability to operate there, but I don't think India is going to be taking a lot of risk on behalf of others,\" he says.\n\n\n\n\n\nIndia may also expect other countries to come to its aid if there were a conflict with China on its border.\n\n\n\n\n\n\"And that would be something that I think would be difficult for other countries to think about.\"\n\n\n\nIndia is expected to be one of the biggest military powers within the next few decades, but it values its neutrality. Source: SBS News\n\nPhilippines\n\nThe Philippines is one of the countries that claim parts of the South China Sea, which has led to clashes with China over issues such as fishing rights, islands and territories, Medcalf says.\n\n\n\n\n\n\"The Philippines has traditionally been quite a weak military power but they're beginning to modernise their forces and their location is strategically very important — they're right at the heart of the sea lanes of Asia.\"\n\n\n\n\n\nWhile the Philippines is an American treaty ally, under former president Rodrigo Duterte, it became closer to China.\n\n\n\n\n\nMedcalf says it would make sense for Australia to have the Philippines as a partner, but caution is needed when considering the limits of its power and whether another change in government could alter dynamics.\n\n\n\nIt's yet another example of how it's a nice idea to try and stitch all of these relationships together into something larger but without the Americans involved somewhere along the line, it still becomes quite flimsy.\n\nThe Philippines has started modernising its military forces. Source: SBS News\n\nCanada\n\nLike Australia, Canada is a middle-sized power but in some ways, it is militarily weaker. It's also a long way away.\n\n\n\n\n\nBut Medcalf points out Canada is technically part of the broader Pacific region as its western coastline borders the Pacific Ocean.\n\n\n\n\n\nIt's also surprisingly active in the region — supporting the UN efforts in East Asia to prevent illegal trade with North Korea and the smuggling of parts or precursors for weapons of mass destruction.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-governments-super-changes-for-high-earners-explained/co8qup372",
        "title": "The government's super changes for high earners, explained",
        "publish_date": "Fri, 6 Jun 2025 09:54:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "The government's super changes for high earners, explained\n\nPublished 6 June 2025, 8:24 am\n\nNew research into the government's plans to increase the tax on high-income earners' superannuation has revealed it could eventually apply to half a million Australians. Labor is moving to pass its contentious plan for 30% taxes on earnings for multi-million dollar balances when parliament returns. SBS Chief political correspondent Anna Henderson explains.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/your-guide-to-what-is-open-over-the-kings-birthday-long-weekend/7goj8w9yp",
        "title": "Your guide to what is open over the King's Birthday long weekend",
        "publish_date": "Fri, 6 Jun 2025 08:04:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points King Charles' birthday is being celebrated on 9 June.\n\nHis actual birthday is on 14 November.\n\nSome stores will have varied trading hours.\n\nKing Charles' actual birthday might not be until 14 November but many Australians will be preparing to mark a public holiday for the King's Birthday on 9 June.\n\n\n\n\n\nIn the Australian Capital Territory, NSW, Tasmania, South Australia and the Northern Territory, and Victoria the public holiday falls on every second Monday in June.\n\n\n\n\n\nHowever, Queensland observes the monarch's birthday on the first Monday of October.\n\n\n\n\n\nWestern Australia usually celebrates at the end of September. It marks WA Day in June.\n\n\n\nREAD MORE King Charles lands in Canada for royal visit seen as a counter to Trump's annexation threats\n\nAs parts of southern and eastern Australia are set to shiver through a wet and snowy long weekend , here's your guide to what will be open.\n\n\n\nTrading hours for King's birthday weekend\n\nUnlike Christmas Day and Good Friday, most shops are open on the King's Birthday public holiday but may operate on different hours.\n\n\n\n\n\nWhile schools and universities will be closed, pubs, cafes and restaurants are allowed to stay open on the public holiday. However, some smaller venues may choose to close.\n\n\n\n\n\nPublic transport is also expected to be running as usual however may operate on a different timetable.\n\n\n\n\n\nIt's recommended to check your state or territories' public transport website to check for any changes.\n\n\n\nREAD MORE King Charles urged to confront the $37 trillion call for colonial reparations\n\nWoolworths stores in South Australia will be closed.\n\n\n\n\n\nHowever the retailer's stores in NSW, the ACT, Victoria, Queensland, the Northern Territory, ﻿Western Australia and Tasmania will be open.\n\n\n\n\n\nSimilarly, Coles stores in NSW, the ACT, Victoria, Queensland, the Northern Territory, ﻿Western Australia and Tasmania will be open.\n\n\n\n\n\nStores in South Australia will ﻿mostly be closed, however some regional stores may remain open.\n\n\n\n\n\n﻿﻿Aldi and IGA stores have varied opening hours across the country and shoppers should check their nearest store for information.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-elon-musk-ruining-tesla-virgin-australia-launches-ipo/yqhug1cxn",
        "title": "Is Elon Musk ruining Tesla? & Virgin Australia launches IPO",
        "publish_date": "Fri, 6 Jun 2025 07:35:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-is-labors-superannuation-policy-and-why-is-it-stirring-controversy/i4336ybe0",
        "title": "What is Labor's superannuation policy, and why is it stirring controversy?",
        "publish_date": "Fri, 6 Jun 2025 06:30:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn Australia, you're forced to save some of your income in what's called superannuation, or super for short.\n\n\n\n\n\nEach time you get paid, a minimum of 11.5 per cent of your wage is put into an investment fund, which you can access at retirement.\n\n\n\n\n\nIt hasn't always been that way - before the 1990s, it was dependent on the job you worked, or the agreement you had with your boss as to who received super.\n\n\n\n\n\nBut in 1992, former Labor Prime Minister Paul Keating changed that.\n\n\n\n\n\n\"Mr. Speaker, for the first time in our history, well in advance of reform in other advanced industrial countries, ordinary Australians will be able to build a decent nest egg for their retirement as a result of the policies of the Labor movement.\"\n\n\n\n\n\nMandatory superannuation addresses two issues - making sure people have money to live comfortably when they retire, and taking financial pressure off the federal budget. If people have enough saved, they won't be reliant on welfare like the aged pension.\n\n\n\n\n\nThe way super is taxed is different to the rest of your income, as Economist from the Grattan Institute Brendan Coates explains.\n\n\n\n\n\n\"Any contributions into super tax at 15 per cent for most people, and then the earnings, whether it be dividends or the interest income from bonds or term deposits, that's also taxed at 15 per cent for most people while they're working, and it's 0 per cent once they retire.\"\n\n\n\n\n\nThere's some exceptions to that rule - high income earners pay 30 per cent on some contributions, and only the first $2 million is tax free at retirement time.\n\n\n\n\n\nWhen you sell something in your superannuation and make a capital gain, that's taxed at 10 per cent.\n\n\n\n\n\nTwo years ago, Treasurer Jim Chalmers announced the plan to increase taxes on some superannuation balances.\n\n\n\n\n\n\"I'm confident that Australians will see this change as modest and reasonable and fair.\"\n\n\n\n\n\nAnd after a landslide election win, Labor is moving to make the changes.\n\n\n\n\n\nIt's been a bit controversial - Deputy Liberal Leader Ted O'Brien doesn't like it.\n\n\n\n\n\n\"Let me be very clear where the coalition stands on this. Labor's super tax is super big and super bad.\"\n\n\n\n\n\nLabor's plan is to double the amount of tax paid on superannuation earnings on balances over $3 million.\n\n\n\n\n\nAt the moment, those earnings are taxed at 15 per cent.\n\n\n\n\n\nThat will stay the same for balances under $3 million, but any earnings on money over that amount will be taxed at 30 per cent.\n\n\n\n\n\n\"It makes a meaningful difference to the budget, and it helps us fund some of our other priorities. It's all about making sure that the superannuation system is fairer, that it's more sustainable.\"\n\n\n\n\n\nAt the moment, around 80,000 Australians - or 0.5 per cent of people who have an Australian superannuation account, will be impacted.\n\n\n\n\n\nBut its not indexed, which means every year as inflation and wages grow, more people will have to pay the extra tax.\n\n\n\n\n\nThe other controversial part of the plan is that it will be applied to unrealised gains.\n\n\n\n\n\nWhen you invest money, if that investment is worth more than what you put in, it's increased in value.\n\n\n\n\n\nBut the gain on the investment is not realised until it's sold - and it's taxed at 10 per cent once that sale happens.\n\n\n\n\n\nLabor is proposing that those gains are taxed before the asset is sold.\n\n\n\n\n\nThe coalition isn't happy about that.\n\n\n\n\n\n\"The introduction of unrealised capital gains will be a disaster for the Australian economy.\"\n\n\n\n\n\nHow that will work is that the government will look at the value of your super and compare it to the year before.\n\n\n\n\n\nAny increase in the balance above $3 million will be taxed at 30 per cent - no matter if the increase is because of realised or unrealised gains.\n\n\n\n\n\nAll the money below $3 million will be taxed the same as before.\n\n\n\n\n\nThere have been concerns for business owners, including farmers, who sometimes have their farm or other major assets in their self managed superannuation fund, because if the value of their farm increases they will have to find the money to pay the extra tax whilst they still own it.\n\n\n\n\n\nIn the past, they wouldn't have had to pay the money until they sold the farm, when they likely have more access to liquid assets.\n\n\n\n\n\nTreasurer Jim Chalmers says taxing unrealised gains is the only way to calculate the extra tax on some super accounts.\n\n\n\n\n\n\"The unrealised gains calculation was recommended to us by Treasury. We provided years of opportunities for people to suggest different ways to calculate that liability, and nobody has been able to come up with one.\"\n\n\n\n\n\nFor Labor, these changes will increase revenue, and stop superannuation being a tax-friendly place to store wealth, as Mr Coates explains.\n\n\n\n\n\n\"The typical retiree does not actually spend down their super. They retiree in their 80s has typically got more money in Super two decades after they retire than on the day that they do retire. And you know, Treasury is expecting their forecasting that 1/3 of the money that's withdrawn from Super, you know, by 2060 each year will be in the form of bequests going to the kids.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/to-russia-with-love-operation-spiders-web-the-trump-musk-bust-up/yaf35qfcn",
        "title": "To Russia with love: Operation Spider's Web & the Trump Musk bust-up",
        "publish_date": "Fri, 6 Jun 2025 06:14:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/muslim-australians-celebrate-eid-al-adha-festival/53ajghflk",
        "title": "Muslim-Australians celebrate Eid al-Adha festival",
        "publish_date": "Fri, 6 Jun 2025 04:18:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrayer, feasts, and family gatherings.\n\n\n\n\n\nMuslims in Australia and around the world are now celebrating one of two key festivals in the Islamic calendar, Eid al-Adha.\n\n\n\n\n\nIt's a celebration which involves the sacrificing of an animal, generally a lamb, a goat or a cow; and then a sharing of the food to friends, family and those living in poverty.\n\n\n\n\n\n\"We celebrate the Eid by first in the morning go to praying. It's called Eid al-Adha praying. Then I personally cook Indonesian traditional food and I give that food to my friends in the college or my housemate.\"\n\n\n\n\n\nThat's Indonesian-Australian man Miftahuddin who is celebrating Eid in the Sydney suburb of Lakemba.\n\n\n\n\n\nHe says, to him, Eid al-Adha is a time to demonstrate his love to God.\n\n\n\n\n\n\"Eid is a symbol of a sacrifice. Everyone now, they pay some amount buying sheeps or cows and they give those animals for God, for Allah.\"\n\n\n\n\n\nThis sacrifice of animals pays respect to a story in the Quran, the Christian Bible and the Torah, that of Ibrahim - also known as Abraham - being willing to sacrifice his own son for God.\n\n\n\n\n\nFor Egyptian-Australian woman Sahar Badawe, she tells SBS Arabic that her community always celebrates the holiday with the dish fatteh.\n\n\n\n\n\n\"The Eid al-Adha breakfast is always a dish called Fatteh in Egypt consisting of lot of meat and yoghurt. You can’t celebrate Eid Adha without enjoying this special breakfast, even though it’s usually a meal suited for lunch time as it’s rich.\"\n\n\n\n\n\nBut for some Muslim migrants, they've found the Eid experience in Australia to be more difficult to navigate balancing tradition with everyday work routines.\n\n\n\n\n\nWith Eid Al-Adha not officially recognised as a public holiday, many families in Australia celebrate around their jobs and school schedules.\n\n\n\n\n\nCommunity events and weekend gatherings can help keep the spirit alive, but Jordanian-Australian Rania Irani told SBS Arabic it’s not quite the same.\n\n\n\n\n\n\"We don’t really feel the spirit of Eid here, to be honest. Everyone goes about their day as usual. My two sons both have to work and don’t get a day off, so we can’t even go out together. We’ll meet friends on Saturday, but still, it’s not like celebrating in our home country, surrounded by family.\"\n\n\n\n\n\nThe Eid festival also coincides with the annual Hajj pilgrimage to Mecca in Saudi Arabia.\n\n\n\n\n\nPilgrims typically perform the tawaf on Eid, walking seven times around the Kaaba, which is the holiest site in Islam and is said to have been built by the prophet Ibrahim and his son.\n\n\n\n\n\nOne worshipper, Zainab Loo, says the once-in-a-lifetime pilgrimage has been indescribable.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/its-australias-third-largest-religion-but-until-now-there-was-no-plans-for-a-hindu-school/afoxw0kj7",
        "title": "It's Australia's third largest religion, but until now there was no plans for a Hindu school",
        "publish_date": "Fri, 6 Jun 2025 03:11:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nDespite Australia becoming more religiously diverse, there isn't a mainstream Hindu school for 800-thousand people in the country who identify with this faith.\n\n\n\n\n\nUnlike Hinduism, other major faiths including Islam and Greek Orthodox have schools of their own.\n\n\n\n\n\nBut that's about to change.\n\n\n\n\n\nA two hectare block in the northwest of Sydney will be home to Australia's first Hindu school in 2027.\n\n\n\n\n\nThis - as the federal government has pledged $8.5 million dollars in grant funding for the construction of a new school in the suburb of Oakville in the Hawkesbury region.\n\n\n\n\n\nHindu Council of Australia's Vice President Surinder Jain shares how the concept emerged in 2019.\n\n\n\n\n\nHe says the community got together to raise funds and purchase the block last year.\n\n\n\n\n\n\"Initially it looked like an impossible task, a mammoth task – I don’t think we’ll ever have our own school but then a group of parents came together, raised money and said we are going to start a Hindu school.\"\n\n\n\n\n\nThe 2021 census found Hinduism is the third largest religion in Australia.\n\n\n\n\n\nThe school will start with Kindergarten to Year Two, and eventually have classes all the way up to Year 12.\n\n\n\n\n\n\"We see no problem in filling kindergarten to Year Two streams, we'll start with one stream initially. Depending on the demand we will add a second or third stream if needed. And once the Year Two students have graduated we will start Year Three so they don't have to change schools.\"\n\n\n\n\n\nMr Jain talks about the aspects of Hinduism that the school will be committing to such as non-violence and good discipline.\n\n\n\n\n\n\"The first thing to be a good Hindu or a good Christian, or any other faith of that matter is to understand what it is. That's what this school will be teaching. Some of the things which will help non-Hindus as well when they study in the school there will be emphasis on yoga, which is for good physical health and there will be emphasis on meditation which is good mental health.\"\n\n\n\n\n\nThere are around 800-thousand Hindus who call Australia home.\n\n\n\n\n\nRahul Jethi from the Hindu Education and Cultural Centre has told SBS their aim is to inspire the next generation in the country.\n\n\n\n\n\n“We expect to create something which is not just a school for learning, which is a place for people to assemble, to get together and also ensure that the next generation of Australians, Hindu Australians they basically get a lot of inspiration and education from this place.”\n\n\n\n\n\nEducation Minister Jason Clare has said it will help provide Hindu Australians with the sort of choice that other Australians have - which is to send their children to a school that incorporates their faith and culture.\n\n\n\n\n\nRam Ramaswamy from the Hindu Education and Cultural Centre has told SBS that the development application process is due to begin next month.\n\n\n\n\n\nHe says they are estimating the total cost to come in at around $35 million dollars.\n\n\n\n\n\n\"Not only the elders, or the people who have just been settled in or the new migrants, everybody started chipping in, even now there are new, young students who are contributing $100 per month and this process is continuing.\"\n\n\n\n\n\nKiran Sampathkumar, from the same centre talks about the commonalities in going to school with someone from the same culture.\n\n\n\n\n\n\"I saw a lot of the boys were able to really, they used to go to the same churches together on a Sunday so they built a brotherhood that I sort of have not seen with Hindu kids in Sydney as yet, so it just provides that safe space for Hindu kids to come and bring the sort of food that you eat at home and you can wear your 'thilak' (*refer to footnote) when you come to school and you're not really going to be afraid someone is going to judge or ask you all these hard questions. You don't need to hide your identity.\"\n\n\n\n\n\nFor Anupriya Mehra, it's about instilling in children the importance of valuing their identity.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-june-7-2025-20250604-p5m4uo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, June 7, 2025",
        "publish_date": "Sat, 07 Jun 2025 12:01:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "17/26\n\nMichael Landy, founder Eagle Financial Solutions, forensic accountant and adviser. Michael Landy says that in all his decades of financial advising he’s never seen as big an example of corporate misconduct as the Lion Property Group matter. He’s helping the investors take legal action against the group and has mapped out the projects on A3 paper. Credit:Wayne Taylor",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/build-up-to-a-blow-up-inside-the-trump-musk-meltdown-20250607-p5m5n8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Build-up to a blow-up: Inside the Trump-Musk meltdown",
        "publish_date": "Sat, 07 Jun 2025 11:27:51 +1000",
        "category": "finance",
        "authors": [
            "Tyler Pager",
            "Maggie Haberman",
            "Jonathan Swan",
            "Theodore Schleifer",
            "Ryan Mac"
        ],
        "text": "This account of the crumbling ties between the president and Musk is based on interviews with 13 people with direct knowledge of the events, all of whom asked for anonymity to describe private discussions. Loading While the relationship had been losing steam over the past several months as Musk clashed with Trump officials, people close to both men said the disagreement over Isaacman accelerated the break-up. Musk had been planning to exit the White House relatively quietly – before Isaacman’s ouster left him feeling humiliated. Now Musk and Trump, who seemed inseparable at one point, are on opposite sides.\n\nMusk suggested Trump should be impeached. Trump has threatened to cancel government contracts with Musk’s companies. And in recent days, Trump has been telling people close to him that he believes Musk is acting “crazy” and must be doing drugs. For Musk, there were few positions across the thousands in the federal government that mattered more to him than the head of NASA, because of its critical importance to SpaceX, his rocket business. So it was of great personal benefit to Musk when Trump chose Isaacman – who has flown to space twice with SpaceX – to oversee the agency. Trump farewells Elon Musk in the Oval Office on May 30, after the latter’s 130-day stint as a special government employee. Credit: AP Isaacman’s donations to Democrats had not always been a problem. While Trump privately told advisers that he was surprised to learn of them, he and his team had been briefed about them during the presidential transition, before Isaacman’s nomination, according to two people with knowledge of the events.\n\nBut by last Friday, when Trump went through the file containing details of the donations, he clearly had changed his mind. Credit: Illustration: Matt Golding Musk barely mounted a defence of his friend. He was anxious about doing so with other people around, including Sergio Gor, director of the presidential personnel office, who had clashed with Musk over other staffing matters. Musk believed that he would be able to talk to Trump at some point after the gathering, privately. But Musk never got a chance to make his case. In the hours after the Oval Office farewell, Trump decided he would withdraw Isaacman from consideration. Musk was stunned by how fast it all happened.\n\nMusk’s allies have argued privately that Isaacman’s recent donations to Democrats were not ideological and made at the encouragement of senator Mark Kelly, a former astronaut. A spokesperson for the Democratic senator for Arizona declined to comment. Loading As Musk dealt with the fallout from the tanked nomination, he spent part of the weekend outside Missoula in Montana, as a guest at “Symposium” – an event for tech executives, investors and startup founders thrown by Founders Fund, the venture capital firm founded by Peter Thiel. He mingled with guests at Paws Up, a high-end resort with glamping tents and luxury cabins set on 15,000 hectares of a historic cattle ranch. There, he had a wide-ranging conversation with Thiel, who could sense no coming feud with the president, according to a person familiar with the talks. OpenAI chief executive Sam Altman, who has been openly feuding with Musk, also attended, though the two did not speak.\n\nFor Musk, the goings-on in Washington were still top of mind. After spending a day in Montana, he turned his attention in earnest to assailing the top domestic priority of Trump: the Republican bill making its way through Congress that would slash taxes and steer more money to the military and immigration enforcement. Privately and publicly, Musk stewed over the bill, believing that its spending would erase the supposed savings of his Department of Government Efficiency (DOGE) and add to the federal deficit. Some Republican lawmakers had tried to assuage Musk’s fears. On Monday, Republican House Speaker Mike Johnson walked the billionaire through the bill and said Congress would try to codify the work done by DOGE.\n\nAfter the call, Johnson told associates that he felt Musk was uninformed about the legislation and the congressional process, but that he had been able reason with the world’s richest man, according to a person familiar with the conversation. On Monday evening, Musk still had concerns. He hinted at them on his social platform X, reposting a chart apparently showing the yearly increase in the national debt. “Scary,” Musk wrote as a caption. Trump did not respond to Musk’s criticisms of the bill and maintained a light public schedule.\n\nThe Trump-Musk alliance fully ruptured on Thursday, six days after the two men put on the collegial display in the Oval Office. Elon Musk attacked Trump in posts on X on Thursday (Friday AEST). Credit: NurPhoto via Getty Images Musk, who had largely focused his attacks on Republicans in Congress, had started directing more ire at the president. So when Trump was asked about Musk’s comments during a meeting with Friedrich Merz, the new German chancellor, the president finally let loose. He said he was “disappointed” in Musk, downplayed the billionaire’s financial support for his presidential campaign and posited that Musk developed “Trump derangement syndrome” after leaving the White House. Musk fired back in real time. Using X, he unleashed a torrent of attacks. He claimed there were references to the president in government documents about Jeffrey Epstein, the sex offender, and indicated his support for the president’s impeachment. He also said Trump’s tariffs would cause a recession by the end of the year.\n\nLoading Later, Trump, using his own social media platform, threatened to cut billions of dollars in federal contracts with Musk’s companies. By Thursday evening, Musk signalled he would be open to de-escalating the fight, while the president seemed to have little interest in an immediate reconciliation. White House officials said Trump had no plans to call Musk. “President Trump is the unequivocal leader of the Republican Party, and the vast majority of the country approves of his job performance as president,” White House press secretary Karoline Leavitt said. “Inflation is down, consumer confidence and wages are up, the jobs report beat expectations for the third month in a row, the border is secure and America is hotter than ever before.” A spokesperson for Musk did not respond to a request for comment.\n\nLoading Musk, his allies and even some White House officials now pin the blame on Gor, believing he sabotaged Isaacman as Musk was on his way out. But some close Trump allies say Gor was being unfairly criticised for a decision that ultimately rests with the president. Gor and Musk clashed several times early in Trump’s second term, including at two cabinet meetings, when Musk questioned how swiftly Gor was moving to fill the top ranks of agencies. Musk’s team and Gor’s team often disagreed over personnel and the amount of power that should be given to aides at DOGE. But Gor’s title – director of the White House Presidential Personnel Office – does not convey the scope of his influence in the president’s orbit. Gor founded a pro-Trump super political action committee during the 2024 presidential election, and co-founded a publishing house with Donald Trump Jr that has published books by the president and his allies. The president’s aides and allies quickly jumped to Gor’s defence on Friday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/the-players-are-so-angry-tottenham-face-revolt-over-postecoglou-sacking-20250607-p5m5na.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The players are so angry’: Tottenham face revolt over Postecoglou sacking",
        "publish_date": "Sat, 07 Jun 2025 11:00:00 +1000",
        "category": "sports",
        "authors": [
            "Matt Law"
        ],
        "text": "Tottenham Hotspur chairman Daniel Levy is facing the threat of a player revolt, having brutally sacked head coach Ange Postecoglou two weeks after winning the Europa League.\n\nPostecoglou’s exit came on the two-year anniversary of his appointment. It is understood that chief football officer Scott Munn, who was one of Postecoglou’s biggest supporters inside Spurs, has also been sacked by Levy.\n\nPostecoglou’s departure has angered a number of Tottenham players, with sources claiming some want to leave the club and that the Australian’s successor will face a huge task to repair the dressing-room damage.\n\nPostecoglou was left in the dark over his future for almost two weeks after the final Premier League game of the season before being told he had been sacked on Friday. A source said: “The players are so angry about what has happened and how it has been handled. The next manager is going to inherit a difficult situation.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/prince-harry-meghan-markle-and-their-children-enjoy-disneyland-20250607-p5m5nc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Harry, Meghan Markle and their children enjoy Disneyland",
        "publish_date": "Sat, 07 Jun 2025 10:05:56 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Harry, Meghan Markle and their children enjoy Disneyland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-2025-afl-teams-and-experts-tips-all-the-changes-for-round-13-20250603-p5m4l9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL teams and round 13 tips: Parish back for Dons, Silvagni returns for Blues",
        "publish_date": "Sat, 07 Jun 2025 09:51:24 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Loading\n\nClick here for the latest episode of the Real Footy tipping podcast.\n\nWESTERN BULLDOGS\n\nB: L.Cleary, J.O’Donnell, R.Gardner\n\nHB: L.Bramble, R.Lobb, B.Dale\n\nC: B.Williams, E.Richards, J.Freijah\n\nHF: R.Sanders, A.Naughton, M.Kennedy\n\nF: L.Vandermeer, B.Khamis, R.West\n\nFOLL: T.English, M.Bontempelli, T.Liberatore\n\nI/C: S.Davidson, J.Dolan, J.Harmes, L.McNeil, A.Treloar\n\nEMG: N.Coffield, C.Hynes, L.Jaques\n\nIN: R.Gardner, J.Dolan, A.Treloar\n\nOUT: O.Baker (omitted), J.Johannisen (illness), T.Duryea (omitted)\n\nHAWTHORN\n\nB: J.Battle, T.Barrass, S.Mitchell\n\nHB: J.Impey, J.Weddle, K.Amon\n\nC: C.Macdonald, C.Nash, H.Morrison\n\nHF: B.Hardwick, S.Butler, D.Moore\n\nF: M.Ramsden, M.Chol, J.Gunston\n\nFOLL: L.Meek, J.Newcombe, J.Ward\n\nI/C: J.Ginnivan, C.Jiath, J.Worpel, M.D’Ambrosio, F.Maginness\n\nEMG: C.Mackenzie, J.Serong, S.Frost\n\nIN: S.Mitchell, S.Butler, M.Ramsden\n\nOUT: J.Sicily (injured), N.Watson (illness), J.Scrimshaw (managed)",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/a-rabbitohs-great-was-the-easy-pick-for-reynolds-300th-game-presentation-20250605-p5m5av.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A Rabbitohs great was the easy pick for Reynolds’ 300th game presentation",
        "publish_date": "Sat, 07 Jun 2025 09:34:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Adam Reynolds said if it wasn’t for a former premiership-winning South Sydney teammate, he probably wouldn’t be celebrating 300 NRL games on Saturday night.\n\nSo it was only fitting that Issac Luke was brought into the Brisbane Broncos’ inner sanctum on Friday morning to present Reynolds with his milestone jersey.\n\nLuke and Reynolds became friends a couple of years before Reynolds debuted in 2012, largely because they were both teenage fathers. Their partners, Tallara and Mickayela, were also close.\n\n“Issac is someone who took me under his wing when I came into first grade. We had kids around the same age, I was shy, but he opened his arms and made me feel really comfortable around the group,” Reynolds said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/ange-sacked-by-spurs-despite-trophy-triumph-20250607-p5m5mz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ange sacked by Spurs despite trophy triumph",
        "publish_date": "Sat, 07 Jun 2025 08:12:01 +1000",
        "category": "sports",
        "authors": [],
        "text": "Ange sacked by Spurs despite trophy triumph\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/ange-will-land-on-his-feet-but-spurs-have-made-an-enormous-mistake-in-sacking-him-20250607-p5m5mo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ange will land on his feet. But Spurs have made an enormous mistake in sacking him",
        "publish_date": "Sat, 07 Jun 2025 07:08:09 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "If that was so crucial, how to explain the cards that Postecoglou was asked to play? Why was he given such a thin squad to take into the season, its lack of depth brutally exposed by those injuries? Why was it that Spurs did not support him with another centre-back in the January transfer window until after their third-choice option in that position went down with a season-ending ACL injury, adding to a crisis which had already ripped the heart out of their domestic campaign? Why was their policy of pursuing talented young players – which, no doubt, will hold them in good stead for the coming years – not also supported with experience that could have enabled them to compete on multiple fronts, when they absolutely have the financial capacity to do both? Postecoglou knew it wasn’t possible this season, so after January, as he explained in his post-Europa League final press conference, he selected one front and focused on it. His staff and playing group backed him in. He made the calculation that ending the club’s trophy drought was the only way of breaking their psychological chains. He said that not everybody at the club agreed with that decision; we can now safely assume that Levy was one of those people. Levy now has the nerve to talk about “emotions” when there was clear logic at play. Tottenham’s motto is Audere est Facere: To Dare is To Do. Postecoglou dared, and he did. “The game is about glory,” the legendary Spurs manager Danny Blanchflower once said. He brought them glory, and his reward was the sack. Postecoglou and Spurs chairman Daniel Levy after the Europa League win. Credit: Getty Images\n\nHe deserved the right to have another crack, but that has been taken away from him. This is the first time Postecoglou has been fired mid-contract. Sure, he was let go by Football Federation Australia at the end of his six-year tenure as Australia’s national youth coach, but that was a little different – his contract was up, and he probably wasn’t going to seek an extension anyway. He has always tried to be the master of his own destiny, but not this time. He will land on his feet. Tottenham’s loss will be another club’s gain. Postecoglou’s reputation has only been enhanced by his time there, his triumph in the Europa League and the way he handled himself throughout. Another team will come for him, and he will win with them. Inter Milan, the beaten UEFA Champions League finalists, could do much worse after their manager Simone Inzaghi decided to take the riches in Saudi Arabia. So could other clubs in Italy, Germany, Spain ... anywhere, really, where they like success. Equally, Postecoglou will feel he has unfinished business in England, and will want to defy the critics who say his brand of football is unsustainable in the Premier League.\n\nAs for Spurs? The hot favourite to take over is Thomas Frank, the Danish manager currently in charge of Brentford. He may prove an excellent fit. Postecoglou has left him an excellent platform to build upon. Loading But Frank has also never won a major trophy in his career. He has never managed a club which has competed in European competitions, or one as big as Tottenham Hotspur. Last season, his team finished 10th in the Premier League, largely due to injuries. He will also have to deal with a playing group that was utterly in Postecoglou’s thrall and reportedly angry with how the club handled his exit. And a board which has made it clear that winning trophies is not enough for them. Tasking him with untying the Gordian knot that is Tottenham Hotspur is a bigger risk than sticking with Postecoglou for a little longer – but that is their call. Good luck with that.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/a-new-boss-his-buddies-and-a-2-6-billion-cash-splash-inside-the-icac-probe-into-school-infrastructure-20250603-p5m4ip.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A new boss, his buddies and a $2.6 billion cash splash: Inside the ICAC probe into School Infrastructure",
        "publish_date": "Sat, 07 Jun 2025 05:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Mcgowan",
            "Lucy Carroll"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Seated in the austere confines of the Independent Commission Against Corruption’s witness box, Mark Scott, the former secretary of the NSW Education Department, remembered Anthony Manning as a popular choice as the first chief executive of a new school-building unit back in 2017. Well-connected from his time working for the equivalent health agency, Manning’s name had been floated as a possible candidate by then-education minister Rob Stokes after a suggestion from PwC partner Amy Brown, and the former premier Mike Baird was among his referees. Health minister Brad Hazzard complimented the appointment at the time, Scott recalled, and senior public servants who had worked with Manning gave Scott the impression of someone viewed as “can-do” and “focused”. “I received no signals of concern or disquiet,” Scott recalled. There were no “red flags”. Former NSW Education Department secretary Mark Scott leaving the ICAC building. Credit: Dean Sewell But, as the ICAC has heard during a month of evidence in its public probe into Manning’s conduct as head of School Infrastructure NSW between 2017 and last year, alarm bells had been ringing among senior public servants in the Education Department for several years after he landed the job. “Somewhere on the spectrum between a bully and completely corrupt,” is how director of strategic governance Sasha Holley remembered describing Manning to a friend in 2023.\n\nAdvertisement\n\nThe watchdog announced in April that it would hold a public inquiry to probe allegations Manning and others at School Infrastructure subverted recruitment practices, improperly awarded contracts and misallocated funds to benefit friends and associates during his time at the agency. It is also probing whether Manning and others engaged in “reprisal action” against staff who raised concerns. The probe came after Manning’s abrupt departure from the role in February last year. The Sydney Morning Herald first reported his referral to the watchdog in July, as well as concerns over an axed $40 million school building contract awarded by the agency. That Manning was in the ICAC’s sights had been a discomforting discovery for successive education secretaries. Georgina Harrisson, who headed the department from 2021 to 2023, said she became “less assertive” in her attempts to track contractor spending in the agency after being notified of “a need not to disrupt things” because of the probe. Former education minister Rob Stokes and then head of School Infrastructure Anthony Manning at North Kellyville Public School in 2018. Credit: Janie Barrett At the heart of the ICAC inquiry are four contractors, and their relationship with the school building boss; Martin Berry, Stuart Suthern-Brunt, Michael Palassis and Kathy Jones. All four were handed millions of dollars in contracts from the agency during Manning’s time as chief executive via their companies, and all four had personal and professional relationships with him.\n\nAdvertisement\n\nManning had known Berry since 2006 and organised his buck’s party. He took spin and yoga classes with Suthern-Brunt, and once described Jones as his “communications fairy godmother”. In 2017, he and Palassis were part of a group trying to develop a “cancer wellness” hospital in China close to the time his company, Paxon, were bidding along with PwC to win a tender with the agency. In total, the four contractors and their associated companies earned some $18 million from NSW taxpayers during Manning’s time in School Infrastructure. But the inquiry has also laid bare a culture in which contingent workers on astronomical wages rode roughshod over the established bureaucracy – some 1,400 contractors were paid more than $344 million between 2017 and 2024, a figure which does not include the sums paid to Manning’s associates – and where officials who raised concerns about breaches of procurement rules were often swept aside. Andrea Patrick appears as a witness at the ICAC. Credit: ICAC It was an agency in which, at least according to some witnesses, the normal rules did not apply. Andrea Patrick, a senior procurement officer at the department who was fired by Manning, alleged that at a meeting in 2017 he “made a comment along the lines of ‘I don’t need you or services or policies’.”\n\nAdvertisement\n\nManning, she claimed, told her he had a “direct line” to ministers and said words to the effect of “if I need to do things different, I just pick up the phone to them, and they’ll sort it”. Running through the inquiry is a sense Manning believed he was brought in to the building unit to shake up a flailing department. Loading With a $2.6 billion funding injection for new school infrastructure coming, there was concern at senior levels of the NSW government that that current leadership wouldn’t be able to get the job done, Scott recalled. Stokes, who was education minister when the agency was set up but is not accused of any wrongdoing, described a feeling of “exasperation” with the department over issues such as a new high-rise school, Arthur Phillip in Parramatta, which was plagued by cost blow-outs and delays. The agency was established in 2017 as the state’s public schools were facing an explosion in enrolments and overcrowding was hitting primary and high schools. At the time Stokes described the new unit as “a centre of excellence for assets and their delivery” in response to “changes around population growth, new ways of teaching and learning, and social change”. But from very early in his tenure, the behaviour which ICAC is now probing began to emerge. Only six weeks into the job, ICAC has heard, Manning spoke to his former boss and friend, Martin Berry, about engaging him and his company, Heathwest Advisory.\n\nAdvertisement\n\nManning and Berry had known each other since about 2006, ICAC has heard, and in his first round of evidence to the commission last week, Berry conceded the two were friends. He gave Manning a job in the Sydney office of consulting firm Turner & Townsend and the two men often socialised together. Manning organised Berry’s buck’s party and attended his wedding, and in text messages dating back to 2015 they bantered about England’s success in the cricket – both are from that country – and arranged to catch up for dinner and drinks near their homes on Sydney’s northern beaches. They also discussed work, and Berry admitted Manning had helped get him a job at Health Infrastructure NSW. But, he also said the men “kept our relationship at a professional level”. “Sorry, just, what do you mean by that?” counsel assisting the inquiry Jamie Darams asked during the examination. “Well, we recognised that there would be occasions where we might be in roles that would need to be seen to be maintaining a professional relationship,” Berry responded. Two weeks after their meeting in 2017, ICAC has heard, Berry sent Manning a “proposed scope of works” to his private email address. The schools’ boss then passed on Berry’s wording to several of his staff – without telling them where it had come from – and a similar document was issued as a “request for quotations” from the agency which Heathwest Advisory went on to win. In other words, as Darams put it, Berry drafted the scope of work put out to a tender that his own company was then awarded, giving it an “obvious advantage” over its competitors.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/they-re-the-best-soccer-team-in-the-bush-but-they-ve-got-nowhere-to-play-20250519-p5m0g1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "They’re the best soccer team in the bush. But they’ve got nowhere to play",
        "publish_date": "Sat, 07 Jun 2025 05:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the middle of practically nowhere - six hours’ drive west of Sydney, five hours’ drive north of Melbourne - lies the best-kept secret in Australian soccer. Maybe Australian sport. Griffith, NSW, is a place that shouldn’t exist. Without irrigation, it would be a desert - dry, flat, and empty. But in 1916, as part of the bold, utopian Murrumbidgee Irrigation Area scheme, it was built from scratch as a planned city, designed by Walter Burley Griffin, the same American architect who laid out Canberra. The early settlers, mostly returned servicemen and British migrants, struggled with the land; it wasn’t until the Italians arrived, bringing with them generations of agricultural know-how and a relentless work ethic, that the region truly began to bloom. Today, around 60 per cent of the city’s 25,000 residents are said to claim some degree of Italian heritage, and it shines through in everything they do. Top-notch Italian eateries line the city’s main drag, Banna Avenue; walking into the famous old La Scala restaurant, down a dingy, dimly lit staircase, was like stumbling into a dinner scene from Goodfellas. The local wine scene is quietly excellent; Yellow Tail, Australia’s leading export brand and a bona fide global phenomenon, is produced in Yenda, which is a 13-minute drive to the east. A tractor transporting harvested grapes through Yarran Wines, Yenda - just east of Griffith. Credit: Destination NSW Season two of Underbelly was also partially set in Griffith, harking back to a darker past that has unfairly coloured the town’s reputation. And then, of course, there’s the soccer.\n\nAdvertisement\n\nThe standard of play at Griffith’s grassroots is surprisingly high given its geographic isolation. The passion for the game is strong, and it has to be, considering the immense obstacles that need to be overcome just to take part. To play at any serious level is to accept many, many hours of driving for hundreds of kilometres just to find an opponent. In football, as in agriculture, Griffith’s best produce ends up elsewhere. If you happen to be decent - like Brisbane Roar youngster Pearson Kasawaya, or former national league players such as Michael Musitano, Eliza Ammendolia or Jordan Jasnos - you eventually have to move to the big smoke to pursue your dreams. ‘A big family affair’ Griffith’s biggest and most successful club is Yoogali Soccer Club, named for the small township on the city’s eastern fringes, towards Yenda. It was formed in 1954 out of the Yoogali Club, one of Australia’s oldest ethnic social clubs, which was where members of Sydney’s Italian community visited for inspiration before founding Club Marconi - though it no longer plays there, having linked up with the Griffith Leagues Club down the road years ago. (That’s why there’s a second team based in Yoogali, known as Yoogali Football Club; the schism between ‘YSC’ and ‘YFC’ would require a whole book to properly explain.) Yoogali has won 34 first-grade titles in various competitions and regularly hosts teams from Sydney for pre-season matches. Tom Sermanni used to bring the Matildas there regularly for training camps during his first two stints as national team boss and spoke at Yoogali’s season launch at the start of this year.\n\nAdvertisement\n\nThe Yoogali Club. Credit: Instagram / @oakbankbecart In an alternate universe, where Griffith is, say, two hours’ drive from Sydney instead of six, it’s not difficult to imagine a club like Yoogali climbing the ranks into the old National Soccer League, back when it had promotion and relegation into the state leagues. Luke Santolin is the current coach of Yoogali’s senior men’s team. His grandfather (or nonno) Noé was one of the club’s founding fathers - the field at the Yoogali Club is named for him - and his father Tony used to coach, and still plays. “They used to play after church with all the Italian immigrants, and it just grew from there,” Santolin says. “Like most football club stories, they were doing everything: they were cutting the grass, they were painting the lines, putting the nets up, all that jazz. It was a big family affair back then. My two boys have just started playing now. It’s really all I’ve ever known.” One of Yoogali’s earliest soccer teams, from the 1950s. Credit: Yoogali SC Yoogali has an itinerant soccer history, through no fault of their own. Far too big for the local league in Griffith, they have spent decades trying to find somewhere to play, only to be consistently rebuffed. They’ve played in Shepparton (twice), Wagga Wagga, a short-lived Regional Premier League involving other Victorian teams, and most notably, in Canberra.\n\nAdvertisement\n\nInvariably, other teams get sick of driving to Griffith and find a way to get rid of them, even though they only have to travel once per year, and Yoogali every fortnight. “We’ve never forfeited a game. Would you believe that? Never,” says Santolin. Griffith’s greatest soccer triumph came in 1971, when a team called Griffith United (an amalgamation of Yoogali and Hanwood FC, their fierce rivals) won the league and cup double in the ACT. They played in front of big, boisterous crowds at home, and then jumped on a bus to Canberra every other weekend to fulfil their away commitments. In that team? Not only Tony Santolin and two Paraguayan brothers, Willie and George Wood, but a 16-year-old Walter Valeri, the father of future Socceroo Carl; his father (Carl’s nonno) was one of Hanwood’s founding members. The Valeris later moved to Canberra for work opportunities. Former Socceroo Carl Valeri (centre) can trace his roots back to Griffith - specifically, to Hanwood FC. Credit: Reuters “The impossible dream came true,” wrote local newspaper The Area News when Griffith United were crowned champions. “They trained hard, travelled long distance and fought tenaciously to give this town an enviable soccer supremacy. They won and thoroughly deserved it.” The next year, they were kicked out for administrative reasons. For the past five years, Yoogali has been competing in Canberra again, as part of the Capital Football system. In 2023, they won promotion to the top-flight NPL - putting them technically just one step below the A-League - and then last year, defied the odds to stay up.\n\nAdvertisement\n\nUnlike their opponents, they don’t pay their players - although they do have a long, proud history of sourcing players from overseas, particularly from Scotland. They don’t get paid either, but the club does cover their airfares and finds them work in Griffith (picking fruit, usually, at first) and a place to live. Some of them never go back. “I remember as a kid growing up, my grandparents had a granny flat at the back of their house where the overseas players would live in,” Santolin says. “I remember going to kick the ball with them and then seeing them play for Yoogali on a Sunday. We got to a level where players were calling us, saying they’d heard from a mutual friend or a contact about our club, and how do they come out? You only get that reputation by conducting yourselves the right way. Some of my best friends ever started off as visa players, and now they’ve got three, four kids, a wife, a business, when originally they just came over to kick a ball. So it’s pretty special.” This year’s team features five members of the Donadel family who, like the Santolins, are Yoogali royalty. Two of them are sons of Sante Donadel, assistant coach, former first-grade coach and a former player for over 50 years. The Donadels moved to Griffith in 1970; Sante’s father played for Yoogali, and made life-long friends at the club, and his uncle was coach of Griffith United when they did the double in ’71. “We’re still learning, as players, coaches and our committee, how to deal with that level of football, the NPL,” Donadel says. “It’s by far the best comp we’ve played in. But it’s been good. We’re one of the only [regional] clubs to have ever done something like this.” Things have been tracking well on the field. They recently smashed last season’s premiers, Gungahlin United, 5-1.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-travellers-nightmare-after-spotting-secret-code-on-boarding-pass-never-had-that-210639452.html",
        "title": "Aussie traveller's 'nightmare' after spotting secret code on boarding pass: 'Never had that'",
        "publish_date": "2025-06-06T21:06:39Z",
        "category": "finance",
        "authors": [],
        "text": "The four-letter code given out by airlines has a \"stigma\" surrounding it, according to one well-travelled Aussie.\n\nRuby was travelling to the US when she spotted the dreaded four-letter code. Source: TikTok/Itsrubytravels\n\nStringent immigration checks and cases of travellers being turned away at the border have left many Aussies second-guessing their need to travel to the United States in recent months.\n\nAnd one traveller heading to America was recently left with a sinking feeling when she received her boarding pass at Brisbane Airport with the code SSSS printed on it.\n\nThe code, which stands for \"secondary security screening selection\", is the \"four letters no traveller wants to see on their boarding pass\" when travelling to the United States, according to United passenger Ruby.\n\nSharing her experience, Ruby said the code is known as \"every traveller's worst nightmare\" to those who regularly visit the US because those who receive it are subjected to additional security screening before they are allowed to board.\n\nADVERTISEMENT\n\n\"I've travelled to over 30 countries so am aware of the stigma around it,\" she told Yahoo News.\n\nAussie subject to additional security screening before US flight\n\nRuby told Yahoo that upon checking into their flight at Brisbane airport ahead of a three-week holiday, her fiancé – who is a US citizen – had \"no problem\", but she was told she required additional checks.\n\n\"When I got to the bag drop and my boarding pass was printed, I got the dreaded four S's,\" she explained. \"They didn't check my paperwork or say anything, which was surprising.\"\n\nIt wasn't until she arrived at the gate and was ready to board that she was \"pulled aside\" to a table for the additional screening.\n\n\"After you've scanned your boarding pass, they said 'go over there' and they had me hand over my passport, which they reviewed. I put all of my stuff out on the table and they swabbed everything, including my bag, laptop, hands and stomach. I've never had that before,\" she explained.\n\nADVERTISEMENT\n\nRuby said that travellers can be flagged for \"all sorts of reasons\" with some saying it's \"random\". \"It's kind of a lottery for seasoned travellers,\" she said.\n\nLuckily, Ruby was allowed to proceed with her journey but it wasn't the end of her security woes. At immigration in San Francisco, she said, \"they were really grilling me\".\n\n\"You never know with the US,\" she warned.\n\nDespite that, she still urged Aussies to enjoy the country, adding that \"it's still safe\" and \"if you have nothing to hide, you shouldn't be worried\". \"Go have fun, but be careful and stay safe,\" she said.\n\nWhy does the SSSS security check exist?\n\nProminent immigration lawyer Melissa Vincenty told Yahoo News she has been subject to the screening herself and has even seen children get flagged.\n\nADVERTISEMENT\n\n\"As soon as you see it you think 'oh man',\" she laughed. But added the additional security checks are common and nothing to worry about.\n\n\"This has been around since the 9/11 legislation when they made the Transportation Security Administration (TSA) under the Department of Homeland Security,\" she explained of the change made in 2003.\n\nWhile neither the TSA nor airlines publish the criteria used when boarding passes are issued, Vincenty believes that the selection process is random.\n\n\"They are required by law to randomly select passengers,\" she explained of the security screening.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]