[
  {
    "url": "https://www.9news.com.au/world/king-charles-shares-cancer-recovery-milestone-in-tv-message/6f245f71-bd75-4ad3-967c-600c565c410d",
    "title": "King Charles shares cancer recovery milestone in TV message",
    "publish_date": "Sat, 13 Dec 2025 01:14:17 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "King Charles III offered a rare update on his cancer journey in a video message on Friday evening, revealing that he has responded well to treatment and it will be reduced in the new year.\n\nCharles, 77, described the milestone in his recovery process as \"a personal blessing\" before hailing \"the remarkable advances that have been made in cancer care in recent years.\"\n\n\"Today I am able to share with you the good news that thanks to early diagnosis, effective intervention and adherence to 'doctor's orders,' my own schedule of cancer treatment can be reduced in the new year,\" the British monarch said in a pre-filmed clip for Channel 4's Stand Up To Cancer broadcast, which partners on its annual campaign with the charity Cancer Research UK.\n\nREAD MORE: Apple issues urgent iPhone update after Triple Zero emergency call testing raises concerns ﻿\n\nKing Charles gives video message update about his cancer journey (Youtube/The Royal Family)\n\nCharles announced he had been diagnosed with cancer in February 2024 after undergoing a prostate procedure.\n\nWhile his treatment is not over, a spokesperson for the King told CNN that \"His Majesty has responded exceptionally well to treatment and his doctors advise that ongoing measures will now move into a precautionary phase.\"\n\nThe spokesperson added: \"This position will be continuously monitored and reviewed to protect and prioritise his continued recovery.\"\n\nIn his video message, which was filmed at his London residence of Clarence House in late November, Charles reflected on learning about his diagnosis.\n\nHe said that he knows it \"can feel overwhelming\" but that he also knows \"early detection is the key that can transform treatment journeys, giving invaluable time to medical teams – and, to their patients, the precious gift of hope.\"\n\nHe stressed the importance of cancer screening programs and encouraged people to make use of them to catch the disease quickly because \"early diagnosis quite simply saves lives.\"\n\n\"Too often, I am told, people avoid screening because they imagine it may be frightening, embarrassing or uncomfortable. If and when they do finally take up their invitation, they are glad they took part,\" he explained, before highlighting a new national Screening Checker , available online in the UK.\n\nKing Charles III and Queen Camilla meet patients during a visit at the University College Hospital Macmillan Cancer Centre on April 30, 2024 in London. (Getty)\n\n\"This simple tool allows you to check whether you are eligible for breast, bowel or cervical cancer screening. It demystifies the process, answers your questions, and guides you towards taking that crucial step.\"\n\nCharles also said that during his own cancer journey he has been \"profoundly moved\" by what he called \"the community of care\" that surrounds every patient.\n\nHe ended his message with his \"most heartfelt thanks to the doctors, nurses, researchers and charity workers involved in diagnosis and treatment programs, together with my particular good wishes to those for whom they care so selflessly.\"\n\nFriday's message is the latest example of how the British sovereign has made cancer awareness a fundamental part of his public facing work.\n\nHis first official engagement following his diagnosis was in April last year when he visited University College Hospital Macmillan Cancer Centre in London, where he met patients and clinicians.\n\nThe King's outing came as he was announced as the new patron of Cancer Research UK. He has also been patron of Macmillan Cancer Support for almost three decades.\n\nHe also sent a deeply personal message to a Buckingham Palace reception in April honoring the work of cancer charities, saying despite the fears that cancer can bring, it can illuminate the best of humanity.\n\nKing Charles III during the 2025 National Service Of Remembrance (Getty)\n\nCharles has been praised for his openness around his diagnosis and raising awareness around it. Caroline Geraghty, senior information nurse at Cancer Research UK, commended both Charles and his daughter-in-law Catherine, Princess of Wales, for sharing their experiences with the disease.\n\n\"He's visited hospitals, he's seen patients, he's visited support centers. He really has kept in touch with people,\" she told CNN.\n\n\"I think he feels, and as do other people, that he's got something in common with them. I think them telling us this also highlights the fact that anyone can get cancer. It doesn't matter who you are.\"\n\nRoyals mark Remembrance Sunday View Gallery\n\nKing Charles has not publicly disclosed the type of cancer he has been receiving outpatient treatment for.\n\nA royal source told CNN last year that the form of cancer detected was not prostate cancer, but did not specify further.\n\nThe spokesperson for the King told CNN on Friday that was because \"the advice from cancer experts is that, in his determination to support the whole cancer community, it is preferable that His Majesty does not address his own specific condition but rather speaks to those affected by all forms of the disease.\"\n\nIt's not yet clear how much longer Charles will require treatment; that would be a matter for his medical team to determine.\n\nFollowing his diagnosis last year, the King briefly stepped away from public facing duties, though he continued to carry out state business.\n\nHe has since returned to a busy diary of engagements and foreign trips.\n\n\"The King has taken great comfort and encouragement from being able to continue leading a full and active life throughout his treatment, while always heeding the advice of his medical team,\" his spokesperson told CNN.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/afp-looking-for-help-in-tracing-objects-linked-to-child-sexual-exploitation-victims/fe6b0397-8b70-4b36-93d7-470b7ce83bcd",
    "title": "AFP launches plea looking to trace objects in search of online child sexual exploitation victims",
    "publish_date": "Sat, 13 Dec 2025 01:30:37 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "The AFP has turned to the community for help in identifying the origins of nine photos from ﻿online child sexual exploitation cold cases.\n\nThe images form part of the fourth ﻿ Australian release of Stop Child Abuse – Trace an Object, which started as a Europol initiative, releasing \"cold case\" online child sexual exploitation images in search of help to help identify the origins.\n\n\"To the ordinary eye, these photographs look like mere slices of everyday life,\" the AFP said in a statement.\n\nRed football jerseys framed for posterity. (AFP)\n\nA Tiny Love Gymini playmat. (AFP)\n\n\"But for the AFP-led Australian Centre to Counter Child Exploitation (ACCCE) they're tiny clues that could help to identify, save and support victims of online child sexual exploitation (OCSE).\"﻿\n\nThe nine images are known to have Australian connections to either victims, location or offender.\n\nA patterned cushion with an owl displayed on it. (AFP)\n\nA pink dress with floral patterns. (AFP)\n\nThe images have been censored to remove graphic material as the AFP hopes releasing them may help in providing useful information or insights from the public.\n\n﻿\"One of the photos from this latest Stop Child Abuse – Trace an Object release shows two framed football jerseys, so, in putting it out into public, we're looking to spark the memory of anyone who might have come across them,\" Victim Identification team leader Detective Sergeant Lana Carey said.\n\n\"Possibilities here could include a player or club member who might recognise the jersey colours or design, a framer who might remember doing the job, or a fan who might know the significance of the number 8 and 11 jerseys being grouped together.\n\n\"It's about tapping into the wisdom of everyday Australians. And we know they're eager to play a role, given the previous three image releases have generated 1372 reports and counting.\"\n\nThe AFP has said these clues could help identify, save and support victims of online child sexual exploitation (AFP)\n\nA kitchen complete with an internet modem, window blinds and coffee mugs. (AFP)\n\nCarey noted that while every photo represented cases where all lines of inquiry had been exhausted, they were not seen as dead ends.\n\n﻿\"Our identification specialists never give up on a victim,\" she said.\n\n\"We follow every lead and avenue we have when files first come into the ACCCE, and if we don't succeed.\"\n\nWe will continue to visit them periodically, year after year after year after year, to see if new intelligence or technology might open up fresh lines of inquiry.\n\n\"It's about the never-ending hunt for closure, the commitment to saving and supporting victims and survivors and, hopefully, that bittersweet moment when you realise you've solved it.\"\n\nAFP Commander Human Exploitation Helen Schneider said the images came into the ACCCE from several sources, including Victim ID taskforces and the US-based National Centre for Missing & Exploited Children.\n\nTropical flowers spread across patterned pink bedspreads. (AFP)\n\nA bedframe with built in radio and lights. (AFP)\n\n\"Our victim identification team members receive fresh images of online child sexual exploitation every single day,\" Commander Schneider said.\n\n\"And every new file carries just as much horror and trauma for the victim as the one before it.\n\n\"Every one of them represents a life upended, so when team members take on a case, they never give up; it's our version of looking for a needle in a haystack.\n\n\"We know community leads can make or break an investigation, so we encourage people to remember that any tip they give us – no matter how small could change the life of a victim.\"\n\nThe images can be found here where people can also make a report for information.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/director-convicted-of-scamming-11m-from-netflix-and-going-on-lavish-spending-spree/10264336-5acf-455c-86b6-d05e77f253d1",
    "title": "Director convicted of scamming $16.5m from Netflix and going on spending spree",
    "publish_date": "Fri, 12 Dec 2025 23:31:23 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A Hollywood director was convicted Thursday on charges that he scammed Netflix out of $16.5 million ($USD 11 million) for a show that never materialised, while he instead used the cash for lavish purchases.\n\nThe purchases included several Rolls-Royces, a Ferrari and about $1.5 million ($USD 1 million) in mattresses and luxury bedding.\n\nCarl Erik Rinsch, best known for directing the film \" 47 Ronin, \" was convicted of wire fraud, money laundering and other charges, according to court records and a spokesperson for federal prosecutors in New York.\n\nProsecutors said Netflix had initially paid Rinsch about $66 million ($USD 44 million) for an unfinished sci-fi show (AP)\n\nIn a statement, Rinsch's attorney, Benjamin Zeman, said he thought the verdict was wrong and \"could set a dangerous precedent for artists who become embroiled in contractual and creative disputes with their benefactors.\"\n\n\"In this case, one of the largest media companies in the world, finding themselves indicted by the federal government for fraud.\"\n\nProsecutors said Netflix had initially paid Rinsch about $66 million ($USD 44 million) for an unfinished sci-fi show called \"White Horse,\" and then sent over another $16.5 million ($USD 11 million) after he said he needed additional funding to wrap up the production.\n\nCarl Erik Rinsch, best known for directing the film \"47 Ronin,\" was convicted of wire fraud, money laundering and other charges. (AP)\n\nBut instead of putting the money toward the show, Rinsch steered the cash to a personal account where he made a series of failed investments, losing around half of the $16.5 million ($USD 11 million) in a couple of months, according to prosecutors.\n\nHe then put the remaining funds into the cryptocurrency market, netting some profit, though Rinsch then deposited the money into his own bank account.\n\nThen came the lavish purchases, prosecutors said, with Rinsch buying five Rolls-Royces and one Ferrari, along with $979,700 ($USD 652,000) on watches and clothes. He also bought two mattresses for about $958,600 ($USD 638,000) and spent another $443,200 ($USD 295,000) on luxury bedding and linens. In addition, he used some of the money to pay off about $2.7 million ($USD 1.8 million) in credit card bills, prosecutors said.\n\nRinsch never finished the show. His sentencing date is set for April.\n\nNetflix declined to comment.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/forced-bankruptcy-rising-australia-fca-report/00a384f7-eec9-4083-b342-8a45e2fdab7c",
    "title": "Surprise culprits forcing Aussies into bankruptcy",
    "publish_date": "Fri, 12 Dec 2025 12:50:00 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Strata bodies are forcing Australians into bankruptcy almost as much as the tax office, and private schools are also increasingly turning to the debilitating measure to recover unpaid debts.\n\nThat's according to a report by Financial Counselling Australia (FCA) released today, which found the number of people forced into bankruptcy is climbing, and the proportion of creditor petitions that end in bankruptcy has tripled over the last six years, up to 40 per cent.\n\nIt outlined that, while the measure should be used as a final step, many Australians have been declared bankrupt over debts as small as $10,000 – which can be largely composed of legal and interest fees.\n\nREAD MORE: Major bank hikes fixed rates despite saying more RBA cuts on the way ﻿\n\nThe rate of Australians being forced into bankruptcy is rising. (Lousie Kennerly)\n\n\"Forced bankruptcy is one of the most serious tools available to creditors and should only be used as a genuine last resort,\" FCA chief executive Dr Domenique Meyrick said.\n\n\"Our report shows that without stronger safeguards and modernised laws, Australians risk losing their homes and livelihoods unnecessarily over relatively modest debts.\"\n\nWhile debt collectors and big banks have largely stopped pursuing bankruptcy over the past six years, other creditors are taking their place.\n\nStrata bodies made up 12 per cent of all cases in 2024-25 – the same as non-bank business lenders and only marginally less than the Australian Tax Office at 13 per cent.\n\nIn 2020-21, they made up just 2 per cent of cases.\n\nREAD MORE: Woman raped by Tom Silvagni says he violated her body and trust ﻿\n\nThe number of bankruptcy actions taken by strata corporations has soared in recent years. (Lousie Kennerly)\n\nIn one example, a woman who was unable to work due to the PTSD, anxiety and depression caused by a violent relationship was pursued by her strata for $10,400 – much of which was legal fees and interest – although she was able to borrow from friends and eventually avoided bankruptcy.\n\nThe FCA has called for strata bodies to be forced to provide hardship assistance and limit the legal action they take against residents in their buildings.\n\n\"Forced bankruptcy is appearing most in sectors that lack strong consumer protections, including rights to hardship support or fair dispute resolution,\" Meyrick said.\n\n\"Put simply, it's happening where safeguards are minimal.\n\n\"Practical reforms are urgently needed to ensure fairness and consistency in the system.\"\n\nREAD MORE: David Jones hints at return of Christmas tradition next year ﻿\n\nThe number of private schools pursuing bankruptcy has also escalated, up to 2 per cent of all cases last financial year – the same proportion as strata bodies in 2020-21.\n\nAlmost half of those matters were from five schools in Victoria: Sirius College, Oakleigh Grammar, Overnewton Anglican Community College, Trinity Grammar School in Kew, and Wesley College Melbourne.\n\nAs with stratas, FCA said hardship assistance should be enshrined in all sectors where the protections don't currently apply.\n\nIt also made seven other recommendations for governments, including that the bankruptcy threshold to be raised from $10,000 to $20,000.\n\n\"These are practical, achievable reforms,\" Meyrick said.\n\n\"They would make the system fairer and more consistent, helping to ensure bankruptcy is used only as a genuine last resort.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/tomago-nsw-federal-governments-strike-deal-to-save-largest-aluminium-smelter/f3affa7c-627d-4d59-8ebf-d0bc56024e6f",
    "title": "More than 1000 jobs saved in government's aluminium smelter deal",
    "publish_date": "Fri, 12 Dec 2025 10:16:00 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "More than 1000 jobs have been saved at Australia's biggest aluminium ﻿smelter after the government stepped in with a deal that would allow the plant to remain open beyond 2028.\n\nRio Tinto warned that closure was all but guaranteed for its Tomago smelter in the NSW Hunter Region when its coal power contract ends in 2028, due to soaring energy costs.\n\nPrime Minister Anthony Albanese announced ﻿the federal and NSW governments have struck a deal with the owners to provide clean energy to the smelter so that it can remain open.\n\nREAD MORE: ﻿ Idyllic tourist hotspot introduces the death penalty for a common offence\n\nTomago Aluminium in the Hunter. (Chris Elfes)\n\n﻿\"There has been a board meeting here that's considered the proposals that were going forward, and what that will look like is Tomago agreeing to have more investment here in their capability, at the same time as we provide security of a guarantee of energy price going forward as well,\" he told reporters in Tomago.\n\nAlbanese said it was in the \"national interest\" to keep the smelter open, jobs going, and manufacturing in Australia. ﻿\n\n\"I say to all the workers here, have a great Christmas in the knowledge that over the coming months, as a result of the decision that we have taken, we'll be working on finalising these details to make sure that your future is as secure,\" he said.\n\n\"My government is working together with the NSW state government and Tomago Aluminium on a new energy agreement that will secure the future of the facility.\"\n\nThe ﻿federal government was in negotiations with the NSW government over funding arrangements.\n\nThe details will be finalised in the coming months. ﻿\n\nAnthony Albanese shakes workers' hands after announcing a deal to keep Tomago Aluminium open. (X)\n\nBased in the Hunter about 13km west of Newcastle, Tomago is Australia's largest aluminium smelter and produces almost 40 per cent of the country's aluminium.\n\nRio Tinto is the majority owner, with Gove Aluminium Finance and Norwegian-owned energy company Norsk Hydro also owning smaller parts of the smelter.\n\nIn late October, Rio Tinto announced that the increasing cost of energy meant it was struggling to find an \"economically viable\" solution to keep the plant operating past the end of the contract.\n\nThe company started consultations with the employees regarding the future of operations.\n\n\"We continue to engage with stakeholders on a viable pathway for Tomago,\" Tomago Aluminium chief executive Jérôme Dozol said at the time.\n\n\"Unfortunately, all market proposals received so far show future energy prices are not commercially viable, and there is significant uncertainty about when renewable projects will be available at the scale we need.\n\n\"While no decision has been made, this is a difficult point to reach.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/perth-family-facing-deportation-granted-permanent-residency/313eced7-6aa4-41ac-9760-68f9039e9aad",
    "title": "Perth family's 14-year fight to escape deportation finally over",
    "publish_date": "Fri, 12 Dec 2025 20:08:45 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: After 14 years of ﻿ denied visa applications and deportation notices, the Aldeiri family got the call they had been waiting so long for this week.\n\nMinister for Immigration Tony Burke had \"intervened\" in their decades-long fight to stay in Australia.\n\nThey were given an appointment at the immigration office on Wednesday and told nothing else.\n\nThe Aldeiri family have been fighting to stay in Australia for more than a decade. Now the fight is over. (Supplied: Rahma Aldeiri)\n\nRahma Aldeiri, 22, feared the worst.\n\n\"We didn't know what he was going to do, like, will he separate the family?\" she told 9news.com.au.\n\n\"Is he just going to grant me and my sisters the permanent residency, but my parents won't get it?\"\n\nInstead, her family got the news they'd waited 14 years for.\n\nEvery single one of them –﻿ dad Sultan, mum Reem, Rahma, and her twin sisters Hareer and Mesk – had all been granted permanent residency.\n\nTheir fight was finally over.\n\n﻿\"We were all just screaming and crying,\" Rahma said.\n\n\"We worked so hard this entire 14 years ... it was definitely worth it, but the process could have been easier.\"\n\nThe Aldeiri family came to Australia from Jordan in 2011, when Rahma was eight.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nRahma and her sisters, Mesk and Hareer, settled right into their new life in Australia. (Supplied: Rahma Aldeiri)\n\nThey were here to visit ﻿her maternal grandmother, an Iraqi refugee who had become an Australian citizen.\n\nWhile here, ﻿Rahma's parents Sultan and Reem applied for protection visas .\n\nThey wanted to stay in Australia and built a life in Sydney , where Rahma and sisters, then just five, started school.\n\nNeighbours called them a \"role model family\", and \"great citizens without being actual citizens\".\n\nBut their future was uncertain.\n\nThe family's protection visa applications made it all the way to the Federal Court but were denied.\n\nSo too were applications for child visas for Rahma and her sisters.\n\nScared for her future, ﻿Rahma started a Change.org petition in 2019 pleading to stay in Australia.\n\nShe was 15 and living in fear of being deported.\n\nREAD MORE: Actress Amanda Seyfried doubles down on Charlie Kirk comments\n\nRahma and her sisters spent most of their lives growing up in Australia, but their future was always uncertain. (Supplied: Rahma Aldeiri)\n\n\"That was a terrible time,\" she said.\n\n\"I'd almost be finishing high school, but I couldn't even celebrate that because I didn't know what would happen next week.\"\n\nThe following year, ﻿the family were given an official deportation notice. ﻿\n\nThey emptied their Sydney home, bought tickets to Jordan, and made one last trip to Perth to see relatives.\n\nThen the pandemic hit, borders slammed shut, and the ﻿Aldeiri family couldn't leave.\n\nSo their immigration lawyer, Simon Jeans, kept fighting for them to stay.\n\nHe made last-ditch applications for a ministerial intervention﻿ but it still took years for the family's case to be seen by Minister for Immigration Tony Burke in 2025.\n\nBy that time, the Aldeiri family had built a life in Perth.\n\nRahma had earned a nursing degree from Curtin University, and her twin sisters Hareer and Mesk had finished high school.\n\nRahma is now a university graduate and her twin sisters are planning careers of their own. (Supplied: Rahma Aldeiri)\n\nBeing sent back to Jordan, a country they could barely remember, was unthinkable.\n\n\"It just doesn't make any sense for us to go back, we have nothing there. This is our home, why would we leave our home?\" Rahma told 9news.com.au in February.\n\nWords can't describe the relief she felt when they were granted permanent residency.\n\nRahma called it the best news of her life in a Change.org update to the 40,000 strangers who backed her petition.\n\nShe also thanked two Nine reporters – Jayne Azzopardi and 9news.com.au's Emily McPherson – for bringing her family's fight into the spotlight over the last 14 years.\n\n\"You helped give our family a voice when we felt voiceless,\" she wrote.\n\n\"You kept us going when things felt impossible.\"\n\nNow she's looking forward to a stable future here in Australia.\n\n﻿As permanent residents, Rahma and her parents can finally get permanent work.\n\nRahma spent years fighting to stay in Australia. Now she can focus on her future. (Supplied: Rahma Aldeiri)\n\nHer younger sisters, both 19, can also start pursuing careers without fear of being deported.\n\n﻿Mesk is already studying engineering on a scholarship at the University of Technology, Sydney.\n\nBut Hareer, who had been unable to secure a scholarship, wasn't able to start a teaching degree due to high international student fees.\n\nThat won't be a problem now.\n\n﻿\"Now we can buy a house, now we can have a little holiday ... I still can't process it,\" Rahma said.\n\n\"No more applications, no more chasing up Medicare, no more stressing about waiting for a call, nothing.\n\n\"Just you wake up and it's nice, it's silent ... it's all over, and we can just live normally now.\"﻿",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/hot-days-power-grid-aluminium-smelter-air-conditioning/65973a00-6e45-4d49-ad2d-db157033a81c",
    "title": "Keeping homes powered on scorchers relies on shutting one industry down",
    "publish_date": "Fri, 12 Dec 2025 20:28:28 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Some days are made for air conditioning .\n\nOn those days where the mercury rises to the angry end of the 30s, those of us with air-con wondered what we did without it.\n\nBut it's on those days Australians stand the greatest risk of losing it all to an unwelcome blackout.\n\nAir conditioning is a major cause of a rise in household electricity use. (Getty)\n\nWhile the grid used to be under the most pressure on winter nights, things have changed, according to the Grattan Institute's Alison Reeve.\n\n\"The winter evening peak in the old days was just everyone coming home and putting the heating on at the same time,\" she said.\n\n\"Now what it's shifting to is everyone putting the air conditioning on at the same time.\"\n\nAdding more pressure on the grid is an ironic issue with coal generation.\n\nIf it gets too hot, coal plants start to struggle.\n\nAluminium smelters are asked to shut down temporarily rather than cause blackouts elsewhere. (Nine Archives)\n\n\"Coal generators are more likely to break down because they don't cope very well with high heat,\" Reeve said.\n\n\"So when that happens, that can also cause a blackout or a brownout, because you've got such high demand at the same time.\"\n\nWhat is saving most Australians from blackouts is an arrangement with some of the country's biggest users of electricity .\n\nWhen the grid is under too much strain, the major users are asked to switch off.\n\nThe biggest offenders are aluminium smelters.\n\nAustralia has four aluminium smelters that account for 10 per cent of the electricity used in the country.\n\nAluminium smelters are the biggest user of electricity in Australia. (Nine Archives)\n\nThe Tomago smelter on the NSW Central Coast uses as much power as a city of a million people.\n\nAnd high power bills has meant the smelter is now turning to the federal government to keep them open.﻿\n\nBut switching them off is an expensive endeavour.\n\nThe smelters run 24 hours a day, and any shutdown is problematic.\n\n\"It doesn't happen that often,\" Reeve said.\n\n\"It's there if we need it.\"\n\nAluminium smelters like this one in Portland use a massive amount of electricity. (Nine Archives)\n\nAnd while rooftop solar panels are helpful for the grid on hot days, it is taking the edge off rather than carrying the load.\n\nSolar panels generate the most electricity around 1pm, but the usual peak time for power usage is about 5pm. By then, the sun has started to set and less electricity is being generated.\n\nSo how can the average punter reduce the risk of blackouts on a hot summer's day?\n\nThe best options are to add a few degrees to the air conditioner, and, obliquely enough, make sure your aluminium cans are getting recycled.\n\nREAD MORE: How each Australian state is doing when it comes to renewable energy",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/new-ai-safety-cameras-captures-shocking-risks-drivers-are-taking-on-the-road/fe0f893c-d7ed-44ea-84cb-3a1bf7ac9672",
    "title": "New AI safety cameras capture 'beyond mind-boggling' driver behaviour",
    "publish_date": "Fri, 12 Dec 2025 11:21:04 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Western Australia's new AI safety cameras have fined more than 31,000 distracted, speeding and unrestrained drivers in their first four weeks of operation.\n\nSix camera trailers dotted across the state, as well as three fixed cameras on the Kwinana Freeway, have been operating on a cautionary basis for eight months.\n\nThat period ended on October 7, after which $13 million in fines were handed out in the next month.﻿\n\nMost shocking of all, a truck driver was snapped driving at 100 km/hr with no seatbelt, with a mobile phone in one hand and another object the other. (Nine)\n\nThe revenue from fines is being reinvested into road safety.\n\n\"If the AI system believes there is an offense, then two humans will look at those photos and make a judgment,\" Road Safety Minister Reece Whitby said.\n\nMore than 12,000 motorists were caught using their mobile phones and about 10,000 drivers were snapped without a seatbelt.\n\n\"It's beyond mind-boggling why anyone would not put on a seatbelt on,\" Whitby said.\n\n\"For goodness sake, please, please exercise caution, be responsible.\"\n\nImages of drivers eating cereal, painting their nails and using nail clippers were just some of the offences caught on camera.\n\nOne driver was seen using her phone while her passenger steered the car.\n\nMost shocking of all, a truck driver was snapped driving at 100km/h with no seatbelt, with a mobile phone in one hand and a clipboard-shaped object in the other.\n\nOne driver was even seen using her phone while her passenger steered the car. (Nine)\n\n\"People are normalising the car as an extension of their home, when you see some of these activities,\" University of Western Australia Professor Teresa Senserrick said.\n\nAuthorities hope the cameras can help change driver behaviour as the state approaches its worst year of road fatalities in almost a decade.\n\nAcademics ﻿at the WA Centre for Road Safety Research at UWA hope a new high-tech driving simulator can help prove just how dangerous these distractions can be.\n\n\"It's usually fractions of seconds that are the difference between either being able to avoid a crash or at least being in a low-impact crash,\" Senserrick said.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/national/adelaide-peak-hour-car-crash-rollover/652b147d-a8c1-4e8b-bf81-4c583b81514e",
    "title": "Driver walks away from chaotic peak-hour crash in Adelaide",
    "publish_date": "Fri, 12 Dec 2025 11:28:30 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A driver has remarkably escaped serious injury after a dramatic peak-hour crash involving a van in the inner Adelaide suburb of Prospect.\n\nThe incident occurred on Regency Road, as a driver came out of a driveway.\n\nThe impact of the collision forced the van onto its side, causing it to scrape along the road.\n\nThe van driver was taken to hospital with a minor back injury. (Nine)\n\nAnother vehicle was forced over the median strip onto the wrong side of the road.\n\nNearby tradesmen rushed to help, with one telling 9News he was preparing to pull the driver out of the van, and he was lost for words when he started to climb out of the wreckage and walk away.\n\n\"They opened the door from there and they tried to pull the man out but the man himself came out,\" a witness said.\n\nThe van driver was taken to hospital with a minor back injury.\n\nThe driver of the Mazda, a woman in her 30s, has been fined for driving without proper control.",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.9news.com.au/world/us-proposes-sunscreen-rules-change/6baf2ac2-8433-4603-bc63-2bf6a02705d1",
    "title": "US proposes major change to sunscreen regulations",
    "publish_date": "Fri, 12 Dec 2025 07:32:54 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A new proposal from the US Food and Drug administration would allow sunscreens in the\n\nUS\n\nto include an active ingredient already commonly used in\n\nAustralia\n\n,\n\nEurope\n\n, and parts of\n\nAsia\n\n.",
    "source": "9News",
    "cluster_id": 9
  },
  {
    "url": "https://www.9news.com.au/national/long-bay-jail-unsafe-conditions-revealed-in-report/75582d92-7d39-4a94-9467-acb380aa59f3",
    "title": "Appalling conditions inside notorious Australian prison found by inspectors",
    "publish_date": "Fri, 12 Dec 2025 04:20:57 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Parts of a notorious Australian jail should be closed due to \"dilapidated\" and \"unsafe\" conditions, according to the prison regulator.\n\nEvidence of vermin, mouldy walls and rusting beds were found inside Sydney's 116-year-old Long Bay Correctional Complex in Sydney's south during an inspection by the NSW Inspector of Custodial Services Fiona Rafter.\n\n﻿Her report covering inspections of the facility, which holds 1200 inmates, during 2023 and last year was tabled in state parliament this week.\n\nLong Bay Correctional Centre in southern Sydney holds 1200 inmates. (AAP)\n\nIt paints a grim picture of life inside the prison's Metropolitan Special Programs Centre, dating back to about 1900.\n\nRafter highlighted how she found a dangerous and dirty environment with hanging points across all areas of the complex.\n\nShe described the cells as \"rundown and small\" and noted they offered little natural light.\n\nTheir size meant they were unable to house wheelchairs and other mobility aids for prisoners with special needs.\n\nRafter was also scathing about the state of the showers in the centre, which had no privacy barriers and poor drainage.\n\nCracked walls and cramped cells were found at Long Bay jail in Sydney by the prison watchdog. (Photo: Inspector of Custodial Services) (Supplied)\n\n\"The damaged and broken tiles in 7-wing were particularly concerning as these showers are used by inmates at-risk of self-harm.\"\n\n﻿The condition and age of the centre meant authorities could not provide a safe environment for prisoners who have mental illness, disability, age and frailty, she said.﻿\n\nRafter also brought to attention the poor conditions in two \"mothballed\" parts of the prison.\n\nThe wings were temporarily closed but were supposed to be left in a state that enabled them to be reopened at short notice.\n\nBut the report found after only three months they were \"filthy\", with fur and faeces pointing to stray cats living in them.\n\nPoor ventilation and run-down ceilings were found by inspectors at Long Bay jail in Sydney. (Photo: Inspector of Custodial Services) (Supplied)\n\nInspectors also scrutinised Long Bay's two hospital ﻿facilities.\n\nThey described one as \"modern, secure, fit for purpose\", but the other housed remand prisoners and \"bore no resemblance to a hospital\".\n\nIn September, the NSW Opposition called for Long Bay jail to be sold off to make room for thousands of new homes﻿.\n\nUnder the plan, the site would be bulldozed to build up to 12,000 homes if the Coalition is elected in 2027.\n\nNSW Corrections Minister Anoulack Chanthivong said the government was considering the recommendations of the report and would issue a formal response at a later date.\n\n\"The government has invested $16 million into its anti-ligature program and is prioritising cells that house inmates most at risk,\" he said.\n\n\"The government has also commissioned a Rapid Review into Unnatural Deaths in Custody to systemic issues and recommend reforms to improve safety and wellbeing in custody.\n\n\"We are actively working to reduce all preventable deaths in custody including by improving design and safety across correctional centres.\"",
    "source": "9News",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/perth-queer-nightclub-connections-celebrates-50-years/106137800",
    "title": "Perth queer nightclub celebrates 50 years of dancing and difference",
    "publish_date": "Sat, 13 Dec 2025 01:50:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Founded in 1975, when homosexuality was still illegal in Western Australia, Perth's Connections nightclub has seen waves of social change and kept the party going amid recessions and a pandemic.\n\nCo-owner Tim Brown, who has worked at Connections for almost 35 years, said when the club first opened in Northbridge in 1975, it was an \"incredible thing\" for the LGBTQIA+ community.\n\n\"It wasn't the first place that people could go in Perth,\" Mr Brown said.\n\n\"There had been several others along the way, but they were even more underground and incredibly coded in how you got into them, how you had access into them, what you could do in them.\n\n\" Connections was always … flamboyant in its approach. It really was a chance for people to show out. \"\n\nHuge social change\n\nIn 1975 in Western Australia, homosexuality was not only illegal for men, but it was also an enormous social taboo.\n\nThe front door of Connections in 1975, the year the club opened. (Supplied: Connections)\n\n\"You could lose your job, lose your family, lose a hell of a lot for even being out, let alone being seen in a gay venue,\" Mr Brown said.\n\n\"I started [working here] in '91, there was still a 'no cameras' policy in here, because people couldn't afford to have their photograph taken in Connections Nightclub, even if they weren't gay, because of what that might mean.\"\n\nHomosexuality was decriminalised in WA in 1990, although the age of consent was set at 21. Equalisation of consent ages occurred in 2002.\n\nIn that setting, Connections became a place for people to escape and be themselves.\n\nAn undated photo of people dancing inside the club. (Supplied: Connections)\n\n\"Remember, 1975 was the peak of disco, a time when nightclubs really came into their own,\" Mr Brown said.\n\n\"People going out, getting dressed up, enjoying themselves in that sort of environment with a very hedonistic, free sort of vibe.\n\n\" If you then overlay that over a group of people who are oppressed day-to-day and you let them have a space where they can let loose and be free and be themselves, it's going to be pretty loose. \"\n\nPeople dancing under disco balls. (Supplied: Connections)\n\nCelebrating all kinds of difference\n\nMr Brown said Connections was not only a space that celebrated the queer community, but also a place that accommodated difference within the community, including age, gender and class.\n\n\"In Perth, being a small town, what happened was that the gays, the lesbians, the young, the old, all ended up in the same space together, which didn't really happen in larger cities,\" he said.\n\n\"[In bigger cities] the women would have their own nightclub, there would be a club for young people, there would be a club for all the subcultures that fit within our community.\n\n\"I think that's what marks Connections out as different from many nightclubs and many other places — it's rooted in that idea that everybody was together, that it celebrates difference, all sorts of difference.\n\n\"Over the years, the goths were here and the punks and all of that. It was a safe harbour for anybody who felt different.\n\n\"I think that's kind of baked into our DNA and something that was born out of necessity in the early days has actually ended up serving us very well into the present day.\"\n\nAn undated photo of Connections at Perth Pride. (Supplied: Connections)\n\nPeople 'got the memo' in the 90s\n\nOver time, Connections changed from a place that people feared being spotted at to one that attracted people from outside the queer community.\n\nA lot of that happened in the 1990s in the wake of the AIDS crisis.\n\n\"The AIDS crisis galvanised us politically, but it also made us visible. We had to stand up and be counted because we were dying,\" Mr Brown said.\n\n\"It was a very dramatic change in our world, but I think the good that came out of that was us standing up and being counted and the general population taking note and then actually realising these guys are really good fun and their venues are really good fun.\n\nA DJ at Connections. (Supplied: Connections/Tobey Black)\n\n\"Furthermore, [the club] always had such a great reputation for music and a great reputation for being really good fun in a 'loose, let your hair down' sort of way.\n\n\"I think there was always an element of the non-gay community that recognised that about Connections and they were always welcome, I just think more people got the memo somewhere in the 90s.\"\n\nLasting 50 years\n\nConnections has survived the ups and downs of Northbridge's popularity, the COVID-19 pandemic, multiple cost-of-living crises, and a tough environment for the hospitality sector.\n\nIt is hard to verify with absolute certainty, but Tim Brown suspects Connections is the longest-running queer club in the Southern Hemisphere.\n\nThe dancefloor at Connections Nightclub. (Supplied: Connections)\n\nFor any hospitality venue, 50 years is an extraordinary achievement.\n\n\"For any business to last 50 years is impressive, for a hospitality business it's amazing, but for a gay nightclub at the end of the earth it's quite incredible,\" Mr Brown said.\n\n\"If you read international media, gay venues all over the world are closing down.\"\n\nAnd in true Connections style, its 50th birthday party has been going on for months, culminating in a big finale on December 13, involving nine DJs and a cabaret throughout the night.\n\n\"We've done a whole series of different events. My favourite was a staff party for the 50 years of Connections staff, and nearly 300 people turned up,\" Mr Brown said.\n\n\"We had a glassie that had worked here on opening night and a manager that had been here in the 80s, it was quite marvellous to see all those layers of people together that was also a way in which we could actually have some conversation.\n\n\"Without doubt, the birthday party itself will probably be pretty manic … and I don't think we're going to get that much conversation.\"\n\nAn undated photo of a Pride celebration at Connections. (Supplied: Connections)\n\nMr Brown is not sure what the next 50 years will bring.\n\n\"I'm not quite sure why people keep asking me this question: it's like, can I go now?\"\n\nBut he is optimistic that the spirit of Connections, or Connies as it is known to the locals, will go on.\n\n\"I think, particularly in this day and age where people are feeling so disconnected, there is something really tribal about being with a group of people and dancing together, having a night out and having a few drinks and laughing and meeting strangers … then we're doing something good,\" he said.\n\n\"If we can keep doing that, there's a good chance that this can keep going for another 50 years or more.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/melbourne-lawyer-dean-hadjina-prison-sentence-stealing-widow/106139262",
    "title": "Melbourne lawyer caught stealing from grieving widow gets four years' jail",
    "publish_date": "Sat, 13 Dec 2025 00:25:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "A former Melbourne lawyer caught stealing from a grieving widow who was his client has been sentenced to more than four years in prison and will never again practise as a solicitor.\n\nDean Hadjina was found to have stolen $482,154 from the widow, who spoke little English, as she sought compensation payouts after her husband's workplace death in 2018.\n\nHadjina, who pleaded guilty to theft and gaining financial advantage by deception in August, pocketed $144,060 from the widow's initial insurance payout of $644,095.\n\nOver the next two years, he persuaded her to pay $338,093 in supposed \"legal fees\", claiming he was working towards securing more compensation.\n\nIn 2021, Hadjina created false Supreme Court documents that said the woman would be awarded $17.25 million.\n\nWhen the money did not come, the victim and her interpreter confronted Hadjina after contacting the courts and an insurance company that was making weekly pension payments.\n\n\"I can't do more than promise and as a good Christian and lawyer, I do not lie ever,\" he wrote in a message.\n\nThe Supreme Court heard Hadjina took advantage of the vulnerable widow as she sought compensation payouts after her husband's death. (ABC News: Karen Percy)\n\nAfter an investigation, the Victorian Legal Services Board found Hadjina only completed $583 worth of genuine legal work for the victim.\n\nIn sentencing Hadjina, Supreme Court Justice Rita Incerti on Friday said his conduct struck \"at the heart of public trust in the legal profession and the justice system\".\n\n\"It is essential that your sentence reflects not only the gravity of your offending, but that it sends a clear and unequivocal message to other legal practitioners, and the broader community, that such breaches of trust will attract serious consequences,\" she said.\n\nJustice Incerti noted some mitigating circumstances for Hadjina, including a report from a forensic psychiatrist that diagnosed him with major depressive disorder, generalised anxiety disorder, opioid use disorder and gambling disorder.\n\n\"I am prepared to accept that your mental impairment reduces your moral culpability for the offending,\" Justice Incerti said.\n\n\"I repeat, however, that the extent to which it does so must be limited.\"\n\nJustice Incerti also ordered Hadjina no longer be able to practice law — a punishment she said affected his sentence.\n\n\"I consider that the loss of your career, the salutary effect of your incarceration, and the significant impact on your family, means there is no realistic prospect of you reoffending,\" she said.\n\n\"The loss of your career is a matter I must take into account as a kind of ancillary punishment.\n\n\"However, it is your misconduct in that very profession which has led to the loss of your career, and so again, the weight which that factor carries must be significantly reduced.\"\n\nHadjina was ordered to pay back $481,605 to the Victorian Legal Services Board after it paid that sum and interest back to the woman from its fidelity fund — a pool of money set aside for victims of fraud committed by legal professionals.\n\nHadjina will be eligible for parole after two years and six months' imprisonment.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/maryborough-pool-delays-town-closed-swimming/106095146",
    "title": "Victorian pool shut for third summer running amid $5m repair blowout",
    "publish_date": "Sat, 13 Dec 2025 00:01:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "For the third summer in a row, a landlocked regional Victorian town where summer temperatures can soar above 40 degrees Celsius is without an outdoor pool.\n\nThe cost to rebuild the decaying Maryborough pool has jumped by more than 50 per cent to an estimated $14 million.\n\nThe pool in central Victoria was deemed at \"end of life\" in 2022 by an independent assessor hired by the Central Goldfields Shire Council.\n\nThe assessor recommended the pool be demolished and rebuilt at a cost of $9 million.\n\nFunding included $3 million from the state government, a proposed $1.5 million council loan, and a $4.5 million federal election pledge.\n\nThe community was under the impression that the funds were locked in and a new 50m pool would be built soon.\n\nBut the pool gates remain shut, and the site sits idle.\n\nDuncan Bates is worried local children have nowhere to learn to swim. (ABC News: Sarah Lawrence)\n\nCommunity frustration\n\nAbout 8,000 people live in Maryborough.\n\nWith the town pool closed, residents have to travel an hour to access the nearest Olympic-sized pools at Ballarat or Bendigo.\n\nThe closest beach is two hours' drive away.\n\nMaryborough Swimming Club president Duncan Bates said the pool closure meant children were missing out on vital swimming lessons at a time when drownings in Victoria were on the rise.\n\n\"We have nowhere suitable to train, we can swim in the 25 metre indoor pool, but it's very shallow so we can't dive in it,\" he said.\n\n\"My concern is people won't stop going to the beach or stop fishing from boats, or messing around in reservoirs or creeks, because they will have never fallen into cold water or gone into deep water because our nearest pool is 3 foot (90cm) deep and nice and warm.\n\n\"It's been a very frustrating process. The community is devastated they don't have a pool over the summer.\"\n\nCentral Goldfields Shire CEO Peter Harriott said the initial estimates were likely incorrect due to the complexity of the site, heritage considerations, and rapidly increasing construction costs.\n\n\"It's really until you've got detailed designs that you can [have] good confidence in the estimates that you've got in front of you,\" he said.\n\nPeter Harriott says the Central Goldfields council is already carrying too much debt. (ABC News: Sarah Lawrence)\n\nPolitical football\n\nMaryborough sits in the Victorian electorate of Ripon, a seat that will be highly contested in next year's state election.\n\n\"I thought this issue was done and dusted and we got the full amount to get the outdoor pool back this year,\" sitting Labor MP Martha Haylett said.\n\n\"I hope to sit down with Peter [Harriot] and go through line by line what this $5 million extra is due to.\"\n\nMaryborough is not the only regional Victorian town where the pool remains shut.\n\nA rebuild of the 25m outdoor pool at Maryborough will start in the second half of next year. (ABC News: Sarah Lawrence)\n\nSouth-east of Bendigo, the Heathcote swimming pool has been closed since last summer after swimmers started to receive minor \"electric shocks\".\n\nAt Rochester, the Campaspe Shire Council needs $8 million to rebuild the town's pool after it was destroyed in the October 2022 floods.\n\nMonash University lecturer in urban planning, Liz Taylor, said Australia's vast network of ageing outdoor pools represented a cost liability that many councils simply could not meet.\n\nBut Dr Taylor, who also chairs the pool committee in her regional town of Elmore, said pools were crucial \"community third places\" to promote social connection, swimming skills and fitness in the post-COVID era.\n\n\"Building local pools is a way of keeping people safer, to learn and practise swimming,\" she said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/public-housing-residents-in-roebourne-swelter-through-heatwave/106129428",
    "title": "Public housing with no aircon leaves Roebourne locals holding the hose",
    "publish_date": "Fri, 12 Dec 2025 23:06:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "In the first week of summer, the Pilbara community of Roebourne has already endured a severe seven-day heatwave in which the mercury peaked at 46.8 degrees Celsius.\n\nThe town of about 1,000 is one of the oldest communities in Western Australia's north.\n\nChildren and elders are among the most vulnerable during heatwaves in towns such as Roebourne. (ABC Pilbara: Kelsey Reid)\n\nA number of the homes are public housing, and many of them do not have air conditioning.\n\nFor hours each day, Koori and Nyoongar mother Jodie Forbs-Price hoses down her four-year-old son Oliver on the trampoline in their front yard.\n\nWith no air conditioning in their state home, it is often cooler outside than in.\n\nJodie lives in public housing with her son Oliver, four, and says the heat can get to be too much. (ABC News: Kelsey Reid)\n\n\"I do love Roebourne, so that's why we do stay, but the heat does get too much,\" Ms Forbs-Price said.\n\n\"It's good country, just hot weather.\"\n\nThere are 680 public housing properties in the City of Karratha local government area.\n\nOliver's mum sprays a hose to keep him cool on hot days. (ABC Pilbara: Kelsey Reid)\n\nAs of October 31, the average waiting time for public housing in Roebourne was 117 weeks. Those on the priority list waited 57 weeks.\n\nThe Department of Communities said all housing built in the north-west after 1990 included ceiling fans, air conditioning apertures and insulation, but many homes in Roebourne pre-dated that.\n\nThe department said residents in older homes, such as Ms Forbs-Price, could purchase air conditioning at their own cost with approval.\n\nThose living with a disability or medical condition could apply for air conditioning.\n\nOliver keeps cool in the midday Roebourne heat. (ABC Pilbara: Kelsey Reid)\n\nMs Forbs-Price said she received $700 a fortnight from Centrelink after her rent and some bills were taken out.\n\nThe cost to buy and install an air conditioning system was out of financial reach for her and others in the community.\n\nMs Forbs-Price relies on a 20-centimetre box fan, ice-blocks, wet towels, and visits to the pool.\n\nA spokesperson for the Department of Housing and Works said homes were built above minimum standards and made \"thermally comfortable and sustainable in terms of costs for tenants to maintain\".\n\nRoebourne hit a high of 46.8C in the first week of December. (ABC Pilbara: Kelsey Reid)\n\nThe hot time\n\nIt is an issue Yindjibarndielder Lyn Cheedy knows very well.\n\n\"You step out of your house, it's like somebody's there waiting to turn the blow-dryer on hot setting,\" she said.\n\nMs Cheedy recalled the measures she used to keep her children cool as they were growing up.\n\nLyn Cheedy has seen people hospitalised and with severe illnesses brought on by the heat. (ABC Pilbara: Kelsey Reid)\n\n\"One of the things I'd do, I'd get a sheet, wring it out, but still have a little bit of water in it, then I would cover my children over like that, and it was like an aircon for them,\" she said.\n\nMs Cheedy said Housing Minister John Carey would not handle a summer night in Roebourne without cooling.\n\n\"We might have to call an ambulance for him,\" she said.\n\n\" His reaction would be, 'Oh shit, this is what these people have to put up with year round. \"\n\nTemperatures in Roebourne tend to be 5C warmer than coastal Pilbara towns. (ABC Pilbara: Kelsey Reid)\n\nA spokesperson for the minister said older houses were not the focus of the state government.\n\n\"The Department of Housing and Works' focus for new builds is to improve the comfort of tenants without adding to their ongoing costs,\" they said.\n\n\"As such, additions including high ceilings, ceiling fans, and improved insulation are provided.\n\n\"The minister regularly travels to regional WA and remote communities to meet with stakeholders, including Roebourne, earlier this year.\"\n\nSean-Paul Stephens says it is well established that there are more deaths in the community during the warmer months. (ABC Pilbara: Kelsey Reid)\n\nThe bad luck time\n\nNgarluma Yindjibarndi Foundation chief executive Sean-Paul Stephens said it was well established in the community that there were more deaths over summer.\n\n\"It's sometimes the 'bad luck time', people will call it in English, and it's well known that those in the most vulnerable cohorts of children, elders — there is increased mortality at this time,\" he said.\n\nA temperature of 50.5C was recorded at Roebourne Airpoort in January 2022. (ABC Pilbara: Kelsey Reid)\n\nA 2025 study from Monash Uni attributed 34 deaths in WA to heatwaves between 2016 and 2019, but that did not include deaths from other illnesses exacerbated by the heat.\n\nWith Roebourne patients often transferred to Karratha or Perth for treatment, death is recorded elsewhere, resulting in skewed data that does not reflect actual mortality in the region.\n\nA dog enjoys a reprieve in the shade from the searing heat in Roebourne this week. (ABC Pilbara: Kelsey Reid)\n\nMr Stephens said First Nations people in the region experienced cyclical disadvantage.\n\n\"It's almost impossible for a community to exit this entrenched disadvantage if you don't even have your basic needs met — you can't even live in a house that has climate control when it wasn't your choice to be in that house in the first place,\" he said.\n\nAppropriate cooling has been an often talked about issue in the town, which has reached 50.5C previously, with the nearby Roebourne Regional Prison only fitted with air conditioning in July this year.\n\nThe facility was built in 1984.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/what-is-the-eu-reparation-loan-plan-for-ukraine/106138652",
    "title": "The EU wants to use frozen Russian assets to fund Ukraine. What are the risks?",
    "publish_date": "Fri, 12 Dec 2025 23:00:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "The European Union wants to enter uncharted legal territory using billions in Russian assets to fund the Ukrainian economy.\n\nIts proposed \"reparations loan\" for Ukraine would see frozen Russian assets used to prop up Kyiv's ailing economy amid Moscow's invasion.\n\nThe commission argues that the war has imposed heavy costs by hiking energy prices and stunting economic growth in the EU, which has already provided nearly 200 billion euros ($353 billion) in support to Ukraine.\n\nBut it has not been done before, making the outcome of any legal claims difficult to predict, according to experts.\n\nHere's what we know about the proposal, when it will be discussed, and the positions of the key players.\n\nWhat is the EU's plan?\n\nWestern powers immobilised Russia's sovereign assets soon after Russia launched its full-scale invasion of Ukraine in 2022.\n\nOf the 300 billion euros ($350 billion) in Russian assets, about 210 billion euros are in Europe, mostly in Belgium, where they are held by central securities depository Euroclear.\n\nEU leaders met with Ukrainian President Volodymyr Zelenskyy in London on December 8.\n\nThese sanctions previously had to be renewed every six months with the approval of all 27 member countries, but on Friday the EU voted to indefinitely freeze Russia’s assets in Europe.\n\nThis ensures Moscow-friendly governments, such as Hungary and Slovakia can't block the sanctions rollover and allow Russia to use the assets.\n\nEU Council President António Costa said European leaders had committed in October \"to keep Russian assets immobilised until Russia ends its war of aggression against Ukraine and compensates for the damage caused\".\n\nEU Council President António Costa says the next step is \"securing Ukraine's financial needs for 2026–27\".\n\nThe EU now plans to use the frozen Russian cash to extend a loan of up to 165 billion euros to Ukraine to cover its military and civilian budget needs in 2026 and 2027.\n\n\"Next step: securing Ukraine's financial needs for 2026–27,\" added Mr Costa.\n\nThe loan would be paid back by Ukraine only when Russia pays Kyiv war damages, making the loan effectively a grant that advances future Russian reparations payments.\n\nWhen will the loan be voted on?\n\nA vote on the proposal was expected at the EU on Friday afternoon in Brussels, but Belgium, Italy, Malta and Bulgaria argued the decision should be made at next week's EU summit.\n\nEU leaders are now set to meet on December 18 to finalise the details of the reparations loan.\n\nEU proposes using frozen Russian assets to fund Ukraine Belgium is pushing back on a European proposal to use frozen Russian assets to help financially support Ukraine.\n\nThey plan to resolve remaining problems, which include guarantees from all EU governments for Belgium that it would not be left alone to foot the bill should a potential Moscow lawsuit prove successful.\n\nEuropean Commissioner for Economy Valdis Dombrovskis said solid guarantees were being put together for Belgium.\n\nBefore that, Ukrainian President Volodymyr Zelenskyy will visit Berlin for talks with German Chancellor Friedrich Merz on Monday, with further European, EU and NATO leaders joining them later, the German government said.\n\nHow has Russia reacted?\n\nRussia has said any plan to freeze its assets would be illegal, and it would fight any plan.\n\nRussia's central bank has already launched legal action against Euroclear, a Brussels-based financial institution, which holds a large amount of Moscow's assets.\n\nThey are arguing in a Moscow court that Euroclear undertook damaging actions, which had affected its ability to dispose of its funds and securities.\n\nRussian President Vladimir Putin led a full-scale invasion of Ukraine in February 2022. (Reuters: Sergei Ilnitsky)\n\nEuroclear has been subject to Russian lawsuits in Moscow courts since the EU froze the assets in 2022.\n\nIn a statement, the central bank described wider EU plans to use Russian assets to aid Ukraine as \"illegal, contrary to international law,\" arguing that they violated \"the principles of sovereign immunity of assets\".\n\nBut economy commissioner Dombrovskis brushed off the suit, saying that the decision is \"legally robust,\" and that he expects Russia \"to continue to launch speculative legal proceedings to prevent the EU from upholding international law\".\n\nWho else might challenge a 'reparation loan'?\n\nHungary, Slovakia and Belgium could also challenge such a loan.\n\nHungary and Slovakia oppose providing more support to Ukraine, but Friday's decision prevents them from blocking the sanctions rollover and makes it easier to use the assets.\n\nLoading...\n\nHungarian Prime Minister Viktor Orbán said on social media that it meant that \"the rule of law in the European Union comes to an end, and Europe's leaders are placing themselves above the rules\".\n\n\"The European Commission is systematically raping European law. It is doing this in order to continue the war in Ukraine, a war that clearly isn't winnable,\" he wrote.\n\nHe said that Hungary \"will do everything in its power to restore a lawful order\".\n\nHungarian Prime Minister Viktor Orbán is Russian President Vladimir Putin's closest ally in Europe (AP: Alexander Nemenov)\n\nIn a letter to Mr Costa, Slovak Prime Minister Robert Fico said that he would refuse to back any move that \"would include covering Ukraine's military expenses for the coming years\".\n\nHe warned \"that the use of frozen Russian assets could directly jeopardise US peace efforts, which directly count on the use of these resources for the reconstruction of Ukraine\".\n\nBelgium, where Euroclear is based, is also opposed to the \"reparations loan\" plan.\n\nIt says that the plan \"entails consequential economic, financial and legal risks,\" and has called on other EU countries to share the risk.\n\nBelgium's Prime Minister Bart De Wever, Hungary's Prime Minister Viktor Orban and Slovakia's Prime Minister Robert Fico, will discuss the reparations plan next week. (AP: Geert Vanden Wijngaert)\n\nBelgium's Prime Minister Bart de Wever says he fears being \"buried in litigation\".\n\nHe has repeatedly expressed concern that Brussels may be left on the hook to repay Russia in the event of a successful claim and wants all EU countries to participate.\n\nTo spread the risk of Russian retaliation, Belgium also wants other G7 countries holding Russian sovereign assets, such as Britain, Canada and Japan, to replicate the EU scheme.\n\nReuters/AP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/record-gold-prices-drive-investment-in-exploration-australia/106121424",
    "title": "Record gold prices drive Australian exploration boom",
    "publish_date": "Fri, 12 Dec 2025 22:33:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "Mick Shorter first came to Australia's gold mining capital of Kalgoorlie-Boulder as a teenager looking for a job.\n\nThe week before his 18th birthday, he started labouring as a driller's offsider.\n\nDecades later, puffing on a cigarette while working the controls of a drill rig, he is at the coalface of a modern-day gold rush.\n\n\"I like it because you're out in the bush, you're playing in the mud,\" he said.\n\n\"It's like you're a little kid. I never grew up.\"\n\nMick Shorter behind the controls of a drill rig. (ABC Goldfields: Jarrod Lucas)\n\nJust 25 kilometres east of Kalgoorlie's Super Pit gold mine, Mr Shorter and two young offsiders are drilling for riches that have made WA's Goldfields region famous around the globe since the 1890s gold rush.\n\nWith the metal trading near record highs, surpassing $6,000 an ounce in Aussie dollar terms for the first time in October, it is no surprise that gold exploration has surged 45 per cent in the past year.\n\nAccording to the Australian Bureau of Statistics (ABS), $431 million was spent on gold exploration in the September quarter, up from $297 million a year ago.\n\nA drill rig tests for gold beneath the surface. (ABC Goldfields: Jarrod Lucas)\n\nAs more capital flows to junior exploration companies in the hunt for gold, Mr Shorter said the drilling industry was facing labour shortages, especially for experienced drillers.\n\n\"It's exciting times for Kalgoorlie … it's been pretty busy, and it's getting busier,\" he said.\n\n\"Because there's so much work on at the moment, there's a shortage of workers, but there's also a shortage of drillers because there haven't been so many come through the ranks over the years.\"\n\nRoadside signs point to the location of working drilling rigs. (ABC Goldfields: Jarrod Lucas)\n\nFinding the golden goose\n\nWhile Mr Shorter has spent the past 30 years drilling for gold and other minerals, he has never actually seen the yellow metal.\n\n\"Thirty years I've been doing this, and I've never seen any gold,\" he said.\n\n\"It's obviously there, but I've never seen it in any samples.\n\n\"You can tell what sort of rocks are good, that might host them [gold deposits], so when you find quartz and stuff, yeah, you're pretty happy.\"\n\nLoading...\n\nIn most cases, gold is not visible to the human eye and requires scientific analysis in an assay laboratory.\n\nEdward Mead, a veteran geologist and director of ASX-listed gold explorer Riversgold, said the results were crucial for planning the next phases of exploration, or more simply \"where we put the next drill hole\".\n\n\"Six months ago, getting assays through the local laboratory would take 10 to 14 days. Now that's out to five to six weeks,\" he said.\n\n\"So if assay labs are an indication of how the industry is going, then absolutely, there has been an uptick in activity.\"\n\nEdward Mead and David Lenigas from Riversgold at the company's Northern Zone project. (ABC Goldfields: Jarrod Lucas)\n\nCash flows to gold\n\nIt has been a remarkable year for gold. The London-based World Gold Council tracks the metal's trade and says there have been more than 50 all-time price highs set.\n\nThe rapid rise helped drive investment in Australia's mineral exploration sector overall in the September quarter, with $3.49 billion representing the strongest quarter since tracking began in 2013.\n\nDrilling samples are sent off to laboratories for testing. (ABC Goldfields: Jarrod Lucas)\n\nBDO Australia's global leader for natural resources, Sherif Andrawes, said gold attracted the lion's share, with 21 ASX-listed gold exploration companies raising a combined $552 million.\n\n\"The gold price is strong and has been for a while now, and I think most people believe it will remain strong for some time,\" he said.\n\n\"Mines of the future take a long time to develop, we're talking 10 to 15 years, so when money isn't coming into the exploration sector, that just puts those mines further away.\n\n\"The more money spent on exploration, the more likely they are to find something, so it's a healthy sign for the industry.\"\n\nGold from the Devon mine is poured at Coolgardie's Greenfields Mill. (ABC Goldfields: Jarrod Lucas)\n\nRecord gold prices have resulted in increased profitability for existing producers and old mines have suddenly become viable again.\n\nIn the case of the Devon mine, near Laverton in WA's northern Goldfields, trucking ore 283km from the mine to Coolgardie's Greenfields Mill for processing has become an economic proposition.\n\nMatsa Resources executive chairman Paul Poli said this year's price surge was \"beyond anyone's wildest dreams\".\n\n\"The increase in the gold price has brought the Goldfields alive,\" he said.\n\nPaul Poli holds the first gold bar produced at the company's Devon mine. (ABC Goldfields: Jarrod Lucas)\n\n\"When we first contemplated putting Devon into production, we were working on a gold price of $3,500 an ounce.\n\n\"It doesn't get any better than this ... people are predicting $10,000 an ounce in the future. Are we going to see that? God knows.\n\n\"But where we are today has meant an abundant amount of employment opportunities, a huge amount of new gold production, and Devon is just a classic example of that.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/tim-tszyu-camp-accused-of-sabotaging-opponent-anthony-velazquez/106139156",
    "title": "Tszyu camp accused of sabotage and 'cancelling' opponent's flight",
    "publish_date": "Fri, 12 Dec 2025 22:25:07 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tim Tszyu's camp has been sensationally accused of sabotaging opponent Anthony Velazquez's preparations for the Australian superstar's do-or-die boxing showdown.\n\nVelazquez (18-1-0, 15KOs) finally arrived on Australian shores on Friday, giving the undefeated American powerhouse less than a week to prepare for next Wednesday night's fight in Sydney.\n\nFollow all the action from Tszyu vs Velazquez in the ABC Sport live blog on Wednesday from 7:00pm AEDT\n\nDue to arrive last Wednesday, it is understood Velazquez was blocked from leaving Los Angeles because the name on his booking didn't match his passport.\n\nWell aware of Tszyu's quest for redemption after three losses in his past four bouts, coach Hector Bermudez claimed No Limit Boxing promoters had interfered with Velazquez's departure from the US.\n\nVelazquez and Bermudez went straight from the airport on Friday to front a Sydney press conference ahead of next week's match-up at TikTok Entertainment Centre.\n\nAsked what had happened at LA International Airport, the undefeated super-middleweight remained tight-lipped.\n\n\"Whatever happened, hey, we're here now,\" Velazquez said.\n\n\"They cancelled the flight. I don't know what reason why they cancelled it.\"\n\nBermudez added: \"It was probably the promotion, or some type of strategy from the promoters.\n\n\"They want to get my man tired, unfocused.\n\n\"He's a young boy. The only thing that can get him unfocused is that ugly face right there [Tszyu].\"\n\nAnthony Velazquez will fight Tim Tszyu in Sydney next Wednesday. (AAP Image: Mick Tsikas)\n\nEven by boxing standards, the allegation is a low blow to the Tszyu camp.\n\n\"I just know that they picked the wrong fighter [to mess with],\" Bermudez said.\n\n\"I know that when you're trying to rebuild a fighter, you don't pick a puncher.\n\n\" I know my boy is ready to fight. Tim Tszyu is ready to retire. We're going to help him out. \"\n\nTszyu (25-3, 18KOs) is desperate to return to the ring to restore his battered international reputation and start climbing the ranks again.\n\nAll three defeats were world-title bouts in America, leading to Tszyu seeking new guidance from trainer Pedro Diaz.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe 31-year-old had undergone an intense two-month camp in Miami training under Diaz.\n\nBermudez also had a dig at Diaz, who is expected to arrive a day before Tszyu's career make-or-break showdown.\n\n\"Pedro Diaz is probably a really, really good amateur coach,\" Bermudez said.\n\n\"He has a lot of knowledge about boxing. He always gets hired and then gets fired. That's his career.\n\n\"Switching trainers is probably a detriment to his [Tszyu] career right now.\n\n\"No way you can develop chemistry that quick with someone. Someone's style is built through their career.\n\n\"The ring is going to expose every instinct that you have. Instincts are built throughout time with whatever trainer he had before.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-12-13/farming-brothers-turn-love-of-fishing-into-commercial-operation/106131052",
    "title": "Farming brothers turn 'gone fishing' into business plan",
    "publish_date": "Fri, 12 Dec 2025 22:21:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "When brothers Adam and Josh Oldano are not busy working on the family cane and papaya farm in Far North Queensland, they are out on the boat casting a line.\n\nBut it does not mean they are not working hard as primary producers.\n\n\"We just honestly love being on the water,\" Josh said.\n\n\"We decided to turn it into an operation and target a few fish to sell commercially. It's going alright.\"\n\nLoading...\n\nThe Innisfail men said they gained their commercial fishing licence about five years ago.\n\n\"I rang [Adam] and said, 'We've got a licence, let's do it,' and he said, 'Alright, sounds fun,'\" Josh said.\n\n\"It's taken five years to build it up to where it is now that it's feasible.\"\n\nNow they supply line-caught fish to local markets and a retail outlet on the Gold Coast.\n\nThe brothers go fishing whenever they can get spare time. (Supplied: Josh Oldano)\n\nThey said they target mostly red fish like red emperor and some trout and aim to bring back roughly 50 fish from each trip offshore.\n\nAdam said they had seen an increase in demand.\n\n\"[We've seen] strong demand, really. They're always chasing fresh north Queensland line caught,\" Adam said.\n\n\"Quota is a very big thing with us, you've got the quota, you've got to fill it,\" Josh said.\n\n\"Our goal is always 50 fish, and we'll look to build on it and build on it greatly if the quota is available.\"\n\nThe brothers said their fishing business acted as a financial backstop for the farming operation, if things were to go awry with weather and wipe out the crops.\n\nAdam and Josh Oldano aim to bring home 50 fish each trip. (Suppleid: Josh Oldano)\n\nBalancing farming and fishing\n\nFinding time to go fishing while farming full time was not easy, but the brothers said it was something they had done for years, although they described the balance as \"interesting\".\n\n\"The farm always takes priority, but when there are little gaps and the stars align, we go fishing,\" Josh said.\n\nDeciding to take their fishing adventures to the next level and go commercial started with many conversations.\n\nWhen they acquired the licence, the decision was made.\n\nThe brothers obtained their commercial fishing licence about five years ago. (Supplied: Josh Oldano)\n\nOften going out for a night or two, they set up their line-catching system, which sometimes does involve using a rod and reel, along with their big eskies ready to bring home the fish.\n\n\"We're specifically line fishing, so one to two hooks on quite a heavy leader, we're using winches obviously for various reasons. [We] get the fish up quick and on the ice,\" Josh said.\n\n\"We're much more streamlined now, we've obviously learned a lot along the way … we're continually learning. We don't stop.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/australia-vs-the-world-the-valley-pool/106139000",
    "title": "'People are looking for this': Swimming's revolution begins with pumping night at The Valley",
    "publish_date": "Fri, 12 Dec 2025 22:09:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "It would be easy to be dismissive of the events that took place at Brisbane's Valley Pool on Friday night.\n\nIn fact, so much of it will have been completely alien to anyone who has watched competitive swimming before — not least the music blaring out from a DJ set up on pool deck.\n\nMystery medleys. Fans voting for start orders in relays. Powerplays.\n\nGimmicky? Yeah, maybe.\n\nHugely entertaining? Absolutely.\n\nBilled as swimming's foray into the T20 sporting entertainment world, fans were treated to a spectacle of epic proportions in Brisbane, as some of swimming's biggest names danced and laughed their way through an innovative program of events.\n\nThe format was designed to thrust the sport into the entertainment space as much as to sharpen the swimmers' competitive instincts.\n\nNot many swim meets have a DJ on pool deck pumping out tunes all night. (Supplied: Swimming Australia/Delly Carr)\n\nTaking the competition out of one of the traditional pools no doubt helped too.\n\nThe Valley Pool's more intimate setting amongst the palm trees and high-rises added an enthusiasm that not even the squalls of rain that swept across the pool could dispel.\n\nAnd as much as the athletes enjoyed themselves on pool deck, any notion that this was just a meaningless kick about was quashed in the very first event.\n\nA fans' choice mixed 4x50m relay, that saw teams named and then supporters decide whether it was to be a straight 4x50m freestyle relay or in medley order — the vote was for a medley — saw Cam McEvoy mowing down Dutch world champion Marrit Steenbergen, making up at least a 10-metre deficit, to get the 1,000-plus supporters up on their feet from the outset.\n\nThe swimmers were enjoying the festival atmosphere as much as the punters. (Supplied: Swimming Australia/Delly Carr)\n\n\"Trust me, these athletes are nervous — they want to perform,\" Dolphins head coach Rohan Taylor told ABC Sport on pool deck, almost shouting over the pumping music and air horn that signified the taking of a power play.\n\n\"By having the novelty events you're taking away the certainty of their normal structure.\n\n\"You're putting the athlete in an unfamiliar space. They're usually process-driven, really methodical. This is just tearing it away from them.\n\n\"You don't know what's going to happen. Look at that first relay. Who'd have thought Cam would go 20.2 and swim over the top. And all of a sudden it lifted the crowd up.\"\n\nCam McEvoy's superb final leg in the mixed 4x50 relay opened the competition with a bang. (Getty Images: Chris Hyde)\n\nThis is not a new idea.\n\nSkins races have long been a part of training events, ever since the Qantas Skins event in Sydney in 1996, with the short-lived International Swimming League also playing around with the format as a way to shake up the perceived monotony and staleness of traditional swimming competitions.\n\n\"It's always been in my head,\" Taylor said of the format.\n\n\"I just looked at the past and said, what sort of things worked really well and how do I pull them all together, ultimately with the aim of getting the fans to feel like they're a part of it, bringing them in close, letting them vote on things.\"\n\nTaylor said they presented the format to Channel Nine last year to show that it could work and, with a couple of tweaks, the Australia vs The World format was born.\n\nAnd yes, there is a degree of gimmick about it.\n\nBut as Taylor said, the swimmers were fully into the competition aspect of the events.\n\nAnd the coaches were fully invested too. Dean Boxall hit the Australian team's powerplay button with all the theatricality and enthusiasm of one of his beloved mid-90s wrestlers.\n\nEffusive showman Dean Boxall was in his element. (Getty Images: Chris Hyde)\n\nIt was sporting entertainment at its very best.\n\n\"It's awesome,\" sprint king Cam McEvoy said.\n\n\"I think it's definitely somewhere the sport is trending.\n\n\"As someone who's been around for a long time now, seeing freshness within the competition landscape is really exciting. It's cool that Australia is taking the first step forward with this.\"\n\nCam McEvoy is a staunch advocate for the format. (Supplied: Swimming Australia/Delly Carr)\n\nMcEvoy, no stranger to innovation with his training methods, said that Swimming Australia should not stop at this, adding more competitions around the country to make a series out of the format.\n\nAnd he said that there was clearly an appetite for it among swimmers.\n\n\"Getting the team that they have for the world team to come out this way for this time of year is impressive, and I think the calibre of who have come out for it shows that the format is needed, people are looking for this within the sport,\" McEvoy said.\n\n\"You could make a full series out of it, you could have teams … I think the world would get around it.\n\n\"For Australia to be the ground zero for unearthing that and putting that out in the world of swimming is really exciting.\"\n\nSwimmers watch the mystery medley, where every swimmer swam the four strokes in a different order, with interest. (ABC Sport: Simon Smale)\n\nGetting competitors to come to Australia was not a problem.\n\nSwimmers from 11 countries made up the 24-strong international team: from New Zealanders like world champion Erika Fairweather, Brits like Olympic champions Duncan Scott and Tom Dean, Dutch world champion Marrit Steenbergen and Egyptian star Abdelrahman Elaraby.\n\nNone needed second invitations.\n\n\"Not a lot, in all honesty,\" Elaraby told ABC Sport when asked how much incentive he needed to fly out for the event.\n\n\"It's really good for the sport.\n\n\"It's the newest thing we have right now — it's great fun to watch. I really hope it does its job around the world.\"\n\nA packed crowd enjoyed the competition immensely. (Supplied: Swimming Australia/Delly Carr)\n\nAnd the Aussie athletes loved it too.\n\n\"It's fun doing it in a different format,\" Lani Pallister, who swam in a 400m event where the leader after each 100 earned points, as well as for the overall win, told ABC Sport.\n\n\"I think this is more about racing and getting points for the team. For me, it's more fun cheering for the rest of Australia and getting the win as a group.\n\n\"It's been so much fun. Everyone is staying in the same hotel and hanging out for the past few days, it's been really cool.\n\n\"I think it gives us an opportunity to race for the sake of racing, it's almost like a training event for us.\"\n\nPallister who, when time allows, also competes in surf-lifesaving events, said it was great to see swimming take some of those lessons on board.\n\nThe crowd of over 1,000 people were into it at poolside. (Supplied: Swimming Australia/Delly Carr)\n\n\"I think surf lifesaving does an incredible job of making it a show and making it a broadcast,\" Pallister said.\n\n\"It's cool that swimming has taken this concept on board, where there are more variables involved too.\"\n\nNew Zealand's former 400m world champion Fairweather, who underlined her commitment to competing by essentially flying in and out for the event, said she would never miss the chance to compete and was enthused by the format.\n\n\"I think it's an exciting meet for spectators, but it's also exciting for us,\" she said.\n\n\"I love any high-quality racing I can get close to home … anything I can get close to New Zealand is good for me.\"\n\nMeg Harris and Sam Short celebrate as Australia beat The World 131-105, but swimming was the real winner.\n\nThe day before the event, Kaylee McKeown told ABC Sport that although swimmers are hugely popular in Australia, staying in the public eye would allow their sizeable achievements to be recognised even more.\n\n\"We're trying to take it in a new avenue,\" she said.\n\n\"There's not really anything like this that's going on in the world at the moment.\n\n\"I'm excited to see what this has in store for the swimmers … especially leading into Brisbane 2032, it's so important to get a home crowd invested in the sport of swimming.\n\n\"I think we go really unrecognised, seeing as we bring in the most amount of medals.\n\n\"I think with more investing in these types of things and just being in the public eye is going to be really good for us across the board.\"\n\nKaylee McKeown embraced the competitive side of the event. (Getty Images: Chris Hyde)\n\nThe packed stands and fully invested crowd suggests that swimming is not going to lose its popularity any time soon — especially with such an impressive group of athletes leading from the front.\n\nBut Taylor noted that it was better to be striking from a position of strength rather than being left chasing the eight ball.\n\n\"I think we're in a good place [as a sport],\" Taylor said.\n\n\"We've got some really high-profile athletes at the moment, the sport has been going really well. So let's take advantage of it.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-12-13/flower-growers-concerned-glyphosate-import-rule-change/106125000",
    "title": "Flower growers see red over glyphosate import rule change",
    "publish_date": "Fri, 12 Dec 2025 21:50:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia last year imported $76 million worth of cut flowers, accounting for half of those sold across the country.\n\nBefore they are freighted from countries including Kenya, Ecuador and Colombia, the stems are soaked in herbicide glyphosate.\n\nThe process, called devitalisation, prevents propagation of flowers and helps prevent the spread of pests and diseases.\n\nAfter an eight-year evaluation, the Australian Department of Agriculture, Fisheries, and Forestry (DAFF) has decided the post-harvest treatment is no longer needed.\n\nFifteen types of imported flowers and foliage are dipped in glyphosate before arriving in Australia. (ABC Rural: Lucy Cooper)\n\nAs part of the review, the department examined whether the practice of soaking stems in weedkiller was scientifically justified.\n\nIt also looked at import conditions to see if they met Australia's World Trade Organisation (WTO) obligations.\n\nA draft report said the risk of propagation and biosecurity issues without the treatment was low.\n\nAbout 15 types of flowers and foliage are treated, including roses and carnations.\n\nAt an online industry briefing in November, DAFF representatives told growers there were no documented cases of individuals propagating cut flower imports commercially in Australia.\n\nThey also said a review of global online garden forum posts on social media platform Reddit showed \"very low prevalence of this activity\" by home gardeners.\n\nAnna Jabour is concerned the changes will affect the agriculture industry. (Supplied: Anna Jabour)\n\nBut local flower growers argue that it just shows that the devitalisation policy has been a deterrent.\n\nFlower Industry Australia chief executive Anna Jabour said she was worried that scrapping the practice would have biosecurity implications.\n\n\"The department has not done adequate testing on what the impact of removing glyphosate will be for the broader agriculture sector,\" she said.\n\n\"This will impact table grapes, wine and olives.\"\n\nWhy are flower growers worried?\n\nImported flowers have some of the highest insect interceptions upon arrival in the country.\n\nNikki Davey says florists often find pests in imported produce. (ABC Rural: Jane McNaughton)\n\nVictorian flower grower Nikki Davey said there were plenty of flowers undetected by quarantine officers.\n\n\"It's not uncommon to hear florists talk about opening or unwrapping a bunch of flowers and having a pest fly out,\" she said.\n\n\"It's about us understanding the risks with being dependent on those high volumes of imported flowers.\"\n\nIn recent years flower imports have been behind the introduction of several pests into Australia, including serpentine leafminer, western flower thrip, and Russian wheat aphid.\n\nThe tiny Russian wheat aphid can cause significant losses in cereal crops. (ABC Rural: James Jooste)\n\nBut the biggest pest threat to Australia is the bacteria xylella.\n\nAustralia is one of the few countries free of the pathogen, which is spread by infected plant material and insects and has the potential to affect up to 600 plant species.\n\n\"Once it's established, there is no cure,\" Ms Jabour said.\n\n\"It's caused billions of dollars in changed landscapes permanently where it has impacted countries.\n\n\"The department is removing this [devitalisation] requirement and they're focusing on how it limits propagation, but they haven't done the biosecurity risk analysis adequately.\"\n\nThe government plans to stop the practice of devitalisation. (ABC News: Tyne Logan)\n\nFlower import review\n\nAustralia and New Zealand are the only countries that have required devitalisation of imported cut flowers and foliage.\n\nNew Zealand opted to ditch it in November this year, a move which also attracted backlash from its local flower growers.\n\nA DAFF spokesperson said: \"The Australian government will never compromise on biosecurity.\"\n\n\"The draft pest risk analysis identifies that biosecurity risks associated with diversion from intended use achieves Australia's appropriate level of protection,\" the spokesperson said.\n\n\"Therefore, phytosanitary measures are not required.\"\n\nFlowers grown in Kenya are sold by Australian florists. (Foreign Correspondent: Isabella Higgins)\n\nThe body representing the country's nursery operators, Greenlife Industry Australia (GIA), said it wanted to see more evidence to support the government's decision.\n\n\"Australia works very hard to protect the fragile nature of the land where we grow things and to really manage the risk of pests, diseases and weeds,\" chief executive Joanna Cave said.\n\n\"So it's a real shame to chip a hole in that armour on the basis of no evidence, as far as we can see.\"\n\nJoanna Cave says the labelling of flower products is more important than ever. (Supplied: Greenlife Industry Australia)\n\nMs Jabour said the mandatory country-of-origin labelling of flowers had never been more relevant.\n\n\"If you're going to dismantle the policy, you'll need to bring in labelling requirements that clearly states 'do not propagate,'\" she said.\n\nPublic submissions on the draft report into the review of the devitalisation of cut flowers close in February next year.\n\nDAFF said it would continue its broader pest risk analysis of imported cut flowers, focusing on bacteria, viruses and fungi.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/counterfeit-matcha-is-flooding-the-market-to-meet-demand/106115334",
    "title": "The battle to trademark matcha as counterfeits from outside Japan rise",
    "publish_date": "Fri, 12 Dec 2025 21:20:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "On the surface, the can of matcha appears genuine, bearing the famous brand name Isuzu along with other product specifications.\n\nThe Japanese green tea powder is so popular that the highly acclaimed producer Marukyu Koyamaen has limited sales for each customer to prevent hoarding.\n\nBut Matsatsugu Nonomura, who handles the company's international sales, knows the can he's holding of Isuzu matcha is a copycat.\n\nNot only is the can black, instead of white, but the tea's aroma, colour, and taste is off.\n\n\"Our matcha, Isuzu, has a very beautiful colour and a truly excellent aroma,\" he explains.\n\n\"The counterfeit Chinese matcha has poor colour and aroma.\"\n\nMatcha lattes have increased in popularity, helped by their aesthetic appeal on social feeds. (Wikimedia: Irvan Ary Maulana)\n\nMatcha's popularity has surged over the past couple of years, and Japanese farmers have struggled to meet growing demand.\n\nQuickly bolstering supply is not an option.\n\nGreen tea plants take about five years to grow and the process to make the powder is painstaking, requiring farmers to shade the plants about three weeks before harvest, to boost chlorophyll and amino acids.\n\nAfter harvesting, the leaves are steamed for 10 seconds, air-dried, then ground using traditional stone mills, which produce just 40 grams an hour.\n\nMatcha labelling is almost completely unregulated, and some Japanese producers are worried that unscrupulous producers in China are exploiting the growing demand by offloading inferior tea products mislabelled as Japanese matcha.\n\nWhile anyone can make matcha, these producers claim some of the labelling or packaging they are seeing overseas copy famous Japanese brand names or falsely claim to be from Japanese tea-growing regions.\n\nMatcha is made from the same plant as most tea, Camellia sinensis, but the leaves undergo a unique process. (ABC News: James Oaten)\n\n\"Manufacturers work tirelessly to supply consumers with premium products,\" Mr Nonomura said.\n\n\"Yet these efforts are now being undermined by counterfeit issues.\"\n\nMatcha popularity 'gratifying to see'\n\nMatcha is a highly specialised green tea, with its origins in Japan dating back at least 400 years.\n\nIt recently exploded in popularity on social media, as consumers praised its health benefits, rich umami flavour, and gentler caffeine hit when compared to coffee.\n\nMatcha is a highly specialised green tea with its origins in Japan dating back at least 400 years. (ABC News: James Oaten)\n\nIt's now common in lattes, cakes, and ice creams across cafes worldwide, but it's not the first time demand has boomed.\n\nThe first matcha shortage took place in the 1990s, when ice-cream maker Haagen-Dazs launched its green tea flavour in Japan.\n\nThe industry was hit again when Starbucks started serving matcha lattes in the 2000s.\n\nThe renewed popularity has been a boon for farmers like Jintaro Yamamoto.\n\n\"It's incredibly gratifying to see that Japanese culture, or these enduring historical traditions, are being recognised by people around the world,\" he said.\n\nUji is one of Japan's most prestigious tea growing regions. (ABC News: James Oaten)\n\nMatcha production increased almost threefold from 2010 to 2023.\n\nLast year, when the social media boom began, Japan's green tea exports broke records after rising 25 per cent in a single year.\n\nThis year, those records have been broken again, with matcha sales from January to September exceeding all of 2024.\n\nBut the intense interest has contributed to shortages.\n\n\"It's deeply regrettable that we cannot meet the demands of people around the world,\" Mr Yamamoto said.\n\nGrowing new green tea plants takes about five years. (ABC News: James Oaten)\n\nMany farmers are also unsure if matcha's popularity will be permanent or short-lived.\n\nOne worry is that producing more matcha will hurt supplies of other green tea, which Japanese consumers still love.\n\nProspect of counterfeits spreading\n\nIn Uji, one of Japan's most prestigious tea-growing regions, long queues of tourists form outside matcha outlets, with shelves cleared within hours of opening.\n\nBuying from the source continues to be reliable, but Mr Nonomura has been tracking the rise of misleading distributors online.\n\nMatsatsugu Nonomura handles Isuzu's international sales. (ABC News: James Oaten)\n\nSome Chinese packets of matcha available for purchase copy famous Japanese product names and packaging, while others falsely claim to be from Japanese tea-growing regions like Uji.\n\n\"If consumers buy something believing it to be Uji matcha and find it not nearly as delicious as expected, there is a risk they will stop buying it,\" he said.\n\n\"The prospect of such counterfeits spreading not just in China but worldwide would be extremely damaging to the market.\"\n\nJapan's agriculture department said the rise of counterfeit products had increased with the rise of matcha's popularity, but it was impossible to provide a specific number.\n\nTackling the problem is also difficult.\n\nThe word \"matcha\" cannot be trademarked, but phrases like \"Uji matcha\" can be.\n\nJapan's Ministry of Agriculture pushed to have such trademarks registered overseas and believed it had some success lobbying China to crackdown on misleading products.\n\nMatcha is made from dried and de-veined green tea leaves that are ground into a fine powder. (ABC News: James Oaten)\n\n\"We understand there have been instances, for example, where a Chinese company unrelated to Uji applied to register the trademark 'Uji Matcha' in China,\" said Tomoyuki Kawai, from the ministry's tea division.\n\n\"But the Chinese authorities rejected it.\"\n\nBut he accepted, even if one misleading product is caught, more will appear later.\n\n\"It is true that we can only deal with each case as it arises,\" he said.\n\nMatcha's surging popularity has led to worldwide shortages of the fine powdered tea. (ABC News: James Oaten)\n\nThe relationship between China and Japan is in a downward spiral, after Prime Minister Sanae Takaichi implied Japan would get involved in a conflict over Taiwan.\n\nChina has its own rich history of producing green tea, but matcha originates from Japan.\n\nMr Nonomura said if Chinese producers wanted to make matcha, they must be honest about its branding.\n\n\"China should compete with its own brand names if it claims to have quality products,\" he said.\n\nThe ABC reached out to the China National Intellectual Property Administration and did not get a response.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/lindsey-vonn-wins-world-cup-downhill-aged-41/106138974",
    "title": "US legend Vonn breaks record to claim World Cup win aged 41",
    "publish_date": "Fri, 12 Dec 2025 21:00:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "American great Lindsey Vonn won the opening women's World Cup downhill of the season on Friday to make Alpine ski history at the age of 41 and give her 2026 Olympic comeback hopes a sensational boost.\n\nThe 2010 Olympic downhill champion took the 83rd win of her career — and first since a downhill in Åre, Sweden, in March 2018 — by 0.98 of a second in the Swiss resort of St Moritz.\n\nThe previous oldest World Cup winner was Switzerland's Didier Cuche at 37 in a men's Super-G in 2012. Italy's Federica Brignone was the oldest previous female winner at 34 last season.\n\n\"I knew I was skiing fast but you never know until the first race,\" said Vonn, who retired in 2019 and began her comeback last year, after a tearful telephone call with her father.\n\n\"I was a little faster than I expected. I think I had a great run but I also made some mistakes so I'm excited for tomorrow.\"\n\nVonn has another downhill on Saturday followed by a Super-G on Sunday.\n\nLindsey Vonn's last World Cup victory came in 2018. (Getty Images: Agence Zoom/Mateo Sgambato)\n\nOnly compatriot Mikaela Shiffrin (104) and Swedish great Ingemar Stenmark (86) have won more Alpine World Cup races than Vonn, who can add to her tally before February's Milano-Cortina Games.\n\nStarting 16th on the Corviglia piste in perfect conditions, Vonn was behind after the first two time checks but powered through to cross the line in one minute 29.63 seconds.\n\nCollapsing in the snow at the inflatable safety barrier, the four-times overall World Cup champion got back up and whooped in delight as she thrust her ski poles in the air.\n\nAustrians Magdalena Egger, second from a 27th start and born a year after Vonn made her World Cup debut, and Mirjam Puchner completed the podium.\n\nVonn's return to competitive downhill skiing, the most dangerous of disciplines, after knee surgery had some former rivals questioning her sanity last year but she has turned that to her advantage.\n\n\"All the people who didn't believe in me, I have to thank them, because it gives me a lot of motivation,\" she said.\n\nLindsey Vonn is now targetting the 2026 Winter Olympic Games — and beyond. (Getty Images: Agence Zoom/Mateo Sgambato)\n\nVonn ended the season with a first podium in seven years when she finished second in the Super-G at the World Cup finals in Sun Valley, Idaho.\n\nFriday was her 44th win in downhill, 21 years after her first in 2004, and it transformed her Olympic prospects.\n\nFrom being an outside medal hope, Vonn now looks a real contender for gold after beating a string of far younger champions in her 409th start.\n\nShe could also extend her comeback to the end of the season, beyond Cortina.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I thought I might retire after the last race of the Olympics, because I didn't think I'd be competitive for a [World Cup] title, but I might need to change my approach,\" she said.\n\nThe American was fastest in training on Wednesday, when she said she felt physically in possibly the best shape she had ever been and had gained muscle and strength.\n\n\"I still didn't ski the best I could have on the compression on the bottom but I just tried to be dynamic, tried to be clean, the way I've been skiing in training and it was pretty solid,\" she said on Friday.\n\n\"It's a long weekend with three races. Yesterday was quite hard, I think I lost a lot of energy just hanging out for 30 minutes,\" she said of a training interrupted by a heavy crash for Switzerland's Olympic combined champion Michelle Gisin.\n\n\"I'm just going to try and get some sleep tonight, hopefully be ready for tomorrow.\n\n\"I'm actually really excited for Super-G because I'm skiing better in Super-G than I am in downhill.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/social-media-ban-teens-roblox-son-boundary-safety/106131786",
    "title": "The social media ban began and my son said something unexpected",
    "publish_date": "Fri, 12 Dec 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "On day one of Australia's social media ban, my 13-year-old son said the most unexpected thing.\n\n\"It's a good start — but it doesn't go far enough.\"\n\nThis from the kid who, like so many of his peers, had been rolling his eyes at the \"lame\" attempts by the federal government to restrict what has become open access by predators to kids on almost every social media and messaging site.\n\nWe are three days in now from Facebook, Instagram, Threads, X, YouTube, Snapchat, Reddit, Kick, Twitch and TikTok being required to remove accounts held by users under 16 years of age in Australia and prevent those teens from registering new accounts.\n\nPlatforms that do not comply risk fines of up to $49.5m.\n\nLoading...\n\nA relief to any parent\n\nThe kids are not restricted from viewing content on sites like YouTube, but they can't sign up for their own accounts until they are 16.\n\nHighly criticised online gaming platforms like Roblox are also required to implement facial age assurance tests, and my son noted that this was in place and was smartly executed. Chat restrictions were immediately obvious.\n\nThis can only be a relief to any parent, even to the ones whose younger teens are anguished at being locked out of their preferred messaging platforms.\n\nThe day the snap streaks ended — for some teens, at least After a year of waiting, Australia's world-leading laws to block kids from accessing social media are officially enacted. But the teens they're meant to impact say not much has actually changed.\n\nBut parental responses have been as varied as their kids are furious. Some parents have gone on the record saying they will help out their kids with VPNs and fake accounts, so their kids aren't \"left out\". Lesser-known messaging services are being downloaded by kids, and possibly parents, to link them in with a hyper-connected world they can no longer imagine doing without.\n\nI understand the impulse. Teens are impressive advocates for their causes.\n\nBut, despite my own scepticism over the effectiveness of this law, it's been heartening to see young teens respond warmly to what is a positive statement of protection and care — and I think we underestimate the force of that.\n\nThe power of the loving boundary\n\nFrom infancy, parents are told about the importance of attachment and presence: of ensuring that a child knows its needs are seen and will be met, and that being around their parents is safe.\n\nBecause our teens are mouthy, critical and opinionated young souls yearning to be free of our boundaries, I think we can underestimate the central nervous system calming that comes with knowing that boundaries, even resented ones, are being placed with care and safety around the kids we love.\n\nSign up for Weekend Reads in your inbox Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nGrace Tame gets it. The steely former Australian of the Year, author and child sex abuse victim advocate posted to Instagram when the law came into place, noting that the internet gave direct access to children and that \"child sex offenders are usually the earliest adopters of new technologies, which they repurpose for harm\".\n\nAnything we can do to restrict access is important, she says.\n\nThis is where we parents should remind ourselves of the power of the loving boundary: not to bind and constrain, but to properly demonstrate that we hold our kids and their safety in our mind, and that they do not slip out of our mind.\n\nAnd that's what this might just turn out to be. Not a watertight seal of safety against predators. Nor an onerous restriction of business of the tech giants. But a good first step.\n\nKeep an eye on the shortcuts\n\nJonathan Haidt, the author of the book The Anxious Generation, and a powerful critic of young people having access to phones, is a huge fan of the change. He calls it \"the most vital law on the planet\" and says it doesn't matter if the rollout is messy and imperfect — \"the alternative is far worse. Without action, we leave yet another generation to grow up under the rule of a handful of tech companies whose business models depend on capturing as much of children's time and attention as possible.\"\n\nIn this household, we will try to keep an eye on the shortcuts, contain the resentments and, probably most important of all, try to lead by example by putting our phones away, turning off the messages and reconnecting in the most essential and powerful way: in person.\n\nThis weekend, we're joining post-natal mums to the ban, too — have a look at the research on what screens postpartum can do to an under-slept mum.\n\nHave a safe and happy weekend, and given this is my last column before Christmas, I should share really the only Christmas song that truly gets me — and of course it's sung by one of the great rock and roll voices. Have a wonderful celebration if you celebrate, and a great break if that's on your list, too. I'll catch up with you for some best reads of 2026 before we hit the new year. Go well.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
    "source": "ABC",
    "cluster_id": 23
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-13/mental-health-fundraiser-in-memory-of-alice-wilkinson/106032394",
    "title": "Alice took her own life at 13. Now her family is fundraising to help others",
    "publish_date": "Fri, 12 Dec 2025 20:49:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Alice Wilkinson loved music.\n\nThe 13-year-old from Broken Hill would often collate playlists with songs from the 1930s through to the 2011 hit Tongue Tied, which was often on repeat in her bedroom.\n\nWARNING: This article contains references to mental health and suicide.\n\nHer father, Trevor Wilkinson, admired her love of \"old school\" music, particularly 80s and 90s rock that they would blast in the car.\n\nAlice was the life of the party and always made sure her friends were having a good time.\n\nShe loved art and doodling cats on her schoolbooks and in loved ones' cards.\n\nAlice Wilkinson loved to draw, with much of her artwork displayed on the walls of her room. (Supplied: Edie-Lee Wilkinson)\n\nHer artwork is hung up in the home she shared with her mother, Edie-Lee Wilkinson, and stepfather Mathew Behrens, who was known as \"bonus dad\".\n\nIt is these positive memories the family hold on to after Alice tragically took her own life in August 2025.\n\nIn her memory, Ms Wilkinson and Mr Behrens are raising money for youth mental health organisation Headspace in the hope that the next child in crisis can access the help they need.\n\n\"It's a shame we could not get there with Alice, but we'd like to get it done for others,\" Ms Wilkinson said.\n\nEdie-Lee Wilkinson and Mathew Behrens remember Alice as a very intelligent young girl. (ABC News: Coquohalla Connor)\n\nRoad to diagnosis\n\nAlice was intelligent and learnt to walk and talk before her peers.\n\nAlice Wilkinson's lively personality was evident from a young age. (Supplied: Edie-Lee Wilkinson)\n\nMs Wilkinson remembers being slightly in awe when her daughter, not even in school yet, handed her a note.\n\n\"The first time [Alice] swore at me, she wrote it down, and I just had to be impressed that she got it all right and in the right context,\" she said.\n\nWhen Alice started primary school, she continued to excel.\n\n\"Her schoolwork was always selected as the one they would put on display … she was a bit of a perfectionist,\" Ms Wilkinson said.\n\nWhen Alice's cousin was diagnosed with autism, Ms Wilkinson began to notice parallels between their behaviour.\n\nShe started seeking a diagnosis for her daughter in 2019.\n\nWhen the COVID-19 pandemic hit, a face-to-face appointment to secure a formal diagnosis became impossible to complete, with the required psychiatric services hundreds of kilometres away in Adelaide.\n\nCreating art helped Alice Wilkinson express her feelings. (ABC News: Bill Ormonde)\n\nMs Wilkinson explored local services, but every option came with a minimum 12-month waiting period.\n\nIt took media and political involvement to secure an appointment in 2021, when Alice was diagnosed with autism spectrum disorder level two.\n\nIt opened the door for the family to receive NDIS support, including access to a social worker and occupational therapist.\n\nAlice Wilkinson's family will always remember her silly and fun personality. (ABC News: Bill Ormonde)\n\nWhile the support was a great boost for the family, services were largely delivered through telehealth or required long commutes.\n\n\"[Alice] was more of a face-to-face person … so I think she did suffer a little bit from that,\" Mr Wilkinson said.\n\n\"I used to take her to see her therapist on the coast and think, 'Having to travel 600 kilometres to help your kids out is just wrong.'\"\n\nTrevor Wilkinson says he will always miss his daughter. (ABC News: Bill Ormonde)\n\nThe Far West Local Health District acknowledged workforce shortages could impact on appointment availability for mental health services, but said access to telehealth had expanded since the pandemic.\n\n\"Telehealth options complement face-to-face services, enabling clinicians to provide support even when travel or in-person appointments are challenging,\" a statement said.\n\n\"This shift has improved accessibility and flexibility for many people in remote areas.\"\n\nAlice Wilkinson loved animals, especially cats. (ABC News: Coquohalla Connor)\n\nSeeking help\n\nSix months before Alice died, she called Lifeline, telling them she had a plan to take her life.\n\nThe counsellors told Alice to wake up her mother, so they could all speak on the phone.\n\n\"In a diary entry she said, 'Nothing's helping.' We tried, and it [wasn't] helping,\" Ms Wilkinson said.\n\nIn an attempt to secure further support for Alice, Ms Wilkinson started investigating a possible ADHD diagnosis for her daughter.\n\nAlice Wilkinson was very close with her mum Edie-Lee Wilkinson. (Supplied: Edie-Lee Wilkinson)\n\nAlice's mental health declined and the family secured a mental health plan through a GP, before being referred to a psychologist and paediatrician to obtain an assessment and for increased medication.\n\n\"That was in hope of looking into ADHD, but we didn’t get her there,\" Ms Wilkinson said.\n\n\"I think it wouldn't have made any difference because she'd already come to the conclusion that nobody could help her.\"\n\nBanding together for Alice\n\nRoyal Australian New Zealand College of Psychiatrists youth psychiatry chair Daniel Pellen said access to psychiatry in remote communities was an ongoing issue.\n\nDaniel Pellen says neurodiverse people in rural areas face an uphill battle to access care. (ABC News: Warwick Ford)\n\n\"We know there are about five times as many psychiatrists in metropolitan areas as there are in rural and remote areas,\" Dr Pellen said.\n\n\"People with ADHD and autism have a higher rate of mental illness, so their chances of suffering are higher.\n\n\"Early intervention is always the best model to follow and we know that if we can see people early, and diagnose and treat appropriately, we'll have a better outcome.\"\n\nAlice Wilkinson's friends came out in support of the Headspace event, wearing Team Alice T-shirts. (ABC News: Bill Ormonde)\n\nAlice's parents hope her story can help other children who are struggling or feeling isolated.\n\nIt was a feeling shared by the Broken Hill community who gathered in the town's square last month to watch Ms Wilkinson, Alice's brother Lucas and mayor Tom Kennedy shave their heads as a fundraiser for the local Headspace branch.\n\n\"No matter how hard things get, the community's always behind you,\" Mr Kennedy said.\n\nEdie-Lee Wilkinson and Tom Kennedy with freshly shaven heads to raise money for the local Headspace. (ABC News: Bill Ormonde)\n\nThe NSW Member for Barwon, Roy Butler, also collected donations from his colleagues, who shaved parts of his head in support for Alice.\n\nThousands of dollars have already been raised in Alice's name and her family will now work in collaboration with Headspace to identify how it could help local children.\n\n\"Whatever we do, it won't bring her back, but we're helping her legacy live on,\" her mum said.",
    "source": "ABC",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/high-demand-for-2026-world-cup-tickets-australia-among-nations-with-the-greatest-interest-20251213-p5nned.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia among nations driving demand for World Cup tickets despite ‘disgraceful prices’",
    "publish_date": "Sat, 13 Dec 2025 12:55:22 +1100",
    "category": "sports",
    "authors": [
      "Rory Carroll"
    ],
    "text": "FIFA received five million requests for World Cup 2026 tickets in the first 24 hours of the latest sales phase, soccer’s world governing body said on Friday, despite an outcry from fan groups this week about high prices for the tournament.\n\nFans from more than 200 countries and territories applied via FIFA.com for seats at the first 48-team World Cup, which will be staged across the United States, Canada and Mexico from June 11 to July 19, 2026, FIFA said.\n\nAfter the three host nations, the top countries of residence for ticket requests were Colombia, England, Ecuador, Brazil, Argentina, Scotland, Germany, Australia, France and Panama.\n\nFootball Supporters Europe (FSE) this week called on FIFA to immediately halt sales of national team allocations, accusing the governing body of imposing “extortionate” ticket prices that risk shutting ordinary fans out of the tournament.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/victoria/swimmers-fighting-the-tide-to-keep-their-pools-afloat-across-victoria-20251210-p5nmln.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Swimmers fighting the tide to keep their pools afloat across Victoria",
    "publish_date": "Sat, 13 Dec 2025 12:53:58 +1100",
    "category": "finance",
    "authors": [
      "Benjamin Preiss"
    ],
    "text": "When the Belfast Aquatics pool opened in Port Fairy in 2007, there was a buoyant feeling the community had achieved the impossible.\n\nPeople in the small town on Victoria’s west coast desperately wanted their own swimming pool and gym even though councils were building larger aquatic centres in central locations.\n\nMatilda Mathews will be unable to use the Port Fairy pool as the council has decided to close it. Credit: Nicole Cleary\n\nSo they did it themselves. Volunteers spent countless hours planning, designing and fundraising. Local builders worked on the construction. Businesses and community groups pitched in with funding, in addition to some council and state government money.\n\nTeresa O’Brien, who lives nearby, recalls with fondness the excitement that swept across the crowd that gathered when the doors first opened. There was an abiding sense the community had done something for the greater good.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/transport-companies-given-fine-free-time-as-ai-powers-inner-west-truck-ban-20251212-p5nn3h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Transport companies given fine-free time as AI powers inner-west truck ban",
    "publish_date": "Sat, 13 Dec 2025 10:21:14 +1100",
    "category": "finance",
    "authors": [
      "Chip Le Grand"
    ],
    "text": "Sensor Dynamics founder Nick Parker said the technology, which had been trialled for the past 18 months, is further advanced from that used on regional highways in NSW or around Sydney’s Port Botany. He said that during the trial of the cameras in Melbourne’s inner west, he was shocked at the size and frequency of heavy vehicles using suburban streets. “You have got lovely residential streets with semi-trailers coming down them,” he said. “It is really no good at all.” Information about trucks detected by the AI-powered cameras will be accessed by the National Heavy Vehicle Regulator. Images captured by the cameras will be analysed by roadside AI and transmitted to an Equinix data centre in Melbourne which the National Heavy Vehicle Regulator, the agency responsible for regulating and licensing all vehicles with a mass exceeding 4.5 tonnes, will access through a secure portal. Parker said information from the cameras would not be uploaded to the cloud or shared with offshore databases.\n\nLoading While the $10.2 billion tunnel project is the headline-grabbing change to Melbourne’s freight industry and roads in the western suburbs, Horne said the government’s decision to lease 29 hectares of the old Melbourne Markets site on Footscray Road for a truck marshalling and container storage facility would also reduce the amount of driving time trucks spend returning empty containers to the port. Most of the container trucks which currently rattle through the inner west are loaded with empties. Horne said the proliferation of 26-metre high-performance freight vehicles (HPFVs) on Melbourne roads and disruption to global freight and logistics caused by the pandemic, as well as how goods are warehoused, had significantly changed the logistics of Melbourne’s freight task from what was envisioned when the tunnel project was first proposed. In 2014, there was just one HPFV registered in Victoria compared to more than 5700 today. The HPFVs, which weigh more than 68.5 tonnes, are too heavy to use the West Gate Bridge.\n\nHorne said Melbourne’s population growth was adding pressure on to the city’s warehousing capacity, as there was an estimated 4.5 square metres of additional warehousing space required for every new resident. “You can see that through the volumes coming through the port,” she said. “They had their biggest year last year with 3.2 million TEUs (20-foot equivalent units) and that trajectory is continuing to grow. Victorian Ports and Freight Minister Melissa Horne. Credit: Joe Armao “That is symptomatic not only of our growing city but that disruption that happened in the supply chain. That hasn’t been a Victorian phenomenon. It’s a global phenomenon.” The idea of a second major road crossing over the Maribyrnong River and dedicated truck routes to the port was first proposed in 2008 by the East-West Link Needs Assessment group chaired by Sir Rod Eddington. In the proposal, daily truck movements in and out of the port were forecast to either double or more than triple from 9000 to between 18,500 and 29,500 by 2035.\n\nThe changing nature of Melbourne’s truck fleet to much bigger vehicles capable of taking more containers has meant that, even though the amount of freight coming into the city has steadily grown, the number of daily truck movements is largely unchanged. The Port of Melbourne, in its soon-to-be published Port Development Strategy for the next 30 years, forecasts truck traffic to and from its docks will grow at between 2 and 3 per cent a year. The government’s most recently published Victorian Freight Plan predicts the freight task to grow faster than the city’s population and more than double between 2020-21 and 2050-51. Sir Rod Eddington in 2020. He says the top recommendations to Melbourne’s transport system he made in 2008 have been realised. Credit: Jason South Eddington said the West Gate Tunnel, despite years of political disagreement about the project, had delivered both the east-west road crossing and key elements of the truck action plan recommended in his report. When added to the Metro Tunnel, which opened this month, the Regional Rail Link built a decade ago and electrification of the Sunbury rail line, the opening of the West Gate Tunnel means the top five recommendations from the seminal Investing in Transport report have been realised.\n\nEddington said that eventually, the final piece of the east-west road project – a tunnel connecting City Link and the Eastern Freeway – would need to be built to take pressure of the Domain and Burnley tunnels. Loading “If you take the Burnley and Domain tunnels out of Melbourne’s infrastructure tomorrow, the city would be gridlocked,” he said. “The bottom line is, you have got to do north of the city what we have done south. It will improve liveability substantially because it takes traffic away from key parts of metropolitan Melbourne and gives much greater certainty to travel times.” Horne, when asked whether she agreed, said the picture would become clearer over the next five years once the North-East Link road project was completed, the Beveridge Intermodal Freight Terminal built north of Melbourne and greater rail capacity to the port established. “Governments into the future will be able to say, ‘What else do we need to do in moving thing around the network?’” she said. “Unless we are doing it efficiently and driving productivity, the city grinds to a halt.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/world/europe/andrew-attends-palace-christening-of-princess-beatrices-daughter-20251213-p5nneb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Andrew attends palace christening of Princess Beatrice’s daughter",
    "publish_date": "Sat, 13 Dec 2025 10:14:01 +1100",
    "category": "lifestyle",
    "authors": [
      "Hannah Furness"
    ],
    "text": "London: Andrew Mountbatten-Windsor and his former wife, Sarah Ferguson, have attended the christening of Princess Beatrice’s daughter – the former prince’s granddaughter – at St James’s Palace in London.\n\nAthena Elizabeth Rose Mapelli Mozzi was christened at a private service for close family and friends on Thursday.\n\nA Range Rover carrying Andrew Mountbatten-Windsor arrives at St James’ Palace on Friday. Credit: GC Images\n\nShe was born on January 22, several weeks premature, and bears the name of her great-grandmother, Elizabeth II.\n\nShe is the second child of Princess Beatrice and Edoardo Mapelli Mozzi, and younger sister to Sienna. Mapelli Mozzi also has a son, Wolfie, to whom Princess Beatrice is stepmother.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/athletics/it-doesn-t-sit-right-sydney-marathon-to-change-ballot-after-local-runners-miss-out-20251114-p5nffi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It doesn’t sit right’: Sydney Marathon to change ballot after local runners miss out",
    "publish_date": "Sat, 13 Dec 2025 09:45:00 +1100",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "The Sydney Marathon will revise its balloting system for the 2027 event after a record number of international applicants resulted in veteran runners being shut out of their local race.\n\nAfter the race gained prestigious World Major status in 2025, the ballot in October for the 2026 event saw 123,000 people vying for 40,000 spots. With no priority given to local runners, thousands missed out.\n\nMark Goodwin with his medals from years of competing in the Sydney Marathon, and one for finishing every major in the world. Credit: Steven Siewert\n\n“That scale of interest from both Australian and international participants means that, unfortunately, some committed runners will miss out in any given year, just as they do in London, New York, Boston, Berlin, Tokyo and Chicago,” a spokesperson for the marathon said.\n\nThe only runners currently guaranteed entry are the six “Blue Line Legends” who have run every Sydney Marathon since the race’s inception in 2001. However, in response to questions from this masthead, race organisers said they would reconsider ballot rules for the 2027 event.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/in-switzerland-they-won-a-goat-now-these-aussie-curlers-want-an-olympic-medal-20251208-p5nlrq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "In Switzerland, they won a goat. Now these Aussie curlers want an Olympic medal",
    "publish_date": "Sat, 13 Dec 2025 09:22:00 +1100",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "“There’s bells everywhere from the goats and the cows, and they made that as their trophy, and we happened to sign it – and we’re happy that we did.” Welcome to the weird, wonderful world of curling – which, for the uninitiated, is essentially lawn bowls on ice, with brooms, infused with intricate chess-level tactical nuance. Dean Hewitt and Tahli Gill in action at Beijing 2022. Credit: Getty Images Signing a goat was an experience Hewitt and Gill won’t forget. But they are keen to create further memories, in pursuit of a far more orthodox sporting prize: an Olympic medal. Hewitt, 31, and Gill, 26, have been on a roll. Last season, they finished top five in every event they competed in bar one. This season, the Australian duo claimed gold at another competition in Bern, won silver medals at both the Colorado Cup and Stirling International, while in May, they collected bronze at the world championships in Canada – the first by any Australian curler in history at that level, although they did fall agonisingly short of direct Olympic qualification.\n\nTheir run of results was enough to boost them to the world No.1 ranking in mixed doubles curling last month; they’ve since slid to No.9, but should they clinch an Olympic berth at the final qualification event in Kelowna, Canada, which runs between December 13-18, they are expected to be in the mix for a medal at Milano-Cortina 2026. That’s some feat, given their chosen sport – the origins of which can be traced to a frozen pond in Scotland in 1511 – barely exists where they’re from. They estimate there are under 200 regular curlers in Australia, whereas a single club in North America or Europe can boast over 1000. Tahli Gill and Dean Hewitt. Credit: AP Modest as their community is back home, they are the faces of it. There are no curling facilities in Australia. It is played on hockey ice, which would be like asking Olympic swimmers to practice in a backyard pool.\n\n“The ice is bumpy,” Hewitt explained. “It’s got hills and valleys and things like that – it doesn’t look like it, it looks very flat, but for curling, it has to be so, so, so flat. And for us to get those conditions, we have to be overseas.” So they spend up to eight months every year abroad, pursuing their dreams, racking up expenses that Hewitt reckons would comfortably sit in the six-figure zone. They’re fortunate they have flexible employment situations: he’s an exercise physiologist who can pick up work in Australia and in Canada, where he is a dual citizen, while Gill is a teacher who does relief work at a school which is very accommodating and understanding of her schedule. “It’s just what you’ve got to do to be at the top,” Hewitt said. Milano-Cortina wouldn’t be their first Olympic appearance, should they make it. Hewitt and Gill also qualified for Beijing 2022, becoming the first curlers to represent Australia on that stage, but their experience was coloured by the pandemic; they couldn’t mingle with other athletes like at a typical Games, while their efforts to stay COVID-free were so mentally exhausting they say it affected their preparations.\n\nPlus, whatever they tried didn’t work: Gill tested positive while in Beijing, and was only able to compete thanks to a late reprieve from Chinese health officials, which allowed her mere minutes to grab her things and get to the curling venue. Loading Since, and partly thanks to the friendly timezone and television exposure in Australia from the last Olympics, they say general interest in curling has skyrocketed – and will grow, should hopes for a dedicated rink come to pass. “Instead of people saying, ‘I don’t really know what that is,’ it’s like, ‘Oh, yeah! I saw that on TV, we had a team,’” Gill said. “We always see a massive influx of people coming and trying curling and wanting to get into [it]. But the biggest challenge that we have is that … we don’t have capacity.”",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/vonn-makes-world-cup-history-20251213-p5nne5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vonn makes World Cup history",
    "publish_date": "Sat, 13 Dec 2025 09:15:28 +1100",
    "category": "sports",
    "authors": [],
    "text": "Vonn makes World Cup history\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/national/victoria/modified-e-bikes-to-be-banned-from-trains-in-victoria-from-next-weekend-20251213-p5nndx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Modified e-bikes to be banned from trains in Victoria from next weekend",
    "publish_date": "Sat, 13 Dec 2025 09:08:41 +1100",
    "category": "finance",
    "authors": [
      "Alexander Darling"
    ],
    "text": "Modified electric bicycles won’t be allowed on Victorian trains – including regional rail services – from December 21.\n\nThe ban, which is aimed at reducing the risk of fires on public transport caused by the vehicles’ lithium-ion batteries, was announced by the state government on Saturday morning.\n\nAn e-bike caught fire on a Melbourne train in March.\n\nA government spokesperson said the ban would not apply to “compliant, factory-built e-bikes and e-scooters”.\n\nHowever, as part of a separate change effective from Sunday, December 21, riders of all e-bikes and scooters will be banned from charging or turning on their vehicles while on trains, trams or buses and in ticketed areas.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/lifestyle/significant-news-king-charles-opens-up-on-his-cancer-battle-20251213-p5nne3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Significant news': King Charles opens up on his cancer battle",
    "publish_date": "Sat, 13 Dec 2025 08:35:22 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "'Significant news': King Charles opens up on his cancer battle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/lifestyle/king-charles-reveals-hes-reducing-his-cancer-treatment-20251213-p5nne0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles reveals he's reducing his cancer treatment",
    "publish_date": "Sat, 13 Dec 2025 08:23:36 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles reveals he's reducing his cancer treatment\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/national/adult-content-creator-banned-from-bali-20251213-p5nndy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adult content creator banned from Bali",
    "publish_date": "Sat, 13 Dec 2025 08:19:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "Adult content creator banned from Bali\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/lifestyle/king-charles-gives-major-cancer-treatment-update-20251213-p5nndw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles gives major cancer treatment update",
    "publish_date": "Sat, 13 Dec 2025 08:09:15 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles gives major cancer treatment update\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/world/king-charles-talks-about-his-cancer-journey-20251213-p5nndu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles talks about his cancer journey",
    "publish_date": "Sat, 13 Dec 2025 07:40:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "King Charles talks about his cancer journey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/national/new-photos-of-trump-at-epstein-s-estate-emerge-20251213-p5nndt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "New photos of Trump at Epstein’s estate emerge",
    "publish_date": "Sat, 13 Dec 2025 07:33:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "New photos of Trump at Epstein’s estate emerge\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/national/car-ploughs-through-shopfront-in-sydney-s-inner-west-20251213-p5nnds.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Car ploughs through shopfront in Sydney’s inner-west",
    "publish_date": "Sat, 13 Dec 2025 07:32:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "Car ploughs through shopfront in Sydney’s inner-west\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.smh.com.au/national/modified-e-bikes-to-be-banned-on-victorian-trains-20251213-p5nndo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Modified e-bikes to be banned on Victorian trains",
    "publish_date": "Sat, 13 Dec 2025 07:28:46 +1100",
    "category": "finance",
    "authors": [],
    "text": "Modified e-bikes to be banned on Victorian trains\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/king-charles-reveals-his-cancer-treatment-can-be-reduced-in-the-new-year/vfgtcduzr",
    "title": "'Personal blessing': King Charles reveals cancer treatment can be scaled back",
    "publish_date": "Fri, 12 Dec 2025 20:22:34 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles said on Friday that his doctors can reduce his treatment for cancer in the new year, describing the moment as a \"blessing\" and testament to remarkable medical advances.\n\n\n\n\n\nCharles, 77, was diagnosed with an unspecified form of cancer last February, and made the latest announcement in a televised broadcast as part of a national cancer awareness campaign in Britain.\n\n\n\n\n\n\"I am able to share with you the good news that thanks to early diagnosis, effective intervention and adherence to doctors' orders, my own schedule of cancer treatment can be reduced in the new year,\" he said.\n\n\n\n\n\n\"This milestone is both a personal blessing and a testimony to the remarkable advances that have been made in cancer care in recent years.\"\n\n\n\n\n\nA spokesperson for Buckingham Palace said his medical treatment will now \"move into a precautionary phase\" but doctors will continuously monitor his health.\n\n\n\nThe public remarks about his experience of cancer and his health condition are unusual for the royal family, which traditionally does not reveal much about the personal lives of its members.\n\n\n\n\n\nThe Buckingham Palace spokesperson said the advice from the cancer experts is that \"it is preferable that His Majesty does not address his own specific condition but rather speaks to those affected by all forms of the disease\".\n\n\n\n\n\nTests detected his cancer after a corrective procedure for an enlarged prostate, Buckingham Palace said in February 2024. At the time, the palace said it would not provide regular updates on his treatment, and did not give details about the cancer.\n\n\n\nREAD MORE Why some Australians stand by the royal family despite the Prince Andrew scandal\n\nAfter some time away from the spotlight, Charles, who ascended to the throne in 2022, returned to public duties in April this year with a busy schedule of ceremonies, appearances and foreign trips.\n\n\n\n\n\nIn March, Buckingham Palace said Charles was briefly hospitalised after suffering side effects from his cancer treatment, which were not specified.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-gift-of-mobility-how-des-has-changed-12-000-lives/d4fcej87x",
    "title": "The gift of mobility: How Des has changed 12,000 lives",
    "publish_date": "Fri, 12 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nThis story is a collaboration with SBS German .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSparks are flying at a workshop on the Gold Coast where volunteers are turning out rough terrain wheelchairs.\n\n\n\n\n\nThe wheelchairs are destined for developing countries, where a wheelchair can be life changing for people with disability, as inventor Des La Rance explains:\n\n\n\n\n\n\"Oh, the reward. When you hand a child a wheelchair, it just takes my breath away.\"\n\n\n\n\n\nThe former cabinet maker first devised the plan to make and donate wheelchairs, after a trip to Fiji in 1996.\n\n\n\n\n\n\"I couldn't believe what the children there were going through without a wheelchair. And one of them that really sticks to my mind is a 14-year-old girl walking around on her hands. We've said, what are you going to do now? And she said, I'm going to town. I've never been to town.\"\n\n\n\n\n\nAlmost 30 years later Mr La Rance’s project still mass produces robust wheelchairs from dumped and unwanted bicycles.\n\n\n\n\n\n\"The bicycles come in, they get cut up and machined to what we want and then they're all passed down through the line with spray painting.\"\n\n\n\n\n\nAnd there’s no shortage of raw materials - with estimates up to half-a-million bicycles are discarded every year. Most end up in landfill. At the Surfers Sunrise Wheelchair Trust, skilled volunteers have turned out almost 12,000 wheelchairs, so far.\n\n\n\n\n\n\"We've delivered them to 31 different countries all over Asia, Africa, you name it, we've been there.\"\n\n\n\n\n\nThe latest shipment is bound for Sri Lanka, where catastrophic flooding creates extra hardship for people with limited mobility. Valluvan Thillairajah is a medical student and volunteer with Australian-based charity Vanni Hope, and currently delivering aid to flood victims there.\n\n\n\n\n\n\"With people who don't have mobility, they're literally unable to get away from it. And a lot of them unfortunately dying and being caught in the destruction, which is yeah really tough.\"\n\n\n\n\n\nWith many roads and paths destroyed in Sri Lanka, Mr Thillairajah says the generous gift of 121 wide-tyre wheelchairs is most welcome.\n\n\n\n\n\n\"They're rough terrain wheelchairs, which are really useful for us because especially in regions like the upcountry, you have to go uphill to get places.\"\n\n\n\n\n\nFor Trust chairman and Gold Coast local Geoff Croad it’s also about keeping unwanted bikes out of landfill.\n\n\n\n\n\n\"There was one building in Surfers [Paradise] that had like 40 to 50 bikes sitting in the basement. So, we're able to pick up 30 this morning, bring them back to the depot. We've probably put through the facility probably 40,000 bikes over the years. We use the back frame of the bike. We need two of those, two matching frames to form the basic wheelchair.\"\n\n\n\n\n\nThe design is so popular, Mr La Rance says the Rotary Club charity is swamped with orders.\n\n\n\n\n\n\"We just keep the containers rolling out. We've got people all over the world wanting these wheelchairs, so we're never going to fulfil the requests that are out there.\"\n\n\n\n\n\nThree decades and thousands of chairs later, Mr La Rance can hardly believe the impact.\n\n\n\n\n\n\"No, I never imagined that at all. You’d need to experience the effect it has on a person er that never been able to walk. You give them a wheelchair and wheel them to wherever they want to go. So, it combines the family back together again as well.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/covid-tracker-melbourne-man/uq72woqzq",
    "title": "Scientists rely on this COVID-19 data. It's made by a volunteer in Melbourne",
    "publish_date": "Fri, 12 Dec 2025 19:33:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "While some people were building puzzles or baking sourdough to get through COVID-19 lockdowns, Mike Honey started tracking case numbers.\n\n\n\n\n\nHe told SBS News he wanted to have a good answer when his grandchildren asked him: \"So, what did you do [during the pandemic]?\"\n\n\n\n\n\nFour years later, the data analyst still translates global COVID-19 data into charts that help the public understand the risks of the disease — from national case numbers to the rise of variant strains worldwide.\n\n\n\n\n\nHis work has popped up in everything from news reports to academic research.\n\n\n\n\n\nAnd although case numbers are the lowest we've seen , epidemiologists told SBS News they still rely on Honey's work to fill an information void where state departments no longer have the time or resources to share data.\n\n\n\nFor the last four years, Mike Honey has spent several hours a week gathering and publishing vital information about COVID-19. Source: Supplied Paul Griffin, an infectious disease physician and clinical microbiologist from the University of Queensland, said: \"I think it's an incredibly valuable service he's provided.\"\n\n\n\n\n\nWhat's more, Honey does it all for free in his spare time.\n\n\n\nLooking at the big picture\n\nSoft-spoken and polite, Honey sat down with SBS News to talk about how he became scientists' go-to for COVID-19 information.\n\n\n\n\n\nHe explained that being from Melbourne's north-west suburbs meant he lived in one of the first places in Australia to be hit by lockdowns.\n\n\n\n\n\nAs an IT specialist stuck at home, he realised it was hard to get information about national case numbers.\n\n\n\n\n\n\"A lot of the states have a decent report that comes out ... but they are just for that state. There's nothing at the federal level,\" Honey said.\n\n\n\n\n\nSo he built a spreadsheet that brought all the case numbers from across the country together in one spot.\n\n\n\n\n\nThen, he posted it online — first on GitHub, an open-source code-sharing platform, and then \"pretty much everywhere\".\n\n\n\nThe graph shows estimated current COVID-19 case numbers across the country based on cases among aged care staff. Source: Supplied National case numbers aren't the only ones he keeps track of. He also monitors variants , vaccine uptake, and aged care case numbers, and posts case charts for New Zealand, the United States, the United Kingdom and Canada.\n\n\n\n\n\nIt wasn't long before epidemiologists started to take notice.\n\n\n\nAn 'incredibly valuable service'\n\nAdrian Esterman, professor of biostatistics and epidemiology at the University of South Australia, said during the pandemic he was asked to give talks to concerned community groups about variants.\n\n\n\n\n\nHe struggled to find enough detail from state health departments to satisfy his audience's questions.\n\n\n\n\n\n\"Then I came across a Tweet from Mike that led to his GitHub site, which provided exactly the information I was looking for,\" he said.\n\n\n\nHoney's variant tracker takes publicly available information on cases of people infected with COVID-19 mutations and brings it all together on a world map.\n\n\n\n\n\nThat way, it's much easier to see which variants are growing and where, compared to pages of text on sites like the World Health Organization's COVID-19 variants dashboard.\n\n\n\n\n\n\"I still give talks on COVID-19, and Mike's is still the go-to website,\" Esterman said.\n\n\n\n\n\nGriffin agrees, and said he still refers to Honey's work \"a few times a week, to be honest\".\n\n\n\n\n\nHe said that while case numbers are low, the data Honey shares still helps to answer important questions.\n\n\n\n\n\n\"Like how we manage our hospitals and healthcare systems, and counsel our individual patients so they have an understanding of the risk,\" he said.\n\n\n\nA legacy in medicine\n\nHoney said his uncle's legacy has inspired him to help out where he can.\n\n\n\n\n\nHis late uncle, Dr Norman Honey, dedicated his life to treating leprosy patients and fighting the disease's stigma. He worked in West Africa before moving to Hong Kong, where he served as chief medical officer.\n\n\n\nNorman Honey (centre-right) after receiving a Member of the British Empire from Queen Elizabeth in 1994 for his work treating leprosy patients. Source: Supplied / Mike Honey Though much of the data is now gathered automatically, Honey said he still spends a few hours each week tracking COVID-19.\n\n\n\n\n\nAnd while he's taken a few nasty comments on social media here and there, he's been surprised by the public's overall response.\n\n\n\n\n\n\"There's a lot of people that say they're glad to see it, and they're hanging on it,\" he said.\n\n\n\n\n\nBut after four years, he admits he's looking forward to the day he doesn't have to post an update.\n\n\n\n\n\n\"It's a little bit of a weight on my shoulders,\" he said.\n\n\n\n\n\nHoney is hopeful the new Australian Centre for Disease Control, set to open on 1 January 2026, will take over his work.\n\n\n\nWhen asked if the government should pay him for his efforts, Honey laughed.\n\n\n\n\n\n\"That'd be nice.\"\n\n\n\n\n\nThen he quickly changed his mind.\n\n\n\n\n\n\"I'd probably prefer to keep it as my hobby.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/video/states-and-territories-reject-major-public-hospital-funding-boost/5rw4rddux",
    "title": "States and territories reject major public hospital funding boost",
    "publish_date": "Fri, 12 Dec 2025 09:49:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/video/pm-backs-tomago-smelter-rescue-to-secure-1-000-jobs/8zqfiziu0",
    "title": "PM backs Tomago smelter rescue to secure 1,000 jobs",
    "publish_date": "Fri, 12 Dec 2025 09:37:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "PM backs Tomago smelter rescue to secure 1,000 jobs\n\nPublished 12 December 2025, 8:25 am\n\nThe Federal Government has announced a rescue package for Australia's biggest aluminium smelter, securing a future for more than 1000 jobs at Tomago, in New South Wales. But the Prime Minister today wouldn't be drawn on the costs of the taxpayer- funded bailout, which will deliver cheap energy to one of the biggest power users in the nation.",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/asx-soars-to-a-four-week-high-as-investors-eye-santa-rally/x5yt7mvg2",
    "title": "ASX soars to a four week high as investors eye Santa rally",
    "publish_date": "Fri, 12 Dec 2025 07:21:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/state-and-territory-health-ministers-reject-commonwealths-latest-hospital-funding-offer/v2gmxf1g0",
    "title": "State and territory health ministers reject Commonwealth's latest hospital funding offer",
    "publish_date": "Fri, 12 Dec 2025 05:41:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"The rejection by states and territories of the latest offer from the Commonwealth with regards to the National Health Reform agreement, should come as no surprise. It has been rejected because it does not meet the promise of the commitment that was given almost two years ago.”\n\n\n\n\n\nThat was Victoria's Minister for Health, Mary-Anne Thomas, speaking after state and territory health ministers rejected the Prime Minister's $20 billion health deal.\n\n\n\n\n\nThis comes after reports 3,050 aged Care patients have been stranded in public hospitals, according to new figures unveiled by states and territories.\n\n\n\n\n\nThis presents a sharp, 25% increase in just three months.\n\n\n\n\n\nThis bottleneck is collateral damage from a long funding standoff between the Commonwealth and the States.\n\n\n\n\n\n\"We know that we are dealing with a aging and growing population. We are dealing with greater acuity and complexity with our patients. It's why we need the promise of the original NHRA delivered that is an increase in the Commonwealth contribution rate, an increase in the growth cap. We need to see these delivered in order for the states and territories to consider a health reform funding agreement.\"\n\n\n\n\n\nThe self-imposed deadline for a new five-year hospital agreement now stands only weeks away.\n\n\n\n\n\nStates and territories say, the federally-funded aged care sector is failing to provide suitable exit points from hospitals, placing an immense and costly burden on state-run health services.\n\n\n\n\n\nFederal Health Minister Mark Butler told ABC Radio National Breakfast that the Federal government wouldn't be giving the states or territories any more money.\n\n\n\n\n\n\"Well, I think health ministers know I'm not bringing more money today. I don't have the authority to do that. We caught up last night, including Tim Nicholls here in Brisbane, for an informal dinner where we canvassed a whole range of these issues. They know that our job as health ministers is to narrow the points of difference as far as we possibly can and then recognise that this deal, which is not just about hospitals, it's also covering some very important disability issues around the future of the NDIS. The deal ultimately is going to be landed by First Ministers, by the Prime Minister and the premiers and the chief ministers, particularly that big question of dollars going into hospitals.\"\n\n\n\n\n\nTasmanian Health Minister Bridget Archer says it's an enormous burden on health systems that are already under intense demand.\n\n\n\n\n\n\"That is the responsibility of the Federal government -and whilst they might say, Oh, look, we've got a budget under pressure - States also have budgets that are under pressure, and we are stepping in to continue to provide that support.\"\n\n\n\n\n\nNew South Wales Minister for health, Ryan Park shares a similar sentiment.\n\n\n\n\n\n\"I'm deeply, deeply furious with what is happening because it's not fair on those patients.\"\n\n\n\n\n\nThe Commonwealth has been embroiled in a funding clash with the states and territories for months as it tries to secure a new five year public hospital agreement.\n\n\n\n\n\nPrime Minister Anthony Albanese sought to ease those tensions, adding an extra $1 billion to an existing offer of $20 billion over five years, and $2 billion over four years to deal with aged care patients stuck in public hospital beds.\n\n\n\n\n\nThe dispute stems back to a national cabinet agreement in 2023 when the federal government promised it would increase its share of public hospital funding to 45% by 2035.\n\n\n\n\n\nBut two years later, a deal is yet to be made.\n\n\n\n\n\nQueensland Minister for Health Tim Nicholls says the chance of a deal this year is unlikely without a largely improved offer.\n\n\n\n\n\n\"That is not the Christmas present that Australians are looking for from their Federal government. When it comes to health care reform, we wake up hopeful, but I'm not sure that we'll get there on Friday. That really requires the Prime Minister to come to the table.\"\n\n\n\n\n\nMr Butler says the major cost driver results from state-level decisions, such as wage deals, which the federal government does not control.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/ley-calls-for-travel-changes-anika-wells/ml103kgx6",
    "title": "Anthony Albanese seeks advice from watchdog on travel perks for politicians",
    "publish_date": "Fri, 12 Dec 2025 04:08:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "The prime minister has sought advice from the parliamentary expenses watchdog on the rules for taxpayer-funded perks , as a second federal minister refers themselves to the body over their travel.\n\n\n\n\n\nAnthony Albanese said he asked the Independent Parliamentary Expenses Authority (IPEA) about a potential review of what travel arrangements are afforded to MPs and senators.\n\n\n\n\n\nThe use of parliamentary entitlements is under scrutiny following revelations about Communications and Sport Minister Anika Wells claiming expenses for major sporting events for herself and her husband.\n\n\n\n\n\nA growing list of MPs and senators have also been in the spotlight for their use of travel perks.\n\n\n\nAlbanese said he would take on recommendations from the expenses watchdog.\n\n\n\n\n\n\"I've said to IPEA, please give us some advice, and we'll take that on board when that advice is received,\" he told reporters on Friday.\n\n\n\n\n\n\"It's important that as parliamentarians we're not sort of deciding things for ourselves, because that would bring obvious criticism.\"\n\n\n\n\n\nWells has referred her travel expenses to the watchdog for review, and Attorney-General Michelle Rowland has also asked the body to look over her travel.\n\n\n\nOpposition Leader Sussan Ley has offered bipartisan support to reform travel perks for politicians.\n\n\n\n\n\nLey said she had written to Albanese requesting a meeting about changes to parliamentary travel entitlements and the ministerial code of conduct.\n\n\n\n\n\n\"We stand ready in a bipartisan sense, I'm working through summer. I can sit down with the prime minister any time and go through measures that he would like to propose implementing, to restore that public trust in the system,\" she told Sky News on Friday.\n\n\n\nREAD MORE Minister defends taxpayer-funded trips as Coalition pushes for independent review\n\n\"What I want to see is that public trust restored and public confidence in the system, and that's clearly gone right off the rails under Prime Minister Albanese.\"\n\n\n\n\n\nThe prime minister has not said whether he will take up the offer of talks.\n\n\n\n\n\nLey also called for Wells to resign as minister over her use of parliamentary entitlements.\n\n\n\n\n\nPoliticians are allowed to claim travel expenses if their official duties are the \"dominant purpose\" of the trip, and are also entitled to fly family to Canberra and other locations around Australia for family reunions.\n\n\n\n\n\nLey said Wells' conduct and use of travel entitlements was \"scandalous\".\n\n\n\nLISTEN TO Pressure mounting on Anika Wells SBS News 01:12 English\n\n\"The whole country is reeling from all of the information that they've received about what she has done. She has not shown an ounce of contrition. She has not stepped up and said sorry,\" she said.\n\n\n\n\n\n\"If (the prime minister) can't stand there and tell the Australian people that this minister has not breached the code of conduct, then she should resign.\"\n\n\n\n\n\nThe parliamentary expenses watchdog was set up following controversy over Ley during her time as health minister, when she used taxpayer funds to travel to the Gold Coast to buy a property.\n\n\n\n\n\nIt led to Ley's resignation as minister and MPs and senators being required to report their expenses on a monthly basis.\n\n\n\nREAD MORE Anthony Albanese confirms deal to keep major aluminium smelter open\n\n\"I made a mistake, I put my hand up, apologised to the Australian people, I held myself accountable to the ministerial code of conduct. Anika Wells has done none of those three things,\" Ley said.\n\n\n\n\n\nHealth Minister Mark Butler said travel entitlements needed to be reasonable and \"used in a sensible way\".\n\n\n\n\n\n\"These rules are important. These jobs place enormous pressure on our families, particularly on our partners who do so much of family work while we're away for as much as 150 or 200 days a year,\" he told Seven's Sunrise program.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/article/tomato-smelter-anthony-albanese-announcement/2fd0q63ht",
    "title": "Anthony Albanese confirms deal to keep major aluminium smelter open",
    "publish_date": "Fri, 12 Dec 2025 03:17:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "More than 1,000 jobs at a troubled aluminium smelter have been secured after the federal government stepped in to keep it running with taxpayer support.\n\n\n\n\n\nRio Tinto, majority owner of the massive Tomago smelter near Newcastle in NSW, had for months been threatening to shut down the plant due to spiralling energy costs.\n\n\n\n\n\nBut on Friday, the government announced it had reached an agreement with the minerals giant to keep Tomago running, promising to use taxpayer funding to provide the smelter with cheaper power.\n\n\n\n\n\nAnnouncing the deal on Friday, Prime Minister Anthony Albanese said: \"It's important we as a nation continue to make things here, and the program that we've been working on to ensure that long-term future, by giving security going forward.\"\n\n\n\n\n\nThe full details of the arrangements have yet to be revealed, but they may also involve the NSW government providing support and underwriting new renewable energy generation, storage, and transmission projects.\n\n\n\nThe smelter is the single largest electricity user in the nation and consumes about 10 per cent of NSW's power supply.\n\n\n\n\n\nIndustry Minister Tim Ayres said the cost and how much each government would contribute were still being worked through.\n\n\n\n\n\n\"The fundamental premise of this is a long-term power purchasing agreement that delivers security at the right price for Tomago so they are internationally competitive,\" he said.\n\n\n\n'A pivotal moment for manufacturing'\n\nThe plant, which produces more than a third of Australia's aluminium, started production in 1983 and delivers up to 590,000 tonnes of the metal a year.\n\n\n\nElectricity makes up 40 per cent of operating costs at Tomago. Source: AAP / Michael Gorton The Australian Workers' Union (AWU) welcomed the announcement\n\n\n\n\n\nAWU national secretary Paul Farrow said: \"This is a pivotal moment for Australian manufacturing.\"\n\n\n\n\n\n\"For months, we've been saying that Tomago isn't just another industrial site. It's the test case for whether Australia is serious about having a manufacturing future,\" he said.\n\n\n\n\n\nThe announcement comes after a flurry of deals struck by the federal government to keep smelters running across the nation as rising energy costs threatened their sustainability.\n\n\n\n\n\nIn October, the federal and Queensland governments agreed on a $600 million joint support package for a copper smelter in Mt Isa.\n\n\n\n\n\nA few months prior, the Commonwealth, South Australian and Tasmanian governments stumped up $135 million in taxpayer funds to keep Nyrstar's lead and zinc smelters operating, with part of the funding going towards expanding production into critical minerals such as antimony.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 4
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/high-demand-for-2026-world-cup-tickets-australia-among-nations-with-the-greatest-interest-20251213-p5nned.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia among nations driving demand for World Cup tickets despite ‘disgraceful prices’",
    "publish_date": "Sat, 13 Dec 2025 12:55:22 +1100",
    "category": "sports",
    "authors": [
      "Rory Carroll"
    ],
    "text": "FIFA received five million requests for World Cup 2026 tickets in the first 24 hours of the latest sales phase, soccer’s world governing body said on Friday, despite an outcry from fan groups this week about high prices for the tournament.\n\nFans from more than 200 countries and territories applied via FIFA.com for seats at the first 48-team World Cup, which will be staged across the United States, Canada and Mexico from June 11 to July 19, 2026, FIFA said.\n\nAfter the three host nations, the top countries of residence for ticket requests were Colombia, England, Ecuador, Brazil, Argentina, Scotland, Germany, Australia, France and Panama.\n\nFootball Supporters Europe (FSE) this week called on FIFA to immediately halt sales of national team allocations, accusing the governing body of imposing “extortionate” ticket prices that risk shutting ordinary fans out of the tournament.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/victoria/swimmers-fighting-the-tide-to-keep-their-pools-afloat-across-victoria-20251210-p5nmln.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Swimmers fighting the tide to keep their pools afloat across Victoria",
    "publish_date": "Sat, 13 Dec 2025 12:53:58 +1100",
    "category": "finance",
    "authors": [
      "Benjamin Preiss"
    ],
    "text": "When the Belfast Aquatics pool opened in Port Fairy in 2007, there was a buoyant feeling the community had achieved the impossible.\n\nPeople in the small town on Victoria’s west coast desperately wanted their own swimming pool and gym even though councils were building larger aquatic centres in central locations.\n\nMatilda Mathews will be unable to use the Port Fairy pool as the council has decided to close it. Credit: Nicole Cleary\n\nSo they did it themselves. Volunteers spent countless hours planning, designing and fundraising. Local builders worked on the construction. Businesses and community groups pitched in with funding, in addition to some council and state government money.\n\nTeresa O’Brien, who lives nearby, recalls with fondness the excitement that swept across the crowd that gathered when the doors first opened. There was an abiding sense the community had done something for the greater good.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/transport-companies-given-fine-free-time-as-ai-powers-inner-west-truck-ban-20251212-p5nn3h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Transport companies given fine-free time as AI powers inner-west truck ban",
    "publish_date": "Sat, 13 Dec 2025 10:21:14 +1100",
    "category": "finance",
    "authors": [
      "Chip Le Grand"
    ],
    "text": "Sensor Dynamics founder Nick Parker said the technology, which had been trialled for the past 18 months, is further advanced from that used on regional highways in NSW or around Sydney’s Port Botany. He said that during the trial of the cameras in Melbourne’s inner west, he was shocked at the size and frequency of heavy vehicles using suburban streets. “You have got lovely residential streets with semi-trailers coming down them,” he said. “It is really no good at all.” Information about trucks detected by the AI-powered cameras will be accessed by the National Heavy Vehicle Regulator. Images captured by the cameras will be analysed by roadside AI and transmitted to an Equinix data centre in Melbourne which the National Heavy Vehicle Regulator, the agency responsible for regulating and licensing all vehicles with a mass exceeding 4.5 tonnes, will access through a secure portal. Parker said information from the cameras would not be uploaded to the cloud or shared with offshore databases.\n\nLoading While the $10.2 billion tunnel project is the headline-grabbing change to Melbourne’s freight industry and roads in the western suburbs, Horne said the government’s decision to lease 29 hectares of the old Melbourne Markets site on Footscray Road for a truck marshalling and container storage facility would also reduce the amount of driving time trucks spend returning empty containers to the port. Most of the container trucks which currently rattle through the inner west are loaded with empties. Horne said the proliferation of 26-metre high-performance freight vehicles (HPFVs) on Melbourne roads and disruption to global freight and logistics caused by the pandemic, as well as how goods are warehoused, had significantly changed the logistics of Melbourne’s freight task from what was envisioned when the tunnel project was first proposed. In 2014, there was just one HPFV registered in Victoria compared to more than 5700 today. The HPFVs, which weigh more than 68.5 tonnes, are too heavy to use the West Gate Bridge.\n\nHorne said Melbourne’s population growth was adding pressure on to the city’s warehousing capacity, as there was an estimated 4.5 square metres of additional warehousing space required for every new resident. “You can see that through the volumes coming through the port,” she said. “They had their biggest year last year with 3.2 million TEUs (20-foot equivalent units) and that trajectory is continuing to grow. Victorian Ports and Freight Minister Melissa Horne. Credit: Joe Armao “That is symptomatic not only of our growing city but that disruption that happened in the supply chain. That hasn’t been a Victorian phenomenon. It’s a global phenomenon.” The idea of a second major road crossing over the Maribyrnong River and dedicated truck routes to the port was first proposed in 2008 by the East-West Link Needs Assessment group chaired by Sir Rod Eddington. In the proposal, daily truck movements in and out of the port were forecast to either double or more than triple from 9000 to between 18,500 and 29,500 by 2035.\n\nThe changing nature of Melbourne’s truck fleet to much bigger vehicles capable of taking more containers has meant that, even though the amount of freight coming into the city has steadily grown, the number of daily truck movements is largely unchanged. The Port of Melbourne, in its soon-to-be published Port Development Strategy for the next 30 years, forecasts truck traffic to and from its docks will grow at between 2 and 3 per cent a year. The government’s most recently published Victorian Freight Plan predicts the freight task to grow faster than the city’s population and more than double between 2020-21 and 2050-51. Sir Rod Eddington in 2020. He says the top recommendations to Melbourne’s transport system he made in 2008 have been realised. Credit: Jason South Eddington said the West Gate Tunnel, despite years of political disagreement about the project, had delivered both the east-west road crossing and key elements of the truck action plan recommended in his report. When added to the Metro Tunnel, which opened this month, the Regional Rail Link built a decade ago and electrification of the Sunbury rail line, the opening of the West Gate Tunnel means the top five recommendations from the seminal Investing in Transport report have been realised.\n\nEddington said that eventually, the final piece of the east-west road project – a tunnel connecting City Link and the Eastern Freeway – would need to be built to take pressure of the Domain and Burnley tunnels. Loading “If you take the Burnley and Domain tunnels out of Melbourne’s infrastructure tomorrow, the city would be gridlocked,” he said. “The bottom line is, you have got to do north of the city what we have done south. It will improve liveability substantially because it takes traffic away from key parts of metropolitan Melbourne and gives much greater certainty to travel times.” Horne, when asked whether she agreed, said the picture would become clearer over the next five years once the North-East Link road project was completed, the Beveridge Intermodal Freight Terminal built north of Melbourne and greater rail capacity to the port established. “Governments into the future will be able to say, ‘What else do we need to do in moving thing around the network?’” she said. “Unless we are doing it efficiently and driving productivity, the city grinds to a halt.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/world/europe/andrew-attends-palace-christening-of-princess-beatrices-daughter-20251213-p5nneb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Andrew attends palace christening of Princess Beatrice’s daughter",
    "publish_date": "Sat, 13 Dec 2025 10:14:01 +1100",
    "category": "lifestyle",
    "authors": [
      "Hannah Furness"
    ],
    "text": "London: Andrew Mountbatten-Windsor and his former wife, Sarah Ferguson, have attended the christening of Princess Beatrice’s daughter – the former prince’s granddaughter – at St James’s Palace in London.\n\nAthena Elizabeth Rose Mapelli Mozzi was christened at a private service for close family and friends on Thursday.\n\nA Range Rover carrying Andrew Mountbatten-Windsor arrives at St James’ Palace on Friday. Credit: GC Images\n\nShe was born on January 22, several weeks premature, and bears the name of her great-grandmother, Elizabeth II.\n\nShe is the second child of Princess Beatrice and Edoardo Mapelli Mozzi, and younger sister to Sienna. Mapelli Mozzi also has a son, Wolfie, to whom Princess Beatrice is stepmother.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/athletics/it-doesn-t-sit-right-sydney-marathon-to-change-ballot-after-local-runners-miss-out-20251114-p5nffi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It doesn’t sit right’: Sydney Marathon to change ballot after local runners miss out",
    "publish_date": "Sat, 13 Dec 2025 09:45:00 +1100",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "The Sydney Marathon will revise its balloting system for the 2027 event after a record number of international applicants resulted in veteran runners being shut out of their local race.\n\nAfter the race gained prestigious World Major status in 2025, the ballot in October for the 2026 event saw 123,000 people vying for 40,000 spots. With no priority given to local runners, thousands missed out.\n\nMark Goodwin with his medals from years of competing in the Sydney Marathon, and one for finishing every major in the world. Credit: Steven Siewert\n\n“That scale of interest from both Australian and international participants means that, unfortunately, some committed runners will miss out in any given year, just as they do in London, New York, Boston, Berlin, Tokyo and Chicago,” a spokesperson for the marathon said.\n\nThe only runners currently guaranteed entry are the six “Blue Line Legends” who have run every Sydney Marathon since the race’s inception in 2001. However, in response to questions from this masthead, race organisers said they would reconsider ballot rules for the 2027 event.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/in-switzerland-they-won-a-goat-now-these-aussie-curlers-want-an-olympic-medal-20251208-p5nlrq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "In Switzerland, they won a goat. Now these Aussie curlers want an Olympic medal",
    "publish_date": "Sat, 13 Dec 2025 09:22:00 +1100",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "“There’s bells everywhere from the goats and the cows, and they made that as their trophy, and we happened to sign it – and we’re happy that we did.” Welcome to the weird, wonderful world of curling – which, for the uninitiated, is essentially lawn bowls on ice, with brooms, infused with intricate chess-level tactical nuance. Dean Hewitt and Tahli Gill in action at Beijing 2022. Credit: Getty Images Signing a goat was an experience Hewitt and Gill won’t forget. But they are keen to create further memories, in pursuit of a far more orthodox sporting prize: an Olympic medal. Hewitt, 31, and Gill, 26, have been on a roll. Last season, they finished top five in every event they competed in bar one. This season, the Australian duo claimed gold at another competition in Bern, won silver medals at both the Colorado Cup and Stirling International, while in May, they collected bronze at the world championships in Canada – the first by any Australian curler in history at that level, although they did fall agonisingly short of direct Olympic qualification.\n\nTheir run of results was enough to boost them to the world No.1 ranking in mixed doubles curling last month; they’ve since slid to No.9, but should they clinch an Olympic berth at the final qualification event in Kelowna, Canada, which runs between December 13-18, they are expected to be in the mix for a medal at Milano-Cortina 2026. That’s some feat, given their chosen sport – the origins of which can be traced to a frozen pond in Scotland in 1511 – barely exists where they’re from. They estimate there are under 200 regular curlers in Australia, whereas a single club in North America or Europe can boast over 1000. Tahli Gill and Dean Hewitt. Credit: AP Modest as their community is back home, they are the faces of it. There are no curling facilities in Australia. It is played on hockey ice, which would be like asking Olympic swimmers to practice in a backyard pool.\n\n“The ice is bumpy,” Hewitt explained. “It’s got hills and valleys and things like that – it doesn’t look like it, it looks very flat, but for curling, it has to be so, so, so flat. And for us to get those conditions, we have to be overseas.” So they spend up to eight months every year abroad, pursuing their dreams, racking up expenses that Hewitt reckons would comfortably sit in the six-figure zone. They’re fortunate they have flexible employment situations: he’s an exercise physiologist who can pick up work in Australia and in Canada, where he is a dual citizen, while Gill is a teacher who does relief work at a school which is very accommodating and understanding of her schedule. “It’s just what you’ve got to do to be at the top,” Hewitt said. Milano-Cortina wouldn’t be their first Olympic appearance, should they make it. Hewitt and Gill also qualified for Beijing 2022, becoming the first curlers to represent Australia on that stage, but their experience was coloured by the pandemic; they couldn’t mingle with other athletes like at a typical Games, while their efforts to stay COVID-free were so mentally exhausting they say it affected their preparations.\n\nPlus, whatever they tried didn’t work: Gill tested positive while in Beijing, and was only able to compete thanks to a late reprieve from Chinese health officials, which allowed her mere minutes to grab her things and get to the curling venue. Loading Since, and partly thanks to the friendly timezone and television exposure in Australia from the last Olympics, they say general interest in curling has skyrocketed – and will grow, should hopes for a dedicated rink come to pass. “Instead of people saying, ‘I don’t really know what that is,’ it’s like, ‘Oh, yeah! I saw that on TV, we had a team,’” Gill said. “We always see a massive influx of people coming and trying curling and wanting to get into [it]. But the biggest challenge that we have is that … we don’t have capacity.”",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/vonn-makes-world-cup-history-20251213-p5nne5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vonn makes World Cup history",
    "publish_date": "Sat, 13 Dec 2025 09:15:28 +1100",
    "category": "sports",
    "authors": [],
    "text": "Vonn makes World Cup history\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/national/victoria/modified-e-bikes-to-be-banned-from-trains-in-victoria-from-next-weekend-20251213-p5nndx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Modified e-bikes to be banned from trains in Victoria from next weekend",
    "publish_date": "Sat, 13 Dec 2025 09:08:41 +1100",
    "category": "finance",
    "authors": [
      "Alexander Darling"
    ],
    "text": "Modified electric bicycles won’t be allowed on Victorian trains – including regional rail services – from December 21.\n\nThe ban, which is aimed at reducing the risk of fires on public transport caused by the vehicles’ lithium-ion batteries, was announced by the state government on Saturday morning.\n\nAn e-bike caught fire on a Melbourne train in March.\n\nA government spokesperson said the ban would not apply to “compliant, factory-built e-bikes and e-scooters”.\n\nHowever, as part of a separate change effective from Sunday, December 21, riders of all e-bikes and scooters will be banned from charging or turning on their vehicles while on trains, trams or buses and in ticketed areas.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/lifestyle/significant-news-king-charles-opens-up-on-his-cancer-battle-20251213-p5nne3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Significant news': King Charles opens up on his cancer battle",
    "publish_date": "Sat, 13 Dec 2025 08:35:22 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "'Significant news': King Charles opens up on his cancer battle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/lifestyle/king-charles-reveals-hes-reducing-his-cancer-treatment-20251213-p5nne0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles reveals he's reducing his cancer treatment",
    "publish_date": "Sat, 13 Dec 2025 08:23:36 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles reveals he's reducing his cancer treatment\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/national/adult-content-creator-banned-from-bali-20251213-p5nndy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adult content creator banned from Bali",
    "publish_date": "Sat, 13 Dec 2025 08:19:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "Adult content creator banned from Bali\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/lifestyle/king-charles-gives-major-cancer-treatment-update-20251213-p5nndw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles gives major cancer treatment update",
    "publish_date": "Sat, 13 Dec 2025 08:09:15 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles gives major cancer treatment update\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/world/king-charles-talks-about-his-cancer-journey-20251213-p5nndu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles talks about his cancer journey",
    "publish_date": "Sat, 13 Dec 2025 07:40:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "King Charles talks about his cancer journey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/national/new-photos-of-trump-at-epstein-s-estate-emerge-20251213-p5nndt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "New photos of Trump at Epstein’s estate emerge",
    "publish_date": "Sat, 13 Dec 2025 07:33:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "New photos of Trump at Epstein’s estate emerge\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/car-ploughs-through-shopfront-in-sydney-s-inner-west-20251213-p5nnds.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Car ploughs through shopfront in Sydney’s inner-west",
    "publish_date": "Sat, 13 Dec 2025 07:32:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "Car ploughs through shopfront in Sydney’s inner-west\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/national/modified-e-bikes-to-be-banned-on-victorian-trains-20251213-p5nndo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Modified e-bikes to be banned on Victorian trains",
    "publish_date": "Sat, 13 Dec 2025 07:28:46 +1100",
    "category": "finance",
    "authors": [],
    "text": "Modified e-bikes to be banned on Victorian trains\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 32
  }
]