[
    {
        "url": "https://www.9news.com.au/national/first-major-australian-oil-province-in-50-years-taroom-trough-open-up/35a25756-6617-4a10-974f-ae2ecda51bde",
        "title": "Oil exploration site 'the size of Singapore' opens up in Queensland",
        "publish_date": "Wed, 11 Feb 2026 01:57:00 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "T﻿hree energy companies have been granted exploration rights for a huge site in Queensland , which could pave the way for Australia's first major oil find in 50 years.\n\nState Minister for Natural Resources and Mines Dale Last says the Taroom Trough, about 300km west of Brisbane, offered \"serious potential to revitalise a domestic oil production industry\".\n\n\"This new exploration area is a critical step in boosting Queensland's domestic energy supplies to put downward pressure on energy prices,\" he said yesterday.\n\nThe exploration area of Taroom Trough in south-west Queensland. (Photo: Omega TN Pty Ltd) (Supplied)\n\nThe 750 square kilometre exploration area – about the same size as Singapore - forms part of a wider package of exploration areas opened for tender last year.\n\nExploration rights to drill for oil and gas have been awarded to energy firms﻿ Omega TN Pty Ltd, Tri-Star Stonecroft Pty Ltd, and Drillsearch Energy Pty Ltd.\n\nAustralian households and businesses would be prioritised for any gas discoveries at Taroom Trough, as per the Australian Market Supply Condition, the state government says.﻿\n\nAustralian Energy Producers, which represents oil and gas producers, says the move has the potential to unlock the country's first major new oil province since the 1970s.\n\n\"Opening up new basins like the Taroom Trough is essential to securing Australia's next wave of oil and gas supply,\" he said.\n\n\"It sends a strong signal Queensland is open for business and serious about attracting the investment needed to support regional jobs and future energy security.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-politics-superannuation-tax-changes/65f1d495-0758-4105-b2bb-4d4e11cee28f",
        "title": "More than a million Aussies on verge of major superannuation boost",
        "publish_date": "Wed, 11 Feb 2026 01:55:17 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "The federal government is taking a second crack at reforming superannuation in a move that would give more than a million low earners a retirement boost while hitting the nation's wealthiest with a higher tax rate.\n\nTreasurer Jim Chalmers this morning introduced the Better Targeted Superannuation Concessions bill to parliament.\n\nIf passed, the new laws would change how superannuation is taxed for two groups of Australians at opposite ends of the wealth spectrum: about 90,000 people with the highest super balances, and roughly 1.3 million of the nation's lowest-paid workers.\n\nThe government is attempting to pass major changes to the superannuation system for the second time. (Louie Douvis/AFR)\n\nFor the latter, the government is hoping to expand the threshold for the low-income superannuation tax offset (LISTO).\n\nIn its current form, the LISTO offsets the tax paid on superannuation for anyone earning less than $37,000 a year, effectively ensuring super is still tax-effective for Australians on low incomes.\n\nUnder the proposed new law, the threshold for the offset will be raised to the top of the second income tax bracket – which currently sits at $45,000 – covering an additional 1.3 million workers.\n\nAccording to the Association of Superannuation Funds of Australia (ASFA), that change will deliver someone on $44,000 a year close to an extra $50,000 in their super balance by the time they retire.\n\nTreasurer Jim Chalmers introduced the new laws to parliament this morning. (Alex Ellinghausen)\n\n\"Our reforms to the low-income superannuation tax offset will help deliver a more secure retirement for more than a million Australians, mainly young people and women,\" Chalmers said.\n\n\"These changes will help make the super system fairer from top to bottom.\"\n\nAlongside the higher LISTO offset, the bill also increases the tax rate on superannuation earnings for accounts with more than $3 million.\n\nThis will impact the top 0.3 per cent of super account holders – a total of about 90,000 people.\n\nInstead of the current flat concessional tax rate of 15 per cent, the bill proposes raising the tax rate on earnings for super accounts with a balance of between $3 million and $10 million to 30 per cent, and to 40 per cent for accounts worth more than $10 million.\n\nThe increased tax rates won't apply to an account's entire earnings – only to the proportion of the balance over each of the new thresholds.\n\nThe government says about 14 times as many people will benefit from the higher LISTO threshold than those who will pay a higher tax rate on their superannuation earnings. (Glenn Hunt/Fairfax Media)\n\nCombined, the changes will generate about $1.6 billion in extra tax revenue for the federal budget per year.\n\nThe introduction of today's bill comes after an aborted attempt to pass similar legislation during the last parliament and following May's federal election, when the government faced significant criticism , particularly on the proposal to tax unrealised gains and a refusal to index the thresholds for the higher tax rates.\n\nBoth of those elements of the laws have since been scrapped – the current bill only includes a higher tax for realised earnings, and the $3 million and $10 million thresholds will be indexed.\n\nDespite the changes, the passage of the current bill is uncertain. The Coalition opposes the changes, meaning the government will require support from the Greens to get the laws through the Senate.\n\nMORE TAX CHANGES: $23 billion break could be overhauled in matter of months ﻿\n\nAccording to the Australian Financial Review , the minor party could demand more stringent measures targeting wealthy accounts in exchange for its backing.\n\nHowever, ASFA has encouraged the Greens and opposition to back the legislation.\n\n\"Together, these changes make super tax settings fairer and more sustainable,\" chief executive Mary Delahunty said.\n\n\"I encourage the parliament to pass the legislation without delay.\n\n\"Aussie workers on low incomes cannot wait another day for the fairness that this package delivers to them.\"\n\nIf passed, the higher tax rates on wealthy accounts will come into effect on July 1, while the LISTO boost will follow a year later.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gold-silver-purchases-can-cause-trouble-at-tax-time/fd653739-2364-4711-9f62-1a93490b9f60",
        "title": "Why investing in gold and silver can trip you up at tax time",
        "publish_date": "Wed, 11 Feb 2026 01:02:32 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "It was one of the biggest financial trends of 2025 and it doesn't appear to be changing in 2026: investors worldwide buying up ﻿ gold and silver as a hedge against growing economic instability.\n\nBut it can come back to bite you at tax time.\n\nH&R Block Australia director of tax communications Mark Chapman said precious metals had a \"special place\" in Australian portfolios, but were also among the most commonly misunderstood assets﻿ from a tax perspective.\n\nThere is a surge of interest in gold amid market instability. (Getty)\n\n\"Many investors assume gold and silver are taxed like shares, or that physical bullion is 'private' and therefore outside the ATO's (Australian Taxation Office's) line of sight,\" Chapman said.\n\n\"Others believe that because these assets do not produce income such as dividends or rent, they must be treated differently.\"\n\nHowever, he said, the reality was that gold and silver sat squarely within Australia's ﻿capital gains tax (CGT) framework.\n\nSilver is also popular. (Getty)\n\nAnd the tax outcome can vary depending on what is purchased, why it is purchased, and how it is held.\n\nCGT assets include physical bullion bars, bullion coins, allocated and unallocated bullion accounts, gold and silver exchange-traded funds (ETFs) and shares in precious metal funds.\n\nChapman said if gold or silver was bought as an investment and later sold for more than its cost, the profit will usually be subject to capital gains tax.\n\nMany people misunderstand how tax treats gold and silver. (Getty)\n\n\"H&R Block sees a common misconception among investors that holding bullion privately removes tax exposure,\" he said.\n\n\"In practice, tax applies regardless of whether the ATO is immediately aware of a transaction.\n\n\"CGT is triggered when the asset is disposed of, including when bullion is sold, gifted, exchanged, or transferred to another entity. Record keeping is critical, as investors who cannot substantiate their cost base often end up paying more tax than necessary.\"\n\nGlobal markets have been unstable. (Bloomberg)\n\nSome gold and silver coins may also fall under the collectables rules, particularly where they have numismatic or collector value.\n\nChapman cautioned that losses on collectables can generally only be offset against gains from other collectables, limiting their usefulness compared to other investment losses.\n\n\"While there are personal use asset exemptions under the tax law, H&R Block notes that investment gold and silver will usually not qualify. Where the asset has been acquired as a store of value or for investment purposes, it is unlikely to be considered a personal use asset,\" Chapman said.\n\nREAD MORE: Grisly discovery in search for missing backpacker in Tasmanian bush\n\n\"For individual investors and trusts, the 50 per cent CGT discount can be a key tax advantage where gold or silver is held for more than 12 months. Companies, however, are not eligible for the discount.\"\n\nAnother important consideration he flagged was the distinction between an investor and a trader.\n\nWhere there is frequent buying and selling with a clear profit-making intent, gains may be treated as ordinary income rather than capital gains, removing access to the CGT discount and changing the overall tax outcome.\n\n\"Gold exposure through ETFs and pooled products is generally taxed under normal CGT rules, but outcomes can differ depending on the legal structure of the product,\" Chapman said.\n\n\"H&R Block recommends investors carefully review product disclosure statements and annual tax statements before assuming the tax treatment.\"\n\nFor self-managed super funds (SMFs), additional compliance considerations apply, including storage, documentation, valuation, and investment strategy alignment.\n\nWhile Chapman said CGT still applies within super, the effective tax rate may be lower for assets held longer than 12 months, but ATO scrutiny in this area remains high.\n\n\"Gold and silver may feel like simple investments, but as H&R Block often sees in practice, the tax treatment can be complex,\" Chapman said.\n\n\"The focus should not be on trying to avoid tax, but on structuring investments correctly and maintaining records so the right amount of tax is paid – and not more.\"\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/the-united-strand-frank-ilett-hair-manchester-united-fan-500-day-long-wait-for-haircut-continues/d7db5aae-9950-4c5f-95c0-76dc684382bb",
        "title": "Football fan's 500 day-long wait for a haircut continues despite late equaliser",
        "publish_date": "Tue, 10 Feb 2026 23:51:58 +0000",
        "category": "sports",
        "authors": [
            "Feb"
        ],
        "text": "While all football fans want their team to win every game, one Manchester United fan had extra reason to be hoping for a win this morning.\n\nFrank Ilett, better known by his social media moniker The United Strand, has gained fame in football circles for refusing to give himself a haircut until his beloved Red Devils win five games in a row.\n\nIllet made the pledge on October 5, 2024, but Manchester United's failure to live up to their end of the bargain means it has been nearly 500 days since he has been able to get a trim.\n\nFrank Ilett's afro has become iconic in football circles. (Instagram/@TheUnitedStrand)\n\nHe has gained a large following and notoriety on social media in the last year and a half, garnering 1.3 million followers on Instagram as he shares regular updates about his hair growth.\n\nHis unruly locks, a significant change from his previous hairstyle, has now become famous, but it could soon be a thing of the past.\n\nIlett's hair before he made the pledge. (Instagram/The United Strand)\n\nManchester United have finally found some good form, four games in a row in all competitions.\n\nThat meant there was a massive chance Illet's wait would end if they could beat relegation battlers West Ham United this morning.\n\nManchester United's failure to win means Ilett's wait for a haircut will span well over 500 days. (Getty)\n\nSuch was the anticipation of the drought potentially breaking, Ilett even live streamed a watch along for the game.\n\nHowever, the drought was not broken, as Manchester United could only salvage a 1-1 draw late on thanks to a stoppage time goal from Benjamin Sesko, having been trailing for much of the second half at the London Stadium.\n\nThis means the clock resets, and Ilett's wait for a trim will extend well over 500 days﻿. Given Manchester United's inconsistencies, it could even span into the two year mark.\n\nIlett has said when the time finally comes to shave off his iconic hair do, he will donate the hair to charity.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-gen-z-saving-money-finance/2997d3ed-70ca-4f75-8f05-8fd79a32ce5c",
        "title": "Have Gen Z finally defied the smashed avo stereotype?",
        "publish_date": "Tue, 10 Feb 2026 21:32:00 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "Nearly 90 per cent of Generation Z Australians aged between 18 and 29 years-old are actively putting\n\nmoney\n\naway, according to new data released by\n\nNAB\n\nthis morning.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/cost-of-living-housing-crisis-to-blame-australia-birth-rate-dropping/3920c79b-1c85-4034-a750-d2f4703261c8",
        "title": "Aussies on good money are being priced out of parenthood",
        "publish_date": "Tue, 10 Feb 2026 18:31:10 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "Exclusive: Australians say the soaring cost of living, including groceries, schooling and housing, is holding them back from having a second child or starting a family at all.\n\nThe national median house price is $1.28 million, median rent is $650 per week, and the price of groceries, food, energy and insurance is through the roof.\n\nCasey Gardiner, a 36-year-old who owns a home in Queensland, tells nine.com.au that she and her partner can't afford children.\n\nGardiner wanted a child but has had to accept she just can't afford one. (Getty Images/iStockphoto)\n\nBoth work odd hours that most childcare doesn't cover, so they'd have to fork out thousands for private childcare services in their child's first few years.\n\nThat's on top of a mortgage, bills and groceries.\n\n\"The maths didn't work,\" ﻿Gardiner told nine.com.au.\n\n\"I'm sure we could have made it work, like so many people have done before, but that's a lot to ask without a village.\"﻿\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nMany Aussie families are only making ends meet because they have help from family, whether it's cash for groceries or free babysitting.\n\nThat's not an option for Gardiner.\n\nHer in-laws don't live close by and her parents made it clear they won't be babysitting, despite pushing for grandchildren in the past.\n\n\"That stopped after I pointed out the cost and impracticality of childcare without routine family help,\" she said.\n\nShe says the only way forward for couples like her and her spouse would be if ﻿Australia introduced free, flexible childcare options.\n\nResearch suggests it can cost more than $200,000 to raise a child in Australia, so it's not wonder Aussies are being priced out of parenthood.\n\nAn Australian Institute of Family Studies report from 2018 put the weekly costs of raising a child range at $140 for unemployed families and $170 for low-paid families.﻿\n\nAdjusted for inflation, that's ﻿about $176 per week for unemployed families and $214 for low-paid families.﻿\n\nAdd that up over 18 years and those families are looking at investing ﻿more than $164,000 and $200,000 into raising one child.\n\nBased on the available data, Australian families can expect to spend in the low six figures in the first 18 years of a child's life – and that's if they only have one.\n\nFamilies with two or more children can expect to cough up a lot more.﻿\n\nREAD MORE: This surgical procedure is booming in Australia as cost of living bites\n\nGardiner is not alone. Having a second child just isn't an option for Barbara Brayovic, 34, no matter how badly she wants one.\n\nShe and her husband ﻿barely made ends meet when their son was born in 2022.\n\n\"It was hell the first year, financially﻿﻿,\" Brayovic told nine.com.au.\n\nEven though her husband works full-time, covering mortgage payments, groceries and other bills on a single income was a challenge.\n\nBrayovic and her husband barely scraped by when they had their first child. Having a second isn't an option. (Getty)\n\nBrayovic is now ﻿working part-time and their son gets three days of subsidised child care per week, but the budget is still tight.\n\n\"I would love to be able to just stay home and take care of my child and not have to work but it's unrealistic,\" she said.\n\nThat's partly because when she ﻿applies for support, she's assessed based on household income (though her husband is taxed as an individual).﻿\n\nTaking on more work isn't an option either, as any additional income would barely cover the cost of extra childcare.\n\nLuxuries like family holidays and manicures are off the table﻿, and Brayovic has to be thrifty with even the essentials.\n\n\"We've got different grocers and butchers around us that I double-check all the specials before I go and buy things,\" she said.﻿\n\nHaving to feed an extra mouth just isn't feasible right now, no matter how much she'd like to giver her son a little brother or sister.﻿\n\n\"It just makes me so sad that he's by himself.\"﻿\n\nBrayovic can't afford to give her young son a little brother or sister. (Getty)\n\nThese stories are heartbreaking but not uncommon.\n\nBianca*, 40, and her husband own a home, are on good salaries, and are about to have their first child.\n\nThey won't be able to afford a second even when she returns to work.\n\n\"Having two children seems to be a luxury reserved for the wealthy,\" she told nine.com.au.\n\nImogen*﻿, 29, and her fiancé earn good money but have postponed having children due to finances.\n\nShe wants to be at home with her children in their formative years but the family won't survive on a single income.﻿\n\nAndrea*, 22, wants to own a home before thinking about kids but current housing prices mean she'll be waiting a long time.\n\n﻿Nadia*, 36, had the same approach but now she and her partner own a home, they can't afford a family on top of the mortgage.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ai-at-work-policy-termination-exclusive-poll/428a1505-b2e9-45e8-918d-14cdbe630b8a",
        "title": "Aussie workers could risk losing their jobs with this AI blunder",
        "publish_date": "Tue, 10 Feb 2026 01:16:45 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "Exclusive: Only one in three Australian workers know if their employer has an artificial intelligence use policy, let alone what it entails, according to a nine.com.au reader poll.﻿\n\nThat could cause major problems, including possible termination, for workers who are found to have used AI in a way that ﻿breaches their employer's AI use policy.\n\n\"Consequences will generally follow the same logic as any other workplace policy breach,\" Giuseppe Carabetta, an associate professor of workplace and business law at the University of Technology Sydney, told nine.com.au.\n\nAussie workers could be risking termination by using AI without knowing their employer's policy. (Nine/Getty)\n\n\"The Fair Work tribunal has upheld dismissals where employees breach data handling, privacy, social media, and information security policies.\"﻿\n\nOf the poll respondents who are currently employed, close to 20 per cent admitted they use AI at work at least daily.\n\nOf these people, nearly half admitted they rely on it multiple times a day.\n\nA futher 19 per cent said they use AI weekly, while more than 60 per cent said they never use AI on the job.﻿\n\nOf those who do use AI at work, the majority said they only use ChatGPT, Google Gemini, and other ﻿AI tools for minor tasks like writing emails and checking spelling.\n\nNearly one in three use AI to produce work like reports and presentations.\n\nAbout 10 per cent use it for other tasks like translating, researching, writing feedback, producing artwork and \"finding answers to questions asked by customers\".\n\nA little over 10 per cent admitted their employer is unaware of their AI use at work and 15 per cent are unsure if their boss knows they use AI.\n\nMore concerningly, only 32 per cent of Aussies who use AI at work actually know if their employer has an AI use policy and what it entails﻿.\n\n\"Even without a policy, an employer could still discipline an employee if AI use caused a privacy breach, disclosure of confidential information, reputational damage, or unsafe or discriminatory outcome,\" Carabetta said.\n\nIf there's no AI policy, workers ﻿can protect themselves in a few ways: never put confidential information into public AI tools; only ﻿use employer‑approved or 'secure' AI systems; and follow any other existing employer policies.\n\nIf in doubt, workers can also ask ﻿an authorised manager what AI use is permitted.\n\n\"If the worker knew the rules and ignored them, then even a first offence may justify termination,\" Carabetta said.\n\n\"Especially where confidentiality or client trust is undermined.\"\n\nThe nine.com.au poll, which runs once a fortnight, canvases the views of the Nine audience on 9Nation, which is an online community of our readers and viewers.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/winter-olympics-2026-daily-guide/106325628",
        "title": "Winter Olympics 2026 quick guide: What to watch",
        "publish_date": "Wed, 11 Feb 2026 02:09:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "What's on?\n\nThe snowboard halfpipe qualifiers bookend the day. At 8:30pm AEDT, look out for Australians Emily Arthur and Amelie Haskell ; before two-time medallist Scotty James and Val Guseli represent in the men's qualification from 5:30am AEDT .\n\nqualifiers bookend the day. At look out for Australians ; before two-time medallist represent in the men's qualification . At 9pm AEDT is the Aussie hopefuls Charlotte Wilson and Emma Bosco have a second chance to reach the moguls final, starting at 12:15am AEDT , with defending champion Jakara Anthony already effectively locked in.\n\nis the Aussie hopefuls have a second chance to reach , with defending champion already effectively locked in. The women's 15km individual biathlon also starts at 12:15am AEDT , with Darcie Morton representing Australia in her first Games.\n\nalso starts at , with representing Australia in her first Games. Holly Harris and Jason Chan wrap up their figure skating program with a free dance to Clair de Lune from 5:30am AEDT .\n\nwrap up their program with a free dance to Clair de Lune from . And for something a bit different, try the Nordic Combined event at 11:45pm AEDT, which combines cross-country skiing with ski jumping.\n\nStay across the action\n\nGet the latest: Winter Olympics day four: Injuries hit Australia hard in Italy Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nOtherwise, you can stream the games live on 9Now or Stan Sport.\n\nGive me more",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/savannahlander-future-uncertain-etheridge-railway-line-bridge/106327582",
        "title": "Flood ruins $500k Savannahlander bridge repair before it is used",
        "publish_date": "Wed, 11 Feb 2026 01:37:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "An outback tourist rail line has been damaged by severe weather before a train ever got the chance to cross a bridge that cost more than $500,000 to repair.\n\nFlooding appears to have bent the Copperfield Gorge wooden trestle bridge at Einasleigh, 250 kilometres south-west of Cairns, weeks after it was fixed.\n\nThe bridge in November 2025, just after the Queensland government spent $500,000 for it to be straightened. (Supplied: The Savannahlander)\n\nIt is the gateway to the final section of the Queensland heritage-listed Etheridge Railway Line, which completes the full 425km journey of the Savannahlander train from Cairns through tropical rainforest to the Gulf Savannah.\n\nAs it stands, the train departs Mareeba and terminates in Wirra Wirra, just shy of Forsayth.\n\nFlooding engulfed the bridge in January. (Supplied: Einasleigh Hotel)\n\nThe flood is the latest impact to the line after disasters in 2023 and 2024, raising concerns it might never run uninterrupted from Cairns to the railhead at Forsayth again.\n\nQueensland Rail estimates the maintenance bill over the next decade could be up to $300 million before any damage bill from flooding.\n\nThe Savannahlander, the line's only user, can transport 3,000 to a maximum of 4,500 passengers annually when it is operational, due to limited accommodation in the outback region.\n\nThe Savannahlander approaches the bridge from the east before entering Einasleigh town in 2023. (Supplied: kevinexplores.com.au)\n\nRecent photos show the bridge was impacted by flooding from heavy rain over Copperfield Dam on January 27.\n\nSavannahlander driver Wil Kemp said it appeared the bridge may be out of alignment which was \"probably a good indicator that there's a lot more serious damage going on\".\n\nThe bridge is damaged underneath, with a cracked upright and part of the deck shunted off the metal frame. (Supplied: Nardeen Hayden)\n\nHe said he was devastated to see the images of the bridge damaged so soon given the effort required to secure funding, which included a petition to the state government.\n\nBut Mr Kemp remained optimistic and said the bends \"don't look as bad\" as last year.\n\n\"It's still standing, so that's got to be a win,\" he said.\n\nQueensland Rail is due to assess the damage to the bridge, but it is not clear when that will be completed.\n\nThe Savannahlander's first tour starts from Mareeba on March 4.\n\nThe Copperfield River passes through Copperfield Gorge under the trestle rail bridge. (Supplied: kevinexplores.com.au)\n\nLNP Cook MP David Kempton said he would lobby for a solution, but not before the damage had been checked.\n\n\"We do need to know what exactly it's going to cost to fix it,\" he said.\n\nWil Kemp says the unexpected rehoming of the Savannahlander to Mareeba Train Station has breathed new life into the area. (Supplied: kevinexplores.com.au)\n\nGulf-Savannah Development chief executive Neil O'Brien said he estimated the train journey supported 25 jobs and contributed $4.6 million annually to the local economy, not least because of the heritage attraction of the 2000-class Queensland rail motor.\n\nMr O'Brien said it could cost $6.2 million to get a partial line operational between Kuranda and Mareeba.\n\nBut he said the region and tourists would miss out if full repairs were not completed.\n\n\"Which will have a significant detriment to the Gulf visitor economy,\" he said.\n\nA Queensland Rail spokesperson said damage along the line had been compounded by its age and remote location.\n\nA map of the Tablelands rail system showing closures in red for the 2025 season. (Supplied: Queensland Rail)\n\nTraeger MP Robbie Katter said the train was \"a key component\" to regional tourism.\n\n\"People in Brisbane might think, 'Not many people live up there, who cares? It's a remote area', but it's everything. It's a real centre of tourism,\" he said.\n\nThe Savannahlander last crossed the Kuranda Range under its own steam in 2023 before ex-Cyclone Jasper destroyed infrastructure. (Supplied: kevinexplores.com.au)\n\nQueensland Transport Minister Brent Mickelberg said about $5 million was spent on the Mareeba to Forsayth line each year.\n\nHe said in the 2026 financial year, $7.1 million would be spent maintaining the Mareeba to Einasleigh line, which included supporting coach services.\n\nIn response to a petition to parliament, Mr Mickleberg said the $300 million repair figure \"requires careful consideration\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/perth-festival-opens/106328574",
        "title": "Perth festival opens with stories 'of the heart' shared via old red phone",
        "publish_date": "Wed, 11 Feb 2026 01:32:57 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Australia's longest running arts event, the Perth Festival, opened at the weekend with outdoor music, a series of light sculptures and social media videos in which people share \"what rests in their hearts\" using an old red phone on a bridge.\n\nFor decades, the Perth Festival (previously known as Perth International Arts Festival) has opened with a large-scale free public event, reaching an all-time high in 2015 when the artistic director found more than $5 million to bring two giant puppets to the Perth CBD, drawing 1.4 million visitors to the city streets.\n\nIn 2018 and 2019, Boorna Waanginy: The Trees Speak, opened the festival with a sound and light projection on the tree canopy of Perth's Kings Park celebrating Noongar culture, and attracted more than 100,000 people over four days.\n\nIn subsequent years, more opening events were planned but derailed by COVID restrictions, and since the pandemic Perth Festival openings have been smaller in scale.\n\nCrowds at Casa Musica, outside the East Perth power station, enjoy a free performance. (Supplied: Perth Festival/Jessica Wyld)\n\nThis year the opening event has gone online, with the festival commissioning British artist Joe Bloom to bring his video series A View from a Bridge to Perth.\n\nThe concept is a kind of Humans of New York in video form. Perth participants talk into an old-fashioned telephone handset while standing on a bridge.\n\nFrom a distance, Bloom talks to his subjects to draw out their story (although his voice is removed in the edit) while filming them from a long distance, slowly panning out as they go on.\n\nTeenage triplets record their interview with Joe Bloom in the A View from a Bridge project. (ABC News: Emma Wynne)\n\nThe videos are then edited into 3-minute stories and published on Instagram.\n\nSpeaking to the ABC when the program was announced, artistic director Anna Reece agreed it was a long way from a free concert that people could take a picnic to and enjoy with their friends.\n\n\"I can't pretend that the festival's, you know, going to make everyone happy, especially if that's your experience and what you've loved about a festival,\" she said.\n\n\"Joe Bloom's got hundreds of thousands of followers, he has millions of hits and I just love the idea that we add to his collection.\n\n\" He'll spend a week filming our beautiful bridges, our everyday people, capture their stories and so we'll create this wonderful collection of Western Australian stories and places but it will be beamed back to the rest of the world to see. \"\n\nJoe Bloom describes the video series as \"a sort of a moving painting\". (ABC News: Emma Wynne)\n\nLifting the red receiver\n\nA View from a Bridge is described on the program as comprising an old red telephone on a bridge that \"invites you to lift the receiver, look out at the view and share what rests in your heart\".\n\nLoading Instagram content\n\nIn fact, the red receiver was connected to a mobile phone so it allowed easy connection between Bloom and his subject. A number of the interviews were pre-arranged, with participants meeting Bloom and his producer Molly Hackney to talk through the process and fit them with a lapel microphone.\n\nFilming was completed in January and the stories have now begun to roll out online, starting with Richard Walley speaking from the Kings Park treetop walk about his experience, as an Indigenous child, seeing his friends being removed from their families.\n\nThe second is the story of mother whose son died at four months old, and the decision to donate his organs, saving other babies' lives.\n\nBloom, who is also known for his paintings, described the pieces as \"a sort of a moving painting because it's one fixed image and throughout 3 minutes, things are coming in and out, but one thing that remains the same is that there's a person standing in the centre of it holding this bizarre old red phone and telling a story\".\n\nOver the two years Bloom has been filming his stories, he has garnered a following of more than 600,000 on the project's Instagram account and is now planning a podcast to give the interviews a longer life.\n\nJoe Bloom says your horizons are broadened when you stand on a bridge. (ABC News: Emma Wynne)\n\nHe said the reason he filmed people standing on bridges was because it seemed to fit with the stories he was trying to draw out.\n\n\"Maybe it's a bit gimmicky to say but when you're on a bridge one's horizons are broadened right?\" he told Jo Trilling on ABC Radio Perth.\n\n\"You could be in a really busy city — really tall buildings or trees and cars everywhere — and you go to a bridge and stand in the middle and not only are your horizons broadened in the physical sense but also in this metaphysical brain space.\n\n\"You're not in a place, you're between places.\n\n\"It's an in-between space where I think our brain allows us a bit more time and space really to just sort of open up and be free and to look up around you and feel small.\"\n\nMany days for picnics\n\nFor people who prefer their free festival experiences to be offline, Reece points out that \"what we're offering now is many days for many picnics to be held, to come down to a whole bunch of different locations across the festival, across the city, to really soak up the summer and arts and culture that takes over all these beautiful places\".\n\nThese include Casa Musica, the outdoor music venue by the Swan River at the East Perth power station, which has a series of free music performances every Thursday to Sunday during the festival, as well as a light projection designed by Bibbulmun Noongar/Budimia Yamatji artist Lance Chadd Tjyllyungoo.\n\nOne of the 11 light sculptures that make up Karla Bidi. (Supplied: Perth Festival/Jessica Wyld)\n\nAlso running through the festival is Karla Bidi, a series of light sculptures placed at 11 locations along the Derbarl Yerrigan (Swan River), symbolising the fires Noongar people would light in pre-colonial times to welcomes visitors to country and offer light, safety and warmth.\n\nEach sculpture has a soundscape created by First Nations artists under the guidance of Noongar elders. The show runs every evening until March 6.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/winter-olympics-2026-milan-cortina-nordic-combined-inequality/105991114",
        "title": "The only Olympic sport that doesn't let women compete starts tonight",
        "publish_date": "Wed, 11 Feb 2026 01:01:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "The 2026 Olympics are being hailed as the most gender-equal Winter Games in history.\n\nThe International Olympic Committee (IOC) said these Games — held across northern Italy — would boast 47 per cent female participation, with a record 50 women's events on the program.\n\nNo, it's not quite the full gender parity the Summer Olympics in Paris achieved in 2024 — it has only been 102 years since the first Winter Olympics, after all — but it is another significant step forward.\n\nGet the latest: Winter Olympics day four: Injuries hit Australia hard in Italy Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nAs then-IOC president Thomas Bach said in 2022: \"We are committed to continuing to advance gender equality, and Milano Cortina will be another key milestone in this endeavour.\"\n\nThere remains one glaring outlier, though.\n\nThe historic sport of Nordic Combined, with over 100 years of Olympic heritage, remains an exclusively male domain — the only sport in the entire Olympic family that remains in a sporting dark age.\n\nWhat is Nordic Combined?\n\nNordic Combined consists of a ski jump and a cross-country ski element. (Getty Images: NordicFocus/Leo Authamayou)\n\nAccording to American skier Annika Malacinski, Nordic Combined is \"one of the most bad-ass sports\" around — and it's easy to see why.\n\n\"Most athletes train for one sport and one sport only,\" Malacinski told ABC Sport from where she is based in Finland.\n\n\"But what's so crazy and cool about Nordic Combined is that we are training for two completely different sports … you are supposed to stay light for ski jumping, and also have the energy and muscle to ski really fast.\n\n\"This is a cool sport. The ski jumping … also the fight for the victory in the cross-country, that's just so cool on its own.\n\n\"It makes me so happy that I can show other people how cool this sport is.\"\n\nAnnika Malacinski was a teenage gymnast with an Olympic dream, a dream that still burns bright despite the authorities dragging their feet. (Getty Images: NordicFocus/Sandra Volk)\n\nContested in a single day (starting tonight at 7:10pm AEDT), athletes start by leaping to earn points for distance and style on the ski jump in the morning, displaying precision, power and explosive strength in a nerve-shredding battle against gravity.\n\nThe points earned in the ski jump translate to a time advantage at the start of a lung-busting endurance cross-country ski race, setting up a thrilling handicap-style sprint to the line for victory.\n\nIt is one of the Winter Olympics' original events, having appeared at every Games since 1924 in Chamonix.\n\nThe sport's roots date back even further than that, though — the first-ever competition took place at Oslo's historic Holmenkollen Ski Festival in 1892 to identify the best all-round skier.\n\nNordic Combined is big news in Norway, which is perhaps why the nation has dominated the event at the Olympics, winning a total of 15 gold medals.\n\nJørgen Graabak of Norway is a member of one of just four nations to be represented on the Olympic podium at the last three Games. (Getty Images: VOIGT/DeFodi Images/Tom Weller)\n\nEven the discipline's foothold in America boils down to the visit of Norwegian legend Karl Hovelsen to Steamboat Springs, Colorado in about 1910, where he established a ski jump hill and cross-country trails. Steamboat Springs, as well as being the hometown of Malacinski, is now known as Ski Town USA.\n\nGermany and its various iterations (West Germany, East Germany and the United Team of Germany) are also considered a powerhouse nation, winning a combined 12 golds, with Finland (4), Austria (3) and Japan (2) the other Olympic medal winners — which is, admittedly, not an enormous spread of nations to have succeeded at the highest level.\n\nIncidentally, Australia has only ever had one Nordic Combined athlete compete at an Olympics. Hal Nerdal, a Norwegian who moved to Australia to work on the Snowy Hydro scheme in the 1950s, finished 31st out of 33 at the 1960 Games in Squaw Valley, USA.\n\nCoincidentally, those Games were the first where a Nordic nation did not win gold, with German legend Georg Thoma ending Norway's run of six wins in seven Games (Finland's Heikki Hasu won the other event in 1948).\n\nA gymnast's Olympic dream turned sour\n\nLoading Instagram content\n\nMalacinski was a relative latecomer to Nordic Combined.\n\nThe now-24-year-old only took up the sport when she was 16 after previously dabbling in a variety of sports, including competitive gymnastics.\n\nIt was the thrill of ski jumping that got Malacinski interested in Nordic Combined in the first place. Her younger brother, Niklas, had already started in the sport and, on account of her Finnish mother and ski-instructor father, she had a solid grounding on skis: \"There's so much Nordic in me and my blood,\" Malacinski explains.\n\nDespite that grounding, perhaps it's only reasonable that she would take to the skies, sparked by a major event in Steamboat Springs.\n\nNiklas Malacinski also competes on the Nordic Combined World Cup circuit. (Getty Images: NordicFocus/Federico Modica)\n\n\"I committed to gymnastics very heavily at 12, and then at 16, ultimately decided that I had to be done with it,\" Malacinski said.\n\n\"So I went through this period of time that I just didn't know what I was doing in life … I was honestly depressed. I didn't know what I wanted to do.\n\n\"On 4th of July in Steamboat Springs, we have this huge [ski jumping] event called Jumpin' and Jammin', it's super fun, the whole town comes and watches.\n\n\"I remember watching my brother, he was 14 at the time, and he almost won out of a bunch of 20-plus-year-olds.\n\n\"Sitting there, I was just like, 'Would it be crazy if I just went off one of those things?'\"\n\nTo anyone who has ever seen a ski jump up close, the answer to that question is undoubtedly, yes, but Malacinski decided to give it a go anyway — and she's not looked back since.\n\nAs Malacinski developed in the sport, her thoughts inevitably turned back to one of the things she dreamed about doing as a gymnast, competing at an Olympic Games and becoming an Olympian.\n\nIncredibly, despite being one of the top Nordic Combined skiers in the world, she's no closer to achieving that dream.\n\nWhy is Nordic Combined men-only?\n\nWomen were, supposedly, not physically able to ski jump. (Getty Images: VOIGT/Christian Bruna)\n\n\"Me and my brother do the same sport. We compete at the same competitions and yet, because he is a man, he is allowed to go compete at the Olympics and I'm not,\" Malacinski said.\n\n\"That, in my head, is just already so ridiculous living in 2025 and going into 2026.\n\n\"I want to show the IOC that they made a horrible mistake in underestimating us.\"\n\nShe's unlikely to be the only one, so why is Nordic Combined still men-only?\n\nNordic skiing has decidedly militaristic origins — it started as a way for Norwegian and Swedish soldiers to practice their skiing skills in the late 19th century — which perhaps offers one explanation as to why a misogynistic mindset has prevailed for so long.\n\nThe other reason boils down to the same nonsensical sexism that held female athletes back in so many other sports.\n\nThe biggest initial obstacle was ski jumping, which women had been barred from competing in until the early 2000s — despite, bafflingly, frequently being used to test hills prior to men being allowed to jump in competition.\n\nSimply put, it was deemed that women were too fragile to stand up to the rigours of repeatedly hurtling themselves off the side of a mountain.\n\nSki jumping is mad, however you look at it, but it's no less mad if you're a man or a woman. (Getty Images: picture alliance/Silas Stein)\n\nHow was such an outdated view allowed to persist for so long?\n\nThe attitude of former International Ski Federation (FIS) president Gian-Franco Kasper offers one suggestion, after he told National Public Radio that ski jumping \"seems not to be appropriate for ladies from a medical point of view\".\n\nIncredibly, he made those comments in 2005.\n\nThat was bad enough, but there was worse.\n\nAmerican ski jumper Lindsey Van was once infamously warned by an unidentified person that her uterus would fall out while she was competing, while Malacinski recalled being told women should not ski jump \"because they thought our ovaries would explode\".\n\nLindsey Van won a world championship title, competed in 37 World Cup events and at the Winter Olympics — and her uterus didn't even fall out once, despite the baffling suggestion that it might. (Getty Images: Lars Baron)\n\nNeedless to say, much like the pioneering women's Marathon runners who were threatened with similar consequences from a bevy of pseudoscientists during the 20th century, neither of those things has happened.\n\nThe discourse had taken place while female ski jumpers fought to be allowed to compete at the Olympic Games, a battle that started in 1998 and finally came to fruition in 2014, just five years after women were finally granted their own World Cup series.\n\nSki jumping's death-defying spectacle a Winter Olympics highlight In one of the most visually spectacular sports on the planet, ski jumpers perform death-defying feats each time they descend the ramp.\n\nEven then, though, it's only at these 2026 Games that women will be allowed to leap off the large hill at an Olympics, having previously been limited to the smaller, normal hill — for reference, the size of the normal hill at the iconic Zhangjiakou Snow Ruyi is 106 metres, while the large one is 140m.\n\nThe delay in giving women the same opportunities as their male counterparts in ski jumping had an understandable knock-on effect with Nordic Combined competition, which only had its first official World Cup event in 2020 and its first world championships in 2021.\n\nIt was half-expected that the Beijing 2022 Games would see the introduction of a women's Nordic Combined, but the reality was somewhat different.\n\n\"They [the IOC] made this decision in 2022 and, in my head, and so many other Nordic Combined girls' heads, there was no chance they were not adding us for 2026,\" Malacinski said.\n\n\"We had a checklist of everything that the Olympic Committee wanted to see us progress in, and we checked off every single one.\n\n\"There was not even a thought in my head that they weren't going to allow us to go to 2026, because the goal was 2022.\n\n\"That [2022 Beijing Games] would have been very, very soon, and a very 50-50 shot. But for '26? No doubt in my mind that they were not gonna add us. Like, how could they not?\n\n\"And then, when they came out with the decision that they weren't going to add us, it was horrible.\"\n\nAnnika Malacinski has made her thoughts clear. (Supplied: Annika Malacinski)\n\nThe decision was met with huge frustration among those in the sport.\n\nBilly Demong, a five-time Olympian in Nordic Combined and member of USA Nordic's board of directors, told The Associated Press the decision was a \"travesty\".\n\n\"This is one of the biggest moves against gender equity in the Olympic movement in history,\" he said.\n\nAnd while the sport's governing body, the FIS, is committed to achieving gender parity at the 2030 Games, Malacinski admits that in the immediate aftermath of the decision, she thought about retiring or switching to focus solely on ski jumping.\n\nBut, instead, she discovered the fire to fight, not just for her fellow competitors, but for the very sport itself.\n\n\"In my head, it was the end until I realised that there's one competition in four years that I don't get to participate in,\" Malacinski said.\n\n\"We have World Cups, the World Championships, Youth Olympics, we have everything except for this one competition, so to me it was stupid that I was like, 'Am I quitting now?'\n\n\"That was kind of like what ignited the fire in me to fight for this.\"\n\nNordic Combined 'thrown overboard'\n\nNordic Combined, like most winter sports, benefits from spectacular scenery. But that is not enough to entice the viewers. (Getty Images: Agence Zoom/Christophe Pallot)\n\nNordic combined remains the solitary anachronism when it comes to the IOC's gender equality ambitions.\n\nBut it's not just the women's side of the program that has an issue. It appears that the entire sport is on borrowed time in terms of its continued status at the Olympics.\n\nIn June 2022, the IOC's executive board discussed \"the concerning situation\" regarding Nordic Combined, saying it had \"by far the lowest audience numbers during [the last three] Games\" and a critical lack of diversity in terms of medal winners.\n\nJust four different countries have claimed the last 27 medals on offer in the sport at the past three Games: Germany (10), Norway (9), Austria (4) and Japan (4).\n\nOnly 12 different nations have ever won a medal in Nordic Combined events at either the Olympics or the World Championships.\n\nThe 18 different nations represented by the 55 athletes who competed in the sport at the last Games in Beijing were the lowest of any non-team sport at those Games.\n\nThe only thing keeping Nordic Combined in the program at all was the \"decisive argument\" around the fact that male athletes had already been preparing for Milan for many years.\n\n\"The inclusion of Nordic Combined in the Olympic Winter Games 2030 depends on a significant positive development, particularly with regard to participation and audience,\" the executive committee noted.\n\nMalacinski is scathing in her response.\n\nNordic Combined is seemingly being set up to fail. (Getty Images: NordicFocus/Vianney Thibaut)\n\n\"How are you supposed to progress the sport if you don't have the Olympics [as a target]?\" Malacinski argues.\n\n\"The younger girls don't want to go do a sport that doesn't allow women in the Olympics. They're going to choose ski jumping or cross-country skiing.\n\n\"[The IOC are] telling us to swim, but they've tied our hands and feet together and thrown us overboard.\n\n\"I think the biggest problem is that we have these old white men on these boards that don't know anything.\"\n\nAt the time, the IOC executive board had 10 men and five women sitting on it. Currently, the board consists of six women and nine men.\n\nOne of the biggest issues appears to be the interest the sport sparks from the audience.\n\nThis too is a bit unfair — the last two Games have taken place in Asia, with time zones unfavourable with Nordic Combined's core (and likely, only) audience of northern and central Europe, which no doubt would have contributed to the lower-than-expected audience figures.\n\n\"Basically, the fate of us being added is how much they can profit, and that has been kind of like the disgusting aspect of the Olympics,\" Malacinski said.\n\n\"[The Olympics] is something that I've dreamed of since I was a little kid, looking up at all these athletes that have gone through crazy training, and their journey and what's happened in their life and the work they've put into this.\n\n\"That is all so distraught in my head right now because all I see is that the Olympics, all they care about is money and politics.\n\n\"That is the one thing that I've learned throughout this whole process, and it has completely destroyed my idea of what the Olympics is.\n\n\"It's almost like, 'Why do I even want to go if this is what they care about, money, who can profit?'\n\n\"But, unfortunately, I feel that you're not taken seriously as an athlete if you don't have the opportunity to compete at the Olympics.\"\n\nIs the focus on Nordic Combined fair?\n\nNordic Combined was the least-watched sport at the last Olympics, but remains popular in its heartland. (Getty Images: Agence Zoom/Christophe Pallot)\n\nMalacinski admits the sport is \"very niche\" but argues that the same is true of just about every winter sport.\n\nAnd that is true. Almost all winter sports struggle for genuine diversity in terms of nations competing purely on account of snow being a necessary and undeniable requirement to any nation that wants to develop a grassroots scene.\n\nIn fact, the low number of different nations competing in Nordic Combined in Beijing (18) was not vastly different from other sports such as Skeleton (21), Ski Jumping (22), Bobsleigh (23) and Short Track (23).\n\nAt the sport's respective world championships in 2025, Nordic Combined compared relatively favourably to sports from a diversity perspective.\n\nAnd that in itself isn't surprising.\n\nThese are incredibly specialised, niche sports with a high degree of danger and requirements for specialist equipment and facilities that are simply not widely available.\n\nFor example, there are only 59 ski jumping centres in 18 countries around the globe currently certified for top-level use by the FIS. In a similar vein, there are only 17 top-level bobsled tracks in 12 different countries.\n\nAccess is clearly an issue when snow and ice are required.\n\nMalacinski points out that there are improvements happening all the time in terms of representation, and her sport is no different in terms of participation than cross-country skiing or bobsled.\n\nNordic Combined is making strides in diversity across the world. (Getty Images: Agence Zoom/Christophe Pallot)\n\n\"The progress that we have made in this sport doesn't even seem real; it's crazy,\" Malacinski argues.\n\n\"Norway has been dominating for quite some time because they are amazing at this sport and in all Nordic sports. But if you look at any world championships for cross-country skiing, you will see that top 10 majority is also Norwegian,\" she said.\n\n\"Whereas when you look at our world championships in Slovenia, and then also in Trondheim last year, we had three nations on the podium.\"\n\nAt the World Championships in Trondheim, across six different events, Nordic Combined had four different nations from three different continents stand on the podiums, with three of those winning a gold.\n\nOf the 12 gold medals on offer in cross-country skiing at those championships, Norway and Sweden shared the spoils with six golds each.\n\n\"It doesn't make sense,\" Malacinski said, in light of these results, regarding the IOC's argument that there needed to be more diversification of talent in the sport.\n\n\"I just want the IOC to get their head out of their asses and, like, tell us what's actually happening behind the curtain, because everything they say just does not make sense.\"\n\nWhat comes next?\n\nFighting for equality at the Olympics is exhausting for Annika Malacinski and her colleagues. (Getty Images: picture alliance/Philipp von Ditfurth)\n\nMalacinski will be in Italy in February. Her brother is on the USA Nordic Combined team, and she will be there supporting him.\n\nBut she won't be competing. If that continues, she's concerned that come 2030, her brother won't have a spot to compete for at the Olympics either.\n\n\"There's no way that the Olympics can go through another cycle and not have 100 per cent equality on the board,\" Malacinski said.\n\n\"So if women are not allowed to compete in 2030, there is no way that they're letting the men go through another round without the women.\n\n\"Not that they [the IOC] care, but because it just looks bad for them, and it looks bad now.\n\n\"It's a legendary sport, and I would hate to see it diminish because of politics and money, so it's something that this whole sport has to fight for.\n\n\"But I've noticed that we do not have a lot of big personalities in this sport. A lot of the time, I feel very alone trying to fight for this.\n\n\"When the decision came out, the year after, the women were putting X on our poles, as in no exceptions, and that was on for a year, and the men in some of the competitions did it as well.\n\n\"But I really feel that no-one is outspoken enough about it. There's not huge personalities that are able to just throw this stuff on social media … you're not going to find what you find in other sports, in freestyle skiing [for example], these really, really big personalities.\n\n\"And at the end of the day, that's going to kill us.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nMalacinski will continue to push, the fate of her sport resting heavily, it seems, on her shoulders.\n\n\"I am trying to make sure that the Olympics put our sport into 2030 for both men and women,\" she said.\n\n\"But I've noticed how small the IOC can make me feel compared to how big they are, and how much power they have. And anything they say goes, and it doesn't really have any repercussions.\n\n\"I don't ever want to come to the point where I feel like I didn't do enough because the Olympic committee will decide my fate, along with the whole sport of Nordic Combined, after these Winter Olympics.\n\n\"If they say no, then the sport will be wiped out, and it's like that, I can't do anything about it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/cba-shares-up-increased-profits-first-half-financial-year/106329968",
        "title": "CBA shares up after bank reports increased profits",
        "publish_date": "Wed, 11 Feb 2026 00:52:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Shares in Australia's biggest bank have risen in early trade after Commonwealth Bank reported rising profits on the back of increased lending and deposit volumes.\n\nCBA's net profit for the first half of the financial year rose 5 per cent to $5.367 billion.\n\nShareholders will receive an interim dividend of of $2.35 per share, fully franked — up 4 per cent from a year ago.\n\nCash profit, a measure preferred by the banks that excludes items they do not regard as \"business as usual\", came in at $5.45 billion, up 6 per cent.\n\nCBA chief executive Matt Comyn said the bank was optimistic about the prospects for the economy.\n\nCapacity constraints explained It may sound boring, but \"capacity constraints\" are to blame for your higher mortgage repayments.\n\n\"Economic growth strengthened during the half, driven by an increase in consumer demand and rising investment in AI and energy infrastructure,\" Mr Comyn said in an ASX statement.\n\n\"Supply side constraints mean that the economy is struggling to meet this increased demand.\n\n\"As a result, inflation is now expected to remain above the Reserve Bank's target band for some time, placing further upward pressure on interest rates.\n\n\" We will continue to seek to support our customers with financial resilience. \"\n\nMortgages, business lending and deposits grow\n\nCBA reported a 3.7 per cent increase in its home lending volumes over the six-month period, compared to 3.5 per cent across the broader banking system.\n\nIt retained about a quarter of Australia's mortgage market.\n\nIts business lending volumes grew 6 per cent in the half, also ahead of system growth.\n\nHousehold deposit volumes were up 7.5 per cent, with CBA holding 27 per cent market share.\n\nIncreased lending for housing drove CBA's profits to start the financial year. (ABC News: John Gunn)\n\nNet interest margins decline as rates rise\n\nAnalysts at UBS said the profit result beat market estimates, as well as its own analysts' forecasts, with business banking a stand-out, but net interest margins were compressed more than expected.\n\nCBA's net interest margin (NIM) — which is the difference between the interest earned on the money it lends and the interest it pays out on deposits — decreased by 4 basis points to 2.04 per cent.\n\nThe bank said it was \"primarily due to competition in home lending and lower Treasury and Markets income\", partially offset by higher earnings elsewhere and other factors.\n\nCommonwealth Bank chief executive Matt Comyn will be interviewed by Alicia Barry on The Business tonight on ABC News Channel or anytime on iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/socceroos-striker-mohamed-toure-hat-trick-debut-norwich/106330220",
        "title": "Socceroo scores hat-trick on starting debut in English Championship",
        "publish_date": "Wed, 11 Feb 2026 00:32:41 +0000",
        "category": "sports",
        "authors": [],
        "text": "Socceroos striker Mohamed Toure has scored a historic hat-trick on his starting debut for English Championship side Norwich.\n\nHe scored his three goals in the Canaries 3-0 win over Oxford away from home.\n\nToure moved to England recently on a $5 million deal from Danish top-flight club Randers and it is already looking like a great decision for the 21-year-old forward.\n\nHe has now scored four times in two games for the Canaries after getting the second goal in a 2-0 win over Blackburn last weekend, having come on as a substitute.\n\nThat performance earned Toure a promotion to Philippe Clement's starting XI for the clash against relegation-threatened Oxford and he did not let his new coach down.\n\nToure opened the scoring with his first touch within 51 seconds, before hitting the scoresheet again in the 19th and 47th minutes as Norwich moved up to 16th on the Championship table.\n\nHe became the first player since Jesse Lingard for Birmingham City in 2013 to score a hat-trick on his starting debut in any of England's top four tiers.\n\n\"It was what we wanted to see from Mohamed — but also from everyone around him,\" said Clement.\n\n\"We've seen the last two months that everyone who plays as a striker gets much better opportunities than three months ago.\n\n\"The strikers can be in good positions to finish off the job, and that's what he did really well.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe Guinea-born forward is near certain to be a member of Tony Popovic's squad for the World Cup in North America starting in June.\n\nAnd if he keeps up this sort of form, Toure is making a compelling case to lead the line for Australia at the World Cup.\n\nHe has netted two goals in eight internationals.\n\nWhen Toure joined Norwich, they faced the real prospect of relegation to the third tier of English football.\n\nBut the back-to-back Toure-inspired victories over Blackburn and Oxford have lifted the Canaries to 16th spot, seven points clear of the drop zone.\n\n\"Mo is still a young lad with a lot of potential and several things to improve, but he is learning fast,\" Clement said.\n\n\"This week we showed him several images of [Erling] Haaland and how he creates space for himself, as well as [Romelu] Lukaku and how he uses his body.\n\n\"It's important to have a striker who can find the spaces in behind and is lethal in front of goal.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/dungeons-and-dragons-inspired-game-for-neurodivergent-kids/106321560",
        "title": "Simplified version of Dungeons and Dragons created to help neurodivergent children",
        "publish_date": "Wed, 11 Feb 2026 00:29:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Growing up moving between several regional communities, Morgan Avery found it difficult to fit in.\n\nThey also had trouble interacting socially with others, meaning a formal diagnosis for Asperger's syndrome, now classified under autism spectrum disorder, in their teens did not come as a total surprise.\n\n\"It's pretty mild, but it still makes it really hard for me to navigate a lot of different social situations,\" Morgan said.\n\nHowever, it was their introduction to the colourful dice and boundless creativity of popular tabletop role-playing game Dungeons and Dragons (D&D) that ultimately helped them come out of their shell.\n\nMorgan Avery often struggled in social situations growing up. (ABC News: Oliver Brown)\n\nNow 29 and based in outback New South Wales, Morgan believes the game can provide similar benefits to other neurodivergent youth in remote communities.\n\n\"[D&D] gives me the opportunity to have that freedom of expression without the fear of being judged,\" they said.\n\n\"It really lets my creativity flow out in an environment that feels safe and comfortable.\n\n\"And I think, based on my own experiences, [it's] really good for other kids who have Asperger's or other neurodivergent qualities.\"\n\nSimpler rules enable easier access\n\nDespite the social benefits of Dungeons and Dragons, finding a pathway into the game is not always easy, particularly for those feeling challenged by the high intensity and larger-than-life personalities the game has become known for in modern pop culture.\n\nHowever, Morgan hopes a simplified version of the game called Dragons of the Spectrum (DOTS) will help overcome this obstacle.\n\nWill Ellison created Dragons of the Spectrum to help young people with their social skills. (Supplied: Will Ellison)\n\nDOTS was created by Adelaide-based clinical psychologist Will Ellison for children aged 10 years and over, to develop their social confidence and peer connection in a specially designed environment.\n\nMr Ellison said Dungeons and Dragons had something for everyone, but diving headfirst into it as a child could be quite daunting.\n\n\"[DOTS] really strips away a lot of the more complex rules that are associated with Dungeons and Dragons [and] focuses more on putting participants or group members in a dynamic social situation,\" Mr Ellison said.\n\n\" So [participants] get to practice social skills and work together as a team to overcome challenges. \"\n\nDifferent approach to social development\n\nAfter initially using DOTS as the focus of his clinical master's research in 2021, Mr Ellison said its success inspired him to start facilitating ongoing 10-week programs for small groups.\n\n\"The group that [first] completed the program demonstrated higher improvements in pro-social behaviour [and] improvements in resiliency,\" he said.\n\n\"Whereas the group that didn't do it actually showed a decrease in resiliency and improvements in a range of different social skills areas.\"\n\nWill Ellison says he has created a more accessible version of the game. (ABC News: Oliver Brown)\n\nIn the years since, Mr Ellison and his team have continued gathering data in larger sample sizes, which they plan to formally publish later this year.\n\nHe said his findings included even greater improvements for participants in areas like social skills and awareness, resilience and emotional regulation.\n\n\"The [DOTS] program is unlike any other program in the world because the way it's structured is very unique,\" he said.\n\n\"We've demonstrated some really positive, statistically significant improvements in a range of different social areas.\n\n\"However, I think the most notable benefit [for] kids that have come and participated [is] the long-term social outlet, that they now have access to D&D at the local library or at school.\"\n\nWill Ellison says he has been proud of what he has achieved with DOTS so far. (ABC News: Oliver Brown)\n\nRegional rollout\n\nThis year will also mark the first time DOTS and a more in-depth follow-up program called Dragons of the Spectrum Plus (DOTS+) will leave their city of origin.\n\nMore than two dozen people from across Australia, most with backgrounds in the child support space, completed special training with Mr Ellison last year to facilitate both programs locally.\n\nThey are now preparing to run DOTS and DOTS+ programs in metropolitan and regional communities such as the Gold Coast, Broken Hill, Rockhampton, and Albury-Wodonga, alongside the school term.\n\nJim Richards jumped at the chance to facilitate the DOTS program. (ABC News: Oliver Brown)\n\nAmong them was Broken Hill social worker and pre-existing Dungeons and Dragons enthusiast, Jim Richards, who said DOTS felt like a perfect fit.\n\n\"When you're trying to deliver a program for young people, people want to know that it's evidence-based [and] it's going to be effective, especially when you're claiming to be teaching social skills,\" he said.\n\nMr Richards has also started a local youth foundation with his wife, Maddie, through which he received a state government grant to run introductory Dungeons and Dragons workshops for young people in some of the more remote communities in far west NSW.\n\nJim Richards and his foundation recently ran introductory Dungeons and Dragons workshops. (Supplied: Jim Richards)\n\nMorgan Avery, who plans to help the Richards family run DOTS in the far west, said they had high hopes for what it could do for regional youths across the neurodiversity spectrum.\n\n\"This is an opportunity to help kids find their people and develop strong bonds with each other,\" Morgan said.\n\n\" Giving [them] that space to really become their own person and not feel weighed down by any neurodivergent issues is very important. \"\n\nMaddie Richards, Morgan Avery and Jim Richards have high hopes for DOTS in outback NSW. (ABC News: Oliver Brown)\n\nIn addition, Mr Richards is optimistic this will lead to even more benefits and skills that are transferable to other parts of their lives.\n\n\"We start by improving people's social skills, confidence, and then that translates into leadership skills, [or] employability [and] improved opportunities,\" Mr Richards said.\n\n\"Imagine if we could just harness the creativity and the enthusiasm of all these young people … who knows what could happen?\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/wa-rents-soar-66pc-in-five-years-the-biggest-increase-in-nation/106329614",
        "title": "Surge in WA rents 'through the roof', massively outstripping wage growth",
        "publish_date": "Wed, 11 Feb 2026 00:22:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rents in Western Australia have surged more than 3.5 times faster than wages over the past five years off the back of the highest growth in rental prices in the country, according to data from property research firm Cotality.\n\nFigures show the average rent in WA has increased by 66 per cent in the five years to September 2025, while wages have only risen 18.5 per cent over the same period.\n\nIt has sparked fresh calls for the state government to do more to help struggling renters at risk of homelessness.\n\nCotality research director Tim Lawless said rental affordability in WA was at an all-time low.\n\n\"Nowhere is the pressure more evident than in Western Australia, where rents have climbed by around two-thirds in just five years,\" he said.\n\n\"Even with wages growing a little faster than the national average, they have come nowhere near keeping up with housing costs in that state.\"\n\nWA's broken housing system laid bare in new report More than half of West Australian households consider their housing unaffordable, an increase of 91 per cent in just two years, according to a new report.\n\nNational rents climbed 43.9 per cent in the five years to September 2025, compared with wage growth of 17.5 per cent over the same period, according to Cotality.\n\nThis week the WA Make Renting Fair Alliance sent letters to members of state parliament calling on them to legislate a limit on rent increases tied to the rate of inflation or a fixed percentage.\n\n\"When you see rents going up and up and up, it means it's impacting everyone,\" Make Renting Fair Alliance spokesperson and Shelter WA chief executive Kath Snell said.\n\n\"When salaries are not going up at the same rate … that puts people in a really difficult situation.\"\n\nRental increase 'through the roof'\n\nIn the 12 months to January 2026, rents in Perth increased by an average of 6.2 per cent, compared with the nationwide mark of 5.4 per cent, according to Cotality.\n\nRenters in WA's regional areas had the highest increase, up 10.1 per cent over the same period.\n\n'Literally no affordable housing': The holiday homes hollowing out towns Tourism is these towns' biggest breadwinner — but with a housing crisis in full swing, short-term stays are pushing locals away.\n\nMs Snell said the rent increases were having a significant impact on WA household budgets.\n\n\"We've got about $20,000 extra per year going into rent [per house] than we did about four years ago, so it's an enormous amount of money,\" she said.\n\nMs Snell said there were number of reasons rental properties were becoming unaffordable.\n\n\"We've got a lot of demand compared to supply. We've seen unfortunately decades of under-investment into social housing,\" she said.\n\nShelter WA CEO Kath Snell says the government must do more to help struggling renters. (ABC News: Courtney Withers)\n\n\"And we've also got a short-term rental market that really has swallowed up a lot of the available properties, so all of those things combined unfortunately means we've got this rental increase that is through the roof.\n\n\"It puts people at a real risk of homelessness, and we are seeing people who can no longer afford the rent increases they are experiencing.\"\n\nPlea for more help for renters\n\nMr Lawless said the rental price squeeze was unlikely to ease in the near future.\n\n\"With vacancy rates still around record lows in many markets and new housing completions running below what is needed to meet population growth, it is hard to see rents materially easing in the near term,\" he said.\n\nThere is a shortage of new housing coming on the market to meet demand in WA. (ABC News: Hugh Sando)\n\n\"Unless wage growth accelerates meaningfully, or we see a step change in rental supply, the risk is that affordability will deteriorate further for lower-income households in particular.\"\n\nAs WA resident faces eviction, more questions about community housing Community housing is seen as a way for the government to tackle the housing crisis, but some people are falling through the cracks.\n\nMs Snell said the government needed to do more to help struggling renters.\n\n\"We're really pushing the government for a rent stabilisation initiative,\" she said\n\n\"One of the things that's worked really well across WA is the Rent Relief scheme.\n\n\"We would really like to see this program continued for at least another two more years beyond its current end date, which is June 2026.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/race-to-save-grass-trees-south-west-wa/106323778",
        "title": "Race against bulldozers to save ancient grass trees in WA's South West",
        "publish_date": "Wed, 11 Feb 2026 00:04:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Amid a population and property boom in WA's South West, a group is racing to save some of the area's oldest grass trees from land clearing and development.\n\nFor more than 20 years, Margaret River Trees has been safely removing and re-homing the slow-growing native plants — known as \"Balga\" trees in Noongar — from sites marked for development.\n\nThe rescued trees are then rehabilitated in holding yards before being sold for landscaping.\n\nManaging director Mike Johnson said the work began with a fascination for the species and had since evolved into a large-scale rescue effort.\n\n\"We rescue and re-home the oldest and most spectacular trees on the planet,\" he said.\n\n\" I do my best to beat the bulldozers in because if I don't, they are literally piled up and bulldozed and burnt. \"\n\nMike Johnson's passion for grass trees and Aboriginal Dreamtime stories led him to his career. (Supplied: Mike Johnson)\n\nMr Johnson estimates the team has saved more than 100,000 grass trees from clearing.\n\nBut he believes fewer than 1 per cent of threatened trees are ultimately rescued.\n\n\"The rule of thumb with a grass tree is 20 to 30 years before it comes out of the ground,\" he said.\n\n\"The oldest one we've ever rescued was 5 metres by 5 metres.\"\n\nGrass trees piled up and burned after government-approved land clearing. (Supplied: Mike Johnson)\n\nCurtin University emeritus professor Byron Lamont, who has been researching grass trees since the 1970s, said the species grew at an incredibly slow pace.\n\n\"My work suggests that they grow from about 5 to 40 millimetres a year, depending on growing conditions,\" he said.\n\n\"The average is about 1.5 centimetres a year.\n\n\" The tallest we've found is 6.5 metres, and that's just over 400 years old by our estimates. \"\n\nGrass trees grow extremely slowly; less than 1.5cm per year. (Supplied: Mike Johnson)\n\nHe said while grass trees were not rare, their slow growth and cultural significance made rescue efforts valuable.\n\nRe-homing process\n\nMr Johnson said before excavation began, the trees were deliberately burned to help stimulate regeneration.\n\n\"Then it's excavators … 5-tonne bobcats, tree spades, tens of thousands of dollars on plastic bags, thousands and thousands of dollars getting our special soil mix to site,\" he said.\n\nThe Margaret River Trees team carefully removes trees ready for transport. (Supplied: Mike Johnson)\n\n\"We start the extraction, place them in the bags with our special blend and water them in and then take them back to our holding yards for 12 months before we look at selling.\"\n\nThe trees are often placed in urban areas for landscaping. (Supplied: Mike Johnson)\n\nMr Johnson said removing mature trees could be physically demanding, particularly in dense bushland or rocky areas where roots were easily damaged.\n\n\"If it's on a super steep hill, if there's a lot of other trees in the area, then the tree roots and the grass tree roots stick together, and you're going to take a really healthy, substantial root ball for it to live,\" he said.\n\n\"If the transport can't get within 200m of a tree, then we're double, triple-handling everything.\"\n\nThe trees are particularly significant for South West WA's Noongar traditional owners. (Supplied: Mike Johnson)\n\nDeep cultural roots\n\nWadandi-Pibulmun cultural custodian Zac Webb said the grass trees were culturally significant for Noongar people.\n\n\"Just the multiple uses for them … so they can be used for food, medicine, an indicator of season change, into tool production,\" he said.\n\n\" Once they're gone, they're gone forever, and they are a West Australian iconic species. \"\n\nZac Webb warns ongoing development could put the species at greater risk. (Supplied)\n\nMr Webb warned ongoing development could put the species at greater risk.\n\n\"We may lose these iconic species or just lose the ability to see them … in the wild where they're supposed to be,\" he said.\n\n\"We might have to actually go driving into the national parks and into the forest to actually see them other than in designer gardens.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/historical-high-country-rail-trail-bridges-destroyed-by-fire/106312604",
        "title": "Historic 'nation-building' bridges lost during Victorian bushfires",
        "publish_date": "Tue, 10 Feb 2026 23:30:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Fires, floods and termites were recognised as major threats to historic trestle bridges along the High Country Rail Trail in Victoria's north-east.\n\nSo volunteers were worried when strong winds pushed the 122,000-hectare Walwa-Mt Lawson State Park bushfire towards the bridges near Shelley, Koetong and the Tallangatta Valley.\n\nWithin 24 hours, 12 of the 13 bridges had burnt to the ground, taking more than 100 years of history, craftsmanship and volunteer restoration efforts with them.\n\nThe Boggy Creek trestle bridge, near Koetong, before the January fires. (Facebook: Nicole Denovan)\n\nRail trail decimated\n\nRiders and walkers along the High Country Rail Trail only crossed two of the bridges.\n\nThe others were deemed too rickety or unstable for use, so they became part of the scenery.\n\n\"They were beautiful to look at, and an amazing feature of an incredible trail,\" Rail Trails Australia vice-president Steven Kaye said.\n\nThe Boggy Creek trestle bridge was completely destroyed in the fire. (Supplied: Stephen Parker)\n\nAccording to 2022 data from Tourism North East, the region attracts more than 160,000 cycling visitors each year, raking in an estimated $131 million.\n\nThe downhill stretch from Shelley to Old Tallangatta is one of the most popular routes, attracting more than 5,000 riders in the 2024-25 financial year.\n\nThe bridges were built from 1914 onwards as part of the Wodonga-Cudgewa rail line.\n\nThey were upgraded as trains became heavier, and played a key role in transporting material to the Snowy Hydro Scheme in the 1950s.\n\nWhen the railway was decommissioned, a dedicated group of volunteers took on the task of making it fit for cyclists, horse riders and walkers.\n\n\"It's been a 25-year labour of love to get the trail connected, and that's basically gone up in smoke,\" Mr Kaye said.\n\nThe Darbyshire trestle bridge was engulfed in flames on January 9. (Supplied: Pete Paton)\n\nParklands Albury Wodonga executive officer Ant Packer said the bridges were more than just structures.\n\n\"They tell the story about our nation-building,\" Ms Packer said.\n\nThey took decades to build with hand tools, horses, carts and locally milled wood.\n\n\"Some of them were three storeys high, 21 metres tall and 96 metres long,\" she said.\n\nMs Packer said volunteers knew they could lose the bridges after three nearby were destroyed in the Black Summer fires.\n\n\"It came through so fast … that it just wasn't possible to do any preparation,\" she said.\n\nThe Wodonga-Cudgewa railway line was crucial in the building of the Snowy Hydro scheme. (Facebook: Wodonga and District Historical Society)\n\nRebuilding dilemma\n\nVolunteers said rebuilding could be costly.\n\nWhen 12 historic trestle bridges were destroyed at Myra Canyon, British Columbia, in 2003, the rebuild project set the provincial and federal governments back $CAD18.5 million ($20 million).\n\nDave Richmond was the recreation section head for British Columbia (BC) Parks in 2003 and oversaw the project, which he described as expensive and difficult.\n\nTwelve trestle bridges were rebuilt after fires in Canada in 2003. (Facebook: Lauren Richards Neufeld)\n\n\"There was only access from each end of the damaged area. We had to build our way towards the centre from each side of the canyon,\" he said.\n\nThe decision to rebuild the trestles near Kelowna, about 400 kilometres north-east of Vancouver, depended heavily on the future fire risk.\n\n\"We had to ask, 'Is there a chance of this re-occurring?'\" he said.\n\nThe risk was deemed low so the rebuild went ahead, and the trestles have since attracted tens of thousands of visitors a year.\n\nMyra Canyon, in British Columbia, attracts thousands of visitors each year. (Supplied: Megan Reading/ Tourism Kelowna)\n\nClean-up underway\n\nThe immediate focus in the Upper Murray is making the trail safe.\n\n\"We've got about 35 kilometres of fences to replace, a lot of them go through the middle of properties,\" Ms Packer said.\n\nParklands Albury Wodonga said it was expecting to have the trail reopened by the middle of the year.\n\nThe cost of any rebuild is yet to be calculated, and finding people with the skills to construct the trestle bridges could be a challenge.\n\nLooking through the community's photos, videos and memories of the bridges, Ms Packer said she was devastated, but was trying to shift her perspective.\n\n\"How amazing that they've been there for 110 years … [it's] something I think we really need to celebrate,\" she said.\n\nMr Richmond said it was important for all stakeholders — including volunteers — to be involved in conversations around next steps.\n\n\"[Volunteers] had invested all the blood, sweat and tears for the people who want to go there and experience the trails,\" he said.\n\n\"Have those challenging discussions early on, about what you're trying to achieve.\"\n\nMs Packer said it was a chance to share memories and hear how the community would like to proceed.\n\n\"I think it's an opportunity … you could see what the bridges were like in a light show, perhaps,\" she said.\n\nBut she said there was no rush.\n\n\"Sometimes we need to slow down and reflect on the past,\" she said.\n\n\"Things take time to build, like these trestle bridges.\"\n\nHeritage Victoria has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/vic-cfmeu-report-government-victoria/106329680",
        "title": "Victorian government defends action on construction sector amid CFMEU allegations",
        "publish_date": "Tue, 10 Feb 2026 23:23:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Victorian government is defending its handling of corruption in the state's construction sector amid accusations, reportedly made as part of a major corruption investigation, that it was \"cowed\" by the CFMEU.\n\nThe claim, reported by Nine Newspapers, was made in the findings of an investigation into CFMEU corruption commissioned by the federal government.\n\nThe findings of the investigation by Geoffrey Watson SC are yet to be publicly released.\n\nMr Watson is reported to have found the Victorian government \"knew about the rising problem — but it is equally clear that the government did nothing about it.\"\n\nWatson is reported to have found suggestions the government's failure to act was due to the close relationship between Labor and the CFMEU was \"an inadequate and unsatisfactory explanation\".\n\n\"A better explanation is that the government, just like the contractors, had been cowed by the combination of the industrial might of the CFMEU and its willingness to act outside the law,\" he is reported to have said.\n\nOn Wednesday morning, Victorian Attorney General Sonia Kilkenny would not comment directly on the contents of the report, saying it had not yet been released.\n\nHowever, she defended the government's attempts to crack down on corruption in the construction sector.\n\n\"You can see from the actions we've already taken, when we acted really swiftly to eradicate this kind of rotten culture that was exposed in parts of Victoria's construction sector,\" she told ABC Radio Melbourne.\n\nIn his report, Geoffrey Watson SC is reported to have made findings critical of the Victorian government. (ABC News: Billy Cooper)\n\nIn his report, Mr Watson also estimated the actions of the CFMEU let to cost blow outs of 15 per cent, describing the figure as a \"very rough\" estimate.\n\nNine Newspapers reported that the sections of the report in which Mr Watson was highly critical of the Victorian government were removed by CFMEU administrator Mark Irving.\n\nA spokesperson for the administrator told the newspaper the sections were initially removed because he \"was not satisfied that they were well-founded or properly tested.\"\n\nThe ABC has contacted the administrator for comment.\n\nAttorney General Sonia Kilkenny defended the Victorian government's actions on corruption in the construction ector. (ABC News)\n\nMs Kilkenny said the Victorian government did not contribute to the Watson investigation.\n\n\"The federal report — the Watson report — is not our report. We haven't had involvement in its content,\" Ms Kilkenny said.\n\n\"This government moved swiftly to establish the Wilson review and of course writing to the Chief Commissioner of Victoria Police and to IBAC referring those allegations for investigation.\n\n\"It proves we have zero tolerance, absolutely zero tolerance for this kind of conduct and this kind of illegal behaviour and we're going to get on and eradicate this rotten culture which has been exposed in parts of our construction sector.\"\n\nThe Wilson review was conducted by senior public sector bureaucrat Greg Wilson, who made eight recommendations in his final report, including the establishment of the new complaints body for the troubled sector, in December 2024.\n\nVictorian federal Liberal MP and Shadow Industrial Relations Minister Tim Wilson said he had concerns about the apparent intervention by the CFMEU administrator in the Watson report.\n\n\"This is alarming and deeply concerning and every Victorian should be concerned about the conduct by the CFMEU, the Albanese government's heads that they appointed to that body and whether taxpayer's money is being abused,\" he told ABC Radio Melbourne.\n\n\"It's pretty distressing when the CFMEU head of the administration is trying to scrub those sections of the report.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/queensland-e-scooter-injuries-escalate-hospital-data-shows/106329602",
        "title": "Queensland e-scooter injuries escalate to five per day",
        "publish_date": "Tue, 10 Feb 2026 22:59:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than five Queenslanders per day are ending up in the emergency department due to e-scooter injuries, according to new state hospital data.\n\nThe Queensland Injury Surveillance Unit found 2,000 riders suffered serious e-mobility injuries in 2025, up from 1,626 in 2024 and 1,380 in 2023.\n\nMichael Kane says this data paints the picture of a rapidly worsening situation. (Supplied: RACQ)\n\nMotoring body RACQ's head of public policy, Michael Kane, told 612 ABC Radio Brisbane this was an alarming increase.\n\nThe data shows about 39 per cent of injuries last year were bone fractures, and about half were head and facial injuries.\n\n\"We're talking about severe injuries, and some of these people will have life-changing injuries,\" Dr Kane said.\n\n\"Nobody wants to have their face smashed onto a road, but that's what we're seeing.\"\n\nDr Kane said the real number of injuries was likely higher, since the data was collected from only 36 hospitals around Queensland.\n\nMore bike lanes needed\n\nAnna Campbell says Queensland is paying lip-service to active transport without building the infrastructure. (ABC Radio Brisbane: Kenji Sato)\n\nQueensland Walks executive officer Anna Campbell said the data also did not include pedestrians who had been struck by e-scooter riders.\n\nDr Campbell said Queensland needed to build more separated cycleways, footpaths, and shared paths to prevent more serious injuries.\n\n\"We've brought in a new form of active transport, but we haven't created the space for it,\" she said.\n\n\"Just this week I spoke to a cafe owner who fears for her life every time she steps outside to serve someone a coffee.\"\n\nMatthew Burke says e-scooter shops are becoming increasingly brazen. (ABC News: Greg Nelson)\n\nBicycle Queensland chief executive Matt Burke said there needed to be crackdowns on dodgy e-scooter shops.\n\n\"Many retailers have had a business model that is really about selling dangerous, illegal motorbikes to kids,\" Dr Burke said.\n\n\"A lot of these motorbikes are being sold with a nudge and a wink, 'We're selling it so you can use it on your private property'.\n\n\"There's not many cattle stations to ride one of these things in the centre of Brisbane.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-11/sport-quick-hits-winter-olympics-day-four-cheating-nauov-tribute/106329142",
        "title": "Quick hits: A cheating admission and a US star's tribute both bring tears",
        "publish_date": "Tue, 10 Feb 2026 22:12:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "A Norwegian's first-ever medal is overshadowed by a stunning admission to reporters as Maxim Naumov pays tribute to his parents in the most beautiful way.\n\nHere are the quick hits from the Winter Olympics.\n\n1. Norwegian wins medal, confesses to cheating on partner\n\nSturla Holm Lægreid was an emotional wreck at the medal ceremony. (Getty Images: picture alliance/Hendrik Schmidt)\n\nWinning a first individual Olympic medal should have been one of the highlights of Sturla Holm Laegreid's life.\n\n\"There is something I want to share with someone who may not be watching today,\" he told Norwegian TV after winning a bronze medal in the biathlon.\n\n\"Half a year ago, I met the love of my life. The world's most beautiful and nicest person. Three months ago, I made the mistake of my life and cheated on her, and I told her about that a week ago.\n\n\"This has been the worst week of my life.\n\n\"I had the gold medal in life, and I am sure there are many people who will see things differently, but I only have eyes for her. Sport has come second these last few days. Yes, I wish I could share this with her.\"\n\nA more extraordinary admission you will not find in the mixed zone at an Olympic competition.\n\nAnd Laegreid probably realised this too, telling media he hoped he didn't detract from his teammate Johan-Olav Botn's gold medal.\n\n\"Now, I hope I didn't ruin Johan's day,\" he said.\n\n\"Maybe it was really selfish of me to give that interview. I'm not really here, mentally.\"\n\nSadly, those journalists had already forgotten Botn's achievements and were scrambling to find the scorned woman for a follow-up story.\n\n2. Naumov's beautiful tribute to parents\n\nMaxim Naumov paid tribute to his parents after his routine in the men's figure skating. (Getty Images: Matthew Stockman)\n\nAmerican figure skater Maxim Naumov provided one of the moments of the Winter Olympics with a lovely tribute to his parents after his performance.\n\nNaumov's parents were tragically killed last year in a plane crash while coming home from last year's US Nationals, and he said his goal in Milano Cortina is for people to see the hard work they did to get him to this stage.\n\nNaumov received a warm reception from the crowd when he went out on the ice, before skating to a beautiful Chopin nocturne in a routine he has been calling a remembrance.\n\nHe landed his opening quad salchow well, bringing applause, and his artistic, heartfelt routine featured graceful spins as the violin and piano piece tugged at the heartstrings.\n\nHe held his finishing pose, and then the emotions came along with the applause. Naumov looked up and smiled, then put his hands over his face.\n\nSitting in the \"kiss and cry\" area waiting for his marks he held up a picture of his parents, Vadim Naumov and Evgenia Shishkova — 1994 world champions in pairs for Russia.\n\nHis marks were a season's best in 85.65, but it wasn't really the point.\n\n3. Australia's double injury nightmare\n\nCam Bolton's Milano Cortina campaign was ended due to a pair of stable neck fractures, adding to Australia's mounting injury toll. (AAP: Dan Himbrechts)\n\nAustralia's Winter Olympics campaign was rocked as both Cam Bolton and Misaki Vaughan were ruled out of the Games after being injured in falls.\n\nThe Australian Olympic Committee (AOC) released a statement confirming snowboard-cross competitor Bolton \"sustained a serious injury during a fall on course at training on Monday\".\n\nBolton reported worsening neck pain yesterday, and a CT scan at the Olympic Polyclinic identified two stable neck fractures.\n\n\"He has been transferred by helicopter to a hospital in Milan for further imaging and assessment, accompanied by a member of the Australian Olympic medical team,\" the AOC said.\n\nIt also confirmed that Vaughan has been ruled out of the Snowboard halfpipe following a failed Head Injury Assessment (HIA).\n\nVaughan hit her head during training on Monday and showed symptoms of a head injury when assessed on site.\n\nWhile the Late Athlete Replacement option was enacted in the case of Bolton, with debutant James Johnstone replacing him, there was no replacement for Vaughan.\n\n4. Italian veteran wins another medal at her sixth Games\n\nItaly's Arianna Fontana won her third Winter Olympics gold medal at her sixth Games. (Getty Images: Andy Cheung)\n\nItaly's Arianna Fontana cemented herself as the most decorated short track speed skater of all-time with another Olympic medal.\n\nFontana and the Italian team dominated the mixed team relay final to the delight of the vocal home crowd in the first short track final of the Winter Games. Canada was second and Belgium third.\n\nThe 35-year-old now has a total of 12 Olympic medals, including three golds, and has picked up at least one medal in each of her six Winter Olympics.\n\n\"This is our home. We're here to protect it,\" was Italy's motto for the race, Fontana said.\n\n\"We tried to show it to the home crowd, 'We're here, we're on a mission,' and that's what we delivered.\"\n\nFontana already began the final as the most decorated Italian Winter Olympian ever, in an Olympic career which began with a relay bronze at the age of 15, the last time Italy hosted the Games in 2006.\n\nIf her 15-year-old self could see her now, \"she won't believe that I'm still here,\" Fontana said. \"She will be like, 'Why are you still skating?' But I'm sure she will be proud.\"\n\n5. Copyright drama ends in friendship\n\nAmber Glenn's use of Seb McKinnon's music ended up in a friendship between the pair. (Getty Images: Tang Xinyu)\n\nCopyright infringement is only a relatively recent issue in figure skating. Before 2014 and a loosening of regulations surrounding competition soundtracks, the bulk of the music used in the sport was in the public domain.\n\nSince then, numerous athlete-composer disputes have cropped up, with the process of acquiring rights often confusing.\n\nEarlier this week, Canadian artist Seb McKinnon, who releases music under the name CLANN, took to social media to express his shock at his song The Return being used in American Amber Glenn's gold medal winning routine, despite Glenn performing to the piece for two years.\n\n\"So just found out an Olympic figure skater used one of my songs without permission for their routine. It aired all over the world … what? Is that usual practice for the Olympics?\" McKinnon posted to X.\n\nHowever, a potentially thorny situation was resolved well for both parties, with Glenn on Monday saying they will move forward together, looking to build on both fanbases.\n\n\"It's my sincere hope that I was able to help create new fans of both figure skating and Seb,\" Glenn said.\n\n\"We will move forward and continue supporting both artists and the skating community.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-israeli-president-herzog-to-arrive-in-canberra-today-angus-taylor-allies-plotting-to-quit-ley-s-frontbench-ahead-of-leadership-challenge-20260211-p5o18f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Israeli President Isaac Herzog touches down in Canberra; Angus Taylor allies plotting to quit Ley’s frontbench ahead of leadership challenge",
        "publish_date": "Wed, 11 Feb 2026 13:47:10 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine",
            "Isabel Mcmillan"
        ],
        "text": "Rental affordability is at a record low, according to data from Cotality, with rents rising two and a half times faster than wages.\n\nThe monthly housing data showed renters in “deep housing stress” are spending a third of their income on rent.\n\nFurther data from the Australian Bureau of Statistics showed investor lending is up more than 23 per cent, as buyers received $43 billion for their housing assets in the first three months of the government’s 5 per cent deposit scheme.\n\nGreens Senator Barbara Pocock Alex Ellinghausen\n\nGreens Senator Barbara Pocock said the data showed the biggest winners of the scheme were property speculators “who rushed into the market, certain that the government’s policy was going to push up property prices, and they were right”.\n\n“Renters are footing the bill for a market stacked in favour of investors, while their wages can’t keep up,” she said. “Australia is in a national housing crisis that is spiralling out of control and renters are being squeezed dry in a landlord-driven market.\n\n“How is it fair that renters are bearing the brunt of the housing crisis while investors profit from tax incentives such as the capital gains tax discount?\n\n“Across the country, renters are in deep financial strife while governments hand out huge tax perks to property hoarders. Labor must scrap these tax breaks.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/olympio-ramps-up-drilling-at-historic-quebec-gold-belt-20260211-p5o1eg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Olympio ramps up drilling at historic Quebec gold belt",
        "publish_date": "Wed, 11 Feb 2026 13:45:59 +1100",
        "category": "finance",
        "authors": [
            "Rowena Duckworth"
        ],
        "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Olympio ramps up drilling at historic Quebec gold belt Brought to you by BULLS N’ BEARS Rowena Duckworth February 11, 2026 — 1:45pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPerth-based Olympio Metals is back on the drill bit at its Bousquet gold project in Quebec, restarting diamond drilling at the Paquin prospect as it looks to build on the highly successful maiden program completed last year. Olympio Metals’ Bousquet project is within Quebec’s famed Abitibi belt. The new campaign is focused squarely on following up standout high-grade results delivered last year, which included intercepts of 6.40 metres at a stellar 6.54 grams per tonne (g/t) gold from 183.0m, 7.90m at an equally spectacular 6.20g/t gold from 138.0m and an eye-watering 1.50m at 54.20g/t gold from 235.5m. Those hits confirmed the presence of a robust gold system hosted along the Cadillac Break, one of the world’s most prolific gold structures. This year’s program comprises eight diamond holes for about 1,200m and is designed to test both up-plunge and up-dip extensions of the mineralisation intersected in a previous drill hole, which threw up tantalising wisps of visible gold. ‘This program will provide further insight into the shallower parts of the Paquin gold system...’ Olympio Metals managing director Sean Delaney\n\nAdvertisement\n\nTwo planned drill holes will specifically target those extensions, while the remainder of the program will focus on the top 100m of the Paquin system, a zone that remarkably has not been drilled since the 1940s. Replacing that historic drilling with modern data is a key objective for Olympio. Much of the early exploration across Paquin relied on outdated survey methods and incomplete sampling, leaving large gaps in geological understanding and making the data unsuitable for modern 3D modelling. The new drilling is intended to deliver reliable structural and geological information that can be confidently incorporated into an updated mineralisation model. Geologically, the area features high-grade disseminated sulphides in biotite-altered schistose and ultramafic rocks, as well as stacked, smoky-blue-grey quartz veins. It is these structurally controlled quartz veins that host the gold and typically have associated sulphides, making them potentially detectable by IP or EM geophysical methods, making detection easier. The Bousquet project sits squarely on the Cadillac Break in Quebec’s Abitibi greenstone belt, a region that has produced more than a whopping 110 million ounces of gold. The project is also strategically located within 15km of several multi-million-ounce gold mines, including Agnico Eagle’s La Ronde operation and Iamgold’s Westwood mine, underscoring the area’s strong endowment and established mining infrastructure.\n\nAdvertisement\n\nOlympio Metals managing director Sean Delaney said: “After a highly successful maiden drill program in 2025, the Company is excited to recommence drilling at Paquin for 2026. This program will provide further insight into the shallower parts of the Paquin gold system, where the majority of historical drill coverage is from the 1940s. These historical datasets are over 80 years old and are not reliable to incorporate into a 3D model, with outdated survey methods and incomplete sampling intervals.” Beyond Paquin, Olympio has the option to acquire an 80 per cent interest in the broader Bousquet project from Bullion Gold Resources through staged cash and share payments and exploration expenditures. To date, the company has completed nearly C$1 million in exploration spending and made C$0.30 million in payments, steadily advancing its foothold in the district. With drilling now underway, Olympio is aiming to confirm continuity, upgrade confidence in the shallow mineralisation and determine whether the high-grade shoots identified in 2025 extend into areas that have never been properly tested. In a region renowned for delivering long-life, high-grade gold mines, the company is positioning itself to see whether Paquin can join that lineage as modern drilling replaces decades-old data. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/rowing-ain-t-happening-if-not-in-rockhampton-bleijie-says-20260211-p5o1dr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rowing ‘ain’t happening’ if not in Rockhampton, Bleijie says",
        "publish_date": "Wed, 11 Feb 2026 13:36:56 +1100",
        "category": "sports",
        "authors": [
            "Julius Dennis"
        ],
        "text": "Advertisement\n\nNationalQueenslandBrisbane 2032 Olympics Rowing ‘ain’t happening’ if not in Rockhampton, Bleijie says Julius Dennis February 11, 2026 — 1:36pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nQueensland’s deputy premier has put the kibosh on a south-east Queensland council’s plan to host the 2032 Olympic rowing, saying the events will happen in Rockhampton or not at all. The City of Moreton Bay planned to discuss on Wednesday a new rowing venue at what is currently a quarry in Lawnton, just north of Brisbane. News of the potential new venue comes after months of speculation that the Fitzroy River in Rockhampton might be unsuitable for Olympic level rowing due to its susceptibility to fast currents. Bleijie said hosting the rowing in Rockhampton was the only option. Julius Dennis With testing of the river being undertaken by the Games Independent Infrastructure Coordination Authority (GIICA), the Moreton Bay plan emerged out of the blue.\n\nAdvertisement\n\nThe venue, flagged in the council’s meeting agenda as a new flatwater precinct, is backed by the quarry’s operators, Boral Cement. The venue for Sydney 2000 Olympics, at Penrith, was also constructed on a former quarry. Related Article Brisbane 2032 Olympics Moreton Bay in bold bid to snatch Olympic rowing from Rockhampton But deputy premier Jarrod Bleijie dismissed the idea out of hand, and said he had already told Moreton Bay mayor Peter Flannery no other options were being considered. “The Queensland government has decided where the venues are through our 2032 delivery plan, and that’s where they are — it’s not changing,” he said. When it was put to him that the host contract dictated the International Olympic Committee has final approval for the venues, Bleijie said the government would not budge.\n\nAdvertisement\n\n“Rowing is going to be in Rocky. If they don’t want it in Rocky, it ain’t happening,” he said. “That’s a big call for the IOC, so I think they should just proceed.” Asked if he was threatening to cancel the rowing if the IOC did not agree to host it in Rockhampton, he said he “didn’t say that”. Bleijie said early results from the GIICA testing were positive. “I’ve had no indication that there would be anything but support for rowing in Rocky from the International Federation [of Rowing] or the IOC,” he said.\n\nAdvertisement\n\nA Rowing Australia spokesperson said they could not comment on the proposal at this time. The City of Moreton Bay has been contacted for comment. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/aussie-smylie-becomes-liv-golf-royalty-20260208-p5o0fg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie Smylie 'becomes LIV Golf royalty'",
        "publish_date": "Wed, 11 Feb 2026 13:09:57 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie Smylie 'becomes LIV Golf royalty'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-wall-street-eyes-records-paramount-sweetens-warner-bros-offer-20260211-p5o180.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX higher as CBA surges; CSL dives",
        "publish_date": "Wed, 11 Feb 2026 12:58:57 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX higher as CBA surges; CSL dives Staff reporter Updated February 11, 2026 — 12:58pm ,first published February 11, 2026 — 5:12am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has extended early gains as investors digest a raft of results from some of the bourse’s biggest companies, with Commonwealth Bank and AGL among the big winners. The S&P/ASX 200 was up 122.4 points or 1.4 per cent in early afternoon trade, as six of 11 industry sectors traded in negative territory but financial stocks helped to boost the index. CBA shares surged in early trade. Oscar Colman Commonwealth Bank bounced 8 per cent as it announced a rise in half-year profits to $5.4 billion. It also hiked its dividend while chief executive Matt Comyn said that persistent inflation was putting “upward pressure” on interest rates. The rest of the big four were also higher. Westpac was up 1.6 per cent, National Australia Bank rose 1.3 per cent and ANZ Bank was up 1 per cent. Health giant CSL tumbled 12.9 per cent. That followed news its earnings for the December half-year had dived 80 per cent after it was forced to write down the value of its assets by $US1.1 billion ($1.6 billion). The biotech giant’s poorly timed announcement of its chief executive’s departure on Tuesday afternoon wiped tens of billions of dollars from its market valuation.\n\nAdvertisement\n\nMining stocks advanced. Among the big iron ore miners BHP gained 1.2 per cent, Rio Tinto rose 1.1 per cent and Fortescue moved 1.6 per cent higher. Gold miner Northern Star slid 0.3 per cent but Evolution Mining jumped 6.2 per cent after it reported a record underlying profit of $785 million. Related Article Opinion\n\nBillionaires Who got richer and who went backwards in the billionaire Olympics Elizabeth Knight Business columnist Energy giant AGL rose 8.9 per cent after releasing its results despite its net profit falling more than 40 per cent from $162 million to $94 million in the six months to December 31. Earnings were dragged down by losses on energy derivative contracts. On an underlying basis, AGL’s half-year profit, which fell 6 per cent to $353 million, was better than analysts had been expecting. The company also announced it has agreed to sell its telco business to Aussie Broadband in a deal it says will simplify its operations and slash costs. Woodside Energy added 0.4 per cent while Santos was flat. Kerry Stokes’ $20 billion industrial group SGH reported a slight lift in net profit to $471 million. It’s the group’s last result to include its stake in embattled group Seven West Media which merged with Triple MMM owner Southern Cross Media, last month. Revenue fell 1.8 per cent to $5.4 billion but SGH managed to lift earnings after cost-cutting and a strong performance from Boral. Offsetting that were declines across WesTrac, Coates, and its energy business as well as another sharp decline from Seven West. Its shares are 4.7 per cent higher.\n\nAdvertisement\n\nStagnating pizza giant Domino’s gained 2.6 per cent after announcing senior McDonald’s executive Andrew Gregory will be its new global chief executive. The group’s executive chairman Jack Cowin has been hunting for a new global CEO since June last year, when Mark Van Dyck resigned after just seven months in the top job. The Australian dollar was trading at US70.96¢ at 12.55pm AEDT. Overnight, stocks drifted on Wall Street following a mixed set of profit reports from big US companies, as toy maker Hasbro jumped but drinks giant Coca-Cola slipped. Hopes also rose that the Federal Reserve would cut interest rates later this year to boost the economy following a discouraging report on retail sales. The markets are hoping the Federal Reserve will cut interest rates later this year to boost the US economy. AP The S&P 500 fell 0.3 per cent after briefly rising above its all-time high, which was set a couple of weeks ago. The Dow Jones Industrial Average added 52 points, or 0.1 per cent, to its own record, while the Nasdaq composite fell 0.6 per cent.\n\nAdvertisement\n\nThe action was strong in the bond market, where Treasury yields fell after a report showed US retailers made less money at the end of last year than economists expected. Shoppers spent roughly the same amount in December as they did in November, less than the modest growth that economists expected. Related Article Opinion\n\nJapan The ‘Iron Lady’ looking to shake up the world order Stephen Bartholomeusz Senior business columnist Altogether, the data should help the Federal Reserve decide what to do with interest rates. The Fed has put interest rates cuts on hold, and too-hot inflation could keep it on pause for a long time. But a weakening of the job market, on the other hand, could push it to resume cuts more quickly. Hasbro climbed 7.5 per cent after topping analysts’ expectations for profit and revenue in the latest quarter. The toymaker credited its Magic: The Gathering game in particular, and announced a program to send up to $1 billion ($1.4 billion) of cash to investors by buying back its own stock. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/im-not-looking-to-change-jonathans-legacy-david-genat-talks-australian-survivor-20260211-p5o1av.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'I'm not looking to change Jonathan's legacy': David Genat talks Australian Survivor",
        "publish_date": "Wed, 11 Feb 2026 12:37:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/cba-profits-rise-to-5-4-billion-comyn-sees-upward-pressure-on-rates-20260210-p5o17d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA shares rocket as profit beats expectations",
        "publish_date": "Wed, 11 Feb 2026 12:34:39 +1100",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "Advertisement\n\nUpdated BusinessBanking & financeEarnings season CBA shares rocket as profit beats expectations Clancy Yeates Updated February 11, 2026 — 12:34pm ,first published February 11, 2026 — 7:49am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nCommonwealth Bank chief Matt Comyn has tipped a short cycle of interest rate hikes that would have a slight effect on the property and mortgage markets, saying the banking giant expects only one more interest rate rise from the Reserve Bank. Delivering a $5.4 billion half-year profit result that beat market expectations, Comyn on Wednesday said inflation was putting “upward pressure” on interest rates, but it would be a “relatively brief” period of rate hikes from the central bank. The profit result sparked a surge in CBA shares, which jumped 7.8 per cent in early afternoon trade as analysts said CBA’s charges for bad debts were lower than the market had forecast. Comyn also indicated he was open to potential changes to the capital gains tax regime to support housing affordability, following reports Treasurer Jim Chalmers is considering a cut to capital gains concessions in the lead-up to this year’s budget. Comyn stressed any such change should be part of a wider package. Commonwealth Bank of Australia chief executive Matt Comyn. Alex Ellinghausen\n\nAdvertisement\n\nSpeaking to this masthead, Comyn said the bank was forecasting one more possible rate rise this year, which he acknowledged would be unwelcome news to borrowers who are stretched. Related Article Analysis\n\nScams After growing to $4.5 trillion, super faces its next big challenge: scammers “We’ve seen one rate increase, we expect that there’ll be perhaps one more, but we don’t think more than that, and then I think there’ll be sort of pressure to go back into an easing cycle beyond that,” Comyn said. Comyn said the impact of higher rates on housing and home loans would be “slight”, flagging credit growth and house price growth of about 5 per cent this year. “I don’t think it’s going to have a really significant impact. For households that have been… stretched, clearly, the prospect of increasing rate hikes, is not something that they’re looking forward to, but I think it will be a relatively brief period of interest rate hikes.”\n\nAdvertisement\n\nOn the prospect of changing the capital gains tax regime, Comyn acknowledged the importance of “intergenerational equity” and said it would be appropriate to look at the issue as part of a wider discussion about taxation. He also highlighted the need for more housing supply and the growing tax burden on working Australians over time. “Without having any of the specifics, I could envisage that [changes to capital gains tax rules] would be, an appropriate measure to look very closely at,” he said. The comments came as CBA’s December half results showed fewer customers were struggling with their home loan repayments, while the banking giant expanded its vast portfolio of home loans and deposits. Cash net profit rose by 5 per cent for the December half compared with the same half a year earlier, beating analyst expectations. In a sign of its confidence in the outlook, CBA said it would raise its interim dividend by 4 per cent to $2.35. Analysts had expected first-half profits of about $5.2 billion and a dividend of $2.31.\n\nAdvertisement\n\nCBA and its rivals last week passed on the RBA’s rate rise to their home loan customers in full, and analysts say the rises are likely to act as a tailwind to bank profits. One in four Australian home loans is with CBA, a market share the bank held in the latest half, while its share of household deposits edged up to 26.6 per cent. The bank has been expanding aggressively into business banking, an attractive market for banks, and in the half CBA grew its business loans and deposits by more than the industry average. Comyn said CBA customers had been supported by lower rates and the strong labour market, and the bank reported lower costs for impaired loans and a fall in home loan arrears. One in four home mortgages in Australia is held by CBA. Eamon Gallagher\n\nAdvertisement\n\nDespite ongoing cost-of-living pressure on many households, CBA said the share of home loan customers behind on repayments had edged lower in the period, thanks to lower interest rates. It said 87 per cent of its customers were ahead of their scheduled repayments. Related Article Opinion\n\nInterest rates Raising interest rates was the RBA’s least-worst option Elizabeth Knight Business columnist A key focus for investors is the bank’s net interest margins – which compare funding costs with what the bank charges customers – and CBA reported a lower margin of 2.04 per cent compared to the June half. Across the banking industry, margins have been pressured by stiff competition in home loans, where Macquarie has been rapidly expanding its share. Comyn acknowledged it was closely watching the competitive backdrop: “We continue to watch the competitive intensity and its implications across the financial system. We are well placed to compete effectively and will continue to adjust our settings as appropriate,” he said. Citi analyst Thomas Strong said CBA’s margin beat market expectations, while its bad debt charges of $319 million were “much better than anticipated”. Strong said the profit result reflected the underlying health of the Australian economy, and it boded well for the full-year.\n\nAdvertisement\n\nThe banking giant’s operating costs rose 5 per cent, an increase it said was driven by higher investment in technology, inflation and some new hiring. CBA’s full-time staffing ranks rose 1 per cent during the six-month period, with the bank employing slightly more than 51,600 people. CBA is regarded as the technology leader among the big four banks, and it said investment spending rose 10 per cent in the half to $1.2 billion, as it sought to bolster its artificial intelligence capabilities. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/life-choices-in-the-frame-amid-the-grim-comedy-of-dysfunctional-family-drama-20260207-p5o0c6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This intriguing concert began almost without us knowing",
        "publish_date": "Wed, 11 Feb 2026 12:15:53 +1100",
        "category": "entertainment",
        "authors": [
            "John Shand",
            "Millie Muroi",
            "George Palathingal",
            "Peter Mccallum",
            "Harriet Cunningham"
        ],
        "text": "Advertisement\n\n★★★★ CultureLive reviewsSydney live reviews This intriguing concert began almost without us knowing John Shand, Millie Muroi, George Palathingal, Peter McCallum and Harriet Cunningham and Updated February 11, 2026 — 12:15pm ,first published February 7, 2026 — 1:42pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nMUSIC\n\nAustralian Chamber Orchestra\n\nCity Recital Hall, February 10\n\nUntil February 18\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★ It’s hard to know where it begins. A low rumble, not quite a note but not quite a noise, barely rising above the patchy pre-concert silence of shuffles and breaths. A distinct phrase or ostinato emerging from the fuzzy palimpsest from time to time, a moment of near clarity to intrigue the ear, before melting back into the whole. This is Horizon, a new work - in fact, a diptych - by composer and activist John Luther Adams. The two parts have their world premiere on alternate nights, in this, the ACO’s first Australian tour for the year. (They will also give the US premiere later this year, and record both parts for CD release in April). Dejan Lazić performs Rachmaninoff’s Rhapsody on a Theme of Paganini. Charlie Kinross Visible Horizon (or is it True Horizon? We aren’t told) is mesmerising, its pulse-free, shapeless rise and fall somehow rewiring my attention span to remain engaged for the entire work. I would be fascinated to experience the entire 40-minute span.\n\nAdvertisement\n\nStravinsky’s Concerto in D Basle, by contrast, arrives with pinpoint precision and no time to lose. This is the kind of work that showcases the ACO as a tight-knit band of soloists: staccatos underpinned by pizzicato, or bulging thick chords, played in tight unison, like a musical hive mind. De Profundis makes an ideal companion piece to the Stravinsky. An early work of Latvian composer Raminta Serksnyte, it channels youthful anxieties and emotions into a compelling tumble that, like the Stravinsky, explores the full range of textures available to a string orchestra. Artistic director Richard Tognetti goads the ensemble into a fiery, take-no-prisoners account. Pianist Dejan Lazic arrives on stage for the headline work of the concert, Rachmaninoff’s Rhapsody on a Theme of Paganini. Lazic is a delightful partner-in-crime for this not entirely successful arrangement for piano, strings and percussion, making up for the orchestral technicolour of the original with a micro-flamboyant exploration of moods across the 24 variations. His performance flips the work from grand circus back to a marvel of ingenuity, piecing together glittering fragments into a dramatic whole.\n\nAdvertisement\n\nMUSIC\n\nLaneway Festival\n\nCentennial Park, February 8\n\nReviewed by GEORGE PALATHINGAL\n\n★★★★½ On a day that started more pink poncho club than Pink Pony Club, Laneway – Australia’s premier rock festival pretty much since its 2005 Melbourne debut made the Big Day Out look relatively basic – once again excelled. A little bit, or even a biggish bit of afternoon rain was never going to stop the thousands of largely Millennial young adults who turned out to see the world’s hottest and coolest acts. It started especially strongly, with Frankston, Vic’s Belair Lip Bombs serving delicious alt-rock jangle at one end of the park, before we spent much of the afternoon doing laps of Centennial to see what was going on everywhere else. Chappell Roan (here earlier in the tour) ruled in Sydney. Chontalle Musson\n\nAdvertisement\n\nHappily, to get to the other end you passed the main stages in the middle, so even if you made the trek to encounter a relative dud on the electronic-friendly (but handily covered) stage you’d catch something fantastic in the middle: the moving, acoustic prettiness of a Gigi Perez, say, or Lucy Dacus making her take on maudlin indie somehow work to thousands in a field, too. Still, past the activations for beauty brands and movies (one opportunity I didn’t take was to get my hair done like Margot Robbie in Wuthering Heights), French enigma Oklou was gently mesmerising in that electronic tent, while solo party-starter The Dare had a solid crack at tearing the roof off it a bit later. Geese were equal parts mind-blowing and borderline nonsense. The truly alternative Geese, equal parts mind-blowing and borderline nonsense, appeased the chin-stroking cognoscenti before the big finish on the main stages, starting with superlative Brit indie-rockers Wet Leg and the intoxicating charisma of their frontwoman Rhian Teasdale – the first of two musical icons-in-waiting on that stage. The other, of course, was headliner Chappell Roan, who has, in just the past couple of years, become the most exciting pop star in recent memory. Her set, all vamp and camp in the best way, was drawn from her only album The Rise and Fall of a Midwest Princess and a handful of singles (with a scorching cover of Heart’s Barracuda thrown in for good measure).\n\nAdvertisement\n\nLaneway makes the Big Day Out look pretty tame. It already sounds like a greatest hits collection and only the hardest-hearted indie snob would say otherwise. And, at a Laneway powered predominantly by female or female-featuring acts – possibly deliberately, more likely just because they’re currently the best around (late bonus shout-out to Canberra rock bad-arses Teen Jesus and the Jean Teasers and Kiwi charmer Benee) – seeing Roan rule it so magnificently was a delight. MUSIC\n\nBach’s Motets\n\nBach Akademie Australia and The Song Company\n\nMosman Art Gallery, February 8\n\nReviewed by PETER McCALLUM\n\n★★★★\n\nAdvertisement\n\nScholars remain unclear about the intended purpose of some of Bach’s motets, but musicologist Christoph Wolff suggests they were used, in part, to train singers in the difficult demands of his music. To sharpen their minds, musicians were fined one groschen (the price of two quarts of ale) for an accidental mistake, and three groschen for a deliberate slip-up. The Bach Akademie and Song Company’s performance of the seven motets now confidently attributed to Bach would scarcely have refreshed the coffers. It was concentrated and rewarding – concentrated because of the music’s rich complexity of design and texture, and rewarding because of the Song Company’s superb mastery of interweaving vocal polyphony. Performed by eight Song Company members arranged in an arc against the high brick wall of the former church that is now Mosman Art Gallery, with four players from the Bach Akademie providing continuo accompaniment, the sound from my vantage point towards the back was vivid, and clear, although it included the acoustic quirks that give such buildings their individuality. Occasionally, notes or parts were boosted unexpectedly. As a violinist, Bach Akademie musical director Madeleine Easton conducted like an instrumentalist, which was not out of place in the instrumentally inspired figuration of the opening motet Lobet den Herrn, BWV 230 although it set a challenge for the singers, albeit one they met handsomely.\n\nAdvertisement\n\nThe halting phrases at the start of Komm, Jesu komm had clipped brightness opening out to mellifluous phrases that were slightly missing from the earlier motet. Sandra Milliken’s Herr Jesus Christus began with low hummed sounds from the male singers before translucent yet sombre chorale-like passages from the upper voices established the music’s tread. At expressive moments, the harmonies modulated vertiginously as though momentarily becoming unanchored. Ich lasse dich nicht BWV 1164 (previously thought to be by Johann Christoph Bach, cousin once removed of Johann Sebastian) and Der Geist hilft unser Schwachheit auf BWV 226 ended the first half, the latter threatening to rattle the fine jar at one tricky moment, although it was small beer. After an involving reading of Furchte dich nicht BWV 228, cellist Daniel Yeadon gave an unassuming and intimate performance of the Prelude from Bach’s Cello Suite No. 2 in D minor BWV 1008. A highlight of the concert was Jesu Meine Freude, BWV 227, particularly the beautiful delicacy of the ninth movement in which sopranos Susannah Lawergren and Michelle Ryan coaxed phrases with exquisite delicacy against tenor Christopher Watson, punctuated by warm soft phrases of the chorale from the altos. O Radiant Dawn by Scottish composer James MacMillan had well-shaped intensity before the glorious eight-part complexity of Singet dem Herrn ein neues Lied , BWV 225 erupted with brilliant agility and exhilarating joy.\n\nAdvertisement\n\nTHEATRE\n\nPurpose\n\nWharf 1 Theatre, February 6\n\nUntil March 22\n\nReviewed by JOHN SHAND\n\n★★★★ Faith has been a fickle mistress for Solomon Jasper. She’s steeled his will in the fight for Civil Rights, but failed to assuage his disappointment in his sons, or prevent his leaving an illegitimate brood in his wake. So Solomon, a retired living treasure among African Americans, has turned to beekeeping. Bees, you see, know their purpose in life. So did Solomon. Once. Tinashe Mangwana as Naz, who leads the audience through the events of Purpose. Prudence Upton American playwrights have focused on dysfunctional families with gleeful zeal. Branden Jacobs-Jenkins follows the hallowed tradition of O’Neill, Williams, Miller and Albee, except he elevates the Jaspers’ dysfunctionality to the grotesque.\n\nAdvertisement\n\nHis theatrical masterstroke is a narrator to steer us through the labyrinth of interlocking hostilities, and tease us with what’s to come. That’s Nazareth, the younger son of Solomon and matriarchal wife Claudine – Naz to all but his father. Naz must be affable, amusing and just a little quirky because he’s neurodivergent to an unspecified degree. Tinashe Mangwana is ideal in director Zindzi Okenyo’s STC production, making credible this asexual creature who delights in solitude while photographing nature. Deni Gordon as matriarch Claudine, Tinashe Mangwana as Naz, Markus Hamilton as Solomon Jasper. Prudence Upton Naz has just donated sperm to his lesbian friend Aziza, when she drops him off at his parents’ place. All would have been well had she not had to return a forgotten phone charger, by which time the snow’s setting in, and Claudine insists Aziza stay. If that sounds like the set-up for a melodrama, in part it is, for this play is a many-headed monster: questioning the purpose of life and the viability of marriage; interrogating fame, reputation and accepting one’s children as they are. It even becomes a grim comedy. Fireworks at a very awkward family dinner. From left: Deni Gordon as matriarch Claudine, Grace Bentley-Tsibuah as Morgan, Sisi Stringer as Aziza, Maurice Marvel Meredith as Morgan’s husband Junior, Tinashe Mangwana as Naz and Markus Hamilton as Solomon Jasper. Prudence Upton\n\nAdvertisement\n\nThe flaws in Okenyo’s production show when the melodrama holds too much sway, and the anger is too relentless. In all other regards, this is an exemplary production of a singular play that would swiftly expose pretenders in the cast. Okenyo’s is strong, with Markus Hamilton as the sternly patriarchal, deeply flawed Solomon. Deni Gordon plays Claudine, and while she has minor lapses, she’s convincing as the only person on earth who can lord it over Solomon. Sisi Stringer is charismatic as the livewire Aziza, who didn’t know Naz came from this famous family, nor that his real name was Nazareth. Now she’s not so sure about his fathering of her child. Maurice Marvel Meredith excels as the elder son, Solomon Junior, a politician mired in white-collar crime, with the family assemblage celebrating his release from prison as well as Claudine’s birthday. Junior’s wife, the feisty Morgan (about to do her own time, now that Junior’s out, as they have two young boys), is brilliantly realised by Grace Bentley-Tsibuah. Morgan has wised up, before anyone else, to the Jaspers not exactly being angels of black excellence. Jeremy Allen’s set is as lavish as the Jaspers are larger than life, and this is an auspicious start to artistic director Mitchell Butel’s STC programming. MUSIC\n\nOneRepublic\n\nQudos Bank Arena, February 6\n\nReviewed by MILLIE MUROI\n\n★★★½\n\nAdvertisement\n\nIf there’s one thing a performer dreads, it’s coming down with an illness on tour. For OneRepublic frontman Ryan Tedder, the show must go on and, fuelled by sips of tea between songs, he delivers. Sure, it’s possible to hear a slight huskiness when he reaches for the high notes, and there are points – especially later on in the show – when he seems to be either saving his voice or is just plain fatigued. Ryan Tedder and OneRepublic in full flight at Qudos Bank Arena. Brody Harper But he and his band make it worth the while. The production is well done with simple but effective lighting and imagery, but it’s Tedder’s interpretation that adds spice to the band’s songs. Switching between high to low registers, and adding vocal twists and runs, Tedder has an instinct for playing with his songs vocally without losing the essence of the number – or doing it just because he can.\n\nAdvertisement\n\nSome of OneRepublic’s early hits such as Good Life are crowd pleasers yet benefit from Tedder’s renewal. Lesser known song Life in Colour – which he says the band should have put more in the spotlight on release in 2013 – also gets its time in the sun as its soft instrumentals complement Tedder’s intentional, emphatic and intimate take on the song. OneRepublic in action. Brody Harper Perfect execution of songs as they’ve been heard before can be pleasant, but in this show the added flair and vocal acrobatics imbue the music with a flavour you won’t hear in OneRepublic’s discography. There are no jaw-dropping moments or goosebumps, but a solo segment with Zach Filkins on Spanish guitar is a highlight, as is the preview of their song Need Your Love to be released later this year: a catchy and promising medley of rock, hip hop and pop. Tedder’s keyboard prowess is also impressive. Having written chart-toppers including Halo (ostensibly penned as he gazed at a photo of Jay-Z and imagined what it must be like for Beyoncé to love him), and Bleeding Love sung by Leona Lewis, Tedder adds enchanting detail to these scores when he plays them on piano.\n\nAdvertisement\n\nAfter a mellow middle section, the show is jam-packed as it ends, with best known songs such as Counting Stars, Apologise and I Ain’t Worried bringing it back to life. Eighteen years after their first Sydney appearance, OneRepublic show why they are still masters of music. They are versatile, polished and adventurous – even with a lead singer nursing his vocal chords on stage in real time.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/how-amyl-and-the-sniffers-star-found-herself-in-a-legal-stoush-with-a-us-photographer-20260210-p5o16m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Amyl and the Sniffers star found herself in a legal stoush with a US photographer",
        "publish_date": "Wed, 11 Feb 2026 12:04:34 +1100",
        "category": "entertainment",
        "authors": [
            "Karl Quinn"
        ],
        "text": "Advertisement\n\nCultureMusicAustralian music How Amyl and the Sniffers star found herself in a legal stoush with a US photographer Karl Quinn February 11, 2026 — 12:04pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt’s hard to picture Amy Taylor, the diminutive and dynamic frontwoman of Aussie rockers Amyl and the Sniffers, in anything other than gym shorts, crop tops and garish make-up. But she may soon have to suit up in something slightly more formal should an ugly legal dispute that’s embroiled one of Australia’s hottest musical acts drag her into court. The case, which pits the Melbourne rocker against American photographer Jamie Nelson, is slated for a hearing in the US District Court in Los Angeles on February 13. And the central issue is who controls a batch of images of Taylor that were shot by Nelson for Vogue Portugal, and are now being sold on the photographer’s website for as much as $US18,000 ($25,000) per print. Amy Taylor has become one of the most recognisable women in rock. Kristoffer Paulsen What’s it all about? Taylor insists she never gave permission for the commercial exploitation of those images beyond their publication in Vogue. Nelson – who bears more than a passing resemblance to the singer – insists she owns the images and has the right to exploit them as she sees fit. As the dispute has heated up, Nelson has also alleged she feels unsafe, and sought a restraining order against Taylor (more on that below).\n\nAdvertisement\n\nThe case has both commercial implications and moral ones, touching on the prickly question of the relative rights of the artist on one side of the camera and of the subject (who happens, in this case, to also be an artist) on the other. How did it start? The matter first became public when Taylor filed a complaint in the Los Angeles District Court on December 22 last year, soon after which it was picked up by the media. But its origins date back to July 2024, when the band’s manager, Simone Ubaldi, reached out to Nelson to engage her services for a photo shoot. Declan Mehrtens (left), Amy Taylor and Bryce Wilson of Amyl and the Sniffers at the 68th Annual Grammy Awards where they were nominated for best rock performance. Jordan Strauss/Invision/AP According to Taylor’s court filing, “the images from that photo shoot were to be used for the band’s upcoming album, for publishing in future documentaries, for inclusion in the band’s special edition artwork, and for displaying on the band’s website and social media accounts.”\n\nAdvertisement\n\nIn other words, Nelson would be hired as a service provider, and the images were for the band’s exclusive use across multiple platforms. The shoot never happened, though, because the parties could not agree terms. Specifically, the court documents claim, the band was “not amenable to Ms Nelson’s use of the band’s name, image, and likeness on branded merchandise … displaying the band members’ images in gallery shows, or using their images to promote Ms Nelson’s photography business, and/or to sell their merchandise, including Ms Nelson’s ‘fine art prints’ or otherwise”. So, no girl on film? Well, here’s where it gets complicated. Months after that mooted shoot fell over, Nelson reached out to Taylor to ask her to take part in an entirely different project, a “Vogue Portugal 12-16-page editorial shoot”.\n\nAdvertisement\n\nTaylor agreed, and her suit alleges that in doing so she granted “an implied license” to use the images for the Vogue shoot alone, and “at no point did Ms Taylor authorise … any other commercial use” of the images. The shoot took place in May 2025, and the images were published in Vogue in July. Taylor contends she received no payment for the shoot or the use of the images. So, what’s the problem? It’s what happened next that lies at the nub of the dispute. In September, Nelson sent Ubaldi and Taylor a selection of images from the May shoot that she wanted to sell via her website as limited-edition fine art prints (on high-quality paper), and as a limited-edition zine. Ubaldi, on Taylor’s behalf, flatly declined.\n\nAdvertisement\n\nDespite that, those prints are still available now via the site under the collective title Champagne Problems. There are 38 images for sale in the series, each in five iterations, ranging in price from $US1500 for a small print (33 x 50 centimetres, editions of 30) to $US18,000 for the largest (152 x 228cm, editions of three). Nelson claims to have spent $US20,000 producing the works. If all prints were to sell at full price, she stands to make more than $US10.5 million. Legal letters at 15 paces… In November, lawyers for Taylor issued a cease and desist letter to Nelson, calling for her to withdraw the prints from sale. Within days, Nelson replied with an email promising to do so. But the next day, November 18, “in a complete reversal of her prior position”, Nelson rescinded that commitment and instead asserted her moral rights as the creator of the works in question.\n\nAdvertisement\n\nAnd then things got really ugly. In early December, John Angus Stewart, Taylor’s filmmaker partner (and the person responsible for the band’s videos, as well as the King Gizzard and the Lizard Wizard concert film Chunky Shrapnel), posted a story on Instagram in which he shared an image from Nelson’s website, overlaid with the words “Amyl and the Sniffers ain’t approved this scam. Don’t buy slop.” He added that the band “price things so you [fans] can afford it”. Taylor and Ubaldi also made derogatory comments about Nelson on her social media accounts. Now, who’s suing who? On December 4, Nelson sent a cease and desist notice via email to Stewart, alleging defamation and “unauthorised use of copyrighted material” (namely the photo of Taylor, taken for Vogue Portugal, that he had posted from Nelson’s website). On December 22, Taylor filed her suit against Nelson, seeking among other things a full accounting of sales to date.\n\nAdvertisement\n\nAt the same time, Nelson has taken action through the courts against Taylor. On December 9, she sought a restraining order against the singer, seeking to prevent her from approaching within 100 yards (about 91 metres) of her home and/or place of business (an unlikely scenario, given the band’s hectic touring schedule and base in Australia) and from posting on her internet or social media platforms. The application also seeks an order preventing Taylor from using “lyrics, symbols, emojis, or coded messages that can reasonably be interpreted as threats, intimidation, or instructions to confront Jamie Nelson in person or online”. In support of the order, Nelson alleged: “I have had difficulty sleeping, concentrating, and performing my work. The ongoing uncertainty and fear of aggressive and vulgar public and private attacks have interfered with my ability to function normally and have caused significant emotional harm.” She also claimed she feels “quite helpless in the face of Ms Taylor’s extensive support network. She has a large team including fans, a publicist, a manager, booking agents, and a lawyer”, and she “simply cannot compete with the scale of resources and influence that she can mobilise against me”.\n\nAdvertisement\n\nIn a highly unusual strategy, the photographer has proactively courted media coverage of the dispute, and attempted to frame Taylor’s suit as a retaliatory action in response to her restraining order. In an email to this masthead, she contends she is “seeking protection from further harassment and intimidating conduct. More broadly, my position has been that I am the copyright holder of the photographic work at issue and retain the right to create and sell fine-art prints of photographs that I produced and financed.” Her body (and face), her choice? Moral rights are at the centre of this dispute, but it’s not just about copyright. While Nelson can claim to be the creator of the works, they only came about because Taylor consented to be part of their creation, and she insists that she did so on the understanding they were for one purpose only – an editorial spread in Vogue Portugal.\n\nAdvertisement\n\nThe first she heard of Nelson’s broader ambition was in September 2025, when the photographer offered her a 15 per cent cut of the proceeds of any sales, which she then estimated might total $70,000 (a Grammy nomination, support slot for AC/DC and a splash of controversy can do wonders for prices in the art market, apparently). Taylor rejected the offer, saying in her response to the application for a restraining order “there was no royalty rate that would have made Ms Nelson’s proposal attractive to me”. Having her name, image and the identity of the band “attached to products that are affordable only to elite, wealthy buyers is horrifying to me,” she wrote. “It is against everything I stand for and would be damaging to the inclusive, egalitarian brand that my bandmates and I have worked incredibly hard to establish over the last 10 years.” Nelson asserts that she owns the images and is “fully within her legal rights to display, market, and sell fine art prints of her own copyrighted work. No approval is required from any third party”. Taylor, though, believes she has the law on her side.\n\nAdvertisement\n\nUnder section 3344 of California’s Civil Code, the use of a person’s image “without such person’s prior consent ... shall be liable for any damages sustained by the person or persons injured as a result thereof ... and any profits from the unauthorised use”. Win or lose, for the photographer there is a lot of money at stake. But for the singer, it’s about a far simpler, and more important, proposition: that she should be the only person who gets to decide how and by whom her image is exploited. And for a Tiny Bikini-wearing sister to try to take that away from her ... well, it’d be no wonder if she’s singing U Should Not Be Doing That and It’s Doing in Me Head on high rotation. Must-see movies, interviews and all the latest from the world of film delivered to your inbox. Sign up for our Screening Room newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/they-were-the-greatest-games-on-earth-so-why-did-state-of-origin-die-20230517-p5d8zk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The tackle that killed State of Origin football",
        "publish_date": "Wed, 11 Feb 2026 12:02:30 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik",
            "Andrew Wu"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size When Andy Collins ran down his Hawthorn teammate Tony Hall at the MCG in 1989, he could not have known his desperate, goal-saving tackle would lead to the demise of State of Origin football. A crowd of 91,960 had flocked to the MCG to watch Victoria play South Australia for the first time at the venue in 18 years. It was there that Hall, caked in mud, lay clutching his knee as the stretcher came out. It was an ordinary tackle with traumatic consequences. Had it not happened on a particularly boggy section of the ground, Hall may have walked away from it. Instead, he was carried off in agony after rupturing three of the four major ligaments in his right knee. Tony Hall clutches his knee after being injured in a tackle during the 1989 State of Origin clash at the MCG. Credit: Channel Seven “If you never played in a grand final, State of Origin was the closest thing to it,” Hall told the Crows in 2015. “Andy was shattered. He was in the hospital with me that night and was really upset about it. He was a good mate, and I still see Andy every now and again these days. It was really tough. The ground was terrible and muddy. You don’t get grounds like that any more, it was horrendous.”\n\nAdvertisement\n\nA great decade of state football culminated on that memorable Saturday afternoon in July when the Vics, with loose eligibility criteria, fielded a forward line featuring Tony Lockett, the Brisbane-born-and-raised Jason Dunstall, and Dermott Brereton. Ten years later, State of Origin as we knew it was gone. ‘Nerves, insecurity, fear ... give way to courage and bravery’ At this time of year many AFL fans lament what might have been as they tune into rugby league’s State of Origin series between NSW and Queensland, typically three of the most watched programs of the year. Referred to as Australian sport’s greatest rivalry, Origin in the northern states is a big deal. Performances at club level are scrutinised from the point of view of worthiness for a Blues or Maroons jersey. The best 36 players in the country come together in combat across 80 bone-jarring minutes playing for a prize considered by some to be greater than the NRL premiership. The three games in the 2022 season were the fourth, fifth and sixth most watched programs of the year, with audiences of between 2.529 million and 2.632 million. Only Ash Barty’s Australian Open victory and presentation and the AFL grand final had a larger audience. The NRL grand final was ninth.\n\nAdvertisement\n\nNSW great Phil “Gus” Gould used to deliver a stirring call to arms in a pre-game speech on Nine’s telecast titled “Last Word”, outlining the gladiatorial nature of origin. “Nerves, insecurity, fear, it will give way to courage and bravery. It will give way to the commitment you have to your teammates and your state. It will give way to the commitment you have to do whatever is necessary to win. “Why? Because that’s what Origin players do.” Legendary South Australian coach Graham Cornes recalls a time when pulling on a state jumper carried the same honour for Australian rules players – and the punters cared. He also remembers when it changed. “When the Crows came in, it changed the landscape a bit, but even the ’94 State of Origin game, some people say it’s the greatest game of footy ever played,” Cornes, who won nine of 11 origin matches, including six of eight against Victoria, said. “Don Scott was one of the commentators. He said at the end it was the best game of footy he had ever seen.”\n\nAdvertisement\n\nSimon Madden remembers the pressure he felt when he walked into the Victorian rooms before a game. “You have got Gerard Healy, Brownlow medallist, Greg Williams, Brownlow medallist, [Dale] ‘Flea’ Weightman, one of the best rovers,” Madden said. “I remember thinking: ‘I have no excuses here, I better do my job. I can’t blame anyone else’.” Tony Lockett and Dermott Brereton after the win over South Australia in 1989. Credit: Getty Images ‘The two mullets on a Tuesday night’ Former players reminisce about playing for their club on the weekend and backing up for their state on Tuesday before lining up again for their club a few days later. “Even when I played, they still played [Stephen] Kernahan versus [Paul] Roos, the two mullets, on a Tuesday night,” Saints coach and former Fitzroy hard man Ross Lyon said.\n\nAdvertisement\n\n“Timmy Watson going head-to-head with the ‘Rat’ [John] Platten. Some great footy was played, and Teddy Whitten. I think we all loved it. As a kid I went in 1978, the Victorian team with Robert Flower and [Paul] Van der Haar, and they dominated Western Australia, it was great.” Anthony Koutoufides was devastated when he was ruled out of what would have been his State of Origin debut for Victoria in 1996. “I got picked to play, but the last week before the game, I got a cork in my calf and it flared up,” he said. The Carlton great still believes the injury may have been held against him come selection a year later, and it wasn’t until 1999 that he was handed the chance to don the Big V against South Australia in what he viewed as “the greatest games on earth”. “In the ’80s, I could not wait to watch Vic v SA, Vic, WA. I would rush home from school – the greatest game on earth is on,” Koutoufides said. Much to Koutoufides’ disappointment, that clash on a sodden MCG proved to be his first – and only – taste of State of Origin.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/rfk-jr-s-policies-contribute-to-10-billion-hit-to-one-of-australia-s-biggest-companies-20260211-p5o1ap.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "RFK Jr’s policies contribute to $10 billion hit to one of Australia’s biggest companies",
        "publish_date": "Wed, 11 Feb 2026 12:01:06 +1100",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "Advertisement\n\nBreaking BusinessCompaniesBiotech RFK Jr’s policies contribute to $10 billion hit to one of Australia’s biggest companies Colin Kruger February 11, 2026 — 12:01pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTrump administration Health Secretary Robert F. Kennedy Jr’s more stringent requirements for vaccines have contributed to a $1.5 billion writedown at one of Australia’s largest companies, biotechnology firm CSL, which then suffered a $10 billion hit to its value. CSL shares plunged on Wednesday morning after the company disclosed the writedowns, posted an 81 per cent drop in first-half profit and sought to explain its abrupt chief executive change on Tuesday amid further weakness in the US vaccine market following the appointment of the vaccine sceptic health secretary. US Health Secretary Robert F. Kennedy Jr: having an anti-vaxxer in charge of America’s health system has been one of the factors hitting CSL’s performance. Aresna Villanueva The company began life as a Commonwealth-owned laboratory and became one of the Australian stock exchange’s great success stories over the past 30 years as it became a big player in blood plasma products and vaccines, but it has also been hurt by regulatory changes in China. Net profit after tax fell to $US401 million ($566 million) for the December half year, hit by restructuring costs from its transformation announced last year and $US1.1 billion ($1.5 billion) worth of asset writedowns on different parts of its global business, including its vaccine division.\n\nAdvertisement\n\nThe biotech’s share price has now halved in 18 months, shredding more than $70 billion of shareholder wealth after the latest writedowns and operational struggles Shares dropped as much as 12 per cent to a low of $150.23, having dropped 5 per cent on Tuesday evening after it botched the announcement that chief executive Dr Paul McKenzie was retiring with immediate effect that day. The stock had not stopped trading on the ASX and dropped quickly amid chaotic trading. “The results we’re presenting today represent a step in a broader transformation of CSL with the objective of delivering enhanced growth, profitability and shareholder returns,” CSL’s interim chief executive, Gordon Naylor, said on Wednesday. He emphasised that his appointment will not be a passive one, and he will continue to drive the changes announced last year.\n\nAdvertisement\n\nRelated Article Analysis\n\nAnti-vaxxer movement How Trump’s antivaxxers helped trigger Aussie giant’s $50b implosion Chairman Dr Brian McNamee told investors in a late call on Tuesday the company had a sense of “urgency” as it looked to improve its performance and indicated McKenzie was not driving the change quickly enough. “When the board sat down recently and looked at our business and thought about where we need to go in the future, we recognised he didn’t have the skills that we wanted for the future,” McNamee told analysts. He also emphasised that the board was “not happy with the performance” of the group. CSL shares dropped significantly last year, as investors were underwhelmed with its general performance, spooked by anti-vaxxer sentiment in its large US market, and US President Donald Trump’s threats to put tariffs of up to 250 per cent on pharmaceuticals.\n\nAdvertisement\n\nRelated Article Biotech Boss of $83b giant CSL exits abruptly In October last year, a further plunge in US vaccination rates since the appointment of Kennedy delivered another hit to vaccine profits and sparked a share price collapse. McNamee said the double-digit decline in US vaccination rates was a shock to the group, given the declines already experienced over the previous two years, and it was yet to see a bottom to this vaccine decline. CSL said in its results announcement that the writedown of its vaccines division was caused by a hit to the value of its coronavirus vaccine technology “driven by declining COVID disease burden and more onerous US regulatory requirements”. On Wednesday, CSL indicated this business was expected to decline further this year.\n\nAdvertisement\n\nChina has also hurt CSL because it has changed its rules to allow a plant-based version of a blood plasma product called albumin to be mixed with the traditional human blood-based equivalent produced by CSL, leading to a 27 per cent drop in its exports to the country. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/trump-s-digital-gold-dream-is-turning-into-a-nightmare-20260211-p5o19o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fool’s gold: Trump’s bitcoin dream is turning into a nightmare",
        "publish_date": "Wed, 11 Feb 2026 11:59:01 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Advertisement\n\nBusinessMarketsBitcoin Opinion Fool’s gold: Trump’s bitcoin dream is turning into a nightmare Stephen Bartholomeusz Senior business columnist February 11, 2026 — 11:59am\n\nFebruary 11, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDonald Trump has described bitcoin as “digital gold.” Events of the past four months say that, whatever else it might be, it isn’t that. The plunge in bitcoin’s price last week underscored that it isn’t behaving as its boosters have described it. It’s not a hedge against inflation, or geopolitical risks, or volatility in traditional assets, or currency debasement. Trump, once a crypto sceptic – he described it as a “scam against the US dollar” – became a convert after crypto billionaires helped fund his campaign Aresna Villanueva Gold, even though it, too, took a hit last week before regaining much of the ground it lost, does perform those roles and has demonstrated that by surging to record levels against a backdrop of volatility in global financial markets, including a depreciating US dollar, and the economic and geopolitical environments. Bitcoin’s price peaked last October at more than $US126,000 ($178,000). It fell more than 22 per cent last week to trade below $US64,000, before recovering to now trade around $US68,650.\n\nAdvertisement\n\nGold, over that same period, has soared from just under $US4000 an ounce to just over $US5000 an ounce today. It has performed as one might expect in the circumstances. Related Article Opinion\n\nJapan The ‘Iron Lady’ looking to shake up the world order Stephen Bartholomeusz Senior business columnist Where bitcoin’s price has plunged more than 45 per cent since its peak, gold’s has risen 25 per cent in that same time period. There is, in effect no positive correlation between the two, which demolishes the notion that bitcoin, or cryptocurrencies more generally, are a hedge against risk. The sell-off of bitcoin last week was part of the broader market meltdown triggered by Anthropic’s release of new artificial intelligence tools that appear to represent a significant threat to software-as-a-service companies. At one point the S&P 500 had fallen more than 2.5 per cent and the more tech-laden Nasdaq index was down 4.5 per cent as fears that AI might cannibalise existing companies earlier than anticipated rose.\n\nAdvertisement\n\nThe performance of bitcoin last week would suggest that it is far more correlated – in a highly leveraged fashion – to equity markets, and technology stocks in particular, than more defensive assets. Unlike gold, it’s leveraged to “risk on” environments rather than “risk off” settings that favour gold. The dramatic demonstration of bitcoin’s leverage to shifts in the risk environment highlights (a) its relatively scarcity and illiquidity in its primary market, given that only 21 million coins will ever be in circulation and (b) the growing liquidity in secondary, synthetic, markets as they became more institutionalised and cryptocurrencies more mainstream. Analysts expect that the price of gold will continue to surge this year after record growth in 2025. However, an ASX-listed gold play failed to fire on debut on Monday. Dominic Lorrimer There has been a proliferation of exchange-traded funds and the development of derivative markets for bitcoin that have created a deeper market for trading in crypto and bitcoin in particular. They have also, however, introduced leveraged and institutional trading strategies to a market that used to be quite unsophisticated. That could help explain the exaggerated swings in value.\n\nAdvertisement\n\nLast week, for instance, one of the proffered explanations for the extent of the bitcoin meltdown was that a Hong Kong hedge fund with a big and leveraged out-of-the-money position in bitcoin derivatives, funded by cheap yen-denominated borrowings, was caught out by the steep fall in the price and the volatility of the yen and hit by margin calls and was forced to liquidate its position. Whether that’s true or apocryphal, it highlights how combustible the combination of leverage, illiquidity and margin calls can be for crypto assets when volatility surges in financial markets. Related Article Opinion\n\nFederal Reserve Trump’s new man could spark a financial meltdown Stephen Bartholomeusz Senior business columnist The decline in bitcoin’s price, however, wasn’t a one-week phenomenon. It began in early October when the bullishness - euphoria even – that accompanied Donald Trump’s win in then presidential election in 2024 and drove bitcoin to record levels began to ebb. Trump, once a crypto sceptic – he described it as a “scam against the US dollar” – became a convert after crypto billionaires helped fund his campaign (and his family piled into the crypto world, starting up a raft of crypto businesses that have greatly increased his wealth).\n\nAdvertisement\n\nTrump declared that he would be the “bitcoin president” and the US would become the “crypto capital of the planet”. He has created a crypto strategic reserve from crypto assets (an estimated 330,000 bitcoins) confiscated by US authorities. Last year Congress passed the Genius Act, which provided a regulatory framework for stablecoins, and has the Clarity Act, which is a complementary bill that fills in some of the details, before it. That latter piece of legislation, and the delays in enacting it, might have been a contributing factor to the post October trend in crypto prices that has wiped nearly $US2 trillion from the overall crypto market’s capitalisation.\n\nAdvertisement\n\nOn Tuesday, there was a meeting at the White House between promoters of stablecoins and bankers who have been wrangling for months over whether stablecoins should, or should not, be able to offer yields or other rewards. The crypto companies say that yields are essential if they are to be competitive and drive user adoption. Trump declared that he would be the ‘bitcoin president’ and the US would become the ‘crypto capital of the planet’. The banks say they will, by offering yields the banks cannot match, drive deposits that are critical for their ability to lend into what is, compared to the banking sector, an effectively unregulated environment. On some estimates, more than $US6 trillion of deposits would be at risk. The Trump administration is keen to see the US stablecoin sector flourish because, with a requirement that for every dollar of stablecoins there always has to be a dollar of safe assets – US Treasury securities are the most obvious – it would drive demand for US government debt and lower the government’s rapidly-rising interest costs.\n\nAdvertisement\n\nTuesday’s meeting – the second in a week – doesn’t appear to have resolved the impasse. The debate, however, highlights the potential for crypto, stablecoins in particular, to change and even destabilise banking systems if the regulatory framework isn’t designed intelligently. The other influences on crypto prices since October might be Trump’s erratic deployment of tariffs, the kidnapping of Venezuela’s president, the threats to invade Greenland and the potential for another military action against Iran, all of which contribute to a risk-averse environment. Related Article Gold ‘Speculate in bitcoin, hoard gold’: Precious metal’s value soars The assaults on the US Federal Reserve and its chairman, and Trump’s nomination of Kevin Warsh, who made his name as an inflation hawk, as the next chair of the Fed probably haven’t helped. The lower interest rates promised by Trump and Warsh aren’t going to materialise if, in the process, they stiffen the resolve of the voting members of the Federal Open Market Committee to demonstrate their independence, and Warsh could easily revert to type once he gains the chair if the inflation rate remains stubbornly high.\n\nAdvertisement\n\nHis desire to shrink the Fed’s balance sheet, which would pull liquidity from the US system, would also be inimical to an asset class which, like equities, performs more strongly when there is a lot of liquidity in the system. While there might be no singular explanation for why bitcoin’s price has been tumbling over the past four months, there are, therefore, a number of streams of risk within the environment that might have contributed to a sell-off that has made it clear that, whatever bitcoin might be, it isn’t digital gold. The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/video/roblox-will-meet-with-government-over-on-platform-grooming/fsdlvoy4k",
        "title": "Roblox will meet with government over on-platform grooming",
        "publish_date": "Tue, 10 Feb 2026 09:30:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Roblox will meet with government over on-platform grooming\n\nPublished 10 February 2026, 6:59 am\n\nGaming platform Roblox is set to meet with the Communications Minister about concerns young users are being exposed to harmful content and grooming online. With more than 350 million monthly users, nearly half of whom are under 14, Roblox has dominated discussion on \"Safer Internet Day\".",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/ai-industry-risks-and-the-australian-dollar-nears-us-0-71/e0v4hjw1g",
        "title": "AI industry risks and the Australian dollar nears US$0.71",
        "publish_date": "Tue, 10 Feb 2026 07:35:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/dfat-apologises-to-families-of-australian-methanol-poisoning-victims-in-laos/5232sikwp",
        "title": "DFAT admits it 'fell short' after Laos methanol poisoning victims' families left in the dark",
        "publish_date": "Tue, 10 Feb 2026 04:03:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Department of Foreign Affairs and Trade (DFAT) has apologised to the families of two young Australian backpackers who died from methanol poisoning in Laos after they were left in the dark about a court case related to their deaths.\n\nHolly Morton-Bowles and Bianca Jones, both 19, were backpacking through Laos in late 2024 when their trip took a tragic turn.\n\nThe pair from Melbourne were fatally poisoned with methanol while drinking on a night out at Nana Backpackers Hostel in Vang Vieng.\n\nAt least six foreigners died during the mass poisoning event in November 2024, including British woman Simone White, a US tourist and two young Danish women.\n\nHolly's father Shaun Bowles said there had been a lack of information from the Australian government about the investigation by Laotian authorities into his daughter's death.\n\nThe Nana Backpackers Hostel in Vang Vieng where the methanol poisonings took place. Source: Getty / STR\n\nBowles and Bianca's father Mark Jones said they were relying on a group chat with White's family for updates from the UK government due to a lack of communication from Australian authorities.\n\nThe families then learned that 10 people connected to the hostel faced court in January and were fined $185 for destroying evidence.\n\nThose involved were also given suspended sentences, according to the group chat.\n\nDespite the Laotian court's minor sentence for the related case, no charges have been pressed over the Australian backpacking pair's deaths.\n\n\"We feel that there hasn't been enough pressure put on the Laos government,\" Bowles told 3AW on Tuesday.\n\n\"We can't get into the country, we're out of options — we need the government to help us.\"\n\nBowles suggested young travellers should forget about Laos and focus on other nations.\n\n\"Don't go,\" he said.\n\n\"We've seen first-hand. They have no appreciation of life and they've shown that by sweeping this under the carpet.\"\n\nWhile the families initially believed the court case was linked to the deaths of their daughters, the DFAT confirmed the destruction of evidence charges only related to the American tourist's death.\n\nThe department has since issued an apology to the families for failing to keep them informed about the court outcome, admitting they \"fell short of our aspiration\".\n\n'Australia expects full accountability', PM says\n\nIn Parliament on Tuesday, Prime Minister Anthony Albanese said it was appropriate that DFAT apologised for the communication failure.\n\n\"The foreign minister has made it clear to her counterpart in Laos that Australia expects full accountability, and the charges should reflect the devastating seriousness of this incident,\" he said.\n\n\"We will continue to engage Laos authorities on those cases and we will do everything we can to support Holly and Bianca's families at this distressing time.\"\n\nVictorian Premier Jacinta Allan, who has previously met the vicitims' families, said processes were adding to their grief.\n\n\"You can't even really call it a punishment, can you? It's just heartbreaking,\" she told reporters on Tuesday.\n\nIn a joint statement, Opposition leader Sussan Ley and foreign affairs spokeswoman Michaelia Cash called for the Laotian ambassador to provide \"a formal explanation\".\n\n\"The Albanese government must also explain the clear failures of consular support and diplomacy in this instance, and why the families of Holly and Bianca were not kept properly informed of these developments,\" they said.\n\nThe Laotian government previously vowed to \"bring the perpetrators to justice in accordance with the law\".\n\nThe Laos embassy was contacted for comment.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/waratahs-name-ferrari-debutant-over-wallaby-star-for-season-opener-20260211-p5o1b3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Waratahs name ‘Ferrari’ debutant over Wallaby star for season opener",
        "publish_date": "Wed, 11 Feb 2026 14:00:00 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Incumbent Wallabies star Andrew Kellaway has been omitted from the Waratahs team for the Super Rugby Pacific season opener on Friday night, with an uncapped rookie preferred at fullback to meet Queensland at Allianz Stadium.\n\nThe selection of Randwick flyer James Hendren over Kellaway in the No.15 is one of several noteworthy calls by Waratahs coach Dan McKellar, who also wasted no time in bringing back Miles Amatosero to the starting side, despite having been exiled from the team for two weeks following his fight with Angus Scott-Young.\n\nCaptain Matt Philip will be one of eight players making their Waratahs debuts against the Reds, alongside Hendren, Pete Samu, Clem Halaholo, Harry Potter, Folau Faingaa, Angus Blyth and Jack Debreczeni.\n\nAmatosero only returned to NSW headquarters at the weekend after serving a two-week suspension for punching Scott-Young, and the big lock not only missed the Tahs’ trials but was not even permitted to train or attend NSW Rugby facilities as part of his penalty, which also involved counselling.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-israeli-president-herzog-to-arrive-in-canberra-today-angus-taylor-allies-plotting-to-quit-ley-s-frontbench-ahead-of-leadership-challenge-20260211-p5o18f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Israeli President Isaac Herzog touches down in Canberra; Angus Taylor allies plotting to quit Ley’s frontbench ahead of leadership challenge",
        "publish_date": "Wed, 11 Feb 2026 13:47:10 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine",
            "Isabel Mcmillan"
        ],
        "text": "AGL, one of Australia’s largest energy companies, has agreed to sell its telecommunications business to Aussie Broadband in a deal it says will simplify operations and slash costs.\n\nThe ASX-listed electricity and gas giant has been pushing for years to expand its reach into telecommunications, allowing it to bundle energy, internet and phone services to its vast customer base.\n\nToday, the company said selling its telco business – which services about 400,000 customer accounts – to Aussie Broadband would enable it to simplify its retail arm and slash operating costs while retaining the ability to bundle customer services.\n\nThe deal, under which Aussie Broadband will pay AGL $115 million in stock, is due to be completed by June.\n\nAGL chief executive Damien Nicks says AGL and Aussie Broadband are committed to a ‘seamless customer migration’ next year. Oscar Colman\n\n“Both parties are committed to a seamless customer migration over financial year 2027,” AGL chief executive Damien Nicks said.\n\nAGL has been seeking to slash costs across its business, partly to free up more funds to spend on the rollout of enough new renewable energy and batteries to replace its ageing coal-fired power stations in Victoria and NSW, which rank among the country’s largest sources of planet-heating greenhouse gas emissions.\n\nUnder pressure from climate-minded investors, including Australian tech billionaire Mike Cannon-Brookes, AGL has pledged to close its coal-burning power stations by 2035, while ratcheting up its decarbonisation targets and investments in cleaner energy.\n\nAGL reported its net profit had fallen more than 40 per cent from $162 million to $94 million during the six months to December 31, dragged down by losses on energy derivative contracts. But on an underlying basis, AGL’s half-year profit, which fell 6 per cent to $353 million, was better than analysts had been expecting.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/olympio-ramps-up-drilling-at-historic-quebec-gold-belt-20260211-p5o1eg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Olympio ramps up drilling at historic Quebec gold belt",
        "publish_date": "Wed, 11 Feb 2026 13:45:59 +1100",
        "category": "finance",
        "authors": [
            "Rowena Duckworth"
        ],
        "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Olympio ramps up drilling at historic Quebec gold belt Brought to you by BULLS N’ BEARS Rowena Duckworth February 11, 2026 — 1:45pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPerth-based Olympio Metals is back on the drill bit at its Bousquet gold project in Quebec, restarting diamond drilling at the Paquin prospect as it looks to build on the highly successful maiden program completed last year. Olympio Metals’ Bousquet project is within Quebec’s famed Abitibi belt. The new campaign is focused squarely on following up standout high-grade results delivered last year, which included intercepts of 6.40 metres at a stellar 6.54 grams per tonne (g/t) gold from 183.0m, 7.90m at an equally spectacular 6.20g/t gold from 138.0m and an eye-watering 1.50m at 54.20g/t gold from 235.5m. Those hits confirmed the presence of a robust gold system hosted along the Cadillac Break, one of the world’s most prolific gold structures. This year’s program comprises eight diamond holes for about 1,200m and is designed to test both up-plunge and up-dip extensions of the mineralisation intersected in a previous drill hole, which threw up tantalising wisps of visible gold. ‘This program will provide further insight into the shallower parts of the Paquin gold system...’ Olympio Metals managing director Sean Delaney\n\nAdvertisement\n\nTwo planned drill holes will specifically target those extensions, while the remainder of the program will focus on the top 100m of the Paquin system, a zone that remarkably has not been drilled since the 1940s. Replacing that historic drilling with modern data is a key objective for Olympio. Much of the early exploration across Paquin relied on outdated survey methods and incomplete sampling, leaving large gaps in geological understanding and making the data unsuitable for modern 3D modelling. The new drilling is intended to deliver reliable structural and geological information that can be confidently incorporated into an updated mineralisation model. Geologically, the area features high-grade disseminated sulphides in biotite-altered schistose and ultramafic rocks, as well as stacked, smoky-blue-grey quartz veins. It is these structurally controlled quartz veins that host the gold and typically have associated sulphides, making them potentially detectable by IP or EM geophysical methods, making detection easier. The Bousquet project sits squarely on the Cadillac Break in Quebec’s Abitibi greenstone belt, a region that has produced more than a whopping 110 million ounces of gold. The project is also strategically located within 15km of several multi-million-ounce gold mines, including Agnico Eagle’s La Ronde operation and Iamgold’s Westwood mine, underscoring the area’s strong endowment and established mining infrastructure.\n\nAdvertisement\n\nOlympio Metals managing director Sean Delaney said: “After a highly successful maiden drill program in 2025, the Company is excited to recommence drilling at Paquin for 2026. This program will provide further insight into the shallower parts of the Paquin gold system, where the majority of historical drill coverage is from the 1940s. These historical datasets are over 80 years old and are not reliable to incorporate into a 3D model, with outdated survey methods and incomplete sampling intervals.” Beyond Paquin, Olympio has the option to acquire an 80 per cent interest in the broader Bousquet project from Bullion Gold Resources through staged cash and share payments and exploration expenditures. To date, the company has completed nearly C$1 million in exploration spending and made C$0.30 million in payments, steadily advancing its foothold in the district. With drilling now underway, Olympio is aiming to confirm continuity, upgrade confidence in the shallow mineralisation and determine whether the high-grade shoots identified in 2025 extend into areas that have never been properly tested. In a region renowned for delivering long-life, high-grade gold mines, the company is positioning itself to see whether Paquin can join that lineage as modern drilling replaces decades-old data. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/rowing-ain-t-happening-if-not-in-rockhampton-bleijie-says-20260211-p5o1dr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rowing ‘ain’t happening’ if not in Rockhampton, Bleijie says",
        "publish_date": "Wed, 11 Feb 2026 13:36:56 +1100",
        "category": "sports",
        "authors": [
            "Julius Dennis"
        ],
        "text": "Advertisement\n\nNationalQueenslandBrisbane 2032 Olympics Rowing ‘ain’t happening’ if not in Rockhampton, Bleijie says Julius Dennis February 11, 2026 — 1:36pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nQueensland’s deputy premier has put the kibosh on a south-east Queensland council’s plan to host the 2032 Olympic rowing, saying the events will happen in Rockhampton or not at all. The City of Moreton Bay planned to discuss on Wednesday a new rowing venue at what is currently a quarry in Lawnton, just north of Brisbane. News of the potential new venue comes after months of speculation that the Fitzroy River in Rockhampton might be unsuitable for Olympic level rowing due to its susceptibility to fast currents. Bleijie said hosting the rowing in Rockhampton was the only option. Julius Dennis With testing of the river being undertaken by the Games Independent Infrastructure Coordination Authority (GIICA), the Moreton Bay plan emerged out of the blue.\n\nAdvertisement\n\nThe venue, flagged in the council’s meeting agenda as a new flatwater precinct, is backed by the quarry’s operators, Boral Cement. The venue for Sydney 2000 Olympics, at Penrith, was also constructed on a former quarry. Related Article Brisbane 2032 Olympics Moreton Bay in bold bid to snatch Olympic rowing from Rockhampton But deputy premier Jarrod Bleijie dismissed the idea out of hand, and said he had already told Moreton Bay mayor Peter Flannery no other options were being considered. “The Queensland government has decided where the venues are through our 2032 delivery plan, and that’s where they are — it’s not changing,” he said. When it was put to him that the host contract dictated the International Olympic Committee has final approval for the venues, Bleijie said the government would not budge.\n\nAdvertisement\n\n“Rowing is going to be in Rocky. If they don’t want it in Rocky, it ain’t happening,” he said. “That’s a big call for the IOC, so I think they should just proceed.” Asked if he was threatening to cancel the rowing if the IOC did not agree to host it in Rockhampton, he said he “didn’t say that”. Bleijie said early results from the GIICA testing were positive. “I’ve had no indication that there would be anything but support for rowing in Rocky from the International Federation [of Rowing] or the IOC,” he said.\n\nAdvertisement\n\nA Rowing Australia spokesperson said they could not comment on the proposal at this time. The City of Moreton Bay has been contacted for comment. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/aussie-smylie-becomes-liv-golf-royalty-20260208-p5o0fg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie Smylie 'becomes LIV Golf royalty'",
        "publish_date": "Wed, 11 Feb 2026 13:09:57 +1100",
        "category": "sports",
        "authors": [],
        "text": "Aussie Smylie 'becomes LIV Golf royalty'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-wall-street-eyes-records-paramount-sweetens-warner-bros-offer-20260211-p5o180.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX higher as CBA surges; CSL dives",
        "publish_date": "Wed, 11 Feb 2026 12:58:57 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX higher as CBA surges; CSL dives Staff reporter Updated February 11, 2026 — 12:58pm ,first published February 11, 2026 — 5:12am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has extended early gains as investors digest a raft of results from some of the bourse’s biggest companies, with Commonwealth Bank and AGL among the big winners. The S&P/ASX 200 was up 122.4 points or 1.4 per cent in early afternoon trade, as six of 11 industry sectors traded in negative territory but financial stocks helped to boost the index. CBA shares surged in early trade. Oscar Colman Commonwealth Bank bounced 8 per cent as it announced a rise in half-year profits to $5.4 billion. It also hiked its dividend while chief executive Matt Comyn said that persistent inflation was putting “upward pressure” on interest rates. The rest of the big four were also higher. Westpac was up 1.6 per cent, National Australia Bank rose 1.3 per cent and ANZ Bank was up 1 per cent. Health giant CSL tumbled 12.9 per cent. That followed news its earnings for the December half-year had dived 80 per cent after it was forced to write down the value of its assets by $US1.1 billion ($1.6 billion). The biotech giant’s poorly timed announcement of its chief executive’s departure on Tuesday afternoon wiped tens of billions of dollars from its market valuation.\n\nAdvertisement\n\nMining stocks advanced. Among the big iron ore miners BHP gained 1.2 per cent, Rio Tinto rose 1.1 per cent and Fortescue moved 1.6 per cent higher. Gold miner Northern Star slid 0.3 per cent but Evolution Mining jumped 6.2 per cent after it reported a record underlying profit of $785 million. Related Article Opinion\n\nBillionaires Who got richer and who went backwards in the billionaire Olympics Elizabeth Knight Business columnist Energy giant AGL rose 8.9 per cent after releasing its results despite its net profit falling more than 40 per cent from $162 million to $94 million in the six months to December 31. Earnings were dragged down by losses on energy derivative contracts. On an underlying basis, AGL’s half-year profit, which fell 6 per cent to $353 million, was better than analysts had been expecting. The company also announced it has agreed to sell its telco business to Aussie Broadband in a deal it says will simplify its operations and slash costs. Woodside Energy added 0.4 per cent while Santos was flat. Kerry Stokes’ $20 billion industrial group SGH reported a slight lift in net profit to $471 million. It’s the group’s last result to include its stake in embattled group Seven West Media which merged with Triple MMM owner Southern Cross Media, last month. Revenue fell 1.8 per cent to $5.4 billion but SGH managed to lift earnings after cost-cutting and a strong performance from Boral. Offsetting that were declines across WesTrac, Coates, and its energy business as well as another sharp decline from Seven West. Its shares are 4.7 per cent higher.\n\nAdvertisement\n\nStagnating pizza giant Domino’s gained 2.6 per cent after announcing senior McDonald’s executive Andrew Gregory will be its new global chief executive. The group’s executive chairman Jack Cowin has been hunting for a new global CEO since June last year, when Mark Van Dyck resigned after just seven months in the top job. The Australian dollar was trading at US70.96¢ at 12.55pm AEDT. Overnight, stocks drifted on Wall Street following a mixed set of profit reports from big US companies, as toy maker Hasbro jumped but drinks giant Coca-Cola slipped. Hopes also rose that the Federal Reserve would cut interest rates later this year to boost the economy following a discouraging report on retail sales. The markets are hoping the Federal Reserve will cut interest rates later this year to boost the US economy. AP The S&P 500 fell 0.3 per cent after briefly rising above its all-time high, which was set a couple of weeks ago. The Dow Jones Industrial Average added 52 points, or 0.1 per cent, to its own record, while the Nasdaq composite fell 0.6 per cent.\n\nAdvertisement\n\nThe action was strong in the bond market, where Treasury yields fell after a report showed US retailers made less money at the end of last year than economists expected. Shoppers spent roughly the same amount in December as they did in November, less than the modest growth that economists expected. Related Article Opinion\n\nJapan The ‘Iron Lady’ looking to shake up the world order Stephen Bartholomeusz Senior business columnist Altogether, the data should help the Federal Reserve decide what to do with interest rates. The Fed has put interest rates cuts on hold, and too-hot inflation could keep it on pause for a long time. But a weakening of the job market, on the other hand, could push it to resume cuts more quickly. Hasbro climbed 7.5 per cent after topping analysts’ expectations for profit and revenue in the latest quarter. The toymaker credited its Magic: The Gathering game in particular, and announced a program to send up to $1 billion ($1.4 billion) of cash to investors by buying back its own stock. With AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/im-not-looking-to-change-jonathans-legacy-david-genat-talks-australian-survivor-20260211-p5o1av.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'I'm not looking to change Jonathan's legacy': David Genat talks Australian Survivor",
        "publish_date": "Wed, 11 Feb 2026 12:37:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/cba-profits-rise-to-5-4-billion-comyn-sees-upward-pressure-on-rates-20260210-p5o17d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA shares rocket as profit beats expectations",
        "publish_date": "Wed, 11 Feb 2026 12:34:39 +1100",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "Advertisement\n\nUpdated BusinessBanking & financeEarnings season CBA shares rocket as profit beats expectations Clancy Yeates Updated February 11, 2026 — 12:34pm ,first published February 11, 2026 — 7:49am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nCommonwealth Bank chief Matt Comyn has tipped a short cycle of interest rate hikes that would have a slight effect on the property and mortgage markets, saying the banking giant expects only one more interest rate rise from the Reserve Bank. Delivering a $5.4 billion half-year profit result that beat market expectations, Comyn on Wednesday said inflation was putting “upward pressure” on interest rates, but it would be a “relatively brief” period of rate hikes from the central bank. The profit result sparked a surge in CBA shares, which jumped 7.8 per cent in early afternoon trade as analysts said CBA’s charges for bad debts were lower than the market had forecast. Comyn also indicated he was open to potential changes to the capital gains tax regime to support housing affordability, following reports Treasurer Jim Chalmers is considering a cut to capital gains concessions in the lead-up to this year’s budget. Comyn stressed any such change should be part of a wider package. Commonwealth Bank of Australia chief executive Matt Comyn. Alex Ellinghausen\n\nAdvertisement\n\nSpeaking to this masthead, Comyn said the bank was forecasting one more possible rate rise this year, which he acknowledged would be unwelcome news to borrowers who are stretched. Related Article Analysis\n\nScams After growing to $4.5 trillion, super faces its next big challenge: scammers “We’ve seen one rate increase, we expect that there’ll be perhaps one more, but we don’t think more than that, and then I think there’ll be sort of pressure to go back into an easing cycle beyond that,” Comyn said. Comyn said the impact of higher rates on housing and home loans would be “slight”, flagging credit growth and house price growth of about 5 per cent this year. “I don’t think it’s going to have a really significant impact. For households that have been… stretched, clearly, the prospect of increasing rate hikes, is not something that they’re looking forward to, but I think it will be a relatively brief period of interest rate hikes.”\n\nAdvertisement\n\nOn the prospect of changing the capital gains tax regime, Comyn acknowledged the importance of “intergenerational equity” and said it would be appropriate to look at the issue as part of a wider discussion about taxation. He also highlighted the need for more housing supply and the growing tax burden on working Australians over time. “Without having any of the specifics, I could envisage that [changes to capital gains tax rules] would be, an appropriate measure to look very closely at,” he said. The comments came as CBA’s December half results showed fewer customers were struggling with their home loan repayments, while the banking giant expanded its vast portfolio of home loans and deposits. Cash net profit rose by 5 per cent for the December half compared with the same half a year earlier, beating analyst expectations. In a sign of its confidence in the outlook, CBA said it would raise its interim dividend by 4 per cent to $2.35. Analysts had expected first-half profits of about $5.2 billion and a dividend of $2.31.\n\nAdvertisement\n\nCBA and its rivals last week passed on the RBA’s rate rise to their home loan customers in full, and analysts say the rises are likely to act as a tailwind to bank profits. One in four Australian home loans is with CBA, a market share the bank held in the latest half, while its share of household deposits edged up to 26.6 per cent. The bank has been expanding aggressively into business banking, an attractive market for banks, and in the half CBA grew its business loans and deposits by more than the industry average. Comyn said CBA customers had been supported by lower rates and the strong labour market, and the bank reported lower costs for impaired loans and a fall in home loan arrears. One in four home mortgages in Australia is held by CBA. Eamon Gallagher\n\nAdvertisement\n\nDespite ongoing cost-of-living pressure on many households, CBA said the share of home loan customers behind on repayments had edged lower in the period, thanks to lower interest rates. It said 87 per cent of its customers were ahead of their scheduled repayments. Related Article Opinion\n\nInterest rates Raising interest rates was the RBA’s least-worst option Elizabeth Knight Business columnist A key focus for investors is the bank’s net interest margins – which compare funding costs with what the bank charges customers – and CBA reported a lower margin of 2.04 per cent compared to the June half. Across the banking industry, margins have been pressured by stiff competition in home loans, where Macquarie has been rapidly expanding its share. Comyn acknowledged it was closely watching the competitive backdrop: “We continue to watch the competitive intensity and its implications across the financial system. We are well placed to compete effectively and will continue to adjust our settings as appropriate,” he said. Citi analyst Thomas Strong said CBA’s margin beat market expectations, while its bad debt charges of $319 million were “much better than anticipated”. Strong said the profit result reflected the underlying health of the Australian economy, and it boded well for the full-year.\n\nAdvertisement\n\nThe banking giant’s operating costs rose 5 per cent, an increase it said was driven by higher investment in technology, inflation and some new hiring. CBA’s full-time staffing ranks rose 1 per cent during the six-month period, with the bank employing slightly more than 51,600 people. CBA is regarded as the technology leader among the big four banks, and it said investment spending rose 10 per cent in the half to $1.2 billion, as it sought to bolster its artificial intelligence capabilities. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/life-choices-in-the-frame-amid-the-grim-comedy-of-dysfunctional-family-drama-20260207-p5o0c6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This intriguing concert began almost without us knowing",
        "publish_date": "Wed, 11 Feb 2026 12:15:53 +1100",
        "category": "entertainment",
        "authors": [
            "John Shand",
            "Millie Muroi",
            "George Palathingal",
            "Peter Mccallum",
            "Harriet Cunningham"
        ],
        "text": "Advertisement\n\n★★★★ CultureLive reviewsSydney live reviews This intriguing concert began almost without us knowing John Shand, Millie Muroi, George Palathingal, Peter McCallum and Harriet Cunningham and Updated February 11, 2026 — 12:15pm ,first published February 7, 2026 — 1:42pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nMUSIC\n\nAustralian Chamber Orchestra\n\nCity Recital Hall, February 10\n\nUntil February 18\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★ It’s hard to know where it begins. A low rumble, not quite a note but not quite a noise, barely rising above the patchy pre-concert silence of shuffles and breaths. A distinct phrase or ostinato emerging from the fuzzy palimpsest from time to time, a moment of near clarity to intrigue the ear, before melting back into the whole. This is Horizon, a new work - in fact, a diptych - by composer and activist John Luther Adams. The two parts have their world premiere on alternate nights, in this, the ACO’s first Australian tour for the year. (They will also give the US premiere later this year, and record both parts for CD release in April). Dejan Lazić performs Rachmaninoff’s Rhapsody on a Theme of Paganini. Charlie Kinross Visible Horizon (or is it True Horizon? We aren’t told) is mesmerising, its pulse-free, shapeless rise and fall somehow rewiring my attention span to remain engaged for the entire work. I would be fascinated to experience the entire 40-minute span.\n\nAdvertisement\n\nStravinsky’s Concerto in D Basle, by contrast, arrives with pinpoint precision and no time to lose. This is the kind of work that showcases the ACO as a tight-knit band of soloists: staccatos underpinned by pizzicato, or bulging thick chords, played in tight unison, like a musical hive mind. De Profundis makes an ideal companion piece to the Stravinsky. An early work of Latvian composer Raminta Serksnyte, it channels youthful anxieties and emotions into a compelling tumble that, like the Stravinsky, explores the full range of textures available to a string orchestra. Artistic director Richard Tognetti goads the ensemble into a fiery, take-no-prisoners account. Pianist Dejan Lazic arrives on stage for the headline work of the concert, Rachmaninoff’s Rhapsody on a Theme of Paganini. Lazic is a delightful partner-in-crime for this not entirely successful arrangement for piano, strings and percussion, making up for the orchestral technicolour of the original with a micro-flamboyant exploration of moods across the 24 variations. His performance flips the work from grand circus back to a marvel of ingenuity, piecing together glittering fragments into a dramatic whole.\n\nAdvertisement\n\nMUSIC\n\nLaneway Festival\n\nCentennial Park, February 8\n\nReviewed by GEORGE PALATHINGAL\n\n★★★★½ On a day that started more pink poncho club than Pink Pony Club, Laneway – Australia’s premier rock festival pretty much since its 2005 Melbourne debut made the Big Day Out look relatively basic – once again excelled. A little bit, or even a biggish bit of afternoon rain was never going to stop the thousands of largely Millennial young adults who turned out to see the world’s hottest and coolest acts. It started especially strongly, with Frankston, Vic’s Belair Lip Bombs serving delicious alt-rock jangle at one end of the park, before we spent much of the afternoon doing laps of Centennial to see what was going on everywhere else. Chappell Roan (here earlier in the tour) ruled in Sydney. Chontalle Musson\n\nAdvertisement\n\nHappily, to get to the other end you passed the main stages in the middle, so even if you made the trek to encounter a relative dud on the electronic-friendly (but handily covered) stage you’d catch something fantastic in the middle: the moving, acoustic prettiness of a Gigi Perez, say, or Lucy Dacus making her take on maudlin indie somehow work to thousands in a field, too. Still, past the activations for beauty brands and movies (one opportunity I didn’t take was to get my hair done like Margot Robbie in Wuthering Heights), French enigma Oklou was gently mesmerising in that electronic tent, while solo party-starter The Dare had a solid crack at tearing the roof off it a bit later. Geese were equal parts mind-blowing and borderline nonsense. The truly alternative Geese, equal parts mind-blowing and borderline nonsense, appeased the chin-stroking cognoscenti before the big finish on the main stages, starting with superlative Brit indie-rockers Wet Leg and the intoxicating charisma of their frontwoman Rhian Teasdale – the first of two musical icons-in-waiting on that stage. The other, of course, was headliner Chappell Roan, who has, in just the past couple of years, become the most exciting pop star in recent memory. Her set, all vamp and camp in the best way, was drawn from her only album The Rise and Fall of a Midwest Princess and a handful of singles (with a scorching cover of Heart’s Barracuda thrown in for good measure).\n\nAdvertisement\n\nLaneway makes the Big Day Out look pretty tame. It already sounds like a greatest hits collection and only the hardest-hearted indie snob would say otherwise. And, at a Laneway powered predominantly by female or female-featuring acts – possibly deliberately, more likely just because they’re currently the best around (late bonus shout-out to Canberra rock bad-arses Teen Jesus and the Jean Teasers and Kiwi charmer Benee) – seeing Roan rule it so magnificently was a delight. MUSIC\n\nBach’s Motets\n\nBach Akademie Australia and The Song Company\n\nMosman Art Gallery, February 8\n\nReviewed by PETER McCALLUM\n\n★★★★\n\nAdvertisement\n\nScholars remain unclear about the intended purpose of some of Bach’s motets, but musicologist Christoph Wolff suggests they were used, in part, to train singers in the difficult demands of his music. To sharpen their minds, musicians were fined one groschen (the price of two quarts of ale) for an accidental mistake, and three groschen for a deliberate slip-up. The Bach Akademie and Song Company’s performance of the seven motets now confidently attributed to Bach would scarcely have refreshed the coffers. It was concentrated and rewarding – concentrated because of the music’s rich complexity of design and texture, and rewarding because of the Song Company’s superb mastery of interweaving vocal polyphony. Performed by eight Song Company members arranged in an arc against the high brick wall of the former church that is now Mosman Art Gallery, with four players from the Bach Akademie providing continuo accompaniment, the sound from my vantage point towards the back was vivid, and clear, although it included the acoustic quirks that give such buildings their individuality. Occasionally, notes or parts were boosted unexpectedly. As a violinist, Bach Akademie musical director Madeleine Easton conducted like an instrumentalist, which was not out of place in the instrumentally inspired figuration of the opening motet Lobet den Herrn, BWV 230 although it set a challenge for the singers, albeit one they met handsomely.\n\nAdvertisement\n\nThe halting phrases at the start of Komm, Jesu komm had clipped brightness opening out to mellifluous phrases that were slightly missing from the earlier motet. Sandra Milliken’s Herr Jesus Christus began with low hummed sounds from the male singers before translucent yet sombre chorale-like passages from the upper voices established the music’s tread. At expressive moments, the harmonies modulated vertiginously as though momentarily becoming unanchored. Ich lasse dich nicht BWV 1164 (previously thought to be by Johann Christoph Bach, cousin once removed of Johann Sebastian) and Der Geist hilft unser Schwachheit auf BWV 226 ended the first half, the latter threatening to rattle the fine jar at one tricky moment, although it was small beer. After an involving reading of Furchte dich nicht BWV 228, cellist Daniel Yeadon gave an unassuming and intimate performance of the Prelude from Bach’s Cello Suite No. 2 in D minor BWV 1008. A highlight of the concert was Jesu Meine Freude, BWV 227, particularly the beautiful delicacy of the ninth movement in which sopranos Susannah Lawergren and Michelle Ryan coaxed phrases with exquisite delicacy against tenor Christopher Watson, punctuated by warm soft phrases of the chorale from the altos. O Radiant Dawn by Scottish composer James MacMillan had well-shaped intensity before the glorious eight-part complexity of Singet dem Herrn ein neues Lied , BWV 225 erupted with brilliant agility and exhilarating joy.\n\nAdvertisement\n\nTHEATRE\n\nPurpose\n\nWharf 1 Theatre, February 6\n\nUntil March 22\n\nReviewed by JOHN SHAND\n\n★★★★ Faith has been a fickle mistress for Solomon Jasper. She’s steeled his will in the fight for Civil Rights, but failed to assuage his disappointment in his sons, or prevent his leaving an illegitimate brood in his wake. So Solomon, a retired living treasure among African Americans, has turned to beekeeping. Bees, you see, know their purpose in life. So did Solomon. Once. Tinashe Mangwana as Naz, who leads the audience through the events of Purpose. Prudence Upton American playwrights have focused on dysfunctional families with gleeful zeal. Branden Jacobs-Jenkins follows the hallowed tradition of O’Neill, Williams, Miller and Albee, except he elevates the Jaspers’ dysfunctionality to the grotesque.\n\nAdvertisement\n\nHis theatrical masterstroke is a narrator to steer us through the labyrinth of interlocking hostilities, and tease us with what’s to come. That’s Nazareth, the younger son of Solomon and matriarchal wife Claudine – Naz to all but his father. Naz must be affable, amusing and just a little quirky because he’s neurodivergent to an unspecified degree. Tinashe Mangwana is ideal in director Zindzi Okenyo’s STC production, making credible this asexual creature who delights in solitude while photographing nature. Deni Gordon as matriarch Claudine, Tinashe Mangwana as Naz, Markus Hamilton as Solomon Jasper. Prudence Upton Naz has just donated sperm to his lesbian friend Aziza, when she drops him off at his parents’ place. All would have been well had she not had to return a forgotten phone charger, by which time the snow’s setting in, and Claudine insists Aziza stay. If that sounds like the set-up for a melodrama, in part it is, for this play is a many-headed monster: questioning the purpose of life and the viability of marriage; interrogating fame, reputation and accepting one’s children as they are. It even becomes a grim comedy. Fireworks at a very awkward family dinner. From left: Deni Gordon as matriarch Claudine, Grace Bentley-Tsibuah as Morgan, Sisi Stringer as Aziza, Maurice Marvel Meredith as Morgan’s husband Junior, Tinashe Mangwana as Naz and Markus Hamilton as Solomon Jasper. Prudence Upton\n\nAdvertisement\n\nThe flaws in Okenyo’s production show when the melodrama holds too much sway, and the anger is too relentless. In all other regards, this is an exemplary production of a singular play that would swiftly expose pretenders in the cast. Okenyo’s is strong, with Markus Hamilton as the sternly patriarchal, deeply flawed Solomon. Deni Gordon plays Claudine, and while she has minor lapses, she’s convincing as the only person on earth who can lord it over Solomon. Sisi Stringer is charismatic as the livewire Aziza, who didn’t know Naz came from this famous family, nor that his real name was Nazareth. Now she’s not so sure about his fathering of her child. Maurice Marvel Meredith excels as the elder son, Solomon Junior, a politician mired in white-collar crime, with the family assemblage celebrating his release from prison as well as Claudine’s birthday. Junior’s wife, the feisty Morgan (about to do her own time, now that Junior’s out, as they have two young boys), is brilliantly realised by Grace Bentley-Tsibuah. Morgan has wised up, before anyone else, to the Jaspers not exactly being angels of black excellence. Jeremy Allen’s set is as lavish as the Jaspers are larger than life, and this is an auspicious start to artistic director Mitchell Butel’s STC programming. MUSIC\n\nOneRepublic\n\nQudos Bank Arena, February 6\n\nReviewed by MILLIE MUROI\n\n★★★½\n\nAdvertisement\n\nIf there’s one thing a performer dreads, it’s coming down with an illness on tour. For OneRepublic frontman Ryan Tedder, the show must go on and, fuelled by sips of tea between songs, he delivers. Sure, it’s possible to hear a slight huskiness when he reaches for the high notes, and there are points – especially later on in the show – when he seems to be either saving his voice or is just plain fatigued. Ryan Tedder and OneRepublic in full flight at Qudos Bank Arena. Brody Harper But he and his band make it worth the while. The production is well done with simple but effective lighting and imagery, but it’s Tedder’s interpretation that adds spice to the band’s songs. Switching between high to low registers, and adding vocal twists and runs, Tedder has an instinct for playing with his songs vocally without losing the essence of the number – or doing it just because he can.\n\nAdvertisement\n\nSome of OneRepublic’s early hits such as Good Life are crowd pleasers yet benefit from Tedder’s renewal. Lesser known song Life in Colour – which he says the band should have put more in the spotlight on release in 2013 – also gets its time in the sun as its soft instrumentals complement Tedder’s intentional, emphatic and intimate take on the song. OneRepublic in action. Brody Harper Perfect execution of songs as they’ve been heard before can be pleasant, but in this show the added flair and vocal acrobatics imbue the music with a flavour you won’t hear in OneRepublic’s discography. There are no jaw-dropping moments or goosebumps, but a solo segment with Zach Filkins on Spanish guitar is a highlight, as is the preview of their song Need Your Love to be released later this year: a catchy and promising medley of rock, hip hop and pop. Tedder’s keyboard prowess is also impressive. Having written chart-toppers including Halo (ostensibly penned as he gazed at a photo of Jay-Z and imagined what it must be like for Beyoncé to love him), and Bleeding Love sung by Leona Lewis, Tedder adds enchanting detail to these scores when he plays them on piano.\n\nAdvertisement\n\nAfter a mellow middle section, the show is jam-packed as it ends, with best known songs such as Counting Stars, Apologise and I Ain’t Worried bringing it back to life. Eighteen years after their first Sydney appearance, OneRepublic show why they are still masters of music. They are versatile, polished and adventurous – even with a lead singer nursing his vocal chords on stage in real time.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/how-amyl-and-the-sniffers-star-found-herself-in-a-legal-stoush-with-a-us-photographer-20260210-p5o16m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Amyl and the Sniffers star found herself in a legal stoush with a US photographer",
        "publish_date": "Wed, 11 Feb 2026 12:04:34 +1100",
        "category": "entertainment",
        "authors": [
            "Karl Quinn"
        ],
        "text": "Advertisement\n\nCultureMusicAustralian music How Amyl and the Sniffers star found herself in a legal stoush with a US photographer Karl Quinn February 11, 2026 — 12:04pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt’s hard to picture Amy Taylor, the diminutive and dynamic frontwoman of Aussie rockers Amyl and the Sniffers, in anything other than gym shorts, crop tops and garish make-up. But she may soon have to suit up in something slightly more formal should an ugly legal dispute that’s embroiled one of Australia’s hottest musical acts drag her into court. The case, which pits the Melbourne rocker against American photographer Jamie Nelson, is slated for a hearing in the US District Court in Los Angeles on February 13. And the central issue is who controls a batch of images of Taylor that were shot by Nelson for Vogue Portugal, and are now being sold on the photographer’s website for as much as $US18,000 ($25,000) per print. Amy Taylor has become one of the most recognisable women in rock. Kristoffer Paulsen What’s it all about? Taylor insists she never gave permission for the commercial exploitation of those images beyond their publication in Vogue. Nelson – who bears more than a passing resemblance to the singer – insists she owns the images and has the right to exploit them as she sees fit. As the dispute has heated up, Nelson has also alleged she feels unsafe, and sought a restraining order against Taylor (more on that below).\n\nAdvertisement\n\nThe case has both commercial implications and moral ones, touching on the prickly question of the relative rights of the artist on one side of the camera and of the subject (who happens, in this case, to also be an artist) on the other. How did it start? The matter first became public when Taylor filed a complaint in the Los Angeles District Court on December 22 last year, soon after which it was picked up by the media. But its origins date back to July 2024, when the band’s manager, Simone Ubaldi, reached out to Nelson to engage her services for a photo shoot. Declan Mehrtens (left), Amy Taylor and Bryce Wilson of Amyl and the Sniffers at the 68th Annual Grammy Awards where they were nominated for best rock performance. Jordan Strauss/Invision/AP According to Taylor’s court filing, “the images from that photo shoot were to be used for the band’s upcoming album, for publishing in future documentaries, for inclusion in the band’s special edition artwork, and for displaying on the band’s website and social media accounts.”\n\nAdvertisement\n\nIn other words, Nelson would be hired as a service provider, and the images were for the band’s exclusive use across multiple platforms. The shoot never happened, though, because the parties could not agree terms. Specifically, the court documents claim, the band was “not amenable to Ms Nelson’s use of the band’s name, image, and likeness on branded merchandise … displaying the band members’ images in gallery shows, or using their images to promote Ms Nelson’s photography business, and/or to sell their merchandise, including Ms Nelson’s ‘fine art prints’ or otherwise”. So, no girl on film? Well, here’s where it gets complicated. Months after that mooted shoot fell over, Nelson reached out to Taylor to ask her to take part in an entirely different project, a “Vogue Portugal 12-16-page editorial shoot”.\n\nAdvertisement\n\nTaylor agreed, and her suit alleges that in doing so she granted “an implied license” to use the images for the Vogue shoot alone, and “at no point did Ms Taylor authorise … any other commercial use” of the images. The shoot took place in May 2025, and the images were published in Vogue in July. Taylor contends she received no payment for the shoot or the use of the images. So, what’s the problem? It’s what happened next that lies at the nub of the dispute. In September, Nelson sent Ubaldi and Taylor a selection of images from the May shoot that she wanted to sell via her website as limited-edition fine art prints (on high-quality paper), and as a limited-edition zine. Ubaldi, on Taylor’s behalf, flatly declined.\n\nAdvertisement\n\nDespite that, those prints are still available now via the site under the collective title Champagne Problems. There are 38 images for sale in the series, each in five iterations, ranging in price from $US1500 for a small print (33 x 50 centimetres, editions of 30) to $US18,000 for the largest (152 x 228cm, editions of three). Nelson claims to have spent $US20,000 producing the works. If all prints were to sell at full price, she stands to make more than $US10.5 million. Legal letters at 15 paces… In November, lawyers for Taylor issued a cease and desist letter to Nelson, calling for her to withdraw the prints from sale. Within days, Nelson replied with an email promising to do so. But the next day, November 18, “in a complete reversal of her prior position”, Nelson rescinded that commitment and instead asserted her moral rights as the creator of the works in question.\n\nAdvertisement\n\nAnd then things got really ugly. In early December, John Angus Stewart, Taylor’s filmmaker partner (and the person responsible for the band’s videos, as well as the King Gizzard and the Lizard Wizard concert film Chunky Shrapnel), posted a story on Instagram in which he shared an image from Nelson’s website, overlaid with the words “Amyl and the Sniffers ain’t approved this scam. Don’t buy slop.” He added that the band “price things so you [fans] can afford it”. Taylor and Ubaldi also made derogatory comments about Nelson on her social media accounts. Now, who’s suing who? On December 4, Nelson sent a cease and desist notice via email to Stewart, alleging defamation and “unauthorised use of copyrighted material” (namely the photo of Taylor, taken for Vogue Portugal, that he had posted from Nelson’s website). On December 22, Taylor filed her suit against Nelson, seeking among other things a full accounting of sales to date.\n\nAdvertisement\n\nAt the same time, Nelson has taken action through the courts against Taylor. On December 9, she sought a restraining order against the singer, seeking to prevent her from approaching within 100 yards (about 91 metres) of her home and/or place of business (an unlikely scenario, given the band’s hectic touring schedule and base in Australia) and from posting on her internet or social media platforms. The application also seeks an order preventing Taylor from using “lyrics, symbols, emojis, or coded messages that can reasonably be interpreted as threats, intimidation, or instructions to confront Jamie Nelson in person or online”. In support of the order, Nelson alleged: “I have had difficulty sleeping, concentrating, and performing my work. The ongoing uncertainty and fear of aggressive and vulgar public and private attacks have interfered with my ability to function normally and have caused significant emotional harm.” She also claimed she feels “quite helpless in the face of Ms Taylor’s extensive support network. She has a large team including fans, a publicist, a manager, booking agents, and a lawyer”, and she “simply cannot compete with the scale of resources and influence that she can mobilise against me”.\n\nAdvertisement\n\nIn a highly unusual strategy, the photographer has proactively courted media coverage of the dispute, and attempted to frame Taylor’s suit as a retaliatory action in response to her restraining order. In an email to this masthead, she contends she is “seeking protection from further harassment and intimidating conduct. More broadly, my position has been that I am the copyright holder of the photographic work at issue and retain the right to create and sell fine-art prints of photographs that I produced and financed.” Her body (and face), her choice? Moral rights are at the centre of this dispute, but it’s not just about copyright. While Nelson can claim to be the creator of the works, they only came about because Taylor consented to be part of their creation, and she insists that she did so on the understanding they were for one purpose only – an editorial spread in Vogue Portugal.\n\nAdvertisement\n\nThe first she heard of Nelson’s broader ambition was in September 2025, when the photographer offered her a 15 per cent cut of the proceeds of any sales, which she then estimated might total $70,000 (a Grammy nomination, support slot for AC/DC and a splash of controversy can do wonders for prices in the art market, apparently). Taylor rejected the offer, saying in her response to the application for a restraining order “there was no royalty rate that would have made Ms Nelson’s proposal attractive to me”. Having her name, image and the identity of the band “attached to products that are affordable only to elite, wealthy buyers is horrifying to me,” she wrote. “It is against everything I stand for and would be damaging to the inclusive, egalitarian brand that my bandmates and I have worked incredibly hard to establish over the last 10 years.” Nelson asserts that she owns the images and is “fully within her legal rights to display, market, and sell fine art prints of her own copyrighted work. No approval is required from any third party”. Taylor, though, believes she has the law on her side.\n\nAdvertisement\n\nUnder section 3344 of California’s Civil Code, the use of a person’s image “without such person’s prior consent ... shall be liable for any damages sustained by the person or persons injured as a result thereof ... and any profits from the unauthorised use”. Win or lose, for the photographer there is a lot of money at stake. But for the singer, it’s about a far simpler, and more important, proposition: that she should be the only person who gets to decide how and by whom her image is exploited. And for a Tiny Bikini-wearing sister to try to take that away from her ... well, it’d be no wonder if she’s singing U Should Not Be Doing That and It’s Doing in Me Head on high rotation. Must-see movies, interviews and all the latest from the world of film delivered to your inbox. Sign up for our Screening Room newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/they-were-the-greatest-games-on-earth-so-why-did-state-of-origin-die-20230517-p5d8zk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The tackle that killed State of Origin football",
        "publish_date": "Wed, 11 Feb 2026 12:02:30 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik",
            "Andrew Wu"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size When Andy Collins ran down his Hawthorn teammate Tony Hall at the MCG in 1989, he could not have known his desperate, goal-saving tackle would lead to the demise of State of Origin football. A crowd of 91,960 had flocked to the MCG to watch Victoria play South Australia for the first time at the venue in 18 years. It was there that Hall, caked in mud, lay clutching his knee as the stretcher came out. It was an ordinary tackle with traumatic consequences. Had it not happened on a particularly boggy section of the ground, Hall may have walked away from it. Instead, he was carried off in agony after rupturing three of the four major ligaments in his right knee. Tony Hall clutches his knee after being injured in a tackle during the 1989 State of Origin clash at the MCG. Credit: Channel Seven “If you never played in a grand final, State of Origin was the closest thing to it,” Hall told the Crows in 2015. “Andy was shattered. He was in the hospital with me that night and was really upset about it. He was a good mate, and I still see Andy every now and again these days. It was really tough. The ground was terrible and muddy. You don’t get grounds like that any more, it was horrendous.”\n\nAdvertisement\n\nA great decade of state football culminated on that memorable Saturday afternoon in July when the Vics, with loose eligibility criteria, fielded a forward line featuring Tony Lockett, the Brisbane-born-and-raised Jason Dunstall, and Dermott Brereton. Ten years later, State of Origin as we knew it was gone. ‘Nerves, insecurity, fear ... give way to courage and bravery’ At this time of year many AFL fans lament what might have been as they tune into rugby league’s State of Origin series between NSW and Queensland, typically three of the most watched programs of the year. Referred to as Australian sport’s greatest rivalry, Origin in the northern states is a big deal. Performances at club level are scrutinised from the point of view of worthiness for a Blues or Maroons jersey. The best 36 players in the country come together in combat across 80 bone-jarring minutes playing for a prize considered by some to be greater than the NRL premiership. The three games in the 2022 season were the fourth, fifth and sixth most watched programs of the year, with audiences of between 2.529 million and 2.632 million. Only Ash Barty’s Australian Open victory and presentation and the AFL grand final had a larger audience. The NRL grand final was ninth.\n\nAdvertisement\n\nNSW great Phil “Gus” Gould used to deliver a stirring call to arms in a pre-game speech on Nine’s telecast titled “Last Word”, outlining the gladiatorial nature of origin. “Nerves, insecurity, fear, it will give way to courage and bravery. It will give way to the commitment you have to your teammates and your state. It will give way to the commitment you have to do whatever is necessary to win. “Why? Because that’s what Origin players do.” Legendary South Australian coach Graham Cornes recalls a time when pulling on a state jumper carried the same honour for Australian rules players – and the punters cared. He also remembers when it changed. “When the Crows came in, it changed the landscape a bit, but even the ’94 State of Origin game, some people say it’s the greatest game of footy ever played,” Cornes, who won nine of 11 origin matches, including six of eight against Victoria, said. “Don Scott was one of the commentators. He said at the end it was the best game of footy he had ever seen.”\n\nAdvertisement\n\nSimon Madden remembers the pressure he felt when he walked into the Victorian rooms before a game. “You have got Gerard Healy, Brownlow medallist, Greg Williams, Brownlow medallist, [Dale] ‘Flea’ Weightman, one of the best rovers,” Madden said. “I remember thinking: ‘I have no excuses here, I better do my job. I can’t blame anyone else’.” Tony Lockett and Dermott Brereton after the win over South Australia in 1989. Credit: Getty Images ‘The two mullets on a Tuesday night’ Former players reminisce about playing for their club on the weekend and backing up for their state on Tuesday before lining up again for their club a few days later. “Even when I played, they still played [Stephen] Kernahan versus [Paul] Roos, the two mullets, on a Tuesday night,” Saints coach and former Fitzroy hard man Ross Lyon said.\n\nAdvertisement\n\n“Timmy Watson going head-to-head with the ‘Rat’ [John] Platten. Some great footy was played, and Teddy Whitten. I think we all loved it. As a kid I went in 1978, the Victorian team with Robert Flower and [Paul] Van der Haar, and they dominated Western Australia, it was great.” Anthony Koutoufides was devastated when he was ruled out of what would have been his State of Origin debut for Victoria in 1996. “I got picked to play, but the last week before the game, I got a cork in my calf and it flared up,” he said. The Carlton great still believes the injury may have been held against him come selection a year later, and it wasn’t until 1999 that he was handed the chance to don the Big V against South Australia in what he viewed as “the greatest games on earth”. “In the ’80s, I could not wait to watch Vic v SA, Vic, WA. I would rush home from school – the greatest game on earth is on,” Koutoufides said. Much to Koutoufides’ disappointment, that clash on a sodden MCG proved to be his first – and only – taste of State of Origin.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/rfk-jr-s-policies-contribute-to-10-billion-hit-to-one-of-australia-s-biggest-companies-20260211-p5o1ap.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "RFK Jr’s policies contribute to $10 billion hit to one of Australia’s biggest companies",
        "publish_date": "Wed, 11 Feb 2026 12:01:06 +1100",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "Advertisement\n\nBreaking BusinessCompaniesBiotech RFK Jr’s policies contribute to $10 billion hit to one of Australia’s biggest companies Colin Kruger February 11, 2026 — 12:01pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTrump administration Health Secretary Robert F. Kennedy Jr’s more stringent requirements for vaccines have contributed to a $1.5 billion writedown at one of Australia’s largest companies, biotechnology firm CSL, which then suffered a $10 billion hit to its value. CSL shares plunged on Wednesday morning after the company disclosed the writedowns, posted an 81 per cent drop in first-half profit and sought to explain its abrupt chief executive change on Tuesday amid further weakness in the US vaccine market following the appointment of the vaccine sceptic health secretary. US Health Secretary Robert F. Kennedy Jr: having an anti-vaxxer in charge of America’s health system has been one of the factors hitting CSL’s performance. Aresna Villanueva The company began life as a Commonwealth-owned laboratory and became one of the Australian stock exchange’s great success stories over the past 30 years as it became a big player in blood plasma products and vaccines, but it has also been hurt by regulatory changes in China. Net profit after tax fell to $US401 million ($566 million) for the December half year, hit by restructuring costs from its transformation announced last year and $US1.1 billion ($1.5 billion) worth of asset writedowns on different parts of its global business, including its vaccine division.\n\nAdvertisement\n\nThe biotech’s share price has now halved in 18 months, shredding more than $70 billion of shareholder wealth after the latest writedowns and operational struggles Shares dropped as much as 12 per cent to a low of $150.23, having dropped 5 per cent on Tuesday evening after it botched the announcement that chief executive Dr Paul McKenzie was retiring with immediate effect that day. The stock had not stopped trading on the ASX and dropped quickly amid chaotic trading. “The results we’re presenting today represent a step in a broader transformation of CSL with the objective of delivering enhanced growth, profitability and shareholder returns,” CSL’s interim chief executive, Gordon Naylor, said on Wednesday. He emphasised that his appointment will not be a passive one, and he will continue to drive the changes announced last year.\n\nAdvertisement\n\nRelated Article Analysis\n\nAnti-vaxxer movement How Trump’s antivaxxers helped trigger Aussie giant’s $50b implosion Chairman Dr Brian McNamee told investors in a late call on Tuesday the company had a sense of “urgency” as it looked to improve its performance and indicated McKenzie was not driving the change quickly enough. “When the board sat down recently and looked at our business and thought about where we need to go in the future, we recognised he didn’t have the skills that we wanted for the future,” McNamee told analysts. He also emphasised that the board was “not happy with the performance” of the group. CSL shares dropped significantly last year, as investors were underwhelmed with its general performance, spooked by anti-vaxxer sentiment in its large US market, and US President Donald Trump’s threats to put tariffs of up to 250 per cent on pharmaceuticals.\n\nAdvertisement\n\nRelated Article Biotech Boss of $83b giant CSL exits abruptly In October last year, a further plunge in US vaccination rates since the appointment of Kennedy delivered another hit to vaccine profits and sparked a share price collapse. McNamee said the double-digit decline in US vaccination rates was a shock to the group, given the declines already experienced over the previous two years, and it was yet to see a bottom to this vaccine decline. CSL said in its results announcement that the writedown of its vaccines division was caused by a hit to the value of its coronavirus vaccine technology “driven by declining COVID disease burden and more onerous US regulatory requirements”. On Wednesday, CSL indicated this business was expected to decline further this year.\n\nAdvertisement\n\nChina has also hurt CSL because it has changed its rules to allow a plant-based version of a blood plasma product called albumin to be mixed with the traditional human blood-based equivalent produced by CSL, leading to a 27 per cent drop in its exports to the country. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/trump-s-digital-gold-dream-is-turning-into-a-nightmare-20260211-p5o19o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fool’s gold: Trump’s bitcoin dream is turning into a nightmare",
        "publish_date": "Wed, 11 Feb 2026 11:59:01 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Advertisement\n\nBusinessMarketsBitcoin Opinion Fool’s gold: Trump’s bitcoin dream is turning into a nightmare Stephen Bartholomeusz Senior business columnist February 11, 2026 — 11:59am\n\nFebruary 11, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDonald Trump has described bitcoin as “digital gold.” Events of the past four months say that, whatever else it might be, it isn’t that. The plunge in bitcoin’s price last week underscored that it isn’t behaving as its boosters have described it. It’s not a hedge against inflation, or geopolitical risks, or volatility in traditional assets, or currency debasement. Trump, once a crypto sceptic – he described it as a “scam against the US dollar” – became a convert after crypto billionaires helped fund his campaign Aresna Villanueva Gold, even though it, too, took a hit last week before regaining much of the ground it lost, does perform those roles and has demonstrated that by surging to record levels against a backdrop of volatility in global financial markets, including a depreciating US dollar, and the economic and geopolitical environments. Bitcoin’s price peaked last October at more than $US126,000 ($178,000). It fell more than 22 per cent last week to trade below $US64,000, before recovering to now trade around $US68,650.\n\nAdvertisement\n\nGold, over that same period, has soared from just under $US4000 an ounce to just over $US5000 an ounce today. It has performed as one might expect in the circumstances. Related Article Opinion\n\nJapan The ‘Iron Lady’ looking to shake up the world order Stephen Bartholomeusz Senior business columnist Where bitcoin’s price has plunged more than 45 per cent since its peak, gold’s has risen 25 per cent in that same time period. There is, in effect no positive correlation between the two, which demolishes the notion that bitcoin, or cryptocurrencies more generally, are a hedge against risk. The sell-off of bitcoin last week was part of the broader market meltdown triggered by Anthropic’s release of new artificial intelligence tools that appear to represent a significant threat to software-as-a-service companies. At one point the S&P 500 had fallen more than 2.5 per cent and the more tech-laden Nasdaq index was down 4.5 per cent as fears that AI might cannibalise existing companies earlier than anticipated rose.\n\nAdvertisement\n\nThe performance of bitcoin last week would suggest that it is far more correlated – in a highly leveraged fashion – to equity markets, and technology stocks in particular, than more defensive assets. Unlike gold, it’s leveraged to “risk on” environments rather than “risk off” settings that favour gold. The dramatic demonstration of bitcoin’s leverage to shifts in the risk environment highlights (a) its relatively scarcity and illiquidity in its primary market, given that only 21 million coins will ever be in circulation and (b) the growing liquidity in secondary, synthetic, markets as they became more institutionalised and cryptocurrencies more mainstream. Analysts expect that the price of gold will continue to surge this year after record growth in 2025. However, an ASX-listed gold play failed to fire on debut on Monday. Dominic Lorrimer There has been a proliferation of exchange-traded funds and the development of derivative markets for bitcoin that have created a deeper market for trading in crypto and bitcoin in particular. They have also, however, introduced leveraged and institutional trading strategies to a market that used to be quite unsophisticated. That could help explain the exaggerated swings in value.\n\nAdvertisement\n\nLast week, for instance, one of the proffered explanations for the extent of the bitcoin meltdown was that a Hong Kong hedge fund with a big and leveraged out-of-the-money position in bitcoin derivatives, funded by cheap yen-denominated borrowings, was caught out by the steep fall in the price and the volatility of the yen and hit by margin calls and was forced to liquidate its position. Whether that’s true or apocryphal, it highlights how combustible the combination of leverage, illiquidity and margin calls can be for crypto assets when volatility surges in financial markets. Related Article Opinion\n\nFederal Reserve Trump’s new man could spark a financial meltdown Stephen Bartholomeusz Senior business columnist The decline in bitcoin’s price, however, wasn’t a one-week phenomenon. It began in early October when the bullishness - euphoria even – that accompanied Donald Trump’s win in then presidential election in 2024 and drove bitcoin to record levels began to ebb. Trump, once a crypto sceptic – he described it as a “scam against the US dollar” – became a convert after crypto billionaires helped fund his campaign (and his family piled into the crypto world, starting up a raft of crypto businesses that have greatly increased his wealth).\n\nAdvertisement\n\nTrump declared that he would be the “bitcoin president” and the US would become the “crypto capital of the planet”. He has created a crypto strategic reserve from crypto assets (an estimated 330,000 bitcoins) confiscated by US authorities. Last year Congress passed the Genius Act, which provided a regulatory framework for stablecoins, and has the Clarity Act, which is a complementary bill that fills in some of the details, before it. That latter piece of legislation, and the delays in enacting it, might have been a contributing factor to the post October trend in crypto prices that has wiped nearly $US2 trillion from the overall crypto market’s capitalisation.\n\nAdvertisement\n\nOn Tuesday, there was a meeting at the White House between promoters of stablecoins and bankers who have been wrangling for months over whether stablecoins should, or should not, be able to offer yields or other rewards. The crypto companies say that yields are essential if they are to be competitive and drive user adoption. Trump declared that he would be the ‘bitcoin president’ and the US would become the ‘crypto capital of the planet’. The banks say they will, by offering yields the banks cannot match, drive deposits that are critical for their ability to lend into what is, compared to the banking sector, an effectively unregulated environment. On some estimates, more than $US6 trillion of deposits would be at risk. The Trump administration is keen to see the US stablecoin sector flourish because, with a requirement that for every dollar of stablecoins there always has to be a dollar of safe assets – US Treasury securities are the most obvious – it would drive demand for US government debt and lower the government’s rapidly-rising interest costs.\n\nAdvertisement\n\nTuesday’s meeting – the second in a week – doesn’t appear to have resolved the impasse. The debate, however, highlights the potential for crypto, stablecoins in particular, to change and even destabilise banking systems if the regulatory framework isn’t designed intelligently. The other influences on crypto prices since October might be Trump’s erratic deployment of tariffs, the kidnapping of Venezuela’s president, the threats to invade Greenland and the potential for another military action against Iran, all of which contribute to a risk-averse environment. Related Article Gold ‘Speculate in bitcoin, hoard gold’: Precious metal’s value soars The assaults on the US Federal Reserve and its chairman, and Trump’s nomination of Kevin Warsh, who made his name as an inflation hawk, as the next chair of the Fed probably haven’t helped. The lower interest rates promised by Trump and Warsh aren’t going to materialise if, in the process, they stiffen the resolve of the voting members of the Federal Open Market Committee to demonstrate their independence, and Warsh could easily revert to type once he gains the chair if the inflation rate remains stubbornly high.\n\nAdvertisement\n\nHis desire to shrink the Fed’s balance sheet, which would pull liquidity from the US system, would also be inimical to an asset class which, like equities, performs more strongly when there is a lot of liquidity in the system. While there might be no singular explanation for why bitcoin’s price has been tumbling over the past four months, there are, therefore, a number of streams of risk within the environment that might have contributed to a sell-off that has made it clear that, whatever bitcoin might be, it isn’t digital gold. The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/live-public-housing-rights-stay-022510639.html",
        "title": "If you live in public housing, what rights do you have to stay in your home?",
        "publish_date": "2026-02-11T02:25:10Z",
        "category": "finance",
        "authors": [],
        "text": "Around 544,000 people live in public housing in Australia. And there’s huge demand for more: 169,000 households are waiting for public housing, up almost 10% from a decade earlier.\n\nBut what happens when a state government decides to move public housing tenants? Do tenants have any legal rights to stay?\n\nSeveral court cases – including a new High Court appeal for Melbourne tenants, and an unexpected win for three Canberra tenants – show how some people are challenging their relocation when laws aren’t properly followed.\n\nHow 3 tenants fought and won\n\nEarlier this month, three public housing tenants in the Australian Capital Territory had a rare win, stopping them being relocated against their wishes. The women had each lived in their home for around 30 to 40 years.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe ACT Supreme Court found the territory’s social housing commissioner had denied the women procedural fairness and failed to consider their rights under the territory’s Human Rights Act. All public bodies in the ACT must properly consider human rights when making a decision.\n\nJustice Verity McWilliam’s judgement quoted iconic Australian movie The Castle, as well as Roman philosopher Cicero:\n\nIt need hardly be said that any interference with one’s home must be lawful. That pithy one-liner in The Castle (1997), voiced in the fictional character of Darryl Kerrigan, still resonates: “It’s not a house, it’s a home. A man’s home is his castle […] You can’t just walk in and steal our homes.”\n\nA precedent, with another case to come\n\nProcedural fairness means a person has a right to be heard by a government decision-maker before a decision affecting their interests is made.\n\nThe ACT Supreme Court found the commissioner had not consulted with the tenants or taken their personal circumstances into account. This breached the tenants’ right to a home, as well as the rights of an Indigenous tenant to maintain community ties and cultural practices.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nCrucially, it wasn’t just a temporary win: as ABC News reported, the three women are still in their Canberra homes today and will not be relocated.\n\nThe tenants’ solicitor Sangeeta Sharmin said the judgement set a precedent, “acknowledging that our clients’ houses are not mere assets, but homes”.\n\nLooking ahead, another group of ACT social housing tenants are taking their class action to the Federal Court, responding to the ACT government’s unsuccessful push to move them from their homes. No date has been set for that hearing.\n\nMelbourne tenants appealing to the High Court\n\nA similar case has been playing out in Melbourne’s inner north.\n\nHomes Victoria is seeking to relocate around 10,000 residents of 44 public housing blocks to redevelop the properties with new social and public housing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut last Thursday, a Victorian court made orders preventing about 32 households from being evicted from three almost empty Melbourne public housing towers, pending an appeal to the High Court. The towers are due to be demolished and Homes Victoria has warned the delays will cost millions of dollars.\n\nInner Melbourne Community Legal tenancy lawyer Louisa Bassini told the ABC the court injunction was a win for tenants:\n\nIt means that they can stay in their homes, see this process through, and make sure that the courts have had a proper opportunity to consider […] whether their rights [under Victoria’s human rights charter] were properly considered.\n\nPublic housing rights across Australia\n\nPrivate and public landlords are entitled to evict tenants when they intend to sell or demolish the premises. But public landlords have additional policies requiring them to help tenants locate alternative premises, either in public housing or in the private market, and to assist with moving costs.\n\nIn the case of redevelopment, tenants may be entitled to return to the redeveloped property. However, this depends on them meeting eligibility criteria, having no outstanding debts, and suitable properties being available.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn Victoria, for example, tenants are offered two properties before a notice to vacate is given. Following this, Homes Victoria may seek a possession order which evicts the tenant.\n\nWestern Australia, the Northern Territory and South Australia have similar relocation guidelines to Victoria. However, they don’t have their own human rights laws.\n\nIn Tasmania, there are no published guidelines regulating relocation, despite research showing how difficult that relocation process can be.\n\nVictoria, the ACT and Queensland have human rights laws in place that protect the right to non-interference with the home, and cultural rights. Public bodies, such as housing authorities, are obliged to properly consider these rights when making decisions.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOver coming months, we’ll see if the High Court agrees to hear the Melbourne tenants’ appeal, as well as the outcome of the ACT social housing tenants’ case in the Federal Court.\n\nBut the recent ACT Supreme Court decision offers some hope for public tenants. If state and territory governments want to relocate tenants, they must follow their own laws and policies properly – or risk costly legal challenges.\n\nThis article is republished from The Conversation. It was written by: Bill Swannie, Australian Catholic University\n\nRead more:\n\n\n\nBill Swannie does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
        "source": "Yahoo"
    }
]