[
  {
    "url": "https://www.9news.com.au/national/student-loans-20-per-cent-cut-rolls-out/a2a81aa8-4a2e-4daf-9f1d-a06ddbaa9b1b",
    "title": "Billions of dollars of debt wiped from accounts of 100,000 Aussies",
    "publish_date": "Fri, 21 Nov 2025 22:38:32 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Billions of dollars of student debt have been wiped from the accounts of 100,000 Australians.\n\nThe Albanese government's pre-election promise to ease student loan debt passed ﻿parliament in August and has begun to roll out from today.\n\nAbout three million Australians will have ﻿a total of $16 billion of all student loans, including HELP, VET, apprenticeship support loans and student startup loans.\n\nEducation Minister Jason Clare said it was the \"biggest cut in student debt ever\". (Nine)\n\nThe first 100,000 people will see their debt slashed from today, with another three million to follow in the next fortnight. ﻿\n\nAustralians will receive a text message or email from the Australian Tax Office when the changes are automatically applied.\n\nEducation Minister Jason Clare said it was the \"biggest cut in student debt ever\".\n\n\"Today, 100,000 young Australians will get the best text message ever, telling them that their debts been cut by 20 per cent,\" he told Weekend Today .\n\n\"On average, that means about $5500 of debt wiped off their back.\n\n﻿\"That's a lot of help for young people, out of TAFE, just out of university, maybe they're just out of home. They're certainly just getting started in life.\"\n\nThe 20 per cent reduction will be calculated based on what the debt amount was on June 1, before indexation was applied.\n\n\"Sydney, Australia - August 17, 2012: Students and graduates converge on a lawn before the University of New South Wales (UNSW) library on a clear winter morning.\" (Getty)\n\nThe legislation also raised the minimum amount people have to make to start repaying their loans from $54,435 to $67,000 and reduced the minimum repayments.\n\nThese changes are in addition to the $3 billion cut from the indexation applied to student loans earlier this year after the government switched the index rate to be whichever is lower: the wage price index or the consumer price index. ﻿\n\nThe federal government earlier this month announced it will introduce a second round of 20 per cent cuts to student loan debt, totalling another $16 billion, by June 1 next year. ﻿\n\n\"I will always fight for every young Australian to have access to a good education,\" Prime Minister Anthony Albanese said in a statement at the time.\n\n﻿\"This will help everyone with student debt right now, whilst we work hard to deliver a better deal for every student in the years ahead.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/brisbane-somerville-house-education-minister-jason-clare-lashes-prestigious-school/060f3d04-02ec-43b9-8cc3-4741c064a108",
    "title": "Education minister calls out prestigious school over leaked document about students",
    "publish_date": "Sat, 22 Nov 2025 06:07:07 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Education Minister Jason Clare has criticised the failure of a prestigious girls school in Brisbane, after a leaked internal document showed teachers had commented on the appearance, behaviour and personalities of children.\n\nYear 11 students at ﻿Somerville House, a 126-year-old boarding and day school in South Brisbane, stumbled upon a spreadsheet and found teachers had made notes about them.\n\nParents were then asked to think of the teachers, with students blamed for sharing the document. ﻿\n\nSomerville House is a 126-year-old school in South Brisbane. (Jorge Branco)\n\nExams have been pushed back a day while the school investigates.\n\nClare said the school has failed in this instance. ﻿\n\n\"They've failed the students, and they've failed the parents of the kids who go to that school,\" he told Weekend Today.\n\n\"Schools have got to collect information, but they've got to do it in a secure way, and they've also got to do it in a professional way.\n\n\"And I don't those things has happened here.\"\n\nSomerville House principal Dr Sandra Hastie said students were being offered counselling and apologised for the \"distress and hurt\" caused.\n\n\"We recently experienced an incident whereby some students accessed some notes about themselves and their peers.\n\nEducation Minister Jason Clare said the school had failed. (Nine)\n\n\"We sincerely apologise for the distress and hurt many within the school community are experiencing. We are very disappointed by what has happened, as the nature of some of these comments fall short of our standards and values.\n\n\"As soon as we were made aware of this incident, we worked with external experts to help us investigate what has happened.\"\n\nHastie said the school's investigation was ongoing.\n\n\"We are taking this situation very seriously and student wellbeing is our priority,\" she said.\n\n\"We have communicated with our school community and made counselling and pastoral care services available to them. We have also opened our Employee Assistance Program to students and families to ensure they have access to support.\n\n\"We are committed to adhering to our legal obligations and we have notified the Office of the Australian Information Commissioner (OAIC).\"\n\nSomerville House was established in 1899 and is a prep to year 12 girls school taking day and boarding students.﻿\n\nFees start at $23,000 to more than $30,000 a year. ﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/artificial-intelligence-impacting-author-pen-names-and-pseudonym-interview-with-author-exclusive/c1a633c4-e731-45e8-b3d6-aa6aaaceedbe",
    "title": "'We're real': The type of book we may never see again thanks to AI",
    "publish_date": "Sat, 22 Nov 2025 20:46:53 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Exclusive: J﻿K Rowling does it. As did Anne Rice and Mark Twain.\n\nYou may not realise it, but Dr Seuss did it too.\n\nThe historic practice of writing under a pseudonym, pen name or nom-de-plume may be dying a slow death - thanks, in part, to the rise of artificial intelligence (AI) in publishing.\n\nAI could be resulting in the slow death of the writer pen name. (Graphic: Polly Hanning)\n\nREAD MORE: ﻿ Professor flooded with death threats over what he wants banned from Queensland\n\nResearch by Cambridge University this week found 51 per cent of published novelists in the UK are worried AI might end up making their jobs redundant.﻿\n\nThere are already terabytes of AI slop masquerading as books being peddled on the internet﻿ – but Queensland fantasy author Darryl King isn't worried these will destroy his career.\n\nKing, who publishes his In All Jest series under the name D.E. King, told nine.com.au there could be very different consequences of ﻿ChatGPT's influence on the book industry.\n\n\"I think all authors are struggling to find ways to market themselves and to stand out now already without AI,\" King explained.\n\n\"It's a bit like music where as authors, we have to go and do more signings and appearances at libraries to validate we're real.\"\n\nRecent studies have found﻿ book readers value the human element more than ever when it comes to fiction.\n\nKing said this has translated into book buyers wanting to know the author more intimately.\n\nThis means no fake name and no shadowy anonymous figure, instead of a real-life author headshot.\n\nIt could impact romance writers, who typically use pen names to preserve anonymity from their real-life acquaintances, the most.\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nQueensland fantasy author Darryl King said readers value authentic authors who show their face more than ever. (Supplied)\n\nREAD MORE: Why thousands of Australians are buying and selling snack vending machines\n\n\"I think it's about those in-person real events where you can see them,\" King explained.\n\n\"So even if I'm buying from America, I can see the events that this guy goes to in Australia and there's might be a video or a photo from it, I'm more likely to believe they're real.\"\n\nThe publishing industry needs to adapt to this pressure from AI, King believes.\n\nThis could mean more money being used to promote authors on social media and in-person.﻿\n\n\"Perhaps that's what the publishing platforms need to do... to validate author profiles more,\" King added.\n\nAt the moment, some AI paragraphs can be easy to pick out.\n\nTake the dreaded ﻿em dash, for example, which has become an AI calling card.\n\nKing said AI has muddied the waters – he has a copy editor from the UK who has always preferred this grammar style.\n\n\"He regularly puts em dashes into my work,\" he laughed.\n\n\"﻿We expect that, that it's AI and it might not be.\n\n\"So how do you tell my stories more human than another story? Is it because it's got typos occasionally?\"\n\nBook authors are increasingly worried about the impact AI has on publishing, according to research. (Getty)\n\nKing also has a day job as a web developer where he ironically often uses and learns about AI.\n\nHe said e-books were already a reason why many authors can't support themselves financially on books alone.\n\n﻿AI is probably going to make it harder, he predicts.\n\n\"I think it was already difficult. Like other industries, we get competition from external, cheaper sources,\" he said.\n\n\"But I think you have to weather that. You have to find things that help you stand out.\n\n\"We all hope that people will start to filter out the rubbish.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/nvidia-the-worlds-biggest-company-just-told-everyone-to-chill-out/d94c1dc9-6e74-426b-a608-908028a64d11",
    "title": "The world's biggest company just told everyone to chill out",
    "publish_date": "Sat, 22 Nov 2025 13:30:25 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Concerns about an AI bubble have been simmering for at least a year and a half. Nvidia's incredibly strong earnings this past week tried to put those fears to bed. It may not have been enough.\n\nNvidia on Wednesday posted sales and profits up more than 60 per cent year-on-year, stronger than Wall Street had projected. CEO Jensen Huang said \"sales are off the charts\". And the company expects fourth quarter revenue of about $US65 billion ($100 billion), once again ahead of Wall Street's projections.\n\nNvidia executives said these results, along with growth from other major AI players and the billions being poured into AI infrastructure, indicate that fears of an AI bubble are overblown.\n\nREAD MORE: Education minister calls out prestigious school over leaked document about students\n\nJensen Huang, NVIDIA founder and CEO, at a Q&A session during the APEC CEO summit in Gyeongju, South Korea. (Getty)\n\n\"There's been a lot of talk about an AI bubble,\" Huang said on a call with analysts on Wednesday. \"From our vantage point, we see something very different.\"\n\nSome Wall Street analysts agree. But the wider market is not yet convinced: After briefly ticking up on Thursday morning following Nvidia's report, the chipmaker's shares (NVDA) dipped back into the red. They closed Friday down 1 per cent, although the stock remains up 29 per cent from the start of this year.\n\nIn other words, Nvidia answered a lot of questions about where the industry stands right now, but it may take more to shift the overall AI narrative.\n\nNot to burst your bubble\n\nNvidia CFO Colette Kress said the company anticipates $US3 trillion ($4.65 trillion) to $US4 trillion ($6.2 trillion) in annual AI infrastructure spending by the end of the decade, adding that demand \"continues to exceed our expectations\". Already, tech giants are expected to pour $US400 billion into AI-related capital expenditures this year, to meet what they say is growing demand for AI and cloud services but also to avoid falling behind industry rivals.\n\nNvidia has every reason to try to reassure investors — expectations for the company are sky-high after nearly two years of astronomical growth. And many look to the chipmaker as a bellwether for the overall tech industry.\n\nEven as Silicon Valley tries to figure out the business model for generative AI, Nvidia has a big role to fill in the existing tech services people use every day, Huang said. That could help insulate Nvidia even if returns from new AI applications are smaller than expected or take longer to arrive than planned.\n\nUS President Donald Trump speaks with Saudi Arabia's Crown Prince Mohammed bin Salman, Elon Musk, Nvidia CEO Jensen Huang and others at the Saudi Investment Forum. (AP)\n\n\"The world has a massive investment in non-AI software, from data processing to science and engineering simulations, representing hundreds of billions of dollars in cloud computing spend each year.\" Much of the infrastructure powering that software has transitioned from running on older CPU chips to Nvidia's GPUs, the chips known for running AI tools, Huang said.\n\nKress also took the unusual step of ticking through highlights from the chipmaker's partners' recent financial reports. At Meta, for example, AI recommendation systems are leading to \"more time spent on apps such as Facebook and Threads\". Anthropic recently noted it expects to earn $US7 billion in annual revenue this year. And Salesforce's engineering team is 30 per cent more efficient now that it's using AI for coding, she said, ﻿among a long list of corporate customers she rattled off.\n\nNvidia isn't the only one arguing that AI bubble concerns may be exaggerated.\n\n\"The pure Nvidia numbers/guidance and strategic vision shows the AI Revolution is NOT a Bubble…instead its Year 3 of a 10-year build out of this 4th Industrial Revolution in our view,\" Wedbush tech analyst Dan Ives said in emailed commentary.\n\nKing Charles III presents the 2025 Queen Elizabeth Prize for Engineering to Jensen Huang. (Getty)\n\nBrian Colello, senior equity analyst at investment research company Morningstar, said he doesn't \"see many signs to suggest that 2026 will be a weak year for Nvidia in any way\" and sees the bubble fears weighing on the company's stock as a \"buying opportunity\".\n\nFears remain\n\nBut despite those strong results, it appears the stock market may not be ready to relax just yet.\n\nQuestions remain about whether tech firms will maintain their massive spending on AI infrastructure, especially as Nvidia has invested in key, unprofitable customers such as OpenAI and Anthropic. OpenAI CFO Sarah Friar also raised alarms earlier this month when she suggested that the government should backstop the debt tech companies are incurring to build AI infrastructure. Some took her comments as a sign OpenAI may struggle to afford its commitments, although the company later tried to walk back the statement.\n\nAnd while Nvidia likely has enough customers even if a bubble burst causes some casualties among AI firms, investors may still be worried about what a downturn or even a slowdown could mean for the larger market.\n\n\"There's been a lot of talk about an AI bubble,\" Huang said on a call with analysts on Wednesday. \"From our vantage point, we see something very different.\" (Getty)\n\nDaniel Morgan, senior portfolio manager at Synovus Trust Company, said questions about the sustainability of Big Tech's infrastructure spending spree and Nvidia's circular funding deals were not \"put to rest\" with its latest report. Instead, they may just be \"punted\" to the next quarter.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/bunnings-managing-director-michael-schneider-secrets-to-success/6d1e3cb9-0b2d-4c6d-a65d-2ca55cbf616d",
    "title": "Michael got a retail job when his career plans fizzled. Now he's Bunnings' top boss",
    "publish_date": "Fri, 21 Nov 2025 20:18:53 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Exclusive: In this nine.com.au series, we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\n﻿Bunnings managing director Michael Schneider originally wanted to be a marine biologist, but the university fees were too high and a scholarship was out of reach.\n\nThen he considered being a school teacher﻿ but that didn't suit him either, so he picked up a job in retail – and pretty much never looked back.\n\nNow he's the top boss at one of Australia's most popular brands, with Bunnings raking in $18.97 billion in revenue in 2024﻿ alone.\n\nThese are his secrets to success.﻿\n\nMichael Schneider originally wanted to be a marine biologist - now he's ﻿Bunnings' managing director. (Supplied)\n\nHow do you start the day to set yourself up for success?\n\nRetailers tend to be morning people - trading performance, inventory availability and the like tend to form our habits early.\n\nWhen I'm travelling, early starts are also good for exploring a city or taking in some exercise.\n\nAt home, it varies depending on the day.\n\nSometimes an early workout is great and occasionally a bit more sleep before coffee and a light breakfast can work a treat.\n\nWhat are three daily habits you always stick to?\n\nEvery day can look different for me, whether it's heading out to stores to hear from our team or looking at an exciting new product to roll out for our customers.\n\nNo matter what I'm doing, three daily habits I stick to are:\n\nKeep moving - avoid sitting, walking meetings are a great way to stay present and keep active. Get back to people quickly - it's polite, professional and keeps you engaged with team, customers and suppliers. Find time for a laugh - life is short, make every day count.\n\nREAD MORE: Influencer turned business owner reveals mistake jobseekers keep making\n\nBunnings raked in $18.97 billion in revenue in 2024﻿ alone. (Domain)\n\nLots of Aussies are looking for a career change. What small action can help them get ahead of other candidates?\n\nI'm someone who has made many pivots over the course of my career.\n\nFrom starting on the shop floor at Target, to studying teaching, working in financial services and then finding my way back to retail, each role has helped shape me as a teammate and leader.\n\nMy best career advice would be to take every opportunity to learn and grow, even if it means stepping outside of your comfort zone.\n\nBe proactive in asking questions, seeking feedback and don't be afraid to put your hand up for new roles or projects.\n\nSometimes just being curious and taking the smallest step can lead to the biggest change.\n\nWhat financial myth did you previously believe that you wish you never bought into?\n\nFor many of us starting out in our careers, there's the idea that financial success is about climbing the ladder quickly.\n\nOver time, I've learned that resilience and consistency matter more.\n\nDon't buy into the myth that there's a shortcut; steady progress and staying true to your values are what really counts.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\nWhat do you wish you could tell your 20-year-old self?\n\nI'd tell myself to not worry too much about the future as it will all work out.\n\nEvery experience, good and bad, shapes who you become as a leader.\n\nBe open to new opportunities and ideas, and build strong relationships and trust with others which will serve you well throughout your career.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/christian-migrants-asia-pacific-sustain-australian-churches/105997642",
    "title": "How migrant and overseas Christians are helping keep Australian churches alive",
    "publish_date": "Sun, 23 Nov 2025 02:19:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "An Anglican Church bishop in Queensland's north says that his 11 Pacific Islander ministers, serving the region's parishes, is saving those parishes from collapse.\n\n\"Together they make up half of my full-time workforce in the diocese,\" Bishop Keith Joseph said.\n\nCensus data shows the number of Australians who identify as Christian has halved from 86 per cent in 1971 to 44 per cent in 2021.\n\nBut the decrease has been tempered by Christian migrants from Asia, Africa, the Middle East and the Pacific.\n\nPriests like Jeffery Akoai (centre) and Pasifika brothers make up half the full-time workforce of their Anglican diocese. (ABC News: Lucy Cooper)\n\nBishop Joseph said priests and brothers have been recruited from the Solomon Islands, Papua New Guinea and Vanuatu to fill service gaps in regional towns, Aboriginal communities and the Torres Strait.\n\n\"All that would go if we didn't have them,\" he said.\n\nThe north Queensland diocese is also in financial trouble because of the compensation owed to victims of historic abuse.\n\nChristian Pacific Islanders attend a monthly Melanesian service where celebrating culture is part of their worship. (ABC News: Lucy Cooper)\n\nKeeping the parishes going also involves vital volunteer work including running op-shops, providing chaplaincy to aged care homes and hospitals, and pastoral care to seasonal workers.\n\n\"You're looking at each parish providing between $200,000 to a million dollars of volunteer labour into their communities each year,\" Bishop Joseph said.\n\n\" If [Pasifika priests] aren't the backbone of the diocese, they are certainly very important. \"\n\nThe Pasifika priests are so valued by the community that a migration pathway was set up between the diocese, the Church of Melanesia and the Department of Home Affairs, the bishop said.\n\nOne priest recruited from the Solomon Islands under the agreement is Reverend Jeffrey Akoai who serves St Paul's Anglican Church at Proserpine in the Whitsundays.\n\nJeffery Akoai was recruited from the Solomon Islands three years ago to sustain parishes in north Queensland. (ABC News: Lucy Cooper)\n\nBesides regular masses he also leads a monthly Melanesian service for the region's many seasonal workers, helping to maintain social cohesion.\n\nOn Saturdays they also run a bible study for the workers which helps keep them from spending time at bars and instead saving money for their families back home.\n\n\"It's like we're creating a home, a safe space away from home, that they are free to come and share whatever challenges they are going through,\" Reverend Akoai said.\n\n\" As Melanesians, wherever we go we bring faith, community and culture with us. \"\n\nKeith Joseph says priests and brothers from Pacific Islands make up half his full-time workforce. (ABC News: Lucy Cooper)\n\nChristianity mixed with Indigenous beliefs\n\nReverend Dr Seforosa Carroll, a theologian at Charles Sturt University, said more than 90 per cent of the population in the Pacific was Christian, making religion inseparable from culture.\n\n\"To not have the church, to not have spirituality, is to lose your soul,\" she said.\n\nSeforosa Carroll says, historically, becoming Christian in the Pacific required becoming \"civilised\" — or Westernised. (Supplied: Seferosa Carroll)\n\nChristianity was tied to colonisation because becoming Christian often required becoming \"civilised\", which equated to being \"Westernised\", she said.\n\n\"In some cases the Christian mission and colonisation accompanied each other, and the missionary was the chief promoter of civilisation,\" Dr Carroll said.\n\nTheological anthropologist at the University of Divinity's Whitley College, Reverend Dr Titus Olorunnisola, said one reason why Christianity remained popular outside the West was because of the prevalence of existential threats like poverty and political unrest.\n\n\"The only hope that people have is to hold on to their faith as a source of strength, hope and refuge,\" Dr Olorunnisola said.\n\nTitus Olorunnisola says the \"spiritual temperature\" in Australian churches is rising. (Supplied: Titus Olorunnisola)\n\nAnother reason why Christianity was strongly embedded in some Pacific and African cultures was because people still held Indigenous beliefs of evil spirits and demons.\n\n\"The way to be spiritually protected for most people was to be a practising believer,\" Dr Olorunnisola said.\n\nHuge parish demographic changes\n\nIt is an ironic pattern playing out across regional Australia — where religious leaders are now recruited from countries that were once converted by Christian missionaries from the West.\n\nMethodist missionaries brought Christianity to Fiji in the 19th century. (Supplied: Matt Tomlinson)\n\nWhen Monsignor Glynn Murphy was ordained in 1983 he remembered there being about 100 active priests across 52 parishes in the Ballarat Catholic Diocese in western Victoria.\n\nSince then, the diocese has amalgamated its parishes so just 23 remain with about 30 priests including those from the Philippines, Vietnam and India.\n\nMonsignor Murphy leads the Wimmera-Mallee parish and has observed congregations of migrant groups change.\n\nGrowing up in Swan Hill he saw Australians and then Italian, Dutch and Chinese families flock to mass on Sunday mornings.\n\nHe said nowadays migrants were mostly young families from the Philippines and India who came to regional Victoria to fulfil labour shortages in education, aged care and healthcare.\n\nThe congregation at St Michael and John's Catholic church is made up of many young families from the Philippines and India. (Supplied: Wimmera Filipino-Australian Club)\n\n\"They tend to have their faith and spiritual life very much to the fore … and you see that reflected in their parish attendance and presence,\" Monsignor Murphy said.\n\nAssimilating through the church\n\nOne of Monsignor Murphy's parishioners is early childhood educator May Falcatan-Rosello.\n\nShe remembered hearing the Horsham church congregation sing The Lord's Prayer, a universal Christian prayer, in Tagalog after she introduced it during a mass.\n\nTagalog is one of the main languages in the Philippines.\n\n\"It was so real! I have goosebumps until now,\" she said.\n\nAnother Filipino parishioner cried because she felt like she was transported back home, she said.\n\nMs Falcatan-Rosello and her family are part of the Wimmera Filipino-Australian Club and attend mass every Sunday at St Michael and John's Catholic Church.\n\nMay Falcatan-Rosello and her family chose to settle in Horsham when the Catholic church embraced them. (Supplied: Wimmera Filipino-Australian Club)\n\nBesides helping with the choir where she has introduced some Filipino hymns, she also runs morning tea and is the only reader of mass of a non-Anglo background.\n\n\"I know I have an accent, but they still roster me for it,\" she said.\n\nAfter living in Toowoomba, Melbourne and Bendigo, Ms Falcatan-Rosello settled in Horsham because of the Catholic church and \"robust Filipino community\".\n\nThe Philippines is the top-ranked birthplace for Australia's overseas-born Catholics. (ABC News: Mitchell Woolnough)\n\nIn 30 years the number of Filipino-born Catholics in Australia has trebled — from less than 62,000 in 1991 to 216,000 in 2021.\n\nIt makes the Philippines the top-ranked birthplace for Australia's overseas-born Catholics.\n\nNearly 80 per cent of the Philippines' population identify as Catholic, which stems from Spanish colonisation that spanned more than 300 years.\n\nMs Falcatan-Rosello said finding a church where she could practise her faith was a consideration when choosing where to migrate to because churches provided a \"sense of belonging\".\n\n\"You eventually develop a support system. Sisters and brothers in faith become that for you too,\" she said.\n\nReverend Akoai's son participates in the Melanesian mass wearing his kabilato, traditional dress and ornaments from Solomon Islands. (ABC News: Lucy Cooper)\n\nDr Olorunnisola said besides being part of one's identity, the church served as a \"nest\" that migrants could \"settle into\" to help them understand Australia and its colloquialisms.\n\n\"There are so many cultural assumptions that you might be coming with when you're coming from overseas,\" he said.\n\nA different kind of worship\n\nCompared to Australia, the way Christianity is practised overseas was more spiritual and overt, Dr Olorunnisola said.\n\nPeople lifted their hands and sometimes each other up, and sharing spiritual experiences with others outside mass was more common.\n\nThe monthly Melanesian mass begins with a procession of parishioners wearing their traditional dress called the kabilato. (ABC News: Lucy Cooper)\n\nWorship in these cultures tend to be more passionate, exuberant, and deeply emotional experiences than in Australian church culture.\n\n\"Here there is so much emphasis on individualism a lot of people tend to keep their faith to themselves,\" Dr Olorunnisola said.\n\n\"Someone who is from a Western background within the same churches may feel 'yeah, I think the things that the pastor spoke about today were reasonable'.\n\n\"But for someone who has come from Asia … their perception of the service was 'oh, I just felt within me that God was touching people'. So you can see the dynamics.\"\n\nAs churches became more multicultural, Dr Olorunnisola felt the \"spiritual temperature\" and vibrancy was rising as people were more exposed to, and accepting, of other expressions of worship.\n\nMelanesian parishioners carry this boat carving to the service to honour the missionaries who brought Christianity to the Pacific. (ABC News: Lucy Cooper)\n\nBack in north Queensland, Reverend Akoai is grateful for the parish and its locals who have welcomed their Melanesian expression of faith and musicality.\n\n\"They feel like they're being nourished by the singing and dancing way of worship that we bring with us,\" he said.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/wallabies-progress-stalls-after-promising-signs-in-2025/106042214",
    "title": "The Wallabies have stalled two years out from World Cup — where to from here?",
    "publish_date": "Sun, 23 Nov 2025 02:13:14 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Wallabies class of 2025 has discovered three months is a long time in international rugby.\n\nIn August, the Wallabies were riding a wave of confidence and public goodwill after producing a 38-22 upset victory over world champion South Africa at Johannesburg's Ellis Park.\n\nIt was the Wallabies's first win against the Springboks at the imposing venue since 1963.\n\nAdding to the magnitude of the achievement was the remarkable fightback they launched from 22-0 down on the scoreboard to stun not just the Springboks, but the typically parochial crowd in attendance.\n\nWhile the victory shouldn't be compared to World Cup triumphs of 1991 and 1999, nor the Grand Slam in 1984 and the Bledisloe Cup series win two years later, it deserved to go down in Wallabies folklore.\n\nThe Wallabies had reason to celebrate their win over the Springboks in August. (Getty Images: Sydney Seshibedi)\n\nAmid suggestions Australian rugby had turned the corner, however, the positive vibes didn't last for long.\n\nThe Wallabies lost eight of their next 10 Tests, including four on the trot during their spring tour, which wrapped up on Sunday morning AEDT with a 48-33 defeat to France.\n\nThe 2025 season will go down as the first in which the Wallabies lost 10 Tests in a calendar year, while not since 1958 have they gone winless on a European tour consisting of at least four internationals.\n\nWallabies reach historic lows The Wallabies lose a 10th Test in a calendar year for the first time, as France proves too strong in Saint-Denis.\n\nIt would be easy to ask where it went wrong, but such a question ignores the fact the warning signs have been present since Joe Schmidt took over as coach in 2024.\n\nThe loss to France illustrated some of the deficiencies in the Wallabies's game under Schmidt.\n\nAlthough the tourists showed admirable spirit to play through to full-time, they failed to produce an 80-minute effort, with lapses of concentration costing them possession and territory at crucial moments during the match.\n\nSeveral entries inside the French 22 were squandered, while poor discipline again contributed to their downfall.\n\nAfter conceding only three penalties in the first half, the Wallabies coughed up 13 by the time the final whistle was blown, with a yellow card (Tom Hooper) also featuring on their rap sheet.\n\nDepth in world-class talent is another issue, as Schmidt highlighted after last weekend's 46-19 defeat to Ireland in Dublin.\n\nMax Jorgensen's brilliant second-half try showed his skill is the equal of star French winger Louis Bielle-Biarrey, and Fraser McReight proved once more he is among the best openside flankers in international rugby.\n\nBut the Wallabies were found wanting in certain positional match-ups and their options at fly half remain a genuine concern.\n\nThe number 10 jersey has been swapped around throughout the year, with Tane Edmed given the playmaker role against France after Carter Gordon's late withdrawal due to injury.\n\nEdmed is yet to mount a case he's a Test-standard fly half, although it's hoped his move to the ACT Brumbies — where he will be coached by Steve Larkham — will accelerate his development.\n\nTane Edmed has struggled to make his presence felt at the Test level. (Getty Images: Franco Arland)\n\nIt's pleasing to see Gordon back in rugby after his brief stint in the NRL, but the jury is out on whether he's the answer to the Wallabies's prayers.\n\nGordon will need more time to re-familiarise himself with the nuances of playing fly half and next year's Super Rugby Pacific season with the Queensland Reds will be vital to this process.\n\nTom Lynagh, Ben Donaldson, Noah Lolesio and possibly James O'Connor are set to be the other contenders to play 10 in the build-up to the 2027 World Cup, which will be hosted by Australia.\n\nThe tournament's history has shown how challenging it is to lift the Webb Ellis Cup without a world-class fly half.\n\nWallabies must stick with Schmidt\n\nThe buck stops with Schmidt when it comes to the Wallabies's performances and he needs to take the lion's share of responsibility for their results.\n\nBut sacking the New Zealander would be the wrong call.\n\nSchmidt — whose winning record with the Wallabies sits below 40 per cent — is due to hand over the reins to Reds coach Les Kiss following the Wallabies's Nations Championship Tests next July.\n\nThis arrangement was announced last April and needs to go through as planned.\n\nJoe Schmidt is set to remain Wallabies coach until mid-next year. (Getty Images: Timothy Rogers)\n\nRemoving Schmidt from his post has the potential to cause instability inside the Wallabies program, just as it did when Dave Rennie was sacked at the beginning of 2023.\n\nAnd moving Kiss into the role earlier than scheduled would disrupt the Reds's Super Rugby Pacific campaign.\n\nAustralia's four Super Rugby Pacific franchises can't afford to be compromised in any way if they are to contend for the championship.\n\nRugby Australia has publicly indicated they have no plans to move Schmidt on early. The governing body must stick firm to this approach.\n\nThis is despite the drums beating louder among sections of the media, as well as members of the Wallabies's loyal — but long-suffering — supporter base.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/make-your-own-christmas-wreath-with-flowers-from-your-garden/106006876",
    "title": "Make a Christmas wreath with flowers from your garden",
    "publish_date": "Sun, 23 Nov 2025 02:10:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "In Australia, Christmas wreaths have typically been structured around European accoutrements, but did you know it is easy to make a wreath with produce from your own garden?\n\nAustralians who want to add their own Christmas flair are embracing native flower wreaths, according to Candice Burger, a flower farmer at Bowral, in the southern highlands of NSW.\n\n\"We've moved a long way from the traditional European wreath, with holly and berries and pine,\" Ms Burger said.\n\n\"We're really slowly crossing a new frontier with Australian native wreaths taking shape here.\"\n\nBilly buttons are a native Australian flower. (ABC Illawarra: Sarah Moss)\n\nMs Burger said native plants worked well in wreaths with other garden flowers.\n\n\"If you take dried hydrangeas and put yellow billy button balls with them, then add any green foliage, you know, you've got the green and the gold,\" she said.\n\n\"Billy buttons grow beautifully in Australia, they're native and add pops of colour. The stems are quite rigid so threading them one at a time is easier.\n\n\"Then you could add in banksia, which is red for Christmas.\n\n\"I think Australians are definitely putting their own take on the wreath and a lot of wreaths are beautiful sculptures.\"\n\nCandice Burger grows vines to harvest for wreath bases. (ABC Illawarra: Sarah Moss)\n\nGarden inspiration\n\nThe wreath base is generally a circle constructed from plaited or twisted wood, which can be branches or vines from around your home.\n\n\"Use an ornamental grapevine or even wisteria,\" Ms Burger said.\n\n\"Then using jute or copper wire, bend them into any shape you want and find a dry place to hang it.\"\n\nThe base holds the wreath together and makes construction easy. (ABC Illawarra: Sarah Moss)\n\nMaking a wreath requires few tools but secateurs, wire, jute, a wreath base, floral ingredients and ribbon are a minimum.\n\n\"Use sharp secateurs for cutting stems, leaves and wire and have both thick and thin wire on hand to hold items in place,\" Ms Burger said.\n\n\"Using twine makes your wreath compostable.\"\n\nVines are twisted into circles and then tied off with twine. (ABC Illawarra: Sarah Moss)\n\nTips for making a wreath\n\nMs Burger said you should prepare to make a big mess that you can clean up later, and to just have fun and go crazy with it.\n\n\"Prepare by stripping leaves and securing flowers as a group, cut wire lengths long enough to twist tightly at the back of the wreath,\" she said.\n\n\"Wreaths can get heavy so prepare a lot of wire or twine to secure it.\"\n\nA combination of dried and fresh flowers is perfect for inserting into wreaths. (ABC Illawarra: Sarah Moss)\n\nShe suggests mixing dry and fresh ingredients, bunching and overlapping it together including fresh banksias, leaves, branches, pine cones, rosemary and lavender.\n\n\"To add textured coloured elements, mix the ingredients with dry and fresh produce, which will dry on the wreath.\n\n\"We've also made wreaths with fresh cut paper daisies, pine and lavender, even fresh hydrangeas dry on the wreath, so you can just go into your garden and cut what's there.\"\n\nCandice Burger starts making a wreath with bunches of flowers. (ABC Illawarra: Sarah Moss)\n\nAdding layers\n\nMs Burger said there were no rules while constructing your wreath.\n\n\"Let ingredients flop outside the circle, create texture by overlapping your ingredients, fill gaps and during construction hold the wreath any which way, it's a work in progress, so don't be shy.\n\n\"It's easy to work with one ingredient at a time and just keep adding and layering up.\n\nCreating a Christmas wreath is an exercise in imagination. (ABC Illawarra: Sarah Moss)\n\n\"Hard petals, like a paper daisy, work well but there are flowering shrubs and trees that have interesting seed pods, and you can include those.\n\n\"If you've got a fruiting tree like an ornamental cherry, that's fun to do, so is dehydrating fruit,\" she said.\n\nTips include following the circle base and looking for spaces in the wood from behind.\n\nHold the stems tightly, and using the wire, wind them around the wreath.\n\n\"Don't worry, you can keep adding to the wreath or finish quite minimally, there are no rules,\" Ms Burger said.\n\nFinishing off\n\nAdd ribbons to your wreath for pops of colour and texture. (ABC Illawarra: Sarah Moss)\n\nMs Burger suggests waiting until you have finished to tidy up the back, add bows and ribbons and test it in place.\n\n\"Use beautiful vintage ribbon, wind that in and make it your own personality,\" she said.\n\n\"Wind stems into place so they're not sticking out, you don't want to see them; then twist the wire to finish it off.\n\n\"Don't secure strands and cut until you know you've finished,\" she said.\n\nAlternately, you don't need to cut the wire off, you can just go around keeping the tension quite tight.\n\nCandice Burger with a Christmas wreath she made. (ABC Illawarra: Sarah Moss)\n\n\"Then hang it and step back from it, don't be shy to move things about,\" Ms Burger said.\n\n\"There's so many things you can find in your garden, you can prep all year for it, or you can go out that day and harvest from your garden.\n\n\"You'll be surprised by how beautiful you can make a wreath.\"\n\nCandice Burger recommends using fresh and dried flowers in Christmas wreaths. (ABC Illawarra: Sarah Moss)",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/f1-live-las-vegas-grand-prix-oscar-piastri-lando-norris/105995102",
    "title": "Live: Piastri hoping to hit the jackpot in Vegas with F1 title hopes at stake",
    "publish_date": "Sun, 23 Nov 2025 02:03:39 +0000",
    "category": "sports",
    "authors": [
      "Michael Doyle"
    ],
    "text": "Oscar Piastri's Formula 1 title hopes could be critically damaged in Las Vegas, as the Australian starts fifth on the grid, with championship leader Lando Norris on pole.\n\nPiastri enters Sunday's grand prix with a 24-point deficit to Norris, having not finished ahead of his teammate in any race since August.\n\nFollow all the action of the Formula 1 Las Vegas Grand Prix on the live blog below.\n\nKey Events Lando Norris on pole after a terrific qualifying session 8 minutes ago STARTING GRID: F1 Las Vegas Grand Prix 15 minutes ago What time does the F1 Las Vegas Grand Prix start? 19 minutes ago Show all key events Lando Norris on pole after a terrific qualifying session M By Michael Doyle Lando Norris was simply brilliant in wet conditions yesterday. He stormed to pole position with a breathtaking performance. Oscar Piastri could not nail his final lap, and will start today's grand prix from fifth. Catch up on yesterday's action by tapping the link below. Piastri to start fifth in Las Vegas as Norris claims pole STARTING GRID: F1 Las Vegas Grand Prix M By Michael Doyle What time does the F1 Las Vegas Grand Prix start? M By Michael Doyle Here is when the race will begin in each of Australia's states and territories: 3pm AEDT: NSW, ACT, Vic, Tas\n\n2:30pm ACDT: South Australia\n\n2pm AEST: Queensland\n\n1:30pm ACST: Northern Territory\n\n12pm AWST: Western Australia Welcome to the ABC Sport live blog M By Michael Doyle Hello Australia. Welcome back to ABC Sport's live digital coverage of the 2025 Formula 1 championship season. This afternoon, Formula 1 races on the famous Las Vegas Strip. This is round 22 of 24, with races in Qatar and Abu Dhabi to end the season. Australian Oscar Piastri is second in the drivers' championship, 24 points adrift of his teammate Lando Norris. Join the conversation, and let us know your thoughts on all things F1, in the comment section.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/storm-causes-widespread-damage-at-port-pirie/106042166",
    "title": "Woman's near miss with ceiling collapse as storm causes severe damage at Port Pirie",
    "publish_date": "Sun, 23 Nov 2025 01:46:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Thousands of residents are facing outages in the South Australian town of Port Pirie after a severe thunderstorm and hail destroyed roofs as well as bringing down trees and powerlines.\n\nThe State Emergency Services (SES) said they received 170 calls for help in a 12-hour period after wind gusts of 119 kilometres per hour were recorded in the town after 8pm on Saturday night.\n\nSA Power Networks external affairs manager Cecilia Schutz told ABC Radio Adelaide a strong and short storm cell caused significant damage, bringing down up to 50 power lines in and around Port Pirie.\n\n\"The combination of a lot of damage and difficulty accessing sites is going to mean that customers in Port Pirie are likely to have an extended outage, I would expect that most of the customers who are out are going to be out beyond today,\" Ms Schutz said.\n\nLarge trees brought down power lines at Port Pirie on Saturday. (Supplied: SA Power Networks)\n\nPort Pirie resident Angela Lewis said her ceiling almost fell on her when she went to inspect the damage overnight.\n\n\"My hubby went out with a torch because all the power went out and he could hear water running and he looked up … and it was coming through the ceiling all round the light fittings,\" Ms Lewis said.\n\n\"We went out and we saw all in our back room was in ankle deep water.\n\n\"I was still trying to take some photos, luckily I took a step back to get a long shot and the ceiling collapsed so it just missed me. It missed me by about a foot.\"\n\nWater leaked through Angela Lewis's home after a severe storm. (Supplied: Angela Lewis)\n\nMs Lewis said her kitchen, dining room, an entertaining room and a shed were destroyed in the storm, which happened within \"10, 15 minutes\".\n\n\"All the back section of our house is unusable,\" she said.\n\n\"The wind was that hard it took the paint off my outdoor setting … we went out this morning to check the damage we had white flecks everywhere.\"\n\nAngela Lewis says her shed was also destroyed in the storm. (Supplied: Angela Lewis)\n\nShe said the damage was extensive around Port Pirie.\n\n\"Emergency services have closed off the street because there's trees down in our street,\" she said.\n\n\"The hail was unbelievable … my husband walking into it, it was up to his ankles.\"\n\nHail reported around Port Pirie during a severe thunderstorm on Saturday night. (Supplied: Michelle Waters)\n\nSES state duty officer Ian Bonython said they had requested support from their metropolitan volunteers as well as from the Country and Metropolitan Fire Services as the calls for assistance overnight poured in.\n\n\"The warning from the Bureau of Meteorology did say it was going to be strong winds and damaging winds so we were expecting it, but not as heavy and not as many taskings as what we did receive,\" Mr Bonython said.\n\n\"The majority of the taskings we attended to last night were wind-related so loose roofing, tree branches and the SA Power Networks were attending to powerlines down.\n\n\"We also had water-related tasks where water was entering through the ceilings and rising up in people's back and front yards.\"\n\nPort Pirie residents experienced hail during a severe storm on Saturday night. (Supplied: Shamus Hawthorn)\n\nBureau of Meteorology meteorologist Jenny Horvat said thunderstorms moved from west to east across South Australia on Saturday but temperatures across the state would warm up on Sunday.\n\n\"We did also see some severe thunderstorms around the Port Pirie area last night,\" Ms Horvat said.\n\n\"It is spring, we do expect to see these dynamic troughs and lows moving across the state at this time of year.\"\n\nShe said the heaviest rainfall was around the Adelaide metropolitan area, receiving about 20 to 40 millimetres overnight.\n\n\"West Terrace picked up 25mm of rain — that's been our wettest day since July here in the city, and for November we haven't seen rainfall in that range for a couple of years there.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/treasury-should-take-on-oligopolies-policy-institute-australia/106040652",
    "title": "Treasury should take on Australia's oligopolies, new think tank says",
    "publish_date": "Sun, 23 Nov 2025 00:55:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's time to beef up the Department of Treasury in Canberra.\n\nA new public policy think tank has called for Treasury to become the driving force behind a new national program to reinvigorate Australia's economy.\n\nPolicy Institute Australia (PIA) says Australia desperately needs a shot of micro-economic reform to reinvigorate competition and unleash a wave of productivity growth.\n\nPM won't force break up of supermarket duopoly Prime Minister Anthony Albanese says Coles and Woolworths \"clearly have excessive market power\", but he rejects any suggestion of introducing divestiture powers.\n\nIt says it's time to replicate the National Competition Policy program that began in 1995, in response to the Hilmer Report in 1993, which catalysed Australia's subsequent productivity boom.\n\n\"A serious bout of pro-competition reform helped launch Australia out of its economic malaise in the 1970s and 1980s when the government launched the National Competition Policy (NCP) in 1995,\" it says.\n\n\"Though the Hilmer reforms are often thought of as \"big bang,\" in fact the reform process took 10 years.\n\n\"Policy Institute Australia believes a commitment of $20 billion in funding over a 10-year reform period ($2 billion per annum) would be consistent with the commitment to the 1995 NCP effort,\" it says.\n\nWhat is Policy Institute Australia?\n\nPolicy Institute Australia (PIA) is a new think tank.\n\nIt was established earlier this year with seed funding from investment banker John Wylie and his wife, Myriam Boisbouvier-Wylie.\n\nCompetition watchdog to get a boost in powers Australia's competition watchdog, the ACCC, will be given far stronger powers to prevent companies making repeated under-the-radar acquisitions that could harm competition and consumers.\n\nIt released its first report last week.\n\nPIA says it wants to bring fresh ideas about how to address Australia's big economic challenges, using market-based solutions where appropriate, while recognising the role governments play in market economies.\n\nIts board members include John Wylie, Professor Glyn Davis, former Productivity Commission chair Peter Harris, News Corp Australia journalist Paul Kelly, Jenn Morris, and former ABC news director Kate Torney.\n\n\"We believe in the long-term benefits of capitalism, free enterprise and a well-functioning market economy,\" its website says. \"We recognise that capitalism can and does overshoot on occasion, and can lag in its ability to appropriately and fairly manage externalities and systemic risk. \"We believe that there is an important role for governments in regulating markets that can and should occur, without unnecessarily impeding economic growth and investment. \"We believe there can be a role for government investment or intervention in markets to help create new industries, address market failure, or crowd in private sector investment – but that government investment should not be a first or default option.\"\n\nPIA says this is the first report in a planned series.\n\nAfter identifying the reasons for the lack of competition in major areas of Australia's economy, and the causes of our poor productivity performance, it plans to use forthcoming papers to suggest solutions for big problems.\n\nIt says Australia enjoyed a burst of productivity growth in the late 1990s and early 2000s during the era of National Competition Policy.\n\nBut in the 20 years since, Australia's economy has again become riddled with issues with declining competition and deteriorating productivity.\n\nIt says key indicators show what that means.\n\nIndustry concentration worsens\n\nFirst, industry concentration has been increasing in Australia in the 21st century.\n\nIn banking, supermarkets, private health insurance and iron ore mining, the top four players control between 70 per cent and 90 per cent of the market.\n\nIt says the average market share of the top four firms across all industries in the economy has increased from about 41 per cent in 2001-02 to about 43 per cent in 2018-19.\n\nThe four major banks together hold about 72 per cent of banking system assets.\n\nIn private health, Medibank and Bupa, HCF, nib and HBF hold 82 per cent of the market, with Medibank and Bupa accounting for more than half.\n\nIn general insurance, IAG, Suncorp, Allianz and QBE control around three quarters of the home and motor insurance market.\n\nIn the retail energy market, AGL, Origin and EnergyAustralia serve 60 per cent of electricity customers and about 80 per cent of gas customers.\n\nFewer new firms, older firms sticking around\n\nSecond, it says Australia has seen a falling rate of firm entry and exit in the 21st century.\n\nIt says the entry of new firms into the economy, and the exit of failing firms, is a key marker of dynamism. That's because new firms bring new ideas and new energy, and lessons learned from business failures can sprout future success.\n\nBut with fewer challengers starting up and fewer under-performers exiting, incumbent firms are likely to stay at the top.\n\nLabour mobility keeps declining\n\nThird, it says labour mobility has been declining for 40 years.\n\n\"More competing firms means more options for workers about where to work,\" the report says.\n\n\"How often workers choose to switch jobs can therefore reflect how much competition there is across the economy.\n\n\"In Australia, more and more workers have been choosing to stay in their current job, rather than find a new one, with labour mobility declining over more than four decades.\"\n\nThe bottom line — competition is on the decline\n\nOverall, it says measuring competition is tricky, but the pattern in the available evidence is consistent.\n\nThe holiday is over If Australia is to keep growing national income as the terms of trade decline it needs a big increase in both infrastructure and operational capital investment.\n\n\"Across 12 indicators that are commonly used as proxy measures for competitive conditions, all the metrics show that Australian competition is on the decline,\" it says.\n\n\"The pace of change is not dramatic, but it seems persistent.\n\n\"If this decline continues, the risk rises that Australians will miss out on the benefits of competition — higher productivity, greater affordability, more choice of what to buy or where to work, high-quality products, and more innovation,\" it says.\n\nThe ultimate performance metric\n\nIt says the most direct measure of poor competition in an industry relates to pricing power, which is measured by tracking \"markups\".\n\nAnd the evidence of markups is going the wrong way.\n\n\"A markup is the difference between the sale price of a product and how much it cost for the firm to produce or acquire that product,\" PIA's report says. \"It is literally a ‘mark up’ — the amount a firm adds on top of cost to set the final price.\"\n\nIt says a paper released by Treasury in 2023 found that, on average, firms had increased their markups by about 5 per cent between 2003 and 2017, suggesting that competition across the economy had weakened over that period.\n\nHow electricity became a political weapon A decade and a half after an energy company CEO outlined his greatest fears for Australia's economic future — no carbon price — the nation again appears set for a renewed battle over climate policy and power generation.\n\nIt says Treasury followed that up with another paper in August, which estimated the economic impact of that fall in competition.\n\nIt asked the question: if the economy had the same level of competition in 2017 as it did in 2003 (measured by markups and other measures), what would productivity growth have been?\n\n\"The authors found that if the economy had retained the level of competition in 2017 as it had in 2003, productivity growth would have been up to 3 per cent higher, worth about $3,000 per Australian,\" it says.\n\nHow to break the impasse\n\nWhat to do about it?\n\nPIA says Australia has become far too reliant on the competition regulator to try to manage the problem of deteriorating competition, and the ACCC can't grow a more competitive Australia on its own.\n\nIt says we need to break the policy impasse.\n\n\"The Commonwealth should empower Treasury as the national steward of pro-competition policy reform, building on the Competition Taskforce, including a mandate and resources to design and implement a bold pro-competition reform agenda over a 10-year time frame,\" it argues. \"In public policy, we have become heavily reliant on the competition regulator, the ACCC, on all matters to do with competition. \"But the ACCC’s mandate is to slow or stop the substantial lessening of competition, not to proactively identify problematic sectors where competition has declined and advance solutions to encourage more competition. \"The ACCC alone cannot grow a more competitive Australia. \"We need a leader of action in policy to drive increased competition, or coordinate where necessary, to spark productivity and better outcomes for all Australians. \"This should be Treasury,\" it says.\n\nIt says to support a revitalised role for Treasury, we need to uplift the current National Competition Policy in scope and effort, creating \"National Competition Policy 2.0\".\n\nAnd that should include a specific focus on how to remove from industry incumbents the power to set rules that determine who can compete with them, or impose unnecessary costs to impede competition.\n\n\"In its last term, the Commonwealth government led the states and territories in laying the foundations for a revitalised NCP,\" it said.\n\n\"Since the government’s 2025 re-election, it has laid out the case and its own ambition to lead a much-needed program of reform to boost Australia’s economic performance.\n\n\"Now is the time for action,\" it says.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/two-day-ashes-test-could-cost-cricket-australia-millions/106041938",
    "title": "Two-day Ashes Test could cost Cricket Australia millions",
    "publish_date": "Sun, 23 Nov 2025 00:50:45 +0000",
    "category": "sports",
    "authors": [],
    "text": "Just weeks after forecasting a record year ahead, Cricket Australia (CA) is facing a multi-million-dollar drain after the rapid-fire two-day Ashes opener.\n\nA combination of Travis Head's all-time Ashes knock and Bazball's cavalier approach to batting led to the first game of the blockbuster series in Perth ending late on day two.\n\nCA is headed for an estimated loss of more than $3 million from ticket revenue for days three and four.\n\nA record 101,514 attended the Test — 51,531 on Friday, then 49,983 — to surpass the record set of 96,463 in Perth last year when India won in four days.\n\nDay three was also almost sold out.\n\nSpeaking before play on Saturday, when Australia's first innings hadn't even finished, CA chief executive Todd Green half-joked he was worried about the Test not making it to day three.\n\n\"It's difficult for a number of different groups,\" Greenberg told SEN when discussing the financial impact of a match finishing early.\n\n\"Our broadcasters first of all.\n\n\"Certainly us, on ticket sales and our partners and sponsors.\n\n\"There's a big economic impact on this series.\"\n\nThousands of England fans had bought tickets for the third day of the first Ashes Test in Perth. (AAP: Dave Hunt)\n\nAt the annual general meeting last month, CA announced a loss of $11.3 million and took strong criticism from Cricket Victoria chair Ross Hepburn for the financial performance.\n\nCA defends $11.3m loss Cricket Australia insists record numbers are ahead despite facing criticism after losing more than $11 million in a summer that included a five-Test home series against India.\n\nThe loss took in a summer that included a five-Test tour from goliath India.\n\n\"In a normal scheduling, you'd have the white-ball cricket as part of that [Test] tour, but that's being played in this financial year,\" CA chair Mike Baird said after the meeting in October.\n\n\"If they were in the same financial year, you would have seen a different position.\n\n\"We're in a position where it's a significant uplift, an over-$20 million improvement.\n\nLoading...\n\n\"Hang on to your hats because next year we are going to have a record year in cricket.\n\n\"You're going to see the most attendance, the most viewership, the most sponsorship.\"\n\nFoxtel said their broadcast on Friday was the most-watched first day of a first Test in its history\n\nThe Seven Network also reported strong ratings for coverage on day one.\n\nAAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/pelvic-pain-devastates-lives-amid-vast-research-gaps/106033730",
    "title": "Pelvic pain devastates lives amid vast research gaps",
    "publish_date": "Sun, 23 Nov 2025 00:31:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Jaali Barton was working her dream job running snorkelling tours at the Cocos (Keeling) Islands, when sudden debilitating pelvic pain left her curled up on the beach, unable to walk.\n\nBouts of pain had become more and more frequent for Ms Barton over the past decade, beginning at age 14.\n\n\"It is the worst pain you can imagine,\" she said.\n\n\"It feels like your insides are being carved out with a knife. It feels like everything is just exploding inside you.\"\n\nMs Barton was forced to come home to mainland Australia to seek treatment, but even that has proved difficult.\n\nShortfalls in funding and focus on the condition have left women like Ms Barton in prolonged pain, according to advocates.\n\nJaali Barton says her chronic pelvic pain forced her to leave her dream job as a tour guide on the Cocos (Keeling) Islands. (Supplied: Jaali Barton)\n\nUntreatable pain\n\nTwo years on, the 24-year-old remains at home with her parents in the small coastal town of Kalbarri in Western Australia.\n\nHer pain has only worsened.\n\nMs Barton loves days at the beach, travelling, doing yoga, working at her job as an education assistant and catching up with friends.\n\nBut her pelvic pain now flares almost every day and can last from hours to several days, trapping her inside her bedroom.\n\nThe walls are lined with beach photos and shells, but it remains a world apart from the life she misses.\n\n\"It's taken so much from me. All the things that I find joy in are now really difficult,\" Ms Barton explained.\n\nMs Barton's pain affects her pelvis and shoots down her legs, and is often coupled with head pain and fatigue.\n\nJaali Barton says it is hard to make plans when your body is unpredictable. (ABC Midwest & Wheatbelt: Brianna Melville)\n\nShe said it could not be eased by painkillers.\n\nMs Barton said her symptoms had caused her to frequently miss work, cancel plans with friends and give up travelling and exercise.\n\nAs a result, Ms Barton said it is extremely difficult to feel positive about her future.\n\n\"You just think, 'what's a life of being in pain every day,'\" she said.\n\n\"It's living day by day, making no plans because your body is just unpredictable.\n\nJaali Barton says she feels alone in the fight with her own body. (ABC Midwest & Wheatbelt: Brianna Melville)\n\nLong road to diagnosis\n\nMs Barton said that over the years that she has had symptoms, her mum would drive her the two hours to the Geraldton emergency department as often as twice a month.\n\nHowever, once appendicitis was ruled out, she says doctors were left unsure about how to treat her.\n\n“Most doctors, nurses, no one actually knows anything about it,” she said.\n\n“You’re kind of left in the dark, on your own.”\n\nAfter 10 years of seeking help, Ms Barton finally had a diagnostic surgery earlier this year, with a biopsy taken of an internal lesion.\n\nThe biopsy pointed to endosalpingiosis, but other doctors have speculated that she also has endometriosis.\n\nJaali Barton in hospital. (Supplied: Jaali Barton)\n\nBoth conditions involve reproductive organ tissue growing outside of where it belongs, often causing pain and inflammation.\n\nShe says she joined an eight-month wait-list for an appointment with a specialist to discuss the results of her surgery.\n\nHowever, worsening pain now has her fearing that the lesions are spreading, and she persistently calls asking for her appointment to be moved forward.\n\nShe said enlisting the help of a naturopath and a pelvic physio has provided her some comfort this year, alongside a community of women she has connected with online.\n\n“I get so many messages from young girls thinking they have the same thing, they have endo, they have the same symptoms,\" she said.\n\n“If sharing this story is going to help anyone, then that’s going to help me.”\n\nResearch gaps remain\n\nThe founder and chair of the Pelvic Pain Foundation of Australia, Susan Evans, says while patients with pelvic pain often expect to be \"fixed\" by doctors, major shortfalls in research have limited what they can do.\n\nSusan Evans is a gynaecologist, laparoscopic surgeon and pain physician who has authored a book about endometriosis and pelvic pain. (Supplied: Dr Susan Evans)\n\n“There has been so little research in this space for generations,\" Dr Evans said.\n\n“A lot of the data that we expect to be available just isn’t available.”\n\nAs a result, Dr Evans says “a lot of catch-up” is required in research to fully understand the prevalence of pelvic pain and investigate its causes, which will require serious funding.\n\nHowever, she says it is important for people with pelvic pain to learn about it themselves and build a team of health professionals to address their specific needs.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/anthony-albanese-wa-visit-saw-no-christmas-presents/106033346",
    "title": "'Albo's Greatest Hits' as PM's western vacation yields little for WA",
    "publish_date": "Sun, 23 Nov 2025 00:16:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "When the prime minister and his entourage rolled into town on Monday, Premier Roger Cook might have been hoping Anthony Albanese had packed him an early Christmas present.\n\nThe PM's visit had all the hallmarks of the kind of obligatory trips made all across the country this time of year.\n\nWhether they liked it or not, Anthony Albanese loaded his kids (ministers) into the car for a journey west to visit some distant relatives (their WA counterparts).\n\nThere was time for holiday happy snaps along the Busselton foreshore, dinner at a nearby brewery and a morning coffee in Bunbury.\n\nLoading Instagram content\n\nBut the prime minister didn't have anything on Cook's wish list to give him.\n\nInstead, it was two days of 'Albo's Greatest Hits' on replay as the PM made few announcements but found some good news to stand in front of.\n\nHealth concerns\n\nAt the top of the wish list for Cook this Christmas, and for every other state and territory leader, is more money for health.\n\nHospitals across the country are struggling to keep up with plenty of pressures. It is up to the states and territories, who run public hospitals, to manage that, with help from federal funds.\n\nStates demand hospitals come before federal bottom line State and territory leaders hold an emergency meeting over public hospital funding, declaring they cannot sacrifice hospital care to bolster the Commonwealth's finances.\n\nAlbanese had promised to help states and territories increase the Commonwealth's share of that funding two years ago, but negotiations have stalled.\n\nHe told them in September to rein in spending, saying the Commonwealth was happy to increase its share, but with a cap on the total growth in its contribution.\n\n\"States cannot cut public hospital activity to suit the federal government's bottom line,\" was the response from Tasmanian Premier, on behalf of his counterparts, on Wednesday.\n\nThey argue the reason they're increasing hospital spending is because the Commonwealth has dropped the ball in areas like aged care and bulk billing.\n\n\"We've already seen the Albanese Labor government provide significant support for urgent care clinics which takes pressure off the hospitals, so I want to give them a bouquet in relation to that,\" Cook said in August.\n\n\"But I'll also give them a brick. They need to do better on aged care.\"\n\nDespite missing out on extra money, or even a hat for joining the Prime Minister aboard the USS Vermont on Wednesday, there was no \"brick\" for the PM when he was standing behind Cook on Wednesday.\n\nRoger Cook was noticeably hat-less when he joined the prime minister aboard the USS Vermont on Wednesday. (ABC News: Keane Bourke)\n\nBut Cook rejected the suggestion he'd lost his nerve.\n\n\"Not at all … we'll continue to make sure that we work with the Commonwealth to improve the full range of care opportunities across people's life journey,\" he told reporters.\n\n\"Those conversations are ongoing. I met with my fellow premiers today. We are continuing to push forward with that conversation.\"\n\nFor his part, Albanese did not seem to be in any great rush to get the deal done before the end of the year, saying: \"We'll wait and see\".\n\n\"So the states have a big incentive on engaging constructively, because otherwise it rolls over for another year.\"\n\nReinforcing achievements\n\nWhen people (especially those who you want to vote for you) can't get the care they need though, they usually don't care about the complexities of federal-state relations — they just want it fixed.\n\nLuckily for both Cook and Albanese, having been resoundingly re-elected this year, they've got some time to rebuild goodwill with voters in other areas.\n\nThat's probably part of the reason Albanese's two major media events were about two major achievements.\n\nOn Tuesday, he visited the future site of a gallium processing plant.\n\nCentral to a $13 billion critical minerals deal he struck with US President Donald Trump last month, it could help diversify WA's iron-ore reliant mining industry.\n\nAnthony Albanese says the gallium project is happening \"right here, right now\". (ABC News: Pip Waller)\n\nThe following morning, he was on Garden Island to meet Australian submariners and defence contractors helping maintain a US submarine.\n\nIt's the same type of sub Australia is expecting to get at least three of, as soon as the early 2030s under the AUKUS defence pact with the United States and United Kingdom.\n\nThis round of maintenance is a big deal because it's the first time this level of support has been provided to a US submarine outside of a US base.\n\nUnresolved issues\n\nBut even those wins come with some unresolved issues for a prime minister still buoyed by his election win in May.\n\nAnd among the myriad of risks that come with AUKUS — including concerns over whether it will even happen — locals who stand to benefit from it aren't all sold just yet.\n\nBusinesses urge parties to 'work together' The next few days are viewed as critical to landing a deal on the proposed reforms to update the EPBC Act, amid hopes the Liberals will be more motivated to bolster their environmental credentials after ditching net zero.\n\nThere are still lingering concerns about there being enough houses nearby, and the ability for already congested roads to keep up with an influx of submariners and workers.\n\nAlso of concern is whether the federal government will be able to pass its latest attempt at overhauling the nation's environment laws, with neither the Greens nor Coalition pledging their support just yet.\n\nBoth government and industry want to get those changes through, sooner rather than later, to help speed up approvals for critical minerals and renewables projects.\n\nCook helped sink the last attempt at rewriting the laws. He almost certainly won't keep quiet if the new version stops him getting Christmas cards from the state's mining industry leaders.\n\nHe's only got one sitting week left to worry about — then it might be up to him to offer a present to West Australians when the government hands down its budget update before Christmas.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/svarc-plug-ruby-dazzles-as-lions-blitz-ends-blues/106042056",
    "title": "Svarc plug: Ruby dazzles as Lions' blitz ends Blues",
    "publish_date": "Sat, 22 Nov 2025 23:59:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ruby Svarc has dazzled with a career-best haul as the Brisbane Lions hit top gear to trounce Carlton and set up a third-straight AFLW grand-final clash with North Melbourne.\n\nSvarc, who had just 17 goals in her previous 55 games, slotted four to power a third-quarter blitz in Saturday night's 10.7 (67) to 5.2 (32) victory in front of 6,511 fans in Brisbane.\n\nThe hosts kicked five goals in 11 minutes to break the contest open after half-time, with Dakota Davidson adding a highlight reel effort from the pocket in a thrilling six-goal third term.\n\n\"They were awesome … haven't had many six-goal quarters in our history and it was on the back of the dam wall bursting … it was a matter of time,\" Lions coach Craig Starcevich said.\n\nHe said you could have \"named your odds\" of Svarc kicking four goals in a preliminary final when she arrived at the club as a rough, athletic diamond.\n\nLoading Instagram content\n\n\"No [I didn't expect it] is the short answer, although that's a bit harsh on Ruby because she's one of the hardest workers,\" he said.\n\n\"She's slowly, slowly got better and better … that was amazing.\"\n\nBrisbane's ninth-straight win, after a week of spicy back-and-forth banter between the sides, reversed the result of their round-three meeting.\n\nIt will be the two-time premiers' fourth-straight grand final appearance and seventh in 10 seasons.\n\nAnd it ensured the Lions and Kangaroos, on a 26-game unbeaten run, will meet again in a third-straight decider next Saturday after the defending champions survived a scare to beat Melbourne by 10 points.\n\n\"They've got their amazing run and we're also on a bit of a run,\" Starcevich said.\n\n\"I'm looking forward to it because the type of footy we've been playing can challenge anyone.\"\n\nThe Lions hammered away in the first quarter but were sloppy and had little to show for their 12 inside-50 entries in a goalless term.\n\nThe hosts remained frantic in the second term and it was Svarc, who had never kicked more than two goals in a game, who settled to take the spoils.\n\nFirst she scooped up a loose ball, raced clear of the contest and, after giving and receiving a handball, kicked a goal on the run.\n\nKangaroos star on being challenged North Melbourne will play in its third consecutive AFLW grand final after weathering an almighty scare from Melbourne.\n\nThen she regathered from her own smothered shot on goal to slot a second major in quick time.\n\nTaylor Smith soccered another through for Brisbane, before Poppy Sholz's second from a free kick made it a five-point margin at the main break.\n\nSvarc wasn't done, a banana kick from the pocket delivering her third before she found more open space and hit Courtney Hodder on the chest.\n\nHodder converted for a 17-point lead and then it was party time when Dakota Davidson tapped towards the boundary and somehow finessed the tight angle for another brilliant goal.\n\nBlues defender Harriet Cordner was pinged for a deliberate rushed behind and Ellie Hampson snuck the goal through, before Davidson's second — a clean strike from 45 metres — made it five majors in 11 minutes.\n\nSophie McKay dragged one back for the Blues, but the sweet-striking Hampson had the reply with the final act of an exhilarating quarter.\n\nSvarc then completed the dream night, pouncing on a loose ball to swing through her fourth goal and all-but end the contest early in the fourth term.\n\nBlues coach Mathew Buck said the Lions' contested work proved too tough to handle, tipping his cap to the competition's standout sides.\n\n\"We got found out a little bit tonight but overall very proud of what we achieved this year,\" he said.\n\n\"Two teams in there that run great programs and their coaches are hard to coach against.\n\n\"The fact they're in there [the final again] is great, fantastic for the competition … they're exactly what we want to be.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/alice-oloughlin-north-melbourne-win-over-melbourne-aflw/106041940",
    "title": "'Stressful the whole game': Kangaroos star on being challenged by Dees",
    "publish_date": "Sat, 22 Nov 2025 23:09:54 +0000",
    "category": "sports",
    "authors": [],
    "text": "In Saturday's first preliminary final, North Melbourne found themselves in a position they hadn't been in for a while.\n\nThe reigning premiers were down at every change against rivals Melbourne. The last time they trailed at three-quarter time was back in 2023, a game they lost to the same opposition.\n\nThen skipper Jasmine Garner took control.\n\nShe had 12 disposals, four clearances, four score involvements and the last goal of the game, just in the final term, which helped propel North into its third consecutive grand final with a slim 10-point victory.\n\nYet it was a small moment from Kangaroos forward Alice O'Loughlin that caught ABC commentator Chyloe Kurdas's eye.\n\n\"[North were] under so much pressure, probably uncharacteristic for North Melbourne, but there was a moment in that fourth quarter that probably turned the game for me,\" Kurdas said.\n\nNorth down Demons to secure grand final berth After surviving some nervous moments, North Melbourne have progressed to another grand final courtesy of a narrow prelim win over the Demons.\n\nThe Kangaroos were down by a goal when O'Loughlin was attacking the ball at the top of their inside 50.\n\nWhile under pressure, she was clean in getting a small handball off to Blaithin Bogue, who kicked the first goal of the fourth quarter to spark the Kangaroos' comeback.\n\n\"That just changed the scoreboard, and it changed the momentum in the game,\" Kurdas said.\n\nO'Loughlin laughed when she heard this.\n\n\"I get a bit of stick, always have to give the first gives, the first hands. Croc (North coach Darren Crocker) [is] always nailing into me on that one,\" she said.\n\n\"So I … straight away went to see him, and was like, 'What do you got to say now?'\"\n\nShe added that it was Bogue, however, who had a good run.\n\n\"I mean, she's a great player and we're so lucky to have her,\" she said.\n\nIt was the Kangaroos' 26th consecutive win, a record they had to fight tooth and nail to keep alive against the Demons, who went into the game as heavy underdogs.\n\nJasmine Garner helped lift her side to a preliminary final win against the Demons. (Getty: Michael Willson/AFL Photos)\n\n\"Look, it was a stressful whole game, to be honest. Melbourne really brought the pressure,\" O'Loughlin said.\n\n\"They're such a quality outfit\".\n\nThe difference, however, was in North's legs.\n\n\"Credit to our fitness staff,\" she said.\n\n\"We really have a lot of faith in these moments, in these tough games, that all of us can run them out to the last siren.\n\n\"So we just have confidence in that.\"\n\nIt is something that will come in handy now the Kangaroos are set to face Brisbane in the grand final after the Lions defeated Carlton in the second preliminary final by a comprehensive 35 points.\n\nFor the third decider in a row, the pair will battle for the flag; each side with one premiership apiece in the now trilogy.\n\nEach side is also known for their fitness and dominance, especially for Brisbane in finals.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/ashes-england-hammered-ben-stokes-batting/106041156",
    "title": "England's brainless Perth capitulation only the beginning",
    "publish_date": "Sat, 22 Nov 2025 22:17:14 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ben Stokes probably summed it up best.\n\nThe unflappable hero of Headingley, England's talisman and chief destroyer just 24 hours prior, admitted to being \"a little bit shell-shocked\" after Australia, or more specifically Travis Head, wrestled Australia out of a desperately tough spot to claim a thumping first Test victory in Perth.\n\nOthers were not so kind.\n\nFormer skipper Michael Vaughan was scathing, rubbishing England's approach with the bat that resulted in two collapses in as many days and the surrendering of a powerful position midway through day two.\n\n\"It disappoints me hugely,\" Vaughan told Fox Sports.\n\n\"In 2023, the first Test match at Edgbaston, England was dominating and in the second innings Nathan Lyon got five-fa [sic] with England playing some dumb cricket. Pat Cummins saw them over the line [with the bat], Australia 1-0 up.\n\n\"Then they went to Lord's … dumb cricket, get bowled out, England 2-0 down.\n\n\"Two years later, at the first time of asking, I see a batting unit playing the exactly same way.\n\n\"Five hours ago England were dominating the game. Five hours later we're sitting here, Australia are 1-0 up.\"\n\nEngland simply could not find a way out of the mire. (Getty Images: Gareth Copley)\n\nIt's true. England was dominating, 99 runs ahead at lunch on the second day with nine wickets in hand.\n\nThe carnage of day one seemed, if not a distant memory, then at least a fever-dream that both teams had been able to put behind them — the shaking out of all those pre-Ashes nerves manifest in a ridiculous smorgasbord of accelerated gameplay.\n\nBut then, with everything seemingly in hand, a litany of atrocious shots resulted in England collapsing into an ungainly heap for the second straight innings.\n\nThe same old story, so familiar to England fans, was being written once again.\n\nEngland went from 1-65 to 6-88 in 8.2 overs and were all out with a lead of just 204. In the first innings, it was a collapse of 5-12 in just 18 balls.\n\nBut Vaughan and plenty of others were aghast at the manner of the dismissals.\n\nScott Boland took three wickets in 11 balls after lunch. (Getty Images: Paul Kane/Cricket Australia)\n\n\"We've been saying we want 'Bazball with brains' but the brains haven't arrived,\" Vaughan told the BBC.\n\n\"They're all trying to whack it to the boundary, it's so disappointing. I look back to last year and it looked like they were learning. I don't see how they can win a big series batting like that.\n\n\"I thought England had a good chance but the bowlers weren't even getting a rest; 30 overs but it wasn't even 30 overs because they were padding up, it's unacceptable.\n\n\"It's silly for us to think they'll win down under if we play like that. This match, they haven't used their tools correctly.\"\n\nBazball with brains? Perhaps that's Travball.\n\nWhile Head picked his moments and carved England's attack to all corners, England's shot selection was decried as \"substandard\" by BBC broadcasting doyen Jonathan Agnew, \"really poor\" by Justin Langer and \"inexcusable\" by Vaughan.\n\nEngland's hall of shame of brainless batting was low-lighted by three of England's supposed best on Saturday in a half-hour period that sent a collection of England's ex-players apoplectic in rage.\n\nDuring England's hideous second-day capitulation, Ollie Pope, Harry Brook and Joe Root all perished to near-identical shots.\n\nJoe Root's atrocious shot was just one of many in England's collapse. (Getty Images: Philip Brown)\n\nPope, having been in the middle for an hour and a half and having faced 56 balls, may have felt a full-blooded drive at a ball outside off stump was vindicated. Every batting coach in history would suggest his lack of footwork was not, but perhaps there can be some accommodation to a man who had looked quite sharp.\n\nHowever, for Brook to play the very same shot against the very same bowler two minutes later borders on the idiotic.\n\nFor Root, the number one-ranked Test batter in the world, to follow suit with another shot from a statuesque base, was ludicrous.\n\nStuart Broad, no stranger to stupid dismissals himself, could not hide a visible obscenity on Channel 7's coverage, with his reaction doubtlessly repeated and amplified in English living rooms throughout the early hours of the morning back home.\n\nEngland lost those three wickets of arguably their best batters in the space of five fraught deliveries as panic cascaded down the line-up like a dousing of freezing cold water would subdue a pack of overly energetic dogs.\n\nYes, the batting was woeful.\n\nBut the bowlers cannot escape scrutiny for their part in the shambles that followed.\n\nIn the space of 24 hours, England's arsenal of pace bowlers went from a world-beating quintet compared to the legendary trio of pace bowlers who terrorised Australia in the late 1950s to an embarrassed collection of club cricketers being pummelled to all parts of Perth Stadium.\n\nNever has the hammer been fashioned into the nail so swiftly.\n\nThe Barmy Army, raucously anticipating every 150km/h missile one day, were left sullen and silent as Head and Marnus Labuschagne, frankly, rendered them impotent with a blistering array of shots to all corners of the ground.\n\nDefeats like this can leave a lasting scar on the psyche of young players. (Getty Images: Gareth Copley)\n\nEngland's five-pronged attack was lethal in the first innings, averaging 141km/h on day one, the fastest data provider CricViz has recorded since it started doing so in 2006.\n\nThis attack of Jofra Archer, Mark Wood, Gus Atkinson and Brydon Carse was Fred Trueman, Frank Tyson, Brian Statham and Peter Loader reborn, with Stokes adding the same guile that Trevor Bailey blessed that fearsome 1958/59 battery with.\n\nIn Perth, Archer and Wood both hit speeds of over 150km/h and, for the first time in several generations, England was able to fight fire with fire.\n\nBut instead of loading the howitzers with gunpowder for day two, England may as well have stuffed its big barrels with sawdust, such was its effectiveness.\n\nArcher barely and briefly got up over 140km/h. Wood, too, struggled to find any rhythm. Atkinson and Carse? Simply fodder for Head's ravenous accumulation of runs.\n\nThis is not to take away anything from Head's innings — \"one of the best knocks\" according to both Stokes and Brendon McCullum — a spectacular blitzkrieg of unadulterated power and innovation that may well have caused permanent damage to England's hopes of success in this series.\n\nTravball trumped Bazball in Perth. (Getty Images: Cricket Australia/Paul Kane)\n\n\"It was an extraordinary knock,\" McCullum said.\n\n\"We've always said if someone stands up to us and produces a performance like that, you have to tip your cap.\n\n\"He knocked us off our lengths when we wanted to hold our lengths as long as we could, and we thought that was the most dangerous thing on the pitch. We weren't able to do that due to the pressure they put us under, so fair play.\"\n\nSo what now?\n\nA pink-ball Test at the humid sweat-box that is the Gabba in December is hardly conducive to a confidence-boosting stint in the middle that most of these batters require.\n\nThere is a pink-ball game scheduled for the gap between these two Tests against Australia A in Canberra.\n\nWill England take up that opportunity?\n\n\"If England don't think that's good preparation to go and play a pink-ball game, they're absolutely stupid,\" Vaughan said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nMcCullum said England would continue to follow its own path.\n\n\"There will be a lot of chatter and for us it's about making sure we don't let our confidence and camaraderie tip too low,\" he said.\n\n\"We know that at our best, we are a good cricket team.\n\n\"We have an extended time off and we have 10 to 12 days to bounce back. We've done it before. We'll believe in what we want to achieve at Brisbane.\"\n\nStokes, meanwhile, said he needed the team to \"hurt\" after that defeat.\n\n\"This is a tough one to start with, given we felt in control of the game,\" he said.\n\n\"We have four more games here. We have to let this sink in. It's hurting at the moment but we have to get our head round it and get to Brisbane. We have a long time before that game starts and put the hard graft for Brisbane.\"\n\nWhatever happens in Brisbane will make or break this series — and likely the careers of those Englishmen who have pinned all their hopes on this series to restore some honour after their previous disappointments down under.\n\nSo as England counts the cost of this shambolic defeat, it needs to know that questions over how its world-beating pace attack was so stymied and its high-class batters so comprehensively, collectively lost the plot will rumble all the way to Brisbane and probably beyond.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-23/victorian-farmer-unconventional-crops-spirits-alcohol-distilling/103563416",
    "title": "This young farmer is turning beets and red wheat into quirky spirits",
    "publish_date": "Sat, 22 Nov 2025 22:07:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ross Shaw's farm shed is brimming with glass beakers and old oak barrels.\n\nThe agronomist and sixth-generation farmer from Victoria's Gippsland region grows crops and runs livestock on his family's property.\n\nBut recently, Mr Shaw has also dabbled in distilling.\n\nAs a sixth-generation farmer, Ross Shaw did not have any background in distilling. (ABC Rural: Faith Tabalujan)\n\n\"We grow excellent grain here in Gippsland, but most of it goes into the feed market because we don't have a receival for malt or flour-grade grain,\" he said.\n\n\"I wanted to add value to our crops, so I decided to open a distillery.\"\n\nWhisky wisdom\n\nOver the past two years, Mr Shaw has dived deep into the world of whisky and spirits.\n\nHis latest projects involve two unconventional crops: red wheat and sugar beets.\n\n\"We had a crop of red wheat and thought, 'Why not turn it into vodka,'\" he said.\n\n\"We did a few trials and landed on a recipe, which produces a bottle with a pleasant graininess and honeycomb sweetness.\"\n\nEmerging red wheat heads at Ross Shaw's Victorian farm. (Supplied: Ross Shaw)\n\nMr Shaw said working with beets was like stepping back in time.\n\n\"The local town of Maffra was built on the sugar beet industry,\" he said.\n\n\"Given you can make alcohol from anything with a sugar or starch source, we took that historic crop and decided to make a sugar beet spirit.\n\n\"Flavour-wise it's quite earthy, so it'd go well in a spicy margarita or just with a bit of ginger beer and lime juice.\"\n\nSugar beets were grown in Maffra in the early 1900s. (Supplied: Maffra and District Historical Society)\n\nEarly hurdles\n\nMr Shaw said perfecting his beet spirit involved a lot of trial and error.\n\n\"It was tough to find seed, so we imported some from Europe, grew the beets and workshopped ways to get the sugar out of them,\" he said.\n\n\"We didn't have the right equipment, so [we] had to hand-harvest all the beets.\n\n\"But we've finally found a process that works.\"\n\nSugar beets can be difficult to harvest without the right equipment. (Supplied: Ross Shaw)\n\nMr Shaw said all good things, including spirits, took time.\n\n\"You need about three years to make a bottle of whisky: one year to grow the grain and then at least two years to age it,\" he said.\n\n\"You've got to be patient.\n\n\"But the clear spirits don't have to sit in a barrel or anything, so you can get them to market a lot quicker.\"\n\nSpirits Victoria Association industry development officer Sebastian Costello said distillers were increasingly exploring new ingredients.\n\n\"This new generation of craft distillers want to give people a sense of place, so you can almost taste different parts of Australia,\" he said.\n\n\"For example, I know some using rye grown in the Mallee, but people are testing out any crop that can be malted and distilled.\"\n\nDriven by 'passion'\n\nFor Mr Shaw, distilling has been the perfect challenge.\n\n\"I didn't know all the science behind it, but just took my passion and did plenty of experimenting,\" he said.\n\n\"The Australian distilling scene is quite collaborative, so now I've got friends all over the country who I can call if I get stuck.\"\n\nRoss Shaw has crafted unique spirits from red wheat and sugar beets. (ABC Rural: Faith Tabalujan)\n\nMr Shaw said his family was apprehensive about his distilling venture at first.\n\n\"But now everyone is involved, including my dad, who loves helping me malt the barley.\"\n\nSpring-sown wheat (left) and barley (right) from Ross Shaw's farm. (Supplied: Ross Shaw)\n\nMr Shaw is now hoping to grow his spirit side hustle.\n\n\"We're definitely scaling up our whisky production by adding equipment and slowly perfecting our process,\" Mr Shaw said.\n\n\"We've still got about 400 bottles each of the red wheat vodka and sugar beet spirit on the shelves.\n\n\"But we're keen to make more if the market demands it.\"\n\nAnd Australian consumers are searching for new flavours, according to Mr Costello.\n\n\"The trend is people drinking less but with more variety,\" he said.\n\n\"And they want to know the story behind each bottle.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/easy-to-say-a-lot-harder-to-do-stokes-refuses-to-blame-england-s-batters-for-perth-capitulation-20251122-p5nhme.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Won’t be changing our blueprint’: McCullum says England won’t deviate from Bazball style",
    "publish_date": "Sun, 23 Nov 2025 13:12:06 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Perth: England coach Brendon McCullum has vowed his team will not deviate from their ultra-aggressive style after “Bazball” spectacularly imploded to hand Australia a stunning victory in the first Test.\n\nAs a shell-shocked England captain Ben Stokes refused to blame his batters after the visitors became just the sixth team in Ashes history to lose inside two days, former skipper Michael Vaughan warned “you can’t be competitive without brains”.\n\nThe cynicism in which England’s ultra-aggressive style is viewed in this country was reinforced after a dramatic Saturday afternoon when Travis Head beat them at their own game.\n\nThe 405 balls England faced in Perth is their lowest tally in a Test where they have been bowled out twice since 1904 at the MCG, four years before Don Bradman was born.\n\nEngland fans back home who went to sleep at lunch with their side almost 100 ahead with nine wickets in hand would have fallen out of their beds in disbelief when they checked the scorecard in the morning to see just what had happened.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/ufc-champ-in-backstage-scuffle-20251123-p5nhpq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "UFC champ in backstage scuffle",
    "publish_date": "Sun, 23 Nov 2025 13:05:22 +1100",
    "category": "sports",
    "authors": [],
    "text": "UFC champ in backstage scuffle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/world/north-america/largest-exhibit-of-indigenous-art-ever-shown-overseas-opens-in-the-us-20251121-p5nhe0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Largest exhibit of Indigenous art ever shown overseas opens in the US",
    "publish_date": "Sun, 23 Nov 2025 13:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Warning: The following article contains names and images of Indigenous people who are deceased.\n\nWashington: The largest exhibition of Indigenous Australian art ever shown overseas is beginning to draw crowds in the US capital, weeks after the grand opening was cancelled due to the government shutdown.\n\nMany of the works now on display at the National Gallery of Art (NGA) in Washington, DC, had never previously left Australia. The Stars We Do Not See, drawn from the extensive National Gallery of Victoria (NGV) collection, comprises nearly 200 pieces by more than 130 artists.\n\nSeven Sisters Song, painted on a road sign, is one of 200 Indigenous Australian artworks on display at the National Gallery of Art. Credit: Courtesy of the National Gallery of Art, Washington\n\nThe exhibit showcases art from every corner of the continent, from Arnhem Land to the Tiwi Islands north of Darwin, South Australia’s Indulkana and the remote Punmu community 600 kilometres from Port Hedland.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/five-hours-of-brilliance-this-is-opera-at-its-biggest-boldest-and-dazzling-best-20251117-p5nfyo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When Colin Friels’ Lear soars it’s heartbreaking",
    "publish_date": "Sun, 23 Nov 2025 12:24:51 +1100",
    "category": "entertainment",
    "authors": [
      "George Palathingal",
      "Nadia Russell"
    ],
    "text": "The problem is that we’re never brought to tears by the saddest play ever penned. Carroll takes us closest, but Whyte, Conroy and, above all, Friels should plunge us into the waiting abyss. The ingredients are mostly in place. MUSIC\n\nRÜFÜS DU SOL\n\nQudos Bank Arena, November 20\n\nReviewed by KATE PRENDERGAST\n\n★★★★½ “I want to make sure everyone’s standing up,” says Tyrone Lindqvist five minutes in. The vocalist is eyeing, as meaningfully as a guy can in dark glasses, the thousands seated in the stadium’s high rises. Too right. For any able-bodied person to sit during a RÜFÜS DU SOL performance is an insult to dance music.\n\nIt was a special homecoming for the world-renowned trio, returning to the city that saw them 15 years ago release their first of five albums, with the legendary Innerbloom getting a jubilant rinse as the closer, ten years to the day since release. Even then, most of the crowd had kept to their feet, aglow with that uplifting nostalgia that is the hallmark of RÜFÜS’s lush, layered sound. Australia’s biggest electronic music export, somehow still chill and on the rise, deliver live shows that adapt and flex their studio excellence, conjuring a world in which sinews meet synths, carbon interfaces machine, sequencing pushes form. Loading They’ve crafted a sublime journey for this tour, putting up top fan favourites like On My Knees while drawing most from Inhale / Exhale (2024), an album that proves their evolution is holding true. Cresting waves of wistful bliss towards a natural high, these are songs that feel forged in the golden hours of day that can be danced to all night. The thrillingly dark Pressure is an anomaly, sonically akin to a biting kiss on the neck. Holding centre with guitar and keyboard, Lindqvist’s voice is that of a dream lover leaned in close, singing sweet sincere words like “daylight just seems so much brighter with you” and “I just wanna treat you better”. Jon George bounces his keys towards a gently insistent hedonism. James Hunt on drums gives everything a beat-chaser or ASMR-craver needs to get their fix. In scene fashion, they’re Matrix-coded for an enduring millennium: black threads, speed dealer sunnies, chains, impressively toned arms. The stage itself is in atmospheric shadows, with industrial scaffolding bleeding colour as a backdrop, and fingers of light caressing the dancers below.\n\nIt’s not all simpatico. Whether the disconnect is between human/machine or human/human, there’s occasional muddiness with the production, diffusing the power of the drops. The stadium – predominantly young – doesn’t mind too much, though. After their AU/NZ run, the boys are off to South America and Europe to spread the RÜFÜS DU SOL euphoria to a world in dire need of some healing hope. THEATRE\n\nRomeo and Juliet\n\nPlayhouse, Sydney Opera House\n\nNovember 20\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★ After months on the road, racking up an impressive death count night after night, Bell Shakespeare’s Romeo and Juliet arrives in Sydney for its final performances. The story remains the same: Two houses alike in dignity, star-crossed lovers, parents’ strife, two hours’ traffic of our stage. The real coup de theatre is to make us believe that just this once the story might turn out differently. That Romeo and Rosalind might get back together, or Juliet might fall desperately in love with Paris, or that Mercutio will just walk on by when Tybalt taunts him.\n\nAnd for a miraculous moment in Peter Evans’ stripped-back production the play does still feel full of possibility. Juliet is a 12-year-old girl with her life ahead of her; Romeo is a dozy, dreamy teenager; Mercutio is Benvolio’s razor-sharp sparring partner, clearly destined for glory. But no. Merridy Eastman and Madeline Li. Credit: Brett Boardman The first half bristles with energy. With the actors on a mostly bare stage, dressed in shades of black (set and costume design by Anna Tregloan), the colour and movement is all in the performances and, with few exceptions, it’s dazzling. Brittany Santariga (Mercutio) and James Thomasson (Benvolio) are a gripping double act who bounce off walls and rostra like kids on red cordial. As for Tybalt, you can almost smell the testosterone radiating from Tom Matthews’ malevolent glares. There’s a febrile brilliance to these youngsters, burning hot, bright and fast. The older generation is no less sparky. Khisraw Jones-Shukoor’s Friar plays the flawed philosopher with understated gravity, while Merridy Eastman, as Juliet’s nurse, upstages the glamorous Capulets with delicious giggles and well-timed gags. Simone Sault’s choreography animates the Capulet’s party and Tom Royce-Hampton’s fight direction furnishes a gripping action sequence, all high-speed leaps and spins, set to the acid rasp of metal on metal.\n\nThe second half feels harder, not least because a taint of unavoidable tragedy hangs over it. Ryan Hodson is an agile, breathless Romeo, snatching excitement out of the air even as he rants and rails against his fate. Juliet’s downfall, by contrast, has something profoundly exhausting about it. Madeleine Li’s Juliet is a child playing at big feelings: her love-making with Romeo is affectingly grandiose and petulant by turn. Meanwhile, her inner world takes her to darker places. Which brings us back to a question with creepy contemporary relevance. At what age does a girl become a woman? Even in Shakespearean times, not 12, surely. The beauty of this production is its honesty and its unstinting commitment to the raw material, Shakespeare’s words. I heard lines spark that had never before caught my ear, and relished words spoken with the grace of poetry and the kick of prose. Any disappointment in seeing the story play out as predicted was leavened by the feeling that there was, and always will be, more to discover in these words. Lenny Kravitz is at his best when he lets rip with his guitar. Credit: Mia Ross\n\nMUSIC\n\nLenny Kravitz\n\nQudos Bank Arena, November 18\n\nReviewed by GEORGE PALATHINGAL\n\n★★★ They just don’t make rock stars like Lenny Kravitz. Any more? I’m not sure they ever did. Here’s a perfectly preserved New Yorker – at 61, he genuinely looks half that – all charismatic but likeable swagger. He still sings with grit and soul, plays a bunch of instruments with effortless panache and gets some of this night’s biggest cheers when he’s merely pausing between songs. (He’s usually just thinking of something to say but still looks like a living, breathing Vogue cover.) Here, however, lies the problem. For someone so long established as a global rock god, it’s eventually apparent that Kravitz’s best work, in a set largely comprising material from this side of 2000, came from the decade or so before that year. Those cheers of aesthetic admiration are loudest because on this tour, well, he looks better than he sounds. The saddest case in point is his 2001 generic power ballad Stillness of Heart, in which our hero encourages a crowd sing-along without realising we don’t know this one. He’s wonderfully gracious about it, lovingly feeding us the lyrics line by line, but the moment falls awkwardly flat.\n\nKravitz fares best when he turns up the guitars and rocks hard: the opening trio of postmillennial tunes is pretty great, though it’s the song that follows, 1991’s Always on the Run, that takes the show to the next level, especially when the brass-boosted coda kicks in. At 61, Kravitz is wearing remarkably well. Credit: Mia Ross Similarly, while the closing trio of big-riffing jams also comes from the ’90s, it builds almost exponentially from his American Woman cover, through Fly Away, into a blistering, ballistic Are You Gonna Go My Way. In between, we get a varied but – there’s that word again – generic series of songs: Low, with its clipped but aimless funk; the lite disco of The Chamber; the not so much forgettable as forgotten piano ballad I’ll Be Waiting. It’s not until the powerhouse soul of a golden oldie that arrives well past the halfway mark, It Ain’t Over ’Til It’s Over, that we eventually hear a song as gorgeous as Kravitz is. At least, given his apparent access to the fountain of youth, he has plenty of years left to come back with a stronger set.\n\nMUSIC\n\nSimone Young Conducts Siegfried\n\nSydney Symphony Orchestra\n\nSydney Opera House, November 13\n\nReviewed by PETER McCALLUM\n\n★★★★★ After splintering a sword, killing a dragon and scaling a fire-covered mountain, not to mention waging a stentorian battle against 100 instrumentalists for 5½ hours, Simon O’Neill, as Siegfried, rose quietly to a top E, the orchestra now silent, to tell us that Siegfried had finally learnt the meaning of fear. You would not have guessed it from his pure pitch and tone, which was as radiant as in the great forging song he had sung in Act 1, where he had adorned the necessary lustiness that the rugged, folk-like lines demand with smooth strength and musical shape. Warwick Fyfe’s voice as Alberich seems to grow in elemental wildness and stature. Credit: Daniel Boud\n\nThis was a performance of astonishing stamina and commanding maturity that tempered power with lyricism, but, as the remaining half hour with Miina-Liisa Varela as Brunnhilde was to show, that was not all. Varela’s awakening lines over the hauntingly still, simple chords Wagner writes after so much crazed chromaticism, glowed with resplendent warmth, and she retained that lustre in each moment of the duet that followed. With intertwining phrases of fiery exultance, she and O’Neill brought this superb performance of the third instalment of Simone Young and the SSO’s concert presentation over four years of Wagner’s Ring cycle to an overpowering close. The quality of the singers Young has assembled has been an outstanding feature of the cycle to date, and Siegfried continued this with a cast that blended experience and freshness. Gerhard Siegel as Mime subtly burnished the edge of his voice towards malevolence, comedy, anger or oleaginous obsequiousness as needed, creating a mercurial gem out of the character’s sometimes tiresome peevishness. Conductor Simone Young’s experience with Wagner was clear right from the opening prelude. Credit: Daniel Boud As the world-wearied Wanderer (Wotan), Wolfgang Koch conjured a rounded nobility of tone in Act 1, inscrutable control in his standoff with the dwarf Alberich in Act 2 and a fiercely impassioned edge in his two great valedictory scenes in Act 3.\n\nWarwick Fyfe’s voice as Alberich seems to grow in elemental wildness and stature each time he appears in the role, and, with assistance of wonderfully dark, polished textures from the SSO brass, he and Koch created a formidable confrontation. Wotan’s scene with Erda embraces resignation rather than confrontation, and Noa Beinart sang this role with statuesque reserve and a shrouded tone of unvoiced mystery. If there really is an earth-goddess, one would want her to sing like that. Loading As the slumbering dragon, Fafner, Teddy Tahu Rhodes created cavernous echoes from the back of the stage and, after being slain, disarming directness from the front. Samantha Clarke sang the part of the Woodbird, the voice of nature that directs the naive Siegfried, with richly coloured silken sound, a refreshing change from the bell-like quality often used for this part. The other great glory of Young’s Ring presentations is to hear the orchestral part on full stage lavished with all the expertise, polish and care of the SSO under concertmaster Andrew Haveron. Horn player David Evans delivered Siegfried’s dragon-wakening call from the high organ loft with a coloured velvety finish, and throughout the wind and brass created many-shaded timbral complexity with moments blazing brilliance and fleeting brightness.\n\nViolas and lower strings brought even-toned depth to the important role Wagner gives these instruments in the opera’s darker textures, and the violins were both brilliantly energised in climaxes and admirably disciplined in quieter passages. The percussion players contributed piercing anvil sounds offstage and ominous and thunderous timpani. Young’s experience with this work was clear right from the opening prelude as she calibrated the pace to draw out tension and expressive moments, all the while maintaining magisterial continuity and flow. These Ring performances have been among the finest I have heard in the Opera House throughout its history. MUSIC\n\nAddison Rae\n\nEnmore Theatre, November 17\n\nReviewed by NADIA RUSSELL\n\n★★★★\n\nJudging by the reception for the first of her two Sydney shows, it’s clear Addison Rae is well on the way from TikTok star to pop princess. It’s a tough transition and she’s far from the first social media star to try to make it in the mainstream – many have stumbled – but this viral TikTok dancer and former Hype House member with millions of followers has talent and charm to burn. It hasn’t been a smooth transition. She tried acting, reality TV, make-up and clothing lines, and her initial music releases didn’t resonate. But last year’s hit single Diet Pepsi broke through and she followed it up with the album Addison earlier this year. Now, she has been nominated for a Grammy (best new artist) and her first headlining tour has produced mesmerising choreography and plenty of viral moments. Addison Rae is well on the way to making it in the mainstream. Credit: Gabrielle Clement If the silhouette of Rae coming out for the opener Fame Is a Gun with her headset mic doesn’t immediately evoke Britney Spears, then that is cemented by the second track I Got It Bad, which actually includes elements of Spears’ ...Baby One More Time. Scantily clad in black lingerie and donning a newscap over her pigtails, for a moment Rae seemed to perfectly channel Spears but without taking away from her own artistry and performance.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/don-t-believe-the-swipe-wallabies-have-flaws-but-are-still-a-team-to-believe-in-20251123-p5nhnb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Don’t believe the swipe: Wallabies have flaws but are still a team to believe in",
    "publish_date": "Sun, 23 Nov 2025 11:28:23 +1100",
    "category": "sports",
    "authors": [
      "Peter Fitzsimons"
    ],
    "text": "The fact that France matched it with three tries of their own in that first half was not surprising, but the news remained good. We were seeing signs of the team that came within an ace of beating the British and Irish Lions, beating South Africa. But with it also came the frustrations. France’s Gael Fickou runs with the ball. Credit: AP Time and again, the Wallaby lineout malfunctioned just when we needed it most. Once was for not throwing the ball in straight, a seriously unforgivable error. (How does that happen at this level?)\n\nThen, right on half time, with the French down a man for the sin bin, and the Wallabies with ball in hand, our fly-half Tane Edmed successfully kicked for the line. What? WHY? The whistle blew and the teams went into the sheds at 19-19. Despite errors like that, the match was there for the taking! Could we do it? We were certainly capable of it.\n\nBut in the second half? This time it was the penalties that ripped a hole in the side of the Wallaby battleship. Ten of them! Every time we were threatening the line, every time French lungs were screaming, their legs wobbling under Wallaby assaults, we gave away a penalty that released the pressure on them, and put the pressure right back on us. France took advantage early in the second half to score a try and a penalty to go to a 27-19 lead only for Australia to again demonstrate what they are capable, just what lethal weapons we actually have in our armoury.\n\nAfter a great steal by replacement hooker Josh Nasser, fullback Max Jorgensen charged down the left touch-line, expertly dribbled it just as the defence closed, to regather and go over in the corner. Try! Try! TRY! A try for your life, I’ll tell a man it is. Edmed slotted it over to close to 27-26 down. Australia’s Dylan Pietsch, left, and France’s Oscar Jegou contest possession. Credit: AP Alas, alas, alas, just when it seemed that a great an historic win might be on the cards – and just when our blokes had demonstrated what they are capable of - those cards fell the other way. Again the lineout malfunctioned when we needed it most, this time to an overthrow and the penalties took their toll.\n\nTwo French tries took them to 41-26 ahead, with seven minutes to go. What did we need? We needed, as a mate pointed out, Travis Head! Or at least we needed his like, to swagger on to the field with twitching handlebar moustache, some swaggering braggadocio, to single-handedly take the match in hand, with such derring-do it would kill a brown dog. We didn’t quite have him, though back-rower Fraser McReight’s bristling bearded and mustachioed form remained a feature throughout the closing phases as he had been through the whole match. When Josh Nasser went over with four minutes to go to make it 41-33, a miracle did not seem out of the question. Our blokes bloody-well deserved one, for the effort they had put in.\n\nAlas, yet more penalties ensued against the Wallabies and the French capitalised to score again and win the whole match 48-33. Oh what might have been! Loading Nevertheless, sneer if you must, but I repeat it: yes, the stats for the year are horrible. Yes, there remain consistent flaws in the Wallaby game whose very persistence – they know what these flaws are, but don’t fix them – but it changes nowt the salient fact. 2025 will be remembered as the year this Wallaby generation showed exactly what they were capable of, when they got it right.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/for-all-the-hype-ai-isn-t-transforming-our-economy-in-a-hurry-20251119-p5ngsx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "For all the hype, AI isn’t transforming our economy in a hurry",
    "publish_date": "Sun, 23 Nov 2025 11:00:23 +1100",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "What really matters to material standards of living in the long run is productivity – the economy’s output from its labour and capital. It’s easy to see why people think AI will do wonders for productivity one day, but it’s equally clear that we’re not there yet. Loading A recent article in the Reserve Bank’s Bulletin provides convincing evidence that suggests many Australian businesses are very much in the phase of figuring how they might use AI, rather than implementing detailed plans. The article, by economists Joel Fernando, Kate McLoughlin and Ravi Ratnayake, is based on insights from a survey of more than 100 medium to large businesses that the RBA speaks to in its liaison program. It found that while firms expect AI investments will make a meaningful difference in the future, many businesses’ adoption of AI today is still in its early, or even experimental, stages.\n\nNearly 40 per cent of firms said they had “minimal” adoption of AI tools, and in these cases, it was typically in the form of “digital assistants” such as Microsoft Copilot or ChatGPT. These are AI tools that can summarise your emails or help with research (often with dubious regard for facts), but they don’t look like productivity game-changers. The RBA’s survey found adoption of AI by Australian firms was “piecemeal”. Often it included staff using ChatGPT. Credit: Reuters Some of the firms surveyed said they were using AI more heavily, but these were generally larger businesses, and the economists said that for most firms “adoption has been shallow to date”. “Overall, many surveyed firms indicated that their adoption of AI tools to date has been relatively piecemeal, with adoption often being employee-led rather than employer-led,” the RBA economists said. But what about the fears of an AI “jobpocalypse”?\n\nThe RBA data doesn’t reflect the wider labour market, and of course, the effect of AI will change from job to job. Even so, the survey and other evidence suggest AI has had a pretty modest impact on staffing so far. Firms surveyed said “most” workers displaced by technology (including AI) had been moved to other jobs in the same employer, though the businesses expected a more “disruptive” impact from AI in the future. About half the surveyed firms expected AI would lead to a “slight” reduction in their total staff over the next three years, due to factors such as natural attrition, hiring fewer new workers, redundancies, or a combination of all three. Westpac chief economist is asked more about AI than her view on interest rates. Credit: Renee Nowytarger Many workers are rightly concerned about the risk of AI to their jobs – no least in industries such as mine, the media – and these findings don’t put those fears to bed. But they do suggest any dramatic changes are still some way off. It’s also one thing for companies to say they plan to cut costs thanks to new technology, but another to do it without creating a gap in their operations. The Commonwealth Bank infamously said it was cutting 45 jobs earlier this year because the roles were being replaced with AI-powered chatbots, only to later backflip.\n\nThe wider economic point is that big technological changes in the past have created new jobs and businesses, as well as wiping some out. That may well happen with AI-related changes, too, but no one knows for sure and it’s likely to be debated for years to come. And that’s another over-arching theme in the RBA research: companies are just very uncertain about the potential use cases for AI, whether they’ll have enough skilled staff, the potential cost, or how it will be regulated. Might AI usher in a new era of rapid productivity growth, reversing a long-running slump? Maybe, but chances are it won’t happen quickly. This uncertainty matters because if AI is really going to transform our economies, businesses are going to have to make major changes to how they operate. Those who are convinced that AI is the next big thing have compared it with some of the biggest technological changes in modern history, such as the invention of the steam engine, electrification, the rise of automobiles or the internet.\n\nMaybe they’re right – but economists also know that these changes did not happen quickly. Loading Moving to electricity, for example, required factories to be overhauled, not to mention infrastructure such as power lines. Or, in a more recent example, it took years for the gain in productivity from computers to be evident. As economist Robert Solow, a Nobel Prize winner, famously said in 1987: “You can see the computer age everywhere but in the productivity statistics.” To get big productivity gains from AI, companies will have to re-examine all their processes and staffing to see how AI could transform their businesses. That takes time, it costs money and it’s likely to require a lot of re-training of staff and potentially hiring more people.\n\nEven though it’s early days, there’s clearly a huge amount of interest in AI in the business world. The fact bosses of big companies constantly tell the market about their AI plans tells us many businesses are indeed planning how they can make the most of the technology. Westpac chief economist Luci Ellis says businesses she speaks to have moved beyond “experimenting” – indeed she’s asked more about AI than she is about her view on interest rates. While Ellis thinks the productivity benefits of AI will appear more quickly than the time it took for computers and the internet to appear in the productivity statistics, it will still take a while. “We’re talking two or three years, not three weeks,” she says. Might AI usher in a new era of rapid productivity growth, reversing a long-running slump? Maybe, but chances are it won’t happen quickly. One thing we can be more confident about is that we won’t get a productivity surge from ChatGPT summarising emails for us. The changes will have to be a lot more profound than that.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/one-dead-four-fighting-for-life-after-horror-house-fire-20251123-p5nhnc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "One dead, four fighting for life after horror house fire",
    "publish_date": "Sun, 23 Nov 2025 10:42:23 +1100",
    "category": "finance",
    "authors": [],
    "text": "One dead, four fighting for life after horror house fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/self-immolation-on-an-almost-unconscionable-scale-how-england-unravelled-20251123-p5nhnw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Self-immolation on an almost unconscionable scale: How England unravelled",
    "publish_date": "Sun, 23 Nov 2025 09:51:46 +1100",
    "category": "sports",
    "authors": [
      "Oliver Brown"
    ],
    "text": "It was a wonder, in all honesty, that the travelling fans were not in a mutinous mood. Many have poured pensions and life savings into making this journey, all to witness England surrender a wonderful overnight position and be blown away in the first two-day Ashes Test for 104 years. If you were being kind, you would call this a systemic failure from a batting perspective. Except England seems not to be adhering to any system at all. Why was Root, normally so cultured and composed, trying to slash Starc through cover? How did England, leading by 105 with nine wickets in hand, self-destruct in such lurid fashion when Australia had just one of their premier strike bowlers? Starc, with 10 wickets for the match, was extraordinary, as lethal as England were hapless. So, too, was Travis Head, blazing to a Test century off just 69 balls, a scoring rate that no Bazballer has yet managed. The humiliation was so total that you fear the potential tailspin to come, with Pat Cummins waiting to be unleashed in Brisbane.\n\nEngland’s across-the-board malfunction turned a likely victory into a ghastly humiliation in a mere 46.4 overs. Nowhere were the problems more vividly illustrated than with the bat, where, on an increasingly placid pitch, they failed to reach 200 once more. While the logic was that Crawley should, despite his flakiness, be a natural fit for the Ashes, his pair suggested such faith was misplaced. A man who has played 59 Tests has now been out in single figures in 41 per cent of the innings he has played. At the top of the order, he has become a liability, with his almost blasé attitude setting the tone for the catalogue of horror that follows. Ben Stokes and England continue to play in their own style. Credit: Getty Images You can be seduced into admiring Ben Duckett’s restless urge to keep the scoreboard ticking over, but what use is this when he fails even to make half-centuries? As for Ollie Pope, what is he doing to justify his place at No.3 when, having played himself in twice, he does nothing to capitalise? It felt briefly as if Gus Atkinson’s gung-ho cameo, stretching England’s lead to over 200, might offer a reprieve, but it was all just needless embroidery on a fiasco.\n\nThe hope was that the bowlers would bail them out again. But as ever, it is the hope that kills, with a swaggering Travis Head savaging England’s attack, the express pace of Jofra Archer and Mark Wood leaving barely a dent on him. When eventually he was caught in the deep for 123, he twirled his bat several times in the air, which could be interpreted either as a salute to the home fans or as a taunt to England. England deserved nothing less than mockery for this performance. Frankly, England deserved nothing less than mockery for this performance. It was not just a capitulation but an affront, both to the very basics of Test cricket and to the supporters who have spent fortunes expecting at least a semblance of a battle. Unfortunately, the notion of “fail to prepare, prepare to fail” is alien to the Bazball credo. England’s trust in their own methods under Stokes and head coach Brendon McCullum is so absolute that any dissent is treated as tantamount to heresy.\n\nThis time, they deserve all the opprobrium they receive. Against an ageing Australia, denuded of both Cummins and Josh Hazlewood, they imagined it would be adequate preparation to play a solitary three-day warm-up against the England Lions at Lilac Hill. What type of warm-up was this for a series by which the success of their philosophical reset would be judged? As ever, they disdain these questions. They maintain their devil-may-care abandon, irrespective of the circumstances. This is the way we play, they shrug. It is also the way they produce the ultimate Ashes nightmare. Wicket-by-wicket: England’s collapse England threw away a position of potential dominance when they lost four wickets in 19 balls, amid a six-wicket collapse from 1-65 for one to 5-88. A few hours later, they lost the first Test.\n\nDuckett – c. Smith, b. Boland Over 16.2 (England 2-65). With England sitting pretty on a lead of 99, having lost only one second-innings wicket, it was a slight surprise that Australia did not turn back to Mitchell Starc straight after lunch. Lyon was off the field, and Cameron Green got his first bowl of the innings. At the other end, Boland continued, and his first ball to Duckett was a beauty, which was snaffled low at slip by the safe hands of Steve Smith. Pope – c. Carey, b. Boland Over 18.3 (England 3-76). In Boland’s next over, he offered Pope a full tempter outside off stump. He could not resist a big drive, which Alex Carey pouched. Brook – c. Khawaja, b. Boland\n\nOver 18.6 (England 4-76). Out walked Harry Brook, who respectfully defended his first two balls, before running out of patience. His third, the last of the over, was edged to first slip. Loading It was an ugly dismissal, made worse by how good Brook had looked on day one. Brook has replaced Pope as vice-captain, and this was the moment for a bit of clear-headed leadership. Brook could not provide it. Root – b. Starc Over 19.2 (England 5-76). The worst, remarkably, was still to come. Root, the designated driver of the Bazball operation, got sucked into the madness. With Root and Ben Stokes at the crease, Starc – eight wickets in the match to this point – was brought back. His second ball was a wide tempter, and Root, to that point comfortable, tried to nail it through cover. An inside edge clattered into his stumps.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/stay-inside-stay-safe-chief-minister-issues-message-for-territorians-20251123-p5nhnu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Stay inside, stay safe': Chief Minister issues message for Territorians",
    "publish_date": "Sun, 23 Nov 2025 09:12:16 +1100",
    "category": "finance",
    "authors": [],
    "text": "'Stay inside, stay safe': Chief Minister issues message for Territorians\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw12-brighton-vs-brentford-20251123-p5nhnr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Brighton vs Brentford",
    "publish_date": "Sun, 23 Nov 2025 09:08:57 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW12: Brighton vs Brentford\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw12-liverpool-vs-nottm-forest-20251123-p5nhnq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Liverpool vs Nott'm Forest",
    "publish_date": "Sun, 23 Nov 2025 09:08:37 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Liverpool vs Nott'm Forest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw12-burnley-vs-chelsea-20251123-p5nhnp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Burnley vs Chelsea",
    "publish_date": "Sun, 23 Nov 2025 09:08:27 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Burnley vs Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw12-bournemouth-vs-west-ham-20251123-p5nhns.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Bournemouth vs West Ham",
    "publish_date": "Sun, 23 Nov 2025 09:08:12 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW12: Bournemouth vs West Ham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw12-fulham-vs-sunderland-20251123-p5nhnn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Fulham vs Sunderland",
    "publish_date": "Sun, 23 Nov 2025 09:07:25 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Fulham vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw12-wolves-vs-crystal-palace-20251123-p5nhno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Wolves vs Crystal Palace",
    "publish_date": "Sun, 23 Nov 2025 09:06:52 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Wolves vs Crystal Palace\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw12-newcastle-vs-man-city-20251123-p5nhnm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Newcastle vs Man City",
    "publish_date": "Sun, 23 Nov 2025 09:06:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Newcastle vs Man City\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-associate-professor-bassina-farbenblum/0qnmbvopq",
    "title": "INTERVIEW: Associate Professor Bassina Farbenblum",
    "publish_date": "Sat, 22 Nov 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/underground-struggles-illegal-miners-risk-death-in-moroccos-forgotten-coal-town/xszzlmjvx",
    "title": "Underground struggles: Illegal miners risk death in Morocco's forgotten coal town",
    "publish_date": "Sat, 22 Nov 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn Morocco's northeastern city of Jerada, illegal coal miners continue to risk their lives to make ends meet.\n\n\n\n\n\nIn 1927, the one and only coal mining plant was founded there - 40 kilometres west of the Algerian border.\n\n\n\n\n\nSince the 1920s, coal mining has been the bread and butter for that North African community.\n\n\n\n\n\nBut in the late 1990s, the Moroccan government decided to shut Jerada's mines, leaving around 9,000 workers unemployed.\n\n\n\n\n\nSo, what's it like now?\n\n\n\n\n\nAlthough it was formally closed for almost three decades, the mines serve as an important source of income for a majority of its residents still there.\n\n\n\n\n\n“When I arrived there was really difficult for me because I was the only one from outside. And when I arrived I saw a funeral happening - it was a little bit chaotic I will say.”\n\n\n\n\n\nIn an exclusive interview, SBS News spoke to David Tiago Barbosa, a photojournalist from Portugal.\n\n\n\n\n\nHe was there in 2023 to document the harsh realities facing these miners.\n\n\n\n\n\nMr Barbosa reflects on his first impression of Jerada.\n\n\n\n\n\n“They were working in the mines but without safety - very dangerous. They were going inside with not harness, they were using a bag, a corn bag, and they attached the corn bag to the rope.”\n\n\n\n\n\nHe was about to enter the coal mine to document their work when this happened.\n\n\n\n\n\n“A big coal bag coming outside and almost falling. So I took the pictures two, three seconds before the bag broke and almost hit two miners there. So they said to me that was very dangerous to go inside.”\n\n\n\n\n\nHe says depending on the area, it could be as deep as 15-40 metres, and as wide as 100 metres horizontally.\n\n\n\n\n\n“The mines are still closed officially, but illegal mining continues, like in secret, mining shafts are dug by hands without safety equipment, without oxygen, without emergency help. And people know they can die at any moment, but they have no other way to feed their families. Some government projects were promised, but the poverty, it's still there.”\n\n\n\n\n\nThat's Mr Hamid - Mr Barbosa's local fixer in Jerada.\n\n\n\n\n\nAccording to local reports, three people died in 2022 from carbon dioxide suffocation inside a well for collecting coal.\n\n\n\n\n\nThe story of coal miners putting their lives at risk to make ends meet has been under-reported in the media.\n\n\n\n\n\nIn 2017, large protests erupted in Jerada following the deaths of two brothers aged 23 and 30 inside a mine.\n\n\n\n\n\nJust last month, the country's Finance Minister Nadia Fettah Alaoui announced Morocco will adjust its upcoming budget to prioritise spending on health and education, as well as allocate some additional funds to reduce regional inequalities.\n\n\n\n\n\nA few days after that, the Powering Past Coal Alliance announced Morocco plans to phase out coal entirely by 2040 if it secures international climate finance.\n\n\n\n\n\nMorocco's energy minister was quoted saying the country has stopped planning for new coal power plants.\n\n\n\n\n\nSBS News has contacted the relevant organisers and ministries in Morocco for a comment, and is yet to receive a response.\n\n\n\n\n\nBut the locals in Jerada remain sceptical this will change the situation for their community.\n\n\n\n\n\nDavid Tiago Barbosa's project titled 'Jerada: The Valley Of Resilience' - which was awarded an honourable mention by the International Photography Awards (IPA)* - was only recently published.\n\n\n\n\n\nHe recalls being under surveillance during his time there, fearing for the safety of his fixer, Hamid.\n\n\n\n\n\n“A police guy went there and started asking for us, asking for what we were doing there. Because I was afraid to them taking my pictures and my SD card.”\n\n\n\n\n\nThankfully he had his images backed up to his hard drive.\n\n\n\n\n\nDuring his stay, he met Youssef, a 25-year-old who had been working in the mine since he was 14 and who was already suffering from lung disease.\n\n\n\n\n\n“He said to me that he started working when he was 12-years-old and his father was working in the old factory. And then when the factory closed, he started working as illegal as well. And the father was with lungs with 100 per cent with silica. So it was really bad and using a mask for breathing and Youssef also started to be really bad with silica problems on the lungs as well.”\n\n\n\n\n\nYoussef has since been arrested in Algeria, while trying to cross by boat to Spain, in search of a better life.\n\n\n\n\n\nSo, what is silica dust, and how is it produced?\n\n\n\n\n\nLung Foundation Australia CEO, Mark Brooke discusses the health implications for the community living and working at these mines.\n\n\n\n\n\n“Silica dust and other forms of hazardous materials in industries that are, for example, mining industries are produced when we are cut through or shape or somehow grind in the extraction of those minerals and we create dust in the air and that dust may contain or is most likely going to contain particulates that are harmful for your lungs.”\n\n\n\n\n\nHe talks about the harmful effects of silica dust on one's health, and why are coal miners largely at risk.\n\n\n\n\n\n“What we do know in Australia, we had an outbreak of coal miners lung disease or black lung about 15 years ago, which was a resurgence of a disease that we had not seen for some time.”\n\n\n\n\n\nHe says that was caused by a whole range of factors, including poor regulation and surveillance, a lack of issuing proper personal protection equipment, and the response from mining corporations to their workers' safety.\n\n\n\n\n\n“Since that time, we've put in place really strong and strict measures that do their very best to protect coal miners and miners, lung health and their health more broadly. And that's because of union campaigns. It's because of organisations like the Lung Foundation and the Thoracic Society working together to really highlight how dangerous dust in workplaces can be.”\n\n\n\n\n\nHe says black lung disease as a disease was always thought about as an accumulation. So it essentially can be someone working in these mines for many years but not seeing the immediate effects.\n\n\n\n\n\n“One of the things we know about black lung disease is that often the diagnosis takes place in later years. Increasingly now, as we have seen with the rapid uptake, the rapid number of patients showing with silicosis in Australia that subject to the manufacturing process, the type of stone being extracted, the cutting tools used the level of personal protection issued to the employees.”\n\n\n\n\n\nMr Brooke says we're increasingly seeing - not just here in Australia but around the world - that the length of time being exposed is shrinking dramatically as people who have only been exposed for a year are showing up with significant lung diseases.\n\n\n\n\n\nHe shares his thoughts on what developing nations can do to prevent this.\n\n\n\n\n\n“The World Health Organisation has recently published a global resolution on lung health. And one of the areas that the New World Health Organisation resolution on integrated care and lung health speaks to is occupational exposures. Every country around the world should be looking at its occupational exposures and lung health and putting in place the frameworks, regulations, and policies and procedures.”\n\n\n\n\n\nStephen Smyth is the Mining and Energy Union General's Vice President in Australia.\n\n\n\n\n\nHe tells SBS News one of the first requirements in all countries for any mining sector anywhere in the world in relation to health and safety - in particularly developing countries - is the adoption of ILO 176.\n\n\n\n\n\nAnd what's really alarming is a lot of countries have not adopted the ILO 176.\n\n\n\n\n\n“Certainly alarming what they're using to be able to get themselves to work without having actually seeing or experienced what they're doing. You're really alarmed. The fact that if they're using, in my words, primitive measures - you'd have to say the working conditions in the mine themselves would be atrocious, would be dangerous. And we certainly lack the basic health and safety legislation, but requirements of to do the job.”\n\n\n\n\n\nHe says despite there being room for improvement in Australia - it has one of the world's leading practices in relation to health and safety - and uses all mechanical machinery.\n\n\n\n\n\n“If you compare it to Australia or other countries, we have standards for lifting devices, standards for slinging, harnessing all those mechanisms as well. So certainly alarming and concerning that workers are putting their lives at risk just getting into the mine, let alone working in tough, hazardous, dangerous conditions each and every day.”\n\n\n\n\n\nHuman rights groups have echoed similar sentiment in the past - defending protesters in the eastern city of Jerada.\n\n\n\n\n\nMr. Hamid shares the realities of the miners on the ground.\n\n\n\n\n\n“Many young men have died in this mines from flooding, explosions, collapsing tunnels, lack of oxygen. Families are left without fathers, brothers or sons.”\n\n\n\n\n\nHe says even young girls work at these mines.\n\n\n\n\n\nAlthough women can't work inside the mines, they can help to select the coal.\n\n\n\n\n\n“Even some, girls between 12 to 16 they go to work there and about if there is insurance, no, some help from the government. No, no protection, nothing.”\n\n\n\n\n\nSome people have left to Oudja in eastern Morocco to work.\n\n\n\n\n\nBut Mr Hamid says most of them stay because it's their homeland and they have nowhere to go.\n\n\n\n\n\n“So the community survives by depending on each other. So sharing food, money and support. Some families collect coal and sell it to the middleman. So the one that it suffers, they don't earn much, but the middleman, he's the one that earns much without doing any job. He's just like buy and then he sells again.”\n\n\n\n\n\nHe says the locals want real jobs, not empty promises from the government.\n\n\n\n\n\n“They don't want to die in this holes. They don't want factories, projects, or legal mines with safety and rights. They want to work with dignity, not in fear.”\n\n\n\n\n\nAdding they are left with no choice.\n\n\n\n\n\n“No one is happy doing this. The go underground, because they don't have a choice. Every time they enter a mine, they say goodbye to their families. It could be the last time. So they work with fear, not with hope.”\n\n\n\n\n\nHe says a miner can earn between 60 Dirham or ten dollars and 120 Dirham or $20 dollars per day - depending on the amount of coal they extract.\n\n\n\n\n\nMr Hamid says the money that they earn is enough for basic necessities such as bread, sugar, food and rent to survive.\n\n\n\n\n\nThe plant that was built was a contract between a Chinese company and the Moroccan government worth over $465 million dollars.\n\n\n\n\n\nThe plant already exists -- as photographed by Mr Barbosa -- with the cemetery in the foreground.\n\n\n\n\n\nThis company created some jobs, but not enough to employ the greater number of people who continue to have no other option and work illegally, risking their lives.\n\n\n\n\n\n“The Chinese company is different because it was a huge investment there and the thing was a new factory, but they didn't have a lot of jobs. So for example, 90 per cent of Jerada is illegal miners and maybe with a new factory, just 10 per cent have a job on the Chinese company. And the other percentage, some people said it was European companies that went there and just say, hey, if you want to earn more, I can give you some tools and you can extract and give to me.”\n\n\n\n\n\nMr Hamid says the danger never stops.\n\n\n\n\n\n“Some of them, they just use kind of a turban or something. There is no oxygen. The tunnels, they collapse, flooding kills minors. There is no hospitals or emergency teams, no legal protection or insurance. And the police chase them because it's illegal and that it happened to me personally when I was with David.”\n\n\n\n\n\nMr Barbosa echoes a similar sentiment.\n\n\n\n\n\n“They don't have, like for example good medical centre, if they have problems with silica problems, they need to go to Casablanca or another big city to have treatment.”\n\n\n\n\n\nMr Hamid again, quoting a miner in Jerada.\n\n\n\n\n\n“My friend who lives in Jerada, he just told me that they have a phrase that they say there. They say we dig our own graves to survive.”\n\n\n\n\n\nThe International Mining Congress this year will be held in Morocco from the 24th to 26th November.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/isolation-and-shame-australians-are-avoiding-perinatal-mental-health-support-new-research-reveals/71wsofd52",
    "title": "'Isolation and shame': Australians are avoiding perinatal mental health support, new research reveals",
    "publish_date": "Sat, 22 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"Pregnancy was a very, it was a very isolating experience. Because I was depressed and low throughout it, I felt a real sense of shame around not experiencing pregnancy like you think you should.\"\n\n\n\n\n\nThat was Lisa Fox - a 44-year-old mother based in the Central Coast of New South Wales.\n\n\n\n\n\nShe recalls experiencing poor mental health during the perinatal period when she was pregnant and gave birth to her son 10 years ago.\n\n\n\n\n\nWhile Lisa was already seeing a psychiatrist and psychologist for a pre-existing mental health condition, she says she was never introduced to specific perinatal support.\n\n\n\n\n\nLisa says she felt isolated and disconnected during her pregnancy and in the 12-18 months after she gave birth to her son Luka.\n\n\n\n\n\n\"And in fact, you know, at about 4 months I had about 5 weeks in a mental health facility to support me. And just that shame that comes with that, and how shame leads to isolation, which is so detrimental to how you can lift yourself out of these things.\"\n\n\n\n\n\nNew research by not-for-profit perinatal mental health organisation, the Gidget Foundation, has found a quarter of Australians experiencing perinatal mental health issues are not seeking help.\n\n\n\n\n\nThis month's survey of over 1,600 Australians found one third of people believed their symptoms were not serious enough.\n\n\n\n\n\nGidget Foundation clinical psychologist and team manager, Katie Peterson says this is due to a lack of awareness around the signs and symptoms of poor perinatal mental health.\n\n\n\n\n\n\"I think it's got to do with people maybe not quite understanding what the difference is between maybe a mental health disorder and what are the different challenges around adjusting to becoming a new parent. Because there are a lot of factors in the perinatal period that we would consider risk factors for why people would go on to develop a mental health disorder. I guess what we know though is that early intervention is the best. So instead of waiting for someone to be kind of more at a serious or severe end, we really want people engaging with professional support early on.\"\n\n\n\n\n\nMs Peterson explains some of the risk factors for mental health issues associated with the perinatal period.\n\n\n\n\n\n\"People are having to adjust to, especially mums, they're going through significant changes hormonally, emotionally, physically, as well as in their social roles. So there's a lot of things that new parents are having to navigate. But we also see new parents might experience birth trauma. They may experience perinatal loss, some parents may have health complications for themselves or for their baby. So it's just a time where things can go wrong sometimes, I guess. And it adds to the extra stresses.\"\n\n\n\n\n\nShame and stigma also play a role in preventing people from seeking appropriate help.\n\n\n\n\n\nChief executive of perinatal mental health organisation PANDA, Julie Borninkhof, explains.\n\n\n\n\n\n\"We know still that people in this country, especially our mums fear raising a conversation about vulnerability because they expect then that the system and community will say 'you're not fit to parent'. And we still hear from callers that they are concerned that people are going to want to take their bubs off them and say 'you're not fit to parent'. And that gets in the way of help-seeking behaviour.\"\n\n\n\n\n\nLisa believes access to tailored perinatal mental health tools would have helped her navigate feelings of shame she experienced at that time.\n\n\n\n\n\n\"Having perinatal specific support I think is crucial for women because even... I was seeking a private psychologist and psychiatrist and didn't receive the sort of fullness of support you can receive when you're going through pregnancy and giving birth. And I think also from that what I really learnt, is that you need to advocate. It's difficult but advocate for your own needs. You can move on, and find other professionals to support you.\"\n\n\n\n\n\nConnecting with and speaking to other mothers during her son's toddler years became a crucial support in how Lisa navigated her mental health.\n\n\n\n\n\n\"And for me, I think this is a key thing around the isolation that exists in this period, is that you really internalise that this is just me. This is just me, it's my fault, I can't cope. But when you do spend time with other women that are going through the same thing, you can say, oh yeah, okay, isn't just me, this is a universal thing that's going on. This is sleep deprivation. This is just really, really hard.\"\n\n\n\n\n\nMs Peterson agrees that reducing isolation and creating shared communities is key to improving individuals' access to mental health care.\n\n\n\n\n\n\"A lot of parents do need to hear the story from someone who kind of have has lived experience of that, of perinatal mental health. And then I guess they may start to relate to that story and see that for themselves. And then by realising that they're not alone, it really does reduce the shame and the stigma around reaching out to mental health services.\"\n\n\n\n\n\nFinancial pressures also contribute to people avoiding professional support, with data from The Gidget Foundation noting 47 per cent of those surveyed relied heavily on bulk billing appointments during the perinatal period, and 27 per cent saying they couldn't afford to seek help.\n\n\n\n\n\nPeople from culturally and linguistically diverse backgrounds, as well as First Nations people, may also confront added cultural and language barriers - as Ms Peterson explains.\n\n\n\n\n\n\"We know that there can be delays in accessing culturally appropriate services, accessing interpreters, and sometimes people from a multicultural background or culturally and linguistically diverse families may find navigating services a little bit tricky or not culturally appropriate. As well as Aboriginal and Torres Strait Islander families, there is an increase in the likelihood of perinatal mental health challenges and again, it's about finding the right supports that are culturally appropriate.\"\n\n\n\n\n\nFathers also often feel excluded from perinatal mental health services - with only just over 5 per cent of PANDA's helpline callers men, despite men making up 14 per cent of the mental health checklist users.\n\n\n\n\n\nThis is something Ms Borninkhof calls the 'Dad gap'.\n\n\n\n\n\n\"I think there's still a significant stigma around the fact that men feel that they have to be the rocks in the family, and we often spend time talking about the fact that even rocks crumble. And I think that services are still behind the eight ball in terms of supporting dads in this country. There's a real resurgence and growth in dads support, but they're still being built because the investment from the funders and the government isn't there because we've been so focused on mums.\"\n\n\n\n\n\nLisa says whole communities need to be aware of the support they can provide new parents.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/leadership-spills-and-policy-reversals-how-healthy-is-our-democracy/nj201gjdp",
    "title": "Leadership spills and policy reversals: How healthy is our democracy?",
    "publish_date": "Fri, 21 Nov 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"So, let’s be honest and up front about last month’s election. We didn’t just lose. We got smashed. Totally smashed. What we as the Liberal Party presented to the Australian people was comprehensively rejected.\"\n\n\n\n\n\nThat declaration of defeat was delivered by Liberal Party Leader Sussan Ley on June 25th, 2025.\n\n\n\n\n\nIn the months following the party's historic defeat, those words have echoed like an omen.\n\n\n\n\n\nSince then, the Liberal Party has undergone organisational movement and policy shifts at the federal and state levels.\n\n\n\n\n\nIn Victoria, Brad Battin was ousted to install Jess Wilson as the first female leader.\n\n\n\n\n\nIn New South Wales Kellie Sloane has been elected as the new leader following Mark Speakman's resignation.\n\n\n\n\n\nTurbulence is rife in the party - So what role does an opposition party play in a Westminster representative democracy?\n\n\n\n\n\nSkye Predevac from the Australia Institute tells us what a Westminster Democracy is.\n\n\n\n\n\n\"The Westminster system is basically a bunch of procedures and protocols and traditions that come from the United Kingdom. So it's, you know, these hundreds of years of built up British traditions when it comes to democracy. And it looks like many things that we have in Australia, things like even having a prime minister, having two Houses of Parliament, having executive the executive branch, having ministers being politicians in members of parliament, parliamentary privilege, the hands are all of these things are part of this. And in this context, it also means having an opposition leader, because traditionally in the United Kingdom, they've only had two big parties, and they alternate between government so it makes sense to have a single person who's in charge of the opposition in a lot of other democracies. It doesn't work that way because they don't have those kind of two major parties.\"\n\n\n\n\n\nDr Jill Sheppard, a politican scientist from the Australian National University says the the opposition party plays a pivotal role in this system.\n\n\n\n\n\n\"It matters for half of the population, for 66% of the population that didn't vote for Labor and want to feel represented by someone, and if they don't feel represented, especially in a compulsory voting system, that is miserable, you know, so if you voted Liberal, or if you just didn't vote Labor, but every day, all you see is Labor, or all you see is criticism of a Liberal party, you start to feel like this is a government that doesn't speak for you at all. And we're not a one party state, like we're meant to be a parliamentary democracy in which the parties work together to come up with consensus on a whole range of policies. And if that's not happening, because Liberal Party can't even agree, you know, can't even come up with a consensus internally, then that that's really bad for how we feel about democracy.\"\n\n\n\n\n\nDr Sheppard notes that despite the Labor government receiving only 34% of the primary vote, it controls the legislative agenda, even without control of the Senate.\n\n\n\n\n\nShe says this is not good for the state of democracy.\n\n\n\n\n\nProfessor Mark Kenny from the Australian National University offers a traditional view of the Opposition's role.\n\n\n\n\n\nHe says they should act as an \"alternative government in residence\" responsible for negotiating legislation, setting the political agenda, and raising issues for discussion among other representatives.\n\n\n\n\n\nConversely, Dr Sheppard says that if assessing the party purely on the act of setting the political agenda, some might argue the Coalition is doing an effective job.\n\n\n\n\n\n\"You know, if we're being generous, we might say the Libs are doing really well on that. Because we're talking about immigration, we're talking about Net Zero, things that Labor doesn't necessarily want us talking about, and that, for better or worse, we're having conversations about those policies.\"\n\n\n\n\n\nThe problem, according to Professor Kenny, is that the federal Opposition is out of touch with the reality of the Labor government's current stronghold.\n\n\n\n\n\nHe says the Coalition is more concerned with internal divisions than becoming electable.\n\n\n\n\n\n\"What does that mean for the quality of government in the longer run? It's an interesting question. In the UK, we see this with the Reform Party led by Nigel Farage, has five seats in a 650-member House of Commons, and yet it's getting more media, really, more media coverage, even from the BBC, than the Lib Dems who've got about 73 seats. And the Greens, who've got, you know, more seats than than Farage and, of course, the Conservatives, who have more seats than all of them. But the Conservatives are, the polls suggest, are no longer going to be the main party of opposition to Labour as that country goes to its next election, Australia could be headed for a similar kind of trajectory.\"\n\n\n\n\n\nSkye Predevac argues that a weak opposition is detrimental to the current system.\n\n\n\n\n\nShe says however that the fact that minority parties secured more seats than the Coalition in the last election suggests the two-party system is open to change.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/no-food-no-money-khoa-was-abandoned-and-owed-10-000-in-unpaid-wages-hes-not-alone/o9uj8zvmv",
    "title": "‘No food, no money’: Khoa was abandoned and owed $10,000 in unpaid wages. He’s not alone",
    "publish_date": "Fri, 21 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nKhoa Nguyenworks as a critical care nurse at a major Melbourne hospital. The 31-year-old is incredibly proud to help save lives on the medical frontline.\n\n\n\n\n\n“It is rewarding but challenging at the same time. I love the fast paced, rapid response that you could do to help the patient to be back on their feet.”\n\n\n\n\n\nBut his journey to the Victorian Heart Hospital was anything but smooth. During a gap year to earn money for university fees, Mr Nguyen took a labouring job on a farm in South Australia.\n\n\n\n\n\n“So we would get up at four, so getting ready and we'd be at the farms around 5, 5 30. Sometimes it's raining and it's hot as well. But yeah, I didn't want to take the break and I just had to keep going because otherwise I wouldn't get paid that day.”\n\n\n\n\n\nMr Nguyen shared a trailer with several others, working long hours for perhaps a few hundred dollars a day. Even then, he said his wages were docked -- allegedly to pay for upfront costs.\n\n\n\n\n\n“They already said we provided you with all the equipment all the safety gear, accommodation and then that's deducted from your salary. The accommodation and the equipment couldn't cost that much - but I didn't know where to seek help so I just agreed with that.”\n\n\n\n\n\nWhat’s worse, he says when the workers asked for their full wages the contractor paid only part of the money owing.\n\n\n\n\n\n“He said we'll keep it here just in case you break equipment and you do something to the accommodation, as well as the bond. And they said after the season then we'll pay you back. When the season finished and we asked for the money to come back and they said ‘okay, I'll give it to you next two days’. And he just took off.”\n\n\n\n\n\nMr Nguyen said the group had little money left for fares home or to buy food.\n\n\n\n\n\n“We drink plenty of water just to feel our stomach and survive because we got no contact, we didn't know where to seek help. I was stuck there two-and-a-half months. Two and a half months I had to stay in the trailer.”\n\n\n\n\n\nMr Nguyen reckons he was owed up to $10,000 in back pay. He doesn’t recall the name of the contractor nor has he tried to recover the funds.\n\n\n\n\n\n“During that period I thought of giving up, I thought ‘oh this is not for me. I don't want to continue anymore. This is so hard for me’.”\n\n\n\n\n\nIt’s an all-too-common problem, according to Associate Professor Bassina Farbenblum ((BASS-in-ah Fahr-ben-bloom)) from the faculty of law and justice at the University of New South Wales and also co-executive Director of the Migrant Justice Institute.\n\n\n\n\n\n“We have a pervasive problem with workplace exploitation for international students and people working on temporary visas in Australia. Migrants are especially vulnerable. So, for international students, they want to stay and finish their studies. And so employers know how desperately they need to protect that visa and how much they need their job.”\n\n\n\n\n\nIt’s not just international students who struggle.\n\n\n\n\n\nA University of Melbourne survey of 2,800 young workers released in July this year found that one third were likely underpaid, two thirds were forced to pay for work-related items such as uniforms or protective equipment, almost one-third were not paid compulsory super. Associate Professor Farbenblum says information is key.\n\n\n\n\n\n“Fair Work Ombudsman's website has some really good resources and that includes working out what your hourly rate is. If you are not getting leave, so if you're not getting sick leave and holiday leave, you're probably a casual worker, which means you're entitled to a 25 per cent loading. And then if you're working on nights and weekends, you might be entitled to penalty rates. Keep records of all the hours you're working. So, send a text message to your employer saying, confirming I'm working these hours on Sunday. If you're not getting payslips, which you should be, at least you've got a documented record of the hours that you're working. So, if you do want to try to claim the wages that you're owed later you've got a really good record of the hours you worked and ideally the amount that you were paid. So, the more you can document, the better.”\n\n\n\n\n\nFrom January this year, intentionally underpaying an employee’s wages or entitlements, including international students, became a criminal offence. Penalties include up to 10 years in prison and fines of more than one-and-a-half million dollars. Associate Professor Farbenblum welcomes the move.\n\n\n\n\n\n“There are also a number of new offenses in the Migration Act and these are particularly important for people on visas and they relate to employers using a person's migration status to coerce them into accepting certain conditions at work or even in the workplace. It might be accepting living arrangements related to the workplace. But we have to do much, much more to ensure that these protections are accessible to migrant workers who are exploited everywhere in Australia. And we have to make our court systems more accessible because right now we are making some dent in some of the worst cases, but we've got a really long way to go.”\n\n\n\n\n\nMr Nguyen finally escaped the farm and returned to Melbourne. His parents initially paid for his studies, later Mr Nguyen took multiple jobs to finish his degree.\n\n\n\n\n\n“It was pretty hard because I was struggling with the money at that time, I was still struggling financially. I couldn't have enough money to pay for my tuition fee. Of course my parents keep borrowing money from everywhere, but of course it wasn't enough.”\n\n\n\n\n\nIn fact, Mr Nguyen worked so hard to raise the $36,000 annual fees, he says he collapsed at university due to low blood sugar. Even so, he refused to quit.\n\n\n\n\n\n“I was scared of making my parents disappointed because they sacrifice their life. They worked tirelessly to get me and my siblings where we are today.”\n\n\n\n\n\nWith thousands of international students signing on for three months summer holiday work, Phil Honeywood, CEO of the International Education Association of Australia, expects more reports of exploitation.\n\n\n\n\n\n“Australia has put in place the regulatory frameworks and the appeal mechanisms to the best in class, world-class standard of employment undertaking. However, there'll always be unscrupulous players who will take advantage of young people's naivety. Really what we need young people to do is if they're signing on the dotted line to get independent advice about the contract they're signing. Ideally it would be from their education providers, job service or indeed their legal service. Make sure that if that first wage does not hit the bank account within the agreed time period, be that one week or maximum fortnight I would suggest, then clearly questions have to be asked. Make your family and your friendship group aware of where you are and how to communicate with you because often we've got mobile phone issues in rural communities. This summer is going to be really the time when the rubber's going to hit the road as to whether the architecture is correct, as to whether enough information is being provided.”\n\n\n\n\n\nDespite speaking only three words of English when he arrived in 2012, Mr Nguyen recently finished a second masters’ degree, in advanced nursing. He is married to his childhood sweetheart with a young daughter, and is proud to have finally achieved his goal.\n\n\n\n\n\n“This is like dream comes true. Like I've been, thanks to those hard times that I feel more mature, I feel that I can - doesn't matter what challenge, unexpected challenge or difficult times come to me, I am always ready to fight the battle.”\n\n\n\n\n\nAnd he has this advice for other international students working to pay their way.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-three-bedroom-properties-are-getting-harder-to-find/6h2g8zswv",
    "title": "'The odds are against us': Why some Australian homeowners may never upgrade",
    "publish_date": "Fri, 21 Nov 2025 19:36:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "On paper, Billy and his wife seem like the kind of couple who could afford to buy a house in Sydney: They earn a combined household income of $350,000 and own two apartments.\n\n\n\n\n\nThe North Shore residents are expecting a child and have been looking to buy a four-bedroom family house for up to $2 million, which is the upper range of what they can afford.\n\n\n\n\n\nBut after months of house-hunting, they are starting to lose hope.\n\n\n\n\n\n\"We were initially amazed that we could borrow this much and we thought we'd get something for it — but now we've started looking and it's kind of like 'what the?'\" Billy says.\n\n\n\nIt just feels like the goalposts keep moving.\n\nData shows Australians are finding it increasingly difficult to upgrade from starter units to family-sized houses, meaning their first step on the property ladder may actually be their final one.\n\n\n\n\n\nIt coincides with a drop in the proportion of three-bedroom properties available, which experts believe needs to be addressed.\n\n\n\n\n\nKPMG urban economist Terry Rawnsley says data shows that since the COVID-19 pandemic, it's become harder to upgrade from an apartment to a house.\n\n\n\nPrice gap is bigger\n\nIn 2019, the price gap between a median unit or townhouse and a median house was 28.3 per cent, but this climbed to 72.3 per cent in the latest figures for 2024/25, according to Rawnsley's analysis.\n\n\n\n\n\nThose who owned a median unit or townhouse in 2019 could have sold it for $700,000 and purchased a median house for around $900,000, which is not a massive gap, he says.\n\n\n\n\n\nThe median unit or townhouse is now worth about $800,000, while the median house costs around $1.4 million, which is a much bigger jump.\n\n\n\n\n\nThis is because house prices have grown much faster than unit prices.\n\n\n\nThe difference in price between the median unit/townhouse, and the median house, is growing in every capital city except Darwin. Source: SBS News In Sydney, the median house price is now $1.7 million, according to Domain.\n\n\n\n\n\nHenny Rahardja, principal buyer's agent at OH Property Group, says she has noticed buyers in Sydney are finding it difficult to upgrade.\n\n\n\n\n\n\"Buyers can't easily make the jump from $1.2 million apartments to $2.8 million houses, for example,\" she says.\n\n\n\n\n\nThis may be even more challenging in suburbs where land sizes are larger.\n\n\n\n\n\n\"Buyers may be okay to buy a house on 500 square metres of land, for example, but this is not helpful if the average land size in the suburb is 900 sq m.\n\n\n\n\n\n\"I think there is a lack of diversity in housing options available at the various price points.\"\n\n\n\n'Hoping for a Christmas miracle'\n\nBilly, 37, and his wife believe they've likely reached the peak of their earning potential and say it's been disappointing to see what they can actually afford to buy in the North Shore, where they would like to stay because it's close to their family.\n\n\n\nWe're getting priced out very easily, especially for things that fit our criteria, which is something that's livable [and] in a decent location.\n\nProperties they've found for around $1.8 million are either dilapidated, on busy roads or don't have much growth potential.\n\n\n\n\n\n\"The odds are against us,\" Billy acknowledges, saying they will keep trying but might have to compromise on liveability.\n\n\n\n\n\n\"We may have to live in something a bit more cramped and maybe save and try and do renovations in the future.\"\n\n\n\nBilly owns a two-bedroom unit in Baulkham Hills, and he and his wife currently live in a three-bedroom unit that she bought one and a half years ago.\n\n\n\n\n\nHis wife's parents helped her to buy the property and Billy says the pair don't feel like it's an option to ask their families for more assistance.\n\n\n\nOut of a matter of pride and self-respect, I guess, because we know we've already gotten help, it doesn't feel right to ask or continually ask for more help until we've given back a little bit.\n\nEven if they sold their properties, they would not have enough funds to substantially boost their borrowing capacity, as they also have to cover capital gains tax.\n\n\n\n\n\nIf they can't find something appropriate, they will probably stay where they are, and Billy says they may have to rethink their careers and pivot in order to gain more income.\n\n\n\n\n\n\"[But] I think that's difficult. The market's moving faster than our salaries are,\" he says.\n\n\n\n\n\n\"We're hoping for a Christmas miracle.\n\n\n\n\n\n\"If there's any time for a miracle to happen, it's normally around Christmas time because people go away on holiday [and] there's not a lot of interest then.\"\n\n\n\nSupply of three-bedroom properties is falling\n\nPart of the problem is that the proportion of three-bedroom properties in Australia has dropped in the past decade.\n\n\n\n\n\nThese properties appeal to both families and downsizers but they are becoming harder to find.\n\n\n\n\n\nRawnsley says three-bedroom properties made up almost half of those available in 2011 (45.7 per cent). But this had dropped to 39.9 per cent by 2021.\n\n\n\n\n\nThe proportion of one- and two-bedroom properties stayed roughly the same, while the proportion of properties with four or more bedrooms rose from 37.9 per cent to 43.6 per cent.\n\n\n\n\n\nThere are now more properties with four or more bedrooms (2.8 million homes) than with three bedrooms (2.6 million homes).\n\n\n\nThe proportion of three-bedroom dwellings declined in the 10 years between 2011 and 2021. Source: SBS News The emphasis on building higher-density apartment blocks with one or two-bedroom dwellings, as well as larger homes on the urban fringe, appears to be depleting the proportion of three-bedroom properties available.\n\n\n\n\n\nAustralian Housing and Urban Research Institute managing director Michael Fotheringham points out that Australia builds many more houses than apartments, and these are mostly concentrated on the urban fringes.\n\n\n\nFor each individual apartment, we build six houses and that continues.\n\n\"Seventy per cent of our housing stock is houses rather than apartments or townhouses. About 15 per cent is apartments and about 15 per cent is townhouses.\"\n\n\n\n\n\nBut the recent focus on building apartments could also be contributing to the scarcity of three-bedroom properties as family-friendly houses in desirable areas are knocked down to make way for apartments, and developers generally prefer to build one- or two-bedroom units.\n\n\n\n\n\nAny three-bedroom units included are often designed as luxury penthouses, making them unaffordable, or are designed to be rented, so they often don't have large living areas suitable for families .\n\n\n\n\n\nThe median price for a three-bedroom unit in Sydney is also higher than for a three-bedroom house, partly because units are often more centrally located .\n\n\n\nDevelopers shifting focus\n\nFlorian Caillon, head of acquisitions at property developer Third.i Group, says three-bedroom dwellings are generally more expensive and can take longer to sell, so some developers may not want stock sitting there for extended periods as they've got interest and other costs to consider.\n\n\n\n\n\nBut he says the group's research has found a spike in people saying they are interested in three-bedroom units in Sydney suburbs such as Gladesville and Crows Nest, and even Newcastle in NSW.\n\n\n\nWe've definitely seen that on the ground, that people are wanting larger units now because they're being priced out of the traditional home market.\n\nIn response, Third.i is changing its focus and the first stage of its new development in Crows Nest will have a greater emphasis on three-bedroom units.\n\n\n\n\n\nJames Alexander-Hatziplis, the chief executive officer of Sydney architecture firm Place Studio, says he has noticed a real shift in the market.\n\n\n\nThird.i's Crows Nest development Hume Place is expected to include more three-bedroom apartments suitable for family living. Source: Supplied \"Developers are starting to focus on apartments that work for a wider mix of people, not just first-home buyers or downsizers,\" he says.\n\n\n\n\n\n\"When you build slightly larger, more flexible apartments, especially with an extra bedroom, they simply last longer in terms of how people can use them.\n\n\n\n\n\n\"This is, at its core, a more sustainable outcome as it reduces the need to replace redundant housing that doesn't meet society's needs.\"\n\n\n\nPush for more family-sized homes\n\nProfessor of planning at Western Sydney University, Nicky Morrison, says previous policy settings haven't clearly signalled that three-bedroom homes are a priority and the market alone has not delivered family-sized apartments at scale.\n\n\n\n\n\n\"At present, we don't build enough well-located, family-sized homes,\" she says.\n\n\n\n\n\nShe stresses that governments should be encouraging developers to build more three-bedroom apartments because they give families and downsizers the ability to stay close to jobs, schools and transport, rather than pushing them to the fringe.\n\n\n\nBoth the Victorian and NSW governments have recently introduced new planning incentives to encourage more family-friendly housing.\n\n\n\n\n\nVictoria's townhouse and low-rise code enables homes of up to three storeys to be fast-tracked through the planning system. One in 10 homes will be required to have three or more bedrooms.\n\n\n\n\n\n\"The only way to make housing fairer for young Victorians is to build more homes faster — that's why we're delivering the biggest overhaul of Victoria's planning laws in decades, bringing Victoria's old-fashioned 'NIMBY' planning laws into the modern era,\" a Victorian government spokesperson says.\n\n\n\n\n\nAccording to a spokesperson for the NSW Department of Planning, Housing and Infrastructure, the state government is focused on increasing housing diversity through reforms such as the NSW Housing Pattern Book and its low and mid-rise housing policy.\n\n\n\n\n\n\"This will encourage development of a wider variety of homes suitable for families, including three-bedroom homes,\" the spokesperson says.\n\n\n\nOne of the designs from the NSW Housing Pattern Book that can be used to construct two side-by-side homes with two to four bedrooms each. Source: Supplied / Sibling Architecture The pattern book provides high-quality home designs for low and mid-rise housing that can be fast-tracked through planning processes. It includes terraces, row homes and mid-rise apartments.\n\n\n\n\n\nBut the spokesperson says councils are primarily responsible for establishing dwelling mix controls, including requirements for more three-bedroom homes, through their local environmental plans or development control plans.\n\n\n\n\n\nWhile Morrison agrees, she says state-level policy signals strongly shape what councils can mandate.\n\n\n\n\n\n\"That is why clearer guidance, incentives and design standards at the state level still matter.\"\n\n\n\nRelief could still be a few years away\n\nRawnsley says the impact of off-the-shelf plans for townhouses or medium-density development will take a few years to realise.\n\n\n\n\n\n\"We'll hopefully start seeing more of this missing middle townhouse coming into fruition over the next couple of years,\" he says.\n\n\n\n\n\n\"We've got lots of developers who build lots of Greenfield housing on the fringe, but we don't really have a very deep or established market of developers who really specialise in this townhouse market in large numbers.\"\n\n\n\n\n\nIt's hoped the supply of townhouses, terraces and other mid-rise apartments will provide another rung on the property ladder that’s more affordable than a standalone house.\n\n\n\nWhen asked whether he believes the concept of a property ladder still works, Rawnsley says the first step is getting much harder for first-home buyers to climb.\n\n\n\n\n\n\"But we know that apartments are more affordable, so apartments are still the first rung,\" he says.\n\n\n\n\n\n\"The next step up is going to be a more challenging one [than previously expected] — you have to build more equity, save more money to get to the house.\n\n\n\n\n\n\"Or you remain in that apartment for the long term. It becomes the final step on the property ladder, rather than the [first] one.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/darwin-braces-for-tropical-cyclone-finas-impact/rgz6zn0s2",
    "title": "Darwin braces for Tropical Cyclone Fina's impact",
    "publish_date": "Fri, 21 Nov 2025 08:18:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/easy-to-say-a-lot-harder-to-do-stokes-refuses-to-blame-england-s-batters-for-perth-capitulation-20251122-p5nhme.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Won’t be changing our blueprint’: McCullum says England won’t deviate from Bazball style",
    "publish_date": "Sun, 23 Nov 2025 13:12:06 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Perth: England coach Brendon McCullum has vowed his team will not deviate from their ultra-aggressive style after “Bazball” spectacularly imploded to hand Australia a stunning victory in the first Test.\n\nAs a shell-shocked England captain Ben Stokes refused to blame his batters after the visitors became just the sixth team in Ashes history to lose inside two days, former skipper Michael Vaughan warned “you can’t be competitive without brains”.\n\nThe cynicism in which England’s ultra-aggressive style is viewed in this country was reinforced after a dramatic Saturday afternoon when Travis Head beat them at their own game.\n\nThe 405 balls England faced in Perth is their lowest tally in a Test where they have been bowled out twice since 1904 at the MCG, four years before Don Bradman was born.\n\nEngland fans back home who went to sleep at lunch with their side almost 100 ahead with nine wickets in hand would have fallen out of their beds in disbelief when they checked the scorecard in the morning to see just what had happened.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/ufc-champ-in-backstage-scuffle-20251123-p5nhpq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "UFC champ in backstage scuffle",
    "publish_date": "Sun, 23 Nov 2025 13:05:22 +1100",
    "category": "sports",
    "authors": [],
    "text": "UFC champ in backstage scuffle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/world/north-america/largest-exhibit-of-indigenous-art-ever-shown-overseas-opens-in-the-us-20251121-p5nhe0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Largest exhibit of Indigenous art ever shown overseas opens in the US",
    "publish_date": "Sun, 23 Nov 2025 13:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Warning: The following article contains names and images of Indigenous people who are deceased.\n\nWashington: The largest exhibition of Indigenous Australian art ever shown overseas is beginning to draw crowds in the US capital, weeks after the grand opening was cancelled due to the government shutdown.\n\nMany of the works now on display at the National Gallery of Art (NGA) in Washington, DC, had never previously left Australia. The Stars We Do Not See, drawn from the extensive National Gallery of Victoria (NGV) collection, comprises nearly 200 pieces by more than 130 artists.\n\nSeven Sisters Song, painted on a road sign, is one of 200 Indigenous Australian artworks on display at the National Gallery of Art. Credit: Courtesy of the National Gallery of Art, Washington\n\nThe exhibit showcases art from every corner of the continent, from Arnhem Land to the Tiwi Islands north of Darwin, South Australia’s Indulkana and the remote Punmu community 600 kilometres from Port Hedland.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/five-hours-of-brilliance-this-is-opera-at-its-biggest-boldest-and-dazzling-best-20251117-p5nfyo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When Colin Friels’ Lear soars it’s heartbreaking",
    "publish_date": "Sun, 23 Nov 2025 12:24:51 +1100",
    "category": "entertainment",
    "authors": [
      "George Palathingal",
      "Nadia Russell"
    ],
    "text": "The problem is that we’re never brought to tears by the saddest play ever penned. Carroll takes us closest, but Whyte, Conroy and, above all, Friels should plunge us into the waiting abyss. The ingredients are mostly in place. MUSIC\n\nRÜFÜS DU SOL\n\nQudos Bank Arena, November 20\n\nReviewed by KATE PRENDERGAST\n\n★★★★½ “I want to make sure everyone’s standing up,” says Tyrone Lindqvist five minutes in. The vocalist is eyeing, as meaningfully as a guy can in dark glasses, the thousands seated in the stadium’s high rises. Too right. For any able-bodied person to sit during a RÜFÜS DU SOL performance is an insult to dance music.\n\nIt was a special homecoming for the world-renowned trio, returning to the city that saw them 15 years ago release their first of five albums, with the legendary Innerbloom getting a jubilant rinse as the closer, ten years to the day since release. Even then, most of the crowd had kept to their feet, aglow with that uplifting nostalgia that is the hallmark of RÜFÜS’s lush, layered sound. Australia’s biggest electronic music export, somehow still chill and on the rise, deliver live shows that adapt and flex their studio excellence, conjuring a world in which sinews meet synths, carbon interfaces machine, sequencing pushes form. Loading They’ve crafted a sublime journey for this tour, putting up top fan favourites like On My Knees while drawing most from Inhale / Exhale (2024), an album that proves their evolution is holding true. Cresting waves of wistful bliss towards a natural high, these are songs that feel forged in the golden hours of day that can be danced to all night. The thrillingly dark Pressure is an anomaly, sonically akin to a biting kiss on the neck. Holding centre with guitar and keyboard, Lindqvist’s voice is that of a dream lover leaned in close, singing sweet sincere words like “daylight just seems so much brighter with you” and “I just wanna treat you better”. Jon George bounces his keys towards a gently insistent hedonism. James Hunt on drums gives everything a beat-chaser or ASMR-craver needs to get their fix. In scene fashion, they’re Matrix-coded for an enduring millennium: black threads, speed dealer sunnies, chains, impressively toned arms. The stage itself is in atmospheric shadows, with industrial scaffolding bleeding colour as a backdrop, and fingers of light caressing the dancers below.\n\nIt’s not all simpatico. Whether the disconnect is between human/machine or human/human, there’s occasional muddiness with the production, diffusing the power of the drops. The stadium – predominantly young – doesn’t mind too much, though. After their AU/NZ run, the boys are off to South America and Europe to spread the RÜFÜS DU SOL euphoria to a world in dire need of some healing hope. THEATRE\n\nRomeo and Juliet\n\nPlayhouse, Sydney Opera House\n\nNovember 20\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★ After months on the road, racking up an impressive death count night after night, Bell Shakespeare’s Romeo and Juliet arrives in Sydney for its final performances. The story remains the same: Two houses alike in dignity, star-crossed lovers, parents’ strife, two hours’ traffic of our stage. The real coup de theatre is to make us believe that just this once the story might turn out differently. That Romeo and Rosalind might get back together, or Juliet might fall desperately in love with Paris, or that Mercutio will just walk on by when Tybalt taunts him.\n\nAnd for a miraculous moment in Peter Evans’ stripped-back production the play does still feel full of possibility. Juliet is a 12-year-old girl with her life ahead of her; Romeo is a dozy, dreamy teenager; Mercutio is Benvolio’s razor-sharp sparring partner, clearly destined for glory. But no. Merridy Eastman and Madeline Li. Credit: Brett Boardman The first half bristles with energy. With the actors on a mostly bare stage, dressed in shades of black (set and costume design by Anna Tregloan), the colour and movement is all in the performances and, with few exceptions, it’s dazzling. Brittany Santariga (Mercutio) and James Thomasson (Benvolio) are a gripping double act who bounce off walls and rostra like kids on red cordial. As for Tybalt, you can almost smell the testosterone radiating from Tom Matthews’ malevolent glares. There’s a febrile brilliance to these youngsters, burning hot, bright and fast. The older generation is no less sparky. Khisraw Jones-Shukoor’s Friar plays the flawed philosopher with understated gravity, while Merridy Eastman, as Juliet’s nurse, upstages the glamorous Capulets with delicious giggles and well-timed gags. Simone Sault’s choreography animates the Capulet’s party and Tom Royce-Hampton’s fight direction furnishes a gripping action sequence, all high-speed leaps and spins, set to the acid rasp of metal on metal.\n\nThe second half feels harder, not least because a taint of unavoidable tragedy hangs over it. Ryan Hodson is an agile, breathless Romeo, snatching excitement out of the air even as he rants and rails against his fate. Juliet’s downfall, by contrast, has something profoundly exhausting about it. Madeleine Li’s Juliet is a child playing at big feelings: her love-making with Romeo is affectingly grandiose and petulant by turn. Meanwhile, her inner world takes her to darker places. Which brings us back to a question with creepy contemporary relevance. At what age does a girl become a woman? Even in Shakespearean times, not 12, surely. The beauty of this production is its honesty and its unstinting commitment to the raw material, Shakespeare’s words. I heard lines spark that had never before caught my ear, and relished words spoken with the grace of poetry and the kick of prose. Any disappointment in seeing the story play out as predicted was leavened by the feeling that there was, and always will be, more to discover in these words. Lenny Kravitz is at his best when he lets rip with his guitar. Credit: Mia Ross\n\nMUSIC\n\nLenny Kravitz\n\nQudos Bank Arena, November 18\n\nReviewed by GEORGE PALATHINGAL\n\n★★★ They just don’t make rock stars like Lenny Kravitz. Any more? I’m not sure they ever did. Here’s a perfectly preserved New Yorker – at 61, he genuinely looks half that – all charismatic but likeable swagger. He still sings with grit and soul, plays a bunch of instruments with effortless panache and gets some of this night’s biggest cheers when he’s merely pausing between songs. (He’s usually just thinking of something to say but still looks like a living, breathing Vogue cover.) Here, however, lies the problem. For someone so long established as a global rock god, it’s eventually apparent that Kravitz’s best work, in a set largely comprising material from this side of 2000, came from the decade or so before that year. Those cheers of aesthetic admiration are loudest because on this tour, well, he looks better than he sounds. The saddest case in point is his 2001 generic power ballad Stillness of Heart, in which our hero encourages a crowd sing-along without realising we don’t know this one. He’s wonderfully gracious about it, lovingly feeding us the lyrics line by line, but the moment falls awkwardly flat.\n\nKravitz fares best when he turns up the guitars and rocks hard: the opening trio of postmillennial tunes is pretty great, though it’s the song that follows, 1991’s Always on the Run, that takes the show to the next level, especially when the brass-boosted coda kicks in. At 61, Kravitz is wearing remarkably well. Credit: Mia Ross Similarly, while the closing trio of big-riffing jams also comes from the ’90s, it builds almost exponentially from his American Woman cover, through Fly Away, into a blistering, ballistic Are You Gonna Go My Way. In between, we get a varied but – there’s that word again – generic series of songs: Low, with its clipped but aimless funk; the lite disco of The Chamber; the not so much forgettable as forgotten piano ballad I’ll Be Waiting. It’s not until the powerhouse soul of a golden oldie that arrives well past the halfway mark, It Ain’t Over ’Til It’s Over, that we eventually hear a song as gorgeous as Kravitz is. At least, given his apparent access to the fountain of youth, he has plenty of years left to come back with a stronger set.\n\nMUSIC\n\nSimone Young Conducts Siegfried\n\nSydney Symphony Orchestra\n\nSydney Opera House, November 13\n\nReviewed by PETER McCALLUM\n\n★★★★★ After splintering a sword, killing a dragon and scaling a fire-covered mountain, not to mention waging a stentorian battle against 100 instrumentalists for 5½ hours, Simon O’Neill, as Siegfried, rose quietly to a top E, the orchestra now silent, to tell us that Siegfried had finally learnt the meaning of fear. You would not have guessed it from his pure pitch and tone, which was as radiant as in the great forging song he had sung in Act 1, where he had adorned the necessary lustiness that the rugged, folk-like lines demand with smooth strength and musical shape. Warwick Fyfe’s voice as Alberich seems to grow in elemental wildness and stature. Credit: Daniel Boud\n\nThis was a performance of astonishing stamina and commanding maturity that tempered power with lyricism, but, as the remaining half hour with Miina-Liisa Varela as Brunnhilde was to show, that was not all. Varela’s awakening lines over the hauntingly still, simple chords Wagner writes after so much crazed chromaticism, glowed with resplendent warmth, and she retained that lustre in each moment of the duet that followed. With intertwining phrases of fiery exultance, she and O’Neill brought this superb performance of the third instalment of Simone Young and the SSO’s concert presentation over four years of Wagner’s Ring cycle to an overpowering close. The quality of the singers Young has assembled has been an outstanding feature of the cycle to date, and Siegfried continued this with a cast that blended experience and freshness. Gerhard Siegel as Mime subtly burnished the edge of his voice towards malevolence, comedy, anger or oleaginous obsequiousness as needed, creating a mercurial gem out of the character’s sometimes tiresome peevishness. Conductor Simone Young’s experience with Wagner was clear right from the opening prelude. Credit: Daniel Boud As the world-wearied Wanderer (Wotan), Wolfgang Koch conjured a rounded nobility of tone in Act 1, inscrutable control in his standoff with the dwarf Alberich in Act 2 and a fiercely impassioned edge in his two great valedictory scenes in Act 3.\n\nWarwick Fyfe’s voice as Alberich seems to grow in elemental wildness and stature each time he appears in the role, and, with assistance of wonderfully dark, polished textures from the SSO brass, he and Koch created a formidable confrontation. Wotan’s scene with Erda embraces resignation rather than confrontation, and Noa Beinart sang this role with statuesque reserve and a shrouded tone of unvoiced mystery. If there really is an earth-goddess, one would want her to sing like that. Loading As the slumbering dragon, Fafner, Teddy Tahu Rhodes created cavernous echoes from the back of the stage and, after being slain, disarming directness from the front. Samantha Clarke sang the part of the Woodbird, the voice of nature that directs the naive Siegfried, with richly coloured silken sound, a refreshing change from the bell-like quality often used for this part. The other great glory of Young’s Ring presentations is to hear the orchestral part on full stage lavished with all the expertise, polish and care of the SSO under concertmaster Andrew Haveron. Horn player David Evans delivered Siegfried’s dragon-wakening call from the high organ loft with a coloured velvety finish, and throughout the wind and brass created many-shaded timbral complexity with moments blazing brilliance and fleeting brightness.\n\nViolas and lower strings brought even-toned depth to the important role Wagner gives these instruments in the opera’s darker textures, and the violins were both brilliantly energised in climaxes and admirably disciplined in quieter passages. The percussion players contributed piercing anvil sounds offstage and ominous and thunderous timpani. Young’s experience with this work was clear right from the opening prelude as she calibrated the pace to draw out tension and expressive moments, all the while maintaining magisterial continuity and flow. These Ring performances have been among the finest I have heard in the Opera House throughout its history. MUSIC\n\nAddison Rae\n\nEnmore Theatre, November 17\n\nReviewed by NADIA RUSSELL\n\n★★★★\n\nJudging by the reception for the first of her two Sydney shows, it’s clear Addison Rae is well on the way from TikTok star to pop princess. It’s a tough transition and she’s far from the first social media star to try to make it in the mainstream – many have stumbled – but this viral TikTok dancer and former Hype House member with millions of followers has talent and charm to burn. It hasn’t been a smooth transition. She tried acting, reality TV, make-up and clothing lines, and her initial music releases didn’t resonate. But last year’s hit single Diet Pepsi broke through and she followed it up with the album Addison earlier this year. Now, she has been nominated for a Grammy (best new artist) and her first headlining tour has produced mesmerising choreography and plenty of viral moments. Addison Rae is well on the way to making it in the mainstream. Credit: Gabrielle Clement If the silhouette of Rae coming out for the opener Fame Is a Gun with her headset mic doesn’t immediately evoke Britney Spears, then that is cemented by the second track I Got It Bad, which actually includes elements of Spears’ ...Baby One More Time. Scantily clad in black lingerie and donning a newscap over her pigtails, for a moment Rae seemed to perfectly channel Spears but without taking away from her own artistry and performance.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/don-t-believe-the-swipe-wallabies-have-flaws-but-are-still-a-team-to-believe-in-20251123-p5nhnb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Don’t believe the swipe: Wallabies have flaws but are still a team to believe in",
    "publish_date": "Sun, 23 Nov 2025 11:28:23 +1100",
    "category": "sports",
    "authors": [
      "Peter Fitzsimons"
    ],
    "text": "The fact that France matched it with three tries of their own in that first half was not surprising, but the news remained good. We were seeing signs of the team that came within an ace of beating the British and Irish Lions, beating South Africa. But with it also came the frustrations. France’s Gael Fickou runs with the ball. Credit: AP Time and again, the Wallaby lineout malfunctioned just when we needed it most. Once was for not throwing the ball in straight, a seriously unforgivable error. (How does that happen at this level?)\n\nThen, right on half time, with the French down a man for the sin bin, and the Wallabies with ball in hand, our fly-half Tane Edmed successfully kicked for the line. What? WHY? The whistle blew and the teams went into the sheds at 19-19. Despite errors like that, the match was there for the taking! Could we do it? We were certainly capable of it.\n\nBut in the second half? This time it was the penalties that ripped a hole in the side of the Wallaby battleship. Ten of them! Every time we were threatening the line, every time French lungs were screaming, their legs wobbling under Wallaby assaults, we gave away a penalty that released the pressure on them, and put the pressure right back on us. France took advantage early in the second half to score a try and a penalty to go to a 27-19 lead only for Australia to again demonstrate what they are capable, just what lethal weapons we actually have in our armoury.\n\nAfter a great steal by replacement hooker Josh Nasser, fullback Max Jorgensen charged down the left touch-line, expertly dribbled it just as the defence closed, to regather and go over in the corner. Try! Try! TRY! A try for your life, I’ll tell a man it is. Edmed slotted it over to close to 27-26 down. Australia’s Dylan Pietsch, left, and France’s Oscar Jegou contest possession. Credit: AP Alas, alas, alas, just when it seemed that a great an historic win might be on the cards – and just when our blokes had demonstrated what they are capable of - those cards fell the other way. Again the lineout malfunctioned when we needed it most, this time to an overthrow and the penalties took their toll.\n\nTwo French tries took them to 41-26 ahead, with seven minutes to go. What did we need? We needed, as a mate pointed out, Travis Head! Or at least we needed his like, to swagger on to the field with twitching handlebar moustache, some swaggering braggadocio, to single-handedly take the match in hand, with such derring-do it would kill a brown dog. We didn’t quite have him, though back-rower Fraser McReight’s bristling bearded and mustachioed form remained a feature throughout the closing phases as he had been through the whole match. When Josh Nasser went over with four minutes to go to make it 41-33, a miracle did not seem out of the question. Our blokes bloody-well deserved one, for the effort they had put in.\n\nAlas, yet more penalties ensued against the Wallabies and the French capitalised to score again and win the whole match 48-33. Oh what might have been! Loading Nevertheless, sneer if you must, but I repeat it: yes, the stats for the year are horrible. Yes, there remain consistent flaws in the Wallaby game whose very persistence – they know what these flaws are, but don’t fix them – but it changes nowt the salient fact. 2025 will be remembered as the year this Wallaby generation showed exactly what they were capable of, when they got it right.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/for-all-the-hype-ai-isn-t-transforming-our-economy-in-a-hurry-20251119-p5ngsx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "For all the hype, AI isn’t transforming our economy in a hurry",
    "publish_date": "Sun, 23 Nov 2025 11:00:23 +1100",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "What really matters to material standards of living in the long run is productivity – the economy’s output from its labour and capital. It’s easy to see why people think AI will do wonders for productivity one day, but it’s equally clear that we’re not there yet. Loading A recent article in the Reserve Bank’s Bulletin provides convincing evidence that suggests many Australian businesses are very much in the phase of figuring how they might use AI, rather than implementing detailed plans. The article, by economists Joel Fernando, Kate McLoughlin and Ravi Ratnayake, is based on insights from a survey of more than 100 medium to large businesses that the RBA speaks to in its liaison program. It found that while firms expect AI investments will make a meaningful difference in the future, many businesses’ adoption of AI today is still in its early, or even experimental, stages.\n\nNearly 40 per cent of firms said they had “minimal” adoption of AI tools, and in these cases, it was typically in the form of “digital assistants” such as Microsoft Copilot or ChatGPT. These are AI tools that can summarise your emails or help with research (often with dubious regard for facts), but they don’t look like productivity game-changers. The RBA’s survey found adoption of AI by Australian firms was “piecemeal”. Often it included staff using ChatGPT. Credit: Reuters Some of the firms surveyed said they were using AI more heavily, but these were generally larger businesses, and the economists said that for most firms “adoption has been shallow to date”. “Overall, many surveyed firms indicated that their adoption of AI tools to date has been relatively piecemeal, with adoption often being employee-led rather than employer-led,” the RBA economists said. But what about the fears of an AI “jobpocalypse”?\n\nThe RBA data doesn’t reflect the wider labour market, and of course, the effect of AI will change from job to job. Even so, the survey and other evidence suggest AI has had a pretty modest impact on staffing so far. Firms surveyed said “most” workers displaced by technology (including AI) had been moved to other jobs in the same employer, though the businesses expected a more “disruptive” impact from AI in the future. About half the surveyed firms expected AI would lead to a “slight” reduction in their total staff over the next three years, due to factors such as natural attrition, hiring fewer new workers, redundancies, or a combination of all three. Westpac chief economist is asked more about AI than her view on interest rates. Credit: Renee Nowytarger Many workers are rightly concerned about the risk of AI to their jobs – no least in industries such as mine, the media – and these findings don’t put those fears to bed. But they do suggest any dramatic changes are still some way off. It’s also one thing for companies to say they plan to cut costs thanks to new technology, but another to do it without creating a gap in their operations. The Commonwealth Bank infamously said it was cutting 45 jobs earlier this year because the roles were being replaced with AI-powered chatbots, only to later backflip.\n\nThe wider economic point is that big technological changes in the past have created new jobs and businesses, as well as wiping some out. That may well happen with AI-related changes, too, but no one knows for sure and it’s likely to be debated for years to come. And that’s another over-arching theme in the RBA research: companies are just very uncertain about the potential use cases for AI, whether they’ll have enough skilled staff, the potential cost, or how it will be regulated. Might AI usher in a new era of rapid productivity growth, reversing a long-running slump? Maybe, but chances are it won’t happen quickly. This uncertainty matters because if AI is really going to transform our economies, businesses are going to have to make major changes to how they operate. Those who are convinced that AI is the next big thing have compared it with some of the biggest technological changes in modern history, such as the invention of the steam engine, electrification, the rise of automobiles or the internet.\n\nMaybe they’re right – but economists also know that these changes did not happen quickly. Loading Moving to electricity, for example, required factories to be overhauled, not to mention infrastructure such as power lines. Or, in a more recent example, it took years for the gain in productivity from computers to be evident. As economist Robert Solow, a Nobel Prize winner, famously said in 1987: “You can see the computer age everywhere but in the productivity statistics.” To get big productivity gains from AI, companies will have to re-examine all their processes and staffing to see how AI could transform their businesses. That takes time, it costs money and it’s likely to require a lot of re-training of staff and potentially hiring more people.\n\nEven though it’s early days, there’s clearly a huge amount of interest in AI in the business world. The fact bosses of big companies constantly tell the market about their AI plans tells us many businesses are indeed planning how they can make the most of the technology. Westpac chief economist Luci Ellis says businesses she speaks to have moved beyond “experimenting” – indeed she’s asked more about AI than she is about her view on interest rates. While Ellis thinks the productivity benefits of AI will appear more quickly than the time it took for computers and the internet to appear in the productivity statistics, it will still take a while. “We’re talking two or three years, not three weeks,” she says. Might AI usher in a new era of rapid productivity growth, reversing a long-running slump? Maybe, but chances are it won’t happen quickly. One thing we can be more confident about is that we won’t get a productivity surge from ChatGPT summarising emails for us. The changes will have to be a lot more profound than that.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/one-dead-four-fighting-for-life-after-horror-house-fire-20251123-p5nhnc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "One dead, four fighting for life after horror house fire",
    "publish_date": "Sun, 23 Nov 2025 10:42:23 +1100",
    "category": "finance",
    "authors": [],
    "text": "One dead, four fighting for life after horror house fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/self-immolation-on-an-almost-unconscionable-scale-how-england-unravelled-20251123-p5nhnw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Self-immolation on an almost unconscionable scale: How England unravelled",
    "publish_date": "Sun, 23 Nov 2025 09:51:46 +1100",
    "category": "sports",
    "authors": [
      "Oliver Brown"
    ],
    "text": "It was a wonder, in all honesty, that the travelling fans were not in a mutinous mood. Many have poured pensions and life savings into making this journey, all to witness England surrender a wonderful overnight position and be blown away in the first two-day Ashes Test for 104 years. If you were being kind, you would call this a systemic failure from a batting perspective. Except England seems not to be adhering to any system at all. Why was Root, normally so cultured and composed, trying to slash Starc through cover? How did England, leading by 105 with nine wickets in hand, self-destruct in such lurid fashion when Australia had just one of their premier strike bowlers? Starc, with 10 wickets for the match, was extraordinary, as lethal as England were hapless. So, too, was Travis Head, blazing to a Test century off just 69 balls, a scoring rate that no Bazballer has yet managed. The humiliation was so total that you fear the potential tailspin to come, with Pat Cummins waiting to be unleashed in Brisbane.\n\nEngland’s across-the-board malfunction turned a likely victory into a ghastly humiliation in a mere 46.4 overs. Nowhere were the problems more vividly illustrated than with the bat, where, on an increasingly placid pitch, they failed to reach 200 once more. While the logic was that Crawley should, despite his flakiness, be a natural fit for the Ashes, his pair suggested such faith was misplaced. A man who has played 59 Tests has now been out in single figures in 41 per cent of the innings he has played. At the top of the order, he has become a liability, with his almost blasé attitude setting the tone for the catalogue of horror that follows. Ben Stokes and England continue to play in their own style. Credit: Getty Images You can be seduced into admiring Ben Duckett’s restless urge to keep the scoreboard ticking over, but what use is this when he fails even to make half-centuries? As for Ollie Pope, what is he doing to justify his place at No.3 when, having played himself in twice, he does nothing to capitalise? It felt briefly as if Gus Atkinson’s gung-ho cameo, stretching England’s lead to over 200, might offer a reprieve, but it was all just needless embroidery on a fiasco.\n\nThe hope was that the bowlers would bail them out again. But as ever, it is the hope that kills, with a swaggering Travis Head savaging England’s attack, the express pace of Jofra Archer and Mark Wood leaving barely a dent on him. When eventually he was caught in the deep for 123, he twirled his bat several times in the air, which could be interpreted either as a salute to the home fans or as a taunt to England. England deserved nothing less than mockery for this performance. Frankly, England deserved nothing less than mockery for this performance. It was not just a capitulation but an affront, both to the very basics of Test cricket and to the supporters who have spent fortunes expecting at least a semblance of a battle. Unfortunately, the notion of “fail to prepare, prepare to fail” is alien to the Bazball credo. England’s trust in their own methods under Stokes and head coach Brendon McCullum is so absolute that any dissent is treated as tantamount to heresy.\n\nThis time, they deserve all the opprobrium they receive. Against an ageing Australia, denuded of both Cummins and Josh Hazlewood, they imagined it would be adequate preparation to play a solitary three-day warm-up against the England Lions at Lilac Hill. What type of warm-up was this for a series by which the success of their philosophical reset would be judged? As ever, they disdain these questions. They maintain their devil-may-care abandon, irrespective of the circumstances. This is the way we play, they shrug. It is also the way they produce the ultimate Ashes nightmare. Wicket-by-wicket: England’s collapse England threw away a position of potential dominance when they lost four wickets in 19 balls, amid a six-wicket collapse from 1-65 for one to 5-88. A few hours later, they lost the first Test.\n\nDuckett – c. Smith, b. Boland Over 16.2 (England 2-65). With England sitting pretty on a lead of 99, having lost only one second-innings wicket, it was a slight surprise that Australia did not turn back to Mitchell Starc straight after lunch. Lyon was off the field, and Cameron Green got his first bowl of the innings. At the other end, Boland continued, and his first ball to Duckett was a beauty, which was snaffled low at slip by the safe hands of Steve Smith. Pope – c. Carey, b. Boland Over 18.3 (England 3-76). In Boland’s next over, he offered Pope a full tempter outside off stump. He could not resist a big drive, which Alex Carey pouched. Brook – c. Khawaja, b. Boland\n\nOver 18.6 (England 4-76). Out walked Harry Brook, who respectfully defended his first two balls, before running out of patience. His third, the last of the over, was edged to first slip. Loading It was an ugly dismissal, made worse by how good Brook had looked on day one. Brook has replaced Pope as vice-captain, and this was the moment for a bit of clear-headed leadership. Brook could not provide it. Root – b. Starc Over 19.2 (England 5-76). The worst, remarkably, was still to come. Root, the designated driver of the Bazball operation, got sucked into the madness. With Root and Ben Stokes at the crease, Starc – eight wickets in the match to this point – was brought back. His second ball was a wide tempter, and Root, to that point comfortable, tried to nail it through cover. An inside edge clattered into his stumps.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/stay-inside-stay-safe-chief-minister-issues-message-for-territorians-20251123-p5nhnu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Stay inside, stay safe': Chief Minister issues message for Territorians",
    "publish_date": "Sun, 23 Nov 2025 09:12:16 +1100",
    "category": "finance",
    "authors": [],
    "text": "'Stay inside, stay safe': Chief Minister issues message for Territorians\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw12-brighton-vs-brentford-20251123-p5nhnr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Brighton vs Brentford",
    "publish_date": "Sun, 23 Nov 2025 09:08:57 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW12: Brighton vs Brentford\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw12-liverpool-vs-nottm-forest-20251123-p5nhnq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Liverpool vs Nott'm Forest",
    "publish_date": "Sun, 23 Nov 2025 09:08:37 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Liverpool vs Nott'm Forest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw12-burnley-vs-chelsea-20251123-p5nhnp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Burnley vs Chelsea",
    "publish_date": "Sun, 23 Nov 2025 09:08:27 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Burnley vs Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw12-bournemouth-vs-west-ham-20251123-p5nhns.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Bournemouth vs West Ham",
    "publish_date": "Sun, 23 Nov 2025 09:08:12 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW12: Bournemouth vs West Ham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw12-fulham-vs-sunderland-20251123-p5nhnn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Fulham vs Sunderland",
    "publish_date": "Sun, 23 Nov 2025 09:07:25 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Fulham vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw12-wolves-vs-crystal-palace-20251123-p5nhno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Wolves vs Crystal Palace",
    "publish_date": "Sun, 23 Nov 2025 09:06:52 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Wolves vs Crystal Palace\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw12-newcastle-vs-man-city-20251123-p5nhnm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW12: Newcastle vs Man City",
    "publish_date": "Sun, 23 Nov 2025 09:06:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW12: Newcastle vs Man City\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  }
]