[
  {
    "url": "https://www.9news.com.au/world/pope-leo-xiv-possible-implications-behind-name/3d057992-483a-4a62-ab81-f4ce6212b40f",
    "title": "What's in a name? Pope Leo XIV's choice signals priorities",
    "publish_date": "Fri, 09 May 2025 01:34:58 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Pope Leo XIV's choice of name signals a commitment to social justice that is very much in line with the late Pope Francis' global ministry.\n\n\"I think a lot of us had a question mark when they elected an American, and then he selected the name Pope Leo XIV,\" said Natalia Imperatori-Lee, the chair of religious studies at Manhattan University.\n\n\"It really means to me he will continue the work of Leo XIII.\"\n\nLIVE UPDATES: Vatican names first American Pope Leo XIV ﻿\n\nNewly elected Pope Leo XIV chose a name with multiple resonances. (AP)\n\nPope Leo XIII, who was head of the Catholic Church from 1878 to 1903, laid the foundation for modern Catholic social thought, most famously with his 1891 encyclical Rerum Novarum, which addressed workers' rights and capitalism at the dawn of the industrial age.\n\nHe criticised both laissez-faire capitalism and state-centric socialism, giving shape to a distinctly Catholic vein of economic teaching.\n\nThe name \"is a deep sign of commitment to social issues,\" said Imperatori-Lee.\n\nPope Leo XIII led the Catholic Church from 1878 until 1903. (Nine)\n\n\"I think this (new) pope is saying something about social justice, by choosing this name, that it is going to be a priority. He is continuing a lot of Francis' ministry,\" she said.\n\nVatican spokesman Matteo Bruni confirmed that choice of the name Leo was a reference to Leo XIII and the social doctrine of the church, in particular the Rerum Novarum encyclical, considered the Catholic Church's first social encyclical.\n\nAnother predecessor, Pope Leo I, was known for repelling the barbarian invasion of Atilla the Hun in 452 CE and dissuading him from sacking Rome through diplomacy, Italian Cardinal Mauro Piacenza told RAI Italian state TV.\n\nA portrait of Pope Leo I by Francisco de Herrera. (Supplied)\n\nHe also noted that Pope Leo XIII elevated the Sanctuary of Our Lady of the Rosary of Pompeii to a papal basilica in 1901.\n\nLeo could also refer to Brother Leo, the 13th century friar who was a great companion of Saint Francis of Assisi. By choosing such a name, the new pope could be signaling also a very strong continuity with Francis, who named himself after the saint.\n\nFor most of the Catholic Church's first millennium, popes used their given names. The first exception was the 6th century Roman Mercurius, who had been named for a pagan god and chose the more appropriate name of John II.\n\nWhite smoke billows from Sistine Chapel chimney as new pope elected View Gallery\n\nThe practice of adopting a new name became ingrained during the 11th century, a period of German popes who chose names of early church bishops out of \"a desire to signify continuity,\" according to Reverend Roberto Regoli, a historian at Rome's Pontifical Gregorian University.\n\nFor many centuries, new popes tended to choose the name of the pope who had elevated them to cardinal. John was the most popular, chosen by 23 popes, followed by Benedict and Gregory, each with 16.\n\nIt was from the mid-20th century that new popes began to choose names signaling the aim of their papacy, Regoli said.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/real-estate-costar-to-buy-domain/8145c018-3383-41bb-91f4-be0aa550ab6a",
    "title": "US real estate giant CoStar to buy Domain in $3 billion deal",
    "publish_date": "Fri, 09 May 2025 01:05:20 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Australian real estate website Domain will be sold to U﻿S real estate giant CoStar in a deal worth almost $3 billion.\n\nNine, the publisher of this website, owns 60 per cent of Domain and will receive around $1.4 billion if the deal is approved.\n\nIn a statement to shareholders this morning, Domain ﻿said it had entered into a scheme implementation deed with CoStar for it to acquire 100 per cent of the company at $4.43 a share.\n\nREAD MORE: ﻿ Sussan Ley sets up Liberal leadership battle with Angus Taylor\n\nAustralian property website Domain will be sold to CoStar in a deal worth $2.8 billion. (Domain.com.au)\n\nCoStar bought 16.9 per cent of Domain in February and has been engaged in due diligence for several weeks to assess the viability of acquiring the rest of the business.\n\nIn a statement to its shareholders, Nine said it supports the takeover bid and intends to vote in its favour.\n\n\"﻿As the controlling shareholder of Domain and with a focus on the best interests of Nine shareholders, Nine supports Domain's decision to enter into the Scheme Deed,\" the market notice reads.\n\nNine CEO Matt Stanton has signalled it supports the proposal by CoStar. (Dominic Lorrimer)\n\n\"Following a comprehensive review process, the Board of Nine has determined that the Transaction appropriately reflects the strategic value of Nine's interest in Domain.\n\n\"Noting the unanimous recommendation of the Domain Board, Nine intends to vote all of the Domain shares it holds or controls in favour of the Scheme in the absence of a superior proposal and subject to an Independent Expert concluding, and continuing to conclude, that the Scheme is in the best interests of Domain shareholders.\"\n\nThe takeover, if approved, is expected to take place in the third quarter of 2025.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/liberal-party-deputy-leader-sussan-ley-to-contest-leadership-election/3387e0aa-f73f-4aa8-a371-cf54843d4920",
    "title": "Sussan Ley sets up Liberal leadership battle with Angus Taylor",
    "publish_date": "Thu, 08 May 2025 23:17:24 +0000",
    "category": "sports",
    "authors": [
      "May"
    ],
    "text": "Taylor confirmed he was throwing his hat into the ring to the\n\nAustralian Financial Review\n\n, saying Price was a great addition to the Liberal ranks.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/new-zealand-sheep-numbers-nz-still-has-more-sheep-than-people-but-humans-are-catching-up/555b691b-d57f-4083-9107-b905157bb773",
    "title": "Yes, NZ still has more sheep than people. But humans are catching up",
    "publish_date": "Thu, 08 May 2025 12:35:52 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The vast number of sheep in New Zealand relative to the country's scant human population has long been the subject of jokes aimed at New Zealanders abroad. It's true: The country is one of a handful in the world that's still home to more sheep than people.\n\nBut humans are catching up, according to new figures released Tuesday. With a population of 23.6 million sheep and 5.3 million people, there are about 4.5 sheep for each New Zealander, government statistics agency data showed.\n\nThat's down from 22 sheep per person in 1982, when farming sheep for meat and wool was New Zealand's biggest earner. Now, years of falling wool prices prompted by a global shift to synthetic fibres have led farmers to change what they do with their land, the sector's biggest lobby group said.\n\nFarmer Ross Turner feeds his sheep hay in his snow-covered paddocks on the outskirts of Christchurch, New Zealand, July 12, 2017. (AP Photo/Mark Baker, File)\n\nA shrinking flock\n\nBy land area, New Zealand is about the size of the United Kingdom, but it has a human population 13 times smaller than the UK. That means there's plenty of room for sheep.\n\nFor close to 150 years, the sheep industry was the backbone of New Zealand's economy and numbers boomed — peaking in 1982 when there were more than 70 million sheep and just 3.2 million people.\n\nBefore Lord of the Rings brought waves of tourists to the country, images of green fields filled with placid sheep against backdrops of snow-capped mountains dominated the country's marketing abroad.\n\nBut over years of decline for global wool prices since — and despite recent rallies — the national flock has steadily diminished.\n\nNow dairy holds the biggest share of New Zealand's agriculture and horticulture-dominant export market.\n\nFarm manager Josh Jackson musters sheep on Withers Farm in Kaipara Flats on May 25, 2023, in Auckland, New Zealand. Josh (Getty)\n\nFarmers try something new\n\nIn 2023, Stats NZ, a government agency, said New Zealand in 2022 dipped below five sheep per person for the first time.\n\nThe national flock had lost a million more sheep in Tuesday's figures, which recorded livestock numbers as of June 2024.\n\nToby Williams, a spokesperson for sector lobby group Federated Farmers, said sheep farmers have switched to more lucrative pursuits — dairy, or the conversion of land from farming to pine forestry in order to sell carbon offsets.\n\n\"If I'm really honest, the wool industry is almost at that tipping point, if not already there, of not having a wool industry anymore,\" he said.\n\nREAD MORE: Mum revealed as woman under guard over deadly fire\n\nMeasures to bolster wool\n\nThe government has drawn up measures intended to slow the decline, including an announcement in 2024 that they will place limits on the scale of farmland that can be converted to carbon forestry.\n\nNew government procurement guidelines launched in April urge the use of New Zealand wool products — such as carpets and insulation — in newly constructed or refurbished public buildings. But those measures are not expected to halt declining sheep numbers.\n\nAustralia — the source of most of the sheep jokes about New Zealanders — is also home to more sheep than people, but the national flock is shrinking too.\n\nThe gap is slimmer: There are about three sheep per Australian.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/trump-teases-major-trade-deal-thursday/be4204ab-badb-4c03-b12b-be3d0410cb76",
    "title": "Trump names UK in 'major trade deal' with 'big and highly respected country'",
    "publish_date": "Thu, 08 May 2025 16:21:08 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "US President Donald Trump has agreed to cut tariffs on UK vehicles, steel and aluminium in a planned trade deal with Britain, which would buy more American beef and streamline its customs process for goods from the US.\n\nThe symbolically resonant agreement announced on Thursday (early Friday AEST) still has yet to be finalised, but it suggested that Trump was still able to negotiate with other countries after his vast set of tariffs stoked fears around the world of an economic downturn and higher inflation.\n\nThe announcement provided a political victory for UK Prime Minister Keir Starmer and offered a degree of validation for Trump's claims that his turbulent approach on trade may be able to rebalance the global economy on his preferred terms.\n\nPresident Donald Trump speaks on the phone to Britain's Prime Minister Keir Starmer on a trade deal between the US and United Kingdom in the Oval Office of the White House, on Thursday, May 8, 2025, in Washington. (AP Photo/Evan Vucci)\n\nThe US president talked up the agreement to reporters from the Oval Office, even as the fine print remained in flux despite his prior statements that a full agreement was signed.\n\n\"The final details are being written up,\" Trump told reporters.\n\n\"In the coming weeks, we'll have it all very conclusive.\"\n\nThe president said that the agreement would lead to more beef and ethanol exports to the UK, which would also streamline the processing of US goods through customs.\n\nCommerce Secretary Howard Lutnick said the baseline 10 per cent tariffs would stay in place, while UK officials said that Trump's auto tariffs would go from 27.5 per cent to 10 per cent on a quota of 100,000 vehicles and the import taxes on steel and aluminium would go from 25 per cent to zero.\n\nTrump cautioned that the agreement with its preservation of a 10 per cent tariff was not a template for other countries pursuing possible trade deals with the US.\n\nBritain's Prime Minister Keir Starmer speaks on the phone to US President Donald Trump at a car factory in the West Midlands, Thursday, May 8, 2025. (AP Photo/Alberto Pezzali, Pool)\n\nHe said he intends to charge higher rates on other countries as part of any agreement — a sign that the import taxes could stay in place in ways that economists warn would reduce economic growth.\n\n\"That's a low number,\" Trump said of his 10 per cent tariff rate.\n\nStarmer, speaking over the phone to Trump, stressed the importance of the relationship between the two countries as the anniversary of the World War II victory in Europe was being commemorated.\n\n\"To be able to announce this great deal on the same deal 80 years forward, almost at the same hour and as we were 80 years ago with the UK and the US standing side by side, I think is incredibly important,\" Starmer said.\n\nStarmer later spoke to workers at a Jaguar Land Rover plant and touted the deal, which he said would protect thousands of auto jobs. He told the workers \"this is just the start\".\n\nShipping containers wait to be processed at London Gateway port, in Stanford-le-Hope, on the Thames estuary east of London, England, Wednesday, February 5, 2025. (AP Photo, File)\n\n\"We are hammering out further details to reduce barriers to trade with the United States and across the world,\" he said.\n\nThe planned deal was the first outlined since Trump began his stutter-step efforts to rewire the global economy by dramatically increasing import taxes in an attempt to increase domestic manufacturing.\n\nThe Republican president quickly rolled out tariffs after returning to the White House, targeting traditional allies such as the UK with import taxes on steel, aluminium and autos.\n\nTrump announced near universal tariffs on April 2, then partially retreated a week later and announced that his administration would seek individual agreements with various countries over the next few months.\n\nSteel rods produced at the Gerdau Ameristeel mill in St Paul, Minnesota, await shipment, May 9, 2019. (AP Photo/Jim Mone, File)\n\nThe US already runs a trade surplus with the UK, making it a bit easier to find common ground as Trump has staked his tariffs on specifically eliminating the annual trade deficits with multiple nations he says have taken advantage of the US.\n\nNo new deals have been reached with America's largest trading partners, including Canada, Mexico and China. Trump has left the highest tariffs in place on China, sparking a confrontation between the world's two biggest economies. Washington and Beijing are sending officials to Switzerland this weekend for an initial round of trade talks.\n\nTrump promised on Thursday that there are \"many other deals, which are in serious stages of negotiation, to follow!\"\n\nThe US and the UK have been aiming to strike a bilateral trade agreement since the British people voted in 2016 to leave the European Union, allowing the country to negotiate independently of the rest of the continent. Then-Prime Minister Boris Johnson touted a future deal with the US as an incentive for Brexit.\n\nNegotiations started in 2020, during Trump's first term. But the talks made little progress under The-President Joe Biden, a Democrat and a critic of Brexit. Negotiations resumed after Trump returned to office in January and intensified in recent weeks.\n\nCelebrity Trump supporters now turning on the US president View Gallery\n\nA major goal of British negotiators has been to reduce or lift the import tax on UK cars and steel, which Trump set at 25 per cent. The US is the largest destination for British cars, accounting for more than a quarter of UK auto exports in 2024, according to the Office for National Statistics.\n\nBritain has also sought tariff exemptions for pharmaceuticals, while the US wants greater access to the British market for agriculture products.\n\nStarmer's government has said it won't lower UK food standards to allow in chlorine-rinsed American chicken or hormone-treated beef.\n\nThe British government will see a deal as a vindication of Starmer's emollient approach to Trump, which has avoided direct confrontation or criticism. Unlike the European Union, Britain did not announce retaliatory tariffs on US goods in response to Trump's import taxes.\n\nA trade deal with the United Kingdom would be symbolically important and a relief for British exporters. But an agreement would do little to address Trump's core concern about persistent trade deficits that prompted him to impose import taxes on countries around the world.\n\nThe US ran a $US11.9 billion ($18.5 billion) trade surplus in goods with the UK last year, according to the Census Bureau. The $US68 billion ($105.9 billion) in goods that the US imported from the UK last year accounted for just 2 per cent of all goods imported into the country.\n\nThe US is much more important to the UK economy. It was Britain's biggest trading partner last year, according to government statistics, though the bulk of Britain's exports to the US are services rather than goods.\n\nPresident Donald Trump arrives on Air Force One at Joint Base Andrews, Md., Sunday, May 4, 2025. (AP Photo/Manuel Balce Ceneta) (AP)\n\nTrump has previously said that his leverage in talks would be US consumers, but he appeared to suggest that the UK would also start buying more American-made goods.\n\n\"I think that the United Kingdom, like every other country, they want to ... go shopping in the United States of America,\" he said.\n\nA trade deal with the US is one of several that Starmer's government is seeking to strike. On Tuesday, Britain and India announced a trade agreement after three years of negotiations.\n\nThe UK is also trying to lift some of the barriers to trade with the EU imposed when Britain left the bloc in 2020.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/kevin-rudd-mocks-donald-trump-movie-tariffs/d14673fd-bb96-42d0-b596-6a65e05a17e7",
    "title": "'Don't tax Bluey': Australian ambassador takes aim at Trump film tariffs",
    "publish_date": "Wed, 07 May 2025 22:44:51 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "\"I don't think we want to see a tax on\n\nBluey\n\n,\" the former prime minister said.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/mothers-day-when-you-re-struggling-with-infertility/105233238",
    "title": "Getting through Mother's Day if you're struggling with infertility",
    "publish_date": "Fri, 09 May 2025 01:57:20 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Just weeks before Mother's Day last year, Alisha Waters and her husband were told they would be unlikely to conceive children.\n\n\"[Our fertility specialist] diagnosed me with endometriosis and said that was impacting my fertility, and that my husband's sperm was essentially useless,\" the 33-year-old from Melbourne/Naarm recalls.\n\nShe says Mother's Day was a particularly tough time.\n\n\"I worked that day, and there were a lot of people at work celebrating Mother's Day.\n\n\"One woman wished me a happy Mother's Day. I said, 'Thanks, but I don't have any kids', and she said 'Well, happy Mother's Day for the future'.\n\n\" It was really hard to hear a month after I found out I was never going to have kids. \"\n\nThere are many reasons people may find Mother's Day difficult, including child loss, the death of a parent, or strained relationships.\n\nPeople experiencing infertility may find themselves torn between grief and wanting to celebrate the mums in their life. (Unsplash)\n\nFertility reproductive counsellor Narelle Dickinson says the celebration can also be triggering for people who have experienced infertility or are trying for a baby.\n\n\"For a day or a month which celebrates motherhood so obviously and publicly, it can feel like a real marker of a dream that hasn't been achieved,\" says Ms Dickinson, based in Brisbane/Meanjin.\n\n\"It can feel almost like a personal attack.\"\n\nSupport for infertility and childlessness World Childless Week (for counsellors, therapists and support networks)\n\n(for counsellors, therapists and support networks) COPE (for connections to specialist support) 1300 740 398\n\n(for connections to specialist support) 1300 740 398 PANDA (for expecting, new and growing families) 1300 726 306\n\n(for expecting, new and growing families) 1300 726 306 Lifeline on 13 11 14\n\non 13 11 14 Beyond Blue on 1300 224 636\n\non 1300 224 636 Red Nose Grief and Loss 24/7 Support Line on 1300 308 307\n\nGrief and Loss 24/7 Support Line on 1300 308 307 Bears of Hope (infant loss support for families) on 1300 114 673\n\n'Invisible grief'\n\nThe \"invisible grief\" of infertility means it's easily overlooked around Mother's Day, says Ms Dickinson.\n\n\"There is so much media marketing around Mother's Day; you can't go to the shops without seeing signage everywhere.\n\n\"Having to go to the family do, and watch everyone else do all the lovely Mother's Day things, when they are unable to have that same celebration — it feels extremely painful.\"\n\nNicole Highet is the CEO and founder of COPE (the Centre of Perinatal Excellence) and says childlessness and infertility can be a \"very isolating experience\".\n\n\"Mother's Day is a reminder of what you don't, or can't, have. You feel like you can't talk about it.\"\n\nShe says people might feel distressed around this time, experiencing feelings of grief, sadness and even anger.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nRomney Hamilton from Sydney/Gadigal Country had four cycles of IVF. She and her husband Glen lost a pregnancy on their first transfer.\n\nThey made the decision to stop IVF in 2023.\n\n\"We were about to start our fifth round when my dad died,\" 40-year-old Romney says.\n\n\"The emotional toll and grief surrounding his death made it clear to me that I couldn't take on another round and that I wanted to get on with my life.\"\n\nRomney Hamilton and her husband decided to stop IVF after four rounds. (Supplied)\n\nShe says their decision to \"move forward\" means their pain is often unseen on Mother's Day.\n\n\" The waves of grief from infertility come and go, but they are more apparent on days like Mother's Day and people forget so easily. \"\n\nMs Dickinson says International Bereaved Mother's Day, held on the first Sunday in May, can help those who have experienced loss feel seen.\n\n\"It's an acknowledgement for families who have had pregnancy or child loss.\"\n\nTaking care when Mother's Day is hard Photo shows An old film photo of Danielle Snelling and mum (Rosa); they wear white and smile to the camera. Seeing pictures and messages of people celebrating Mother's Day online can be difficult for those who have lost a mum or a child, are experiencing infertility, or have a strained relationship with their mum.\n\n'I'll be a mother by Mother's Day'\n\nFor those who are trying to conceive, Ms Dickinson says Mother's Day is a milestone that can remind them they're \"not there yet\".\n\n\"All of these major holidays or celebrations tend to mark another year or milestone of when someone expected they would be pregnant or have had a child.\n\n\"People do the 'I'll have a baby by Christmas', 'I'll have a baby by my birthday', 'I'll be a mother by Mother's Day', so when those milestones roll around and we're not there, it emphasises that in a very painful way.\"\n\nPeople may also experience pressure from family and friends, and intrusive questions about how their fertility journey is going.\n\nThe grief of childlessness on Father's Day Photo shows Michael Hughes sitting in a restaurant, smiling to the camera and clasping his hands together. Michael Hughes had always imagined being a dad, but it didn't eventuate for him. Father's Day is especially painful, as it was the day his wife had a miscarriage almost two decades ago.\n\nTaking care around this time\n\nWhile managing your social media intake around Mother's Day to avoid displays of motherhood can be a good idea, Ms Highet suggests you might also find support online.\n\n\"Hearing of other people's stories can let people know they are not alone.\"\n\nFacebook support groups and other networks including World Childless Week and The Truth are some examples.\n\nMs Dickinson says it's OK to set boundaries and let people know you might need to withdraw around this time.\n\n\"You may feel like you don't want to participate [in celebrations] to protect yourself.\"\n\nRomney says she is learning to cope, focusing on celebrating her mum and sister, while still acknowledging her own grief.\n\n\"We can be happy for other people but also sad for ourselves.\n\n\"Mother's Day is a beautiful celebration, but unless a person goes through loss and infertility, it's very hard to understand the depth of pain that comes with it.\"\n\nAlisha will be holidaying in France on Mother's Day.\n\n\"I even told my husband, 'Thank God I won't be here for Mother's Day'.\n\n\"I like it for other people, but at the same time I don't want people to say stupid things.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/british-and-irish-lions-test-squad-who-is-selected-match-dates/105177472",
    "title": "A ringer, a Rebel and two Aussies are named for the British and Irish Lions",
    "publish_date": "Fri, 09 May 2025 01:56:08 +0000",
    "category": "sports",
    "authors": [],
    "text": "The British and Irish Lions squad has been announced for the upcoming tour of Australia, ending months of speculation about who would be named.\n\nThe 38-strong touring party features 15 Ireland players, 13 from England, eight from Scotland and just two from Wales.\n\nEngland's lock and two-time Lions tourist Maro Itoje is captain.\n\nCoach Andy Farrell, the Englishman in charge of Ireland, had some desperately tough choices to make, but has selected a very strong squad to tour Down Under.\n\nHere's the list of players rugby fans will become acquainted with over the next couple of months.\n\nForwards\n\nProp: Zander Fagerson (SCO) Zander Fagerson. ( ) Glasgow Warriors & Scotland | 75 caps (3 tries) | 4 appearances on 2021 tour, 0 caps 29yo, Perth, SCO | 188cm/126kg A Glasgow Warriors stalwart, Fagerson is one of the most-reliable performers in Scotland's ever-improving side. Never one to take a backward step, the west coast product is the sort of player that you want to have in your side, which is where he will likely be if there's any possibility of things getting out of hand. However, a calf injury he suffered in the lead-up to Glasgow's URC match against Zebra did put his touring participation in doubt, with Warriors coach Franco Smith telling reporters that the issue would rule him out until late June. Prop: Tadhg Furlong (IRE) Tadhg Furlong. ( ) Leinster & Ireland | 79 caps (5 tries) | 6 Lions Test caps 32yo, Wexford, IRE | 183cm/119kg Tadhg Furlong is one of the premier tight head props in the world, so there was never a doubt that he would be named to his third Lions touring team. Or was there? The 32-year-old missed all but one of Ireland's underwhelming Six Nations campaign and its entire series of autumn internationals with troublesome hamstring and calf injuries, playing just 33 minutes of international rugby since July last year. Battling these re-occurring injuries has been tough and there has to be an acceptance that his body is not capable of the repeat efforts it was in his 20s. But this monster of a presence in the front row has earned his spot on tour despite the lack of game time in recent months and will likely be a pillar of strength come Test time too. Prop: Ellis Genge (ENG) Ellis Genge. ( ) Bristol Bears & England | 71 caps (5 tries) | Lions tour debut 30yo, Bristol, ENG | 187cm/116kg Ellis Genge is passion personified in an England shirt — and you'd expect the Bristolian to bring all and that and more Down Under with the Lions as well. A man who walks the walk as much as he talks the talk, Genge is as mobile as they come and a hugely impressive scrummager to boot, adding yet another mark to the Lions' impressive scrum stocks on this tour — in 2022 he was named World Rugby loosehead prop of the year. Genge scored one of his rare international tries against the Wallabies in Perth in 2022, albeit in a 28-30 defeat, but will have happy memories of that tour as Eddie Jones's tourists secured a 2-1 series victory. Prop: Andrew Porter (IRE) Andrew Porter. ( ) Leinster & Ireland | 75 caps (6 tries) | Named to tour in 2021 29yo, Dublin, IRE | 183cm/123kg One of the hardest-working players on the field, Leinster stalwart Andrew Porter was tireless throughout Ireland's Six Nations campaign. He hit 99 rucks — 22 more than any other prop — and made 52 tackles in the Championship — one of just two props to pass 50. Porter was named to tour with the Lions in 2021 but did not make it to South Africa after suffering a toe injury in the lead-up. He will see this as being an opportunity to make up for lost time and the missed opportunity that got away from him through no fault of his own four years ago. Prop: Pierre Schoeman (SCO) Pierre Schoeman. ( ) Edinburgh & Scotland | 42 caps (6 tries) | Lions tour debut 31yo, Mbombela, RSA | 180cm/118kg One of Scotland's South Africa-born contingent, Schoeman has confirmed himself as one of Scotland's key performers as Gregor Townsend's boys raised themselves into the conversation. A former Springbok U20 international and ex-skipper of the Springbok schoolboys team, Schoeman made his debut for Scotland in 2021 after qualifying on residency grounds, having moved to Edinburgh in 2018. A monster at scrum time and devastating in the loose, it's easy to see why Schoeman is a fan favourite north of Hadrian's Wall and could be in with a very decent shout of wearing the number one jersey in Brisbane when the first Test comes around. Prop: Will Stuart (ENG) Will Stuart. ( ) Bath & England | 50 caps (3 tries) | Lions tour debut 28yo, London, ENG | 189cm/127kg Will Stuart is dangerous in the loose as well as solid at scrum time. ( ) Will Stuart had a superb Six Nations campaign for England, pushing his case with a number of assured displays. Given that the tight-head was under enormous pressure to keep his spot in the England team after a very disappointing tour of New Zealand that saw him left off the list of centrally contracted players, his resurgence has been all the more impressive. Starting at the back end of 2024, England's scrum has gone from strength-to-strength, devastating their opponents in the close confines of hand-to-hand combat that typifies the tight five. An ancient history buff who acknowledges he's happier with a lower profile than some of his front row partners, Stuart is a deserving tourist and should make his mark in the Test team. Hooker: Luke Cowan-Dickie (ENG) Luke Cowan-Dickie. ( ) Sale Sharks & Ireland | 49 caps (9 tries) | 3 Lions Test caps (2021) 31yo, Truro, ENG | 183cm/111kg The Cornish hooker started out life in rugby as a prop before moving into the centre of the front row, where he excelled for both club and country. It's not been an easy path though, even accounting for the fact that he had former captain Jamie George to contend with for the number two jersey for England. After being one of the best hookers in the world through 2021, injury forced Cowan-Dickie to undergo neck surgery in 2023 that affected nerves in his arm for over a year. He then had a scare during a match for Sale when his heart skipped a beat … atrial fibrillation. A two-time Six Nations winner and a member of the 2019 Rugby World Cup squad that finished as runner-up, Cowan-Dickie has since given up drinking and playing Call of Duty — a game for which he was ranked as number one in the world for a short time. Hooker: Rónan Kelleher (IRE) Rónan Kelleher. ( ) Leinster & Ireland | 39 caps (8 tries) | Lions tourist in 2021 27yo, Dublin, IRE | 185cm/111kg A tourist in 2021, initially as non-travelling cover but eventually as a full-blown replacement, Kelleher's inclusion says as much about Leinster's strength in depth as it does his own abilities. Indeed, ABC Sport had Kelleher as the best-performing hooker through the first two rounds of this year's Six Nations, before Sheehan returned from injury and was judged best for the final three weeks of the campaign. When Dan Sheehan suffered a season-ending knee injury in 2024, Kelleher was a more than ample replacement for both club and country. The two twos may as well come as a package deal and will continue to share duties at all levels. Hooker: Dan Sheehan (IRE) Dan Sheehan. ( ) Leinster & Ireland | 32 caps (15 tries) | Lions tour debut 26yo, Dublin, IRE | 191cm/111kg The most-prolific try-scoring forward in Six Nations history, Sheehan crossed the line five times in the course of the Championship this year, including a hat-trick against Italy. The Dublin lad has had his share of setbacks in his career, including an ACL injury in 2024, but never let that get him down. His return to the Leinster side saw him score two tries against the Stormers and he stepped up to captain Ireland during this year's Six Nations in the absence of Caelan Doris. A reliable lineout thrower and busier than any in the loose, Sheehan had stamped his ticket to Australia long before the squad was eventually named. Lock: Tadhg Beirne (IRE) Tadhg Beirne. ( ) Munster & Ireland | 61 caps (12 tries) | 2 Lions Test caps (2021) 33yo, Eadestown, Co Kildare, IRE | 198cm/113kg The Munster skipper made his international bow for Ireland's senior team against Australia in 2018, helping the squad to a historic 2-1 victory. In fact, in three Tests against Australia for Ireland he has never been on the losing side. The ex-Leinster and Scarlets man will be hoping for something similar when he dons the red of the British and Irish Lions. A stellar performer who can also play in the back row if required, Beirne has twice been named in the World Rugby men's team of the year in the second row. During the Six Nations, Beirne and Andrew Porter both received abuse for an incident that saw Antoine Dupont rupture his ACL, with France coach Fabien Galthie particularly passionate. However, Beirne was adamant that there was no malice and it was just an unfortunate incident at a clean-out of a ruck. Lock: Ollie Chessum (ENG) Ollie Chessum. ( ) Leicester Tigers & England | 28 caps (2 tries) | Lions tour debut 24yo, Boston, ENG | 201cm/118kg Following an 11-month injury lay-off, Ollie Chessum was brought straight back into England's Six Nations squad, underlining the high esteem the Lincolnshire man is held by Steve Borthwick — who should know a thing or two about being an international lock. Chessum's reaction to those back-to-back injuries to his shoulder and knee impressed his Australian coach at Leicester, Michael Cheika, who praised his attitude to rehab. A giant of a man, Chessum has been a feature of England's second row but can also be used in the back row if required. Lock: Scott Cummins (SCO) Scott Cummins. ( ) Glasgow Warriors & Scoland | 42 caps (2 tries) | 3 Lions Test caps (2021) 26yo, Glasgow, SCO | 198cm/116kg Capped at almost every level by Scotland, Cummins was first selected in the senior squad by Gregor Townsend in 2017 but did not make his debut in the senior team until 2019. A long wait, but worth it for the Glaswegian, who has since made himself an integral member of the Scotland side. Cummins was in the spotlight in 2024 when he was sent off against South Africa for an innocuous-looking clean-out at a ruck. His absence from the squad through a broken arm for the 2025 edition was keenly felt for a Scotland team that somewhat stalled in their development. Lock | Captain: Maro Itoje (ENG) Maro Itoje. ( ) Saracens & England | 93 caps (8 tries) | 6 Lions Test caps (2017, 2021) 30yo, London, ENG | 195cm/118kg Maro Itoje was once again immense for England. ( ) A man writing himself into the history books as one of England's all-time greats. Itoje, named skipper of England for this year's Championships, was the only man to play in every minute of every game as England managed a heartening second-place finish behind France. A man who leads by example, whose performances simply demand respect whether it's for Saracens, England, or the Lions. This will be his third Lions tour and, given he has played in every Test on the previous two tours he's been on with the Lions, expect his name to be among the first on the team sheet this time around as well and add his list to the great locks of the past, like Willie John McBride and Alun Wyn Jones. Lock: Joe McCarthy (IRE) Joe McCarthy. ( ) Leinster & Ireland | 93 caps (8 tries) | Lions tour debut 24yo, Manhattan, USA | 198cm/124kg One of Ireland and Leinster's key performers in the second row over the last few years, McCarthy is a giant of a man who made his international debut against the Wallabies in 2022. He didn't have the most impactful Six Nations campaign, but has been impressive domestically for Leinster. Discipline is going to be a hot topic on tour, and one that McCarthy will need to be careful about. In a later match against the Wallabies, the New York-born, Ireland-raised lock left quite the impression on Rob Valetini in Dublin last year, when he clashed heads with the Aussie forward only to escape punishment from the officials. McCarthy was penalised with a sin-binning though for pulling back Thomas Ramos in Dublin during the Six Nations, which allowed the French to capitalise and run away with the win. It was a rare card for a team that had taken great pride in its discipline over the past few years and the sort of issue teams cannot afford to give away in tight Test matches. Lock: James Ryan (IRE) James Ryan. ( ) Leinster & Ireland | 72 caps (5 tries) | Lions tour debut 28yo, Blackrock, Co Dublin, Ireland | 203cm/124kg Another monster of a lock who has been a stalwart in the Leinster and Ireland back row for a number of years. In fact, current Wallabies coach Joe Schimdt thought so highly of Ryan that he handed him his full international debut before he had suited up for Leinster, becoming the first player since 2012 to play for his country before his province. His inclusion was vindicated — he scored a try on debut. Many of the squad have leadership credentials and Ryan is no exception, captaining the Ireland under 20s to a runners-up finish at the 2016 world championship — Ireland's best-ever position. His talkative nature to referees eventually led to him being replaced, but don't expect that will stop him from muttering a few words out on the field. Backrow: Jack Conan (IRE) Jack Conan. ( ) Leinster & Ireland | 72 caps (13 tries) | 3 Lions Test caps (2021) 32yo, Bray, Co Wicklow, Ireland | 193cm/124kg A fixture of the Leinster team for more than a decade, Conan is an immense runner in the loose, who is also a furious presence in defence, earning the joint-highest number of turnovers of anyone in the Ireland squad throughout the Six Nations despite mostly playing off the bench. Comfortable anywhere in the back three, he scored tries against Scotland, Wales and France, as well as being a key factor in the second-half surge that accounted for England. It is off the bench where Conan can be most effective, acknowledging that during the week being a squad member in modern rugby is vital. Another player who has had to return from almost a year out of the game — in part due to missing the 2024 summer tour for the arrival of his first child — Conan suffered a shoulder injury in the Six Nations but he has since recovered. Backrow: Tom Curry (ENG) Tom Curry. ( ) Sale Sharks & England | 61 caps (6 tries) | 3 Lions Test caps (2021) 26yo, London, ENG | 185cm/109kg There were very few players who performed as consistently well throughout the Six Nations as Tom Curry. Starting every game for England, his stunning work rate in both attack and defence were impossible to ignore by anyone watching. Perhaps most impressively though was the stunning display he produced in Cardiff, where he embarrassed his opposite number and Lions jersey frontrunner Jac Morgan in a devastating display, all in front of coach Andy Farrell. Don't back against him adding to his three Lions caps despite the impossible strength in depth of the back row across the British Isles. Backrow: Ben Earl (ENG) Ben Earl. ( ) Saracens & England | 42 caps (6 tries) | 3 Lions Test caps (2021) 27yo, Redhill, ENG | 183cm/107kg Another of the stellar England backrow unit who simply doesn't know what fatigue is — or at least plays that way. No England player had more carries than Earl through the Six Nations, with the Saracens man taking all 63 of them into contact — second only to Blair Kinghorne in his propensity to hit tacklers. Earl also made more tackles than any other England player, no mean feat given how the entire loose forward contingent hunted in packs. He also stole five balls at the breakdown, equal most of all England players with Ben Curry, and made a turnover tackle as well. You know what you're going to get if you pick Ben Earl, a whirlwind of power and willingness. Backrow: Jac Morgan (WAL) Jac Morgan. ( ) Ospreys & Wales | 24 caps (7 tries) | Lions tour debut 25yo, Swansea, WAL | 182cm/105kg By the end of the Six Nations, Wales skipper Jac Morgan looked absolutely exhausted. Jac Morgan is by far Wales' best player. ( ) That's understandable. He had played every minute of Wales's sorry campaign, making more tackles (92) than anyone else in the tournament, hitting more rucks than anyone bar Gregory Alldritt and doing it all while carrying his misfiring teammates on his back. It would not have gone unnoticed that Morgan had his worst display of the tournament in the humiliation at the hands of England in Cardiff, where he was comprehensively outplayed by his direct opponent for a Lions starting berth, Ben Curry. Wales has a fine heritage when it comes to the Lions, and although the number of tourists from Wales is paltry compared to recent years, in Morgan they have at least provided one of the best. Backrow: Henry Pollock (ENG) Henry Pollock. ( ) Northampton Saints & England | 1 cap (2 tries) | Lions tour debut 20yo, Banbury, ENG | 186cm/100kg Get used to this name, because it's one you're going to be hearing a lot of in rugby circles over the next few years. Bruising and combative back row forwards are 10-a-penny in rugby union, and yet there is still something a little bit special about this youngster. Having captained England at under 18 and under 20 level — the latter of which saw him lift the 2024 under 20 Rugby World Championship — Pollock roared into senior team contention after starring for England A against Australia in London in November last year. He made his senior debut off the bench in Cardiff as England romped to a belting victory against their arch nemesis, with Pollock scoring twice. His display against Leinster in Dublin for the Saints showed that he loves the limelight, laying down tackles on his senior rivals and scoring a wonderful try that embarrassed Sam Prendergast to such an extent that it may have been the deciding moment that saw him missing the trip. Every tour needs a bolter and Pollock has proven with his stellar performances this year that he is more than up to the task. Backrow: Josh van der Flier (IRE) Josh van der Flier. ( ) Leinster & Ireland | 73 caps (13 tries) | Lions tour debut 32yo, Wicklow, IRE | 186cm/103kg Despite the name suggesting otherwise, Josh van der Flier is not one of the South African exiles playing in Europe. In fact, he's of Dutch stock, and was born and raised in Wicklow south of Dublin. A keen thinker — he has a masters degree from Dublin Business School — van der Flier has been one of Ireland's best for a number of years, winning the World Rugby player of the year award in 2022 and being named player of the series for the 2024 November internationals. Nobody in an Ireland shirt made more tackles than him in the Six Nations, nor hit as many rucks as he did.\n\nBacks\n\nScrum half: Jamison Gibson-Park (IRE) Jamison Gibson-Park. ( ) Leinster & Ireland | 43 caps (7 tries) | Lions tour debut 33yo, Great Barrier Island, NZ | 175cm/80kg A player who cut his teeth playing for Taranaki in the National Provincial Championships across the ditch, Jamison Gibson-Park was considered one of the rising stars of New Zealand rugby. As a 20-year-old he was selected for the Māori All Blacks in 2012, before going on to play Super Rugby for the Blues and Hurricanes. Staying in New Zealand though, was not Gibson-Park's destiny, as he would move to Dublin in 2016, becoming eligible for Ireland on residency grounds in 2019. He made his Ireland debut in 2020 and has since been awarded citizenship. A shoe-in for the number nine jersey, Gibson-Park started the Six Nations brightly against England, but frankly dropped off as the tournament progressed. The Lions will want and need him on top form if they are to succeed Down Under. Scrum half: Alex Mitchell (ENG) Alex Mitchell. ( ) Northampton Saints & England | 23 caps (4 tries) | Lions tour debut 27yo, Maidstone, ENG | 178cm/89kg An exciting, running scrum half, Alex Mitchell was involved in five tries for England in the Six Nations, second most behind Northampton teammate Tommy Freeman. And yet it is his form for Northampton that has undoubtedly got the 27-year-old Kent man on the plane. Against Leinster last week he was exceptional, leading the Saints to an unlikely European final. With Northampton providing four tourists, expect Mitchell to use his relationship with Fin Smith on the midweek team to great effect and work to get into that Test team. Scrum half: Tomos Williams (WAL) Tomos Williams. ( ) Gloucester & Wales | 60 caps (10 tries) | Lions tour debut 30yo, Treorchy, WAL | 180cm/86kg There's no hiding from Wales's abysmal Six Nations campaign, but among the ashes of a once fine rugby nation, Tomos Williams still flickered. From the former mining region of the Rhondda Fawr Valley, Williams will be upholding Welsh pride on tour alongside his country skipper Jac Morgan. Given Wales's fine history with the Lions, there's no wonder he admitted to shedding a tear when he heard he had made the squad. A darting runner who honed his speed of foot and mind on the sevens circuit, the ex-Cardiff man will relish having a pack in front of him that's not going backwards at a rate of knots when he suits up for the Lions. Fly half: Finn Russell (SCO) Finn Russell. ( ) Bath & Scotland | 85 caps (415pts, 9 tries) | 1 Lions Test cap 32yo, Stirling, SCO | 182cm/87kg Mercurial. Established. Flashy. Take your pick of adjectives to describe Finn Russell. But one thing you can be sure of is his will to win. In a Six Nations tournament filled with young pretenders for the Lions 10 shirt, Russell could be considered a safe pair of hands — although the veteran did have his moments with some careless play against Ireland and some terrible goal-kicking against England. Despite those lapses Scotland has, under his guidance, developed one of the best attacking back lines in the world, albeit one that did not quite have the cutting edge he or coach Gregor Townsend would have hoped for during the Northern Hemisphere spring. He is the top scorer in the Premiership for Bath, with 148 points (five penalties, 59 conversions and three tries), which should be an indication his ability off the tee has not been dulled. With even more weapons at his disposal and a brutally strong pack ahead of him, what could Russell do for the Lions? We may not have to wonder too long. Fly half: Fin Smith (ENG) Fin Smith. ( ) Northampton Saints & England | 11 caps (29pts) | Lions tour debut 22yo, Warwick, ENG | 178cm/87kg Fin Smith had a man of the match performance. ( ) Just a couple of months ago nobody would have thought Fin Smith would be anything other than deserving of a cursory mention when it came to the British and Irish Lions squad — perhaps only in passing as reference to his grandfather, Tom Elliot, the Scotland prop who played eight tour games but no Tests on the 1955 Lions tour of South Africa. Yet, after a superb Six Nations and a series of magical performances for the Saints in both the Premiership and European Cup competition, young Fin forced himself into the conversation. Having been named in the Premiership team of the season and the Players Association players' player of the year in 2023/24 should have been a clue as to the trajectory his career was on, but managing to convert that domestic form into the international stage was something else. His performances up against fellow young gun, Sam Prendergast would have made a particular impression on the selection team just last week when the youngster helped guide the Saints to a hugely unexpected victory over Leinster at the Aviva Stadium in the European Cup semifinal. Fly half: Marcus Smith (ENG) Marcus Smith. ( ) Harlequins & England | 44 caps (14 tries, 314pts) | Lions tourist in 2021 26yo, Manila, PHI | 175cm/82kg Marcus Smith and Fin Smith will both be on the plane. ( ) One of the most thrilling broken-play players in world rugby, Marcus Smith should, perhaps, feel a little fortunate that he has been included in this Lions squad. A year ago you'd have said the Harlequins man was a nailed-on starter for both the Lions and England, but with the rise of Fin Smith and a shift to fullback at international level, Marcus's stock has fallen. And yet, despite a dramatic drop-off in club form of late, there are few players in the world who can incite as much excitement as Smith does when he has his hands on the ball. Whether he plays at 15 or 10 on tour, given the amount of ball the Lions will be expected to have, he could make hay against any opponent, with his versatility potentially making him an ideal bench player for the Test team. Centre: Bundee Aki (IRE) Bundee Aki. ( ) Connacht & Ireland | 65 caps (18 tries) | 1 Lions Test cap 35yo, Ōtāhuhu, NZ | 178cm/102kg It's easy to think of Bundee Aki as another of New Zealand's rugby refugees now plying his trade in Europe, but the 35-year-old veteran is so much more than that. Moving from the Chiefs fresh after winning Super Rugby to unfashionable Connacht out on Ireland's windswept west coast, Aki made the Westerners a genuine title force and even helped them win the Pro12 in 2015. As Ireland has surged, so has Aki, winning two grand slams and three Six Nations titles in total since he made his debut in 2017, after completing his three years of residency. Aki was criticised earlier in his career after admitting that he moved to Ireland primarily to play international rugby, but has embraced life so comprehensively in Galway that he has become a citizen in 2024. \"I love the people, I love the culture … There's not a bad word I can speak about Ireland,\" Aki said upon being made a citizen. Centre: Elliot Daly (ENG) Eliot Daly. ( ) Saracens & England | 65 caps (131 points, 18 tries) | 5 Lions Test caps (2017, 2021) 32yo, Croydon, ENG | 178cm/83kg He's listed as a centre, but in reality Elliot Daly can play just about anywhere in the back line. Immense under the high ball and a brutal attacking force, Daly will likely slot in at fullback as often as he will in the centres. His enormous boot, capable of kicking penalty goals from beyond half way, may also prove vital. Another of the backs in this squad to be in the incredibly small group of players who have played both for and against the touring side. In 2023, Daly played for the Barbarians who took on the touring Lions in Hong Kong. Since then he has gone on to play five Tests, including all three in the dramatic drawn series against New Zealand in 2021. Centre: Huw Jones (SCO) Huw Jones. ( ) Glasgow Warriors & Scotland | 58 caps (23 tries) | Lions tour debut 31yo, Leith, SCO | 186cm/102kg Scotland to England to South Africa to Scotland and now the Lions — Huw Jones's rugby life has already taken him plenty of places around the world. Born in Scotland, Jones was educated in England before moving to South Africa, where he got his first taste of professional rugby with Western Province and then the Stormers in Super Rugby. The call of home was always there though and he moved to the Glasgow Warriors where, either side of a season at Harlequins, he has remained ever since. A hard-running and skilful ball carrier whose ability to unpick a defence with lines few can see let alone defend against, Jones has been one of the stars in a backline full of them for the Scots in recent years — particularly in partnership with former Australian Sione Tuipulotu. Although he has not played since the Six Nations on account of an ankle injury, he had plenty of credit in the bank to keep his spot in the squad. Centre: Garry Ringrose (IRE) Garry Ringrose. ( ) Leinster & Ireland | 67 caps (77 points, 15 tries) | Lions tour debut 30yo, Blackrock, Co Dublin, IRE | 185cm/102kg A fleet-of-foot centre who has been a fixture in the Ireland set-up since 2016, Gary Ringrose is a multiple winner at club and international level. One of the most skilled ball-handlers in the game, Ringrose has the ability to unlock defences with a hint of a swerve as much as a powerful fend. Being sent off for a high tackle against Wales — and a subsequent three-match ban — limited his international appearances this season. But there was little concern that Andy Farrell would leave one of his most dependable backs at home. Centre: Sione Tuipulotu (SCO) Sione Tuipulotu. ( ) Glasgow Warriors & Scotland | 58 caps (23 tries) | Lions tour debut 28yo, Melbourne, AUS | 179cm/104kg The Melbourne Rebels are, sadly, no more, but they will be represented in some small way at least on this year's Lions tour. A graduate of the Rebels set-up, Sione Tuipulotu felt like his Lions dream was over after he suffered a pectoral injury in January that has kept him out of action until May. Fortunately, Andy Farrell had already seen enough from this adopted Scot, who qualified for the tartan army on account of his grandmother. And it's a fitting reward for what has been a stunning rise for the Australian-born centre, who has inarguably been the heart and soul of Scotland's rise into genuine contenders in recent years as captain. In November, Tuipulotu clashed with Joseph-Aukuso Suaalii, so that might be one to keep an eye on Down Under. Wing: Tommy Freeman (ENG) Tommy Freeman. ( ) Northampton & England | 20 caps (7 tries) | Lions tour debut 24yo, Oxford, ENG | 188cm/92kg Tommy Freeman made history during the 2025 Six Nations, becoming the first Englishman to score a try in each round of fixtures — even if the legitimacy of the try awarded against Scotland at Twickenham is justifiably contested north of the border. One of the rising stars of England rugby, Freeman combines powerful running with electric speed and finishing ability — everything you could ask for from a winger, in other words. Overall he has 16 tries from 17 starts for Northampton, and five in nine for England this season. He made his starting debut for England at Lang Park in 2022 under Eddie Jones, perhaps he'll make his Lions debut there too. Wing: Mack Hansen (IRE) Mack Hansen. ( ) Connacht & Ireland | 28 caps (12 tries) | Lions tour debut 27yo, Canberra, AUS | 188cm/89kg Mack Hansen suffered an ankle injury that will force him to miss the last few rounds of the United Rugby Championship, which must have meant he feared for his spot on this year's Lions tour, especially given the impressive form of Scotland's Darcy Graham. He needn't have worried, despite professing to being \"speechless\" for the first time in his life. Despite not having the most prolific of Six Nations tournaments, the Australian-born winger with an Irish mother has been a key member of Andy Farrell's back line for Ireland and was, if not a certainty for selection, a pretty safe bet. Hansen was one of the first players interviewed after the squad was announced, telling the event at the O2 via Zoom that he had just been about to go for a swim on Ireland's west coast. In May. You can take the boy out of Australia … Wing: James Lowe (IRE) James Lowe. ( ) Leinster & Ireland | 40 caps (17 tries) | Lions tour debut 32yo, Nelson, NZ | 188cm/101kg Not many players will have played both against the British and Irish Lions as well as for them, but that's a rare honour that James Lowe will likely achieve this tour. Lowe first played against the Lions in 2017, when he appeared at fullback for the Māori All Blacks in their 32-10 defeat against the Lions in Rotorua. That was the last of Lowe's eight caps for the Māori. Fast forward eight years and Lowe has 40 international appearances for Ireland under his belt and a reputation as one of the most dangerously powerful wingers in the world. Wing: Duhan van der Merwe (SCO) Duhan van der Merwe. ( ) Edinburgh & Scotland | 49 caps (32 tries) | 3 Lions Test caps 29yo, George, RSA | 193cm/106kg Nothing short of a try-scoring machine he may be, but Duhan van der Merwe does have his critics, summarised succinctly by Rugby World this week: \"Some may argue that Duhan van de Merwe doesn’t offer enough ‘without’ the ball,\" wrote columnist and author Paul Williams. \"But that’s much like criticising a nuclear weapon because all it does is blow things up.\" It's a fair enough statement. This monstrous winger tore up the record books as a kid in the Western Cape, earning a spot as part of the South Africa squad that finished runners-up at the 2014 Junior World Championship. A move to Montpellier in 2016 didn't really work out, but shifting north to Edinburgh proved the trick, with the club signing him despite question marks over a hip injury. Injury is clouding him in the lead-up to this Lions Tour, an ankle injury requiring surgery has kept him out the Edinburgh line up since March. Fullback: Hugo Keenan (IRE) Hugo Keenan. ( ) Leinster & Ireland | 46 caps (13 tries) | Lions tour debut 28yo, Dublin, IRE | 185cm/92kg A Paris 2024 Olympian with the Ireland Sevens team, Hugo Keenan displays all the skills needed to break lines and tackles at will in the 15s game as well. Equally capable at fullback or the wing, Keenan is super capable under the high ball and is very dangerous in broken play — kicking to him is ill-advised. Another of Leinster's bevvy of stars who will line up for the Lions — 12 of the touring squad play in the blue of Leinster. Fullback: Blair Kinghorn (SCO) Blair Kinghorn. ( ) Stade Toulousain & Scotland | 60 caps (146 pts, 16 tries) | Lions tour debut 28yo, Edinburgh, SCO | 193cm/107kg The stand out 15 of the home nations during the past Six Nations, nothing would stop Blair Kinghorn being named in this squad. That's despite him likely to miss at least the first tour match in Perth against the Force due to Toulouse's Top14 finals commitments. The final of the Top14 — of which Toulouse are runaway leaders of at the moment — takes place on the same day as the Lions' first match in Australia, June 28. But given Kinghorn's skill set — barring scrumhalf he can reasonably be expected to slot in anywhere in the back line should the need arise — there was no doubt that the ex-Edinburgh man would make the trip, no matter how delayed he is.\n\nWhen are the Lions fixtures?\n\nThe British and Irish Lions will play their first Test on tour at Lang Park. ( )\n\nThe British and Irish Lions will play nine matches in Australia, culminating the three Tests in Brisbane, Melbourne and Sydney in late July/early August.\n\nPrior to their departure, the Lions will face Argentina at the Aviva Stadium in Dublin.\n\nThis will be the third time in recent years that the Lions have faced a national team as part of their pre-tour preparations, following matches against Japan at Murrayfield in 2021 (Lions won 28-10) and against Argentina in Cardiff in 2005 (a 25-25 draw).\n\nThe Lions have also met France at the Parc des Princes in 1989 (Lions won 29-27), a Rest of the World team at Cardiff Arms Park in 1986 (Lions won 15-7) and the Barbarians at Twickenham in 1977 (Lions won 23-14).\n\nThere were also unofficial matches against Cardiff and Wales at the old Arms Park in 1951 and 1955 after the tourists had returned.\n\nThe tour proper though, starts in Perth.\n\nB&I Lions vs Argentina — Aviva Stadium, Dublin (June 21, 5am)\n\nB&I Lions vs Argentina — Aviva Stadium, Dublin (June 21, 5am) Western Force vs B&I Lions — Perth Stadium (June 28, 8pm)\n\nWestern Force vs B&I Lions — Perth Stadium (June 28, 8pm) Queensland Reds vs B&I Lions — Lang Park, Brisbane (July 2, 8pm)\n\nQueensland Reds vs B&I Lions — Lang Park, Brisbane (July 2, 8pm) NSW Waratahs vs B&I Lions — Sydney Football Stadium (July 5, 8pm)\n\nNSW Waratahs vs B&I Lions — Sydney Football Stadium (July 5, 8pm) ACT Brumbies vs B&I Lions — Canberra Stadium (July 9, 8pm)\n\nACT Brumbies vs B&I Lions — Canberra Stadium (July 9, 8pm) Aus&NZ Invitational vs B&I Lions — Adelaide Oval (July 12, 8pm)\n\nAus&NZ Invitational vs B&I Lions — Adelaide Oval (July 12, 8pm) 1st Test: Wallabies vs B&I Lions — Lang Park, Brisbane (July 19, 8pm)\n\nFirst Nations and Pasifika XV vs B&I Lions — Docklands Stadium, Melbourne (July 22, 8pm)\n\nFirst Nations and Pasifika XV vs B&I Lions — Docklands Stadium, Melbourne (July 22, 8pm) 2nd Test: Wallabies vs B&I Lions — MCG, Melbourne (July 26, 8pm)\n\n3rd Test: Wallabies vs B&I Lions — Olympic Stadium, Sydney (August 2, 8pm)\n\nABC Sport will be live blogging every match of the British and Irish Lions Tour, including all three Tests.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/bellingen-deputy-mayor-ellie-tree-resigns/105267438",
    "title": "Young mum quits council saying job was 'costing her money'",
    "publish_date": "Fri, 09 May 2025 01:42:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "A 31-year-old deputy mayor and mother of three has resigned from her regional council claiming it was costing her money to represent her community.\n\nEllie Tree announced she was stepping down from Bellingen Shire Council on the New South Wales Mid North Coast after a three-month leave of absence.\n\nShe said she was unable to balance the workload between family, full-time employment and postgraduate study.\n\n\"Unfortunately council pays the least and takes up the most of my time,\" Cr Tree said.\n\n\"People that step into the role aren't doing it for the money, it's a passion.\n\n\" I was having to take days of leave without pay to attend council meetings and it ended up costing me money to be a councillor. \"\n\n'Sad indictment of local government'\n\nWomen under 40 make up only 6 per cent of councillors according to the latest report on councillor diversity from the NSW Office of Local Government.\n\nIn NSW, councillors are paid an annual fee instead of a salary, which is determined by the Local Government Remuneration Tribunal.\n\nWhile mayors in cities can earn six-figure salaries, councillors earn as little as $10,220.\n\nCr Tree told the ABC she was paid $18,000 per year for her work on the Bellingen council.\n\nCr Tree's kids would often accompany her to council events. (Supplied: Bellingen Shire Council)\n\nAfter being re-elected in 2024, Cr Tree unsuccessfully pushed to change the time of council meetings from 9:45am to sometime in the evening.\n\n\"When you're in a position such as mine where you need to take days off your full-time job to attend meetings, [the pay] dwindled down to about $6,000 a year in your back pocket,\" Cr Tree said.\n\nBellingen Mayor Steve Allan said Cr Tree had made a huge contribution to the local community and it was disappointing she had to resign.\n\n\"It's a very difficult ask of a young, working mother to be able to fulfil the role of councillor while working full-time and looking after a family,\" Cr Allan said.\n\n\" It's a sad indictment on the structure of local government in NSW. \"\n\nBarriers to participation\n\nAs more women than ever enter politics at the federal level, structural barriers like low pay remain for those looking to cut their teeth in local politics in NSW.\n\nAccording to analysis from the Australian Local Government Women's Association, women's representation on councils across Australia has grown to 40 per cent.\n\nLocal Government NSW president Phyllis Miller said despite the improved representation, the poor pay and heavy workload for councillors meant mostly older, semi-retired people were putting their hands up to be involved.\n\n\"If we don't start to change the fee structure, we're going to end up with people at retirement age being the only people who can afford to stand for local government,\" Cr Miller said.\n\nPhyllis Miller says local government's pay and workload mean mostly older, semi-retired people are involved. (Supplied)\n\nCr Miller said Local Government NSW was continuing to lobby the state government for increased funding and support for councillors.\n\n\"We go to the remuneration tribunal every year and we get nothing,\" she said.\n\n\"In Queensland, you get 85 per cent of a backbencher's salary, so the councillors would be on $70,000-80,000 a year.\n\n\" I don't think politicians realise our workload is every bit as big as theirs. \"\n\nCr Tree, who was the youngest councillor in Bellingen Shire's history when she was first elected in 2021, said despite her resignation she hoped to stay engaged in the community.\n\n\"Right now, I just think my time is better off spent with my kids and focusing on my full-time employment,\" she said.\n\n\"Will I run again? Maybe when I'm old and semi-retired.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/how-women-who-have-lost-their-mums-mark-mothers-day/105264398",
    "title": "Motherless daughters urged to share their stories to normalise grief",
    "publish_date": "Fri, 09 May 2025 01:08:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Morgan Hunter was just nine months old when she lost her parents and two sisters in a horrific car accident.\n\nThe 31-year-old, from Queensland's Sunshine Coast, thought she had no memories of her mother Kerrie — until recently.\n\n\"I was able to watch a family video for the first time and I heard her laugh,\" Ms Hunter said.\n\n\" I could actually hear that it was the voice that I could remember, so that was quite a beautiful experience for me to be able to know that she's been with me all along. \"\n\nMother's Day pain\n\nMs Hunter and her brother, who also survived the 1994 crash, were raised by their aunt and uncle.\n\nMs Hunter, pictured as a baby with her brother, who also survived the crash. (Supplied)\n\n\"You used to have the Mother's Day stalls at school,\" she said.\n\n\"I was still picking out a present for someone who stood in the place of a mum, but she never was my mum — it never felt truly real or whole.\n\n\" The first three quarters of my life I didn't really talk a lot about my mum or my family. \"\n\nMs Hunter says growing up not knowing her mother made her grief \"even more confusing\". (Supplied)\n\nWhen she did speak, Ms Hunter said her grief would often be \"minimised\".\n\n\"People will kind of say, 'But you didn't know them so you wouldn't really understand what grief or what loss is,'\" she said.\n\n\" There's this hole that is kind of unexplained because that loss is more of a somatic or physical experience. \"\n\nMs Hunter, pictured with her husband Ed, says people have tried to minimise her grief over the years. (Supplied: Morgan Hunter)\n\nHonouring her mum's memory\n\nMs Hunter is one of 3.9 million Australian women who have lost their mum, with 1.2 million experiencing the profound loss before the age of 44.\n\nA few years ago, she discovered advocacy group Motherless Daughters Australia.\n\nMs Hunter says talking about and remembering her mother and family has helped her immensely. (Supplied)\n\n\"It's been such a humanising experience, it's made me feel like there are people out there who just get it,\" she said.\n\nThe group has also transformed the way she now deals with her grief.\n\n\"For a long time, I didn't have any rituals. It's something I'm starting to build and develop,\" she said.\n\n\"I read through her [Kerrie's] journals on days of significance, like her birthday or on Mother's Day, I'll try and really lean into that connection and try and understand her.\n\n\"I will light a candle. I might make a recipe from her recipe book to try and eat something that she enjoyed.\"\n\nMs Hunter says being able to talk to other woman who have lost their mothers has been life-changing for her. (Supplied)\n\nShe said finally talking about her mother had brought her a lot of comfort.\n\n\"She is described as being born to be a mum … incredibly nurturing and really aware of her kids and what they loved and was always trying to make every single day a special experience,\" she said.\n\n\" The way that people talk, it's apparent Mum had such a big place in a lot of people's lives, she made such a mark in a really beautiful way. \"\n\nReclaiming the day\n\nDanielle Snelling co-founded Motherless Daughters Australia in 2013, after losing her mum Rosa to a rare gynaecological cancer.\n\nMs Snelling said it was important to remember the origins of Mother's Day, which was founded in 1905 by Anna Jarvis, after the American's mother Ann died.\n\nDanielle Snelling hopes to normalise discussions about grief to help bereaved daughters. (Supplied: Motherless Daughters Australia)\n\n\"That helps women in our community have a sense of ownership on the day … to feel that they can very much partake in Mother's Day, and the day actually exists through a daughter grieving her mum,\" Ms Snelling said.\n\n\"This year, our campaign is focusing on educating people that grief's not brief.\n\n\"Whether you lost your mum a year ago, six months ago or 20 years ago, the impact of that grief and loss is still very much present, especially at this time of year — however you feel is perfectly fine.\"\n\nHere's how to help: It's OK not to know what to say. Sometimes sitting in silence and listening is the perfect way to show support.\n\nListen without directing away from the grief.\n\nSend a quick text to let them know you're thinking of them or ask if they would like to meet for a coffee.\n\nShare memories and stories.\n\nDon't be afraid to mention their mother's name.\n\nDon't assume the person grieving is over their loss just because they appear to be having a good day.\n\nKeep in touch.\n\nShe said the time leading up to Mother's Day could be just as tough but there were ways to support those who were grieving.\n\nWhile Motherless Daughters Australia is an organisation created specifically for women, much of the support and insights shared can be equally helpful for sons who are grieving, or for those wanting to support a bereaved woman.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/nsw-former-cricketer-stuart-macgill-sentenced/105272936",
    "title": "Breaking: Former cricketer Stuart MacGill avoids jail over cocaine deal",
    "publish_date": "Fri, 09 May 2025 01:01:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former Australian cricketer Stuart MacGill has avoided jail after being found guilty of taking part in the supply of cocaine in Sydney.\n\nThe 54-year-old faced trial over allegations he participated in the supply of a large commercial quantity of a prohibited drug, over an April 2021 introduction he made between his cocaine dealer and his partner's brother, Marino Sotiropoulos.\n\nOn the Crown's case, the introduction amounted to setting up a drug supply because the dealer and Mr Sotiropoulos allegedly went on to organise a $330,000 deal for 1 kilogram of cocaine.\n\nA jury in the NSW District Court heard that while MacGill's involvement was limited to the introduction, the dealer also took part in two other alleged supplies, including one in which he handed over a vacuum-sealed bag of A4 paper instead of cash to Mr Sotiropoulos's associates.\n\nThe jury found MacGill guilty of knowingly taking part in the supply of a prohibited drug, without the large commercial supply element.\n\nOn Friday, Judge Nicole Noman sentenced MacGill to a one year-and-10-month intensive corrections order and almost 500 hours of community service.\n\nJudge Noman said his testimony was \"implausible\" and \"devoid of candour\".\n\nSpeaking outside the court, MacGill's barrister Thos Hodgson said the former cricketer's legal team would consider whether to appeal both the conviction and the sentence.\n\nHowever, he described the sentence as a win \"of sorts\".",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/tourists-stuck-in-bedourie-outback-qld-flooding/105266736",
    "title": "Stranded couple's makeshift 'beach holiday' in Queensland's outback",
    "publish_date": "Fri, 09 May 2025 00:49:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Scorched red dirt, hordes of flies, and life stuck on a time loop.\n\nIt could be mistaken for a scene from a Hollywood blockbuster, but this was the month-long reality for a Sunshine Coast couple stranded by floodwaters in Queensland's outback.\n\n\"You've heard the expression Groundhog Day — that's what happened,\" said Bob Esler, comparing his time in the desert town of Bedourie to the 1993 film.\n\nHe said the most laughable part of the adventure was that he and wife Carol Weeks had never planned to stop in the tiny outback town in the first place.\n\nLoading...\n\nIn mid-March the pair set off from their Glass House Mountains home in south-east Queensland on the cross-country adventure of a lifetime.\n\n\"We were heading to Western Australia to see Cape Range National Park and swim with the whale sharks,\" Mr Esler said.\n\n\"We hadn't taken a trip down through Birdsville and thought, 'Why don't we detour the trip through Mount Isa, take an extra day or two and make the trip a bit more interesting?'\"\n\nThat extra day or two turned into four and a half weeks.\n\nThe couple marvelled at how floodwaters could stretch as far as the eye can see despite no rain. (Supplied: Carol Weeks)\n\nDry flooding lessons\n\nThe couple set off on their trip on March 18 when much of coastal Queensland was recovering from heavy downpours and ex-Tropical Cyclone Alfred.\n\nFarmers brace for stock losses Photo shows An ariel from helicopter of building under water. Queensland graziers say more aviation fuel is desperately needed as helicopters play a key role in evacuations, supply drops, and mustering.\n\nAs they crossed into the desert three days later, Mr Esler said there was not a cloud in sight despite the state's northern region copping the brunt of wet weather.\n\n\"There hadn't been any rain there. We looked at the weather radar — which we now know does not cover the area,\" he said.\n\nThe nearest high-resolution Doppler radar is over 500 kilometres away from Bedourie in Mount Isa — a sore point for many who say they were caught off guard by outback flooding.\n\nMr Esler was one of them.\n\n\" We thought we should be right getting through. Little did we know it had already rained further north and the mass of water was just [travelling] down. \"\n\nThe pair enjoyed the rich landscapes of the state's outback. (Supplied: Carol Weeks)\n\nThe unique rivulets that make up the Channel Country delivered so-called dry flooding to communities hundreds of kilometres from where rains fell on other parts of western Queensland.\n\nThe pair, armed with a trusty 4x4 camper and four-wheel drive, made camp for the night in Bedourie, with plans to finish their detour to Birdsville the following morning.\n\n\"That's when we learned it didn't matter if it rained on us or not. We weren't getting through anywhere,\" Mr Esler said.\n\nLife on a loop\n\nLong-made plans changed overnight and, looking back, Ms Weeks said she was still shocked at the speed of the water.\n\nPicturesque sunsets helped to lighten the mood when life felt stuck on a loop. (Supplied: Carol Weeks)\n\n\"We woke up early and thought, 'We need to go,'\" she said.\n\n\"We headed out straight away without even any breakfast. Basically the floodwaters were already there.\"\n\nShallow but broad-stretching waters consumed the bitumen in all directions, turning the town into an island.\n\n\"It got to a point where we couldn't see where the road ended. We had to turn around — it just didn't feel safe,\" Ms Weeks said.\n\nIt quickly became evident it would be some time before the road trip would resume.\n\nThe couple have braved the elements, to some extent, while living in their camping trailer. (Supplied: Carol Weeks)\n\nThe set up — with no air conditioning to break up the days where the mercury hit 40 degrees Celsius — was far from glamorous.\n\n\"The camper is not large. There's enough room for one person to stand up comfortably but it's not meant to be lived in as a house,\" Mr Esler said.\n\nEmbracing the bush attitude, the pair made the best of the situation.\n\nMs Weeks says the 25-metre public pool became a sanctuary away from the flies each day. (Supplied: Carol Weeks)\n\n\"We got into a routine every day — wake up and have breakfast, fight the flies off, then we'd normally go down and check out the flood waters,\" Mr Esler said.\n\n\" There were hard days right towards the end. Most of it we just took the attitude that we couldn't go anywhere, we'll look at it like a beach holiday. \"\n\nDonning a fly net became part of the routine to endure the swarm. (Supplied: Carol Weeks)\n\nAdjusting to the bush lifestyle\n\nFor Ms Weeks, becoming \"temporary residents\" and blending in with the locals helped ease the wait.\n\n\"They spoke to us, they explained how the rivers and channels run into each other, we were invited to community events. We just got into our little groove,\" she said.\n\nThere were even differences from home the couple came to appreciate.\n\n\"I can't walk over to the shops … from my own home, I have to drive 10 minutes,\" Ms Weeks said.\n\n\"So it was nice walking over to the roadhouse to pick up a carton of milk or whatever, or go and harass someone for a chat.\"\n\nDaily walks to check water levels became more hopeful as flooding receded. (Supplied: Carol Weeks)\n\nMr Esler said after nearly five weeks, when the water receded low enough to make their way out, a sense of emotion washed over the pair.\n\n\"It wasn't a sense of elation, it was almost like a sense of leaving somewhere and leaving something behind,\" he said.\n\n\"One of the interesting things about Bedourie is that there are a lot of people who don't come from that area.\n\n\"We met people who were backpackers that are working there now and they'd love to stay there.\n\n\"That speaks volumes.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/melbourne-taxi-rideshare-reform/105272108",
    "title": "Mandatory recordings and tougher penalties to stamp out dodgy taxi drivers",
    "publish_date": "Fri, 09 May 2025 00:28:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victoria's taxi and rideshare companies will undergo a suite of changes in a bid to crack down on dodgy drivers and stamp out bad behaviour.\n\nOn Friday the state government announced a package of reforms which would include increasing the penalties for bad behaviour, mandating audio recordings and a new \"two-strike rule\".\n\n\"Our commercial passenger vehicle (CPV) industry is incredibly important for our city and state,\" transport minister Gabrielle Williams said.\n\n\"Which is why it's so important that we ensure that it is as safe as it can possibly be and as reliable as it can possibly be.\"\n\nThe new two-strike rule would be similar to what exists in New South Wales, allowing the regulator to cancel the accreditation of a driver who has two fare-related convictions.\n\nThe government says it is committed to stamping out bad behaviour by drivers. (ABC News)\n\nIn addition to that, drivers might also have their accreditation cancelled or suspended if there is a pattern of complaints made against them, including for things like not using a meter.\n\n\"There might be complaints made about an individual driver that are very similar but fall below that conviction threshold, it still allows the regulator to do something about it,\" Ms Williams said.\n\nThe news was welcomed by Victorian Taxi Association director Peter Valentine, who said it was something the organisation had wanted for a long time.\n\n“We don't want ... those type of drivers in the state. It's not good for the state and it's not good for the industry,\" he said.\n\nHe questioned whether it would be enforced properly, but said that was the responsibility of the government.\n\n“We want to make sure that they do enforce it and that [drivers are made] fully aware ... that it's not something that they can take on lightly,\" he said.\n\n\" It's two strikes and you're gone and that's it. \"\n\nMandatory recordings don't go far enough, peak body says\n\nThe announcement followed media reports in The Age which detailed how a taxi driver abused and scammed a number of passenger with disabilities.\n\nSome incidents were captured on CCTV and ultimately led to the driver's conviction.\n\n\"We saw some reporting earlier this year which quite frankly put on display some utterly unacceptable and disgusting behaviour by a small number, and we do know it's a minority cohort, of drivers in our CPV industry,\" Ms Williams said.\n\n\"That conduct that was reported is quite clearly unacceptable to all Victorians.\"\n\nUnder the changes, camera rules will be updated to give carers access to live, in-vehicle camera vision, if it is offered by the taxi or rideshare company.\n\nIt will also be mandatory for cameras in booked vehicles to record the audio and vision of those rides.\n\nThe government said it would assist in building evidence when a complaint was made and would also allow companies to act swiftly.\n\nBut Mr Valentine said whilst it was a good start, it needed to expand beyond booked taxis.\n\nPassengers can access QR codes in taxis to make a complaint more easily. (ABC News: Kathy Lord)\n\n\"We’ve seen incidents in North Melbourne of rape out of rideshare cars,\" he said.\n\n\"It cannot stop at taxis. It has to be in all commercial passenger vehicles, and that means it must also be in your rideshare car.\"\n\nIt has become easier for passengers to make a complaint with the rollout of QR codes, which link passengers directly to a complaints page, earlier this year.\n\nThe page also provides passengers with information about unlawful conduct.\n\n\"Its about accountability, it's about safety and it's about making sure Victorians have confidence in what is an incredibly important service in our state,\" Ms Williams said.\n\nThe government said these changes were just the start of measures to be rolled out.\n\nMs Williams said the government was also keen to expand the retention time of footage in vehicles. Recordings are currently kept for 72 hours.\n\nShe said camera settings would be reviewed to better understand technological constraints before making any changes there.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/pilbara-rents-not-improving-despite-state-and-resources-efforts/105259686",
    "title": "Renters in WA's Pilbara paying the same as people in Melbourne",
    "publish_date": "Thu, 08 May 2025 23:55:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "In a remote corner of Western Australia the cost of rent is on par with Melbourne and Sydney's most expensive suburbs.\n\nLennon Crane, 23, has for eight months been struggling to find a house in Karratha, where the median weekly rent is $1,144, according to a CoreLogic report.\n\nThe report shows it is the most expensive regional town in the country to rent, with Byron Bay second.\n\nMr Crane and his partner are renting a \"fairly old\" two-bedroom apartment in the nearby town of Dampier for $650 a week.\n\nThey are rethinking their plans to eventually buy in the region.\n\nMr Crane says people in the resource and mining industries are more successful with home ownership. (ABC News: Mietta Adams)\n\nThe exorbitant prices cannot be attributed to one single issue, but a combination of factors that make it extremely expensive to build new homes.\n\n\"We know that the market is not in balance,\" Premier Roger Cook said, while spruiking a construction update in Karratha this week.\n\nState and local governments, as well as the region's big mining companies, have poured millions into fixing the problem.\n\nFor example, the federal government has splashed $22.1 million to release 199 lots at a site in Karratha.\n\nThe City of Karratha, Rio Tinto and Woodside have also provided 66 dwellings across the city to support service workers.\n\nNo tradies to build them\n\nPort Hedland real estate agent Morag Lower said no amount of money from governments or mining companies would get more homes built quickly.\n\nKarratha's population is predicted to rise by 35 per cent by 2030. (ABC News: Mietta Adams)\n\n\"We've got a severe shortage of all trades, it's hard to do renovations in this town, far less build new homes,\" Ms Lowe said.\n\n\" In this state, we don't have a real estate problem, we've got a residential construction problem. \"\n\nShe said part of the reason it was difficult to get tradies to town was because they would not be able to turn a profit on new builds.\n\nMs Lowe said the cost of building a new home was greater than what it could be sold for.\n\nMs Lowe says the market in Port Hedland is not viable for home builders. (ABC News: Charlie McLean)\n\n\"You're actually going to be able to buy an existing property cheaper than it would be to build,\" she said.\n\n\"There's very little choice in a town like Port Hedland for builders.\"\n\nKarratha Mayor Dan Scott said the situation was the same across the Pilbara, stalling vital housing projects for years.\n\n\"Over the last five years you can count on one hand how many development approvals we have given for a house,\" he said.\n\nHousing goes to industry\n\nResidential and social housing developments have struggled to get off the ground in Karratha, while developments backed by large resource companies are steaming ahead.\n\nInternational fertiliser company Perdaman has started building 31 of its 100 planned houses in Karratha, part of a combined $122 million state government project.\n\nWA Premier Roger Cook says big resources companies should build homes for their workers. (ABC News: Mietta Adams)\n\nMr Scott said it would make a difference if Perdaman was able to house more staff locally, while the premier acknowledged the role industry played to stimulate the economy and draw people into communities.\n\n\"We need big companies like Perdaman, BHP, Rio Tinto to play their role,\" Mr Cook said.\n\n\"You've got to have people to make sure these industries can thrive. Those people have to have places to live and we need people to build the places for them to live in.\"\n\nBut for low-middle income earners who are not supported by resource companies — which often subsidise rent, utilities and mortgage payments — the market remains inaccessible.\n\nMr Crane said as a teacher, none of his colleagues were able to buy unless their partners worked in the mining or resource industry.\n\nHe said those who got help with their mortgages and bills could afford more for a deposit.\n\n\"It drives up the prices because people keep outbidding each other,\" Mr Crane said.\n\nHe said the \"ridiculous\" prices were making him second guess his dreams of owning a Pilbara home.\n\n\"It's making me think about just not buying and saving the money until I move on,\" Mr Crane said.\n\nPlaying catch-up\n\nHigh construction costs have coincided with a boom in new resources projects expected to drive more people to the Pilbara.\n\nKarratha's population is expected to jump by almost 8,000 people by the early 2030s.\n\nRegional Development Australia Pilbara chief executive Tony Simpson said 60,000 more workers were needed to build a suite of renewable and critical mineral projects in the area.\n\nMr Simpson says getting more workers into the Pilbara to build homes is a challenge. (ABC News: Mietta Adams)\n\n\"We've seen both state and federal governments [invest] in housing, but unfortunately the catch-up time is the issue,\" he said.\n\n'We have our Achilles heel around our rentals, there's not enough of them.\n\n\"How do we keep the fabric of the town, and how can we keep it growing?\"\n\nHigh construction costs have stalled the expansion of affordable housing in Karratha. (ABC News: Charlie McLean)\n\nBoom and bust cycles\n\nMs Lowe said much of the pain renters were feeling was down to decisions made during the region's last downturn in the early 2010s, when iron-ore prices fell sharply.\n\nShe said it led to thousands of local builders leaving the industry because their work dried up.\n\n\"If there was ever an opportunity to build houses at a reasonable cost, it was throughout that downturn,\" she said.\n\nBut Ms Lowe said the state had not acted on the opportunity, leaving those who did not work in the lucrative mining industry with nowhere affordable to live.\n\n\"They haven't replenished their stock, as far as I can see, in a couple of decades,\" Ms Lowe said.\n\nMorag Lowe believes the state missed an opportunity to build low-cost housing. (Supplied: Morag Lowe)\n\n\"Successive state governments have got out of the responsibility of providing social housing for lower-paid workers.\"\n\nMs Lowe said the best way to decrease rents would be a big increase in state-built social housing.\n\nThe state government did not respond to further questions in time for publication.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/ipl-players-consider-leaving-india-pakistan-conflict/105272142",
    "title": "Blackouts and travel chaos leave IPL season hanging by a thread",
    "publish_date": "Thu, 08 May 2025 23:10:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Indian Premier League is facing postponement due to increasing tensions between India and Pakistan, as international players consider leaving the country.\n\nThe confusion around the immediate future of the tournament was highlighted overnight when Ricky Ponting's Punjab Kings game in Dharamsala was postponed due to a power outage, with the location of future matches still up in the air.\n\n\"We're not sure where we're going at the moment,\" Ponting said after being asked about the future plans for his team.\n\n\"There's been some talk about Ahmedabad and some talk about Jaipur, but we're only really worried about tonight's match.\n\n\"You know, there's been a fair bit happening the last few days and we're just trying to make sure we focus on our performance here.\"\n\nOn a day when the league cited logistical challenges amid increasing tensions, coach Ponting was left frustrated when a power failure stopped the Kings' batters just when they were fully charged against Mitchell Starc and the rest of the Delhi Capitals attack.\n\nPunjab had cruised ominously to 1-122 in just 10.1 overs when one of the light towers at the picturesque stadium malfunctioned and the game had to be called off, with both sides getting a point each.\n\nDelhi was happy about that — but it was a frustration for Ponting, who had felt his side could amass something in the region of 240 after a dazzling start from his two openers.\n\nPriyansh Arya cracked 70 and Prabhsimran Singh was 50 not out after a rocky opening for Starc, who had been hit for five boundaries in two wicketless overs (0-23).\n\nThe \"no result\" left the Kings, whose side had featured two of their five Australians, Josh Inglis and Marcus Stoinis, still handily placed in third place on 15 points, with only four teams to qualify.\n\nBut what happens next for the Kings and the rest of the IPL program remains up in the air with the news from the Indian Cricket Board (BCCI) that the next match planned to be played in Dharamsala on Sunday had been moved to Ahmedabad.\n\nAirports in Dharamsala and Chandigarh — where the Kings are based — have been closed for civilian and commercial use since Wednesday, while others across India's north-western corridor are also out of bounds to the cricketers.\n\nDespite the volatility of the situation, BCCI secretary Devajit Saikia said the foreign players in the 10-team league had no worries about continuing to play.\n\n\"They are quite comfortable. Everyone in the league is comfortable,\" Saikia said.\n\n\"The safety and security of every player — be it a local player or a foreigner — every match official and every fan is important for us.\n\n\"We have the clearance of every single authority.\"\n\nPakistan Super League moves to UAE\n\nMeanwhile, the Pakistan Super League will move the remaining matches of its season to the United Arab Emirates amid the ongoing tensions between Pakistan and India.\n\nA match between Peshawar Zalmi and Karachi Kings, due to be held in Rawalpindi, was postponed after Pakistan's military said Indian drones were destroyed in various Pakistan cities.\n\nA Pakistan Cricket Board official told the BBC that one drone misfired and led to an explosion in the street behind the stadium in Rawalpindi. The BBC had been unable to verify these claims.\n\nThe exact schedule for the rest of the tournament, including dates and venues in the UAE, has yet to be confirmed.\n\nAustralian players in the PSL include Matt Short, Ben Dwarshuis, Riley Meredith, David Warner, Ben McDermott, Ashton Turner, Mitchell Owen, Max Bryant, and Sean Abbott.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/ship-rules-stop-interstate-grain-exports/105264640",
    "title": "'Horrendously expensive' interstate shipping denies farmers lifeline",
    "publish_date": "Thu, 08 May 2025 23:03:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "A West Australian grain exporter says it is cheaper and safer to send Australian grain to China than to drought-hit farmers in South Australia and other states.\n\nLivestock farmers grappling with an ongoing drought in SA are running short of feed and are looking to source high protein crops, such as lupin, and fodder from other states.\n\nBut Perth shipper John Orr said union and government-imposed shipping rules made it risky and expensive to send grain to other states.\n\n\"It's horrendously expensive to ship interstate these days and there's some really sad reasons for that,\" he said.\n\nMr Orr said mandated higher wages for seafarers on interstate shipments added $60 a tonne to the cost of lupins and other grains compared to the average shipment to China.\n\nMost of Australia's domestic freight is transported via road or rail.\n\nThe nation has nine Australian-flagged ships and the government is looking to increase the fleet.\n\nGraziers in South Australia are experiencing difficult times after low rainfall last year. (ABC Mid West Wheatbelt: Jo Prendergast)\n\nRationing feed, waiting for rain\n\nNear Streaky Bay on the Eyre Peninsula, farmer Dion Trezona has been rationing the feed he has left for his sheep while hoping for rain.\n\nLast year, he cut 60 bales of hay.\n\nHe usually grows about 1,000.\n\n\"It's less than ideal,\" he said.\n\n\"When you only have 100mm of rain for the whole year last year, the feed now is pretty well non-existent.\n\n\"It's going to be very, very tight getting through to the finish line [after rain] at the end of June.\"\n\nMr Trezona said he had brought some manufactured sheep pellets from WA on trucks.\n\nRunning out of hay was his biggest concern.\n\nHe said some grain prices had soared and the freight cost for feed was adding $100-to-$150 a tonne to his expenses.\n\n\"There's no support over here in South Australia for the majority of grain producers in the state,\" he said.\n\n\"The state government here seems to think we'll grow the money to get the economy going for the state, but they don't have to support us in the middle.\n\n\"When you're 1,000 kilometres from anywhere and you just want stuff to rock up in bulk, a bit of support for some freight subsidies would be appreciated, if not needed.\"\n\nDion Trezona says he is worried about running out of hay. (ABC Mid West Wheatbelt: Jo Prendergast)\n\nRules 'deny efficient trade'\n\nMr Orr said he had received enquiries about sending lupin, and he wanted to assist, but he could not make the numbers work.\n\nHe said crew costs, Australian port container booking charges, and the risk of exorbitant fees if a container arrived at the wharf an hour late made it unviable.\n\n\"Plus, you still have to pack the product and then you have to get anthracnose testing done because of interstate quarantine requirements,\" he said.\n\n\"Those containers get locked up while you're doing the tests. There's a lot of risk involved.\n\n\" This is denying efficient trade of goods, which actually hurts everyone, it hurts the engine room of the economy. \"\n\nJohn Orr says the costs of interstate shipping are prohibitive. (Supplied: John Orr)\n\nReview underway\n\nAfter promising to create a \"strategic fleet\" of up to 12 Australian-flagged and crewed vessels for commercial operation in 2019, the Commonwealth government also commissioned a strategic fleet task force report.\n\nIt made recommendations to reverse the decline of the Australian shipping fleet.\n\nThe report suggested shipping taxation incentives and government financial assistance be provided to ship owners and operators to reduce the cost gap between Australian and foreign vessels.\n\nMaritime Industry Australia chief executive Angela Gillham said tax reform, such as seafarers' income tax and changing corporate tax settings, was essential to make Australian vessels cost competitive with their international counterparts.\n\n\"When we are talking about the competitive nature of Australian ships versus international, it's really all about tax,\" she said.\n\n\"There are some really good opportunities to reduce the cost differential between Australian and foreign ships that are available for the government to do right now.\"\n\nMs Gillham said the government needed to act swiftly.\n\n\"We have about nine vessels left, for a very large island nation that has a significant shipping task that exists within a fairly volatile geopolitical dynamic at the moment, vulnerable supply chains, we think it is incredibly urgent,\" she said.\n\n\"We needed to get started on this a decade ago.\"\n\nSupply chain task force\n\nAfter floods cut railway lines in 2022, the WA government formed a shipping and supply chain task force to examine industry links between WA, interstate and international customers.\n\n\"Current [Commonwealth] policy favours the use of international shipping lines for most import, export and domestic sea-borne freight,\" the taskforce report noted.\n\nThe report made a range of recommendations, including that the WA government work with the Commonwealth and other states to \"level the field\" with international carriers and stimulate an Australian-flagged fleet.\n\nSheep farmers in South Australia are carefully budgeting livestock feed. (ABC Mid West Wheatbelt: Jo Prendergast)\n\nWA farmers miss price premiums\n\nBarry Large heads up Grain Producers Australia, a national organisation representing grain growers.\n\nHe said Australian growers should have access to any domestic market at any time as long as biosecurity protocols were met.\n\n\"When it comes to handling and shipping, I find it distasteful that we can't work this out to be able to help these places that are in need of quality product,\" he said.\n\n\"It's putting added costs onto the growers who are finding it tough at the moment because they can't access [the WA] market, so really it's not helping anyone here.\"\n\nMr Large said bulk shipping would normally be the most cost-effective way of moving large volumes of grain, while removing it from the road network.\n\n\"Quantity [should] mean decreased costs, and when it works the other way, you really have to ask questions.\"\n\nMr Large said the current legislation review was an opportunity to create a more flexible and cost-competitive domestic shipping system.\n\nA final report for the Coastal Trading Act review is due this year.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/nt-barramundi-classic-fishing-competition-daly-river-remote-/105271168",
    "title": "Iconic fishing competition draws anglers to the NT's remote Daly River",
    "publish_date": "Thu, 08 May 2025 22:32:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "From a packed tourist park on the banks of Daly River, anglers in teams of three venture as far as 50 kilometres downstream in search of a prized barramundi.\n\nAbout 150 competitive anglers from around the country have travelled from as far away as Melbourne and the Pilbara to this remote river in the Northern Territory.\n\nThe Daly River is about 220 kilometres south of Darwin. (Supplied: Rick Knight/Darwin Game Fishing Club)\n\nThey are here for the popular annual event the Barramundi Classic, a tag-and-release tournament targeting a fish favoured by anglers for its elusive behaviour, and what many describe as an exciting fight once hooked.\n\nOver the five-day event, about 3,000 fish are expected to be tagged, with competitors earning points based on a combination of the size of the fish they catch and overall quantity caught.\n\nWhile many serious competitors arrive towing expensive boats boasting the latest and greatest technology in sport fishing, for most, the event is a chance to connect with friends and enjoy the scenery on stunning Malak Malak country.\n\nAcclaimed Darwin angler Shane Compain is attending the 2025 Barramundi Classic. (ABC News: Tristan Hooft)\n\nFishers are advised to be aware of the presence of crocodiles while on and around the Daly River. (ABC News: Tristan Hooft)\n\nMasters angler Gaye Silva first came to the Daly in 1999 and has returned to the Barramundi Classic every year since.\n\n\"It's like a big reunion every year. All the familiar faces and so many friends that we've made through fishing. We just love it, and the fishing of course is a bonus,\" she said.\n\nDespite gender stereotypes associated with the sport, more women than men fish in the Northern Territory, something Ms Silva said was slowly being reflected by the number of women who fish competitively in the Barramundi Classic.\n\nBarra Classic competitor Gaye Silva preparing to enjoy a sweet treat on the Daly River. (ABC News: Tristan Hooft)\n\n“Back in the day there may have only been four or five women fishing, but now there are maybe 20. A lot of women fishing,” Ms Silva said.\n\nShe adds that the sport is “fully embraced by everyone”.\n\nFishing for science\n\nAll barramundi caught during the event are tagged to assist in scientific monitoring by the NT Department of Agriculture and Fisheries before being quickly released, making it one of the biggest contributors to barramundi tagging data in the region.\n\nCompetitors use a bespoke tool to insert a numbered plastic tag under the skin of the fish, making it identifiable should it be caught again.\n\nInformation, including the size of the fish and the location it was caught in, is recorded and entered into a database supplied to Fisheries, contributing to the sustainable management of the popular fishery.\n\nThe tagging of the barrumundi helps the NT Department of Agriculture and Fisheries monitor the species. (ABC News: Tristan Hooft)\n\nAlex Julius, a lifetime member of the Amateur Fishing Association of the Northern Territory (AFANT) was involved in establishing fish tagging at the Barra Classic in the 1980s.\n\n“It was really the start of serious recreational tagging for barramundi in the Northern Territory and has proven to be very beneficial to gaining knowledge of the fishery,” Mr Julius said.\n\nMr Julius says the tagging of barramundi made the competition unique.\n\n\"The only other tagging competitions that take place are for billfish,\" he said.\n\n\"As far as I know, there's no other tagging program for smaller sport fish like the barramundi.\"\n\nAlex Julius (Centre) says the tagging element of the Barramundi Classic made the competition unique. (ABC News: Tristan Hooft)\n\nAccommodating seniors\n\nEven with the right precautionary measures, hours in the Top End sun can take a toll on competitors, especially the tournament’s more experienced anglers.\n\nNow in its second year, a masters competition for anglers over the age of 60 is held concurrently, running for three days instead of the main event’s five.\n\nLifetime member of the Darwin Game Fishing club, Leigh Halprin, said he hatched the idea for a masters division after seeing exhausted older competitors return to camp after a long session on the river.\n\n“A lot of the older guys who had been fishing for a long time were [saying] the days were getting longer and hotter and we can’t sort of keep up all the time,” he said.\n\n“So, I took it on board and started thinking, well, maybe we need something to keep them fishing in the classic if we made it easier for them.\"\n\nLeigh Halprin was the instigator of the masters division, which caters for senior fishers looking for shorter days. (ABC News: Tristan Hooft)\n\nWhile competitors in the masters competition start at the same time, Mr Halprin said a shorter day fishing allowed older competitors to enjoy the event as much as other fishos.\n\n“Lines out is a couple of hours earlier to give you time to get back to the campsite, have the first hot shower, have the first beer, relax, be able to tie up the boat to the pontoon before everybody else gets back,” he said.\n\nThe inaugural masters competition last year attracted six teams.\n\n\"Second year in, we've got 12 teams and they're all still enjoying the fishing knowing that they don't have to go as hard,\" Mr Halprin said.\n\nThe Barramundi Classic runs until Sunday.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/drought-impacting-wool-industry-shearing-workforce/105267254",
    "title": "Shearers struggle for work as wool production hits century low",
    "publish_date": "Thu, 08 May 2025 21:50:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Shearers are struggling to find work as Australian wool production falls to its lowest in more than a century.\n\nSteep falls in wool production and sheep numbers in drought-affected South Australia have forced shearers to look interstate and overseas for work or consider leaving the industry.\n\nThe wool industry has fallen on hard times in recent years. (ABC Rural: Selina Green)\n\nNaracoorte farmer Paul Oster said he had seen the wool industry from many angles as a grower, shearer, trainer and shearing contractor, and the drought and increasing costs were affecting all involved.\n\n\"It has a rippling effect through everyone's business livelihood, their family livelihood, community livelihood … it's of great concern,\" Mr Oster said.\n\nMr Oster is worried good workers are turning away from the industry due to the lack of opportunities.\n\nMost people in the wool industry are confident production will bounce back. (ABC News: Floss Adams)\n\nHe said well-organised shearers could once keep themselves busy enough through the year to make ends meet, but options had become limited.\n\n\"We have such a high-performing level of staff right now that are unfortunately questioning, 'Where is our future?'\" Mr Oster said.\n\n\" I never thought I would actually say your best option could possibly be Centrelink through this quiet time. \"\n\nShearing Contractors' Association of Australia shearer woolhandler training executive officer Glenn Haynes was also concerned.\n\n\"I honestly think we are going to lose around 20 per cent of our workforce in South Australia,\" he said.\n\nNational problem\n\nMr Haynes said he was putting on extra training sessions in 2023 to help fill a shortage of workers in the industry.\n\nHe said the shortage had since turned into an excess.\n\nGlenn Haynes (left) has worked in the wool industry for three decades. (Supplied: Glenn Haynes)\n\n\"I've never had so many people ringing me looking for work,\" Mr Haynes said.\n\n\"We've still got a lot of young people wanting to get into the industry … but it's having a job on the other end of it.\"\n\nWhile those looking for work would usually go interstate, he said the opportunities were not there either.\n\nWool quality has also been impacted by drought conditions. (ABC South East SA: Liz Rymill)\n\n\"The trouble is you have the majority of Victoria in a similar situation and a lot of NSW in the same situation, and then the floods in Queensland, and Tasmania is just full,\" Mr Haynes said.\n\n\"WA's sheep numbers have dropped dramatically over the last 12 months … so we have a lot of Western Australians ringing looking for work as well.\n\n\"There's a lot of guys and girls out there that are just … going to have to travel [overseas for work] this year.\"\n\nThe Australian Wool Forecasting Committee expects the nation's wool production to decline almost 12 per cent this year compared to last.\n\nIt has forecast a further 8.4 per cent drop in the coming financial year.\n\nThe estimated wool production for 2025-26 is 256.6 million kilograms, which would be the lowest recorded level since the early 1900s.\n\nIn SA and WA, this year's clip is forecast to fall 18.4 per cent.\n\nDrought impacts SA wool\n\nAustralian Wool Network SA manager Rod Miller said many producers had reduced their flock due to the ongoing drought.\n\nRod Miller says the cost of managing drought conditions is impacting farmers. (Supplied: AWN)\n\n\"The excessive, long feeding cost is the proverbial straw breaking this camel's back,\" Mr Miller said.\n\n\"The drought will finish one day, but we're going into the second year now and if you're feeding out sheep over 14 months continually, it's a real Groundhog Day for a lot of these producers.\n\n\"With higher input costs and include shearing as well, and the feed costs, it's just soaking up all the profit margin and taking a lot of the fun out of it.\"\n\nMr Miller said SA was feeding an oversupply of drought-affected wool into a market of low global demand.\n\nGrowers determined to hang in\n\nWhile people in the wool industry agree times are dire, those who have stuck with it believed it could bounce back once rain returns.\n\nWhat's wrong with our weather charts this year? Photo shows A clear blue sky over paddocks in Auburn, SA As South Australia and Victoria continue to face drought and unseasonable heat, there has been a notable absence of major rain systems. So, what's going on?\n\nSandy Martin, who operates Baratta Station in SA's mid-north, said he had ridden the ups and downs of the sheep industry for the past 45 years.\n\n\"In the last 10 years, we've had three years of drought, two years of COVID, two years of low commodity prices, and we're still in business,\" he said.\n\n\"Actually, we've had a lovely year at Baratta and our sheep and wool production has been above-average, and our farming country at Jamestown is just hanging in there.\n\n\"If we get rain, we'll get back on track pretty quickly.\n\n\"If it all comes together, it's a bloody beautiful industry — I couldn't think of anything better.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/michelle-grattan-liberals-leadership-struggles/105271102",
    "title": "Bitter struggle in Liberals for likely poisoned chalice",
    "publish_date": "Thu, 08 May 2025 21:31:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "By late last week it was clear Labor would win the election, but it came as more of a surprise when Peter Dutton lost the Queensland seat of Dickson he'd held since 2001.\n\nNor did many anticipate Greens leader Adam Bandt, member for Melbourne since 2010, would be swept away, in a lower house rout that has seen the minor party stripped of three of its four House of Representative seats.\n\nBoth the Liberals and the Greens are in existential moments, in need of new leaders and some painful introspections about their future directions.\n\nThinking back to the Liberal experience after Kevin Rudd's 2007 victory, some wonder why anyone would be putting up their hand for the party leadership.\n\nThe Liberals churned through three leaders between 2007 and 2009. Brendan Nelson took over the party after Labor's victory; undermined by Malcolm Turnbull, he lasted less than a year. Turnbull survived just over a year before being ousted by Tony Abbott.\n\nAdmittedly the experience of Peter Dutton was different — he was given a full term as opposition leader.\n\nBut the chances of Dutton's successor becoming prime minister will be very low. With the added seats Labor has won, the Liberals are looking at a two-term strategy. The odds are on more than one leader, and generational change, in that time. Tim Wilson, 45, who has won back Goldstein, obviously has his eye on the prize in the longer term.\n\nLoading\n\nDespite all the disincentives, Sussan Ley, 63, and Angus Taylor, 58, both want this thankless post that's up for grabs at Tuesday's party meeting.\n\nThe battle has turned into a fight over negatives as much as positives. Supporters of Ley say Taylor did a dreadful job as shadow treasurer, including not producing a tax policy. The Taylor camp argues Ley, the deputy leader, under-performed generally.\n\nBoth contenders hold regional NSW electorates. Taylor's support base is the conservative wing of the party; Leys' is the moderate wing. The relative weightings of the factions in the Liberal party room has changed somewhat as a result of the election, in the favour of the moderates.\n\nFor those Liberal MPs whose votes are not tightly locked in by factional allegiances, there are multiple questions they need to consider.\n\nWho will be able to keep the party together, while forcing it to face up to what changes it must make, and driving a major overhaul of policy? Who can improve the Liberals' standing with women, and with younger voters? Who can better handle the relationship with the Nationals?\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nOn the last point, anyone who might think it would be best to break the Coalition is, I believe, misguided. Going it alone didn't work in the 1970s and the 1980s. Different as they may be, the Liberals and Nationals are, electorally, two parts of a whole.\n\nThey need their collective numbers to win and they're better to stay together in opposition, to make the partnership in government work. But the relationship may be rocky.\n\nAt the election, the Nationals retained almost all their seats and will have a relatively bigger voice from now on.\n\nOn Thursday, however, their highest-profile senator, Jacinta Nampijinpa Price, jumped from the Nationals to the Liberals. She said she thought she could be more effective in the Liberals, \"especially as the party faces a significant rebuild […] I feel obliged to play a robust part in\".\n\nThis was a concerted move from the right, and will play into the leadership contest in an as-yet unclear way. With speculation that she might run as Taylor's deputy, Price was asked on Sky on Thursday night if she would be willing to be drafted for a position. \"I will not put any limitations on myself,\" she said.\n\nFor the Liberals, there is absolutely no silver lining from this election. The Greens can take some comfort in the fact they’ve retained their numbers (11) in the Senate, with only a small fall in their Senate vote. On the projected results, the Greens are set to be the sole negotiators with the government in the Senate on legislation opposed by the Coalition.\n\nWho will become leader is still an open question, with South Australian veteran senator Sarah Hanson-Young, deputy leader Mehreen Faruqi, and the party’s Senate leader, Larissa Waters, mentioned. Whoever gets the post, the leadership will return to the Senate, where it always was until Bandt obtained the position in early 2020.\n\nPost election, Anthony Albanese has continued his fierce pre-election attack on the Greens. “What I hope comes out of the new Senate is a bit of a recognition that one of the reasons why the Greens political party have had a bad outcome in the election is the view that they simply combined with the Coalition in what I termed the ‘noalition’, to provide blockages, and that occurred across a range of portfolios, housing, treasury, as well as environment,” he told the ABC.\n\nAlbanese was particularly scathing about Greens housing spokesman Max Chandler-Mather who lost his seat and criticised parliament as a “sick place”.\n\n“Maybe what he needs is a mirror and a reflection on why he’s no longer in parliament. […] This is a guy who stood before signs at a CFMEU rally in Brisbane describing me as a Nazi.”\n\nBob Brown, the Greens’ inaugural leader from 2005 to 2012, describes Albanese’s comments as \"ungracious\" in \"his moment of glory\".\n\nABC Politics in your inbox Photo shows Brett Worthington looks at the camera wearing a blue blazer and glasses Sign up to the ABC Politics newsletter with Brett Worthington\n\nWhile the Greens' pro-Palestinian position came under much criticism, Brown strongly defends it, declaring it \"honorable\".\n\nBrown, speaking to The Conversation, says the Greens will be in an extraordinarily powerful position in the Senate, and their \"environmental origins will come back to the fore\". He urges the Greens to \"have deaf ears to calls for the Senate to be a rubber stamp\". The constitution, he says, has the Senate with equal powers with the house except on money matters.\n\nBrown predicts the Greens will be \"resurgent\" at the next election. His strongest message is directed squarely at the government. \"The Greens should never direct preferences to Labor again — because Labor takes preferences with one hand and stabs the Greens with the other.\"\n\nLike the new Liberal leader, Bandt's successor will inherit a party at a fork in the road. Does it become more militant or more moderate, more confrontational in its dealing with the government, or as transactional as possible?\n\nBandt's hope of the Greens power-sharing with a Labor government in the lower house has evaporated. So how does the party use what power it has in the Senate, while trying to put itself in the best position to avoid going further backwards at the next election?\n\nMichelle Grattan is a professorial fellow at the University of Canberra and chief political correspondent at The Conversation, where this article first appeared.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/europa-league-tottenham-hotspur-through-to-final/105271934",
    "title": "'Couldn't be prouder': Ange's Spurs power into Europa League final",
    "publish_date": "Thu, 08 May 2025 21:27:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ange Postecoglou's dream of ending a wretched season for Tottenham with a piece of silverware is still alive after Spurs put on a polished, professional performance in Norway to beat FK Bodø/Glimt 2-0 and book a place in an all-English Europa League final.\n\nSpurs' 5-1 semifinal aggregate win has set them up with a mouth-watering finale to a troubled season as they'll play Manchester United in the one-off decider after the fellow Premier League strugglers beat Athletic Bilbao 4-1 at Old Trafford for a 7-1 aggregate win.\n\nThe final will be in Bilbao, Spain on May 21 with Postecoglou having a chance to maintain his proud assertion that he always wins a trophy in his second year in any managerial job.\n\nIt looked a tough assignment in the Arctic Circle for Spurs, who led 3-1 after the first home leg but had to contend with a team that has become one of the romantic favourites in the tournament and is awfully hard to beat on its own plastic pitch as many European luminaries have discovered.\n\nBut two goals in six minutes just after the hour from Dominic Solanke and Pedro Porro were enough to underline Spurs' superiority, with Postecoglou's job prospects at the club having been given a major boost.\n\n\"Couldn't be prouder of the lads,\" Postecoglou said after the game.\n\n\"We knew it was a difficult place to come. We're aware of the record they have here, the pitch. I think the lads handled it well. Excited, we're in a final.\n\n\"We've grown in maturity and we understand exactly what's required. I think that's where we won the game. We kept them to a minimum in the first half and did what we needed to do.\n\n\"We've used every player in the squad. We've overcome adversity. I felt when we got into the knockout, it helped we got players back.\"\n\nPostecoglou also paid tribute to the Spurs fans who have stuck by him in a difficult season.\n\n\"It's why you do what we do,\" he said.\n\n\"You understand the context of what this football club has been trying to achieve for quite a while. Managers and players come and go but the supporters are a constant. There were 400 here tonight and maybe a few more snuck in and many more at home. I hope we gave them something to smile about.\n\n\"We'll just keep doing what we're doing.\"\n\nTottenham will play Manchester United in the Europa League final on Thursday, May 22 at 5am (AEST). Join ABC Sport's Simon Smale as he live blogs all the action.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-09/asx-markets-business-news-live-updates/105271992",
    "title": "Live: First Trump tariff deal boosts US shares but ASX trades flat",
    "publish_date": "Thu, 08 May 2025 21:21:00 +0000",
    "category": "finance",
    "authors": [
      "Michael Janda",
      "Nassim Khadem",
      "David Taylor"
    ],
    "text": "Housing affordability was a major issue in Labor's election campaign, with promises to construct 1.2 million new homes to address housing shortages.\n\nAnalysis from BMI, a Fitch Solutions Company, suggests this policy resonated strongly with urban voters.\n\n\"Australia's 2025 federal election resulted in a decisive victory for Prime Minister Anthony Albanese and the Labor Party, securing 89 seats in the House of Representatives and marking the largest win for Labor at the federal level since 1987,\" BMI said.\n\n\"Labor's comprehensive plan to tackle the cost-of-living crisis includes power bill rebates, tax cuts, reduced PBS medicine costs, and student debt relief, totaling over 20 billion, which face challenges due to modest economic growth prospects.\n\n\"Fulfilling Labor's ambitious economic promises will necessitate careful budget management to avoid unsustainable debt levels.\"\n\nIt notes over the past decade house prices have surged, with the average price of residential dwellings reaching $977,000 in Q4 2024, up from $686,000 in Q4 2019 and $568,000 in Q4 2014.\n\n\"The severity of the issue is further underscored by the rise in the payment to income ratio, which increased from just over 30 per cent in Q3 2020 to nearly 55 per cent in Q4 2024.\"\n\nRead more about how the mainstream political parties campaigned on the issue of housing affordability, and the related debate about whether to get rid of property tax breaks, here:",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/they-re-a-childhood-rite-of-passage-so-why-are-more-parents-saying-no-to-sleepovers-20250402-p5logq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "They’re a childhood rite of passage, so why are more parents saying ‘no’ to sleepovers?",
    "publish_date": "Fri, 09 May 2025 12:00:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "He plans to revisit the rule when his daughters are around 15, “when they’re more mature and when they’re more armed to defend themselves, I suppose, in the event of something happening”. Changing cultural attitudes to sleepovers Gabrielle Hunt, a PhD candidate at Australian Catholic University and a registered psychologist, says more Australian parents are becoming wary of sleepovers. Some are worried about the risk of sexual abuse, says Hunt. Others, she says, are concerned about technology use, and differing family’s rules around devices.\n\nEqually, Hunt acknowledges that sleepovers can be an important stage of development for many children. Loading “Sleepovers can be an opportunity to build really close relationships with their peers and develop resilience about being away from home, and having to look after some of those self-care tasks that might otherwise be prompted by mum or dad,” says Hunt. Is there a ‘right’ age for sleepovers? There is no right age for children to start attending sleepovers, says parenting educator and founder of Connected Parenting Genevieve Muir.\n\nA mother of four boys under 18, Muir does allow sleepovers, but says the right age has varied from child to child. “One of my kids has a significant speech challenge. I wasn’t going to let him have a sleepover as fast as his older brother because I knew that should something happen, he wouldn’t have the ability to communicate that as well to me.” “It’s looking at the skills and where my child is at and thinking, ‘Well, is my child ready?’ Not just in a ‘want to go’ capacity, but in an emotional readiness and a self-readiness,” she says. “It should be a decision that happens between parents and their children in terms of what they both feel comfortable with,” says Hunt.\n\nTheir first sleepover Loading Ahead of a child’s first sleepover, Hunt says it’s important to nail the basics – like toileting, showering and table customs. Then, make sure your child has an exit strategy should they need one. “It’s about communicating, ‘It’s okay if you want to go home’.”\n\n“It’s really common for kids to get to bedtime and miss home or it’s really scary because it’s the first time. So just reassure children that it’s okay if you need to get picked up, even if it’s late,” says Hunt. Loading She recommends ensuring your child knows who to speak with should they need an “out”, or scheduling a time for you to call. She says preparing your child for their first sleepover should start well before the age they are ready. “The single biggest thing we can do as parents is have open, ongoing, honest conversations about children that empower them,” she says.\n\nHow to talk to the host family Ahead of a sleepover, particularly if it’s your child’s first time with a host family, Hunt recommends talking with the host adults. This includes broaching topics like “when is an appropriate bedtime, what your rules and expectations around device use are, and who else is going to be in the home when this sleepover happens,” including if parents might be leaving kids with a babysitter. Consider an “everything but the sleep” sleepover, where the kids stay up late, have a midnight snack, then return home to sleep. There’s no need to feel uncomfortable asking questions, either, if they can help you and your child feel at ease.\n\nIf the sleepover is with a family you don’t know well, Hunt suggests holding a daytime get-together beforehand. If you are simply not comfortable with a family, always trust your gut, says Muir. Sleepover alternatives If you don’t think your child is ready for sleepovers, there’s no need for them to miss out on the fun. Hunt recommends the “everything-but-the-sleep sleepover” as an alternative, where kids might have a late night but return home to sleep in their own bed.\n\nMuir suggests talking with your child about why they want to attend a sleepover. Loading “We can’t really expect a child to understand, ‘I’m trying to keep you safe’. They don’t care about that. They just want to go on the sleepover.” Instead, try to understand their motives. “It might be, ‘We’re going to have a midnight snack and we’ve been talking about it’. So you could say, ‘Let’s have your friend over, we’ll have a late snack and then I’ll drop them home.’ You can come up with alternatives when you understand what the motive is.”",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/art-and-design/archibald-prize-live-results-2025-blog-updates-portrait-prize-wynne-sulman-packing-room-winners-art-gallery-of-nsw-start-time-20250509-p5lxv7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Archibald Prize LIVE updates: Tell us who you think will win",
    "publish_date": "Fri, 09 May 2025 11:58:30 +1000",
    "category": "entertainment",
    "authors": [
      "Linda Morris",
      "Hannah Kennelly"
    ],
    "text": "Good morning,\n\nI’m Hannah and welcome to our 2025 coverage of the Archibald, Wynne and Sulman prize winners at the Art Gallery of NSW.\n\nArchibald Prize finalists at the Art Gallery of NSW in Sydney. Credit: Janie Barrett\n\nThese are three of the most coveted prizes in the Australian art world and we are expecting winners to be announced from noon today.\n\nThe $100,000 103-year-old Archibald Prize for portraiture was first awarded in 1921. This year it attracted 904 entries.\n\nJust over one-third of the 57 entries are first-time nominees. Twenty-two are portraits of fellow artists and there are 12 self-portraits. Six subjects are from the stage and screen, three from the world of media and journalism, and three from music. A gritty portrait of city councillor Yvonne Weldon is the lone pollie’s portrait to grace the gallery walls.\n\nThe exhibition of the prize finalists opens to the public tomorrow and continues until August 17. It will then tour venues in NSW and Victoria.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/business/companies/the-woman-who-took-on-tesla-and-wants-to-see-musk-in-court-20250501-p5lvwe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The woman who took on Tesla (and wants to see Musk in court)",
    "publish_date": "Fri, 09 May 2025 11:51:41 +1000",
    "category": "finance",
    "authors": [
      "Jim Norton"
    ],
    "text": "Two years later, in November 2021, it appeared her seven-year campaign to hold the near-trillion-dollar company to account in a public court had finally stalled, however. Having insisted on representing herself, taking on Tesla’s army of expensive lawyers alone to keep costs down, her defamation case was thrown out. Musk, it seemed, was victorious. But, four years on, his words could come back to haunt him. Despite battling late-stage breast cancer, Balan refused to give up. Last month, the indefatigable mother-of-one won an appeal that reverses the decision – and opens the way for her explosive claims to be heard in public. ‘It was not easy to think that my son’s memory of me would be overshadowed because of this scumbag.’ “I cannot wait to see Musk and his goons on the stand and see how they will explain their lies and hate against me for doing the right thing,” posted Balan on X shortly after the decision was handed down on April 14. A fortnight later, speaking from Jacksonville, Florida, she is no less combative.\n\n“What a pathetic hypocrite that monster is,” she tells The Telegraph, in a thick Transylvanian accent. “At the same time, he’s bragging about being the free speech absolutist, he’s paying millions of dollars in legal fees to make sure I never have my day in court.” “I have the evidence for everything,” she adds, claiming that several top executives have agreed to testify in her case, and that Tesla is very much aware of one particularly damning recording. “That’s the reason Musk is so p-----.” Serious quality and safety concerns Growing up just 15 minutes from Bran Castle, otherwise known as Dracula’s Castle, Balan’s favourite toys as a child were pliers and screwdrivers. While other girls played with dolls, she would often be found with oil on her clothes and in her hair, taking engines and motors apart and putting them together again. Tesla’s stock price is the key to Musk’s business empire and his personal life. Credit: Getty Images\n\nAfter marrying aged 22, she went on to earn a degree in engineering and then moved to Canada in the early noughties. She later joined Boeing to work on the interior of the 787 Dreamliner in Seattle. In 2010, she was hired by Tesla – still a relatively small company – to help design the battery pack for the Model S. Well-liked and known for being a hard worker, she solved a crucial problem early on that had baffled managers and was delaying the sedan going into production. In recognition, her initials were etched into the battery pack case, which can still be found on some models. In a court document, Tesla’s lawyers admitted Balan was “at the heart of innovation at Tesla”. Branding Musk an arrogant “spoiled brat” who would constantly flaunt his wealth, her memory is no doubt tainted by subsequent dealings with his lawyers. But aside from some suggestive remarks about the “well-equipped” girls in the office when she was in earshot, she doesn’t recall any particularly bad run-ins with him. Loading Indeed, it was Musk she turned to directly in 2014 when she first discovered “serious safety and quality” flaws after joining the interior fittings team. In an email, she sidestepped her own line manager and requested a meeting with him to discuss her concerns that the interior floor mats could curl up and interfere with the brake pedal.\n\nHowever, on the day of the meeting with Musk, HR instead allegedly marched her to a “dungeon room”, where two security guards “with guns and handcuffs around their waist” were told to stay outside “in case she runs away”. She claims she was pressured to resign immediately. Feeling like she had no alternative, Balan signed the paper in front of her, but wrote she was only doing so because she had “dare[d] to speak up” to senior management. Shocked, Balan says she fainted as she was escorted out. Ever since, she has been fighting to clear her name. “That made my fight with cancer even more difficult,” Balan says. “Because there were quite a few moments they didn’t know if I would make it. It was not easy to think that my son’s memory of me would forever be overshadowed because of this scumbag.” She reserves particular anger for arbitration agreements. For the first few years, she was unable to fight the claims publicly due to the clause inserted into every Tesla contract. The concept was first introduced in the US in 1925 to relieve the burden on the court system by moving business contract disputes into a separate forum. But their use has mushroomed. Research suggests 80 per cent of the largest US companies have used such agreements in workplace disputes. (They are far less common in the UK, where employees have greater protections.) Such clauses – which notoriously tend to favour the employer – are “a back door for nasty corporations to steal freedom of speech”, says Balan.\n\nAfter three years in private arbitration over her removal from the company, Balan was awarded $US350,000) – “peanuts” compared to the $US40 million she says the shares she relinquished when she left would now be worth. She was not willing to give up and decided to go public with her claims in 2017. Tesla was incensed. In response to a Huffington Post article which marked the first coverage of her case by the media, bosses demanded a 600-word rebuttal that made claims of “criminal conduct” by Balan when she was an employee – despite never having raised these in the arbitration hearings. In 2019, Balan filed her defamation lawsuit, claiming it damaged her reputation and made it near impossible for her to find a job. She alleges it left her effectively blacklisted. On one occasion, a British director at a US company rang her to explain that he’d wanted to hire her but his legal team had intervened, Balan claims. “They kept calling and threatening people who wanted to hire me that they couldn’t afford to be on the wrong side of Elon Musk,” she says. “It was worse than having a crazy maniac as an ex-boyfriend.” ‘Toe to toe with a billionaire bully’ Balan is not the only Tesla whistleblower to find herself at the mercy of Musk’s hardball tactics. In 2018, former Tesla technician Martin Tripp told Business Insider that Tesla was wasting a “jaw-dropping” amount of raw material as it ramped up production of the Model 3. The response? Musk accused Tripp of being a “saboteur”, suing him for $US167 million for allegedly hacking the company’s systems, stealing trade secrets, and leaking information to the media.\n\nTesla even informed police it had received a tip that the former employee might “come back and shoot people” at the Gigafactory in Nevada where he worked. The sheriff’s investigation concluded “there was no credible threat”. Tripp insisted he had leaked the information out of legitimate concern and, believing he had been defamed as a would-be mass shooter, countersued. But the case swung Tesla’s way – with Tripp ordered to pay Tesla $US400,000 in damages in 2020. Balan had raised safety concerns about the firm’s Model S vehicles directly with Musk back in 2014. Credit: AP In Balan’s case, after sending Musk an intent to sue, the defamation claim failed to settle. “One of my conditions was for them to apologise and admit… that everything they said was a lie – and they didn’t want to do that.” Instead, she says, Musk opted for his favoured weapon – “lawfare” – and the battle continued. As the richest man in the world with an estimated net worth of $US330 billion, Musk is not shy of a legal fight. In 2018, British cave diver Vernon Unsworth, who helped rescue a trapped youth football team from a flooded Thai cave, sued Musk for £142 million ($293 million). Musk had branded Unsworth a “pedo” on X after the diver criticised his proposal to use a mini-submarine in the rescue as a PR stunt. He willingly went to court to contest the case – and won. Unsworth’s lawyer subsequently lamented that his client had gone “toe to toe with a billionaire bully”.\n\nIt makes Balan’s case all the more remarkable. Crucially, early on in the defamation case, a judge ruled all the confidentiality clauses in her Tesla contract could be dropped. “That’s the reason why I can legally talk to you now,” she explains. But by the beginning of 2022, her case had seemed all but over as her claim was thrown out by a judge in California and her arbitration verdict was confirmed, closing the matter. Again, Balan refused to give up and appealed the decision. A week later, she was diagnosed with stage-3B breast cancer. As she underwent treatment, she twice asked for a continuation, where the case is put on hold for a certain period. The second time, Tesla’s lawyers refused, she alleges. “So when the due date came to file it last January, I was so exhausted, and the treatment was so harsh and powerful, I was barely…” she says, pausing. “My body was struggling to go to the bathroom. This is how bad I was.” Last month’s decision by the three-judge panel of the Ninth Circuit Court of Appeal effectively nullified her arbitration award as a court judgment, reopening the possibility for Balan to pursue her defamation claims in a proper court of law. Though not yet a victory, it is a significant milestone – and one that is giving other Tesla whistleblowers hope, she says, adding that several have contacted her since the ruling. Loading “Everybody said that it’s impossible,” she says. “Only a handful of people for so many years actually trusted me that I could do it. But I did it.” How does she feel now? “I’m feeling really happy – I proved them wrong,” she says. “I proved to them an immigrant woman engineer had the capacity, the brain power, to learn their stupid legal system and actually win. So yeah, I feel pretty damn good.”",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/hot-sandwiches-hit-the-menu-at-a-p-bakery-s-shiny-new-site-20250509-p5lxwu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hot sandwiches hit the menu at A.P Bakery’s shiny new site",
    "publish_date": "Fri, 09 May 2025 11:45:51 +1000",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nNew speciality sangers are made from rotisserie-cooked meats.\n\n1 / 4 The Midnight in Havana sandwich. Janie Barrett 2 / 4 The porchetta sandwich. Janie Barrett 3 / 4 The rotisserie where the meats are cooked. Janie Barrett 4 / 4 Shiny new A.P Quay, with entrance on Young Street. Janie Barrett Previous Slide Next Slide\n\nBakery$$$$\n\nTucked into the base of the Quay Quarter Tower, A.P Quay is the second All Purpose Bakery location to open this year (and the seventh overall), after chef Mat Lindsay, baker Dougal Muffet and hotelier Russell Beard launched Darlinghurst’s A.P Bread and Wine in January.\n\nCroissants and assorted breads are made on site at the Circular Quay shop, but it’s the hot sandwiches, made from meats cooked on gleaming imported French spits, that have people most excited.\n\nThe big three drawcards from the spit are the BBQ spice-rubbed spatchcock, fennel seed and garlic-rolled porchetta and the pastrami-brined beef, but the full sandwich menu runs much longer, with baguettes, brekkie rolls and toasties.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/afl/glandular-fever-a-ruptured-pec-foot-hamstring-and-back-injuries-a-bomber-s-painful-path-to-16-games-20250508-p5lxls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Glandular fever, a ruptured pec’, foot, hamstring and back injuries: A Bomber’s painful path to 16 games",
    "publish_date": "Fri, 09 May 2025 11:43:46 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "Testing revealed that the 23-year-old’s troublesome left hamstring was smaller and weaker than his right. Dr Enda King gave Reid a series of exercises and sent him back to Melbourne. After considerable hard work, the reward Reid often felt he missed out on was suddenly a reality. Zach Reid competes with Collingwood’s Dan Houston in his first Anzac Day game last month. Credit: AFL Photos “I had a full-body scan recently at Olympic Park that compares muscle mass, and now I’m equal, left and right, and I haven’t had any hammy issues since,” he said. Where the trouble started Essendon selected Reid, then barely 19 years old, to play his first AFL game in round five of his debut season against a Brisbane Lions team that had signed ex-Bombers star Joe Daniher.\n\nHe felt sick that week, but thought it was a common cold, or the flu at worst. Reid was wrong, and his health deteriorated rapidly in the days after playing. Loading “I was like, ‘I’m not giving up this opportunity to play my first game’, so I went up there pretty sick already, and then I played, and I think that just tipped me over the edge,” Reid said. “The exhaustion of playing your first AFL game is hard enough as it is, but when you’ve got glandular fever – which I didn’t know at the time – [it is even harder]. After that, I went downhill. The next week was Anzac Day. It was a dream to play Anzac Day, and I was going to get my opportunity in my first year. I’ve missed every Anzac Day until this year.” Reid, whose draft season was wiped out by the COVID-19 pandemic, was bedridden for weeks, but eventually made it back on the training track. Only weeks in, scans revealed a stress fracture in his lower back.\n\n“I think being in bed for ages, and then coming back to an AFL program, on top of missing so much footy during COVID, didn’t help a growing body,” he said. That ended Reid’s season after just one senior match. Bone stress in the sesamoid bone in his right foot in the ensuing pre-season was just a minor nuisance in comparison. Reid was otherwise injury free in 2022, adding seven senior games and 12 in the VFL. But by December that year, his back stress fractures returned. “That was really flattening,” he said. “People were trying to help, and saying, ‘Oh, you’ve got 10 years ahead of you; don’t worry about it’ – but I think the average [AFL] career length is four years. I was like, ‘You don’t have a crystal ball, so you can’t really say that’.\n\n“My mindset back then was, ‘Poor me; why is this happening to me?’. You think when you’re a top-10 pick, you’re going to come in, and it’s going to go smoothly, but then you get hit in the face with some adversity.” Learning to better handle his setbacks, which Reid said came with maturity and perspective – “It could be a lot worse. I could be homeless” – proved crucial. His three hamstring injuries, all on his left leg, and a ruptured left pectoral muscle were still to come. Zach Reid’s wretched injury history 2021: Reid diagnosed with glandular fever after making his AFL debut in round five against Brisbane Lions. Three months later, after being bedridden then rebuilding his fitness, scans reveal he has a stress fracture in his lower back. 2022: Bone stress is detected in the sesamoid bone of his right foot in pre-season. He wears orthotics to remedy the issue, and plays most of the season between the AFL and VFL. 2023: Another back stress fracture interrupts his pre-season and delays his season start. Shortly after returning in the VFL, Reid suffers a T-junction hamstring injury in his left leg that sidelines him for six weeks. In testing ahead of his planned VFL return, the injury flares up, prompting season-ending surgery. 2024: Suffers a left hamstring strain - in a different area to the previous two - in Essendon’s round one win over Hawthorn. It costs him seven games, then in the fourth match of his comeback in the VFL, an opponent crashes into him, rupturing his left pectoral muscle, leading to another operation. The latter was a freak injury in a VFL match, where Reid went to tackle a Box Hill opponent who “steamrolled” through his arm and ruptured the injury-cursed Bomber’s pec. Season-ending surgery followed. Playing on Anzac Day was not Reid’s only highlight this season. He also had the chance to share the field with, and play directly on, his brother, West Coast forward-ruck Archer.\n\n“I was the perfect match-up for him,” Reid said. “We both didn’t really have any impact, so it was funny, but it was good that it was close. It made it entertaining for our parents.” The Reid brothers, Zach and Archer, played against each other in round six. Credit: AFL Photos Reid insists the only change now he is playing regularly is the extra attention from media and fans, some of whom thank him for being a “bargain buy” in fantasy football. “I’m outperforming my price, so that’s the main thing fans are grateful for,” he said, smiling.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/advantage-lions-relying-on-england-the-right-call-for-tourists-20250509-p5lxwn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Advantage Lions: Relying on England the right call for tourists",
    "publish_date": "Fri, 09 May 2025 11:41:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "There is only one positional unit in the British and Irish Lions squad announced overnight on Thursday in which an Englishman is not present, and even that might be a moot point with Northampton winger Tommy Freeman capable of playing in the No.13 jersey if Huw Jones (Scotland) or Garry Ringrose (Ireland) are injured.\n\nNot even the Irish can claim that spread of players throughout the squad, with No.10s Sam Prendergast and Jack Crowley notably omitted in favour of England’s Fin Smith and Marcus Smith.\n\nThe squad shows that Lions coach Andy Farrell has been smart and flexible enough to see a late shift in the power dynamics between the Lions nations, with brilliant 20-year-old flanker Henry Pollock also rewarded for a brilliant performance in Northampton’s win against Leinster in Dublin last weekend.\n\nNone of this is good news for the Wallabies. The earlier prospect of an underwhelming Lions squad was based on the premise that Ireland had plateaued, and while that is arguably still true it did not factor in an England rise.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/buddha-in-the-box-why-ivan-cleary-is-the-zen-master-20250506-p5lwws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Buddha in the box: Why Ivan Cleary is the Zen master",
    "publish_date": "Fri, 09 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Roy Masters"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size When does a dynasty die? There is no knowing when the end begins. Ivan Cleary, coach of the Panthers – who have won the past four NRL premierships but are now on a lowly ladder position, says, “I’m not even sure of the exact definition of a dynasty. Have we had one, or are we still in one at Penrith? There is no such thing as a machine in perpetual motion. At some point, you’ve got to stop for fuel.” He agrees the continual loss of players in the salary cap era, including three top-class ones at the end of the 2024 season – James Fisher-Harris, their physically dominant forward leader; Jarome Luai, the attacking foil for his own son, Nathan, and Sunia Turuva, a first-half tryscorer in last year’s grand final - helps drain the tank. As will the coming loss of co-captain Isaah Yeo, Liam Martin, Cleary and possibly fullback Dylan Edwards to the NSW team, making it difficult to win enough games to make this year’s top eight. Nor did results up to Magic Round suggest their replacements, despite being the product of the NRL’s best assembly line, would help the Panthers peat, let alone five-peat. “All that adds to it possibly ending,” says Cleary, on the eve of his team’s comprehensive 32-8 win over the Broncos in Brisbane. The victory is a timely warning that it is foolish to proclaim the death of a dynasty. Ivan and Nathan Cleary after winning their fourth premiership. Credit: Getty Images There is no voice of doom from the top of the Blue Mountains saying the club is slipping down to the lowlands where the also-rans live. Melbourne is described as a dynasty, yet the club has never won consecutive premierships. If Cleary has doubts about the end of a dynasty, he has certainty about its beginning . When the Panthers were beaten 26-20 by Melbourne in the 2020 grand final, he told reporters, “I’d love to have the game tomorrow, that’s for sure.”\n\nAdvertisement\n\nAsked about it now, he says, “I genuinely meant it. I felt like we ran out of time. I felt like I’d like to have the first half again and it would have been enough. Although the play-offs had been tight, everything in the grand final went faster. The Storm’s line speed was fantastic. We made a few mistakes. Nathan threw an intercept and couldn’t get it out of his head. But I also thought at the time that this is part of the journey. And it was.” If there are any doubts this was the game that motivated Penrith, the Panthers players made it obvious in their redemptive victory over Melbourne last year. It has never been previously reported but some of the Storm’s younger players were shocked at the vitriol Penrith spewed at them as they stood behind the posts after a try. Luai had not forgotten the “get back to Mount Druitt” slur from the Storm’s Jahrome Hughes. The Fibro versus Silvertail ethos of under-privilege persists in Sydney’s western suburbs and Cleary, who has lived in Penrith for 14 years and still owns a house in the northern beaches, makes no apology for any sledging. “It was still remembered,” he said. “We learnt a lot from the 2020 grand final, including a lot of stuff that happened off the ball.” Cleary had coached more than 370 games by the time he won his first premiership. He had previously coached the Warriors, Panthers and Wests Tigers before returning to Penrith. Ivan Cleary in his first year of coaching the Warriors in 2006. Credit: David White It sounds ludicrous to suggest a man with all that experience, including taking the Warriors to the 2011 grand final, would grow as a coach along with his young team but he agrees. “Definitely,” he says. “My career had all been about rebuild. By the time I got back to Penrith, it was the first time I actually thought I had a team that could win a grand final. I could see green shoots and blue sky.” He admits he feared for his reputation. “I wondered whether I would be the guy who was only known for dragging teams up out of the gutter and not reaching the top. I have definitely grown as coach along the way with these players.”\n\nAdvertisement\n\nPenrith have led a tactical revolution in the NRL, using their back five to create field position and hence balance the energy output of backs and forwards. “Part of that decision was personnel,” says Cleary with reference to the power of the now injured winger Brian To’o and fullback Edwards returning the ball to near halfway. “The beauty of the back five is that they can get the forwards thinking about defence. All our stats in the game are about attack but I’ve always believed defence wins games and attack decides by how much.” Some observers believe the Panthers led in exploiting the six-again rule by deliberately conceding breaches early in the tackle count to trap a team in its own 40-metre zone. “We definitely didn’t do it deliberately,” Cleary says. “We place a lot of emphasis on controlling the ruck and line speed but the breaches weren’t deliberate.” He does admit to introducing the ruse of blockers preventing opposition players from hurrying the kicker. The Storm’s Christian Welch was particularly effective harassing Nathan in the 2020 grand final and Penrith’s sophisticated blocking system was the response. ‘I wondered whether I would be the guy who was only known for dragging teams up out of the gutter and not reaching the top’ Ivan Cleary “I’ll take that as a compliment,” Cleary says, before conceding the NRL subsequently did the job for him by penalising any player who makes contact with a kicker. “Halves now have a level of protection on kicks.” He also pleads guilty to the recent scrum ploy of the half placing the ball on the ground and retreating to first receiver in the backline, while a scrum player picks it up and feeds the ball. Insofar as it adds a man to the backline, it creates an overlap. “The Roosters did it to us and scored a try,” Cleary admits. He wasn’t resentful he had been punished by his own invention. “I thought at the time, ‘That is pretty cool, too.’” He explains the ploy came in response to the NRL ban on teams holding the ball at the base of the scrum. “A lot of scrum tries came from that but the NRL stopped it and now they have done it again by making us re-start the scrum feed.”\n\nAdvertisement\n\nHowever, he concedes the NRL’s relentless mission to increase ball in play time by reducing stoppages has benefitted Penrith and Melbourne. “The continuity has helped us,” he agrees. “The six-again rule has been good for us but most of the calls you don’t know what they are for.” He echoes the complaint of all coaches that referees can use repeat sets to even up a game. He welcomes a review of the salary cap, saying, “Penrith doesn’t get any rewards for players developed in our pathways going to other clubs as NRL players. We are doing a good job for the NRL producing players.” Luai left after four premierships, including leading the team last year in place of an injured Nathan who also missed NSW’s Origin winning series in which Luai played a stellar role. Asked if the Panthers under-valued the five-eighth, Cleary said, “I definitely did not under-estimate him. We fought tooth and nail to keep him. We couldn’t get near the money he was offered plus he wanted to forge his own path. I’m proud of what he is doing at Wests Tigers but I wish he was here.” Like his colleagues, he rails against the NRL draw which resembles something dreamed up by muppets Ernie and Bert. Penrith’s Origin players are required to play a 3pm match on a Saturday in Auckland after the Wednesday evening Origin encounter in Perth. “They [Penrith’s Origin representatives] won’t be playing in Auckland,” Cleary said.“It’s ridiculous. I don’t have a choice.” Nathan and Ivan Cleary after Penrith lost the 2020 grand final. Credit: Getty So, let’s go back to that 2020 grand final - the beginning of the Penrith dynasty. Would Cleary have liked a time-out, as they have in US sports, where a coach can stop the game and settle the players. “If we were able to have them, that’s the sort of game where it would have helped,” he said. “But in the NRL we have time-outs for things we don’t want time-outs for.” As he sits in the coach’s box at games, awaiting the Bunker’s decision, he looks composed while his rivals stress and fume. “Underneath the surface, I ride all the highs and lows, just like the other coaches,” he reveals.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/ange-dropped-the-coldest-quote-in-soccer-history-in-90-minutes-he-can-deliver-on-it-20250509-p5lxu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ange dropped the coldest quote in soccer history. In 90 minutes he can deliver on it",
    "publish_date": "Fri, 09 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Having won their semi-final tie 5-1 on aggregate over Bodo/Glimt, Spurs are into the Europa League final against Manchester United. So Postecoglou is 90 minutes away - maybe 120 - from having dropped one of the coldest quotes in modern football history. The psychological burden of Tottenham’s 15-year trophy drought, which has weighed so heavily on this club, could be finally discarded. Ange Postecoglou in Bodo. Credit: nna\\seathompson By a man who, if certain reports are to be believed, will be discarded by the club regardless. Indeed, the question of his future remains - but it shouldn’t. It is a ludicrous notion that a decision about whether Postecoglou is the right man to lead Spurs into the future, or at least the third year of his four-year contract, should hinge on a single fixture. It’s even sillier if it’s already been made.\n\nThere’s certainly no glossing over how poor their Premier League season has been, and how inexplicably bad some of their performances have been in it. But there’s enough evidence, if you want to see it, in how they’ve performed in the Europa League, and how Postecoglou has set them up tactically, and how the players are responding to him, to suggest that there’s still something in this project that is worth pursuing. The unity in the Tottenham camp - as captured by the club’s channels, who posted his stirring post-match address to the players on social media - speaks for itself. Any other manager in these circumstances, and with those results, would have lost not only the dressing room but their own head long ago. Yves Bissouma leads the post-match celebrations. Credit: Getty Images Not Postecoglou. There’s been some evidence of fraying, but fundamentally, he’s kept it together. The biggest challenge for him at Spurs was never about wins and losses. It was about changing the mentality of this football club, about getting rid of the ‘Spursy’ tag. And he’s doing it, bit by bit, challenging not only the external conversation about Tottenham but also their own internal self-defeating perceptions.\n\nLike the trips to Eintracht Frankfurt and AZ Alkmaar earlier in the tournament, many fans were petrified about the prospect of playing north of the Arctic Circle on a plastic pitch against a team in Bodo/Glimt with a giant-slaying record. In the end, there was nothing to be worried about. The players couldn’t have been more focused. Postecoglou, too, has probably learned some things along the way. There’s no doubt that Spurs are playing more pragmatic football in the Europa League than those who follow his teams would expect to see. His sides hardly ever launch it long from goal kicks; Tottenham did almost exclusively that in Bodo. Circumstances dictated it, as he explained afterwards, but there have been plenty of other times in his career where circumstances also dictated it, and he didn’t go down this path. Why now, and not then? One for him to answer. Either way, those who knocked him earlier in the season for having no “Plan B” and never changing his tactics are quiet now. Pre-match, Postecoglou essentially laughed off the suggestion from Arsène Wenger - the ex-Arsenal manager, so not a disinterested party - that the Europa League winners didn’t deserve to qualify for the UEFA Champions League the following season because the then-likely finalists Spurs and Man United were doing so poorly in the Premier League. They sit 16th and 15th respectively on the table.\n\nLoading Post-match, Postecoglou again took aim at the notion that people were “fearing” the prospect of Spurs actually winning something for once, and thus were working ahead of time to diminish their achievement before it happens. “I could have been sitting here at exactly the same time in fifth position, and I can guarantee that the commentary around me would be: ‘Well, that’s great Ange, but this club needs to win something.’ That’s exactly what everyone would be saying,” he said, calling the hypocrites out directly. “So of course it’s massive. You have to frame it against what this club has been through over the last 15 or 20 years and what the supporters have been through.” What they’ve all been through this year, painful as it’s been, might yet prove to be worth it.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/politics/jacinta-price-yelled-at-in-hotel-by-aboriginal-activist-20250509-p5lxx1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jacinta Price yelled at in hotel by Aboriginal activist",
    "publish_date": "Fri, 09 May 2025 11:34:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "Jacinta Price yelled at in hotel by Aboriginal activist\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/tap-and-no-the-card-surcharges-that-look-set-for-the-chop-20250506-p5lwwo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tap and no? The card surcharges that look set for the chop",
    "publish_date": "Fri, 09 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Madeleine Heffernan"
    ],
    "text": "The central bank will release its report on surcharging shortly, and the government will then decide whether to ban debit surcharges, while seeking to not disproportionately hurt small businesses. “We’re cracking down on unfair and excessive card surcharges to get a better deal for Australians and small businesses,” a spokesman for Treasurer Jim Chalmers said. “We’re prepared to ban debit card surcharges subject to the further work under way now by the Reserve Bank if there are sufficient safeguards to ensure both small businesses and consumers can benefit from lower costs.” The Reserve says small businesses can be charged a whopping three times more in transaction fees than larger merchants.\n\nThe hospitality industry warns that menu prices will have to rise if businesses can no longer recover the cost of debit card payments from customers, saying a coffee that now costs $5.08 with a card surcharge might rise to $5.50. “Of course it will be inflationary,” said Wes Lambert, chief executive of the Australian Restaurant and Cafe Association. “Removing a debit surcharge will translate directly to the bottom line. And to mitigate this drop in profit, we’ll see a sharp increase in prices much greater than 8¢ that we currently pay on a cup of coffee. We’ll be rounding that [price rise] to 10¢, 20¢ or even 50¢.” The Australian Restaurant and Cafe Association, the Australian Hotels Association and the Australian Lottery & Newsagents Association are lobbying the Reserve Bank against a ban. Card surcharging is more common in cafes, restaurants and pubs than in other sectors, the Reserve said. But Ebstein said the removal of surcharges would have a negligible effect on consumer prices and that any ensuing price rises by businesses would be opportunistic. He said the cost to merchants of accepting cards had reduced significantly since the Reserve first allowed surcharging in 2013.\n\nEbstein, of MWE Consulting, said businesses should regard card payment costs as another cost of being in business. “You don’t charge someone an extra bit because you’ve just done an advertising campaign, or you’ve just paid your electricity bill,” he said. “Card costs actually reduce your overall costs because 30 years ago you were maintaining accounts for customers, there was a cost; most of your payments were in cash, there was a cost.” Palace Cinema chief executive Benjamin Zeccola. Credit: Jason South Palace Cinemas chief executive Benjamin Zeccola said banning card surcharges would do “serious damage to the sectors driving economic activity and employment”. Surcharging helped businesses recover their costs transparently, Zeccola said.\n\n“If government reform eliminates that transparent mechanism without care, it’s not cutting ‘junk fees’ – it is foisting them invisibly onto small businesses, pushing prices up, or worse, tipping fragile businesses over the edge,” he said. “That’s inflationary, not protective.” Family-run book retailer the Book Depot goes against the norm by not charging the surcharge at the point of sale. “All of us find it annoying as consumers and so have avoided inflicting it on our customers,” co-owner Tony Sidebottom said. “We also try and offer the cheapest books in the marketplace and this message doesn’t sit comfortably alongside the surcharge.” Sidebottom said the Book Depot regarded the surcharge as just another cost, like electricity. Tony Sidebottom of the Book Depot, which does not apply a surcharge at the point of sale. Credit: Paul Jeffers\n\n“The consumer pays for it anyway, really. With our business, our margins reduce very slightly but when we’re considering pricing decisions, it’s something we take into account.” The Australian Competition and Consumer Commission said misleading surcharging practices were a compliance and enforcement priority. It regularly received tip-offs about alleged excessive surcharging, particularly by small and micro-businesses, it said. But big companies are not immune to excessive card surcharging. The competition watchdog said Europcar, Fitness First and Nine Entertainment, owner of The Age, had been financially penalised for charging surcharges that were greater than their costs. The Australian Banking Association said consumers “should always know the cost of an item before they pay for it”. The association said while it wanted to see less surcharging, prohibiting it “would represent an abrupt shift to a practice”.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/world/north-america/starmer-s-nothing-deal-with-trump-is-a-warning-sign-for-albanese-20250509-p5lxsw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starmer’s ‘nothing’ deal with Trump is a warning sign for Albanese",
    "publish_date": "Fri, 09 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "The first question to Donald Trump after announcing his “historic” trade deal with the United Kingdom came from a British reporter who, in a classic case of English versus American sensibilities, asked the president: Aren’t you overselling this?\n\nOf course, he was. But Trump oversells everything. In that sense, he is the quintessential American, in direct contrast to the British tradition of understatement.\n\nDonald Trump listens to Britain’s US ambassador Peter Mandelson in the Oval Office. Credit: AP\n\nIn this case, though, Britain’s Keir Starmer is just as guilty – if not more so. Not only is he portraying this as a massive win for British workers, but he described it as a historic moment between the two countries, up there with VE Day, which occurred on the same day 80 years ago.\n\nWell, an armistice it ain’t. This is a list of concessions more than a trade deal, and one in which the UK is still subject to billions worth of tariffs that didn’t exist last year.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-for-flat-open-us-stocks-gain-as-trump-says-buy-before-china-talks-20250509-p5lxt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX rises in early trade after Wall Street gains; Macquarie, Nine shares jump",
    "publish_date": "Fri, 09 May 2025 11:18:51 +1000",
    "category": "finance",
    "authors": [
      "Rita Nazareth"
    ],
    "text": "The Australian sharemarket traded higher on Friday morning, buoyed by solid company results and optimism for easing global trade tensions after Donald Trump announced a trade deal with the UK, made encouraging comments on talks with China and said investors should buy shares now.\n\nThe S&P/ASX 200 rose 27 points, or 0.3 per cent, to 8213.70 as of 11.18am AEST, with six of its 11 industry sectors advancing as gains from energy, banks and IT stocks were muted by losses from the materials sector. The modest uplift comes after the local bourse added 0.2 per cent on Thursday. The Australian dollar fell below US64¢ and was trading at US63.93¢.\n\nThe announcement of Trump’s first trade deal stoked optimism on Wall Street. Credit: Bloomberg\n\nShares of Macquarie Group and News Corp gained after both reported better-than-expected results. Nine Entertainment, the publisher of this masthead, rallied after US real estate listings giant CoStar confirmed a $3 billion deal to buy its majority-owned property listings business Domain, raising the prospect of a special payout to shareholders.\n\nMacquarie Group climbed 4.3 per cent after reporting a 5 per cent lift in full-year profits to $3.72 billion, helped by a strong performance in its flagship asset management business. Analysts had predicted a $3.69 billion profit. Three of the big four banks also advanced, with CBA up 0.3 per cent, National Australia Bank up 0.7 per cent and Westpac up 1.1 per cent. ANZ was down 1 per cent.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/this-charcoal-chicken-shop-serves-a-close-chick-fil-a-dupe-20250509-p5lxwp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This charcoal chicken shop serves a close Chick-fil-A dupe",
    "publish_date": "Fri, 09 May 2025 11:15:44 +1000",
    "category": "finance",
    "authors": [
      "Quincy Malesovas"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nFind American-style fried chicken and Aussie-style roast chook at Chook in Cremorne.\n\n1 / 5 The “proper sandwich” with chicken, Acide pickles and buttermilk ranch. Supplied 2 / 5 Chicken tenders from Chook. Supplied 3 / 5 The “Julius wrap” with crispy chicken, caesar dressing and prosciutto. Supplied 4 / 5 Crispy chicken is a specialty at Chook. Supplied 5 / 5 Salad bowls are also available. Supplied Previous Slide Next Slide\n\nAmerican$$$$\n\nFourteen years ago, Fonda shook up Melbourne’s fast-casual Mexican dining. Now, its co-founder Tim McDonald is ready “to modernise the charcoal chicken offering and give people what they want in 2025” with his new venture, Chook. That translates to a choice of fried or roasted chicken served in wraps, bowls and sandwiches (the American term for chicken burgers).\n\nThe fried chicken – pressure-fried so it stays juicy and absorbs less oil – borrows a technique from popular US fast-food chain Chick-fil-A. Roast chook nods to classic Aussie styles. Available whole, halved or quartered, it’s salt-brined and finished in a combi oven, which allows the bird to steam while it cooks, avoiding dryness.\n\nHot tip: For a close Chick-fil-A dupe, order the Proper Chicken Sandwich with fried chicken, buttermilk ranch and pickles, plus a side of waffle fries.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/joey-says-titans-coach-not-the-problem-20250509-p5lxws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Joey says Titans coach not the problem",
    "publish_date": "Fri, 09 May 2025 11:08:49 +1000",
    "category": "sports",
    "authors": [],
    "text": "Joey says Titans coach not the problem\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-super-tax-that-slipped-under-the-radar-during-the-election-campaign/2j94iwv5q",
    "title": "The super tax that slipped under the radar during the election campaign",
    "publish_date": "Thu, 8 May 2025 23:33:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "The re-election of the Albanese government has led to renewed concern about planned changes to the taxation of investment returns in superannuation funds .\n\n\n\n\n\nLabor’s emphatic victory on Saturday night, including what looks like an increased presence in the Senate, suggests the legislation is likely to become law in the near future.\n\n\n\nRetirement income in Australia\n\nAustralia's retirement income system comprises two pillars: a government-funded age pension as well as private superannuation.\n\n\n\n\n\nSuper includes compulsory employer-funded contributions as well as additional personal contributions.\n\n\n\n\n\nThese two pillars are complementary; a person can receive a pension even if they have private super. But the more super they have, the less pension they are eligible for.\n\n\n\nAbout 70 per cent of superannuation assets are held in Australian Prudential Regulation Authority (APRA)-regulated funds, and 25 per cent are held in self-managed super funds (SMSFs).\n\n\n\n\n\nThere are two types of tax — and tax concessions — on super. First, employer contributions and capped personal contributions are taxed at a concessional rate of 15 per cent. Second, income earned by a super fund is taxed at 15 per cent for balances in the accumulation phase (when contributions are being made). Income earned in the pension phase is tax-free.\n\n\n\nSo what does the proposed reform entail?\n\nStarting 1 July, the government proposes to increase the concessional tax rate on super account earnings in the accumulation phase from 15 per cent to 30 per cent for balances above $3 million.\n\n\n\n\n\nThose affected — about 80,000 super account holders, or 0.5 per cent of the total — will continue to benefit from the existing 15 per cent concessional tax rate on earnings on the first $3 million of their super balance.\n\n\n\n\n\nThey will also be able to carry forward any loss as an offset against their tax liability in future years.\n\n\n\nConcerns with the proposed reform\n\nConcerns have been raised this reform implies the taxation of unrealised capital gains on assets held in super accounts, such as shares or property, even if they have not been sold.\n\n\n\n\n\nThis is, indeed, a significant departure from the status quo. Both APRA-regulated funds and SMSFs are currently only required to pay capital gains tax once the asset is sold and the gain is crystallised.\n\n\n\n\n\nThe move to tax unrealised capital gains is likely to prove particularly onerous for SMSFs. The typical industry super fund has a diversified portfolio of assets of varying liquidity, including significant cash holdings. But SMSF portfolios are often dominated by a large and illiquid asset (one that cannot be easily sold and converted into cash) such as a farm or business property.\n\n\n\nAs a result, an SMSF facing a large unrealised capital gain, say from an increase in property values, may not have sufficient cash flow to pay the associated tax bill. The SMSF trustee might be forced to prematurely sell assets to meet the fund's tax liability.\n\n\n\n\n\nIn the United States, former president Joe Biden's 2025 budget included a similar proposal to tax unrealised capital gains for households with more than US$100 million ($155.9 million) in wealth.\n\n\n\nPurpose of the proposed reform\n\nIn announcing this initiative, Treasurer Jim Chalmers suggested the motivation was two-fold.\n\n\n\n\n\nFirst, the federal government is facing pressure on the budget bottom line and generous tax concessions for super are becoming expensive.\n\n\n\n\n\nSecond, current super tax concessions are highly regressive. This means most benefits of the concessions flow to the wealthiest households which, in any case, will not be eligible for the pension.\n\n\n\n\n\nThe cost of current super concessions to the federal budget is about $50 billion in foregone revenue, according to the Treasury. That is almost the cost of the age pension.\n\n\n\n\n\nThe Grattan Institute argues superannuation has become a \"taxpayer-funded inheritance scheme\". A Treasury review found most Australians die with large outstanding super balances.\n\n\n\n\n\nThe Association of Superannuation Funds of Australia Retirement Standard calculates that, for a comfortable retirement, a couple needs a super balance of about $700,000 if they retire at age 67. The $3 million threshold is out of the ballpark. However, if the threshold is not indexed, more people will be affected over time.\n\n\n\nSo, is this reform useful?\n\nAccording to the government's Retirement Income Review, the objective of Australia's super system should be to \"deliver adequate standards of living in retirement in an equitable, sustainable and cohesive way\".\n\n\n\n\n\nWhile the proposed tax change aims to improve the equity and sustainability of Australia's super system, it is not clear how it will work in practice.\n\n\n\n\n\nIn response to SMSF concerns about the difficulty in paying tax bills, the government's proposal gives taxpayers 84 days to pay the tax liability instead of the usual 21 days. This hardly mitigates the risk that SMSF trustees may have to liquidate the main asset in their fund.\n\n\n\nThe Biden proposal had presented an alternative model, allowing for the tax liability to be paid over several years, not all at once. Alternatively, taxpayers could pay an interest-like charge while deferring their unrealised capital gains tax liability.\n\n\n\n\n\nSuch alternatives do not appear to have been seriously considered in the Australian government's proposal.\n\n\n\n\n\nUltimately, though, the question must be asked: is taxing volatile unrealised capital gains really the most effective way to improve equity in, and the sustainability of, the superannuation system?\n\n\n\n\n\nMark Melatos is an associate professor of economics at the University of Sydney.\n\n\n\n\n\nHe does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-washup-party-time-ep-6/4piz4wdqo",
    "title": "The Washup: Party Time Ep 6",
    "publish_date": "Thu, 8 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/who-is-pope-leo-xiv-the-first-us-cardinal-to-lead-the-catholic-church/1k2aqy8w3",
    "title": "Who is Pope Leo XIV, the first US cardinal to lead the Catholic Church?",
    "publish_date": "Thu, 8 May 2025 20:38:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Robert Prevost, a former missionary in Peru, has been elected pope, becoming the first from the US.\n\nHe was chosen by the College of Cardinals despite being relatively unknown globally.\n\nHis election signals continuity with Pope Francis, especially on social justice issues and Church outreach.\n\nRobert Prevost, the choice of the world's Catholic cardinals to serve as leader of the 1.4-billion-member Church, is the first pope from the United States and has little recognition on the global stage.\n\n\n\n\n\nAged 69 and originally from Chicago, Prevost has spent most of his career as a missionary in Peru and became a cardinal only in 2023. He has given few media interviews.\n\n\n\n\n\nHe takes the papal name Leo XIV, and succeeds Pope Francis , who had led the Church since 2013.\n\n\n\n\n\nReverend Mark Francis, a friend of Prevost since the 1970s, told Reuters the cardinal was a firm supporter of his predecessor's papacy, and especially of the late pontiff's commitment to social justice issues.\n\n\n\n\n\n\"He was always friendly and warm and remained a voice of common sense and practical concerns for the Church's outreach to the poor,\" said Francis, who attended seminary with Prevost and later knew him when they both lived in Rome in the 2000s.\n\n\n\n\n\n\"He has a wry sense of humour, but was not someone who sought the limelight,\" said Francis, who leads the US province of the Viatorian religious order.\n\n\n\nPrevost first served as a bishop in Chiclayo, in north-western Peru, from 2015 to 2023, and became a Peruvian citizen in 2015, so he has dual nationality.\n\n\n\n\n\nPope Francis brought him to Rome that year to head the Vatican office in charge of choosing which priests should serve as Catholic bishops across the globe, meaning he has had a hand in selecting many of the world's bishops.\n\n\n\n\n\nJesus Leon Angeles, coordinator of a Catholic group in Chiclayo who has known Prevost since 2018, called him a \"very simple\" person who would go out of his way to help others.\n\n\n\n\n\nLeon Angeles said Prevost had shown special concern for Venezuelan migrants in Peru, saying: \"He is a person who likes to help.\"\n\n\n\n\n\nMore than 1.5 million Venezuelans have moved to Peru in recent years, partly to escape their country's economic crisis.\n\n\n\nIn a 2023 interview with the Vatican's news outlet, Prevost focused on the importance of evangelisation to help the Church grow.\n\n\n\n\n\n\"We are often preoccupied with teaching doctrine ... but we risk forgetting that our first task is to teach what it means to know Jesus Christ,\" he said.\n\n\n\n\n\nPrevost said during a 2023 Vatican press conference: \"Our work is to enlarge the tent and to let everyone know they are welcome inside the Church.\"\n\n\n\nThe crowd of faithful gathered for the new pontiff, Pope Leo XIV, to celebrate his appointment at the Vatican. Source: AAP / Marco Iacobucci\n\n'He knows how to listen'\n\nPrevost was born in 1955 and is a member of the global Augustinian religious order, which includes about 2,500 priests and brothers, operates in 50 countries and has a special focus on a life of community and equality among its members.\n\n\n\n\n\nHe has a bachelor's degree from Villanova University in Philadelphia, a master's from the Catholic Theological Union in Chicago, and a doctorate in Church law from the Pontifical College of St Thomas Aquinas in Rome.\n\n\n\n\n\nPrevost first went to Peru as a missionary in 1985, returning to the US in 1999 to take up a leadership role in his religious order.\n\n\n\nPrevost later moved to Rome to serve two six-year terms as head of the Augustinians, visiting many of the order's communities across the world. He is known to speak English, Spanish, Italian, French and Portuguese.\n\n\n\n\n\nReturning to Rome in 2023, he generally did not take part in many of the social events that attract Vatican officials throughout the city.\n\n\n\n\n\nLeon Angeles said he is a person with leadership skills: \"But at the same time, he knows how to listen. He has that virtue.\"\n\n\n\n\n\n\"The cardinal has the courtesy to ask for an opinion, even if it's from the simplest or most humble person.\n\n\n\n\n\n\"He knows how to listen to everyone.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/signs-coalition-nuclear-policy-not-buried-despite-election-loss/ideom2e8z",
    "title": "Is nuclear dead? Signs Coalition's policy isn't buried despite election loss",
    "publish_date": "Thu, 8 May 2025 19:50:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Some Coalition politicians have signalled their continued support for nuclear energy despite it being what an expert described as \"electoral suicide\".\n\n\n\n\n\nLiberal MP Tim Wilson said Australia will have to \"de-industrialise\" without nuclear power as he backed the energy source during his victory speech this week .\n\n\n\n\n\nThe Liberals and Nationals will be conducting reviews of their policy platform as they take stock of a sweeping election defeat, which resulted in Labor claiming majority government.\n\n\n\n\n\nThe Coalition has lost a number of its moderate MPs as metropolitan areas turned away from the Liberals.\n\n\n\n\n\nWilson has bucked that trend, re-claiming the seat of Goldstein in Melbourne from independent MP Zoe Daniel, and throwing his support behind a future in which nuclear energy plays a role.\n\n\n\n\n\n\"I, in my core sense of belief, believe in the role of nuclear power,\" he said.\n\n\n\n'Many' in the Coalition are pro-nuclear\n\nNationals MP Michael McCormack said many members of the Nationals and Liberals remain \"very pro-nuclear\".\n\n\n\n\n\nWhen asked if nuclear power could cause a split between the Liberals and Nationals, he told Radio National on Thursday morning: \"We'll have to wait and see.\"\n\n\n\n\n\nAsked to clarify his response, McCormack said: \"There are many people within the Liberal Party who are very pro-nuclear, just like the National Party, and obviously there will be people who will now want to review all the policies.\"\n\n\n\n\n\n\"Everything will be on the table, there will be reviews by both parties,\" he said.\n\n\n\nMcCormack said it's a \"matter for the parties\" whether a nuclear energy policy will be taken to the next election in three years' time.\n\n\n\n\n\n\"People do believe that if we're going to get to net zero, that it [nuclear] has to be part of the energy mix, there are a lot of Liberals on board with that too,\" he said.\n\n\n\n\n\nHowever, Liberal senator Maria Kovacic said she wanted the policy to be dumped.\n\n\n\n\n\n\"The Liberal Party must immediately scrap the nuclear energy plan and back the private market's investment in renewable energy,\" she said on Tuesday.\n\n\n\nLISTEN TO How feasible is nuclear power in Australia and what would it cost? CSIRO and experts take a look SBS News 22/05/2024 07:48 Play\n\nWhat was the Coalition's nuclear policy?\n\nIn mid-2024, then-Opposition leader Peter Dutton announced that if elected, he would create seven nuclear power plants across NSW, Victoria, Queensland, South Australia, and Western Australia, pledging it would lead to cheaper energy.\n\n\n\n\n\nThe Coalition estimated the project would cost $331 billion and had planned to build the plants in the following electorates:\n\n\n\nLiddell in NSW, electorate of Hunter\n\nMount Piper in NSW, electorate of Calare\n\nTarong in Queensland, electorate of Maranoa\n\nCallide in Queensland, electorate of Flynn\n\nPort Augusta in SA, electorate of Grey\n\nLoy Yang in Victoria, electorate of Gippsland\n\nMuja in WA, electorate of O'Connor\n\nThe party's plan to build the reactors faced opposition from members of the public as well as state premiers who were against nuclear facilities in their home states.\n\n\n\n\n\nDutton didn't visit any of the proposed sites during the five-week election campaign.\n\n\n\n'Electoral suicide'\n\nThere were swings against the Coalition in nearly every seat where it proposed a nuclear plant, except for Flynn in Queensland, according to Australian Electoral Commission data.\n\n\n\n\n\nMeanwhile, Labor recorded positive swings in every seat where offshore wind projects have been announced.\n\n\n\n\n\nAdam Simpson, a senior lecturer in international studies at the University of South Australia, described pro-nuclear policies as unpopular \"electoral suicide\".\n\n\n\nREAD MORE The many ways Australia will change under Anthony Albanese's second term\n\nBut the Coalition didn't have much of a choice when it came to election promises around energy, Simpson told SBS News.\n\n\n\n\n\n\"The Coalition had to come to the election saying something about energy policy if they were going to oppose Labor's policy, and there's not really that many options,\" he said.\n\n\n\n\n\n\"They could have come out and said, 'We're going to use gas and or coal for eternity', but then they would have to abandon their commitment to net zero.\"\n\n\n\nFewer moderates in the party\n\nSimpson said there are a couple of reasons the Coalition could come back with a version of the policy for the next election.\n\n\n\n\n\n\"In 2022, they lost all those teal seats. They lost a lot of moderate voices from the Liberal Party. And then that's just been exacerbated in this recent election,\" Simpson said.\n\n\n\n\n\n\"There are very few voices going to be coming from metropolitan urban areas in the Coalition party room. So that's why I wouldn't be surprised if, after they do the post-election wash-up and assessment of what went wrong, they come out again with another pro-nuclear policy.\"\n\n\n\nSimpson said \"cultural opposition\" is likely another factor, with the Coalition ideologically resistant to a transition to renewable energy.\n\n\n\n\n\n\"They don't particularly believe in climate change, and it's certainly not a priority for them,\" he said.\n\n\n\n\n\nWhile nuclear energy could be a policy the Coalition runs again in 2028, Simpson predicted it would cause \"further devastation\" within its remaining metropolitan seats and push the Coalition into the \"electoral wilderness\" for a generation.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/live-blog/cardinal-robert-prevost-a-little-known-missionary-from-chicago-elected-pope-leo-xiv/g4onrp5c9",
    "title": "LIVE: Cardinal Robert Prevost, a little-known missionary from Chicago, elected Pope Leo XIV",
    "publish_date": "Thu, 8 May 2025 19:29:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "More international reactions to Pope Leo XIV's ascendancy\n\n\"The election of Pope Leo XIV is a deeply profound moment of joy for Catholics in the United Kingdom and globally, and begins a new chapter for the leadership of the Church and in the world.\n\n\n\n\"Pope Leo is the first American Pope. This is a momentous moment. As Pope Francis' papacy showed, the Holy See has a special role to play in bringing people and nations together to address the major issues of our time; especially on climate change, alleviating poverty and promoting peace and justice across the world.\"\n\n\n\n— British Prime Minister Keir Starmer\n\n\n\n\n\n\"Born in the United States and naturalised Peruvian in 2015, His Holiness lived and served for years in our country, where he shared the life of the people with humility, love and deep faith. His closeness to the most needy left an indelible mark in our hearts.\n\n\n\n\"The Peruvian people, a nation of faith and hope, unite in prayer for his pontificate and celebrate with gratitude that a pastor who loved Peru is now guiding the universal Church. May God bless him and accompany him in his mission!\"\n\n\n\n— Peruvian President Dina Boluarte\n\n\n\n\n\n\"Italians will look to you as a guide and point of reference, recognising in the Pope and the Church that spiritual and moral authority that derives from its inexhaustible message of love, charity and hope, which flows from the Word of God.\"\n\n\n\n— Italian Prime Minister Giorgia Meloni\n\n\n\n\n\n\"Please accept my heartfelt congratulations on your election as Pope. I am confident that the constructive dialogue and cooperation established between Russia and the Vatican will continue to develop on the basis of the Christian values that unite us.\n\n\n\n\"I wish you, Your Holiness, success in fulfilling the high mission entrusted to you, as well as good health and well-being.\"\n\n\n\n— Russian President Vladimir Putin\n\n\n\n\n\n\"A historic moment for the Catholic Church and its millions of faithful. To Pope Leo XIV , to all Catholics in France and around the world, I send a fraternal message.\n\n\n\n\"On this May 8th, may this new pontificate bring peace and hope.\"\n\n\n\n— French President Emmanuel Macron\n\n\n\n\n\n\"I hope he continues the legacy of Pope Francis , whose main virtues were the incessant search for peace and social justice, the defence of the environment, dialogue with all peoples and all religions, and respect for the diversity of human beings.\n\n\n\n\"We do not need wars, hatred and intolerance. We need more solidarity and more humanism. We need love for our neighbour, which is the basis of Christ's teachings. May Pope Leo XIV bless us and inspire us in our ongoing quest to build a better and more just world.\"\n\n\n\n— Brazilian President Luiz Inácio Lula da Silva",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/sam-kerr-and-kristie-mewis-welcome-baby-boy-jagger/ctklor1fn",
    "title": "Sam Kerr and Kristie Mewis welcome baby boy Jagger",
    "publish_date": "Thu, 8 May 2025 11:29:45 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's most acclaimed female soccer star, Sam Kerr, and her fiancée, Kristie Mewis, a professional soccer player from the United States, have confirmed the birth of their first child.\n\n\n\n\n\n\"Our little man is here, Jagger Mewis-Kerr,\" the pair said in a joint Instagram post on Thursday.\n\n\n\n\n\nKerr and Mewis had previously announced the pregnancy last November on social media with a picture showing off Mewis' baby bump.\n\n\n\nThey received a flood of support from fellow teammates and fans at the time, but some users also used it as an opportunity to level homophobic abuse at the couple.\n\n\n\n\n\nIn response, Chelsea Pride, an LGBTIQ+ supporter group affiliated with the men's English Premier League and Women's Super League (WSL) club for which Kerr plays, condemned the abuse as \"heartbreaking and infuriating\" adding that \"homophobia has no place in football\".\n\n\n\n\n\nKerr welcomes Jagger into the world after an eventful few years, which include a high-profile London trial for a charge of racially aggravated abuse — of which she was acquitted — and an injury which saw her miss much of the Matildas' impressive 2023 World Cup campaign.\n\n\n\n\n\nMewis — who is an acclaimed athlete in her own right and plays for West Ham United as well as the US national team — met Kerr in 2020. They have been a couple since 2021 and became engaged in September 2023.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/video/ultra-fast-fashion-brand-shein-sets-its-sights-on-australia/bcvb4oghn",
    "title": "Ultra-fast fashion brand SHEIN sets its sights on Australia",
    "publish_date": "Thu, 8 May 2025 09:58:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ultra-fast fashion brand SHEIN sets its sights on Australia\n\nPublished 8 May 2025, 8:32 am\n\nGlobal fashion giant SHEIN is being made to rethink its corporate strategy. Primarily selling extremely cheap Chinese goods, it's facing tariffs of up to 120% on imports to the US, forcing it to shift focus to other lucrative markets, like Australia. The move is prompting concerns over the impacts of ultra-fast fashion.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/trumps-trade-deal-post-pulls-asx-out-of-the-red/h0osgc0ik",
    "title": "Trump's trade deal post pulls ASX out of the red",
    "publish_date": "Thu, 8 May 2025 08:11:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-conflict-in-kashmir/zotc8odc3",
    "title": "INTERVIEW: The conflict in Kashmir",
    "publish_date": "Thu, 8 May 2025 06:44:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/its-not-all-in-your-head-the-complex-psychology-of-pain-management/23vjct7uc",
    "title": "It's not all in your head: the complex psychology of pain management",
    "publish_date": "Thu, 8 May 2025 05:49:23 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Australian College of Anaesthetists says there are a number of commonly recognised types of pain.\n\n\n\n\n\nThey include acute pain, cancer pain and chronic non-cancer pain - Including over 200 chronic pain conditions back pain, endometriosis and fibromyalgia among many others.\n\n\n\n\n\nWhatever type of pain a person is experiencing the effects on all aspects of an individual's life can be profound.\n\n\n\n\n\nProfessor Lorimer Moseley is a professor of Clinical Neurosciences at the University of South Australia and the Chair of PainAdelaide.\n\n\n\n\n\nHe says this is a vulnerable population group.\n\n\n\n\n\n\"Chronic pain is extraordinarily complex and everyone's chronic pain is theirs. It's not a universal condition that contributes to it. And the things that hinder are different and they're quite individually specific. This is a large group of people who are challenged by chronic pain and they're a group of people that for decades have been on the edges, have been not believed and probably even worse than that have been called malingerers or been told you've just got to snap out of it or it's all on your head.\"\n\n\n\n\n\nOne in five people in Australia and New Zealand will experience chronic pain at some stage in their lives and it's recognised as a major global health issue.\n\n\n\n\n\nUnrelieved pain can affect every area of a person's life with major social, financial and emotional consequences.\n\n\n\n\n\nAlong with medication and surgery other treatment techniques include education and psychological treatments such as behaviour and cognitive therapy.\n\n\n\n\n\nResearchers at the University of New South Wales and Neuroscience Research Australia [[NeuRA]] have done a randomised trial focusing on the experiences of people with chronic pain and the role emotional processing plays in managing chronic pain conditions.\n\n\n\n\n\nDr Nell Norman Knott is a research fellow and clinical trial manager at the University of New South Wales and Neuroscience Research Australia.\n\n\n\n\n\n\"It's incredibly emotional. And we see this because people who we see and in the literature we know, they present with heightened levels of worry, they present with low mood. And from an emotional and mental health standpoint, we see increasing levels of anxiety and depression in up to about 80 per cent of people with chronic pain. But the aspect of we are particularly interested in is this concept of emotion dysregulation, which really means difficulties being able to bring up positive emotions and dampen down negative emotions. And increasingly we see in the literature that people with chronic pain have emotion dysregulation as a feature of their condition.\"\n\n\n\n\n\nThe study's authors says it doesn't matter which type of pain a person has - because the emotional effects are very similar.\n\n\n\n\n\nThe study included all types of chronic pain from migraine to chronic low back pain, fibromyalgia, neuropathic pain, musculoskeletal pain, inflammatory pain.\n\n\n\n\n\nProfessor Moseley says its logical that chronic pain would have a major impact on a person's emotional state.\n\n\n\n\n\n\"Of course it's going to make life more difficult in so many ways, including regulating your emotions. So that's an intuitively sensible link that if you're in a lot of pain, you're under a lot of stress, you're in fear, it's harder to regulate your emotions. What is less intuitive but is equally as important is that it's a two way street. So if for some other reason you struggle to regulate your emotions, then that will probably make pain more impactful and probably make pain worse, such is the complexity of pain. I mean the true story of how pain works inside the human body and brain is extraordinary and points to how much we've got in front of us to solve this problem. But it also raises opportunities for effective treatments, some of which look at all the factors involved, for example, the role of emotions.\"\n\n\n\n\n\nThe randomised trial took place from March 2023 to September 2024 and focused on the experiences of 89 people with chronic pain.\n\n\n\n\n\n45 people received their usual pain management treatments plus a psychological treatment known as Dialectical Behaviour Therapy or DBT.\n\n\n\n\n\nThe other half only received their usual pain management therapies.\n\n\n\n\n\nEven though the sample was small - Dr Norman-Nott says in post treatment questionnaires, D-B-T participants reported positive outcomes compared to those who did not receive the treatment.\n\n\n\n\n\n\"What we found that there was a significant improvement in emotion dysregulation in people who received pain and emotion therapy compared to those who continue to access the usual treatment. So we also saw that there were significant benefits in people's depression, anxiety, sleep problems, and their wellbeing in that those people that received pain and emotion therapy compared to those who didn't saw significant improvements in all of those areas.\"\n\n\n\n\n\nA key element of DBT is that it's a type of group therapy, which the report's authors say is incredibly beneficial for people with chronic pain.\n\n\n\n\n\nJanelle has had chronic pain for over 30 plus years and in that time has used opioids to manage her pain.\n\n\n\n\n\nShe says having chronic pain is a very stressful experience.\n\n\n\n\n\n\"I've been on a lot of opioids and things like that, but I've had nothing or found no course that's been able to help take away the pain or help control the pain at home. And having chronic pain is very emotional and very stressful. I've not really found anyone that's cared about my emotional side of my chronic pain. And as Sylvia and Nell have said, the more emotional you are, the more pain that you have, which is a bit weird, but that's the way it is. And by doing the course, I've been able to learn how to reduce my emotional side of my pain, which has helped my chronic pain in the end.\"\n\n\n\n\n\nThe course covered mindfulness, understanding emotions, naming emotions, how to change emotional responses, and also how to bring up positive emotions so that it reduces vulnerability to intense feelings and stressful situations.\n\n\n\n\n\nProfessor Lorimer Moseley AO says the key thing to remember about chronic pain is no one strategy works everyone but information from trusted sources is key.\n\n\n\n\n\n\"The evidence-based guidelines around the world when they list what are the most important treatment approaches for people with chronic pain, they all list education as the first one. And it's easy for us as health professionals or for people challenged by pain to think, well, I don't need more education. But what the evidence clearly shows is that if you can understand a bit more about the true complexity of how pain works, how your pain works and the evidence-based approaches to slowly retraining your hypersensitive pain system, your likelihood of improvement radically improves.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/culture/art-and-design/archibald-prize-live-results-2025-blog-updates-portrait-prize-wynne-sulman-packing-room-winners-art-gallery-of-nsw-start-time-20250509-p5lxv7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Archibald Prize LIVE updates: Tell us who you think will win",
    "publish_date": "Fri, 09 May 2025 12:02:57 +1000",
    "category": "entertainment",
    "authors": [
      "Linda Morris",
      "Hannah Kennelly"
    ],
    "text": "Good morning,\n\nI’m Hannah and welcome to our 2025 coverage of the Archibald, Wynne and Sulman prize winners at the Art Gallery of NSW.\n\nArchibald Prize finalists at the Art Gallery of NSW in Sydney. Credit: Janie Barrett\n\nThese are three of the most coveted prizes in the Australian art world and we are expecting winners to be announced from noon today.\n\nThe $100,000 103-year-old Archibald Prize for portraiture was first awarded in 1921. This year it attracted 904 entries.\n\nJust over one-third of the 57 entries are first-time nominees. Twenty-two are portraits of fellow artists and there are 12 self-portraits. Six subjects are from the stage and screen, three from the world of media and journalism, and three from music. A gritty portrait of city councillor Yvonne Weldon is the lone pollie’s portrait to grace the gallery walls.\n\nThe exhibition of the prize finalists opens to the public tomorrow and continues until August 17. It will then tour venues in NSW and Victoria.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/they-re-a-childhood-rite-of-passage-so-why-are-more-parents-saying-no-to-sleepovers-20250402-p5logq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "They’re a childhood rite of passage, so why are more parents saying ‘no’ to sleepovers?",
    "publish_date": "Fri, 09 May 2025 12:00:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "He plans to revisit the rule when his daughters are around 15, “when they’re more mature and when they’re more armed to defend themselves, I suppose, in the event of something happening”. Changing cultural attitudes to sleepovers Gabrielle Hunt, a PhD candidate at Australian Catholic University and a registered psychologist, says more Australian parents are becoming wary of sleepovers. Some are worried about the risk of sexual abuse, says Hunt. Others, she says, are concerned about technology use, and differing family’s rules around devices.\n\nEqually, Hunt acknowledges that sleepovers can be an important stage of development for many children. Loading “Sleepovers can be an opportunity to build really close relationships with their peers and develop resilience about being away from home, and having to look after some of those self-care tasks that might otherwise be prompted by mum or dad,” says Hunt. Is there a ‘right’ age for sleepovers? There is no right age for children to start attending sleepovers, says parenting educator and founder of Connected Parenting Genevieve Muir.\n\nA mother of four boys under 18, Muir does allow sleepovers, but says the right age has varied from child to child. “One of my kids has a significant speech challenge. I wasn’t going to let him have a sleepover as fast as his older brother because I knew that should something happen, he wouldn’t have the ability to communicate that as well to me.” “It’s looking at the skills and where my child is at and thinking, ‘Well, is my child ready?’ Not just in a ‘want to go’ capacity, but in an emotional readiness and a self-readiness,” she says. “It should be a decision that happens between parents and their children in terms of what they both feel comfortable with,” says Hunt.\n\nTheir first sleepover Loading Ahead of a child’s first sleepover, Hunt says it’s important to nail the basics – like toileting, showering and table customs. Then, make sure your child has an exit strategy should they need one. “It’s about communicating, ‘It’s okay if you want to go home’.”\n\n“It’s really common for kids to get to bedtime and miss home or it’s really scary because it’s the first time. So just reassure children that it’s okay if you need to get picked up, even if it’s late,” says Hunt. Loading She recommends ensuring your child knows who to speak with should they need an “out”, or scheduling a time for you to call. She says preparing your child for their first sleepover should start well before the age they are ready. “The single biggest thing we can do as parents is have open, ongoing, honest conversations about children that empower them,” she says.\n\nHow to talk to the host family Ahead of a sleepover, particularly if it’s your child’s first time with a host family, Hunt recommends talking with the host adults. This includes broaching topics like “when is an appropriate bedtime, what your rules and expectations around device use are, and who else is going to be in the home when this sleepover happens,” including if parents might be leaving kids with a babysitter. Consider an “everything but the sleep” sleepover, where the kids stay up late, have a midnight snack, then return home to sleep. There’s no need to feel uncomfortable asking questions, either, if they can help you and your child feel at ease.\n\nIf the sleepover is with a family you don’t know well, Hunt suggests holding a daytime get-together beforehand. If you are simply not comfortable with a family, always trust your gut, says Muir. Sleepover alternatives If you don’t think your child is ready for sleepovers, there’s no need for them to miss out on the fun. Hunt recommends the “everything-but-the-sleep sleepover” as an alternative, where kids might have a late night but return home to sleep in their own bed.\n\nMuir suggests talking with your child about why they want to attend a sleepover. Loading “We can’t really expect a child to understand, ‘I’m trying to keep you safe’. They don’t care about that. They just want to go on the sleepover.” Instead, try to understand their motives. “It might be, ‘We’re going to have a midnight snack and we’ve been talking about it’. So you could say, ‘Let’s have your friend over, we’ll have a late snack and then I’ll drop them home.’ You can come up with alternatives when you understand what the motive is.”",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/companies/the-woman-who-took-on-tesla-and-wants-to-see-musk-in-court-20250501-p5lvwe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The woman who took on Tesla (and wants to see Musk in court)",
    "publish_date": "Fri, 09 May 2025 11:51:41 +1000",
    "category": "finance",
    "authors": [
      "Jim Norton"
    ],
    "text": "Two years later, in November 2021, it appeared her seven-year campaign to hold the near-trillion-dollar company to account in a public court had finally stalled, however. Having insisted on representing herself, taking on Tesla’s army of expensive lawyers alone to keep costs down, her defamation case was thrown out. Musk, it seemed, was victorious. But, four years on, his words could come back to haunt him. Despite battling late-stage breast cancer, Balan refused to give up. Last month, the indefatigable mother-of-one won an appeal that reverses the decision – and opens the way for her explosive claims to be heard in public. ‘It was not easy to think that my son’s memory of me would be overshadowed because of this scumbag.’ “I cannot wait to see Musk and his goons on the stand and see how they will explain their lies and hate against me for doing the right thing,” posted Balan on X shortly after the decision was handed down on April 14. A fortnight later, speaking from Jacksonville, Florida, she is no less combative.\n\n“What a pathetic hypocrite that monster is,” she tells The Telegraph, in a thick Transylvanian accent. “At the same time, he’s bragging about being the free speech absolutist, he’s paying millions of dollars in legal fees to make sure I never have my day in court.” “I have the evidence for everything,” she adds, claiming that several top executives have agreed to testify in her case, and that Tesla is very much aware of one particularly damning recording. “That’s the reason Musk is so p-----.” Serious quality and safety concerns Growing up just 15 minutes from Bran Castle, otherwise known as Dracula’s Castle, Balan’s favourite toys as a child were pliers and screwdrivers. While other girls played with dolls, she would often be found with oil on her clothes and in her hair, taking engines and motors apart and putting them together again. Tesla’s stock price is the key to Musk’s business empire and his personal life. Credit: Getty Images\n\nAfter marrying aged 22, she went on to earn a degree in engineering and then moved to Canada in the early noughties. She later joined Boeing to work on the interior of the 787 Dreamliner in Seattle. In 2010, she was hired by Tesla – still a relatively small company – to help design the battery pack for the Model S. Well-liked and known for being a hard worker, she solved a crucial problem early on that had baffled managers and was delaying the sedan going into production. In recognition, her initials were etched into the battery pack case, which can still be found on some models. In a court document, Tesla’s lawyers admitted Balan was “at the heart of innovation at Tesla”. Branding Musk an arrogant “spoiled brat” who would constantly flaunt his wealth, her memory is no doubt tainted by subsequent dealings with his lawyers. But aside from some suggestive remarks about the “well-equipped” girls in the office when she was in earshot, she doesn’t recall any particularly bad run-ins with him. Loading Indeed, it was Musk she turned to directly in 2014 when she first discovered “serious safety and quality” flaws after joining the interior fittings team. In an email, she sidestepped her own line manager and requested a meeting with him to discuss her concerns that the interior floor mats could curl up and interfere with the brake pedal.\n\nHowever, on the day of the meeting with Musk, HR instead allegedly marched her to a “dungeon room”, where two security guards “with guns and handcuffs around their waist” were told to stay outside “in case she runs away”. She claims she was pressured to resign immediately. Feeling like she had no alternative, Balan signed the paper in front of her, but wrote she was only doing so because she had “dare[d] to speak up” to senior management. Shocked, Balan says she fainted as she was escorted out. Ever since, she has been fighting to clear her name. “That made my fight with cancer even more difficult,” Balan says. “Because there were quite a few moments they didn’t know if I would make it. It was not easy to think that my son’s memory of me would forever be overshadowed because of this scumbag.” She reserves particular anger for arbitration agreements. For the first few years, she was unable to fight the claims publicly due to the clause inserted into every Tesla contract. The concept was first introduced in the US in 1925 to relieve the burden on the court system by moving business contract disputes into a separate forum. But their use has mushroomed. Research suggests 80 per cent of the largest US companies have used such agreements in workplace disputes. (They are far less common in the UK, where employees have greater protections.) Such clauses – which notoriously tend to favour the employer – are “a back door for nasty corporations to steal freedom of speech”, says Balan.\n\nAfter three years in private arbitration over her removal from the company, Balan was awarded $US350,000) – “peanuts” compared to the $US40 million she says the shares she relinquished when she left would now be worth. She was not willing to give up and decided to go public with her claims in 2017. Tesla was incensed. In response to a Huffington Post article which marked the first coverage of her case by the media, bosses demanded a 600-word rebuttal that made claims of “criminal conduct” by Balan when she was an employee – despite never having raised these in the arbitration hearings. In 2019, Balan filed her defamation lawsuit, claiming it damaged her reputation and made it near impossible for her to find a job. She alleges it left her effectively blacklisted. On one occasion, a British director at a US company rang her to explain that he’d wanted to hire her but his legal team had intervened, Balan claims. “They kept calling and threatening people who wanted to hire me that they couldn’t afford to be on the wrong side of Elon Musk,” she says. “It was worse than having a crazy maniac as an ex-boyfriend.” ‘Toe to toe with a billionaire bully’ Balan is not the only Tesla whistleblower to find herself at the mercy of Musk’s hardball tactics. In 2018, former Tesla technician Martin Tripp told Business Insider that Tesla was wasting a “jaw-dropping” amount of raw material as it ramped up production of the Model 3. The response? Musk accused Tripp of being a “saboteur”, suing him for $US167 million for allegedly hacking the company’s systems, stealing trade secrets, and leaking information to the media.\n\nTesla even informed police it had received a tip that the former employee might “come back and shoot people” at the Gigafactory in Nevada where he worked. The sheriff’s investigation concluded “there was no credible threat”. Tripp insisted he had leaked the information out of legitimate concern and, believing he had been defamed as a would-be mass shooter, countersued. But the case swung Tesla’s way – with Tripp ordered to pay Tesla $US400,000 in damages in 2020. Balan had raised safety concerns about the firm’s Model S vehicles directly with Musk back in 2014. Credit: AP In Balan’s case, after sending Musk an intent to sue, the defamation claim failed to settle. “One of my conditions was for them to apologise and admit… that everything they said was a lie – and they didn’t want to do that.” Instead, she says, Musk opted for his favoured weapon – “lawfare” – and the battle continued. As the richest man in the world with an estimated net worth of $US330 billion, Musk is not shy of a legal fight. In 2018, British cave diver Vernon Unsworth, who helped rescue a trapped youth football team from a flooded Thai cave, sued Musk for £142 million ($293 million). Musk had branded Unsworth a “pedo” on X after the diver criticised his proposal to use a mini-submarine in the rescue as a PR stunt. He willingly went to court to contest the case – and won. Unsworth’s lawyer subsequently lamented that his client had gone “toe to toe with a billionaire bully”.\n\nIt makes Balan’s case all the more remarkable. Crucially, early on in the defamation case, a judge ruled all the confidentiality clauses in her Tesla contract could be dropped. “That’s the reason why I can legally talk to you now,” she explains. But by the beginning of 2022, her case had seemed all but over as her claim was thrown out by a judge in California and her arbitration verdict was confirmed, closing the matter. Again, Balan refused to give up and appealed the decision. A week later, she was diagnosed with stage-3B breast cancer. As she underwent treatment, she twice asked for a continuation, where the case is put on hold for a certain period. The second time, Tesla’s lawyers refused, she alleges. “So when the due date came to file it last January, I was so exhausted, and the treatment was so harsh and powerful, I was barely…” she says, pausing. “My body was struggling to go to the bathroom. This is how bad I was.” Last month’s decision by the three-judge panel of the Ninth Circuit Court of Appeal effectively nullified her arbitration award as a court judgment, reopening the possibility for Balan to pursue her defamation claims in a proper court of law. Though not yet a victory, it is a significant milestone – and one that is giving other Tesla whistleblowers hope, she says, adding that several have contacted her since the ruling. Loading “Everybody said that it’s impossible,” she says. “Only a handful of people for so many years actually trusted me that I could do it. But I did it.” How does she feel now? “I’m feeling really happy – I proved them wrong,” she says. “I proved to them an immigrant woman engineer had the capacity, the brain power, to learn their stupid legal system and actually win. So yeah, I feel pretty damn good.”",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/hot-sandwiches-hit-the-menu-at-a-p-bakery-s-shiny-new-site-20250509-p5lxwu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hot sandwiches hit the menu at A.P Bakery’s shiny new site",
    "publish_date": "Fri, 09 May 2025 11:45:51 +1000",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nNew speciality sangers are made from rotisserie-cooked meats.\n\n1 / 4 The Midnight in Havana sandwich. Janie Barrett 2 / 4 The porchetta sandwich. Janie Barrett 3 / 4 The rotisserie where the meats are cooked. Janie Barrett 4 / 4 Shiny new A.P Quay, with entrance on Young Street. Janie Barrett Previous Slide Next Slide\n\nBakery$$$$\n\nTucked into the base of the Quay Quarter Tower, A.P Quay is the second All Purpose Bakery location to open this year (and the seventh overall), after chef Mat Lindsay, baker Dougal Muffet and hotelier Russell Beard launched Darlinghurst’s A.P Bread and Wine in January.\n\nCroissants and assorted breads are made on site at the Circular Quay shop, but it’s the hot sandwiches, made from meats cooked on gleaming imported French spits, that have people most excited.\n\nThe big three drawcards from the spit are the BBQ spice-rubbed spatchcock, fennel seed and garlic-rolled porchetta and the pastrami-brined beef, but the full sandwich menu runs much longer, with baguettes, brekkie rolls and toasties.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/afl/glandular-fever-a-ruptured-pec-foot-hamstring-and-back-injuries-a-bomber-s-painful-path-to-16-games-20250508-p5lxls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Glandular fever, a ruptured pec’, foot, hamstring and back injuries: A Bomber’s painful path to 16 games",
    "publish_date": "Fri, 09 May 2025 11:43:46 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "Testing revealed that the 23-year-old’s troublesome left hamstring was smaller and weaker than his right. Dr Enda King gave Reid a series of exercises and sent him back to Melbourne. After considerable hard work, the reward Reid often felt he missed out on was suddenly a reality. Zach Reid competes with Collingwood’s Dan Houston in his first Anzac Day game last month. Credit: AFL Photos “I had a full-body scan recently at Olympic Park that compares muscle mass, and now I’m equal, left and right, and I haven’t had any hammy issues since,” he said. Where the trouble started Essendon selected Reid, then barely 19 years old, to play his first AFL game in round five of his debut season against a Brisbane Lions team that had signed ex-Bombers star Joe Daniher.\n\nHe felt sick that week, but thought it was a common cold, or the flu at worst. Reid was wrong, and his health deteriorated rapidly in the days after playing. Loading “I was like, ‘I’m not giving up this opportunity to play my first game’, so I went up there pretty sick already, and then I played, and I think that just tipped me over the edge,” Reid said. “The exhaustion of playing your first AFL game is hard enough as it is, but when you’ve got glandular fever – which I didn’t know at the time – [it is even harder]. After that, I went downhill. The next week was Anzac Day. It was a dream to play Anzac Day, and I was going to get my opportunity in my first year. I’ve missed every Anzac Day until this year.” Reid, whose draft season was wiped out by the COVID-19 pandemic, was bedridden for weeks, but eventually made it back on the training track. Only weeks in, scans revealed a stress fracture in his lower back.\n\n“I think being in bed for ages, and then coming back to an AFL program, on top of missing so much footy during COVID, didn’t help a growing body,” he said. That ended Reid’s season after just one senior match. Bone stress in the sesamoid bone in his right foot in the ensuing pre-season was just a minor nuisance in comparison. Reid was otherwise injury free in 2022, adding seven senior games and 12 in the VFL. But by December that year, his back stress fractures returned. “That was really flattening,” he said. “People were trying to help, and saying, ‘Oh, you’ve got 10 years ahead of you; don’t worry about it’ – but I think the average [AFL] career length is four years. I was like, ‘You don’t have a crystal ball, so you can’t really say that’.\n\n“My mindset back then was, ‘Poor me; why is this happening to me?’. You think when you’re a top-10 pick, you’re going to come in, and it’s going to go smoothly, but then you get hit in the face with some adversity.” Learning to better handle his setbacks, which Reid said came with maturity and perspective – “It could be a lot worse. I could be homeless” – proved crucial. His three hamstring injuries, all on his left leg, and a ruptured left pectoral muscle were still to come. Zach Reid’s wretched injury history 2021: Reid diagnosed with glandular fever after making his AFL debut in round five against Brisbane Lions. Three months later, after being bedridden then rebuilding his fitness, scans reveal he has a stress fracture in his lower back. 2022: Bone stress is detected in the sesamoid bone of his right foot in pre-season. He wears orthotics to remedy the issue, and plays most of the season between the AFL and VFL. 2023: Another back stress fracture interrupts his pre-season and delays his season start. Shortly after returning in the VFL, Reid suffers a T-junction hamstring injury in his left leg that sidelines him for six weeks. In testing ahead of his planned VFL return, the injury flares up, prompting season-ending surgery. 2024: Suffers a left hamstring strain - in a different area to the previous two - in Essendon’s round one win over Hawthorn. It costs him seven games, then in the fourth match of his comeback in the VFL, an opponent crashes into him, rupturing his left pectoral muscle, leading to another operation. The latter was a freak injury in a VFL match, where Reid went to tackle a Box Hill opponent who “steamrolled” through his arm and ruptured the injury-cursed Bomber’s pec. Season-ending surgery followed. Playing on Anzac Day was not Reid’s only highlight this season. He also had the chance to share the field with, and play directly on, his brother, West Coast forward-ruck Archer.\n\n“I was the perfect match-up for him,” Reid said. “We both didn’t really have any impact, so it was funny, but it was good that it was close. It made it entertaining for our parents.” The Reid brothers, Zach and Archer, played against each other in round six. Credit: AFL Photos Reid insists the only change now he is playing regularly is the extra attention from media and fans, some of whom thank him for being a “bargain buy” in fantasy football. “I’m outperforming my price, so that’s the main thing fans are grateful for,” he said, smiling.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/advantage-lions-relying-on-england-the-right-call-for-tourists-20250509-p5lxwn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Advantage Lions: Relying on England the right call for tourists",
    "publish_date": "Fri, 09 May 2025 11:41:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "There is only one positional unit in the British and Irish Lions squad announced overnight on Thursday in which an Englishman is not present, and even that might be a moot point with Northampton winger Tommy Freeman capable of playing in the No.13 jersey if Huw Jones (Scotland) or Garry Ringrose (Ireland) are injured.\n\nNot even the Irish can claim that spread of players throughout the squad, with No.10s Sam Prendergast and Jack Crowley notably omitted in favour of England’s Fin Smith and Marcus Smith.\n\nThe squad shows that Lions coach Andy Farrell has been smart and flexible enough to see a late shift in the power dynamics between the Lions nations, with brilliant 20-year-old flanker Henry Pollock also rewarded for a brilliant performance in Northampton’s win against Leinster in Dublin last weekend.\n\nNone of this is good news for the Wallabies. The earlier prospect of an underwhelming Lions squad was based on the premise that Ireland had plateaued, and while that is arguably still true it did not factor in an England rise.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/buddha-in-the-box-why-ivan-cleary-is-the-zen-master-20250506-p5lwws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Buddha in the box: Why Ivan Cleary is the Zen master",
    "publish_date": "Fri, 09 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Roy Masters"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size When does a dynasty die? There is no knowing when the end begins. Ivan Cleary, coach of the Panthers – who have won the past four NRL premierships but are now on a lowly ladder position, says, “I’m not even sure of the exact definition of a dynasty. Have we had one, or are we still in one at Penrith? There is no such thing as a machine in perpetual motion. At some point, you’ve got to stop for fuel.” He agrees the continual loss of players in the salary cap era, including three top-class ones at the end of the 2024 season – James Fisher-Harris, their physically dominant forward leader; Jarome Luai, the attacking foil for his own son, Nathan, and Sunia Turuva, a first-half tryscorer in last year’s grand final - helps drain the tank. As will the coming loss of co-captain Isaah Yeo, Liam Martin, Cleary and possibly fullback Dylan Edwards to the NSW team, making it difficult to win enough games to make this year’s top eight. Nor did results up to Magic Round suggest their replacements, despite being the product of the NRL’s best assembly line, would help the Panthers peat, let alone five-peat. “All that adds to it possibly ending,” says Cleary, on the eve of his team’s comprehensive 32-8 win over the Broncos in Brisbane. The victory is a timely warning that it is foolish to proclaim the death of a dynasty. Ivan and Nathan Cleary after winning their fourth premiership. Credit: Getty Images There is no voice of doom from the top of the Blue Mountains saying the club is slipping down to the lowlands where the also-rans live. Melbourne is described as a dynasty, yet the club has never won consecutive premierships. If Cleary has doubts about the end of a dynasty, he has certainty about its beginning . When the Panthers were beaten 26-20 by Melbourne in the 2020 grand final, he told reporters, “I’d love to have the game tomorrow, that’s for sure.”\n\nAdvertisement\n\nAsked about it now, he says, “I genuinely meant it. I felt like we ran out of time. I felt like I’d like to have the first half again and it would have been enough. Although the play-offs had been tight, everything in the grand final went faster. The Storm’s line speed was fantastic. We made a few mistakes. Nathan threw an intercept and couldn’t get it out of his head. But I also thought at the time that this is part of the journey. And it was.” If there are any doubts this was the game that motivated Penrith, the Panthers players made it obvious in their redemptive victory over Melbourne last year. It has never been previously reported but some of the Storm’s younger players were shocked at the vitriol Penrith spewed at them as they stood behind the posts after a try. Luai had not forgotten the “get back to Mount Druitt” slur from the Storm’s Jahrome Hughes. The Fibro versus Silvertail ethos of under-privilege persists in Sydney’s western suburbs and Cleary, who has lived in Penrith for 14 years and still owns a house in the northern beaches, makes no apology for any sledging. “It was still remembered,” he said. “We learnt a lot from the 2020 grand final, including a lot of stuff that happened off the ball.” Cleary had coached more than 370 games by the time he won his first premiership. He had previously coached the Warriors, Panthers and Wests Tigers before returning to Penrith. Ivan Cleary in his first year of coaching the Warriors in 2006. Credit: David White It sounds ludicrous to suggest a man with all that experience, including taking the Warriors to the 2011 grand final, would grow as a coach along with his young team but he agrees. “Definitely,” he says. “My career had all been about rebuild. By the time I got back to Penrith, it was the first time I actually thought I had a team that could win a grand final. I could see green shoots and blue sky.” He admits he feared for his reputation. “I wondered whether I would be the guy who was only known for dragging teams up out of the gutter and not reaching the top. I have definitely grown as coach along the way with these players.”\n\nAdvertisement\n\nPenrith have led a tactical revolution in the NRL, using their back five to create field position and hence balance the energy output of backs and forwards. “Part of that decision was personnel,” says Cleary with reference to the power of the now injured winger Brian To’o and fullback Edwards returning the ball to near halfway. “The beauty of the back five is that they can get the forwards thinking about defence. All our stats in the game are about attack but I’ve always believed defence wins games and attack decides by how much.” Some observers believe the Panthers led in exploiting the six-again rule by deliberately conceding breaches early in the tackle count to trap a team in its own 40-metre zone. “We definitely didn’t do it deliberately,” Cleary says. “We place a lot of emphasis on controlling the ruck and line speed but the breaches weren’t deliberate.” He does admit to introducing the ruse of blockers preventing opposition players from hurrying the kicker. The Storm’s Christian Welch was particularly effective harassing Nathan in the 2020 grand final and Penrith’s sophisticated blocking system was the response. ‘I wondered whether I would be the guy who was only known for dragging teams up out of the gutter and not reaching the top’ Ivan Cleary “I’ll take that as a compliment,” Cleary says, before conceding the NRL subsequently did the job for him by penalising any player who makes contact with a kicker. “Halves now have a level of protection on kicks.” He also pleads guilty to the recent scrum ploy of the half placing the ball on the ground and retreating to first receiver in the backline, while a scrum player picks it up and feeds the ball. Insofar as it adds a man to the backline, it creates an overlap. “The Roosters did it to us and scored a try,” Cleary admits. He wasn’t resentful he had been punished by his own invention. “I thought at the time, ‘That is pretty cool, too.’” He explains the ploy came in response to the NRL ban on teams holding the ball at the base of the scrum. “A lot of scrum tries came from that but the NRL stopped it and now they have done it again by making us re-start the scrum feed.”\n\nAdvertisement\n\nHowever, he concedes the NRL’s relentless mission to increase ball in play time by reducing stoppages has benefitted Penrith and Melbourne. “The continuity has helped us,” he agrees. “The six-again rule has been good for us but most of the calls you don’t know what they are for.” He echoes the complaint of all coaches that referees can use repeat sets to even up a game. He welcomes a review of the salary cap, saying, “Penrith doesn’t get any rewards for players developed in our pathways going to other clubs as NRL players. We are doing a good job for the NRL producing players.” Luai left after four premierships, including leading the team last year in place of an injured Nathan who also missed NSW’s Origin winning series in which Luai played a stellar role. Asked if the Panthers under-valued the five-eighth, Cleary said, “I definitely did not under-estimate him. We fought tooth and nail to keep him. We couldn’t get near the money he was offered plus he wanted to forge his own path. I’m proud of what he is doing at Wests Tigers but I wish he was here.” Like his colleagues, he rails against the NRL draw which resembles something dreamed up by muppets Ernie and Bert. Penrith’s Origin players are required to play a 3pm match on a Saturday in Auckland after the Wednesday evening Origin encounter in Perth. “They [Penrith’s Origin representatives] won’t be playing in Auckland,” Cleary said.“It’s ridiculous. I don’t have a choice.” Nathan and Ivan Cleary after Penrith lost the 2020 grand final. Credit: Getty So, let’s go back to that 2020 grand final - the beginning of the Penrith dynasty. Would Cleary have liked a time-out, as they have in US sports, where a coach can stop the game and settle the players. “If we were able to have them, that’s the sort of game where it would have helped,” he said. “But in the NRL we have time-outs for things we don’t want time-outs for.” As he sits in the coach’s box at games, awaiting the Bunker’s decision, he looks composed while his rivals stress and fume. “Underneath the surface, I ride all the highs and lows, just like the other coaches,” he reveals.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/ange-dropped-the-coldest-quote-in-soccer-history-in-90-minutes-he-can-deliver-on-it-20250509-p5lxu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ange dropped the coldest quote in soccer history. In 90 minutes he can deliver on it",
    "publish_date": "Fri, 09 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Having won their semi-final tie 5-1 on aggregate over Bodo/Glimt, Spurs are into the Europa League final against Manchester United. So Postecoglou is 90 minutes away - maybe 120 - from having dropped one of the coldest quotes in modern football history. The psychological burden of Tottenham’s 15-year trophy drought, which has weighed so heavily on this club, could be finally discarded. Ange Postecoglou in Bodo. Credit: nna\\seathompson By a man who, if certain reports are to be believed, will be discarded by the club regardless. Indeed, the question of his future remains - but it shouldn’t. It is a ludicrous notion that a decision about whether Postecoglou is the right man to lead Spurs into the future, or at least the third year of his four-year contract, should hinge on a single fixture. It’s even sillier if it’s already been made.\n\nThere’s certainly no glossing over how poor their Premier League season has been, and how inexplicably bad some of their performances have been in it. But there’s enough evidence, if you want to see it, in how they’ve performed in the Europa League, and how Postecoglou has set them up tactically, and how the players are responding to him, to suggest that there’s still something in this project that is worth pursuing. The unity in the Tottenham camp - as captured by the club’s channels, who posted his stirring post-match address to the players on social media - speaks for itself. Any other manager in these circumstances, and with those results, would have lost not only the dressing room but their own head long ago. Yves Bissouma leads the post-match celebrations. Credit: Getty Images Not Postecoglou. There’s been some evidence of fraying, but fundamentally, he’s kept it together. The biggest challenge for him at Spurs was never about wins and losses. It was about changing the mentality of this football club, about getting rid of the ‘Spursy’ tag. And he’s doing it, bit by bit, challenging not only the external conversation about Tottenham but also their own internal self-defeating perceptions.\n\nLike the trips to Eintracht Frankfurt and AZ Alkmaar earlier in the tournament, many fans were petrified about the prospect of playing north of the Arctic Circle on a plastic pitch against a team in Bodo/Glimt with a giant-slaying record. In the end, there was nothing to be worried about. The players couldn’t have been more focused. Postecoglou, too, has probably learned some things along the way. There’s no doubt that Spurs are playing more pragmatic football in the Europa League than those who follow his teams would expect to see. His sides hardly ever launch it long from goal kicks; Tottenham did almost exclusively that in Bodo. Circumstances dictated it, as he explained afterwards, but there have been plenty of other times in his career where circumstances also dictated it, and he didn’t go down this path. Why now, and not then? One for him to answer. Either way, those who knocked him earlier in the season for having no “Plan B” and never changing his tactics are quiet now. Pre-match, Postecoglou essentially laughed off the suggestion from Arsène Wenger - the ex-Arsenal manager, so not a disinterested party - that the Europa League winners didn’t deserve to qualify for the UEFA Champions League the following season because the then-likely finalists Spurs and Man United were doing so poorly in the Premier League. They sit 16th and 15th respectively on the table.\n\nLoading Post-match, Postecoglou again took aim at the notion that people were “fearing” the prospect of Spurs actually winning something for once, and thus were working ahead of time to diminish their achievement before it happens. “I could have been sitting here at exactly the same time in fifth position, and I can guarantee that the commentary around me would be: ‘Well, that’s great Ange, but this club needs to win something.’ That’s exactly what everyone would be saying,” he said, calling the hypocrites out directly. “So of course it’s massive. You have to frame it against what this club has been through over the last 15 or 20 years and what the supporters have been through.” What they’ve all been through this year, painful as it’s been, might yet prove to be worth it.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/politics/jacinta-price-yelled-at-in-hotel-by-aboriginal-activist-20250509-p5lxx1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jacinta Price yelled at in hotel by Aboriginal activist",
    "publish_date": "Fri, 09 May 2025 11:34:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "Jacinta Price yelled at in hotel by Aboriginal activist\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/tap-and-no-the-card-surcharges-that-look-set-for-the-chop-20250506-p5lwwo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tap and no? The card surcharges that look set for the chop",
    "publish_date": "Fri, 09 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Madeleine Heffernan"
    ],
    "text": "The central bank will release its report on surcharging shortly, and the government will then decide whether to ban debit surcharges, while seeking to not disproportionately hurt small businesses. “We’re cracking down on unfair and excessive card surcharges to get a better deal for Australians and small businesses,” a spokesman for Treasurer Jim Chalmers said. “We’re prepared to ban debit card surcharges subject to the further work under way now by the Reserve Bank if there are sufficient safeguards to ensure both small businesses and consumers can benefit from lower costs.” The Reserve says small businesses can be charged a whopping three times more in transaction fees than larger merchants.\n\nThe hospitality industry warns that menu prices will have to rise if businesses can no longer recover the cost of debit card payments from customers, saying a coffee that now costs $5.08 with a card surcharge might rise to $5.50. “Of course it will be inflationary,” said Wes Lambert, chief executive of the Australian Restaurant and Cafe Association. “Removing a debit surcharge will translate directly to the bottom line. And to mitigate this drop in profit, we’ll see a sharp increase in prices much greater than 8¢ that we currently pay on a cup of coffee. We’ll be rounding that [price rise] to 10¢, 20¢ or even 50¢.” The Australian Restaurant and Cafe Association, the Australian Hotels Association and the Australian Lottery & Newsagents Association are lobbying the Reserve Bank against a ban. Card surcharging is more common in cafes, restaurants and pubs than in other sectors, the Reserve said. But Ebstein said the removal of surcharges would have a negligible effect on consumer prices and that any ensuing price rises by businesses would be opportunistic. He said the cost to merchants of accepting cards had reduced significantly since the Reserve first allowed surcharging in 2013.\n\nEbstein, of MWE Consulting, said businesses should regard card payment costs as another cost of being in business. “You don’t charge someone an extra bit because you’ve just done an advertising campaign, or you’ve just paid your electricity bill,” he said. “Card costs actually reduce your overall costs because 30 years ago you were maintaining accounts for customers, there was a cost; most of your payments were in cash, there was a cost.” Palace Cinema chief executive Benjamin Zeccola. Credit: Jason South Palace Cinemas chief executive Benjamin Zeccola said banning card surcharges would do “serious damage to the sectors driving economic activity and employment”. Surcharging helped businesses recover their costs transparently, Zeccola said.\n\n“If government reform eliminates that transparent mechanism without care, it’s not cutting ‘junk fees’ – it is foisting them invisibly onto small businesses, pushing prices up, or worse, tipping fragile businesses over the edge,” he said. “That’s inflationary, not protective.” Family-run book retailer the Book Depot goes against the norm by not charging the surcharge at the point of sale. “All of us find it annoying as consumers and so have avoided inflicting it on our customers,” co-owner Tony Sidebottom said. “We also try and offer the cheapest books in the marketplace and this message doesn’t sit comfortably alongside the surcharge.” Sidebottom said the Book Depot regarded the surcharge as just another cost, like electricity. Tony Sidebottom of the Book Depot, which does not apply a surcharge at the point of sale. Credit: Paul Jeffers\n\n“The consumer pays for it anyway, really. With our business, our margins reduce very slightly but when we’re considering pricing decisions, it’s something we take into account.” The Australian Competition and Consumer Commission said misleading surcharging practices were a compliance and enforcement priority. It regularly received tip-offs about alleged excessive surcharging, particularly by small and micro-businesses, it said. But big companies are not immune to excessive card surcharging. The competition watchdog said Europcar, Fitness First and Nine Entertainment, owner of The Age, had been financially penalised for charging surcharges that were greater than their costs. The Australian Banking Association said consumers “should always know the cost of an item before they pay for it”. The association said while it wanted to see less surcharging, prohibiting it “would represent an abrupt shift to a practice”.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/world/north-america/starmer-s-nothing-deal-with-trump-is-a-warning-sign-for-albanese-20250509-p5lxsw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starmer’s ‘nothing’ deal with Trump is a warning sign for Albanese",
    "publish_date": "Fri, 09 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "The first question to Donald Trump after announcing his “historic” trade deal with the United Kingdom came from a British reporter who, in a classic case of English versus American sensibilities, asked the president: Aren’t you overselling this?\n\nOf course, he was. But Trump oversells everything. In that sense, he is the quintessential American, in direct contrast to the British tradition of understatement.\n\nDonald Trump listens to Britain’s US ambassador Peter Mandelson in the Oval Office. Credit: AP\n\nIn this case, though, Britain’s Keir Starmer is just as guilty – if not more so. Not only is he portraying this as a massive win for British workers, but he described it as a historic moment between the two countries, up there with VE Day, which occurred on the same day 80 years ago.\n\nWell, an armistice it ain’t. This is a list of concessions more than a trade deal, and one in which the UK is still subject to billions worth of tariffs that didn’t exist last year.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-for-flat-open-us-stocks-gain-as-trump-says-buy-before-china-talks-20250509-p5lxt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX rises in early trade after Wall Street gains; Macquarie, Nine shares jump",
    "publish_date": "Fri, 09 May 2025 11:18:51 +1000",
    "category": "finance",
    "authors": [
      "Rita Nazareth"
    ],
    "text": "The Australian sharemarket traded higher on Friday morning, buoyed by solid company results and optimism for easing global trade tensions after Donald Trump announced a trade deal with the UK, made encouraging comments on talks with China and said investors should buy shares now.\n\nThe S&P/ASX 200 rose 27 points, or 0.3 per cent, to 8213.70 as of 11.18am AEST, with six of its 11 industry sectors advancing as gains from energy, banks and IT stocks were muted by losses from the materials sector. The modest uplift comes after the local bourse added 0.2 per cent on Thursday. The Australian dollar fell below US64¢ and was trading at US63.93¢.\n\nThe announcement of Trump’s first trade deal stoked optimism on Wall Street. Credit: Bloomberg\n\nShares of Macquarie Group and News Corp gained after both reported better-than-expected results. Nine Entertainment, the publisher of this masthead, rallied after US real estate listings giant CoStar confirmed a $3 billion deal to buy its majority-owned property listings business Domain, raising the prospect of a special payout to shareholders.\n\nMacquarie Group climbed 4.3 per cent after reporting a 5 per cent lift in full-year profits to $3.72 billion, helped by a strong performance in its flagship asset management business. Analysts had predicted a $3.69 billion profit. Three of the big four banks also advanced, with CBA up 0.3 per cent, National Australia Bank up 0.7 per cent and Westpac up 1.1 per cent. ANZ was down 1 per cent.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/this-charcoal-chicken-shop-serves-a-close-chick-fil-a-dupe-20250509-p5lxwp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This charcoal chicken shop serves a close Chick-fil-A dupe",
    "publish_date": "Fri, 09 May 2025 11:15:44 +1000",
    "category": "finance",
    "authors": [
      "Quincy Malesovas"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nFind American-style fried chicken and Aussie-style roast chook at Chook in Cremorne.\n\n1 / 5 The “proper sandwich” with chicken, Acide pickles and buttermilk ranch. Supplied 2 / 5 Chicken tenders from Chook. Supplied 3 / 5 The “Julius wrap” with crispy chicken, caesar dressing and prosciutto. Supplied 4 / 5 Crispy chicken is a specialty at Chook. Supplied 5 / 5 Salad bowls are also available. Supplied Previous Slide Next Slide\n\nAmerican$$$$\n\nFourteen years ago, Fonda shook up Melbourne’s fast-casual Mexican dining. Now, its co-founder Tim McDonald is ready “to modernise the charcoal chicken offering and give people what they want in 2025” with his new venture, Chook. That translates to a choice of fried or roasted chicken served in wraps, bowls and sandwiches (the American term for chicken burgers).\n\nThe fried chicken – pressure-fried so it stays juicy and absorbs less oil – borrows a technique from popular US fast-food chain Chick-fil-A. Roast chook nods to classic Aussie styles. Available whole, halved or quartered, it’s salt-brined and finished in a combi oven, which allows the bird to steam while it cooks, avoiding dryness.\n\nHot tip: For a close Chick-fil-A dupe, order the Proper Chicken Sandwich with fried chicken, buttermilk ranch and pickles, plus a side of waffle fries.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://au.news.yahoo.com/resident-hits-out-at-ev-issue-taking-over-aussie-suburbs-after-new-2200-fines-introduced-011625029.html",
    "title": "Resident hits out at EV issue taking over Aussie suburbs after new $2,200 fines introduced",
    "publish_date": "2025-05-09T01:16:25Z",
    "category": "finance",
    "authors": [],
    "text": "Limited parking in urban areas across Australia continues to cause tension among EV and non-EV drivers.\n\nA resident slammed the decision to keep precious on-street parking limited to only EV charging. Source: Facebook/C Jones\n\nAs councils race to install electric vehicle (EV) chargers across Australian suburbs to keep up with growing demand, prime parking locations are being snapped up for the new infrastructure – and some locals aren't happy about the disappearing parking options in their community as a result.\n\nThis is the case in one inner-city suburb of Sydney, where a resident claims two EV-designated parking bays are consistently vacant. Seeking the opinion of others in a local community group, he complained that he often has to park further away and walk to amenities, only to pass the parking bays which are frequently sitting empty.\n\n\"Day four of two electric vehicle-only spots not being used,\" the Leichhardt resident posted online.\n\n\"Two key parking and drop-off spots for residents, small businesses and most importantly right out the front of a local GP and pathology.\"\n\nADVERTISEMENT\n\nAfter legislation was introduced in November 2022, it became a fineable offence for drivers of petrol engine vehicles to park in allocated charging bays, with a potential fine of up to $2,200. The practice is often referred to as 'ICEing'.\n\nCouncil steadfast on providing more EV charging bays\n\nWith parking availability becoming increasingly more limited in urban areas, the introduction of EV-only bays is exacerbating the already existent disdain some drivers have towards the cars. Yahoo News has previously reported on the limited parking in Leichhardt, with some residents choosing to illegally reserve on-street parking in a bid to secure a spot outside their home.\n\nHowever, the local council remains steadfast that it is required to provide infrastructure for EV drivers. A spokesperson for the Inner West City council told Yahoo it has \"rolled out the largest number of kerbside EV charging stations of any council in the nation\" and there will be \"more to come\".\n\nThe local council touts itself as the \"EV capital of Australia\" and currently has installed 102 public EV chargers, with 34 more to be rolled out by the end of June.\n\nADVERTISEMENT\n\nThe council has rolled out more than 100 new charges in recent years. But petrol powered cars must keep them free. Source: Facebook/C Jones\n\nHow is the location of EV charging bays chosen?\n\nThere are many considerations when choosing the location of an EV charging bay, including the power grid capacity of the site, safety considerations, locations of other chargers and adjacent land uses.\n\nWhen the council was questioned about the perceived prioritisation of parking for EVs over non-EVs, the spokesperson confirmed to Yahoo a council review will commence to gather insight into whether their strategy has worked, and how it can be improved moving forward.\n\n\"This data is not currently available. However, a utilisation study is intended to commence six months after the final charger is operational,\" the spokesperson said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 42
  },
  {
    "url": "https://au.news.yahoo.com/expats-aussie-find-in-chinese-supermarket-highlights-major-global-shift-caught-my-attention-215411630.html",
    "title": "Expat's Aussie find in Chinese supermarket highlights major global shift: 'Caught my attention'",
    "publish_date": "2025-05-08T21:54:11Z",
    "category": "finance",
    "authors": [],
    "text": "US expat Garrett said the uncommon discovery signals a larger change taking place in China.\n\nUS expat Garrett discovered Aussie beef at a grocery store in China after Trump's tariffs effectively halted trade between the two countries. Source: TikTok/Theforeignerlife\n\nA US expat living in China made a surprising discovery at a local supermarket, signalling a major shift in the favour of Australia amid an increasingly unstable global environment.\n\nGarrett, who is originally from Boston but lives in Shanghai, told Yahoo News he was recently grocery shopping when he stumbled upon a packet of minced beef from Australia.\n\nWhile that might not mean much to many, it comes just one month after the Trump administration sent shockwaves through the entire world when he announced reciprocal tariffs on just about every country on April 2, a day he called \"Liberation Day\".\n\nAustralia's beef industry was singled out with Trump declaring, \"[Australia] won’t take any of our beef\" due to our tough biosecurity rules.\n\nADVERTISEMENT\n\nBut the announcement also caused a grinding halt to America's $2.5 billion beef trade to China — after the country copped the largest tariff of 145 per cent. China countered imposing tariffs on US imports of 125 per cent.\n\nThe price pressure on US meat exports followed China not renewing the registration of hundreds of US meat facilities. These factors have combined to halt US beef imports into China, and Australia's beef industry has benefitted significantly with it set for a record-breaking $13.9 billion in sales in 2024–25, a 12 per cent increase from the previous record set the year prior.\n\nOf the discovery at a \"high-end\" store in a shopping mall in Shanghai, Garrett said he had been unaware of Australian beef being \"commonly available\" compared to meat from the US.\n\n\"On this particular visit, I was shopping for ingredients to make beef ragu and noticed a package labelled as Australian beef,\" he said. \"It caught my attention,\" he said.\n\nGarret, who shared a video about the discovery, said; \"The whole idea that China is hurting because of the tariffs... they’re not because they’re buying it from other places, because they’re not as dependent on the US,\" he said, adding, \"They’ll just go elsewhere.\"\n\nADVERTISEMENT\n\nGarrett said he \"trusts Australia more than America\" with the quality of the minced wagyu beef, which cost 46 Chinese yuan (A$9.90).\n\nThe last time Garrett remembers seeing American beef in local grocery stores was about a month ago, around the time the tariffs were introduced.\n\n\"From what I understand, food quality standards and regulations in the US are comparatively lower, and the use of chemicals and additives in cattle feed and meat processing is a concern for me,\" he said.\n\n\"Overall, I trust Australia’s regulatory approach, which seems to prioritise quality and safety over profit,\" he said.\n\nUS President Donald Trump's trade announcement was intended to 'make America wealthy again'. Source: Getty\n\nAustralia 'well placed' to handle US tariff instability\n\nInitially, Australia faced a 10 per cent tariff on goods and while it fared better than most, Prime Minister Anthony Albanese described it as “unwarranted” at the time.\n\nADVERTISEMENT\n\nMeanwhile, China received tariffs of up to 145 per cent and in retaliation, imposed a minimum 125 per cent tariff on US goods.\n\nAustralia’s other trading partners, including the European Union, Vietnam, Japan and South Korea, faced tariffs ranging from 20 to 52 per cent. These tariffs were temporarily suspended for 90 days to allow countries other than China time to negotiate with the US.\n\nWhile financial markets initially responded shakily, earlier this week, big four bank Westpac's chief executive Anthony Miller said despite the uncertainty from Trump's global tariff crackdown, Australia is likely to weather the storm. \"Australia is well placed to handle the instability,\" he said on Monday.\n\nHow did the Chinese react to Trump's tariff announcement?\n\nSpeaking of the reaction in China to the US tariffs, Garrett said his Chinese friends and colleagues responded with \"raised eyebrows and a shrug\".\n\nADVERTISEMENT\n\n\"The discussions I heard focused on facts and figures, particularly regarding the US’s reliance on Chinese goods versus the reverse,\" he said.\n\nHe believes that while the tariffs have \"certainly had an impact\" on both sides, \"most people in China haven't felt a direct impact\".\n\n\"Few Chinese consumers heavily rely on American-made products, which left many of my friends puzzled by the rationale behind the tariffs,\" he said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 43
  }
]