[
    {
        "url": "https://www.9news.com.au/national/federal-election-2025-working-from-home-policy-interview-with-small-business-owner/2f97bbdf-23d8-4ead-8b77-8d58b1f3fa67",
        "title": "Why working from home looms large for voters like Jordan this election",
        "publish_date": "Fri, 25 Apr 2025 21:10:29 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Policies threatening the right to work from home in the public sector may have wider consequences at the ballot box this election.\n\nAfter Peter Dutton pushed forward with plans to force thousands of public service workers back into the office full-time if the Coalition won the election, the sanctity of hybrid work became a hot-button voter issue – so much so the opposition leader walked back the policy just one week into the campaign .\n\nJordan Carroll, 25, isn't a federal worker but he's among the voters who highly value workplace flexibility.\n\nREAD MORE: The major election promises Labor and the Coalition have made to try and win your vote\n\nJordan Carroll values a hybrid work policy far more than salary. (Supplied)\n\nCarroll left his 9-5 job at Commonwealth Bank to start his own business and isn't surprised voter sentiment would shift in favour of flexibility.\n\nHe quit CBA before it ordered workers to return to the office 50 per cent of the time and enjoyed a hybrid model while still working at the bank.\n\n\"Perceptions are changing in terms of what people want from their career,\" Caroll, who started his research company The Launch Crew after the COVID-19 pandemic, told 9news.com.au.\n\n\"People are realising that enjoyment of life doesn't just come from money, it comes from the social side of life… and you get more of that from flexibility at work.\"\n\nAccording to a survey conducted by Rippling, 42 per cent of people would re-consider joining a company if it expected full-time office attendance.\n\nMore than half of those surveyed also said they rank family-oriented benefits such as flexible hours and parental leave above all else, including salary.\n\nCarroll said he'd also likely choose the benefits of regular work from home over more money if he was job hunting again.\n\n\"The quality of life would reduce a lot [without WFH],\" he said.\n\n\"You can save money with more flexibility, spending less out on lunch, if you have kids you don't necessarily need childcare or you don't need to pay hideous rent in Sydney, I could live somewhere else a bit cheaper,\" he said.\n\nREAD MORE: Customer left confused after bank closes accounts with no warning or reason\n\nOpposition leader Peter Dutton walked back his plans to force federal workers back into the office. (James Brickwood)\n\nVice president and head﻿ of Rippling Matt Loop said hybrid work can feel like an eight per cent salary boost when you combine savings on commutes, parking and lunches.\n\n\"For many households, ditching the train fare or after-school care is worth more than a modest bump in base pay,\" he explained, referencing an estimate made by the International Monetary Fund .\n\nCarroll described Dutton's earlier vow to ban working from home for public sector workers as a \"kick in the teeth\".\n\nAnd Loop anticipates this reneged policy will still loom large over the federal election as Australians head to the polls, despite Dutton walking it back and insisting it would never have impacted private-sector employees.\n\n\"The debate around flexibility now extends far beyond just the workplace. When an issue shapes everyday life so strongly, it can become a key factor that affects voting decisions – like healthcare or economic policy,\" Loop said.\n\n\"Tough talk on WFH from public figures might play well to those who equate employee presence with effort, but it completely ignores where the mainstream sits.\n\n\"Recent events show how quickly sentiment can shift when policies appear out of step with workforce realities.\"\n\nRippling vice president Matt Loop said Dutton's WFH stance looms large this election. (Supplied)\n\nREAD MORE: Where Anthony Albanese and Peter Dutton have been on the campaign trail\n\nThe Australian Council of Trade Unions (ACTU) took aim at the Coalition's work-from-home stance before Dutton's backflip and said it would primarily hurt women in the workforce.﻿\n\n\"Peter Dutton's one-size-fits-all approach will take us backwards,\" ACTU president Michele O'Neil said.\n\n\"Having the freedom to work from home has helped a million extra women enter the workforce in the past four years.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/pope-francis-death-farewell-to-pope-francis-australian-tourists-among-thousands-queuing-to-say-goodbye/178577f8-ec82-4c65-9b59-1bd5fd0bf7c7",
        "title": "Solemnity and anticipation among thousands queuing to say goodbye to Pope Francis",
        "publish_date": "Fri, 25 Apr 2025 21:33:13 +0000",
        "category": "entertainment",
        "authors": [
            "Apr"
        ],
        "text": "As the sun sets over the Vatican City mere days after the death of Pope Francis , St Peter's Square is abuzz with pilgrims from all corners of the globe gathering to pay their respects to the late pontiff, who died on Easter Monday at the age of 88.\n\nA curious blend of solemnity and anticipation fills the air as I weave my way through the dense throng of Catholic mourners, tourists, and media from around the world.\n\nConversations in multiple languages hum in the background as the stoic crowd stands united in a shared moment of history, grappling not only with the loss of a deeply cherished spiritual leader, but also with the gravity of witnessing a moment that will echo through time.\n\nSt Peter's Square is abuzz with pilgrims from all corners of the globe. (Getty)\n\n\"It's a once-in-a-lifetime experience,\" Linda Coorey, who's travelling with fellow Australian Bernadette Lahood, says.\n\nThe pair, currently on holiday from Sydney, adjusted their itinerary to visit the Vatican in recognition of the impact Pope Francis had on their community.\n\n\"I think he was a particularly great pope, and certainly for our families, this is really important to pay our respects,\" Lahood adds.\n\n\"They wish they could also be here, but they're really glad that we're here and able to experience this and share that experience with them back home.\"\n\nREAD MORE: ﻿ Faithfuls pay final respects to Pope Francis as public viewing begins\n\nCrowds gather for procession of Pope's body View Gallery\n\nCrowds are enduring waits of up to six hours for a glimpse of Pope Francis's body, now lying in state beneath the majestic dome of St Peter's Basilica.\n\nThe basilica's great bell, Campanone, tolls solemnly, honouring the late pontiff in accordance with centuries-old tradition.\n\nThe sacred site remains open to the public day and night until the funeral tonight (AEST), allowing mourners from around the world to pay their final respects.\n\n\"It's worth it,\" Coorey says without hesitation.\n\nTo her, Pope Francis represented a leader who embraced everyone, regardless of their background.\n\n\"He was a people person - he loved being among ordinary people, not just dignitaries and politicians.\"\n\nFaithful are seen inside St Peter's Basilica to pay homage to the body of Pope Francis in Vatican City. (Getty)\n\nSimilarly for Lahood, the Pope's inclusive nature set him apart, bridging a gap between generations.\n\n\"For young Catholics in their formative years he's been a really good influence and been connected to all people, not just traditionalists, he's had a lot of appeal to the broader community, both Catholic and non-Catholic and I think he's been really vocal about issues that really represent how Christians should behave.\"\n\nInside the Basilica, I'm told it's an atmosphere of deep reverence and beauty as crowds silently shuffle past the open casket, rosaries in hand, to honour the man who led the Catholic Church for over a decade.\n\n\"Waiting outside was anxious and exhausting, but once I got in, it was beautiful,\" New Yorker Nancy Jiang says.\n\n\"I was just in St Peter's on Easter Saturday.\n\n\"Now going back in the evening and seeing everything lighten up, it was beautiful.\n\n\"Definitely worth the wait and lifetime experience.\"\n\nREAD MORE: ﻿ How the Pope spent his final hours and his last touching words to nurse\n\nCrowds are enduring waits of up to six hours for a glimpse of Pope Francis's body. (Claire Knight)\n\nRenowned for his humility, compassion, and reformist vision, Pope Francis — born Jorge Mario Bergoglio on December 17, 1936, in Buenos Aires — was the first Latin American and the first Jesuit to ascend to the papacy.\n\n\n\nAmong the many gathered in Rome today are South American Catholics, devoted followers of the late pontiff.\n\n\"The church is not just a European church, it's a world church,\" Brazilian Aducci Correia Kenig shares.\n\nHe's confident the same sense of diversity will continue with the next leader, who will be decided by an inner sanctum of cardinals in the coming weeks.\n\n\"It was very important for the church… Because we had this South American pope from another continent so people from China, Australia and other places, they think 'why not?\"\n\nREAD MORE: The youngest man to vote for a new pope is a Melbourne priest ﻿\n\nJung Nuns wait in St Peter's Square to pay their respects to Pope Francis. (Getty)\n\nThe pope's funeral will take place this Saturday, April 26, at 10am local time (6pm in Australia) in St Peter's Square, with global leaders including US President Donald Trump and Prince William expected to attend.\n\nTrue to his wishes for simplicity, Pope Francis will be buried in the Basilica of St Mary Major - a quieter, more humble resting place than some of his predecessors chose.\n\nAs the Vatican mourns, Catholics like Correia Kenig are hopeful that it's not the end, but an exciting new beginning for the church.\n\n\"The faith is reborn… believers are coming back to the church, new believers, I hope this new pope will make the faith stronger so those far away from the church can return.\"\n\nWhile a new pope is expected to be elected by mid-May, the focus for now remains on remembering a leader who touched lives across continents with a message of mercy, dignity, and hope.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/labubu-blind-box-pop-mart-craze-australia/61223e72-7c3d-4274-bacf-a87af4486baf",
        "title": "Aussie had to travel 6600km to get her hands on one of these 'creepy' little things",
        "publish_date": "Fri, 25 Apr 2025 21:10:11 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "From a distance, the fluffy figures on ﻿Ottilie Vaughan's bag look like children's toys.\n\nGet a little closer and you'll spot the sharp-toothed grins and intense expressions that mark them as something altogether different: a little \"monster\" named Labubu.\n\nDesigned by Hong Kong-born artist Kasing Lung and sold by Chinese toy company Pop Mart, Labubu is the latest viral obsession Gen Zs and Millennials can't get enough of.\n\nREAD MORE: How the Pope spent his final hours and his last touching words to nurse\n\nThese little \"monsters\" are Labubus, the latest viral obsession Gen Zs and Millennials can't get enough of. (Edward Berthelot/Getty )\n\nThe most popular toys are the keychain size, which typically retail for $32 at Pop Mart﻿ but can go for more than $100 on some resale sites because they're so hard to get.\n\nMassive lines form outside Pop Mart stores before they even open when new Labubu stock is due in, the online store is almost always sold out of the toys, and customers must adhere to a strict purchase limit to limit resale.\n\nAnd Australians who manage to get their hands on one of the \"creepy\" toys ﻿won't even know which one they've purchased until they open it, as Labubus are sold in a blind box format.\n\nEach one comes sealed in a box that could contain one of several \"normal\" versions of the toy or a very rare \"special\" version, which are coveted among collectors.\n\nThe blind box toy market is growing and its global value was estimated to be more than $21 ﻿billion in 2024, according to Cognitive Market Research.\n\nThe Australian market alone made up more than $260 million of that figure, suggesting that Aussies are more than willing to spend their hard-earned cash on the collectibles.\n\nTikTok videos of shoppers \"unboxing\" Labubu blind boxes can rack up hundreds of thousands of views. (TikTok)\n\nVideos of shoppers \"unboxing\" the toys can amass hundreds of thousands of views on social media, where 23-year-old Vaughan first discovered Labubus late last year.\n\nShe first spotted the toys on the handbags of fashion influencers, K-pop stars, and celebrities, then videos of the little monsters started popping up on her TikTok For You Page.\n\nThere are currently more than 1.2 million posts with the hashtag #labubu on the app and after watching just a fraction of them, ﻿Vaughan decided she \"needed\" a Labubu too.\n\nShe just had to find one.﻿\n\n\"I went looking for them all around Sydney city [but] I had no luck,\" she told 9news.com.au.\n\n\"I wasn't keen on buying second-hand, it's not as fun and also can be so expensive.\"\n\nEbay vendor wants $10,500 for this Aussie coin - is it worth it? View Gallery\n\nThere's also no guarantee that resold or second-hand Labubus are legitimate and fake toys – Lafufus, as they're sometimes called by fans –﻿ are common.\n\nLocal collectors reported that ﻿imitation Labubus were being sold at the Sydney Royal Easter Show﻿ this year, where local influencer Annie Nguyen recorded footage of what she claimed was a stall selling fake collectibles.\n\nTwo toys purchased at the stall for $35 each and sighted by 9news.com.au appeared to be imitation Labubus and featured details that didn't match the authentic product.\n\nREAD MORE: At least 26 dead after gunmen open fire on tourists in disputed Himalayan region\n\n﻿Imitation Labubus were allegedly being sold at the Sydney Royal Easter Show﻿ this year. (Instagram/@anniesbucketlist)\n\nVaughan's hunt for an elusive Labubu finally came to an end more than 6600km away in Malaysia, where she bought two for about $40 each from a store in Kuala Lumpur while on holiday.\n\n\"I couldn't resist,\" she said.\n\n\"They're hard to get, so even if you don't have a lot of money, if you can find one it feels necessary to buy.\"\n\nAnd she's not the only Australian who feels that way.﻿\n\nPop Mart, which is known for selling Labubu and other collectable blind box toys, has exploded across the country in the almost four years since it first arrived in Australia.\n\nIts Australian website and online store went live in October 2021, ﻿followed by a robo-shop (a retail location stocked with vending machines) in November and a pop-up store in December.\n\nThe first ﻿physical store opened in August 2022 and less than three years later, Pop Mart boasts 11 retail stores and 19 robo shops across the country.\n\nSelling everything from $20 Labubu phone charms to $1500 collectible statues of the monster, Pop Mart has done well by cashing in on the collectible craze Down Under.\n\nVaughan currently has two Labubu collectibles and a Cry Baby charm on her bag. (Supplied)\n\nAnd ﻿Vaughan doesn't see it dying down any time soon either, adding that she's not surprised young Australians are spending their cash on the viral toys even in a cost-of-living crisis.\n\n\"Everyone has given up on saving lots of money so we just buy trinkets for fun,\" she said.\n\nWith three Labubus currently adorning her favourite bag, ﻿the 23-year-old isn't actively searching for the toys anymore but hasn't ruled out buying more.\n\n\"If I saw one in a vending machine, I would probably buy it.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/she-knew-something-was-wrong-mums-warning-as-survival-rates-for-certain-cancers-stagnate/3c905b2d-03c5-4096-bfc4-872187e31d70",
        "title": "Jaime's tumour grew to 7cm before her doctors listened to her",
        "publish_date": "Fri, 25 Apr 2025 00:45:15 +0000",
        "category": "lifestyle",
        "authors": [
            "Apr"
        ],
        "text": "The mother of a NSW woman who died of cervical cancer has told how her daughter spent more than a year trying to get doctors to listen to her concerns.\n\nAmanda Ne'Roi is speaking out about her daughter Jaime's devastating case as three peak research organisations - the Australian New Zealand Gynaecological Oncology Group, Ovarian Cancer Australia and the Ovarian Cancer Research Foundation - join forces to call on the government to commit $100 million in funding towards gynaecological cancer.\n\nAround 19 Australian women a day are diagnosed with a gynaecological cancer, according to December 2024 statistics from the Australian Institute of Health and Welfare (AIHW).\n\nJaime Ne'Roi, pictured with her daughter Indiana. Jaime died in 2023 when Indiana was aged one. (Supplied)\n\nHowever, survival rates for gynaecological cancers have stagnated and fallen well behind improvements for other cancers, such as breast cancer.\n\nIn the 15 years between 1991–1995 and 2016–2020, the five-year survival rate for women with gynaecological cancers increased by just 6 per cent, compared with 13 per cent for breast cancer, the AIHW data shows.\n\nNe'Roi said Jaime knew something was not right a few months after she gave birth to her second child, Indiana, in May 2020.\n\n\"She was having spotting, discharge, and an upset stomach. She felt sick. She just knew something was wrong,\" Ne'Roi said.\n\nJaime went to her GP, who referred her to a gynaecologist she had seen a decade earlier, when abnormal cells were detected on her cervix.\n\nAt the time, the gynaecologist decided against a hysterectomy because she was yet to have children.\n\nNe'Roi said the gynecologist dismissed her daughter's symptoms because she had recently given birth.\n\n\"He said it was just because she had a baby. He didn't even give her a pap smear test,\" Ne'Roi said.\n\nIt took her daughter Jaime more than a year for doctors to listen to her concerns, her mother Amanda Ne'Roi said. (Supplied)\n\nJaime then went to another gynaecologist, who also attributed the symptoms to her having had a baby and put her on the contraceptive pill, Ne'Roi said.\n\n\"She kept saying to them, there's something very wrong.\"\n\nNe'Roi said she remembered having conversations with Jaime, who was very worried, and telling her to go back to the gynaecologist.\n\nAfter another visit, the gynaecologist agreed to do an internal examination via a laparoscopy in August 2021, which revealed Jaime had stage 3 cervical cancer at the age of 37.\n\n\"By the time she actually got a doctor to listen, she had a seven-centimetre tumour and it was inoperable,\" Ne'Roi said.\n\nJaime underwent radiation and chemotherapy, and briefly received good news in December 2021, when a scan showed up clear.\n\nHowever, by February 2022 the cancer was back and had spread to her uterus and lymph nodes.\n\nA hysterectomy and more chemotherapy and radiation followed, but Jaime's health was deteriorating fast.\n\nThe last option presented by Jaime's doctors was immunotherapy, however, the family was told it would need to foot the bill at a cost of $6000 a fortnight.\n\n\"My husband and I were looking at selling up our property, everything - so were her brothers,\" Ne'Roi said.\n\nWith the money needed immediately, however, the family started an online fundraiser, which allowed Jaime to start the treatment.\n\nThe treatment was not unsuccessful and Jaime died in July 2023, just under two years after she was first diagnosed.\n\nShe left behind her partner and two children, Harrison, then aged six, and Indiana, aged one.\n\n\"The hardest thing I've had to do in my whole entire life was to tell my grandson his mum had gone,\" Ne'Roi said.\n\n\"He burst into tears and said, 'I just want my mommy back.'\"\n\nJaime Ne'Roi died two years after she was diagnosed with stage three cervical cancer. (Supplied)\n\nRates of cervical cancer have been increasing in Australia, despite the national rollout of the HPV vaccine in 2007, which provides some protection against the cancer-causing virus.\n\nBetween 2000 and 2024, incidence rates of cervical cancer have climbed from 5.5 cases per 100,000 people to 8, AIHW data shows.\n\nNe'Roi said Jaime had been vaccinated for HPV, which showed why women should not become complacent about the disease.\n\n\"I think the trouble is, people become very complacent about gynecological cancers, they aren't mentioned much. Breast cancer is huge,\" Ne'Roi said.\n\n\"I'm sharing this story to illustrate the hidden crisis impacting all Australian women, because it can hit any one of us at any time.\"\n\nMore money was desperately needed for research for all gynecological cancers, Ne'Roi said.\n\nProfessor Clare Scott, Australia New Zealand Gynaecological Oncology Group (ANZGOG) chair, said gynecological cancers had been left underfunded for decades and were a hidden crisis that was expected to grow.\n\nGynecological cancers - which include uterine, ovarian and cervical cancers - are predicted to surge by 21 per cent over the next 10 years.\n\n\"For too long, gynaecological cancers have been overlooked and underfunded, leaving women with limited treatment options and unacceptable survival rates,\" Scott said.\n\n\"These are not just statistics - they are our mothers, sisters, daughters, wives, and friends... we must do better.\"\n\nANZGOG, along with Ovarian Cancer Australia and the Ovarian Cancer Research Foundation, are seeking $100 million in federal government funding over four years to go towards more personalised treatments for patients, clinical education, a national research databank and drug trials.\n\n\"The survival rates for gynaecological cancers have barely changed in decades. That fact alone should be a wake-up call,\" Ovarian Cancer Research Foundation CEO Robin Penty said.\n\n\"We know that the answers are there – they lie in research and in better understanding of women's bodies and women's pain. To reveal them we need appropriate and proportionate investment.\"\n\nA spokesperson for Health Minister Mark Butler said he would continue discussions with the ANZGOG about their proposal.\n\n\"The Albanese Labor government is doing all we can to support patients, families, loved ones and carers on the cancer journey,\" the spokesperson said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/albanese-coy-on-russian-military-request/105219356",
        "title": "Albanese coy on Russian military request amid defence spending row",
        "publish_date": "Sat, 26 Apr 2025 01:46:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese has declined to expand on his hint that Australia knew in advance about a rejected Russian request to base military aircraft in Indonesia.\n\nThe prime minister has been reluctant to discuss the specifics of that request since it became an election issue in the third week of the campaign, following a media report from defence outlet Janes.\n\nBut in an interview with The Australian newspaper published on Saturday, Mr Albanese appeared to confirm he did have prior knowledge of Russia's advance, alluding to \"intelligence\" as he asserted that Indonesia had shut the matter down \"very quickly\".\n\nSpeaking to reporters on Saturday morning, the PM would not repeat that suggestion, saying he could not confirm knowledge that a request had been made.\n\n\"What I can do and confirm is that there have been reports of that, and that the reports of that are not surprising … It's not surprising that the Russian ambassador to Indonesia wants to talk up Russian influence in the region,\" he said.\n\nOpposition Leader Peter Dutton was forced to concede an error last week when he wrongly claimed the Indonesian President had confirmed the reports, prompting accusations from Labor that he was \"loose\".\n\nMr Albanese said on Saturday the \"verballing of the president of Indonesia by the alternative prime minister of Australia\" was \"frankly shocking\".\n\n\"You can't go around when you… might be in a position of authority in eight days' time and think that it's ok to just shoot from the hip and say what you like about our international partners. That's what they have done in this campaign.\"\n\nDutton adds detail to defence announcement\n\nMr Dutton has argued the fact of a request points to the Albanese government's \"weakness\" on diplomacy and defence, as he pitches an expansion of defence funding to three per cent of Australia's GDP within a decade.\n\n\"We believe very strongly in investing more into defence [and] doing it responsibly,\" he told reporters on Saturday.\n\nThe Coalition added more detail to its promise of an extra $21 billion over five years after it attracted Labor criticism for declining to specify how the extra money would be spent.\n\nA policy statement uploaded the Liberal Party website indicates a focus on \"projects that rapidly increase Australia's strike and counter-strike capabilities\", including \"missiles, drones, and uncrewed undersea vessels\".\n\nPeter Dutton's party added some detail to its defence policy commitments on Saturday. (ABC News: Ian Cutmore)\n\nThe opposition also proposes an \"immediate\" summit of experts, more investment in AUKUS, and efforts to boost recruiting and retention.\n\n\"We need to pay for the AUKUS submarine deal,\" Mr Dutton said.\n\n\"Labor hasn't put any money into that program, and that's why the morale is plummeting under this government in the Defence Force… They know tat Army has been cannibalised to pay for AUKUS, and it shouldn't be like that.\"\n\nMr Dutton said specific details about spending would be worked out in government.\n\n\"There's a lot of money that we spend in defence at the moment that I think can be spent more efficiently, and the capability that we need to acquire, we can base that on decisions of experts and the advice of the departments,\" he said.\n\nMr Albanese said the Coalition's defence policy was a \"mystery tour… You buy a ticket and you don't know where it's going…\n\n\"They can't say where the money is coming from and what it will be spent on.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/tjuntjuntjara-wants-help-for-smokers-to-quit/105195032",
        "title": "Remote community wants help for smokers to quit amid high tobacco price",
        "publish_date": "Sat, 26 Apr 2025 00:53:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Michael Stevens has gone a long time without a cigarette.\n\nThe Spinifex man has worked as a health practitioner in the remote community of Tjuntjuntjara, 1,300 kilometres east of Perth, for a decade.\n\nAmong the countless challenges he faces — from resourcing, to chronic illnesses, to his vehicles' broken windows — is the region's incredible rate of smoking.\n\n\"I used to smoke. Not anymore,\" he says.\n\n\" I don't know why people smoke. \"\n\nTjuntjuntjara is one of Australia's most remote communities. (ABC News: Sharon Gordon)\n\nAcross Australia, about 8.8 per cent of adults smoke every day.\n\nIn remote First Nations communities, the figure shoots to 46 per cent.\n\nBut in Tjuntjuntjara, community leaders fear smoking rates are far higher.\n\n\"There'd be over 70 per cent of people who smoke in Tjuntjuntjara,\" community chief executive Jon Lark estimates.\n\nHe says the community urgently needs support to lower smoking rates, improve health outcomes and reduce reliance on some of the most expensive cigarettes in the country.\n\nAbout 70 per cent of adults are daily smokers in Tjuntjuntjara, locals believe. (ABC Goldfields: Katrina Tap)\n\nSmoking costs 45 per cent more\n\nSmoking causes 37 per cent of all First Nations deaths across Australia, and half of deaths in people aged 45 years and over, according to federal government data.\n\nBut Mr Lark says figures from Tjuntjuntjarra's community store highlight another problem.\n\n\" People spend nine times the amount on tobacco and cigarettes than they do on fresh fruit and vegetables. \"\n\nWhen the ABC visited Tjuntjuntjara's one shop early this month, a 30 gram pouch of tobacco cost $114 and a packet of 20 cigarettes cost $56.\n\nThe prices were more than 45 per cent higher than a major supermarket, where similar products were $79 and $38 respectively.\n\nLawrence Minning says cigarettes are too expensive in Tjuntjuntjara. (ABC Esperance: Emily Smith)\n\nStanding outside the store, local Lawrence Minning says prices were a concern in the community.\n\n\"It's too dear for smoke,\" he says.\n\n\"Smokes cost a hundred and something [dollars]. How come?\"\n\nMr Lark puts it down to enormous freight costs on top of federal government taxes.\n\nSpinifex woman Donna Marie Brown says the costs give rise to social issues, with younger residents \"humbugging\" elders for money to buy tobacco or people going without proper food, to instead buy smoking products.\n\nDonna Marie Brown says smoking causes social issues in Tjuntjuntjara. (ABC Goldfields: Katrina Tap)\n\n\"They just buy a pie or cool drink,\" she says.\n\n\"That's not going to last them a few weeks.\"\n\nMs Brown says a lot of people want to quit.\n\n'It's hard to give up'\n\nStephen Farrington, a remote area nurse practitioner with the Spinifex Health Service in Tjuntjuntjara, says nicotine patches and gum are available at the clinic, but they are often ineffective.\n\n\"It's so social that someone will come and offer them a cigarette and they go, 'Oh, it's only one,'\" he says.\n\n\"And then they're back onto it again. So it's hard to give up.\n\n\"But yeah, the cost is just phenomenal, considering incomes.\n\n\" It's probably close to a third [of people's] incomes. \"\n\nStephen Farrington says the community has almost zero mental health support. (ABC Esperance: Emily Smith)\n\nThe federal government funds the national Tackling Indigenous Smoking program, which provides a \"locally tailored and First Nations-led mix of activities to reduce smoking and vaping prevalence among First Nations people\".\n\nThe program's website says although remote First Nations communities have seen little change in daily smoking rates, there has been an uptick in attempts to quit and fewer young people are taking up the habit.\n\nThe Kalgoorlie-based Bega Garnbirringu Health Service received $1.7 million to deliver the program in WA's Goldfields.\n\nA federal government spokesperson says the program was delivered in Tjuntjuntjara at some point early last year, but provided no further details.\n\nBut Jon Lark does not believe any of the program's elements were delivered in the community.\n\nBega Garnbirringu did not respond to requests for comment.\n\nIt's estimated people spend as much as a third of their incomes on tobacco. (ABC Esperance: Emily Smith)\n\nMr Farrington says the community's lack of mental health support adds to the problem.\n\n\"We've got no visiting psychiatrist to make [a] diagnosis,\" he says.\n\n\"We've got no visiting mental health nurses to support us with our day-to-day maintenance of these people.\n\n\" We basically fly alone. \"\n\nA WA Department of Health spokesperson says WA Quitline has dedicated Aboriginal counsellors who provide culturally safe, non-judgemental support.\n\nFederal Labor's last budget committed $141.2 million to expand the Tackling Indigenous Smoking Program, $29.5 million to expand programs designed to help people quit and $63.4 million for smoking and vaping public health campaigns over the forward estimates period.\n\nThe Coalition says if elected, it would be committed to promoting the health of Indigenous Australians, especially those in remote communities.\n\nTjuntjuntjara is in the Great Victoria Desert. (ABC Goldfields: Katrina Tap)\n\n\"That is why we are investing in outcomes-based health services for marginalised Indigenous Australians,\" a spokesperson says.\n\nThey said they would commit $500 million for mental health support and double the mental health sessions from 10 to 20 per year.\n\nBlack market cigarettes reduce tax\n\nThe federal government's tobacco excise, which results in higher cigarette prices, helps pay for health services and treatments for tobacco-related illnesses.\n\nBut this year, the tobacco tax take will be almost $7 billion less than expected, due to the booming trade in illegal, black market cigarettes.\n\nA sign in the Tjuntjuntjara store warns tobacco prices will rise further. (ABC Esperance: Emily Smith)\n\nAsked whether this meant less money was available for quit programs, the ABC was told funding earmarked to reduce smoking was not dependent on a specific amount of tobacco excise being collected.\n\nStakeholders say the tax is widely recognised as one of the most effective ways to reduce smoking prevalence.\n\nMr Stevens has not had a cigarette in a long time. (ABC Esperance: Emily Smith)\n\nMr Stevens says it certainly deterred him.\n\n\"I used to smoke, but I don't smoke no more,\" he says.\n\n\"[There were] too much people asking [for smokes].\n\n\" And it cost too much money. \"\n\nMr Lark points out smoking rates have fallen dramatically across wider Australia in recent decades, indicating its public health campaigns are working.\n\nHe just wishes more of them were available in his remote community.\n\nJon Lark wants more funding for programs to help people quit smoking. (ABC Goldfields: Jarrod Lucas)\n\n\"We're so far behind in trying to catch up with the rest of Australia,\" Mr Lark says.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/afl-cats-back-bailey-smith-ahead-of-blues-clash/105219198",
        "title": "Cats back 'energetic guy' Smith as Blues test looms",
        "publish_date": "Fri, 25 Apr 2025 23:39:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Geelong defender Zach Guthrie has urged teammate Bailey Smith to continue playing on the edge, provided the high-profile midfielder's on-field antics do not become a distraction for the club.\n\nSmith has been in the spotlight since joining the Cats from the Western Bulldogs, mostly for the right reasons.\n\nBut minor indiscretions have threatened to divert his focus at times, ahead of Sunday's match with Carlton at the MCG.\n\nCats star awaits AFL fine Photo shows Bailey Smith gives double middle fingers to a fan after the Geelong Cats' win over Adelaide Crows. Geelong star Bailey Smith is waiting to see how much he will be fined for flipping off a fan in Adelaide after the Cats' win over the Crows.\n\nSmith has twice been fined for obscene hand gestures directed at opposition supporters this month and was also charged with misconduct for slamming a ball into Hawthorn player Jarman Impey's head.\n\nThe 24-year-old's individuality has been celebrated by Geelong, with coach Chris Scott among those railing against suggestions the Cats' boom acquisition should tone it down.\n\n\"That's his personality,\" Guthrie said.\n\n\"He's a very energetic guy and as long as his mind is still on task and he's playing the right way and helping the team, which he's been doing with his play out on the field, then I'm fine with it.\n\n\"Every individual's got a different way they go about it and that's his.\n\n\"But he's able to perform for us and that's the most important thing.\"\n\nSmith, who played 103 matches with the Bulldogs, spent the 2024 season on the sidelines with a knee injury before joining the Cats during last year's trade period.\n\nHe has formed a potent partnership with fellow Geelong dasher Max Holmes.\n\nIn five appearances with the Cats, Smith is averaging career-best numbers of 29.6 disposals, 11.6 contested possessions, 5.4 clearances and 5.2 tackles per match.\n\nGeelong's ability to walk the Bailey Smith tightrope could lead to premiership Photo shows Bailey Smith extends his arms In the heat of Geelong's epic battle with Hawthorn, a subtle interaction between Bailey Smith and a teammate gave an insight into how he has been able to slot into his new club so well.\n\n\"He's been huge. He provides that run, which is really good, and he's obviously a really good inside player as well,\" Guthrie said.\n\n\"So to have that balance and him working in tandem with Max Holmes through the midfield has been great for us.\n\n\"He brings plenty of energy and I think him and Max are going to be really important players for us for many years.\"\n\nThe Cats have lost Gryan Miers (concussion) and Mitch Knevitt (foot injury), and dropped Ted Clohesy, as they seek to continue a strong start to the season with a fourth straight win.\n\nOisin Mullin, Oliver Wiltshire and Jhye Clark have been called up.\n\nCarlton welcomes back Harry McKay after a week out with concussion in place of Lewis Young.\n\nAfter a horror 0-4 start to the season, the Blues have steadied with wins over West Coast and North Melbourne.\n\nThe Cats are provisionally fifth on the ladder as round seven continues, while the Blues are in 13th place.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/calls-for-better-youth-mental-health-access-ahead-of-election/105206964",
        "title": "Mental health support for Brooke's kids will win her vote",
        "publish_date": "Fri, 25 Apr 2025 23:12:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Like many Australians, Brooke Bottrell has been fairly tuned out of this federal election.\n\nThe Coffs Harbour mother has had little capacity for politics as she tries to find medical specialists and support for her stepdaughter and son.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nHer 10-year-old stepdaughter was seeing youth mental health organisation headspace locally, before being categorised as too complex for the service.\n\nMs Bottrell's kids have struggled to access mental health services in Coffs Harbour. (ABC Coffs Coast: Claire Simmonds)\n\n\"[She] has been through body shaming and suicidal thoughts,\" Ms Bottrell said.\n\n\"Once you add autism on top of that, there's really no services available.\"\n\nSupport for young people and families The Butterfly Foundation: National helpline 1800 ED HOPE (1800 33 4673), 8am-midnight (AEST/AEDT), 7 days a week\n\nReachOut Australia: Confidential online peer support for young people and online resources for wellbeing\n\nHeadspace: Centres in each state and territory or check out eheadspace for online support\n\nThe Kids Helpline: 24-hour support on 1800 55 1800\n\nLifeline: 24-hour support for all Australians on 13 11 14\n\nMeanwhile Ms Bottrell said it took her two years to get her now 11-year-old son into a child psychologist, only to have the specialist relocate to Port Macquarie, more than 150 kilometres away.\n\nHer son's ongoing treatment is now done via telehealth.\n\nMs Bottrell said accessing mental health care had been a drawn-out battle, and was an issue should would like to see addressed by both sides of politics.\n\n\"The cost is huge. You can't access the services through the public system because we just don't have them,\" Ms Bottrell said.\n\nIn the hotly contested NSW regional electorate of Cowper, access to youth mental healthcare services has become a key topic.\n\nAccess to health care and mental health were two of the top three issues for the electorate of Cowper, along with housing affordability and homelessness, in a pre-election survey conducted by the Salvation Army.\n\nGaps in care\n\nAccording to the Australian Institute of Health and Welfare, about one in seven young people experienced a mental health disorder in the past 12 months.\n\nThe clinical lead at headspace Coffs Harbour, Emily Fraser, said young people in Cowper and regional areas struggled to access affordable care due to a lack of specialists.\n\nEmily Fraser says there are gaps in access to mental health care. (ABC Coffs Coast: Claire Simmonds)\n\n\"One of the gaps we're seeing a lot is for ADHD and autism assessments, which require a specialist report from a psychiatrist or paediatrician,\" Ms Fraser said.\n\n\"There's also limited access to GPs that prescribe medication for ADHD. There's a couple that do, but outside of them, its like [finding] hen's teeth.\"\n\nWhile headspace helps a large proportion with its free early intervention model of care for 12–25 year olds, there are young people who fall outside what they offer.\n\nCoffs Harbour-based clinical psychologist Basia Radlinska says local children under 12 can wait up to two years to get mental health support.\n\n\"If you want to know what it's like to wait for mental healthcare, try to get a kid under the age of 10 in for an assessment,\" Dr Radlinska said.\n\nBasia Radlinska says children under 12 who need a psychiatric assessment can wait for up to two years. (ABC Coffs Coast: Claire Simmonds)\n\nPolicies for the 'missing middle'\n\nMeet the people falling through the gaps of the mental health care system Photo shows Several people gather in a crowd People with complex and ongoing mental health needs say the health system is letting them down.\n\nThe \"missing middle\" — young people whose mental health care sit somewhere between early intervention and acute needs — is a focus for local candidates running for the seat.\n\nSitting Nationals MP Pat Conaghan said he had experienced the issue first hand.\n\n\"I know close friends that have had to go to Queensland to get their child assessed for autism and ADHD,\" Mr Conaghan said.\n\nPat Conaghan says a Coalition government would put $100 million into regional healthcare. (ABC Coffs Coast: Toby Hemmings)\n\nThe Coalition has committed to invest $400 million specifically into youth mental health, which will include increasing the capacity of headspace centres and reinstating 20 Medicare-subsidised psychology sessions per year.\n\nDr Radlinska said expansions to headspace were crucial to helping meet the needs of young people.\n\n\"[Headspace] doesn't serve youth who might have more complex mental health difficulties or who have been engaged with the system already,\" she said.\n\nLabor candidate for Cowper Greg Vigors says his party has promised similar measures in its billion-dollar mental health care election commitment, including opening new Medicare mental health centres across the country.\n\nGreg Vigors says Labor will commit a billion dollars to mental healthcare. (ABC Coffs Coast: Claire Simmonds)\n\nIndependent candidate for Cowper and former nurse Caz Heise said if elected, she would support restoring access to a minimum of 20 mental health sessions per calendar year.\n\n\" We've got a community where the statistics around mental health are getting worse not better, and where we haven't had a focus to actually nip this in the bud. \"\n\nCaz Heise says if elected, she'll lobby for 20 Medicare-subsidised mental health sessions to be reinstated. (Supplied)\n\nDr Radlinska said while it was positive to see all the political parties talking about putting more money into youth mental health, the promise of more Medicare mental health centres from Labor was particularly appealing.\n\n\"We've had one in Coffs Harbour for the last six months and its already going really well,\" Dr Radlinska said.\n\n\"It looks like Labor are focusing more on expanding services to address the 'missing middle.'\"\n\nHave Your Say: What matters to you this federal election? Photo shows A graphic showing a range of reader comments about potential issues in Australia's 2025 federal election. What do you need to know before you vote in the upcoming federal election? What would you ask the candidates? Have Your Say.\n\nBrooke Bottrell hopes that whoever is elected advocates for more training and funding for services in regional areas.\n\n\"The area needs a lot of mental health services implemented and a lot of funding brought in to be able to support us,\" she said.\n\n\"If I can see anyone that's going to bring that to the party, then they would definitely get my vote.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/madrid-open-alexei-popyrin-daria-kasatkina-chris-o-connell/105219134",
        "title": "Aussies produce mixed fortunes at Madrid Open",
        "publish_date": "Fri, 25 Apr 2025 22:58:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alexei Popyrin and Chris O'Connell have been knocked out of the Madrid Open, with Australia's hopes in the men's draw now resting on Alex de Minaur.\n\nBut Daria Kasatkina won her first match in Europe since switching allegiance to Australia, beating American Alycia Parks in the women's tournament.\n\nPopyrin's hopes of a deep run crumbled in the round of 64 as the 25th seed posted a 6-4, 7-6 (7/4) loss to Kazakh Alexander Bublik.\n\nO'Connell, who won his opening match earlier in the tournament, fell to third seed Taylor Fritz, with the US Open finalist outplaying the Sydneysider 6-1, 6-4.\n\nThe results leave world number seven de Minaur as the sole Australian in the men's draw.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nAfter a first-round bye, de Minaur will face Italian world number 43 Lorenzo Sonego on the main Manolo Santana Stadium court.\n\nRussia-born Kasatkina, the world number 14, was not at her sharpest in the second round but was still far too good for Parks, winning 6-2, 7-5.\n\nKasatkina, the only Australian representative left in the women's event, is at her strongest on clay and will face a much sterner test against Russian 22nd seed Ekaterina Alexandrova in the round of 32.\n\nAlexandrova defeated Serbian Olga Danilović 6-3, 6-4 to remain in the tournament.\n\nWorld number one Aryna Sabalenka, winner in Madrid in 2021 and 2023, overpowered Russia's Anna Blinkova 6-3, 6-4.\n\nThird seed Jessica Pegula beat German Eva Lys 6-2, 6-2 for her tour-leading 27th victory of the year.\n\nBut there was a shock with Russian world number 39 Anastasia Potapova upsetting China's Olympic champion, eighth seed Qinwen Zheng, 6-4, 6-4.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/tas-bridgewater-material-institute-kitchen-opens-for-students/105202668",
        "title": "Social enterprise kitchen hopes to inspire kids to cook and eat well",
        "publish_date": "Fri, 25 Apr 2025 22:53:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "In Hobart's outer suburbs, busy hands are making light work of a harvest of cucamelons — a slightly sour, crisp fruit with the look of a mini watermelon, but the taste of a cucumber.\n\nBut as the pile builds up, alongside freshly plucked cherry tomatoes, it doesn't have far to be transported before it can be turned into a delicious dish thanks to the recent opening of a brand new commercial kitchen, just a few metres away.\n\nThe kitchen is the latest addition to the Bridgewater-based base of social enterprise charity Material Institute.\n\nWith the site already home to a science beauty lab and market garden, the kitchen has been designed to give students hands-on experience preparing and cooking healthy meals with all the necessary equipment.\n\nRoughly 30 students a week will make use of the kitchen, a number Material Institute is hopeful will continue to grow. (ABC News: Luke Bowden)\n\n\"This is the fruition of a long-term plan,\" Amelia Clifford, the relationships manager at Material Institute, said.\n\nCurrently, the charity runs food education program 24 Carrot Gardens in 24 Tasmanian schools, mostly in the state's south.\n\nWhile largely run within the schools, the program also includes students coming to the Bridgewater site for workshops — but until now, all the cooking has had to occur outside, limiting the options.\n\nWith this purpose-built kitchen, new opportunities for the students would open up, Ms Clifford said.\n\nStudents going through the market garden have been sharing what they've learned — with the 'cuteamelons' a crowd favourite. (ABC News: Luke Bowden)\n\n\"An immersive approach in a professional kitchen will be more impactful through first-hand participant experience of the seed-to-plate journey, harvesting food from the gardens only metres away,\" she said.\n\n\" It will expand the students' skills … by being in a different type of cooking environment. So, professionally set up, engaging with community, serving and supporting. \"\n\nIt will be used by roughly 30 students a week for the workshops, and the team hopes the infrastructure will also encourage more schools to get involved.\n\nThe kitchen will also be used for food preparation and catering for local community events.\n\nSetting up healthy habits early\n\nTasmanian Community Fund chairperson Ric de Santi with Material Institute horticulturalist Louise Sales. (ABC News: Luke Bowden)\n\nThe construction of the kitchen was aided by a grant from the Tasmanian Community Fund, which said it was exactly the kind of project it seeks to support.\n\n\"It's fabulous — to be able to grow the food, cook it in a commercial kitchen environment and then share it,\" chairperson Ric de Santi said.\n\n\" It teaches you skills that hopefully inspires some of the children to look at food and beverage or hospitality careers, of which there's plenty of opportunity in Tasmania. \"\n\nStudents will be shown how to harvest vegetables from the on-site market garden, and turn them into tasty dishes to share. (ABC News: Luke Bowden)\n\nMr de Santi said setting up healthy habits early and teaching students about where their food came from was vital for setting up \"healthy habits into the future\".\n\n\"This project brings young people, children, family and the community together around growing, preparing and sharing healthy and nutritious, affordable food.\"\n\nMore plans on the horizon\n\nWhile initially the kitchen will be put to use for school workshops and existing public event offerings, Ms Clifford said its purpose would not end there.\n\nShe said there were also opportunities to engage older high school students who were looking for pathways beyond the classroom, with formal hospitality training and apprenticeships.\n\nMs Clifford said having a space where young people could get a glimpse at what a career in the sector could look like, and to learn under industry professionals, was \"essential\".\n\n\" It gives exposure to all different opportunities and different professionals in the space, different people they can interact with and things to look forward to in their future life as adults. \"\n\nKirsha Kaechele (centre) wants children to be inspired by the kitchen. (ABC News: Luke Bowden)\n\nThe 'beauty laboratory' teaching teenagers science by stealth Photo shows Three people in a science class. When Kirsha Kaechele randomly surveyed a group of teenagers about their interests, she was surprised to hear \"beauty\" topped their lists. It inspired her to build a lab that teaches science through beauty products.\n\nCharity founder Kirsha Kaechele — who is also an artist and curator at Tasmania's Museum of Old and New Art (MONA) and wife of owner David Walsh — said she wanted the kitchen to be a place that students could be proud to access.\n\nShe said ensuring it was aesthetically beautiful and that the students felt they were actively contributing to the program was a key part of that.\n\n\"I want them to be inspired. I want them to feel proud, I want them to walk in and say 'wow' and then take charge — just take over and run the place,\" Ms Kaechele said.\n\nDown the line, a future goal is also to open up the space more broadly to the public as a social enterprise cafe.\n\n\"The idea is to really lift young people up and give them the opportunity to build real skills — running a business, preparing the food, hospitality, just all aspects of what a cafe has to offer,\" Ms Kaechele said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/valerie-the-dachshund-found-safe-after-529-days-lost/105176940",
        "title": "Missing sausage dog 'finally safe' after 17 months on island",
        "publish_date": "Fri, 25 Apr 2025 22:43:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "A beloved miniature dachshund who disappeared on a South Australian island 529 days ago has been found safe and well by wildlife rescuers.\n\nValerie the dachshund vanished a year-and-a-half ago on Kangaroo Island, with Kangala Wildlife Rescue working \"around the clock\" in recent weeks to bring her home.\n\nOn Friday night, they announced Valerie had finally been rescued.\n\n\"After weeks of tireless efforts by Kangala Wildlife Rescue volunteers and partner organisations, Valerie has been safely rescued and is fit and well,\" they said in a social media post.\n\n\" We are absolutely thrilled and deeply relieved that Valerie is finally safe and able to begin her transition back to her loving parents, Josh and Georgia. \"\n\nValerie the dachshund has been found after 529 days in the wilderness. (Supplied: Facebook)\n\nOwner Georgia Gardner expressed her relief on social media.\n\n\"For anyone who’s ever lost a pet, your feelings are valid and never give up hope,\" she said in a post.\n\n\"Sometimes good things happen to good people.\n\n\"Incredibly grateful for Kangala Wildlife Rescue, the Kangaroo Island community, our friends, family and everyone who has contributed their support to rescue Val.\n\n\" We'll see you soon Valerie. \"\n\nJosh Fishlock and Georgia Gardner with their dog, Valerie who went missing on Kangaroo Island.\n\nSearch for Valerie takes 1,000 volunteer hours\n\nKangala Wildlife Rescue said the search for Valerie involved more than 1,000 volunteer hours and roughly 5,000 kilometres travelled.\n\nThe local team set up a \"rescue site\" which included cameras and a trap with a \"remote door system\".\n\nThey said the main focus was Valerie's safety and mental health, \"doing everything we can to make the transition back home as stress free as possible\".\n\nThe team set up the large dog trap like \"her own little room\", furnishing it with Valerie's toys and bed from home, her mum's clothing, hidden food and challenges to keep her entertained.\n\nValerie was lost on Kangaroo Island. (Supplied: Facebook)\n\n\"The plan is to unlock a few of these memories that have been temporarily locked away since she's been in survival mode,\" the rescue team said earlier this week in a post.\n\n\"We have seen an amazing change in Valerie's [demeanour] recently as she begins to remember all those familiar smells, tastes and sounds.\"\n\nIsland a 'perfect oasis' for Valerie\n\nThe wildlife rescue said Kangaroo Island was a \"perfect oasis\" for Valerie's survival, with abundant overhead cover and many hiding spots to protect her in extreme weather.\n\n\"While it’s been a great area for little Valerie, you can certainly see why this rescue has been challenging and keeping everyone on their toes,\" they said in a social post.\n\nKangala Wildlife Rescue found Valerie. (Supplied: Facebook)\n\nKangala Wildlife Rescue said Valerie would often drop in to the rescue site, before wandering off for days.\n\nThey said the \"abundance of wildlife\" and Valerie's constantly changing schedule meant it had been \"impossible\" to safely secure the dachshund using their normal trapping methods, so they installed a remote trigger system instead.\n\n\"This rescue was a true testament to the dedication and perseverance of our team, the unwavering support of the community, and the power of collaboration,\" the team said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/nt-communities-waiting-for-federal-labor-housing-promise/105151102",
        "title": "From a tin shed in remote Binjari, Olivia waits on a $4bn housing promise",
        "publish_date": "Fri, 25 Apr 2025 22:42:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than a year ago, Prime Minister Anthony Albanese visited the remote Aboriginal community of Binjari to announce $4 billion for remote housing.\n\nBut since then the community have yet to see a single new home built.\n\nBinjari, located around 16 kilometres west of Katherine, is one of more than 80 Aboriginal communities dotted across the NT and, like many, it is struggling with chronic overcrowding.\n\nDebbie Aloisi says housing is the first step to advancement for her community and its children. (ABC News: Pete Garnish)\n\nLifelong resident Olivia Raymond vividly remembers the day the prime minister visited town, pleading for help with her home which she said was no longer liveable.\n\n\"It's falling apart … when it rains mould comes from underneath and mosquitoes, and we barely sleep at night,\" she said.\n\nOlivia Raymond says it's disappointing when politicians promise change and then \"down the track you see nothing happening\". (ABC News: Pete Garnish)\n\nDuring his March 2024 visit, Mr Albanese promised a landmark $4 billion to address overcrowding and improve the standard of remote housing across the NT.\n\nPM announces $4 billion NT remote housing package Photo shows a caucasian man wearing a pink collared shirt talking Prime Minister Anthony Albanese has announced the 10-year agreement, which is expected to see up to 270 homes built each year, during a visit to the territory.\n\nMr Albanese said the government was committed to closing the gap, labelling the announcement a \"proud day\" for the government and a turning point for Aboriginal communities.\n\nBut since then, no new homes have been built in Binjari and community members said they feel let down.\n\nDanielle Raymond lives in the two-bedroom unit where Mr Albanese made the landmark funding promise and said growing families are desperate for more space.\n\nBinjari resident Danielle Raymond and her family. (ABC News: Olivana Lathouris)\n\n\"They said they were going to build more houses but nothing, we're still waiting,\" she said.\n\nThe remote NT community of Binjari, where the Albanese government announced $4 billion for remote housing in 2024, has yet to receive a single new house. (ABC News: Pete Garnish)\n\nWhere is the money going?\n\nThe $4 billion remote housing agreement between the federal and NT governments aims to fund 2,700 new homes over the next decade, or 270 homes each year.\n\nAccording to the NT government, which oversees the spending, $107.7 million has been spent so far on capital works with 125 new or refurbished homes delivered across 28 remote locations.\n\nBinjari isn't one of them.\n\nBetween July and February, an additional $24 million has been spent on repairs and maintenance on remote homes.\n\nThe NT government said the focus for the first year of the 10-year agreement was to identify communities with the greatest need.\n\nThe Binjari community continues to experience overcrowding, with no new homes built in the community since the Albanese government's 2024 promise. (ABC News: Pete Garnish)\n\n'We're worse off than we were'\n\nThe NT has the highest rate of overcrowding in Australia.\n\nThe CEO of Binjari's Aboriginal Community Corporation, Debbie Aloisi, said the situation in her community was dire and funding wasn't flowing fast enough.\n\n\"Binjari has received nothing, we're worse off than we were,\" she said.\n\nDebbie Aloisi says the Binjari community has lost faith in politicians. (ABC News: Pete Garnish)\n\n\" Everywhere is overcrowded, you'll have a three-bedroom house with fifteen people in it. \"\n\nMs Aloisi said she's frustrated Binjari was used as the backdrop for a government announcement which the community is yet to benefit from.\n\nBinjari sits around 16 kilometres west of Katherine. (ABC News: Olivana Lathouris)\n\n\"They make these motherhood statements and then nothing happens,\" she said.\n\n\"It gets to the point now where the people here just don't believe.\"\n\nLocal employment opportunities drying up\n\nLocal man Justin Maroney was employed as a tradesperson by the community corporation to build homes in Binjari and neighbouring communities.\n\nIn the last year, Ms Aloisi said government tenders — which the corporation relied upon to provide work for local people — have dried up forcing her to lay off 15 local tradespeople.\n\n\"It was a shock really, didn't know what to say,\" Mr Maroney said.\n\nJustin Maroney says it was a real shock when he was made redundant by Binjari's Aboriginal Community Corporation. (ABC News: Pete Garnish)\n\nMr Maroney now does odd jobs around town, but with a wife and child to care for, his family is barely making ends meet.\n\n\"I used to have a car and whenever it would break down, I always had money to pay for it but now, had to get rid of it.\"\n\nFuture of remote housing agreement uncertain\n\nThe NT government insists it is on track to meet the targets set under the remote housing agreement, but the future of the funding under a federal Coalition government remains uncertain.\n\nIn remote Australia, a forgotten housing crisis drags on Photo shows Children play on a bed in the lounge room during the heat of the Rockhole day. The pandemic has exposed generations of neglect in the funding of remote housing for Aboriginal Australians. In the Northern Territory, families still hold on to hope their children will see a better future.\n\n\"How they're being carried out and delivered, and also costs associated with those builds, will be considered and under review,\" shadow minister for Indigenous Affairs Jacinta Nampijimpa Price said.\n\nWith the federal election now imminent, Ms Aloisi said the community was desperate to see progress.\n\n\"Housing is the first step, I believe, to advancement,\" Ms Aloisi said.\n\n\" If you've got a roof over your head, you can go out and look for a job — but the house comes first. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/tas-yole-stables-search-results-in-show-cause-notices-racing/105198170",
        "title": "Alleged breaches found during multi-agency search of Yole stables",
        "publish_date": "Fri, 25 Apr 2025 22:16:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tasmanian harness trainer Wayne Yole has been given until the end of the month to prove why he \"should be allowed to home, stable or train any horses\" at his Sidmouth property following a multi-agency inspection last month.\n\nOn March 24, Tasmanian Racing Integrity Commissioner Sean Carroll organised an inspection of the stables at Sidmouth in northern Tasmania.\n\nRacing Integrity Commissioner Sean Carroll. (ABC News: Morgan Timms)\n\nIn attendance were representatives from the Tasracing Integrity Unit, RSPCA Tasmania, Biosecurity Tasmania and the West Tamar Council.\n\nDuring the search, Tasracing says it identified numerous alleged breaches of regulatory requirements and animal welfare guidelines.\n\nIt has since issued Wayne Yole with a notice for him to show cause as to why the stables should be allowed to home, stable or train horses from the premises.\n\nThe Yole Racing stables at Sidmouth, pictured in 2023. (ABC News: Maren Preuss)\n\nHorses on cocaine, race fixing among allegations at inquiry Photo shows A horse with a harness coach. A Tasmanian harness racing inquiry has heard allegations of race fixing, illegal betting and horse doping.\n\nIt is unclear exactly what the show cause notice relates to.\n\nWayne Yole is the father of harness trainers Ben and Tim Yole. Both trainers have been disqualified from the industry for three years.\n\nLast year the ABC reported that several horses that used to list Ben Yole as their trainer were transferred into his father Wayne's name.\n\nThat decision was signed off by the now-defunct Office of Racing Integrity.\n\nWayne Yole has been given until April 30 to rectify any issues and respond to the notice.\n\nA spokesperson for Wayne Yole said they would work through any issues.\n\n\"We are still awaiting clarification as to what is required,\" they said.\n\n\"We hope it will all be sorted out in an orderly manner.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/older-worker-takes-on-youth-dominated-fast-food-industry/105156120",
        "title": "'Nanny' works in youth-dominated fast food industry because she loves it",
        "publish_date": "Fri, 25 Apr 2025 22:11:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Jan Lawlor, 64, is not your typical fast-food worker.\n\nSome women in their 60s are looking to settle down into retirement, while others have re-joined or remained in the workforce for financial reasons during a cost-of-living crisis.\n\nBut Ms Lawlor said she was in a fortunate position to be working at her local McDonald's simply because she loves it, and was not ready to give it up just yet.\n\nIn 2020, in the midst of the COVID-19 pandemic, Ms Lawlor chose to leave her job of 22 years at a bakery in regional South Australia.\n\nA few months later, after becoming regular customers at Renmark McDonald's, Ms Lawlor and her friend — known by many in the community — were asked by the previous owners to join the crew.\n\n\"We sort of looked at them and said, 'You don't want a pair of old tarts like us, do you?’\" she said.\n\n\" They thought, being a more 'mature age', we would be an asset to their team because of our experience. \"\n\nDespite not actively looking for work at the time, Ms Lawlor accepted and was keen to \"take the challenge on\".\n\nMore women working in their 60s\n\nAccording to the Diversity Council Australia, older women are participating in the national workforce at an increasing rate.\n\nFor example, participation rates by women aged 60 to 64 rose from 10 per cent in 1982 to 54 per cent in 2022.\n\n\"This trend reflects changing social norms, greater financial need, longer life expectancy, and improved health,\" the council's chief executive Catherine Hunter said.\n\nShe said employers across Australia should support older women to work in \"meaningful roles\" to prevent later-life disadvantage as they were the \"fastest growing cohort of people experiencing homelessness\".\n\nCatherine Hunter says diversity across Australian workplaces had improved, but ageism remains a barrier. (Supplied: Diversity Council Australia)\n\n\"Largely because they've had less opportunity to accumulate superannuation and savings due to interrupted or undervalued work histories,\" Ms Hunter said.\n\n\"Despite their capabilities, older women still participate in the workforce at much lower rates than men their age, largely due to the double impact of ageism and sexism.\"\n\nMs Hunter said while diversity in Australian workplaces had improved in recent years, including progress in age diversity, there was still work to be done.\n\n\"Research shows that age-diverse teams are more motivated, have higher retention and perform better,\" she said.\n\n\" Regional workplaces have a unique strength: deep ties to local communities. \"\n\nMs Lawlor has worked at McDonald's in Renmark since early 2021. (ABC Riverland: Elyse Armanini)\n\nLocal poster girl\n\nWhen she first started at McDonald's in 2021, Ms Lawlor wondered how she would be accepted by the predominantly young cohort.\n\nFour years on, the 64-year-old has become a respected member of the team with the moniker of Nanny.\n\n\"I love it. I've really engaged with the younger generation,\" she said\n\n\" They walk in and say, 'Morning Nanny!' and off we go. \"\n\nMaddii Lloyd, 25, (right) enjoys working with Ms Lawlor. (ABC Riverland: Elyse Armanini)\n\nWorking for the fast food giant in a regional town has taken Ms Lawlor to unexpected places, to her surprise and that of family members across the country.\n\nShe was filmed a couple of years ago as part of an advertising campaign shown during AFL games, and was included on flyers at the Perth show.\n\n\"Just goes to show, you don't have to be a 14-year-old and you can advertise the fact older generations are most welcome,\" Ms Lawlor said.\n\n'Underestimated' value\n\nMs Hunter said the value mature-aged women brought to industries such as hospitality was \"often underestimated\".\n\n\"[They] can offer strong interpersonal and communication skills that strengthen team cohesion and enhance customer experience,\" she said.\n\nIn a statement, McDonald's Australia said it provided jobs for people \"of all ages and experience levels\".\n\nAccording to data provided by McDonald's, more than 560 people aged over 60, nearly 1,000 aged over 55 and more than 2,000 45-plus are currently employed nationally out of a workforce of more than 115,000.\n\nRenmark McDonald's owner Brenton Edwards said while the company was one of the largest youth employers in Australia, hiring older workers at the local store had been beneficial for everyone involved.\n\nBrenton Edwards says the local McDonald's receives multiple applications a week from people aged 45-plus. (ABC Riverland: Elyse Armanini)\n\n\"We don't have 14 and 15-year-olds applying every day like some of the city stores do, so we've had to pivot a little bit and look at who we can employ,\" he said.\n\nMr Edwards said he was receiving on average two job applications a week from people aged 45-plus, and employees such as Jan brought \"maturity and a sense of calm\" to the environment.\n\nMs Lawlor says she enjoys making coffees and teaching younger employees barista skills. (ABC Riverland: Elyse Armanini)\n\nNot ready to hang up the apron\n\nWorking under the town's Golden Arches has become somewhat of a family affair for Ms Lawlor.\n\nHer daughter worked in the same restaurant during her school years in the late 1990s, and now her 16-year-old grandson, Noah, has joined the team at the same time.\n\nMs Lawlor said while she thought about retirement \"a lot\", she was happy staying in the workforce for a little while longer.\n\n\"You're helping others, but you're also helping yourself and you're broadening your horizons and your knowledge.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/indian-premier-league-pat-cummins-sunrisers-hyderabad/105219054",
        "title": "Cummins's Sunrisers Hyderabad score vital IPL win",
        "publish_date": "Fri, 25 Apr 2025 21:53:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Pat Cummins has led Sunrisers Hyderabad to a five-wicket victory over Chennai Super Kings to revive his side's chances of reaching the Indian Premier League (IPL) play-offs.\n\nThe Australia skipper produced the figures of 2-21 to help bowl out the Super Kings for 154 with one ball remaining in Chennai.\n\nHyderabad chased down the victory target with eight balls to spare.\n\n\"That was great. A few things came together tonight,\" Hyderabad captain Cummins said after the match.\n\n\"You always get a bit down after a few losses, but the boys played well.\n\n14yo prodigy becomes youngest-ever IPL player Photo shows Vaibhav Suryavanshi raises his bat in his left hand Vaibhav Suryavanshi shows what all the hype is about by putting his first ball into the stands on debut for the Rajasthan Royals against the Lucknow Super Giants in the IPL.\n\n\"Our record against CSK isn't great here, so with five games left, we're still hopeful. We'll give it a good crack.\n\n\"You always wish we'd finished that a bit more comfortably and been a bit more clinical.\n\n\"But, overall, happy to get a win.\"\n\nCummins was at the heart of Hyderabad's triumph, winning a crucial toss and deciding to field.\n\nHe returned the most economical four overs of his IPL campaign while taking the key wickets of hard-hitting opener Ayush Mhatre (30 off 19 balls) and all-rounder Anshul Kamboj (2).\n\nMedium-pacer Harshal Patel was named player of the match for his 4-28, which included the prize wicket of Super Kings captain MS Dhoni for 6.\n\nIn Hyderabad's innings, Cummins's fellow Australian Travis Head failed to kick on again after getting to 19 off 16 balls at the top of the order.\n\nHe was bowled by Kamboj after swinging wildly across the line.\n\nHyderabad made hard work of the run chase and was grateful to Ishan Kishan's 44 and an unbeaten 32 off 22 balls from Kamindu Mendis.\n\nIt was the side's third win of the season, moving them to eighth in the 10-team table.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/rainforest-home-with-cassowaries-built-after-cyclone-yasi/105147456",
        "title": "The house that Yasi built: One man's solitary life with the cassowaries",
        "publish_date": "Fri, 25 Apr 2025 21:41:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's a birdwatcher's paradise, a 10-acre plot of tranquillity that Kenn Parker calls home.\n\nIn this isolated patch of rainforest on the doorstep of the Wet Tropics World Heritage Area in northern Queensland, he lives a quiet life observing the natural world around him.\n\nKenn Parker says he is endlessly fascinated by the natural environment around him. (ABC News: Baz Ruddick)\n\n\"There's never a dull moment. There is always something happening,\" Mr Parker says, as he sits on the verandah of a purposefully built bird-watching hut.\n\n\"One minute it might be a cassowary or a bandicoot, or a wallaby or a snake. They just keep coming and I love them.\"\n\nKenn Parker's house includes a small, three-sided bird-watching shelter where he welcomes visitors. (ABC News: Baz Ruddick)\n\nBut of all his forest neighbours, the most intriguing are the cassowaries — often deemed the most dangerous birds in the world due to their razor sharp claws and powerful legs.\n\n\"I didn't think I was going to be living this close to cassowaries. But they just arrived one day and they haven't gone,\" he said.\n\nSince purchasing the property in 2000, Mr Parker estimates he has seen 42 chicks grow up, some of whom have returned as proud fathers with their own offspring to show him.\n\nMr Parker loves the quietude of the rainforest. (ABC News: Baz Ruddick)\n\nHis fascination with these extraordinary birds, which are raised by the male parent, has led Mr Parker to document their behaviour.\n\n\"I videoed them all from tiny little chicks — three days old and four days old. They've just grown up around me,\" he said.\n\n\" The dad will bring the chicks back and go, 'Hey, look what I've got'. They're very good dads. \"\n\nCassowaries often visit Mr Parker's house as they move through the forest scratching for food. (ABC News: Baz Ruddick)\n\nWhile he has affectionately given nicknames to some of the more frequent visiting birds — Duchess and Danger — Mr Parker maintains a safe distance and never approaches them.\n\nHe believes that when the cassowaries are close to his house, they don't find his presence threatening and are therefore less of a danger to him.\n\n\"When I get out and go into the forest it's a different story. You have to be careful. You are a human. You are a problem,\" he said.\n\nMr Parker exercises caution around the cassowaries. (ABC News: Baz Ruddick)\n\nThe night the wind howled\n\nMr Parker is accustomed to solitary life, having spent many decades living at sea and travelling on sailboats.\n\nIn 2000, he decided to put down roots among the trees.\n\nHe purchased the 10-acre block at Bilyana, north of Cardwell, for just under $50,000 using a compensation payment he was awarded after a workplace accident.\n\n\"As I started to walk through [the forest] there was a little pink native hibiscus and I knew from that moment this property was going to be mine,\" he said.\n\nMr Parker's small house was built in 16 days using timber from trees felled by Cyclone Yasi in 2011 for the frames. (ABC News: Baz Ruddick)\n\nWhen he began living on the block, his home was an old campervan with a pop-top roof, which was perfectly serviceable until Tropical Cyclone Yasi unleashed its fury on North Queensland in February 2011.\n\nThe Category 5 storm remains one of the most devastating to ever cross the Australian coast.\n\nAs Mr Parker sheltered in his van, he could hear trees and huge branches falling all around him as gale-force winds tore through the rainforest.\n\nDamaged boats are stacked on top of one another at Port Hinchinbrook boat harbour in Cardwell, Thursday, Feb. 3, 2011, as a result of category 5 tropical cyclone Yasi. (AAP: Dave Hunt)\n\n\"I had the roof tied down and I can see it starting to lift so I'm hanging on. It's roped but the wind is picking it up, dropping it, picking it up, dropping it,\" he recalled.\n\n\"Then this wattle tree just came down and went 'bop' and kept the roof down all night.\"\n\nDowned trees and signs litter the foreshore at Cardwell, days after Cyclone Yasi. (Audience submitted: Russell Cumming)\n\nHe felt safer with the tree anchoring his fragile abode, but was afraid for the animals who called this part of the forest home.\n\nAt first light, he climbed out of his battered van and was shocked by the destruction around him.\n\nThe view, normally obscured by trees, opened up and he could see Dunk Island 30 kilometres to the north-east and Tully to the north.\n\nThe frame and roof trusses were cut using a portable mill loaned to Mr Parker by a friend. (ABC News: Baz Ruddick)\n\n\"The first little bird I saw was a little blue wren. It made my heart sing. I nearly cried because I thought if that little bird can survive then the cassowaries and all these other little animals, they're going to be alright,\" he said.\n\nThe house that Yasi built\n\nMr Parker never planned to build a permanent structure on his property.\n\n\"I wasn't going to build here because there was no way in the world I was going to cut these trees down. I wasn't even going to build a track,\" he said.\n\nBut with his campervan ruined, he decided to put all the fallen timber around him to good use.\n\nFriends whose properties had also been hit brought him extra wood, and with their help and the use of a portable mill, Mr Parker set to work using the timber to build the frames and trusses of a small house.\n\nMr Parker spends time repairing electronics at his kitchen table. (ABC News: Baz Ruddick)\n\n\"Two or three big blue gums came down so we cut them up,\" he said.\n\n\"It all came from here except the pine … I cut this [timber] really fresh within two or three weeks of it coming down and it cut dead straight — perfect,\" he said.\n\nIn just 16 days, Mr Parker had a small but liveable home. The kitchen and bathroom are still makeshift and the place is run on five deep-cycle batteries — recharged by the sun.\n\nMr Parker says one day cassowaries arrived at his property and now they visit him regularly. (ABC News: Baz Ruddick)\n\nAdapting to life in the rainforest has come with its challenges.\n\n\"There is no water but there is a spring, so I invented a pump that pumps water up the hill and puts 5,000 litres of water in those tanks there a day,\" he said.\n\n\"I wouldn't want to live anywhere else.\n\n\"[I love] the quiet at night. You might hear an owl or a scrub fowl, you hear frogs — but it's so quiet. And the stillness.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/sa-sturt-profile-federal-election-2025/105205734",
        "title": "The talk on the street in South Australia's most marginal seat",
        "publish_date": "Fri, 25 Apr 2025 21:24:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "The electorate of Sturt is South Australia's most marginal seat.\n\nIt covers Adelaide's eastern suburbs, from Mount Osmond in the south, through Norwood and up to Hope Valley in the north.\n\nIt's been held by the Liberals for decades, but in 2022 the party held on with the slimmest of margins.\n\nIn what may be SA's hottest election contest, we visited the seat to ask people what issues are most important to them.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nNaine is an urban planner, and housing is high on her list of priorities.\n\n\"The supply of housing is a big thing — it's not just the demand side but also the supply side,\" she said.\n\n\"How do you actually develop cities in a sustainable manner … knowing climate change is an issue, sustainability, livability, all these things are being just used as words.\n\nAs a new mum, Naine is also passionate about childcare. (ABC News: Justin Hewitson)\n\n\"How do you develop for the future knowing population is going to increase, migration and all those kind of things. Do you just go for an urban sprawl or do you provide policies that support sustainable ways of development?\"\n\nAs a new mum, she's also passionate about childcare.\n\n\"Giving people enough support to have kids now and think about what Australia will be in the next 30 years, 40 years not just right now issues,\" she said.\n\nRetired teacher Kay wants more focus on improving the health system, but addressing climate change is also a high priority.\n\n\"I think environmental issues, climate change,\" she said.\n\n\"I think we should be doing as much as we can. I know that people say that Australia is a small country and we can't make a big impact but if everybody just said, 'well I can't make an impact,' the whole world would go to pieces.\"\n\nAddressing climate change is a high-priority for Kay. (ABC News: Justin Hewitson)\n\nWhen it comes to how the election is playing out, she'd like to see the parties focus on policies rather than negative campaigning.\n\n\"I'm sick to death of seeing adverts just rubbishing the other party and all of the stuff that you get through the post,\" she said.\n\n\"I just take one look at it and throw it in the bin because until they start saying, this is what we really stand for and what we want to do, I'm not prepared to just read stuff about how the other side is no good.\"\n\nLong term focus\n\nRetirees Margaret and Don both want long-term policy and planning, not short-term promises.\n\n\"Everybody's talking about the cost of living, but then you look around and you see people carrying out expensive operations,\" Don said.\n\n\"I'm more inclined to look at the longer term and I think who's best to have ideas and policies that are good for this country in the longer term.\"\n\nMargaret said she has a similar opinion.\n\n\"I think Albanese is doing a wonderful job but he hasn't quite finished,\" she said.\n\n\"He needs to get the housing under control, and educating our own students in our own universities as well.\"\n\nDon and Margaret want more focus on the higher education system this election. (ABC News: Justin Hewitson)\n\nWhen it comes to a long-term future, Margaret and Don both want a focus on the education system, particularly universities.\n\n\"Our country is likely to have a more prosperous future if we invest in our young people's education,\" Don said.\n\n\" I think to some extent we've gone a bit too far with the idea of turning our universities into export industries rather than concentrate on our own people's education. \"\n\nNot everyone in Sturt thinks major improvements are needed.\n\nHealthcare worker Juliet has moved to Australia from Kenya and said she's happy with the way things are.\n\n\"Honestly speaking, I don't see anything negative,\" she said.\n\n\"Everything to me is positive because where I come from, you guys have the best life.\n\nHealthcare worker Juliet says she is happy with how things are. (ABC News: Justin Hewitson)\n\n\"Maybe it's because we're new but so far so good, nothing to complain.\n\n\"Like this park, these are things that we never have back home.\n\n\"The parks, the way my son goes to kindy, the way they read is totally different. We get an update, how his emotions are, how he's interacting with other kids — back at home we never get that.\n\n\"Here it is really good, especially the education. I love it.\"\n\nHow will these issues play out in Sturt?\n\nSturt isn't just South Australia's most marginal seat, it's also one of the most hotly contested.\n\nIt's been in Liberal hands since 1972, and was held by high-profile MP Christopher Pyne for decades.\n\nLiberal staffer James Stevens took it over in 2019 and in 2022 his margin narrowed to just 0.5 per cent.\n\nThis year he's up against Labor's Claire Clutterham, a local lawyer, but there are a couple of other significant candidates.\n\nThe Greens' vote increased by 5.2 per cent in 2022 and the same candidate, Katie McCusker, is running again.\n\nEven with a major swing in her favour, Ms McCusker only got 16.4 per cent of the vote in 2022, so winning the seat is still a big ask.\n\nAnd this time there's also a 'teal' independent candidate, local doctor Verity Cooper, who is backed by the Climate 200 group.\n\nUnless there's a major upset, what will be most interesting is where those teal and Greens preferences flow, and whether there'll be enough of a swing to Labor for the ALP to win it for the first time in more than 50 years.\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/election-women-voters-cost-of-living-housing-health-environment/105188210",
        "title": "As voter priorities shift, some women feel ignored by male politicians",
        "publish_date": "Fri, 25 Apr 2025 21:23:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's gender voting gap is widening as the major parties continue to lose women to independents, research shows.\n\nWomen voters have told the ABC they're feeling disengaged from politics despite holding concerns about the cost of living, health, housing and education policies.\n\nResearchers say women are feeling under-represented and struggle to speak up about the issues that matter to them.\n\nLess than a week out from the federal election, we spoke to four women in Queensland about their concerns.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nChildcare and health\n\nAmelia Faulkner lives in the Far North Queensland LNP electorate of Leichhardt.\n\nThe Cairns mother-of-one is \"seriously considering\" returning to work early because of the cost of living but says childcare for her four-month-old baby daughter is a \"serious barrier\".\n\n\"A lot of regional mums are having to consider whether to go back to work — and probably lose money having to pay for childcare — or to take the hit to their future career and job prospects,\" Ms Faulkner says.\n\nAmeila Faulkner is concerned about women's health and the cost of childcare for working parents. (ABC News: Brendan Mounter)\n\nSince moving to Cairns in 2019, and living through a string of severe weather events, she's become more concerned about a party's environmental policies.\n\n\"They're things I want to see taken seriously by the government I vote for,\" she says.\n\nThe young Far North Queensland mother is trying to balance a plan for returning to work, with the cost and accessibility of childcare. (ABC News: Brendan Mounter)\n\nMs Faulkner believes some women are wary to talk about politics in case they \"cop backlash\".\n\nBut she's unwilling to ignore the country-city divide for regional women like herself.\n\n\"Prenatal, postnatal, birth, mental health — it's all unavailable or really limited,\" she says.\n\nMonash University researcher Blair Williams says a lot of women voters feel \"less involved\" because they're not represented.\n\nMen and women are more divided, and it could sway the election Photo shows Dutton with backbench New data suggests that gender and politics are getting more polarised and the views of women and men more divided. It is consequential for how we understand this election.\n\n\"If you look at the latest debates on TV, it's all white men in blue suits,\" she says.\n\n\"Jobs for the boys, blokey kind of policies and politics, you've got the high vis and hard hats, that kind of politics.\"\n\nAnd policies and campaigns tend to skew the same, Dr Williams says.\n\n\"Less to do with women's trades, or female-dominated trades like hairdressing. I think that speaks to women's belonging in politics.\"\n\nForever renters\n\nNatalie Dean is a teacher and \"forever renter\" in the safe Labor outer Brisbane seat of Oxley.\n\nNatalie Dean, pictured here holding flowers gifted to her by students. (Supplied)\n\nThe 57-year-old had four years of successive rent rises at her Yeerongpilly townhouse before her lease wasn't renewed — only for it to be re-listed the day after handing her keys in, with another $90 rent increase tacked on.\n\nShe used to own a home in north Queensland with her husband, but took a financial hit when they got divorced.\n\nMs Dean couldn't have her own children, so watching her nieces and nephews grow up in Brisbane is incredibly important to her. (Supplied)\n\n\"I kind of walked away from the marriage with nothing and there was no way I could afford to buy anything, so I just went straight into a rental,\" she says.\n\n\"I don't feel like I can have any control over the most fundamental thing, which is my home.\n\n\"It makes you feel that you have no worth in society.\"\n\nMs Dean wants limits to negative gearing for people who own multiple properties.\n\nShe doesn't think either major party has a policy to help forever renters like her.\n\n\"The Coalition's policy of tax deducting mortgage repayments is only helping people who can already afford a mortgage, how is that helping the supply problem?\" she says.\n\n\"Sadly, the Labor Party's policy isn't much better.\"\n\nSarah Cameron, a senior lecturer at Griffith Business School, has researched voter behaviour as chief investigator on the Australian Election Study.\n\nDr Sarah Cameron says the gender gap between voters has widened over recent federal elections. (Supplied)\n\nShe's observed a widening \"gender gap\" globally where women are increasingly likely to lean left, with men somewhat more likely to vote for parties on the right.\n\nMeanwhile, the number of people voting for a major party is at \"record lows\".\n\n\"Disaffection\" with the Morrison government in 2022 led to an \"unprecedented rise of alternative actors in politics\", Dr Cameron says.\n\n\"It was the independents' focus on areas of the then-government's weakness — political integrity, climate change, but also gender equality — that contributed to their success.\"\n\nMs Dean says no bank will grant her a home loan, because \"I would be dead before I'd paid it off\". (AAP: Dave Hunt)\n\n'Women my age are invisible'\n\nJulie Anastasia O'Connor supplements her disability pension delivering pizza part-time, a job she loves because it helps her to feel less isolated.\n\nThe 57-year-old lives in the Brisbane electorate, a key seat held by the Greens with a slim margin.\n\nShe wants to see policies that help low-income earners.\n\n\"We're just ignored, women of my age — we're invisible,\" she says.\n\n\" I've been immobilised with fear and anxiety … It is so depressing. \"\n\nWith how expensive rental housing and groceries have become, Julie Anastasia O'Connor is struggling to make ends meet. (ABC News: Shari Hams)\n\nMs O'Connor worries her psychiatric illness will relapse from cost-of-living stress and land her back at hospital for the first time in almost a decade.\n\n\"I used to spend about $80 a week on food, last year. Now I spend over $100, and I'm getting less,\" she says.\n\n\"My greatest fear is all my progress will be unravelled and I'll end up in the ward, helpless again.\"\n\nResearch shows women aged between 55 to 64 are the fastest-growing homeless cohort. Ms O'Connor says this \"shows how we are undervalued in the community\".\n\nShe wants women to be more politically engaged.\n\n\"We get to choose which way the community goes,\" she says.\n\n\"We all have a right and a responsibility to make ourselves heard and be visible in the community.\"\n\nMs O'Connor is worried about the impact cost-of-living stress is having on her health. (ABC News: Shari Hams)\n\nPoliticians 'overlooking' what matters\n\nAnna Beck lives in the Dickson electorate, Queensland's most marginal seat held by potential prime minister Peter Dutton, and is on maternity leave from her job as a paramedic.\n\nIn her 12 years working in health, she's seen resources stretched thin in an increasingly overloaded system.\n\nAs a parent, she feels the same way about the public education system.\n\nAnna Beck, a mother-of-two in Cedar Creek, has been working in the health sector for over a decade. (ABC News: Nickoles Coleman)\n\n\"I've always been politically engaged, and I think it's just becoming more apparent that we need to look for solutions beyond that two-party system,\" she says.\n\nMs Beck says politicians are overlooking the issues that matter most to women — like healthcare, education and the cost of living.\n\n\"If women felt more represented, if their values and things that matter to them are being spoken about and funded for the better, I think women would potentially engage a little bit more,\" she says.\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/nsw-military-career-transition-to-firefighting-former-commando/105210372",
        "title": "'From one family to another': Commando finds fresh start in firefighting",
        "publish_date": "Fri, 25 Apr 2025 21:08:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Michael Zemaitis left his full-time military career, he still wanted to pursue work that helped give back to the community.\n\n\"I was starting a family so I wanted to look at a career that wouldn't keep me away from them but would still allow me to serve and help others,\" he said.\n\nAfter serving in the Australian Army for 15 years as a combat engineer and commando, Mr Zemaitis made the decision to leave military life behind and apply for a role with Fire and Rescue NSW (FRNSW).\n\nLike many, he struggled with the transition out of service but said support from FRNSW made things much easier.\n\n\"It was like going from one family to another,\" he said.\n\n\"The camaraderie is there, we all have the same purpose and we're all there to support each other within the team and the broader community.\"\n\nMichael Zemaitis served in the army for 15 years. (Supplied)\n\nMr Zemaitis is not alone in his experience, with approximately 400 current serving or former Australian Defence Force (ADF) members in FRNSW ranks.\n\nSuperintendent Gregory Houston, zone commander for Sydney's CBD and eastern suburbs, said both organisations had similar values and transferable skill sets.\n\n\"The fire service is an attractive career for veterans as it offers a sense of purpose, service and duty,\" he said.\n\nHe found that veterans know how to work well as a team, follow instructions and have a can-do attitude — all of which are the essence of being a firefighter.\n\nThere are parallels between working as a firefighter and serving in the military. (ABC News: Sally-Anne Young)\n\nTeaching veterans to have an elevator pitch\n\nCraig Delaney, a veteran himself, manages the NSW government's Veterans Employment Program.\n\nHe said supporting veterans during their career transition was crucial to ensuring positive self-esteem and wellbeing.\n\n\"We've had almost 3,700 veterans employed since we began the program,\" he said.\n\nCraig Delaney manages the NSW government's Veterans Employment Program.\n\n\" It's teaching veterans to have an elevator pitch so they can meet someone and go, 'G'day mate this is what I can do'. \"\n\nTasks such as writing a resume, learning job interview skills, completing job searches and even how to relate their ADF experience to the civilian world are key focus areas in the program.\n\nIt's ultimately about teaching veterans how to sell themselves as an asset to future employers.\n\nThe 'healthy soldier' effect\n\nAdvocating for veteran mental health as they enter civilian life is crucial, Mr Delaney noted, however he said it was also important to acknowledge the resilience of service people.\n\nMarc Diplock on helping veterans transition to a civilian life When Marc Diplock's defence career ended, the journey to find help in the civilian world was long and rocky. So, he carved out a new life: helping other veterans.\n\n\"People say all veterans have PTSD, that is untrue. [Veterans] understand what their triggers are and can still be totally fantastic employees,\" he said.\n\nAccording to a 2022 Australian Institute of Health and Welfare (AIHW) report, the unique nature of service can actually \"enhance a person's health and wellbeing\" — a phenomenon known as the \"healthy soldier\" effect.\n\nThe paper noted that in 2016, the majority of ex-serving ADF members surveyed were \"doing well\", with many having higher education qualifications, owning their homes and being \"socially connected by living in a family type household\".\n\nSeparate research by the AIHW did flag however that veterans have a higher suicide risk compared to the general population.\n\nThe NSW government's program aims to teach veterans how to find future employment outside of the military. (Supplied: Fire and Rescue NSW)\n\nAfter working closely in the employment sector, Mr Delaney recommended three simple things employers could do to help veterans in their transition.\n\nThis includes employers recognising the skills veterans can bring to an organisation, an option to identify as a veteran in job applications, as well as honest and constructive feedback for those unsuccessful in obtaining a position.\n\n\"We just want people to help veterans and do the right thing,\" Mr Delaney said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-26/five-regional-seats-to-watch-this-federal-election/105157292",
        "title": "Five seats that could change the course of the election",
        "publish_date": "Fri, 25 Apr 2025 21:05:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Every contest is crucial across the country as Anthony Albanese and Peter Dutton face off in the federal election, and in regional Australia there are five seats that could play a hand in the overall result.\n\nUniting them all are the key issues on voters' minds, including cost of living, childcare deserts and renewable energy.\n\nHere are the five regional seats to watch, starting in Western Australia.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nBullwinkel, WA\n\nAustralia's newest electorate, the seat of Bullwinkel east of Perth, was created in response to the growing population of WA's capital.\n\nIt pieces historic farming towns together with semi-rural areas and the urban fringe, creating a seat of unlikely bedfellows.\n\nIn the historic settlement town of York, an hour and half from Perth, farmers are concerned about the phase-out of the live export trade by 2028.\n\nYork farmer Peter Boyle has been raising and fattening sheep for 58 years and for him, stopping live exports means the end of a steady source of generational income.\n\nPeter Boyle watches over his sheep being mustered. (ABC News: Alex Hyman)\n\n\"I don't want to go out of sheep and the boys don't want to go out of sheep,\" Mr Boyle said.\n\n\"We've got a lot of infrastructure, a lot of money tied up in fencing, 500km or more of fencing, five sets of sheep yards, three shearing sheds.\n\n\" It's all a lot of money tied up and … a lot of knowledge and wisdom tied up as well, and that's all going to go out the door. \"\n\nThe live export phase-out legislation, passed in parliament last year, came after a series of high-profile animal welfare incidents, including the deaths of thousands of sheep on the Awassi Express in 2017.\n\nSince 2017, the industry has made significant changes to animal welfare practices, and both the National and Liberal party have committed to repealing the legislation to end the live sheep trade.\n\nPeter Boyle hopes people in the city learn about why farmers want live exports. (ABC News: Alex Hyman)\n\nMr Boyle believes this is the industry's last chance to make their concerns known to city voters.\n\n\"We've only got one shot at this, and if we don't, it's our own fault,\" he said.\n\nAt the start of the election, a convoy of truckies and farmers made their way loudly at peak hour in Perth, appealing to their city cousins to support their protest.\n\nLoading...\n\nThe race for the seat of Bullwinkel is a three-way contest between the Nationals, Liberal and Labor and the hot favourite depends on where you live in the electorate.\n\nThe majority of Bullwinkel constituents live on the outskirts of Perth, and the concerns of those voters are more in line with people in the city.\n\nWannon, VIC\n\nChildcare and wind power are both driving debates in the seat of Wannon, in the south-west corner of Victoria.\n\nNamed after a local river, and a Liberal stronghold since 1955, current Wannon MP Dan Tehan is facing increased competition from surging Independent Alex Dyson.\n\nFor families, the region has become a childcare desert, with nearly three children vying for each childcare place on offer.\n\nLack of childcare is an issue on voters' minds in the seat of Wannon, as it is in much of Australia. (AAP)\n\nCourtney Finnegan lives in Port Fairy, has a three-year-old and is expecting twins.\n\nThere are more than 160 children on the wait list for the three childcare centres near Ms Finnegan, and in the main regional hub of Warrnambool, there are 350 children on the list.\n\nShe hopes there will be space for the twins by the time they are 12 months old, so she can return to her part-time administration job.\n\n\"My boss has asked if I'm definitely coming back to work and it really depends on the daycare situation,\" Ms Finnegan said.\n\n\"Needing two spots at once is a bit nerve-wracking.\"\n\nWind power is also a hot topic, as Wannon is home to the most wind farms of any electorate in Victoria.\n\nSteven Conte has always been in favour of renewables and has been waiting for action since the 1990s.\n\nHe lives in a micro home nestled in a picturesque town between Warrnambool and Port Fairy.\n\n\"If I had a choice, I would prefer to look out at an ocean-scape that didn't have any industrial kit in it,\" Mr Conte said.\n\n\"However, this is an extremely pressing clear and present danger.\"\n\nWind power is a hot topic in the seat of Wannon in Victoria. (ABC News: Charles Brice)\n\nFormer Warrnambool mayor Michael Neoh is the convener of a group opposing the offshore wind farm zone.\n\n\"We've got a pristine ocean, we've got a whale nursery, we've got tourist towns that also rely on the Southern Ocean,\" Mr Neoh said.\n\nHe believes the zone has become an election issue for voters because only one of the two key players running for the seat has made his position clear.\n\nIncumbent Liberal Party MP Dan Tehan has promised a Coalition government would scrap the zone, while Independent Alex Dyson has promised to hold his own consultation process and only support the project if there are real community benefits.\n\nLingiari, NT\n\nUnpaved and pot-holed, the red-dirt road out to the remote Indigenous community of Ltyentye Apurte/Santa Teresa, 80 kilometres south-east of Alice Springs, has been a source of frustration for decades.\n\n\"We've got our renals that travel on this road three times a week,\" said Arrernte man Darren Young.\n\nLocal kids ride bikes around Ltyentye Apurte/Santa Teresa. (ABC News: Xavier Martin)\n\nThe rough road has serious health implications as renal patients with kidney disease are forced to travel to and from Alice Springs every week for dialysis.\n\nAlong with housing, these are the two main issues for Lingiari voters in the community as the federal election approaches.\n\n\"Not having the paved road contributes to keeping people in poverty,\" said Ellie Kamara, the CEO of the Indigenous-run Atyenhenge Atherre Aboriginal Corporation, which runs programs in Ltyentye Apurte.\n\nThe seat of Lingiari is vast and takes in 99 per cent of the Northern Territory, excluding Darwin.\n\nClaire Young is the chair of the Atyenhenge Atherre Aboriginal Corporation. (ABC News: Alex Barwick)\n\nIt includes 73 remote Aboriginal communities and regional towns such as Alice Springs, Tennant Creek and Katherine.\n\nOnce a safe Labor seat held by Warren Snowden for decades, it became marginal at the last election.\n\nTiwi Antmajjere woman Marion Scrymgour won the seat for Labor by around 800 votes.\n\nMs Scrymgour is up against Country Liberal candidate Lisa Siebert, who is a Larrakia woman and former police officer, and well-known Greens candidate Blair McFarland.\n\nLooking over Ltyentye Apurte/ Santa Teresa in the Northern Territory. (ABC News: Xavier Martin)\n\nIn the regional town of Alice Springs, crime has clogged the headlines and is on voters' minds.\n\n\"I think people are looking for instant wins and that's not going to happen,\" said Alyawarre man Michael Liddle.\n\nFor trusted election coverage Photo shows The Words ABC News Daily with the ABC Listen logo beside it. Blue and pale green striped background. Submit your election questions and tune in for a weekly explainer of the latest election news. Listen to ABC News Daily on ABC listen.\n\nHe believes law and order will play a big role, but says finding long-term solutions to complex issues is crucial.\n\nMr Liddle runs a federally funded men's behaviour change program.\n\n\"If we don't push the reset button, their whole identity is going to be fast eroded, by the noises of things like alcohol, ganja, domestic violence, housing, employment,\" Mr Liddle said.\n\n\" All the social negatives are drowning out the positive signs of one's identity. \"\n\nBut voter turnout is the lowest in the country in Lingiari. One in three enrolled voters did not cast their ballot in the 2022 federal election.\n\nGilmore, NSW\n\nThe seat of Gilmore stretches 200km along the south coast of New South Wales.\n\nIt was the closest race in the country in the 2022 federal election, with Labor's Fiona Phillips holding onto the seat by just 373 votes.\n\nThis election will be a rematch between Ms Philipps and the Liberal hopeful Andrew Constance, with six other candidates in the mix.\n\nThe electorate's razor-thin margin is remarkable, and so too is its high rate of rental stress — the seventh-highest in the country.\n\nKristy Alleson has moved 13 times in three years amid the housing crisis on the NSW South Coast. (ABC News: Michael Black)\n\nNo-one feels this more than locals like Kristy Alleson, who has been squeezed out of the rental market and forced to move further south to find a place to live.\n\n\"I made my own timeline since my daughter was born — since August 2022, I've moved 13 times,\" she said.\n\n\"There were women's refuges, mouldy little asbestos homes, dodgy landlords that took a $4,000 bond and didn't want to give it back.\n\n\"I'm just looking at how many vulnerable situations I put myself in, just to try and have a roof over our heads.\"\n\nCoastal beach homes in the Shire of Eurobodalla lay vacant at a time of unprecedented demand for rentals. (ABC South East NSW: Holly Tregenza)\n\nMs Alleson has four daughters, two of them living with their father back in the Eurobodalla Shire. It's a part of the country she doesn't recognise anymore.\n\n\"I'm still in shock every time I drive around to see a new suburb popping up and more bush being cleared.\" she said.\n\nMs Alleson is about to move to a small cabin-style property in the Bega Valley, outside of the Gilmore electorate, where things have become far too tough for herself and others.\n\n\"I don't know if blame is the right word, but things definitely need to change. We're really suffering,\" she said.\n\n\" Why has society turned such a blind eye to women and children? \"\n\nBoth major parties are offering policies to help first homebuyers. Labor has also committed to building more affordable housing if re-elected, and the Coalition will build support infrastructure in new suburbs.\n\nThe Greens, meanwhile, are appealing directly to renting Australians, with a national rent freeze and other housing policies.\n\nBut in an electorate as marginal as Gilmore, just a few hundred voters frustrated with the escalating housing crisis could swing this crucial seat.\n\nBraddon, TAS\n\nCovering the north-west and west coast of Tasmania, Braddon swings between Liberal and Labor at almost every election.\n\nIt includes some of the most regional and remote parts of the island state.\n\nKerrie Laffer is a long-time local in Zeehan, a mining town that was once the third-largest population centre in the state, but now has a population of around 700.\n\nZeehan is a small remote town that sits in the seat of Braddon on the west coast of Tasmania. (ABC News: Maren Preuss)\n\nMs Laffer said access to services like healthcare was a major problem in her community.\n\n\"We need more medical facilities … we need specialists that travel down, or transport for people that don't drive,\" she said.\n\nBraddon is often decided by which party is best catering to the industries and jobs in the area.\n\nWith the decline of some major mines and a shift towards FIFO and DIDO work, towns like Zeehan face a challenging future, with the industry they once relied on no longer able to sustain them entirely.\n\nOn top of changes in the mining industry, a debate is raging around salmon farming on the west-coast.\n\nMany locals feel there is no clear plan around what industries can replace these traditionally big employers.\n\nTassal's Aqua Spa well-boat servicing salmon pens off the Tasmanian coast. (Supplied: Tassal)\n\nThe seat is currently held by Liberal Gavin Pearce, but he is not contesting the 2025 election.\n\nLiberal candidate and former defence contractor Malcolm Hingston is facing off against Labor's Anne Urquhart, who was a senior official in the Australian Manufacturing Workers Union before entering politics.\n\nBut regardless of who claims victory, many locals are pessimistic that the election will change much for their town.\n\nMs Laffer said her community felt disconnected from the government.\n\n\"They come down, they say, 'Yes we know what it's all about', 'Yes we know how you feel', 'Yes we understand you'. No you don't. Have you ever been through it?\" Ms Laffer said.\n\nCredits\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-albanese-dutton-resume-campaign-after-hecklers-disrupt-welcome-to-country-at-anzac-day-services-20250425-p5lucj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Albanese, Dutton resume campaign after hecklers disrupt Welcome to Country at Anzac Day services",
        "publish_date": "Sat, 26 Apr 2025 11:29:45 +1000",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "Dutton has seemingly decided he has had enough of the prickly inquisitions that had begun to characterise his daily press conferences.\n\nSeveral media events earlier in the week featured tense long and exchanges with reporters. He received repeat questions from individual reporters on his views on trans women, immigration numbers, public service cuts, and other tricky topics.\n\nToday, Dutton took a leaf from Albanese’s playbook and said journalists would get one question each. He often ignored follow-ups by moving around the circle of assembled reporters to the next question. One or two follow-ups were acknowledged by Dutton, but it was an overall more controlled affair than earlier in the week.\n\nDutton will be relieved to have enforced such a rule without appearing overly domineering in telling a journalist they could not further question. The stricter approach is bad for transparency but a positive sign for the Dutton campaign heading into the final week – if it lasts.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/munsters-bellamy-quip-exposes-storm-injury-crisis-20250426-p5luem.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Munster's Bellamy quip exposes Storm injury crisis",
        "publish_date": "Sat, 26 Apr 2025 11:03:32 +1000",
        "category": "finance",
        "authors": [],
        "text": "Munster's Bellamy quip exposes Storm injury crisis\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/steven-may-bailey-fritsch-in-for-anzac-day-eve-afl-experts-tips-and-teams-for-round-seven-20250423-p5ltrw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ginnivan back for Hawthorn, Breust to miss: AFL experts’ tips and teams",
        "publish_date": "Sat, 26 Apr 2025 10:58:59 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Loading\n\nMELBOURNE\n\nB: J. Bowey, S. May, C. Salem\n\nHB: C. Windsor, T. McDonald, J. McVee\n\nC: K. Chandler, J. Viney, E. Langdon\n\nHF: T. Sparrow, T. Fullarton, K. Pickett\n\nF: K. Tholstrup, B. Fritsch, C. Spargo\n\nR: M. Gawn, C. Petracca, H. Langford\n\nI/C: C. Oliver, X. Lindsay, T. Rivers, H. Sharp, H. Petty\n\nEMG: J. Billings, B. Howes, A. Johnson\n\nIN: S. May, J. McVee, B. Fritsch\n\nOUT: B. Howes (omitted), D. Turner (injured), J. Melksham (managed)\n\nRICHMOND\n\nB: B. Miller, N. Broad, N. Vlastuin\n\nHB: J. Short, S. Banks, L. Trainor\n\nC: H. Ralphsmith, T. Dow, J. Trezise\n\nHF: S. Campbell, J. Ross, S. Green\n\nF: J. Faull, T. Lynch, M. Rioli\n\nR: T. Nankervis, T. Taranto, J. Hopper\n\nI/C: R. Mansell, T. Brown, C. Gray, K. McIntosh, S. Lalor\n\nEMG: T. Sonsie, J. Bauer, K. Smith\n\nIN: R. Mansell, C. Gray\n\nOUT: N. Balta (legal reasons), S. Ryan (injured)",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/a-quiet-sacred-ceremony-on-one-of-the-last-steps-in-pope-s-final-journey-20250426-p5ludq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A quiet, sacred ceremony in one of the last steps on Pope’s final journey",
        "publish_date": "Sat, 26 Apr 2025 10:32:54 +1000",
        "category": "sports",
        "authors": [
            "Rob Harris"
        ],
        "text": "Rome: As the evening shadows stretched across St Peter’s Basilica on Friday, a quiet, sacred ceremony was performed, marking one of the last steps in the final journey of the 88-year-old Pope Francis.\n\nWrapped in a simple red chasuble, the Pope’s hands rested gently on a rosary, a final coat of arms, along with a plaque bearing his name, was affixed to his wooden and zinc coffin.\n\nCardinal Kevin Farrell seals the zinc cover of the casket containing Pope Francis’ body. Credit: Vatican Media\n\nThe ritual, conducted by Cardinal Kevin Farrell, was accompanied by prayers and the sprinkling of holy water. The Pope’s personal medals, a cross and other mementos from his papacy were placed within the coffin before the lid was sealed for the last time.\n\nIn just hours, the streets of Rome will be flooded with mourners from around the globe, including heads of state, clergy, pilgrims and the very people Francis spent his life advocating for – the poor and marginalised.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/latrell-mitchell-suspended-for-high-tackle-in-another-blow-for-rabbitohs-20250426-p5ludv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Latrell Mitchell suspended for high tackle in another blow for Rabbitohs",
        "publish_date": "Sat, 26 Apr 2025 10:28:32 +1000",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "South Sydney fullback Latrell Mitchell is facing at least one week on the sidelines for a high shot on Storm winger Sualauvi Fa’alogo in the Rabbitohs loss to Melbourne on Friday night.\n\nMitchell was sent to the sin bin in the 49th minute after he slid into a tackle and collected Fa’alogo high.\n\n“It’s direct contact with the shoulder, moderate force, on report, in the bin,” referee Peter Gough said.\n\nThe storm flyer was subsequently taken from the field for a head injury assessment, which he failed, meaning he will miss Melbourne’s Magic Round clash with the Raiders next week as he undergoes the NRL’s mandatory 11-day concussion stand down.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/shayna-jack-in-tears-after-incredible-comeback-20240801-p5jy9b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shayna Jack in tears after incredible comeback",
        "publish_date": "Sat, 26 Apr 2025 10:19:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Shayna Jack in tears after incredible comeback\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/hurting-eagles-aim-for-special-afl-win-against-hawks-20250426-p5luej.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hurting Eagles aim for special AFL win against Hawks",
        "publish_date": "Sat, 26 Apr 2025 10:03:18 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "West Coast recruit Jack Graham says the entire team is hurting after an 0-6 start to the season, but he’s confident a “special” win is just around the corner.\n\nThe Eagles are yet to taste victory under new coach Andrew McQualter, and coughed up a 29-point lead en route to a heartbreaking two-point loss to Essendon in Perth last week.\n\nNew Eagles coach Andrew McQualter. Credit: AFL Photos via Getty Images\n\nWest Coast will start rank underdogs on Sunday against premiership fancies Hawthorn at Marvel Stadium, and the Eagles are now hot favourites to collect this year’s wooden spoon.\n\nGraham’s tough initiation at the club is in stark contrast to what he experienced during his early years at Richmond.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/agents-juggling-players-and-coaches-are-afforded-plenty-of-leeway-20250425-p5lu6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Agents juggling players and coaches are afforded plenty of leeway",
        "publish_date": "Sat, 26 Apr 2025 10:00:00 +1000",
        "category": "sports",
        "authors": [
            "Darren Kane"
        ],
        "text": "I don’t watch much of Anasta’s to-camera stuff, and I’ve no view whether his opinions favour his clients’ interests or not. But even if they do, do those circumstances constitute Anasta having a conflict of interest? Hardly. That would assume someone in Anasta’s position in the media lives in a soundproof room. Being prominent in the media isn’t relevant to either test. Anasta has no more of a conflict of interest than does Peter V’landys, by reason of him merely being Racing NSW CEO and Australian Rugby League Commission chairman. V’landys has no such conflict; thoroughbred racing and rugby league are two plainly different sports. Moreover, Anasta isn’t exactly Robinson Crusoe in terms of someone in the media having a side hustle. Phil Gould, for example, is an expert commentator for Channel Nine, publishers of this masthead, and general manager of football at the Bulldogs. And that’s fine. Nevertheless, would it be advisable for Anasta to veer away from expressing views that obviously touch on the interests of his clients? Yes. And I speak with some authority. I’ve practised as a lawyer, specialising in sports law, for over two decades. Among other roles, I’m an arbitrator with the National Sports Tribunal, the chair of the Combat Sports Authority of NSW, a member of the Harness Racing NSW appeals panel, and a member of the ethics panel of the International Testing Agency, which manages anti-doping programs for the International Olympic Committee and over 45 international federations.\n\nNRL 360 host Braith Anasta. Credit: NRL Photos Also, I’ve written this column for 12 years. There’s so much I’ll never be able to write about, as much as it would make for tremendous copy. By virtue of his media role, Anasta is compelled to have opinions; nobody’s going to watch someone that everyone invariably agrees with. My role as a columnist gives me a mere fraction of the prominence of Anasta, and my professional obligations far exceed his because I’m a lawyer, who is required to shoulder the ethical obligations that go hand in glove with all that. I routinely agonise about what I can say, and what I can’t. I’ve no idea whether Anasta is afflicted with such angst. He should be. But he still doesn’t have a conflict of interest in the proper sense. The more pertinent matter for examination is the level of power that exists to regulate player agents in terms of their professional obligations and conflicts of interest. It’s the system of regulating sports agents involved in rugby league, and in professional sport in general in Australia, which is where things run out of steam.\n\nThere are currently about 150 sports agents registered under the NRL’s mandatory Accredited Agents Scheme, which entitles them to represent rugby league players in contract negotiations with clubs. There were 105 agents registered just five years ago. Each of the 17 clubs has an elite squad capped at 30 players. That’s just over 500 potential clients already involved at the game’s highest level. Of the cohort of registered agents, most have no top-level clients, or maybe one. Player agency is as speculative an enterprise as scurraging in the dirt for truffles. Agents vacuum up umpteen 16-year- olds with stars in their eyes in the knowledge that maybe one of the crop will, one day, generate a commission. At the other end of the spectrum to the agents struggling with few or no clients, there’s a cabal of uber agents, including the invariably-in-the-headlines Isaac Moses, who have sequestered the market. In addition to the countless superstars and emerging players on his books, Moses oversees the affairs of not less than five of the 17 NRL head coaches. Think about it: it would be nearly impossible to get the best possible contractual terms for all of your clients in that scenario, where basically there’s one single market: the National Rugby League.\n\nConjecture over whether Anasta has conflicting interests by reason of his media prominence and his nascent player agency business misses the bigger issue. The NRL does a poor job of regulating the agency profession, which in turn is largely not the NRL’s fault. It’s seriously arguable that the whole concept of a governing body licensing and regulating player agency constitutes an unreasonable restraint on the trade of those wanting to act as player agents, and it’s also a breach of Australia’s competition laws. That argument has never been assessed in the Australian courts; push too hard, and it could be. In 2021, the NRL’s appeals panel confirmed Moses’ deregistration as a player agent, consequent to rules breaches of apparent “great seriousness”. It wasn’t his first offending – he also was banned for six months over a decade ago, arising from the Melbourne Storm salary cap affair. Yet in 2025, Moses operates like a puppeteer in rugby league. His last deregistration remained in force for less than two years. Somehow, that fact sits at odds with a finding that a professional person committed rules transgressions of “great seriousness”. The stint on rugby league’s naughty step never adversely affected Moses’ registration as a rugby union player agent, nor the ability of other agents within his business to carry on. Now, he’s more influential than ever.\n\nPlayer agents provide quasi-legal, financial and accounting services in negotiations that are complex, and where tremendous amounts of the folding stuff and livelihoods are bargained. Loading Lawyers, accountants and financial advisers are heavily regulated by governments and professional regulatory bodies. In contrast, player agents in rugby league subscribe to a code of conduct that requires them to (a) not take improper advantage of their position; and (b) not intermingle their personal interests with their professional responsibilities. Agents, however, aren’t restricted in terms of a maximum number of clients, the number of clients playing in the same positions, the number of players who they represent at any given club, or in terms of representing coaching staff and media types as well as players. But regardless of what the NRL’s rules say, there’s a toothlessness to their operation in practice, as is evidenced by Moses’ own registration history. It’s not wrong that professional sports regulate agents; it’s fundamental. But it’s only part of the solution.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/there-s-a-bear-in-where-why-perth-is-wrong-spot-for-club-s-return-20250425-p5lu8b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There’s a bear in where? Why Perth is wrong spot for club’s return",
        "publish_date": "Sat, 26 Apr 2025 09:55:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Fitzsimons"
        ],
        "text": "Spotlight on Tigers’ culture Told yers. Last week in this space, I opined that Tigers coach Benji Marshall’s tightly scripted remarks about there being no bullying in his team vis a vis Lachie Galvin, was surely on legal advice that the club was totally exposed in the way they had treated the 19-year-old wunderkind: dropping him to reserve grade, not reining in players attacking him on social media, and putting out a press release that unleashed the hounds of hell on him to the point that he needed a security detail, #FFS! Lachlan Galvin playing NSW Cup for Western Suburbs Magpies. Credit: Max Mason-Hubers “The Tigers”, I opined, “could find themselves a long way up metaphorical Legal Shit Creek without a paddle. For while the Tigers might be a football team, they’re also an employer, owing a duty of care to their employees. And in February, the High Court of Australia handed down a groundbreaking decision in a matter of Elisha v Vision where it held that Elisha could recover damages for psychiatric injury arising from a breach of the employment contract by an employer.” And so it proved, for this week, we found out, the Galvin camp has indeed sent a legal letter right up the Tigers’ Khyber Pass, pointing out much of the above, and alleging both bullying and an unsafe workplace. Yes, Galvin is back in the starting side – again, I would not be surprised if that, too, was on legal advice – but the whole debilitating affair has a long way to play out.\n\nAnd we are not even to the most extraordinary part. That came on Wednesday, when Tigers CEO Shane Richardson was interviewed by the Daily Telegraph. When it came to the club’s culture, he said, the Tigers were “outstanding”. No, really. Who remembers any other club, ever, where three senior members verbally attack another player on social media, and a younger member at that? I’ll wait. If that is “outstanding”, Richo, what does “seriously ordinary” look like?\n\nBut tell us, please do, your take on the Tigers putting out the press release that you were told by the Galvin camp would be a disaster – telling the world, what Galvin’s management had said quietly, that the young man wanted to move on at the end of his contract – but you released it anyway. “At the end of the day,” Richardson said, “my job is to make sure that the Wests Tigers are protected. And I believe what we did, I don’t believe it could be done any other way.” Lachie Galvin and coach Benji Marshall make eye contact at Tigers training. Credit: Renee Nowytarger Seriously? You HAD to point out that your brightest young star wanted to move on, and despite the fact that this resulted in a fortnight of shattering headlines and the young man needing a security detail, this was still a good idea? And “protected” the Tigers? Yes, Richo insisted.\n\n“It’s come out this week, we popped the pimple, we’ve moved on from it. I honestly believe that we couldn’t have done any better.” The “pimple”? What does a festering boil look like? “We couldn’t have done it any better”? Just what would things look like now if it had been handled badly?\n\nAs to your equal insistence that Galvin “has never once said to us, not one time has he said to us, that Benji’s not a good coach or can’t coach,” to my neophyte legal eyes, that only bolsters the young fellow’s legal case. You say, Richo, he never said that. But we all know he was dropped to reserve grade and became, for that fortnight, the most hated figure in the game, attacked by his own team for “disrespecting the coach” and vilified by a howling mob of social and traditional media, asserting he said EXACTLY that. But you say he never did. What are they going off, then? The only answer can be that very press release you were advised not to put out, but did anyway. Seriously, those quotes are simply gobsmacking. Blokes want to leave clubs all the time. It’s no big deal. It happens. But this has become a huge and embarrassing deal for the Tigers, precisely because of the way MANAGEMENT handled it. You say, very carefully, Galvin is not at fault. Who does that leave then? Why I won’t be watching SBW v Gallen Here is 42-year-old former AFL star Justin Koschitzke telling Channel Seven this week what it was like dealing with concussion throughout his career. He’d been badly concussed many times, and things were starting to go foggy, but he felt obliged to keep going.\n\n“[I kept thinking] it will pass ... and this will get better, because you’re in an environment where you don’t want to lose respect from your teammates, you don’t want to give an inch, you want to be in your armour because someone else is taking your spot [in the team]. What I thought was ‘manning up’ was to come back and play that year, but if I had my time again, there’s no way I would have played that year ... knowing what I know now.” He regrets it, bitterly. “Maybe knowing what I know now, I wouldn’t have played ever again. I can honestly say that. Why would I put myself in a situation to keep getting hit and keep getting hit, knowing what I know and what I feel like as a 42-year-old? But back then your bulletproof, right? You think this is going to get better.” But they didn’t. Every concussion is brain damage, and he can now see clearly just how disastrous the whole thing was for him. In a proper system, the game would have stepped in, and given him the tap on the shoulder: that’s enough now. Meanwhile, I see many people are excited by the prospect of 39-year-old Sonny Bill Williams and 43-year-old Paul Gallen – already with many concussions between them – soon getting in the ring and having a “super fight”.\n\nI am not. Read the above, again, and tell me you think it is a sporting contest you can morally support. What they said Billy Moore on the Bears coming back: “With my lovely wife, I’ve had a glass of champagne already today. This is the biggest day since 1922 ... I’m pretty f---ing happy.” Carlos Alcaraz: “I don’t want to be called Rafa’s successor. I want to be called Carlos Alcaraz Garfia.” We will bear that in mind, Carlos Alcaraz Garfia. The words of the late Pope Francis, when the Argentinian met Diego Maradona at the Vatican, were recalled this week: “So, which is the guilty hand?”\n\nOscar Piastri after winning the Saudi Arabian Grand Prix: “I’m more proud of all of those things [hard work in the off-season] than I am of the fact that I’m leading the championship because, ultimately, I want to be leading it after round 24, not round five.” Dallas Mavericks GM Nico Harrison on the Luka Doncic trade: “I did know that Luka was important to the fan base. I didn’t quite know it to what level.” Dylan Brown. Credit: Getty Images Dylan Brown on leaving social media: “I’ve told a few people, you get off Instagram, you don’t see anything, so I’m doing well.” Leeds manager Daniel Farke after they sealed promotion to the EPL with a 6-0 win, with Dutch forward Joel Piroe scoring four after a goal drought: “In the last few weeks his performances were better but the ball didn’t want to go in the net. It’s a bit like shaking a bottle of ketchup – all of a sudden everything comes out and that was a bit the case today.” Shades of Ogden Nash’s poem, The Catsup Bottle: “First a little, Then a lottle.”\n\nPhil Gould won’t bring Lachlan Galvin to the Bulldogs: “We are not involved in the Lachlan Galvin discussion and we won’t be involved in the Lachlan Galvin discussion.” Maybe. But with that promise and $5, I reckon I could get a cappuccino. Tasmanian Premier Jeremy Rockliff on their AFL team. Not sure he’s spoken to a Carlton fan recently: “This has to work. It has to work for Tasmania, it has to work for the AFL, it has to work not just for the next five, 10 years, but I want to make sure that the Tassie team is here in 100 years and Tasmanians are proud of it, just like Blues supporters and Collingwood supporters are proud of their team.” Nathan Cleary. Credit: NRL Photos Nathan Cleary after the Panthers beat the Roosters: “Tonight we wanted to just put in a really good performance and let the rest take care of itself, and just get that feeling back of what it feels like to be a Panther and the way we want to play.” Waratahs coach Dan McKellar after another bad loss when asked if he was disappointed with it: “Are we disappointed? Are we disappointed? What do you think? What would you think? Yes, we are disappointed.”\n\nKnights coach Adam O’Brien when asked at the post-match press conference what he thought about an incident in their loss to the Sharks: “What do you think?” Journalist: “No one really cares what I think.” Skateboarder Chloe Covell on coming back from injury: “I just had to get over it and get back on the skateboard.” Bill Lawry on the death of the Australia’s former Test opener and cricket commentator Keith Stackpole, 84: “We have lost not only a great Victorian but a real good citizen. He was great to have as a friend. He has been wonderful.” Fair enough, and vale “Stacky”. But interesting, yes? North of the Murray, and south of the Tweed, we in the geographical area known as NSW never farewell a great with, “He was a great New South Welshman”. Team of the week North Sydney Bears. With the euphoria around their return, makes you wonder why they were ever kicked out. Still, welcome back!\n\nGold Coast Suns. No sooner did TFF write “Gold Coast Suns. Last undefeated AFL side this season. Stop the world – I want to get off”, than the undefeated Suns lost to third-last Richmond. The Kiss of Death powers are still strong! Vaibhav Suryavanshi. The 14-year-old marked being the youngest ever IPL player by hitting his first ball for six! Loading Melbourne City. Won a second successive A-League Women premiership. Oscar Piastri. Our Oscar has won three of the past four Formula 1 races and is in top spot, with just 19 races to go! (I know. I was surprised, too. THAT many Formula 1 races in a year? Who knew?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/woman-dies-after-falling-80-metres-down-sunshine-coast-waterfall-20250426-p5lueg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman dies after falling 80 metres down Sunshine Coast waterfall",
        "publish_date": "Sat, 26 Apr 2025 09:48:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Woman dies after falling 80 metres down Sunshine Coast waterfall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/they-didn-t-know-what-a-schooner-was-we-had-to-explain-a-meat-raffle-20250422-p5lt9s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘They didn’t know what a schooner was. We had to explain a meat raffle’",
        "publish_date": "Sat, 26 Apr 2025 09:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "New York: When Old Mates Pub staged a special opening party on a cold night in February, the queue snaked around the block. By 9pm, the joint had run out of beer.\n\nIn the weeks since, the Australian bar in Lower Manhattan has become a meeting place for expats and tourists, and a hotspot for Aussie events. Uber-cool Melbourne DJ Dom Dolla played a secret set there ahead of his sold-out shows at Madison Square Garden, and it hosted the NYC launch of underwear brand Bonds, featuring model Robert Irwin.\n\nOld Mates, a new Australian pub in New York, has proved a hit with famously fickle New Yorkers. Credit: Alex Towle\n\nBut Old Mates has also seen an influx of less obvious guests: Americans. In a short time, the pub has become a hit with famously fickle New Yorkers.\n\n“So many Americans,” says general manager Amanda Verratti, an ex-Sydneysider who has grown used to dealing with lost-in-translation moments. “They didn’t know what a schooner was. We had to explain a meat raffle. The amount of people who thought I meant a charcuterie board … Explaining AFL and NRL to people, I’ve taken great joy in it.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/brayshaw-serong-star-as-dockers-beat-crows-in-perth-20250426-p5luee.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brayshaw, Serong star as Dockers beat Crows in Perth",
        "publish_date": "Sat, 26 Apr 2025 09:44:01 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "Andrew Brayshaw and Caleb Serong have put on a midfield masterclass to lead Fremantle to an 18-point Anzac Day victory over Adelaide at Optus Stadium.\n\nBrayshaw racked up 37 disposals, six clearances and 522m gained while Serong tallied 32 possessions and 10 clearances in Friday night’s match as Fremantle posted a 12.13 (85) to 9.13 (67) win.\n\nRiley Thilthorpe of the Crows talks to his team mates during the 2025 AFL Round 07 match between the Fremantle Dockers and the Adelaide Crows at Optus Stadium on April 25. Credit: AFL Photos via Getty Images\n\nA bumper crowd of 53,048 turned up for Fremantle’s annual Len Hall Tribute Game, with Brayshaw winning the inaugural Arthur Leggett Medal as best afield.\n\nDockers coach Justin Longmuir questioned his team’s toughness in the wake of last week’s shock 10-point loss to Melbourne.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/inspiration/sorry-santa-this-winter-wonderland-is-actually-more-magical-in-autumn-20250416-p5lsa2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sorry, Santa: This winter wonderland is actually more magical in autumn",
        "publish_date": "Sat, 26 Apr 2025 08:22:00 +1000",
        "category": "finance",
        "authors": [
            "Rob Mcfarland"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Snow, reindeer, Santa Claus. For most people, the far north of Scandinavia is synonymous with Christmas – a twinkling, wintry wonderland of snow-smothered forests and rosy-cheeked good cheer. Visit during winter and you’ll certainly find a version of that. But you’ll also encounter temperatures that regularly plummet below minus 30 degrees and days where the sun never peeks above the horizon. While every season in Lapland has its appeal, there’s a special allure to what the indigenous Sami people call “tjaktjagiesse” – the transition from summer to autumn that starts in August. It’s a period characterised by crisp mornings, warm sunny days and a colourful fanfare of autumn foliage. It’s the ideal time to venture outdoors – to fish, hike, bike and forage – and the lengthening nights offer the potential of glimpsing the fabled northern lights. Although Lapland officially includes the northernmost parts of Norway, Sweden, Finland and the Kola Peninsula in Russia, the region one hour north of Lulea (pronounced Loo-lay-oh) in Sweden is particularly compelling. Map of Swedish Lapland. Credit: A forested wilderness of raging rivers and fish-filled lakes just below the Arctic Circle, it harbours a cluster of remarkable properties with innovative excursions and fabulous fare.\n\nAdvertisement\n\nIt’s also home to an intriguing cast of outdoor enthusiasts who embody the hardy pioneer spirit required to live and work in a place of climatic extremes. The secret of which appears to be drinking an inordinate amount of coffee. Santa’s stunt double and me “This is the worst weather for walking with bears,” says Mikael Suorra as we zigzag through bushy undergrowth in a forest of birch and pine trees. We’re hiking into a blustery wind, which means that any bears in the vicinity are unlikely to smell us or hear us. This is a concern given Sweden’s forests are home to around 2500 brown bears and we just passed a clearing that had been completely stripped of berries – presumably by a hungry bear. Not that Suorra is concerned. As the owner of Hide and See nature tours, he’s spent years exploring these undulating woodlands near the village of Harads and has been mock-charged by both a bear and a two-metre-high moose. The secret with bears, he tells me, is not to play dead, but rather to shout and make yourself look as large as possible. And what happened with the moose? “I just hid behind a tree.” During our two-hour hike, he explains that the “forest is always talking to you”. Moss on a tree trunk grows on the northern side while the branches reach south towards the sun.\n\nAdvertisement\n\nI learn how to clear blocked sinuses using formic acid emitted by ants (a skill I hope I never actually have to use) and the most effective way to collect their protein-rich eggs to fry up for dinner. After a lakeside “fika” (a cup of strong black coffee and a blueberry muffin made by his daughter), he demonstrates his most-prized skill: moose calling. Using a special conical loudhailer, he imitates the mournful cry of a cow in heat. “You can imagine how disappointed the bulls are when they turn up and find me,” he says. In Sweden, the right to enjoy nature is enshrined in law. The right to enjoy nature is so precious to Swedes, it’s enshrined in law. Called allemansratten, it’s a public access prerogative that means you can hike, forage and camp almost anywhere, provided you’re considerate and don’t litter. That afternoon I join Robert Westin, owner of Arctic Adventure, for a kayak trip on the nearby Lule River – a broad, 450-kilometre-long waterway that starts in the far north of the country. After selling his IT security business in 2019, he now offers fishing, kayaking and snowmobiling tours. “My father was a professional trapper and hunter,” he says, “so I spent every weekend in the wilderness.” After paddling across the 200-metre-wide river, we skirt an island dotted with blood-red summer cottages and come ashore in a sheltered backwater by a small wooden hut.\n\nAdvertisement\n\nCanoeing Naturally, the first thing he does is light a fire to brew coffee. On an average day, he reckons he drinks at least 20 cups. “If you can’t make coffee in Sweden,” he says, smiling, “you won’t find a wife.” Sitting in the warm, late-afternoon sun among a verdant landscape of fragrant pines, it’s hard to believe this entire river freezes solid in winter, transforming into a frosty playground for snowmobilers and ice fishers. The coldest temperature Westin has experienced is a frankly unimaginable minus 52 degrees. “It was fine,” he says. “You just need the right clothing.” For the native Sami, who’ve been living in the Arctic for more than 2000 years, the right clothing was primarily animal hides and fur. Like many indigenous groups, they survived in the extreme conditions by utilising the natural resources around them. The following day I meet Lars Eriksson, an 80-year-old Sami reindeer herder, at his property in the small hamlet of Flakaberg. With his snow-white beard, colourful wool gakti (a traditional tunic) and elaborately decorated leather belt, he could easily pass as Santa’s stunt double. “My life is reindeer,” he says, explaining that he would spend the summers tending his herd in the forest before moving them to the coast in winter. All the reindeer in Sweden belong to the Sami; a mark on each animal’s ear uniquely identifies its owner. All the reindeer in Sweden belong to the Sami. Credit: iStock\n\nAdvertisement\n\nHaving sold most of his herd, he now dwells in the same wooden house with no electricity where five generations of his ancestors lived. “Everything has changed,” he says, wistfully. “You used to be able to survive on 400 reindeer. Now you’d need 1000.” He explains that climate change and excessive logging have made it harder for the reindeer to find lichen, their main food source, so herders have to supplement their diet with hay. Reindeer are unusual in that both males and females have antlers, which regrow every year. In an impressive feat of yogic dexterity, they shape them using their back legs, a process done by feel to ensure they grow symmetrically. When a reindeer is slaughtered, the Sami use everything, even down to the ligaments, which are dried and repurposed as thread. Having devoted his life to reindeer, Eriksson is now happy to be home with his wife and a small herd of 40 animals that live in the surrounding forest. “I know every one of them,” he says, fondly. “They all have different personalities.” Running with the pack Training for winter – booties and a wheeled cart for the huskies.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/missing-sausage-dog-valerie-found-after-529-days-at-large-20250426-p5ludn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Missing sausage dog Valerie found after 529 days at large",
        "publish_date": "Sat, 26 Apr 2025 07:24:08 +1000",
        "category": "finance",
        "authors": [],
        "text": "Missing sausage dog Valerie found after 529 days at large\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/dignitaries-converging-on-rome-for-funeral-of-pope-francis-20250426-p5ludl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dignitaries converging on Rome for funeral of Pope Francis",
        "publish_date": "Sat, 26 Apr 2025 07:22:08 +1000",
        "category": "finance",
        "authors": [],
        "text": "Dignitaries converging on Rome for funeral of Pope Francis\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/instagrammers-behind-aus-foodiee-revealed/f5n04ahwo",
        "title": "These Instagrammers want to try every Australian dish. Their favourite might surprise you",
        "publish_date": "Sat, 26 Apr 2025 01:09:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Aus Foodiee has become one of the more wholesome accounts on the internet. A narrator who seems to be a newcomer to Australia tries iconic dishes like a vanilla slice, pavlova, supermarket hot chook, Bubble O'Bill ice cream and a Bunnings 'sausage sizzle'.\n\n\n\n\n\nThe comment section is full of Australians praising the narrator's calm Korean commentary and sense of wonder at everyday foods, with fans offering recommendations for more classics, such as Arnott's Shapes and Milo.\n\n\n\n\n\nAfter feedback about how they prepared a hot cross bun \"wrong\", Aus Foodiee thanked fans and gave it another go in a second video, where they were judged to have prepared it properly — toasted with lots of butter.\n\n\n\n\n\nWhat fans don't know is that the account is actually the work of two Korean men — Mingoo Lee and Jungho Choi.\n\n\n\nAbout Aussie life and going viral\n\nIn their first-ever interview — where they revealed their faces and names — the Aus Foodiee creators spoke to SBS News about how life in Australia has been a surprising treat since arriving two months ago on working holiday visas.\n\n\n\n\n\n\"Some people don't use shoes here. I don't know why,\" Lee said, laughing.\n\n\n\n\n\n\"The traditional Aussie has a hairstyle like yours.\" He pointed to this author's mullet and laughed even harder.\n\n\n\n\n\nLee, who worked as a videographer in Korea, is typically the one who directs, films and edits the videos.\n\n\n\n\n\nBut he doesn't cook, leaving that job to Choi, who has worked as a chef in his day job for over seven years.\n\n\n\n\n\nThe reason they don't show their faces is that the videos are easier to edit if there are no shots of people, they said, half-joking.\n\n\n\n\n\nThe pair said they have been \"best friends for 20 years\".\n\n\n\n\n\nThey met as eight-year-olds and have maintained a close friendship despite moving to separate cities — Lee lived in Seoul and Choi lived in Busan.\n\n\n\n\n\nIt's a far cry from regional Victoria where they're living now, juggling foodie shoots in between work and travel to Melbourne to film at restaurants.\n\n\n\nLee said he created the account to help people understand and connect with other cultures, and said what he's learned along the way has helped him adapt to life in Australia.\n\n\n\n\n\n\"I didn't expect lots of people's interest, but I think I want to make a very helpful account. And I think food has a very special energy,\" he said.\n\n\n\n\n\n\"I didn't expect us to have an encouraging and powerful effect, but someday we are going to make this channel bigger and bigger and bigger.\"\n\n\n\nREAD MORE Is Indonesian the new Thai? Why the cuisine is having a moment in Australia\n\nThe sausage sizzle phenomenon\n\nTheir most popular video, with nearly a million views on Instagram and TikTok combined, is the homemade sausage sizzle.\n\n\n\n\n\nChoi caramelises onions, pan-fries a packet of sausages and serves them on white bread with ketchup.\n\n\n\n\n\nSpeaking in Korean with auto-generated English captions, Lee says in the video: \"This is said to be the national dish of Australians ... I think it's also called Bunnings sausage sizzle.\n\n\n\n\n\n\"How to make it is easier than you think.\"\n\n\n\nAs is often the case with their dishes, fans who frequently comment on their posts gave them another idea, so they filmed a trip to get a sausage in bread from Bunnings, describing it as \"meaningful food\".\n\n\n\n\n\nChoi and Lee said they weren't sure why so many people loved the sausage video in particular, but they thought the meal was one of the tastiest they've had.\n\n\n\n\n\nThe duo laughed, saying they were surprised the sausages were so thin.\n\n\n\n\n\nHaving also learned about it from the comments section, they will go to get a 'democracy sausage' on election day on 3 May .\n\n\n\nWhat are the duo's favourite dishes?\n\nSo what's Lee's favourite dish he discovered in two months in Australia?\n\n\n\n\n\nThe kebab.\n\n\n\n\n\nChoi's favourite is the hot cross bun, though he really enjoys Japanese food.\n\n\n\n\n\nThey said Australia's food scene should be described as multicultural.\n\n\n\n\n\n\"You can try every country's food, but some are not as good as others,\" Lee said.\n\n\n\n\n\nHe said the Korean food they tried in Melbourne was nice but not spicy enough.\n\n\n\n\n\nThe duo plan to make as many videos as they can while in Australia, most likely whatever their audience suggests Choi should cook.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/valerie-found-after-529-days-missing-dachshund-returns-fit-and-well/s36wfjca8",
        "title": "'Finally safe': Valerie the dachshund found 'fit and well' after 529 days on the run",
        "publish_date": "Sat, 26 Apr 2025 00:54:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "The long search for Valerie, the missing miniature dachshund, is over — and it has ended happily.\n\n\n\n\n\nAn incredible 529 days after the dog went missing on South Australia's Kangaroo Island, she was found by a volunteer-led Kangala Wildlife Rescue group.\n\n\n\n\n\n\"After weeks of tireless efforts by Kangala Wildlife Rescue volunteers and partner organisations Valerie has been safely rescued and is fit and well,\" the group said in a post on social media.\n\n\n\n\n\n\"Valerie is finally safe and able to begin her transition back to her loving parents.\"\n\n\n\n\n\nAccording to the group, the search involved 1,000 hours spent by volunteers, 5,000km travelled in private cars and the use of various cameras, traps, and technologies.\n\n\n\nWhat happened to Valerie the dachshund?\n\nIn November 2023, Valerie, wearing a pink collar, went missing while travelling with her owners, Georgia Gardner and Josh Fishlock, on Kangaroo Island.\n\n\n\n\n\nDespite a five-day search, the couple were unsuccessful in finding her, and they eventually returned home.\n\n\n\n\n\nEarlier this year, more than 12 months after Valerie was last seen, hopes were raised again after reports of a dachshund with a pink collar were spotted.\n\n\n\n\n\n\"Based on firsthand accounts and video evidence, we now know that Valerie is alive,\" Kangala Wildlife Rescue group said in mid-March.\n\n\n\n\n\n\"She runs at the first sign of humans or vehicles, and despite the best efforts of dedicated Island locals, Valerie has been impossible to catch.\"\n\n\n\n\n\nEarlier this month, another video of the dachshund was shared showing her near a trap.\n\n\n\nValerie had been missing for more than 500 days. Source: Supplied / Kangala Wildlife Rescue It was reported that Valerie frequently visited the site.\n\n\n\n\n\n\"She has become confident entering the large dog trap, which has been set up like her own little room with her toys and bed from home,\" the rescue group said.\n\n\n\n\n\nThe search has finally concluded with the group posting a video of Valerie on Friday.\n\n\n\n\n\n\"This successful outcome highlights the vital role that wildlife rescue organisations play in our community, extending their expertise and compassion to all animals in need,\" the group said.\n\n\n\n\n\n\"Valerie's story is a reminder that hope and determination can lead to incredible results.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/prevention-is-better-than-the-cure-fighting-the-tanning-trend/wv84mvm94",
        "title": "Prevention is better than the cure: fighting the tanning trend",
        "publish_date": "Fri, 25 Apr 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n“Say these simple words: 'Slip, Slop, Slap! It sounds like a breeze when you say it like that. Slip, Slop, Slap! In the sun this summer say 'Slip, Slop, Slap!' Slip, Slop, Slap!'\n\n\n\n\n\nIn 1981, the famous Slip, Slop Slap campaign stormed our screens and airwaves.\n\n\n\n\n\nSid the Seagull was enlisted to encourage Aussies to seek protection from ultraviolet or U-V damage from the sun.\n\n\n\n\n\n44 years on and the Cancer Councils of Australia and Bureau of Statistics have done a study that shows while the song still slaps.. it seems the message has slipped.\n\n\n\n\n\nProfessor Anne Cust studies cancer in populations as an epidemiologist and Chair of the Cancer Council's National Skin Cancer Committee.\n\n\n\n\n\n\"One in five young Australians have tried to get a suntan in the past year and only about half of Australians are using adequate sun protection.\"\n\n\n\n\n\nThis alarming trend comes as the rate of melanoma continues to rise - 16,800 Australians will likely be diagnosed this year - one every thirty minutes.\n\n\n\n\n\nGeneration Z are educated on sun safety - so why aren't younger Australians following the rules?\n\n\n\n\n\nDoctor Stephen Dann - a marketing expert at the Australian National University - says social media is a big factor.\n\n\n\n\n\n\"The first thing is they are a young audience who are very driven by immediate outcomes. I get a tan, I look aesthetically pleasing to myself and the people around me. I look good. I feel great. I have a consequence coming to me in 35 years' time. That is future me's problem.\"\n\n\n\n\n\n2024 Australian of the Year, Professor Georgina Long, is the joint number one expert in the world in melanoma research.\n\n\n\n\n\nShe is frustrated by the rules around what influencers in Australia can advertise online.\n\n\n\n\n\nThey can't spruik products with an S-P-F rating including sunblock, but they can use their platforms to share information about non-therapeutic goods, like tan accelerants.\n\n\n\n\n\n\"So, people put these creams on to go in the sun and get a more accelerated tan more quickly. That is dangerous, that is a carcinogen, that is cancer causing. Do we need legislation about that? Do we need to free up guidelines around advertising good sunscreens. At the moment, good sunscreens, we're not able to advertise.\"\n\n\n\n\n\nSince 2022, the Therapeutic Goods Administration banned social media testimonials around products or devices that claim a medical or therapeutic benefit - including skincare and vitamins.\n\n\n\n\n\nThe rule can apply to any description of the qualities of a product with S-P-F protection, including sunblock.\n\n\n\n\n\nDr Dann says the rules that were designed to protect consumers, may have had the opposite effect.\n\n\n\n\n\n\"They were more worried about food contamination, or someone being offered a miracle cure for something that wasn't curable. That sunscreen got swept up as a consequence was one of those unfortunate outcomes of good policy, bad implementation.\"\n\n\n\n\n\nAs TikTok trends, including hashtag sunburnt tan lines gather hundreds of millions of views - the Cancer Council is fighting back with its End the Trend campaign.\n\n\n\n\n\nSix high profile Australian social media influencers have spent the past month staying out of the sun, rejecting fake tan and guiding their followers to the shade.\n\n\n\n\n\nOnline influencer Tayla Broad was motivated to end the trend, because she saw how skin cancer impacted loved ones.\n\n\n\n\n\n\"We can all be aware just how damaging the tanning culture can be, even with the likes of fake tanning. So, join me on this journey to challenge the way we view tanning and why we feel the need to tan to be beautiful.\"\n\n\n\n\n\nProfessor Cust sees the irony in tanning trending in an online space dominated by beauty.\n\n\n\n\n\n\"UV radiation that you get from the sun, there are different types of UV radiation. UVA is responsible for a lot of the ageing that we see from the sun exposure and the UVB is responsible for a lot of the burning. So, if you are concerned about beauty, it is much better to stay out of the sun.\"\n\n\n\n\n\nProfessor Long has pioneered and led research into immunotherapy treatments for melanoma that mean a diagnosis that was deadly in 2010, now has an above-fifty-fifty chance of a cure.\n\n\n\n\n\n\"There is a handshake that the cancer cell would give the immune system or the immune cells so that the immune cells would say 'this is my friend, this is my family, off I go, I won't kill you.' But these drugs, checkpoint inhibitors, interrupt that handshake and allow those immune T cells to kill the cancer cells, the melanoma cancer cells. So those drugs which we started working with around that 2010 period absolutely revolutionised how we later treated melanoma.\"\n\n\n\n\n\nIt is a monumental feat she and her colleagues have achieved.\n\n\n\n\n\nBut Professor Long is united with experts who agree prevention is the best cure - and the second line of defence is a skin check.\n\n\n\n\n\nAn online melanoma risk assessment tool is available at melanoma risk dot org dot a-u.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-jameela-jamil-thinks-we-have-stockholm-syndrome-for-the-patriarchy/tiuk85w27",
        "title": "Why Jameela Jamil thinks we have Stockholm syndrome — for the patriarchy",
        "publish_date": "Fri, 25 Apr 2025 20:43:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "This article contains references to eating disorders.\n\n\n\n\n\nJameela Jamil is the first to admit she's not perfect.\n\n\n\n\n\nIn fact, it's something the English actor, writer, podcaster, and advocate actively embraces.\n\n\n\n\n\n\"Women have this pressure that is put upon us — and then we put upon ourselves — that we have to be perfect from the start,\" she says ahead of her \"very fun, very unfiltered\" Australian speaking tour.\n\n\n\n\n\nBest known for her roles in The Good Place and Marvel's She-Hulk, Jamil has garnered a loyal following for her direct, passionate, and often humorous commentary on everything from body image, mental health, and gender equality to reproductive freedom , disability, and LGBTIQ+ rights.\n\n\n\nJamil starred in The Good Place, a comedy set in the afterlife, alongside legendary actor Ted Danson. Source: Supplied / NBC Her anti-perfectionist stance has made her something of a poster girl for it.\n\n\n\n\n\n\"I think the reason I've made it quite far in my life for someone who came from nothing and didn't know anyone, had no connections, is because I have the audacity of a man,\" says Jamil.\n\n\n\nI have the audacity to know that it's not my responsibility to be perfect when I just start trying something for the first time.\n\n\"I don't know if I'm going to be good at it, but I throw myself in and I am proud of myself for that.\"\n\n\n\n\n\nIt's an attitude that the 39-year-old credits with giving her a life that's a far cry from the \"dignified\" one she envisioned when she was younger.\n\n\n\nJamil grew up wanting to be a doctor. She says her younger self would probably think she's \"a massive goon\" and be \"very embarrassed\" by her. Source: Instagram / Jameela Jamil\n\nAn unconventional path to fame\n\nA chance encounter with a producer in a London pub in 2008 led Jamil, who was working as an English teacher, to land a job as a TV presenter.\n\n\n\n\n\nShe later moved into radio presenting, becoming the first female solo host of BBC Radio 1's Official Chart show, before upping sticks to Los Angeles to pursue screenwriting.\n\n\n\n\n\nIt was there, after securing her first-ever acting role in 2016 as British socialite Tahani Al-Jamil in the hit TV series The Good Place, that she found global fame.\n\n\n\nJameela Jamil (right) rose to prominence in the UK as a presenter on the youth entertainment show T4. Source: Getty / Ian West - PA Images But as her profile increased, so did her impulse to speak out.\n\n\n\n\n\n\"I don't know how to not say anything,\" she says.\n\n\n\n\n\n\"It doesn’t feel like there’s a choice whether or not you can say something when you see injustice.\"\n\n\n\n\n\nJamil's growing frustration with women's value being measured by a number on the scale led the self-described \"feminist-in-progress\" to found the I Weigh movement in 2018.\n\n\n\n\n\n\"If you want something to change, if you complain about a problem, then surely it would only make sense, logically, to try and do something about it?\" she says of her advocacy efforts.\n\n\n\nAfter Jamil's post went viral, she turned it into social media movement. Source: Instagram / Jameela Jamil Beginning as a social media campaign encouraging people to publicly celebrate their achievements and contributions to society rather than focus on their size or appearance, I Weigh later evolved into a \"community allyship platform\". It was relaunched last year as Move For Your Mind.\n\n\n\n\n\nWhile Jamil's unashamed outspokenness and advocacy have been praised by many and led to plaudits such as being named one of Time magazine's 25 most influential people in 2019, she cringes at being put on a pedestal or viewed as \"some type of guru or master\".\n\n\n\nIt's not a call to arms … I'm more trying to start big, public conversations about [these issues] so we can stop just being lulled into submission all of the time.\n\n\"It's normal to care. It's not normal to not care.\"\n\n\n\n'Pretty privilege' and pile-ons\n\nNaturally, there have been questions about whether a statuesque, conventionally attractive cisgender woman (Jamil's name literally means \"beautiful\" in Arabic) in Hollywood is qualified to speak about issues like diet culture and fatphobia, particularly when much of the associated harm is perpetuated by celebrities and influencers.\n\n\n\n\n\nJamil acknowledges she is more privileged than most. At the same time, she has experienced firsthand the long-term harm that comes with trying to meet unrealistic and ever-changing beauty standards, as well as how brutally women, particularly those in the public eye, can be treated for simply existing.\n\n\n\nEarly in her career, Jamil was subject to tabloid scrutiny in the UK, which criticised her for being too thin and then later mocked her for gaining weight as a result of medication she was taking.\n\n\n\n\n\nAt the same time, she was battling an eating disorder that had developed in her teens, something Jamil says has caused lasting damage to her bone density, digestive system, kidneys, liver, and heart.\n\n\n\nShe says part of the pull to conform to beauty standards stems from an underlying desire to belong.\n\n\n\n\n\n\"There's this feeling of 'I'll be left behind if I don't obey the group and do the thing that will allow me to be included,' because it's real that if you are skinnier or you look younger or you have pretty privilege, you're more likely to be included.\"\n\n\n\n\n\nAs well as speaking publicly about the racism, classism and appearance-based abuse she experienced growing up — including being \"very violently\" bullied for being South Asian — Jamil has been vocal about the impact of multiple chronic health conditions she's experienced throughout her life, such as Ehlers-Danlos syndrome, post-traumatic stress disorder, depression, anxiety, mercury poisoning and coeliac disease.\n\n\n\nHer propensity to be an \"open book\" about her life has sometimes come back to bite her. In 2020, a string of Instagram posts went viral, alleging Jamil had fabricated details about her injuries and illnesses.\n\n\n\n\n\nThe author of the posts even went so far as to suggest Jamil had Munchausen syndrome, a mental disorder in which a person fakes or exaggerates illness to gain attention and sympathy.\n\n\n\n\n\nJamil publicly refuted the claims, as did her long-term partner, musician James Blake, saying they highlighted how people with chronic health conditions and invisible disabilities are often disbelieved.\n\n\n\n\n\nWhile Jamil has endured her fair share of trolling and abuse online, not all of the criticism levelled at her has been unjustified.\n\n\n\n\n\nOne such example is her past \"slut-shaming\" of other female celebrities, including Miley Cyrus, Beyonce, and Rihanna.\n\n\n\nJamil lives in Los Angeles with her boyfriend, English musician James Blake. Source: Getty / David Crotty/Patrick McMullan Jamil says she regrets some of the things she's said and how she's said them and takes accountability for that.\n\n\n\n\n\n\"But you can regret something and still be glad that you did it because that's how I learned what to do differently next time,\" she says of how she used to communicate online.\n\n\n\n\n\n\"If I hadn't made those mistakes, I wouldn't have then gone on to go, 'Oh, okay, I actually need to change course', and this has made me a better and wiser person.\"\n\n\n\n'Perfection is the enemy of progress'\n\nIn fact, self-accountability has become a core tenet of Jamil's advocacy.\n\n\n\n\n\nAmid the rise of far-right extremism around the world, infighting among the left, and some hard-won rights and freedoms, particularly for women, \"taking a huge backswing\", Jamil's belief that \"perfection is the enemy of progress\" is perhaps more vital than ever.\n\n\n\n\n\n\"We don't really have time for everyone to wait to be the perfect feminist or the perfect activist,\" she says.\n\n\n\nYou just have to scrap in now before we end up in a bunch of red coats with white bonnets.\n\nJamil has waged a war against diet culture and beauty standards. Source: Instagram / Jameela Jamil/Stylist Magazine It's no surprise to Jamil that the recent sociopolitical regression, particularly in the US, has coincided with thinness being glamorised once again and the increasing normalisation of cosmetic procedures and weight loss injections , largely pedalled via social media.\n\n\n\n\n\nRather, she says, it's \"by design\".\n\n\n\n\n\n\"The only reason any grown adult man would want a grown adult woman to look and behave and have the body of a barely pubescent girl is to keep her small in every way; make sure she's not eating enough so she's not got the strength to fight for her rights, make sure she's consumed and worried and panicking over every tiny 'imperfection' on her face so she's distracted, she doesn't have time to organise; make sure she's not sleeping enough, make sure she's got low self-esteem.\"\n\n\n\nJamil was named one of Glamour's magazine's women of the year in 2024. Source: Getty / Karwai Tang But Jamil says she's perplexed why, after so much positive progress around things like fat liberation, body positivity, feminism, and understanding the misogynistic roots of beauty standards, women are still willing to comply.\n\n\n\n\n\n\"It's honestly creeped me out watching grown women in 2025 lap it up again as if we learned nothing in the last 10 years,\" she says while also emphasising she supports people's right to do what they want to their own bodies.\n\n\n\n\n\n\"It's like Eternal Sunshine of the Spotless Mind happened, and everyone's brains just got wiped of everything that we all collectively discussed, because we have Stockholm syndrome for the patriarchy — and we have to just own that.\"\n\n\n\n'We're all guilty of it'\n\nJamil, admittedly, isn't entirely immune to the pressure to conform.\n\n\n\n\n\n\"There's no way I would wear the dresses I wear if I didn't live with a man that I wanted to sleep with. I would be wearing much more comfortable clothes, I wouldn't wash my hair, I don't think I'd brush my teeth,\" she says with a laugh.\n\n\n\n\n\n\"We're all guilty of it — but to what extent are you willing to punish or risk your body, your life, and your mental and physical health for a patriarchal standard?\"\n\n\n\nThe beauty and diet industry will always make sure that you feel like a pig, no matter what you do.\n\nThe cyclical and, at times dangerous nature of beauty standards is largely why Jamil has sworn off undergoing cosmetic surgery and treatments, such as botox and fillers .\n\n\n\n\"I hated being young, I love being older, I don't want any memory of what life was like when I was too young to have any wrinkles,\" says Jamil Source: Getty / Marla Aufmuth Like imperfection, ageing naturally and entering her \"crone era\" is something she's actively embracing — and hopes to inspire others to do as well. ('Crone era' is a term used in some feminist circles to describe a phase marked by the wisdom of age.)\n\n\n\n\n\n\"I want my 85-year-old self to like who I am now. I want her to feel like I was looking out for her, that I was excited for her arrival, and I wasn't dreading it, and doing everything I could to avoid it.\n\n\n\n\n\n\"I don't want to preserve youth forever … These wrinkles that I'm getting are ones that have been formed from me frowning and figuring out how f**ked the world is, and I'm glad for them. They're lines of wisdom.\"\n\n\n\nFinding humour in disaster\n\nWith so much heaviness in the world right now, Jamil's focusing her energy on injecting more humour into her work.\n\n\n\n\n\n\"Everything's getting too dark. It's too dark. I can't take it anymore. I'm going to explode,\" she says.\n\n\n\n\n\n\"We all need a release.\"\n\n\n\nNext month, she's launching a new comedy podcast, Wrong Turns, which will feature \"some of the funniest people in the world\" sharing their \"best disaster stories\".\n\n\n\n\n\n\"Every time you hear about something terrible or embarrassing happening to someone, there's always this need for us to turn it into an inspirational, teachable moment … [but] sometimes you don't get wiser.\n\n\n\n\n\n\"Sometimes things are just shit, and we need to accept that and laugh about it.\"\n\n\n\n\n\nAn Evening with Jameela Jamil will take place at Sydney's State Theatre on 26 April, Brisbane's QPAC Concert Hall on 27 April, and Melbourne's Hamer Hall on 28 April.\n\n\n\n\n\nReaders seeking support for body image concerns and eating disorders can contact Butterfly Foundation on 1800 33 4673. More information is available at butterfly.org.au\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/elon-musk-doge-what-next/agkepkdb8",
        "title": "Elon Musk’s DOGE has caused chaos. Now he's stepping back, what might come next?",
        "publish_date": "Fri, 25 Apr 2025 20:41:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tesla CEO Elon Musk announced this week that his work with the US Department of Government Efficiency (DOGE) will \"drop significantly\".\n\n\n\n\n\nIn a conference call with Tesla stakeholders, he vowed to only spend \"a day or two per week on government matters\" starting from May.\n\n\n\n\n\nJust before the announcement, Tesla shares closed nearly 4 per cent higher after experiencing their biggest one-day fall in four-and-a-half years.\n\n\n\n\n\nThe Reuters news agency reported that Tesla has been facing uncertainty from the Trump tariffs and \"shifting global trade policies\", adding that the company's vehicle revenue dropped by 20 per cent and net profit by 71 per cent in the first quarter this year — the time since United States President Donald Trump took office and Musk started working at DOGE.\n\n\n\nREAD MORE Elon Musk to scale back at DOGE amid falling Tesla profits\n\nOver the same period, hundreds of protests against Tesla have been organised outside dealerships and on social media around the world. Dubbed the 'Tesla Takedown', the movement is urging people to stop buying Tesla products, sell off Tesla stock, and join the protests.\n\n\n\n\n\nSome Tesla dealerships have also been vandalised, which Trump called \"domestic terrorism\" while vowing the perpetrators would \"go through hell\".\n\n\n\nWhat is DOGE, and how much has it saved?\n\nDespite its name, DOGE is not an official government department in the US administration.\n\n\n\n\n\nThe advisory body was created by Trump during a barrage of executive orders he signed on 20 January, the day of his inauguration.\n\n\n\n\n\nSeveral DOGE staff appear to be young people from technology backgrounds with limited government experience.\n\n\n\n\n\nMusk has been quoted as saying DOGE aimed to cut US$1 trillion ($1.5 trillion) from the federal budget in a bid to reduce government debt. This was partly to be achieved by \"mass headcount reductions across the federal bureaucracy\".\n\n\n\nLast month, over 200 \"Tesla Takedown\" protets took place around the globe. Source: SIPA USA, AP / Kirsty Wigglesworth However, earlier this month he told a US cabinet meeting that target had been drastically revised down to US$150 billion ($230 billion) for the financial year.\n\n\n\n\n\nTo date the DOGE website claims it has saved US taxpayers US$160 billion ($284 billion) through the mass government layoffs, pulling back funding from programs and shutting government agencies.\n\n\n\n\n\nBut the claimed savings have been disputed, and at times the group has published incorrect figures.\n\n\n\n\n\nReuters found 20 instances where the staff and funding cuts led to purchasing bottlenecks and increased costs; paralysis in decision-making; longer public wait times; higher-paid civil servants filling in menial jobs, and a brain drain of scientific and technological talent.\n\n\n\n\n\n\"DOGE is not a serious exercise,\" said Jessica Riedl, a fellow at the Manhattan Institute, a fiscally conservative think tank that supports streamlining government. She estimates DOGE has only saved US$5 billion ($7.8 billion) to date, and believes it will end up costing more than it saves.\n\n\n\nThe examples span 14 government agencies and were described in Reuters interviews with three dozen federal workers, union representatives, and governance experts.\n\n\n\n\n\nAlthough these accounts do not provide a comprehensive picture of DOGE's project to drastically cut the cost and size of the federal bureaucracy, Reuters reported they do reveal collateral damage resulting from the group's efforts to make the sprawling federal bureaucracy more efficient.\n\n\n\n\n\nIn response to questions about the impact of DOGE's cuts on government efficiency, White House spokesman Harrison Fields told Reuters in a statement that Musk's team \"has already modernised government technology, prevented fraud, streamlined processes, and identified billions of dollars in savings for American taxpayers.\"\n\n\n\nWhat’s next for DOGE?\n\nWesley Widmaier, a US-born professor at Australian National University's Department of International Relations, believes it's likely many DOGE employees also worked at X (formerly Twitter), which Musk acquired in 2022. At the time, Musk fired a large number of its employees around the world, including CEO Parag Agrawal.\n\n\n\n\n\nWidmaier believes that the future of DOGE is tied to Musk and the various dimensions he brings to his role as its chief.\n\n\n\n\n\n\"It's not just Elon Musk as a person, it's Elon Musk as an apparatus,\" he said.\n\n\n\n\n\n\"If he were to step back [from DOGE], the project he has embarked upon — whatever you think of it — would also dwindle down.\"\n\n\n\nFrom speaking at election rallies, to meetings in the Oval Office, Musk has been a fixture during Trump's second presidency. Source: EPA, AP / (1) Aaron Schwartz, (2) Sarah Yensel, (3) Chip Somodevilla, (5) Alex Brandon Under US law, Musk is classified as a \"special government employee\", which allows him to work a government job for 130 days each year, with the period due to reset in January of 2026.\n\n\n\n\n\nGiven his reduced workload, Widmaier said it isn't clear when exactly Musk's finish date will be.\n\n\n\n\n\nBut when Trump initially signed the executive order setting up DOGE, he also set the deadline of 4 July 2026 as the end date for the department.\n\n\n\n\n\nThis day corresponds with the 250th anniversary of the signing of the US Declaration of Independence.\n\n\n\n\n\nIn response to an X post in December 2024 that said DOGE would finish entirely on this date, Musk wrote: \"The final step of DOGE is to delete itself\".\n\n\n\n\n\nNo one has been publicly tapped to replace Musk once he officially winds up his work, however one option would be for the group to take its orders from Russell Vought, who runs the Office of Management and Budget — a key agency that oversees government spending and regulations in the executive branch.\n\n\n\n\n\nSteve Davis, a longtime Musk employee at SpaceX who has taken on a prominent role at DOGE, could be another contender, according to the Wall Street Journal.\n\n\n\n\n\nWith additional reporting by Reuters\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trumps-crimea-ultimatum-india-pakistan-tensions-and-a-conclave-plot-twist/j53rjrjgb",
        "title": "Trump's Crimea ultimatum, India-Pakistan tensions and a conclave plot-twist?",
        "publish_date": "Fri, 25 Apr 2025 08:34:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/extremely-disappointed-electric-vehicle-groups-react-to-duttons-tax-break-backflip/gqvy34ayx",
        "title": "'Extremely disappointed': Electric vehicle groups react to Dutton's tax break backflip",
        "publish_date": "Fri, 25 Apr 2025 07:23:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Opposition leader Peter Dutton appears to have backtracked on a $3 billion tax break for electric vehicle (EV) buyers — just two days after indicating the Coalition would keep the incentive if elected.\n\n\n\n\n\nOn Monday, Dutton said a Coalition government would not repeal the fringe benefits tax (FBT) exemption for electric vehicles, a Labor policy introduced in 2022 that has grown in popularity and cost.\n\n\n\n\n\nBut by Wednesday evening, the Coalition issued a press release confirming it would axe the scheme and said it was an example of \"wasteful spending\".\n\n\n\nDuring a heated press conference in Hobart on Thursday, Dutton said he thought he was being asked about Labor's proposed vehicle emissions standards earlier that week, not the FBT exemption.\n\n\n\n\n\nDutton claimed that he never said he would keep Labor’s EV tax break and that his response on Monday was about Labor’s vehicle emissions standards, an entirely different policy, which the opposition has dubbed the \"ute tax\".\n\n\n\n\n\nUnder Labor's current policy, electric and hydrogen-powered vehicles do not attract fringe benefits tax if they fall under the luxury car tax threshold of $91,387 and are bought through a salary packaging program.\n\n\n\n\n\nSince the scheme began three years ago, between 90,000 and 100,000 customers have taken advantage of the discount, according to the National Automotive Leasing and Salary Packaging Association (NALSPA).\n\n\n\nREAD MORE Why Australians are buying EVs even if they can't charge the cars at home\n\nAutomotive groups warn of price increases\n\nAutomotive groups have said drivers in outer metropolitan suburbs could be hit hardest by the change, which would raise transport costs for some while the Coalition's promised cuts to fuel excise would lower costs for others driving petrol cars.\n\n\n\n\n\nThe change would raise costs for Australians buying electric vehicles by thousands of dollars each year, NALSPA chief executive Rohan Martin said.\n\n\n\n\n\n\"For an EV around the $45,000 mark, we estimate a worker would pay another $3,500 per year without the exemption to own and operate that car,\" Martin told AAP.\n\n\n\n\n\n\"If it was a $60,000 EV, such as a [BYD] Sealion 7, then it would be about $4,700 more per annum without the exemption.\"\n\n\n\nRising costs would hit families in suburbs hardest, he said, as households with longer commutes, solar panels and off-street parking had proven most likely to use the tax exemption.\n\n\n\n\n\n\"It's average, everyday working Australians living in outer metropolitan suburbs that are the main beneficiaries of this existing policy and are the main users of this policy,\" Martin added.\n\n\n\n'Extremely disappointed'\n\nBefore the backflip, the Electric Vehicle Council's chief executive Julie Delvecchio said the decision for both major parties to support the FBT exemption meant Australians could \"continue to access cost-of-living relief by shifting to cleaner, more affordable cars\".\n\n\n\n\n\nBut on Wednesday evening, Delvecchio issued another statement: \"If the Coalition is indeed scrapping the FBT exemption, after the opposition leader just days ago indicated he didn’t have any proposals to change it, then we are extremely disappointed and confused by this backflip.\"\n\n\n\n\n\n\"If the Coalition wants to make cars cheaper and driving cheaper during a cost-of-living crisis, it wouldn’t be removing this discount for Australians.\"\n\n\n\nThe Australia Institute also criticised the move, as well as tax breaks on big \"dumb\" utes, which cause more pollution than other cars.\n\n\n\n\n\n\"Basic economics says to tax things you want less of and subsidise things you want more of, yet Peter Dutton seems to want less electric vehicles and more American-style utes on our roads,\" said Richard Denniss, executive director of The Australia Institute.\n\n\n\n\n\n\"The Coalition says it's scrapping the EV tax break — which it supported up until Monday — because people who buy electric vehicles can afford them. Surely the same should apply for big utes.\"\n\n\n\n\n\n- With additional reporting from the Australian Associated Press.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-to-watch-pope-funeral-australia/m75pdoyq6",
        "title": "What you need to know about the pope's funeral: From how to watch to who's attending",
        "publish_date": "Fri, 25 Apr 2025 05:12:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "This weekend, Pope Francis, the leader of the Roman Catholic Church , will be officially farewelled and laid to rest.\n\n\n\n\n\nThe pope died at his Vatican residence on Monday, aged 88, from stroke and heart failure, following a recent bout of double pneumonia .\n\n\n\n\n\nHis body has been lying in state in St Peter's Basilica since Wednesday, and tens of thousands of mourners have travelled to the Vatican to pay their respects. On Friday evening, his coffin will be sealed during a liturgical rite ahead of the funeral the next day.\n\n\n\n\n\nHere's what to know about Pope Francis' funeral, ceremonial traditions, and who is attending.\n\n\n\nWhen is Pope Francis' funeral?\n\nThe funeral will be held on Saturday 26 April at St Peter's Square from 6pm AEST (10am Rome time).\n\n\n\n\n\nThe service is expected to last for about two and a half hours.\n\n\n\n\n\nVatican Media will host a live stream on YouTube and on its website. SBS will also stream the funeral via the new Euronews fast channel from 5pm to 9pm AEST. You can watch it here .\n\n\n\n\n\nDozens of leaders from around the world and hundreds of thousands of members of the public are expected to attend.\n\n\n\nWhat happens at the pope's funeral?\n\nThe pope's funeral is typically steeped in tradition and ancient rituals, but before his death, Francis chose to simplify or opt out of some papal funeral traditions.\n\n\n\n\n\nIn 2023, Francis said he would like to be buried at Rome's Basilica of Saint Mary Major, departing from the tradition of almost 100 popes who chose to be buried in the Vatican Grottoes. He is also expected to be buried in a single coffin, rather than the three traditionally used.\n\n\n\nPope Francis' body has been lying in state in the lead-up to his funeral on Saturday. Source: AAP / Emilio Morenatti/AP Cardinal Giovanni Battista Re, dean of the College of Cardinals, will preside over the funeral.\n\n\n\n\n\nHe will lead prayers and Bible readings, and deliver the final commendation and valediction. Readings are expected to be held in a mixture of languages, including Latin, Italian and English.\n\n\n\n\n\nThe funeral will mark the beginning of the Novemdiales, or nine days of mourning.\n\n\n\nWhich Australians are attending the pope's funeral?\n\nPrime Minister Anthony Albanese and Opposition leader Peter Dutton will not be attending the funeral.\n\n\n\n\n\nAlbanese has confirmed Australia will be represented by Governor-General Sam Mostyn and the ambassador to the Vatican, Keith Pitt.\n\n\n\n\n\nTrade Minister Don Farrell will also attend, along with Nationals MP Michael McCormack, who was nominated by Dutton to represent the Coalition.\n\n\n\nWhich other world leaders are attending the pope's funeral?\n\nThe Australian representatives will join leaders and royalty from around the world.\n\n\n\n\n\nUnited States President Donald Trump, Italy's President Sergio Mattarella and Prime Minister Giorgia Meloni, and French President Emmanuel Macron have all said they will attend.\n\n\n\n\n\nJavier Milei, president of Argentina (where Francis was born), will also attend.\n\n\n\nFrom the United Kingdom, Prime Minister Keir Starmer and Prince William are both expected to attend.\n\n\n\n\n\nRepresenting the European Union will be Commission president Ursula von der Leyen, Council president António Costa, and Parliament president Roberta Metsola.\n\n\n\n\n\nUkraine's President Volodymyr Zelenskyy will be attending, while the Kremlin has said Russian President Vladimir Putin will not attend.\n\n\n\n\n\n— Additional reporting by the Reuters news agency.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-coalition-wont-back-labors-plan-to-wipe-student-debt-saying-its-unfair-to-tradies/oos11zr1h",
        "title": "'Crumbs off the table': Why some students say they feel left behind this election",
        "publish_date": "Fri, 25 Apr 2025 04:43:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "This federal election, millennial and gen Z voters will be the biggest voting bloc, outnumbering their older counterparts.\n\n\n\n\n\nBut despite holding the most power , some think not enough is being done for students in this election. Earlier this week, the Coalition said it would not back a Labor promise to cut university debt by 20 per cent if elected.\n\n\n\n\n\n\"I think the major parties have very little to offer students, with the exception of students who happen to run private childcare companies or fossil fuel projects,\" National Union of Students education officer James McVicar told SBS News.\n\n\n\n\n\n\"For the rest of us, it's a few crumbs off the table.\"\n\n\n\n\n\nSo, where do the major parties stand on students? Here's what they've promised.\n\n\n\nThe Coalition: No to HECS relief, yes to tradies\n\nThe Coalition says it won't back Labor's promise to write off a portion of student debt if it's re-elected, calling the HELP cut \"elitist\" and \"profoundly unfair\".\n\n\n\n\n\nOn Wednesday night, the Coalition released a statement saying it would not proceed with Labor's plan to cut 20 per cent from all student loans, which Labor says would save the average graduate about $5,520.\n\n\n\n\n\n\"It's not fair that they [university students] should get thousands of dollars from taxpayers, but the young tradies who had to borrow to pay for their ute or their tools, or the uni students who diligently paid off their student debt, get nothing,\" the statement said.\n\n\n\n\n\nMore broadly, the Coalition's policies on education focus primarily on tradespeople.\n\n\n\n\n\nThey've promised to build 12 new technical colleges in areas with skill shortages and youth unemployment. This will allow senior high school students to enrol in school-based apprenticeships and traineeships while still earning a Year 12 certificate.\n\n\n\n\n\nThey've also promised to return the number of apprentices and trainees in training to over 400,000 and have vowed to provide small and medium businesses with $12,000 to support the wages of new apprentices.\n\n\n\nREAD MORE Coalition promises to build 12 new technical colleges across Australia\n\nInternational students are also in their sights, with plans to cap international student numbers to 240,000 — 30,000 fewer than what Labor proposed last year. They say the move will help free up housing for young people.\n\n\n\n\n\nUniversities Australia, a peak body for the sector, has pushed back against the \"scapegoating\" of international students, warning the move would harm the economy and damage Australia's reputation as a study destination.\n\n\n\nREAD MORE Caps on international students won't just be a headache for universities\n\nLabor promises to slash student debt, raise repayment threshold\n\nLabor's pitch towards students has focused on its promise to wipe 20 per cent of student debt if re-elected, which they say will save about $5,520 for the average graduate.\n\n\n\n\n\nThe policy, which would cost about $16 billion, would apply to around three million Australians. The government says it's aimed at relieving cost of living pressures on young people.\n\n\n\n\n\nThe Albanese government has also pledged to lift the income threshold for student loan repayments from $54,000 to $67,000.\n\n\n\nIf re-elected, Labor has promised to introduce a $10,000 incentive payment for Australians in construction apprenticeships and to fast-track the qualifications of 6,000 tradies to help build more homes across Australia, as part of its 'Advanced Entry Trades Training program'.\n\n\n\n\n\nLabor will also make free TAFE permanent, and provide a payment to support nursing, midwifery, teaching and social work students to complete their unpaid prac requirements.\n\n\n\nREAD MORE Labor floats plan targeting Morrison-era policy that hiked university course fees\n\nLast year, Labor criticised the controversial Job-Ready Graduates scheme, brought in under a previous Coalition government which hiked fees for arts degrees and lowered them for subjects like teaching and STEM.\n\n\n\n\n\nEducation Minister Jason Clare said in November he intended to set up an Australian Tertiary Education Commission to provide non-binding advice on university course fees.\n\n\n\n\n\nBut Labor is yet to announce plans to reform the scheme.\n\n\n\n\n\n\"The Jobs-Ready Graduate scheme was and is a Liberal Party scheme to make students pay more for their education overall and channel them into degrees that they considered to be priorities,\" McVicar said.\n\n\n\n\n\n\"I don't think the priorities of the party of Peter Dutton should dictate what's on offer to students in the higher education sector. I'm for a fully-funded and free higher education system without 'price signals' and soaring student debt.\"\n\n\n\nGreens pledge free university and TAFE\n\nMeanwhile, the Australian Greens have pledged to make university and TAFE free for students , with the government covering all fees for students studying at public universities.\n\n\n\n\n\nThey estimate this would cost $46.5 billion, which would be paid for by taxing big corporations.\n\n\n\n\n\nThey also want all university debt abolished.\n\n\n\n\n\n\"I think at a bare minimum, we should have free education again,\" McVicar said. \"It could be easily covered with the money the government instead wants to spend on nuclear-fuelled submarines.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-albanese-dutton-resume-campaign-after-hecklers-disrupt-welcome-to-country-at-anzac-day-services-20250425-p5lucj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Albanese, Dutton resume campaign after hecklers disrupt Welcome to Country at Anzac Day services",
        "publish_date": "Sat, 26 Apr 2025 11:29:45 +1000",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "Dutton has seemingly decided he has had enough of the prickly inquisitions that had begun to characterise his daily press conferences.\n\nSeveral media events earlier in the week featured tense long and exchanges with reporters. He received repeat questions from individual reporters on his views on trans women, immigration numbers, public service cuts, and other tricky topics.\n\nToday, Dutton took a leaf from Albanese’s playbook and said journalists would get one question each. He often ignored follow-ups by moving around the circle of assembled reporters to the next question. One or two follow-ups were acknowledged by Dutton, but it was an overall more controlled affair than earlier in the week.\n\nDutton will be relieved to have enforced such a rule without appearing overly domineering in telling a journalist they could not further question. The stricter approach is bad for transparency but a positive sign for the Dutton campaign heading into the final week – if it lasts.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/munsters-bellamy-quip-exposes-storm-injury-crisis-20250426-p5luem.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Munster's Bellamy quip exposes Storm injury crisis",
        "publish_date": "Sat, 26 Apr 2025 11:03:32 +1000",
        "category": "finance",
        "authors": [],
        "text": "Munster's Bellamy quip exposes Storm injury crisis\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/steven-may-bailey-fritsch-in-for-anzac-day-eve-afl-experts-tips-and-teams-for-round-seven-20250423-p5ltrw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ginnivan back for Hawthorn, Breust to miss: AFL experts’ tips and teams",
        "publish_date": "Sat, 26 Apr 2025 10:58:59 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Loading\n\nMELBOURNE\n\nB: J. Bowey, S. May, C. Salem\n\nHB: C. Windsor, T. McDonald, J. McVee\n\nC: K. Chandler, J. Viney, E. Langdon\n\nHF: T. Sparrow, T. Fullarton, K. Pickett\n\nF: K. Tholstrup, B. Fritsch, C. Spargo\n\nR: M. Gawn, C. Petracca, H. Langford\n\nI/C: C. Oliver, X. Lindsay, T. Rivers, H. Sharp, H. Petty\n\nEMG: J. Billings, B. Howes, A. Johnson\n\nIN: S. May, J. McVee, B. Fritsch\n\nOUT: B. Howes (omitted), D. Turner (injured), J. Melksham (managed)\n\nRICHMOND\n\nB: B. Miller, N. Broad, N. Vlastuin\n\nHB: J. Short, S. Banks, L. Trainor\n\nC: H. Ralphsmith, T. Dow, J. Trezise\n\nHF: S. Campbell, J. Ross, S. Green\n\nF: J. Faull, T. Lynch, M. Rioli\n\nR: T. Nankervis, T. Taranto, J. Hopper\n\nI/C: R. Mansell, T. Brown, C. Gray, K. McIntosh, S. Lalor\n\nEMG: T. Sonsie, J. Bauer, K. Smith\n\nIN: R. Mansell, C. Gray\n\nOUT: N. Balta (legal reasons), S. Ryan (injured)",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/a-quiet-sacred-ceremony-on-one-of-the-last-steps-in-pope-s-final-journey-20250426-p5ludq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A quiet, sacred ceremony in one of the last steps on Pope’s final journey",
        "publish_date": "Sat, 26 Apr 2025 10:32:54 +1000",
        "category": "sports",
        "authors": [
            "Rob Harris"
        ],
        "text": "Rome: As the evening shadows stretched across St Peter’s Basilica on Friday, a quiet, sacred ceremony was performed, marking one of the last steps in the final journey of the 88-year-old Pope Francis.\n\nWrapped in a simple red chasuble, the Pope’s hands rested gently on a rosary, a final coat of arms, along with a plaque bearing his name, was affixed to his wooden and zinc coffin.\n\nCardinal Kevin Farrell seals the zinc cover of the casket containing Pope Francis’ body. Credit: Vatican Media\n\nThe ritual, conducted by Cardinal Kevin Farrell, was accompanied by prayers and the sprinkling of holy water. The Pope’s personal medals, a cross and other mementos from his papacy were placed within the coffin before the lid was sealed for the last time.\n\nIn just hours, the streets of Rome will be flooded with mourners from around the globe, including heads of state, clergy, pilgrims and the very people Francis spent his life advocating for – the poor and marginalised.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/latrell-mitchell-suspended-for-high-tackle-in-another-blow-for-rabbitohs-20250426-p5ludv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Latrell Mitchell suspended for high tackle in another blow for Rabbitohs",
        "publish_date": "Sat, 26 Apr 2025 10:28:32 +1000",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "South Sydney fullback Latrell Mitchell is facing at least one week on the sidelines for a high shot on Storm winger Sualauvi Fa’alogo in the Rabbitohs loss to Melbourne on Friday night.\n\nMitchell was sent to the sin bin in the 49th minute after he slid into a tackle and collected Fa’alogo high.\n\n“It’s direct contact with the shoulder, moderate force, on report, in the bin,” referee Peter Gough said.\n\nThe storm flyer was subsequently taken from the field for a head injury assessment, which he failed, meaning he will miss Melbourne’s Magic Round clash with the Raiders next week as he undergoes the NRL’s mandatory 11-day concussion stand down.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/shayna-jack-in-tears-after-incredible-comeback-20240801-p5jy9b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shayna Jack in tears after incredible comeback",
        "publish_date": "Sat, 26 Apr 2025 10:19:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Shayna Jack in tears after incredible comeback\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/hurting-eagles-aim-for-special-afl-win-against-hawks-20250426-p5luej.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hurting Eagles aim for special AFL win against Hawks",
        "publish_date": "Sat, 26 Apr 2025 10:03:18 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "West Coast recruit Jack Graham says the entire team is hurting after an 0-6 start to the season, but he’s confident a “special” win is just around the corner.\n\nThe Eagles are yet to taste victory under new coach Andrew McQualter, and coughed up a 29-point lead en route to a heartbreaking two-point loss to Essendon in Perth last week.\n\nNew Eagles coach Andrew McQualter. Credit: AFL Photos via Getty Images\n\nWest Coast will start rank underdogs on Sunday against premiership fancies Hawthorn at Marvel Stadium, and the Eagles are now hot favourites to collect this year’s wooden spoon.\n\nGraham’s tough initiation at the club is in stark contrast to what he experienced during his early years at Richmond.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/agents-juggling-players-and-coaches-are-afforded-plenty-of-leeway-20250425-p5lu6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Agents juggling players and coaches are afforded plenty of leeway",
        "publish_date": "Sat, 26 Apr 2025 10:00:00 +1000",
        "category": "sports",
        "authors": [
            "Darren Kane"
        ],
        "text": "I don’t watch much of Anasta’s to-camera stuff, and I’ve no view whether his opinions favour his clients’ interests or not. But even if they do, do those circumstances constitute Anasta having a conflict of interest? Hardly. That would assume someone in Anasta’s position in the media lives in a soundproof room. Being prominent in the media isn’t relevant to either test. Anasta has no more of a conflict of interest than does Peter V’landys, by reason of him merely being Racing NSW CEO and Australian Rugby League Commission chairman. V’landys has no such conflict; thoroughbred racing and rugby league are two plainly different sports. Moreover, Anasta isn’t exactly Robinson Crusoe in terms of someone in the media having a side hustle. Phil Gould, for example, is an expert commentator for Channel Nine, publishers of this masthead, and general manager of football at the Bulldogs. And that’s fine. Nevertheless, would it be advisable for Anasta to veer away from expressing views that obviously touch on the interests of his clients? Yes. And I speak with some authority. I’ve practised as a lawyer, specialising in sports law, for over two decades. Among other roles, I’m an arbitrator with the National Sports Tribunal, the chair of the Combat Sports Authority of NSW, a member of the Harness Racing NSW appeals panel, and a member of the ethics panel of the International Testing Agency, which manages anti-doping programs for the International Olympic Committee and over 45 international federations.\n\nNRL 360 host Braith Anasta. Credit: NRL Photos Also, I’ve written this column for 12 years. There’s so much I’ll never be able to write about, as much as it would make for tremendous copy. By virtue of his media role, Anasta is compelled to have opinions; nobody’s going to watch someone that everyone invariably agrees with. My role as a columnist gives me a mere fraction of the prominence of Anasta, and my professional obligations far exceed his because I’m a lawyer, who is required to shoulder the ethical obligations that go hand in glove with all that. I routinely agonise about what I can say, and what I can’t. I’ve no idea whether Anasta is afflicted with such angst. He should be. But he still doesn’t have a conflict of interest in the proper sense. The more pertinent matter for examination is the level of power that exists to regulate player agents in terms of their professional obligations and conflicts of interest. It’s the system of regulating sports agents involved in rugby league, and in professional sport in general in Australia, which is where things run out of steam.\n\nThere are currently about 150 sports agents registered under the NRL’s mandatory Accredited Agents Scheme, which entitles them to represent rugby league players in contract negotiations with clubs. There were 105 agents registered just five years ago. Each of the 17 clubs has an elite squad capped at 30 players. That’s just over 500 potential clients already involved at the game’s highest level. Of the cohort of registered agents, most have no top-level clients, or maybe one. Player agency is as speculative an enterprise as scurraging in the dirt for truffles. Agents vacuum up umpteen 16-year- olds with stars in their eyes in the knowledge that maybe one of the crop will, one day, generate a commission. At the other end of the spectrum to the agents struggling with few or no clients, there’s a cabal of uber agents, including the invariably-in-the-headlines Isaac Moses, who have sequestered the market. In addition to the countless superstars and emerging players on his books, Moses oversees the affairs of not less than five of the 17 NRL head coaches. Think about it: it would be nearly impossible to get the best possible contractual terms for all of your clients in that scenario, where basically there’s one single market: the National Rugby League.\n\nConjecture over whether Anasta has conflicting interests by reason of his media prominence and his nascent player agency business misses the bigger issue. The NRL does a poor job of regulating the agency profession, which in turn is largely not the NRL’s fault. It’s seriously arguable that the whole concept of a governing body licensing and regulating player agency constitutes an unreasonable restraint on the trade of those wanting to act as player agents, and it’s also a breach of Australia’s competition laws. That argument has never been assessed in the Australian courts; push too hard, and it could be. In 2021, the NRL’s appeals panel confirmed Moses’ deregistration as a player agent, consequent to rules breaches of apparent “great seriousness”. It wasn’t his first offending – he also was banned for six months over a decade ago, arising from the Melbourne Storm salary cap affair. Yet in 2025, Moses operates like a puppeteer in rugby league. His last deregistration remained in force for less than two years. Somehow, that fact sits at odds with a finding that a professional person committed rules transgressions of “great seriousness”. The stint on rugby league’s naughty step never adversely affected Moses’ registration as a rugby union player agent, nor the ability of other agents within his business to carry on. Now, he’s more influential than ever.\n\nPlayer agents provide quasi-legal, financial and accounting services in negotiations that are complex, and where tremendous amounts of the folding stuff and livelihoods are bargained. Loading Lawyers, accountants and financial advisers are heavily regulated by governments and professional regulatory bodies. In contrast, player agents in rugby league subscribe to a code of conduct that requires them to (a) not take improper advantage of their position; and (b) not intermingle their personal interests with their professional responsibilities. Agents, however, aren’t restricted in terms of a maximum number of clients, the number of clients playing in the same positions, the number of players who they represent at any given club, or in terms of representing coaching staff and media types as well as players. But regardless of what the NRL’s rules say, there’s a toothlessness to their operation in practice, as is evidenced by Moses’ own registration history. It’s not wrong that professional sports regulate agents; it’s fundamental. But it’s only part of the solution.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/there-s-a-bear-in-where-why-perth-is-wrong-spot-for-club-s-return-20250425-p5lu8b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There’s a bear in where? Why Perth is wrong spot for club’s return",
        "publish_date": "Sat, 26 Apr 2025 09:55:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Fitzsimons"
        ],
        "text": "Spotlight on Tigers’ culture Told yers. Last week in this space, I opined that Tigers coach Benji Marshall’s tightly scripted remarks about there being no bullying in his team vis a vis Lachie Galvin, was surely on legal advice that the club was totally exposed in the way they had treated the 19-year-old wunderkind: dropping him to reserve grade, not reining in players attacking him on social media, and putting out a press release that unleashed the hounds of hell on him to the point that he needed a security detail, #FFS! Lachlan Galvin playing NSW Cup for Western Suburbs Magpies. Credit: Max Mason-Hubers “The Tigers”, I opined, “could find themselves a long way up metaphorical Legal Shit Creek without a paddle. For while the Tigers might be a football team, they’re also an employer, owing a duty of care to their employees. And in February, the High Court of Australia handed down a groundbreaking decision in a matter of Elisha v Vision where it held that Elisha could recover damages for psychiatric injury arising from a breach of the employment contract by an employer.” And so it proved, for this week, we found out, the Galvin camp has indeed sent a legal letter right up the Tigers’ Khyber Pass, pointing out much of the above, and alleging both bullying and an unsafe workplace. Yes, Galvin is back in the starting side – again, I would not be surprised if that, too, was on legal advice – but the whole debilitating affair has a long way to play out.\n\nAnd we are not even to the most extraordinary part. That came on Wednesday, when Tigers CEO Shane Richardson was interviewed by the Daily Telegraph. When it came to the club’s culture, he said, the Tigers were “outstanding”. No, really. Who remembers any other club, ever, where three senior members verbally attack another player on social media, and a younger member at that? I’ll wait. If that is “outstanding”, Richo, what does “seriously ordinary” look like?\n\nBut tell us, please do, your take on the Tigers putting out the press release that you were told by the Galvin camp would be a disaster – telling the world, what Galvin’s management had said quietly, that the young man wanted to move on at the end of his contract – but you released it anyway. “At the end of the day,” Richardson said, “my job is to make sure that the Wests Tigers are protected. And I believe what we did, I don’t believe it could be done any other way.” Lachie Galvin and coach Benji Marshall make eye contact at Tigers training. Credit: Renee Nowytarger Seriously? You HAD to point out that your brightest young star wanted to move on, and despite the fact that this resulted in a fortnight of shattering headlines and the young man needing a security detail, this was still a good idea? And “protected” the Tigers? Yes, Richo insisted.\n\n“It’s come out this week, we popped the pimple, we’ve moved on from it. I honestly believe that we couldn’t have done any better.” The “pimple”? What does a festering boil look like? “We couldn’t have done it any better”? Just what would things look like now if it had been handled badly?\n\nAs to your equal insistence that Galvin “has never once said to us, not one time has he said to us, that Benji’s not a good coach or can’t coach,” to my neophyte legal eyes, that only bolsters the young fellow’s legal case. You say, Richo, he never said that. But we all know he was dropped to reserve grade and became, for that fortnight, the most hated figure in the game, attacked by his own team for “disrespecting the coach” and vilified by a howling mob of social and traditional media, asserting he said EXACTLY that. But you say he never did. What are they going off, then? The only answer can be that very press release you were advised not to put out, but did anyway. Seriously, those quotes are simply gobsmacking. Blokes want to leave clubs all the time. It’s no big deal. It happens. But this has become a huge and embarrassing deal for the Tigers, precisely because of the way MANAGEMENT handled it. You say, very carefully, Galvin is not at fault. Who does that leave then? Why I won’t be watching SBW v Gallen Here is 42-year-old former AFL star Justin Koschitzke telling Channel Seven this week what it was like dealing with concussion throughout his career. He’d been badly concussed many times, and things were starting to go foggy, but he felt obliged to keep going.\n\n“[I kept thinking] it will pass ... and this will get better, because you’re in an environment where you don’t want to lose respect from your teammates, you don’t want to give an inch, you want to be in your armour because someone else is taking your spot [in the team]. What I thought was ‘manning up’ was to come back and play that year, but if I had my time again, there’s no way I would have played that year ... knowing what I know now.” He regrets it, bitterly. “Maybe knowing what I know now, I wouldn’t have played ever again. I can honestly say that. Why would I put myself in a situation to keep getting hit and keep getting hit, knowing what I know and what I feel like as a 42-year-old? But back then your bulletproof, right? You think this is going to get better.” But they didn’t. Every concussion is brain damage, and he can now see clearly just how disastrous the whole thing was for him. In a proper system, the game would have stepped in, and given him the tap on the shoulder: that’s enough now. Meanwhile, I see many people are excited by the prospect of 39-year-old Sonny Bill Williams and 43-year-old Paul Gallen – already with many concussions between them – soon getting in the ring and having a “super fight”.\n\nI am not. Read the above, again, and tell me you think it is a sporting contest you can morally support. What they said Billy Moore on the Bears coming back: “With my lovely wife, I’ve had a glass of champagne already today. This is the biggest day since 1922 ... I’m pretty f---ing happy.” Carlos Alcaraz: “I don’t want to be called Rafa’s successor. I want to be called Carlos Alcaraz Garfia.” We will bear that in mind, Carlos Alcaraz Garfia. The words of the late Pope Francis, when the Argentinian met Diego Maradona at the Vatican, were recalled this week: “So, which is the guilty hand?”\n\nOscar Piastri after winning the Saudi Arabian Grand Prix: “I’m more proud of all of those things [hard work in the off-season] than I am of the fact that I’m leading the championship because, ultimately, I want to be leading it after round 24, not round five.” Dallas Mavericks GM Nico Harrison on the Luka Doncic trade: “I did know that Luka was important to the fan base. I didn’t quite know it to what level.” Dylan Brown. Credit: Getty Images Dylan Brown on leaving social media: “I’ve told a few people, you get off Instagram, you don’t see anything, so I’m doing well.” Leeds manager Daniel Farke after they sealed promotion to the EPL with a 6-0 win, with Dutch forward Joel Piroe scoring four after a goal drought: “In the last few weeks his performances were better but the ball didn’t want to go in the net. It’s a bit like shaking a bottle of ketchup – all of a sudden everything comes out and that was a bit the case today.” Shades of Ogden Nash’s poem, The Catsup Bottle: “First a little, Then a lottle.”\n\nPhil Gould won’t bring Lachlan Galvin to the Bulldogs: “We are not involved in the Lachlan Galvin discussion and we won’t be involved in the Lachlan Galvin discussion.” Maybe. But with that promise and $5, I reckon I could get a cappuccino. Tasmanian Premier Jeremy Rockliff on their AFL team. Not sure he’s spoken to a Carlton fan recently: “This has to work. It has to work for Tasmania, it has to work for the AFL, it has to work not just for the next five, 10 years, but I want to make sure that the Tassie team is here in 100 years and Tasmanians are proud of it, just like Blues supporters and Collingwood supporters are proud of their team.” Nathan Cleary. Credit: NRL Photos Nathan Cleary after the Panthers beat the Roosters: “Tonight we wanted to just put in a really good performance and let the rest take care of itself, and just get that feeling back of what it feels like to be a Panther and the way we want to play.” Waratahs coach Dan McKellar after another bad loss when asked if he was disappointed with it: “Are we disappointed? Are we disappointed? What do you think? What would you think? Yes, we are disappointed.”\n\nKnights coach Adam O’Brien when asked at the post-match press conference what he thought about an incident in their loss to the Sharks: “What do you think?” Journalist: “No one really cares what I think.” Skateboarder Chloe Covell on coming back from injury: “I just had to get over it and get back on the skateboard.” Bill Lawry on the death of the Australia’s former Test opener and cricket commentator Keith Stackpole, 84: “We have lost not only a great Victorian but a real good citizen. He was great to have as a friend. He has been wonderful.” Fair enough, and vale “Stacky”. But interesting, yes? North of the Murray, and south of the Tweed, we in the geographical area known as NSW never farewell a great with, “He was a great New South Welshman”. Team of the week North Sydney Bears. With the euphoria around their return, makes you wonder why they were ever kicked out. Still, welcome back!\n\nGold Coast Suns. No sooner did TFF write “Gold Coast Suns. Last undefeated AFL side this season. Stop the world – I want to get off”, than the undefeated Suns lost to third-last Richmond. The Kiss of Death powers are still strong! Vaibhav Suryavanshi. The 14-year-old marked being the youngest ever IPL player by hitting his first ball for six! Loading Melbourne City. Won a second successive A-League Women premiership. Oscar Piastri. Our Oscar has won three of the past four Formula 1 races and is in top spot, with just 19 races to go! (I know. I was surprised, too. THAT many Formula 1 races in a year? Who knew?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/woman-dies-after-falling-80-metres-down-sunshine-coast-waterfall-20250426-p5lueg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Woman dies after falling 80 metres down Sunshine Coast waterfall",
        "publish_date": "Sat, 26 Apr 2025 09:48:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Woman dies after falling 80 metres down Sunshine Coast waterfall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/they-didn-t-know-what-a-schooner-was-we-had-to-explain-a-meat-raffle-20250422-p5lt9s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘They didn’t know what a schooner was. We had to explain a meat raffle’",
        "publish_date": "Sat, 26 Apr 2025 09:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "New York: When Old Mates Pub staged a special opening party on a cold night in February, the queue snaked around the block. By 9pm, the joint had run out of beer.\n\nIn the weeks since, the Australian bar in Lower Manhattan has become a meeting place for expats and tourists, and a hotspot for Aussie events. Uber-cool Melbourne DJ Dom Dolla played a secret set there ahead of his sold-out shows at Madison Square Garden, and it hosted the NYC launch of underwear brand Bonds, featuring model Robert Irwin.\n\nOld Mates, a new Australian pub in New York, has proved a hit with famously fickle New Yorkers. Credit: Alex Towle\n\nBut Old Mates has also seen an influx of less obvious guests: Americans. In a short time, the pub has become a hit with famously fickle New Yorkers.\n\n“So many Americans,” says general manager Amanda Verratti, an ex-Sydneysider who has grown used to dealing with lost-in-translation moments. “They didn’t know what a schooner was. We had to explain a meat raffle. The amount of people who thought I meant a charcuterie board … Explaining AFL and NRL to people, I’ve taken great joy in it.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/brayshaw-serong-star-as-dockers-beat-crows-in-perth-20250426-p5luee.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brayshaw, Serong star as Dockers beat Crows in Perth",
        "publish_date": "Sat, 26 Apr 2025 09:44:01 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "Andrew Brayshaw and Caleb Serong have put on a midfield masterclass to lead Fremantle to an 18-point Anzac Day victory over Adelaide at Optus Stadium.\n\nBrayshaw racked up 37 disposals, six clearances and 522m gained while Serong tallied 32 possessions and 10 clearances in Friday night’s match as Fremantle posted a 12.13 (85) to 9.13 (67) win.\n\nRiley Thilthorpe of the Crows talks to his team mates during the 2025 AFL Round 07 match between the Fremantle Dockers and the Adelaide Crows at Optus Stadium on April 25. Credit: AFL Photos via Getty Images\n\nA bumper crowd of 53,048 turned up for Fremantle’s annual Len Hall Tribute Game, with Brayshaw winning the inaugural Arthur Leggett Medal as best afield.\n\nDockers coach Justin Longmuir questioned his team’s toughness in the wake of last week’s shock 10-point loss to Melbourne.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/inspiration/sorry-santa-this-winter-wonderland-is-actually-more-magical-in-autumn-20250416-p5lsa2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sorry, Santa: This winter wonderland is actually more magical in autumn",
        "publish_date": "Sat, 26 Apr 2025 08:22:00 +1000",
        "category": "finance",
        "authors": [
            "Rob Mcfarland"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Snow, reindeer, Santa Claus. For most people, the far north of Scandinavia is synonymous with Christmas – a twinkling, wintry wonderland of snow-smothered forests and rosy-cheeked good cheer. Visit during winter and you’ll certainly find a version of that. But you’ll also encounter temperatures that regularly plummet below minus 30 degrees and days where the sun never peeks above the horizon. While every season in Lapland has its appeal, there’s a special allure to what the indigenous Sami people call “tjaktjagiesse” – the transition from summer to autumn that starts in August. It’s a period characterised by crisp mornings, warm sunny days and a colourful fanfare of autumn foliage. It’s the ideal time to venture outdoors – to fish, hike, bike and forage – and the lengthening nights offer the potential of glimpsing the fabled northern lights. Although Lapland officially includes the northernmost parts of Norway, Sweden, Finland and the Kola Peninsula in Russia, the region one hour north of Lulea (pronounced Loo-lay-oh) in Sweden is particularly compelling. Map of Swedish Lapland. Credit: A forested wilderness of raging rivers and fish-filled lakes just below the Arctic Circle, it harbours a cluster of remarkable properties with innovative excursions and fabulous fare.\n\nAdvertisement\n\nIt’s also home to an intriguing cast of outdoor enthusiasts who embody the hardy pioneer spirit required to live and work in a place of climatic extremes. The secret of which appears to be drinking an inordinate amount of coffee. Santa’s stunt double and me “This is the worst weather for walking with bears,” says Mikael Suorra as we zigzag through bushy undergrowth in a forest of birch and pine trees. We’re hiking into a blustery wind, which means that any bears in the vicinity are unlikely to smell us or hear us. This is a concern given Sweden’s forests are home to around 2500 brown bears and we just passed a clearing that had been completely stripped of berries – presumably by a hungry bear. Not that Suorra is concerned. As the owner of Hide and See nature tours, he’s spent years exploring these undulating woodlands near the village of Harads and has been mock-charged by both a bear and a two-metre-high moose. The secret with bears, he tells me, is not to play dead, but rather to shout and make yourself look as large as possible. And what happened with the moose? “I just hid behind a tree.” During our two-hour hike, he explains that the “forest is always talking to you”. Moss on a tree trunk grows on the northern side while the branches reach south towards the sun.\n\nAdvertisement\n\nI learn how to clear blocked sinuses using formic acid emitted by ants (a skill I hope I never actually have to use) and the most effective way to collect their protein-rich eggs to fry up for dinner. After a lakeside “fika” (a cup of strong black coffee and a blueberry muffin made by his daughter), he demonstrates his most-prized skill: moose calling. Using a special conical loudhailer, he imitates the mournful cry of a cow in heat. “You can imagine how disappointed the bulls are when they turn up and find me,” he says. In Sweden, the right to enjoy nature is enshrined in law. The right to enjoy nature is so precious to Swedes, it’s enshrined in law. Called allemansratten, it’s a public access prerogative that means you can hike, forage and camp almost anywhere, provided you’re considerate and don’t litter. That afternoon I join Robert Westin, owner of Arctic Adventure, for a kayak trip on the nearby Lule River – a broad, 450-kilometre-long waterway that starts in the far north of the country. After selling his IT security business in 2019, he now offers fishing, kayaking and snowmobiling tours. “My father was a professional trapper and hunter,” he says, “so I spent every weekend in the wilderness.” After paddling across the 200-metre-wide river, we skirt an island dotted with blood-red summer cottages and come ashore in a sheltered backwater by a small wooden hut.\n\nAdvertisement\n\nCanoeing Naturally, the first thing he does is light a fire to brew coffee. On an average day, he reckons he drinks at least 20 cups. “If you can’t make coffee in Sweden,” he says, smiling, “you won’t find a wife.” Sitting in the warm, late-afternoon sun among a verdant landscape of fragrant pines, it’s hard to believe this entire river freezes solid in winter, transforming into a frosty playground for snowmobilers and ice fishers. The coldest temperature Westin has experienced is a frankly unimaginable minus 52 degrees. “It was fine,” he says. “You just need the right clothing.” For the native Sami, who’ve been living in the Arctic for more than 2000 years, the right clothing was primarily animal hides and fur. Like many indigenous groups, they survived in the extreme conditions by utilising the natural resources around them. The following day I meet Lars Eriksson, an 80-year-old Sami reindeer herder, at his property in the small hamlet of Flakaberg. With his snow-white beard, colourful wool gakti (a traditional tunic) and elaborately decorated leather belt, he could easily pass as Santa’s stunt double. “My life is reindeer,” he says, explaining that he would spend the summers tending his herd in the forest before moving them to the coast in winter. All the reindeer in Sweden belong to the Sami; a mark on each animal’s ear uniquely identifies its owner. All the reindeer in Sweden belong to the Sami. Credit: iStock\n\nAdvertisement\n\nHaving sold most of his herd, he now dwells in the same wooden house with no electricity where five generations of his ancestors lived. “Everything has changed,” he says, wistfully. “You used to be able to survive on 400 reindeer. Now you’d need 1000.” He explains that climate change and excessive logging have made it harder for the reindeer to find lichen, their main food source, so herders have to supplement their diet with hay. Reindeer are unusual in that both males and females have antlers, which regrow every year. In an impressive feat of yogic dexterity, they shape them using their back legs, a process done by feel to ensure they grow symmetrically. When a reindeer is slaughtered, the Sami use everything, even down to the ligaments, which are dried and repurposed as thread. Having devoted his life to reindeer, Eriksson is now happy to be home with his wife and a small herd of 40 animals that live in the surrounding forest. “I know every one of them,” he says, fondly. “They all have different personalities.” Running with the pack Training for winter – booties and a wheeled cart for the huskies.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/missing-sausage-dog-valerie-found-after-529-days-at-large-20250426-p5ludn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Missing sausage dog Valerie found after 529 days at large",
        "publish_date": "Sat, 26 Apr 2025 07:24:08 +1000",
        "category": "finance",
        "authors": [],
        "text": "Missing sausage dog Valerie found after 529 days at large\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/dignitaries-converging-on-rome-for-funeral-of-pope-francis-20250426-p5ludl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dignitaries converging on Rome for funeral of Pope Francis",
        "publish_date": "Sat, 26 Apr 2025 07:22:08 +1000",
        "category": "finance",
        "authors": [],
        "text": "Dignitaries converging on Rome for funeral of Pope Francis\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/national-park-camping-costs-to-rise-in-major-change-to-boost-consistency-tackle-ghost-bookings-052146358.html",
        "title": "National Park camping costs to rise in major change to boost consistency, tackle ghost bookings",
        "publish_date": "2025-04-25T05:21:46Z",
        "category": "finance",
        "authors": [],
        "text": "Camping grounds in NSW have seen visitation grow by 49 per cent over the past decade. And now things are set to change.\n\nWith expected changes, some camping grounds will soon cost nearly $100 per night. Source: Getty\n\nAussies in the country's most populous state are being encouraged to have their say as NSW plans to dramatically overhaul the cost and booking systems for camping grounds in national parks. The expected changes will see travellers and avid campers pay more for most sites in the state but authorities say it is much needed to handle the increased popularity of domestic tourism and improve service delivery.\n\nThe NSW National Parks and Wildlife Service (NPWS) is currently inviting the community to provide feedback on the vast proposal, which is designed to tackle issues including ghost camping and address a currently complex and inconsistent system of fees between sites.\n\n\"All feedback on the proposal, which aims to introduce more consistent and simplified state-wide camping fees and bookings for NSW national parks and reserves will be carefully considered,\" a spokesperson told Yahoo News.\n\nThe Service manages 895 parks and reserves which make up roughly 10 per cent of the state's total land mass. According to the consultation paper, visitation has grown 49 per cent over the last decade, and there are now more than 50 million visits to national parks every year, including 1.8 million overnight campground stays.\n\nADVERTISEMENT\n\nRELATED: Excitement as new NSW hike opens, but some balk at the cost\n\nThere have been no significant changes to New South Wales national park camping fees since 2017, however when the changes are enacted, fees will be pegged to increases in the consumer price index, meaning prices would rise each year.\n\nSeasonal price variations will also be applied, meaning campers will pay more in peak times but less on average during the off season.\n\nOverall, sites will be divided into tiers with the lowest tier amounting to a simple clearing with no facilities remaining free. Campgrounds from tier 2 to tier 5 (which make up 85 per cent of sites) will range from $22 in high season for the most basic campground to $65 for sites that have water and access to a flushable toilet. The top campsites, tier 6, which have hot showers and BBQ facilities, will cost $89 per night.\n\nWith CPI indexation, top camping facilities will soon cost more than $90 per night for group bookings. Source: NSW National Parks and Wildlife Service\n\nWhile Parks authorities aim to simplify things by potentially scrapping surcharges for extra people in group bookings, popular campgrounds, particularly around Sydney, will become materially more expensive to stay at during popular times.\n\nADVERTISEMENT\n\nFor example, a family of four who currently pay $68 in a tier 6 beachfront campsite, would soon pay $89 per night, meaning a five night stay would cost an extra $105.\n\nThe higher costs are needed due to record investment in campground infrastructure, increased park management costs and changing community expectations, the National Parks and Wildlife Service says.\n\nThe numbers within the circles represent the number of campgrounds in that geographical area. Source: NSW National Parks and Wildlife Service\n\nMore generous cancellation refunds to tackle ghost camping\n\nVictoria has currently made camping in the state completely free. However NSW authorities have raised \"growing concerns\" around the problem of ghost camping where people book a campsite but then fail to actually turn up. To counteract this ongoing issue, the fee overhaul will increase cancellation refunds to 80 per cent. Currently campers who cancel less than a week out can't get a refund on anything, while they are only eligible for a 50 per cent refund if they cancel between eight and 30 days prior to their trip.\n\nADVERTISEMENT\n\nWhile the changes appear all but certain, authorities insist ongoing feedback from the public – which closes in exactly one month – will inform the final details of the fee overhaul. You can have your say here.\n\nYahoo understands there is no concrete date for when the implementation of the new prices will commence.\n\nIt comes as councils across the country, as well as wildlife rangers, are cracking down on illegal camping. One council on the NSW Central Coast this month warned those in the area ahead of the Easter weekend of heavy fines for illegal camping, including a whopping $110,000 potential penalty for repeat offenders.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/the-meaning-behind-little-known-marker-appearing-on-more-and-more-aussie-roads-031944272.html",
        "title": "The meaning behind little-known marker appearing on 'more and more' Aussie roads",
        "publish_date": "2025-04-25T03:19:44Z",
        "category": "finance",
        "authors": [],
        "text": "An experienced Aussie caravanner said campsite chats have revealed just how few people are aware of the 'green dot' road initiative.\n\nIn NSW and Queensland, drivers have likely noticed green reflective dots on sign posts installed on the side of busy highways. Source: Keith ‘Harry’ Hodges/Facebook/Getty\n\nAussie drivers have been urged to pay attention to a little-known marker that is “appearing more and more” on major roads. In NSW and Queensland, motorists have likely noticed green reflective dots on sign posts installed on the side of busy highways, completely unaware of their meaning.\n\nWhile the simple circles may not appear important, they can in fact be a vital sign for travellers.\n\nExperienced Aussie caravanner Keith ‘Harry’ Hodges, who documents his adventures online, said many recent campsite chats have revealed just how few people are aware of the green dot road initiative.\n\nIt was created several years ago by road safety advocate and truck driver Rod Hannifey, who was routinely trying to find a good spot to pull over because he was tired — but by the time he found one, he would be passed it.\n\nADVERTISEMENT\n\nApproximately 500 meters from a safe place to pull over, drivers will notice three green dots under the standard red reflector. Getting closer, two green circles will appear on the post indicating the pull-over spot is about 250 metres ahead. Finally, one green circle appears just before the rest area.\n\n“These green dots can be found more and more on New South Wales and Queensland roads,” Hodges said. “They are not limited to just trucks, motorhomes or car and caravans, they are there for any motorists to pull over and let traffic past.”\n\nApproximately 500 meters from a safe place to pull over, drivers will notice three green dots under the standard red dot. Getting closer, two green circles will appear. Source: Keith ‘Harry’ Hodges/Facebook\n\nMore road markers rolled out across south NSW\n\nIn January, Transport for NSW announced it had marked 14 new green reflector sites “on important freight routes” in the state’s south to improve road safety. Since 2020, on average there have been 47 fatal crashes involving heavy trucks each year.\n\nADVERTISEMENT\n\nThe rollout of more reflective markers “will go a long way in enabling truck drivers to stop and rest on what can be very long journeys, particularly at night,” Minister for Regional Transport and Roads Jenny Aitchison said.\n\nHannifey described the move as a “big win”.\n\n“Green reflector sites have made a real difference out on the road. Another driver told me it had saved their life. It’s such a simple idea, but it’s already saving lives,” he said.\n\nAlthough the concept was designed for heavy transport, you don’t need to be a truck driver or towing a caravan to use the space indicated by the dots, as any motorist can pull up in the safe zone.\n\nADVERTISEMENT\n\nThe sites can be used as a safe place to stop if you’re towing a heavy vehicle and traffic is piling up behind, or if you need a break from driving. However, the areas are not suitable for overnight or extended stays.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]