[
    {
        "url": "https://www.9news.com.au/national/she-knew-something-was-wrong-mums-warning-as-survival-rates-for-certain-cancers-stagnate/3c905b2d-03c5-4096-bfc4-872187e31d70",
        "title": "Jaime's tumour grew to 7cm before her doctors listened to her",
        "publish_date": "Fri, 25 Apr 2025 00:45:15 +0000",
        "category": "lifestyle",
        "authors": [
            "Apr"
        ],
        "text": "The mother of a NSW woman who died of cervical cancer has told how her daughter spent more than a year trying to get doctors to listen to her concerns.\n\nAmanda Ne'Roi is speaking out about her daughter Jaime's devastating case as three peak research organisations - the Australian New Zealand Gynaecological Oncology Group, Ovarian Cancer Australia and the Ovarian Cancer Research Foundation - join forces to call on the government to commit $100 million in funding towards gynaecological cancer.\n\nAround 19 Australian women a day are diagnosed with a gynaecological cancer, according to December 2024 statistics from the Australian Institute of Health and Welfare (AIHW).\n\nJaime Ne'Roi, pictured with her daughter Indiana. Jaime died in 2023 when Indiana was aged one. (Supplied)\n\nHowever, survival rates for gynaecological cancers have stagnated and fallen well behind improvements for other cancers, such as breast cancer.\n\nIn the 15 years between 1991–1995 and 2016–2020, the five-year survival rate for women with gynaecological cancers increased by just 6 per cent, compared with 13 per cent for breast cancer, the AIHW data shows.\n\nNe'Roi said Jaime knew something was not right a few months after she gave birth to her second child, Indiana, in May 2020.\n\n\"She was having spotting, discharge, and an upset stomach. She felt sick. She just knew something was wrong,\" Ne'Roi said.\n\nJaime went to her GP, who referred her to a gynaecologist she had seen a decade earlier, when abnormal cells were detected on her cervix.\n\nAt the time, the gynaecologist decided against a hysterectomy because she was yet to have children.\n\nNe'Roi said the gynecologist dismissed her daughter's symptoms because she had recently given birth.\n\n\"He said it was just because she had a baby. He didn't even give her a pap smear test,\" Ne'Roi said.\n\nIt took her daughter Jaime more than a year for doctors to listen to her concerns, her mother Amanda Ne'Roi said. (Supplied)\n\nJaime then went to another gynaecologist, who also attributed the symptoms to her having had a baby and put her on the contraceptive pill, Ne'Roi said.\n\n\"She kept saying to them, there's something very wrong.\"\n\nNe'Roi said she remembered having conversations with Jaime, who was very worried, and telling her to go back to the gynaecologist.\n\nAfter another visit, the gynaecologist agreed to do an internal examination via a laparoscopy in August 2021, which revealed Jaime had stage 3 cervical cancer at the age of 37.\n\n\"By the time she actually got a doctor to listen, she had a seven-centimetre tumour and it was inoperable,\" Ne'Roi said.\n\nJaime underwent radiation and chemotherapy, and briefly received good news in December 2021, when a scan showed up clear.\n\nHowever, by February 2022 the cancer was back and had spread to her uterus and lymph nodes.\n\nA hysterectomy and more chemotherapy and radiation followed, but Jaime's health was deteriorating fast.\n\nThe last option presented by Jaime's doctors was immunotherapy, however, the family was told it would need to foot the bill at a cost of $6000 a fortnight.\n\n\"My husband and I were looking at selling up our property, everything - so were her brothers,\" Ne'Roi said.\n\nWith the money needed immediately, however, the family started an online fundraiser, which allowed Jaime to start the treatment.\n\nThe treatment was not unsuccessful and Jaime died in July 2023, just under two years after she was first diagnosed.\n\nShe left behind her partner and two children, Harrison, then aged six, and Indiana, aged one.\n\n\"The hardest thing I've had to do in my whole entire life was to tell my grandson his mum had gone,\" Ne'Roi said.\n\n\"He burst into tears and said, 'I just want my mommy back.'\"\n\nJaime Ne'Roi died two years after she was diagnosed with stage three cervical cancer. (Supplied)\n\nRates of cervical cancer have been increasing in Australia, despite the national rollout of the HPV vaccine in 2007, which provides some protection against the cancer-causing virus.\n\nBetween 2000 and 2024, incidence rates of cervical cancer have climbed from 5.5 cases per 100,000 people to 8, AIHW data shows.\n\nNe'Roi said Jaime had been vaccinated for HPV, which showed why women should not become complacent about the disease.\n\n\"I think the trouble is, people become very complacent about gynecological cancers, they aren't mentioned much. Breast cancer is huge,\" Ne'Roi said.\n\n\"I'm sharing this story to illustrate the hidden crisis impacting all Australian women, because it can hit any one of us at any time.\"\n\nMore money was desperately needed for research for all gynecological cancers, Ne'Roi said.\n\nProfessor Clare Scott, Australia New Zealand Gynaecological Oncology Group (ANZGOG) chair, said gynecological cancers had been left underfunded for decades and were a hidden crisis that was expected to grow.\n\nGynecological cancers - which include uterine, ovarian and cervical cancers - are predicted to surge by 21 per cent over the next 10 years.\n\n\"For too long, gynaecological cancers have been overlooked and underfunded, leaving women with limited treatment options and unacceptable survival rates,\" Scott said.\n\n\"These are not just statistics - they are our mothers, sisters, daughters, wives, and friends... we must do better.\"\n\nANZGOG, along with Ovarian Cancer Australia and the Ovarian Cancer Research Foundation, are seeking $100 million in federal government funding over four years to go towards more personalised treatments for patients, clinical education, a national research databank and drug trials.\n\n\"The survival rates for gynaecological cancers have barely changed in decades. That fact alone should be a wake-up call,\" Ovarian Cancer Research Foundation CEO Robin Penty said.\n\n\"We know that the answers are there – they lie in research and in better understanding of women's bodies and women's pain. To reveal them we need appropriate and proportionate investment.\"\n\nA spokesperson for Health Minister Mark Butler said he would continue discussions with the ANZGOG about their proposal.\n\n\"The Albanese Labor government is doing all we can to support patients, families, loved ones and carers on the cancer journey,\" the spokesperson said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/anzac-day-memorials-dawn-services-2025-parades-in-pictures-gallery/4a78f54e-230c-41da-9f7d-15274891a2ef",
        "title": "How Australians are marking Anzac Day",
        "publish_date": "Thu, 24 Apr 2025 23:36:54 +0000",
        "category": "sports",
        "authors": [
            "April"
        ],
        "text": "6 of 20 Attribution: Getty\n\nAttendees walk up the stairs to enter the sanctuary to pay their respects at the conclusion of the dawn service at the Shrine of Remembrance in Melbourne.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-election-2025-policy-promises-anthony-albanese-peter-dutton-housing-tax-energy-health-explained/69f5f5d2-2fff-4aa3-b10e-8ce7d707a50f",
        "title": "The election promises Labor and the Coalition have made to win your vote",
        "publish_date": "Thu, 24 Apr 2025 09:20:52 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "With the federal election campaign well under way, both Labor and the Coalition have unveiled﻿ a slew of policies in an attempt to attract voters.\n\nUnlike in 2022, when Anthony Albanese ran a \"small target\" campaign and there were relatively few significant differences between the major parties' policy offerings, there are some notable contrasts this time around.\n\nHere are the main election promises made by Labor and the Coalition in the lead-up to the 2025 election.﻿\n\nREAD MORE: Where Albanese and Dutton have been on the campaign trail ﻿\n\nAnthony Albanese and Peter Dutton have made a long list of election promises. (Nine)\n\nHousing\n\nLabor\n\nLabor will allow first-home buyers to get into the property market with just a 5 per cent deposit without having to pay lenders mortgage insurance ﻿(LMI).\n\nIt has also promised $10 billion in funding to build 100,000 properties specifically for first-home﻿ buyers, and has matched the Coalition's pledge to ban foreign investors from buying existing homes for two years.\n\nIt will also continue a series of other housing policies enacted this term, including the Housing Australia Future Fund , Help to Buy scheme , and National Housing Accord target of building 1.2 million homes by mid-2029.﻿\n\nREAD MORE: The key seats that could give Labor a second term in government ﻿\n\nTha major parties have different approaches to addressing the housing crisis. (Dion Georgopoulos/SMH)\n\nCoalition﻿\n\nThe Coalition has promised to make the interest payments on the first $650,000 of a mortgage for a new home tax deductible for eligible buyers.\n\nIt will also allow people to withdraw $50,000 from their superannuation for a home deposit, and has allocated $5 billion for a fund to speed up essential infrastructure in a move it says will support 500,000 new homes.\n\nIt has also promised to ban ﻿foreign investors from buying existing homes for two years, scrap the $10 billion Housing Australia Future Fund, and reduce migration intake by 25 per cent.\n\n﻿Tax and cost of living\n\nContrasting tax relief has been ﻿front and centre since the first day of the campaign, with Albanese and Peter Dutton arguing they have the better plan to handle the cost of living.\n\nLabor\n\nLabor went into the election fresh off the federal budget, when it announced a \"modest\" tax cut worth about $5 a week when it's introduced in 2026-27 before doubling to $10 a week the year after.\n\nAt the party's official campaign launch, Albanese also announced an automatic $1000 deduction﻿ all workers will be able to claim instead of having to lodge individual claims and receipts for multiple deductions.\n\nREAD MORE: The suburbs that could make Peter Dutton prime minister ﻿\n\nCoalition\n\nThe Coalition has promised to repeal Labor's tax cuts, instead promising to halve the fuel excise for a year to provide cost-of-living relief to motorists .\n\nIt has also offered up a temporary tax offset of up to $1200 for low- and middle-income earners who take home less than $144,000. This will only apply for the 2025-26 financial year.\n\nPeter Dutton has been visiting plenty of petrol stations to push his proposed cut to the fuel excise. (James Brickwood/SMH)\n\nEnergy﻿ and climate\n\nPerhaps the most significant policy difference between the two major parties is on energy, thanks to the Coalition's push for Australia to embrace nuclear power . ﻿\n\nLabor\n\nLabor has pledged to extend the energy bill rebates rolled out in the 2024 budget for another six months , providing households with an extra $150 in savings.\n\nIt will continue to roll out renewables to meet Australia's energy needs, with the goal of solar and wind making up 82 per cent of the grid by 2030, with gas and other fossil fuels \"firming\" up supply.\n\nIt's also announced a $2.3 billion fund to cut the cost of installing battery storage by 30 per cent.\n\nLabor has existing emissions reductions targets for 2030 and 2050 (a 43 per cent cut and net zero respectively), but hasn't committed to a 2035 goal. ﻿\n\nREAD MORE: The severe penalties for anyone caught voting twice ﻿\n\nLabor's energy policy is focused on expanding the rollout of renewables. (Wolter Peeters/SMH)\n\nCoalition\n\nThe centrepiece of the Coalition's energy plan is its proposal to construct seven nuclear reactors around the country.\n\nIt says all of the plants would be operational sometime in the 2040s, and would cost $331 billion – although the modelling used for that figure relies on Australia needing and producing significantly less energy than Labor's plan.﻿\n\nIt is also planning to ramp up gas production to meet the energy shortfall in the interim as coal plants shut down and the reactors are built﻿, announcing a $1 billion fund for infrastructure expansion.\n\nOpposition leader visits 14th servo of election campaign View Gallery\n\nIt will also introduce an east coast gas reservation , forcing local producers to keep more gas in Australia instead of selling it overseas, and fast-track approval for the North West Shelf gas expansion.\n\nThe Coalition has not set emissions reduction targets. While it has previously talked of scrapping and reviewing Labor's 2030 goal, it says it is committed to net zero by 2050 and the emissions reduction targets Australia signed up to at the Paris climate conference.\n\nThe Coalition has also pledged to repeal the New Vehicle Efficiency Standard, which encourages car makers to produce more fuel-efficient vehicles and penalises companies that exceed a set emissions cap.\n\nThe Coalition is proposing a shift to nuclear energy. (AP Photo/Virginia Mayo)\n\nHealth\n\nLabor has leant heavily into health – particularly Medicare – during the campaign, seeking to target Dutton for his previous stint as health minister.\n\nLabor\n\nLabor will also spend $644 million to expand the Medicare urgent care clinic network with 50 new centres, and $1 billion to build or upgrade dozens of walk-in mental health facilities and train 1200 new workers in the sector.\n\nMedicare has been at the heart of Anthony Albanese's re-election pitch. (Alex Ellinghausen)\n\nCoalition\n\nFor the most part, the Coalition has matched Labor's big health policies, promising to back the $8.5 billion Medicare funding and cut to PBS medicine costs.\n\nOn mental health, it is promising $400 million for youth services, and will permanently reintroduce the pandemic-era policy for 20 subsidised mental health sessions for people with a mental health care plan﻿, up from the current 10.\n\nEducation\n\nEducation is another area ﻿that Labor has sought to target, particularly in relation to childcare and student debt.\n\nLabor\n\nLabor has promised to forgive $16 billion in student debt on June 1 – a 20 per cent cut for everyone with an outstanding HECS-HELP or other similar loan.\n\nIt will also establish a $1 billion fund to build and upgrade 160 childcare centres, in addition to its move to provide three days of subsidised childcare for all families .﻿\n\nLabor will also continue to provide fee-free TAFE places.﻿\n\nCoalition\n\nThe Coalition will set a target of having 400,000 apprentices and trainees and incentivise businesses to provide those positions.﻿\n\n﻿Workplace\n\nA focus on workplace policies has somewhat faded as the campaign﻿ has progressed.\n\nLabor\n\nLabor will ban non-compete clauses for workers earning less than $175,000 a year to make it easier for people to change jobs. It is also promising to protect penalty rates in legislation if re-elected.\n\nCoalition\n\nThe Coalition has promised to shrink the size of the public service by 41,000 workers over five years through a hiring freeze, natural attrition, and offering voluntary redundancies.\n\nIt is also offering up to $20,000﻿ in tax deductions for small businesses to spend on staff meals and entertainment.\n\nIt has previously promised to repeal the right-to-disconnect ﻿laws introduced in the last parliament, although has said it would keep Labor's same job, same pay legislation.\n\nIt had been promising to force public servants back to the office, but scrapped that policy one week into the campaign .﻿\n\nREAD MORE: The 10 closest seats heading into the election ﻿\n\nBoth parties have a small handful of policies focused on workplaces. (Louie Douvis/AFR)\n\nCrime\n\nAs a largely state-controlled issue, crime hadn't been a major talking point until late in the campaign due to an Easter Monday announcement by the Coalition .\n\nLabor\n\nLabor largely wasn't drawn on the Coalition's crime announcement, pointing to its own policies it enacted during the last term, including introducing a child sexual offender registry and a crackdown on illegal tobacco being imported into Australia.﻿\n\nIt also made the first domestic violence pledge of the campaign: $8.6 million in funding for \"innovative \" management of perpetrators, as well as a crackdown on financial abuse .﻿\n\nCoalition\n\nThe Coalition ﻿promised to allocate $750 million in funding for a range of crime policies, including trialling a new child sex offenders disclosure scheme, an AFP strike force to target illicit drugs, and a national antisemitism taskforce led by the AFP.\n\nIt also said it would standardise knife laws and roll out detector wands across the country in conjunction with the states and territories.\n\nIn a later announcement, it ﻿promised $90 million for domestic violence prevention and response , including setting up a notional offenders registry.\n\nREAD MORE: How independents will shape the federal election ﻿\n\nDefence spending was brought up late on in the campaign. (AP)\n\nDefence\n\nWhile defence has loomed over much of the campaign due to the reported Russian request for an airbase in Indonesia, it took until 10 days before election day for a major announcement by either of the parties.﻿\n\nLabor\n\nLabor has not leant heavily into defence during the campaign. Last year, it promised to increase defence spending by $50.3 billion over a decade , and later announced it would bring some of that forward.\n\nCoalition\n\n﻿The Coalition announced it would boost spending by a further $21 billion by 2030 and lift total defence expenditure to 3 per cent of GDP within the next 10 years.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/chinese-manufacturing-tiktok-are-luxury-handbags-really-being-made-in-china-its-a-complex-answer/b8b9fa8d-277e-41f2-b365-18de66981b5f",
        "title": "Are luxury handbags really being made in China? It's a complex answer",
        "publish_date": "Thu, 24 Apr 2025 02:22:37 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "The majority of the world's designer luxury goods are made in China, not Europe, Chinese manufacturers have claimed on social media.\n\nHandbag manufacturers from China sent TikTok into meltdown in recent weeks, claiming massive designer brands like Gucci, Prada, Louis Vuitton and Dior make their bags in China before shipping them to Europe to get \"made in Italy\" stamped on the tag.\n\nIn a now-removed video, bag craftsman Wang Sen claimed that 80 per cent of luxury bags are made in China.\n\nREAD MORE: Customer left confused after bank closes accounts with no warning or reason\n\nHandbag manufacturers from China sent TikTok into meltdown in recent weeks, claiming massive designer brands are made in China. (iStock)\n\n\"Some say as long as there's a tag saying 'made in China', that bag can never be quality... however﻿, in fact, more than 80 per cent of the luxury bags in the world are made in China,\" he says in the video.\n\n\"Those luxury brands just won't acknowledge that they take almost finished bags from China factories back to their own countries and just do the repackaging and logo installation﻿... that way the bags will appear in their boutiques as 'made in Italy'.\"\n\nHe posted several other videos, showing the inside of ﻿the factories where he says the designer bags are made.\n\nAfter the video went viral, hundreds more videos followed from other manufacturers making similar claims.\n\nBut is it true?\n\nAre designer bags made in China?﻿\n\nBily Dimoski, the Australian director ﻿of global fashion agency Deepwear, said parts of luxury items are manufactured in Asia and other countries - but not the whole bag.\n\n\"While China is a major player in global manufacturing, the claim that 80 per cent of luxury goods are made there oversimplifies a much more complex supply chain,\" she said.\n\n\"Brands like Louis Vuitton, you're looking at maximum 60 per cent of the bag being made (not in Europe)... and it's not the finished bag ... that is definitely happening, but it's not only out of China﻿.\"\n\nAbout 60 to 70 per cent of a luxury bag's components would be sourced and manufactured in Asia and other countries, with the remaining 30 to 40 per cent of the production complete in Europe, Dimoski said.\n\nREAD MORE: Man accused of carjacking that left woman in hospital\n\nIn a now-removed video, bag craftsman Wang Sen claimed that 80 per cent of luxury bags are made in China. (Nine)\n\n\"Luxury production is highly fragmented, luxury brands rely on a multiple-country model, materials and parts may be sourced out of Asia, but the design, finishing and assembly are often placed in Europe,\" she said.\n\n\"For example, Japan has great zippers, so (components) are probably coming from all different countries, but they'd do the finished piece in Europe.\"\n\nDimoski warned consumers to \"think critically\" before placing an online order with one of the Chinese manufacturers. ﻿\n\n\"What does exist in China is a large counterfeit market - factories are capable of producing high-grade counterfeits, they have the craftsmanship and technical skills to produce luxury products.\n\n\"I'm 100 per cent sure that (the bags) are counterfeits... China can develop high luxury products.\"\n\nREAD MORE: Faithfuls pay their final respects to Pope Francis as public viewing begins\n\nThe \"made in\" label depends on where the last substantial transformation happens for the product, which could mean anything from a bag's stiching to leather tanning. (Getty)\n\nOnly a percentage of any item has to be made in the country that's attributed on the tag, for both luxury and non-luxury brands.\n\nThe \"made in\" label depends on where the last substantial transformation happens for the product, which could mean anything from a bag's assembly to leather tanning.\n\nDimoski says there's a grey area around the tags.\n\n\"Some brands only do the final stitching or packaging in Italy, just enough to meet legal requirements. Technically, that's allowed,\" she said.\n\nFounder and director of Melbourne-based offshore clothing manufacturer, The Clothing Room, Kristy Sturgess, told 9news.com.au a large majority of high-end brands would have China in their supply chain.\n\nDimoski warned consumers to \"think critically\" before placing an online order with one of the Chinese manufacturers. ﻿ (Supplied)\n\n\"There are a lot of independent and high-end brands that are still producing out of China, it's not uncommon... to my knowledge, it's about 80 per cent,\" she said.\n\n\"Some would be coming from other countries like India or potentially Bali, and then you've got some brands, about 5 per cent, would be manufacturing (from start to finish) in Europe.\n\n\"They may be leaving a certain portion of the finishing to be done in Italy, and then they're able to label that was made there.\"\n\n9news.com.au understands some luxury brands do not use Chinese factories at all to make their bags.\n\nPrada has 26 industrial factories globally, with 23 in Italy.﻿\n\nLouis Vuitton says on its website that its products are made in France, Italy, Spain, the US and Switzerland, but does not specify the number of factories in each country. ﻿\n\nBoth Sturgess and Dimoski cautioned that the videos circulating online of factories claiming to manufacture for the big designer brands are more likely to feature high-quality fakes.\n\nThe videos were posted to TikTok, sending fashion lovers into a meltdown. (AP Photo/Ashley Landis)\n\nHow much do luxury bags cost to make? ﻿\n\nWhen the videos started going viral on TikTok, some protested they had always known, while others were outraged by just how large the profit margins were on these luxury items, which cost well over $10,000.\n\nOne video by SENBAGS broke down the production cost of a Hermes Birkin bag to about $US1400 ($2200).\n\nBirkin bags, which are made in France, ﻿sell for anywhere between $10,000 to $30,000 out of the store, and can reach up to $2 million in the elusive second-hand market, depending on the rarity of the bag.\n\nREAD MORE: Teenager shot dead during brawl near popular beach\n\n﻿\"A Birkin bag is not $30,000 to manufacture... there's always a 20 to 30 per cent upcharge when producing in Europe compared to Asia,\" Dimoski said.\n\n\"So on that $1400 figure, put about 30 to 40 per cent on top of that (for the cost).\" ﻿\n\nDimoski said Deepwear have previously produced mid to high quality bags for between $70 to $150 wholesale.\n\nSturgess said online outrage about the price of making a Birkin bag \"is justified\".\n\n\"You're talking about a luxury brand that's selling a bag for $59,000... It's costing $1500 (for a high-quality replica) being made in China,\" Sturgess said.\n\n\"I can understand the uproar.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/tatsuya-investigation-under-way-after-rat-found-in-womans-salad-at-restaurant/769d6da2-4c81-47b5-abd3-b38c56d3cbee",
        "title": "Restaurant apologises after woman complains she found rat in salad",
        "publish_date": "Thu, 24 Apr 2025 09:01:57 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A north-west Sydney restaurant has apologised to customers after a customer complained that a rat was found in a woman's salad.\n\nTatsuya West Ryde was open this afternoon, two days after the rodent was discovered on Tuesday.\n\nPictures posted in a Google review showed the slimy, lifeless pest the size of an adult hand.\n\nA food safety investigation is underway after a rat was found in a woman's salad at a Japanese restaurant in Sydney's north west. (Nine)\n\n\"I'd eaten half of it at this point,\" the woman claimed.\n\n\"What's even more shocking is that they continued to serve food to other customers that weren't aware.\"\n\nIt was described as \"unacceptable and disgusting\" by another customer sitting near the woman.\n\nThere have been six individual reviews about the incident.\n\nThe restaurant apologised for the incident in a response to the woman's one-star review.\n\n\"We sincerely apologise for this incident,\" it wrote.\n\nPictures posted in a Google review showed the slimy, lifeless pest the size of an adult hand. (Nine)\n\n\"The issue originated from a delivered salad box which we are currently investigating with our supplier and local food authorities.\n\n\"We are taking all necessary steps to prevent such incidents and appreciate your understanding.\"\n\nIn a statement to 9News, the restaurant's owner said the cause of the incident was under investigation.\n\n\"An unexpected and deeply concerning issue arose during service, for which we acknowledge a serious lapse in our internal processes,\" the owner said.\n\n\"While we prefer not to go into graphic detail out of respect for those affected, we fully recognise that the incident occurred within our operations and may have caused distress to the customers involved, as well as to the wider community that places its trust in us.\n\n\"Regardless of rumours or online commentary, our position remains clear: the incident happened at our restaurant, and we take full responsibility.\n\n\"We are not focused on assigning blame or debating the source.\n\n\"Our priority is to take strong corrective and preventative actions to ensure something like this never happens again.\"\n\n\"We are treating this matter with the utmost seriousness.\"\n\nThe restaurant voluntarily reported the find to the City of Ryde and the NSW Food Authority.\n\nIt also quarantined related ingredients, engaged pest control services, closed the restaurant for a deep clean, retrained staff and launched an internal review, the owner said. ﻿\n\n\"We recognise that words alone are not enough. Our responsibility now is to act decisively, improve our standards, and rebuild the trust that this community has placed in us.\n\n\"That is what we are committed to — openly, sincerely, and with lasting improvements.\n\n\"We offer our heartfelt apology to the customer involved and to everyone affected.\n\n\"At Tatsuya, we hold ourselves to high standards.\n\n\"When we fall short, we take it seriously, and we are committed to doing better.\"\n\nRyde City Council said they had inspected the restaurant on Thursday after receiving a complaint from a diner.\n\n\"The inspection uncovered several food safety issues and Council will be taking enforcement action under the Food Act 2003 to address them,\" the council said in a statement.\n\n\"All food handlers at the restaurant will also be required to undertake further training in food safety matters.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ute-brand-taken-to-court-for-alleged-misleading-advertising/ee880c84-7ea5-4ed7-b296-8bdb5019ff39",
        "title": "ACCC alleges ute brand's claims of 'durable and tough' cars were misleading",
        "publish_date": "Wed, 23 Apr 2025 23:48:08 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Australia's consumer watchdog has launched legal action against a major Chinese car manufacturer, accusing the brand of misleading advertising about the durability of its vehicles.\n\nThe Australian Competition and Consumer Commission (ACCC) alleges LDV Automotive Australia, a brand that makes utes and vans, claimed that several of their models were \"durable and tough\" and that they were suitable for use in off-road terrain and harsh conditions.\n\nInstead, the ACCC alleges the brands' T60 and G10 models \" had a propensity to rust or corrode within five years of being manufactured\".\n\nThe ACCC alleges that LDV Automotive Australia, a brand that makes utes and vans, claimed that several of their models were \"durable and tough\", and that they were suitable for use in off-road terrain and harsh conditions. (Supplied/ACCC)\n\nIn a statement to 9news.com.au, LDV Australia said the company would be \"defending the ACCC's allegations in court\".﻿\n\nAdvertisements from the company that drew the ACCC's attention included images of LDV T60 utes charging through mud, gravel and flowing creeks.\n\nThe ACCC alleges LDV's claim that the ute \"turns the toughest tracks into a walk in the park\" was misleading.\n\n\"Who needs roads when you're driving a T60?\" was another tag the ACCC alleged was misleading.\n\n\"Therefore, the advertised LDV vehicles, including those in which rust or corrosion occurred, were not durable and tough,\" the ACCC said.\n\nThe watchdog said between 2018 and 2024, the company received more than 5000 complaints from customers about the rust.\n\nAdvertisements from the company that drew the ACCC's attention included images of LDV T60 utes charging through mud, gravel and flowing creeks. (Supplied/ACCC)\n\n\"We allege that despite being aware of the propensity for the vehicles to rust, LDV continued to make representations for a number of years that the T60 and G10 vehicles were durable and suitable for use in a variety of terrains,\" ACCC Chair Gina Cass-Gottlieb said.\n\n\"As a result, we allege that LDV's conduct is likely to have caused harm to affected consumers, including because the propensity for rust or corrosion lowered the value of their vehicles, and because consumers lost the opportunity to make an informed decision that may have involved purchasing an alternative vehicle that did not carry the same risks.\"\n\nThe ACCC will seek penalties and \"consumer redress,\" among other orders when the case goes before the Federal Court.\n\nLDV Australia general manager Dinesh Chinnappa said the company acknowledged﻿ yesterday's announcement of the legal proceedings.\n\n\"﻿For 18 months LDV Australia has been engaged in good faith discussions with the commission in an attempt to resolve its concerns, and to provide remedies to consumers,\" he said.\n\n\"It is disappointing this process has ended in these legal proceedings.\"\n\n\"LDV Australia takes its obligations under Australian Consumer Law seriously, and we look forward to defending the ACCC's allegations in court.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/pope-francis-death-faithfuls-pay-final-respects-to-pope-francis-as-public-viewing-begins/eceeb809-990f-43ac-935b-fb7b9b913526",
        "title": "Faithfuls pay final respects to Pope Francis as public viewing begins",
        "publish_date": "Wed, 23 Apr 2025 20:55:24 +0000",
        "category": "entertainment",
        "authors": [
            "Apr"
        ],
        "text": "Thousands of people have filed through St Peter's Basilica to pay their final respects to Pope Francis at the start of three days of public viewing ahead of his funeral.\n\nThrongs of the faithful made their way to the 16th century basilica's main altar where Francis' open wooden casket was perched, as Swiss Guards stood at attention.\n\nOver the coming days, tens of thousands of people are expected to pass through, and the Vatican said it could extend the viewer hours even longer due to high turnout.\n\nREAD MORE: How the Pope spent his final hours and his last touching words to nurse\n\nThrongs of the faithful made their way to the 16th century basilica's main altar where Francis' open wooden casket was perched. (AP)\n\nIn the first eight-and-a-half hours, 19,430 people paid their respects to the pope.\n\nFrancis was laid out in red robes, clasping a rosary and wearing a bishop's miter, the traditional pointed headdress.\n\nWho are the contenders to be the next pope? View Gallery\n\nMourners waited hours to reach the casket, which was behind a cordon. Some held their mobile phones aloft as they neared to snap photos in what has become a modern ritual.\n\n\"It gave me chills,\" said Ivenes Bianco, as she left.\n\nShe was in Rome from the southern city of Brindisi for medical care, and came to pay her respects.\n\n\"He was important to me because he encouraged co-existence. He brought many people together.''\n\nREAD MORE: At least 26 dead after gunmen open fire on tourists in disputed Himalayan region\n\nThe body of Pope Francis is carried through St. Peter's Square to St. Peter's Basilica at the Vatican. (AP)\n\nFrancis' casket wasn't put on an elevated bier — as was the case with past popes — but placed on a ramp, facing the pews.\n\nIt was in keeping with his wishes for the rituals surrounding a papal funeral to be simplified to reflect his belief that the pope's role is that of simple pastor, not world leader.\n\nCardinals, meanwhile, met in private to finalise preparations for Saturday's funeral and plan the conclave to elect Francis' successor.\n\nFrancis died on Monday at age 88, capping a 12-year pontificate characterised by his concern for the poor and message of inclusion, but also some criticism from conservatives who sometimes felt alienated by his progressive bent.\n\nFrancis first lay in state in the hotel where he lived, in a private viewing for Vatican residents and the papal household.\n\nImages released by the Vatican on Tuesday showed the pope in an open casket, his hands folded over a rosary.\n\nFrancis was laid out in red robes, clasping a rosary and wearing a bishop's miter, the traditional pointed headdress. (AP)\n\nA nun cries as the body of Pope Francis is carried into St. Peter's Basilica at the Vatican. (AP)\n\nWednesday opened with the bells of St Peter's tolling as pallbearers carried Francis' body into the basilica, in a procession through the piazza where he had delivered his final goodbye.\n\nFrancis had made a surprise \"popemobile\" tour through the faithful on Easter Sunday, after his nurse assured him he could despite his frail health from a bout of pneumonia and long hospitalization.\n\nCardinal Kevin Farrell, who is running the Vatican until a new pope is elected, led the procession to the altar, with clouds of incense and the choir chanting the Litany of Saints hymn.\n\nIn pairs, cardinals approached the casket, bowed and made a sign of the cross, followed by bishops, ushers, priests and nuns.\n\nREAD MORE: Eight men sought by police over attack outside Melbourne club\n\nCardinal Kevin Farrell, who is running the Vatican until a new pope is elected, led the procession to the altar. (AP)\n\nThen the doors were opened to the public. There was the squeak of sneakers, the rustling of kneeling nuns, the murmur of quiet prayers. A cough, a child's cry.\n\n\"We knew there were many people, so we approached this with calmness,\" said Rosa Morghen from Naples, adding: \"It's the feeling one experiences when a family member passes away, as he is a father, a grandfather who has gone.\"\n\nThe public viewing ends Friday at 7 pm (3am AEST), after which Francis' casket will be closed and sealed.\n\nThe funeral has been set for Saturday at 10 am (6pm AEST) in St Peter's Square.\n\nIt will be attended by world leaders, including US President Donald Trump and Ukrainian President Volodmyr Zelenskyy.\n\nAfter the funeral, the conclave\n\nFrancis' death and funeral will usher in a carefully orchestrated period of transition in the 1.4 billion-strong Catholic Church, with cardinals gathering over the coming days before entering a conclave, the secretive ritual voting in the Sistine Chapel to elect a new pope.\n\nThe public viewing ends Friday at 7 pm, after which Francis' casket will be closed and sealed. (AP)\n\nThere are 133 cardinals who are under 80 years old and eligible to vote, after two bowed out for health reasons, and the new pontiff will likely come from within their ranks. The conclave is not expected to begin before May 5.\n\nSouth Korean Cardinal Lazarus You Heung-sik, who heads the Vatican's office for priests, predicted a short conclave but acknowledged the transition is full of uncertainties.\n\n\"We'll see what the Holy Spirit says,\" he said on Wednesday. Asked if the next pope could come from Asia, where the Catholic Church is growing, he insisted: \"For the Lord, there's no East or West.\"\n\nPapua New Guinea's first and only cardinal, John Ribat, prepared on Wednesday to leave for Rome to participate in the vote, pleased to represent the South Pacific island nation of 12 million people and more than 800 languages in a College of Cardinals that Francis greatly diversified.\n\n\"To have a representative from here to be in the conclave, it is a big thing,\" Ribart told the Australian Broadcasting Corp.\n\nItalian police have tightened security for the events, carrying out foot and horse patrols around the Vatican. (AP)\n\nHe said he hoped the next pope would be someone who could lead the church in \"a way that is truthful and binds everyone together.\"\n\nItalian police have tightened security for the events, carrying out foot and horse patrols around the Vatican, where pilgrims continued to arrive for the Holy Year celebrations that Francis opened in December.\n\n\"The death of a pope is not a small thing, because we've lost our leader,'' said Julio Henrique from Brazil.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/canterbury-bulldogs-suspensions-brisbane-broncos-loss/105215966",
        "title": "Bulldogs facing two months' worth of bans after Broncos loss",
        "publish_date": "Fri, 25 Apr 2025 01:28:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Canterbury Bulldogs have copped another blow after their first loss of the season, with three players facing a combined nine weeks on the sidelines due to suspensions.\n\nBrisbane ended the Bulldogs's 6-0 start to the year with a 42-18 win at a rain-soaked Lang Park on Thursday night, during which three Bulldogs were sent to the sin-bin.\n\nWinger Marcelo Montoya was binned for a high shot on Broncos back rower Brendan Piakura, but it appeared to be as much about repeated offences as the severity of the contact, and he was not cited.\n\nABC Sport is live blogging every round of the AFL and NRL seasons in 2025.\n\nBroncos winger Deine Mariner was also binned late in the game for a high tackle on Viliame Kikau but escaped the match review committee's wrath.\n\nDogs forwards Sitili Tupouniua and Josh Curran were not so lucky for their high shots, and five-eighth Matt Burton was also charged with a grade-two careless high tackle on Billy Walters.\n\nBroncos end Bulldogs' perfect start to 2025 Photo shows Bronson Xerri and Jacob Preston stand on the field after the Bulldogs' loss to Brisbane. Canterbury coach Cameron Ciraldo says he is equal parts \"proud\" and \"filthy\" with his team after their perfect start to the season was undone by the Brisbane Broncos.\n\nTupouniua was the hardest hit, cited for a shoulder charge and lifting his knees into the tackler's head, both on Piakura.\n\nThe off-season recruit from the Roosters was offered three games for the shoulder charge and two weeks for the high knees with early guilty pleas, with one week added to each if he fights the charges.\n\nCurran is facing a three-week ban if he pleads guilty to a shoulder charge on Payne Haas and Burton can accept a one-game ban for his high tackle on Walters.\n\nCanterbury utility Kurt Mann told ABC Sport a number of the reported incidents were \"pretty unavoidable\" as players slipped over in the wet.\n\n\"I guess it's the way the game is going,\" he said.\n\n\" Some people don't really agree with it, a lot of people probably wouldn't, but that's just the way it is now. \"\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nBulldogs coach Cameron Ciraldo was non-committal when asked if the sin-binnings were too harsh but admitted it was not an easy game to watch.\n\n\"I don't know. There was so much going on tonight and no flow to the game,\" he said.\n\n\"It was one of those games that was hard to watch to be honest. It was a ball-ache to watch for me so I am sure everyone else felt the same.\n\n\"I put that down to us trying too hard. We have been pretty disciplined for long periods so we can fix it.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/when-is-pope-funeral-what-to-expect/105206542",
        "title": "When is Pope Francis's funeral? What to know about the ceremony and burial",
        "publish_date": "Fri, 25 Apr 2025 00:58:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "The death of Pope Francis on Easter Monday has set in motion a series of ancient rituals that will culminate in his funeral on Saturday.\n\nBut it will not follow traditional protocols, making a break from the past as the world mourns the loss of the \"people's pope\".\n\nHere's what we know about the funeral of Pope Francis.\n\nWhen is the pope's funeral?\n\nThe pope's funeral will take place on Saturday, April 26 — six days after his death.\n\nIt will begin at 10am local time. That's 6pm AEST for Australians on the east coast.\n\nWhere will it be held?\n\nFrancis's funeral will be held outside in St Peter's Square, weather permitting.\n\nPrevious papal funerals have also been held outside, with thousands of mourners filling the open space in front of the basilica.\n\nFrancis's funeral liturgy will be presided over by Cardinal Giovanni Battista Re, dean of the College of Cardinals — the group which will in the coming weeks be tasked with appointing a new pope.\n\nInside Pope Francis's final days Photo shows A man in religious garb sitting in front of a red curtain, looking on As he glided around St Peter's Square in his Popemobile on Sunday, the fact he was 88 and had just spent several weeks in hospital somehow seemed a distant memory. Then everything changed.\n\nHow to watch\n\nABC NEWS will broadcast the funeral as part of its live coverage on Saturday.\n\nCoverage will also be blogged live right here on the ABC NEWS website and a stream will be available on YouTube.\n\nVatican Media will offer a live stream on YouTube and its official websites.\n\nWhere will the pope be buried?\n\nA pope known for defying expectations, Francis will continue this trend in death.\n\nHe will become the first pontiff to be buried away from the Vatican in more than a century.\n\nIn his final testament, dated June 29, 2022, Pope Francis requested he be buried at Rome's Basilica of Saint Mary Major.\n\nThroughout his life, Francis has always entrusted himself to the Virgin Mary.\n\n\"For this reason, I ask that my mortal remains rest — awaiting the day of Resurrection — in the Papal Basilica of Saint Mary Major,\" the will read. \"The tomb must be in the earth; simple, without particular decoration and with the only inscription: Franciscus.\"\n\nThe last pope to be buried there was Clement IX in 1669.\n\nInside the Basilica of Santa Maria Maggiore, where Pope Francis has decided to be buried. (Reuters: Guglielmo Mangiapane)\n\nThe Unesco World Heritage site is one of the Italian capital's four major papal basilicas, and has played a key role in Francis's history since he was elected in 2013.\n\nLess than 24 hours after he became pope, Francis visited the basilica to pray in front of one of the Catholic world's most important icons of the Virgin Mary, the Salus Populi Romani — meaning Salvation of the Roman people.\n\nHe would regularly travel to St Mary Major before leaving on trips abroad and upon his return to Rome.\n\nWho will attend?\n\nTens of thousands of people are expected to attend the funeral.\n\nA string of world leaders have confirmed they will travel to the Vatican for the service.\n\nHere's a list of some of the attendees:\n\nArgentinian president Javier Milei\n\nItalian prime minister Giorgia Meloni\n\nBrazilian president Luiz Inácio Lula da Silva\n\nFrench president Emmanuel Macron\n\nBritian prime minister Keir Starmer\n\nUkrainian president Volodymyr Zelenskyy\n\nUS president Donald Trump and his wife Melania\n\nBritain's Prince William will also be attending on behalf of his father King Charles.\n\nAustralia will be represented at the funeral by Governor-General Sam Mostyn and the ambassador to the Vatican, designate Keith Pitt.\n\nThe list will also include federal trade minister Don Farrell and former deputy prime minister Michael McCormack.\n\nPrime minister Anthony Albanese and Opposition leader Peter Dutton will not attend as the election enters its final week.\n\nAll of the 252 Catholic cardinals will be invited to attend.\n\nUkrainian-born Melbourne cardinal Mykola Bychok will also be at the funeral. He is one of the 135 cardinals from around the world eligible to take part in the conclave.\n\nLoading...\n\nHow does the pope's funeral work?\n\nIn 2024, Francis revised various papal funeral rites and rituals to cut back on a lot of the associated pomp and pageantry.\n\nExplaining the changes, Archbishop Diego Ravelli, master of Papal Liturgical Ceremonies, said that the aim was to highlight that the pope's funeral is \"that of a shepherd and disciple of Christ, and not of a powerful man of this world\".\n\nFor example, traditionally, a deceased pope was laid to rest inside three stacked coffins made of cypress wood, lead and oak.\n\nHowever, after the changes enacted by him last year, Francis's body is being placed inside a simplified wooden coffin lined in zinc.\n\nDuring Pope John Paul II's funeral, the service began with the great bells of St Peter's Basilica tolling in mourning.\n\nThen 12 pallbearers carried John Paul's coffin out of the church. The choir sang the Latin prayer: \"Grant him eternal rest, O Lord, and shine your light on him forever.\"\n\nThe coffin was then laid on the steps of the vast church.\n\nSaturday's two and a half hour service will likely be led by Cardinal Battista Re.\n\nCardinal Giovanni Battista Re also led former Pope Benedict's funeral in St. Peter's Square. (Reuters: Guglielmo Mangiapane)\n\nHe will lead those present in prayers and Bible readings, and will deliver the final commendation and valediction — a concluding prayer where the Pope will be formally entrusted to God.\n\nThe funeral will be held in different languages. It's likely that the main prayers will be said in Latin and Italian.\n\nPatriarchs, cardinals, archbishops, bishops and priests from across the globe will take part.\n\nThe event requires a huge security operation.\n\nAn estimated four million people thronged the streets of the Vatican during John Paul II's funeral in 2005, alongside 8,000 security staff members.\n\nAfter the funeral, the pontiff's body will be moved to St Mary Major for the burial.\n\nA nine day mourning period, known as Novemdiales, will then begin.\n\nWhen will the conclave happen?\n\nFollowing the funeral, a conclave of cardinals will convene to elect a successor.\n\nWe don't have an exact timing on that yet.\n\nWho could be the next pope? Photo shows Pope Francis grinning while wearing white robes and a silver Catholic cross chain and waving with his left hand Speculation is swirling about who could be the new leader of the Catholic church. But the secretive nature of papal elections means it's hard to pick a single frontrunner.\n\nBut the dean of the College of Cardinals has 15 to 20 days to summon the cardinals to Rome after the pope's death where they meet in the Sistine Chapel to begin the decision-making process.\n\nOnly cardinals under the age of 80 have a say in the decision and the voting takes place behind closed doors.\n\nIt typically takes from days to weeks for a pope to be chosen, though it can stretch slightly beyond that.\n\nOf the cardinals eligible to appoint the next pontiff, Pope Francis installed 108.\n\nThe last three popes were chosen within days.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/carlos-alcaraz-withdraws-vukic-hijikata-lose-madrid-open-tennis/105215486",
        "title": "Aussies' tough runs continue as Alcaraz withdraws from Madrid",
        "publish_date": "Fri, 25 Apr 2025 00:08:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "It was a rough day for the Australians and the local fans at the Madrid Open as Spanish star Carlos Alcaraz was forced to withdraw, while the green and gold contingent was slashed.\n\nThe Sydney duo of Aleksandar Vukic and Rinky Hijikata both crashed out at the celebrated Caja Magica clay-court venue in the capital, with Maya Joint's loss leaving Daria Kasatkina as the only Australian representative on the women's side.\n\nNews of home favourite Alcaraz's withdrawal from the tournament to protect a injury left the home fans deflated, with the second seed struggling with hamstring and groin injuries ahead of his French Open title defence next month.\n\nAlcaraz sustained the injury and took a medical timeout during the final of the Barcelona Open, where he was denied a third title by Denmark's Holger Rune.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nAlcaraz had received a bye into the second round and was scheduled to play his first match against Canada's Gabriel Diallo on Friday before he pulled out.\n\nThe 21-year-old said he would try to play the next big tournament in the clay-court swing, the Rome Masters 1000 event from May 7-18, where world number one Jannik Sinner is expected to make a comeback from his doping ban.\n\nIt was a similarly tough day for Australian fans as three male players were left on the men's side and just one on the women's.\n\nKei Nishikori beat Vukic 6-4, 3-6, 6-3, marking the Japanese veteran's 450th victory at tour-level in his distinguished career, with the 35-year-old saying he hopes to reach 500 before retiring.\n\nVukic suffered his 10th straight defeat in what is turning out to be a wretched season for the 29-year-old world number 83, whose last eight matches have ended with him losing in a deciding set. He has not enjoyed a winning handshake since beating Bjorn Borg's son Leo in the Davis Cup back in Stockholm in January.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHijikata enjoyed victories over Lloyd Harris and Fabio Fognini in qualifying but is also enduring a tough run, falling 7-5, 7-5 in his opening-round clash to giant American Reilly Opelka for a fourth straight tour-level defeat in a month.\n\nAustralia's big guns will enter the men's main draw over the next couple of days, with sixth seed Alex de Minaur set to face Italian Lorenzo Sonego, and 25th seed Alexei Popyrin up against unpredictable Kazakh Alexander Bublik. Chris O'Connell rounds out the remaining Australians in the ATP draw, facing a daunting second-round encounter with third seed Taylor Fritz.\n\nOn the women's side, teenager Joint, fresh off her first WTA 1000 level win, fell to 10th-ranked Emma Navarro in straight sets — 7-5, 7-5.\n\nKasatkina faces American Alycia Parks after receiving a bye into the second round.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/conclave-movie-streaming-watch-pope-election/105204912",
        "title": "What the film Conclave gets right (and wrong) about electing a new pope",
        "publish_date": "Fri, 25 Apr 2025 00:00:48 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Smear campaigns, politicking, gossip and blackmail: Conclave had it all.\n\nThe film about the death of a fictional pope and the election of a new papal leader was an awards-season favourite.\n\nAnd now, as Catholics around the globe mourn the death of Pope Francis, that election process begins in the real world too.\n\n\"I had grown up in a Catholic family [and] uncles of mine work as Catholic priests and theologians,\" Conclave's lead actor, Ralph Fiennes, told the ABC.\n\n\"So my instinctive thing was, 'Please, please can we get this right? Can the details be accurate?'\"\n\nAnd as life imitates art in the weeks to come, the film will act as a reference point for many of us outside the secretive process.\n\nWe sat down with Darius von Guttner Sporzynski, a historian and the dean of the Australian Catholic University's Canberra campus, to see if Fiennes got his wish.\n\nWhat happens when the pope dies?\n\nIn Conclave, we follow Fiennes' character, Cardinal Lawrence, in the aftermath of a fictitious pope's death.\n\nWhen a pope passes away or resigns, a 'vacancy of the Apostolic See' is declared. The rules around what happens next are set out in Vatican legislation, updated by Pope John Paul II in 1996.\n\nProfessor von Guttner Sporzynski says the film mirrors this legislation \"almost to the letter\".\n\nConclave's cast and crew aimed for accuracy with every detail. (Supplied: Roadshow)\n\nNine days of mourning follow the death, cardinals arrive at the Vatican from around the world, and the conclave — the meeting central to the election process for the new pope — must begin within 20 days.\n\nFiennes' Cardinal Lawrence is a fictional Dean of the College of Cardinals, the person who must oversee the conclave.\n\nThe current real-life dean is Giovanni Battista Re; however, the 91-year-old will not be able to run the conclave, as participation is restricted to cardinals under 80.\n\nWith the vice dean (Cardinal Leonardo Sandri) also over 80, the running of the conclave usually falls to the most senior eligible cardinal bishop, Cardinal Pietro Parolin.\n\nWhat Pope Francis has revealed about the conclave\n\nMuch of the film centres on factional tensions and smear campaigns among the cardinals, who have differing views on the future of the church.\n\nProfessor von Guttner Sporzynski says just how much this has been dramatised for entertainment is up for debate.\n\n\"There are no written minutes that are given to us to suggest how these meetings unfold,\" he says.\n\nFor him, the film excels in showing the human side of a deeply spiritual process, where cardinals have their own likes, dislikes, ideologies, flaws and vices.\n\nWhile director Edward Berger calls Conclave a \"thriller that takes us behind the Vatican doors\", he says it's really about \"Ralph Fiennes' inner journey\". (Supplied: Roadshow)\n\nPope Francis himself (then Jorge Bergoglio) revealed a group of cardinals \"used\" him in the 2005 conclave in an attempt to block the election of Cardinal Joseph Ratzinger.\n\nIn his book The Successor, the late Pope said he received 40 out of 115 votes, but the intention wasn't to elect him. Instead, the group aimed to prevent a 'foreign' pope, hoping to force a compromise candidate after knocking the German Cardinal Ratzinger out of the running.\n\nRaised in Argentina but ethnically Italian, Pope Francis announced he would refuse the role, and Cardinal Ratzinger was elected as Pope Benedict XVI.\n\nThe Vatican and the Santa Marta residence\n\nIn Conclave, like in the real world, cardinals are sequestered to the Vatican throughout the election, so they are not unduly influenced by the outside world.\n\nListen to the podcast Photo shows The Screen Show Jason Di Rosso interviews the makers of the movies and TV you need to see.\n\nThe Vatican is, however, off limits to any and all film and television production.\n\nFilming was therefore limited to historic buildings across Rome, but cast members were given an exclusive tour of the Sistine Chapel.\n\n\"We went to the Vatican and got to see a little bit behind the scenes, what most people would not normally be able to see,\" actor Stanley Tucci told The Screen Show's Jason Di Rosso.\n\n\"That alone is impressive. I mean, the Sistine Chapel is, of course, an extraordinary thing, and to have access to it the way we did … was great.\"\n\nDirector Edward Berger says while they were \"inspired\" by the real Casa Santa Marta — where cardinals live during the conclave — they \"designed it a little bit, because it is so spare and actually looks quite boring, it's not very cinematic\". (Supplied: Roadshow)\n\nFiennes says it was important to the whole cast and crew to be as precise as possible.\n\n\"We did have a religious adviser on set every day to make sure that [with] even the simplest things of our deportment, [like] how we held our prayer hands … we got the details right.\n\n\"I'm sure there'll be people saying we got this wrong and that wrong, but there was definitely a strong effort to be accurate in terms of the religious details in the film.\"\n\nThe conclave's meaning and significance\n\nAs Professor von Guttner Sporzynski explains, the conclave is a secret ballot reminiscent of the leadership elections we have across the globe.\n\n\"There's a paper ballot with a handwritten name of a candidate on it … [and] there's scrutineers,\" just like on our own election nights.\n\nBut as Conclave's director, Edward Berger, pointed out on The Screen Show, it's also \"basically [the] most secretive election process in the world\".\n\nDirector Edward Berger and his team recreated The Sistine Chapel in all its glory for the film. (Supplied: Roadshow)\n\nIn the film, the scrutineers pierce the ballots with a needle and red thread after they've been counted, binding them together and adding to the drama.\n\n\"In the past, the death of a pope was confirmed by … knocking a tiny silver hammer into the forehead of the deceased,\" Professor von Guttner Sporzynski says.\n\n\"That used to be the tradition. We don't do this anymore; medical practitioners now confirm the person is dead.\n\n\" Do they [still] use the thread to do the needle thing? I don't know. Maybe yes, maybe not. But it looks very good in the movie. \"\n\nHe says cardinals cast two ballots each morning and two each afternoon, until a consensus of two-thirds majority is reached.\n\nSmoke from the Sistine Chapel's chimney is still the first notification the public have about the conclave's results.\n\nBlack smoke means a failed vote, while white smoke signals there is a new pope.\n\nProfessor von Guttner Sporzynski says originally this was achieved by burning the ballots themselves, with the addition of wet straw to create white smoke.\n\nThese days, as in the film, the colours are achieved with chemicals.\n\nFactional tensions heighten the drama in Conclave. (Supplied: Roadshow)\n\n\"Essentially, Pope John Paul II put all these new rules in the [Vatican] legislation because he participated in two conclaves and he understood that the old rules were slightly too cumbersome,\" Professor von Guttner Sporzynski explains.\n\nHe says these practical, logistical concerns find a balance with spirituality in the conclave process.\n\n\"Catholics believe it is inspired by the higher power and like [they say] in the movie: If there was no mystery, there wouldn't be a need for faith.\"\n\nConclave is streaming in Australia (to rent or buy) on Prime Video, Apple TV, Google TV or YouTube.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/sunshine-coast-flash-flooding-hinterland-anzac-day/105215158",
        "title": "Lightning strikes, flash floods cancel Sunshine Coast dawn services",
        "publish_date": "Thu, 24 Apr 2025 22:11:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Heavy rain, flooding, and dangerous lightning in Queensland's south east have forced the cancellation of at least two Anzac dawn services on the Sunshine Coast and some marches on the Gold Coast.\n\nOn the Sunshine Coast hinterland, emergency services rescued two people from their cars, and several roads have been shut.\n\nAlmost 140 millimetres of rain fell in Nambour in the three hours to 1:30am.\n\nOther parts of the coast experienced between 100 and 200mm of rain since 9am yesterday, with the bulk of it overnight.\n\nSome of the highest totals were at West Woombye, where falls of 235mm were recorded.\n\nThat led to the cancellation of the Nambour dawn service, breakfast, and march.\n\nAlmost 300 chairs washed away\n\nNambour RSL sub-branch president Wes Davidson was disappointed the service had to be cancelled. (ABC News: Jennifer Nichols)\n\nNambour RSL sub-branch president Wes Davidson described the cancellation of the service as \"very disappointing\".\n\n\"We planned for a long time … and put so much effort into this over the past three or four months,\" he said.\n\n\"Unfortunately, this morning I just had to make the call.\"\n\nMr Davidson said even if floodwaters had receded in time, the amount of mud and the slippery ground left behind would have rendered the area unsafe.\n\nOrganisers of the Nambour dawn service are beginning the mammoth task of trying to find the 280-odd chairs that were washed away in the flash flooding. (ABC News: Jennifer Nichols)\n\nThe power and speed at which the water rose were evident from how many chairs floodwaters had managed to wash away.\n\nThree hundred chairs had been stacked up overnight, ready to be laid out this morning.\n\nBut once the waters receded this morning, only 20 remained.\n\nThe downpour comes after Nambour was hit with intense flash flooding during ex-Tropical Cyclone Alfred.\n\nSome of those chairs ended up in trees after a \"disappointing\" cancellation of the Nambour dawn service. (ABC News: Jennifer Nichols)\n\nIn Buderim, the dawn service was also cancelled due to poor weather conditions this morning.\n\nQueensland Fire and Rescue crews performed two swift water rescues in the early hours of this morning after people became trapped in their vehicles.\n\nIn Nambour, a single occupant of a car was helped to safety after they became trapped in floodwaters around 6am.\n\nWhile in Buderim, another single occupant of a vehicle was helped to safety after entering floodwaters on Crosby Road around 5am.\n\nNambour residents woke to flash flooding. (Facebook: Sarah Ann)\n\nQueensland Ambulance Service was also called to Nambour around 3:30am to reports of a man who had become trapped in floodwaters in his vehicle.\n\nHe had freed himself by the time emergency services arrived and was transported to hospital in a stable condition.\n\nTwo women were also taken to hospital after two separate lightning strikes.\n\nOne female patient was taken to Caboolture Hospital with minor burns after lightning hit a property in Burpengary around 3am while another woman was taken to Nambour Hospital with neck pain after lightning struck a property on Yandina Bli Bli Road just before 1am.\n\nRough sleepers' tents washed away\n\nIn Nambour, flash flooding at Petrie Creek washed away a number of tents where homeless people had been living.\n\nTents and possessions were washed away in the flash flooding. (ABC News: Jennifer Nichols)\n\nPastor Dale Dowler, who runs the community and homeless shelter The Shack in Nambour said there had been devastation and shock this morning after the latest round of flash flooding.\n\nHe estimated it was the fifth or sixth time that particular part of town had flooded in the past 12 months.\n\nPastor Dale Dowler works to prepare emergency supplies after the latest round of flash flooding. (ABC News: Jennifer Nichols)\n\n\"Some people have lost all of their clothes,\" he said.\n\n\" They've lost everything ... We don't get to see a lot of tears, but there were certainly tears this morning because I think it's just, it's all too much. \"\n\nHe said people had started moving last night as the rain intensified, but many had been \"caught off guard\" by the severity of the weather.\n\nGold Coast marches also cancelled\n\nThe rain has also caused the cancellation of several Anzac Day marches on the Gold Coast.\n\nParades have been called off at Southport and Burleigh Heads after the Bureau of Meteorology earlier issued a severe thunderstorm warning for the coast.\n\nBurleigh Heads RSL president Graeme Mowbray said the area had received more than 60mm of rain in a few hours and conditions were not safe.\n\n\"We had torrential rain and our marquees all got destroyed in the rain, and the park is flooded, so we can't really conduct a service here with people,\" he said.\n\n\"We were supposed to have a march at 9:30am, but with lightning we can't do that with school children and elderly people around.\"\n\nMr Mowbray said while he was disappointed the march would not go ahead, it had been fortunate the rain held off during this morning’s dawn service.\n\nRain to ease during the day\n\nBureau of Meteorology senior forecaster Dean Narramore said the heavy rain had been caused by an upper trough that moved over south-east Queensland overnight.\n\nHe said rainfall was expected to ease throughout the day on the Sunshine Coast, with the system moving towards Brisbane and the Gold Coast.\n\n\"We could see showers and thunderstorms continue this afternoon … just hit and miss stuff,\" Mr Narramore said.\n\nInitial minor flood warnings have been issued for the Maroochy and Noosa Rivers.\n\nMinor flooding is likely along the Maroochy River, and minor flooding is occurring at Warana Bridge.\n\nModerate flooding is occurring at Yandina and Kiamba.\n\nAn initial minor flood warning has also been issued for the Mary River, with the bureau saying minor flooding is likely at Dagun Pocket this evening, as well as Gympie overnight and into tomorrow.\n\nMr Narramore said the river gauges were beginning to drop by 7am.\n\nHowever, he urged people who were considering travelling to the Gold Coast or Brisbane to stay alert to the potential of thunderstorms.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/pork-industry-japanese-encephalitis-vaccine-australia-industry/105201828",
        "title": "Pork industry waits for vaccine three years after viral outbreak",
        "publish_date": "Thu, 24 Apr 2025 21:33:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's $6 billion pork industry has been waiting for a vaccine against the Japanese encephalitis virus (JEV) for three years since its outbreak.\n\nLoading...\n\nNine people have died from the virus since 2021, including two in Queensland this year.\n\nA vaccine exists for humans, but two separate pig vaccines are yet to clear federal approval processes.\n\nIt comes as primary producers do everything they can to combat the mosquito-borne virus that causes significant reproductive issues in sows and has cost the pork industry millions of dollars.\n\nEmergency permits\n\nThe Australian Pesticides and Veterinary Medicines Authority (APVMA) said it was assessing two emergency use permit applications, which would allow scientists to trial their vaccines in piggeries.\n\nThe competing vaccines have been developed primarily by the University of Queensland and veterinary company Apiam Animal Health.\n\nChris Richards says he has 100,000 doses of a safe and effective vaccine. (Supplied: Chris Richards)\n\nApiam Animal Health chief executive Chris Richards said he lodged his application on March 14, it passed the preliminary assessment two days later, and was told by the APVMA he would hear back within two weeks.\n\nHe said he had been waiting for six weeks.\n\nHe said the company had the capacity to vaccinate 50,000 sows within two weeks of emergency approval.\n\n\"We haven't … really been notified that there are any deficiencies in the application,\" he said.\n\n\"But also haven't been updated as to when that might be processed.\n\n\"If we got an emergency use permit today, we'd be able to vaccinate most of those sows that are in the affected areas in the next two weeks.\"\n\nFeeling forgotten\n\nFarmers have been told their best defence is mosquito controls as JEV spread in Queensland.\n\nThe most recent detection was at the Betta Pork facility in Biloela.\n\nDirector Laurie Brosnan said he was following industry best practice to keep his piggery safe, but it was not enough without an effective vaccine.\n\nHe said Betta Pork had an independent contractor who sprayed open waterways, puddles, and other areas \"at a considerable cost\".\n\n\"We also treat the animals to protect them against JEV,\" he said.\n\n\"It's just unfortunate that there's only so much you can do.\"\n\nLaurie Brosnan says he is frustrated with the wait for a vaccine. (Supplied: Laurie Brosnan)\n\nHe said he felt his industry had been forgotten.\n\n\"I can't help but feel that the pig industry is not front of mind,\" he said.\n\n\"I understand we're in election time, and politicians make promises as they do.\n\n\"I still feel that the government isn't prioritising or even giving the pig industry a fair go.\"\n\nTop concern\n\nAustralian Pork chief executive Margo Andrea said JEV was a top concern for the industry.\n\n\"The previous outbreak in 2022 cost the industry millions of dollars and significantly impacted operations for piggeries across four states,\" she said.\n\n\"Three years later, JEV continues to contribute to losses for producers and their communities.\n\n\"We will continue pushing for a vaccine that will help keep our herds safe and healthy and help safeguard our producers' livelihoods.\"\n\nGrowing need\n\nUniversity of Queensland Associate Professor Jody Peters, who oversaw the development of one of the vaccines, said there was enough data to show that it was safe and effective.\n\nJody Peters (right) looks at cells used for vaccines with Jessica Harrison. (Supplied: University of Queensland)\n\nDr Peters said her team started working on it as soon as they were notified of the first JEV outbreak in Australia in early 2022.\n\n\"The initial trials occurred at the end of 2022, and some additional trials occurred in 2023,\" she said.\n\n\"I think we have got sufficient data to prove that it is effective, and it is safe.\n\n\"But, ultimately, it is up to the regulatory bodies to determine whether we have produced enough data to date.\"\n\nDr Peters said the need for a commercially available vaccine was growing.\n\n\"With all of the flooding that's occurred recently, the mosquito that is likely the culprit for transmitting the virus would have bred up huge populations,\" she said.\n\n\"I am incredibly frustrated, as are pig farmers, with how long it is taking to get these approvals across the line.\n\n\"But I do believe that we will have a vaccine on the market in the future.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/david-speirs-drug-supply-conviction-analysis-/105213210",
        "title": "David Speirs has gone from alternative SA premier to convicted drug supplier",
        "publish_date": "Thu, 24 Apr 2025 21:29:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Less than nine months ago, David Speirs held one of South Australia's most prominent and important jobs: the state's alternative premier and leader of the Liberal Party.\n\nNow, those titles have been replaced by \"convicted drug supplier\".\n\nIn a busy Adelaide Magistrates Court as Speirs was sentenced on Thursday, he was painted as a volunteer who cared for the natural world around him and served his community as a councillor and deputy mayor before his election to parliament.\n\nMagistrate Brian Nitschke highlighted a \"distinguished parliamentary career\" in the decade after his election in 2014, serving as environment and water minister in the former Marshall government before becoming leader of the opposition in 2022.\n\nDavid Speirs leaves court after being convicted and fined over drug supply charges. (ABC News: Guido Salazar)\n\nBut amid the stress and fatigue of this top political role, he turned to cocaine in June 2024 as a form of \"escapism\".\n\nIt was only months later in September when a video was published by News Corp of Speirs snorting from a plate.\n\nThese drug charges are unrelated to the video but instead relate to two separate instances, between August 1 and August 10 last year, where Speirs admitted to supplying a controlled drug.\n\nIt was on August 8 that Speirs faced the media to quit as Liberal leader, telling reporters he'd \"had a gutful\" and didn't have the energy to continue. The announcement followed years of persistent speculation over his future.\n\nDavid Speirs resigned from parliament after the charges were laid. (ABC News: Carl Saville)\n\nDuring sentencing, the court heard it was the stress and chronic exhaustion of the role that first led Speirs to be curious to try cocaine when it was offered to him by a friend.\n\n\"You believe [when taking cocaine] you experienced a significant change from your chronic state of tiredness, fatigue and frustration that you'd become accustomed to since you became leader of the opposition,\" Magistrate Nitschke said.\n\nA career lost\n\nIn sentencing, Magistrate Nitschke recognised that Speirs had \"effectively lost the parliamentary and political career which [he] sought to build up\".\n\nDavid Speirs represented the southern suburbs seat of Black before his resignation. (ABC News: Carl Saville)\n\n\"I accept that in many walks of life, such devastating consequences may not always be the consequences of such offending,\" he said.\n\nBut Magistrate Nitschke also said that Speirs would have had an appreciation of the \"criminality and public mischief\" of his offending because of his job.\n\nFrom Liberal leader to guilty plea Photo shows A man adjusts his tie as he looks at a journalist who sits opposite him At this time last year, David Speirs was adamant his position as SA Liberal leader was \"100 per cent secure\" and that he would not be challenged — but a great deal has changed in 12 months.\n\nHe agreed media scrutiny on Speirs had been intense, but it was unsurprising given his prominent position and community expectations of his role.\n\nBut he said that it didn't amount to extra-curial punishment, or something that punishes an offender beyond what a court imposes.\n\nFor the two counts of supply a controlled drug, which he previously pleaded guilty to, Speirs was fined $9,000 and given 37.5 hours of community service.\n\nHis lawyer had argued for a conviction not to be recorded against him, to spare the Scottish national from problems travelling.\n\nBut Magistrate Nitschke said the offending was too serious and there was a need for denunciation and deterrence, so Speirs now has two convictions recorded against him.\n\nAwkward timing\n\nSpeirs's sentence is an unwanted headline for a Liberal Party that has endured a brutal three years in South Australia — from the toppling of a one-term state government to a pair of historic by-election losses and a lacklustre federal performance.\n\nHaving it come just over a week before voters head to the polls for a federal election is far from ideal for federal Liberals in SA hoping to stay on message.\n\nVincent Tarzia with candidate Amanda Wilson during the Black by-election campaign, which the Liberal party went on to lose. (ABC News: Briana Fiore)\n\nAnd a state election is just around the corner too, with Opposition Leader Vincent Tarzia's team already facing a mammoth battle to topple a Labor government led by a popular premier in Peter Malinauskas.\n\nWhile that isn't a challenge Speirs will have to tackle, he will have to pay a price of $9,000 and 37.5 hours of his time for his actions.\n\nAnd both he and his former colleagues will likely spend plenty of time reflecting on the remarkable fall from grace of someone who went from \"alternative premier\" to \"convicted criminal\" in a matter of months.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/western-bears-perth-nrl-club-reports-close-to-reality/105209770",
        "title": "Has the long fight to bring an NRL side to Perth finally been won?",
        "publish_date": "Thu, 24 Apr 2025 21:22:28 +0000",
        "category": "sports",
        "authors": [],
        "text": "It was only three weeks ago WA Premier Roger Cook lashed the National Rugby League for its treatment of a bid for a Perth team, accusing the organisation of using his state as a \"cash cow\".\n\n“Given our location on the Indian Ocean rim and in the same time zone as 60 per cent of the world’s population, the strategic value of a Western Australian side should be self-evident to the NRL,\" he told the Sydney Morning Herald.\n\n“Unfortunately, like some people from the east, the NRL only appears to see WA as a potential cash cow.\"\n\nWA Premier Roger Cook is passionate about bringing an NRL team to the state. (ABC News: Keane Bourke)\n\nBut now media reports on the east-coast suggest the sides have come to an agreement, and that the Western Bears franchise will come into existence as the league's 18th team.\n\nIt's been a protracted, public, and at times downright mean negotiation process.\n\nSo is this the one that finally sticks? Or is it just another false dawn for long-suffering NRL fans in the west?\n\nThe fight for a WA team\n\nLeague fans in Perth could be forgiven for being cynical of the reports out of Sydney, given Cook's underwhelming response when asked about them at a press conference.\n\n\"We continue to have those negotiations, we haven't had a formal response from the NRL,\" he said.\n\nWA's ongoing absence from the NRL Photo shows Teenager with red and white jersey stands on a football pitch against a burnt orange sky. Western Australia's young rugby league players hope the sun hasn't set on the state's prospect of joining the national competition, as the state prepares to host the sport's biggest event.\n\n\"I assume they have a range of processes they need to go through to consider anything in relation to these conversations.\n\n\"I will say that conversations are positive and we continue to look forward to those discussions continuing.\"\n\nThe cynicism can be forgiven, considering that last year fans had the rug pulled from under them a day before an official announcement was expected.\n\nA consortium led by Cash Converters owner Peter Cumins put together a bid in conjunction with the North Sydney Bears, with the support of the WA government, which would have seen the Bears relocate to Perth.\n\nIt was expected the side would feature in the NRL in 2027. Such was the assurity of the success of the bid, the ABC understands there was a launch event scheduled for October 10 last year.\n\nARL Chairman Peter V'landys previously described the WA offer \"disrespectful\". (Getty Images: Cameron Spencer)\n\nBut just two days before that, Newscorp reported the Australian Rugby League Commission had rejected the consortium's bid as \"significantly short\", while Nine Newspapers reported ARLC chair Peter V'landys described the offer as \"low-ball\" and \"disrespectful\".\n\nThe long road\n\nThe battle to bring a professional rugby league side back to Perth has been a long one.\n\nThe Western Reds were axed in 1997, as part of a peace deal between the NRL and the breakaway Super League competition.\n\nThe success of bringing NRL games to Perth, and the huge crowds at State of Origin matches in the city has fuelled the drive to again bring a side to the west on a permanent basis.\n\nState of Origin games in Perth have been well attended. (AAP: Dave Hunt)\n\nBut a recent double-header at Perth Stadium was poorly attended, as fans appeared to follow through on a threat to boycott the event following perceived poor treatment from the NRL.\n\nJust over 31,000 fans went to the two games, with some holding up signs demanding a Perth side be added to the competition.\n\nFans have watched several attempts to re-enter the league fall flat.\n\n'NRL won't fix our problems': PNG divided over Australia's $600m rugby deal Photo shows Australian PM seals the deal with a hand shake with the Papua New Guinean PM both wearing suits and smiling at the camera China's growing role in Papua New Guinea's health, education, and infrastructure hasn't gone unnoticed, nor has the $600 million Australian-funded NRL team set for 2028.\n\nWhen the Western Australian Rugby League resurrected the Reds to participate in the New South Wales state competition from 2008, it was with an eye to eventually rejoining the national competition. Those efforts failed.\n\nThe WARL then launched the West Coast Pirates brand in 2012, featuring the original colours of the Reds, hoping it would reignite Perth’s bid for an NRL presence. The club never made it beyond the NSW junior rugby league competition.\n\nWA fans could be forgiven for only believing a Perth NRL team is real if and when they see the players take to the field in the top-flight competition.\n\nA political football\n\nThe cost of establishing a team in Perth, or relocating one from Sydney as is the case with the North Sydney Bears, has been the major sticking point.\n\nThe now defunct consortium that backed a Perth-based bid to enter an NRL side in 2027 was rebuffed despite making a revised offer of a $20 million licence fee to join the competition.\n\nJust 31,000 people attended the recent NRL double header at Perth Stadium. (Getty Images: Paul Kane)\n\nWhen V'landys announced the introduction of the PNG NRL side for 2028 on December 12 last year, he also said the Perth consortium, known as the Western Bears and led by former Western Reds chair Cumins, was \"in the dust bin\".\n\nWhile bringing a side to Perth has been a pet-project of Premier Cook's, he's been steadfast in making it a value-for-money proposition.\n\n\"We've made our position to the NRL very clear, and that is any deal must deliver value for WA taxpayers,\" Cook said in a statement earlier this month.\n\n\"Since then, we've had some positive discussions, and those discussions are ongoing.\"\n\nThe quest for a team in Perth is supported by Liberal Opposition leader Basil Zempilas.\n\nWA Opposition Leader Basil Zemplias is supportive of the push to bring an NRL team to WA. (ABC News: Keane Bourke)\n\n\"The idea of Perth having an NRL team based here makes sense, we're a big city and a big state. We deserve to be on the national stage,\" he said.\n\n\"But the people of West Australia deserve to know how much it is going to cost.\n\n\"Premiers of all persuasions are allowed to have projects that they are passionate about and I don't question his right to champion something that he believes will be good for Perth.\n\n\"I think there are enough people here with an interest in rugby league that there will be a following that will make a Perth-based rugby league team something that can grow through the years.\"\n\nAll things point to Perth finally making the NRL truly national, but many fans will be nervous until a ball is kicked.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/tara-kinder-ella-ramsay-medley-breaststoke-rival/105208930",
        "title": "The burgeoning rivalry that lit up the Australian swimming titles",
        "publish_date": "Thu, 24 Apr 2025 20:59:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sport is nothing without rivalries.\n\nWhen the thrill of a head-to-head race trumps all else, the surrounding competitors almost fading into little more than background noise.\n\nAt the Australian Open Swimming Championships this week, spectators have been treated to a fine, healthy rivalry between 21-year-old Tara Kinder and 20-year-old Ella Ramsay.\n\nOver, and over, and over, and over again.\n\nRamsay and Kinder could have been auditioning for a synchronised spot, entwined as they were in a tremendous dance of finals swimming that took place on all four days at the Brisbane Aquatic Centre.\n\nThe 200m individual medley. The 400m individual medley. The 200m breaststroke. The 100m breaststroke. Even the B final of the 200m freestyle.\n\nTara Kinder won the 200m breaststroke at the Brisbane Aquatic Centre. (Getty Images: Chris Hyde)\n\nUp on the blocks, if either one of these swimmers looked to their side, they'd lock eyes with the other.\n\nGame on.\n\n\"We've somehow ended up in the lanes next to each other, every final,\" Kinder laughs when asked about it by ABC Sport.\n\n\"Even tonight in the 200 free, the B final, I was like, 'hey', but yeah, it's good.\n\n\"I've raced against her since I was like 14 and we've both really just been medley and she sort of stepped up over breaststroke the last few years.\n\n\"[At] trials last year, she gave everyone a run for their money in that breaststroke, making that Paris team and I was like, 'I'm gonna step up my game now'.\"\n\nElla Ramsay claimed the 100m breaststroke. (Getty Images: Chris Hyde)\n\nIpswich swimmer Ramsay had a stunning 2024 Olympic trials, earning a spot on the Olympic team in the 200m breaststroke and both 200 and 400 individual medleys, and went on to win a silver medal in the 4x100m medley relay.\n\nBut she acknowledged the benefit of having a close rival in Brisbane this past week.\n\n\"It's nice to have someone there pushing you,\" Ramsay tells ABC Sport.\n\n\"If you didn't have someone there pushing, you wouldn't get to the next step.\n\n\"So it's really nice having her there to compete with.\"\n\nAnd it was terrifically evenly matched.\n\nKinder rediscovering her love for the water\n\nTara Kinder had a breakout championships, with two gold medal winning swims. (Getty Images: Chris Hyde)\n\nRamsay, an Olympic finalist from Paris, claimed gold in the 200m IM by 1.24 seconds.\n\nKinder returned the favour with gold in the 400m medley by 4.13 seconds.\n\nRamsay edged Kinder in the 100m breaststroke by 0.40 seconds.\n\nThen Kinder took out the 200m breaststroke by 0.64 seconds.\n\n\"I've never been on a open national podium before this week,\" Kinder says.\n\n\"So I will take two gold and two silver any day of the week.\"\n\nKinder's breakout performance is a credit to her perseverance.\n\nIn 2021, the now-21-year-old took a break from the sport, burnt out by the relentless pressure of being an athlete at such a young age.\n\n\"2021 was just a hell of a ride for me,\" Kinder recalls.\n\nTara Kinder claimed her first four medals at Australian Open Championships this week. (Supplied: Swimming Australia/Delly Carr)\n\n\"I got glandular fever leading into Tokyo Olympic trials, that was also my year 12 year in high school, so off the back of a pretty average trials had to do my exams, ended up getting COVID as well.\n\n\"I took a bit of a break to do schoolies and everything off the back of the exams and never really felt committed enough to try and get my body back to the fitness that it was at eight months prior.\n\n\"So the new year rolled around and I wanted to see what life was like outside of school, but also outside of being an elite athlete. I didn't really have anything else.\"\n\nKinder threw herself into university fulltime — \"hated it\" she said — before the siren call of the pool landed her back in training.\n\n\"When Fukuoka [world championship 2023] trials rolled around, I saw that they were going to be in Melbourne,\" Kinder says.\n\n\"So I texted Craig [Jackson] and I was like, 'Hey, do you wanna take me back?'\n\n\"And I came back.\"\n\nKinder says the time away, during which she studied, moved out of home and moved back in again, helped focus her mind.\n\n\"I experienced it all and just realised that I didn't really feel like I had a drive towards something,\" Kinder says.\n\n\"I wasn't the biggest fan of uni so it wasn't like a career-focused passion, so I thought moving back into swimming could be something to look for.\n\n\"And then the first few months back swimming it was a lot more fun than it's ever been before. So I thought I'd stick with it.\"\n\nRamsay thrilled with new coach Marshall\n\nElla Ramsay swam in three individual events at the Paris 2024 Olympics. (Getty Images: Chris Hyde)\n\nRamsay too has had to refocus over the past year.\n\nFollowing her excellent Olympic performance, Ramsay enjoyed a well-earned couple of months off before returning to the pool — and it appears to have paid off.\n\n\"Coming off the Olympics I had a really big physical and mental break,\" Ramsay explains.\n\n\"Not that I like to compare, but comparing to this time last year, I'm actually some of my events were fast. So it's so it's nice to see that and reflect on that.\"\n\nPart of that may be down to new coach Mel Marshall, who has taken over at Griffith University after Michael Bohl stepped away.\n\nElla Ramsay credited Mel Marshall for helping her back up after the Olympics. (Getty Images: Chris Hyde)\n\n\"We have a good group down there, a good environment and she's [Marshall's] been really good. I can't thank her enough,\" Ramsay says.\n\n\"Coming off the Olympics, it's hard for anyone, but she's got me back into peak performance I'd say, both mental and physical, so I'm very thankful.\"\n\nEven if that means doing two extra swims on what is supposed to be a day off, with Ramsay swimming the 200m freestyle and 200m backstroke on Thursday.\n\n\"Mel gave me heaps of events,\" Ramsay says with a huge grin.\n\n\"Today was supposed to be a day off, but she gave me the 200 free and 200 back instead, so very nice of her.\"\n\nNow, both women will focus on qualifying for the world championships at the trials in Adelaide in June.\n\nThere, they will likely be competing for the same spot on the team, with Olympic medallist Kaylee McKeown a shoo-in for the lead spot.\n\nMcKeown pulled out of the 200m medley on Easter Monday and withdrew from the championships entirely on Thursday after announcing on Instagram that she would be leaving Griffith University to train back at the USC Spartans club on the Sunshine Coast.\n\nKaylee McKeown will be a favourite to swim the 200m medley in Singapore. (Getty Images: Chris Hyde)\n\nThe five-time Olympic gold medallist, who won bronze at the 2024 Paris Games in the 200m IM, will almost certainly race the event in Singapore.\n\nBut with this burgeoning rivalry? Who knows who will join her on the Australian team, with both Ramsay and Kinder achieving the qualifying time.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\n\"It's nice to have her [Kinder] there because I can be disappointed in myself and then come back to the drawing board and see what I can do better come next race,\" Ramsay explains.\n\n\"I do get really excited to race next to Ella because she paces a lot differently to me,\" Kinder says.\n\n\"Obviously in that 400m IM I had many seconds [to catch up] — backstroke's my weakest stroke, so I like the chase in the breaststroke, then just to try and hold it out and then hope my freestyle is good enough to hold her off.\n\n\"And then the [200 IM] is not at my strongest, but Kaylee's got that anyway,\" she adds with a laugh.\n\n\"But just being able to get on top of that podium there [in the 400] and that rivalry with Ella, and try to be as close to her best time from Paris that I could be, was just the drive, because obviously top two qualify for worlds.\n\n\"And just, yeah, focusing on that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/zonal-tax-offset-reform-call-federal-election-agenda/105179174",
        "title": "Rural voters want zonal tax offset updates this election",
        "publish_date": "Thu, 24 Apr 2025 20:56:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "The major parties are eagerly pulling tax levers as they look to win over voters on cost of living and housing, but Australians living in the bush say they have been overlooked this election.\n\nResidents of specified regional and remote communities in every Australian state and territory — except Victoria and the ACT — are eligible for a rebate of up to $1,173 at tax time, a measure introduced in 1945 as a balm for the higher costs encountered living in remote parts of the country.\n\nStay updated: Federal election live updates: Get the latest updates from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nIt has been more than 30 years since the fixed rebate amounts were last updated and outback Queensland resident Nicole Crawford believed it was overdue for reform.\n\nNicole Crawford believes zonal rebates are due for an update. (ABC North West Qld: Meghan Dansie)\n\n\"If there is some kind of extra tax incentive to keep people here, in these rural areas, that would be a great idea,\" she said.\n\nThe 35-year-old healthcare worker and mother of one said ensuring remote Australians could cope with costs such as $1,200 return airfares to the nearest capital city, $3 per litre petrol costs, and electricity bills in the thousands had largely become the responsibility of employers.\n\nShe said it had created a divide between those with generous employment packages and those without.\n\n\"It's very dependent on your work situation and the kind of job you're in, the kind of incentives that brought you out here, which does differ between industries,\" she said.\n\nA 'moral argument' to pay less tax in the regions\n\nMr Dutton has said he is \"happy to have a look\" at whether people in regions should pay less tax. (ABC News: Emily Dobson)\n\nPrior to the election campaign and during a visit to Mount Isa in north-west Queensland last August, Coalition leader Peter Dutton said there was a \"moral argument\" for regional Australians to pay less tax than city residents.\n\n\"I think there are arguments for people who live in regional towns where you're paying more for petrol, you're paying more for electricity, you're paying more for housing. There's an additional cost that comes with it,\" he said.\n\n\"We're happy to have a look at taxation arrangements.\"\n\nThe Coalition has not brought that policy to the election.\n\nPrime Minister Albanese at a press conference in Mount Isa prior to the election. (ABC North West Qld: Maddie Nixon)\n\nPrime Minister Anthony Albanese disregarded Mr Dutton's comments as a \"thought bubble\" while on his own visit to the outback mining town in January.\n\n\"I think the idea of zonal taxation isn't something that certainly has ever been on our agenda because of the distortions and manipulations that could occur,\" he said.\n\nBoth Labor and Coalition spokespeople declined to comment further.\n\nPush to increase rebates by thousands\n\nFor trusted election coverage Photo shows The Words ABC News Daily with the ABC Listen logo beside it. Blue and pale green striped background. Submit your election questions and tune in for a weekly explainer of the latest election news. Listen to ABC News Daily on ABC listen.\n\nA zonal tax offset essentially means a person will pay less at tax time, depending on their postcode and their dependents.\n\nLocals in designated special areas like Norfolk Island, off the coast of Australia, are eligible for the highest fixed rebate. Zone A residents in locations such as Darwin and Broome can offset $338 at tax time, and Australians in Zone B locations like Broken Hill can offset $57 if they reside there for more than 183 days a year.\n\nBelinda Balch, 54, spent many years living in rural inland Australia, but now resides in South-East Queensland.\n\nMs Balch said living on the coast had strengthened her belief that the existing rebates should be adjusted for inflation.\n\nBelinda Balch said her concern was with her employees' high cost of living. (Supplied: Belinda Balch)\n\n\"It should be increased to at least $5,000 a year — enough to allow remote residents to travel for just one major experience,\" she said.\n\n\"It's not simply a matter of moving — regional and remote communities are essential to sustaining the standard of living in urban centres.\n\n\" People should not be disadvantaged for living remotely. \"\n\nMany remote Australian towns like Mount Isa struggle to hold on to workers. (ABC North West Qld: Meghan Dansie)\n\nThe existing tax concessions exist despite the Constitution setting down that taxes collected by the federal government cannot \"discriminate between states or parts of states\", a potential contradiction that has never been challenged.\n\nA 2020 Productivity Commission report found remote area tax concessions and payments were \"outdated, inequitable, and poorly designed\" and should be limited to only very \"very remote\" locations, with half of the claimants living in Cairns, Darwin, and Townsville, which have developed significantly since the policy's introduction.\n\nIn a statement from 2020, the Morrison government said it would not act on the recommendations because of the \"significant disruption\" they would cause during the COVID-19 pandemic and bushfire recovery period.\n\nMinor tax reform on the election menu?\n\nHave Your Say: What matters to you this federal election? Photo shows A graphic showing a range of reader comments about potential issues in Australia's 2025 federal election. What do you need to know before you vote in the upcoming federal election? What would you ask the candidates? Have Your Say.\n\nBoth major parties have been squaring off over the best way to deliver cost-of-living relief across the country.\n\nLabor legislated \"modest\" tax cuts prior to the election that would see all Australians pocket a maximum of $10 a week extra.\n\nThe Coalition has promised to reverse Labor's legislated tax cuts, instead promising a temporary halving of the fuel tax, which would save consumers around $14 a week if passed on in full.\n\nThey have also promised first-time home buyers tax-deductible mortgage interest payments.\n\nThe Crawford family moved remotely because of employment incentives. (ABC North West Qld: Meghan Dansie)\n\nRadiologist Nicole Crawford, who moved to Mount Isa in remote north-west Queensland a year ago for employment, hoped to see the major parties take up the mantle of increasing tax benefits for rural Australians, taking the responsibility out of the hands of employers to keep communities alive.\n\n\"It's really, really important to get people out here but also to keep people here long term because it's a very small community, but a fantastic community,\" she said.\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/labor-senator-katy-gallagher-federal-election-pitch/105213136",
        "title": "Gallagher seeks fourth Senate win but concedes Pocock's popularity",
        "publish_date": "Thu, 24 Apr 2025 20:40:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Finance Minister Katy Gallagher is the most senior federal representative the ACT has ever had and is now seeking her fourth election win as a senator.\n\nThere's just one problem though — at the height of her powers within the Albanese government, Senator Gallagher risks being bumped from first to second place in the ACT pecking order by independent Senator David Pocock.\n\nStay updated: Federal election live updates: Get the latest updates from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\n\"I think David is very popular,\" she said of the former Wallabies captain, who she will preference second.\n\n\"I think he's been a good senator, but I'm getting nothing in return.\n\n\"His camp wanted our number two, but they don't preference anybody.\"\n\nThe former ACT chief minister said Senator Pocock might enjoy \"freedom\" as an independent, but he lacked the muscle to protect Canberra's public service jobs.\n\n\"Labor is the only party who can prevent Peter Dutton from savaging our town,\" Senator Gallagher said.\n\n\"An independent isn't going to be able to do that.\n\n\" I've brought the nation's capital to the decision-making table. \"\n\nKaty Gallagher is seeking re-election on May 3. (ABC News: Adam Kennedy)\n\nAPS size 'about right'\n\nOpposition Leader Peter Dutton has campaigned on a plan to cut 41,000 Australian public service (APS) jobs, which he confirmed would all be Canberra-based.\n\nThat is despite the Liberal senate candidate for the ACT Jacob Vadakkedathu previously insisting the job cuts would come from across the country.\n\nThe APS is expected to employ 213,000 people in the next financial year.\n\n'Actually put Australians first': Pocock seeks reelection Photo shows A Whole New Ballgame | David Pocock The ACT senator is hoping for a second term as he attempts to 'do politics differently'.\n\nAs of June 30, 2024, 36.9 per cent of the APS workforce was based in Canberra, amounting to almost 70,000 jobs.\n\n\"We actually think that the staffing level is about right,\" Senator Gallagher said.\n\nShe did not rule out cuts altogether but said a returned Labor government would continue to try to improve budget efficiency.\n\n\"Look, there may be some changes across departments and agencies as programs finish and other priorities ramp up, but I think, roughly, the public service is the appropriate size, and I actually think that's an important part of fiscal discipline.\n\n\"It's not just constantly an add-on.\"\n\nHealth pitch doomed?\n\nLabor's campaign centrepiece on health is to make nine out of 10 visits to a general practitioner free by the end of the decade.\n\nIt says it will incentivise GPs to bulk-bill via an $8.5-billion scheme.\n\nThe pledge is to triple the bulk-billing incentive for all patients – not just concession card holders – and to provide a 12.5 per cent loading for practices that bulk-bill all patients.\n\nThe Coalition has promised to match the policy with an equal spend.\n\nLabor estimates the number of ACT practices bulk-billing all patients could increase from eight to about 25 under its plan.\n\nKaty Gallagher says her seniority helps her represent the ACT. (ABC News: Matt Roberts)\n\nThe national rate of bulk-billing is 77.4 per cent and 52.7 per cent in the ACT, according to recent government data.\n\n\"We acknowledge that Canberra isn't sitting at the national average now — it's well below that,\" Senator Gallagher said.\n\nFor trusted election coverage Photo shows The Words ABC News Daily with the ABC Listen logo beside it. Blue and pale green striped background. Submit your election questions and tune in for a weekly explainer of the latest election news. Listen to ABC News Daily on ABC listen.\n\nShe has not committed to trying to push the ACT to meet the national benchmark set by her government, but said it was her hope.\n\n\"I would love to get there,\" Senator Gallagher said.\n\n'We've also put on the table $10.5 million to bring in three new bulk-billing clinics – that would be a requirement of that grant – to essentially drive some competition.\n\n\"And obviously the interchange in Tuggeranong is going to remain open.\"\n\nCabinet power delivers\n\nAs a senior Cabinet minister in the finance portfolio, Senator Gallagher has worked on four budgets in the last three years, each of which involved a punishing schedule of expenditure review meetings.\n\nConventional logic might suggest being a key national decision-maker might bring a host of benefits for Canberra, but Senator Gallagher was cautious about overstating them.\n\nSenator Gallagher said of her credentials as a local advocate that a lot of work had been done.\n\n\"Obviously rebuilding the public service is very important for our town,\" she said.\n\n\"I've been leading that and making sure we've got, for example, a national security building actually underway.\n\n\"I'd really like to see the convention centre get to the point where we start actually constructing it — it's been a project that's been kicking around for a long time.\n\n\"I think it's got local benefits, but also it really entrenches Canberra as the nation's capital.\"\n\nLoading\n\nSenator Gallagher said her work with the ACT government was \"under-recognised\".\n\n\"Things like light rail, Civic pool, the convention centre — they're all really important, but yeah, [the Australian Institute of Sport], national institutions,\" she said.\n\nThe long-held goal of doubling the number of senators in both territories from two to four has eluded Senator Gallagher in the 47th Parliament.\n\nShe said although it was a party policy, her government had not proposed the relevant legislation because it would prefer to have the support of the Opposition when seeking to change the composition of parliament.\n\nAustralians head to the polls on May 3.\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-25/womens-running-changes-once-the-sun-sets/105089612",
        "title": "How women's running changes once the sun sets",
        "publish_date": "Thu, 24 Apr 2025 20:36:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "Running a marathon is not just about clocking up kilometres — it is a juggling act of nutrition, injury prevention, and carving out time that does not always exist.\n\nAnd for a blossoming cohort of female athletes the end of daylight saving often signals a significant disruption to their ability to pound the pavement.\n\nConcerns over safety have never been higher.\n\nLoading...\n\nThe 2024 Strava Year In Sport report, which it said analysed sporting data from more than 135 million users, recorded a 59 per cent increase in running club participation last year.\n\nThe report also found more women are taking part in running, with a five per cent lift in the number of women running a marathon and a 16 per cent rise in half marathons.\n\nAt the same time, women have been found to often feel unsafe in public spaces, according to research from Deakin University.\n\nAnd as the nation continues to grapple with the disappearance of Ballarat runner and mother Samantha Murphy, conversations around female safety in public spaces have been renewed.\n\n'Totally alone'\n\nJane Cantwell lives in the inner-Melbourne suburb of Alphington and has been training for her first half marathon, a 21.1-kilometre run.\n\nTraining involves runs along the Darebin Creek and Yarra trails squeezed in around her work and daylight hours.\n\nJane Cantwell says daylight saving changes the way she trains after dark. (Supplied: Jane Cantwell)\n\nBut juggling training with work often means the only time she can train is after hours, facing the track alone.\n\n\"When the days get too short I won't be able to run before work anymore,\" she said.\n\n\" I've done a few in the dark with a head torch but it doesn't feel safe enough, so I have no idea how I'll be able to keep it up in winter. \"\n\nWomen who love to run Photo shows A selfie of a woman in a light blue singlet top and blue shorts smiling with her arm outstretched to take the photo. How perceptions of safety influence how these women choose to run.\n\nMs Cantwell's running journey started just two years ago, and she recently completed a half marathon at Canberra.\n\nShe said on one hand the chance of something untoward happening feels \"low\".\n\n\"But the potential risk is so high,\" she conceded.\n\nWomen missing out\n\nDanielle Bryan is the founder of Run Like a Girl, a \"ladies only\" running group that helps women with running programs, run groups, along with training and recovery tips.\n\nBallarat and Bendigo invested in lighting athletics tracks and ovals during winter so busy people could train after dark. (Supplied: Parkrun)\n\nShe said the end of daylight saving often marked an uptick in the number of women signing up for training programs and memberships.\n\n\"Run Like A Girl's busiest time of year is now, and through the winter our numbers go up,\" Ms Bryan said.\n\n\"Putting a group together as opposed to running on your own in broad daylight in the summer … the group scenario reduces the risk of exposure.\n\n\" They're always thinking about their safety, even when not running. \"\n\nA woman welcomes new participants to Parkrun. (Supplied: Parkrun)\n\nThe appetite for female running events is growing.\n\nThe recently held Nike After Dark Tour in Sydney celebrated the female running community in a safe and controlled space with participants running a half marathon around Sydney landmarks at dusk, then a portion of the run undertaken in the dark.\n\nRegional cities such as Ballarat and Bendigo have invested in lighting athletics tracks and ovals during winter hours to provide a space for people to train after dark.\n\nMore women are signing up to run at local marathon events, such as the Ballarat Marathon. (Supplied: Ballarat Marathon)\n\nLake Wendouree in Ballarat has been illuminated with more than 220 lights funded in part by a state government investment, a move that Ballarat Marathon spokesperson Adam McNicol said spoke to the growing interest in community running, particularly for women.\n\nThis weekend, Ballarat will host its second Ballarat Marathon with events spanning a 5km run through to a full marathon.\n\nMr McNicol said the percentage of male and female participants sat at 41 per cent female and 59 per cent male.\n\nHow to start running Photo shows Woman about to run but a big question mark beside her for a story about how to start running, a cheap and effective exercise. Busting myths that prevent would-be runners from achieving their health and fitness goals.\n\nAnd the number of entrants in 2025 has boomed more than 40 per cent with about 9,000 runners set to hit the pavement in late April, amounting to about 3,600 women runners.\n\n\"When I did a lot of running around the lake on a Friday morning there are so many women,\" Mr McNicol said.\n\n\"I know from speaking to many female runners they run around the lake because of the lights, it's a fantastic asset.\n\n\"It's heartbreaking they feel they need that in order to train, or to train in a group.\n\n\"As a male I feel I can go running anywhere in Ballarat and feel safe.\n\n\" You don't want people missing out because they don't feel safe. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/education/it-may-not-be-trendy-but-i-d-still-send-my-kids-to-single-sex-schools-20250424-p5lu2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It may not be trendy, but I’d still send my kids to single-sex schools",
        "publish_date": "Fri, 25 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "Look, I fancy myself as being as modern as anyone who remembers chanting “Peace, Charger, Fosters Lager” in the 1970s or drinking Tang while watching Lost in Space can be.\n\nIf you ignore all the mid-century furniture, contemporary is my vibe. I know burrata is over, that statement belts and solo travel to secondary cities are hot. I’ve seen Amyl and the Sniffers live and am into hyperrealistic drama series.\n\nEnrolments at all-boys’ Xavier College have fallen over the past five years.\n\nAnd yet, I can’t drag myself into the current day and admit single-sex schools should not still be a thing.\n\nThe subject came up for me and my husband this week on a dog walk, sparked by news that enrolments at Melbourne’s all-boys Xavier College have dropped 19.5 per cent in the past five years.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/it-s-unacceptable-it-s-wrong-prince-harry-calls-for-change-to-protect-children-online-20250425-p5lu69.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s unacceptable, it’s wrong’: Prince Harry calls for change to protect children online",
        "publish_date": "Fri, 25 Apr 2025 11:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "India Mctaggart"
        ],
        "text": "The Duke of Sussex has said life is “better” when spent off social media.\n\nPrince Harry spoke out as he and wife Meghan unveiled a memorial in New York dedicated to children who have lost their lives because of the harms of the internet.\n\nPrince Harry and his wife Meghan have spoken out at a memorial about the work to be done to better protect children online. Credit: GC Images\n\nSpeaking to BBC Breakfast, the Prince said: “Life is better off of social media. I say that as a parent, and I say that as someone who has spoken to many of the kids here tonight who aren’t on social media because they have lost a brother or a sister to social media.\n\n“But clearly enough is not being done. Some of the stories here are truly harrowing.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/bulldogs-trio-face-combined-13-weeks-on-sidelines-after-wild-broncos-loss-20250425-p5lu80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bulldogs trio face combined 13 weeks on sidelines after wild Broncos loss",
        "publish_date": "Fri, 25 Apr 2025 11:18:59 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Canterbury back-rower Sitili Tupouniua is facing up to seven matches on the sidelines for two incidents in which he kneed and shoulder-charged Brisbane’s Brendan Piakura in the head.\n\nWith teammates Josh Curran (grade two shoulder charge) facing up to four weeks out and Matt Burton (grade two careless high tackle) also issued a 1-2 game ban, the Bulldogs trio face a combined nine weeks on the sidelines if they were to each accept early guilty pleas.\n\nThat figure balloons to a maximum of 13 combined weeks if each charge was unsuccessfully challenged at the judiciary.\n\nTupouniua was placed on report, but not sin-binned for leading with his knee into contact with Piakura in Thursday night’s heavy loss to the Broncos, to the consternation of commentators given the Bunker viewed several replays of the incident.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-chicken-korma-20250425-p5lu7q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s chicken korma",
        "publish_date": "Fri, 25 Apr 2025 10:55:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1 Combine the chicken and the marinade ingredients and set aside for at least an hour, but preferably refrigerated overnight.\n\nStep 2 Heat a large saucepan over medium heat and add 1 tablespoon of oil and the onions. Fry the onions for about 6 minutes until browned, then transfer to a blender with the cashews, yoghurt and about ½ a cup of water. Blend to a smooth purée.\n\nStep 3 Return the saucepan to the heat and add the remaining oil. Add the cinnamon, cloves, cardamom, bay leaf and chilli (if using) and fry for a minute until fragrant.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/dogs-star-in-trouble-for-raised-knee-20250425-p5lu75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dogs star in trouble for raised knee",
        "publish_date": "Fri, 25 Apr 2025 09:48:16 +1000",
        "category": "finance",
        "authors": [],
        "text": "Dogs star in trouble for raised knee\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/china-has-an-army-of-robots-on-its-side-in-the-tariff-war-20250424-p5ltzo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "China has an army of robots on its side in the tariff war",
        "publish_date": "Fri, 25 Apr 2025 09:44:00 +1000",
        "category": "finance",
        "authors": [
            "Keith Bradsher"
        ],
        "text": "Elon Li’s curbside workshop in Guangzhou, the commercial hub of southeastern China, has 11 workers who cut and weld metal to make inexpensive ovens and barbecue equipment. He is preparing to pay $US40,000 ($63,000) to a Chinese company for a robotic arm with a camera. The device uses artificial intelligence to observe how a worker welds the sides of an oven, and then duplicates the action with minimal human intervention. Only four years ago, the same system was available only from foreign robot companies and cost nearly $US140,000. “Before, I never would have imagined investing in automation,” Li said, adding that a human employee “can only work for eight hours a day, but a machine can work 24 hours.” A robot sorts lug nuts before attaching wheels to electric cars at a Zeekr plant in Ningbo, China. Credit: Qilai Shen/The New York Times Bigger companies bet far more on automation. In Ningbo, a huge factory for Zeekr, a Chinese electric carmaker, had 500 robots when it opened four years ago. Now there are 820, and many more are planned.\n\nCheerfully trilling Kenny G tunes to warn any people of their approach, robot carts haul aluminum ingots to an automated elevator, which lifts the blocks of metal to a furnace at the top of a 12-metre tall Chinese-made machine. Once molten, the aluminum is cast into the shapes of various car body panels and other components. More robot carts, and the occasional human driving a forklift, take the components to a warehouse. Loading Yet more robots take the panels to the assembly line, where hundreds of robotic arms, working in teams of up to 16, do a complex dance to weld them together into car bodies. The welding area is a so-called dark factory, meaning that the robots can operate without workers and with the lights off. China’s factories still employ legions of workers. Even with the automation, they are needed to check quality and install some parts that require manual dexterity, such as wiring harnesses. There are things cameras and computers cannot do on their own. Before cars are painted, workers still run gloved hands over them and sand smooth any tiny imperfections. A worker making ovens and cookware at a small factory in Guangzhou. The company plans to acquire a robotic arm that uses artificial intelligence to replicate the way a person welds the sides of an oven. Credit: Qilai Shen/The New York Times\n\nYet, some of the later steps of quality control are also being automated with the help of artificial intelligence. Loading Near the end of Zeekr’s assembly line, a dozen high-resolution cameras take photos of each car. Computers compare the images to an extensive database of correctly assembled cars and alert factory staff if a discrepancy is found. The task takes seconds. “Most of our colleagues’ jobs involve sitting in front of a computer monitor,” said Pinky Wu, a Zeekr worker. Zeekr and other Chinese automakers are also using artificial intelligence to design cars and their features more efficiently.\n\nCarrie Li, a designer who works at Zeekr’s new office building in Shanghai, uses AI to analyse how different interior surfaces will intersect in a car. “I have more spare time to open my mind and explore for myself which kinds of fashion trends to include in the cars’ interior,” Li said. Car factories in the United States also use automation, but much of the equipment comes from China. Most of the world’s car assembly plants built in the past 20 years were in China, and an automation industry grew up around them. Chinese companies also bought overseas suppliers of advanced robotics, such as Kuka of Germany, and moved much of their operations to China. When Volkswagen opened an electric car factory a year ago in Hefei, it had one robot from Germany and 1074 robots made in Shanghai. China’s rapid advance in factory robotics has been propelled from the top down. Beijing’s “Made in China 2025” initiative, which began a decade ago, set out 10 industries in which China sought to be globally competitive. Robotics was one of them.\n\nA white-glove inspection of a vehicle on the assembly line. There remain some tasks that computers and cameras can’t do on their own. Credit: Qilai Shen/The New York Times To force the car industry to think about how to use humanoid robots with two arms and two legs, for example, government officials in Beijing told major automakers last year to rent robots and submit videos of them performing tasks in their assembly plants. The Zeekr plant’s greeter robot, which is still in testing, has a humanoid hand. Credit: Qilai Shen/The New York Times The videos required many takes to get them right. The robots did only basic tasks, such as sorting auto parts in a warehouse. But the initiative has helped push the carmakers along. In a show of the automation push, the Beijing municipal government held a half-marathon on Saturday for 12,000 runners and 20 humanoid robots. Only six robots finished the race, and the fastest of them took nearly three times as long as the fastest runners. But the event helped draw attention to robots.\n\nLast month, Premier Li Qiang, China’s second-highest official, said in his annual report to the legislature that the country’s plans this year would include an effort to “vigorously develop” intelligent robots. The country’s top economic planning agency announced a $US137 billion national venture capital fund for robotics, artificial intelligence and other advanced technologies. A display screen on a robot being trained to greet visitors at the Zeekr car assembly plant in Ningbo, China . Credit: Qilai Shen/The New York Times China’s government-controlled banks have increased lending to industrial borrowers over the past four years by a staggering $US1.9 trillion. That has paid for the construction of factories as well as the replacement of equipment at existing ones. China’s universities produce about 350,000 mechanical engineering graduates per year, as well as electricians, welders and other trained technicians. By comparison, American universities graduate about 45,000 mechanical engineers each year.\n\nJonathan Hurst, chief robot officer and a co-founder of Agility Robotics, a leading American robot manufacturer, said finding skilled employees had been one of his biggest challenges. As a graduate student in the Robotics Institute at Carnegie Mellon University in Pittsburgh, Hurst said, he was one of two mechanical engineers. China’s rapid embrace of automation worries some Chinese workers. Geng Yuanjie, 27, drives a forklift at the Zeekr factory, where he has worked for the past two years. He said there were considerably fewer robots at the Volkswagen factory where he previously worked. Surrounded by robots, he has few co-workers to talk to during his 12-hour shifts. To demonstrate advances in automation, Beijing held a half-marathon for 12,000 runners and 20 humanoid robots. Only six robots finished. Credit: Andrea Verdelli/The New York Times “I can feel the trend towards automation,” Geng said as he watched a robot cart pull a rack of car parts past his forklift. He said that his high school education might not be enough for him to qualify for classes in programming robots, and that he worried he might lose his job someday to a robot.\n\n“It is not just my concern – everyone worries about it,” Geng said. Automation has threatened and even eliminated jobs around the world for more than a century, often slowing automation’s growth. In China, there are fewer obstacles than practically anywhere else. China has no independent labor unions, and Communist Party control leaves almost no room for dissent. Another factor behind China’s automation drive is the country’s demographic crisis. The number of babies born each year has dropped by almost two-thirds since 1987. At the same time, two-thirds of people turning 18 now enroll at a university or college, an educational trajectory that has allowed a new generation to aspire to careers outside factory labor. “China’s demographic dividend is over,” said Stephen Dyer, head of the Asia industrial practice at AlixPartners, a consulting firm. “They’re now in a demographic deficit, and the only way out of that is productivity.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/anzac-day-marches-get-underway-20250425-p5lu6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anzac Day marches get underway",
        "publish_date": "Fri, 25 Apr 2025 09:29:53 +1000",
        "category": "finance",
        "authors": [],
        "text": "Anzac Day marches get underway\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/gwyneth-paltrow-responds-to-rumoured-feud-with-meghan-markle-20250326-p5lmo7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gwyneth Paltrow responds to rumoured feud with Meghan Markle",
        "publish_date": "Fri, 25 Apr 2025 09:03:01 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Gwyneth Paltrow responds to rumoured feud with Meghan Markle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/deputy-prime-minister-s-special-anzac-day-reflection-20250425-p5lu5v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Deputy prime minister’s special Anzac Day reflection",
        "publish_date": "Fri, 25 Apr 2025 08:44:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "Deputy prime minister’s special Anzac Day reflection\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/pope-is-now-part-of-the-endless-scroll-as-phones-steal-from-stillness-and-silence-of-grief-20250425-p5lu55.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pope now part of the endless scroll, as phones steal from stillness and silence of grief",
        "publish_date": "Fri, 25 Apr 2025 08:36:10 +1000",
        "category": "entertainment",
        "authors": [
            "Rob Harris"
        ],
        "text": "Vatican City: Even with the gravity of death in the air, it’s hard not to marvel at Michelangelo’s dome, an impossible structure suspended above us like the sky itself had been poured into stone.\n\nBut today, it wasn’t the art or the grandeur of St Peter’s Basilica that held us. It was the man lying beneath it all.\n\nThousands of people wait before St Peter’s Basilica to see the Pope lying in state on Thursday. Credit: Flavio Brancaleone\n\nPope Francis, in death, looked exactly as he had tried to live – unadorned. There was no papal crown, no golden thread. Just a red chasuble, his white cassock, and the gentle crossing of his hands on his chest. His face was slackened by time, but unmistakably him.\n\nThe man who spoke of climate change as a moral crisis. The man who washed the feet of prisoners. The man who dared, within the great machinery of the Catholic Church, to simply ask for kindness.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cozzie-livs-party-time-ep-4/bxsvyxges",
        "title": "Cozzie Livs: Party Time Ep 4",
        "publish_date": "Thu, 24 Apr 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/labor-pledges-to-set-up-a-strategic-reserve-of-critical-minerals/mob0oe246",
        "title": "Labor pledges to set up a strategic reserve of critical minerals",
        "publish_date": "Thu, 24 Apr 2025 10:00:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/confusion-over-oppositions-migration-policies/keeokb972",
        "title": "Confusion over Opposition's migration policies",
        "publish_date": "Thu, 24 Apr 2025 08:52:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSpeaking on ABC Radio National, Opposition Immigration spokesman Dan Tehan said a Coalition government would cut skilled migration.\n\n\n\n\n\n\"What we're going to do in the first instance is we're going to reduce the skilled migration level. We will take that down from 185,000 to 140,000. The program will continue at 150,000 in years two and three.\"\n\n\n\n\n\nThe Coalition is yet to release a target for skilled migration - so the figures from its Immigration Spokesperson were unexpected.\n\n\n\n\n\nQuestioned on the wisdom of reducing skilled visas at a time of worker shortages, Mr Tehan told ABC's Radio National that some skills would in fact be prioritised.\n\n\n\n\n\n\"We've said we want to prioritise those trade areas to complement out plumbers, our electricians, our builders, and we will focus on that. We've also said in those areas for instance in terms of hospitality where we need chefs and cooks we'll look at prioritising those areas. when it comes to aged care. What we'll do is we will change the settings that the Labor party have put in place, which is actually restricting people from being able to come in. \"\n\n\n\n\n\nThe skilled migration intake is currently limited to 132,000 places - that's 8000 places fewer than the target cited as Coalition policy by Mr Tehan.\n\n\n\n\n\n\n\n\n\nWhen asked by SBS if his party was in fact proposing to increase migration - Opposition Leader Peter Dutton replied that he hadn't seen the comments made by his Immigration Spokesperson - but confirmed his party would cut overall migration.\n\n\n\n\n\nDutton: \"What we've said is that we are gonna cut migration by 25 per cent, because we are going to cut it by 25 per cent, because the government has created a housing crisis, bringing two million people in over two years, which is unprecedented, so we gonna fix that.\"\n\n\n\n\n\nReporter:\"So do you think he misspeaks?\"\n\n\n\n\n\nDutton: \"We are gonna fix up Labor's mess, we've been clear about what we will be doing in Year 1 and 2, where we will reduce by 25 per cent in Year 3 and 4, we will bring it back up. We have to get Aussie kids to the houses.\"\n\n\n\n\n\nThe Opposition Leader has previously said he will cut net overseas migration by 100,000 places in order to free up more housing for young people in Australia.\n\n\n\n\n\nNet migration refers to the difference between the number of people arriving in Australia and those leaving.\n\n\n\n\n\nTo achieve the Coalition's migration targets, Mr Tehan confirmed a Dutton government would cut Australia’s humanitarian intake by 20,000, to its long-term average of 13,750, and reduce foreign student commencements by at least 30,000.\n\n\n\n\n\nParent visas and partner visas would not change under a Coalition government.\n\n\n\n\n\nThe Federation of Ethnic Communities Councils of Australia earlier this week released a statement criticising Coalition proposals to change the citizenship 'values' test and ban refugees from Gaza.\n\n\n\n\n\nChairperson Peter Doukas says he's also concerned migrants have become scapegoats for the cost of living and housing crises.\n\n\n\n\n\n\"We've seen a divergence, particularly from some political actors, of their traditional stance protecting the pluralistic nature of our multicultural society, and for that reason we have voiced our concerns that we want to keep racism, racial profiling, out of this campaign. All parties have concerning rhetoric regarding immigration in a way that is different from previous stances and the stances of previous Australian governments.\"\n\n\n\n\n\nPeter Khalil is recontesting the safe Labor seat of Wills in Melbourne's north in the May 3 election, and is also the government's special envoy for social cohesion.\n\n\n\n\n\nHe says the Labor Party is proud of its record in resettling Palestinian refugees from Gaza.\n\n\n\n\n\n\n\n\"I think Australia is only one of three countries that's provided thousands of visas for Palestinian refugees. We've resettled a number of refugees in my electorate. I've worked with Palestinian families, in fact helped some families to get out of Gaza and worked with the Foreign Ministry and so on to do that work and help resettle them. We don't make a big fuss about it, we don't make TikTok videos about it because this is about making sure we get outcomes.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/theyre-all-useless-the-battle-to-make-alienated-voters-care-about-this-election/0y4i5sjls",
        "title": "'They're all useless': The battle to make alienated voters care about this election",
        "publish_date": "Thu, 24 Apr 2025 06:03:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Lunchtime is busy at a Broadmeadows shopping centre in Melbourne's north-west, not far from Tullamarine airport.\n\n\n\n\n\nThe food court is buzzing, and long lines are snaking away from Gloria Jean's cafe, the kebab shop, and the Middle Eastern bakery Zet & Zaatar.\n\n\n\n\n\nBut for some Australians, a food court lunch has become a rare treat, as voters cut spending on even the essentials.\n\n\n\n\n\nSBS News spoke to a group of young Muslim women at Nando's who were there to celebrate a friend's birthday.\n\n\n\n\n\nThey are feeling disaffected about the federal election on 3 May.\n\n\n\nShoppers are spending less on food amid a cost of living crisis. Source: SBS News \"They're all useless,\" the birthday girl said.\n\n\n\n\n\nA second woman said she doesn't vote. \"I'm registered, but I don't vote for any of them, I don't want to engage.\"\n\n\n\n\n\nAsked if independent candidates have any more appeal than the major parties, a third woman told SBS News: \"They're all just as bad as each other. People can't afford to eat, so what's the point?\"\n\n\n\n\n\nThe group are all registered to vote in the electorate of Calwell, in Melbourne's north-west.\n\n\n\n\n\nIt's a safe Labor seat held by a margin of over 12 per cent.\n\n\n\nCreated in 1984, Calwell has only ever had two MPs — both of them Labor. And after holding office since 2001, current MP Maria Vamvakinou is retiring this year.\n\n\n\n\n\nSBS News has contacted Labor's new candidate Basem Abdo for comment.\n\n\n\n\n\nAbdo stood alongside Labor's climate change minister Chris Bowen at a press conference in Broadmeadows early this month to talk about the party's solar batteries scheme.\n\n\n\n\n\n\"Today is not just about cleaner energy, but cheaper energy,\" Abdo told reporters, adding that \"bill busting\" was important to his community.\n\n\n\nREAD MORE How to make your vote count in Australia's preferential voting system\n\nStory of electorate is one of 'neglect'\n\nAccording to the most recent Census data, nearly a quarter of Calwell's population is Muslim and less than half of its population was born in Australia.\n\n\n\n\n\nIndependent candidate for Calwell, Samim Moslih, spoke to SBS News at a candidate exchange hosted by SBS at the Broadmeadows shopping centre on Wednesday. He said the story of Calwell is one of \"neglect, neglect, neglect\".\n\n\n\n\n\n\"If you don't vote for the party that's in power, you don't get anything. And if you vote for the party that is in power and it's not a marginal seat, you don't get anything, but you're paying taxes through and through,\" he said.\n\n\n\nIndependent candidate for Calwell Samim Moslih at an SBS voters' exchange event. Source: SBS News / Madeleine Wedesweiler Moslih, who was born in Afghanistan, said he has received legal advice confirming he has made satisfactory steps to renounce his Afghan citizenship.\n\n\n\n\n\nThe issue came to the fore again last year when One Nation senator Pauline Hanson questioned Senator Fatima Payman's eligibility to sit in parliament for having Afghan citizenship. Payman, at the time, said she had taken reasonable steps to renounce her citizenship but was unsuccessful because the embassy had no contact with the Taliban government.\n\n\n\n\n\nMoslih points out Calwell has a population of over 200,000.\n\n\n\n\n\n\"We don't have a 24-hour hospital with an emergency department. We don't have a university campus,\" he said.\n\n\n\n\n\n\"We've got a young girl who's travelling one and a half hours just to get to class — a new uni student who's getting to class.\n\n\n\n\n\n\"She's cooked before she's even starting to actually learn anything.\"\n\n\n\nNot enough being done to combat Islamophobia\n\nPollsters have tipped Labor could lose voters who strongly oppose its policies in relation to the Hamas-Israel war, as was the case in the United Kingdom last year .\n\n\n\n\n\nMoslih said the major parties' failure to call the conflict a genocide amounts to \"emotional neglect\".\n\n\n\n\n\nA United Nations special committee, Amnesty International and a South African delegation at the International Court of Justice have accused Israel of committing genocide in Gaza , which Israel denies.\n\n\n\nSamim Moslih is the independent candidate for Calwell. Source: Supplied / Samim Moslih Moslih accused the government of not doing enough to combat Islamophobia, which he said is \"spreading like a cancer\".\n\n\n\n\n\n\"We've got an Islamophobia envoy that is lost in the wilderness. There's a report that he's putting together, while we are living Islamophobia day in day out, our women are being attacked,\" Moslih said.\n\n\n\n\n\n\"I will be the voice and an unapologetic voice forcing the change that we need because this silence is what is causing the problem.\"\n\n\n\nThe local Greens candidate Ravneet Garcha is also trying to appeal to the Muslim vote in the area.\n\n\n\n\n\nAnnouncing her campaign in February, Garcha singled out \"fighting for Palestine\" as one of her top three priorities if elected, alongside fighting for renters and getting dental into Medicare.\n\n\n\n\n\nIf elected, she would become the first Punjabi candidate to represent the electorate, where the community is growing at a steady rate.\n\n\n\n\n\nBut a source with knowledge of the campaigns told SBS News the Victorian Greens are focusing most of their energy on the nearby seat of Wills, held by Labor candidate Peter Khalil.\n\n\n\nCandidates trying to appeal to diverse community\n\nOutside the Broadmeadows shopping centre, local man Andy said he doesn't like politics, doesn't want to talk about it, and doesn't want to vote, but he will because he has to.\n\n\n\n\n\nThe things that concern him most are getting support for his friend and support for the Assyrian community.\n\n\n\nAndy (left) said he \"doesn't do politics\" but wants respect to be shown to the Assyrian community. Source: SBS News / Madeleine Wedesweiler It's a community the Liberal party is trying to appeal to.\n\n\n\n\n\nThe Liberal candidate for Calwell, Usman Ghani, announced this week an elected Liberal government would invest a $2 million into building an early childhood centre at the St George Assyrian Church of the East.\n\n\n\n\n\nHe also fronted a press conference alongside Opposition leader Peter Dutton on day four of his electoral campaign, to announce $1.5 billion in extra money for the Melbourne Airport Rail Link.\n\n\n\n\n\nThe airport is located just outside the southern border of the electorate.\n\n\n\nThe Liberal candidate for Calwell, Usman Ghani (pictured on the right of the signboard), fronted a press conference with Opposition leader Peter Dutton to announce $1.5 billion in extra money for the Melbourne Airport Rail Link. Source: AAP / Mick Tsikas Meanwhile, Family First candidate Maria Bengtsson told SBS Examines her party's priorities are protecting children and also freedom.\n\n\n\n\n\n\"Freedom of speech, freedom for your choice,\" she said.\n\n\n\n\n\n\"It's not on government to tell me what to do. I know what is best for me and my family really and I care very much so I want people to know that freedom is very important.\"\n\n\n\nAaron Qin, chair of the Australian Commerce and Culture Foundation, said the Chinese community in Calwell is mainly concerned about the cost of living and health care. Source: SBS News / Madeleine Wedesweiler Aaron Qin, chair of the not-for-profit Australian Commerce and Culture Foundation, has been trying to engage the area's Chinese community in voting.\n\n\n\n\n\nHe said his community is concerned primarily about cost of living measures and health care.\n\n\n\n\n\n\"I think most of the people don't understand what is going on. [The government and Opposition] haven't delivered a clear message,\" he said.\n\n\n\n\n\n\"They say we'll reform the Medicare system , but how is that going to help the local people?\"\n\n\n\n'It's so important to vote'\n\nWhile some voters are confused and many are feeling apathetic, others recognise the importance of voting and feel proud to cast their vote.\n\n\n\n\n\nThe Australian Electoral Commission announced earlier this month a record 98.2 per cent of eligible voters had enrolled for this year's election, representing a 5 per cent increase on 2022.\n\n\n\n\n\nAn elderly Vietnamese couple who spoke to SBS News said they had already voted after their son took them to an early voting centre on Wednesday.\n\n\n\n\n\n\"When we came to Australia in 1985, we didn't want to vote and we didn't know who to vote for.\n\n\n\n\n\n\"But it's so important to vote.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/liberal-party-history-australia/eb5cinhj5",
        "title": "Australia's most election-winning party: Liberal Party — then and now",
        "publish_date": "Thu, 24 Apr 2025 04:18:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's the party with the most election wins under its belt in Australian history and the party of Australia's two longest-serving prime ministers.\n\n\n\n\n\nBut where did the Liberal Party come from, and who are they now?\n\n\n\n\n\nHere's your guide to Australia's Liberal Party ahead of the 2025 election.\n\n\n\nA brief history of the Liberal Party\n\nFormed in 1944, the Liberal Party was born in response to the Labor Party.\n\n\n\n\n\n\n\nDr Jill Sheppard, senior lecturer at The Australian National University's School of Politics and International Relations, said there was a simple idea behind it.\n\n\n\n\n\n\"The Liberal Party really just formed in response to the Labor Party, and that has shaped not only sort of their history, but it also shapes where they are at the moment,\" she told SBS News.\n\n\n\n\n\nRobert Menzies, the founding member of the Liberal Party, was very strong on the idea of individual choice.\n\n\n\n\n\nHis assessment was that the Labor Party had been born out of the union movement and that no-one spoke for people who were self-employed and the middle class.\n\n\n\n\n\nA bunch of other people thought the same thing, so they banded together to form the Liberal Party, as former Liberal Party frontbencher George Brandis explains.\n\n\n\n\n\n\"The Liberal Party was conceived to represent the broad mainstream of Australia in those days, not organised labour, and it certainly wasn't designed to represent the big end of town either,\" he told SBS News.\n\n\n\nREAD MORE Major donors to political parties\n\nIn 1949, the Liberal Party won its first election, partnering up with the Country Party of Australia, making Robert Menzies prime minister.\n\n\n\n\n\n\"He [Robert Menzies] was hugely successful at creating and sort of driving this sense of purpose that represented an Australian society that made sense to a lot of people, and he called these he's forgotten people,\" Brandis said.\n\n\n\n\n\nFor this reason, the Liberal Party focused on people who were middle-class, owned small businesses, and professionals.\n\n\n\n\n\n\"Menzies said the rich can look after themselves; the working man is often looked after by his trade union,\" Brandis said.\n\n\n\n\n\n\"But middle-class people, small business people, professional people, farmers, artisans, those sorts of people have no-one to look after them. So that was the original base of the Liberal Party.\"\n\n\n\n\n\nMenzies was a strong advocate of the 1901 Immigration Restriction Act — more commonly known as the 'White Australia Policy'.\n\n\n\n\n\nBut in 1966, the Liberal Party changed laws, paving the way to abolish the policy.\n\n\n\nWait, doesn't liberal mean left?\n\nThe Liberal Party is considered to be the more conservative of the two major parties, leaning right.\n\n\n\n\n\nAnd since the party is more politically conservative than liberal, the name might seem a bit confusing.\n\n\n\n\n\nWhile in other parts of the world, parties that oppose labour are often called conservative, Brandis said that was not the original intent of the party.\n\n\n\n\n\n\"Of the various options that Menzies had in choosing the name of his new party, he avoided calling it the Conservative Party, because he wasn't a conservative, he was a classical liberal,\" he said.\n\n\n\nBut Sheppard said there is a conservative element.\n\n\n\n\n\n\"There are two core streams of the Liberal Party, and one is what we would call liberal, but we often call that small liberal. What we mean is there is a genuine belief that the government is not here to help you, that you are your best advocate, that you should you can best decide how to live your life, and the less the government does, the better,\" she said.\n\n\n\n\n\n\"The conservative stream of the Liberal Party does think that government is okay. They're much less resistant to the idea that government can solve our problems.\"\n\n\n\nWhat does the Liberal Party look like nowadays?\n\nNowadays, the Liberal Party traditionally seeks a \"smaller, quieter Australia\", Sheppard said.\n\n\n\n\n\n\"But what they are less happy about are things like same-sex marriage, open borders, you know, international students. They want a smaller, quieter Australia that looks more like it did in the 1960s,\" she said.\n\n\n\n\n\n\"It's an incredibly different set of principles that the Liberal Party is trying to manage. Under Peter Dutton, the party feels quite conservative. It feels like a party that just wants us to live quietly, does not want to rock the boat too much.\"\n\n\n\nThe Liberal Party teams up with the Nationals in a coalition to form a government.\n\n\n\n\n\nBrandis describes it as a \"functional\" and \"necessary\" relationship.\n\n\n\n\n\n\"The National Party, though, is a very different beast from the Liberal Party,\" he said.\n\n\n\nWhat have been the Liberal Party's biggest achievements?\n\nSheppard said the party would be proud of its economic achievements.\n\n\n\n\n\n\"Liberalisation of the economy, you know, the ability for anyone in the middle class or working class to move up in society, to own their own business, to go to university if they wish, to live the kind of life that they choose that isn't tied to their occupation or to what their parents did,\" she explains.\n\n\n\n\n\n\"They would say that is their core achievement over the last 30 years.\"\n\n\n\nSome of the most well-known Liberal Party policies include:\n\n\n\nResettling Vietnamese refugees after the Vietnam War in 1976.\n\nEstablishing the Special Broadcasting Service in 1978.\n\nBringing in tougher gun laws after the Port Arthur massacre in 1996.\n\nAnd creating Operation Sovereign Borders in 2013.\n\nWhich leaders have been part of the Liberal Party?\n\nOne of the party's best-known leaders is Harold Holt, who famously went missing in the ocean.\n\n\n\n\n\nJohn Howard, the second longest-serving prime minister of Australia, was also a member of the Liberal Party.\n\n\n\n\n\nThe party was last in government in 2022 — and Scott Morrison was the last Liberal Party prime minister of Australia.\n\n\n\n\n\nPeter Dutton is the current leader and will be the prime minister if the Coalition wins the next election.\n\n\n\n\n\nHe's been a politician for 25 years, and before then was a police officer.\n\n\n\nREAD MORE What to know about Peter Dutton, the leader of the opposition vying to be PM\n\nWhat's ahead for the Liberal Party in this upcoming election?\n\nFor this year's election, the Liberal Party's slogan is 'Get Australia Back on Track'.\n\n\n\n\n\nTheir policies include:\n\n\n\nBuilding Australia's first nuclear reactors\n\nBeing tough on crime\n\nReducing wasteful spending, including cutting public service jobs\n\nReducing migration\n\nSo, how does the party stack up to its original manifesto? Pretty well, Sheppard said.\n\n\n\n\n\n\"Weirdly, I think the Liberal Party is probably closer to its original party than the Labor Party is.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/labor-party-history-australia/qjhh1zoxt",
        "title": "Australia's oldest political party: A guide to Labor ahead of the 2025 election",
        "publish_date": "Thu, 24 Apr 2025 04:13:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's Australia's oldest political party and is currently in power in Australia.\n\n\n\n\n\nBut where did the Labor Party come from and what does it represent now?\n\n\n\n\n\nAhead, your guide to the party ahead of the 2025 election.\n\n\n\nAustralia's oldest political party\n\nThe Australian Labor Party — or ALP — is Australia's oldest political party.\n\n\n\n\n\nThe ALP is synonymous with Australia's labour and union movement, being born from the \"great shearer strikes in western Queensland in the 1890s\", according to Wayne Swan, former treasurer and the party's current national president.\n\n\n\n\n\nBack then, working conditions were tough, so trade unions, which are organised groups of workers, were formed.\n\n\n\n\n\nThey wanted their demands taken seriously by the government, so they formed the Labor Party in 1901.\n\n\n\nAt the start, Labor's policies were focused on workers' rights. It campaigned for the eight-hour working day and created the minimum working wage.\n\n\n\n\n\nIn its early days, it was a strong advocate for the ‘White Australia Policy’ and was largely against immigration.\n\n\n\n\n\nBut these days, the party's priorities have shifted.\n\n\n\nWhat does the ALP look like now?\n\nLabor fills the space of the more progressive party out of the two main contenders, and is considered centre left.\n\n\n\n\n\nSenior lecturer at the Australian National University's School of Politics and International Relations, Jill Sheppard, says the party is rooted in unions.\n\n\n\n\n\n\"Sometimes, when we think we'd expect Labor to be a bit more progressive on some issues, or maybe a bit more pro-immigration, we can sometimes explain that by drawing on their history of being really trade union representatives,\" she tells SBS News.\n\n\n\n\n\nThe Labor Party says it also represents the working class and workers' rights in Australia, rooted in strong union ties.\n\n\n\nREAD MORE The 124-year-old feature of Australian elections that Albanese supports changing\n\n\"We are a party that is proudly of the union movement and associated with the union, so the union movement is a participant in our party,\" Swan told SBS News. \"Not all union members are members of the Labor Party, but many are.\n\n\n\n\n\n\"The ethos of unionism, the solidarity that comes from it, looking after your mate, if you like, always been having an eye out for those that are more vulnerable, and lending them a helping hand lies at the very core of unionism, but also at the very core ethos of the Labor Party.\"\n\n\n\n\n\nAt its core, the Labor Party believes the government has a role in \"spreading\" opportunity, according to Swan.\n\n\n\nHe says it's what you'd call a party of big government.\n\n\n\n\n\n\"We fundamentally believe that government has got a role to play in creating prosperity and then spreading the opportunity,\" he said.\n\n\n\n\n\n\"So we see a significant role for government intervention in the economy, in clear contrast to the number of conservative parties over the past 100 years that have argued for essentially a survival of the fittest mentality on their side of politics, small government, regressive tax, a very sparse social safety net.\"\n\n\n\nWhat have been the Labor Party's biggest achievements?\n\nSheppard says over the last 15 years, the party would be proud of its social achievements.\n\n\n\n\n\n\"We might look at things like the apology to the Stolen Generations, we might look at constant minimum wage increases, things that don't always sound very exciting, but they are the important business of governing the country, making sure that there is a safety net for the worst off Australians,\" she said.\n\n\n\nSome of its biggest achievements include:\n\n\n\nIntroducing universal healthcare in 1974 (first known as Medibank, now Medicare)\n\nThe Native Title Act of 1993\n\nSetting up the National Disability Insurance Scheme, the NDIS, in 2013\n\nWhich well-known leaders have been part of the ALP?\n\nTwo key Labor figures were Gough Whitlam, its longest-serving leader, and Bob Hawke, its longest-serving prime minister.\n\n\n\n\n\nWhitlam led a reformist government that ended military conscription, established universal healthcare and introduced free university education, among other measures.\n\n\n\n\n\nHe was controversially dismissed by then governor-general Sir John Kerr in 1975.\n\n\n\n\n\nThe Hawke government's measures included floating the dollar, deregulating the banking industry and confirming Australia's national colours as green and gold.\n\n\n\n\n\nHawke was also renowned for the speed at which he could skol a beer.\n\n\n\nREAD MORE What to know about Anthony Albanese, prime minister and Labor leader\n\nKevin Rudd — who was pushed out by Australia's first and only female PM Julia Gillard — both belong to the ALP.\n\n\n\n\n\nThe leader of the party, and Australia at the moment, is Anthony Albanese. If Labor wins the next election, he'll be prime minister again.\n\n\n\n\n\nHe's been a federal politician for almost 30 years, elected to the inner west Sydney seat of Grayndler.\n\n\n\n\n\nHe has spoken about how he grew up in public housing with a single mother.\n\n\n\n\n\nWhen taking office, he said his government's areas of focus would be the cost of living, bolstering Indigenous rights, and tougher climate action.\n\n\n\nWhat's ahead for the Labor Party this upcoming election?\n\nAs we head into the election, Swan says it's not going to be easy for Labor.\n\n\n\n\n\n\"There's a myriad of challenges,\" Swan said. \"There's been no government in the last couple of years that's been re-elected internationally in this cost of living crisis, which is largely internationally induced. So it's a tough environment to go to the people.\"\n\n\n\n\n\nThis election, Labor's policies include:\n\n\n\nCutting student debt\n\nMaking childcare cheaper\n\nImproving Medicare\n\nInvesting in renewable energy\n\nSo how does the party stack up to its original manifesto? Sheppard says there's been a lot of change.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/education/it-may-not-be-trendy-but-i-d-still-send-my-kids-to-single-sex-schools-20250424-p5lu2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It may not be trendy, but I’d still send my kids to single-sex schools",
        "publish_date": "Fri, 25 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "Look, I fancy myself as being as modern as anyone who remembers chanting “Peace, Charger, Fosters Lager” in the 1970s or drinking Tang while watching Lost in Space can be.\n\nIf you ignore all the mid-century furniture, contemporary is my vibe. I know burrata is over, that statement belts and solo travel to secondary cities are hot. I’ve seen Amyl and the Sniffers live and am into hyperrealistic drama series.\n\nEnrolments at all-boys’ Xavier College have fallen over the past five years.\n\nAnd yet, I can’t drag myself into the current day and admit single-sex schools should not still be a thing.\n\nThe subject came up for me and my husband this week on a dog walk, sparked by news that enrolments at Melbourne’s all-boys Xavier College have dropped 19.5 per cent in the past five years.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/it-s-unacceptable-it-s-wrong-prince-harry-calls-for-change-to-protect-children-online-20250425-p5lu69.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s unacceptable, it’s wrong’: Prince Harry calls for change to protect children online",
        "publish_date": "Fri, 25 Apr 2025 11:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "India Mctaggart"
        ],
        "text": "The Duke of Sussex has said life is “better” when spent off social media.\n\nPrince Harry spoke out as he and wife Meghan unveiled a memorial in New York dedicated to children who have lost their lives because of the harms of the internet.\n\nPrince Harry and his wife Meghan have spoken out at a memorial about the work to be done to better protect children online. Credit: GC Images\n\nSpeaking to BBC Breakfast, the Prince said: “Life is better off of social media. I say that as a parent, and I say that as someone who has spoken to many of the kids here tonight who aren’t on social media because they have lost a brother or a sister to social media.\n\n“But clearly enough is not being done. Some of the stories here are truly harrowing.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/bulldogs-trio-face-combined-13-weeks-on-sidelines-after-wild-broncos-loss-20250425-p5lu80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bulldogs trio face combined 13 weeks on sidelines after wild Broncos loss",
        "publish_date": "Fri, 25 Apr 2025 11:18:59 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Canterbury back-rower Sitili Tupouniua is facing up to seven matches on the sidelines for two incidents in which he kneed and shoulder-charged Brisbane’s Brendan Piakura in the head.\n\nWith teammates Josh Curran (grade two shoulder charge) facing up to four weeks out and Matt Burton (grade two careless high tackle) also issued a 1-2 game ban, the Bulldogs trio face a combined nine weeks on the sidelines if they were to each accept early guilty pleas.\n\nThat figure balloons to a maximum of 13 combined weeks if each charge was unsuccessfully challenged at the judiciary.\n\nTupouniua was placed on report, but not sin-binned for leading with his knee into contact with Piakura in Thursday night’s heavy loss to the Broncos, to the consternation of commentators given the Bunker viewed several replays of the incident.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-chicken-korma-20250425-p5lu7q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s chicken korma",
        "publish_date": "Fri, 25 Apr 2025 10:55:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1 Combine the chicken and the marinade ingredients and set aside for at least an hour, but preferably refrigerated overnight.\n\nStep 2 Heat a large saucepan over medium heat and add 1 tablespoon of oil and the onions. Fry the onions for about 6 minutes until browned, then transfer to a blender with the cashews, yoghurt and about ½ a cup of water. Blend to a smooth purée.\n\nStep 3 Return the saucepan to the heat and add the remaining oil. Add the cinnamon, cloves, cardamom, bay leaf and chilli (if using) and fry for a minute until fragrant.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/dogs-star-in-trouble-for-raised-knee-20250425-p5lu75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dogs star in trouble for raised knee",
        "publish_date": "Fri, 25 Apr 2025 09:48:16 +1000",
        "category": "finance",
        "authors": [],
        "text": "Dogs star in trouble for raised knee\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/china-has-an-army-of-robots-on-its-side-in-the-tariff-war-20250424-p5ltzo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "China has an army of robots on its side in the tariff war",
        "publish_date": "Fri, 25 Apr 2025 09:44:00 +1000",
        "category": "finance",
        "authors": [
            "Keith Bradsher"
        ],
        "text": "Elon Li’s curbside workshop in Guangzhou, the commercial hub of southeastern China, has 11 workers who cut and weld metal to make inexpensive ovens and barbecue equipment. He is preparing to pay $US40,000 ($63,000) to a Chinese company for a robotic arm with a camera. The device uses artificial intelligence to observe how a worker welds the sides of an oven, and then duplicates the action with minimal human intervention. Only four years ago, the same system was available only from foreign robot companies and cost nearly $US140,000. “Before, I never would have imagined investing in automation,” Li said, adding that a human employee “can only work for eight hours a day, but a machine can work 24 hours.” A robot sorts lug nuts before attaching wheels to electric cars at a Zeekr plant in Ningbo, China. Credit: Qilai Shen/The New York Times Bigger companies bet far more on automation. In Ningbo, a huge factory for Zeekr, a Chinese electric carmaker, had 500 robots when it opened four years ago. Now there are 820, and many more are planned.\n\nCheerfully trilling Kenny G tunes to warn any people of their approach, robot carts haul aluminum ingots to an automated elevator, which lifts the blocks of metal to a furnace at the top of a 12-metre tall Chinese-made machine. Once molten, the aluminum is cast into the shapes of various car body panels and other components. More robot carts, and the occasional human driving a forklift, take the components to a warehouse. Loading Yet more robots take the panels to the assembly line, where hundreds of robotic arms, working in teams of up to 16, do a complex dance to weld them together into car bodies. The welding area is a so-called dark factory, meaning that the robots can operate without workers and with the lights off. China’s factories still employ legions of workers. Even with the automation, they are needed to check quality and install some parts that require manual dexterity, such as wiring harnesses. There are things cameras and computers cannot do on their own. Before cars are painted, workers still run gloved hands over them and sand smooth any tiny imperfections. A worker making ovens and cookware at a small factory in Guangzhou. The company plans to acquire a robotic arm that uses artificial intelligence to replicate the way a person welds the sides of an oven. Credit: Qilai Shen/The New York Times\n\nYet, some of the later steps of quality control are also being automated with the help of artificial intelligence. Loading Near the end of Zeekr’s assembly line, a dozen high-resolution cameras take photos of each car. Computers compare the images to an extensive database of correctly assembled cars and alert factory staff if a discrepancy is found. The task takes seconds. “Most of our colleagues’ jobs involve sitting in front of a computer monitor,” said Pinky Wu, a Zeekr worker. Zeekr and other Chinese automakers are also using artificial intelligence to design cars and their features more efficiently.\n\nCarrie Li, a designer who works at Zeekr’s new office building in Shanghai, uses AI to analyse how different interior surfaces will intersect in a car. “I have more spare time to open my mind and explore for myself which kinds of fashion trends to include in the cars’ interior,” Li said. Car factories in the United States also use automation, but much of the equipment comes from China. Most of the world’s car assembly plants built in the past 20 years were in China, and an automation industry grew up around them. Chinese companies also bought overseas suppliers of advanced robotics, such as Kuka of Germany, and moved much of their operations to China. When Volkswagen opened an electric car factory a year ago in Hefei, it had one robot from Germany and 1074 robots made in Shanghai. China’s rapid advance in factory robotics has been propelled from the top down. Beijing’s “Made in China 2025” initiative, which began a decade ago, set out 10 industries in which China sought to be globally competitive. Robotics was one of them.\n\nA white-glove inspection of a vehicle on the assembly line. There remain some tasks that computers and cameras can’t do on their own. Credit: Qilai Shen/The New York Times To force the car industry to think about how to use humanoid robots with two arms and two legs, for example, government officials in Beijing told major automakers last year to rent robots and submit videos of them performing tasks in their assembly plants. The Zeekr plant’s greeter robot, which is still in testing, has a humanoid hand. Credit: Qilai Shen/The New York Times The videos required many takes to get them right. The robots did only basic tasks, such as sorting auto parts in a warehouse. But the initiative has helped push the carmakers along. In a show of the automation push, the Beijing municipal government held a half-marathon on Saturday for 12,000 runners and 20 humanoid robots. Only six robots finished the race, and the fastest of them took nearly three times as long as the fastest runners. But the event helped draw attention to robots.\n\nLast month, Premier Li Qiang, China’s second-highest official, said in his annual report to the legislature that the country’s plans this year would include an effort to “vigorously develop” intelligent robots. The country’s top economic planning agency announced a $US137 billion national venture capital fund for robotics, artificial intelligence and other advanced technologies. A display screen on a robot being trained to greet visitors at the Zeekr car assembly plant in Ningbo, China . Credit: Qilai Shen/The New York Times China’s government-controlled banks have increased lending to industrial borrowers over the past four years by a staggering $US1.9 trillion. That has paid for the construction of factories as well as the replacement of equipment at existing ones. China’s universities produce about 350,000 mechanical engineering graduates per year, as well as electricians, welders and other trained technicians. By comparison, American universities graduate about 45,000 mechanical engineers each year.\n\nJonathan Hurst, chief robot officer and a co-founder of Agility Robotics, a leading American robot manufacturer, said finding skilled employees had been one of his biggest challenges. As a graduate student in the Robotics Institute at Carnegie Mellon University in Pittsburgh, Hurst said, he was one of two mechanical engineers. China’s rapid embrace of automation worries some Chinese workers. Geng Yuanjie, 27, drives a forklift at the Zeekr factory, where he has worked for the past two years. He said there were considerably fewer robots at the Volkswagen factory where he previously worked. Surrounded by robots, he has few co-workers to talk to during his 12-hour shifts. To demonstrate advances in automation, Beijing held a half-marathon for 12,000 runners and 20 humanoid robots. Only six robots finished. Credit: Andrea Verdelli/The New York Times “I can feel the trend towards automation,” Geng said as he watched a robot cart pull a rack of car parts past his forklift. He said that his high school education might not be enough for him to qualify for classes in programming robots, and that he worried he might lose his job someday to a robot.\n\n“It is not just my concern – everyone worries about it,” Geng said. Automation has threatened and even eliminated jobs around the world for more than a century, often slowing automation’s growth. In China, there are fewer obstacles than practically anywhere else. China has no independent labor unions, and Communist Party control leaves almost no room for dissent. Another factor behind China’s automation drive is the country’s demographic crisis. The number of babies born each year has dropped by almost two-thirds since 1987. At the same time, two-thirds of people turning 18 now enroll at a university or college, an educational trajectory that has allowed a new generation to aspire to careers outside factory labor. “China’s demographic dividend is over,” said Stephen Dyer, head of the Asia industrial practice at AlixPartners, a consulting firm. “They’re now in a demographic deficit, and the only way out of that is productivity.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/anzac-day-marches-get-underway-20250425-p5lu6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anzac Day marches get underway",
        "publish_date": "Fri, 25 Apr 2025 09:29:53 +1000",
        "category": "finance",
        "authors": [],
        "text": "Anzac Day marches get underway\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/gwyneth-paltrow-responds-to-rumoured-feud-with-meghan-markle-20250326-p5lmo7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gwyneth Paltrow responds to rumoured feud with Meghan Markle",
        "publish_date": "Fri, 25 Apr 2025 09:03:01 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Gwyneth Paltrow responds to rumoured feud with Meghan Markle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/deputy-prime-minister-s-special-anzac-day-reflection-20250425-p5lu5v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Deputy prime minister’s special Anzac Day reflection",
        "publish_date": "Fri, 25 Apr 2025 08:44:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "Deputy prime minister’s special Anzac Day reflection\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/pope-is-now-part-of-the-endless-scroll-as-phones-steal-from-stillness-and-silence-of-grief-20250425-p5lu55.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pope now part of the endless scroll, as phones steal from stillness and silence of grief",
        "publish_date": "Fri, 25 Apr 2025 08:36:10 +1000",
        "category": "entertainment",
        "authors": [
            "Rob Harris"
        ],
        "text": "Vatican City: Even with the gravity of death in the air, it’s hard not to marvel at Michelangelo’s dome, an impossible structure suspended above us like the sky itself had been poured into stone.\n\nBut today, it wasn’t the art or the grandeur of St Peter’s Basilica that held us. It was the man lying beneath it all.\n\nThousands of people wait before St Peter’s Basilica to see the Pope lying in state on Thursday. Credit: Flavio Brancaleone\n\nPope Francis, in death, looked exactly as he had tried to live – unadorned. There was no papal crown, no golden thread. Just a red chasuble, his white cassock, and the gentle crossing of his hands on his chest. His face was slackened by time, but unmistakably him.\n\nThe man who spoke of climate change as a moral crisis. The man who washed the feet of prisoners. The man who dared, within the great machinery of the Catholic Church, to simply ask for kindness.",
        "source": "TheAge"
    }
]