[
    {
        "url": "https://www.9news.com.au/national/first-home-buyer-scheme-begins-wednesday-what-to-know/3b1be609-be8a-42c4-a1c5-1e093a1ef6fd",
        "title": "Whopping $1.5 billion property buying barrier to be scrapped instantly",
        "publish_date": "Mon, 29 Sep 2025 01:22:57 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "An expanded five per cent first home deposit scheme will come into effect on Wednesday, fulfilling a core government election pledge, but some observers are warning of the effect it will have on a frenzied housing market.\n\nAll first home buyers will be able to enter the property market with ﻿a five per cent deposit, with the rest of the deposit backed by the government under the Labor scheme.\n\nIt's set to kick off on Wednesday, October 1.\n\nAll first home buyers will be able to enter the property market with just ﻿a five per cent deposit. (iStock)\n\nUnder the changes, all first home buyers will have access, with no caps on places or income limits, according to government statements.\n\nProperty price caps will also be set higher in line with average house prices, providing access to a greater variety of homes.\n\nThe government expects first home buyers using the scheme in just its first year are expected to avoid around $1.5 billion in potential mortgage insurance costs.\n\nREAD MORE: Men who vanished on missing catamaran found off NSW coast\n\nThe government's signature home deposit scheme will take effect this week. (Getty Images/iStockphoto)\n\nObservers have warned of the effect on a frenzied housing market. (Joe Armao)\n\nBut the Real Estate Buyers Agents Association of Australia has warned of potential adverse effects on the market.\n\nREBAA president Melinda Jennison said prices had jumped significantly in many locations in the past month as home buyers started to panic about the impact of the scheme on the wider market.\n\n\"Properties that were selling for $750,000 last month are now selling for close to $800,000,\" Jennison said.\n\nREAD MORE: Thousands hit with another Optus outage\n\n\"Many buyers are reportedly panicking with some purchasing sight unseen or overpaying to secure a property before 1 October.\"\n\nJennison said it was admirable for the government to help more first home buyers enter the market, but without more housing supple, extra demand would only drive up the market.\n\n\"What was $800,000 will soon be $900,000, which will make it even more difficult for first timers to secure finance for a home – even with the scheme's five per cent deposit on offer,\" she said.\n\n\"Markets are already in frenzy, let alone what the next few months will bring once the scheme has started.\n\n\"Property buyers need to calm down, stick to their budgets, and seek out expert advice from professional buyers' agents to ensure they don't overpay because of their fear of missing out.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/government-flags-further-superannuation-funds-after-shield-collapse/284bb389-6979-4d2e-8eb9-d500415cd0f8",
        "title": "Government flags clampdown on superannuation investment funds",
        "publish_date": "Mon, 29 Sep 2025 01:36:48 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "T﻿ougher regulations to clamp down on dodgy superannuation funds are being flagged by the federal government in the wake of the Shield Master Fund collapse.\n\nMacquarie Group has agreed to pay back in full $321 million to 3000 members of Shield, a subsidiary of the investment bank, by tomorrow after it was sued by the Australian Securities and Investments Commission.\n\nMacquarie admitted it did not act efficiently, honestly and fairly by failing to place Shield on a watch list for heightened monitoring.\n\nAssistant Treasurer Daniel Mulino. (Photo by Chris Hopkins) (Nine)\n\nThe move by the corporate regulator was welcomed by Assistant Treasurer Daniel Mulin who said he was working with ASIC on reforms to make it tougher for shonky funds to be licensed.\n\n\"As minister I am also engaging regularly with ASIC, my department, and with key industry stakeholder groups in order to better understand the drivers of conduct that have led to these collapses, and how we can work together with the sectors to implement sensible reforms that better protect consumers in the future,\" Mulin said.\n\n\"We are seeing failings at every step of the value chain, including from lead generators, financial advisers, superannuation trustees, auditors, managed investment schemes and research houses.\"\n\nMulin said the Shield collapse was a reminder for Australians to be wary of high-pressure sales tactics, including requests to make a decision on the spot, and clickbait online advertising.\n\nEarlier this year, ASIC chair Joe Longo said the rules around setting up a managed investment fund were \"very permissive\".\n\n\"The bar is so low to register one, it basically serves no barrier to entry at all,\" he said.\n\n\"It doesn't matter if the underlying asset is alpacas or meme coins - if the fund has a valid trust deed and disclosure document, ASIC has to register it.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/optus-outage-dapto-nsw-triple-zero-calls-affected/a5503bf6-3386-4350-8274-90052c2ca5da",
        "title": "Optus triple zero outage 'unacceptable', premier says",
        "publish_date": "Mon, 29 Sep 2025 01:00:07 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Premier Chris Minns has slammed the Optus outage in New South Wales on the weekend as \"clearly unacceptable\" as the telco giant's recent woes continue.\n\n\"New South Wales deserves full and transparent information from Optus about what went wrong yesterday, including when emergency services and the telco authority were notified,\" Minns said.\n\n\"Our emergency services have worked tirelessly to check on the welfare of those affected by this outage, and that work will continue today.\n\nThe Optus network was hit by another outage on the weekend. (Nine)\n\nMultiple people were left unable to contact triple zero after the outage over the weekend.\n\nAn Optus spokesperson said there had been \"an issue involving a mobile phone tower site\" in the Dapto region.\n\nThe outage affected calls between 3am and 12.20pm yesterday, including nine calls to the emergency hotline.\n\nThousands of customers were affected. (Getty)\n\nOptus said all people who attempted to contact triple zero were \"okay\".\n\nSeveral of the emergency calls were accidental or test calls.\n\n\"While there are currently no reports of adverse patient outcomes from this incident, it underlines just how critical reliable communications are, which is why we welcome the federal government and ACMA's investigations into Optus,\" Minns said.\n\nAbout 4500 people were affected by the outage, but the Optus spokesper﻿son said services had been restored.\n\nMultiple emergency calls were blocked. (Getty)\n\nThe weekend outage comes just days after ﻿a major outage earlier this month that has been linked to multiple deaths.\n\nHundreds of emergency phone callers were left unconnected across multiple states.\n\nOptus chief executive Stephen Rue blamed that outage on human error, saying a firewall upgrade had been botched.\n\n\"Preliminary investigations have determined that on the first night of the upgrade, the steps taken on past successful upgrades of a similar nature were not followed,\" he said last week.\n\n\"On this occasion of the upgrade of 18 September, the first step in the process was not followed.\"\n\nCommunications Minister Anika Wells has warned of \"consequences\" for the telco giant, but no specific penalties have yet been handed down.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/missing-yacht-heading-from-yamba-in-nsw-to-queensland-gold-coast-sparks-search/d2153c20-1dc1-4afb-a535-ebe64c2b677b",
        "title": "Men who vanished on missing catamaran found off NSW coast",
        "publish_date": "Sun, 28 Sep 2025 21:05:01 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "It was scheduled to arrive at Southport on the\n\nGold Coast\n\nabout 5pm that same day but never docked.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ivfaustralia-the-world-egg-and-sperm-bank-donor-eggs/575dd558-b2d9-4ba2-872b-e1ca50587e86",
        "title": "Reason behind leading IVF clinic's huge donor egg call remains a mystery",
        "publish_date": "Sun, 28 Sep 2025 23:45:18 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "One of Australia's leading fertility ﻿clinics has announced it will no longer allow families to source donor eggs from a major international egg and sperm bank.\n\nIVFAustralia announced it will no longer be facilitating new arrangements using donor eggs from The World Egg and Sperm Bank last week.\n\nWhen asked why the decision had been made, a spokesperson said: \"IVFAustralia regularly reviews its donor programs and provider arrangements.\n\nREAD MORE: Millions of Aussies to have thousands in debt wiped from today\n\nIVFAustralia announced it will no longer be using donor eggs from The World Egg and Sperm Bank this week. (IVFAustralia)\n\n\"As part of this process, our arrangement with The World Egg and Sperm Bank has now concluded, and we are in the process of establishing a new partnership with an alternative provider.\"﻿\n\n9news.com.au has attempted to contact The World Egg and Sperm Bank for comment on multiple occasions.﻿\n\n9news.com.au is not suggesting The World Egg and Sperm Bank has engaged in any wrongdoing, just that IVFAustralia has decided not to utilise its services anymore.\n\nThe World Egg and Sperm Bank is a privately owned US-based company and expanded to Australia this year.\n\nIVFAustralia first announced the significant \"update\" to ﻿its donor egg program in an email to customers.\n\n\"Please be advised that IVFAustralia will no longer be facilitating any new arrangements using donor eggs sourced from The World Egg and Sperm Bank,\" it read.\n\n\"We know this news may be unexpected and may feel deeply disappointing, especially if you had been spending time considering this pathway.\"\n\n﻿IVFAustralia confirmed it is working to establish new donor egg \"collaborations\" and expect to have them in place in the coming months.\n\nThe email also reassured clients already in the process of using donor eggs from The World Egg and Sperm Bank that they would have their current arrangements honoured.\n\n\"You will be able to proceed as planned.\"\n\nThis is the update IVFAustraliia customers received. (IVFAustralia)\n\nA spokesperson for IVFAustralia told 9news they \"recognise this news may be distressing for patients, and our team is here to provide support.\n\n\"It's our priority to establish a new arrangement and we are actively working to establish a new partnership with an alternative provider.\"\n\nThey said IVFAustralia's donor team is available to help Australians navigate finding a known donor.\n\nThey also encouraged patients ﻿\"who are ready to begin their egg donor pathway\" to look into IVFAustralia's local egg donor program.\n\n\"We continuously seek to attract new local donors to the program,\" they said.\n\nIVF births have grown exponentially across Australia in the last 40 years.\n\nAbout one in every 16 babies born in the country are born via IVF these days﻿.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/prime-minister-albanese-uk-visit-king/3a0b60ce-429c-4a20-8f54-794453459963",
        "title": "Albanese meets with King Charles at Balmoral",
        "publish_date": "Sat, 27 Sep 2025 22:16:59 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Prime Minister Anthony Albanese has visited Balmoral Castle for a private meeting with King Charles III.\n\nAlbanese and fiance Jodie Haydon flew to Scotland overnight for the face-to-face visit, which the prime minister described as a privilege and a \"great honour\".\n\nThe King only two weeks ago praised the AUKUS defence pact between Australia, the US and Britain during Donald Trump's state visit to the UK.﻿\n\nKing Charles III during an audience with Australian Prime Minister Anthony Albanese at Balmoral Castle. (Getty)\n\nThe prime minister will tomorrow speak at the UK Labour Party conference in Liverpool before travelling to the United Arab Emirates.﻿\n\nEarlier, Albanese joined the British Prime Minister Sir Keir Starmer in discussing defence, security, trade and the economy.\n\nTop of the agenda was how to protect the AUKUS pact from being unpicked by Donald Trump's America First agenda.\n\nThe US President's unique brand of populism has been matched in Britain by Nigel Farage's Reform party which is leading the UK polls.\n\nFarage is riding a wave of anti-immigration sentiment helped along by rallies stoked by far-right activists .\n\nMarch for Australia protests have also been held in major cities over the past few weeks.﻿\n\n\"That sends shivers through the spines on many of our communities,\" Starmer said.\n\n\"I don't want to see the rise of populist organisations,\" Albanese added.\n\nPrime Minister Anthony Albanese and Jodie Haydon arrives for an informal meeting with Prime Minister of the United Kingdom and Lady Victoria Starmer, the Prime Minister of Canada and Madam Diana Fox Carney and Mette Frederiksen, Prime Minister of Denmark at 10 Downing Street. (Dominic Lorrimer)\n\nThe British Prime Minister hosted his Australian counterpart at Number 10.\n\nAlbanese said: \"We share values and today more so than ever really.\"\n\nLater, he was seen heading into the famous door with some Aussie-brewed beers with partner Haydon.\n\nHe clutched a four-pack of his own Albo brew by Willie The Boatman﻿ in Sydney.\n\nREAD MORE: Man dies after plane owned by skydiving business crashes\n\nBritish Prime Minister Keir Starmer (L) welcomes Australian Prime Minister Anthony Albanese to 10 Downing Street. (Getty)\n\nAlbanese and Starmer are both from the progressive side of politics.\n\nAlbanese scored a thumping re-election in May.\n\nThe other is facing an early reckoning just 14 months after winning power.\n\nThe British public is increasingly concerned about illegal migrants, with many crossing the English Channel in boats.\n\nThe British PM has announced a mandatory digital ID in a bid to stamp out illegal workers.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/ashraf-mahrous-egypt-guinness-world-record-pull-ship-teeth/40d0d59f-5816-4b87-8a95-004e4decd01b",
        "title": "Egyptian wrestler pulls 700-ton ship with his teeth",
        "publish_date": "Sun, 28 Sep 2025 01:45:07 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": "With nothing but grit, muscle and an iron jaw, a hugely popular Egyptian wrestler geared up for an extraordinary challenge yesterday: pulling a 700-ton ship across the water with a rope held only by his teeth.\n\n“Today, I have come to break the world record,” Ashraf Mahrous said in an interview in Egypt’s Red Sea resort of Hurghada after the challenge.\n\nIt was no easy task but Ashraf Mahrous, also known by his nickname Kabonga, has dazzled before with his astonishing strength. Earlier this year, he pulled a train. He has also singlehandedly pulled a locomotive and four years ago, a truck.\n\nMahrous in action whilst a Guinness Book of World Records official watches on. (AP)\n\nWith each achievement, his popularity has soared — children run after him in the streets, where he's known simply as “strong man.”\n\nWith the ship pull, Mahrous, a 44-year-old native of the port city of Ismalia, hopes to get yet another recognition from the Guinness World Records.\n\nA triumph by the Red Sea\n\nThe scene was set at the shore in Hurghada. Mahrous first pulled a 700-ton ship, and to affirm his challenge he pulled two ships weighing approximately 1150 tons together.\n\n“I pulled them both, thanks to God, to prove to my friends and the whole world that God blessed me by being the strongest man in the world,” Mahrous said.\n\nHe said the current Guinness World Record is a 614-ton ship set in 2018.\n\nMahrous said he will send videos and photos of his attempt to Guinness World Records to be evaluated.\n\nMahrous celebrating his feat. (AP)\n\nIn preparation for the feat, Mahrous followed a protein- and iron-rich diet, consuming at least a dozen eggs, two whole chickens, and 5 kilograms of fish every day — all while training for two hours, three times a day.\n\nIt wasn't his first ship pull. Six years ago, he tried for two hours before he managed to pull a 4000-ton ship in the water, a rope strapped to his shoulders, for about 30 metres. The event was caught on video.\n\n″I grunted and yelled as I pulled the ship, and I spoke to it, saying ‘It’s either me or you today,’\" he told The Associated Press recently at his local gym in Cairo, where he trains daily.\n\nMahrous believes that speaking with the object he pulls beforehand helps him establish a connection and is key to his success. “It’s important for me to treat the object that I will pull as part of my body that moves along with my heart beat,” he said.\n\nAn extraordinary child\n\nMahrous, 190 centimetres tall and weighing 155 kilograms, said his strength emerged early.\n\nAs a child, he would carry his friends for fun and haul heavy loads, several gas cylinders at once on a wheelbarrow. He was nine when his father lost his job as a contractor in Iraq and after that, Mahrous began knocking on doors, offering to lift heavy items for some cash.\n\nOnce, he accidentally broke a friend’s arm when he tried to pull him as they played. He helped people move bricks, sandbags and other heavy materials — and he was fast. He loved sports and trained in kung fu, kickboxing and even established a wrestling team in Cairo.\n\nIt was only when his friends saw him easily flip giant tires 10 times in a row in a deserted courtyard at their gym and push a car using only a finger that they encouraged him to go for a world record.\n\n“I was inspired by people who broke records and felt like they are no better than me,” he said. Now he's less fearful of injuries and more concerned about failing to accomplish a pull.\n\nMahrous was supported by a crowd of people on the shores of the Red Sea. (AP)\n\nPast recognitions\n\nIn March, he was formally recognised by Guinness World Records for the heaviest rail pull: He pulled a train weighing 279 tons with a rope held by his teeth for a distance of nearly 10 metres. At the time, he received two other certificates, for the heaviest locomotive pull and for the fastest 100-metre road vehicle pull.\n\nMahrous, who is also president of the Egyptian Federation for Professional Wrestlers, was previously recognised by Guinness in June 2021, for pulling a 15,730-kilogram truck with his teeth. And in February 2024, the international franchise recognised him for cracking and eating 11 raw eggs in 30 seconds.\n\nHe wears a mouthguard during pulling events but says he has no concerns about his teeth. Instead of going to a dentist, he uses a miswak — a traditional teeth-cleaning twig rich in anti-bacterial compounds that help prevent decay.\n\nHe says he takes no supplements but eats, sleeps and works out at least twice every day.\n\nHis ambitions are far from over. Next, he plans to send a request to the Egyptian presidency for permission to pull a 263,000-ton submarine.\n\nHe also hopes someday to pull a plane using only his eyelid muscles.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/rory-mcilroy-defends-wife-erica-ryder-cup-abuse/105829570",
        "title": "McIlroy defends wife after 'astonishing' abuse from US Ryder Cup fans",
        "publish_date": "Mon, 29 Sep 2025 01:34:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "The victorious European Ryder Cup team has called out the behaviour of American fans at Bethpage after three days of unsavoury scenes from within the gallery.\n\nEurope stalwart Rory McIlroy was on the receiving end of the lion's share of the abuse, and the low point of the weekend came when a beer projected from the crowd struck McIlroy's wife, Erica.\n\nAn MC hired by the PGA of America was also stood down after leading a \"f*** you, Rory\" chant before the second morning of competition.\n\nShane Lowry, who played alongside McIlroy, said Erica was a constant target of American abuse.\n\n\"I was out there for two days with Erica McIlroy, and the amount of abuse that she received was astonishing,\" Lowry said.\n\n\"The way she was out there supporting her husband and supporting her team was unbelievable, and kudos to her for that.\"\n\nTeam Europe and their partners celebrate Ryder Cup victory. (Getty Images: Harry How)\n\nAn emotional McIlroy stood up for his wife and decried the abuse they both received in New York.\n\n\"Erica is fine. She is a very, very strong woman. She handled everything with class and poise and dignity like she always has.\n\n\"I love her, and we're going to have a good time celebrating tonight.\n\n\"I don't think we should ever accept that in golf. I think golf should be held to a higher standard than what was seen out there this week.\n\n\"We will be making sure to say to our fans in Ireland in 2027 that what happened here is not acceptable.\"\n\nLuke Donald, the captain of the European team, praised his team for overcoming a \"nasty\" atmosphere.\n\nRory McIlroy celebrates victory with Shane Lowry. (Getty Images: Carl Recine)\n\nMcIlroy also said he thought the heavy police and security presence on the second afternoon was \"insane\" and believed the poor behaviour was isolated to a minority in the crowd.\n\n\"There was a lot of language that was unacceptable and abusive behaviour, but it's a minority of the crowd.\n\n\"The majority of people here are true golf fans and are respectful, and let both teams have the same chance to hit the shots and have a fair contest.\n\n\"But there was a small subset of people that behaved a little bit differently than that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/task-eternal-space-exhibition-to-launch-powerhouse-parramatta/105829116",
        "title": "New Sydney museum to reach for the stars with opening exhibition",
        "publish_date": "Mon, 29 Sep 2025 01:33:06 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The new Powerhouse Parramatta will open with the largest exhibition space in the country, with a focus on humanity's mission into outer space.\n\nCutting edge technology, spaceship parts and the history of space exploration will feature in the two-year exhibition at the new western Sydney museum.\n\nThe exhibition, dubbed Task Eternal, will be housed in an 18-metre high space over 2,200 square metres in which visitors will ascend through four sections.\n\nThe Powerhouse Museum in Parramatta will open in late 2026. (ABC News: Anton Rose, Monish Nand)\n\nPowerhouse CEO Lisa Havilah says the exhibition will feature elements of science, technology and creativity.\n\n\"Task Eternal is an exhibition about our human ambition to get into the sky,\" Ms Havilah told 702 ABC Radio Sydney.\n\n\" You'll move through the exhibition, but you'll also move through and up and around a tower and experience stories and objects and artworks along the way. \"\n\nA prototype of the Roo-ver will feature in Task Eternal. (Supplied: Powerhouse)\n\nAmong the displays will be Australian astronaut Katherine Bennell-Pegg's spacesuit — the first time it will be available to the public.\n\nIt will also include a prototype of the Roo-ver lunar probe which is being developed for a mission to the moon with the Australian Space Agency at the end of the decade.\n\nSome of the creative displays include artworks from First Nations and international artists interpretations of the dimensions of space.\n\nArtistic displays will include a Torlap Larpjaroensook kinetic sculpture based on the Voyager 1 space probe. (Supplied: Anna May Kirk)\n\nMuseum to open with 5 exhibitions\n\nThe space exhibition will be one of five exhibitions at the Parramatta site when it opens in late 2026.\n\n\"We don't have a date as yet, but it'll be in that very end of next year,\" Ms Havilah said.\n\nMs Havilah told 702 ABC Radio Sydney that all the exhibitions at Powerhouse Parramatta will be temporary.\n\n\"Some will go for a year, some will go for two years, but there'll always be new exhibitions and new stories,\" Ms Havilah said.\n\n\"We'll open with five major exhibitions and so we're just announcing the first one today, which is really exciting, and so over the next year we'll share the other projects and exhibitions that are coming up.\"\n\nTask Eternal will be one of five opening exhibitions, Powerhouse Museum CEO Liz Havilah told 702 ABC Radio Sydney. (ABC News: Sean Tarek Goodwin)\n\nPowerhouse, Australia's flagship science and technology museum, has not had a museum open since it closed its Ultimo premises for major renovations in February 2024.\n\nThe Ultimo museum is expected to reopen to the public in 2027.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/daniel-sanders-wins-world-championship/105829266",
        "title": "Aussie Sanders secures world championship with another victory",
        "publish_date": "Mon, 29 Sep 2025 01:24:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian off-road motorcycle racing star Daniel Sanders has secured the Rally-Raid World Championship with another race win, this time in Portugal.\n\nSanders took victory — and the world championship — at the 2,400km Rally-Raid Portugal on Sunday.\n\nIt was the 31-year-old's fourth straight win this year, and extends an unbeaten streak that stretches back to 2024 — including his dominant win at January's Dakar Rally.\n\nWith his latest victory, Sanders now has enough points to head into the season's final round in Morocco with an insurmountable advantage over his rivals.\n\nIt is his first world title, as well as KTM's first in the World Rally-Raid Championship.\n\n\"It's a dream you think about when you're a kid,\" Sanders said after crossing the finish line.\n\nDaniel Sanders (left) celebrates victory in Portugal with his KTM team. (Supplied: KTM)\n\nUnprecedented dominance\n\nSanders' season has been almost without blemish, save the occasional navigation issues inherent in the off-road category, on his way to becoming world champion.\n\nRally-raid is a mixed-vehicle category which combines motorcycles, specialist off-road cars and quad-bikes.\n\nRaces take place over multiple days, with one section, or \"stage\", each day.\n\nSanders' Dakar Rally win in January propelled him to international fame, and foreshadowed a 2025 season in which he has literally left his rivals in his dust.\n\nHis results are now unmatched in the championship's four-year history: he has set records for total race wins (five) and stage wins (23), as well as the most race wins in a year (four) and stage wins in a year (15).\n\nHeading to Portugal, Sanders and his team knew a top-three finish would be enough to secure the title.\n\nBut the Australian never appeared interested in playing it safe.\n\nDaniel Sanders splashes through a water hazard on his way to victory in Portugal. (Supplied: KTM)\n\nMore silverware in Portugal\n\nFrom the outset, Sanders reminded his rivals why he was the runaway championship leader.\n\nOn his number-four pumpkin-orange dirt bike, the Australian was quickest on four days — cutting a blistering pace through dusty tracks which caught out two experienced rivals.\n\nRacers navigated unpredictable and evolving sand tracks, over rolling hills, bush and open plains — even briefly crossing into neighbouring Spain.\n\nFor Sanders, whose unshakable grin has symbolised just how much he's enjoyed 2025, there were once again no major issues.\n\nThe Australian crossed the finish line more than three minutes ahead of his closest rival, extending his record-breaking run.\n\n\"It's very rare to have this sort of consistency in rally,\" Sanders said.\n\n\"I'm happy to get the world championship here in Portugal and, hopefully, there's a lot more to come.\"\n\nDaniel Sanders rides through a dusty section of track in Portugal. (Supplied: KTM)\n\nFamily watched closely from home in Victoria\n\nOn the family's orchard in the sparsely populated farming locale of Three Bridges, a short drive from Melbourne, the world championship is the reward for years of dedication.\n\nMum Pauline and dad Peter followed their son's progress online.\n\nPauline said her son called through shortly after the finish to share the good news, and to get updates on the farm.\n\n\"I keep seeing these things on social media: world champion,\" she said.\n\n\"I couldn't be happier.\"\n\nSanders next competes in the Rallye du Maroc from October 10, before returning to Australia with the champion's trophy.\n\n\"He'll have a little bit of extra luggage, which will be nice,\" Pauline said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/pogacar-pedals-to-another-epic-world-cycling-title/105829612",
        "title": "Pogačar pedals to another epic world cycling title",
        "publish_date": "Mon, 29 Sep 2025 01:15:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tadej Pogačar has achieved another phenomenal and historic world road race championship triumph, defending his rainbow jersey in Rwanda with a now trademark epic solo ride.\n\nThe great Slovenian attacked with 104 kilometres left on Mount Kigali on Sunday, local time, and went it alone 66km from home to destroy the field and become the first man to complete the world championship-Tour de France double in successive years.\n\nWith a tour de force that again raises the question of whether he might just be the greatest cyclist of all time, Pogačar had 1 minute 28 seconds to spare over Olympic champion Remco Evenepoel at the end of the 267.7km slog around Kigali, which featured a merciless 5,475m of climbing.\n\nEvenepoel added silver to the gold he had won in the time trial the previous weekend, and was left musing with frustration on how he might have gotten so much closer to Pogačar if he hadn't lost crucial time because of two bike changes.\n\nIreland's Ben Healy took the bronze medal, 2:16 behind Pogačar, to become the first Irishman on the podium since Sean Kelly in 1989.\n\nPogačar's victory was truly extraordinary on a day so tough that only 30 riders among the 165-strong field managed to complete the course in hot, stifling conditions, including two battling Australians — Jai Hindley, who was 16th at 10:01 behind Pogačar, and Michael Storer, who was 19th at 10:12.\n\nPogačar broke Evenepoel and the rest of the field on the Mount Kigali ascent, taking only Spain's Juan Ayuso and Mexico's Isaac del Toro — his two teammates at UAE Team Emirates-XRG — with him, but not for long until he finally decided he must cast del Toro adrift.\n\n\"Juan had a problem quite soon, and Isaac had some stomach problems, and I was left alone quite early, but I'm so happy I made it,\" said Pogačar, who'd won last year's race in Zurich with a similar assault but had flagged in the later stages.\n\nNot this year, though, even if he admitted: \"It was getting harder every lap, so the energy resources were running out near the end. You doubt a bit, but you have to push through and do your best.\"\n\nCheered on by thousands thronging the streets of Rwanda's capital in a ride befitting the first championships staged in Africa, Pogačar, who made light of the cobbled climb 15 times on the city circuit, even had time to smile on the victory lap, hailing his 6 hours 20 minutes in the saddle as an \"extraordinary experience\".\n\nHindley was at one point looking strong in a five-man chase group headed by Evenepoel that raised hopes he might emulate Ben O'Connor, Australia's silver medallist last year.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nEventually, though, the relentless climbing took its toll, leaving even one all-time great Primož Roglič, who finished 11th, admitting if felt like \"torture\".\n\nOnly a week ago, Pogačar's failure to finish among the medals in the time trial had raised questions about his readiness, but once again, the amazing 27-year-old had the perfect answer as he became the first rider since Juan Alaphilippe in 2020 and 2021 to successfully defend the title.\n\nIt capped another amazing year for Pogačar, who claimed a fourth Tour de France crown in July, and added spring classics triumphs at Strade Bianche, the Tour of Flanders, La Fleche Wallonne and Liege–Bastogne–Liege.\n\nHe'll have another Monument in his sights at the Tour of Lombardy next month, with his illustrious Slovenian teammate Roglič left marvelling: \"He's incredible — chapeau to him.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/volunteering-to-test-a-career-change/105788520",
        "title": "Changing careers can be scary but volunteering can make it easier",
        "publish_date": "Mon, 29 Sep 2025 01:03:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Anita Lussetti's parents were dying, the family was supported by volunteers at Mercy Palliative Care.\n\nThe IT worker, then in her 40s, took six months off from her job to care for her parents, and was considering a career change at the same time.\n\n\"I decided that I needed something that gave me more purpose,\" she says.\n\nShe began volunteering with Uniting Care, visiting socially isolated people, and decided to enrol in a degree in counselling.\n\n\"The volunteering just assured me that I was on the right path doing the right things,\" she says.\n\nAnita was working in IT for a bank before she started volunteering to try out a career change. (Supplied)\n\nAnita now works as a trauma counsellor and hasn't looked back.\n\n\"I'm in the best job of my life,\" she says.\n\nWhy volunteer\n\nIn Australia, an estimated 5 million people volunteer for various reasons.\n\nA survey of employers found that 85 per cent valued volunteering as work experience when hiring.\n\nVolunteering Australia CEO Mark Pearce says it can help build connections and help get a foot in the door in industries you may be new to.\n\n\" It provides the opportunity for people to develop skills, to build networks, to gain experience. \"\n\nVolunteering can include many different activities, such as working in kitchens. (ABC News: Rachael Lucas)\n\nRachel Hannam, a psychologist specialising in career counselling, says it can be a great way to get into a role, or get a better view of an industry or organisation.\n\n\"I've certainly sent clients to volunteering and they've found plenty of organisations which love having volunteers and it's often been a stepping stone for them, either psychologically or materially because they've ended up with paid work,\" she says.\n\n\"It's what we call a realistic job preview. So you give yourself a preview of what it might be like to work in a particular industry or organisation,\" Dr Hannam says.\n\nMr Pearce says it can be a beneficial stepping stone for a number of different industries.\n\n\"We've certainly seen it a lot in industries like health and aged care, things to do with environment and animal welfare and also with organisations and industries involved in things like disaster recovery preparedness and relief.\n\n\"People will often get involved with the SES, which does a remarkable job in communities, they love it, they build experience, they become conversant with the language of the organisation and the sector, and then they may well look to gain employment in that sector.\"\n\nAn SES volunteer helping out after ex-Tropical Cyclone Jasper tore through Cairns. ( ABC News: Michael Lloyd )\n\nVolunteering is not just free labour\n\nWhile valuable for experience, it's important to note that volunteering is not just free labour.\n\nVolunteering Australia notes that the definition of volunteering is, \"time willingly given for the common good and without financial gain.\"\n\n\"This is a really important definition,\" Mr Pearce says.\n\nVolunteering is distinct from unpaid internships or work experience.\n\nVolunteering shouldn’t be a sacrifice, but an expression of belonging Australia can no longer afford to treat volunteering as a nostalgic value. It is a priority that must evolve with the society it’s meant to serve. But guilt won’t fix the current volunteer shortfall.\n\nMr Pearce says volunteering has positive impacts on community, and can include animal welfare, arts, heritage, business, unions, emergency services, health, religion, law and welfare.\n\n\"It's time willingly given for the common good. And this speaks for things like, for example, causes and others.\"\n\nDispersing the fantasy\n\nVolunteering can also help you understand how suitable an organisation is for you and how aligned it is with your values.\n\nSometimes, it can remove a misconception about a job.\n\nHas volunteering helped you with a career change or decision? Share with us here.\n\nDr Hannam says she's had clients who volunteered at an animal rescue and chose not to pursue it.\n\n\"It could have been other people, or it could have been the work was really not what they thought — [for example] It was monotonous and boring.\n\n\" Sometimes we have this idealised and fantasy idea of volunteering and working in this kind of an organisation, and so often in life, our fantasies are blown up by reality. \"\n\nDr Hannam herself had a \"fantasy\" of working as a school teacher.\n\n\"I remember I wanted to be a primary school teacher, had a fantasy of it, idealised the idea of being this awesome school teacher and I actually became a teacher — and it was a shock to the system of how different in reality it was to my fantasy,\" she says.\n\nSome people have volunteered with the SES and it has led to paid work. (Supplied: NSW SES )\n\nIf volunteering doesn't feel like an option\n\nVolunteering may not be suitable for a number of reasons. If you're time-poor, or the locations don't work, or the type of job you want to move into simply doesn't facilitate voluntary work.\n\nThe benefits of having a mundane job Photo shows woman laying on table looking bored at work Meg has never had a \"dream job\" and says mundane works brings her financial security, peace, and flexibility.\n\nDr Hannam says there are still ways you can get a feel for an industry.\n\n\"Go talk to people,\" she says, recommending people connect with industry insiders, get to know the ins and outs, the frustrations of the job and read job descriptions.\n\nSocial media can be a helpful way to do this.\n\nMr Pearce makes the point that volunteering doesn't have to be a large time commitment.\n\n\"As the name suggests, it's voluntary. We're seeing that, because people are far more time-poor, community expectations have changed quite a bit. People are becoming more willing to say: 'I only have 2 hours in a week or maybe 1 hour every fortnight, but I really want to contribute.'\"\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\nAnd if you do sign up to a volunteering position and feel it's not for you, there's no obligation to continue.\n\n\"There's no employment contract. So as a consequence of that, people can volunteer as and when it suits them,\" says Mr Pearce.\n\nAnd whether it's the right fit or not, no decision is \"wrong\", says Dr Hannam.\n\n\" We have to just remember that no decision is wrong. In the end, being a teacher led me back to psychology and different decisions will lead you somewhere and no path is right or wrong. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/nrl-grand-final-broncos-storm-walsh-munster-clash/105828434",
        "title": "The clash of furious styles that will define the 2025 NRL grand final",
        "publish_date": "Sun, 28 Sep 2025 23:51:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "A premiership isn't supposed to be perfect, and that's the entire point for both Melbourne and Brisbane ahead of Sunday's NRL grand final.\n\nThe two teams approach the decider from opposite directions. The Storm aspire to perfection, and under Craig Bellamy, they always have.\n\nThere must be some part of them that knows they can never get there, but as they gear up for their 11th grand final under their legendary mentor, they also know the chase of it is a trick they play on themselves.\n\nThe pursuit of that perfection is what has made Melbourne strong, fast, and smart, and why it knows exactly what percentages to play and how to play them.\n\nThe Storm continues to be a force despite years of being consistently being in contention. (AAP: Joel Carrett)\n\nIt's what has made the Storm the team of the new century for so long that the century isn't all that new anymore.\n\nBut it's also a lie that drives them towards a higher truth and the foundation on which the real winning is done, as proven by their preliminary final win over Cronulla.\n\nA perfect team would not play Jahrome Hughes with an arm held together by prayers and good intentions, and a perfect team would not trust him to play his normal game in such a big spot, or score a 30-metre solo try right through the heart of the Sharks' defence, because a perfect team cannot trust to something as human as courage.\n\nA perfect team would not have Cameron Munster dink a little kick over the top for Ryan Papenhuyzen from the middle of the field, in an attacking position with tackles up their sleeve, because the percentages say to just tighten the grip.\n\nNor would they want Harry Grant to run it from dummy half on his own side of halfway on the last with eight points in the game and five minutes on the clock, because a perfect team could not allow instinct or feeling or spirit into its operating system.\n\nWhen Melbourne threw perfection away on Friday night, it found tries because, to a man, the Storm has all the benefits of a classic football education while knowing that sometimes a masterpiece has to go outside the lines.\n\nBrisbane, by contrast, lives so far outside the lines it can't even see them. They could never be perfect because they are too wild, too emotional, too caught in the rapture of the big moments and victories they crave so badly.\n\nThat's why they fell behind by 18 points against Canberra in week one, and 14 points against Penrith, and it's also why they were able to win both times and move to the brink of a premiership.\n\nIt's not that coach Michael Maguire makes them that way. After all, he came up under Bellamy at the Storm, and you could fill tomes with what's been written about the work ethic he demands of his players and himself.\n\nHe has put the steel into them, and helped them find a rare resilience, but nobody could build a team like this totally on purpose.\n\nBroncos end Penrith dynasty in NRL finals thriller Photo shows Broncos celebrate Deine Mariner's last-gasp try against Penrith. Adam Reynolds nails a sideline conversion with three minutes left to send the Broncos into the NRL grand final and end Penrith's dynasty with a 16-14 win at Lang Park.\n\nYou cannot teach what Brisbane has got, and you cannot learn the lessons it has found in the depths of its soul in its last two matches as it stared down big deficits and shortening time.\n\nThey came out of the grave, but neither of the wins was a resurrection because, although the Broncos had been buried alive and even though it was partially of their own doing, they weren't dead.\n\nComing back against the Raiders was one thing, but coming back against Penrith — the patron saints for the age of optimisation, who had gone 98 games without defeat since the start of 2020 in matches where it led by 12 points or more — is near a miracle.\n\nIn the first half, the Broncos were up for the fight physically but seemed loose and a little scattered, and in front of a Lang Park crowd that howled like a beast, they wanted it almost too badly.\n\nThe returning Adam Reynolds could not link with Reece Walsh, and nor could Ezra Mam when he came on the field.\n\nWalsh grabs the Sun to light up Brisbane's season Photo shows A man celebrates after winning a rugby league match Brisbane and Canberra went to the great beyond in their golden point finals match and it was Reece Walsh who led the Broncos to the promised land.\n\nChances were missed and Penrith turned the screws, but, for the first time in age, they were not tight enough, and by the end, we entered a realm beyond what we normally know.\n\nWalsh, who wears stardom so easily he seems born to it and for whom no moment is ever too large, had the bravery to throw a no-look offload to Deine Mariner for the equalising try, and the sense to give the ball to Reynolds for the decisive conversion.\n\nPayne Haas, who defied belief in playing 80 minutes in the middle of the field and proved yet again he's one of a kind, found something late to put the pressure on Nathan Cleary and stop a potential two-point field goal.\n\nEver since their loss in the 2023 grand final and through large swathes of this season, the Broncos have not always found it easy to be a good team, but when it has really mattered, they have found a way to be a great one.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWith all that in mind, Sunday shapes as the ultimate clash of not just styles, but ways to live.\n\nOne team is trusting a way that has led to success since before some of them were born, the other is running on faith that the path will continue to appear before them as they race into a future they cannot fully see.\n\nThe Victorians look to their heads before their hearts, and the Queenslanders are the other way round, only for both of them to wind up in the same place with what seems like an equal chance at the ultimate prize.\n\nNeither team is perfect. Neither team would want to be, and you don't need to be to take the trophy home.\n\nBecoming who they are is what has brought them here and what they will trust to take them the rest of the way to paradise.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/canine-ehrlichiosis-endemic-spreads-across-northern-australia/105814976",
        "title": "Deadly tick-borne dog disease here to stay, warns vet",
        "publish_date": "Sun, 28 Sep 2025 23:25:05 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A potentially deadly tick-borne disease that attacks a dog's immune system is now \"endemic\" across northern Australia.\n\nThe rapid spread of canine ehrlichiosis since it was first detected in Australia in 2020 \"has left a lot of destruction in its wake\", veterinarian Liisa Ahlstrom said.\n\n\"It's endemic, which means we're never getting rid of it,\" Dr Ahlstrom said.\n\n\"A lot of dogs have died from this disease … it's well and truly established across northern Australia.\"\n\nEhrlichiosis is transmitted by infected brown dog ticks. (Supplied: AMRRIC)\n\nDeceptive symptoms\n\nEhrlichiosis is a bacterial disease transmitted quickly when an infected brown dog tick bites a dog.\n\nThe disease presents in three phases, and Dr Ahlstrom said in the first stage symptoms could appear around two weeks after infection.\n\nCloudy eyes is one of the symptoms of ehrlichiosis. (Supplied: Gillian Tenni)\n\nSymptoms include fever, cloudy eyes, lethargy, enlarged lymph nodes, bleeding from the nose, under-skin bleeding and rapid weight loss.\n\n\"Some dogs will die in this early stage, but most dogs will recover and appear to be well,\" she said.\n\nThe second phase, where visible symptoms disappear, could be deceptive, according to Dr Ahlstrom.\n\nShe said, although the dog may appear to have recovered, the bacteria would have entered its bone marrow.\n\n\"You enter this subclinical phase, then months later — or even years later — they'll get really sick again,\" she said.\n\nBy the third and terminal phase, she said most dogs would die, even with treatment.\n\n\"They bleed uncontrollably because they're not making blood cells anymore and can't clot their blood,\" Dr Ahlstrom said.\n\nPet owners in northern Australia are being urged to take preventative action. (Supplied: Gillian Tenni)\n\nOnce a dog has been infected, treatment in the form of rigorous antibiotics is available but it needs to be administered as early as possible.\n\n\"If you suspect your dog's a little bit unwell, talk to your vet straight away because they're going to have a much better chance of survival if diagnosed early,\" Dr Ahlstrom said.\n\nMisconceptions around prevention\n\nVeterinarian Dr Ally Reid owns a practice in Cloncurry, in north-west Queensland.\n\nThe outback vet said she had treated up to a dozen cases in the past year, an increase from the year before.\n\n\"We're getting dogs from further out in the Gulf, where those sorts of things aren't monitored as well,\" she said.\n\nDr Ally Reid has seen an increase in cases among dogs in north-west Queensland. (Supplied: Ally Reid)\n\nWith no available vaccine, Dr Reid said prevention was vital.\n\n\"If you're getting ticks attached and biting, then you've got the risk that's already spreading the disease, so your repellents are a much more effective way to stop that spread from occurring,\" she said.\n\nBecause transmission from the brown dog tick happens quickly, Dr Reid recommended using a preventative collar in combination with oral tick medication.\n\nDr Gillian Tenni works 120 kilometres west, in Mount Isa, and said she had seen around 30 cases in the past year.\n\n\"I feel a lot of dogs may be infected with the disease without the owner realising,\" she said.\n\n\"The best prevention is something that will kill and repel the tick before it bites and transmits the disease.\"\n\nVets say a repellent collar is necessary to protect dogs from the brown dog tick. (ABC North Queensland: Mia Knight)\n\n'Well-suited to Australia'\n\nBrown dog ticks can be found in backyards, under buildings, inside homes and in the bush.\n\n\"This is a tick that loves warm weather and it can withstand drought and floods,\" Dr Ahlstrom said.\n\n\"[It's] a tick that is so well-suited to Australia.\"\n\nIt is not known how ehrlichiosis entered Australia but it was first detected in Western Australia in 2020 and north Queensland in 2022. It is now also present in the Northern Territory and South Australia.\n\nBrown dog ticks live in areas north of the dotted line. (Supplied: Biosecurity Tasmania)\n\nWhen the disease first arrived in Australia it was notifiable, so if a vet suspected that a dog had ehrlichiosis they had to report it, meaning initial case numbers were tracked.\n\n\"It was still very much kind of the tip of the iceberg because of the regions where the disease is most prevalent,\" Dr Ahlstrom said.\n\nNow at endemic status, ehrlichiosis does not have to be reported.\n\n\"There's really no way of knowing the prevalence,\" Dr Ahlstrom said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/emergency-relief-centres-stripped-of-federal-funding-food-cost/105800534",
        "title": "Blow for struggling families as food relief centres lose funding",
        "publish_date": "Sun, 28 Sep 2025 22:48:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Emergency relief centres across Victoria are facing a financial crisis as the federal government plans to slash their funding at the end of this month.\n\nAmong the hardest hit will be Horsham's Christian Emergency Food Centre, in western Victoria, which has fed those in need across the Wimmera since 1998.\n\n\"People can come to us, just walk in and say what they need, and they can walk out with packed boxes of food so that they can eat straight away,\" client assessment manager Bev Miatke said.\n\nFrom next month, the service will no longer have funding under the federal government's Financial Wellbeing and Capability Activity grant.\n\n\n\n\n\nBev Miatke packs food boxes for clients at the Horsham Christian Emergency Food Centre. (ABC Mildura-Swan Hill: Peter Quattrocelli) The grant was a five-year contract, which means the relief centres must wait until at least 2030 to reapply.\n\nMs Miatke said her organisation had been given \"no explanation\" as to why its grant application was unsuccessful.\n\n\"There's just so many sad cases out there, where if we hadn't intervened families and children wouldn't have got the help that they really needed, and it's just heartbreaking to think that we wouldn't be able to do that help in the future.\"\n\nFeeding the needy for almost 30 years\n\nThe food centre received about $80,000 in previous years from the Commonwealth grant.\n\nMs Miatke said that money translated into about $500,000 worth of benefits to clients when it was coupled with donations from local businesses and residents. Last year, about 3,000 people came to the centre.\n\nShe said the service would not be able to survive on donations alone.\n\n\n\n\n\nChristian Emergency Food Centre in Horsham will lose its federal government funding at the end of this month. (ABC Mildura-Swan Hill: Ed Gannon) \"A lot of the financial assistance that we also give to clients, which is medical prescriptions, help with getting fuel for getting to medical appointments, some help with utility bills. That's going to gradually go down and down and down until there may not be any help there,\" Ms Miatke said.\n\nIn a statement, the Department of Social Services said funding for food relief had doubled, while funding for emergency relief had increased across Australia.\n\nThe department said people seeking emergency relief support could contact one of the five providers that deliver services in north-west Victoria, which included those in Ararat and Mildura.\n\nBut Ms Miatke said those services were simply too far away.\n\n\"If they haven't got money to put food on the table for themselves and their children, how are they going to afford fuel to even do the one hour [trip] to Ararat … and then an hour drive home again, or the four hours to the only other organisation that was funded, which is in Mildura.\"\n\nVolunteers helping out at the Horsham Christian Emergency Food Centre. (ABC Mildura-Swan Hill: Peter Quattrocelli)\n\nUniting merger\n\nUniting Vic.Tas said it would close or merge eight of its services in Bendigo, Blackburn, Broadmeadows, Epping, Footscray, Geelong, Ringwood and St Albans.\n\nIt has also had to cut funding to the volunteer-led Stawell Inter Church Council Cottage in western Victoria, which received nearly $50,000 from Uniting Vic.Tas last financial year.\n\n\"From the end of this month, we will have no government funding for those who are in need in Stawell,\" church council spokeswoman Mary Rita Thomas said.\n\n\"This must be a mistake. We've had no warning. We've had no notification.\"\n\nMary Rita Thomas believes the funding cut must have been \"a mistake\". (Supplied: Mary Rita Thomas)\n\nLast financial year, the centre helped 292 households with 661 people, 22 per cent of whom were aged under 17.\n\nOne third of the people the centre helped live with a disability.\n\n\"We're being there in a very humble way, but we will have to do that with less [without the funding],\" Ms Thomas said.\n\nLouise Netherway says Uniting Vic.Tas will merge or close eight services in Victoria. (Supplied: Uniting Vic.Tas)\n\n\" [This] will mean that children will be going to bed hungry, people with disabilities will be in all sorts of strife, parents whose children are suddenly terribly ill will be running backwards and forwards to doctors and going out of town. \"\n\nUniting Vic.Tas senior manager for the Wimmera Louise Netherway said the local model of delivering help to those in need was working.\n\n\"Due to this funding change, it's causing some disruptions for us now as we adjust and try and rethink how we're going to deliver that emergency relief across the region,\" she said.\n\n\"We understand the government has provided funding for emergency relief to other not-for-profit organisations; however, we are disappointed that Uniting has missed out in this instance.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/ryder-cup-golf-beer-thrown-at-rory-and-erica-mcilroy/105829272",
        "title": "Ugly scenes mar Ryder Cup as beer almost hits McIlroy during Europe's win",
        "publish_date": "Sun, 28 Sep 2025 22:39:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ugly scenes broke out at golf's Ryder Cup in the United States after a beer was launched from the crowd, almost hitting Northern Ireland's Rory McIlroy and his wife, Erica.\n\nEurope dominated at the New York course to retain the trophy, having claimed victory 13 out of 19 times since 1979.\n\nBut a tense and often unruly atmosphere came to a head on the weekend, when a cup of beer almost struck the European star and his partner.\n\nThe incident occurred after the second day of competition, after McIlroy and Shane Lowry had defeated Americans Justin Thomas and Cam Young in the four-balls.\n\nFootage shows McIlroy turning back to the crowd to remonstrate after the incident.\n\nA second angle of the incident appears to show that the beer was being held by one fan in the air, before another fan slapped it out of his hand towards the couple.\n\nEarlier on Sunday, a Ryder Cup MC employed to warm up the American crowd stepped down from her role and apologised after leading an offensive chant aimed at McIlroy.\n\nComedian Heather McMahan joined in with the crowd on the first tee yesterday as they chanted \"f*** you, Rory!\" at Europe's star player.\n\nHer chant rang out over the public address system and was caught on recordings.\n\nThe PGA of America said in a statement that McMahan had apologised.\n\n\"Heather has extended an apology to Rory McIlroy and Ryder Cup Europe and has stepped down from hosting the first tee of the Ryder Cup,\" it said.\n\nEuropean captain Luke Donald accused American fans of \"crossing the line\" after his players were subjected to heckling, with comments repeatedly aimed at McIlroy as he prepared to play shots.\n\nFans were fired up from day one after a visit from president Donald Trump, who watched on from behind bullet proof glass after rallying the crowd.\n\nEurope dominates again to claim Ryder Cup\n\nMeanwhile, the Americans were left searching for answers in what is becoming a lopsided series.\n\nThe Americans at least showed a pulse on the final day and made Europe sweat, storming back from the largest last day deficit ever against Europe with real hope.\n\nShane Lowry, who contended with the unruly New York crowds all week, had the last word. He birdied three of the last four holes, and his final putt will be part of Ryder Cup lore for Europe.\n\nShane Lowry sank the crucial putt which saw Europe retain the Ryder Cup. (Getty Images: Vaughn Ridley)\n\nRussell Henley had a 1-up lead, but his 10-foot birdie putt on the 18th to win the match was short.\n\nLowry holed his 6-foot birdie to halve the match, giving Europe the 14 points it needed to retain the cup as the defending champion. Three matches remained on the course.\n\nLowry said to his caddie walking up the 18th, \"I have a chance to do the coolest thing in my life.\"\n\nAnd he did just that.\n\nTeam Europe celebrate with the Ryder Cup after winning on American soil. (Getty Images: Jared C Tilton)\n\nEurope now has captured the cup 13 out of 19 times since 1979, the start of the modern era, and now has won five of the last 10 Ryder Cups on US soil.\n\nEurope's best players starred at Bethpage Black even as New York fans hurled abuse, building a record seven-point lead going into the 12 singles matches.\n\nEurope put a half-point on the board before a shot was hit. Viktor Hovland, who had a summer neck injury flare up on Saturday, was forced to withdraw. Harris English, whose name had been put in the secret envelope, also sat out and the match was declared halved.\n\nThe Americans had to win nine of the 11 matches and halve another and they put up an astonishing fight, finally hearing cheers for the US instead of only vitriol toward Europe.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/asia-cup-cricket-final-india-downs-pakistan-two-balls-to-spare/105829144",
        "title": "Farcical scenes as India lifts 'invisible trophy' after Asia Cup victory",
        "publish_date": "Sun, 28 Sep 2025 21:59:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "India has held its nerve in the last over to win cricket's Asia Cup for the ninth time with a five-wicket victory over arch-rival Pakistan with only two balls remaining.\n\nBut a reported refusal to claim the trophy after the match led to farcical scenes, as Indian players pretended to lift an invisible cup and then showed their empty hands to fans to mimic holding the award.\n\nReports suggested India did not want to accept the trophy from Pakistan Cricket Board chief and head of Asian Cricket Council Mohsin Naqvi.\n\nSuryakumar Yadav (right) pretends to carry the trophy to the Indian team. (Getty Images: Surjeet Yadav/MB Media)\n\n\"I have been informed by the ACC that the Indian cricket team will not be collecting their awards tonight,\" presenter Simon Doull said.\n\n\"So that does conclude the post-match presentation.\"\n\nTilak Varma scored 69 not out for India off 53 balls in Monday morning's (AEST) final, including a crucial six against Haris Rauf in the 20th over.\n\nRinku Singh hit the winning runs with a four — the only ball Singh faced in the entire tournament.\n\nPut into bat, Pakistan had earlier collapsed from 1-113 to 146 all out in 19.1 overs at Dubai International Cricket Stadium.\n\nThat looked like being enough after defending champion India's terrible start to its innings, dropping to 3-20 after four overs, including the prized wicket of Abhishek Sharma (5).\n\nPakistan's Faheem Ashraf celebrates after dismissing India's Abhishek Sharma. (Getty Images: Francois Nel)\n\nBut Varma and Shivam Dube (33) led the recovery as India reached 150-5 in 19.4 overs.\n\nVarma added 57 off 50 balls with Sanju Samson (24) but the game-changing partnership was between Varma and Dube (33 off 22 balls). The duo added 60 off 40 balls to snatch the game out of Pakistan's hands.\n\nIt was India's second Asia Cup victory after 2016, and ninth overall since 1984, across formats.\n\nThis was the first India-Pakistan final in Asia Cup history, which started in 1984. The two sides had already met twice earlier in this tournament — in group play and Super Four — both won comfortably by India.\n\nIndia's cricketers refused to shake hands with Pakistan after both those games and there were no handshakes at Sunday's toss or at the end of the game.\n\nCaptains Surya Kumar Yadhav and Salman Agha before the game. Players refused to shake hands throughout the final. (Getty Images: Surjeet Yadav/MB Media)\n\nIndia's chase got off to the worst possible start with a rare failure for aggressive opener Sharma. He was out caught for five off Faheem Ashraf.\n\nAshraf struck again to send back Shubman Gill for 12, while Shaheen Afridi got rid of skipper Suryakumar Yadav for just one.\n\nYadav's miserable tournament ended with a total of 72 runs, while Sharma finished as the top run-scorer — 314 runs in seven innings at an average of 44.85 and a strike rate of 200.\n\nBut India was in deep trouble at 3-36 in the power play. Varma and Samson calmly rebuilt the innings without taking unnecessary risks. Samson faced 21 deliveries and only hit one six.\n\nSamson was out in the 13th over, caught off spinner Abrar Ahmed, leaving India still needing another partnership.\n\nVarma and Dube met the challenge. Dube hit two sixes and two fours, while Varma reached 50 off 41 balls.\n\nTilak Varma celebrates victory after hitting the winning runs against Pakistan in the Asia Cup final. (Getty Images: Francois Nel)\n\nOverall, Varma hit three fours and four sixes. He stayed calm even when Dube was out in the penultimate over.\n\nRauf bowled the final over with India needing 10 more runs for victory, and Varma got eight of them off the first two balls — including his fourth six. Singh then finished off with two balls to spare.\n\nEarlier, Pakistan fumbled a great start and lost its last nine wickets for 33 runs in 39 deliveries.\n\nSahibzada Farhan (57 runs in 38 balls) and Fakhar Zaman (46 in 35) had given Pakistan a solid start at 0-84 but number three Saim Ayub (14) was the only other Pakistan batter to reach double figures. Farhan hit five fours and three sixes.\n\nFans were more receptive of each other than the players were, with Indians and Pakistanis mingling in the Dubai stadium. (Getty Images: Surjeet Yadav/MB Media)\n\nLeft-arm wrist spinner Kuldeep Yadav took 4-30 in four overs. Jasprit Bumrah, Varun Chakravarthy and Axar Patel claimed two wickets each.\n\nBumrah claimed the last wicket as Pakistan's innings ended in 19.1 overs.\n\nPakistan had enjoyed the power play — scoring 45 without loss — and was 87-1 at the halfway point.\n\nFarhan reached his 50 off 35 balls — his second of the tournament and also against India. Chakravarthy got the breakthrough as Farhan was caught in the deep in the 10th over. Even so, Pakistan was past 100 in 11.2 overs and looked set for a good score.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nKuldeep Yadav started the fightback in his second spell of two overs.\n\n\"They had a great start at like 100-1. But we knew if you get a couple quick wickets, new batters will find it tough to carry the momentum,\" the spinner said.\n\n\"I was bowling my final over and looking to get them out.\"\n\nHe broke the back of Pakistan's innings, dismissing Salman Agha (8), Shaheen Afridi (0) and Ashraf (0) as the lower-middle order wilted under pressure. The turning point had come when Zaman was caught out in the 15th over against Chakravarthy.\n\nThe Asia Cup has marked a resumption of cricket ties between India and Pakistan only months after the neighbouring countries were engaged in a tense border situation in May that disrupted the IPL and the Pakistan Super League.\n\nThere were no handshakes at the toss, where India skipper Suryakumar Yadav spoke with former India cricketer-turned-broadcaster Ravi Shastri and Pakistan captain Agha talked with former Pakistan cricketer-turned-broadcaster Waqar Younis.\n\nPakistan had named an unchanged team for the match while India all-rounder Hardik Pandya missed out owing to a niggle, replaced by Rinku Singh.\n\nBumrah and Shivam Dube returned for India, with Arshdeep Singh and Harshit Rana out.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/children-author-illustrator-pamela-allen-exhibition/105816018",
        "title": "Who Sank the Boat? Pamela Allen's stories come to life in this exhibit",
        "publish_date": "Sun, 28 Sep 2025 21:32:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "If you look closely enough, low to the ground, there are little creatures all over the State Library of New South Wales.\n\nThe rows of ducklings are a breadcrumb-trail invitation up the stately stairs and into an intriguing new exhibition that celebrates one of Australia and New Zealand's best-loved children's authors — Pamela Allen.\n\nFree and open until mid-2027, The Curious World of Pamela Allen is an Australian first, bringing the work of the beloved author-illustrator both off the page and out of the archives into a larger-than-life physical space.\n\nAged 91, Allen has published more than 60 picture books from 1980 to today — including eight illustrated for other authors — selling millions of copies. Thirty-one of her books are still in print, comprising generationally loved characters Mr McGee, Bertie and the Bear, Belinda, Alexander and the motley crew of animals who sank a boat.\n\nLoading...\n\nIt is the first time Allen has exhibited her illustrations, and a rare appearance of her work beyond the page or the theatrical stage.\n\nKeeping tight control of her designs over her career and maintaining integrity of Allen's work was paramount in achieving the interactive family exhibition.\n\n\"It's tasteful. They've done a very, very beautiful job. I'm very proud of it, because it's a great acclamation and celebration for me,\" Allen says.\n\nAn invitation to read and play\n\nIn the hallway leading into the exhibition, cut-outs of Allen's clouds, birds, umbrellas and characters float high above the heads of children.\n\nThe Curious World of Pamela Allen invites children — and adults — to enter the world of her books. (Supplied: Gene Ramirez)\n\nFrom the entry, Mr McGee's head looms large, a structure that is an immediate invitation to sit on the side of the brim of his hat and play on the other side, featuring a bounty of dress-up hats and a mirror.\n\nThe playful celebration of Allen's work continues with a slide through Mr McGee's tree, a giant digital book of Bertie and the Bear with pages turned by waving arms, and model characters to place in a little red boat, with waves projected on the floor.\n\nThe space is not just for children; original illustrations, drafts and letters from Allen's archive enlighten how books are made from draft to print.\n\nThere are surprises along the way, revealing changes of titles and characters, along with lesser-known and out-of-print works.\n\nPamela Allen's classic book Who Sank The Boat forms part of the new interactive display at the State Library of NSW. (Supplied: Gene Ramirez)\n\nCurator Sarah Morley, who has worked on Pamela Allen's archive since 2018, when she received a remarkable letter offering the acquisition, says integrating children's and adults' experiences within the space was intentional.\n\n\"We went into it with a very deliberate intention that it be for children and families. We've done picture book exhibitions before, but this one we wanted the design to be interactive and incorporate the original artworks as well,\" Morley says.\n\n\"My books are a triangle with the parents,\" says Allen, describing the theatre of parents reading to a child, with the drama of the voice essential to the reading experience of the non-reading child.\n\n\"It's not just the book. There are two people — the child and the parent reading,\" she says.\n\nLeaving room for imagination\n\nThere are small details everywhere — thin black lines throughout, on chairs and tables, contributing to the storybook environment, and the flow of colours and illustrations through each space, leaving plenty of white space, true to Allen's intent to have as few distractions as possible.\n\nHer commitment to the perfect theatrical picture book was so strong that she would push against her publishers when they asked for less white space and more filled-in scenery.\n\nThe exhibition asks visitors to interact with Pamela Allen's stories. (Supplied: Gene Ramirez)\n\n\"I wouldn't do it!\" she says.\n\n\"If you look at my books, there's only the information you have to have.\"\n\nSLNSW's exhibition designers create subtle divisions in space to explore a variety of Allen's books.\n\n\"With giant elements, we wanted kids to have a sense of amazement and awe when they walk in and feel, wow, I am walking into one of Pamela's picture books,\" curator Morley says.\n\nReading as connection\n\nThe exhibition is not just a playground of reading, but also an insight into the creative mind of one of Australia and New Zealand's greatest creators.\n\nHer recipe for excellence in children's books is one she wants to share, in order to better educate would-be writers, as well as parents, carers and educators wanting to better know how to engage children in reading as an intimate theatrical experience, unique to each family.\n\n\"It's an experience, and that's the thing I think I want people to realise,\" she says.\n\n\"The security and the warmth of sharing something. People do talk to me about memories.\n\n\" You remember this book or something and it's usually because it was a great time with your father, or what we used to do when you were reading it with your mother. Cock-a-doodle-doo! Make the most of everything! \"\n\nLooking to Rosie's Walk by Pat Hutchins as a beautiful and inquisitive exemplary picture book, Allen decided on her method while walking over the Sydney Harbour Bridge after meeting with children's publisher Anne Ingram in 1979.\n\nAllen prefers an economy of words, no distractions, never repeating information between the text and the images, and, above all, drama: voices, anticipation, page turns and questions.\n\nABC Radio National's Top 100 Books of the 21st Century Top 100 Books is Radio National's new annual countdown where we hand over the reins to you to vote for your favourite books, and then we celebrate the Top 100 in a big weekend broadcast!\n\nUnlike many children's authors who speak regularly at schools, reading to a public audience has rarely been on Allen's agenda, and the opening event on September 21 was an unusual treat for her to share her latest book, Cock-a-Doodle-Doo! with the exact gusto she expects of her readers.\n\n\"I'm going to be a great rooster,\" Allen chuckles before the opening.\n\nComplete with a cast of dress-up characters, with costumes lovingly sewn by SLNSW education officer Susan Owen, there was a musical marching procession up the stairs to cut the ribbon and declare the celebration of Pamela Allen officially open.\n\nThe costumes of Pamela Allen book characters were made by Susan Owen (back left). (Supplied: Gene Ramirez)\n\n\"An exhibition is the pinnacle, being able to share these collections with everybody because this collection here at the State Library is phenomenal, but it's the people's collection. It's for everyone,\" curator Morley said.\n\n\"Being able to add Pamela to the canon of Australian literature among all the amazing Australian authors and illustrators that we collect is really important.\"\n\nThe Curious World of Pamela Allen is at the State Library of NSW until July 2027.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/nrl-broncos-vs-panthers-ivan-cleary-on-scott-sorensen/105829092",
        "title": "'Huge call': Cleary bemoans NRL's decision to bench star after head clash",
        "publish_date": "Sun, 28 Sep 2025 21:23:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "A frustrated Ivan Cleary says it was a \"huge call\" to rub Scott Sorensen out of Penrith's preliminary final loss after the forward passed a mid-game head injury assessment.\n\nBut the Panthers will opt against complaining to the NRL following the 16-14 loss to Brisbane that brought their thrilling run of premierships to an end.\n\nSorensen clashed heads with teammate Blaize Talagi in the opening 2 minutes of Sunday's grand final qualifier and immediately left the field at Suncorp Stadium.\n\nThe NRL's independent doctor ruled Sorensen had exhibited category-one symptoms, ruling him out of the match and the grand final, were Penrith to make it.\n\nBut Sorensen passed a subsequent head injury assessment conducted by the Panthers' medical staff and was well enough to watch the rest of the game from the sidelines.\n\nThe four-time premiership winner could not return to the field, under the NRL's concussion rules.\n\nThe blow left the Panthers playing in hot conditions with one less man for almost the entirety of the contest.\n\n\"It's a huge call, especially when he passes his HIA,\" Cleary said.\n\n\"It's a tough one. It makes life a bit harder, for sure.\"\n\nPenrith had been ready to seek an exemption to play Sorensen in the grand final, which would have fallen within the 11-day period that a category-one assessment requires a player to miss.\n\nHow Reynolds's game-winning moment played out Photo shows Adam Reynolds shouts after kicking a goal against Penrith. Adam Reynolds took the kicking tee from the Broncos' biggest star in the biggest moment of their season so far, and it paid off in the biggest way possible.\n\nBut it is now believed the club will not query the NRL's decision to rule Sorensen out of the game, despite the forward passing his assessment.\n\nPenrith's tight two-point preliminary final loss came after the team had wrestled itself back into premiership contention following a dismal start to the year.\n\nThe four-time reigning premiers slipped to last on the ladder after round 12, before a nine-game winning streak helped them lock up seventh spot.\n\nIn premiership history, no team had ever won a finals game after sitting last so late in a season, but the Panthers won two en route to Sunday's epic against Brisbane.\n\nCleary was still reticent to consider the season a success, as dreams of a fifth consecutive premiership slipped away.\n\n\"I'm not sure about a success. It's still a good year,\" he said.\n\n\"Our start really put us under pressure, and ultimately that's part of the season. That was not good enough. I have to take responsibility for that.\n\n\"After that, there was some really good stuff. Even the finals series, I thought we handled it pretty well. Lots of good stuff, but I'm not sure if I'd call it a success.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-29/asx-markets-business-news-live-updates/105828406",
        "title": "Live: ASX jumps after Wall Street ends losing streak",
        "publish_date": "Sun, 28 Sep 2025 21:12:00 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts"
        ],
        "text": "The ASX 200 has powered out of the blocks, buoyed by Wall Street ending its three-day losing streak on Friday.\n\nAt 10:50am AEST, the index was up 0.9% to 8,869 points, while the broader All Ordinaries gained a similar amount.\n\nASX 200 this morning (LSEG, ASX)\n\nAll sectors had made gains except for energy, which was down despite a spike in oil prices on Friday.\n\nHealthcare was up, supported by CSL (+3.0%), which has rebounded from Friday's fears about the impact of new US tariffs on pharmaceuticals.\n\nASX 200 by sector (LSEG, ASX)\n\nThe banks have all been bid up with CBA gaining 2%\n\nASX 200 banks (LSEG, ASX)\n\nMiners have reversed on softer commodity prices and iron ore tumbling more than 2% in China on Friday with BHP, Rio Tinto and Fortescue all down around 1%.\n\nMineral Resources was the exception, gaining 0.6% on news that it had completed repairs on its key iron ore road in the Pilbara.\n\nASX major miners (LSEG, ASX)\n\nThe energy sector has been weighed down by uranium miners (Paladin -2.1%) and coal producers (Whitehaven -1.9%), while Woodside is up 0.5%.\n\nGold miners are rising on the back of spot prices heading towards $3,800/ounce.\n\nASX major gold miners (LSEG, ASX)\n\nThe ASX 200 top movers list is headed by DroneShield (+11.7%), which is still gaining on its US expansion plans.\n\nASX 200 top movers (LSEG, ASX)\n\nThe mineral sands miner and rare earths wannabe Iluka (-3.2%) is the poorest performer on the ASX 200 bottom movers list, which also features uranium miners and coal producers.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-says-kitchen-cabinets-and-sofas-are-a-threat-to-america-20250929-p5mym4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump says kitchen cabinets and sofas are a threat to America",
        "publish_date": "Mon, 29 Sep 2025 11:56:28 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Even his “reciprocal” tariffs on all imports could be replaced by Section 232 versions, should the US Supreme Court uphold lower court judgements that they are illegal, although (a) the Supreme Court has a recent history of giving the administration what it asks for and (b) it would be far more time-consuming to use the section, which requires a particular and detailed investigatory process, and the administration would have to refund billions of dollars of tariff revenue in the meantime. Citing national security threats as a pretext for hitting imports of kitchen cabinets or furniture with his tariffs is clearly an artifice to enable Trump to build a wall against, it seems, almost all manufactured imports and the raw or semi-finished components to make them. It’s also a way of maximising revenue for a government that is awash in deficits and debt. Next up in Trump’s war on the world. The kitchen. Credit: istock Last year the US raised $US90 billion ($137.4 billion) from customs and excise duties. Recently, that revenue has been running at close to $US30 billion a month and it will keep rising as the most recently added tariffs (the reciprocal tariffs went live only last month) start to contribute.\n\nMost estimates of the tariffs are that they will generate around $US2.5 trillion over a decade, if they remain in place over that period. Loading They are of course, a particularly regressive tax on American consumers – they are paid for either by the US importer or are passed onto consumers via higher prices, with lower-income households hit hardest – despite Trump’s continued assertions that foreign countries are paying them. The Yale Budget Lab says they will cost the equivalent of an average annual per-household loss of income of $US2400 in 2025 dollars, will lower US GDP growth by 0.4 per centage points in the long run and increase the unemployment rate by 0.7 percentage points next year. They will also impact the US inflation rate, indeed they are already are impacting it.\n\nThe US Federal Reserve Board’s preferred measure of inflation is the core personal consumption expenditures index. On Friday the index, excluding volatile food and energy prices, showed a 0.3 percentage point increase in August relative to July. In July, then index rose 0.2 percentage points from June. The index is 2.9 per cent ahead of the same month last year. He’s also foreshadowed national security tariffs on robotics, industrial machinery., semiconductors and medical devices and no doubt will come up with some other products deemed critical to America’s security. In other words, prices and inflation are ticking up even before the full impact of the main tariffs – the baseline and reciprocal tariffs on the rest of the world – is felt. That’s despite the fact that most of the tariffs’ costs have, so far, been absorbed in the margins of US businesses rather than passed onto consumers.\n\nMany businesses also boosted their imports at pre-tariff prices significantly ahead of the well-flagged introduction of the main tariffs, allowing them to maintain pre-tariff pricing until their inventories have been depleted. There’s no evidence that exporters to the US have lowered their prices to absorb any material proportion of the tariffs’ costs. Loading Companies also wouldn’t want to raise prices and lose sales while there is a possibility the Supreme Court will deem the tariffs illegal and force the revenue to be returned to importers. The full effects of the existing tariffs won’t be seen for months and, with Trump regularly adding to the list of affected products, perhaps well into next year. While the impact on prices and inflation has been relatively muted to date, within the revised data released by the Commerce Department last week that showed robust 3.8 per cent growth in real GDP in the June quarter (after negative growth in the first quarter), business spending fell by an annualised 5.6 per cent in real terms. Business spending is being chilled by the uncertainties generated by Trump’s trade wars and immigration policies.\n\nWith wages growth relatively flat, the overall growth in the economy appears to have been powered by consumption funded by households drawing on their savings, perhaps to get in ahead of the tariffs. That’s not sustainable. The US has only days to avert another threat to growth, the shutting down of the US government if congressional Republicans and Democrats can’t find a short-term compromise before the government’s funding runs out on Wednesday, the start of America’s new financial year. Trump, who had refused a request from Democrat leaders for a meeting, has changed his mind and will now discuss a short-term spending bill with them. US Federal Reserve chair Jerome Powell. It’s a thankless task being a central banker in Trump’s America. Credit: Bloomberg The Democrats, while saying they want to avoid a shutdown, are insisting on an extension of health care subsidies and the restoration of cuts to health care spending in the administration’s One Big Beautiful Bill Act, while Republicans want an extension of the funding before they will negotiate (if they will negotiate).",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/i-stood-there-stunned-knockout-bid-secures-carindale-postwar-cottage-20250929-p5mym9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I stood there stunned’: Knockout bid secures Carindale postwar cottage",
        "publish_date": "Mon, 29 Sep 2025 11:49:25 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A postwar cottage in one of Brisbane’s fastest growing suburbs was snapped up for $1.4 million in seconds on Saturday after an “intimidating” gambit from a young buyer.\n\nFor the vendors, who paid just $565,000 for the three-bedroom Carindale home in 2019 and spent about $100,000 on renovations, the result was nothing short of a windfall.\n\nA first-home buyer opened the auction at $1.2 million, before a woman from Cairns launched the final knockout bid just moments later.The move left the four other bidders speechless and selling agent Joanna Gianniotis, of Place Estate Agents, stunned.\n\n“That bid was an intimidation tactic … and it worked. The reserve was set at $1.3 million,” said Gianniotis. “The other bidders just stood there and looked at each other.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/downsizer-pays-7-3m-for-four-bedroom-queens-park-home-at-auction-20250929-p5mylt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Downsizer pays $7.3m for four-bedroom Queens Park home at auction",
        "publish_date": "Mon, 29 Sep 2025 11:48:10 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A charming four-bedroom home in Queens Park sold for $7.31 million at auction on Saturday, $1.36 million above its $5.95 million reserve.\n\nGuided at $5.5 million, the Federation residence at 8 Rawson Avenue comes with dual access and a double garage.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nEleven people registered, and four actively bid for the parkside property a short stroll from Centennial Park. Two of the active buyers were represented by buyer’s agents.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/there-s-more-in-us-title-run-is-over-but-panthers-vow-more-to-come-20250929-p5mykl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘There’s more in us’: Title run is over, but Panthers vow more to come",
        "publish_date": "Mon, 29 Sep 2025 11:33:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Is it the end of an era at Penrith, or did a 2025 campaign that ended in a painful preliminary final loss double as a chance to re-tool for another golden run?\n\nPanthers co-captain Isaah Yeo is in the latter camp, warning rival NRL clubs that his deposed champions will be back bigger and better next year.\n\nThe Panthers’ run of four-straight premierships ended at Suncorp Stadium on Sunday when, after leading Brisbane 14-0 in the preliminary final, they conceded 16 unanswered second-half points.\n\nWhile Yeo was shattered not to have qualified for a sixth successive grand final, he was “really proud of the group” after the Panthers slumped to last on the ladder mid-season before rallying to reach the play-offs.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-man-drowns-at-burleigh-heads-in-weekend-tragedy-fog-shrouds-brisbane-cbd-but-spares-airport-20250926-p5my69.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live:  Premier says Suncorp Stadium upgrades a ‘very high’ priority; Man drowns at Burleigh Heads in weekend tragedy; Fog shrouds Brisbane CBD but spares airport",
        "publish_date": "Mon, 29 Sep 2025 11:31:40 +1000",
        "category": "sports",
        "authors": [],
        "text": "Premier David Crisafulli says upgrades to Suncorp Stadium are a “very high” priority and evaluations are under way to consider further venue capacity.\n\n“I’m not talking about just normal bare bones main­tenance, I’m talking about a proper investment into the ­stadium,” Crisafulli said ahead of Sunday’s blockbuster NRL preliminary final.\n\nThe premier said there would “need to be an investment ahead of [the] 2032” Olympics.\n\nAn artist’s impression of planned upgrades to Suncorp Stadium under the previous Labor government, showing new screens. Credit: GIICA RTI\n\n“I don’t think Suncorp at the moment is at the level it should be,” he said.\n\n“It’s a great venue and it’s part of who we are as a state … there will be additional funding to Suncorp over and above.\n\nLoading\n\n“We do believe that when the eyes of the world are on us, we have to make sure that there’s a new stadium that’s world class, but our existing venues also have to be the best they can be.”\n\nThe former state government had planned upgrades for the 52,500-seat venue in its Olympic plan, but a right-to-information request from Brisbane Times revealed the stadium had not been set to change dramatically.\n\nCrisafulli said Sports Minister Tim Mander was already assessing changes to Lang Park, which last underwent major renovations in 2011 to repair significant flood damage, and works were “under way” on potential upgrades.\n\n“I’m not talking about just normal bare bones maintenance as in depreciation maintenance, I’m talking about a proper investment in the stadium,” he said.\n\n“There are a number of venues in this state that aren’t at the level where they should be, and we should use the Olympic and Paralympic Games as an opportunity to have that finish line.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/it-s-daisy-s-home-away-from-home-but-it-could-soon-be-knocked-down-for-mass-housing-20250902-p5mrrb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It’s Daisy’s home away from home. But it could soon be knocked down for mass housing",
        "publish_date": "Mon, 29 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Cindy Yin"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size On a quiet street in Sydney’s inner west, tucked in between warehouses, is an unassuming building where sounds of squeaking shoes on matte red floors and the echoing of balls ricocheting off bats fill the air. For years, the RTTC Table Tennis Academy in Rhodes has been Sydney’s hotspot for nurturing world-class table tennis players, training more than 300 students each week. But that could all end after the state government’s three-person Housing Delivery Authority recommended the fast-tracking of a proposal to build 2020 homes on the site. A Herald analysis of some of the largest HDA projects reveals a considerable gap in amenity – some of the proposed homes will be just a stone’s throw away from shops, train stations, schools, and hospitals, while some residents will live up to 17 kilometres away from train stations and even further from schools, shops, or emergency departments. RTTC Table Tennis Academy on Averill Street in Rhodes, Sydney. Credit: James Brickwood The HDA’s recommendations bypass local councils, which accelerates development approval times for major residential developments above $60 million in metropolitan areas and $30 million in regional NSW. Since February, more than 91,100 potential homes have been declared state significant under the HDA pathway.\n\nAdvertisement\n\nRhodes If it goes ahead, the development will mean the table tennis academy on Averill Street will have to shut its doors so the building can be demolished to make way for 2020 apartments, resulting in a loss of public amenity in an already densely populated suburb. It has become a second home for 15-year-old Daisy Xie, who for the past five years has attended at least four times a week. Xie said closure of the centre that was a perfect in-between meeting point for her and her playing partner would upend their training. “It’s already difficult to find a training partner that suits you. Besides, this venue is so good – if we have to move elsewhere it will disrupt training and make things a lot more inconvenient,” she said. “The centre has flat, even grounds, so the ball won’t roll around. It’s also well lit and has air conditioning. It will be difficult to find a location just as suitable.”\n\nAdvertisement\n\nClub manager Jecie Yao said it signed a 10-year lease with the landlord in 2023. But the uncertain future of the centre means it could be asked at any point to close up and relocate, which would present countless logistical nightmares. “We hope it’s not happening, but I know eventually it will happen. It’s pretty tough when a business has to relocate. We’ll have to do the marketing and start from scratch,” Yao said. Rhodes has no schools, and the proposed development is a 12-minute walk to Rhodes station. Marsden Park In between a permanently shuttered laboratory and an expanse of overgrown fields, is a package of empty land in Marsden Park that could have 800 homes. The proposed greenfield development at 264A South Street is 4.3 kilometres from Schofields train station, 2.2km from the nearest grocery store, and almost 6.8 km away from the closest primary school and high school. The closest hospital with an emergency department is 6.7km away, in Mount Druitt.\n\nAdvertisement\n\nRichmond Road is also the only major road in – or out – of Marsden Park, meaning the already congested corridor could buckle under pressure from more residents moving in. Located 50km north-west of the CBD, Marsden Park is a relatively new suburb known for its sprawling small-lot, dark-roofed large houses that have become synonymous with homogenous new-build homes on Sydney’s periphery. Marsden Park is far from basic amenities. Credit: Rhett Wyman The population has boomed in these greenfield suburbs. Marsden Park and its neighbouring suburb Shanes Park added nearly 18,000 people between 2019 and 2023, bringing its total population to 23,778. Experts have previously flagged issues with these fringe suburbs, such as rising heat, poor transport links, minimal recreational space, and the absence of essential amenities. Appin\n\nAdvertisement\n\nThe largest development recommended by the HDA comprises 2499 homes in Appin, 71km south-west of Sydney on the road between Wollongong and Campbelltown. While Appin sits within the Greater Macarthur growth area, and is a key plank in the state’s plan to build 377,000 homes by 2029, amenities and infrastructure are few and far between for its 3500 residents. The closest hospital in Campbelltown is more than an 18-kilometre drive away, and Douglas Park, the nearest train station is almost 17 kilometres from the proposed site. While there is a long-term vision for nearly 16,000 new homes in Appin, a cap of 2499 homes has been put in place, and will only increase when wastewater and infrastructure such as roads and sewage systems are delivered first by Transport for NSW and Sydney Water. Draft plans from the developer include three new local centres with shops and services, new transport corridors and road upgrades, three new school sites, and sites for emergency service facilities. Development along Appin Road, a highway linking Sydney’s south-west suburbs with Wollongong. Credit: Brook Mitchell\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/magical-number-young-couple-beats-six-others-with-knockout-offer-for-spotswood-house-20250929-p5mylu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Magical number’: Young couple beats six others with knockout offer for Spotswood house",
        "publish_date": "Mon, 29 Sep 2025 11:17:14 +1000",
        "category": "finance",
        "authors": [
            "Abbir Dib"
        ],
        "text": "A house in Spotswood drew in seven young bidders before a knockout offer of $1 million sealed the deal at auction on Saturday.\n\nThe three-bedroom home at 20 Forrest Street was listed with a price guide of $780,000 to $860,000, with the reserve set at $850,000.\n\nThe opening bid of $780,000 sparked competitive bidding in $10,000 increments. Jellis Craig Inner West director Glen Baird said the auction was dominated by younger buyers, and the winner was a young couple.\n\n“They were all young couples. There was an older couple bidding, but they were bidding for their son in America,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-demons-said-good-bye-to-goodwin-should-they-do-the-same-to-petracca-and-oliver-20250826-p5mpt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Magpies fielded the oldest finals team ever. Now it’s time to make tough calls",
        "publish_date": "Mon, 29 Sep 2025 11:12:04 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Jon Pierik",
            "Marc Mcgowan",
            "Scott Spits",
            "Vince Rugari"
        ],
        "text": "The Magpies, however, may tell Mihocek they won’t budge from their two-year offer. Mason Cox, 34, faces an uncertain future, while Dan Houston – and the Pies – will agree they need more from him next season. Bobby Hill, having missed so much football because of personal issues, remains a close watch. Something to look forward to: Houston was not the same counter-puncher he was at Port Adelaide in his first year with the Magpies – expect that to change next year. He is exemplary with ball in hand, and needs to have more of it. Skipper Darcy Moore had an indifferent season, and may need to revisit the balance between pure defending and hunting the ball. Get that right, and the Magpies – already built on defence – will be even stronger. Coach Craig McRae wants a blend of good draft picks and established players through this trade/draft period. They missed out on Jack Silvagni, but will trade for Swans’ forward Jack Buller.\n\nAnother established defender may be front of mind, for Jeremy Howe, 35, is showing signs of wear and tear. Predicted best and fairest: Nick Daicos.\n\n– Jon Pierik Adelaide (fifth after finals loss)\n\nWins: 18 Losses: 7 Draft picks: 18, 41, 48, 54, 66, 72. What went well: There was much to like. The Crows not only leapt back into the finals for the first time since 2017, but won 12 of their final 13 home-and-away games to finish as minor premier. Matthews Nicks’ game plan, essentially built on going long down the line, held up during the season proper. Taylor Walker may not like what he hears from the Crows’ bosses in his end-of-season meeting. Credit: AFL Photos via Getty Images Skipper Jordan Dawson and full-forward Riley Thilthorpe were All-Australians, while fellow forwards Taylor Walker and Darcy Fogarty, and forward-midfielder Ben Keays, also enjoyed strong home-and-away seasons. Former Demon Alex Neal-Bullen was a fine acquisition, and could be a future skipper.\n\nIzak Rankine provided creativity up field and close to goal, and was badly missed through suspension for a homophobic slur in September. “What it did do was it changed the dynamic of our group,” Nicks said of Rankine’s absence. “Izak is, and this is my opinion, one of the best players in the game, so I think if any team loses their best player, then it becomes quite challenging to replace that.” It could be a rough exit meeting for: Taylor Walker. The champion forward, 35, is off contract, and his time may be up after a modest finals campaign. The Crows may feel Thilthorpe and Fogarty need to be empowered and shoulder greater responsibility. Fellow veteran Brodie Smith, 33, is also weighing up his future. Something to look forward to: This was a year when the Crows built a foundation for what should be a five-year premiership tilt. Yes, they failed to win a quarter in their two finals defeats, becoming the first minor premiers in more than 40 years to be dumped from September in straight sets, but that sting should fire this squad. However, they do have holes. While unbeaten in 13 games against bottom nine teams, they were 6-7 against top nine teams, their scoring and defence dropping off.\n\nThey need another X-factor in addition to Rankine, while a forward line of three talls didn’t hold-up in September, when the ball is on the ground more. Another strong defender would also help. Nicks will need to tinker with his game plan. As he said after the semi-final loss to Hawthorn, it’s harder to move the ball the way you want in the finals when the intensity rises. The Crows have been linked with off-contract Lions forward Callum Ah Chee.\n\nBest and fairest tip: Jordan Dawson.\n\n– Jon Pierik Suns gun Matt Rowell takes a physical battering in every game he plays. Credit: Getty Images Gold Coast (sixth after finals loss)\n\nWins: 16 Losses: 9 Draft picks 6, 14, 15, 32, 56, 68 What went well: The Suns have finally risen. This was a breakthrough season for a club, which not only made its maiden finals run in its 15th attempt, but conjured a miraculous win over the Dockers in Perth. Skipper Noah Anderson and fellow midfielder Matt Rowell were first-time All-Australians, their sustained efforts in the midfield a sight to behold. The physical punishment Rowell takes reminds us of the hits an NFL running back endures. Marking forward Ben King was superb in front of goal but will need to add a new trick or two. Fellow forward Ben Long had a breakout campaign, although he was disappointing in the semi-final, while recruits Daniel Rioli and John Noble delivered what was expected of them at half-back.\n\nSam Collins is a beast at full-back, Touk Miller delivered run and carry, while Bailey Humphrey showed signs of morphing into the Suns’ version of Cam Rayner. It could be a rough exit meeting for: Jed Walter. The young forward was dropped after round 19 and did not return to the side. While the former Suns academy product is contracted for next season, he could be used in a trade for Carlton’s Charlie Curnow. While a star in the making, Mac Andrew will face a strong review of his finals performances. Something to look forward to: There is plenty to look forward to with this emerging list, coach Damien Hardwick declaring his team is built for September. The base is there, it’s now time to build internally and through canny trades. The Suns were too reliant on Rowell and Anderson, and need another robust midfielder who can deliver under pressure. The unicorn that is Ethan Read struggled in the semi-final but has the height and talent to be a long-term marking threat. They could lose Sam Flanders, who has two years remaining on his contract, and Malcolm Rosas, through the trade period.\n\nBest and fairest tip: Noah Anderson.\n\n– Jon Pierik Fremantle (8th) Wins: 16. Losses: 8. Draft picks 13, 31, 38, 49, 67. What went well: After last year’s meltdown, when they slipped from the top eight at the start of August to 10th by the end, the Dockers held firm this year and returned to the finals for the first time since 2022, winning 12 of their last 14 games to finish sixth. Caleb Serong again starred in the Fremantle midfield. Credit: AFL Photos\n\nThey adopted a more attacking gameplan after five losses from their first nine games, but failed to fully embrace this mantra in a stinging elimination final defeat to the Suns. “We’ve grown so much throughout the year with the way we play our footy, the way we embrace challenges, the way we’ve improved our footy on the road,” coach Justin Longmuir said after the loss to the Suns. Marking talls Josh Treacy (44 goals) and Patrick Voss (37) had strong seasons, while Murphy Reid claimed the AFLPA’s best young player award. Former premiership Tiger Shai Bolton (28) was arguably the recruit of the year. Defender Jordan Clark and midfield stud Caleb Serong were All-Australians, while Andrew Brayshaw was unlucky not to be.\n\nIt could be a rough exit meeting for: Jye Amiss. While he played all 24 games, Amiss, a key marking tall, returned a modest 32 goals, and averaged career-lows in marks and disposals per game. He had only two touches (one goal) in the elimination final before being subbed off. Amiss could be a trade target. Then there’s ruckman Sean Darcy. Will he and Luke Jackson continue to be a one-two punch in the ruck? We’ll see. Something to look forward to: The Dockers are building nicely. They had an average age of just 24.9 years through the season – the fourth youngest in the competition. Fremantle ruckman Sean Darcy. Credit: AFL Photos AFL great James Hird has set high expectations for them next year, despite their loss to the Suns on Saturday.\n\n“I think they have to be top four next year with their list and the way they’ve had the final this year and the performances against the best teams in the competition. I’ve really gotten locked in that top four next year,” Hird said. But they cannot afford to have lulls and slip back into a defensive mindset when the pressure is at its greatest. This will be Longmuir’s greatest challenge. Best and fairest: Caleb Serong.\n\n– Jon Pierik GWS (7th)\n\nWins: 16. Losses: 8. Draft picks: 12, 30, 36. What went well: After a dodgy first half of the year, the Giants won nine of their last 10 home-and-away games, scoring more than 100 points in each of them. In the end, they finished with one of the AFL’s best attacking records, just two points behind third place. Toby Greene and his Giants were eliminated at home by the Hawks. Credit: AFL Photos At their best, they were absolutely awe-inspiring: their stunning third quarters against the Swans in the second Sydney derby of the season, plus their (eventually unsuccessful) comeback against Hawthorn in their elimination final, will live long in the memory. The challenge will be closing the gap between their frightening best and their timid worst. It could be a rough exit meeting for: Everyone. The Giants have now lost their past four finals, including two at home (and three in Sydney) – the sort of record that each player needs to take a varying degree of responsibility for, as well as the coaching group, and will require them all to look deeply within over the summer. September stumbles are becoming too much of a theme.\n\nWhat’s clear is that they concede too many entries, which can’t be wholly pinned on the six poor blokes in defence who had to deal with that avalanche. All things considered, they managed OK, but it felt unsustainable, and so it has proved. And there’s a similar problem going the other way. When they’re on, they’re on, but the Giants’ attack falls to pieces when they mindlessly blaze away inside 50 as they did against Hawthorn, which completely undermines their forward set-up. Composure in key moments is lacking in this side across every line, and that’s not an easy thing to add. Sam Taylor is a star defender for GWS, but the Giants’ defensive unit is under pressure. Credit: AFL Photos Something to look forward to: As Adam Kingsley said post-match, the Giants still have “all the pieces” to contend, although their ageing stars are running out of petrol. But the window remains open, their next tier of rising stars will be better with another season under their belts and if they can address their inconsistencies, get to the psychological nub of their finals failures and have some better luck with injuries, there’s no reason why they won’t be back contending again in 2026. Best and fairest tip: Finn Callaghan showed exactly why St Kilda threw a $17 million, 10-year contract offer at him; thank heavens he said no. He and Tom Green (likely second in the best and fairest) run this team now.\n\n– Vince Rugari\n\nWestern Bulldogs (9th) Wins: 14. Losses: 9. Draft picks: 10, 28 What went well: Offensive power. The Doggies poured on the goals this season, scoring more points (2493) than any other team. Led by Marcus Bontempelli, Tom Liberatore, Ed Richards and an increasingly influential Sam Darcy up forward, they beat up teams with regularity. While that resulted in a 14-9 record, the team from the west missed the finals. The Bulldogs were an offensive juggernaut in 2025 but still missed finals. Credit: Getty Images\n\nIt could be a rough exit meeting for: Jamarra Ugle-Hagan. The one-time No.1 draft pick has occupied so much of the Bulldogs top brass’ time this season. It would be fascinating to witness his official exit meeting given there’s so much to discuss for a player who didn’t add to his tally of 67 AFL games this season. Defenders will be in the spotlight, too, but each player on the list will be pressed for explanations as to why the Dogs simply couldn’t beat teams who were vying for finals spots. Something to look forward to: Plenty, to be truthful. The Dogs have recorded 14 wins in consecutive seasons; in 2024 they played finals, so they can’t wallow in pity about what happened this year. Jamarra Ugle-Hagan didn’t play a game for the Bulldogs this season. Credit: Justin McManus Darcy, at age 22, remains one of the most exciting young players in the game. Aaron Naughton’s best season (65 goals) is a beacon of hope for even better things, too.\n\nBest and fairest tip: I’ve landed on Ed Richards ahead of Tom Liberatore. Bontempelli’s missed games through injury will cost him.\n\n– Scott Spits Port Adelaide (13th) Wins: 8. Losses: 15. Draft picks: 26, 42, 60 What went well: That’s tough to answer because this was an extremely disappointing year, despite Ken Hinkley’s protestations the list is set up well for 2026. Port Adelaide chairman David Koch stuck with Ken Hinkley to the end. Credit: Getty Images\n\nHaving made a preliminary final last year, the Power slipped markedly. However, skipper Connor Rozee and fellow star midfielder Zak Butters were typically industrious, while forward Mitch Georgiades delivered a half-century of goals for the first time. Aliir Aliir enjoyed another stellar season in defence, while Travis Boak and Hinkley were given a classy send-off against the Suns, the victory fully deserved. Zak Butters won Port Adelaide’s best and fairest award - the John Cahill Medal - for the third consecutive year in 2025. Credit: Getty Images It could be a rough exit meeting for: President David Koch and his board. The succession plan designed to ease Hinkley out and Josh Carr to prepare for the senior role next season was done with the best of intentions, but the scoreboard says it was a failure. If Hinkley wasn’t the man to take the team forward, then Carr should have been immediately installed, and Hinkley given a thank-you payout for his years of fine service.\n\nSomething to look forward to: The Power should be back in the finals hunt next year, but they will need to get busy in the trade period. Do they have enough true stars? Missing out on Nasiah Wanganeen-Milera will hurt. Late season injuries have given the youngsters a chance. We like what we have seen of Jack Whitlock, who can play ruck and go forward. Best and fairest winner: Zak Butters.\n\n– Jon Pierik Essendon (15th)\n\n\n\nWins: 6. Losses: 17. Draft picks: 4, 5, 22, 25. What went well: The Bombers have some superb youngsters. In his second year, Nate Caddy again gave glimpses of the player he could become, with 20 goals and more flashes of brilliance. Isaac Kako gave Bombers fans something to get excited about. Credit: AFL Photos Isaac Kako impressed with his smarts around goals and showed late in the season he can also be developed as a pinch-hitter in the centre square. Archie Roberts, the lowest draft pick of the trio, could end up being a steal. The teenager is advanced beyond his years, demonstrating composure and skill in a defence that was under siege.\n\nAngus Clarke is another of the club’s 15 debutants this year who has provided Bombers fans with hope in a wretched campaign. It could be a rough exit meeting for: Ben Hobbs. In his fourth season, Hobbs, 21, failed to take a more significant role in the side. Worryingly for Hobbs, despite Essendon’s litany of injuries, he was dropped for the first leg of the final round and could not break back into the team. Hobbs has stagnated in his past two seasons, reaching 20 disposals in just three of his past 30 games. His disposal remains a worry. If time has run out for the first-round pick from the 2021 draft, it would raise further queries on the Bombers’ recruiting and player development. Something to look forward to: The draft. The Bombers have a strong hand in this year’s draft after acquiring Melbourne’s first selection through a pick swap last year. Even accounting for father/son, academy and NGA picks, the Bombers should have access to two very good youngsters.\n\nIf Sam Draper departs through free agency, that should deliver another first-round pick. Unfortunately for the Dons, this is not considered the strongest draft, but one experienced recruiter has said they would not be surprised if smokies emerge deeper in the pool. Best and fairest: Zach Merrett.\n\n– Andrew Wu West Coast (18th) Wins: 1. Losses: 22. Draft picks: 1, 14, 19, 32, 50.\n\nWhat went well: Sorry West Coast fans, this is not pretty. The Eagles have managed 11 wins in four seasons, including just one victory, over St Kilda, in a torturous 2025 season. But there’s always a glimmer of hope and performances and players to celebrate. Two-time Richmond premiership player Jack Graham, who joined the Eagles for 2025, comfortably exceeded his career average for disposals (19.2 possessions per game this season) and had 7.8 tackles per game (which is considered “elite”). It could be a rough exit meeting for: The defensive unit and the defence coaches. West Coast comfortably conceded the highest number of points (2438) this season, leaving them with a limp percentage of 60.1. If premierships are built from the backline, they need to focus there.\n\nIt will be fascinating to see the club’s attitude towards Tim Kelly, who played 19 games in his sixth season with the Eagles. Something to look forward to: It couldn’t get any worse, could it? If West Coast haven’t bottomed out, where is the bottom? The Eagles can expect the No.2 draft pick as compensation for losing free agent Oscar Allen to Brisbane, so that’s something. And Harley Reid is staying for now, having resisted interest from big Victorian clubs to extend until the end of 2028. Eagles fans can only look forward to better times ahead. Best and fairest tip: Jack Graham.\n\n– Scott Spits\n\nNorth Melbourne (16th) Wins: 5 Losses: 17 Draws: 1 Draft picks: 20, 21, 39, 57 What went well: They made it out of the bottom two! The Kangaroos and coach Alastair Clarkson would have liked to see more progress on the ladder, but he remains bullish they are heading in the right direction. North Melbourne avoided another bottom-two finish. Credit: Getty Images\n\nAfter a torrid first six rounds and the odd thrashing beyond that, North were generally more competitive, including securing a draw with Brisbane, but there were no statement wins. Instead, they would be pleased with Harry Sheezel’s transition to a midfield-forward role, the continued development of Colby McKercher and career-best seasons from Cam Zurhaar and Paul Curtis. It could be a rough exit meeting for: Will Phillips. The No.3 pick in the COVID-19-impacted 2020 draft class played only seven matches this season and does not appear to be in the Roos’ plans. He should latch on somewhere, but needs to get going to save his career. Something to look forward to: Next year promises to be the season when North Melbourne finally take a genuine leap. How high that is remains to be seen, but the expectations must rise, even if that is as modest as aiming for between eight and 10 wins.\n\nThe young talent is there, and they may have finally found Nick Larkey’s sidekick in Cooper Trembath. A stiffer defence and another progression from their midfield group should enable them to take another belated step. Best and fairest: Luke Davies-Uniacke.\n\n– Marc McGowan Richmond (17th)\n\nWins: 5. Losses: 18. Draft picks: 2,3 What went well: Plenty for a club that was widely tipped to sail through turbulent waters with a drastically young and inexperienced list. The season began on the best note possible with a stunning round-one win over Carlton. The nature of the victory, a come-from-behind triumph, set the tone for the season for both the Tigers and Blues. Throw in highlights from Maurice Rioli jnr, and all was swell. Tim Taranto had a strong season as one of the Tigers’ on-field leaders. Credit: AFL Photos It could be a rough exit meeting for: The club’s forwards and the forward coaches. The Tigers scored the fewest number of points (1449), less even than West Coast, a club that limped to one victory, compared to Richmond’s five.\n\nVeteran spearhead Tom Lynch could cop a drive-by sledge for missing games. He played only 16 matches (due largely to a suspension) after a tough couple of years with injuries. Something to look forward to: There’s so much to look forward to. Realistically, the Tigers will battle to replicate their win-loss tally (5-18) as they continue to develop their young group. It could be a case of the “second-year blues” for a host of players. But Richmond will be eyeing off their matches against Carlton and the chance to knock them off again.\n\nBest and fairest tip: Tim Taranto.\n\n– Scott Spits St Kilda (12th) Wins: 9. Losses: 14. Draft picks: 7, 43, 58. What went well: The Saints were a popular choice to sink into the bottom four, but finished three wins clear of that territory while prioritising youth. The Saints will welcome Tom De Koning in 2026 and welcome back Max King after another injury-riddled season. Credit: AFL Photos\n\nSt Kilda’s round two upset of Geelong was a false dawn, but a peek at their upside. They also demolished Fremantle and executed the greatest three-quarter-time comeback from 46 points down against Melbourne. That latter win was the first of four in a row before they almost upset GWS in round 24. Nasiah Wanganeen-Milera’s emergence as a top-liner was massive, while Max Hall followed Cooper Sharman and Max Heath as a mid-season draft success story. It could be a rough exit meeting for: Zak Jones. The brother of ex-Demons captain Nathan was not one of the five Saints who re-signed last week, and faces an uncertain future. Jones turns 31 in March, and St Kilda already made it clear they want to get younger in the midfield.\n\nSomething to look forward to: Another two years from Wanganeen-Milera, who they retained despite Adelaide and Port Adelaide wanting him. There is optimism about what Mattaes Phillipou, Darcy Wilson, Alix Tauru and Tobie Travaglia can become, while the likes of Hugo Garcia, Isaac Keeler, Hugh Boxshall and Lance Collard also show promise. Tom De Koning will be on the list in 2026, and Max King will hopefully be fit again. Best and fairest tip: Nasiah Wanganeen-Milera.\n\n– Marc McGowan Sydney (10th)\n\nWins: 12. Losses: 11. Draft picks: 9, 27, 45, 63. What went well: Having won just four of their first 12 games under new coach Dean Cox, the Swans showed fortitude to rebound and win eight of their final 11 games. Brodie Grundy returned to his best form for Sydney in 2025. Credit: AFL Photos Playmaker Isaac Heeney had a tough start, but then reminded everyone why he is a legitimate star. Chad Warner was a consistent threat through the midfield, but did not have the impact he enjoyed through 2022-24.\n\nA serious ankle injury through the pre-season sidelined Errol Gulden for months and seriously hurt the Swans’ midfield and creative drive, just as his return in round 15 had the reverse effect. Brodie Grundy reinforced why he is one of the competition’s premier ruckmen. It could be a rough exit meeting for: Skipper Callum Mills. For the Swans to make the leap next season, Mills needs to consistently be on the park. His 2024 campaign was derailed after injuring his rotator cuff in a Mad Monday celebration. He missed the first half of this year because of plantar fascia. He needs to lead the way in 2026. Something to look forward to: This has been a year of recalibration for the Swans, and learning, particularly for Cox, who is now more at ease in the top role after replacing John Longmire.\n\nWhile it feels somewhat of a wasted year, the Swans are still in top-four mode, and are likely to be strengthened through the trade period. They just need to get moving earlier next season. Best and fairest tip: Isaac Heeney.\n\n– Jon Pierik Carlton (11th) Wins: 9. Losses: 14. Draft picks: 34, 44, 62*. What went well: Not much. George Hewett was one of few Blues to exceed expectations, putting together a career-best season in the midfield.\n\nJack Silvagni and Tom De Koning are both leaving the Blues. Credit: Getty Images Better known as a defensive onballer, Hewett became a prolific ball-winner in his own right. In his 12th season on an AFL list, the former Swan is a strong chance to win his first best and fairest award. Veteran Nick Haynes overcame a horror start at the club to become dependable defender. He deserves another year. Young midfielder Cooper Lord is one to watch. George Hewett stepped up for the Blues in 2025, but didn’t get enough support. Credit: Getty Images The Blues blooded seven debutants, the best of whom looks to be key defender Harry O’Farrell, who, unfortunately, injured his knee.\n\nOther gains were bitter-sweet. Jack Silvagni was a revelation in defence but played just 13 games and is now on the move. Ollie Hollands found plenty of the ball in his new role as a running defender but his kicking needs work. It could be a rough exit meeting for: Mitch McGovern. The Blues are keen to get money off their books and the writing is on the wall for the 30-year-old, who narrowly missed a games trigger that would have earned a contract extension. With Silvagni walking out and O’Farrell to be unsighted for much of 2026, the defender may yet get another year, but it will be on the Blues’ terms. Veterans Adam Saad and Blake Acres both had ordinary seasons. Something to look forward to: With mass change underway in the coaches box, free agents Tom De Koning and Silvagni confirming their departures, and ongoing chatter about Charlie Curnow, it’s already been a turbulent off-season for the Blues, and the AFL home and away season isn’t even officially over yet! Expect that turmoil to continue for some time yet.\n\nBut once they ride that out, there will be hope again. The departures of De Koning and Silvagni will strengthen the Blues’ draft hand to acquire highly-rated Harry Dean as a father-son pick. Decimated by injury in 2025, the Blues can vault back into finals contention with a cleaner bill of health. Curnow (assuming he stays) and Sam Walsh had interrupted preseasons which severely impacted their year. Harry McKay missed half the season. Matthew Cottrell and Elijah Hollands, two of their best runners, hardly played, and heart-and-soul defender Nic Newman didn’t get on the field at all.\n\nThen there’s the prospect of a fit Jagga Smith. Get all them right and the Blues should be stronger – but this was a year when they fell well below expectations. Best and fairest tip: George Hewett.\n\n– Andrew Wu Melbourne (14th) Wins: 7. Losses: 16. Draft picks: 23, 51, 59* What went well: Kysaiah Pickett graduated from a star goalsneak to a game-breaking midfielder/forward who now rivals skipper Max Gawn as the club’s best player. Despite their troubles, the Demons secured Pickett’s prized signature in a huge coup, keeping him in the red and the blue until the end of 2034 on a lucrative contract.\n\nMidfielders Christian Petracca and Clayton Oliver are stars for Melbourne and both have long-term contracts, but that no longer means their respective futures at the club are guaranteed. Credit: Getty Images Gawn was again a colossus, talking through action on the field and becoming their spokesperson for almost every crisis off it. Rebounding defender Jake Bowey has taken the next step to become a driver of the team while Harvey Langford, the No.6 pick in last year’s draft, is the Demons’ next A-grade midfielder after making a seamless transition to senior football. Veteran forward Jake Melksham, with 33 goals from 18 games, earned himself another contract, which was confirmed by the Demons just days after their season ended.\n\nIt could be a rough exit meeting for: Clayton Oliver and Christian Petracca. Do two of Melbourne’s greatest players want to stay? If either player wants out, the club should not stand in their way. Coming back from a life-threatening injury, Petracca’s season was steady, and he will likely finish in the top six of the club’s best and fairest award, but a long way from his game-breaking ways. Loading\n\nOliver was better than last year when his campaign was compromised by his off-field issues. Both still have time to return to their best but the competition trend away from contest and stoppage towards speed and ball use is against them. Jacob van Rooyen went backwards in a season the club needed him to hold down a key forward posting. Something to look forward to: The appointment of a new coach always renews hope among the supporter base. Nathan Buckley is the early favourite but whoever succeeds Simon Goodwin must decide whether the core of this list can rise again after two years of diminishing returns or if it’s time to invest more heavily in the next generation. In Harvey Langford, Xavier Lindsay and Caleb Windsor, the Dees have three highly talented young guns who will play a lot of football for the club.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/stuck-up-storm-prop-lashes-broncos-heading-into-decider-20250929-p5mymx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Stuck up’: Storm prop lashes Broncos heading into decider",
        "publish_date": "Mon, 29 Sep 2025 10:58:27 +1000",
        "category": "sports",
        "authors": [
            "Roy Ward"
        ],
        "text": "Loading\n\nMelbourne Storm prop Stefano Utoikamanu has labelled the Broncos as “stuck up” in the opening salvo of grand final week.\n\nThe NSW Blues prop has steadily improved for the Storm in his first season since joining from Wests Tigers, and he didn’t hide his dislike for Brisbaneon Monday.\n\nUtoikamanu didn’t identify individual players, but the Brisbane side that plays on Sunday will contain headline grabbers such as Reece Walsh, Ezra Mam, and Kotoni Staggs.\n\nThe Storm’s players have already anointed Utoikamanu as their “enforcer” especially with towering prop Nelson Asofa-Solomona suspended for the grand final.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/jess-fox-discusses-the-slalom-world-championships-20250929-p5mymr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jess Fox discusses the Slalom World Championships",
        "publish_date": "Mon, 29 Sep 2025 10:53:12 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Jess Fox discusses the Slalom World Championships\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-as-wall-street-snaps-losing-streak-20250929-p5myk4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks, healthcare shares shine as ASX climbs higher",
        "publish_date": "Mon, 29 Sep 2025 10:40:26 +1000",
        "category": "finance",
        "authors": [
            "Stan Choe"
        ],
        "text": "The Australian sharemarket has made a bright start to the week after Wall Street broke its three-session losing streak on Friday.\n\nThe S&P/ ASX 200 climbed 50.8 points, or 0.6 per cent, higher to 8838.5 points, with 10 of 11 industry sectors in positive territory. Materials was the sole sector in the red.\n\nWall Street closed the week with a winning session. Credit: Bloomberg\n\nFinancial stocks were stronger, with shares in the big four banks higher in early trade. NAB and Westpac each added 1.1 per cent, Commonwealth Bank – the biggest stock on the index – was up 0.7 per cent and ANZ advanced 0.6 per cent.\n\nMining stocks were largely lower with iron ore heavyweights Rio Tinto (down 1.6 per cent), BHP (down 0.8 per cent) and Fortescue (down 1 per cent) sharply lower, as the price of the key steelmaking ingredient slid over the weekend. Gold miners were higher. Evolution Mining jumped 2.8 per cent, Northern Star edged up 0.1 per cent and Newmont rose 1 per cent in early trade.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/olympic-boxer-smoked-in-half-time-sprint-20250929-p5myn6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Olympic boxer smoked in half time sprint",
        "publish_date": "Mon, 29 Sep 2025 10:30:20 +1000",
        "category": "sports",
        "authors": [],
        "text": "Olympic boxer smoked in half time sprint\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/jobs-and-wages-have-boosted-budgets-bottom-line-ahead-of-rates-call/jdopyy4vp",
        "title": "Jobs and wages boost budget bottom line ahead of Tuesday's interest rates call",
        "publish_date": "Sun, 28 Sep 2025 22:33:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal budget is $18 billion better off thanks to a stronger-than-expected jobs market.\n\n\n\n\n\nThe final budget outcome, to be released on Monday, is set to show a deficit of just under $10 billion for 2024/25 — down from the $28 billion forecasted last financial year.\n\n\n\n\n\nTreasurer Jim Chalmers said a robust jobs market and a rise in take-home pay for workers were among the reasons for the uptick in budget performance.\n\n\n\n\n\nHe said the final results for the last financial year showed the federal budget was in a strong position.\n\n\n\n\n\n\"In dollar terms, we've made more progress on the budget in three years than any government in history,\" he said.\n\n\n\n\"We've turned two big Liberal deficits into two substantial Labor surpluses in our first two years, significantly reduced the deficit in our third year and continued to pay down debt,\" Chalmers said.\n\n\n\n\n\nThe overall budget deficit for the last full financial year is set to be 0.4 per cent of Australia's gross domestic product.\n\n\n\n\n\nChalmers said other factors, such as budget revenue upgrades being banked and spending restraint by the Commonwealth, also contributed to lower deficit levels.\n\n\n\n\n\n\"Today's figures show that the deficit in our third year is around a fifth of the forecast we inherited from the coalition and around a third of the forecast before the election earlier this year,\" he said.\n\n\n\n\n\n\"Responsible economic management is the hallmark of the Albanese Labor government and today's result reinforces that.\"\n\n\n\nAn estimated 70 per cent of revenue upgrades have been banked in the past three years.\n\n\n\n\n\nThe final budget outcome is also expected to show average real spending at 1.7 per cent across the seven years to 2028/29.\n\n\n\n\n\nThe release of the budget paper coincides with the Reserve Bank starting two days of deliberations on whether to cut interest rates again.\n\n\n\n\n\nThe central bank is widely expected to keep the official cash rate on hold at 3.6 per cent following a slight rise in monthly inflation.\n\n\n\n\n\nMonthly inflation in August rose from 2.8 per cent to 3 per cent, and while the Reserve Bank places more weight on quarterly figures, the increase has dampened expectations of further mortgage relief.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/working-in-a-gaza-field-hospital-the-view-from-an-australian-emergency-nurse/m1eyvcolm",
        "title": "Working in a Gaza field hospital: The view from an Australian emergency nurse",
        "publish_date": "Sun, 28 Sep 2025 21:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"So I'm here at the Red Cross Field Hospital in Rafah. I'm in our resuscitation area.\"\n\n\n\n\n\nFor the past five weeks, Australian nurse Jean-Philippe Miller has been working in southern Gaza.\n\n\n\n\n\n\"We've got our blood now so we can transfuse our patient. She's the young lady who's suffered a gunshot wound to her flank. She had damage to her spleen. She had damage to her lung collapsed and and blood in there.\n\n\n\n\n\n\"So we had to put a chest drain in - and drain out some of that blood. She remains with a high respiratory rate and high heart rate. It will give her this blood now. And it will help her stabilise her.\"\n\n\n\n\n\nAn emergency nurse originally from Melbourne, Jean-Phillipe has spent the last decade deploying with the Red Cross to South Sudan, Myanmar, Bangladesh and Syria - now on his fourth rotation in Gaza.\n\n\n\n\n\n\"The hardest thing, the most distressing thing is seeing children who are injured. We've had children with gunshot wounds, with shrapnel injuries, with blast injuries. The children who have lost their parents. They're calling out for their their dead parents in our hospital. And you see how traumatised they are.\n\n\n\n\n\n\"This is a hospital project in an active conflict zone we're a weapon-wounded hospital. We're seeing significant injuries here and yeah, I mean, it's confronting work.\"\n\n\n\n\n\nThe Red Cross Field Hospital in Rafah opened in May last year.\n\n\n\n\n\nIt was intended as a temporary facility, but is now one of the last fully functioning hospitals in Gaza.\n\n\n\n\n\n\"It is is a hospital made of tents. We have seven wards. We have up to 100 patients. We were 110 when I first arrived. It's kind of a pre-packaged hospital that is normally designed to only operate for several months.\"\n\n\n\n\n\nThe hospital is two kilometres from a Gaza Humanitarian Foundation aid site.\n\n\n\n\n\nAnd since it opened in May, the Red Cross has reported a surge in mass casualty incidents, saying 11 of 13 were linked to the aid distribution site.\n\n\n\n\n\nMedics say more than a third of patients were under 18.\n\n\n\n\n\nAnd nearly half were women.\n\n\n\n\n\nJean Phillipe says he's attended mass casualty incidents of around 30 to 50 patients, but says his national colleagues have seen much larger events in the last few months.\n\n\n\n\n\n\"The largest one was around 245 casualties arriving within a few hours. So it's near impossible to comprehend the chaos and the difficulty that that would be to treat all those patients.\n\n\n\n\n\n\"Overall, as a whole, that the hospital has treated over 4,500 weapon wounded individuals; and logged 300 deaths of people that have been trying to access food.\"\n\n\n\n\n\nThe hospital also constantly takes blood donations, often from the relatives of those injured, to provide lifesaving transfusions.\n\n\n\n\n\nLike every other medical facility in Gaza, the hospital operates with limited supplies.\n\n\n\n\n\nJean Phillipe explaining that the Red Cross provides colour-coded kits for first responders.\n\n\n\n\n\n\"So you've got red for critical patients, those with life-threatening injuries. Yellow for acute patients, green for the walking wounded, black for patients that have arrived deceased, and then you've got blue for those patients that have suffered unsurvivable injuries. And then it is more of a matter of making them comfortable and allowing them to die with some dignity.\"\n\n\n\n\n\nIsrael's military offensive in Gaza City in the north is driving tens of thousands of Palestinians south.\n\n\n\n\n\n\"There's a lot of desperation. There's people who are trying to find places to evacuate to - and they're unable to. There's people ... we've got staff members who they can't evacuate their families because they've got elderly parents. There's also costs involved with evacuations that people can't afford. So no doubt there are kind of more tents springing up around us in the south.\"\n\n\n\n\n\nEvacuations exacerbating existing challenges including access to food.\n\n\n\n\n\n\"Unfortunately, we are seeing more and more patients arrive to the hospital with signs of malnourishment. And this is really worrying for us because it delays recovery and increases risks of complications for these patients.\"\n\n\n\n\n\nJean Phillipe says the circumference of patients' upper arms are measured - to assess the severity of malnutrition.\n\n\n\n\n\n\"The challenges here in Gaza really comes down to food scarcity to high market prices and to the lack of availability of nutritional supplementation.\"\n\n\n\n\n\nAt the hospital, meals are donated.\n\n\n\n\n\n\"Patient and staff are getting their meals. This is what we have, a huge portion of rice. So patients and staff can come and collect it. And this is kindly donated to us from the World Central Kitchen.\"\n\n\n\n\n\nThere are also constant reminders of the surrounding war zone.\n\n\n\n\n\n\"That's our bell for the safe room, so we're going to lie flat and wait it out. There was just some shooting nearby so.\"\n\n\n\n\n\nMore than 500 aid workers have been killed in Gaza since October 2023, according to the UN.\n\n\n\n\n\nAustralian Red Cross CEO Andrew Colvin says 67 are Red Cross and Red Crescent staff.\n\n\n\n\n\n\"That is 67 deaths that didn't need to happen. That's 67 lives of volunteers who are putting themselves in the face of danger to help others. These people are not dispensable. We can't just look at this as a cost of conflict.\"\n\n\n\n\n\nDespite the daily trauma, Jean-Philppe says there are also reminders of resilience.\n\n\n\n\n\nA father surviving critical injuries to meet his newborn son.\n\n\n\n\n\n\"Overnight something quite miraculous has happened. His pregnant wife gave birth to a baby boy just 20 metres away in our maternity department. It is a moment that - despite all the pain and suffering that we do see here in Gaza, there are some moments of hope and joy.\"\n\n\n\n\n\nThe local carpenter Mohammed makes toys for the children and crutches for the injured.\n\n\n\n\n\n\"At peak times, he's been making about 16 pairs of these crutches per week. These are incredibly important in order to get our patients rehabilitated and back up on their feet.\"\n\n\n\n\n\nReflecting on his time in Gaza, Jean Phillipe says he wants people back home to see the human side of the conflict.\n\n\n\n\n\n\"I think it is very easy for us to kind of get lost in the numbers. Really, the people here are ordinary people in in extremely extraordinarily difficult circumstances.\n\n\n\n\n\n\"And these are people that had hopes and dreams, and they had jobs, and they had families. And I mean these people have lost everything. Like they've lost their homes, they've lost their loved ones.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/breast-cancer-patients-to-save-thousands-as-new-drug-added-to-pbs/udwi5kklx",
        "title": "Breast cancer patients in Australia to save thousands as new drug added to PBS",
        "publish_date": "Sun, 28 Sep 2025 09:06:19 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Thousands of Australians will pay considerably less for breast cancer treatment due to a new federal government decision.\n\n\n\n\n\nHealth Minister Mark Butler has announced that Truqap, a breast cancer drug, will be on the Pharmaceutical Benefits Scheme (PBS) from Wednesday, 1 October, with the start of Breast Cancer Awareness Month.\n\n\n\n\n\nBeing on PBS means the treatment will be on the government-subsidised list of medicines.\n\n\n\n\n\nTruqap is used to treat breast cancer that is either locally advanced or metastatic and cannot be removed through surgery.\n\n\n\n\n\nWithout the subsidy, patients were facing costs of $100,000 for a course of treatment on Truqap.\n\n\n\n\n\nFrom Wednesday, they will pay a maximum of $31.60 per script.\n\n\n\nREAD MORE Why women still fall through the gaps in Australia's breast cancer diagnosis process\n\nHealth Minister Mark Butler said the listing is expected to improve survival rates for those with metastatic breast cancer.\n\n\n\n\n\n\"We think that only about 1 in 3 women with metastatic breast cancer will go on to survive 5 years or more,\" he said.\n\n\n\n\n\n\"This new listing, Truqap, will provide that additional hope to — we think — about 3,000 women and a few men as well, every single year. Making a very big dent in some of the challenges we have around the survivability and quality of life for women with metastatic breast cancer.\"\n\n\n\n\n\nAndrea Smith, a founding member of Metastatic Breast Cancer (MBC) Action Australia, an organisation for people with metastatic breast cancer, has welcomed the recent decision.\n\n\n\n\"The estimated 24,000 people living with metastatic breast cancer in Australia often balance work and family responsibilities while dealing with the unrelenting psychological and physical demands of their diagnosis,\" she said.\n\n\n\n\n\nAccording to the federal government, in 2024, more than 21,000 Australians were diagnosed with breast cancer, about 13 per cent of all new cancer cases that year, and 3,305 died from the disease.\n\n\n\n\n\nFran Boyle, a medical oncologist at the Mater Hospital in North Sydney, who treats patients with metastatic breast cancer, said adding Truqap to the PBS \"means there is a new treatment option that can be used before chemotherapy, if this is desired.”\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-28-september-2025/tnffsaz6i",
        "title": "Evening News Bulletin 28 September 2025",
        "publish_date": "Sun, 28 Sep 2025 05:58:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nAnthony Albanese defends the decision to attend a UK Labour Party conference\n\nMoldovans vote in a high-stakes parliamentary election\n\nIndigenous athlete Kirra Wright wins Australia's first medal at the World Para Athletics Championships\n\nThe Prime Minister has defended the use of taxpayer funds to attend a UK Labour Party conference.\n\n\n\n\n\nAnthony Albanese is set to deliver a speech at the party's annual conference in Liverpool in the coming hours.\n\n\n\n\n\nThe engagement has been criticised by federal Opposition leader Sussan Ley, who says he should not use his official overseas visit to the UK to attend a domestic political event.\n\n\n\n\n\nMr Albanese says the trip to Liverpool is in line with his intention to hold various meetings to deepen engagement, including one that he had with the leader of UK's Conservative Party, Kemi Badenoch.\n\n\n\n\n\n\"We have a relationship with the United Kingdom. The United Kingdom has a free trade agreement with Australia. That is really important. It is about Australian jobs. Our economic benefit we receive from that free trade agreement - from this engagement. The AUKUS arrangements mean that we need to engage with the UK government and accepting the invitation of Prime Minister Starmer to meet not just with him, but with all of his ministers - is important. It is a part of my job.\"\n\n\n\n\n\n---\n\n\n\n\n\nMoldovans are casting their votes to determine which MPs will form the new 101-seat legislature.\n\n\n\n\n\nThe election is viewed by many as a choice between Moldova’s continued path toward European Union membership or closer ties with Russia.\n\n\n\n\n\nThe Head of the European Parliament election observation delegation says there has been ample evidence of Russian interference in the Moldovan election in the lead-up to voting day.\n\n\n\n\n\nIulian Groza is the executive director of the Institute for European Policies and Reforms. He says the stakes are very high.\n\n\n\n\n\n\"Moldova has now set a clear way towards becoming member of the European Union despite various elections we had in Moldova, Moldova managed to advance into accession negotiations. And we understand that and we are aware about the fact that Russia is looking at these elections as their ultimate probably battle.\"\n\n\n\n\n\nOpposition parties have dismissed claims of Russian interference, calling it a \"political show\".\n\n\n\n\n\n---\n\n\n\n\n\nHealthcare workers in Gaza say they are facing a mounting crisis, as Israel continues its offensive and fuel supplies run low in Gaza City.\n\n\n\n\n\nThe director of Al-Shifa hospital, Dr Mohammed Abu Salmiya, says if the hospital goes out of service, it will be catastrophic and thousands will die.\n\n\n\n\n\n\"We are still providing medical services to the people of Gaza City despite the ongoing invasion, the tanks approaching the hospital, and the continuous shelling. Our teams are committed to their duty.\"\n\n\n\n\n\nGaza's health authorities say the death toll in the strip has risen to nearly 66,000 (65,926), with over 167,000 injured since the conflict between Hamas and Israel erupted on October 7, 2023.\n\n\n\n\n\nThat toll includes 77 people killed and another 256 injured in the past 24 hours.\n\n\n\n\n\n---\n\n\n\n\n\nPatients have welcomed the listing of a breast cancer treatment on the Pharmaceutical Benefits Scheme.\n\n\n\n\n\nTruqap is used to treat locally advanced or metastatic breast cancer that cannot be removed by surgery.\n\n\n\n\n\nThe treatment will be on the government-subsidised list of medicines from Wednesday, coinciding with the start of Breast Cancer Awareness Month.\n\n\n\n\n\nWithout the subsidy, patients were facing costs of $100,000 for a course of treatment on Truqap. Under the listing, they will pay a maximum of $31.60 per script.\n\n\n\n\n\nFederal Health Minister Mark Butler says the listing is expected to boost the survival rate outcomes for those with metastatic breast cancer.\n\n\n\n\n\n\"We think that only about 1 in 3 women with metastatic breast cancer will go on to survive 5 years or more. This new listing, Truqap, will provide that additional hope to - we think - about 3,000 women and a few men as well, every single year. Making a very big dent in some of the challenges we have around the survivability and quality of life for women with metastatic breast cancer.\"\n\n\n\n\n\n---\n\n\n\n\n\nTo sport and in athletics, First Nations athlete Kirra Wright says she is excited to win Australia's first medal on the opening day of the World Para Athletics Championships in New Delhi.\n\n\n\n\n\nThe 17-year-old won a silver medal in her global debut - competing in the Women's Shot Put F36 event.\n\n\n\n\n\nWright says the result brings her a step closer to achieving her dream of representing Australia at the Paralympic Games.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-we-are-family-we-should-work-together-palau-presidents-challenge-to-australia/mcmwdac58",
        "title": "INTERVIEW: 'We are family, we should work together': Palau President's challenge to Australia",
        "publish_date": "Sat, 27 Sep 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/republican-albanese-meets-the-king-as-opposition-questions-taxpayer-bill-for-uk-trip/l61hmhwc6",
        "title": "Republican Albanese meets the King, as Opposition questions taxpayer bill for UK trip",
        "publish_date": "Sat, 27 Sep 2025 21:24:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "King Charles has hosted Anthony Albanese and his fiancée Jodie Haydon at the sprawling Balmoral Castle grounds in the Scottish Highlands.\n\n\n\n\n\nAt the same time, the Opposition is questioning the use of taxpayer funds for the prime minister to travel to Liverpool tomorrow to deliver a speech at a UK Labour conference, supporting British Prime Minister Keir Starmer, who is trailing in the polls.\n\n\n\n\n\nOpposition leader Sussan Ley says Albanese is in the UK as the nation's prime minister, \"not the leader of the Australian Labor Party\".\n\n\n\n\n\n\"He shouldn't be swanning around on the taxpayer dollar at Labour political conferences hanging out with his left-wing mates,\" she said.\n\n\n\n\n\n\"I met with Kemi Badenoch yesterday,\" Albanese said, referring to London talks with the UK Opposition leader to defend against claims of partisanship.\n\n\n\nAlbanese also maintains that, given the Australia-UK free trade deal and the AUKUS agreement , it's important to engage with various members of the ministry.\n\n\n\n\n\nHe told SBS World News he would be meeting with the UK defence minister and home affairs minister while in Liverpool.\n\n\n\nA royal and a republican\n\nAlbanese also took a day trip from London to take up the audience with Australia's monarch as part of his trip to the UK.\n\n\n\n\n\nThe prime minister is a staunch republican — he even appointed an assistant minister for the republic when he was first elected to the top job — but he said there was no appetite for a republic referendum in this term of parliament.\n\n\n\n\n\n\"I have always supported an Australian as our head of state,\" the prime minister told SBS World News.\n\n\n\n\n\n\"But the existing arrangements are in place. We have, I think, a very respectful relationship, and we have a Monarch, His Majesty, who's very passionate in the interests about Australia, interested about world affairs and the future, and the opportunity to engage with him constructively is one that I will always take up.\"\n\n\n\n\n\nAustralian tourist Deb Miller was travelling in Scotland and came to see Balmoral Castle when she noticed a convoy of cars arriving at the gates.\n\n\n\nPrime Minister Anthony Albanese and partner Jodie Haydon arrive at the gate to Balmoral Castle for an audience with King Charles III. Source: AAP / Lukas Coch Initially, she thought a member of the royal family may have been approaching.\n\n\n\n\n\n\"It would have been nice if he stopped and said g'day,\" she said of the prime minister's arrival — gliding through the gates in a car with darkened windows.\n\n\n\n\n\nAlbanese travelled to the remote part of Scotland and entered the gates at Balmoral.\n\n\n\n\n\nMiller had arrived at the castle hoping to sight-see, but it was closed to the public today, so seeing her prime minister on the other side of the world had to suffice for a tourist experience.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-footballer-fandi-ahmad-is-a-singaporean-sporting-legend-we-find-out-why/o9g54fzkl",
        "title": "INTERVIEW: Footballer Fandi Ahmad is a Singaporean sporting legend: We find out why",
        "publish_date": "Sat, 27 Sep 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-says-kitchen-cabinets-and-sofas-are-a-threat-to-america-20250929-p5mym4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump says kitchen cabinets and sofas are a threat to America",
        "publish_date": "Mon, 29 Sep 2025 11:56:28 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Even his “reciprocal” tariffs on all imports could be replaced by Section 232 versions, should the US Supreme Court uphold lower court judgements that they are illegal, although (a) the Supreme Court has a recent history of giving the administration what it asks for and (b) it would be far more time-consuming to use the section, which requires a particular and detailed investigatory process, and the administration would have to refund billions of dollars of tariff revenue in the meantime. Citing national security threats as a pretext for hitting imports of kitchen cabinets or furniture with his tariffs is clearly an artifice to enable Trump to build a wall against, it seems, almost all manufactured imports and the raw or semi-finished components to make them. It’s also a way of maximising revenue for a government that is awash in deficits and debt. Next up in Trump’s war on the world. The kitchen. Credit: istock Last year the US raised $US90 billion ($137.4 billion) from customs and excise duties. Recently, that revenue has been running at close to $US30 billion a month and it will keep rising as the most recently added tariffs (the reciprocal tariffs went live only last month) start to contribute.\n\nMost estimates of the tariffs are that they will generate around $US2.5 trillion over a decade, if they remain in place over that period. Loading They are of course, a particularly regressive tax on American consumers – they are paid for either by the US importer or are passed onto consumers via higher prices, with lower-income households hit hardest – despite Trump’s continued assertions that foreign countries are paying them. The Yale Budget Lab says they will cost the equivalent of an average annual per-household loss of income of $US2400 in 2025 dollars, will lower US GDP growth by 0.4 per centage points in the long run and increase the unemployment rate by 0.7 percentage points next year. They will also impact the US inflation rate, indeed they are already are impacting it.\n\nThe US Federal Reserve Board’s preferred measure of inflation is the core personal consumption expenditures index. On Friday the index, excluding volatile food and energy prices, showed a 0.3 percentage point increase in August relative to July. In July, then index rose 0.2 percentage points from June. The index is 2.9 per cent ahead of the same month last year. He’s also foreshadowed national security tariffs on robotics, industrial machinery., semiconductors and medical devices and no doubt will come up with some other products deemed critical to America’s security. In other words, prices and inflation are ticking up even before the full impact of the main tariffs – the baseline and reciprocal tariffs on the rest of the world – is felt. That’s despite the fact that most of the tariffs’ costs have, so far, been absorbed in the margins of US businesses rather than passed onto consumers.\n\nMany businesses also boosted their imports at pre-tariff prices significantly ahead of the well-flagged introduction of the main tariffs, allowing them to maintain pre-tariff pricing until their inventories have been depleted. There’s no evidence that exporters to the US have lowered their prices to absorb any material proportion of the tariffs’ costs. Loading Companies also wouldn’t want to raise prices and lose sales while there is a possibility the Supreme Court will deem the tariffs illegal and force the revenue to be returned to importers. The full effects of the existing tariffs won’t be seen for months and, with Trump regularly adding to the list of affected products, perhaps well into next year. While the impact on prices and inflation has been relatively muted to date, within the revised data released by the Commerce Department last week that showed robust 3.8 per cent growth in real GDP in the June quarter (after negative growth in the first quarter), business spending fell by an annualised 5.6 per cent in real terms. Business spending is being chilled by the uncertainties generated by Trump’s trade wars and immigration policies.\n\nWith wages growth relatively flat, the overall growth in the economy appears to have been powered by consumption funded by households drawing on their savings, perhaps to get in ahead of the tariffs. That’s not sustainable. The US has only days to avert another threat to growth, the shutting down of the US government if congressional Republicans and Democrats can’t find a short-term compromise before the government’s funding runs out on Wednesday, the start of America’s new financial year. Trump, who had refused a request from Democrat leaders for a meeting, has changed his mind and will now discuss a short-term spending bill with them. US Federal Reserve chair Jerome Powell. It’s a thankless task being a central banker in Trump’s America. Credit: Bloomberg The Democrats, while saying they want to avoid a shutdown, are insisting on an extension of health care subsidies and the restoration of cuts to health care spending in the administration’s One Big Beautiful Bill Act, while Republicans want an extension of the funding before they will negotiate (if they will negotiate).",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/i-stood-there-stunned-knockout-bid-secures-carindale-postwar-cottage-20250929-p5mym9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I stood there stunned’: Knockout bid secures Carindale postwar cottage",
        "publish_date": "Mon, 29 Sep 2025 11:49:25 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A postwar cottage in one of Brisbane’s fastest growing suburbs was snapped up for $1.4 million in seconds on Saturday after an “intimidating” gambit from a young buyer.\n\nFor the vendors, who paid just $565,000 for the three-bedroom Carindale home in 2019 and spent about $100,000 on renovations, the result was nothing short of a windfall.\n\nA first-home buyer opened the auction at $1.2 million, before a woman from Cairns launched the final knockout bid just moments later.The move left the four other bidders speechless and selling agent Joanna Gianniotis, of Place Estate Agents, stunned.\n\n“That bid was an intimidation tactic … and it worked. The reserve was set at $1.3 million,” said Gianniotis. “The other bidders just stood there and looked at each other.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/downsizer-pays-7-3m-for-four-bedroom-queens-park-home-at-auction-20250929-p5mylt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Downsizer pays $7.3m for four-bedroom Queens Park home at auction",
        "publish_date": "Mon, 29 Sep 2025 11:48:10 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A charming four-bedroom home in Queens Park sold for $7.31 million at auction on Saturday, $1.36 million above its $5.95 million reserve.\n\nGuided at $5.5 million, the Federation residence at 8 Rawson Avenue comes with dual access and a double garage.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nEleven people registered, and four actively bid for the parkside property a short stroll from Centennial Park. Two of the active buyers were represented by buyer’s agents.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/there-s-more-in-us-title-run-is-over-but-panthers-vow-more-to-come-20250929-p5mykl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘There’s more in us’: Title run is over, but Panthers vow more to come",
        "publish_date": "Mon, 29 Sep 2025 11:33:00 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "Is it the end of an era at Penrith, or did a 2025 campaign that ended in a painful preliminary final loss double as a chance to re-tool for another golden run?\n\nPanthers co-captain Isaah Yeo is in the latter camp, warning rival NRL clubs that his deposed champions will be back bigger and better next year.\n\nThe Panthers’ run of four-straight premierships ended at Suncorp Stadium on Sunday when, after leading Brisbane 14-0 in the preliminary final, they conceded 16 unanswered second-half points.\n\nWhile Yeo was shattered not to have qualified for a sixth successive grand final, he was “really proud of the group” after the Panthers slumped to last on the ladder mid-season before rallying to reach the play-offs.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-man-drowns-at-burleigh-heads-in-weekend-tragedy-fog-shrouds-brisbane-cbd-but-spares-airport-20250926-p5my69.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live:  Premier says Suncorp Stadium upgrades a ‘very high’ priority; Man drowns at Burleigh Heads in weekend tragedy; Fog shrouds Brisbane CBD but spares airport",
        "publish_date": "Mon, 29 Sep 2025 11:31:40 +1000",
        "category": "sports",
        "authors": [],
        "text": "Premier David Crisafulli says upgrades to Suncorp Stadium are a “very high” priority and evaluations are under way to consider further venue capacity.\n\n“I’m not talking about just normal bare bones main­tenance, I’m talking about a proper investment into the ­stadium,” Crisafulli said ahead of Sunday’s blockbuster NRL preliminary final.\n\nThe premier said there would “need to be an investment ahead of [the] 2032” Olympics.\n\nAn artist’s impression of planned upgrades to Suncorp Stadium under the previous Labor government, showing new screens. Credit: GIICA RTI\n\n“I don’t think Suncorp at the moment is at the level it should be,” he said.\n\n“It’s a great venue and it’s part of who we are as a state … there will be additional funding to Suncorp over and above.\n\nLoading\n\n“We do believe that when the eyes of the world are on us, we have to make sure that there’s a new stadium that’s world class, but our existing venues also have to be the best they can be.”\n\nThe former state government had planned upgrades for the 52,500-seat venue in its Olympic plan, but a right-to-information request from Brisbane Times revealed the stadium had not been set to change dramatically.\n\nCrisafulli said Sports Minister Tim Mander was already assessing changes to Lang Park, which last underwent major renovations in 2011 to repair significant flood damage, and works were “under way” on potential upgrades.\n\n“I’m not talking about just normal bare bones maintenance as in depreciation maintenance, I’m talking about a proper investment in the stadium,” he said.\n\n“There are a number of venues in this state that aren’t at the level where they should be, and we should use the Olympic and Paralympic Games as an opportunity to have that finish line.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/it-s-daisy-s-home-away-from-home-but-it-could-soon-be-knocked-down-for-mass-housing-20250902-p5mrrb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It’s Daisy’s home away from home. But it could soon be knocked down for mass housing",
        "publish_date": "Mon, 29 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Cindy Yin"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size On a quiet street in Sydney’s inner west, tucked in between warehouses, is an unassuming building where sounds of squeaking shoes on matte red floors and the echoing of balls ricocheting off bats fill the air. For years, the RTTC Table Tennis Academy in Rhodes has been Sydney’s hotspot for nurturing world-class table tennis players, training more than 300 students each week. But that could all end after the state government’s three-person Housing Delivery Authority recommended the fast-tracking of a proposal to build 2020 homes on the site. A Herald analysis of some of the largest HDA projects reveals a considerable gap in amenity – some of the proposed homes will be just a stone’s throw away from shops, train stations, schools, and hospitals, while some residents will live up to 17 kilometres away from train stations and even further from schools, shops, or emergency departments. RTTC Table Tennis Academy on Averill Street in Rhodes, Sydney. Credit: James Brickwood The HDA’s recommendations bypass local councils, which accelerates development approval times for major residential developments above $60 million in metropolitan areas and $30 million in regional NSW. Since February, more than 91,100 potential homes have been declared state significant under the HDA pathway.\n\nAdvertisement\n\nRhodes If it goes ahead, the development will mean the table tennis academy on Averill Street will have to shut its doors so the building can be demolished to make way for 2020 apartments, resulting in a loss of public amenity in an already densely populated suburb. It has become a second home for 15-year-old Daisy Xie, who for the past five years has attended at least four times a week. Xie said closure of the centre that was a perfect in-between meeting point for her and her playing partner would upend their training. “It’s already difficult to find a training partner that suits you. Besides, this venue is so good – if we have to move elsewhere it will disrupt training and make things a lot more inconvenient,” she said. “The centre has flat, even grounds, so the ball won’t roll around. It’s also well lit and has air conditioning. It will be difficult to find a location just as suitable.”\n\nAdvertisement\n\nClub manager Jecie Yao said it signed a 10-year lease with the landlord in 2023. But the uncertain future of the centre means it could be asked at any point to close up and relocate, which would present countless logistical nightmares. “We hope it’s not happening, but I know eventually it will happen. It’s pretty tough when a business has to relocate. We’ll have to do the marketing and start from scratch,” Yao said. Rhodes has no schools, and the proposed development is a 12-minute walk to Rhodes station. Marsden Park In between a permanently shuttered laboratory and an expanse of overgrown fields, is a package of empty land in Marsden Park that could have 800 homes. The proposed greenfield development at 264A South Street is 4.3 kilometres from Schofields train station, 2.2km from the nearest grocery store, and almost 6.8 km away from the closest primary school and high school. The closest hospital with an emergency department is 6.7km away, in Mount Druitt.\n\nAdvertisement\n\nRichmond Road is also the only major road in – or out – of Marsden Park, meaning the already congested corridor could buckle under pressure from more residents moving in. Located 50km north-west of the CBD, Marsden Park is a relatively new suburb known for its sprawling small-lot, dark-roofed large houses that have become synonymous with homogenous new-build homes on Sydney’s periphery. Marsden Park is far from basic amenities. Credit: Rhett Wyman The population has boomed in these greenfield suburbs. Marsden Park and its neighbouring suburb Shanes Park added nearly 18,000 people between 2019 and 2023, bringing its total population to 23,778. Experts have previously flagged issues with these fringe suburbs, such as rising heat, poor transport links, minimal recreational space, and the absence of essential amenities. Appin\n\nAdvertisement\n\nThe largest development recommended by the HDA comprises 2499 homes in Appin, 71km south-west of Sydney on the road between Wollongong and Campbelltown. While Appin sits within the Greater Macarthur growth area, and is a key plank in the state’s plan to build 377,000 homes by 2029, amenities and infrastructure are few and far between for its 3500 residents. The closest hospital in Campbelltown is more than an 18-kilometre drive away, and Douglas Park, the nearest train station is almost 17 kilometres from the proposed site. While there is a long-term vision for nearly 16,000 new homes in Appin, a cap of 2499 homes has been put in place, and will only increase when wastewater and infrastructure such as roads and sewage systems are delivered first by Transport for NSW and Sydney Water. Draft plans from the developer include three new local centres with shops and services, new transport corridors and road upgrades, three new school sites, and sites for emergency service facilities. Development along Appin Road, a highway linking Sydney’s south-west suburbs with Wollongong. Credit: Brook Mitchell\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/magical-number-young-couple-beats-six-others-with-knockout-offer-for-spotswood-house-20250929-p5mylu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Magical number’: Young couple beats six others with knockout offer for Spotswood house",
        "publish_date": "Mon, 29 Sep 2025 11:17:14 +1000",
        "category": "finance",
        "authors": [
            "Abbir Dib"
        ],
        "text": "A house in Spotswood drew in seven young bidders before a knockout offer of $1 million sealed the deal at auction on Saturday.\n\nThe three-bedroom home at 20 Forrest Street was listed with a price guide of $780,000 to $860,000, with the reserve set at $850,000.\n\nThe opening bid of $780,000 sparked competitive bidding in $10,000 increments. Jellis Craig Inner West director Glen Baird said the auction was dominated by younger buyers, and the winner was a young couple.\n\n“They were all young couples. There was an older couple bidding, but they were bidding for their son in America,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-demons-said-good-bye-to-goodwin-should-they-do-the-same-to-petracca-and-oliver-20250826-p5mpt6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Magpies fielded the oldest finals team ever. Now it’s time to make tough calls",
        "publish_date": "Mon, 29 Sep 2025 11:12:04 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Jon Pierik",
            "Marc Mcgowan",
            "Scott Spits",
            "Vince Rugari"
        ],
        "text": "The Magpies, however, may tell Mihocek they won’t budge from their two-year offer. Mason Cox, 34, faces an uncertain future, while Dan Houston – and the Pies – will agree they need more from him next season. Bobby Hill, having missed so much football because of personal issues, remains a close watch. Something to look forward to: Houston was not the same counter-puncher he was at Port Adelaide in his first year with the Magpies – expect that to change next year. He is exemplary with ball in hand, and needs to have more of it. Skipper Darcy Moore had an indifferent season, and may need to revisit the balance between pure defending and hunting the ball. Get that right, and the Magpies – already built on defence – will be even stronger. Coach Craig McRae wants a blend of good draft picks and established players through this trade/draft period. They missed out on Jack Silvagni, but will trade for Swans’ forward Jack Buller.\n\nAnother established defender may be front of mind, for Jeremy Howe, 35, is showing signs of wear and tear. Predicted best and fairest: Nick Daicos.\n\n– Jon Pierik Adelaide (fifth after finals loss)\n\nWins: 18 Losses: 7 Draft picks: 18, 41, 48, 54, 66, 72. What went well: There was much to like. The Crows not only leapt back into the finals for the first time since 2017, but won 12 of their final 13 home-and-away games to finish as minor premier. Matthews Nicks’ game plan, essentially built on going long down the line, held up during the season proper. Taylor Walker may not like what he hears from the Crows’ bosses in his end-of-season meeting. Credit: AFL Photos via Getty Images Skipper Jordan Dawson and full-forward Riley Thilthorpe were All-Australians, while fellow forwards Taylor Walker and Darcy Fogarty, and forward-midfielder Ben Keays, also enjoyed strong home-and-away seasons. Former Demon Alex Neal-Bullen was a fine acquisition, and could be a future skipper.\n\nIzak Rankine provided creativity up field and close to goal, and was badly missed through suspension for a homophobic slur in September. “What it did do was it changed the dynamic of our group,” Nicks said of Rankine’s absence. “Izak is, and this is my opinion, one of the best players in the game, so I think if any team loses their best player, then it becomes quite challenging to replace that.” It could be a rough exit meeting for: Taylor Walker. The champion forward, 35, is off contract, and his time may be up after a modest finals campaign. The Crows may feel Thilthorpe and Fogarty need to be empowered and shoulder greater responsibility. Fellow veteran Brodie Smith, 33, is also weighing up his future. Something to look forward to: This was a year when the Crows built a foundation for what should be a five-year premiership tilt. Yes, they failed to win a quarter in their two finals defeats, becoming the first minor premiers in more than 40 years to be dumped from September in straight sets, but that sting should fire this squad. However, they do have holes. While unbeaten in 13 games against bottom nine teams, they were 6-7 against top nine teams, their scoring and defence dropping off.\n\nThey need another X-factor in addition to Rankine, while a forward line of three talls didn’t hold-up in September, when the ball is on the ground more. Another strong defender would also help. Nicks will need to tinker with his game plan. As he said after the semi-final loss to Hawthorn, it’s harder to move the ball the way you want in the finals when the intensity rises. The Crows have been linked with off-contract Lions forward Callum Ah Chee.\n\nBest and fairest tip: Jordan Dawson.\n\n– Jon Pierik Suns gun Matt Rowell takes a physical battering in every game he plays. Credit: Getty Images Gold Coast (sixth after finals loss)\n\nWins: 16 Losses: 9 Draft picks 6, 14, 15, 32, 56, 68 What went well: The Suns have finally risen. This was a breakthrough season for a club, which not only made its maiden finals run in its 15th attempt, but conjured a miraculous win over the Dockers in Perth. Skipper Noah Anderson and fellow midfielder Matt Rowell were first-time All-Australians, their sustained efforts in the midfield a sight to behold. The physical punishment Rowell takes reminds us of the hits an NFL running back endures. Marking forward Ben King was superb in front of goal but will need to add a new trick or two. Fellow forward Ben Long had a breakout campaign, although he was disappointing in the semi-final, while recruits Daniel Rioli and John Noble delivered what was expected of them at half-back.\n\nSam Collins is a beast at full-back, Touk Miller delivered run and carry, while Bailey Humphrey showed signs of morphing into the Suns’ version of Cam Rayner. It could be a rough exit meeting for: Jed Walter. The young forward was dropped after round 19 and did not return to the side. While the former Suns academy product is contracted for next season, he could be used in a trade for Carlton’s Charlie Curnow. While a star in the making, Mac Andrew will face a strong review of his finals performances. Something to look forward to: There is plenty to look forward to with this emerging list, coach Damien Hardwick declaring his team is built for September. The base is there, it’s now time to build internally and through canny trades. The Suns were too reliant on Rowell and Anderson, and need another robust midfielder who can deliver under pressure. The unicorn that is Ethan Read struggled in the semi-final but has the height and talent to be a long-term marking threat. They could lose Sam Flanders, who has two years remaining on his contract, and Malcolm Rosas, through the trade period.\n\nBest and fairest tip: Noah Anderson.\n\n– Jon Pierik Fremantle (8th) Wins: 16. Losses: 8. Draft picks 13, 31, 38, 49, 67. What went well: After last year’s meltdown, when they slipped from the top eight at the start of August to 10th by the end, the Dockers held firm this year and returned to the finals for the first time since 2022, winning 12 of their last 14 games to finish sixth. Caleb Serong again starred in the Fremantle midfield. Credit: AFL Photos\n\nThey adopted a more attacking gameplan after five losses from their first nine games, but failed to fully embrace this mantra in a stinging elimination final defeat to the Suns. “We’ve grown so much throughout the year with the way we play our footy, the way we embrace challenges, the way we’ve improved our footy on the road,” coach Justin Longmuir said after the loss to the Suns. Marking talls Josh Treacy (44 goals) and Patrick Voss (37) had strong seasons, while Murphy Reid claimed the AFLPA’s best young player award. Former premiership Tiger Shai Bolton (28) was arguably the recruit of the year. Defender Jordan Clark and midfield stud Caleb Serong were All-Australians, while Andrew Brayshaw was unlucky not to be.\n\nIt could be a rough exit meeting for: Jye Amiss. While he played all 24 games, Amiss, a key marking tall, returned a modest 32 goals, and averaged career-lows in marks and disposals per game. He had only two touches (one goal) in the elimination final before being subbed off. Amiss could be a trade target. Then there’s ruckman Sean Darcy. Will he and Luke Jackson continue to be a one-two punch in the ruck? We’ll see. Something to look forward to: The Dockers are building nicely. They had an average age of just 24.9 years through the season – the fourth youngest in the competition. Fremantle ruckman Sean Darcy. Credit: AFL Photos AFL great James Hird has set high expectations for them next year, despite their loss to the Suns on Saturday.\n\n“I think they have to be top four next year with their list and the way they’ve had the final this year and the performances against the best teams in the competition. I’ve really gotten locked in that top four next year,” Hird said. But they cannot afford to have lulls and slip back into a defensive mindset when the pressure is at its greatest. This will be Longmuir’s greatest challenge. Best and fairest: Caleb Serong.\n\n– Jon Pierik GWS (7th)\n\nWins: 16. Losses: 8. Draft picks: 12, 30, 36. What went well: After a dodgy first half of the year, the Giants won nine of their last 10 home-and-away games, scoring more than 100 points in each of them. In the end, they finished with one of the AFL’s best attacking records, just two points behind third place. Toby Greene and his Giants were eliminated at home by the Hawks. Credit: AFL Photos At their best, they were absolutely awe-inspiring: their stunning third quarters against the Swans in the second Sydney derby of the season, plus their (eventually unsuccessful) comeback against Hawthorn in their elimination final, will live long in the memory. The challenge will be closing the gap between their frightening best and their timid worst. It could be a rough exit meeting for: Everyone. The Giants have now lost their past four finals, including two at home (and three in Sydney) – the sort of record that each player needs to take a varying degree of responsibility for, as well as the coaching group, and will require them all to look deeply within over the summer. September stumbles are becoming too much of a theme.\n\nWhat’s clear is that they concede too many entries, which can’t be wholly pinned on the six poor blokes in defence who had to deal with that avalanche. All things considered, they managed OK, but it felt unsustainable, and so it has proved. And there’s a similar problem going the other way. When they’re on, they’re on, but the Giants’ attack falls to pieces when they mindlessly blaze away inside 50 as they did against Hawthorn, which completely undermines their forward set-up. Composure in key moments is lacking in this side across every line, and that’s not an easy thing to add. Sam Taylor is a star defender for GWS, but the Giants’ defensive unit is under pressure. Credit: AFL Photos Something to look forward to: As Adam Kingsley said post-match, the Giants still have “all the pieces” to contend, although their ageing stars are running out of petrol. But the window remains open, their next tier of rising stars will be better with another season under their belts and if they can address their inconsistencies, get to the psychological nub of their finals failures and have some better luck with injuries, there’s no reason why they won’t be back contending again in 2026. Best and fairest tip: Finn Callaghan showed exactly why St Kilda threw a $17 million, 10-year contract offer at him; thank heavens he said no. He and Tom Green (likely second in the best and fairest) run this team now.\n\n– Vince Rugari\n\nWestern Bulldogs (9th) Wins: 14. Losses: 9. Draft picks: 10, 28 What went well: Offensive power. The Doggies poured on the goals this season, scoring more points (2493) than any other team. Led by Marcus Bontempelli, Tom Liberatore, Ed Richards and an increasingly influential Sam Darcy up forward, they beat up teams with regularity. While that resulted in a 14-9 record, the team from the west missed the finals. The Bulldogs were an offensive juggernaut in 2025 but still missed finals. Credit: Getty Images\n\nIt could be a rough exit meeting for: Jamarra Ugle-Hagan. The one-time No.1 draft pick has occupied so much of the Bulldogs top brass’ time this season. It would be fascinating to witness his official exit meeting given there’s so much to discuss for a player who didn’t add to his tally of 67 AFL games this season. Defenders will be in the spotlight, too, but each player on the list will be pressed for explanations as to why the Dogs simply couldn’t beat teams who were vying for finals spots. Something to look forward to: Plenty, to be truthful. The Dogs have recorded 14 wins in consecutive seasons; in 2024 they played finals, so they can’t wallow in pity about what happened this year. Jamarra Ugle-Hagan didn’t play a game for the Bulldogs this season. Credit: Justin McManus Darcy, at age 22, remains one of the most exciting young players in the game. Aaron Naughton’s best season (65 goals) is a beacon of hope for even better things, too.\n\nBest and fairest tip: I’ve landed on Ed Richards ahead of Tom Liberatore. Bontempelli’s missed games through injury will cost him.\n\n– Scott Spits Port Adelaide (13th) Wins: 8. Losses: 15. Draft picks: 26, 42, 60 What went well: That’s tough to answer because this was an extremely disappointing year, despite Ken Hinkley’s protestations the list is set up well for 2026. Port Adelaide chairman David Koch stuck with Ken Hinkley to the end. Credit: Getty Images\n\nHaving made a preliminary final last year, the Power slipped markedly. However, skipper Connor Rozee and fellow star midfielder Zak Butters were typically industrious, while forward Mitch Georgiades delivered a half-century of goals for the first time. Aliir Aliir enjoyed another stellar season in defence, while Travis Boak and Hinkley were given a classy send-off against the Suns, the victory fully deserved. Zak Butters won Port Adelaide’s best and fairest award - the John Cahill Medal - for the third consecutive year in 2025. Credit: Getty Images It could be a rough exit meeting for: President David Koch and his board. The succession plan designed to ease Hinkley out and Josh Carr to prepare for the senior role next season was done with the best of intentions, but the scoreboard says it was a failure. If Hinkley wasn’t the man to take the team forward, then Carr should have been immediately installed, and Hinkley given a thank-you payout for his years of fine service.\n\nSomething to look forward to: The Power should be back in the finals hunt next year, but they will need to get busy in the trade period. Do they have enough true stars? Missing out on Nasiah Wanganeen-Milera will hurt. Late season injuries have given the youngsters a chance. We like what we have seen of Jack Whitlock, who can play ruck and go forward. Best and fairest winner: Zak Butters.\n\n– Jon Pierik Essendon (15th)\n\n\n\nWins: 6. Losses: 17. Draft picks: 4, 5, 22, 25. What went well: The Bombers have some superb youngsters. In his second year, Nate Caddy again gave glimpses of the player he could become, with 20 goals and more flashes of brilliance. Isaac Kako gave Bombers fans something to get excited about. Credit: AFL Photos Isaac Kako impressed with his smarts around goals and showed late in the season he can also be developed as a pinch-hitter in the centre square. Archie Roberts, the lowest draft pick of the trio, could end up being a steal. The teenager is advanced beyond his years, demonstrating composure and skill in a defence that was under siege.\n\nAngus Clarke is another of the club’s 15 debutants this year who has provided Bombers fans with hope in a wretched campaign. It could be a rough exit meeting for: Ben Hobbs. In his fourth season, Hobbs, 21, failed to take a more significant role in the side. Worryingly for Hobbs, despite Essendon’s litany of injuries, he was dropped for the first leg of the final round and could not break back into the team. Hobbs has stagnated in his past two seasons, reaching 20 disposals in just three of his past 30 games. His disposal remains a worry. If time has run out for the first-round pick from the 2021 draft, it would raise further queries on the Bombers’ recruiting and player development. Something to look forward to: The draft. The Bombers have a strong hand in this year’s draft after acquiring Melbourne’s first selection through a pick swap last year. Even accounting for father/son, academy and NGA picks, the Bombers should have access to two very good youngsters.\n\nIf Sam Draper departs through free agency, that should deliver another first-round pick. Unfortunately for the Dons, this is not considered the strongest draft, but one experienced recruiter has said they would not be surprised if smokies emerge deeper in the pool. Best and fairest: Zach Merrett.\n\n– Andrew Wu West Coast (18th) Wins: 1. Losses: 22. Draft picks: 1, 14, 19, 32, 50.\n\nWhat went well: Sorry West Coast fans, this is not pretty. The Eagles have managed 11 wins in four seasons, including just one victory, over St Kilda, in a torturous 2025 season. But there’s always a glimmer of hope and performances and players to celebrate. Two-time Richmond premiership player Jack Graham, who joined the Eagles for 2025, comfortably exceeded his career average for disposals (19.2 possessions per game this season) and had 7.8 tackles per game (which is considered “elite”). It could be a rough exit meeting for: The defensive unit and the defence coaches. West Coast comfortably conceded the highest number of points (2438) this season, leaving them with a limp percentage of 60.1. If premierships are built from the backline, they need to focus there.\n\nIt will be fascinating to see the club’s attitude towards Tim Kelly, who played 19 games in his sixth season with the Eagles. Something to look forward to: It couldn’t get any worse, could it? If West Coast haven’t bottomed out, where is the bottom? The Eagles can expect the No.2 draft pick as compensation for losing free agent Oscar Allen to Brisbane, so that’s something. And Harley Reid is staying for now, having resisted interest from big Victorian clubs to extend until the end of 2028. Eagles fans can only look forward to better times ahead. Best and fairest tip: Jack Graham.\n\n– Scott Spits\n\nNorth Melbourne (16th) Wins: 5 Losses: 17 Draws: 1 Draft picks: 20, 21, 39, 57 What went well: They made it out of the bottom two! The Kangaroos and coach Alastair Clarkson would have liked to see more progress on the ladder, but he remains bullish they are heading in the right direction. North Melbourne avoided another bottom-two finish. Credit: Getty Images\n\nAfter a torrid first six rounds and the odd thrashing beyond that, North were generally more competitive, including securing a draw with Brisbane, but there were no statement wins. Instead, they would be pleased with Harry Sheezel’s transition to a midfield-forward role, the continued development of Colby McKercher and career-best seasons from Cam Zurhaar and Paul Curtis. It could be a rough exit meeting for: Will Phillips. The No.3 pick in the COVID-19-impacted 2020 draft class played only seven matches this season and does not appear to be in the Roos’ plans. He should latch on somewhere, but needs to get going to save his career. Something to look forward to: Next year promises to be the season when North Melbourne finally take a genuine leap. How high that is remains to be seen, but the expectations must rise, even if that is as modest as aiming for between eight and 10 wins.\n\nThe young talent is there, and they may have finally found Nick Larkey’s sidekick in Cooper Trembath. A stiffer defence and another progression from their midfield group should enable them to take another belated step. Best and fairest: Luke Davies-Uniacke.\n\n– Marc McGowan Richmond (17th)\n\nWins: 5. Losses: 18. Draft picks: 2,3 What went well: Plenty for a club that was widely tipped to sail through turbulent waters with a drastically young and inexperienced list. The season began on the best note possible with a stunning round-one win over Carlton. The nature of the victory, a come-from-behind triumph, set the tone for the season for both the Tigers and Blues. Throw in highlights from Maurice Rioli jnr, and all was swell. Tim Taranto had a strong season as one of the Tigers’ on-field leaders. Credit: AFL Photos It could be a rough exit meeting for: The club’s forwards and the forward coaches. The Tigers scored the fewest number of points (1449), less even than West Coast, a club that limped to one victory, compared to Richmond’s five.\n\nVeteran spearhead Tom Lynch could cop a drive-by sledge for missing games. He played only 16 matches (due largely to a suspension) after a tough couple of years with injuries. Something to look forward to: There’s so much to look forward to. Realistically, the Tigers will battle to replicate their win-loss tally (5-18) as they continue to develop their young group. It could be a case of the “second-year blues” for a host of players. But Richmond will be eyeing off their matches against Carlton and the chance to knock them off again.\n\nBest and fairest tip: Tim Taranto.\n\n– Scott Spits St Kilda (12th) Wins: 9. Losses: 14. Draft picks: 7, 43, 58. What went well: The Saints were a popular choice to sink into the bottom four, but finished three wins clear of that territory while prioritising youth. The Saints will welcome Tom De Koning in 2026 and welcome back Max King after another injury-riddled season. Credit: AFL Photos\n\nSt Kilda’s round two upset of Geelong was a false dawn, but a peek at their upside. They also demolished Fremantle and executed the greatest three-quarter-time comeback from 46 points down against Melbourne. That latter win was the first of four in a row before they almost upset GWS in round 24. Nasiah Wanganeen-Milera’s emergence as a top-liner was massive, while Max Hall followed Cooper Sharman and Max Heath as a mid-season draft success story. It could be a rough exit meeting for: Zak Jones. The brother of ex-Demons captain Nathan was not one of the five Saints who re-signed last week, and faces an uncertain future. Jones turns 31 in March, and St Kilda already made it clear they want to get younger in the midfield.\n\nSomething to look forward to: Another two years from Wanganeen-Milera, who they retained despite Adelaide and Port Adelaide wanting him. There is optimism about what Mattaes Phillipou, Darcy Wilson, Alix Tauru and Tobie Travaglia can become, while the likes of Hugo Garcia, Isaac Keeler, Hugh Boxshall and Lance Collard also show promise. Tom De Koning will be on the list in 2026, and Max King will hopefully be fit again. Best and fairest tip: Nasiah Wanganeen-Milera.\n\n– Marc McGowan Sydney (10th)\n\nWins: 12. Losses: 11. Draft picks: 9, 27, 45, 63. What went well: Having won just four of their first 12 games under new coach Dean Cox, the Swans showed fortitude to rebound and win eight of their final 11 games. Brodie Grundy returned to his best form for Sydney in 2025. Credit: AFL Photos Playmaker Isaac Heeney had a tough start, but then reminded everyone why he is a legitimate star. Chad Warner was a consistent threat through the midfield, but did not have the impact he enjoyed through 2022-24.\n\nA serious ankle injury through the pre-season sidelined Errol Gulden for months and seriously hurt the Swans’ midfield and creative drive, just as his return in round 15 had the reverse effect. Brodie Grundy reinforced why he is one of the competition’s premier ruckmen. It could be a rough exit meeting for: Skipper Callum Mills. For the Swans to make the leap next season, Mills needs to consistently be on the park. His 2024 campaign was derailed after injuring his rotator cuff in a Mad Monday celebration. He missed the first half of this year because of plantar fascia. He needs to lead the way in 2026. Something to look forward to: This has been a year of recalibration for the Swans, and learning, particularly for Cox, who is now more at ease in the top role after replacing John Longmire.\n\nWhile it feels somewhat of a wasted year, the Swans are still in top-four mode, and are likely to be strengthened through the trade period. They just need to get moving earlier next season. Best and fairest tip: Isaac Heeney.\n\n– Jon Pierik Carlton (11th) Wins: 9. Losses: 14. Draft picks: 34, 44, 62*. What went well: Not much. George Hewett was one of few Blues to exceed expectations, putting together a career-best season in the midfield.\n\nJack Silvagni and Tom De Koning are both leaving the Blues. Credit: Getty Images Better known as a defensive onballer, Hewett became a prolific ball-winner in his own right. In his 12th season on an AFL list, the former Swan is a strong chance to win his first best and fairest award. Veteran Nick Haynes overcame a horror start at the club to become dependable defender. He deserves another year. Young midfielder Cooper Lord is one to watch. George Hewett stepped up for the Blues in 2025, but didn’t get enough support. Credit: Getty Images The Blues blooded seven debutants, the best of whom looks to be key defender Harry O’Farrell, who, unfortunately, injured his knee.\n\nOther gains were bitter-sweet. Jack Silvagni was a revelation in defence but played just 13 games and is now on the move. Ollie Hollands found plenty of the ball in his new role as a running defender but his kicking needs work. It could be a rough exit meeting for: Mitch McGovern. The Blues are keen to get money off their books and the writing is on the wall for the 30-year-old, who narrowly missed a games trigger that would have earned a contract extension. With Silvagni walking out and O’Farrell to be unsighted for much of 2026, the defender may yet get another year, but it will be on the Blues’ terms. Veterans Adam Saad and Blake Acres both had ordinary seasons. Something to look forward to: With mass change underway in the coaches box, free agents Tom De Koning and Silvagni confirming their departures, and ongoing chatter about Charlie Curnow, it’s already been a turbulent off-season for the Blues, and the AFL home and away season isn’t even officially over yet! Expect that turmoil to continue for some time yet.\n\nBut once they ride that out, there will be hope again. The departures of De Koning and Silvagni will strengthen the Blues’ draft hand to acquire highly-rated Harry Dean as a father-son pick. Decimated by injury in 2025, the Blues can vault back into finals contention with a cleaner bill of health. Curnow (assuming he stays) and Sam Walsh had interrupted preseasons which severely impacted their year. Harry McKay missed half the season. Matthew Cottrell and Elijah Hollands, two of their best runners, hardly played, and heart-and-soul defender Nic Newman didn’t get on the field at all.\n\nThen there’s the prospect of a fit Jagga Smith. Get all them right and the Blues should be stronger – but this was a year when they fell well below expectations. Best and fairest tip: George Hewett.\n\n– Andrew Wu Melbourne (14th) Wins: 7. Losses: 16. Draft picks: 23, 51, 59* What went well: Kysaiah Pickett graduated from a star goalsneak to a game-breaking midfielder/forward who now rivals skipper Max Gawn as the club’s best player. Despite their troubles, the Demons secured Pickett’s prized signature in a huge coup, keeping him in the red and the blue until the end of 2034 on a lucrative contract.\n\nMidfielders Christian Petracca and Clayton Oliver are stars for Melbourne and both have long-term contracts, but that no longer means their respective futures at the club are guaranteed. Credit: Getty Images Gawn was again a colossus, talking through action on the field and becoming their spokesperson for almost every crisis off it. Rebounding defender Jake Bowey has taken the next step to become a driver of the team while Harvey Langford, the No.6 pick in last year’s draft, is the Demons’ next A-grade midfielder after making a seamless transition to senior football. Veteran forward Jake Melksham, with 33 goals from 18 games, earned himself another contract, which was confirmed by the Demons just days after their season ended.\n\nIt could be a rough exit meeting for: Clayton Oliver and Christian Petracca. Do two of Melbourne’s greatest players want to stay? If either player wants out, the club should not stand in their way. Coming back from a life-threatening injury, Petracca’s season was steady, and he will likely finish in the top six of the club’s best and fairest award, but a long way from his game-breaking ways. Loading\n\nOliver was better than last year when his campaign was compromised by his off-field issues. Both still have time to return to their best but the competition trend away from contest and stoppage towards speed and ball use is against them. Jacob van Rooyen went backwards in a season the club needed him to hold down a key forward posting. Something to look forward to: The appointment of a new coach always renews hope among the supporter base. Nathan Buckley is the early favourite but whoever succeeds Simon Goodwin must decide whether the core of this list can rise again after two years of diminishing returns or if it’s time to invest more heavily in the next generation. In Harvey Langford, Xavier Lindsay and Caleb Windsor, the Dees have three highly talented young guns who will play a lot of football for the club.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/stuck-up-storm-prop-lashes-broncos-heading-into-decider-20250929-p5mymx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Stuck up’: Storm prop lashes Broncos heading into decider",
        "publish_date": "Mon, 29 Sep 2025 10:58:27 +1000",
        "category": "sports",
        "authors": [
            "Roy Ward"
        ],
        "text": "Loading\n\nMelbourne Storm prop Stefano Utoikamanu has labelled the Broncos as “stuck up” in the opening salvo of grand final week.\n\nThe NSW Blues prop has steadily improved for the Storm in his first season since joining from Wests Tigers, and he didn’t hide his dislike for Brisbaneon Monday.\n\nUtoikamanu didn’t identify individual players, but the Brisbane side that plays on Sunday will contain headline grabbers such as Reece Walsh, Ezra Mam, and Kotoni Staggs.\n\nThe Storm’s players have already anointed Utoikamanu as their “enforcer” especially with towering prop Nelson Asofa-Solomona suspended for the grand final.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/jess-fox-discusses-the-slalom-world-championships-20250929-p5mymr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jess Fox discusses the Slalom World Championships",
        "publish_date": "Mon, 29 Sep 2025 10:53:12 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Jess Fox discusses the Slalom World Championships\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-as-wall-street-snaps-losing-streak-20250929-p5myk4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Banks, healthcare shares shine as ASX climbs higher",
        "publish_date": "Mon, 29 Sep 2025 10:40:26 +1000",
        "category": "finance",
        "authors": [
            "Stan Choe"
        ],
        "text": "The Australian sharemarket has made a bright start to the week after Wall Street broke its three-session losing streak on Friday.\n\nThe S&P/ ASX 200 climbed 50.8 points, or 0.6 per cent, higher to 8838.5 points, with 10 of 11 industry sectors in positive territory. Materials was the sole sector in the red.\n\nWall Street closed the week with a winning session. Credit: Bloomberg\n\nFinancial stocks were stronger, with shares in the big four banks higher in early trade. NAB and Westpac each added 1.1 per cent, Commonwealth Bank – the biggest stock on the index – was up 0.7 per cent and ANZ advanced 0.6 per cent.\n\nMining stocks were largely lower with iron ore heavyweights Rio Tinto (down 1.6 per cent), BHP (down 0.8 per cent) and Fortescue (down 1 per cent) sharply lower, as the price of the key steelmaking ingredient slid over the weekend. Gold miners were higher. Evolution Mining jumped 2.8 per cent, Northern Star edged up 0.1 per cent and Newmont rose 1 per cent in early trade.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/olympic-boxer-smoked-in-half-time-sprint-20250929-p5myn6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Olympic boxer smoked in half time sprint",
        "publish_date": "Mon, 29 Sep 2025 10:30:20 +1000",
        "category": "sports",
        "authors": [],
        "text": "Olympic boxer smoked in half time sprint\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]