[
  {
    "url": "https://www.9news.com.au/world/trumps-commerce-secretary-says-new-electronics-tariff-exemptions-are-temporary-chip-tariffs-coming/c5cb18ef-b15c-46fa-bc22-94505d7d5ab5",
    "title": "Confusion over Trump's new tariff exemption",
    "publish_date": "Mon, 14 Apr 2025 01:19:12 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Tariff exemptions announced on electronics like smartphones and laptops are only a temporary reprieve until the Trump administration develops a new tariff approach specific to the semiconductor industry, US Commerce Secretary Howard Lutnick said.\n\nWhite House officials, including President Donald Trump himself, spent the weekend downplaying the significance of exemptions that lessen but won't eliminate the effect of US tariffs on imports of popular consumer devices and their key components.\n\n“They’re exempt from the reciprocal tariffs but they’re included in the semiconductor tariffs, which are coming in probably a month or two,” Lutnick told ABC's “This Week”.\n\nTrump added to the confusion hours later, declaring on social media that there was no “exception” at all because the goods are “just moving to a different\" bucket and will still face a 20 per cent tariff as part of his administration's move to punish China for its role in fentanyl trafficking.\n\nThe Trump administration had said it would exclude electronics from broader so-called reciprocal tariffs, a move that could help keep the prices down for phones and other consumer products that aren’t usually made in the US.\n\nChina's commerce ministry in a Sunday statement welcomed the change as a small step even as it called for the US to completely cancel the rest of its tariffs.\n\nElectronics goods such as the iPhone are exempt according to the latest tariff announcements. (Getty)\n\nSparing electronics was expected to benefit big tech companies like Apple and Samsung and chip makers like Nvidia, though the uncertainty of future tariffs may rein in an anticipated tech stock rally tonight.\n\nUS Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to most of the tariffs levied on China or the 10 per cent baseline tariffs elsewhere.\n\nIt was the latest tariff change by the Trump administration, which has made several U-turns in its massive plan to put tariffs in place on goods from most countries. White House officials sought to dismiss any suggestion of a reprieve as the weekend progressed.\n\n﻿\n\nWorkers inside a Foxconn facility in China in 2021. Foxconn is the company that assembles iPhones for Apple. (AP)\n\nOn Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. In his post Sunday on TruthSocial, he promised the White House was “taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN.”\n\nSome had assumed the exemption filed night reflected the president’s realisation that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the US any time soon, if ever.\n\nThe administration has predicted that the trade war prod Apple to make iPhones in the US for the first time, but that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China.\n\nIt would take several years and cost billions of dollars to build new plants in the U.S., burdening Apple with economic forces that could triple the price of an iPhone and torpedo sales of its marquee product.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/class-action-launched-against-bupa-aged-care/291bd9af-df6f-423a-bddf-e3fb263426c4",
    "title": "Class action begins against aged care provider Bupa",
    "publish_date": "Mon, 14 Apr 2025 00:54:23 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A﻿ class action has been launched today against aged care provider Bupa over allegations it provided poor quality services at its residential homes.\n\nThe Federal Court lawsuit alleges that between July 2019 and April 2025, Bupa Aged Care Australia's homes failed to deliver the standards promised to residents.\n\nLauren Meath, senior associate from Echo Law in Melbourne, says the healthcare company \"regularly and consistently\" failed to meet minimum acceptable benchmarks for care.\n\nBupa is a major aged care services provider in Australia. (Bupa)\n\n\"Aged care residents and their families should be able to trust that they will receive safe and high‑quality care when entering aged care.\n\n\"The experience should match what is promised and marketed by Bupa, and what is expected by the Australian community and at law. Sadly at Bupa that has not been the case.\"\n\nThe Royal Commission into Aged Care Quality and Safety in 2019-2020 heard evidence of \"unacceptably high levels of substandard care\" in the aged care system, including in facilities owned and operated by Bupa.\n\nAmong its findings, the commission highlighted systemic understaffing at for-profit aged care providers and failures in providing the correct staffing-skill mix.\n\nThe lawsuit alleges failures in these areas continue today at Bupa aged care homes.\n\nAged care royal commissioners Tony Pagone, left, and Lynelle Briggs. (Photo by Arsineh Houspian) (Nine)\n\n\"We know that staff on the floor are doing their best to provide safe and high-quality care. But individual nurses, care workers and support staff can only do so much,\" said Meath.\n\n\"Bupa's own reporting confirms widespread understaffing and failures to meet the minimum acceptable level of care required under Australian law at each of its aged care facilities.\n\n\"These are systemic failures at the corporate level and at the expense of residents.\" ﻿\n\nThe class action alleged Bupa breached the contractual obligations it owes to residents under its resident agreements, and contravened guarantees under consumer law.\n\nThe lawsuit is seeking to recover damages for breach of contract.\n\nBupa has been contacted by 9news.com.au for comment.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/seventeen-seventy-drowning-two-dead-one-fighting-for-life-after-central-queensland-drowning-tragedy/851be47c-66d4-4184-8e04-3215f6709438",
    "title": "Two dead, one fighting for life after Queensland drowning tragedy",
    "publish_date": "Sun, 13 Apr 2025 09:44:12 +0000",
    "category": "sports",
    "authors": [
      "Apr"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/coachella-2025-celebrities-guests-in-pictures/bc92360a-dc65-463c-a3d5-f7c0079b04ac",
    "title": "Wild fashion and on-stage antics during weekend one of Coachella",
    "publish_date": "Mon, 14 Apr 2025 01:07:23 +0000",
    "category": "entertainment",
    "authors": [
      "April"
    ],
    "text": "1 of 26 Attribution: Los Angeles Times via Getty Imag\n\nThe iconic Coachella Valley Music and Arts Festival, also known simply as 'Coachella', is now in full swing in the sunny Californian desert.\n\nCoachella 2025 is showcasing some of the biggest names in music and is attended by the most﻿ famous people in the world.\n\nThe likes of Lady Gaga, Queen's Brian May, Green Day and Belinda Carlisle and the Go-Go's have already graced the stage during the epic first weekend.\n\nSee the photos here.﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/insurance-industry-worried-about-lithium-battery-fires/105160348",
    "title": "Insurance industry 'very worried' about lithium battery fires",
    "publish_date": "Mon, 14 Apr 2025 00:58:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "In Western Australia, an average of three house fires a week are caused by exploding lithium batteries.\n\nThe Insurance Council of Australia said while most firms had no plans to charge higher premiums for households with the batteries, or to try to restrict their use, it was deeply concerned.\n\n\"Most policies will cover you for a fire no matter how it starts because fires can start with an electrical fault,\" the council's chief executive Andrew Hall told ABC Radio Perth.\n\n\"They can start with a candle that maybe catches light on the curtains and the like.\n\n\"When you're covered for fire, you know, regardless of how it starts, most home and contents policies will cover you for that fire event.\n\n\" Having said that, though, we are very, very worried about lithium-ion batteries. \"\n\nFurniture and carpet burnt inside a family home during a lithium battery-sparked a fire. (Supplied)\n\nWhile Mr Hall said insurers were unlikely to start excluding homes with the batteries from coverage, it was concerned about the regulations governing their sale, and safety.\n\n\"We're very worried about poor quality ones that have been coming into the country in truckloads and not being handled correctly, particularly while they're being recharged.\n\n\"And we're very worried we're going to see some catastrophic loss driven by one of these fires in the near future.\"\n\nExploding like 'absolute bombs'\n\nThe potential for catastrophic damage arises from the way that batteries catch fire, and the difficulty in putting them out.\n\nNeighbours battle over charging EVs in apartment car parks Photo shows A green electric vehicle parked in an underground charging bay. Strata owners are increasingly banning electric vehicles from charging in basement car parks as fire safety authorities disagree over the risk of battery fires.\n\n\"When the fire starts in them, they're not put out with water and people can get very injured trying to use water to douse the flames. They need special fire extinguishers,\" Mr Hall said.\n\n\"The footage that I have seen of these batteries when they catch fire is horrific. They are absolute bombs.\n\n\"And if you're caught in a confined space within an apartment, even worse, within an elevator, and they decide to explode, it can have terrible life consequences.\"\n\nDepartment of Fire and Emergency Services (DFES) fire investigation and analysis unit district officer, Mark Hayes, said it could be hard to tell when a battery was about to combust.\n\n\"There are four stages of damage to a lithium-ion cell before it catches fire. It's got to sustain either electrical, mechanical or thermal damage and then it starts to undergo thermal runaway,\" he said.\n\n\"You don't see this, but once it does undergo thermal runaway, the battery will swell and then it will explode outside of itself.\n\n\"If you see or hear your battery starting to off gas I would evacuate because the toxins that come out from a lithium-ion battery are deadly.\"\n\nNot just e-scooters to blame\n\nWhile many people associate the battery fires with e-rideables like bikes and scooters, lithium batteries are in use all over the home, and many of us couldn't imagine life without them.\n\n\"The same technology has been around since 1991 when Sony first patented the battery for its Handycam,\" Mr Hayes said.\n\nLithium batteries are used in e-bikes. (ABC Radio Perth: Emma Wynne)\n\nMr Hall said fires had been started by batteries in a multitude of devices.\n\n\"A leaf blower will have a rechargeable lithium-ion battery in it,\" he said.\n\n\"We hear a lot of stories about tradies who are charging their power tools overnight.\n\n\"They may have dropped that power tool and damaged the battery unknowingly and then plugged it in to be charged, and that's what catches fire.\n\n\"We had one case in in Sydney where an entire golf clubhouse burnt down because the golf buggies were charging and the lithium-ion batteries caught fire and burnt the whole clubhouse down.\"\n\nMinimising the risk\n\nMr Hall said the insurance industry was keen to work with regulators and the fire services to address the problem.\n\nOne way it sees to ameliorate the risk is tougher regulations on the sale of batteries and their chargers, as using cheaper imported batteries not designed for a particular device, or the wrong charger, increases the risk of fire.\n\n\"In New South Wales, for example, they've put in very strict controls now on the consumer affairs level about what batteries can be imported into New South Wales,\" he said.\n\n\"Batteries that are not the original manufactured battery for that bike, bought cheaply online, they're the ones that catch fire.\"\n\nA lithium battery started a fire that gutted a Queensland house. (Supplied: Queensland Fire Department)\n\nMr Hayes said it was a risk that was not worth taking.\n\n\"There was one [fire] that occurred in the northern suburbs [of Perth] where an e-scooter was on charge with a charger that didn't belong to that scooter.\n\n\" Making sure that you use the charger that comes with the item is one way that you can minimise the risk. \"\n\nIn Western Australia, DFES is in talks with the department of Energy, Mines, Industry Regulation and Safety (DMIRS) about regulating batteries.\n\nIn the meantime, Mr Hayes recommended against buying cheaper imported batteries online.\n\n\"Things that are made in Australia require a ticket approval. Things that are imported don't,\" he said.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/bosses-at-callide-power-station-step-down-after-explosion/105171868",
    "title": "Bosses at trouble-plagued Qld power station step down after explosion",
    "publish_date": "Mon, 14 Apr 2025 00:50:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "The bosses of a trouble-plagued power station in central Queensland have left the company after an explosion earlier this month.\n\nOne of Callide Power Station's generators is expected to be offline until the end of May after a \"pressure spike\".\n\nLast week, Energy Minister David Janetzki was called out for failing to mention the unit was offline in a speech that spruiked the ongoing role of coal in the energy grid.\n\nOn Sunday, the government accused state-owned CS Energy of failing \"to communicate the seriousness of the incident\" on April 4.\n\nJust days before, Mr Janetzki had said he was briefed on what happened and that it was \"publicly available information\".\n\nEnergy Minister David Janetzki was called out for failing to mention the unit was offline in a speech that spruiked the ongoing role of coal in the energy grid. (AAP: Darren England)\n\nOn Monday Deputy Premier Jarrod Bleijie confirmed two CS Energy employees had left the company.\n\n\"The CEO, my understanding, had indicated last week that they intended to resign,\" he said.\n\n\"We have asked that particular individual to bring forward their resignation, which was effective on the weekend.\n\n\"And the second general manager has also vacated the position.\"\n\nMr Bleijie said a safety investigation was ongoing.\n\n\"My office has a daily briefing from Workplace Health and Safety of incidents, and it basically said that an incident had taken place,\" he said.\n\n\"It didn't go to the extreme because obviously there's an investigation afoot now.\"\n\nCallide Power Station, in Biloela, is a central Queensland coal-fired facility. (ABC News: Scout Wallen)\n\nSpeaking on the weekend, Premier David Crisafulli said he was \"blown away\" by the seriousness of the incident and blamed the former Labor government, saying the unit \"didn't deteriorate in the 150 days of our government\".\n\nMeanwhile, Opposition Deputy Leader Cameron Dick accused the premier of hiding what he knew about the explosion.\n\nIn 2021, an explosion at Callide left nearly half a million homes without power.\n\nCS Energy has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/australian-firms-manufacturing-china-caught-trump-tariffs/105165444",
    "title": "Australian companies caught in the US-China trade war",
    "publish_date": "Mon, 14 Apr 2025 00:31:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Beatrice Toh was only just recently celebrating her business' launch in the United States.\n\nThe Melbourne-based entrepreneur started her children's company as a young mum, when she dreamed up a reusable alternative to throwaway colouring books.\n\nThe expansion of HeyDoodle to the US has been almost a year in the works, and it has cost time and money to configure the toy range for the American market.\n\nBeatrice Toh celebrating her business's expansion into the US at a toy fair in New York in 2025. (Supplied)\n\nNow, celebration has turned to stress and \"delirium\", as Ms Toh and her small staff navigate an escalating and fast-moving trade war between the US and China.\n\n\"It's definitely a curveball,\" she says.\n\nHeyDoodle's experience goes against the headlines that US President Donald Trump has given Australia a relatively workable tariff of 10 per cent, as part of his administration's economic nationalism.\n\nTariffs are essentially a tax on goods as they enter a nation's borders.\n\nIn HeyDoodle's case, the company expects to pay the far higher tariff that the US has slapped on China — now more than 100 per cent and rising.\n\nThat's because the firm's silicone colouring mats are manufactured in China.\n\nThey are then shipped directly from a factory there to the US to wholesalers and retailers, such as bookshop giant Barnes & Noble.\n\nUS and Australian authorities can't confirm tariff details\n\nMs Toh doesn't believe it will matter that her company is Australian-owned.\n\nShe also doesn't think she can get around the Chinese tariff by bringing goods made there back to Australia before shipping them to the US.\n\n\"It's all about the country of origin,\" Ms Toh tells ABC News.\n\nNeither US authorities nor Australia's own trade department confirmed this situation to ABC News.\n\nYet several trade law experts agreed with Ms Toh's initial assessment of the situation. And they contend the US will likely over-rule Australia's longstanding free trade agreement with the US.\n\nThe cost of this HeyDoodle colouring mat could soar in the US due to the tariffs on Chinese-made goods. (ABC News: Emilia Terzon)\n\nKPMG chief economist Brendan Rynne notes that the statements that have come out of the Trump administration so far include ones about reducing \"the risk of transhipment and evasion\".\n\n\"It's about where the goods are produced,\" Mr Rynne says.\n\n\" The framework they're proposing to adopt seems to get changed on a daily basis. \"\n\nMr Rynne's understanding is that the tariffs being implemented by the US will be applied to the price stamped on products as they enter their border, known as \"ad valorem\" tariffs.\n\nIn HeyDoodle's case, this could push up the price of one of the brand's standard colouring book sets from $30 to upwards of $50.\n\nMs Toh doesn't think many American shoppers will pay that.\n\n\"It's not an essential item. It's just an activity for your child,\" she says.\n\n\" It's going to be tricky. There's going to be a portion of where we absorb the tariff, our wholesalers absorb some, and then the customers will just have to pay a higher price. But I think everybody suffers. \"\n\nAustralian brands exposed to China tariffs\n\nTariffs are also a new source of stress for swimwear company owner Steve Philpott.\n\nSwimwear company owner Steve Philpott says the past few weeks have been \"crazy\". (ABC News: John Gunn)\n\nJust like HeyDoodle, Mr Philpott's Sydney-based company has several labels that are made in China and sold into the US market, including its biggest brand, Sea Level.\n\nHe also has received the same advice from trade experts about the higher China tariffs applying to any products he makes there and then sends into the American market.\n\n\"It's been a bit of a roller-coaster,\" he says about the past few weeks.\n\n\" We have to see a bit of humour in it because it's just so crazy. \"\n\nWhat a weak Aussie dollar means for travellers Photo shows A woman takes a photograph of illuminated cherry blossoms in full bloom The Australian dollar has been tracking lower against all major currencies, making overseas travel more expensive.\n\nThe fashion brand's exposure to the US market is substantial, with Mr Philpott estimating almost a quarter of Sea Level's sales are now there.\n\nHe agrees with Ms Toh that there's \"no way\" the brand can wholly pass the extra tariff onto US shoppers.\n\n\"The market won't handle that,\" he says.\n\nOther fashion brands that manufacture in China and sell in the US market include luxury women's label Zimmermann, mass-market chain Cotton On, and iconic Australian underwear brand Bonds.\n\nNone of these companies replied to queries from ABC News.\n\n\"The bulk of Australian fashion is made offshore,\" Mr Philpott notes.\n\n\" It might sound nice that [Australia] is only getting 10 per cent [tariffs] right now, but if it's made offshore and it's made in China, the tariff is huge. \"\n\nMr Philpott was also already bracing for a less publicised change to trade rules between the US and China, due to come into effect in early May.\n\nThe \"de minimis exemption\", which allowed parcels valued under $US800 ($1,270) to enter the US duty-free, will end for Chinese goods that are mailed direct to American online shoppers.\n\nThis so-called \"Shein and Temu tax\" will also impact Australian brands that ship directly from China to online shoppers in the US, KPMG's Mr Rynne believes.\n\nLoading...\n\nCompanies could move manufacturing out of China\n\nUS President Donald Trump's tariffs have swung around wildly in the last few weeks, resulting in a wind back of those threatened against most nations to a flat 10 per cent, branded for now as a temporary pause.\n\nThe Trump administration says it's using these tariffs to prioritise manufacturing of goods in the US, however analysts observe that the singling out of China speaks to broader geopolitics.\n\nIn Trump's America, toasters will be astronomically expensive. Here's why Photo shows A close up shot of Donald Trump looking at Xi Jinping. Of all Trump's miscalculations this week, his biggest miscalculation of all may be assuming that China would not hit back.\n\nMr Philpott hopes the situation between the two economic superpowers calms down, and as a result he isn't making any \"hasty decisions\" about withdrawing production from China.\n\nHowever, he's exploring contingency plans: factories in Cambodia, and further afield in Africa.\n\n\"They don't have the same supply chain and same ability as China does,\" he says.\n\n\"China is literally the best in the world for what we do. We have long-term relationships, 13 and 14 years, with factories.\n\n\"So moving to another country is not what we want to do. Setting up in the US is not viable for us either.\"\n\nOne of Mr Philpott's other brands, Bond-Eye, is mostly made in Australia, and he is now wondering whether that could be \"leveraged\" if the higher taxes on China and lower imposts on Australia continue.\n\nOne silver lining for exporters is the tanking Australian dollar, which briefly fell below 60 US cents at some points last week, making anything sent out from Australia cheaper for overseas buyers.\n\nAustralian swimwear brands like Sea Level and Bond Eye can't afford to absorb all of the tariffs. (ABC News: John Gunn)\n\n\"Producing more in Australian is challenging. Our [garment] industry has been so decimated,\" Mr Philpott says of making more garments onshore.\n\n\"The government really does need to support the Australian fashion industry.\"\n\nIn Melbourne, HeyDoodle's Beatrice Toh doesn't think she can move production of her silicone books to Australia, which she already tried to do when starting out, only to be told it wasn't possible.\n\n\"They said we don't have the inks necessary here to do it,\" she recalls.\n\n\"It would be great to get some [government] support, especially for small businesses.\n\n\"I've got lots of friends in the same boat at the moment. We all don't know what to do.\n\n\"We're running out of stock in the US. Do we send more stock in?\"\n\nIn a statement, the government agency that works with Australian offshore traders says it has been \"working closely with impacted industries and exporters\".\n\nTrade Minister Don Farrell declined to be interviewed for this story.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/community-environmental-concerns-for-lancelin-limesand-mining/105135180",
    "title": "Residents fear mining will remove 'perfect fire barrier' sand dunes",
    "publish_date": "Sun, 13 Apr 2025 23:57:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Opposition to sand mining along the coast north of Perth has heated up, with locals pointing to a recent emergency fire as a reason for the dunes to stay.\n\nIn late March, lightning sparked several fires near the coastal town of Lancelin, about 125 kilometres north of Perth.\n\nOne emergency level blaze came close to the town, prompting the evacuation of a caravan park.\n\nLoading...\n\nDepartment of Fire and Emergency Sevices incident controller Andrew Duckworth said the surrounding sand dunes \"absolutely\" prevented the quickly-moving flames from reaching the community.\n\n\"Not only is [the dune] unvegetated, but it also has some height to it and that would effectively stop embers travelling across as well,\" he said.\n\n\" In a lot of ways, it's a perfect fire barrier. \"\n\nShifting mining from the red to green area triggered community conflict. (Supplied: Aglime of Australia)\n\nBut the same sand dunes are currently being mined by Aglime of Australia for limesand, commonly used by the agriculture industry to improve soil quality.\n\nThe company mined the southern end of the dunes for decades, and only in recent years began operating further north.\n\nThe Department of Energy, Mines, Industry Regulation and Safety assessed the environmental impacts of sand mining when the mining proposal was submitted in 2020, and approved the project.\n\nThe company has an extraction rate of 200,000 – 400,000 tonnes per year and the current mine has an estimated life of 25 years, according to its website.\n\nLocals worry damage already done\n\nTina Broughton is a representative of Save Lancelin Dunes, a community action group which has been lobbying to stop the mining since March 2023.\n\n\"The sand dunes act as a natural fire break that have protected us from multiple catastrophic fires in the past,\" she said.\n\n\"And [they're] also an important part of the coastal processes that protect our shoreline.\"\n\nTina Broughton fears time is running out to save the dunes. (Supplied: Tina Broughton)\n\nMs Broughton said the group was engaging coastal engineers to show how the sand removal was negatively impacting the seaside ecosystem.\n\n\"Significant damage has already been done, so every tonne of sand that is leaving now is just adding to that,\" she said.\n\nMs Broughton said the company should look at other sources of limesand with less community impact — and the Save Lancelin Dunes group would become more vocal for change.\n\nLancelin is between the ocean and sand dunes, with coastal scrub beyond. (ABC Midwest & Wheatbelt: Chris Lewis)\n\n\"We've sort of gone [for the] 'softly, softly' approach and we are now really coming to a head,\" she said.\n\n\" We will start making it uncomfortable for people … expect to see protests. \"\n\nEcosystem health a concern\n\nSally Thompson from the University of Western Australia's Centre for Water and Spatial Science said fire protection from a sand dune varied based on its vegetation density.\n\nSally Thompson says sand dunes play an important role in seaside environments. (ABC News: Emma Wynne)\n\nShe agreed dunes were significant for communities and ecosystems, and said extensive sand mining could strip away coastal protection.\n\n\"Those dunes [are] the buffer in between things like rising sea levels and high levels of storm surge, extreme weather events and those more interior coastal environments,\" Dr Thompson said.\n\n\" We're increasing the risk that if we do have extreme weather events that they're going to have an impact for the inland. \"\n\nLocal shire wants more support\n\nGingin shire president Linda Balcombe said the mine's location was having a negative impact on the community but also understood the importance of limesand.\n\nLinda Balcome says she is balancing community and mining industry concerns. (Supplied: Shire of Gingin)\n\nShe said ultimately the decision was out of her hands as the state government managed the tenements.\n\n\"We've got our hands tied a little bit,\" Cr Balcombe said.\n\n\"We need the state to take a stand in this and assist us in finding the solution.\"\n\nThe Western Australian government said the sand dunes were iconic and provided significant tourism value, but were also an important limesand resource which was essential to the agriculture sector.\n\nTourists flock to the dunes for sand boarding and off-road driving. (ABC Midwest & Wheatbelt: Sam McManus)\n\nA spokesperson said sand mining had occurred for decades in Lancelin, and was well regulated.\n\n\"Aglime is currently operating under an approved proposal that has been subject to an appropriate environmental assessment, including the assessment of potential impacts to water resources and other land users,\" they said.\n\nAn Aglime of Australia spokesperson said it operated under \"a rigorous governmental mining regulation framework\" to provide an essential resource to WA's agriculture industry.\n\nAglime says less than 9 per cent of Lancelin's sand dune area has been mined since the 1980s. (Supplied)",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/90th-minute-winner-liverpool-two-wins-from-premier-league-title/105172866",
    "title": "90th-minute winner has Liverpool six points from Premier League glory",
    "publish_date": "Sun, 13 Apr 2025 22:45:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Virgil van Dijk has scored a late winner against West Ham to move Liverpool within six points of the Premier League title.\n\nA 2-1 victory at Anfield means Arne Slot's team needs to win just two more games to be certain of a record-equalling 20th English league title and draw level with Manchester United's total.\n\n\"A big relief,\" was how the Liverpool manager described Van Dijk's 89th-minute header.\n\n\"We saved a big set-piece for a very important moment.\"\n\nLiverpool had looked like dropping points when Andrew Robinson scored an own-goal in the 86th to level the game at 1-1 after Luis Diaz's first-half opener.\n\nBut captain Van Dijk rose to head home and ensure the league leader took advantage after second-placed Arsenal slipped up on Saturday by drawing 1-1 with Brentford.\n\nNewcastle routed Manchester United 4-1 and Chelsea came back from 2-0 down against relegation-fighting Ipswich to draw 2-2.\n\nWolves' hopes of avoiding the drop were further boosted by a 4-2 win against Tottenham.\n\nLiverpool could be crowned champion as early as next Sunday if Arsenal loses to Ipswich earlier that day.\n\nThe Merseyside club is 13 points clear at the top of the standings with six rounds to go.\n\nThe victory completed a week of celebrations for Liverpool supporters after top scorer Mohamed Salah ended uncertainty over his future by signing a new two-year contract.\n\nHe marked that new deal in style by maintaining his outstanding form this season to cross for Diaz's opener in the 18th minute.\n\nIt was his 45th goal or assist in the league this season, which set a new record for a 38-game Premier League campaign, according to statistician Opta.\n\nHe left the field late on to a standing ovation from the home fans.\n\nWest Ham twice came close to equalising before Robertson's own-goal.\n\nMohammed Kudus hit the bar in the first half and Jarrod Bowen was denied by Alisson when through on goal after the break.\n\nAndre Onana was left out of Manchester United's squad for the game against Newcastle following his latest high-profile errors for the club — but it didn't prevent a heavy loss for Ruben Amorim's team.\n\nUnited lost 4-1 at St James' Park — a 10th defeat in 21 Premier League games since Amorim took charge in November.\n\nThe loss means United will set a new club record for its lowest point haul in the Premier League era.\n\nThe storied club cannot match the 58 points it amassed in the 2021-22 campaign. Even a perfect record in its last six games would only see it reach 56 points.\n\nBack-up goalkeeper Altay Bayindir replaced Onana after the Cameroon international was partially at fault for both goals in United's 2-2 draw with Lyon in the Europa League on Thursday.\n\nOnana was not even named as a substitute.\n\nBut Bayindir was beaten four times by a Newcastle team that is powering its way toward Champions League qualification and moved up to fourth in the standings, even without manager Eddie Howe , who missed the game because of illness.\n\nHarvey Barnes scored twice for Newcastle, which can go third if it wins its game in hand.\n\nDefeat was an unhappy way to mark United's 4,000th game in the English top flight.\n\nEverton, Liverpool, Arsenal and Aston Villa are the only other teams to reach that landmark.\n\nChelsea's hopes of qualifying for the Champions League next season were dealt an unexpected blow by Ipswich.\n\nAltay Bayindir's (C) rare opportunity for a Premier League start in goal turned to ashes in Manchester United's 4-1 loss to Newcastle. (Getty Images: Stu Forster)\n\nTrailing 2-0 at half-time at Stamford Bridge, an own-goal from Axel Tuanzebe just after the break got Enzo Maresca's team back into the game.\n\nJadon Sancho levelled in the 79th, but it was still two points dropped for fifth-placed Chelsea, which could have moved above Manchester City in fourth.\n\nWolves need just five more points to be certain of safety after a 4-2 win against Spurs.\n\nRayan Ait-Nouri and an own-goal by Djed Spence gave Wolves a 2-0 lead at halftime. Jorgen Strand Larsen and Matheus Cunha scored after the break, with Mathys Tel and Richarlison on target for Spurs.\n\nWolves moved above West Ham on goal difference and up to 16th in the standings.\n\nAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/tas-afl-stadium-enabling-legislation-challenges-remain/105169496",
    "title": "Final stadium approval could be granted within months — but challenges remain",
    "publish_date": "Sun, 13 Apr 2025 22:29:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tasmanian Premier Jeremy Rockliff says he hopes special legislation to enable the Macquarie Point stadium can be introduced in May, debated in June and pass parliament in July.\n\nHe confirmed on Sunday that he planned to sidestep the current planning process, which involves an assessment by the Tasmanian Planning Commission (TPC).\n\nA list of stadium problems — from crowd squeeze to bus freeze Photo shows A map showing pinch points on three out of the four sides of a stadium and nearby areas. Macquarie Point is hemmed in by a highway, a working port, heritage buildings and a knoll, with just enough space for a stadium. The Planning Commission has laid bare the problems.\n\nA TPC panel's draft report on March 31 highlighted a range of issues with the stadium, ranging from traffic and pedestrian problems, the impact on Tasmania's finances, and the management of water and site contamination.\n\nRather than continuing with this process, parliament will instead be asked to directly vote on the stadium's approval.\n\nMr Rockliff said he hoped construction could start by Christmas, and that problems highlighted by the TPC could be addressed through conditions in the legislation.\n\n\"There are issues that we need to deal with and, of course, with enabling legislation will be conditions attached as well,\" he said.\n\n\"Which will include a number of areas in terms of traffic management, in terms of water and sewage and other matters that need to be considered in any planning and infrastructure development.\"\n\nMr Rockliff informed various upper house independents of his plans on Saturday evening, and attempted to contact Labor leader Dean Winter on Sunday morning, who has already committed to supporting it.\n\nThe votes of Labor and independents will be critical in whether the stadium can pass the upper house.\n\nGovernment has task ahead to convince crossbench\n\nA rendering of the proposed Macquarie Point stadium in Hobart released by the Macquarie Point Development Corporation to the Tasmanian Planning Commission, which was published by the TPC in February 2025. (Supplied: Macquarie Point Development Corporation)\n\nThe legislation itself will be tabled in May, before a period of public consultation.\n\nAt the same time, the TPC will continue its work, and will receive submissions on the stadium until May 8.\n\nDepending on the timing of the legislation, the TPC might also hold a directions hearing in the lead-up to a potential public hearing.\n\nIts work would then end if the legislation passes.\n\nLabor has already committed to support the legislation, meaning the government requires two upper house independents to reach the required eight votes.\n\nTasmanian independent MLC Meg Webb says the shift to legislation is a \"disrespectful move\". (ABC News: Luke Bowden)\n\nSeveral crossbenchers — including Meg Webb and Mike Gaffney, along with Greens MLC Cassy O'Connor — have already confirmed they are opposed to the government's approach.\n\nMs Webb said it was a \"disrespectful move\" that could make the government's job more difficult.\n\n\"[The public] want to see us make good decisions based on clear evidence that's informed by experts,\" she said.\n\n\"That's absolutely not what can happen under this proposal from the government to ram this through parliament with special legislation.\n\n\" I think all MPs will be given pause for thought about whether they can put their name to that kind of disgraceful throwing out of democracy. \"\n\nBut others — including Bec Thomas, Tania Rattray and Dean Harriss — are likely to be a target for the government.\n\nLabor upper house member Luke Edmunds said the party wanted to see the legislation be as strong as possible, and include input from all MPs.\n\n\"I don't think this is something we want to scrape home by one vote. I think it's something that we can actually bring people's feedback to address the concerns,\" he said.\n\nTown planning issues yet to be resolved\n\nTown planning, traffic management and safe pedestrian dispersal were among some of the strongest criticisms made by the TPC panel.\n\nIt raised concerns about pinch points throughout the Hobart CBD for crowds to move, and also the potential for unsafe conditions if there is an emergency in the stadium.\n\nQuestions answered about Hobart's new AFL stadium Photo shows Thumbnail for Macquarie Point stadium TILES INTERACTIVE. A mountain of information has just been released about Hobart's proposed Macquarie Point stadium. So, what does it tell us about the contentious project?\n\nThe site is constrained on each side by a working port, a major roadway, heritage strips of buildings, and a raised knoll with a cenotaph on top, while requiring excavation into reclaimed land with previous site contamination.\n\nThe Macquarie Point Development Corporation's own commissioned reports highlighted the eventual need for additional public road and transport infrastructure, such as developing the northern suburbs transit corridor.\n\nThe disused corridor, which runs through Hobart's most populous suburbs, has long seen government proposals — including most recently for \"rapid bus\" transit — but none have progressed to detailed planning stages.\n\nThe Macquarie Point Development Corporation's commissioned reports highlighted there would be a need to increase public road and transport infrastructure. (Supplied: MPDC)\n\nWhen asked if this planning should be done before the stadium is built, Mr Rockliff said the stadium would instead be an \"enabler\" for these upgrades to happen.\n\n\"You need the enabler,\" he said.\n\n\"And the enabler for the entire Macquarie Point precinct, all that private investment when it comes to the visitor economy, when it comes to hotels, pubs and clubs and cafes, you need the enabler.\n\n\" And the enabler for a team, the enabler for economic investment, the enabler for transport infrastructure, the enabler for pedestrian access … an enabler is the stadium. \"\n\nBureaucrat role in 'legal advice' questioned\n\nMPDC's reaction to the draft TPC report on March 31 was swift.\n\nWithin three days, it had released a submission by a law firm it has been engaging, MinterEllison, which was later called \"legal advice\".\n\nThe submission questioned various aspects of the TPC's approach, and was then used by government ministers to question the TPC's draft report, including Eric Abetz who described the submission as \"so strong and so robust\".\n\nCommunications tabled in parliament — following a Greens motion — show how the submission was developed.\n\nLitmus test for stadium support ahead of vote Photo shows 'Yes stadium' and 'No stadium' stickers composite image. A debate in which those in favour of and those against a proposed stadium in Hobart will have their say has likely given a good indication of whether the project will survive a vote in Tasmania's parliament.\n\nMinterEllison provided the MPDC with a draft letter on March 31, which questioned the TPC's approach on its economic analysis, its use of planning schemes, \"exaggerated\" land area and by making \"findings\" before feedback had been received.\n\nOver the coming days, it received feedback from various department heads and the MPDC board, including at a board meeting the night before it was released.\n\nThe final submission, on April 3, had been significantly strengthened, and remained under a MinterEllison letterhead.\n\nIt now included a claim that the TPC draft report did not comply with the relevant laws, had \"errors of law, approach and analysis\", that it \"should be given limited, if any, weight\", and adopted \"significant portions\" of an earlier report by economist Nicholas Gruen.\n\nThe communications also show a change being suggested by Department of Premier and Cabinet secretary Kathrine Morgan-Wicks, which was then adopted in the final submission.\n\nThis involved questioning why the report extended to matters of the state's economy.\n\nGreens MP Vica Bayley says the \"legal advice\" had no independence. (ABC News: Ashleigh Barraclough)\n\nGreens MP Vica Bayley said the \"legal advice\" had no independence.\n\n\"These documents show the so-called 'legal advice' the Rockliff government has relied on to dismiss the Planning Commission's report was in fact no such thing,\" he said.\n\n\" It was a team effort by government representatives and the stadium proponent's lawyers to cook up the political argument that suited the Liberals and put it on a law firm's letterhead. \"\n\nAn MPDC spokesperson said that each of the additions to the submission were \"matters that were identified by the legal team as matters that should be set out\".\n\nA government spokesperson says \"it is standard practice for legal advice to go through iterative drafts between lawyers and clients\".\n\nThe government would not release further draft copies between the first and final editions, claiming legal privilege.\n\nIt was able to avoid releasing these due to an amendment on the motion proposed by Labor leader Dean Winter.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/aboriginal-entrepreneurs-businesses-based-on-cultural-knowledge/105149946",
    "title": "Aboriginal entrepreneurs harness ancient knowledge for new businesses",
    "publish_date": "Sun, 13 Apr 2025 22:15:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Growing up, Barkandji/Malyangapa man David Doyle would hear the stories and customs of his Indigenous ancestors, but he did not think much of it.\n\nWhat he could not have imagined at the time was the business potential of the ancient knowledge.\n\nThe now-46-year-old said he was lucky to spend a lot of time with the elders of his Aboriginal community in outback New South Wales.\n\n\"I got to travel around quite a lot, [and] a lot of that time was [spent] fishing, camping and learning [about] what people used to eat or use as medicine before colonisation,\" Mr Doyle said.\n\nMr Doyle boils native lemongrass in his backyard before mixing it with soap powder. (ABC News: Oliver Brown)\n\n\"I didn't take much notice [when] I was a kid, but growing up now, I realised I could benefit from that myself.\n\n\"[For example] when I got eczema when I turned about 40, I decided that I needed to do something because the [conventional] medicines, the steroid creams, I was getting weren't helping a great deal.\"\n\nBusiness built from personal need\n\nRecalling treatments from his childhood, Mr Doyle began using native plants that grow in far west New South Wales, including Eremophila longifolia, also known as emu bush, which can be used for skin conditions.\n\nThe plant Eremophila longifolia, also known as emu bush. (ABC: Gardening Australia)\n\nHe started incorporating the plants into soaps and creams, and soon realised their potential as a commercial product.\n\n\"I started giving it away to family and friends, and of course, they started giving it away [and] people started asking for it,\" he said.\n\nMr Doyle makes the products himself in his Broken Hill backyard using ingredients gathered from his people's traditional lands near Menindee and sells them online.\n\nMr Doyle creates his products by hand in his Broken Hill backyard. (ABC News: Oliver Brown)\n\nHe has also explored other commercial ways of using his traditional knowledge by running on-country Aboriginal guided tours in the Menindee region, where he speaks about native plants and their uses.\n\n\"It's something [I'd] never really looked towards as something I'd want to expand on,\" he said.\n\nMr Doyle sells his soaps online. (Supplied: David Doyle)\n\n\"But it's probably one of the things [now] that I really enjoy, sharing plant knowledge and traditional uses, as well as how we can contemporarily use them now in modern day so that we're still connected to culture, connected to country.\"\n\nPaying it forward\n\nMr Doyle's business has been welcomed by many in the far west, including fellow Malyangapa man Mark Sutton.\n\n\"I have bought his soap and mailed it to our 25-year-old daughter in the Hunter Valley [and] she's giving us lovely feedback,\" he said.\n\n\"This is the kind of thing where traditional Aboriginal culture can translate into helping us, not only as Aboriginal people, but helping all of us as Australians.\"\n\nMark Sutton is a big believer in the use of traditional knowledge. (Supplied: Mark Sutton)\n\nMr Sutton, 55, who has worked as an Aboriginal tour guide for more than three decades, is also an advocate for using traditional knowledge in his own working life.\n\n\"[Aboriginal and scientific knowledge] can co-exist and that is something I think we should aim to do,\" Mr Sutton said.\n\n\" On my guided tours now I'm trying to give the scientific name, then the common name, [and] then try and add the Aboriginal traditional language name. \"\n\nAfter years of working as a casual tour guide for others, Mr Sutton has recently started his own private enterprise, and hopes to eventually provide work opportunities for other Indigenous people.\n\nMr Sutton loves blending traditional and scientific knowledge about the land. (Supplied: Mark Sutton)\n\n\"I've had the benefit of many people's knowledge and experience, so now I feel that onus of responsibility to maybe take on some local young people,\" he said.\n\n\"It might only be on a casual basis, but I would certainly like to think that I can start bringing some other Aboriginal community members along on this ride with me.\"\n\nA growing national trend\n\nAccording to national organisation Indigenous Business Australia (IBA), Indigenous-owned businesses are a strength for Australia.\n\nIBA deputy chief executive and Potaruwutj man, Sean Armistead, said the Aboriginal and Torres Strait Islander business sector grew by more than 50 per cent between 2016 and 2021 to more than 29,000 business owners and managers nationwide.\n\nSean Armistead says Aboriginal-led businesses are becoming increasingly common in Australia. (Supplied: Indigenous Business Australia)\n\nHe said, while many were operating in the same sectors as non-First Nations business owners, using traditional knowledge to support them could help businesses stand out from the crowd.\n\n\"We've seen the inclusion of cultural knowledge in the expansion of the Indigenous Rangers Program as well as tourism and bush foods,\" Mr Armistead said.\n\n\"When you look at how Indigenous culture has existed for more than 50,000 years, then you also can see how recognising culture to protect country is so important, particularly with things like fire burning.\"\n\nMr Doyle, who still works part-time outside his traditional knowledge businesses, said there was huge potential for further growth in the space and he hopes more Aboriginal people actively explore it in the future.\n\nMr Doyle hopes more Aboriginal Australians consider how their cultural knowledge can help their careers. (ABC News: Oliver Brown)\n\n\"The native bush food industry is worth multi-million dollars and they're expecting to jump into the billions very soon, and about 2 per cent of that's Indigenous owned and operated,\" Mr Doyle said.\n\n\"So there's definitely a huge industry using cultural knowledge [there].\n\n\"The best thing about it is when we do it, [we're] making sure we use those sustainable practices we've always used and not just coming in, taking the whole plant and using it to make money.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/premier-rail-realignment-around-kalgoorlie-super-pit-gold-mine/104777346",
    "title": "Inland port would improve freight movement with fewer trucks on the road",
    "publish_date": "Sun, 13 Apr 2025 21:43:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's premier says decade-old plans to transform the historic mining centre of Kalgoorlie-Boulder into an inland port are unlikely to happen unless the state's rail freight network is back in government hands.\n\nRoger Cook's comments come after he took on new trade, investment and economic diversification portfolios in his new-look cabinet, and as WA mulls the relocation of its main container port from Fremantle to Kwinana, at an eye-watering cost of at least $7 billion.\n\nPremier Roger Cook at Kalgoorlie Railway Station during the state election campaign. (ABC Goldfields: Jarrod Lucas)\n\nWhile the rail plans for Kalgoorlie-Boulder, about 600 kilometres east of Perth, have been mooted for decades to open up mineralised ground along strike from the historic Golden Mile, it is being touted by stakeholders as a potential way to reduce the bottleneck to Fremantle.\n\nThe proposed realignment around the Super Pit gold mine involves decommissioning about 25km of the Australian Rail Track Corporation's (ARTC) line at the point of connection with the WA network controlled by Arc Infrastructure.\n\nConstruction of new rail and passing lanes would link up with an intermodal terminal on industrial land adjoining the new route.\n\nEarly estimates suggest the proposed realignment of rail and the development of an intermodal transport facility would cost at least $170 million but funding is not the only hurdle.\n\n\"The only way that realignment is going to take place is if we bring the rail freight network back into public hands,\" Mr Cook said on March 7 during the election.\n\n\"That is the only time we will have the opportunity to take advantage of these sort of initiatives.\"\n\nAn empty iron ore train returns to Kalgoorlie-Boulder after delivering its cargo to Esperance Port. (ABC Goldfields: Jarrod Lucas)\n\nThe premier doubled down on those comments on April 10, revealing \"very complex negotiations\" are at early stage with Arc Infrastructure.\n\nIt comes after the Cook government announced in January its plans to end Arc Infrastructure's 50-year lease of the rail freight network, which was privatised in 2000 in a deal worth $586 million.\n\nThe Liberals have suggested it could cost between $5 billion and $8 billion to end the lease prior to 2049, which Mr Cook has described as \"fanciful\".\n\n\"I'm told that people pay more to get freight from Kalgoorlie to Perth than they do to get freight from Sydney to Kalgoorlie,\" Mr Cook said.\n\nA map of the proposed railway realignment in Kalgoorlie-Boulder. (Supplied: Australian Government)\n\nFeasibility study due mid-year\n\nA spokesperson for Arc Infrastructure did not shed any light on the status of lease negotiations with the state government but said it had long supported the Kalgoorlie rail realignment project.\n\n\"We will continue to work with government and industry stakeholders to achieve a positive outcome for the Goldfields region,\" she said.\n\nConsultancy firm Deloitte is expected to deliver a detailed business case mid-year.\n\nARTC director of infrastructure projects, Heather Parry, said realigning rail for mining expansions was not uncommon.\n\nShe said she was previously involved in relocating track for the Mount Pleasant coal mine in New South Wales' Upper Hunter Valley.\n\n\"The potential for an intermodal hub is exciting,\" she said.\n\n\"Intermodal just means moving from one mode of transport to another, so it's akin to an inland port and it allows for a lot of operational flexibility, and improved freight movement.\"\n\nHaul trucks operating in Kalgoorlie's Super Pit gold mine, which has produced more than 21 million ounces since 1989. (ABC Goldfields: Jarrod Lucas)\n\nIndustry leads push\n\nMurray Leahy, managing director of ASX-listed mining and trucking contractor MLG, is among several Goldfields business leaders who have been lobbying for the project for years.\n\nHe said it would take hundreds of trucks off the road every day, with freight currently travelling through Kalgoorlie-Boulder on trains before being trucked back, while many trains returning to the east coast were empty.\n\nMurray Leahy says an intermodal transport hub in Kalgoorlie-Boulder would reduce the number of trucks on the road. (ABC Goldfields: Jarrod Lucas)\n\n\"The total movements along the Great Eastern Highway is close to 2,000 trucks a day,\" he said.\n\n\"At least 250 of those are bringing freight back to Kalgoorlie after it has already gone through on a train, so it starts there by lowering emissions and improving efficiency.\n\n\"It creates an opportunity to diversify our economy locally, de-bottleneck our existing state infrastructure and drive growth in our region, and it's really being driven by a centralised view of supporting Fremantle, which is an important asset for WA.\"\n\nMayor Glenn Wilson says the city is looking to diversify its economy but the mining industry remains its biggest employer. (ABC Goldfields: Jarrod Lucas)\n\nKalgoorlie-Boulder Mayor Glenn Wilson said the project represented the most significant upgrade in rail infrastructure since 1968, when the standard gauge line to Perth opened as the final piece of the puzzle for a continuous east-west freight link.\n\n\"We've got a spine that's sterilised at the moment through a large rail corridor with a hangover from the narrow gauge,\" he said.\n\n\"An intermodal facility could add some resilience to our freight network here in Western Australia … we're offering to take that bottleneck out of the metro area.\"\n\nRare earths in spotlight\n\nWhile opening up new areas for gold mining, the project could also benefit a newly-opened $800 million rare earths refinery which has become a strategic asset for the federal government in light of recent tariffs by the United States.\n\nRare earths are used in high-tech applications, including electric vehicles and missiles.\n\nIn 2023, ASX-listed Lynas Rare Earths signed a $US258 million contract with the US Department of Defense to build a refinery in Texas, which will eventually be fed by material from the Kalgoorlie plant.\n\nA freight train moves along tracks bordering the Lynas Rare Earths refinery in West Kalgoorlie. (ABC Goldfields: Jarrod Lucas)\n\n\"Australia is not particularly competitive on inland logistics,\" Lynas managing director Amanda Lacaze said.\n\n\"Improved infrastructure for transport will certainly improve the efficiency of us getting material to the plant, as well as us getting material from the plant.\"\n\nAmanda Lacaze says an intermodal transport facility would be \"good for business and the community\". (ABC Goldfields: Jarrod Lucas)\n\nAnother key stakeholder is Australia's biggest rail freight operator, Aurizon, which recently began implementing changes across its WA bulk freight business after a review to improve cost and fleet efficiencies.\n\n\"Aurizon looks forward to the release of the realignment study and to governments consulting further with industry,\" Aurizon said in a statement.\n\n\"We support consideration being given to the most cost-effective and efficient way to meet the growing demand of freight customers. This should include utilising existing infrastructure to the greatest extent possible.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/asx-markets-business-news-live-updates/105172096",
    "title": "Live: ASX rises after Wall Street rallies on Fed's assurances, China bans rare earths exports",
    "publish_date": "Sun, 13 Apr 2025 21:30:10 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts",
      "Daniel Ziffer"
    ],
    "text": "Just a quick scoreboard update in the US versus Rest of the World tariff-fest.\n\nAfter the US raised its overall tariffs on Chinese imports to 145% on Friday, China shot back, raising its tariffs on US imports from 84% to 125%, adding that would be about it because, \"at the current tariff level, there is no market acceptance for US goods exported to China\".\n\nThe US then tinkered with or, as the Trump administration said, \"clarified\" its original tariff barrage, carving out smartphones, laptops and some electronic devices from the new regime.\n\nThat may have been due to the calculation that found the tariffs would increase the cost of a new iPhone by more than 60% from $US1,100 to $US1,800 ($US 2,500 if the phone was entirely made in the US), not exactly a popular move in the smart phone-addicted US.\n\nCost an iPhone 16 before and after US tariffs (AMP)\n\nThe whole electronics thing has yet to be bedded down, with the White House saying, just to be clear, the clarification will be further clarified later today.\n\nUS Commerce Secretary Howard Lutnick also waded into the spirit of clarification by noting the carve out \"is not a permanent sort of exemption\" and the tech products will be subject to separate sectoral tariffs along with semiconductors.\n\nTrump posted on social media that the electronics are \"just moving to a different Tariff 'bucket'\" and the administration will be \"taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN\".\n\nLutnick added some clarification to the presidential post, noting, \"He's saying they're exempt from the reciprocal tariffs, but they're included in the semiconductor tariffs, which are coming in probably a month or two.'\"\n\n\"These are things that are national security, that we need to be made in America,\" Mr Lutnick added.\n\nChina's reaction was along the lines of \"whatever\". Or, more officially, China's Ministry of Commerce said it was a \"small step for the US to correct its wrongful unilateral reciprocal tariffs\".\n\nChina added: \"Oh, and by the way, we are banning shipments of rare earths to the US — strategic metals the US has no local production in and needed in things like semiconductor manufacture — immediately.\"\n\nThe export ban also includes rare earth magnets, an area where China holds around a 90% share of the global market, essential materials in auto, aerospace, semiconductor and military equipment manufacturing.\n\nAt least that was clear.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/landholders-call-for-increased-wind-farm-setback-distances/105094122",
    "title": "Twelve of Australia's tallest wind turbines will surround this retired couple's home",
    "publish_date": "Sun, 13 Apr 2025 21:22:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Neville and Gladys Franz walk outside of their peaceful rural Queensland home, they look up at Australia's tallest wind turbines.\n\nThe structures, measuring 247 metres from base to tip, are part of the 83-turbine Wambo Wind Farm near Diamondy, 280 kilometres north-west of Brisbane.\n\n\"When you look out of your home, they're the first thing that you see,\" Mr Franz said.\n\n\" When you see these things all the way around you, it's not so good. \"\n\nThey're significantly higher than the nation's first turbines built in 1987, which stood 30m high, at Salmon Beach Wind Farm near Esperance in Western Australia.\n\nAustralia's tallest wind turbines, at the Wambo Wind Farm in southern Queensland, are 247 metres high. (ABC News)\n\nSeven machines have already been installed near the Franz family's fence line, and with another five to be erected, they will be on all four sides of their property.\n\nIt's not the retirement they envisioned, having left their farm near Caboolture 21 years ago for a more peaceful lifestyle, and they're worried about the visual and noise impacts.\n\n\"We came to this area with the idea of settling down and retiring and have a lifestyle that suited us, which [was to] look down the paddock and see your cattle and see a nice outlook,\" Mr Franz said.\n\nMr Franz and his wife Gladys moved to Diamondy 21 years ago. (ABC Rural: Brandon Long)\n\nDuring the developer's consultation phase, the couple declined to host the turbines on their property.\n\nHowever, their neighbours agreed to have them installed, and their locations are perfectly legal — erected just outside of the state's minimum setback distance of 1.5km from a dwelling.\n\nIncreasing debate\n\nAs wind turbines become taller — proposals near Biloela in Queensland and the Blue Mountains in New South Wales have flagged 300m-high structures — there is increasing debate about whether setbacks should be bumped up to reduce their potential impact.\n\nWambo Wind Farm said it was required to meet stringent noise requirements set out in the development approval conditions and once the wind farm commenced, acoustic experts would measure and report on the noise levels.\n\n\"Should noise from Wambo Wind Farm exceed the approval limits, the project will immediately implement measures to bring noise levels back to within the approved limits,\" a spokesperson said.\n\nConstruction crews are on-site raising the steel structures. (ABC Rural: Brandon Long)\n\nThe project, a joint venture between Cubico and Queensland government-owned Stanwell, will play a key role in Australia's efforts to achieve net-zero greenhouse gas emissions by 2050.\n\nMost of the public also appears to be on board with wind according to a 2023 CSIRO survey, which found about 80 per cent of Australians in capital cities would \"approve\" or at least \"tolerate\" living near a wind farm, dropping to 70 per cent for those living out of town.\n\nDecommissioning issues scare some off renewables Photo shows A serious man and a woman stand in field of crops, man, wears cap, looks down, woman looks away, blue sky, trees. A couple in regional Australia could've earned millions from renewables, but one major issue stopped them.\n\nHowever, the Franz family, living at ground zero, is calling on the government to implement a 3km setback for all future turbines.\n\nThe couple's son Glenn and daughter-in-law Kathleen are joint partners in the farm.\n\nGlenn said while they were not \"anti-renewable\", turbines should be sited with more consideration for surrounding residents.\n\n\"There's got to be a lot more consideration given to the non-host neighbours,\" Glenn said.\n\n\"It's certainly divided the community.\"\n\n'Fairly noisy'\n\nDavid Greenup, a grazier who neighbours the fully operational Coopers Gap Wind Farm to the east near Cooranga North, believes a 2km to 3km setback would be more appropriate.\n\nCoopers Gap near Cooranga North is one of Queensland's largest operational wind farms. (ABC Rural: Brandon Long)\n\n\"Depending on the wind direction, it can be fairly noisy,\" Mr Greenup said.\n\n\"Our closest house to the wind farm is 1.5km to the closest tower. That house gets fairly impacted.\"\n\nThe site features smaller, 180m-tall turbines.\n\nOperator Tilt Renewables was contacted for comment but did not reply by deadline.\n\nQueensland farming lobby group AgForce echoed the landholders' concerns, also advocating for a \"significant\" increase in the state's minimum setback distance.\n\nChief executive officer Michael Guerin said the current regulations were designed when turbines were much smaller.\n\nMichael Guerin is calling for an increase to the setback distance between turbines and dwellings. (ABC News: Christopher Gillette)\n\n\"None of this has been adequately thought through,\" Mr Guerin said.\n\nWind industry\n\nThe industry argues longer setbacks are not necessary because larger turbines are more efficient and cost effective, and technology has helped minimise noise.\n\nChris O'Keefe, spokesperson at national renewable energy lobby group Clean Energy Council (CEC) said current setback distances were adequate and provided certainty for developers, and longer setbacks would not work.\n\n\"We just don't think it would work at all,\" Mr O'Keefe said.\n\n\"Investment is being dished out as a result of those rules and any changes to those, we would have concerns with.\"\n\nState by state rules\n\nIn Australia, setback distances vary by state.\n\nIn Queensland, the Department of State Development, Infrastructure and Planning determines setback distances.\n\nA secret report laid bare WA's emissions woes. What does it mean for Australia? Photo shows A composite image of the Prime Minister and WA Premier If the country’s biggest mining and resources state can't commit to meeting an emissions reduction target, what hope does the Albanese government have?\n\nA department spokesperson said it would continue to consult with local government, communities and industry as the next phase of reforms are implemented to ensure local communities and councils \"are given the rights to ensure their voices and concerns are addressed\".\n\nIn Victoria, turbines must be at least 1km from a dwelling, while in Western Australia, the recommended distance is 1.5km.\n\nNew South Wales uses a sliding scale based on turbine height, equating to a 1.5km setback for a 240m turbine.\n\nReview may be warranted\n\nThe Australian Energy Infrastructure Commissioner (AEIC), who independently oversees renewables and reports to the Commonwealth, says taller turbines may require longer setbacks.\n\nOn the AEIC website, the commissioner recommends a default setback distance of 1.5km for turbines with a tip height of up to 200m.\n\nFor tip heights greater than 200m, \"a longer setback distance may be more appropriate to accommodate increased visual amenity impacts\".\n\nRegarding noise, the commissioner states, \"Improvements in turbine design have mitigated the noise effects\" and \"noise contours have not materially changed\" for these larger turbines.\n\nOne of the most recent turbine health studies in Australia was led by Peter Catcheside, professor at the College of Medicine and Public Health at Flinders University.\n\nPeter Catcheside is a sleep and respiratory physiologist. (Supplied: Flinders Foundation)\n\nThe 2016-2021 study found noise effects from wind turbines were \"pretty small\", though he acknowledged, \"it's a sensible concern as the machines get bigger\", and further listening tests might be warranted.\n\nMr Franz's property will soon be encircled by 12, 247m-high wind turbines. (ABC Rural: Brandon Long)\n\nWhile a change of rules could be too late for the Franz and Greenup families, they hope distances are changed for future generations' amenity.\n\n\"I hope our government that we've got in power now really sit down and have a look at this, because it's probably something you don't want anyone else to go through,\" Glenn Franz said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/labor-launches-election-campaign-in-wa/105171826",
    "title": "Labor’s symbol-heavy campaign launch highlights key challenge in WA",
    "publish_date": "Sun, 13 Apr 2025 21:15:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Nothing was left to chance as Prime Minister Anthony Albanese launched Labor's election campaign in WA.\n\nThere was an embrace of WA Premier Roger Cook, fresh off the back of a larger-than-expected state win, perhaps in the hope some of his popularity would rub off.\n\nChoosing to launch the campaign in Perth was an acknowledgement of WA's pull and a show of gratitude for the state he feels indebted to for helping him win the last election.\n\nPrime Minister Anthony Albanese launched Labor's election campaign in Perth for the second consecutive time. (ABC News: Keane Bourke )\n\nAnd as it all came to an end, there was a strategic nod to one of the state's icons.\n\nNot Mark McGowan, who became one of the world's most popular politicians following COVID, and not its booming mining industry.\n\nIt was the the state's emblem — the black swan — that Albanese drew upon.\n\nThe black swan\n\n\"For hundreds of years in England and across Europe, when people needed to describe something impossible, something that simply couldn't exist, they would say it was like a black swan,\" he said.\n\n\"The rest of the world was certain that there was no such thing as a black swan, until Europeans sailed up that river just out there and saw them by the thousands.\"\n\nThe image Albanese seemed to be evoking was of himself as one of those European explorers, sailing along the Swan River into WA ahead of the last election in 2022, to discover hundreds of thousands of voters waiting to be wooed.\n\nAnthony Albanese referenced the black swan as a symbol to describe something impossible. (ABC News: Robert Koenig-Luck)\n\nIn Tangney, Hasluck, Pearce and Swan, Albanese (aided by McGowan's intense popularity) brought those voters onside, delivering crucial seats for his win.\n\nBut now that the black swan has been discovered, the task of winning in the west isn't as straightforward.\n\nFormer prime minister Julia Gillard at Labor's campaign launch in Perth. (ABC News: Andrew O'Connor )\n\n2022 election\n\nA big part of the reason for Albanese's success, and the reason he could 'discover' those black swans, was because they felt forgotten by the Morrison Liberal government.\n\nThe COVID-hangover that also influenced the result was two-fold: firstly, McGowan's lingering popularity, as well as the sour taste left by the Morrison government's decision to join Clive Palmer in a High Court challenge against WA's hard borders.\n\nMark McGowan and Anthony Albanese on the federal election campaign trail at Westfield Carousel shopping centre in 2022. (ABC News: James Carmody)\n\nAlbanese and his team stood in stark contrast.\n\nThey were present in the west, said all the right things, and launched their campaign at Perth Stadium.\n\nTogether, they told the state — which is thousands of kilometres from the nation's capital and often feels forgotten — they had a friend who would listen.\n\n\"To be honest, he's barely been away ever since,\" Premier Roger Cook told the crowd at yesterday's launch as he revved them up for their leader's arrival.\n\n\" He comes back to WA every other week, or so it seems. \"\n\nWA Premier Roger Cook revved up the crowd ahead of Anthony Albanese's address. (ABC News: Andrew O'Connor )\n\nIt's been a little less than that, at 31 visits according to the PM.\n\nHolding his launch in the west is meant to reinforce how much he values the state, but that might not be front of mind for voters.\n\nIn the wake of the state campaign, there's a sense many are switched off to the same again at a federal level and might not realise he's had a major campaign launch at all, let alone that it was in their home town.\n\nAnd while Dutton hasn't racked up quite as many visits, the Liberals have learnt from their mistakes and been more present, especial of late.\n\nLiberal Leader Peter Dutton attending a business breakfast in Perth on Friday. (ABC News: Andrew O'Connor )\n\nIn 2022, appealing to WA's parochialism was the winning ticket.\n\nIn 2025, it's the price of entry, which both leaders have paid.\n\nWA's key issues\n\nThat makes the policies each side is offering Western Australians much more important.\n\nBoth have bowed to the state's great mining powerhouses and passed the test of recognising its self-imposed title of \"the engine room of the nation\".\n\nAlbanese has promised to re-work the Nature Positive laws that Cook had asked him to scrap because of the concerns of the resources sector.\n\nThe Coalition has promised to \"never revive\" the laws and is instead promising to \"halve project approval times while keeping standards high\", starting with the North West Shelf project.\n\nCost of living and housing, key issues in the west, have been just as important everywhere else across the nation, with each party proposing their own solutions to tackle the problem.\n\nKeep the sheep\n\nOne of the few significant points of difference is on the live sheep export trade — which Labor has promised to phase out by 2028 and which the Liberals would reinstate.\n\nA 14.8 per cent swing away from Labor in the regions at the recent state election has been attributed, at least in part, to Labor's stance.\n\nIn Perth, the swing was 11.7 per cent.\n\nKeep the sheep protesters were outside Anthony Albanese's hotel on the day of Labor's campaign launch in Perth. (ABC News: Keane Bourke )\n\n\"Anthony Albanese has shown us no respect at all,\" one farmer told the ABC.\n\n\"He hasn't had the courage to stand in front of us once … completely disrespectful and completely lacked courage and even manners to talk to us and tell us why.\"\n\nBut the stance carries little risk for Labor in the west — the state's regions have been solidly blue territory for decades with little prospect of changing.\n\nKeep the sheep protesters with utes and vans circled Anthony Albanese's hotel on Sunday. (ABC News: Keane Bourke )\n\nOptimism in the west\n\nFor the next three weeks both sides will keep pointing to reasons they should be optimistic in the west.\n\nLabor seems hopeful it will keep the four seats it picked up last time, at the very least, helped along by a stronger-than-expected state result.\n\nThe Liberals have pinned a lot of hope on taking Curtin back from independent Kate Chaney and winning the newly created seat of Bullwinkel on Perth's fringes.\n\nThe Liberals are hoping to win back the seat of Curtin from independent MP Kate Chaney. (Supplied)\n\nWithout McGowan's seemingly magical touch or Morrison's distance, the race should at least be a little more interesting.\n\nIt's a big incentive for both sides to keep make the long trip west at least once more to see if there are a few more black swans waiting to be discovered.\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/mary-fowler-suffers-knee-injury-in-fa-cup-semifinal-defeat/105172754",
    "title": "Mary Fowler suffers knee injury in FA Cup semifinal defeat",
    "publish_date": "Sun, 13 Apr 2025 21:06:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "Manchester City officials say they're \"not fearing the worst\" after Mary Fowler suffered a knee injury in their Women's FA Cup semifinal defeat by neighbours Manchester United.\n\nThe Matildas star limped out of the derby tie within just the first 20 minutes of City's 2-0 home defeat after requiring several minutes of treatment on the Academy Stadium pitch in Manchester after she appeared to wrench her right knee while overstretching for the ball.\n\nWith anxiety clear on the City bench featuring players who have suffered serious ACL injuries in the past, interim manager Nick Cushing reported after the game: \"It doesn't look great imminently.\n\n\"To lose Mary Fowler in an important game at an early stage, and to lose a goal, was catastrophic.\n\n\"It is her knee. I don't want to speculate, but we're not fearing the worst.\"\n\nThere had earlier been obvious concern from the City medics before the grimacing 22-year-old was able to get back to her feet and, briefly, it appeared as if she felt she might be able to get back into the action.\n\nBut she had to be substituted in the 24th minute by Naomi Layzell, and could then only watch on the bench as her dream of any English silverware this season died following their League Cup final defeat and Champions League exits at the hands of Chelsea.\n\nFowler was still being treated when the already injury-depleted City went 2-0 down to United in the 22nd minute, with Grace Clinton adding to the lead they'd been given by a brilliant strike from Celin Bizet after just six minutes.\n\nIt was a dispiriting end to what had been another impressive week for Fowler when she netted for the Matildas back home in their win over South Korea before jetting back for City's big game.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nFor City, Fowler has been a key creative spark all season, especially while a series of injuries have been afflicting some of their other stars, like Khadija Shaw, Lauren Hemp and Vivianne Miedema.\n\nCity's defeat ended any prospect of Australia's two premier women's players going head-to-head in the Cup final at Wembley in May, with Sam Kerr's Chelsea having reached the final with a 2-1 win over Liverpool on Saturday.\n\nKerr herself faces a race against time to feature in the final as Chelsea has reported she's still \"a few weeks away\" from getting back into action after her own long-standing ACL injury.\n\nHolders United, though, look set to offer a big challenge to the English champions Chelsea after reaching their third final in a row.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-14/streaming-independent-box-office-south-australian-film-corp/105133244",
    "title": "Will streaming put an end to surprise indie hits at the box office?",
    "publish_date": "Sun, 13 Apr 2025 20:44:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western cinema is littered with rags-to-riches stories of independent films making millions, but in an age of streaming where box offices are bypassed altogether, are windfalls becoming a thing of the past?\n\nGeorge Miller's Mad Max of 1979, for example, was made with a budget of $350,000 and went on to make nearly $100 million in box office gross earnings.\n\nIn the United States, Jared Hess's Napoleon Dynamite of 2004 cost about $400,000 and grossed more than $46 million.\n\nSouth Australian filmmaker John deCaux has recently received funding from a US company to make a feature horror film called Drop Bear.\n\nHe said the market for independent films had changed, but pointed to Adelaide's Michael and Danny Philippou's 2023 debut feature, Talk to Me, as a recent example of success.\n\nBehind Hollywood's studio logos Photo shows A computer graphic of Earth with the word Universal in large lettering before it Film studio logos are as well-known as our favourite movie actors, but are they finally losing their prominence due to the rise of streaming?\n\nIt was made for about $5 million and became the highest-grossing horror film for American independent entertainment company, A24, earning $140 million in global box office sales.\n\n\"I think it does still exist, but it's about understanding your niche and knowing where you can get your revenue from,\" deCaux said.\n\n\"The Napoleon Dynamites are super rare and are exceptions to the rule but traditionally, for most filmmakers, it's about learning a craft and doing it over and over, and building up to those bigger projects.\n\n\"We found our way of making money through a beekeeping series on YouTube, and through YouTube revenue.\"\n\nDanny and Michael Philippou debuted their first feature film at the Adelaide Film Festival in 2022. (Supplied)\n\nThe Philippous too had been creating short films and clips for their YouTube channel RackaRacka for about a decade prior to securing backing for their first feature, which is now getting a second life on Netflix — currently ranked in the global top 10 most watched chart.\n\nThe digital shift\n\ndeCaux said there had been two major shifts in filmmaking over the past 20-odd years.\n\nFirst was the shift in medium from film to digital, making cameras more affordable and bypassing the need to buy, develop and edit on film.\n\nThen there was the emergence of online streaming services in the mid-1990s that evolved with technology into more user-friendly platforms, like YouTube in 2005 and Netflix in 2007.\n\nDo we still need free-to-air TV? Photo shows A colourful graphic featuring a TV icon, a teen girl, a remote, and ABC, SBS, Nine, Seven, Netflix, Disney+ and other logos. Ratings data shows young people are turning away from traditional television in droves in favour of online streaming platforms and social media. But an expert says free-to-air television still has a role.\n\nBut streaming's convenience reduced attendance numbers in cinemas, prompting major Hollywood studios to take less risks on new ideas and spend big money on safer bets like superhero franchises.\n\nConversely, streaming platforms opened up new channels for low and mid-budget films that might not have been made or distributed otherwise.\n\nSouth Australian Film Corporation chief executive Kate Croser said \"the era of breakout indie films certainly isn't over, it's just evolving\".\n\n\"The more popular the film is on the [streaming] platform, the more views it gets, and the more buzz it generates, the more likely the streamer is to want to work with the filmmaker again and may even directly commission their next project,\" she said.\n\n\"Streaming can amplify success, in many ways … it can mean massive global exposure, sometimes more than a limited theatrical release could, and it can also allow films to have two rounds of critical and audience success.\"\n\nKate Croser says streaming has created new opportunities. (ABC Radio Adelaide: Malcolm Sutton)\n\nBeyond negotiating acquisition contracts, however, independents creating a film for streaming platforms alone cannot benefit from the box office sales of the past.\n\nMs Croser said acquisition agreements with streaming services and the rates paid were often commercial in confidence, but they could be boosted by star power or large existing audiences.\n\n\"Typically, the streamer either pays the filmmaker a flat fee to win the rights to the film outright, or the filmmaker will licence the film to the streamer for a set period of time, either exclusively or non-exclusively, after which they may licence it elsewhere,\" she said.\n\n\"Revenue sharing arrangements can be a possibility, more commonly on smaller platforms [based on subscriber views or engagement time].\"\n\n1979's Mad Max made nearly $100 million in gross box office sales off a budget of $350,000. (Supplied)\n\nBut she said there were other benefits, such as low and mid-budget films not needing to sell as much to break even and return a profit, and streamers being able to commission directly from filmmakers and finance their production.\n\n\"Depending on the platform, this can open up much bigger budgets and global audiences than might otherwise be available,\" Ms Croser said.\n\nShe added the lack of a programming schedule and the need for a \"huge catalogue of content\" for varied demographics made it an \"especially fertile ground for genre films or those with a specific or niche interest audience\".\n\nFilm festival 'launch pads'\n\nRegardless of how a project would be distributed, Ms Croser added that international film festivals remained \"critical launch pads\" that contributed to whether an independent film, or TV series, was a critical and/or commercial success.\n\nSA animated feature Lesbian Space Princess premiered at the Berlinale in Germany. (Supplied: We Made A Thing Studios)\n\nShe said SA's Run Rabbit Run was acquired by Netflix off the back of its world premiere at Sundance Film Festival in 2023 and \"smashed the streamer's ratings in its first week of release\" with 6 million views.\n\nStan series Thou Shalt Not Steal premiered at the Toronto International Film Festival and SXSW Sydney and became one of Australia's biggest critical hits last year.\n\nAnd SA's animated feature, Lesbian Space Princess, has recently been acquired for worldwide distribution after winning best feature after its premiere at the Berlinale in Germany.\n\n\"Cinemas aren't the only kingmakers anymore,\" Ms Croser said.\n\n\"It's a mix including streaming, festivals, smart distribution and a rise in audience-generated buzz.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-albanese-dutton-signature-policies-revealed-economists-warn-of-house-price-surge-20250414-p5lrgb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE: Albanese, Dutton signature policies revealed; economists warn of house price surge",
    "publish_date": "Mon, 14 Apr 2025 11:59:57 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Dutton failed to acknowledge or answer a question probing why he, who has made $30 million of property transactions across 26 pieces of real estate over 35 years, wouldn’t provide financial support to help his son Harry enter the property market.\n\nMedia heard from Harry earlier in Dutton’s press conference, where the younger Dutton said that while he was “saving like mad” to afford his first property, the dream of homeownership remained unlikely in the near-term amid skyrocketing housing prices.\n\nPeter Dutton’s son Harry speaks about homeownership struggles. Credit: James Brickwood\n\nWhen asked by Herald and Age federal political reporter Olivia Ireland about why he wouldn’t chip in to support his son purchasing his first home, Dutton ignored the question, responding instead with a rehearsed talking point questioning Labor’s competence as economic managers.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/afl/three-key-performances-from-pies-win-and-is-there-a-new-top-midfield-combo-in-the-afl-key-takeouts-from-round-five-20250411-p5lqyk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three key performances from Pies’ win and is there a new top midfield combo in the AFL? Key takeouts from round five",
    "publish_date": "Mon, 14 Apr 2025 11:59:51 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Having turned 35 last week, the 2016 Brownlow medallist could be forgiven for attacking the ball with a touch less ferocity than he did in his prime. But the manner in which he physically intimated the Crows’ back line with his angry charge on the ball was stunning, reinforcing why he is arguably the greatest contest player of the modern generation. “The body is feeling great … the last couple of years I haven’t been able to get through those first couple of weeks [because of injury]. Once you get through that first couple, first month, you start to be a bit more bulletproof. I have started to get to that stage,” Dangerfield told Fox Footy. Coach Chris Scott and his coaching panel also deserve a shoutout. Where the Cats had looked to stretch the Crows for much of the first half with longer kicks, inadvertently allowing the Crows to use their speed, after half-time the Cats pushed upfield better and gave themselves options closer to the ball, meaning they could control the ball more in their front half, denying the Crows the run they had enjoyed while scoring 32 of their 33 points in the final term from turnovers. The Cats have had their wobbles this season, but they are a legitimate premiership threat. Monday’s clash against the Hawks has all the hallmarks of the epic battles these teams waged from 2008 through the “Kennett curse” era.\n\nPie night: Good things comes in threes Friday night, Adelaide Oval\n\nCollingwood defeated Sydney by 31 points Much was made of the overall age of Collingwood’s “Dad’s Army” list through the pre-season, and concerns about a perceived lack of depth. After five games, those issues have been put to bed. While Ned Long’s emergence in the midfield as a replacement for Jordan De Goey on Friday night won particular praise, Long having been delisted by the Hawks at the end of 2023, the Magpies’ hierarchy should also be delighted by their other moves.\n\nWill Hoskin-Elliott replaced injured small forward Lachie Schultz – best on ground against Carlton last week – in the front half, and had 13 disposals, including a goal. In a reshuffling of the decks because of Dan Houston’s suspension, Lachie Sullivan was drafted in to effectively replace Harry Perryman in defence, the latter then tasked to be the rebounding half-back that Houston typically is. With Long thriving as a ball hunter in the mould of the injured De Goey, the Magpies proved that all good things do come in threes. This was a defensive masterclass by the Magpies, for they denied the Swans their key offensive plank – attacking through the corridor. The Swans like to possess the ball but, too often, turned it over when forced down the line. Aside from the opening round loss to Greater Western Sydney, their only defeat so far this season when they conceded 104 points, the Magpies have not coughed up more than 78 points in a game. The troubles of 2024 are now all but a memory. Fixture boon for AFL Sunday night, Adelaide Oval\n\nPort Adelaide defeated Hawthorn by 30 points\n\nThe hype and exposure this game attracted should have the AFL seriously considering running it back next season. Much to think about: Sam Mitchell and his Hawks should expect a return clash against the Power at the Adelaide Oval next year. Credit: AFL Photos via Getty Images Gather Round may have its own unique quirks, including tight dressing rooms at the suburban venues, but, ultimately, the AFL is all about maximising exposure, whether that be attendances or broadcast ratings. And this one was a winner in the relatively unexplored Sunday night prime-time slot. The weekend got off to a great start when the Crows hosted their former star Patrick Dangerfield and his Cats at the Adelaide Oval, and was capped by Sunday night’s grudge match. While the contest didn’t quite live it up to the billing – sly old fox Ken Hinkley did a number on the man of the moment, Sam Mitchell – the heightened emotions of the crowd, and the chirp among players, meant this was a must-watch occasion.\n\nLoading The AFL, and all sports for that matter, are under pressure from broadcasters to deliver “events” – contests that transcend the norm and can attract the average fan, and those with a mild interest in the game, to tune in. The Hawks and Power, care of their tight results last season, and the post-siren drama of the semi-final, ensured there were several characters fans could gravitate to. Or simply pick a side. This rivalry is real. “I know I definitely used it,” Power star Jason Horne-Francis told Seven after the match.\n\nLoading “I think rivalries are so good to have, and I think the one that we’re building here, it’s such a good rivalry … so, I know I definitely used it. I know some of the boys used it.” There will be a rematch in round 19 in Launceston, but an Adelaide Oval fixture should already be pencilled in for next year. Hinkley, of course, won’t be there next season, as the coaching handover to Josh Carr will be completed by then. But the Power’s five-goal win was a coaching masterclass, the inspired move of skipper Connor Rozee to half-back leaving the Hawks flummoxed. In a week when they lost their best player Will Day to long-term injury, this was a brutal reality check for the previously unbeaten Hawks. Their run from half-back dried up, a point Geelong have undoubtedly taken note of ahead of their Easter Monday clash.\n\nFans hope for blue skies ahead Saturday afternoon, Adelaide Oval\n\nCarlton defeated West Coast by 71 points Loading Carlton supporters won’t take too much from the win over the Eagles at Adelaide Oval. Yes, it was a relief to see their team finally get off the mark, but this is a woeful Eagles line-up that coach Andrew McQualter needs to strip right back. However, for the Blues, there were at least signs of a revival. And even signs AFL great Jimmy Bartel’s suggested non-negotiables, published in this masthead, had, dare we say it, been embraced.\n\nBartel called for the Blues’ defenders to use their opponent as the starting point and win the contest from there. Jacob Weitering and Jack Silvagni had been doing that; Mitch McGovern, in one of his best games, punctuated by a late long goal, and line-breaker Adam Saad, appeared to heed the message. Bartel wanted the midfielders to “spread, spread, spread”, a point Sam Walsh essentially made last Monday when he felt too many Blues were stuck in the contest. Walsh, with only one goal before Saturday, took his own advice, and booted three amid a 37-disposal masterpiece. The Geelong great also wanted the Blues’ forwards to aim for two tackles each per quarter. While the Blues were beaten 46-35 in overall tackles, they won the inside-50 count, 12-5. What will frustrate the Blues is that they managed only 17 goals from a whopping 73 inside-50 entries. That must improve against North Melbourne on Good Friday. For the Eagles, some of the errors they made, particularly when attempting to clear the ball from defence, had to be seen to be believed. It is still baffling that arguably the club with the most financial muscle of any in the competition can have been so bad for so long.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/golf/mcilroy-s-breathtaking-masters-win-was-as-good-as-sport-will-ever-be-20250414-p5lrju.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "McIlroy’s breathtaking Masters win was as good as sport will ever be",
    "publish_date": "Mon, 14 Apr 2025 11:55:49 +1000",
    "category": "sports",
    "authors": [
      "Peter Fitzsimons"
    ],
    "text": "But near-murder is what we saw, with a staggering twist. For this final day’s play was not a case of McIlroy trading death blows with a fierce opponent at all. The theme of this last day was the Northern Irishman trading blows with himself, unleashing vicious uppercuts to his own chin, only to come back swinging for the fairways regardless. Rory McIlroy celebrates winning the US Masters. Credit: Getty Images Time and again he followed the kind of choked shots that were Greg Norman’s infamous hallmark on his own final-day choke for the ages in the same tournament in 1996 with masterful recovery strokes that simply took the breath away. In the course of the tournament, McIlroy hit four – count ’em four – double-bogeys. But instead of throwing himself to the ground and weeping, he composed himself, against all reason, and delivered birdies. A double-bogey to begin this day? No problem.\n\nA wedge shot that put his ball right in the middle of what the denizens of Augusta call “Rae’s Creek”, but which to McIlroy had obviously become a creek of another name, and he was a man without a paddle. But no, he recovers again! All the while, however, Rose is quietly putting superb birdies together himself, less the double-bogeys, to start to mow down everyone between him and McIlroy. All of which sets up the best of the theatre, the play’s final act. For even as McIlroy cruises regardless to what looks to be a two-shot win, they keep doing cutaway shots to Rose who – having finished two lots ahead of McIlroy – is on the practice tee, staying limbered up and focused on the exceedingly off-chance that his rival will blow this. Surely, surely, Rory is not going to blow it now and ...\n\nAnd before our very eyes, on the 18th, he puts it in the bunker! Again, he could be forgiven for wrapping his club around the nearest tree, before falling to the ground and saying “I CANNOT do this any more!” But no, he pulls off a miraculous bunker shot to have the green jacket in his grasp, if he can just hole a relatively easy putt that he should be able to knock in with his eyes closed ... only to … only to miss. McIlroy can clearly barely believe that this can have happened again. Is he about to be humiliated as he was last year when in the last few holes of the US Open he bogeyed four of the last five holes – including two sitters on the 16th and 18th – to lose to Bryson DeChambeau? Cue Nick Faldo on commentary at the time. “That’s going to haunt Rory for the rest of his life, those two misses.” Say, Rory, are you facing that, now, only worse? “Haunt” you? If you lose this mate, it will be your waking thought for the rest of your life! Steely-eyed, he makes his way to the tee for the play-off hole, with his caddy, Harry Diamond. Best friends since they were kids, and best men at each other’s wedding, the two talk quietly – settle, Rory, settle, it will be OK– as Justin Rose arrives. And now, as Rose and McIlroy face off before beginning, do they glare at each other, a la boxing? Do they mutter crude imprecations under their breath, as cricket is infamous for? Do they even ignore each other as tennis players are wont to do in the tunnel at Wimbledon?\n\nNone of the above. Instead they warmly embrace each other, and sincerely wish each other the best. This time, no chokes, no jokes. Rose hits a wonder shot to be a couple of metres off the hole – only for McIlroy to hit an even better one, just a metre off. Rose two-putts to sink his. Over to you, Rory. McIlroy embraces Justin Rose after the dramatic climax to the Masters. Credit: Getty Images\n\nThis one for the money. For the glory. For the monkey off your back. For your first major in 11 years. This one, to take your place as one of only six players in the history of golf to have completed the grand slam of majors, with the last one being Tiger Woods 25 years ago. This one for your mum and dad, who raised you as their only child and made so many sacrifices to give you every chance of competing with the off-spring of more privileged folk – who even now, are watching in your childhood home at Holyrood, where you dreamed of this moment from the age of ten onwards. Can you do it? McIlroy lines it up. He taps. It drifts . . . drifts . . . drifts . . . in! Victory! McIlroy brings his hands to his head, throwing his putter behind him as he does so. His whole body shakes with emotion.\n\nNow, Rory, now. Now you can throw yourself to the ground. And so he does, simply unable to stand. Rose, though obviously devastated – his own life’s dream, snatched off him just instants ago – hangs back so as not to impede for a second on McIlroy’s glory. Only when it ebbs does he come into the frame, to warmly embrace his great rival and sincerely congratulate him, before withdrawing. The podium is all yours. It is sport, as good as it gets – and golf, which has somehow resisted garish carry-on, (yes, yes, yes, apart from LIV, I mean,) to maintain its sheer class. Loading Making his way to the clubhouse, McIlroy is further engulfed by all and sundry, including his wife and children, but must finally extricate himself, to say “I’ve got to go and get a green jacket.”",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/golf/the-masters-2025-final-round-live-mcilroy-searches-for-elusive-green-jacket-as-day-pushes-up-the-leaderboard-20250413-p5lrfy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "McIlroy breaks Masters drought with remarkable victory in a play-off",
    "publish_date": "Mon, 14 Apr 2025 11:45:24 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Rory McIlroy has defied another Masters meltdown to win in a playoff from Justin Rose and become the first European to secure a career grand slam more than a decade in the making.\n\nThe Northern Irishman (11 under, 72, 66, 66, 73) was four shots clear through 10 holes but, as he did 14 years ago at Augusta National, stumbled with five dropped shots as Rose (65, 71, 75, 66) surged to finish level.\n\nA bogey on the last hole of regulation forced a sudden-death playoff and both men had birdie putts on the first extra hole, McIlroy putting his approach to three feet after Rose’s had settled 15 feet away.\n\nRose’s effort slid by, before McIlroy tapped in to clinch his maiden Masters title and first major in 11 years.\n\nThe 35-year-old fell to the ground in relief after his putt dropped, having watched a five-foot par attempt on the same hole slide by minutes earlier that would have sealed the triumph in regulation.\n\nRory McIlroy poses with the Masters trophy. Credit: Getty Images\n\nTiger Woods was the last man to complete the set of all four majors when he dominated the British Open in his first attempt at the career grand slam in 2000.\n\n“It was 14 years in the making; I feel like I could have got it done there,” McIlroy said of the 2011 Masters fadeout that has haunted him.\n\n“There was a lot of pent up emotion that just came out on that 18th green\n\n“A moment like that just makes ... all the close calls worth it.”\n\nGene Sarazen, Ben Hogan, Gary Player and Jack Nicklaus are the only other members of the career grand slam club.\n\nScottie Scheffler puts the green Jacket on winner, Rory McIlroy. Credit: AP\n\nThe rollercoaster final day started with McIlroy two shots clear of Bryson DeChambeau (seven under) with the American briefly leading after just two holes before fading as the chasing pack surged.\n\nLeading by four after the 10th, he dropped a shot on the 11th and then inexplicably found water with a wedge despite laying up on 13th.\n\nThat fourth double bogey for his tournament is now a quirky record among champions.\n\nWhen his curling putt on the 14th sat on the lip of the cup but didn’t drop and he’d lost the lead.\n\nRose, who led for a record fifth time after the first round, bogeyed the 17th but then drained a 20-foot putt on the 18th to heap pressure on the leader.\n\nJustin Rose of England reacts to missing his putt on the 18th green. Credit: Getty Images\n\nMcIlroy found the sand with his wedge approach and then pulled his par putt to fall into the playoff.\n\nHe delivered again with an iron, as he had done with scintillating approaches to the 15th and 17th for birdies, to secure victory.\n\nThe whirlwind began on Thursday when McIlroy went back to par with a pair of double bogeys and sat seven behind fast-starting Rose.\n\nOnly Nick Faldo in 1990 and Woods in 2005 had previously come from that far back after the opening round to win.\n\nBut McIlroy launched his comeback with a back nine of 31 and exploded out of the blocks with a record six consecutive threes to start on Saturday.\n\n“All week I responded to setbacks,” he said.\n\nPatrick Reed (nine under) holed out for eagle on the 17th to finish outright third.\n\nScottie Scheffler (eight under) was fourth and Australian Jason Day dropped shots on the last two holes to finish five under and in a tie for eighth.\n\nRose fell just short of executing the second-biggest Masters comeback after starting the final day seven shots behind.\n\nThe former world No.1, US Open and Olympic champion, joins Greg Norman as a three-time Masters runner-up and Ben Hogan as the only loser of multiple playoffs after his 2017 defeat to Sergio Garcia.\n\nMin Woo Lee, Australia’s only other cut survivor, was two over on Sunday to finish six over for the tournament in 49th.\n\nAAP",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/liberal-party-drops-diss-track-aimed-at-labor-20250414-p5lrkk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Liberal Party drops 'diss track' aimed at Labor",
    "publish_date": "Mon, 14 Apr 2025 11:44:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "Liberal Party drops 'diss track' aimed at Labor\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/world/north-america/trump-s-boosters-laud-his-tariff-flip-flop-but-consumers-are-not-buying-it-20250414-p5lrh8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s boosters laud his tariff flip-flop but consumers are not buying it",
    "publish_date": "Mon, 14 Apr 2025 11:40:15 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Washington: Another day, another tariff backflip. This time it was a Friday night carve out for smartphones, laptops, computer parts and other electronics, which will no longer be subject to the 125 per cent tariff Donald Trump placed on goods from China.\n\nIt’s a significant backdown because about a quarter of US imports from China are electronics – even more than several other countries that have had their tariffs temporarily reduced to 10 per cent.\n\nStill, Trump and his lieutenants were upset to see this called out as yet another tariff flip-flop. Administration figures were out in force on the Sunday morning political talk shows saying electronics, including all-important semiconductors, would instead be part of a separate “bucket” of tariffs to come in the next month or two.\n\nDonald Trump’s tariff policies are making American consumers jittery. Credit: Bloomberg\n\n“They’re going to have a special, focused type of tariff to make sure those products get re-shored,” Commerce Secretary Howard Lutnick said on ABC’s This Week. “We need to have these things made in America.”",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/property/news/couple-spends-3-69m-on-really-liveable-and-practical-luxury-home-20250414-p5lrhh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Couple spends $3.69m on ‘really liveable and practical’ luxury home",
    "publish_date": "Mon, 14 Apr 2025 11:38:37 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A downsizing couple paid $3.69 million for an immaculate duplex in Essendon under the hammer on Saturday.\n\nFive buyers showed interest and three actively bid for the four-bedroom home, guided between $3,350,000 to $3,685,000 at 18a Roberts Street.\n\nBidding opened on a $3.3 million genuine bid but then stalled, and a vendor bid of $3.35 million was placed.\n\nAfter a bid of $3,375,000 was offered, the auction took off in $25,000 increments until it was on the market at $3.65 million, and sold at $3.69 million.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/nsw/like-putting-a-highway-across-a-park-the-problem-with-the-fish-market-ferry-plan-20250408-p5lq3c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Like putting a highway across a park’: The problem with the fish market ferry plan",
    "publish_date": "Mon, 14 Apr 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Megan Gorrey"
    ],
    "text": "Rowers fear an inner city bay will become a highway for ferries and private vessels once the new Sydney Fish Market opens, risking dangerous collisions or forcing them to abandon the waterway altogether.\n\nThe NSW government plans to open a 50-metre recreational wharf at its $836 million fish market opening at the head of Blackwattle Bay later this year. It forecasts the complex will attract about 6 million visitors a year – double the number going to the current adjacent site in Pyrmont.\n\nGlebe Rowing Club members prepare to skim the water at dawn. They are among hundreds of rowers and paddlers who use the bay in the early morning, afternoons and weekends. Credit: Kate Geraghty\n\nGlebe Rowing Club captain Nick Galea said hundreds of members of more than a dozen clubs based at Blackwattle Bay were worried the influx of visitors would cause congestion, push rowers and paddlers into the path of big ferries, and generate wash that could disturb or capsize smaller vessels.\n\n“Our biggest fear is people getting run over by a ferry, particularly younger or older people who might be less experienced,” Galea said.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/mary-fowler-may-have-hurt-her-knee-badly-that-would-be-an-utter-disaster-for-the-matildas-20250414-p5lriy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mary Fowler may have hurt her knee … badly. That would be an utter disaster for the Matildas",
    "publish_date": "Mon, 14 Apr 2025 11:28:25 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Australian soccer is still cursed. Whatever John Safran did with that chicken in Mozambique all those years ago to overturn a curse placed on Johnny Warren’s Socceroos in 1969, it clearly didn’t take. Or maybe there’s a different curse on the Matildas. Who knows?\n\nHow else to explain the acute misfortune that continues to befall our most beloved national team, particularly on the eve of major tournaments?\n\nSam Kerr famously did her calf just before the Women’s World Cup, curtailing her involvement in a tournament that felt like it was almost made for her. Then she did her ACL in the lead-in to Paris 2024, robbing her of a chance of redemption; she still hasn’t returned to the field.\n\nNow Mary Fowler? Of all players? This close to the Women’s Asian Cup?",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/decadent-escapes-cheese-parties-long-lunches-vic-food-events-for-when-winter-hits-20250411-p5lr3n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Decadent escapes, cheese parties, long lunches: Vic food events for when winter hits",
    "publish_date": "Mon, 14 Apr 2025 11:00:00 +1000",
    "category": "finance",
    "authors": [
      "Kosa Monteith"
    ],
    "text": "Advertisement\n\nEating outFood events Decadent escapes, cheese parties, long lunches: Vic food events for when winter hits Seek out an off-grid weekend with food by top chefs, a double-whammy wine and cheese festival and a long lunch with a face you’ll know from TV. Kosa Monteith April 14, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nColder months bring the spirit of feasting and cosy nights by the fire, but there are plenty of events to lure you from hibernation. Taste the terroir of Grampians wine, take a pal to a long lunch, or get out of Victoria with an off-grid weekend in the Tassie wilderness that includes food from top chefs. Grampians Grape Escape is a celebration of the region’s wine, spirits and natural beauty. Supplied Grampians Grape Escape (May 2 to 4) Good for: Those who like to give back. One of Australia’s longest-running food and wine festivals, Grampians Grape Escape has more than 30 years under its belt. This year’s event holds even more weight after recent bushfires, and will open with Feel-Good Friday celebrating the region’s resilience. More than 100 exhibitors will showcase western Victoria’s best, including 30 winemakers such as Dalwhinnie, Jackson Brooke and Seppelt. There are spirits, craft beer and produce; music and live entertainment; a pickling workshop; and cooking demonstrations by MasterChef alums Justine Schofield and Dani Venn.\n\nAdvertisement\n\nFrom $55 (for adults), grampiansgrapeescape.com.au Mould Cheese Festival x Pinot Palooza (July 4 to 5) Good for: Lovers of wine and cheese (isn’t that everyone?) Two of Australia’s favourite festivals have teamed up for the perfect pairing. Mould showcases more than 50 Australian artisan cheeses from bright to pungent and ripe, while Pinot Palooza pours drops from here and abroad. Let winemakers from Innocent Bystander, Meadowbank and Yering Station show you the art of pairing pinot noir with food. In between, try standout cheeses from Bruny Island, Long Paddock and Dreaming Goat, and shop for cheeseboard accompaniments including award-winning charcuterie, pâté, relishes and honey. There are also drinks by Archie Rose. $59, mouldcheesefestival.com\n\nAdvertisement\n\nDarker Days is an annual High Country festival embracing dark ales, live music and more. Supplied Darker Days Festival (June 21) Good for: Craft beer fans who like their brews dark and with a side of rock. At Bright’s beer and music festival, headlined this year by local indie legends British India, snuggle up beside the bonfire and cradle dark beers from hosts Bright Brewery, New Zealand’s Urbanaut, NSW’s Seeker Brewing and Victoria’s Boatrocker. There’ll be other drinks from High Country producers Alpine Cider, Reed and Co, and Backwoods; hearty feasts of smoked meat, spicy Mexican cuisine and more; plus face-painting, roving entertainers and live music well into the night. Tickets on sale April 23. Visit Instagramor brightbrewery.com.au/darkerdays for updates.\n\nAdvertisement\n\nDeli Lane (May 10) Good for: Busy people who need cooking inspiration – and anyone who wants to treat their mum the day before Mother’s Day. Cooking fast, flavourful food for the family is TV host and author Justine Schofield’s ninja skill. And she’s going to share some of her best tricks for streamlining your cooking at a fabulous long lunch hosted by Good Food Events. Embracing your freezer is the focus of Schofield’s new cookbook, Cook Ahead, and she’ll be showing how frozen veg can be your friend with her menu for Deli Lane presented by Bird’s Eye. Joining her will be MasterChef alumni Conor Curran to bring the fun. $135 for three courses including drinks, goodfoodevents.com.au Two top Melbourne chefs will cook for guests at Kittawa Lodge, King Island. Supplied\n\nAdvertisement\n\nRosheen Kaul and Stephen Nairn at Kittawa Lodge\n\n(May 28 to June 3, July 30 to August 5) Good for: Those wanting a super boutique experience (although it has a price-tag to match). If you can’t beat the chill, go all in and book a Tasmanian escape. At secluded Kittawa Lodge on King Island, two super-star Melbourne chefs will bunker down with guests over winter, preparing toasty dinners, bountiful picnics and dreamy breakfasts. Stephen Nairn (Omnia, Yugen) kicks things off in May, followed by Rosheen Kaul (ex-Etta) in July. From Nairn, expect clam chowder, King Island beef with Jerusalem artichoke, and sticky toffee pudding. From $8650 for two guests for three nights, kittawalodge.com/bookings With Emma Breheny\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/best-dressed-in-the-sky-the-top-7-airline-uniforms-of-all-time-20250408-p5lq8q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Best dressed in the sky: The top 7 airline uniforms of all time",
    "publish_date": "Mon, 14 Apr 2025 10:58:31 +1000",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "East meets West in Lawrence Xu’s designs for Chinese carrier Hainan Airlines, which made its debut during Paris Fashion Week in 2017. “When waiting at the boarding gate, stewardesses will be wearing cheongsam, coats, hairpins, beret-style hats, and high heels to show their full respect to passengers,” Xu said at the launch. The cheongsam-inspired dresses feature a print of the mythical roc bird, referencing planes in flight, and are teamed with muted grey jackets with contemporary lines. Male crew are given grey double-breasted coats that would look equally at home in any finance district. 3. Braniff Airlines, Emilio Pucci, 1965\n\nCabin crew model 1960s Pucci uniforms in front of Lockheed’s supersonic transport mock-up. Credit: Getty Images The psychedelic uniforms of the Braniff Airlines flight crew by Emilio Pucci in 1965 were stylish and fashion forward but did little to dispel the “coffee, tea or me” stereotype of cabin crew. Under the guidance of marketing guru Mary Wells Lawrence, the inspiration for Mad Men’s Peggy Olson, the colourful uniforms for the Texas-based airline turned the economy aisle into a runway. Lawrence devised a layering concept known as the Air Strip, allowing staff to remove pieces as the flight progressed to its destination. Rain domes – to protect hairdos from rain and wind on the tarmac – lasted only one month as part of the uniform as there was nowhere to store them on board.\n\nThe uniforms were more successful than the airline, which was grounded in 1982, with vintage Pucci pieces frequently selling for more than $1000 on eBay. 4. Qantas, Emilio Pucci, 1974 Emilio Pucci reveals his Qantas uniforms on the cover of the airline’s magazine in 1974. They remained in use until 1985. Following his success with Braniff, Qantas commissioned Pucci to design its cabin crew uniforms in 1974. The striptease layering of the Braniff uniforms was abandoned in favour of a vivid floral print, jersey shirt dress, light enough to be washed in a hotel basin for staff on a short layover.\n\nMen were given boxy block colour jackets, denoting their rank, which were voluminous enough to store cartons of duty-free cigarettes, with lapels competing with the plane’s wingspan. Unfortunately, the women’s uniform was the only one to make the cut for the Jenny the Jetsetting Qantas Air Hostess Doll released in 1974. 5. Air France, Cristobal Balenciaga, 1968 The Air France summer and winter uniforms for flight attendants designed by Cristobal Balenciaga in 1968. The Air France uniforms by Cristobal Balenciaga marked the only time the revered couturier stooped to design ready-to-wear pieces.\n\nIn 1968, Balenciaga closed his couture house after creating a sleek uniform for the female cabin crew that would probably win the Fashions on the Field competition at the Melbourne Cup if worn today. The uniform came in a winter style with a high-waisted jacket with four patch pockets, and a navy-blue-and-white scarf that could be knotted to hold hats in place. The skirt featured kangaroo pockets and was worn above knee-high boots, but the summer collection was the real standout. In sky-blue or pale pink, the summer uniform featured a short-sleeved, double-breasted cropped jacket with an asymmetric fastening, and prim navy-blue hatter’s bow beneath a Peter Pan collar. This is what the schoolgirl Madeleine would have worn once she graduated from the convent. 6. Virgin Atlantic, Vivienne Westwood, 2014\n\nTelevision personality Michelle Visage (second from left) at the launch of Virgin Atlantic’s gender-neutral uniform policy in 2022, wearing the Vivienne Westwood designs. The late Dame Vivienne Westwood’s fondness for flounces, bare bottoms and a ribald sexuality in her designs seemed to make her an unlikely choice to upgrade Virgin Atlantic’s uniforms in 2014. “She was the natural choice to redesign the uniform across all areas of our business,” said a statement from the airline. “Firstly because original design and sustainability are vital to both Virgin Atlantic and Vivienne Westwood.” Westwood’s signature details are present with the frill blouse taken from her Red Label spring/summer 2005 collection, pencil skirts with a back pleat, and red jackets with nipped waists. Three-piece suits in deep burgundy and grey, worn over a white shirt with wide collar, were originally the choice for men. In 2022, the airline launched a gender-free approach to dressing, with staff able to choose any pieces from the range to reflect their identity. Following the announcement, staff on a flight to Qatar were instructed to dress according to traditional gender norms.\n\n7. Alaska Airlines, Luly Yang, 2018 The Alaska Airlines uniform by Luly Yang, unveiled in 2018. The first time I flew Alaska Airlines, I was captivated by a flight attendant’s dreamcatcher earrings and devastated to find out that they weren’t part of the uniforms. A quick trip to the cockpit alleviated my disappointment. Seattle-based designer Luly Yang’s uniforms for the airline, unveiled in 2018, are mostly unremarkable but the pilot’s leather jackets inject some Top Gun cool into the skies. Let’s hope the jackets remain as Yang designs the airline’s new uniforms following its merging with Hawaiian Airlines.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/stan-team-calls-teddys-miracle-try-20250414-p5lrjk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Stan team calls Teddy's miracle try",
    "publish_date": "Mon, 14 Apr 2025 10:55:02 +1000",
    "category": "sports",
    "authors": [],
    "text": "Stan team calls Teddy's miracle try\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/matt-dennys-discus-record-is-broken-within-minutes-as-lithuanias-mykolas-alekna-surpasses-the-75-m-20250414-p5lrjm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Matt Denny's discus record is broken within minutes as Lithuania's Mykolas Alekna surpasses the 75 m",
    "publish_date": "Mon, 14 Apr 2025 10:54:37 +1000",
    "category": "finance",
    "authors": [],
    "text": "Matt Denny's discus record is broken within minutes as Lithuania's Mykolas Alekna surpasses the 75 m\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/barnes-slots-a-double-against-united-20250414-p5lrjl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Barnes slots a double against United",
    "publish_date": "Mon, 14 Apr 2025 10:54:16 +1000",
    "category": "finance",
    "authors": [],
    "text": "Barnes slots a double against United\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-key-issues-that-will-define-the-election-and-where-the-major-parties-stand-20250306-p5lhbw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Albanese v Dutton: what are they offering on housing, taxes, health",
    "publish_date": "Mon, 14 Apr 2025 10:50:11 +1000",
    "category": "finance",
    "authors": [
      "Natassia Chrysanthos"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Anthony Albanese and Peter Dutton have launched their formal election campaigns with duelling policies on taxation and housing, which will add to the policy debate at this year’s election. The leaders are also tussling over Medicare and fighting over the best energy policy for Australia’s future. But it all comes down to the cost of living, which is the defining issue of the campaign, as turbulent global affairs put a spotlight on foreign policy and the economy. Here are the key policy issues dominating the campaign, and where Labor and the Coalition stand on them. Housing and home ownership For first home buyers, Labor is promising $10 billion to build 100,000 homes exclusively for first-time buyers to move into from 2027. It will also allow all first home buyers to purchase property with just a 5 per cent deposit, with the government to guarantee the rest of a typical 20 per cent deposit.\n\nAdvertisement\n\nThis is on top of its promise to build 1.2 million homes by the end of the decade. Its $10 billion Housing Australia Future Fund will raise money for new builds, including 40,000 social and affordable rental homes. The Coalition, on the other hand, will allow first-home buyers to deduct mortgage interest payments from their taxable income for five years when they buy newly built homes, up to the first $650,000 of a mortgage. This will apply to singles earning up to $175,000, and couples on a combined income of up to $250,000. Loading Australians would also be able to withdraw up to $50,000 from their superannuation accounts to buy their first home. The Coalition says it will abolish Labor’s housing fund and instead invest $5 billion to deliver infrastructure – such as water, power and sewerage – at development sites, which it says will help build 500,000 new homes. Both parties will ban foreign investors from buying existing homes for two years – a Coalition policy that Labor has adopted.\n\nTaxes and cost-of-living relief\n\nAdvertisement\n\nTax was a latecomer to the campaign agenda but has become a significant talking point. Labor will create a $1000 instant tax deduction for work-related expenses, so people won’t need to submit receipts up to that amount in their tax returns. The party has also introduced an extra tax cut – on top of its restructured stage three tax cuts – that will reduce the lowest marginal tax rate from 16 to 14 per cent over two years, starting in July 2026. It means workers will get a $268 tax cut in 2026-27, which becomes $536 a year from 2027-28 onwards. The Coalition says it will repeal the latest tax cut if it wins government, effectively reinstating the higher 16 per cent tax rate. Loading But it will give a one-off $1200 tax offset to people earning between $48,000 and $104,000 in next year’s tax return. Taxpayers earning below $48,000, or between $104,000 and $144,000, will receive a smaller amount. The Coalition will also halve the fuel excise for 12 months, saving Australians 25.4¢ per litre of petrol.\n\nAdvertisement\n\nAdvertisement\n\nThe Coalition will scale this back and instead says it will build seven government-owned nuclear power plants by the mid-2040s. Until then, it will rely on running coal plants for longer and ramp up domestic gas production. It wants gas companies to divert more supply to the Australian market, rather than ship it offshore. Both parties have committed to net zero greenhouse gas emissions by 2050, but Labor has also set a legally binding target to cut emissions by 43 per cent by 2030. The Coalition has indicated it would be less ambitious for the end of the decade, but said it would set interim targets in government. Population and immigration Both parties say immigration has been too high since the pandemic and needs to come down. Labor has forecast net overseas migration will slow to 260,000 in 2025-26. The Coalition has committed to slashing the budget numbers by an extra 100,000 people. Loading International students are a big part of this picture: Labor wanted to cap student numbers at 270,000, but the Coalition blocked that bill. The opposition has since said it will introduce its own caps to set numbers at 240,000, while hiking student visa fees. The parties last year formed a unity ticket when it comes to how they manage people Australia doesn’t want in the country: they teamed up on three new laws, including paying third countries to take non-citizens. However, Dutton has also pledged to go harder on this issue – he is considering a referendum on allowing politicians to strip criminal dual nationals of their Australian citizenship, and wants questions on antisemitism in the citizenship test.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/devil-in-the-detail-will-first-home-buyers-benefit-from-labor-and-coalition-promises/z6bwv9vx5",
    "title": "'Devil in the detail': Will first home buyers benefit from Labor and Coalition promises?",
    "publish_date": "Mon, 14 Apr 2025 01:43:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Economists and industry leaders have expressed concern over housing promises made by both Labor and the Coalition during the election campaign .\n\n\n\n\n\nAt the weekend, Prime Minister Anthony Albanese committed to expanding a scheme that allows first home buyers to purchase a home with a 5 per cent deposit (if they buy a newly built or substantially renovated home); and said Labor would also build up to 100,000 new affordable homes for first home buyers.\n\n\n\n\n\nMeanwhile, Opposition leader Peter Dutton unveiled a plan that would make interest payments on the first $650,000 of a first home buyer's mortgage tax deductible for the first five years for those who purchase a newly built home.\n\n\n\n\n\nEconomist Chris Richardson described both parties' approaches as \"pretty dumb\", warning that their housing pledges would only worsen inflation and fail to address Australia’s housing affordability crisis.\n\n\n\nRichardson added that property prices would likely continue to rise as a result of these promises.\n\n\n\n\n\n\"Both sides are promising to give us extra money … this doesn’t make Australia more prosperous. It’s just more money, chasing the same amount of stuff [and resulting in] prices higher than they need to be,\" he said.\n\n\n\nHow is housing affordability being defined?\n\nIndependent senator Jacqui Lambie also hit out at both leaders for failing to deliver on previous housing commitments.\n\n\n\n\n\n\"I mean, you’ve got to be kidding me,\" Lambie said in an interview on Channel Nine's Today on Monday.\n\n\n\n\n\n\"How about you turn the first lot of soil on the first 50 or 60,000 homes that you’ve promised?\"\n\n\n\n\n\nLabor's Housing Australia Future Fund to build 20,000 new social housing properties over five years from 2024 has been criticised for not yet delivering any new homes, although Labor has blamed delays in getting legislation passed on the Greens and Coalition.\n\n\n\nExperts have also questioned the way housing affordability is being defined in the national conversation.\n\n\n\n\n\nLiam Davies, a lecturer in sustainability and urban planning at RMIT, argued that many of the new schemes on offer are mislabelled as being aimed at housing affordability.\n\n\n\n\n\n\"They’re actually about 'accessibility'— we’ve just made it easier to get really big loans and that we call 'housing affordability'.\"\n\n\n\nTwo solutions for two different groups\n\nDavies noted that the two major housing schemes target different demographics.\n\n\n\n\n\nLabor is helping those without a deposit and the Coalition is focusing on those who already have one, but both face the same fundamental issue: a reliance on new builds.\n\n\n\n\n\nDavies said the \"devil in the detail\" is that the policies are only for new builds.\n\n\n\nREAD MORE The voters who could see more misinformation this election\n\n\"So it really depends on when those new builds are built, where they’re built,\" he said.\n\n\n\n\n\n\"If it’s just suburban housing on the fringe, that doesn’t really help.\"\n\n\n\n\n\nHe added that given the scale of government expenditure involved, there needed to be a longer-term strategy to ensure sustained housing accessibility and genuine affordability.\n\n\n\nMore support needed to keep up with demand\n\nFrom an industry perspective, Property Council of Australia CEO Mike Zorbas welcomed the proposed injection of new builds as a \"shot in the arm\" but warned more support for local planning systems was needed to ensure supply could keep pace.\n\n\n\n\n\n\"Coupled with supply improvement policies, deductibility of mortgage repayments on new builds will help first home buyers who are watching their dream of home ownership slip away,\" he said.\n\n\n\n\n\n\"A stronger demand pipeline allows building businesses to plan for the future with confidence, translating to more new homes across the country and is a hedge against global uncertainty.\n\n\n\n\n\n\"Whoever forms government will need to apply additional direct incentives to boost state and local government supply and approval capacity, keeping the market in equilibrium, to build the homes the nation needs.\"\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/di-sheehan-the-church-stole-my-baby/kgijtoo6t",
    "title": "Di Sheehan: The Church Stole my Baby",
    "publish_date": "Mon, 14 Apr 2025 00:48:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Di was a guest on our Insight episode, Secrets and Lies , broadcast in 2024.\n\n\n\n\n\nFollow Insightful on the SBS Audio App , Apple Podcasts , Spotify , or wherever you get your podcasts.\n\n\n\n\n\nHost: Kumi Taguchi\n\n\n\nSupervising Producers: Rebecca Baillie and Maria Nguyen-Emmett\n\n\n\nExecutive Producer: Ross Scheepers\n\n\n\nStory Editor: Madox Foster\n\n\n\nSenior Post Producer: Saber Baluch\n\n\n\nProduction Coordinator: Kate Hrayssi\n\n\n\nArtwork: Aaron Hobbs\n\n\n\nAudio Operations Supervisor: Jonathan Hochman\n\n\n\nMastering and mixing by Micky Grossman\n\n\n\nLISTEN TO Di Sheehan: The Church Stole my Baby SBS News 14/04/2025 23:50 Play\n\nTranscript\n\n\n\n\n\nDi: The issue for me is that what the Catholic Church in particular and other churches.\n\n\n\n\n\nDi: What they were doing, which was so cruel in their mind, they were turning a child that they labelled as illegitimate into a legitimate child, a child that needed to be saved from the young, unmarried mother.\n\n\n\n\n\nKumi: You discovered that the baby you had been told had died at birth, was in fact alive. What was it like to learn that?\n\n\n\n\n\nDi: I was trying to work out what happened. I was trying to remember to breathe again. I was also trying to work out how I would tell my other children and my family, because with this secret, to me, I hadn't told anyone.\n\n\n\n\n\nKumi: Hi, I'm Kumi Taguchi. Welcome to Insightful. It's impossible to forget Di Sheehan.\n\n\n\n\n\nDi: I turned to my then husband and I turned to him and said, I want another baby.\n\n\n\n\n\nDi: Because there was a void there.\n\n\n\n\n\nKumi: I was so happy that Di wanted to chat again for this podcast.\n\n\n\n\n\nKumi: Hi Di. How nice is it to see you again? I was just smiling as you were walking in.\n\n\n\n\n\nDi: Alright, OK.\n\n\n\n\n\nKumi: Thank you so much for coming to chat.\n\n\n\n\n\nKumi: Di, you were one of 5 children. You grew up in a big Catholic family. What was it like growing up in that family in the sort of 50s and 60s?\n\n\n\n\n\nDi: It was a difficult childhood as such. My brother and sisters, we had a really good relationship, but we didn't as such have a conventional upbringing. We were raised in hotels.\n\n\n\n\n\nDi: I quite often say that I come from an Irish Catholic alcoholic background, and that's quite literally true. My father was a publican. My first memory is that downstairs was a pub, you know, old fashioned hotel.\n\n\n\n\n\nDi:. So my sisters and my brother, we were like a little gang because we just roamed through the hotel, you know, went into the guest rooms, jumped on the bed, got into trouble, all those sorts of things. And from a very early age, we all tried to stay out of the way of our father, because you would never know what would set him off when you're living in that environment.\n\n\n\n\n\nDi: There's a lot of alcohol, you know, obviously a lot of drinking, a lot of smoking, you know, the smells. To this day, I can't walk past a hotel and I get a whiff from the cellar of beer and it just turns my stomach, as does the smell of cigarettes. It was just that that environment.\n\n\n\n\n\nKumi: I understand you stood up to your father when you were about 11. What happened there?\n\n\n\n\n\nDi: I did stand up to my father. I can remember distinctly it was my mother's birthday and he had bought her a piece of jewelry. He had it in a box. But he was drunk. He was, he was pissed. We were all, you know, wanting to have cake and all laughing and talking, etc. and I don't know what set him off and\n\n\n\n\n\nDi: He just threw the box with the ring or whatever was inside at my mother and hit her.\n\n\n\n\n\nDi: And I, I did try to stand up to him.\n\n\n\n\n\nDi: And tell him that that wasn't right. We were, all of us were concerned, we were in tears and he hit me.\n\n\n\n\n\nDi: So I ran out. I, I left.\n\n\n\n\n\nDi: I just ran out the door and I thought, I'll go somewhere safe, which was the local Catholic Church. And the priest listened to what I said and then drove me back and put me back inside.\n\n\n\n\n\nDi: And then of course, my father says, I'll come in for a drink. And then the priest says, well, well, you know, it's good to have her home. I'll stay and have some drinks with you. It must be difficult having a daughter that age that isn't obedient or doesn't respect you or things like that.\n\n\n\n\n\nDi: And that was a betrayal. That was a betrayal. I had, I can remember, I felt such hatred, you know, having been told that the church was a sanctuary.\n\n\n\n\n\nDi: And in fact, the priest, that priest and other priests were just my father's drinking buddies.\n\n\n\n\n\nKumi: You must have felt so let down and that kind of trust.\n\n\n\n\n\nDi: Absolutely, and abandoned. And when that happens when you're a child, you start to put up those barriers to protect yourself.\n\n\n\n\n\nKumi: You've said that sort of the only way that you could survive your childhood was to sort of get out as soon as you could and getting an education and\n\n\n\n\n\nKumi: Studying to be a vet, it feels like they, that was such a huge part of having an adulthood or moving out of that childhood.\n\n\n\n\n\nDi: It was important for me earlier on.\n\n\n\n\n\nDi: To take control of my life. I can remember that I.\n\n\n\n\n\nDi: And I didn't think this straight away. It was a conscious thought that I was never.\n\n\n\n\n\nDi: Going to let anyone have any control over my life, that sort of control over my life, that I was going to be responsible for myself.\n\n\n\n\n\nDi: And I knew that I needed to, I needed to educate myself, and that's what I focused on.\n\n\n\n\n\nKumi: You fall in love, you're unwed. You fall pregnant.\n\n\n\n\n\nKumi: When you found out you were pregnant, what went through your mind?\n\n\n\n\n\nDi: First of all, I think I was in denial. It was, I can't be, it's.\n\n\n\n\n\nDi: Not possible, um, you know, all the things that go through here.\n\n\n\n\n\nDi: And I had a baby.\n\n\n\n\n\nDi: And I was told that the baby had died. I didn't ever, after he was born, I didn't hold him. They.\n\n\n\n\n\nDi: Took him away, and I don't even know that anyone told me that I'd had a boy.\n\n\n\n\n\nDi: And then I was left isolated. I can remember they took him away and everyone left. And I was freezing cold. I can remember.\n\n\n\n\n\nDi: I just was shivering.\n\n\n\n\n\nDi: And I was on, you know, I remember it as a stainless steel table by myself, left there by myself.\n\n\n\n\n\nDi: And I don't know for how long. And I can remember that.\n\n\n\n\n\nDi: I think it was a doctor because a man went past the door.\n\n\n\n\n\nDi: With a white coat on and she said, Are you all right? And I was shivering, I was crying. I was bleeding. I had no blanket on me, nothing.\n\n\n\n\n\nDi: And he said, are you all right? And I said, I just went no. And he just walked a few paces and he said,\n\n\n\n\n\nDi: She must have been the nurses standing there.\n\n\n\n\n\nDi: Someone get in there and look after her.\n\n\n\n\n\nDi: That…that was the only kindness that I received at that time.\n\n\n\n\n\nKumi: So you're all alone, you've given birth to a baby. You haven't held him, you don't even know it's a him.\n\n\n\n\n\nKumi: Do they then come in and say, your baby died?\n\n\n\n\n\nDi: No, nothing.\n\n\n\n\n\nDi: From that time, having seen that doctor.\n\n\n\n\n\nDi: I don't have a lot of memories after that. I can't remember whether it was like death by 1000 cuts where they came in and said that he was.\n\n\n\n\n\nDi: Unwell or, but I do know that they said that he hadn't survived.\n\n\n\n\n\nKumi: You then signed papers which you believed were sort of discharge papers to get you out of the hospital, but in fact, you were signing adoption you were handing over your child to the, to the state.\n\n\n\n\n\nDi: Yes. That's exactly what happened. I was told that I couldn't leave the hospital until I'd signed the papers, so I signed the papers. Then I left.\n\n\n\n\n\nKumi: You went on to marry and have 2 more children, when you held those babies in your arms and you brought them home.\n\n\n\n\n\nKumi: What was that like?\n\n\n\n\n\nDi: It was absolutely. It was absolutely wonderful. It was.\n\n\n\n\n\nDi: Most wonderful, wonderful feeling.\n\n\n\n\n\nDi: To be responsible for this child, to have this love that I did have, and I understand more now. For my eldest son, I had maternal connection and I had love for him, but no child to.\n\n\n\n\n\nDi: To give it to and then having buried all those feelings when I had.\n\n\n\n\n\nDi: My other children, it was I.\n\n\n\n\n\nDi: Just poured myself, I just.\n\n\n\n\n\nDi: I just rank up their smell, their touch, they feel, their noises and fully accepted the responsibility to look after them.\n\n\n\n\n\nDi: I know that when, because I had a daughter with my then husband and then a son.\n\n\n\n\n\nDi: And when I had my son.\n\n\n\n\n\nDi: I turned to my then husband and I turned to him and said, I want another baby.\n\n\n\n\n\nDi: Because there was a void there, it was his toe.\n\n\n\n\n\nDi: I wanted my first child to be part of this family.\n\n\n\n\n\nKumi: Did you ever tell your then husband about your firstborn?\n\n\n\n\n\nDi: No.\n\n\n\n\n\nDi: No, when I buried all this, and then started virtually a new life.\n\n\n\n\n\nDi: I'd buried it so deeply, I didn't have.\n\n\n\n\n\nDi: The skills, I didn't have the understanding to be able to talk about this to anyone and.\n\n\n\n\n\nDi: Not to him either.\n\n\n\n\n\nKumi: 42 years later, you received an email. Who was it from?\n\n\n\n\n\nDi: I received an email from a young man saying with his birth date in the hospital saying he thought.\n\n\n\n\n\nDi: That I was his mother.\n\n\n\n\n\nDi: And I couldn't breathe. I I couldn't breathe.\n\n\n\n\n\nDi: It was uh very difficult to take in and then I had to process.\n\n\n\n\n\nDi: What had happened in the context of me personally because I had blocked out exactly what had happened. And I think the issue for me is that what society in general at that time and the Catholic Church in particular and other churches and doctors, etc. what they were doing, which was so cruel and so lacking in the form of\n\n\n\n\n\nDi: Kindness at all.\n\n\n\n\n\nDi: was that they were in their mind, they were turning.\n\n\n\n\n\nDi: A child that they labelled as illegitimate into a legitimate child, a child that needed to be saved from the young, unmarried mother.\n\n\n\n\n\nKumi: You discovered that the baby you had been told had died at birth, was in fact alive, and that you have a son who is now in his 50s. What was it like to learn that?\n\n\n\n\n\nDi: It was… It was sheer joy. It was unbridled joy.\n\n\n\n\n\nDi: That what I'd buried so deeply in the secret that I'd held.\n\n\n\n\n\nDi: And what I'd been told was not true. And the fact that he he was alive wasn't just a relief, it was just.\n\n\n\n\n\nDi: Joy, even as I was trying to work out what happened, I was trying to remember to breathe again. I was also trying to work out how I would tell my other children and my family, because with this secret, to me, I hadn't told anyone.\n\n\n\n\n\nDi: Mm.\n\n\n\n\n\nKumi: It's just extraordinary. I can't even imagine that moment and so much to process in an instant, in an instant. You were initially quite reluctant to talk about your story. Why was that?\n\n\n\n\n\nDi: The story is very personal, even though it happened to, you know, the same situation in various forms happened to probably around 240, 250,000 young women that were either coerced or lied to and their babies were then taken and given to couples, other couples.\n\n\n\n\n\nDi: But I didn't want to be seen as a victim or.\n\n\n\n\n\nDi: Being gratuitous in this very, very personal situation. And I think just thinking about it now with that question that you've asked is,\n\n\n\n\n\nDi: I think that I didn't want to be judged.\n\n\n\n\n\nDi: I think, and, ah, I think that was a big.\n\n\n\n\n\nDi: Being part of it.\n\n\n\n\n\nDi: It kept this secret for decades, you know, like with me, it was 40 years. It was important to be able to say that, to be able to sit there and let people know that this actually happened and it had a devastating effect on the young women and the children involved.\n\n\n\n\n\nKumi: What sort of judgement were you thinking might happen or what were you afraid?\n\n\n\n\n\nKumi: That people might say, what did you think people would say?\n\n\n\n\n\nDi: I always thought of myself as having been brought up in the Catholic Church. I labelled myself as a Catholic girl gone bad. And\n\n\n\n\n\nDi: Even when I, when I think of it now, that's.\n\n\n\n\n\nDi: It's very painful.\n\n\n\n\n\nDi: To think that I, well, it's sad to think that that's how I labelled myself but.\n\n\n\n\n\nDi: When you're a young girl and you've been brought up and told by nuns and involved in the Catholic Church, then that label became a part of me. I know it's not rational, but it was.\n\n\n\n\n\nDi: That understanding that, what I'd been taught as a Catholic child and the strict moral code that I'd done something just.\n\n\n\n\n\nDi: Absolutely awful, which was to fall in love with a young man and have a relationship.\n\n\n\n\n\nDi: And not be buried and then have a baby. So that was in society these days, I mean, you would think, wouldn't do that. We've come a long way. But that background and that indoctrination is very entrenched, becomes entrenched. And you, you can tell I get transported back a bit to.\n\n\n\n\n\nDi: What happened, even though I don't have whole memories of that time, I lost probably more than 2, closer to 4 years of my life. After that, just trying to cope without any support, etc. and nobody talking about anything, just trying to move on.\n\n\n\n\n\nDi: And when that happens, that is the judgement and the pain. Some people have called me brave, which I don't think that I am, but I think\n\n\n\n\n\nDi: If you don't talk about a secret, if you don't acknowledge it, then.\n\n\n\n\n\nDi: I don't believe you can move on, and I probably would have if my son hadn't.\n\n\n\n\n\nDi: Hadn't sent me an email, I probably would have gone to my grave without sounding melodramatic.\n\n\n\n\n\nDi: Without telling anyone. Whereas now that I've spoken about it to my family and my friends, and that is all part of the healing process and an understanding too of\n\n\n\n\n\nDi: Our history, which was so devastating to a group of society that we're actually innocent young women.\n\n\n\n\n\nKumi: When did you tell your then adult children? About him and what was that like?\n\n\n\n\n\nDi: We always have a family dinner once a week. And my youngest was still at home. He was at university and my daughter would come over. And so I said, OK, then, come over for dinner. We'll have a family meeting. I've got something I want to tell you. So they were there in the kitchen, meal was going out onto the table. And my youngest stood in the kitchen and said, OK, you've got something to tell us. And I said, yes. I said, but we'll have dinner and then I'll talk to you.\n\n\n\n\n\nDi: And he went, I know what it is.\n\n\n\n\n\nDi: And I went, I don't think so. He was adamant, yes, I know what it is.\n\n\n\n\n\nDi: I went, OK, what is it, then, what do you think it is? And he went, you've found God.\n\n\n\n\n\nKumi: So there was something different about you and you've kind of flagged that there's something you want to talk about. When he said that, did you laugh? What the fuck?\n\n\n\n\n\nKumi: What the fuck?\n\n\n\n\n\nDi: I said, Tom, where did you get? Why would you think that? I mean, that's absurd. I said, you know what I think about religion. And I said to him, you don't know your mother very well at all, do you?\n\n\n\n\n\nKumi: Yeah.\n\n\n\n\n\nKumi: And so you say, no, I'm not, I'm not, that's not what's happened. I haven't found God, but this is what's happened.\n\n\n\n\n\nDi: And by the time I had told them, just I told them briefly that I had a relationship and that I've been contacted and my son and I'd been told that he died and now he was here and\n\n\n\n\n\nDi: And then I said, and by the way, I'm a grandmother, and they burst out.\n\n\n\n\n\nDi: I mean, you're a grandmother. Oh God, like this. And then I had the email and I gave it to them. And then I was crying and my daughter hugged me and\n\n\n\n\n\nDi: Then we talked a bit about what had happened, etc. and they accepted it. They accepted that they had a brother.\n\n\n\n\n\nDi: And they had two cousins as well. So it was then we moved on to, well, when can we meet them? How can we do this, etc. etc. So.\n\n\n\n\n\nDi: It was wonderful. It was absolutely wonderful.\n\n\n\n\n\nKumi: What is your relationship like with your eldest son now?\n\n\n\n\n\nDi: It's a very relaxed relationship now. I was overjoyed the first time that I heard him.\n\n\n\n\n\nDi: Refer to me as my mother sit like this, and that relationship is.\n\n\n\n\n\nDi: I think getting stronger and we're understanding.\n\n\n\n\n\nDi: More about each other. We celebrate holidays and birthdays and things like that. And I wouldn't say we, it's not that we're working on it. It's, it's, he's part of the family, we're part of his family.\n\n\n\n\n\nDi: And it's respectful and kind. It's a lovely relationship.\n\n\n\n\n\nKumi: You've described the shame you felt and feeling worthless and judged. Do you still feel that way about yourself when you look in the mirror, who's the dye that you see?\n\n\n\n\n\nDi: No, I don't feel that way, I think.\n\n\n\n\n\nDi: My son finding me has meant that I can.\n\n\n\n\n\nDi: Accept what happened without the guilt, have a better understanding of what was going on.\n\n\n\n\n\nDi: And I'm probably less angry than I was, you know, holding on to a secret like that.\n\n\n\n\n\nDi: I don't want to sound melodramatic in that it eats you away, but it's there and.\n\n\n\n\n\nDi: You can't be your true self if you're not honest with.\n\n\n\n\n\nDi: With yourself, with your family, you know, with your friends. So having that secret, it was cathartic as such and\n\n\n\n\n\nDi: And I am allowing myself to be.\n\n\n\n\n\nDi: Happier, more content, and enjoying.\n\n\n\n\n\nDi: The things that go on with in my life, but also with my family.\n\n\n\n\n\nKumi: Di, it is such a pleasure to chat to you again and see you again.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/mianne-bagger-trans-were-not-a-voice-for-women/yeyibbq87",
    "title": "Mianne Bagger: Trans - We’re Not A Voice for Women",
    "publish_date": "Mon, 14 Apr 2025 00:45:38 +0000",
    "category": "sports",
    "authors": [],
    "text": "Mianne was a guest on our Insight episode, Gender Games , broadcast in 2022; and The Gender Spectrum , broadcast in 2022.\n\n\n\n\n\nFollow Insightful on the SBS Audio App , Apple Podcasts , Spotify , or wherever you get your podcasts.\n\n\n\n\n\nHost: Kumi Taguchi\n\n\n\nSupervising Producers: Rebecca Baillie and Maria Nguyen-Emmett\n\n\n\nExecutive Producer: Ross Scheepers\n\n\n\nStory Editor: Madox Foster\n\n\n\nSenior Post Producer: Saber Baluch\n\n\n\nProduction Coordinator: Kate Hrayssi\n\n\n\nArtwork: Aaron Hobbs\n\n\n\nAudio Operations Supervisor: Jonathan Hochman\n\n\n\nMastering and mixing by Micky Grossman\n\n\n\nLISTEN TO Mianne Bagger: Trans - We’re Not A Voice for Women SBS News 14/04/2025 23:38 Play\n\n\n\n\n\nTranscript\n\n\n\n\n\nMianne: I don't know many other transsexual women, for example, but the few I do know, we know there are some places that are reserved for women that we won't go. We don't have rights to be a voice for women. Yes, we're living as women, but that's not, we've had our own journey and have that respect for women, and that mutual respect has existed, and that's now been pretty much destroyed. And now society is understandably having a backlash.\n\n\n\n\n\nKumi: Hi, I'm Kumi Taguchi. Welcome to Insightful.\n\n\n\n\n\nMianne: It almost becomes to be anyone with blue hair that doesn't agree with their observed sex at birth, and you're trans.\n\n\n\n\n\nKumi: Mianne Bagger transitioned in the 90s. In 2004, she became the first openly transitioned woman to play in a professional golf tournament.\n\n\n\n\n\nMianne: I clearly wasn't as strong, and I knew that was the case also just with general life, and the girls got to meet me as well and play against me and could see my game was no different.\n\n\n\n\n\nKumi: What struck me is how incredibly honest Mianne is and thoughtful.\n\n\n\n\n\nMianne: I was just surviving. This wasn't working, I was dying, I was suffocating.\n\n\n\n\n\nMianne: I'd rather live.\n\n\n\n\n\nKumi: And he is one of those people who's constantly learning and evolving.\n\n\n\n\n\nKumi: Mianne, it's so great to see you again. Welcome.\n\n\n\n\n\nMianne: Thank you for the invitation.\n\n\n\n\n\nKumi: You transitioned in 1992. When did you become aware of your gender identity issues?\n\n\n\n\n\nMianne: From my earliest memories is about 7 or 8 years old, and you know, it's really hard to,\n\n\n\n\n\nMianne: Explain or define what that is. It's just an awareness that happens, and a common thing I'll relate to is maybe left or right-handed, you know, it's not something that people chose, it's just something people are. And if you ask people when did you know you were left or right-handed, well,\n\n\n\n\n\nMianne: You don't, you just are, and for me as well, that's just my earliest recollections, and it's more an awareness of maybe somehow being different, having different likes, not having things in common with other kids or other boys at the time.\n\n\n\n\n\nMianne: So you go on this, you, you start this journey of self-discovery going, what's going on? Why do I feel like this is, this isn't like everyone else?\n\n\n\n\n\nKumi: Can you think of specific things that you liked or disliked that made you feel that difference?\n\n\n\n\n\nMianne: It seems superficial to pinpoint specific things. A bit like the rough and tumble play of boys, you know, doing rugby and, and all of that kind of thing, and, and, and rough sports. I hated it.\n\n\n\n\n\nMianne: And I remember going through early stages of high school in the UK and then because I've always been good at sports, being kind of athletic, good at hand-eye coordination.\n\n\n\n\n\nMianne: And then I was almost kind of mandated in school to join the rugby team, and I thought, oh God. And that's pretty rough tackling and whatever. And I hated it. I think I played two matches and I always came out with a horrible headache and getting beaten around, and I hated it. But it's not to belittle and say, oh, there must be some gender issue, because I don't like playing rough and tumble sports. You know, it's not as, it's not that simplistic. It is far more complex.\n\n\n\n\n\nMianne: And that, and it's kind of a whole package, if you like. It is just an inner sense and this is a kind of an affinity with more things that girls liked and a, and a yearning for that. And I, I don't know what it was. A lot of disconnect from things that a lot of boys did, and just an internal sense of self. There's also that physical feeling of self, the physical wrongness of the body, so it's also an internal thing.\n\n\n\n\n\nKumi: You describe yourself as transsexual. How is that different to transgender? I'm so interested in this terminology.\n\n\n\n\n\nMianne: I know. It's become such a melting pot these days. It used to have trans or transgender came about because it was a bit of a softer term than transsexual. I always hated the term just because of the connotations that it contained the word sex or sexual, which was fine, but now, of course, we were in this.\n\n\n\n\n\nMianne: Weird climate today of well which has amounted to gender activists and everything being lumped under the trans label. It almost becomes to be anyone with blue hair that doesn't agree with their observed sex at birth, and you're trans, and then transsexual people that, let's say be diagnosed with gender dysphoria, I'll put that in quotes, whatever that might mean, because that might be fluid as well. But we've at the time had a recognised psychological condition.\n\n\n\n\n\nMianne: And have then gone through medical treatment to allay that discomfort and for the vast majority of us it's\n\n\n\n\n\nMianne: Quite successful, it's quite an appropriate treatment and enables us to get on with life. So transsexual refers to someone diagnosed with gender dysphoria and then going through the medical treatment of hormone therapy and then eventual surgical intervention, and then get on with life. And trans and transgender now doesn't even involve any medical intervention whatsoever, so we're going into the self ID and it's it.\n\n\n\n\n\nMianne: It's almost become meaningless, but unfortunately there are so many people in the trans category and so few in the transsexual category that we barely have a voice in this big screaming and noise that's going on in the public domain by gender activists that we end up not having a voice and we just fade into the background, but we also then end up getting tarred with the same brush as all the gender activists and you kind of understand.\n\n\n\n\n\nMianne: The standoff position that a lot of people in society might have, and it's like, and people don't understand the difference and don't know the difference, and I think that's why it's also important to have a bit of a voice like you're giving me now as well, to hopefully provide a bit of a, an explanation or clarity in the difference of these terms and provide that separation or that difference.\n\n\n\n\n\nKumi: What voice are you losing by being under that same umbrella?\n\n\n\n\n\nMianne: It's not so much about losing a voice, but we've also had, we, we've almost had a, a definition imposed on us. Like we're some radical or we want to demand society bend over to our whims and do whatever we say. That's not what we're about. The vast majority\n\n\n\n\n\nMianne: of transsexual men and women, we basically merge into life. We work out how do we merge, respectfully merge into life with everyone else and also almost have this mutual respect with society. And for decades prior to this, that mutual respect has existed.\n\n\n\n\n\nMianne: Women and men know this happens, but we go through a transition and then we carry on. We go and get work, and we have friends and boyfriends and girlfriends and whatever it is, some get married and get on with life, and then everyone's happy, and we also know that there are just some places that we don't really have access to. I don't know.\n\n\n\n\n\nMianne: Many other transsexual women, for example. But the few I do know, we know there are some places, for example, that are reserved for women that we won't go. We won't take positions, for example, you know, Women of the Year or Sportswoman of the Year or whatever. It's like, we don't really have rights to that title. We don't have rights to be a voice for women.\n\n\n\n\n\nMianne: Yes, we're living as women, but that's not, we've had our own journey and have that respect for women, and that mutual respect has existed, and that's now been pretty much destroyed. And now everyone's society is understandably having a backlash, you know, access to toilets and changing rooms and, and taking a quite a crowbar approach.\n\n\n\n\n\nMianne: To go, that's it, no flexibility, that's it. Game's over, full restriction, and we're probably going to be impacted by that in some regard. But I think what'll happen quite likely, it'll drive transsexual men and women underground again to live, you know, stealth, to not be able to be open about our lives, which of us, a majority of us or many of us would be.\n\n\n\n\n\nMianne: Capable of doing, and it's just a difficult life to lead. I mean, I've really enjoyed being able to live my life openly and just have friends and people accept me for just who and what I am.\n\n\n\n\n\nMianne: Uh, so who knows what the future's gonna be like?\n\n\n\n\n\nKumi: I want to go to golf. When did you first pick up a golf club and what was it about golf that appealed to you?\n\n\n\n\n\nMianne: It was basically when my mum and dad started playing golf, and I was about, I think I was about 7 or 8 years old at the time. It's probably part of my personality, you know, golf is just such an individual sport. And I'm a technical and detailed kind of person as well. And if anyone that's played a lot of golf understands that it's not just something you don't just grab a stick and hit a ball and hit it where you want it, there's, it can get really, really complex and to get proficient.\n\n\n\n\n\nMianne: At it, it takes a lot of practise, a lot of effort, a lot of really focused and targeted effort and practise with all the the little details. And I think there was some part of golf that just appealed to me immediately, and it was a family thing, so we we then lived in Denmark. We lived in a street with two other families that were a member of the same golf club with their kids.\n\n\n\n\n\nMianne: And so a lot of weekends, particularly in summer, would be at the golf club, and it was filled with fun, so the kids we'd go running around, eating ice-cream, hitting balls on the range, putting, parents were out playing.\n\n\n\n\n\nKumi: Like a lot of pro players in their rookie year, Mianne's scores this summer have been less than stellar, but she staged a powerful comeback.\n\n\n\n\n\nKumi: You took a break from the sport while you transitioned, after your surgery, you returned to amateur golf this time in the women's division. Did the game feel any\n\n\n\n\n\nMianne: different? I just wanted to go back and play golf because I loved it and I missed it. Yeah, I joined a golf club and I was just doing my own thing.\n\n\n\n\n\nMianne: With my personality, I just like doing things well. So I started practising. I'd get there early and wanted to go and play golf well. And good players at golf clubs, they get noticed. So it didn't take long, a few people, you get to know a few people, and then I play with other people, my game gets better. And then someone approached me to join a local pennant team in Adelaide, a women's team.\n\n\n\n\n\nMianne: And of course that surprised me and I thought, really, I mean they all knew who I was. I was always open about my past even then.\n\n\n\n\n\nMianne: And they approached me regardless, and I did question, are you sure? Is that OK? And they go, yeah, yeah, and you know, we discussed it, it's happening around the country. So then I was asked to join a local pennant squad, and I was really tentative because I I was thinking, look, is this fair? Is this OK?\n\n\n\n\n\nMianne: And I stepped into it slowly and I got to play with some of the better players in the state.\n\n\n\n\n\nKumi: Jumping in there, did you express that feeling that you're having of, is this fair? Should I be doing this?\n\n\n\n\n\nMianne: Yes, I, I did because I did question if that was sure this is OK and they reassured me. So I played with some of the players and then playing some of these interclub competitions, I got to meet some of the better players in the state and then played a few more competitions and got to meet some of the better players in the country.\n\n\n\n\n\nMianne: And that's when I learned that my game was kind of average. I wasn't even among the longest hitters. And then I really tried, I'm gonna, you know, smash the ball, and there was plenty of girls, top ranked girls that were out hitting me and outplaying me.\n\n\n\n\n\nMianne: And I thought wow, well this seems OK and obviously this impact of transition has been very real because I know my game was was different after the impact of loss of testosterone.\n\n\n\n\n\nKumi: So you felt you weren't as strong as you had been.\n\n\n\n\n\nMianne: I clearly wasn't as strong, and I, I knew that.\n\n\n\n\n\nMianne: That was the case also just with general life. And the girls got to meet me as well and play against me and could see my game was no different. It was the same as anyone else, and I had to work just as hard as everyone else for my game to get better and to be competitive.\n\n\n\n\n\nMianne: But of course I'm just a sample size of one, you know, and they can't speak to populations. And so while me individually might have been OK, but that doesn't speak for the majority, and now the 20 years since that time has obviously been shining up.\n\n\n\n\n\nMianne: Brighter light on the issue where it has become problematic. Clearly this can't go unrestricted. There needs to be some rules in some context, even if it does mean the complete restriction, for example, to someone like me to uh women's competitive sport.\n\n\n\n\n\nKumi: If you felt like you had an advantage in a sport, would you withdraw yourself from a women's competition?\n\n\n\n\n\nMianne: Well, now I just, I, I won't go and compete. I won't go and play. I've sometimes thought about it. It would be really lovely, even just to play the Pro-Am series here in Australia. And I've got a good friend that I, I, I've known from amateur golf days, from the very beginning in playing state women's golf, who I've sometimes toured with. We've played a bit in Europe and we travelled in Australia. And, you know, she's asked if I'm gonna go and play.\n\n\n\n\n\nMianne: Uh, the next upcoming season. And as much as I'd love to, I have sometimes thought about it, because my game's still generally pretty good. I keep fit. Um, my game is good enough, but I, I just can't do it in principle, with everything that's going on in the country and globally, I can't do it. I like to consider that I go through life with some integrity, and it just wouldn't sit well with me, and I, as much as I'd like to, I, I just can't.\n\n\n\n\n\nKumi: In 2003, you had an emotional episode that you say changed your life. You were in your late thirties at the time. What happened?\n\n\n\n\n\nMianne: That was a really a weird period. I was still working full-time and I was obviously playing amateur golf.\n\n\n\n\n\nMianne: And it's just one of these things sometimes that happens in our lives, in the universe, things were coming to an end. One day I got home from work, sat down, shut the door, and I started crying. I just felt this overwhelm, and I just can't explain it. I don't know if it's an emotional breakdown or what do you, I don't know what to call it.\n\n\n\n\n\nMianne: But uh I've never experienced it before and I was crying and so I look, I made some dinner and I was crying, I ate dinner crying. I thought I'll go and have a shower and go to bed and I was crying. I went to bed, went to sleep crying.\n\n\n\n\n\nMianne: I finally slept and as soon as I woke up the next morning, I started crying, and I got ready and I thought what the hell is going on, like I, I just didn't understand it.\n\n\n\n\n\nMianne: And I thought, look, I'll just keep going and get into it, it'll probably wear off, and I was crying and I got in the car and I drove out of the gate and, you know, there was a car coming down the road. I'll quickly just nip out and onto the road, and I turned a bit sharply and smashed into a parked car, and, you know, smashed the front of my car up and I just, whatever, who cares, and I kept driving and I drove to work.\n\n\n\n\n\nMianne: I thought I'll get busy with work and I was still crying, and then I just, I had to go into to the office and just say, look, I don't know what's going on, but I can't stop crying.\n\n\n\n\n\nMianne: I'm gonna go.\n\n\n\n\n\nMianne: So I went home and then eventually it subsided, and it was just this, look, I'm a bit of a philosophical person and spiritual person in some sense, and,\n\n\n\n\n\nMianne: We have these times in life where it's like the universe is speaking to us, it's giving us a bit of a nudge. It's like, hey, are you listening here, and then it sort of pushes it a bit harder and then it gives us a punch in the face and the hints get harder and\n\n\n\n\n\nMianne: louder. Can you hear me? Because women's amateur golf was coming to an end. I was at the same job for 16 years, which was amazing.\n\n\n\n\n\nMianne: Amazing at doing research and development with, uh, loudspeakers, hi fi cinema speakers. Loved my job. I loved going to work every single day. Relationships weren't happening because I was opening about my life, and this was in Adelaide. It's a pretty small conservative city, so that wasn't happening. And kind of everything was like coming to a stop.\n\n\n\n\n\nMianne: And I wanted to go and see if I could pursue professional golf, because at the time I'd been playing amateur golf for a number of a few years and was on the state team, and I thought, look, I'm gonna see if I can do this.\n\n\n\n\n\nMianne: So that it basically started my journey, and I thought, whatever it is, I've got to get out of here. There's a big wide world out there, and I want to go and live life. I was in a place with a mortgage and a car loan and interest-free furniture, and there was no light at the end of the tunnel, and I thought, this isn't living. And I think I was probably feeling the suffocation of the restriction of this life, in quotes.\n\n\n\n\n\nMianne: And I thought, I'm not doing this, I need to live lives, and I don't know how I'm gonna do this. So I sold everything. I sold my house, car, furniture. I left my job because I couldn't just keep one bit because I needed a job to pay for the mortgage, but if I sold the house, well, I'll need somewhere to live if I'm gonna work, so I had to get rid of all of it.\n\n\n\n\n\nKumi: In what time frame did this happen?\n\n\n\n\n\nMianne: Pretty quickly, 3 to 6 months.\n\n\n\n\n\nKumi: Wow, I guess. It takes a lot of courage to do that.\n\n\n\n\n\nMianne: You know, it's really funny people use.\n\n\n\n\n\nMianne: With courage a lot with my life, which is lovely. But the analogy I always use, like, imagine you're in a small boat out a few kilometres out in the ocean and it sinks, and you're there floating in the water and you can see land just over there. Are you just gonna give up and drown, or are you gonna swim because you can see the land just there? And it's not brave. It's survival. And you just do it. That's what we do as humans. And that's all I was doing. I was just surviving. This wasn't working, I was dying. I was suffocating.\n\n\n\n\n\nMianne: I'd rather live. So I did what I needed to do to live, and it was just in a different journey because of my life, the way my life has gone. I haven't had the same kind of, I'll call it privileges in life as as other people. I don't just get to meet a guy and have an open relationship and see how it transpires. No, my past comes out.\n\n\n\n\n\nMianne: Most of the time they freak out and it all comes to a crashes in a burning heap. That's fine. I look, I get it. Uh, there's not a complaint about that. And with other journeys in life, there's always these restrictions or obstacles I have to overcome. So I decided, look, I'm gonna go and live life my way. I have to find my journey in life.\n\n\n\n\n\nMianne: And how I can walk my path, whatever that might be, but it's not going to be sitting in a house paying a mortgage when there's this big wide world out there, so I, I'm gonna go live life and if I'm gonna sort of have an early, an early demise, an early death, well let's at least give it a crack, and as they say, let's dive sliding into the grave kind of thing.\n\n\n\n\n\nMianne: So I wanted to see if I could change the rules of golf around the world, so I wrote to some of the main tours Europe, US and Australia, going, hey, they already knew who I was and I approached them and asked them about.\n\n\n\n\n\nMianne: Whether they would consider changing their rules, and it just happened to coincide with the IOC, the International Olympic Committee, first introducing their policy of sex reassignment in sport, which obviously made it easier for different sporting bodies to change their rules, and a long story short, I eventually ended up having rules changed in 6 countries on 3 continents.\n\n\n\n\n\nMianne: And then I was eligible to compete, and I went to the European tour, got my tour card and then had an 1112 year touring career ensued.\n\n\n\n\n\nKumi: How did you get them to change their mind?\n\n\n\n\n\nMianne: It wasn't about me getting them to change their mind.\n\n\n\n\n\nMianne: I just walked through life with honesty and integrity is generally how I put it. But I think it was important for me to go and meet them, sit face to face with someone. It's easy to have a, an opinion against someone when you're dealing with them remotely, but when you're sitting face to face, you get that human connection. And maybe it was unfair that I did it that way, cause it's a bit harder to cast someone off when they're sitting in front of you. But they'd seen me on TV, they knew who I was, and\n\n\n\n\n\nMianne: Just want to hear how I presented things.\n\n\n\n\n\nMianne: And well, they made their decisions without any\n\n\n\n\n\nMianne: I say, look, it's not like I was threatening them with legal action. That was never going to be a modus operandi of my journey into this. This was to be based on any knowledge of science or humanity at the time, which primarily it was whether misguided or not, they made the best decisions at that time.\n\n\n\n\n\nMianne: To my benefit.\n\n\n\n\n\nKumi: Have you ever wondered what your life would look like had you not had that emotional episode?\n\n\n\n\n\nMianne: No, I don't really entertain thoughts like that, I guess, because they're they're somewhat meaningless, you know, our life is what they are, and they're not any different.\n\n\n\n\n\nKumi: Now, it was hard to get you into the studio, Mianne, because we need to time you being in Sydney with your travels and the lifestyle you have, which is living in a caravan. Tell us about that lifestyle and, yeah, just tell us about your caravan maybe first and that lifestyle.\n\n\n\n\n\nMianne: So it's not a caravan, I live out of a van, a van, OK, so it's a small van. So when I was touring, obviously I sold everything and,\n\n\n\n\n\nMianne: I hadn't had a car for 18 years, you know, the government had closed down borders and we couldn't travel, and I needed to travel. So I bought a van and I converted it myself. You know, I do web development, so I set it up with a monitor so I can sit and work in my van. And I just need to have, I don't know what it is, again, my personality, uh, and I don't know if maybe it's a disorder I've got, but I need to keep moving, keep travelling, and I need to be in sunshine and warmth. It's just crucial to our health.\n\n\n\n\n\nMianne: But I love people and I love travelling new destinations. So now I generally go north in winter, obviously for sunshine, it just gets too cold down south. And I do different kind of work. I do obviously some web development. It's more of a, I don't know, what do we call it, a boutique web development business, just a personal connection with businesses and people. I'm a sometimes barista, so I work as a\n\n\n\n\n\nMianne: and places I'm a complete coffee snob. That's so good. Yeah, so I do some of that. I look, I've done hostel cleaning, cleaning jobs, and a bit of farm work and, and just go out and do new things. It's tied in also to changing our ideals because it's so easy to keep walking the same worn path. And as the saying goes, it's impossible to be a tourist in your own town.\n\n\n\n\n\nMianne: So I wanted to do new things and meet new people, so I had to get out of what was familiar to me and do new things. I'd never worked in a shop before.\n\n\n\n\n\nKumi: What do your family and friends think about how you live in your van?\n\n\n\n\n\nMianne: Huh? Well, my friends, you know, they love it, they think it's great. One thing I do love, you know, even when I was touring, because I would spend summer in Europe and summer in Australia, and people would often say, when I turn up, ohh, my Anna's here, it must be summer.\n\n\n\n\n\nMianne: And I love that. It's like, you're the season. I'm the sunshine. You're the sunshine. And I love that. I bring a different energy into places, and I like that I do that too. And when I go and stay with people, one of the things I love doing is coming in and cooking dinner, because I don't often get to use kitchens. I can cook out of my van and everything. It's all self-powered and all of that kind of thing. But there's nothing like using a proper big kitchen. So I come into people's homes and cook dinner a couple of times.\n\n\n\n\n\nKumi: Mianne, it is such a pleasure to see you again. Thank you so much for dropping in on your journey South.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-kids-are-struggling-with-maths-due-to-unproven-teaching-methods/fchn1x8xr",
    "title": "Australian kids are struggling with maths due to 'unproven' teaching methods, report shows",
    "publish_date": "Mon, 14 Apr 2025 00:44:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Grattan Institute study has found that not only are Australia's students struggling with maths, but many teachers lack the confidence to teach it even at a Year Six level.\n\n\n\n\n\nThe institute has called for a number of government commitments, including a long-term goal of 90 per cent numeracy proficiency on NAPLAN testing, clearer guidance to schools on teaching methods and more professional development for teachers.\n\n\n\n\n\nJust 13 per cent of Australian Year Four students excelled on a 2023 international maths test, compared with 22 per cent in England, 16 per cent in Ireland and 32 per cent in Japan.\n\n\n\n\n\nAt Year Eight level, just 11 per cent of Australians excelled.\n\n\n\n'Faddish' teaching methods criticised\n\nJordana Hunter, education program director at Grattan Institute, said Australia had deprioritised maths for decades.\n\n\n\n\n\n\"Governments have also been too slow to rule out faddish but unproven maths teaching methods,\" she said.\n\n\n\n\n\n\"To turn rhetoric into reality, governments need to take seriously the evidence base on how humans, including children, learn maths most effectively.\"\n\n\n\nThe institute's survey found some teachers lacked the confidence to teach Year Six maths, while many were concerned about their colleagues' ability to teach the subject.\n\n\n\n\n\nHunter said a 10-year 'maths guarantee strategy' would only cost about $67 per primary school student a year.\n\n\n\nREAD MORE Is your kid getting too much screen time? Take our quiz to find out\n\nJoanna Barbousas, education expert at La Trobe University, said the study made it clear action was needed to halt the \"numeracy crisis\".\n\n\n\n\n\n\"The lifetime impact for students who fall behind on these core skills is substantial, affecting long-term employment, health and social outcomes and perpetuating cycles of disadvantage.\n\n\n\n\n\n\"Teachers are telling us they feel unprepared for the classroom … when half of our 15-year-olds fail to achieve national standards in maths, it's not the students who are failing, it's our approach to education.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/geoff-huegill-the-pressure-of-perfection/h06p1ui12",
    "title": "Geoff Huegill: The Pressure of Perfection",
    "publish_date": "Mon, 14 Apr 2025 00:18:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Geoff was a guest on Insight episode, Second Chances , broadcast in 2024.\n\n\n\n\n\nFollow Insightful on the SBS Audio App , Apple Podcasts , Spotify , or wherever you get your podcasts.\n\n\n\n\n\nHost: Kumi Taguchi\n\n\n\nSupervising Producers: Rebecca Baillie and Maria Nguyen-Emmett\n\n\n\nExecutive Producer: Ross Scheepers\n\n\n\nStory Editor: Madox Foster\n\n\n\nSenior Post Producer: Saber Baluch\n\n\n\nProduction Coordinator: Kate Hrayssi\n\n\n\nArtwork: Aaron Hobbs\n\n\n\nAudio Operations Supervisor: Jonathan Hochman\n\n\n\nMastering and mixing by Micky Grossman\n\n\n\nLISTEN TO Geoff Huegill: The Pressure of Perfection SBS News 14/04/2025 25:11 Play\n\n\n\n\n\nTranscript\n\n\n\n\n\nGeoff: You've got to be a unique cat to want to put your head in a bucket and swim for 345 hours a day.\n\n\n\n\n\nKumi: I'm Kumi Taguchi. Welcome to Insightful. Geoff Huegill was someone I have always been aware of.\n\n\n\n\n\nGeoff: I was basically trained to be the best of the best.\n\n\n\n\n\nKumi: I remember watching him swimming and winning golds for Australia, and I knew he'd had some tougher times in the public eye.\n\n\n\n\n\nGeoff: I'm the first to put my hand up and say that I make a lot of mistakes. I had no idea though what he was like behind the headlines. One of the things that I've learned within myself is that my whole life was all about pain, pain from.\n\n\n\n\n\nGeoff: Parents separating, pain from my father passing away and watching him pass away, the pain of having to channel my emotions and energy into doing something that I did very, very well.\n\n\n\n\n\nKumi: What struck me was how polite and humble Geoff was and how honest, and he was up for a chat.\n\n\n\n\n\nKumi: It's so good to see you.\n\n\n\n\n\nGeoff: Yeah, and you too.\n\n\n\n\n\nKumi: You were born in Nhulunbuy, this is a small peninsula town in the Northern Territory. Your mum is Thai, your dad was a FIFO miner. How did they meet?\n\n\n\n\n\nGeoff: So my mum grew up in rural Thailand and she was a chef. So she had a cooking cart, being the eldest daughter of three daughters, one of her responsibilities at that particular stage of life was being one of the main financiers of the family and to help out as much as possible. So she had a love for cooking, had a passion for cooking, and listening to her story of how she started off and then raising a little pig and then growing this pig and then selling it off to be able to buy a food cart to then be able to take it from rural Thailand down to Bangkok, and I believe my father was with one of his mates and,\n\n\n\n\n\nGeoff: They were having some time off and relaxing and met my mum, and basically she just cooked for him and fed him for the whole time. He was literally in Bangkok, which was quite amazing. So, you talk about by chance of how do you get this opportunity to not only just be on this planet, but this opportunity to do things you do. It's quite a unique story. It's quite different, and obviously everyone has their own unique story, but quite a spin out.\n\n\n\n\n\nKumi: You've spoken about values a lot Geoff, and one of the things that really struck me when you were in the Insight studio was, I felt this real sense of humility, like you treated everyone there with such,\n\n\n\n\n\nKumi: Generosity and care and support, and I remember thinking, oh, there's a lot more to this guy than I know from what I've read. Where have those aspects of your personality come from?\n\n\n\n\n\nGeoff: I believe I've got my work ethic from my mum, to tell you the truth. There's no, from my mum and from my dad, but also too from the key influential people that have been in my life, like my swimming coach, one of my first swimming coaches who I got to live with after my father passed away. I've always been a,\n\n\n\n\n\nGeoff: Big believer that things happen in life for a reason. For me, if my father didn't pass away, I don't know whether or not I would have had the determination to be able to stick through the hard challenges of just fighting to get to the Olympics. And Ken, my former coach, he, what people don't realise is he put a swimmer on every Australian team from 1976 to 2016.\n\n\n\n\n\nGeoff: So for 40 years, he created this environment and there was method to his madness. One of the best things that he taught me is always be good to the people you pass on the way up because they're going to be the first people you pass on the way back down. I learned pretty quick through my journey in sport that obviously everyone does have a story.\n\n\n\n\n\nGeoff: You know, I remember going into my first Olympic Games and multiple Olympic gold medalists pulled me aside and told me this story, and the moral of the story is, it doesn't matter who you are, where you come from, or what you've done. When you step up to the final of the 100 metres butterfly, he said, I guarantee that everyone walks out of the food hall with food down the front of their shirt, right? So,\n\n\n\n\n\nGeoff: Everyone trips over their own feet, and these are the people that are the best of the best, right? So he said, just go out there and do what you have to do. So, I've had some really, really good mentors or people that have influenced my life, and I've been very lucky throughout that journey so far. So yeah, I can't really complain.\n\n\n\n\n\nKumi: Just to backtrack, you were 12, I understand when your dad died of a heart attack. That's right. What do you remember about that day?\n\n\n\n\n\nGeoff: It was hard. I remember coming home from training, it was a Tuesday night. My dad was already in bed. He wasn't feeling 100%. He literally just said to me, well, I said to him, because Ken had told me, my coach had told me that he was gonna send me off to my first a nationals. So I was really, really excited.\n\n\n\n\n\nGeoff: About that and came home it just before my 13th birthday. And I remember just telling him while he was in bed and then had my dinner and went to bed and didn't think anything of it. And then during the middle of the night, he woke up and I heard him go into the bathroom and turn the shower on, and then he collapsed in the shower and I was up and, and obviously woke up the whole household and called the ambulance and, you know, I think when I reflect and and look back on it,\n\n\n\n\n\nGeoff: It was the parts that were really hard were just how sudden everything changed. Like literally in the blink of an eye. It was like he's there and then he wasn't there.\n\n\n\n\n\nGeoff: This is like 12 a.m. and by 6:30 in the morning, I got the news that he passed away and. Just a whole mix of emotions just run through you, right? Like, what now, and how did this happen and,\n\n\n\n\n\nGeoff: Yeah, it's, it's a lot for a 12 year old to sort of take on board. And, uh, yeah, it took me, I, I didn't realise how long it actually took to, uh, deal with that situation. And as you can see or hear, it does still make me pretty emotional at times.\n\n\n\n\n\nKumi: Yeah, thanks for sharing that, Geoff, and sorry to bring that up. I'm so glad you got to tell him about.\n\n\n\n\n\nKumi: What you were about to do with your swimming, that you had that chat with him, but he knew.\n\n\n\n\n\nGeoff: Funny you say that because I, I've never looked at it that way.\n\n\n\n\n\nKumi: Yeah, I feel like, oh what an amazing thing for your dad to know about you, about your son, you know, definitely.\n\n\n\n\n\nKumi: So Ken, would the man, your coach, your mentor who you went to live with, you suddenly living in a new home and still putting effort into your swimming, was that in a way, I don't know, like a kind of saviour in a way when everything was different and everything changed in an instant. You've got this thing that you can still rely on.\n\n\n\n\n\nGeoff: When I reflect back at it, I was very lucky that I had my swimming and had my swimming club. I mean, God knows what would have happened if I wasn't in that environment, and if I wasn't in that club. You know, obviously I've got a tendency of wanting to have a good time and to, uh, you know, want to have a little bit of fun, um, without a doubt. But, uh, so I never know. I mean, that's a, it's a hypothetical. I tend not to look down these hypothetical questions, but,\n\n\n\n\n\nGeoff: What I do appreciate, and this is why I'm a firm believer that things happen in life for a reason, cause not long after that, Sydney won the bid for the Olympics. It was about 6 months after. And then I knew at that stage, I was in the right environment. I had the right coach to be able to go from 8 nationals into Olympic medalists, being a champion.\n\n\n\n\n\nGeoff: On the international scene and stage, and it was quite easy to put the roadmap together. And it's funny we touch upon this because I was back in Australia a couple of weeks ago, and I literally did this similar exercise with a bunch of up and coming children or athletes that are at that 1012, 14 years of age where,\n\n\n\n\n\nGeoff: To look forward 8 years, if you're 12, that means you're gonna be 20 in the 2032 Olympics. Yes. So, when you look back on the stats and where things are, I think in swimming Australia, 90% of athletes have won their first international medal before the age of 21, and of that 90%.\n\n\n\n\n\nGeoff: And 90% of them have been with the same coach since the age of 15. So, the stats don't lie. And so it's a bit of a spin out to reflect on it from that side, to have the opportunity to work with the younger generation of kids that are coming through to building roadmaps, building strategies, building plans on using sport for life after sport.\n\n\n\n\n\nNEWS ANCHOR: Hugo and Slim, Klim and Huegill, Huegill's in front, Huegill, Klim, the touch, the touch, and there it is. Huegill wins by 100.\n\n\n\n\n\nKumi: You walked away from swimming after the 2004 Athens Olympics. You had a really public kind of battle with weight gain. I mean, God, everyone kind of commenting. It took another, I think, 60 years. You lost 40 kg, then you made an international swimming comeback at the Delhi Commonwealth Games in 2010. What was it like getting that chance again, that pressure in a way of that second chance and the public's expectations on you?\n\n\n\n\n\nGeoff: For me it was, it was something that just seemed natural, right? I mean, I've always been a goal oriented person. It would be like, it's time to start taking care of my health, or start looking after myself and moving on a daily basis. And it's not like one day I woke up and had this epiphany of, oh, I'm just gonna get back into the pool again and hopefully swim on the international circuit. A lot of thought, a lot of planning, a lot of consulting and understanding what the journey was going to be like getting back into it again. I, I mean, I took a lot of time to think.\n\n\n\n\n\nGeoff: About that, because one of the things I sort of realised was just how much pain I was going to be in from a physiological sort of sense, right? How much effort was required on a daily basis to push myself to get back to that level again. And once I made up my mind, that was something I actually wanted to do again, then it was all systems go, right? I, I went in 110%.\n\n\n\n\n\nKumi: One of the things I think about swimming are the endless laps, like this monotony.\n\n\n\n\n\nKumi: And repetition and I just don't think I could do that. Is there a particular mindset of a swimmer who can just get in that pool day in, day out?\n\n\n\n\n\nGeoff: You've got to be a unique cat to want to put your head in a bucket and swim for 345 hours a day, and then when you're out of the pool, you're in the gym, pushing yourself to extremes. I think when you talk about the unique mindset of a swimmer, everyone's got their own goals and their purposes, or the reasons of why they actually do that. And I think for anyone, whether you want to be successful in a media career, successful in a sporting career, you have to understand what the purpose is.\n\n\n\n\n\nGeoff: As to why you are going to put yourself through that physical and mental exhaustion and mental pain. So for me, it was, I had purpose. I, I understood exactly why I was getting into the water every single day. I understand the job and the task ahead of me. So to make that call, it was quite an easy thing to do.\n\n\n\n\n\nKumi: So you went well in Delhi, you walked away with gold and silver. That same year you were voted the 2010 Australian Sport Performer of the Year. Did you feel like it was a great comeback for all the doubters?\n\n\n\n\n\nGeoff: Sort of, yeah, no, but, I think the biggest thing was just proving it to myself, and that was the most important thing, that all of the accolades and the celebrations and the things that came after, because I was doing it for myself, it didn't really faze me about those things. And it's not until you get a little bit older in life and you reflect on your career that you actually realise how big a task that was to actually execute 51.6 seconds at a particular moment in time.\n\n\n\n\n\nKumi: Let's fast forward 4 years, the tough year where you and your then ex-wife were charged with drug possession. I'm just so fascinated with what you remember about that day.\n\n\n\n\n\nGeoff: Obviously, I was a little bit inebriated, had quite a few drinks and.\n\n\n\n\n\nGeoff: I didn't think about anything, to tell you the truth. I didn't have any care or responsibility in the world. I was just living my life at that particular point in time. Obviously, once things started to get real, being that I got pulled aside by the police and taken into a room and questioned, that's when my mindset shifted really, really quick. It goes from being proactive into reactive, because I understood,\n\n\n\n\n\nGeoff: And realised that things were gonna change and things were gonna change really, really quick. So, I think you're starting to get a bit of an idea into some of the wacky ways my mind works, but it was about having a bit of a plan and a strategy and a solution in terms of how we're going to deal with this, who are the people we need to contact, and then putting a plan in place to be able to get the results that we were looking for to.\n\n\n\n\n\nGeoff: have no criminal conviction. Being a global frequent flyer and travelling a lot throughout my career, I understand the damages that it sets you back if you do actually have a criminal conviction. So, it just makes life a little bit harder, obviously. So, recognising and realising what needed to be done and how do we execute it, my mind just went straight into, um, problem solving.\n\n\n\n\n\nKumi: So much of your identity is still tied to being a swimmer. Have you had to separate part of your identity to that part of what you did?\n\n\n\n\n\nGeoff: I've always tried to, but there's always the public perception.\n\n\n\n\n\nGeoff: And every time I've tried to walk away from the sport, I actually still am really happy being in the water. Whether it's working with the next generation of kids that are coming through, or even working with a bunch of adults that are trying to swim the English Channel or do half Ironman triathlons, or even working with a bunch of.\n\n\n\n\n\nGeoff: where we're doing teambuilding projects, I guess a lot of my experience comes back from being in the environments that I was in that swimming environments, but also to the environment of being an Olympian, so to speak. So, every time I try and escape it, to try and get away, it's been an education.\n\n\n\n\n\nGeoff: Throughout my career, I look back and we talk about some of these challenging things that I've been through in my life. The only way that I've been able to get through it is because of all of the challenging things I've learned through sport. And I think when we talk about success, or most importantly, when we talk about people having confidence, right? Cause,\n\n\n\n\n\nGeoff: Confidence and self-confidence and self-belief. Ultimately, these things are internal, right? So to be able to have more confidence, to be able to face the challenges or the hurdles of life, it's because you in particular have overcome those challenges and those hard moments and periods of life. So, I think if I reflect back onto 2014…\n\n\n\n\n\nGeoff: In the arrest of 2014, I knew that I'd been through a lot of harder things, and this was only just going to be another blip in the radar. You know, I got the Olympic rings tattoo on my wrist when I was going into Athens Olympics in 2004. I didn't get it after the 2000 Olympics and,\n\n\n\n\n\nGeoff: The reason why it holds a lot more significance is because the challenges of getting behind the blocks in 2004 were a lot harder than in 2000. Different mindsets, different approaches, different environment, different stages and phases of life, and,\n\n\n\n\n\nGeoff: To me that challenge in itself meant a hell of a lot and obviously having a chance to represent my country at a home Olympics, and those are the successes that I've had or the challenges that I had to overcome, which helped me line up behind the blocks when I raced in 2010.\n\n\n\n\n\nNEWS ANCHOR: What's 20 metres when you've conquered 40 kg. Geoff Huegill of Australia, Geoff Huegill of Australia goes in for the kill. A happy ending for Geoff Huegill, happily ever after it is, it's a Commonwealth Games record.\n\n\n\n\n\nKumi: You're now living in Singapore where you met your second wife, Roxanne. How did you guys meet?\n\n\n\n\n\nGeoff: We met through friends, to tell you the truth. We were introduced, which is quite amazing, and look, within the 1st 90 seconds of meeting Roxy, I just realised that she was a different cat. And I said that to her straight away. It was like, well, hang on here, you're a different cat. And then literally, we just connected and gelled. We had so much in common, and it's been,\n\n\n\n\n\nGeoff: Like everything, though, you have your ups and downs, but it's been a journey that I've really enjoyed.\n\n\n\n\n\nKumi: How would you react if any of your kids wanted to be an elite athlete?\n\n\n\n\n\nGeoff: Obviously, I'm gonna support them in whatever it is they want to do, because that's what you do when you have children, I guess, or that's what I would do because that's what my parents did for me. So, the endless love and care and support and, and assistance, I think I would help them put their roadmap from A to B.\n\n\n\n\n\nGeoff: Or A to Z and work out whatever it is that they want to do, but also be there for them and, and support them. Give them as much love and comfort and recognition for the things that they do want to do. And about 12 months ago, I had a call with my eldest daughter, Mila, and she rang me up and said, Hey, Dad, I love you, but I, I don't want to swim anymore. And I was like, Yeah, great. Well, that's the, you know, and, and at the time, I was obviously heartbroken because she's top 3 in Australia and\n\n\n\n\n\nGeoff: You know, obviously state champion I she purely gifted and talented, and if she doesn't want to swim, then I can't force her to swim. You can't cage animals, right? People have to learn these things for themselves and I think what's very lucky though is she's still at an age where,\n\n\n\n\n\nGeoff: If she wanted to pick it up, she can still do it, but she's obviously got to put a lot more work into it. But you, when you've got a surname of Hui and you're standing behind the blocks of anywhere in the pool, you're naturally gonna have a lot of eyeballs on you, and, and that in itself is a lot of pressure. If my children, as long as they do something, I mean, you can't sit around in the afternoon and do nothing. You either have to have an earn or learn mentality. So if you're not earning $1 you've got to be continuing your studies.\n\n\n\n\n\nGeoff: So these are the things I try and share with my daughters and my sons, and we share with them is having direction, what's your plan? What's your strategy, how do we get there, and then the simple things of short, medium and long-term goals, because we all need purpose every single day of and reason to get out of bed. And that in itself can be a challenge for a lot of people depending on where they are at that particular stage and phase of life. When we look at things like mental health or just life challenges in itself, it's,\n\n\n\n\n\nGeoff: It's quite easy to give up on the spark of life and get engaged in life, and everyone can have a million reasons why they don't want to participate or engage anymore. And I think for an individual, it's finding the purpose or the why. Why do you want to engage in this? What is the purpose, and why do you actually love what you do? As a friend told me the other day, there's a big difference obviously between love and like, right? Perfect analogy is, I like my wife, um, you know.\n\n\n\n\n\nGeoff: You know, when someone actually says that to you, it's like, yeah, I like my wife. It's like, yeah, but liking something and loving something are two different things, right?\n\n\n\n\n\nGeoff: And I do love my wife.\n\n\n\n\n\nKumi: Have there ever been moments, given that you lost your dad so young, but you had this wonderful mentor? Who do you look to or who do you imagine in terms of, that's how I'm gonna be as a dad? Like, how do you make those choices?\n\n\n\n\n\nGeoff: It's pretty challenging. And look, I'm, I'm the first to put my hand up and say that I make a lot of mistakes on the go, because the hardest thing is being present.\n\n\n\n\n\nGeoff: That's the first challenge. And then through those emotions or through those challenges at that particular point of time, obviously, there's a, everyone, every individual has certain things that trigger us, things that trigger us from our own childhood, things that, when we look back on our children and we, we reflect and we say, oh my gosh, I don't wanna be this type of parent, I don't wanna do this, and\n\n\n\n\n\nGeoff: Through those triggers, obviously sets off a range of emotions, and then from the emotions, we can choose to have a reaction. I'm always constantly self-reflecting, understanding, trying to see things from a different time and a different point of view, recognising and realising that we're dealing with little individuals, things that were or may have been,\n\n\n\n\n\nGeoff: Dealt with when I was growing up, obviously isn't acceptable today, you know, I can't just put my children in the pool and tell them to swim for 5 or 10 kilometres to just sort of get the energy out, right?\n\n\n\n\n\nKumi: No, you left like child services exactly.\n\n\n\n\n\nGeoff: Right, you know, but you gotta be able to laugh about these things, but that, that being said, it's, it just means I've, I've got to continually grow, and you've just got to be kind with yourself. I think that's one of the other things as well is kindness to yourself, especially as a parent, because we don't deliberately go out there and try and,\n\n\n\n\n\nGeoff: Rock the boat and make things hard. I mean, obviously there's a, there's a reason to why we have our values and our beliefs, but ultimately, at the end of the day, most people are doing the best that they can at those particular points of time, you know, so the forgiveness of yourself is also a big challenge. It's pretty hard. Parenting is one of the hardest things I've ever done, Kumi. I think when\n\n\n\n\n\nGeoff: You get annoyed with someone and you're in the swimming pool, you can just get in the other lane and just swim, right? Or get out of the pool and come back later. There's just no off switch with kids, right? Like they're. And, and my boys as well, right? They're just one pace, and that's just full on, right? And boys are totally different. Boys are totally different to girls, right? Girls can just sit and just do craft and everything boys are like, they're just, my boys are just animals, right? I love them. They're just, they're just.\n\n\n\n\n\nGeoff: They're just animals, right, they're just gonna tear the place apart, and they've got one speed and that's just full on, and I shake my head and it's just like, Jesus, is that life biting me on the arse again? Like, it's just like, wow, I've got I've gotta work out a way to deal with this.\n\n\n\n\n\nKumi: Life sounds pretty good for you though at the moment. Sounds like you're in a good spot.\n\n\n\n\n\nGeoff: Look, Kumi, why be so serious, right? It's only a matter of life and death.\n\n\n\n\n\nKumi: That's right. Two options.\n\n\n\n\n\nGeoff: Look, life is, life is in a good spot. It's in a good spot today, and that's all I can deal with. I can just deal with today. A couple of years ago, I was diagnosed, I finally sought treatment for my ADHD. That's been a big change in my life and my career, in particular, being able to be more present, not as, I don't want to say all over the shop, but easily distracted.\n\n\n\n\n\nGeoff: Is a big thing as well, and, um, I'm going on this path of sobriety, right, so my aim is to not pick up a drink today, uh, because I've got too much work and things to do, but, uh, today for me has lasted almost 18 months, and that in itself has been a journey because,\n\n\n\n\n\nGeoff: Especially when you look at trauma or challenges that in particularly I've been through in life, one of the things that I guess is dealing with emotional sobriety, right? So, stopping drinking was never an issue, you know, for me it was, is what do I need to do to not use my emotions to pick up a drink. Going on this journey, I think one of the things that I've learned within myself is that my whole life was all about pain, right? I was constantly in pain, pain from,\n\n\n\n\n\nGeoff: Parents separating pain from my father passing away and watching him pass away, having to live in an environment that wasn't what I thought was going to be home. The pain of having to channel my emotions and energy into doing something that I did very, very well. And I was basically trained to be the best of the best, and that is ultimately, how do you deal with pain, and how do you manage pain and channel it in the right direction. And\n\n\n\n\n\nGeoff: You know, obviously I've succeeded in that area of life, but it's not until I got a little bit older that I realised that, hey, I don't want to be in pain anymore. So, going on this path of emotional sobriety, I laugh, it's the, it's the eat, pray, love, Kumi, right, that part of life, right? I've I've obviously done a lot of eating if I put on 50 kilogrammes and had to lose it.\n\n\n\n\n\nGeoff: Being a Cleo, former Cleo's most eligible bachelor, I've sort of knocked that part of my life out. But now it's like, obviously, the spiritual aspect of life, which is the most important thing to me, because I realised that as a role model and for my children, I need to be a better partner or a better, better coach or a better individual. I have to have, I need to be more centred with what's going on within me, and\n\n\n\n\n\nGeoff: When you made the comment of, like, I seem to be in a, a good place or a happy place, it's, um, I mean, that can change pretty quick, but I've, I now have the tools to be able to deal with those challenges when they come up. So, just because I stopped drinking doesn't make my problems go away.\n\n\n\n\n\nKumi: Geoff, I could speak to you all day. Thanks, Geoff. Have a great day.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-much-protein-you-really-need/9tzyegukk",
    "title": "Don't listen to the influencers. Here's how much protein you really need",
    "publish_date": "Sun, 13 Apr 2025 19:51:44 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Key Points Protein is described by the Dietitians Australia president as the 'building blocks' of the body.\n\nIt's also a trending topic on TikTok and Instagram.\n\nBut should people be taking dietary advice from social media?\n\nThere are almost three million posts on Instagram labelled #highprotein, many featuring men or women in workout gear.\n\n\n\n\n\nProtein intake is the latest health food topic getting traction on social media, and the message is usually that people aren't getting enough of it — but is that true?\n\n\n\nWhat does protein do for us?\n\nDietitians Australia president Dr Fiona Willer said protein can be thought of as the \"building blocks of our own bodies\".\n\n\n\nFiona Willer from Dietitians Australia says adding protein to a a diet is generally not needed for most Australians. Source: Getty / Kindamorphic \"Inside every type of protein is amino acids. There's a range of amino acids that our bodies can choose to build itself from and if we need to, we can break down protein into those amino acids and then process the amino acids into energy, a source of energy, so that's how our bodies use it.\"\n\n\n\n\n\nProtein is a key part of many foods, including meat, poultry, eggs, beans, milk, soy products, nuts and legumes.\n\n\n\n\n\nWiller said as our bodies digest food with protein, it gets broken down into its component amino acids, \"and then builds whatever it needs of its own body out of it\".\n\n\n\nDaily protein on a plate\n\nShe said the recommended daily amount of protein a person should eat is 46 grams for a woman and 64 grams for a man .\n\n\n\n\n\n\"So something like a steak, for every 100 grams of steak that we eat, that's 25 grams of protein, same with chicken, something like a cup of milk is about 10 grams of protein in there,\" Willer said.\n\n\n\n\n\n\"It's very difficult to be protein deficient in Australia.\n\n\n\n\n\n\"There'd be very few people that need to eat differently in order to meet their protein requirements.\n\n\n\n\n\n\"So that is the recommended daily dietary intake, to cover the body's protein requirements for 97 per cent of the population,\" she said.\n\n\n\n\n\nDietitians Australia, the peak body for dietitians and nutrition professionals, says exact protein requirements can depend on age, gender, height and weight. The Department of Health provides more information here .\n\n\n\nWhat's trending?\n\nA study published last month in the international research journal Appetite looked at misinformation about nutrition provided to youth by content creators. It said: \"Health information, particularly about nutrition, has flourished on social media in recent years. However, these claims often lack proper scrutiny enhancing the risk of misinformation.\"\n\n\n\n\n\nTikTok features video after video of people posting their \"day of eating 140 grams of protein\".\n\n\n\n\n\nWiller said: \"It would be very rare circumstance where that much protein would be biologically required, and she's kind of eating for three, if it's that much protein.\"\n\n\n\n\n\nMany influencers try to suggest they are offering help, saying: \"if you’re struggling to eat enough protein…\" giving the sense that what they have to say could be health advice.\n\n\n\n\n\nWiller said a lack of protein is more often than not associated with famine, malnutrition or childhood neglect.\n\n\n\nREAD MORE The price young men are paying to get big\n\nBut what if you work out a lot?\n\nShe said even for those who spend a lot of time exercising, they generally do not need more than the average daily recommended amounts.\n\n\n\n\n\n\"If you are exercising at the level of an elite athlete, there are some increased needs but if you were doing that, that's a special circumstance where you should really be supervised by a sports dietitian,\" she said.\n\n\n\n\n\n\"Even the regular, pretty fit human, they don't need to worry about counting grams of protein ... it will be being met through the process of just meeting their daily energy needs through their appetite cues.\"\n\n\n\nWhat happens if you eat too much protein?\n\nWiller said eating too much protein could potentially put a strain on your kidneys.\n\n\n\n\n\n\"When you have a super high protein intake, for regular, healthy humans, kidneys can usually cope with that, but for people whose kidneys are not working at full tilt, that may be a challenge,\" she said.\n\n\n\n\n\nShe said kidney disease could occur as a result of excess protein but people often lived with it for some time before it is diagnosed.\n\n\n\n\n\nWiller said the main reason people should be wary of a high-protein diet is that it would inevitably mean their diet is not balanced.\n\n\n\n\n\n\"Rather than thinking about the detriment that protein itself can bring, it's really what it's crowding out ... other things that we need to function well, like fruit, vegetables, grain foods, fibre.\"\n\n\n\nSo why the trend?\n\nWiller said there's \"been no big breakthrough studies that have shown eating a huge amount of protein is related to superhuman abilities\".\n\n\n\n\n\n\"It's absolutely a social media-birthed trend that's not really based on current scientific research findings.\"\n\n\n\nWiller said despite this, food companies had jumped on people’s hyper-awareness about protein.\n\n\n\n\n\n\"There’s 'high protein' cottage cheese, but the nutrients in it were no different from regular cottage cheese, so some of it will be labelling has changed to highlight the normal amount of protein,\" she said.\n\n\n\n\n\n\"But I'm sure that there are products being reformulated for higher protein claims. We see that every time there's a trend.\"\n\n\n\n\n\nThis article contains general information only. For advice relating to your personal situation, see a qualified medical practitioner.\n\n\n\n\n\nFor support with eating disorders or body image concerns, call Butterfly National Helpline on 1800 ED HOPE (1800 33 4673) or visit www.butterfly.org.au to chat online or email, 7 days a week, 8am-midnight (AEST/AEDT).\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/housing-central-to-duelling-labor-and-liberal-campaign-launches/ak0h6p5ir",
    "title": "Housing central to duelling Labor and Liberal campaign launches",
    "publish_date": "Sun, 13 Apr 2025 09:28:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Housing central to duelling Labor and Liberal campaign launches\n\nPublished 13 April 2025, 9:03 am\n\nThe 2025 federal election is now less than three weeks away and the major campaigns have been launched on opposite sides of the country with rival commitments worth tens of billions of dollars. Labor is promising a major increase in housing supply and cheaper mortgages for first home buyers, while the Coalition is pledging to make mortgage repayments tax deductible. The parties have also revealed new cash back plans to attract swinging voters.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/labor-pledges-1000-automatic-tax-deduction/sikrs52zh",
    "title": "Labor pledges $1000 automatic tax deduction",
    "publish_date": "Sun, 13 Apr 2025 09:03:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/heres-whats-in-albanese-and-duttons-new-housing-plans/87aaa3xri",
    "title": "Exclusive homes and tax perks: Here's what's in Albanese and Dutton's new housing plans",
    "publish_date": "Sun, 13 Apr 2025 08:06:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "The major parties have used election campaign launches to focus attention on first home buyers, each unveiling pathways to enter the property market.\n\n\n\n\n\nPrime Minister Anthony Albanese on Sunday committed to build up to 100,000 new homes and expand a scheme that allows Australians to buy a home with a 5 per cent deposit, if Labor is re-elected at the 3 May poll.\n\n\n\n\n\nMeanwhile, Opposition leader Peter Dutton unveiled a plan that would allow first home buyers to deduct mortgage interest payments against their taxable income.\n\n\n\n\n\nBoth leaders have pitched the plans as helping more people get on to the property ladder amid Australia's housing crisis — but they're not without criticism.\n\n\n\nLabor's plan: First home buyer scheme expansion and exclusive homes\n\nA re-elected Labor government would expand the first home guarantee scheme — which allows a 5 per cent deposit to purchase, with the government guaranteeing the other 15 per cent — to all first-time buyers. Participants would not be subject the lenders mortgage insurance, which can add thousands to the total cost oh a home loan.\n\n\n\n\n\nThe change would take effect from 1 January 2026.\n\n\n\n\n\n\"Young Australians are bearing the brunt of the housing crisis, and our government is going to step up to give them a fair go at owning their own home,\" Housing Minister Clare O'Neil said in a statement.\n\n\n\n\n\nAs part of the expansion, property price limits would be increased to average house prices in each city and region\n\n\n\n\n\nSydney's current property price limit of $900,000 would be increased to $1.5 million and Brisbane's would rise from $700,000 to $1 million. Victoria's capital or regional centres could increase from $800,000 to $950,000; Perth from $600,000 to $850,000; Adelaide from $600,000 to $900,000; and Hobart from $600,000 to $700,000.\n\n\n\n\n\nSally Tindall, the data insights director at financial comparison website Canstar, said the proposed expansion would put first home buyers on \"a more even footing\", those considering using it should be cautious.\n\n\n\n\n\nCanstar said those purchasing with a smaller deposit could face higher interest rates, and the scheme would prevent them from renting out the property unless they secure an exemption. They would also remain subject to banks’ serviceability buffers, which are designed to stop borrowers from taking out more than their income can support.\n\n\n\n\n\nTindall said: \"The scheme does nothing to address property prices, which is the biggest hurdle most first home buyers face.\"\n\n\n\nHousing Minister Clare O'Neil said government-built homes will be cheaper than private sector built homes, but did not disclose by how much. Source: AAP / Mick Tsikas But Labor has also pledged to build up to 100,000 homes exclusively for first home buyers. It says will work with states and industry partners to identify suitable build sites, including use of government land that is vacant or underutilised.\n\n\n\n\n\nIn a statement, Labor said that in order to get projects moving quickly, states and territories would fast-track land release, up zoning and planning approvals.\n\n\n\n\n\nSpeaking with the ABC's Insiders program on Sunday morning, O'Neil clarified that government-built homes will be cheaper than private sector built homes, but did not disclose by how much.\n\n\n\n\n\n\"We will negotiate this on a state-by-state basis,\" O'Neil said. \"But in the South Australian example, we are building homes that are affordable at the entry level of the market — somewhere between $500,000 and $600,000.\"\n\n\n\n\n\nLabor says construction would begin in 2026, with buyers moving in from 2028.\n\n\n\n\n\nThe pledge comes as Labor faces pressure over its broader pledge to building 1.2 million homes by 2030 by the end of the decade , although it maintains the target can still be met.\n\n\n\nThe Coalition's plan: Tax deductions on mortgage interest payments\n\nThe Coalition would introduce a first home buyer mortgage deductibility scheme.\n\n\n\n\n\nIt would allow first-time buyers of new builds to deduct the interest on the first $650,000 of their home loan for five years when lodging their tax returns.\n\n\n\n\n\nThere would be no cap on the property’s purchase price or the loan amount.\n\n\n\nUnder a Coalition plan, first home buyers purchasing new builds would be able to deduct the interest on the first $650,000 of their home loan for five years when lodging their tax returns. Source: AAP / Fabian Strauch/DPA The scheme would apply to owner-occupiers and be means-tested, with an income cap of $175,000 for singles and $250,000 for couples.\n\n\n\n\n\nOnce eligible, participants would retain access to the deduction even if their income rises.\n\n\n\n\n\nIt understood the Coalition would move to legislate the scheme within its first 100 days of government.\n\n\n\n\n\nMaiy Azize, the spokesperson for national housing campaign Everybody’s Home, labelled the plan a \"form of negative gearing for non-investors\" which could drive up home prices.\n\n\n\n\n\n\"To make housing more affordable, we need to get rid of tax breaks when it comes to property, not create more,\" she said.\n\n\n\nWhat do experts think?\n\nSpeaking to SBS News ahead of the launches, when media reports of the plans had begun to emerge, economist Chris Richardson described the proposals as \"pretty dumb from both sides\" and said they would make housing more unaffordable.\n\n\n\n\n\n\"Both sides are promising to give first home buyers more money, but more money isn't the problem,\" he said. \"Our problem is not enough houses in Australia.\"\n\n\n\n\n\nAlso speaking ahead of the launches with Michael Fortheringham, managing director of the Australian Housing and Urban Research Institute.\n\n\n\n\n\nFotheringham said the easing of caps on the first home guarantee scheme was reasonable in light of current market conditions.\n\n\n\n\n\n\"There’s no point having a scheme that isn’t available to anyone because the caps haven’t kept pace with where property prices and household incomes are,\" Fotheringham said. \"I think it's an appropriate ongoing adjustment.\"\n\n\n\n\n\nHe said the construction of 100,000 homes for first home buyers is the \"bigger part\" of Labor's announcement.\n\n\n\n\n\n\"This is a massive supply-side measure that focuses on building affordable housing, rather than financing it through third parties,\" Fotheringham said.\n\n\n\n\n\n\"Each state and territory will have their own ideas about what's appropriate. What’s built in Sydney will be different from what’s built in places like Dubbo or Geelong, so there will be quite a bit of variety.\"\n\n\n\n\n\nHe said he's optimistic about what this means for Australians in major cities.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/labor-and-the-coalition-launch-their-2025-federal-election-campaigns/a8obe1vdm",
    "title": "Campaigns launched: PM pledges $1k 'instant tax deduction', Dutton teases defence boost",
    "publish_date": "Sun, 13 Apr 2025 05:34:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Labor and the Coalition have officially launched their federal election campaigns, with the cost of living and first home buyers taking centre stage as the race nears the halfway mark.\n\n\n\n\n\nPrime Minister Anthony Albanese announced a $10 billion plan that Labor says will help first home buyers get on the property ladder by making 100,000 homes available exclusively to them. He also pledged to expand the first home guarantee scheme — which allows a 5 per cent deposit to purchase, with the government guaranteeing the other 15 per cent — to all first-time buyers.\n\n\n\n\n\nAlbanese also revealed Labor would introduce a $1,000 \"instant tax deduction\" for work-related expenses.\n\n\n\n\n\nMeanwhile, Opposition leader Peter Dutton said the Coalition would allow first home buyers who purchase new builds to deduct the interest component of their mortgage repayments on the first $650,000 of their home loan for five years. The scheme would apply to owner-occupiers and be means-tested, with an income cap of $175,000 for singles and $250,000 for couples. Dutton also confirmed the Coalition would allow Australians to access up to $50,000 of their superannuation towards a deposit for their first home.\n\n\n\n\n\nThe Opposition leader also announced $10 billion would go towards a once-off cost of living tax offset. The tax break would be applied to those earning up to $144,000, and calculated to deliver up to $1,200 back at the end of the financial year.\n\n\n\nDutton says Australia faces a 'pivotal election'\n\nDutton spoke at the Liverpool Catholic Club in south-west Sydney. Former prime ministers John Howard, Scott Morrison, and Tony Abbott were among those in attendance.\n\n\n\n\n\nHe said the nation was facing a \"pivotal election\", the outcome of which would \"define the decades to come\".\n\n\n\n\n\n\"We must become a more resilient, self-reliant, resourceful, and robust country,\" Dutton said, adding that a Coalition government would \"revive our national self-confidence\".\n\n\n\nFormer prime minister John Howard (pictured shaking Peter Dutton's hand) was among the former leaders to attend the Coalition campaign launch. Source: AAP / Mick Tsikas He said Australia would become a \"nuclear-powered nation\" under the Coalition, claiming the technology would lower power prices for consumers — a claim some experts have questioned , at least in the short term.\n\n\n\n\n\nThe Coalition would conduct a \"full audit\" on government spending for Indigenous programs, Dutton said, which would \"improve housing, health, education and employment\" outcomes.\n\n\n\n\n\nHe said a Coalition government would hold a royal commission into sexual abuse in Indigenous communities. Many groups have said there is no evidence to support such an investigation .\n\n\n\nDutton said a government he leads will be \"committed to ensuring that classrooms are places of education — not indoctrination\", adding that a curriculum that focused on reading, of writing and arithmetic would \"become the norm\" under a Coalition government.\n\n\n\n\n\nThe Opposition leader said the world faced \"uncertain times\" and that Australia's military must be equipped \"at speed and scale\", and that the Coalition would \"soon announce a significant investment in defence\".\n\n\n\n\n\n\"It’s a necessary investment in our security, in deterring aggression, and in maintaining peace,\" he said.\n\n\n\nREAD MORE The voters who could see more misinformation this election\n\nAlbanese wants to give young Australians a 'fair crack' at purchasing a home\n\nSpeaking at a conference centre in Perth, Albanese said $10 billion pledge to first home owners would give young Australians a \"fair crack\" at purchasing because they would not have to compete with property investors.\n\n\n\n\n\n\"We want Australians to be able to afford a home where they want to live — close to their family, friends, work and community,\" Albanese said.\n\n\n\nLabor has promised to work with states and territories to use vacant or under-utilised government land to fast-track release and planning approvals to build the 100,000 homes from 2026, with buyers moving in by 2028.\n\n\n\n\n\nBut the pledge comes as Labor faces pressure over its broader pledge to building 1.2 million homes by 2030 by the end of the decade , although it maintains the target can still be met.\n\n\n\n(Left to right) Home Affairs Minister Tony Burke, Foreign Affairs Minister Penny Wong, former prime minister Julia Gillard, and Finance Minister Katy Gallagher at Labor's 2025 federal election campaign launch on Sunday. Source: AAP / Lukas Coch Albanese said the $1,000 \"instant tax deduction\" for work-related expenses would be help people avoid missing out on claims they’re entitled to and prevent them from paying more tax than they should.\n\n\n\n\n\nIt would be made available from the 2026-2027 financial year, and would give taxpayers the option to claim a flat $1,000 deduction for such expenses instead of itemising individual claims. Those who opt in would not need to keep receipts for expenses under the threshold.\n\n\n\n\n\n\"If you’re in a job where you spend more than $1,000 each year on your uniform or equipment, you can still claim a higher deduction in the usual way,\" he said.\n\n\n\nREAD MORE The 24-year-old rule that lets politicians use your data however they want\n\nAlbanese also accused the Coalition of wanting to \"mimic\" US-style policies.\n\n\n\n\n\n\"Why on earth would we try to mimic anywhere else?,\" Albanese said. \"We don’t want a wager system where people have to rely on tips to make ends meet. We don’t want Australian students burdened by a lifetime of debt. And we never ever want an American-style health system in this country.\"\n\n\n\n\n\nThe Coalition has so far not announced a policy that would increase university fees for domestic students. Labor has pledged to wipe 20 per cent from all student debts , but it has left the former Coalition government's Jobs-ready Graduates Package — which saw cuts so some degrees and vast increases to others — in place.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-travellers-weak-dollar/b718vfhgu",
    "title": "Holidaying on a weak dollar: What Australian travellers should know",
    "publish_date": "Sun, 13 Apr 2025 01:44:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Dreaming of sipping a spritz in Italy this year? You might want to check the exchange rate first.\n\n\n\n\n\nFlights, accommodation, meals, and insurance — many things can become more expensive when your dollar doesn't go as far.\n\n\n\nCould Trump's tariffs disrupt your travel plans?\n\nBut on Wednesday, before these developments, the Aussie dollar fell to 59.15 US cents — its weakest point in about five years.\n\n\n\n\n\nIt has since recovered slightly, buying about 62 US cents. The Aussie dollar is also weaker against the Euro, buying about 55 euro cents — down from 58 euro cents last month.\n\n\n\n\n\nDespite the dip, Dr Luke Hartigan, lecturer at the University of Sydney and a former Reserve Bank economist, warned against assuming price hikes across the board just yet.\n\n\n\n\n\n\"Thinking back to when the dollar went below 50 [US] cents back in the 2000s, it didn't lead to immediate, massive price rises. Many businesses absorbed the costs or hedged against them,\" he said.\n\n\n\n\n\nCompanies that rely on overseas imports often protect themselves through currency hedging, locking in exchange rates in advance. This means some travel-related costs may not spike immediately, but if the dollar stays low for months, you could feel the pinch more at the petrol pump or when booking international flights.\n\n\n\n\n\n\"Fuel and air travel — those will be reflected quite soon, I imagine,\" Hartigan said.\n\n\n\n\n\n\"What is likely to be reflected immediately is consumers deciding to travel locally. So you may end up going to Queensland or just to Cairns instead of going overseas, with the exception of New Zealand. That's the one country our dollar always never falls against.\"\n\n\n\nAre people still planning to travel? If yes, then where?\n\nSydney resident Laura said she's had to change her travel plans to Europe in July due to the poor exchange rate.\n\n\n\n\n\n\"I was planning to go Greece and Italy this year, but I ended up changing it to Thailand. A lot of my friends are having their Euro summer in Southeast Asia now,\" she said.\n\n\n\n\n\n\"I have family in London that I was going to stay with, but even then, I lose half of my money as soon as I land because of how bad the Aussie dollar is compared to the British Pound.\n\n\n\n\n\n\"I'd rather have a holiday where I know I can get way more for my money, which takes me a lot longer to save up due to the cost of living here in Australia.\"\n\n\n\n'Travel is a price elastic good'\n\nA study released by the Tourism and Transport Forum (TTF) that surveyed Australians about their travel plans from 1 December 2024 to 28 February 2025 showed that despite the rising cost of living continuing to strain Australians' wallets, a significant portion of the nation still planned to prioritise travel.\n\n\n\n\n\nNSW and Queensland emerged as the most popular destinations for those travelling domestically, while Aussies headed overseas were most likely to visit New Zealand, Japan or Europe, according to the survey.\n\n\n\n\n\nTTF CEO Margy Osmond said despite the age-old advice to book in early, Australians have indicated their openness for a last-minute travel plan.\n\n\n\n\n\n\"Whether it's due to the busy end-of-year schedule or looking out for a final-hour deal, most Australians have said that they’d book a holiday less than a month in advance. Almost a third would even wait until a few days out from departure to get organised,\" she said in December.\n\n\n\n\n\nHowever, Professor Sara Dolnicar from The University of Queensland who specialises in travel and tourism said travel is a \"very price elastic good\".\n\n\n\n\n\n\"Given the current cost of living crisis and now the low Australian dollar, when it comes to tourism, it reacts strongly to price changes or income changes,\" she said.\n\n\n\nDolnicar said consumer behaviour has shifted post-pandemic, with Australians now showing a stronger preference for international holiday destinations over domestic ones.\n\n\n\n\n\n\"The pandemic taught us that we actually can have a nice holiday close to home. I was hoping that realisation would linger, especially for sustainability purposes. But in Australia, that hasn't been particularly the case,\" she said.\n\n\n\n\n\n\"I think Australians still have this very strong desire to travel internationally. We have destinations like Europe and the United States that are somehow idealised in what it means to us to have a specific kind of holiday.\n\n\n\n\n\n\"So for Australians, it's not about giving up on the dream ... but instead to delay it for when it becomes more affordable.\"\n\n\n\nREAD MORE New travel deal to allow Australians faster entry through US airports\n\nThe global impact of economic uncertainty\n\nBut beyond Australia, the global economic outlook is not exactly positive.\n\n\n\n\n\n\"The US for sure [is at risk of recession],\" Hartigan said.\n\n\n\n\n\n\"Businesses are likely to shelve investment plans, and consumers are tightening their purse strings. You amplify that across everything — cars, coffee, chocolate, even game consoles being delayed.\"\n\n\n\n\n\nHe said trade-heavy, low-income countries like Vietnam and Bangladesh are also feeling the sting of global tariff wars and slower consumer demand — all of which eventually ripple through supply chains and travel costs.\n\n\n\nTravel tips for a weak dollar economy\n\nIf you're still keen to travel internationally, a few savvy moves can help ease the blow:\n\n\n\nBook early. Lock in flights and accommodation while rates are stable\n\nUse hedged travel cards or lock in exchange rates early\n\nTravel during off-peak seasons and look for deals on flights and stays\n\nWatch your destination's currency\n\nConsider package deals, these can bundle costs and reduce exposure to fluctuating exchange rates",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-albanese-dutton-signature-policies-revealed-economists-warn-of-house-price-surge-20250414-p5lrgb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE: Albanese, Dutton signature policies revealed; economists warn of house price surge",
    "publish_date": "Mon, 14 Apr 2025 11:59:57 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Dutton failed to acknowledge or answer a question probing why he, who has made $30 million of property transactions across 26 pieces of real estate over 35 years, wouldn’t provide financial support to help his son Harry enter the property market.\n\nMedia heard from Harry earlier in Dutton’s press conference, where the younger Dutton said that while he was “saving like mad” to afford his first property, the dream of homeownership remained unlikely in the near-term amid skyrocketing housing prices.\n\nPeter Dutton’s son Harry speaks about homeownership struggles. Credit: James Brickwood\n\nWhen asked by Herald and Age federal political reporter Olivia Ireland about why he wouldn’t chip in to support his son purchasing his first home, Dutton ignored the question, responding instead with a rehearsed talking point questioning Labor’s competence as economic managers.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/afl/three-key-performances-from-pies-win-and-is-there-a-new-top-midfield-combo-in-the-afl-key-takeouts-from-round-five-20250411-p5lqyk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three key performances from Pies’ win and is there a new top midfield combo in the AFL? Key takeouts from round five",
    "publish_date": "Mon, 14 Apr 2025 11:59:51 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Having turned 35 last week, the 2016 Brownlow medallist could be forgiven for attacking the ball with a touch less ferocity than he did in his prime. But the manner in which he physically intimated the Crows’ back line with his angry charge on the ball was stunning, reinforcing why he is arguably the greatest contest player of the modern generation. “The body is feeling great … the last couple of years I haven’t been able to get through those first couple of weeks [because of injury]. Once you get through that first couple, first month, you start to be a bit more bulletproof. I have started to get to that stage,” Dangerfield told Fox Footy. Coach Chris Scott and his coaching panel also deserve a shoutout. Where the Cats had looked to stretch the Crows for much of the first half with longer kicks, inadvertently allowing the Crows to use their speed, after half-time the Cats pushed upfield better and gave themselves options closer to the ball, meaning they could control the ball more in their front half, denying the Crows the run they had enjoyed while scoring 32 of their 33 points in the final term from turnovers. The Cats have had their wobbles this season, but they are a legitimate premiership threat. Monday’s clash against the Hawks has all the hallmarks of the epic battles these teams waged from 2008 through the “Kennett curse” era.\n\nPie night: Good things comes in threes Friday night, Adelaide Oval\n\nCollingwood defeated Sydney by 31 points Much was made of the overall age of Collingwood’s “Dad’s Army” list through the pre-season, and concerns about a perceived lack of depth. After five games, those issues have been put to bed. While Ned Long’s emergence in the midfield as a replacement for Jordan De Goey on Friday night won particular praise, Long having been delisted by the Hawks at the end of 2023, the Magpies’ hierarchy should also be delighted by their other moves.\n\nWill Hoskin-Elliott replaced injured small forward Lachie Schultz – best on ground against Carlton last week – in the front half, and had 13 disposals, including a goal. In a reshuffling of the decks because of Dan Houston’s suspension, Lachie Sullivan was drafted in to effectively replace Harry Perryman in defence, the latter then tasked to be the rebounding half-back that Houston typically is. With Long thriving as a ball hunter in the mould of the injured De Goey, the Magpies proved that all good things do come in threes. This was a defensive masterclass by the Magpies, for they denied the Swans their key offensive plank – attacking through the corridor. The Swans like to possess the ball but, too often, turned it over when forced down the line. Aside from the opening round loss to Greater Western Sydney, their only defeat so far this season when they conceded 104 points, the Magpies have not coughed up more than 78 points in a game. The troubles of 2024 are now all but a memory. Fixture boon for AFL Sunday night, Adelaide Oval\n\nPort Adelaide defeated Hawthorn by 30 points\n\nThe hype and exposure this game attracted should have the AFL seriously considering running it back next season. Much to think about: Sam Mitchell and his Hawks should expect a return clash against the Power at the Adelaide Oval next year. Credit: AFL Photos via Getty Images Gather Round may have its own unique quirks, including tight dressing rooms at the suburban venues, but, ultimately, the AFL is all about maximising exposure, whether that be attendances or broadcast ratings. And this one was a winner in the relatively unexplored Sunday night prime-time slot. The weekend got off to a great start when the Crows hosted their former star Patrick Dangerfield and his Cats at the Adelaide Oval, and was capped by Sunday night’s grudge match. While the contest didn’t quite live it up to the billing – sly old fox Ken Hinkley did a number on the man of the moment, Sam Mitchell – the heightened emotions of the crowd, and the chirp among players, meant this was a must-watch occasion.\n\nLoading The AFL, and all sports for that matter, are under pressure from broadcasters to deliver “events” – contests that transcend the norm and can attract the average fan, and those with a mild interest in the game, to tune in. The Hawks and Power, care of their tight results last season, and the post-siren drama of the semi-final, ensured there were several characters fans could gravitate to. Or simply pick a side. This rivalry is real. “I know I definitely used it,” Power star Jason Horne-Francis told Seven after the match.\n\nLoading “I think rivalries are so good to have, and I think the one that we’re building here, it’s such a good rivalry … so, I know I definitely used it. I know some of the boys used it.” There will be a rematch in round 19 in Launceston, but an Adelaide Oval fixture should already be pencilled in for next year. Hinkley, of course, won’t be there next season, as the coaching handover to Josh Carr will be completed by then. But the Power’s five-goal win was a coaching masterclass, the inspired move of skipper Connor Rozee to half-back leaving the Hawks flummoxed. In a week when they lost their best player Will Day to long-term injury, this was a brutal reality check for the previously unbeaten Hawks. Their run from half-back dried up, a point Geelong have undoubtedly taken note of ahead of their Easter Monday clash.\n\nFans hope for blue skies ahead Saturday afternoon, Adelaide Oval\n\nCarlton defeated West Coast by 71 points Loading Carlton supporters won’t take too much from the win over the Eagles at Adelaide Oval. Yes, it was a relief to see their team finally get off the mark, but this is a woeful Eagles line-up that coach Andrew McQualter needs to strip right back. However, for the Blues, there were at least signs of a revival. And even signs AFL great Jimmy Bartel’s suggested non-negotiables, published in this masthead, had, dare we say it, been embraced.\n\nBartel called for the Blues’ defenders to use their opponent as the starting point and win the contest from there. Jacob Weitering and Jack Silvagni had been doing that; Mitch McGovern, in one of his best games, punctuated by a late long goal, and line-breaker Adam Saad, appeared to heed the message. Bartel wanted the midfielders to “spread, spread, spread”, a point Sam Walsh essentially made last Monday when he felt too many Blues were stuck in the contest. Walsh, with only one goal before Saturday, took his own advice, and booted three amid a 37-disposal masterpiece. The Geelong great also wanted the Blues’ forwards to aim for two tackles each per quarter. While the Blues were beaten 46-35 in overall tackles, they won the inside-50 count, 12-5. What will frustrate the Blues is that they managed only 17 goals from a whopping 73 inside-50 entries. That must improve against North Melbourne on Good Friday. For the Eagles, some of the errors they made, particularly when attempting to clear the ball from defence, had to be seen to be believed. It is still baffling that arguably the club with the most financial muscle of any in the competition can have been so bad for so long.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/golf/mcilroy-s-breathtaking-masters-win-was-as-good-as-sport-will-ever-be-20250414-p5lrju.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "McIlroy’s breathtaking Masters win was as good as sport will ever be",
    "publish_date": "Mon, 14 Apr 2025 11:55:49 +1000",
    "category": "sports",
    "authors": [
      "Peter Fitzsimons"
    ],
    "text": "But near-murder is what we saw, with a staggering twist. For this final day’s play was not a case of McIlroy trading death blows with a fierce opponent at all. The theme of this last day was the Northern Irishman trading blows with himself, unleashing vicious uppercuts to his own chin, only to come back swinging for the fairways regardless. Rory McIlroy celebrates winning the US Masters. Credit: Getty Images Time and again he followed the kind of choked shots that were Greg Norman’s infamous hallmark on his own final-day choke for the ages in the same tournament in 1996 with masterful recovery strokes that simply took the breath away. In the course of the tournament, McIlroy hit four – count ’em four – double-bogeys. But instead of throwing himself to the ground and weeping, he composed himself, against all reason, and delivered birdies. A double-bogey to begin this day? No problem.\n\nA wedge shot that put his ball right in the middle of what the denizens of Augusta call “Rae’s Creek”, but which to McIlroy had obviously become a creek of another name, and he was a man without a paddle. But no, he recovers again! All the while, however, Rose is quietly putting superb birdies together himself, less the double-bogeys, to start to mow down everyone between him and McIlroy. All of which sets up the best of the theatre, the play’s final act. For even as McIlroy cruises regardless to what looks to be a two-shot win, they keep doing cutaway shots to Rose who – having finished two lots ahead of McIlroy – is on the practice tee, staying limbered up and focused on the exceedingly off-chance that his rival will blow this. Surely, surely, Rory is not going to blow it now and ...\n\nAnd before our very eyes, on the 18th, he puts it in the bunker! Again, he could be forgiven for wrapping his club around the nearest tree, before falling to the ground and saying “I CANNOT do this any more!” But no, he pulls off a miraculous bunker shot to have the green jacket in his grasp, if he can just hole a relatively easy putt that he should be able to knock in with his eyes closed ... only to … only to miss. McIlroy can clearly barely believe that this can have happened again. Is he about to be humiliated as he was last year when in the last few holes of the US Open he bogeyed four of the last five holes – including two sitters on the 16th and 18th – to lose to Bryson DeChambeau? Cue Nick Faldo on commentary at the time. “That’s going to haunt Rory for the rest of his life, those two misses.” Say, Rory, are you facing that, now, only worse? “Haunt” you? If you lose this mate, it will be your waking thought for the rest of your life! Steely-eyed, he makes his way to the tee for the play-off hole, with his caddy, Harry Diamond. Best friends since they were kids, and best men at each other’s wedding, the two talk quietly – settle, Rory, settle, it will be OK– as Justin Rose arrives. And now, as Rose and McIlroy face off before beginning, do they glare at each other, a la boxing? Do they mutter crude imprecations under their breath, as cricket is infamous for? Do they even ignore each other as tennis players are wont to do in the tunnel at Wimbledon?\n\nNone of the above. Instead they warmly embrace each other, and sincerely wish each other the best. This time, no chokes, no jokes. Rose hits a wonder shot to be a couple of metres off the hole – only for McIlroy to hit an even better one, just a metre off. Rose two-putts to sink his. Over to you, Rory. McIlroy embraces Justin Rose after the dramatic climax to the Masters. Credit: Getty Images\n\nThis one for the money. For the glory. For the monkey off your back. For your first major in 11 years. This one, to take your place as one of only six players in the history of golf to have completed the grand slam of majors, with the last one being Tiger Woods 25 years ago. This one for your mum and dad, who raised you as their only child and made so many sacrifices to give you every chance of competing with the off-spring of more privileged folk – who even now, are watching in your childhood home at Holyrood, where you dreamed of this moment from the age of ten onwards. Can you do it? McIlroy lines it up. He taps. It drifts . . . drifts . . . drifts . . . in! Victory! McIlroy brings his hands to his head, throwing his putter behind him as he does so. His whole body shakes with emotion.\n\nNow, Rory, now. Now you can throw yourself to the ground. And so he does, simply unable to stand. Rose, though obviously devastated – his own life’s dream, snatched off him just instants ago – hangs back so as not to impede for a second on McIlroy’s glory. Only when it ebbs does he come into the frame, to warmly embrace his great rival and sincerely congratulate him, before withdrawing. The podium is all yours. It is sport, as good as it gets – and golf, which has somehow resisted garish carry-on, (yes, yes, yes, apart from LIV, I mean,) to maintain its sheer class. Loading Making his way to the clubhouse, McIlroy is further engulfed by all and sundry, including his wife and children, but must finally extricate himself, to say “I’ve got to go and get a green jacket.”",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/golf/the-masters-2025-final-round-live-mcilroy-searches-for-elusive-green-jacket-as-day-pushes-up-the-leaderboard-20250413-p5lrfy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "McIlroy breaks Masters drought with remarkable victory in a play-off",
    "publish_date": "Mon, 14 Apr 2025 11:45:24 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Rory McIlroy has defied another Masters meltdown to win in a playoff from Justin Rose and become the first European to secure a career grand slam more than a decade in the making.\n\nThe Northern Irishman (11 under, 72, 66, 66, 73) was four shots clear through 10 holes but, as he did 14 years ago at Augusta National, stumbled with five dropped shots as Rose (65, 71, 75, 66) surged to finish level.\n\nA bogey on the last hole of regulation forced a sudden-death playoff and both men had birdie putts on the first extra hole, McIlroy putting his approach to three feet after Rose’s had settled 15 feet away.\n\nRose’s effort slid by, before McIlroy tapped in to clinch his maiden Masters title and first major in 11 years.\n\nThe 35-year-old fell to the ground in relief after his putt dropped, having watched a five-foot par attempt on the same hole slide by minutes earlier that would have sealed the triumph in regulation.\n\nRory McIlroy poses with the Masters trophy. Credit: Getty Images\n\nTiger Woods was the last man to complete the set of all four majors when he dominated the British Open in his first attempt at the career grand slam in 2000.\n\n“It was 14 years in the making; I feel like I could have got it done there,” McIlroy said of the 2011 Masters fadeout that has haunted him.\n\n“There was a lot of pent up emotion that just came out on that 18th green\n\n“A moment like that just makes ... all the close calls worth it.”\n\nGene Sarazen, Ben Hogan, Gary Player and Jack Nicklaus are the only other members of the career grand slam club.\n\nScottie Scheffler puts the green Jacket on winner, Rory McIlroy. Credit: AP\n\nThe rollercoaster final day started with McIlroy two shots clear of Bryson DeChambeau (seven under) with the American briefly leading after just two holes before fading as the chasing pack surged.\n\nLeading by four after the 10th, he dropped a shot on the 11th and then inexplicably found water with a wedge despite laying up on 13th.\n\nThat fourth double bogey for his tournament is now a quirky record among champions.\n\nWhen his curling putt on the 14th sat on the lip of the cup but didn’t drop and he’d lost the lead.\n\nRose, who led for a record fifth time after the first round, bogeyed the 17th but then drained a 20-foot putt on the 18th to heap pressure on the leader.\n\nJustin Rose of England reacts to missing his putt on the 18th green. Credit: Getty Images\n\nMcIlroy found the sand with his wedge approach and then pulled his par putt to fall into the playoff.\n\nHe delivered again with an iron, as he had done with scintillating approaches to the 15th and 17th for birdies, to secure victory.\n\nThe whirlwind began on Thursday when McIlroy went back to par with a pair of double bogeys and sat seven behind fast-starting Rose.\n\nOnly Nick Faldo in 1990 and Woods in 2005 had previously come from that far back after the opening round to win.\n\nBut McIlroy launched his comeback with a back nine of 31 and exploded out of the blocks with a record six consecutive threes to start on Saturday.\n\n“All week I responded to setbacks,” he said.\n\nPatrick Reed (nine under) holed out for eagle on the 17th to finish outright third.\n\nScottie Scheffler (eight under) was fourth and Australian Jason Day dropped shots on the last two holes to finish five under and in a tie for eighth.\n\nRose fell just short of executing the second-biggest Masters comeback after starting the final day seven shots behind.\n\nThe former world No.1, US Open and Olympic champion, joins Greg Norman as a three-time Masters runner-up and Ben Hogan as the only loser of multiple playoffs after his 2017 defeat to Sergio Garcia.\n\nMin Woo Lee, Australia’s only other cut survivor, was two over on Sunday to finish six over for the tournament in 49th.\n\nAAP",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/liberal-party-drops-diss-track-aimed-at-labor-20250414-p5lrkk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Liberal Party drops 'diss track' aimed at Labor",
    "publish_date": "Mon, 14 Apr 2025 11:44:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "Liberal Party drops 'diss track' aimed at Labor\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/world/north-america/trump-s-boosters-laud-his-tariff-flip-flop-but-consumers-are-not-buying-it-20250414-p5lrh8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s boosters laud his tariff flip-flop but consumers are not buying it",
    "publish_date": "Mon, 14 Apr 2025 11:40:15 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Washington: Another day, another tariff backflip. This time it was a Friday night carve out for smartphones, laptops, computer parts and other electronics, which will no longer be subject to the 125 per cent tariff Donald Trump placed on goods from China.\n\nIt’s a significant backdown because about a quarter of US imports from China are electronics – even more than several other countries that have had their tariffs temporarily reduced to 10 per cent.\n\nStill, Trump and his lieutenants were upset to see this called out as yet another tariff flip-flop. Administration figures were out in force on the Sunday morning political talk shows saying electronics, including all-important semiconductors, would instead be part of a separate “bucket” of tariffs to come in the next month or two.\n\nDonald Trump’s tariff policies are making American consumers jittery. Credit: Bloomberg\n\n“They’re going to have a special, focused type of tariff to make sure those products get re-shored,” Commerce Secretary Howard Lutnick said on ABC’s This Week. “We need to have these things made in America.”",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/property/news/couple-spends-3-69m-on-really-liveable-and-practical-luxury-home-20250414-p5lrhh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Couple spends $3.69m on ‘really liveable and practical’ luxury home",
    "publish_date": "Mon, 14 Apr 2025 11:38:37 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A downsizing couple paid $3.69 million for an immaculate duplex in Essendon under the hammer on Saturday.\n\nFive buyers showed interest and three actively bid for the four-bedroom home, guided between $3,350,000 to $3,685,000 at 18a Roberts Street.\n\nBidding opened on a $3.3 million genuine bid but then stalled, and a vendor bid of $3.35 million was placed.\n\nAfter a bid of $3,375,000 was offered, the auction took off in $25,000 increments until it was on the market at $3.65 million, and sold at $3.69 million.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/nsw/like-putting-a-highway-across-a-park-the-problem-with-the-fish-market-ferry-plan-20250408-p5lq3c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Like putting a highway across a park’: The problem with the fish market ferry plan",
    "publish_date": "Mon, 14 Apr 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Megan Gorrey"
    ],
    "text": "Rowers fear an inner city bay will become a highway for ferries and private vessels once the new Sydney Fish Market opens, risking dangerous collisions or forcing them to abandon the waterway altogether.\n\nThe NSW government plans to open a 50-metre recreational wharf at its $836 million fish market opening at the head of Blackwattle Bay later this year. It forecasts the complex will attract about 6 million visitors a year – double the number going to the current adjacent site in Pyrmont.\n\nGlebe Rowing Club members prepare to skim the water at dawn. They are among hundreds of rowers and paddlers who use the bay in the early morning, afternoons and weekends. Credit: Kate Geraghty\n\nGlebe Rowing Club captain Nick Galea said hundreds of members of more than a dozen clubs based at Blackwattle Bay were worried the influx of visitors would cause congestion, push rowers and paddlers into the path of big ferries, and generate wash that could disturb or capsize smaller vessels.\n\n“Our biggest fear is people getting run over by a ferry, particularly younger or older people who might be less experienced,” Galea said.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/mary-fowler-may-have-hurt-her-knee-badly-that-would-be-an-utter-disaster-for-the-matildas-20250414-p5lriy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mary Fowler may have hurt her knee … badly. That would be an utter disaster for the Matildas",
    "publish_date": "Mon, 14 Apr 2025 11:28:25 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Australian soccer is still cursed. Whatever John Safran did with that chicken in Mozambique all those years ago to overturn a curse placed on Johnny Warren’s Socceroos in 1969, it clearly didn’t take. Or maybe there’s a different curse on the Matildas. Who knows?\n\nHow else to explain the acute misfortune that continues to befall our most beloved national team, particularly on the eve of major tournaments?\n\nSam Kerr famously did her calf just before the Women’s World Cup, curtailing her involvement in a tournament that felt like it was almost made for her. Then she did her ACL in the lead-in to Paris 2024, robbing her of a chance of redemption; she still hasn’t returned to the field.\n\nNow Mary Fowler? Of all players? This close to the Women’s Asian Cup?",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/decadent-escapes-cheese-parties-long-lunches-vic-food-events-for-when-winter-hits-20250411-p5lr3n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Decadent escapes, cheese parties, long lunches: Vic food events for when winter hits",
    "publish_date": "Mon, 14 Apr 2025 11:00:00 +1000",
    "category": "finance",
    "authors": [
      "Kosa Monteith"
    ],
    "text": "Advertisement\n\nEating outFood events Decadent escapes, cheese parties, long lunches: Vic food events for when winter hits Seek out an off-grid weekend with food by top chefs, a double-whammy wine and cheese festival and a long lunch with a face you’ll know from TV. Kosa Monteith April 14, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nColder months bring the spirit of feasting and cosy nights by the fire, but there are plenty of events to lure you from hibernation. Taste the terroir of Grampians wine, take a pal to a long lunch, or get out of Victoria with an off-grid weekend in the Tassie wilderness that includes food from top chefs. Grampians Grape Escape is a celebration of the region’s wine, spirits and natural beauty. Supplied Grampians Grape Escape (May 2 to 4) Good for: Those who like to give back. One of Australia’s longest-running food and wine festivals, Grampians Grape Escape has more than 30 years under its belt. This year’s event holds even more weight after recent bushfires, and will open with Feel-Good Friday celebrating the region’s resilience. More than 100 exhibitors will showcase western Victoria’s best, including 30 winemakers such as Dalwhinnie, Jackson Brooke and Seppelt. There are spirits, craft beer and produce; music and live entertainment; a pickling workshop; and cooking demonstrations by MasterChef alums Justine Schofield and Dani Venn.\n\nAdvertisement\n\nFrom $55 (for adults), grampiansgrapeescape.com.au Mould Cheese Festival x Pinot Palooza (July 4 to 5) Good for: Lovers of wine and cheese (isn’t that everyone?) Two of Australia’s favourite festivals have teamed up for the perfect pairing. Mould showcases more than 50 Australian artisan cheeses from bright to pungent and ripe, while Pinot Palooza pours drops from here and abroad. Let winemakers from Innocent Bystander, Meadowbank and Yering Station show you the art of pairing pinot noir with food. In between, try standout cheeses from Bruny Island, Long Paddock and Dreaming Goat, and shop for cheeseboard accompaniments including award-winning charcuterie, pâté, relishes and honey. There are also drinks by Archie Rose. $59, mouldcheesefestival.com\n\nAdvertisement\n\nDarker Days is an annual High Country festival embracing dark ales, live music and more. Supplied Darker Days Festival (June 21) Good for: Craft beer fans who like their brews dark and with a side of rock. At Bright’s beer and music festival, headlined this year by local indie legends British India, snuggle up beside the bonfire and cradle dark beers from hosts Bright Brewery, New Zealand’s Urbanaut, NSW’s Seeker Brewing and Victoria’s Boatrocker. There’ll be other drinks from High Country producers Alpine Cider, Reed and Co, and Backwoods; hearty feasts of smoked meat, spicy Mexican cuisine and more; plus face-painting, roving entertainers and live music well into the night. Tickets on sale April 23. Visit Instagramor brightbrewery.com.au/darkerdays for updates.\n\nAdvertisement\n\nDeli Lane (May 10) Good for: Busy people who need cooking inspiration – and anyone who wants to treat their mum the day before Mother’s Day. Cooking fast, flavourful food for the family is TV host and author Justine Schofield’s ninja skill. And she’s going to share some of her best tricks for streamlining your cooking at a fabulous long lunch hosted by Good Food Events. Embracing your freezer is the focus of Schofield’s new cookbook, Cook Ahead, and she’ll be showing how frozen veg can be your friend with her menu for Deli Lane presented by Bird’s Eye. Joining her will be MasterChef alumni Conor Curran to bring the fun. $135 for three courses including drinks, goodfoodevents.com.au Two top Melbourne chefs will cook for guests at Kittawa Lodge, King Island. Supplied\n\nAdvertisement\n\nRosheen Kaul and Stephen Nairn at Kittawa Lodge\n\n(May 28 to June 3, July 30 to August 5) Good for: Those wanting a super boutique experience (although it has a price-tag to match). If you can’t beat the chill, go all in and book a Tasmanian escape. At secluded Kittawa Lodge on King Island, two super-star Melbourne chefs will bunker down with guests over winter, preparing toasty dinners, bountiful picnics and dreamy breakfasts. Stephen Nairn (Omnia, Yugen) kicks things off in May, followed by Rosheen Kaul (ex-Etta) in July. From Nairn, expect clam chowder, King Island beef with Jerusalem artichoke, and sticky toffee pudding. From $8650 for two guests for three nights, kittawalodge.com/bookings With Emma Breheny\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/best-dressed-in-the-sky-the-top-7-airline-uniforms-of-all-time-20250408-p5lq8q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Best dressed in the sky: The top 7 airline uniforms of all time",
    "publish_date": "Mon, 14 Apr 2025 10:58:31 +1000",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "East meets West in Lawrence Xu’s designs for Chinese carrier Hainan Airlines, which made its debut during Paris Fashion Week in 2017. “When waiting at the boarding gate, stewardesses will be wearing cheongsam, coats, hairpins, beret-style hats, and high heels to show their full respect to passengers,” Xu said at the launch. The cheongsam-inspired dresses feature a print of the mythical roc bird, referencing planes in flight, and are teamed with muted grey jackets with contemporary lines. Male crew are given grey double-breasted coats that would look equally at home in any finance district. 3. Braniff Airlines, Emilio Pucci, 1965\n\nCabin crew model 1960s Pucci uniforms in front of Lockheed’s supersonic transport mock-up. Credit: Getty Images The psychedelic uniforms of the Braniff Airlines flight crew by Emilio Pucci in 1965 were stylish and fashion forward but did little to dispel the “coffee, tea or me” stereotype of cabin crew. Under the guidance of marketing guru Mary Wells Lawrence, the inspiration for Mad Men’s Peggy Olson, the colourful uniforms for the Texas-based airline turned the economy aisle into a runway. Lawrence devised a layering concept known as the Air Strip, allowing staff to remove pieces as the flight progressed to its destination. Rain domes – to protect hairdos from rain and wind on the tarmac – lasted only one month as part of the uniform as there was nowhere to store them on board.\n\nThe uniforms were more successful than the airline, which was grounded in 1982, with vintage Pucci pieces frequently selling for more than $1000 on eBay. 4. Qantas, Emilio Pucci, 1974 Emilio Pucci reveals his Qantas uniforms on the cover of the airline’s magazine in 1974. They remained in use until 1985. Following his success with Braniff, Qantas commissioned Pucci to design its cabin crew uniforms in 1974. The striptease layering of the Braniff uniforms was abandoned in favour of a vivid floral print, jersey shirt dress, light enough to be washed in a hotel basin for staff on a short layover.\n\nMen were given boxy block colour jackets, denoting their rank, which were voluminous enough to store cartons of duty-free cigarettes, with lapels competing with the plane’s wingspan. Unfortunately, the women’s uniform was the only one to make the cut for the Jenny the Jetsetting Qantas Air Hostess Doll released in 1974. 5. Air France, Cristobal Balenciaga, 1968 The Air France summer and winter uniforms for flight attendants designed by Cristobal Balenciaga in 1968. The Air France uniforms by Cristobal Balenciaga marked the only time the revered couturier stooped to design ready-to-wear pieces.\n\nIn 1968, Balenciaga closed his couture house after creating a sleek uniform for the female cabin crew that would probably win the Fashions on the Field competition at the Melbourne Cup if worn today. The uniform came in a winter style with a high-waisted jacket with four patch pockets, and a navy-blue-and-white scarf that could be knotted to hold hats in place. The skirt featured kangaroo pockets and was worn above knee-high boots, but the summer collection was the real standout. In sky-blue or pale pink, the summer uniform featured a short-sleeved, double-breasted cropped jacket with an asymmetric fastening, and prim navy-blue hatter’s bow beneath a Peter Pan collar. This is what the schoolgirl Madeleine would have worn once she graduated from the convent. 6. Virgin Atlantic, Vivienne Westwood, 2014\n\nTelevision personality Michelle Visage (second from left) at the launch of Virgin Atlantic’s gender-neutral uniform policy in 2022, wearing the Vivienne Westwood designs. The late Dame Vivienne Westwood’s fondness for flounces, bare bottoms and a ribald sexuality in her designs seemed to make her an unlikely choice to upgrade Virgin Atlantic’s uniforms in 2014. “She was the natural choice to redesign the uniform across all areas of our business,” said a statement from the airline. “Firstly because original design and sustainability are vital to both Virgin Atlantic and Vivienne Westwood.” Westwood’s signature details are present with the frill blouse taken from her Red Label spring/summer 2005 collection, pencil skirts with a back pleat, and red jackets with nipped waists. Three-piece suits in deep burgundy and grey, worn over a white shirt with wide collar, were originally the choice for men. In 2022, the airline launched a gender-free approach to dressing, with staff able to choose any pieces from the range to reflect their identity. Following the announcement, staff on a flight to Qatar were instructed to dress according to traditional gender norms.\n\n7. Alaska Airlines, Luly Yang, 2018 The Alaska Airlines uniform by Luly Yang, unveiled in 2018. The first time I flew Alaska Airlines, I was captivated by a flight attendant’s dreamcatcher earrings and devastated to find out that they weren’t part of the uniforms. A quick trip to the cockpit alleviated my disappointment. Seattle-based designer Luly Yang’s uniforms for the airline, unveiled in 2018, are mostly unremarkable but the pilot’s leather jackets inject some Top Gun cool into the skies. Let’s hope the jackets remain as Yang designs the airline’s new uniforms following its merging with Hawaiian Airlines.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/stan-team-calls-teddys-miracle-try-20250414-p5lrjk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Stan team calls Teddy's miracle try",
    "publish_date": "Mon, 14 Apr 2025 10:55:02 +1000",
    "category": "sports",
    "authors": [],
    "text": "Stan team calls Teddy's miracle try\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/matt-dennys-discus-record-is-broken-within-minutes-as-lithuanias-mykolas-alekna-surpasses-the-75-m-20250414-p5lrjm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Matt Denny's discus record is broken within minutes as Lithuania's Mykolas Alekna surpasses the 75 m",
    "publish_date": "Mon, 14 Apr 2025 10:54:37 +1000",
    "category": "finance",
    "authors": [],
    "text": "Matt Denny's discus record is broken within minutes as Lithuania's Mykolas Alekna surpasses the 75 m\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/barnes-slots-a-double-against-united-20250414-p5lrjl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Barnes slots a double against United",
    "publish_date": "Mon, 14 Apr 2025 10:54:16 +1000",
    "category": "finance",
    "authors": [],
    "text": "Barnes slots a double against United\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-key-issues-that-will-define-the-election-and-where-the-major-parties-stand-20250306-p5lhbw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Albanese v Dutton: what are they offering on housing, taxes, health",
    "publish_date": "Mon, 14 Apr 2025 10:50:11 +1000",
    "category": "finance",
    "authors": [
      "Natassia Chrysanthos"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Anthony Albanese and Peter Dutton have launched their formal election campaigns with duelling policies on taxation and housing, which will add to the policy debate at this year’s election. The leaders are also tussling over Medicare and fighting over the best energy policy for Australia’s future. But it all comes down to the cost of living, which is the defining issue of the campaign, as turbulent global affairs put a spotlight on foreign policy and the economy. Here are the key policy issues dominating the campaign, and where Labor and the Coalition stand on them. Housing and home ownership For first home buyers, Labor is promising $10 billion to build 100,000 homes exclusively for first-time buyers to move into from 2027. It will also allow all first home buyers to purchase property with just a 5 per cent deposit, with the government to guarantee the rest of a typical 20 per cent deposit.\n\nAdvertisement\n\nThis is on top of its promise to build 1.2 million homes by the end of the decade. Its $10 billion Housing Australia Future Fund will raise money for new builds, including 40,000 social and affordable rental homes. The Coalition, on the other hand, will allow first-home buyers to deduct mortgage interest payments from their taxable income for five years when they buy newly built homes, up to the first $650,000 of a mortgage. This will apply to singles earning up to $175,000, and couples on a combined income of up to $250,000. Loading Australians would also be able to withdraw up to $50,000 from their superannuation accounts to buy their first home. The Coalition says it will abolish Labor’s housing fund and instead invest $5 billion to deliver infrastructure – such as water, power and sewerage – at development sites, which it says will help build 500,000 new homes. Both parties will ban foreign investors from buying existing homes for two years – a Coalition policy that Labor has adopted.\n\nTaxes and cost-of-living relief\n\nAdvertisement\n\nTax was a latecomer to the campaign agenda but has become a significant talking point. Labor will create a $1000 instant tax deduction for work-related expenses, so people won’t need to submit receipts up to that amount in their tax returns. The party has also introduced an extra tax cut – on top of its restructured stage three tax cuts – that will reduce the lowest marginal tax rate from 16 to 14 per cent over two years, starting in July 2026. It means workers will get a $268 tax cut in 2026-27, which becomes $536 a year from 2027-28 onwards. The Coalition says it will repeal the latest tax cut if it wins government, effectively reinstating the higher 16 per cent tax rate. Loading But it will give a one-off $1200 tax offset to people earning between $48,000 and $104,000 in next year’s tax return. Taxpayers earning below $48,000, or between $104,000 and $144,000, will receive a smaller amount. The Coalition will also halve the fuel excise for 12 months, saving Australians 25.4¢ per litre of petrol.\n\nAdvertisement\n\nAdvertisement\n\nThe Coalition will scale this back and instead says it will build seven government-owned nuclear power plants by the mid-2040s. Until then, it will rely on running coal plants for longer and ramp up domestic gas production. It wants gas companies to divert more supply to the Australian market, rather than ship it offshore. Both parties have committed to net zero greenhouse gas emissions by 2050, but Labor has also set a legally binding target to cut emissions by 43 per cent by 2030. The Coalition has indicated it would be less ambitious for the end of the decade, but said it would set interim targets in government. Population and immigration Both parties say immigration has been too high since the pandemic and needs to come down. Labor has forecast net overseas migration will slow to 260,000 in 2025-26. The Coalition has committed to slashing the budget numbers by an extra 100,000 people. Loading International students are a big part of this picture: Labor wanted to cap student numbers at 270,000, but the Coalition blocked that bill. The opposition has since said it will introduce its own caps to set numbers at 240,000, while hiking student visa fees. The parties last year formed a unity ticket when it comes to how they manage people Australia doesn’t want in the country: they teamed up on three new laws, including paying third countries to take non-citizens. However, Dutton has also pledged to go harder on this issue – he is considering a referendum on allowing politicians to strip criminal dual nationals of their Australian citizenship, and wants questions on antisemitism in the citizenship test.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://au.news.yahoo.com/live/karl-stefanovics-scathing-election-claim-bunnings-looking-to-expand-further-china-asks-trump-to-fix-mistake-001208423.html",
    "title": "Karl Stefanovic's scathing election claim, Bunnings looking to 'expand further', China asks Trump to fix 'mistake'",
    "publish_date": "2025-04-14T00:12:08Z",
    "category": "finance",
    "authors": [
      "Tom Flanagan"
    ],
    "text": "Treasurer Jim Chalmers has batted away suggestions the major parties are “recklessly buying votes” with big-ticket election promises during a clash with Today host Karl Stefanovic.\n\nStefanovic wasted no time getting stuck into both sides on Monday morning, saying it was like “watching Dumb and Dumber, you guys recklessly buying our votes”.\n\nChalmers refuted the suggestion, saying there was “a really important difference”.\n\n“What we've shown as a Labor government is we’ve been able to maintain a focus on the cost of living,” he said.\n\n“At the same time as we’ve got the budget in much better nick, and that’s meant that we could make room for the sorts of commitments that we have been making in a really responsible way.\n\nTreasurer Jim Chalmers has batted away suggestions the major parties are “recklessly buying votes” with big-ticket electionpromises during a clash with Today host Karl Stefanovic.\n\n“The budget’s more than $200bn stronger than when we came to office. We’ve got the Liberal debt down.\n\n“We’ve delivered those two surpluses, and that’s meant we’ve been able to help with the cost of living. Ongoing tax relief, helping with medicines and energy, bill rebates and the like.”\n\nOn Sunday, the major parties announced expensive housing policies which economists say will pump more money into the housing market and raise prices.\n\nChalmers argued the Coalition’s plan had no ongoing benefit.\n\n“What Peter Dutton did yesterday was to borrow and burn another $10bn and still provide no ongoing cost of living help for people who are doing it tough.\n\n“And then he’ll claw that back with permanently higher income taxes, lower wages and secret cuts to pay for his nuclear reactors.”\n\nRead NCA NewsWire's election wrap this Monday here.",
    "source": "Yahoo",
    "cluster_id": 38
  }
]