[
  {
    "url": "https://www.9news.com.au/world/donald-trump-update-us-president-signs-executive-order-aiming-to-lower-us-drug-costs/57730465-509f-463e-b572-2ca6dac2e70d",
    "title": "'One-sixth that price in Australia': Trump signs drug price order",
    "publish_date": "Mon, 12 May 2025 19:43:12 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "US President Donald Trump has unveiled a drug price overhaul he claims will force other countries, including Australia , to pay more in order to reduce prices for Americans.\n\nHe signed a sweeping executive order setting a 30-day deadline for drugmakers to electively lower the cost of prescription drugs in the US or face new limits down the road over what the US government would pay.\n\nThe order calls on the health department, led by Robert F Kennedy Jr, to broker new price tags for drugs over the next month.\n\nUS President Donald Trump signs an executive order related to drug prices, in the Roosevelt Room of the White House in Washington, Monday, May 12, 2025, in Washington. (AP Photo/Mark Schiefelbein)\n\nIf deals are not reached, Kennedy will be tasked with developing a new rule that ties the price the US pays for medications to lower prices paid by other countries.\n\n\"We're going to equalise,\" Trump said during a Monday morning (early Tuesday AEST) press conference.\n\n\"We're all going to pay the same. We're going to pay what Europe pays.\"\n\nThe European Union was undoubtedly the president's main target but he also called out price differences between the UK and Australia.\n\n\"Whoever is paying the lowest price, we will look at that price when we will say that's the price we're going to pay. Most favoured nation is what it is,\" Trump said.\n\n\"One breast cancer drug costs Americans over $16,000 per bottle, but the same drug from the same factory, manufactured by the same company, is one-sixth that price in Australia and one-tenth that price in Sweden. One-tenth for the identical product.\n\nIf deals are not reached, Kennedy will be tasked with developing a new rule that ties the price the US pays for medications to lower prices paid by other countries. (AP Photo/Mark Schiefelbein)\n\n\"A common asthma drug costs almost $500 here in America, but costs less than $40 in the United Kingdom.\"\n\nIt's unclear what — if any — impact the Republican president's executive order will have on millions of Americans who have private health insurance. The federal government has the most power to shape the price it pays for drugs covered by Medicare and Medicaid.\n\nThe impact on prices in Australia and other countries is even less clear but Trump insisted the goal was to force other developed nations to foot more of the bill for research and development of drugs.\n\n\"Europe is going to have to pay a little bit more. The rest of the world is going to have to pay a little bit more, and America is going to pay a lot less,\" he said.\n\nThe US has taken issue with the Pharmaceutical Benefits Scheme in the past and Trump has continuously threatened to introduce tariffs on pharmaceuticals, one of Australia's largest exports to the US, worth about $1.6 billion a year.\n\nThe latest move is not a tariff, nor would it have any direct impact on the PBS, which Prime Minister Anthony Albanese promised during the election campaign was off the table in any trade negotiations with the Trump Administration.\n\nREAD MORE: Mum wakes in hospital to discover both fallopian tubes removed ﻿\n\nPharmaceuticals are seen in North Andover, Massachusetts , on June 15, 2018. (AP Photo/Elise Amendola, file)\n\nTop US drugmakers say Trump's order is bad for patients\n\nThe US' pharmaceutical lobby, which represents the top drugmakers, immediately pushed back against Trump's order, calling it a \"bad deal\" for American patients. Drugmakers have long argued that any threats to their profits could impact the research they do to develop new drugs.\n\n\"Importing foreign prices from socialist countries would be a bad deal for American patients and workers,\" Stephen J Ubl, the president and CEO of PhRMA, said in a statement.\n\n\"It would mean less treatments and cures and would jeopardize the hundreds of billions our member companies are planning to invest in America.\"\n\nTrump's so-called \"most favoured nation\" approach to Medicare drug pricing has been controversial since he first tried to implement it during his first term. He signed a similar executive order in the final weeks of his presidency, which called for the US to only pay a lower price than other countries pay for some drugs — such as injectables or cancer drugs given through infusions — administered in a doctor's office.\n\nThat narrow executive order faced hurdles, with a court order that blocked the rule from going into effect under President Joe Biden's administration. The pharmaceutical industry argued that Trump's 2020 attempt would give foreign governments the \"upper hand\" in deciding the value of medicines in the U.S.\n\nTop US drugmakers say Trump's order is bad for patients. (AP Photo/Julio Cortez, File)\n\nTrump says other countries are to blame\n\nTrump repeatedly defended pharmaceutical companies, instead blaming other countries for the high price Americans pay for drugs, during a wide-ranging speech at the White House on Monday.\n\nThe president was flanked by Kennedy, Centres for Medicare and Medicaid Services administrator Dr Mehmet Oz, Food and Drug Administration commissioner Dr Marty Makary and National Institutes of Health director Jay Bhattacharya.\n\nHe did, however, threaten the companies with federal investigations into their practices and opening up the US drug market to bring in more imported medications from other countries.\n\nPresident Donald Trump, with Dr Mehmet Oz, Administrator of the Centres for Medicare & Medicaid Services, left, and Health and Human Services Secretary Robert F Kennedy Jr, right, holds an executive order related to drug prices, in the Roosevelt Room of the White House in Washington, Monday, May 12, 2025, in Washington. (AP Photo/Mark Schiefelbein)\n\n\"The pharmaceutical companies make most of their profits from America,\" Trump said.\n\n\"That's not a good thing.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/stocks-sp-500-dow-jones-and-nasdaq-after-us-and-china-announce-90-day-truce-in-trade-war/be4897a3-18f6-4e70-9c57-75fbd4a7c459",
    "title": "Stocks soar after US and China announce 90-day truce in trade war",
    "publish_date": "Mon, 12 May 2025 16:45:47 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "They agreed to take down most of their tariffs that economists warned could start a recession and create shortages on US store shelves.\n\nThe S&P 500 was 2.6 per cent higher in midday trading on Monday (early Tuesday AEST) and back within 5.5 per cent of its all-time high set in February.\n\nTrader Thomas McCauley works on the floor of the New York Stock Exchange on Friday. (AP Photo/Richard Drew)\n\nIt's been roaring higher since falling nearly 20 per cent below the mark last month on hopes that President Donald Trump will lower his tariffs after reaching trade deals with other countries. It's back above where it was on April 2, Trump's \"Liberation Day,\" when he announced stiff worldwide tariffs that ignited worries about a potentially self-inflicted recession.\n\nThe Dow Jones Industrial Average was up 951 points, or 2.3 per cent, as of 11.30am on Monday (1.30am Tuesday, and the Nasdaq composite was 3.5 per cent higher.\n\nIt wasn't just stocks surging following what one analyst called a \"best case scenario\" for US-China tariff talks.\n\nCrude oil prices jumped more than 3 per cent because a global economy less weakened by tariffs would be hungrier for fuel. The value of the US dollar climbed against everything from the euro to the Japanese yen to the Swiss franc.\n\nAnd US Treasury yields jumped on expectations that the Federal Reserve won't have to cut interest rates so deeply this year in order to protect the economy from the damage of tariffs.\n\nOf course, conditions could change quickly again, as Wall Street has seen all too often in Trump's on-again-off-again rollout of tariffs. Plus, the reduction in US and China tariffs will last only 90 days.\n\nPanic on Wall Street as Trump announces new tariffs View Gallery\n\nThat's to give the world's two largest economies time for more talks followed last weekend's negotiations in Geneva, Switzerland, that the US side said had made \"substantial progress\".\n\nUntil then, a joint statement said the United States will cut tariffs on Chinese goods to 30 per cent from as high as 145 per cent.\n\nChina said its tariffs on US goods would fall to 10 per cent from 125 per cent. That follows a deal the US announced last week with the United Kingdom that will bring down tariffs on many UK imports to 10 per cent.\n\nBig challenges remain in the negotiations between China and the US, but the mood nevertheless was ebullient across Wall Street on Monday, and gains were widespread.\n\nGold's price fell as investors felt less need to buy something safe.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/vivid-sydney-2025-dates-events-program-road-closures-everything-you-need-to-know-explainer/ba92cd0d-c874-4066-932f-579bdfc4023a",
    "title": "Everything you need to know about Vivid Sydney 2025",
    "publish_date": "Mon, 12 May 2025 23:23:47 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "V﻿ivid Sydney is just around the corner and will showcase light installations, music performances, food offers and other illuminating experiences.\n\nVivid Sydney, the 15th running of the festival, will start on May 23 and run until June 14 - inspired by the theme \"dream\".\n\nWant to experience it yourself? Here's everything you need to know about Vivid Sydney 2025.﻿\n\nREAD MORE﻿: Vivid reveals 2025 program with more free events but no drone show\n\n\"Everything starts with a dream, a wish, an idea ... ﻿In 2025, Vivid Sydney invites you to dream big,\" festival director Gill Minervini said. (Getty Images/iStockphoto)\n\nWhat date is Vivid Sydney 2025?\n\nVivid Sydney will start on May 23 and run until June 14.\n\nThe Sydney skyline will light up across for the scheduled 23 days starting at 6pm until 11pm.\n\nWhere is Vivid Sydney 2025 and what's on?\n\nVivid Sydney is scattered across multiple locations in Sydney.\n\n﻿The light installations can be found starting at The Goods Line around Haymarket and Ultimo, Darling Harbour, CBD, Barangaroo, Circular Quay and The Rocks.\n\nFor the first time since 2018, Vivid Sydney will also have installations in Martin Place.﻿\n\nA number of Vivid Music events will be taking place including in the Sydney Opera house and at the Carriageworks - and free music events will feature during \"Tumbalong nights\".\n\n﻿Neon Dreams and Vivid Fire Kitchen are the highlights of Vivid Food, along with other food events.\n\nA number of \"idea events\"﻿ are also taking place with a range of free and paid talks and shows.\n\nFor a full program, click here.﻿\n\nMap of the Vivid Sydney 2025 precincts. (Vivid Sydney)\n\nWhat is the theme for Vivid Sydney 2025?\n\nThe theme for this year is \"dream\".\n\n\"Everything starts with a dream, a wish, an idea,\" festival director Gill Minervini said.\n\n﻿\"In 2025, Vivid Sydney invites you to dream big. To go to the outer reaches of your mind, to think differently, without boundaries or preconceptions and to immerse yourself in new experiences and ideas.\"\n\nHow to get to Vivid Sydney 2025﻿\n\nPublic transport services will run to and from the city with extra services for convenient travel.\n\nCommuters will still need to tap on and off at Opal gates as public transport will not be free.\n\nThe public ﻿ is advised to arrive early before the lights at 6pm to avoid congestion caused by road closures and limited parking.\n\nA light installation on the Opera House. (Vivid Sydney / David McDiarmid)\n\nRoad closures and accessibility\n\nDuring the festival, there will be some major road closures and parking restrictions.\n\nRoad closures will be in effect in parts of The Rocks, Dawes Point, Millers Point, Sydney, Haymarket and Ultimo.\n\nRoads will be closed from 5pm and will reopen by 1am﻿ each night.\n\nAdditionally, closures will take place on Fridays and weekends.﻿\n\nFor more information on road closures, click here.\n\nFor information regarding accessibility, updates will be available here.﻿\n\nIs Vivid Sydney 2025 free?\n\nThe festival offers a range of free and paid experiences.\n\n﻿Almost all of the light installations are free, like the Starscape Tunnel by The Goods Line or the Sound Walk in the City Recital Hall.\n\nMost music events will be paid, however there ﻿will be free shows during the Tumbalong Nights at Darling Harbour.\n\nSimilarly, there will be a variety of paid food experiences across the festival.\n\nFor those looking for a more premium option, Vivid Sydney also offers a range of paid experiences like dinner cruises, bar tours and ﻿night paddle kayaking.\n\nREAD MORE:﻿ Demotions and promotions dished out as PM unveils new cabinet\n\nThis year will feature the Starscape Tunnel light installation in the City Recital Hall. (Vivid Sydney / Mandylights)\n\nWhat is replacing the Vivid drone show?\n\nDespite last year's impressive show of more than 1000 drones over six shows, this year will not feature a drone show.\n\nAdvice from NSW Police and Transport for NSW ﻿determined that the \"Vivid Sydney drone shows cannot be staged safely as per last year's format\".\n\nInstead, this year is set to feature a more \"innovative program\", organisers said.\n\nHow crowded does Vivid Sydney get?﻿\n\nLast year, roughly 2.42 million people attended Vivid Sydney across its time.\n\nFridays, Saturdays, Sundays and the Monday public holiday usually attract the largest crowds.\n\nSo be prepared for crowds, plan ahead and stay safe.\n\nFor more information, visit the Vivid Sydney website.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/victoria-drought-crisis-farmer-duncan-barber-reveals-despair-at-ongoing-disaster/23948dff-2553-4399-a47b-1cfb475e2ec6",
    "title": "'Despair': Farmer's plea as drinking water runs out in drought",
    "publish_date": "Mon, 12 May 2025 21:46:03 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Farmers in Victoria are in the middle of an unfolding drought crisis, with the state government urged to take action as families are left in \"despair\".\n\nMetcalfe-based sheep producer Duncan Barber said this drought was the worst he'd seen in 40 years in the area.\n\nHe said so far they'd had just 40ml of rain for the year.\n\nREAD MORE: Gunman on the run after truck driver hospitalised in Sydney ﻿\n\nSheep producer Duncan Barber from Metcalfe, Victoria. (Today)\n\n\"Our last good rain was in November last year,\" he said.\n\nThe family farm's sheep flock was devouring about 50 tonnes of barley a fortnight, with paddocks ground down to dust.\n\nAnd ewes were struggling to birth lambs, with many newborns just abandoned by the battling mothers.﻿\n\nVictoria is in the grip of a vicious drought. (Today)\n\n\"We really need recognition most,\" Barber told Today.\n\n\"We really need the government to stand up and say, yes, Victoria is in a drought.\n\n\"And if they do declare it, then they're going to have to do something about it. They are going to have to have to help us.\"\n\nREAD MORE: Boy with cerebral palsy forced to take truck to hospital ﻿\n\nThe livestock are struggling. (Today)\n\nAll the Australian towns with record-breaking weather events View Gallery\n\nBarber said the current drought was worse than the brutal disaster that hit Australian agriculture around the turn of the millennium.\n\n\"This is the first time that we've actually run out of drinking water,\" he said.\n\n\"You know, it's a hard thing to say.\"﻿\n\nHe said he was committed to keep his family farm going.\n\n\"I mean, they keep telling us, 'yes, it's going to rain'. 'It's going to rain next week',\" he said.\n\n\"But unfortunately, for the last six months, next week hasn't happened.\"﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-qatar-plane-air-force-one-gift-legal-details-still-being-worked-out-white-house-says/7dd5ed33-2b08-493a-869d-3286844a803e",
    "title": "Qatar's offer of new Air Force One a 'security nightmare'",
    "publish_date": "Mon, 12 May 2025 21:04:26 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "White House press secretary Karoline Leavitt said overnight that the legal details on accepting a Boeing 747-8 jet to replace Air Force One as a gift from the Qatari royal family are \"still being worked out.\"\n\n\"Any donation to this government is always done in full compliance with the law,\" she added.\n\nCNN reported yesterday that the Trump administration was set to accept a plane from the Qatari royal family that will be retrofitted and used as Air Force One during the president's second term, according to two people familiar with the agreement.\n\nUS President Donald Trump boards Air Force One upon departure at Morristown Municipal Airport in Morristown, New Jersey. (Mandel Ngan/AFP/Getty Images via CNN)\n\nWhen pressed if she believed this \"gift\" would require something in return, Leavitt responded: \"Absolutely not, because they know President Trump, and they know he only works with the interests of the American public in mind.\"\n\nUS President Donald Trump said that the Defence Department plans to accept the luxury jet as a \"GIFT, FREE OF CHARGE,\" on social media.\n\nHe said the multimillion dollar jet would be used on a temporary basis \"in a very public and transparent transaction.\"\n\nTrump said the plane would be a gift \"free of charge\". (AP Photo/Mark Schiefelbein)\n\nGiven the massive value of a Boeing 747-8, the move is unprecedented and raises substantial ethical and legal questions.\n\nA Qatari official said the plane is technically being gifted from the Qatari Ministry of Defense to the Pentagon, describing it more as a government-to-government transaction instead of a personal one.\n\nThe Defence Department will then retrofit the plane for the president's use with security features and modifications.\n\nThe Qatari government said it was technically a gift to the Pentagon. (Daniel Slim/AFP/Getty Images via CNN Newsource)\n\n\"The possible transfer of an aircraft for temporary use as Air Force One is currently under consideration between Qatar's Ministry of Defence and the US Department of Defence, but the matter remains under review by the respective legal departments, and no decision has been made,\" Ali Al-Ansari, Qatar's media attaché to the US, said Sunday.\n\nWithin the Secret Service, the potential gifting of a plane by a foreign government for presidential use is being viewed as a \"security nightmare,\" a law enforcement source told CNN.\n\n\"The (US Air Force) would have to tear it apart looking for surveillance equipment and inspect the integrity of the plane,\" the source said.\n\nCelebrity Trump supporters now turning on the US president View Gallery\n\nOvernight, Trump defended the plan to accept the jet, describing it as a \"contribution\" and saying he would be a \"stupid person\" if he turned down a free jet.\n\nTrump added that the plane will \"go directly\" to his presidential library after he leaves office.\n\n\"I wouldn't be using it,\" he said.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/melbourne-mother-sues-western-health-after-waking-up-without-both-fallopian-tubes/5e5ddb56-dd59-40f2-9c0a-f9b16cd488ce",
    "title": "Mother sues healthcare provider after waking up without fallopian tubes",
    "publish_date": "Mon, 12 May 2025 08:28:08 +0000",
    "category": "lifestyle",
    "authors": [
      "May"
    ],
    "text": "A﻿ Melbourne woman is suing healthcare provider Western Health over a medical misdiagnosis that left her without fallopian tubes and shattered her dream of having a big family.\n\nLiz and Mouhamad Darwish always wanted to have a big family.\n\nThe couple met 17 years ago﻿ and have three children together. They were overjoyed when they discovered they were expecting another baby in early 2022.\n\nREAD MORE: ﻿ Charlie Teo wants to resume operating in Australia\n\nMelbourne woman Liz Darwish is suing healthcare provider Western Health over a medical misdiagnosis that left her without fallopian tubes and shattered her dream of having a big family. (Nine)\n\nBut, at 10 weeks, Liz noticed some bleeding.\n\nA visit to Bacchus Marsh Hospital confirmed she had suffered a miscarriage.\n\n\"This is life and this is how it is and we have to be thankful for our blessing and sometimes things are out of our hand,\" she told 9News. ﻿\n\nLiz's situation took a dramatic turn about five weeks later.\n\nShe was coming out of the shower one morning when her blood pressure dropped and she lost consciousness up to five times.\n\nHer son﻿s found her lying on the floor.\n\nLiz was rushed to Sunshine Hospital, where she was asked if she was pregnant. ﻿\n\n\"I said no, I wasn't pregnant, I had a cleanout five to six weeks prior in Bacchus Marsh Hospital so there was no chance I was pregnant,\" she said.\n\nREAD MORE: ﻿ Demotions and promotions dished out as PM unveils new cabinet\n\nLiz Darwish feels medical staff failed her. (Nine)\n\nBut it turned out that Liz was still pregnant and ﻿doctors at Bacchus Marsh had missed the ectopic pregnancy in the fallopian tube, which had then ruptured.\n\n\"I was bleeding internally and I just thought, 'I'm not going to make it, I'm not going to make it home',\" she said.\n\n\"I just didn't think I would be able to see my kids again and I thought my daughter's going to grow up without her mum.\"\n\n\"﻿Horrifying to get a phone call suddenly to picture yourself as a single dad, as a widow dad with three young kids,\" Mohammed said.\n\n\"It was horrific, it was absolutely horrific.\"\n\nAgain, Liz felt the medical staff failed her.\n\nShe claimed no one had told her it was an ﻿ectopic pregnancy and she thought she was dying, so told doctors to do whatever was necessary to keep her alive.\n\nWhen she woke up, she was told her fallopian tubes had been removed.\n\nREAD MORE: ﻿ Ryan holds on in Kooyong as flurry of close seats called\n\nThree years later, Liz said she has still not received an explanation from Western Health as to why doctors at Sunshine Hospital had decided to remove both her fallopian tubes when it was a ﻿ruptured ectopic pregnancy that caused the health emergency.\n\n\"It is not usual practice to remove both fallopian tubes when the ectopic pregnancy has only ruptured in one,\" her lawyer, Maryse Andrinopoulos-Tsigolis from Shine Lawyers, said.\n\n\"They got it wrong every step of the way,\" Liz said.\n\n\"All the way from beginning to end, they had it wrong,\" Mohammed said.\n\nAfter waiting years for answers, the couple is now taking legal action against Western Health.\n\n\"With appropriate care, Liz would not have lost either fallopian tube,\" Andrinopoulos-Tsigolis said.\n\n\"This shouldn't have happened, it has had devastating consequences for Liz and is something that could've been solved through a simple laparoscopy.\"﻿\n\nLiz and Mohammed said the medical mistakes have robbed them of growing their family.\n\n\"That choice and that decision was taken away and that's what's hard,\" Liz said.\n\n\"Take accountability and fix what you've done. Fix it so it doesn't happen to anyone else.\"\n\nIn a statement, a Western Health spokesperson said they were \"committed to providing patient-centred, high-quality care and the safety and wellbeing of our patients is our top priority\".\n\n\"For privacy reasons we will not comment on individual patients in response to media enquiries,\" the spokesperson said.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/paradise-falls-victoria-graffiti-sacred-site-vandalised/494c8a6d-4409-495c-bc9e-dda6e91a82b6",
    "title": "Victorian town wakes to find beloved sacred site  vandalised",
    "publish_date": "Mon, 12 May 2025 04:17:21 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "With a population of just over 200, everyone knows everyone in ﻿Cheshunt, Victoria.\n\nBut no one seems to know who ﻿defaced a sacred site at nearby Paradise Falls in the Alpine National Park this weekend.\n\nAlmost two metres tall and several metres wide, the graffiti scrawled across the pristine rock wall appears to be of one or more artists' signatures or 'tags'.\n\nNo one seems to know who ﻿defaced a sacred site at nearby Paradise Falls in the Alpine National Park this weekend. (Supplied)\n\n\"It's shocking. It's so shocking [...] shock is where I think most of the community is today,\" a local who asked not to be named told 9news.com.au.\n\n\"Because when it started circulating last night, I think most people were really hoping that it was going to be photoshopped, that it was a prank.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nLocated about three-and-a-half hours from Melbourne, Paradise Falls ﻿is a popular tourist attraction for its natural beauty.\n\nThe falls cascade from a conglomerate rock formation and the area is considered a sacred women's place by the Bangerang People.\n\nBangerang Country encompasses parts of north-east Victoria and Southern Riverina Murray region of New South Wales and at least ten clan groups form the Bangerang Nation.\n\nA Facebook page titled ﻿'Always Was, Always Will Be, Bpangerang Country' shared a photo of the graffiti on Sunday, calling it \"thoughtless\" and \"disrespectful\".\n\n9news has reached out to the ﻿Bangerang Cultural Centre in Shepparton, Victoria for comment.\n\nThe Cheshunt local 9news spoke to believes the culprits likely waited for the cover of darkness to graffiti the rock wall \"when no one else was around\".\n\n﻿Paradise Falls is a tourist hotspot and is typically packed with visitors on weekends, and the graffiti seemed to appear overnight between Saturday and Sunday.\n\n\"I doubt that it was something that was done in daylight, I think it would have been done at dusk or dawn, or with some lights down there,\" she said.\n\nThe resident also suggested that the vandalism may have been planned, as it likely would have taken multiple cans of paint to cover such a large section of rock wall.﻿\n\n\"You don't just have [...] 20 cans of spray paint in your backpack to randomly decide to do something,\" she claimed.\n\n\"This has been planned.\"\n\nShe and other locals just hope that the paint can be removed without damaging the rock underneath, which has been there for thousands of years.﻿\n\nA Parks Victoria spokesperson told 9news, \"Parks Victoria are aware of the incident at Paradise Falls and we have referred the matter to the authorities.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-13/nsw-metro-station-hunters-street-archaeology-prosper-de-mestre/105285440",
    "title": "Bullet shells and a businessman's home found in Sydney Metro dig",
    "publish_date": "Tue, 13 May 2025 01:58:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "The excavation of what will become Hunter Street Metro station has unearthed archaeological treasures from early Sydney.\n\nArchaeologists discovered sandstock brick footings from the 1820s to 1840s, believed to be the base for prominent businessman, Jean Charles Prosper de Mestre's, home and counting house — a traditional finance office.\n\nDe Mestre grew up in America before he moved to Australia in 1818 and began his working life as a business importer.\n\nGlass and miscellaneous items found in Hunter Street station excavation. (Supplied: NSW government)\n\nHe later went onto be the director of the Bank of New South Wales and his own companies.\n\nSydney Metro West's excavation team made the discovery near the former De Mestre Place, a laneway just off George Street, finding a treasure trove of other relics including glass beads, an 1834 coin, slate pencils and glass bottles.\n\nGun flint and bullet shells, likely from the former George Street Barrack opposite the site, were also notable finds.\n\nThe city's history will be further preserved with the incorporation of the heritage-listed Skinners Family Hotel built in 1845.\n\nSkinner's Family Hotel, corner George and Hunter streets, Sydney in 1849. A watercolour by Andrew Torning. (Supplied: State Library of NSW)\n\nThe Hunter Street metro station will be the final stop on the 24-kilometre Sydney Metro West line, connecting Parramatta to the Sydney CBD from 2032.\n\nSome of de Mestre's descendants met with the project's director Ronan McEleney to view the uncovered relics, some of which will go on display to the public on 18 May.\n\nThe sandstock brick footings believed to be part of prominent Sydney colonial-era merchant Prosper de Mestre's residence and counting house. (Supplied: State Library of NSW)\n\nMr McEleney said the artefacts were being catalogued and analysed by specialists.\n\n\"Special care is being taken to preserve these relics so that future generations can learn more about the Sydney of that era,\" he said.\n\n\" Having the involvement of the de Mestre family and incorporating the Skinners Family Hotel into the metro build are important ways we are ensuring Sydney's heritage is remembered in this historic transport project. \"\n\nNSW Transport Minister John Graham said the government hoped the discoveries \"serve as a reminder of how rich in history the site is\".\n\n\"The Hunter Street metro station project is part of Sydney's future, but these finds are a fascinating window into the city's past,\" he said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-13/dallas-mavericks-nba-draft-lottery-cooper-flagg/105285580",
    "title": "After one of the worst trades in NBA history, Dallas just hit the jackpot",
    "publish_date": "Tue, 13 May 2025 01:25:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "After being roundly mocked for trading away a generational talent in February, the Dallas Mavericks have beaten the odds to grab another one in June.\n\nThe Mavericks and general manager Nico Harrison were pilloried for sending Luka Dončić to the Los Angeles Lakers for Anthony Davis earlier this season, just months after he led Dallas to the 2024 NBA Finals.\n\nBut, after missing the play-offs, the ping-pong balls in the NBA Draft Lottery bailed them out, gifting them the first pick in next month's draft, with Duke sensation Cooper Flagg a lock.\n\nAnd just like that, there is something to root for in Dallas again after a tumultuous few months where Dončić got traded and the Mavs missed the play-offs as Davis suited up for just nine games and the team won 12 of 30 down the stretch.\n\nLuka Dončić and LeBron James were united in LA after a Dallas-Lakers trade in February. (Getty Images: Wally Skalij/Los Angeles Times)\n\nThe Lakers lost 4-1 in the first round to Minnesota.\n\nThe Mavericks only had a 1.8 per cent chance of getting the top pick and were long odds (8.5 per cent) of even falling in the top four, prompting shocked reactions around the league and tears of laughter from Dončić's Lakers teammate LeBron James.\n\nRolando Blackman, a four-time All Star with the Mavericks in the 80s and 90s, was representing the team as the draft order was decided and could not hide his glee when the San Antonio Spurs were read out as the number two pick.\n\nBlackman laughed and clasped his hands together as he shook hands with NBA deputy chief executive Mark Tatum.\n\n\"I am so happy for Mavericks fans,\" Dallas chief executive Rick Welts said, clutching the envelope with the number one emblazoned on it.\n\nDončić trade 'a seismic event in NBA history' Photo shows Rob Pelinka, Luka Doncic and JJ Redick Luka Dončić's controversial move from the Dallas Mavericks to the Los Angeles Lakers shook the NBA's foundations. Here is why the stunning move has such widespread ramifications.\n\n\"I only got to Dallas January 1st this year. February 1st, we broke the internet. I am just amazed at the depth of emotion and connection that the fan base has with this team. And what happened today.\n\n\"I can't imagine a better day for Mavs fans. It's going to really be something special. I can't wait to get back to Dallas.\"\n\nThe Mavs lost 4-1 to the Boston Celtics in the NBA Finals last season, then scorned their fans by trading away Dončić, who clearly did not want to leave as evidenced by the tears he shed when he returned to Dallas as a Laker and the team paid tribute to him.\n\n\"I didn't try to think about it too much,\" Flagg said on the broadcast of the lottery about what it'll likely mean for his immediate future.\n\n\"It was out of my control.\"\n\nCooper Flagg is a consensus top draft pick. (AP: Eric Gay)\n\nIf Miami had lost in the play-in tournament, the Heat would have had the odds that the Mavericks ended up having — so if the ping-pong balls bounced the same way, they would have had the top pick.\n\n\"I mean come on man,\" Heat forward Kevin Love posted on social media when the lottery winner was announced.\n\n\"There is no f***ing way.\"\n\nDallas was so far out of the picture that when Flagg posed with four NBA teams' caps in a promotional shoot before the lottery, it was New Orleans, Charlotte, Washington and Utah.\n\nCharlotte will pick fourth, with the Jazz, Wizards and Pelicans following them in that order on June 26 despite those four teams having the best odds of picking first going into the lottery.\n\nLoading YouTube content\n\nFlagg averaged 19.2 points, 7.5 rebounds and 4.2 assists while leading Duke to the Final Four in his lone college season, and he has had success against NBA players already.\n\nLast summer, when the US Olympic team was holding its training camp in Las Vegas in advance of the Paris Games — where the Americans won gold yet again — Flagg was part of the select team brought in for scrimmages against the Olympians.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nFlagg, who was 17 years old at the time, more than held his own in those workouts.\n\n\"I don't know who we're going to take, but should we take him, I think his resume is pretty strong,\" Welts said.\n\n\"Every time he's put in a situation that everyone wondered if he could succeed, he's succeeded and then some.\"\n\nIt is another boon for the city of Dallas, with the Wings picking college superstar Paige Bueckers with the first pick in the WNBA Draft last month.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-13/eurovision-2025-10-years-of-australia-competing-dami-im-sbs/105281334",
    "title": "From Dami Im to the Milkshake Man: 10 years of Australia in Eurovision",
    "publish_date": "Tue, 13 May 2025 00:48:31 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "It's been 10 years since Australia rocked up at the 2015 Eurovision Song Contest with Guy Sebastian singing the achingly safe and respectable 'Tonight Again' as a wildcard entry.\n\nAnd despite yearly questions of \"why is Australia in Eurovision?\", we're still going.\n\nSure, we've failed to qualify for the grand final twice: the first time in 2021 with Montaigne's layered, if convoluted pop track, 'Technicolour', and last year, with ethereal electro-pop duo Electric Fields' dance anthem, 'One Milkali (One Blood)', sung partly in Language.\n\nBut non-qualifying is a normal part of the Eurovision journey for every competing country — unless you're Ukraine, and have a perfect qualification record.\n\nLoading YouTube content\n\nAnd Australia has also experienced some real Eurovision highs.\n\nThe highest was undoubtedly coming second in 2016 with Dami Im's powerful, timeless ballad 'Sound of Silence' — our best result in the competition so far.\n\nNot only have we cracked the top 10 four more times, we've also brought impressive levels of diversity.\n\nOur representing artists have hailed from the likes of Australian Idol, the Queensland Conservatorium of Music and TikTok, and have been overwhelmingly culturally and ethnically diverse; it wasn't until Kate Miller-Heidke — who came ninth with 'Zero Gravity' in 2019 — that we had a white Australian Eurovision representative.\n\nThere will always be Eurovision purists who argue non-European countries shouldn't be in the contest — Israel and Azerbaijan face complaints, too.\n\nBut a decade in, it's starting to feel like we belong.\n\nWhy is Israel allowed to participate in Eurovision even though Russia was banned? Photo shows A woman in a bandaged-style dres sings into a microphone on a stage with an Israeli and a Russian flag either side of her. Russia was excluded in 2022 after the country invaded Ukraine, so why was Israel still allowed to participate in 2024?\n\nShould we stay in Eurovision, though?\n\n\"I don't think there were any other performances in my life, before or since, that have been that intense … I felt it the whole time,\" says Dami Im of her time on Eurovision in 2016.\n\n\"But when I look back, I feel like it was very special that I got to be a part of something so big.\n\n\"It impacted me on a huge level, like so dramatically. I would say there was me before Eurovision and me after Eurovision. The two Damis are very different to me.\"\n\nNot only was competing in Eurovision \"powerful\" in connecting the Meanjin/Brisbane-based singer-songwriter with a global fan base — it also helped her see something in herself.\n\n\" I thought, 'If I can do this with this much pressure and have this much support from fans globally, I can keep going. So, it was a huge, significant event for me as an artist, and as a person as well. \"\n\nNine years on, she says she's still benefiting from the \"confidence\" boost Eurovision gave her; just last year, Dami took part in Eurovision on Tour, with a string of concerts across the globe. And she's currently recording her seventh studio album.\n\nDami says \"it was a really heavy thought\" she would always be known by the number she placed: \"But it was true.\" (Getty Images: Michael Campanella/WireImage)\n\nJess Carniel has spent the past decade researching the song contest and our place in it. She agrees Eurovision is a great way to showcase Australian talent to a global audience of 163 million people.\n\n\"Now, we've got fans of Australian artists living in Portugal and Brazil and Sweden and China, and they've got access to these artists watching Eurovision,\" the associate professor in humanities at the University of South Queensland explains.\n\nAnd beyond the kitsch, the drinking games and the joy that is Europop, she says there are many more cultural and political reasons why direct involvement in Eurovision is important for Australia.\n\n\"Once we started participating in Eurovision, it became this really interesting way of feeling connected to the rest of the world. That's a recurring theme in my research.\"\n\nLoading YouTube content\n\nCarniel says that connection isn't about our \"European roots\" (\"Australians from a diverse range of backgrounds love Eurovision\"), but forging new cultural and political ties.\n\n\"Especially in this political climate, where our major military partner [the United States] is going off the rails, we need to make sure we're situated in the world in a different way,\" she explains.\n\n\" All the hard-power stuff — the nuclear submarines and trade deals and everything — are really important, but the soft power that Eurovision offers is also important. \"\n\nThe birth and death of Eurovision — Australia Decides\n\nGuy and Dami, as well as their successors, Isaiah and Jessica Mauboy, were all chosen internally by SBS.\n\nThe broadcaster changed things up in 2019, opening the selection process to the Australian public with a national competition.\n\nSet on the Gold Coast, Eurovision — Australia Decides was a game-changer for fans who struggle to make it to Europe for the main event, the local economy and up-and-coming artists.\n\nBut SBS canned the national contest — which crowned Kate Miller-Heidke, Montaigne and Sheldon Riley — after just three editions.\n\nLoading YouTube content\n\nThe organisation told TV Tonight in 2022: \"A variety of factors contributed to us coming to this decision.\"\n\n\"My understanding is it came down to [the fact] their licensing deal to use the word 'Eurovision' had expired, and apparently running the event was very expensive,\" Carniel says.\n\nShe thinks it's \"really, really sad\" the national competition was scrapped, because it was worthwhile for domestic audiences and brought \"quite a bit to the Gold Coast economy\".\n\n\"And it wasn't just Australians watching it. Someone like Jaguar Jonze has fans around the world, not because she represented us in Eurovision, but because she was part of the national selection,\" Carniel says.\n\nEven the internally selected Dami wants to see Eurovision — Australia Decides return.\n\n'Do I eat or do I make art?' Australian artists among worst-paid workers Photo shows Madeleine Thornton-Smith, a young woman, smiles in a gallery space, in front of a tapestry that reads \"Union of Working Artists\" A new study of more than 900 Australian artists and arts workers has found poor working conditions and pay are widespread throughout the industry.\n\n\"In Australia, we don't get a lot of opportunities to showcase our music [and] being in the music industry is really, really difficult,\" she says.\n\nBut Emily Griggs, head of the Australian delegation and SBS Entertainment, says SBS has no plans to resume the national competition \"any time soon\".\n\nSince returning to an internal selection process in 2023, SBS has sent two Eurovision — Australia Decides runners-up to represent Australia: Voyager, followed by Electric Fields.\n\nFor 2025, the broadcaster selected Go-Jo — a relatively unknown artist who built a following on TikTok and who will represent Australia with 'Milkshake Man'.\n\nLoading YouTube content\n\nWhere to from here?\n\nCarniel may have dedicated the past decade of her life to researching Australia's involvement in Eurovision, but she's actually \"really, really surprised\" we're competing this year.\n\n\"I felt that last year, the late announcement of Electric Fields, and the fact [SBS] had selected Electric Fields at all, was a swan song,\" she says.\n\nThen came the announcement longtime Australian hosts Myf Warhurst and Joel Creasey would not return, adding to the sense \"we were just in this weird limbo land\".\n\nCountry WA town proud to see homegrown star Go-Jo in Eurovision Photo shows A curly haired man, wears red, white striped tee, jeans leans back on one leg, arms out, hairy underarms. As Go-Jo gears up to represent Australia at Eurovision, he has become the talk of the town in the country community he grew up.\n\nTheir replacements, Courtney Act and Tony Armstrong, were announced just over a month before the 2025 contest.\n\n\"It feels like there isn't the same kind of investment and level of energy there was when we first started, from SBS's side,\" Carniel says.\n\n\"I think SBS needs to demonstrate their commitment a little bit more than they have in the past few years, by keeping us in the loop a little bit more around their plans and decision-making processes.\n\n\" When there's that silence, people get really, really worried and think: 'Well, this is the end of it.' \"\n\nThere's no confirmation yet of our continued participation beyond this year; Australia currently relies on an annual invitation to compete in the contest.\n\nWhile she won't reveal specific figures (\"Eurovision is about much more than dollars and cents\"), Griggs says SBS's \"investment in Eurovision has naturally evolved over the years … as with any major production\", and that the broadcaster's commitment to the contest \"remains unwavering\".\n\nFar from the end some local fans and experts like Carniel fear, she sees 2025 as the beginning of a \"new chapter\" for Australia in Eurovision.\n\n\" With this revived energy, we will remain true to the incredible Aussie spirit that has always seen us stand out. \"\n\nThe Eurovision Song Contest airs live and in prime time from May 14-18 exclusively on SBS and SBS On Demand.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-13/erin-patterson-mushroom-murder-trial-jury-hears-court-evidence/105285362",
    "title": "Live: Doctors who examined Erin Patterson give murder trial evidence",
    "publish_date": "Tue, 13 May 2025 00:20:24 +0000",
    "category": "lifestyle",
    "authors": [
      "Tim Callanan",
      "Judd Boaz",
      "Kristian Silva"
    ],
    "text": "Dr Varuna Ruggoo, another medical practitioner working at Monash Health, is the next witness in the box.\n\nShe was an emergency physician at the emergency department in the days following the lunch, and was involved in the care of Erin Patterson on August 1.\n\nDr Ruggoo says Erin had received IV fluids throughout the night, as well as the drug NAC for perceived liver issues.\n\nA liver function test found Erin's liver health to be \"all within normal limits\", she says.\n\nAt 10:14am, a review found her blood tests and vital signs showed no sign of liver toxicity, and that Erin was able to be discharged.\n\nDr Ruggoo tells the court that notes from Dr Muldoon had indicated that Erin was not suffering from amanita phalloides — death cap mushroom — poisoning.\n\n\"She wrote in her notes that there was no concern about that type of poisoning,\" Dr Ruggoo says.\n\nShe tells the court Erin indicated she had not vomited or experienced diarrhoea at all in the time before she was handed over to Dr Ruggoo earlier in the morning, and had eaten lunch before seeing the doctor.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-13/indigenous-language-taught-in-outback-classrooms/105280598",
    "title": "Gulf students ask to be taught Gangalidda instead of Japanese",
    "publish_date": "Mon, 12 May 2025 23:29:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Mayarr Yanner attended primary school more than a decade ago in Queensland's Gulf of Carpentaria she was taught Japanese.\n\nHer peers at Burketown State School, most of whom were Aboriginal, asked why.\n\n\"We all used to ask, 'Why are we learning Japanese?' None of us are going to go to Japan,\" Ms Yanner said.\n\nAs a high-schooler at boarding school on the Gold Coast her peers asked if she knew her Indigenous language from back home.\n\n\"I would say, 'I know a bit', but I wish I had the privilege of saying that I'm fluent in it,\" she said.\n\nKaren Ford and Mayarr Yanner have worked together to develop learning material. (Supplied: Chris Ford)\n\nNow 22 years of age, Ms Yanner has returned to Burketown and not only does she know much more of the Gangalidda language — she teaches it.\n\nHer role as partnership initiative officer and language teacher at Burketown State School includes delivering the Gangalidda language other than English (LOTE) program.\n\nLanguage used everywhere, every day\n\nKaren Ford is head of curriculum at Burketown State School where more than 90 per cent of students are Indigenous.\n\nWorking closely with the community, she co-designed the Gangalidda LOTE subject within the Australian curriculum.\n\n\"We really needed to make sure we had all the protocols right,\" Ms Ford said.\n\n\" It acknowledges that the ancestral owners of the language are the teachers of the language, and therefore it needs to be taught in Indigenous ways of knowing and learning. \"\n\nMayarr Yanner has used the Gangalidda dictionary to develop her classroom materials. (Supplied: Mayarr Yanner)\n\nThe school started teaching non-assessable content in 2017 and developed an official curriculum by 2019.\n\nThe program has been cemented this year by hiring Ms Yanner, a Gangalidda woman, as its language teacher.\n\nLOTE lessons are on a Monday, but the language is on display every day.\n\n\"If you walk around Burketown State School you'll see not just English names for things but you'll also see them in language,\" Ms Ford said.\n\nIn early primary, students learn key words and phrases:\n\ngayi — hello\n\nmayara — friend/countrymen\n\nngada — my name is …\n\nMunkubayi — Burketown\n\nFor upper primary they have developed a junior ranger program, where Indigenous rangers deliver activities using the Gangalidda language on country.\n\nThis extends to the school's cultural sustainability garden, where they learn about medicinal plants and bush tucker.\n\nMore schools to follow\n\nThe Burketown State School program is being presented across Queensland as a model for other schools to consider.\n\nSchool staff recently travelled to the 2025 Gimuy First Nations Languages Workshop in Cairns and will soon attend the North Queensland Region Partnership Initiative Conference Townsville to encourage other schools to develop their own Indigenous LOTE programs.\n\nMurrandoo Yanner speaking at the 2025 Gimuy First Nations Languages Workshop. (Supplied: Michael Vesotsky)\n\nAs of 2024, 152 state schools were investigating, developing or implementing an Aboriginal language program or a Torres Strait Islander language program, according to the Department of Education.\n\nMossman, Yarrabah and Aurukun state schools all teach an Aboriginal or Torres Strait Islander language.\n\nAn ancient dictionary\n\nElder Murrandoo Yanner, the lead cultural consultant for the program, said a decades-old Gangalidda dictionary was crucial to its development.\n\nMore teacher training on Indigenous language Photo shows A group of pre primary students sit on the mat with their teacher smiling at the camera Since the early 1990s Aboriginal English has been recognised as one of over 160 official dialects of English.\n\n\"We had a lot of fluid speakers still in the tribe in the 1990s. Before they passed on we had our dictionary recorded, both in writing and recording, for the proper pronunciation,\" Mr Yanner said.\n\n\"A lot of senior elders from the Gangalidda people over the years … contributed.\"\n\nThe dictionary is comprehensive, including many variations that exist in the Gangalidda language.\n\n\"There's not a single word for crocodile — [there's] a crocodile, a female crocodile, male crocodile, saltwater crocodile, fresh crocodile, juvenile crocodile,\" Mr Yanner said.\n\nLanguage is sacred to Mr Yanner and the Gangalidda people.\n\n\"If you're on Gangalidda country and you speak Gangalidda, it unlocks all these magical things on country because that country recognises the language that belongs to it,\" he said.\n\nThe Gangalidda language on display on the school's totems. (Supplied: Chris Ford)\n\nA spokesperson for the Department of Education said teaching Aboriginal and Torres Strait Islander languages could help increase school attendance and improve academic engagement — a sentiment shared by Mr Yanner.\n\n\"I think we'll make better, brighter children … for this community,\" he said.\n\nSeeing his daughter Mayarr Yanner return to Burketown to teach the language has filled him with pride.\n\n\"Language is a part of our culture, and my identity, so it feels good to be able to reconnect,\" Ms Yanner said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-13/australian-players-ipl-resuming-india-pakistan-ceasefire/105285284",
    "title": "'A lot of anxiety' as Australian players decide whether to return to IPL",
    "publish_date": "Mon, 12 May 2025 23:20:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Indian Premier League is to resume this weekend leaving the many Australians involved with tough decisions to make.\n\nCricket's richest competition was suspended on Friday May 9 amid fighting between India and Pakistan but will resume on Saturday after the announcement of a ceasefire between the nuclear-armed neighbours.\n\nA number of Australians are involved as players, coaching staff and commentators and most have left India, returning home over the weekend.\n\nNow they must decide whether they are able, and wish to, return.\n\nPat Cummins was reunited with his wife and children back in Australia. (Instagram: Becky Cummins)\n\nMany were shaken by events leading to the postponement and several have other commitments.\n\nCricket Australia said it \"will support players in their individual decisions whether to return to India or not\".\n\nMost notable of these is the the World Test Championship (WTC) final against South Africa, which starts at Lord's on June 11, barely a week after the rescheduled IPL final on June 3.\n\nThe IPL still has 13 group matches left, including the fixture between Ricky Ponting's Punjab Kings and Mitchell Starc's Delhi Capitals, which was called off during the first innings on May 8 as air-raid sirens wailed nearby.\n\nIndia has only 'paused' military action against Pakistan, Modi says Photo shows A man with white hair and white beard wearing frameless glasses looks sternly away from the camera In a national address, Narendra Modi also vowed to take retaliatory action for any future terror attacks.\n\nAustralia women's captain Alyssa Healy was in India with husband Starc and arrived home with him on Sunday.\n\n\"There was a lot of anxiety around the Australian group because we didn't have a whole heap of information as to what was going on,\" Healy told the Willow Talk podcast.\n\n\"That's probably been the really interesting and probably the scariest part of this whole situation is the misinformation.\n\n\"Quite close to what's being fought over, but we were assured everything was fine: 'Everything is OK, it's miles away, the game will go ahead and everything will be fine.'\"\n\nThe match that will resume the tournament will be played between Royal Challengers Bengaluru (RCB) and Kolkata Knight Riders on May 17 in Bengaluru.\n\nJosh Hazlewood plays for RCB, but has been nursing a shoulder injury and missed their most recent match. He is expected to be fit for Lord's.\n\nHazlewood, Starc, captain Pat Cummins, Travis head and Josh Inglis are among the possible Australian WTC players in IPL teams.\n\nCummins and Head play for Sunrisers Hyderabad, which are out of play-off contention even though they have three matches remaining, but Inglis's Punjab, Starc's Delhi, and Marsh's Lucknow Super Giants remain in the frame.\n\nOther high-profile Australians involved include Justin Langer, coach at Lucknow, Ponting's assistant Brad Haddin, Chennai batting coach Mike Hussey, and commentators Matthew Hayden and Mel Jones.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPonting and Haddin are understood to have remained in India.\n\n\"After extensive consultations with government and security agencies, and with all the key stakeholders, the Board has decided to proceed with the remainder of the season,\" India's cricket board (BCCI) said in a statement.\n\nThe Pakistan Super League, which includes David Warner among the participants, is also expected to announce a resumption imminently, though many of the overseas players are reported to be unlikely to return, in part due to other commitments.\n\nIndia and Pakistan have clashed since India struck multiple locations in Pakistan that it said were \"terrorist camps\" in retaliation for the deadly attack in its troubled region of Kashmir last month, in which it said Islamabad was involved.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/AP/Reuters",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-13/measles-cases-across-the-country-highest-we-ve-seen-in-six-years/105280894",
    "title": "Measles cases across the country highest we've seen in six years",
    "publish_date": "Mon, 12 May 2025 23:13:28 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Measles cases have reached the highest number of infections nationwide in six years.\n\nThe National Notifiable Disease Surveillance System shows 71 measles cases have been reported across the country this year so far.\n\nThis already exceeds the total for 2024 and is the highest number recorded since 2019, when there were 284 cases.\n\nThis year, 14 cases were reported in people aged 25-29 years old, and children aged 0-4 years old had the second highest number of infections recorded.\n\nIn 2025, Victoria had recorded 26 infections, New South Wales 21, and Western Australia 18.\n\nHealth officials have issued a nationwide call to prevent the spread.\n\nWhy are we seeing more measles cases?\n\nMeasles outbreaks in US surpass 1,000 cases Photo shows measles virus particle The Centers for Disease Control and Prevention says 14 outbreaks have been recorded this year, with 93 per cent of confirmed cases being outbreak-associated.\n\nIn April, medical professionals urged travellers to stay vigilant amid a global rise in cases in the United States and other parts of the world.\n\nRamya Raman, the Royal Australian College of General Practitioners vice-president and Western Australia chair, told the ABC the rise in cases could be because people were travelling overseas more frequently.\n\nThe vaccination rate could also be a contributing factor, Dr Raman said.\n\n\"We are below the 95 per cent vaccination rate that we need for herd immunity, so overseas arrivals and local infection spreading and the infectiousness of the actual condition is probably all contributing to that,\" she said.\n\nUnvaccinated and partially vaccinated\n\nThe measles virus has not been widely circulating in Australia for some time, largely due to many people already receiving double dose vaccinations, reducing the chances of catching the virus.\n\nStudies suggest that one bout of measles usually results in lifelong immunity\n\nTwo doses of the MMR (Mumps, Measles, and Rubella) vaccine was introduced to the national childhood immunisation schedule in the early 90s.\n\nBut Australians born before then might have received only one dose and be \"partially vaccinated\", Dr Raman said.\n\n\"If you were born after 1965 and haven't already had two doses of the measles, mumps, and rubella vaccine, you can get up to two free MMR vaccinations through your GP,\" she said.\n\nWhat are the symptoms of Measles?\n\nMeasles cases around the world are on the rise. (Supplied: WA Department of Health)\n\nMeasles is a highly infectious, itchy rash with a fever, which typically affects children, but medicos are now seeing a spike in older age groups.\n\nPeople struck down with measles usually have a rash and flu-like symptoms.\n\nIt begins with the \"prodrome phase\" which lasts about two to four days.\n\nWhat is the measles? Photo shows A boy with a third day measles rash. Australia was declared measles-free in 2014, but imported cases are still sometimes diagnosed. So, what does it do to your body, and what sort of threat can it pose to the population?\n\nA person can experience a fever that exceeds 38 degrees Celsius, as well as a cough, runny nose and conjunctivitis — redness and swelling of the eyes.\n\n\"Often, patients look quite unwell during this time as well, and then as the illness progresses, the rash starts,\" Dr Raman said.\n\nThe measles rash usually begins three to five days after the prodrome phase.\n\nThe rash is usually red, and raised, and can be flat. It typically starts on the face, around the hairline, and then spreads down into the neck, the trunk, the arms, legs, and feet.\n\n\"[The measles rash] is initially spotty, then merges over time to become blotchy patches. And it's always a little bit trickier to see these spots on patients with darker skin tones,\" Dr Raman said.\n\nCalls for preventive measures\n\nMeasles can be a nasty virus, especially for the vulnerable, elderly or immunocompromised.\n\nThe Australian Immunisation Handbook recommends vaccination for people born during or since 1966 who have not received the two doses, particularly healthcare workers, childhood educators, and carers.\n\nDr Raman suggests pregnant women should not get the vaccine but instead speak with their GP.\n\nShe said it was important to see a healthcare professional if you suspect you have the measles to prevent its spread.\n\n\"This is a highly contagious virus, but it's also important for patients to seek medical attention if they're not feeling quite well.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/national/victoria/piedimonte-s-inches-closer-to-revamp-as-council-votes-on-laneway-sale-20250507-p5lxet.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Piedimonte’s inches closer to revamp as council votes on laneway sale",
    "publish_date": "Tue, 13 May 2025 11:58:30 +1000",
    "category": "finance",
    "authors": [
      "Lachlan Abbott"
    ],
    "text": "The contentious and long-stalled revamp of an iconic supermarket in Melbourne’s inner north may be about to clear a final hurdle as the council votes on whether to sell a crucial piece of public land to the developers.\n\nOn Tuesday night, Yarra City Council will decide whether to start consultation to sell part of a laneway behind Piedimonte’s Supermarket in Fitzroy North, which developers need to transform the site.\n\nAnne Coveny (front), secretary of Protect Fitzroy North, with locals who oppose the sale of a bluestone laneway to make way for the Piedimonte’s Supermarket redevelopment. Credit: Paul Jeffers\n\nThe Piedimonte family won approval to redevelop their eponymous supermarket off St Georges Road into a five-storey complex in May 2021, despite council opposition and more than 600 residents objecting.\n\nBut the approved plans still require the purchase of a council-owned lane to connect separate sites on Scotchmer Street and facilitate the supermarket renovation and to add 66 apartments, a roof terrace, cafe and three levels of underground parking.",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/national/queensland/last-resort-council-threatens-toll-to-pay-for-story-bridge-repairs-20250513-p5lynr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Last resort’: Council threatens toll to pay for Story Bridge repairs",
    "publish_date": "Tue, 13 May 2025 11:58:10 +1000",
    "category": "finance",
    "authors": [
      "Catherine Strohfeldt"
    ],
    "text": "A toll or levy for motorists using Story Bridge has been threatened as Brisbane City Council prepares to make another bid for state and federal funding to complete “significant” restoration work.\n\nAn independent report commissioned by the council found the 85-year-old structure required a 15-year period of continued work.\n\nLord Mayor Adrian Schrinner told 4BC’s Peter Fegan a toll or levy was a “100 per cent no from council”, but costs for repairs exceeded the budget.\n\nRestoration work is done on Story Bridge in Brisbane. Credit: Brisbane City Council\n\nHe said that without government help, the council could be forced to consider options, including an annual rates levy, toll or private sponsorship to fund the restoration.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/money/planning-and-budgeting/why-short-term-thinking-won-t-build-long-lasting-wealth-20250513-p5lyqd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why short-term thinking won’t build long-lasting wealth",
    "publish_date": "Tue, 13 May 2025 11:52:45 +1000",
    "category": "finance",
    "authors": [
      "Paridhi Jain"
    ],
    "text": "Here are a few examples of what that looks like. Short-term v long-term thinking Loading One of the most underrated financial skills is the ability to think long-term. I’m not talking in months or even years, but decades. Here’s the difference in what that sounds like: Short-term: “I need to get on the property ladder as soon as possible.” Long-term: “I want to buy a property I’m happy to hang onto for a couple of decades.”\n\nShort-term: “What can I invest in that will give me X per cent return in one to two years?” Long-term: “What can I invest in that will still be a quality investment five, 10, 20 years from now?” Long-term thinking is harder – it takes more patience and delivers less instant gratification. You have to move away from wanting fast results to wanting results that last. Taking the time to create a streamlined savings system won’t deliver the quick wins that chasing after savings hacks will, but it will deliver bigger, more sustainable results long-term. Building wealth is a long-term game. Credit: Getty Images Taking the time to buy a property with your long-term goals in mind won’t satisfy the urgent desire to ‘get on the property ladder’ now, but it will pay off big-time in a few decades.\n\nFundamentally, wealth is a long-term game. No short-term quick wins will pay off as much as stretching your ability to think long-term in your financial decision-making. Security v opportunity Are you acquiring wealth for security or for opportunity? For most, the drive to earn more, save more and invest more is rooted in a desire for security. This can be a lifelong journey that doesn’t end until you have a fully paid-off house and enough assets to retire. Even then you can still be worried about running out of money. Instead, what if you started asking, “What are the opportunities that wealth can make available to me?” This takes you on a totally different journey to “How do I create financial security?”\n\nOne takes you on a cautious journey where the acquisition of wealth is the end goal. The other opens up possibilities, with wealth being a resource for creating a richer experience of life. ‘Right decision’ v ‘right for me’ Loading Initially, you might be fixated on making the ‘right’ move. What’s the ‘best’ investment? Should I buy a property or invest in shares? If there’s going to be a market crash, should I sell my investments or ride it out? The thing is, there isn’t one single correct answer. It’s better to think of there being core principles, and you get to choose how you apply those principles to your life.\n\nYou can be financially successful whether you invest in property or shares; whether you buy a property now or rentvest now; whether you invest inside or outside superannuation. Many choices can be a good choice – so it’s not about trying to determine one universally correct answer but picking the right choice for you. This requires having the self-awareness to know what’s the right choice for you – and the self-trust to back that choice, even when others appear to be succeeding faster on another path. Often, we get caught up in trying to improve financial results by taking different actions. Chasing a new strategy, trying a new tool, jumping onto the latest investment fad. But better financial results come down to one thing: better decision-making. And better decisions start with better thinking. This is a skill you can learn – and when you do, financial growth won’t be something you need to chase. It will be inevitable.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/politics/federal/every-seat-that-changed-hands-and-those-that-are-still-in-doubt-20250502-p5lw3y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "These are the four seats still too close to call – and 18 that changed hands",
    "publish_date": "Tue, 13 May 2025 11:48:53 +1000",
    "category": "finance",
    "authors": [
      "Millie Muroi",
      "Matt Wade",
      "Olivia Ireland"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nFour seats across the nation remain too close to call as the margins in some high-profile electoral battles narrowed to double digits.\n\nTwo contests between Liberals and teal independents – in Sydney’s Bradfield and Melbourne’s Kooyong – were called on Monday by this masthead’s decision desk for Gisele Kapterian and Monique Ryan respectively.\n\nElsewhere on Monday, the seats of Bean (ACT) and Fisher (QLD) were called and have been retained by Labor and the LNP respectively. On Tuesday morning, Monash was retained by the Coalition.\n\nWe will continue to update this story as soon as every remaining seat is called – and you can stay up to date on the results page.\n\nEvery seat still too close to call\n\nCalwell\n\nHeld by now-retired Labor veteran Maria Vamvakinou for more than two decades, this working-class north suburban seat should have been safe.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/eels-won-t-rush-blues-hopeful-lomax-back-because-of-origin-20250513-p5lyof.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Eels won’t rush Blues hopeful Lomax back because of Origin",
    "publish_date": "Tue, 13 May 2025 11:45:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Zac Lomax will on Tuesday afternoon be named to return from a foot injury on the wing for Parramatta, but faces a fitness test on Wednesday that will have repercussions for both the Eels and NSW Blues.\n\nCoach Jason Ryles confirmed Lomax was set to play his first game since breaking a bone in his foot against his former club, St George Illawarra, in round five. An already injured Lomax slotted the winning field-goal in golden point that afternoon.\n\n“If he gets through Wednesday’s training, which we expect him to, he’ll play,” Ryles said.\n\n“If there’s the slightest bit of [concern], we’ll put him on ice for the week.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/kohli-was-the-face-of-the-new-bold-and-brash-india-20250513-p5lyo7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kohli was the face of the new bold and brash India",
    "publish_date": "Tue, 13 May 2025 11:44:57 +1000",
    "category": "sports",
    "authors": [
      "Greg Chappell"
    ],
    "text": "Virat Kohli’s retirement from Test cricket marks the end of a thunderous era - a reign forged in grit, fire, and audacity.\n\nIt closes the chapter on the most transformative figure in Indian cricket since Sachin Tendulkar - perhaps even eclipsing him in terms of cultural influence and psychological impact on India’s identity. Certainly, there is no other cricketer Australian crowds loved to stir more - ironically, a sign of esteem.\n\nKohli, the incandescent heart of Indian cricket for more than a decade, did not just score runs. He redefined expectations, challenged conventions, and symbolised the self-assured, unapologetic India of the 21st century. His departure leaves not only a statistical void, but a seismic shift in energy - for there has never been another quite like him.\n\nThere was a time when Indian cricket, particularly overseas, bore the air of respectful submission - playing with technical skill, yes, but often with psychological inferiority. That changed in stages. Sourav Ganguly gave it a new spine. MS Dhoni brought ice-cold leadership and white-ball dominance. But Kohli? Kohli lit the fire. He tore the script and authored a new one where India was not just competitive abroad - it expected to win.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/maroons-star-confident-ahead-of-game-two-20250513-p5lyr8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Maroons star confident ahead of game two",
    "publish_date": "Tue, 13 May 2025 11:29:32 +1000",
    "category": "sports",
    "authors": [],
    "text": "Maroons star confident ahead of game two\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-jump-wall-street-soars-after-us-china-trade-war-truce-20250513-p5lymg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX jumps after Wall Street soared on US-China trade war truce",
    "publish_date": "Tue, 13 May 2025 11:13:01 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket jumped in early trade, following a rally on Wall Street after China and the United States announced a 90-day truce in their trade war and agreed to temporarily reduce tariffs on each other’s goods.\n\nThe S&P/ASX 200 was up 55.5 points, or 0.7 per cent, to 8289 as of 10.50am AEST, having jumped above 8300 in the first half hour of trading. Seven of the 11 industry sectors advanced, led by mining companies, retailers, IT and energy stocks, while more defensive sectors such as utilities and telecommunications declined. The Australian dollar softened to US63.69¢.\n\nUS stocks soared on the news of a 90-day truce in the trade war, setting the tone for the Australian market. Credit: Bloomberg\n\nAustralia’s iron ore heavyweights advanced after prices for the metal jumped 3.2 per cent to $US100 a tonne overnight as the Trump administration dramatically slashed its crippling tariffs on imports from China, limiting the immediate damage on Australia’s biggest export market. BHP shares climbed 2.3 per cent, Fortescue was up 2.7 per cent and Rio Tinto gained 1.4 per cent.\n\nThe materials sector’s gains were limited, however, by heavy falls in gold miners as prices for bullion dropped overnight as investors felt less need to buy something safe. Northern Star Resources (down 5.7 per cent), Evolution Mining (down 6.6 per cent) and Newmont (down 3.7 per cent) all slumped.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/money/investing/why-these-vintage-toys-are-too-valuable-to-play-with-20250513-p5lyp1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why these vintage toys are too valuable to play with",
    "publish_date": "Tue, 13 May 2025 11:10:40 +1000",
    "category": "finance",
    "authors": [
      "Stephen Crafti"
    ],
    "text": "Toys are a touchstone to one’s childhood – either for toys one had or, just as often, things that were considered by parents “too top shelf” to consider purchasing for their children.\n\nDecades later, seeing that same toy rekindles that connection and, in some instances, triggers the start of a vintage toy collection. From French and German bisque (porcelain) dolls produced from the 1860s through to Barbie dolls released a century later, the market continually changes – as do the prices.\n\n“Failed dolls”, vintage Barbies, and push pedal cards are all among vintage toys fetching a high price today.\n\nGraeme Horne has been at the helm of Abbingdon Auctions Australia for the last 30 years – his focus is on dolls, bears, toys and collectables. Three auctions are held each year at his Wantirna South headquarters, an outer suburb of Melbourne.\n\nWhile prices fluctuate so does the demographic. “Many of our older customers started collecting bisque dolls many years ago, while our younger clients, young women in their 20s to 30s, gravitate to Barbie dolls from the 1960s and the Monster High dolls from the early 1980s (more goth or punk with two-tone coloured hair and thick eyeliner),” says Horne, who sells these to his main markets – New Zealand, Singapore, the United States and the United Kingdom.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/victoria/security-boost-for-the-cbd-as-budget-squeeze-puts-brakes-on-other-ambitious-plans-20250513-p5lypg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Security boost for the CBD as budget squeeze puts brakes on other ambitious election promises",
    "publish_date": "Tue, 13 May 2025 11:03:09 +1000",
    "category": "finance",
    "authors": [
      "Cara Waters",
      "Sophie Aubrey"
    ],
    "text": "Public safety in the CBD will get a $4.5 million boost for more security guards, extra CCTV and lighting as part of the City of Melbourne’s budget, but many of Lord Mayor Nick Reece’s other election pledges remain unfunded.\n\nThe $732 million draft budget unveiled on Tuesday records a small $150,000 surplus with a repayment plan to reduce the council’s debt from $212 million this financial year to zero in seven years.\n\nThe council has put aside $4.5m on security measures for the city. Credit: Wayne Taylor\n\nThe budget pours $2 million into the council’s controversial security team to put “more boots on the ground”.\n\nIt also includes $2.1 million to upgrade and expand the city’s CCTV, activating more than 100 new cameras, and $1 million to light up the city’s laneways.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-ceo-of-palliative-care-australia/1v5h36ab7",
    "title": "INTERVIEW: CEO of Palliative Care Australia",
    "publish_date": "Mon, 12 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Camilla Rowland is the CEO of Palliative Care Australia and has worked in the Australian health and community service sectors for more than thirty years. She's talking to SBS's Jennifer Scherer.\n\n\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/video/eurovision-begins-amid-political-controversy/61vsj1hds",
    "title": "Eurovision begins amid political controversy",
    "publish_date": "Mon, 12 May 2025 10:57:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Eurovision begins amid political controversy\n\nPublished 12 May 2025, 7:51 am\n\nTens of millions of people will soon be glued to their screens for the world's most watched entertainment show. This year's theme for the Eurovision Song Contest is \"United by Music\" and is being held in Switzerland but a controversial inclusion has cast a shadow over the opening ceremony.",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/video/breaking-taboos-surrounding-menstrual-bleeding-and-womens-health/mky6sk90m",
    "title": "Breaking taboos surrounding menstrual bleeding and women's health",
    "publish_date": "Mon, 12 May 2025 10:52:15 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Breaking taboos surrounding menstrual bleeding and women's health\n\nPublished 12 May 2025, 7:55 am\n\nHeavy menstrual bleeding affects one out of four women Australia-wide but is often excluded from discussions around women's health. While many have celebrated the government's $793 million investment into women's health, there's been no specific reference to this condition. That's prompting calls for a change in terminology to challenge taboos.",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/video/sparking-conversations-around-culturally-appropriate-end-of-life-care/jc1hw2usv",
    "title": "Sparking conversations around culturally appropriate end-of-life care",
    "publish_date": "Mon, 12 May 2025 10:43:31 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Sparking conversations around culturally appropriate end-of-life care\n\nPublished 12 May 2025, 9:03 am\n\nAs a family member approaches the end of their life, people in migrant communities can face special challenges. Culturally appropriate customs and traditions related to death and dying are a focus in National Palliative Care Week, now in its 30th year. This story has been produced in collaboration with SBS Greek.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/david-littleproud-will-stay-on-as-nationals-leader/l1u0qzc1f",
    "title": "David Littleproud will stay on as Nationals leader",
    "publish_date": "Mon, 12 May 2025 09:09:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/prime-minister-to-attend-pope-leos-inauguration/lhq4x01il",
    "title": "Prime Minister to attend Pope Leo’s inauguration",
    "publish_date": "Mon, 12 May 2025 09:08:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/new-assistant-minister-portfolio-created-for-international-education/yn1rg7a90",
    "title": "New assistant minister portfolio created for international education",
    "publish_date": "Mon, 12 May 2025 09:07:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/is-a-supermarket-price-war-on-the-horizon/d4oy4dywi",
    "title": "Is a supermarket price war on the horizon?",
    "publish_date": "Mon, 12 May 2025 07:38:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/victoria/piedimonte-s-inches-closer-to-revamp-as-council-votes-on-laneway-sale-20250507-p5lxet.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Piedimonte’s inches closer to revamp as council votes on laneway sale",
    "publish_date": "Tue, 13 May 2025 11:58:30 +1000",
    "category": "finance",
    "authors": [
      "Lachlan Abbott"
    ],
    "text": "The contentious and long-stalled revamp of an iconic supermarket in Melbourne’s inner north may be about to clear a final hurdle as the council votes on whether to sell a crucial piece of public land to the developers.\n\nOn Tuesday night, Yarra City Council will decide whether to start consultation to sell part of a laneway behind Piedimonte’s Supermarket in Fitzroy North, which developers need to transform the site.\n\nAnne Coveny (front), secretary of Protect Fitzroy North, with locals who oppose the sale of a bluestone laneway to make way for the Piedimonte’s Supermarket redevelopment. Credit: Paul Jeffers\n\nThe Piedimonte family won approval to redevelop their eponymous supermarket off St Georges Road into a five-storey complex in May 2021, despite council opposition and more than 600 residents objecting.\n\nBut the approved plans still require the purchase of a council-owned lane to connect separate sites on Scotchmer Street and facilitate the supermarket renovation and to add 66 apartments, a roof terrace, cafe and three levels of underground parking.",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/national/queensland/last-resort-council-threatens-toll-to-pay-for-story-bridge-repairs-20250513-p5lynr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Last resort’: Council threatens toll to pay for Story Bridge repairs",
    "publish_date": "Tue, 13 May 2025 11:58:10 +1000",
    "category": "finance",
    "authors": [
      "Catherine Strohfeldt"
    ],
    "text": "A toll or levy for motorists using Story Bridge has been threatened as Brisbane City Council prepares to make another bid for state and federal funding to complete “significant” restoration work.\n\nAn independent report commissioned by the council found the 85-year-old structure required a 15-year period of continued work.\n\nLord Mayor Adrian Schrinner told 4BC’s Peter Fegan a toll or levy was a “100 per cent no from council”, but costs for repairs exceeded the budget.\n\nRestoration work is done on Story Bridge in Brisbane. Credit: Brisbane City Council\n\nHe said that without government help, the council could be forced to consider options, including an annual rates levy, toll or private sponsorship to fund the restoration.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/money/planning-and-budgeting/why-short-term-thinking-won-t-build-long-lasting-wealth-20250513-p5lyqd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why short-term thinking won’t build long-lasting wealth",
    "publish_date": "Tue, 13 May 2025 11:52:45 +1000",
    "category": "finance",
    "authors": [
      "Paridhi Jain"
    ],
    "text": "Here are a few examples of what that looks like. Short-term v long-term thinking Loading One of the most underrated financial skills is the ability to think long-term. I’m not talking in months or even years, but decades. Here’s the difference in what that sounds like: Short-term: “I need to get on the property ladder as soon as possible.” Long-term: “I want to buy a property I’m happy to hang onto for a couple of decades.”\n\nShort-term: “What can I invest in that will give me X per cent return in one to two years?” Long-term: “What can I invest in that will still be a quality investment five, 10, 20 years from now?” Long-term thinking is harder – it takes more patience and delivers less instant gratification. You have to move away from wanting fast results to wanting results that last. Taking the time to create a streamlined savings system won’t deliver the quick wins that chasing after savings hacks will, but it will deliver bigger, more sustainable results long-term. Building wealth is a long-term game. Credit: Getty Images Taking the time to buy a property with your long-term goals in mind won’t satisfy the urgent desire to ‘get on the property ladder’ now, but it will pay off big-time in a few decades.\n\nFundamentally, wealth is a long-term game. No short-term quick wins will pay off as much as stretching your ability to think long-term in your financial decision-making. Security v opportunity Are you acquiring wealth for security or for opportunity? For most, the drive to earn more, save more and invest more is rooted in a desire for security. This can be a lifelong journey that doesn’t end until you have a fully paid-off house and enough assets to retire. Even then you can still be worried about running out of money. Instead, what if you started asking, “What are the opportunities that wealth can make available to me?” This takes you on a totally different journey to “How do I create financial security?”\n\nOne takes you on a cautious journey where the acquisition of wealth is the end goal. The other opens up possibilities, with wealth being a resource for creating a richer experience of life. ‘Right decision’ v ‘right for me’ Loading Initially, you might be fixated on making the ‘right’ move. What’s the ‘best’ investment? Should I buy a property or invest in shares? If there’s going to be a market crash, should I sell my investments or ride it out? The thing is, there isn’t one single correct answer. It’s better to think of there being core principles, and you get to choose how you apply those principles to your life.\n\nYou can be financially successful whether you invest in property or shares; whether you buy a property now or rentvest now; whether you invest inside or outside superannuation. Many choices can be a good choice – so it’s not about trying to determine one universally correct answer but picking the right choice for you. This requires having the self-awareness to know what’s the right choice for you – and the self-trust to back that choice, even when others appear to be succeeding faster on another path. Often, we get caught up in trying to improve financial results by taking different actions. Chasing a new strategy, trying a new tool, jumping onto the latest investment fad. But better financial results come down to one thing: better decision-making. And better decisions start with better thinking. This is a skill you can learn – and when you do, financial growth won’t be something you need to chase. It will be inevitable.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/politics/federal/every-seat-that-changed-hands-and-those-that-are-still-in-doubt-20250502-p5lw3y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "These are the four seats still too close to call – and 18 that changed hands",
    "publish_date": "Tue, 13 May 2025 11:48:53 +1000",
    "category": "finance",
    "authors": [
      "Millie Muroi",
      "Matt Wade",
      "Olivia Ireland"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nFour seats across the nation remain too close to call as the margins in some high-profile electoral battles narrowed to double digits.\n\nTwo contests between Liberals and teal independents – in Sydney’s Bradfield and Melbourne’s Kooyong – were called on Monday by this masthead’s decision desk for Gisele Kapterian and Monique Ryan respectively.\n\nElsewhere on Monday, the seats of Bean (ACT) and Fisher (QLD) were called and have been retained by Labor and the LNP respectively. On Tuesday morning, Monash was retained by the Coalition.\n\nWe will continue to update this story as soon as every remaining seat is called – and you can stay up to date on the results page.\n\nEvery seat still too close to call\n\nCalwell\n\nHeld by now-retired Labor veteran Maria Vamvakinou for more than two decades, this working-class north suburban seat should have been safe.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/eels-won-t-rush-blues-hopeful-lomax-back-because-of-origin-20250513-p5lyof.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Eels won’t rush Blues hopeful Lomax back because of Origin",
    "publish_date": "Tue, 13 May 2025 11:45:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Zac Lomax will on Tuesday afternoon be named to return from a foot injury on the wing for Parramatta, but faces a fitness test on Wednesday that will have repercussions for both the Eels and NSW Blues.\n\nCoach Jason Ryles confirmed Lomax was set to play his first game since breaking a bone in his foot against his former club, St George Illawarra, in round five. An already injured Lomax slotted the winning field-goal in golden point that afternoon.\n\n“If he gets through Wednesday’s training, which we expect him to, he’ll play,” Ryles said.\n\n“If there’s the slightest bit of [concern], we’ll put him on ice for the week.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/kohli-was-the-face-of-the-new-bold-and-brash-india-20250513-p5lyo7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kohli was the face of the new bold and brash India",
    "publish_date": "Tue, 13 May 2025 11:44:57 +1000",
    "category": "sports",
    "authors": [
      "Greg Chappell"
    ],
    "text": "Virat Kohli’s retirement from Test cricket marks the end of a thunderous era - a reign forged in grit, fire, and audacity.\n\nIt closes the chapter on the most transformative figure in Indian cricket since Sachin Tendulkar - perhaps even eclipsing him in terms of cultural influence and psychological impact on India’s identity. Certainly, there is no other cricketer Australian crowds loved to stir more - ironically, a sign of esteem.\n\nKohli, the incandescent heart of Indian cricket for more than a decade, did not just score runs. He redefined expectations, challenged conventions, and symbolised the self-assured, unapologetic India of the 21st century. His departure leaves not only a statistical void, but a seismic shift in energy - for there has never been another quite like him.\n\nThere was a time when Indian cricket, particularly overseas, bore the air of respectful submission - playing with technical skill, yes, but often with psychological inferiority. That changed in stages. Sourav Ganguly gave it a new spine. MS Dhoni brought ice-cold leadership and white-ball dominance. But Kohli? Kohli lit the fire. He tore the script and authored a new one where India was not just competitive abroad - it expected to win.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/maroons-star-confident-ahead-of-game-two-20250513-p5lyr8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Maroons star confident ahead of game two",
    "publish_date": "Tue, 13 May 2025 11:29:32 +1000",
    "category": "sports",
    "authors": [],
    "text": "Maroons star confident ahead of game two\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-jump-wall-street-soars-after-us-china-trade-war-truce-20250513-p5lymg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX jumps after Wall Street soared on US-China trade war truce",
    "publish_date": "Tue, 13 May 2025 11:13:01 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket jumped in early trade, following a rally on Wall Street after China and the United States announced a 90-day truce in their trade war and agreed to temporarily reduce tariffs on each other’s goods.\n\nThe S&P/ASX 200 was up 55.5 points, or 0.7 per cent, to 8289 as of 10.50am AEST, having jumped above 8300 in the first half hour of trading. Seven of the 11 industry sectors advanced, led by mining companies, retailers, IT and energy stocks, while more defensive sectors such as utilities and telecommunications declined. The Australian dollar softened to US63.69¢.\n\nUS stocks soared on the news of a 90-day truce in the trade war, setting the tone for the Australian market. Credit: Bloomberg\n\nAustralia’s iron ore heavyweights advanced after prices for the metal jumped 3.2 per cent to $US100 a tonne overnight as the Trump administration dramatically slashed its crippling tariffs on imports from China, limiting the immediate damage on Australia’s biggest export market. BHP shares climbed 2.3 per cent, Fortescue was up 2.7 per cent and Rio Tinto gained 1.4 per cent.\n\nThe materials sector’s gains were limited, however, by heavy falls in gold miners as prices for bullion dropped overnight as investors felt less need to buy something safe. Northern Star Resources (down 5.7 per cent), Evolution Mining (down 6.6 per cent) and Newmont (down 3.7 per cent) all slumped.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/money/investing/why-these-vintage-toys-are-too-valuable-to-play-with-20250513-p5lyp1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why these vintage toys are too valuable to play with",
    "publish_date": "Tue, 13 May 2025 11:10:40 +1000",
    "category": "finance",
    "authors": [
      "Stephen Crafti"
    ],
    "text": "Toys are a touchstone to one’s childhood – either for toys one had or, just as often, things that were considered by parents “too top shelf” to consider purchasing for their children.\n\nDecades later, seeing that same toy rekindles that connection and, in some instances, triggers the start of a vintage toy collection. From French and German bisque (porcelain) dolls produced from the 1860s through to Barbie dolls released a century later, the market continually changes – as do the prices.\n\n“Failed dolls”, vintage Barbies, and push pedal cards are all among vintage toys fetching a high price today.\n\nGraeme Horne has been at the helm of Abbingdon Auctions Australia for the last 30 years – his focus is on dolls, bears, toys and collectables. Three auctions are held each year at his Wantirna South headquarters, an outer suburb of Melbourne.\n\nWhile prices fluctuate so does the demographic. “Many of our older customers started collecting bisque dolls many years ago, while our younger clients, young women in their 20s to 30s, gravitate to Barbie dolls from the 1960s and the Monster High dolls from the early 1980s (more goth or punk with two-tone coloured hair and thick eyeliner),” says Horne, who sells these to his main markets – New Zealand, Singapore, the United States and the United Kingdom.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/victoria/security-boost-for-the-cbd-as-budget-squeeze-puts-brakes-on-other-ambitious-plans-20250513-p5lypg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Security boost for the CBD as budget squeeze puts brakes on other ambitious election promises",
    "publish_date": "Tue, 13 May 2025 11:03:09 +1000",
    "category": "finance",
    "authors": [
      "Cara Waters",
      "Sophie Aubrey"
    ],
    "text": "Public safety in the CBD will get a $4.5 million boost for more security guards, extra CCTV and lighting as part of the City of Melbourne’s budget, but many of Lord Mayor Nick Reece’s other election pledges remain unfunded.\n\nThe $732 million draft budget unveiled on Tuesday records a small $150,000 surplus with a repayment plan to reduce the council’s debt from $212 million this financial year to zero in seven years.\n\nThe council has put aside $4.5m on security measures for the city. Credit: Wayne Taylor\n\nThe budget pours $2 million into the council’s controversial security team to put “more boots on the ground”.\n\nIt also includes $2.1 million to upgrade and expand the city’s CCTV, activating more than 100 new cameras, and $1 million to light up the city’s laneways.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://au.news.yahoo.com/fears-major-law-change-could-cut-the-guts-out-of-entire-rural-industry-it-cant-be-fixed-005634866.html",
    "title": "Fears major law change could 'cut the guts' out of entire rural industry: 'It can't be fixed'",
    "publish_date": "2025-05-13T00:56:34Z",
    "category": "finance",
    "authors": [],
    "text": "Animal welfare advocates are celebrating the planned live export ban, but farm workers say it will have an unintended ripple effect on the economy.\n\nShearers fear wool sheds like these could soon stand empty due to ripple effects from a ban on live sheep exports. Source: Darren Spencer\n\nA classic Aussie trade could be gutted in one state if the Albanese Labor Government follows through on a controversial plan, according to industry insiders.\n\nShearers point to a unique set of circumstances that mean an upcoming ban of live sheep exports will have a ripple effect set to decimate the prized merino wool industry in Western Australia.\n\n“The ban doesn't come into effect until May, 2028 but farmers are making decisions now on what they do,” WA Shearing Industry Association president Darren Spencer told Yahoo News. “Right across our membership here, most contractors have got a lot less work,” he said.\n\nCramming live sheep into pens and shipping them 10,000km has long been controversial, and animal advocates are thankful for Labor’s planned ban. Groups like Animals Australia and the RSPCA say the industry has a “dark history” and raised concerns about welfare at sea and after disembarking in the Middle East where butchering traditions are different to our own.\n\nADVERTISEMENT\n\n“Live sheep export is fundamentally cruel and it cannot be fixed. Literally millions of sheep have died and all have suffered through this trade in live animals,” an Animals Australia spokesperson told Yahoo.\n\n“Animals Australia has conducted dozens of investigations over two decades and always finds suffering, lodging 76 legal complaints showing exporters' unwillingness to follow even basic rules.”\n\nThe wool industry supports more than just shearing jobs. Source: Darren Spencer\n\nShearers who can process 150 sheep a day can make $600 to $750 a day. Source: Darren Spencer\n\nWhile Animals Australia argues suffering associated with live export is ongoing, “inherent and unfixable”, peak body the Australian Livestock Exporters' Council has dismissed allegations about ongoing animal welfare problems.\n\nIts CEO Mark Harvey-Sutton told Yahoo there’s “no doubt” there were issues prior to reforms in 2018, but exporters have significantly improved, with one just recording its best voyage ever — 22 mortalities out of a shipment of 50,000 animals.\n\nADVERTISEMENT\n\n“What it boils down to is this government has made a deal with activists and made this decision based on ideology rather than evidence,” he said.\n\nWill only farmers and shearers be impacted by the ban?\n\nHarvey-Sutton estimates Western Australia’s flocks have already declined by 25 per cent in the last 12 months. The industry warns it's not just the farmers and the labourers they employ that will be impacted, but also shops and other businesses in rural communities they buy from. The wool industry alone isn’t just shearers and farmers, there are also brokers, handlers, dumpers, testers and transporters.\n\n“If you look at the precedent that this sets, this is the first time the government's actually shut down a rural industry. We anticipated what the impact would be, and so far we've been proven correct. But in terms of how bad the damage is, sadly, we'll just have to see over time,” he said.\n\nPerth is widely considered the world’s most isolated major city, and so it's unsurprising that Western Australia’s sheep market runs separately from the rest of the country.\n\nADVERTISEMENT\n\nSouth Australia ceased live sheep export in 2018, but in the west, the industry continues to have a major influence on sheep prices. Although live export only makes up 1 per cent of Australia’s sheep and wool exports, Harvey-Sutton says it plays an important role, creating pricing competition in Western Australia.\n\n“[Now] exporters and processors have to compete with each other, so you get a higher price naturally,” he said.\n\n“You take that away, they don't have to compete… prices drop, and then that's less income for the producer. Then the producer has to make a decision — am I earning enough income to continue producing sheep?”\n\nAnimals Australia claims live export has “inherent and unfixable” problems, but the industry maintains it has reformed itself. Source: Getty\n\nHow will ripples of live export ban harm the wool industry?\n\nThere’s a specific impact on the wool industry that the WA Shearing Industry Association has witnessed.\n\nADVERTISEMENT\n\nCross-bred sheep put on weight so fast and are often slaughtered before they've sprouted a fleece worth shearing. Merino sheep are slower to mature and are reared because their fleece is of a superior quality. They’ll normally be shorn multiple times before they’re sent to slaughter, providing lots of work for shearers.\n\n“Merino ewes are always sought after, you can always get rid of them for breeding. But it’s the merino wethers [non-breeding males] that you can’t get rid of,” Darren Spencer said.\n\nMerino sheep are generally shorn multiple times before slaughter, while cross-breeds put on weight much faster. Source: Getty\n\nAfter 12 months of age, these wethers are considered mutton and they sell for a lower amount than lamb. While finding an abattoir to slaughter them at a good price in Western Australia can be a problem, there’s more interest overseas.\n\n“Live export is so important to us, because it takes those slower maturing merinos out of the system and gives them a much better value than they have in the [local] abattoirs,” Spencer said.\n\nWhen sheep lost value in the 1990s, farmers simply shot and buried them, and Spencer is fearful of history repeating. While the planned live export ban isn’t the only issue sheep farmers face, he thinks the loss of live export will be an added blow that will “cut the guts” out of the wool industry.\n\nThere are few abattoirs left in Western Australia that process sheep, and much of the state is in drought. Rearing animals in feedlots so they put on weight before they become mutton is expensive because the price of grain is high. So those wanting to raise merino sheep are looking to the greener pastures in the east of Australia.\n\nShearers who can process 150 sheep can make $600 to $750 in a day, but the work is increasingly inconsistent.\n\n\"That's the problem now, we will have banks to work for three to four months, and then there'll be time to sit down,\" Spencer said. \"It's not really good having groups of shearers just sitting around.\"\n\nWas the sheep industry already in trouble?\n\nAnimals Australia argues the sheep export trade has been in “terminal decline” for decades, with numbers falling from six million annually in the early 2000s to around 400,000 in 2024. It told Yahoo decreases in flock size have been triggered by farmers moving from livestock to cropping.\n\n“The change is happening and whether the live sheep trade was to have continued or not, farmers and utility workers such as shearers would be adapting,” its spokesperson said.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 29
  },
  {
    "url": "https://au.news.yahoo.com/driveway-photo-shows-major-shift-homeowners-are-making-across-australia-saving-a-dollar-a-day-070250419.html",
    "title": "Driveway photo shows major shift homeowners are making across Australia: 'Saving a dollar a day'",
    "publish_date": "2025-05-12T07:02:50Z",
    "category": "finance",
    "authors": [],
    "text": "For some it takes years to achieve, but more Australians are saying goodbye to their home gas connection.\n\nNow you see it, now you don't. Source: Grace Mitchell/Facebook\n\nAussie homeowners looking to reduce their carbon footprint, bring down their bills and improve the overall efficiency of their homes are leading a major shift unfolding in suburbs across the country.\n\nAustralia punches well above its weight when it comes to producing gas. Despite being one of the 10 biggest gas producing nations in the world — with more than three quarters of it exported overseas — Australians at home are increasingly turning away from the energy source.\n\nInstead, they're opting to make their homes fully electric. For Melbourne resident Grace Mitchell, \"getting off gas was about minimising our use of fossil fuels and trying to maximise our use of renewable energy\", she told Yahoo News.\n\n\"A few years ago we decided we wanted to do a renovation of the house, so those things lined up... It was good timing now to go through and make the house much more energy efficient.\"\n\nADVERTISEMENT\n\nKicking gas meant losing the dollar a day connection fee as the family also set about making their home as thermally efficient as possible to \"generally lower our footprint,\" Grace said.\n\nIn the considerable revamp of the family's circa 1919 single-fronted weatherboard cottage in inner Melbourne, they replaced a gas ducted heating and evaporative cooler system with reverse-cycle air-conditioning, gas cooking with an induction cooktop and electric oven, and gas hot water with an electric heat pump.\n\n\"We're saving a dollar a day on just not having a gas connection,\" Grace noted, saying that as they gradually moved away from using gas-powered appliances, it was only their instant hot water that relied on it.\n\n\"Our last gas bill, I think it was over a 60-day period, we had $60 for gas connection and about $20 worth of actual gas use,\" she told Yahoo.\n\nThe house has been retrofitted with all new electric appliances. Source: Grace Mitchell/Facebook\n\nConverting from gas cheaper than moving, homeowner says\n\nWhile Grace admits they were fortunate enough to have the money to do the renovations and make the environmentally friendly changes, upgrading the older house still made financial sense when compared to potentially moving and incurring the related costs.\n\nADVERTISEMENT\n\n\"Just buying and selling the house... with stamp duty and everything, you're going to drop $100,000 just shifting if you've got an average house in Melbourne. So you can do quite a lot on your existing house if you kind of think of it like that.\"\n\nShe joined a Facebook group called My Efficient Home which today has more than 140,000 members where people share tips \"about improving the comfort and energy performance of Australian homes\".\n\n\"House is so much more thermally efficient and comfortable to live in,\" Grace posted to the group recently about the changes she made. \"Thanks to this group for all the knowledge gleaned along the way to help us figure all this out!\"\n\nShe's far from the only one partaking in the national trend.\n\nADVERTISEMENT\n\n\"I am only the last of many to celebrate no longer using gas,\" another Aussie group member who posted about their transition, which took place over a six-year period, told Yahoo News.\n\n\"I have been working to this over the last years gradually replacing appliances as I could afford to do so. Some people have been able to do a house renovation and then complete the work in one go,\" she added.\n\nAustralia has the highest penetration rate of rooftop solar in the world. Source: Getty\n\nHalf of Aussies considering turning off gas\n\nAccording to research by Energy Consumers Australia last year, there has \"been a clear shift\" in the past three years of Aussie homeowners thinking about getting off gas, with more than 50 per cent considering cutting their connection fully.\n\nSimilar findings were found in a survey by the Australian Institute in 2023 with 55 per cent of Aussies saying they felt positively about electrifying more homes. \"With electric technology now readily available, the biggest barrier to making that switch is the upfront cost of transition,\" the Australian Institute's Noah Schultz-Byard said at the time.\n\nADVERTISEMENT\n\nAustralia has the highest penetration rate of rooftop solar in the world, and after the federal Labor government's romping election win this month, households across the country can look forward to a $2.3 billion subsidy program to help homeowners with the cost of installing a home battery.\n\n\"In the future we'll think about upgrading our solar... and potentially a battery,\" Grace told Yahoo when asked about the policy. \"It's always nice to get the incentive of subsidies, but you're still having to outlay cash yourself.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/regular-camper-hits-out-at-major-change-set-for-national-park-sites-in-aussie-state-065721630.html",
    "title": "Regular camper hits out at major change set for national park sites in Aussie state",
    "publish_date": "2025-05-12T06:57:21Z",
    "category": "finance",
    "authors": [],
    "text": "Campground fees could soon be as much as nine times the amount at some sites if the proposal is rolled out.\n\nOutback Mike is urging Aussies to speak up against the camping changes proposed by NSW authorities. Source: TikTok/outbackmike & Getty\n\nOutback Mike has urged campers to speak up against a major proposal that would overhaul camping in the country's most populous state, with the renowned adventurer concerned everyday Australians could soon be discouraged from enjoying the bush due to increased campground prices.\n\nMike Atkinson, who appeared on the popular TV show Alone Australia, believes increasing the cost of campgrounds in New South Wales is not the answer to tackling problems the recent surge in camping has created, such as limited campsite accessibility and ghost bookings.\n\nHe told Yahoo News he worries the state's National Parks and Wildlife Service (NPWS) simply sees the potential to make \"heaps of money\" from the 49 per cent surge in campground visitations reported by authorities over the last decade.\n\n\"The really serious thing is that they are introducing camping fees to an enormous percentage of campgrounds that never had them before,\" Mike said.\n\nADVERTISEMENT\n\n\"Never in the history of parks has there ever been a camping fee there... and now my guess is 60 to 70 per cent of campgrounds will have fees for the first time ever. I feel that the executives in NSW National Parks are running it like a business, and it's not, it's a public service.\"\n\nThe service manages 895 parks and reserves which make up roughly 10 per cent of the state's total land mass. NSW authorities claim there are now 1.8 million overnight campground stays every year.\n\nHow would campers be impacted by the proposed change?\n\nThe NPWS proposal involves a state-wide approach to campground pricing, with every site categorised into one of six tiers with an attached price bracket based on its amenities. There would be a different nightly price for camping at high season compared to low season for each campground.\n\nThe proposed NSW campground tiering system. Source: NSW NPWS consultation paper\n\nFor example, Thredbo Diggings campground — situated in NSW's Snowy Mountains region — could increase from $6 to $54 per night during high season, as it would be classified as a tier four campground with tables, barbecues and shelters.\n\nADVERTISEMENT\n\nMike camped there in July last year and said the prospect of paying nine times the nightly amount to stay at the same campground is unreasonable.\n\n\"They care more about extracting money from people than they do about solving the problem. That is my honest opinion,\" Mike said.\n\nStaying at many popular campgrounds around the state is expected to increase in price under the proposal.\n\nIt could soon cost nine times more for a camper to sleep overnight at Thredbo Diggings campground. Source: ExplorOz & TikTok/outbackmike\n\nWhat alternative solutions could tackle camping issues?\n\nMike has been a firm believer that scrapping booking systems would solve many of the problems faced by campers and authorities. Without a booking system, ghost bookings would be eradicated as a first come, first service approach would be the only option, stopping people from claiming a campsite online they later don't physically show up and use.\n\nADVERTISEMENT\n\n\"The solution is to get rid of the booking system,\" he said.\n\nHowever, a 2022 NPWS survey of the most frequent national park campers found 87 per cent of respondents \"wanted to be able to book a site because it gives them certainty\".\n\nMike also believes a simple increase in the supply of campgrounds to offset the sudden increase of demand is a no-brainer.\n\n\"They're saying 49 per cent extra people are visiting the parks but nowhere in their proposal did they consider increasing the amount of campsites by 49 per cent, therefore meeting demand,\" he said.\n\nTo provide your feedback before May 25, click here to access the NPWS survey.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 31
  }
]