[
    {
        "url": "https://www.9news.com.au/national/victoria-wurundjeri-woiwurrung-people-file-native-title-claim-over-melbourne-and-surrounds/93a1ce04-ca43-4434-bc70-f3fee762e37e",
        "title": "Native title claim filed for Melbourne and surrounds",
        "publish_date": "Mon, 10 Nov 2025 00:38:48 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "The Wurundjeri Woi-wurrung people have filed a native title claim with the federal court over Melbourne and surrounding suburbs.\n\nIt covers thousands of square kilometres of metropolitan Melbourne from north of the Great Dividing Range, east towards Mount Baw Baw, west to the Werribee River and south to Moradialloc Creek. ﻿\n\nThe Wurundjeri Woi-wurrung people are seeking legal recognition of their traditional rights and connection to the country, according to the claim filed on Friday.\n\nThe Wurundjeri Woi-wurrung people have filed a native title claim with the federal court over Melbourne and surrounding suburbs. (Slater and Gordon)\n\nThe action comes a little over a week after Victoria became the first state in Australia to legislate a treaty with its Indigenous people. ﻿\n\nElder Perry Wandin said it was time for the traditional lore and customs of the Wurundjeri Woi-wurrung people to be recognised.\n\n\"Wurundjeri people have fought for decades for recognition and respect, and have been at the forefront of protecting culture and country in Melbourne and surrounds,\" he said.\n\nElder Uncle Andrew Gardiner added, \"We are doing this for our ancestors and for our future generations.\"\n\nNative title is the legal recognition of the traditional rights and interests that Indigenous people have over land and waters according to their own laws and customs.\n\nIt would grant the ﻿Wurundjeri Woi-wurrung people greater opportunities to exercise their traditional rights, such as fishing, gathering resources, caring for the country, protecting places of significance and maintaining their relationship with land and water. ﻿\n\nA claim does not affect private homes, businesses or public infrastructure. (Getty)\n\nA claim does not affect private homes, businesses or public infrastructure and can coexist with other land uses, such as Crown land, reserves and waterways. ﻿\n\nIf successful, the ﻿Wurundjeri Woi-wurrung people's claim would be the eighth native title determination to be granted in Victoria.\n\nIt would also make Melbourne the third capital city to be encompassed under a native title claim, following the Kaurna people's recognition over an area including Adelaide in 2018 and the Noongar people over an area including Perth in 2021. ﻿\n\nThe ﻿National Native Title Tribunal will now decide whether to register the claim.\n\nThe ﻿Wurundjeri Woi-wurrung elders intend to work with the state government and neighbouring traditional owner groups to reach an agreement.\n\nAll claims, including the seven previously granted and the several currently before the courts, encompass the majority of Victoria. ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/health-insurance-premiums-2026-set-to-rise-with-inflation/e290cba1-e8cf-4ca6-9595-e2612ffd9d26",
        "title": "Millions of Australians warned of  jump in health insurance premiums",
        "publish_date": "Sun, 09 Nov 2025 23:54:00 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "F﻿or the first time in half a decade, the 15 million Australians with private health insurance face a steeper rise in their annual premiums.\n\nOn Wednesday, private health insurers will submit their proposed insurance premium changes to Federal Health Minister Mark Butler for review.\n\nNew analysis by Money.com.au shows next year's premium increase will break a five-year trend to align closely with health inflation.﻿\n\nREAD MORE: Radio icon John Laws dies aged 90\n\nHealth Minister Mark Butler has urged private health funds to offer customers value for money over insurance premiums. . (Getty)\n\nSoaring private hospital costs and wage increases are expected to drive up the cost of premiums.﻿\n\nMoney.com.au general manager of health insurance, Chris Whitelaw, said since 2021 and the aftermath of the pandemic, premium increases have been restrained but that is due to end.\n\n\"Their pricing buffer is running out, and the private health sector is likely to recalibrate after several years of suppressed pricing.\n\n\"We expect 2026 could mark the first year in half a decade where premiums and health inflation move in tandem,\" he says.\n\nREAD MORE: ﻿ Over 150 new school zone speed limits roll out in SA from today\n\nSoaring private hospital costs and wage increases are expected to drive up the cost of premiums.﻿ (Getty Images/iStockphoto)\n\n﻿Butler said﻿ he expects health funds to show good faith in their proposals, but they are facing cost rises and a struggling private hospital sector.\n\nHealth insurance premiums increased by an average of 3.73 per cent this year.\n\nThe changes were announced in February after Butler twice knocked back insurers' earlier proposals for steeper increases of between 5 per cent and 6 per cent.\n\nIn the lead-up to Wednesday's submissions, Butler said he expected private health funds to ﻿make \"more strenuous efforts\" to offer value to customers and help struggling private hospitals.\n\nHis final decision - expected between December and late January - will determine how much more Australians will pay for private health cover when new premiums begin next April.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/black-friday-shopping-sales-warning-accc/f6cb6e13-d7be-4f09-b639-b06a122cd24f",
        "title": "Warning for shoppers hoping to find a Black Friday bargain",
        "publish_date": "Sun, 09 Nov 2025 23:48:26 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "S﻿hoppers looking for a bargain this Black Friday should watch out for sales scams.\n\nConsumer bosses are warning they'll be looking out for banned sales tactics in the next few weeks.\n\nThey're warning shoppers to check carefully if sales are actually genuine.﻿\n\nREAD MORE: Radio icon John Laws dies aged 90\n\nConsumer bosses are warning they'll be looking out for banned sales tactics in the next few weeks. (Dion Georgopoulos)\n\nThey'll be cracking down on offers that break the rules.\n\n\"We are putting retailers on notice to review their sales advertising practices to ensure that any sales or discount claims they make are accurate, clear, and not likely to mislead or deceive consumers,\" ACCC Deputy Chair Catriona Lowe said.\n\n\"If consumers are waiting for the Black Friday sales to make a big purchase, we encourage them to consider checking the prices now before sales start, so they can compare the price and determine if they are making a legitimate saving.\n\n\"We will pay special attention to retailers who were identified as having problematic sales practices in the sweep we conducted during last year's Black Friday and Boxing Day sales and expect to see improved compliance across the retail sector.\"\n\nCompanies can face investigations and fines if they break the rules. (Dion Georgopoulos)\n\nThey're looking for misleading limited-time representations that create a false sense of urgency for shoppers, misleading \"site-wide\" or \"store-wide\" claims about sales, and claims of \"up to X per cent off\", where few products are on sale at X per cent off.\n\nCompanies can face investigations and fines if they break the rules.\n\n﻿In June 2025, Michael Hill, My House and Hairhouse online paid penalties for allegedly making false and misleading representations about their Black Friday Sales.\n\nLast year the ACCC said it saw some \"concerning\" sales ads.\n\nThere are still ongoing investigations as a result of the sweep conducted in 2024.﻿\n\nBlack Friday started in America, and has grown globally.\n\nIt refers to the day after Thanksgiving, when shops and websites traditionally hold sales.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/coffee-heart-health-reduce-atrial-fibrillation-irregular-heartbeat/61405206-9a9d-44f6-999a-f93f015cca1b",
        "title": "Hidden health benefit discovered in your daily cup of coffee",
        "publish_date": "Sun, 09 Nov 2025 23:12:05 +0000",
        "category": "lifestyle",
        "authors": [
            "Nov"
        ],
        "text": "Your morning coffee could be doing more for your health than you realise.\n\nNew research from The University of Adelaide has revealed that drinking a cup of coffee a day may protect against atrial fibrillation (AF), also known as an irregular heartbeat.\n\nIt's a common heart condition that affects one in three people in their lifetime and can lead to heart failure, stroke, and even death.\n\nREAD MORE: Radio icon John Laws dies aged 90\n\nYour morning coffee could be doing more for your health than you realise. (Getty)\n\nAbout half a million Australians are living with AF, with an estimated 30 per cent of whom are undiagnosed.\n\nThat's approximately 150,000 people who have the condition – which is linked to high blood pressure, obesity and other heart diseases – and have no idea.\n\nBut coffee could help reduce AF's effects.\n\nResearchers conducted a ﻿randomised clinical trial called the DECAF (Does Eliminating Coffee Avoid Fibrillation) trial with 200 AF patients from Australia and abroad.\n\n\"We found the coffee drinkers experienced a significant reduction in AF compared to those who avoided coffee and caffeine.\" (Getty)\n\nHalf were told to give up coffee for six months, while the rest were told to drink at least one cup a day.\n\nBoth groups were ﻿monitored for any episodes of AF, which were verified by physicians.\n\nThe results were \"astounding\", ﻿according to first author Professor Christopher X. Wong from the University of Adelaide and Royal Adelaide Hospital.\n\n\"We found the coffee drinkers experienced a significant reduction in AF compared to those who avoided coffee and caffeine,\" he said.\n\n\"This is surprising as it goes against the common assumption by doctors and patients that coffee worsens heart rhythm disorders such as AF.\"\n\nThe DECAF trial participants who drank coffee daily showed a ﻿39 per cent reduction in the risk of recurrent AF episodes.\n\nIt may be good news for Australians with AF who have previously been told by doctors to limit their coffee intake for the sake of their heart health.\n\n\"This trial suggests that coffee is not only safe but likely to be protective,\" Wong said.\n\nSenior author Professor Gregory Marcus from the Division of Cardiology at UCSF explained that caffeine is a diuretic, which could potentially reduce blood pressure and lessen AF risk.\n\nHe also noted that coffee ﻿increases physical activity and contains ingredients with anti-inflammatory properties, both of which could have positive impacts on AF patients.\n\n\"Based on these results, coffee-drinking patients with AF can safely continue to enjoy their coffee,\" Wong added.\n\n\"Furthermore, it may be worth investigating whether AF patients who don't drink coffee should actually consider starting.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/john-laws-death-premier-chris-minns-says-government-would-love-state-funeral/cfdfaed9-216c-4fd4-b281-13072eef3824",
        "title": "Premier responds to state funeral question for John Laws",
        "publish_date": "Sun, 09 Nov 2025 22:01:58 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A state funeral for broadcasting legend John Laws could be on the cards after New South Wales Premier Chris Minns said the government would \"love\" to offer it.\n\nLaws died aged 90 at his Woolloomoolloo home in Sydney on the weekend after spending two weeks in hospital last month.\n\nHis death has sparked a wave of tributes , including from Prime Minister Anthony Albanese and Oscar-winning actor Russell Crowe.\n\nJohn Laws has died aged 90. (9News)\n\nMinns issued his own tribute to the radio giant dubbed \"Golden Tonsils\", ﻿and backed that up on Today this morning, calling Laws an \"absolute legend\".\n\n\"A big loss for broadcasting and Australia,\" he said.\n\nAsked whether a state funeral would be possible for the man who, during his career, held the ear of Australians around the country, Minns said it was possible.\n\nNSW Premier Chris Minns said a state funeral could be offered. (9News)\n\n\"I haven't spoken to the family yet, I'm not sure if that's their desire (but) we're doing everything to acknowledge his legacy and reputation,\" he said.\n\n\"If they would like to do it, we'd love to offer it.\"﻿\n\nLaws retired from radio for the second and final time just last year, after a career spanning more than 70 years.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/bbc-director-resigns-over-trump-speech-editing/cc7163ea-6ec5-43ae-b6d0-c63a3d9e595d",
        "title": "Trump unleashes on global media giant",
        "publish_date": "Sun, 09 Nov 2025 23:17:50 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "The head of the BBC and the British broadcaster's top news executive have both resigned amid criticism of the way the organisation edited a speech by US President Donald Trump.\n\nThe BBC said director-general Tim Davie and news chief executive Deborah Turness had both decided to leave the corporation.\n\nBritain's publicly funded national broadcaster has been criticised for editing a speech Trump made on January 6, 2021, before protesters attacked the Capitol in Washington.\n\nBBC director-general Tim Davie has announced he is quitting. (Hannah McKay/Pool via AP, File) (AP)\n\nCritics said that the way the speech was edited for a BBC documentary last year was misleading and cut out a section where Trump said that he wanted supporters to demonstrate peacefully.\n\nIn a new post on Truth Social today, Trump blasted the BBC over the documentary.\n\n\"The TOP people in the BBC, including TIM DAVIE, the BOSS, are all quitting/FIRED, because they were caught 'doctoring' my very good (PERFECT!) speech of January 6th,\" Trump's account posted.\n\n\"Thank you to The Telegraph for exposing these Corrupt 'Journalists.' These are very dishonest people who tried to step on the scales of a Presidential Election.\n\n\"On top of everything else, they are from a Foreign Country, one that many consider our Number One Ally. What a terrible thing for Democracy!\"\n\nTrump held nothing back in his post on Truth Social. (Truth Social)\n\nIn a letter to staff, Davie said quitting the job after five years \"is entirely my decision.\"\n\n\"Overall the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility,\" Davie said.\n\nHe said that he was \"working through exact timings with the Board to allow for an orderly transition to a successor over the coming months.\"\n\nREAD MORE: One photo captures tenderness amid chaos as super typhoon hits battered nation\n\nPro-Trump supporters storm the US Capitol following a rally with President Donald Trump on January 6, 2021 (Photo by Samuel Corum / Getty Images)\n\nTurness said that the controversy about the Trump documentary \"has reached a stage where it is causing damage to the BBC — an institution that I love. As the CEO of BBC News and Current Affairs, the buck stops with me.\"\n\n\"In public life leaders need to be fully accountable, and that is why I am stepping down,\" she said in a note to staff.\n\n\"While mistakes have been made, I want to be absolutely clear recent allegations that BBC News is institutionally biased are wrong.\"\n\nPressure on the broadcaster's top executives had been growing since the Daily Telegraph newspaper published parts of a dossier complied by Michael Prescott, who had been hired to advise the BBC on standards and guidelines.\n\nAs well as the Trump edit, it criticised the BBC's coverage of transgender issues and raised concerns of anti-Israel bias in the BBC's Arabic service.\n\nBritain's Conservative Party leader Kemi Badenoch. (Danny Lawson/Pool Photo via AP) (AP)\n\nThe 103-year-old BBC faces greater scrutiny than other broadcasters - and criticism from its commercial rivals - because of its status as a national institution funded through an annual licence fee of £174.50 ($353) paid by all households with a television.\n\nThe BBC airs vast reams of entertainment and sports programming across multiple television and radio stations and online platforms — but it's the BBC's news output that is most often under scrutiny.\n\nThe broadcaster is bound by the terms of its charter to be impartial in its output, and critics are quick to point out when they think it has failed. It's frequently a political football, with conservatives seeing a leftist slant in its news output and some liberals accusing it of having a conservative bias.\n\nIt has also been criticised from all angles over its coverage of the Israel-Hamas war in Gaza. In February, the BBC removed a documentary about Gaza from its streaming service after it emerged that the child narrator was the son of an official in the Hamas-led government.\n\nKemi Badenoch, leader of the opposition Conservative Party, said that the BBC was full of \"institutional bias,\" and \"the new leadership must now deliver genuine reform of the culture of the BBC, top to bottom.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/john-laws-death-anthony-albanese-ray-hadley-and-more-pay-tribute-to-radio-icon/54c171de-c536-44af-82c8-0320047b577e",
        "title": "'A legend': Oscar winner's emotional tribute to radio icon",
        "publish_date": "Sun, 09 Nov 2025 18:45:04 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Fellow radio stars, Prime Minister Anthony Albanese and Hollywood actor Russell Crowe have led tributes to radio titan John Laws, the man known as \"the Golden Tonsils\".\n\nLaws died at 90 following a 71-year radio career that saw him described by a former Australian leader as \"the broadcaster of the century\".\n\nAlbanese said Laws was an \"iconic voice and so much more\".\n\nFellow radio stars and Prime Minister Anthony Albanese have led tributes to radio titan John Laws, the man known as \"the Golden Tonsils\". (Nine)\n\n\"Generations of Australians trusted and respected him for telling it straight, digging deep and giving his guests and his listeners a chance to be heard,\" he said on X.\n\n\"John was always a thoroughly prepared and thoughtful interviewer - and wonderful company off-air.\n\n\"My condolences to his loved ones and to all who benefited from his wisdom and guidance.\"\n\nOscar-winning actor Russell Crowe described Laws as a neighbour, mentor, \"mischievous mate and a very good friend\".\n\n\"I am deeply saddened by his passing, however, I am buoyed in the sure and certain knowledge that he led a magnificent life of achievement and adventure and he lived every moment,\" Crowe said.\n\n\"He worked hard, played harder and loved completely. A legend, in the very best, most Australian, sense of the word.\n\n\"I loved him and I'll never forget him.\"\n\nREAD MORE: ﻿ Radio icon John Laws dies aged 90\n\nActor Russell Crowe and John Laws at Caroline Laws' funeral. (AAP)\n\nKyle Sandilands described him as \"one of the true originals\".\n\n\"You could never mistake him for anyone else,\" the Kyle and Jackie O host said on X.\n\n\"He said what he thought, didn't care who he offended, but could also show deep compassion when required.\n\n\"I'm devastated to have lost a mentor and a mate. Radio won't be the same without him.﻿\"\n\nSydney radio legend John Laws (9News)\n\nRay Hadley said Laws revolutionised the talk radio industry.\n\n\"In the latter years when he was at 2SM and tell me I was a copier... my reply was that if you were in the presence of someone who had perfected their craft, you'd be mad not to use some of that yourself,\" he told the Daily Telegraph.\n\nFederal Opposition Leader Sussan Ley called Laws a true pioneer of broadcasting whose legacy would \"echo for years to come\".\n\n\"His unmistakable voice became part of our national soundtrack,\" she said.\n\n\"He informed and entertained millions, asked the tough questions and always made space for others to be heard.\n\n\"He helped shape public debate with a style that was fearless, perceptive and unmistakably his own.\"\n\nNSW Premier Chris Minns acknowledged the death with \"great sadness\", calling Laws \"a towering figure in Australian radio whose voice resonated across the nation for more than seven decades\".\n\n\"John's career was extraordinary. Few broadcasters have left such a deep and lasting mark on Australian media,\" Minns said.\n\n\"On behalf of the NSW Government, I extend my deepest condolences to John's family, friends, colleagues and all who listened, learned and were challenged by him.\n\n\"His legacy lies not only in the thousands of hours on air, but in the connection he forged with millions of Australians.\"\n\nFormer journalist and radio host Mike Carlton said there was \"no better broadcaster in all the long history of radio\".\n\n\"The king is dead,\" he said, on X.\n\n\"I'm told John died peacefully at home. And I'm sad to hear it.\n\n\"We were friends…we had a fierce feud…we made up and were friends again.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-kingston-train-crashes-into-car-lucky-escape/9940edb9-915c-4851-88ae-6799ffee6db4",
        "title": "Woman's miraculous escape after becoming trapped in car on train tracks",
        "publish_date": "Sun, 09 Nov 2025 02:33:14 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A﻿ woman in Queensland made a miraculous escape after becoming trapped when her car lost control and ended up on train tracks.\n\nHaunting CCTV vision shows the incident which took place on Mayes Avenue in the Logan suburb of Kingston about 10.﻿30pm yesterday evening.\n\nJust minutes earlier, the car was seen careening around a corner, before flying off a three-metre cliff and onto the tracks.\n\nIncredibly, the woman in the car only suffered minor injuries. (Nine)\n\n\"I quickly ran out and went to assist, saw the car upside down on the track,\" a witness told 9News.\n\nThe female driver became trapped ﻿as witnesses tried to free her from the wreckage.\n\nBut they had to abandon their heroic attempts as an oncoming train approached.\n\n﻿\"We had to quickly get up to safety and we just watched helplessly as the train just smashed into the car,\" the witness added.\n\nIncredibly, the woman in the car only suffered minor injuries.\n\nShe was taken to Princess Alexandra Hospital in stable condition.\n\n﻿Nobody on the train was injured.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/kimberley-town-kununurra-facing-life-without-a-cemetery/105979730",
        "title": "Remote WA town's cemetery running out of room",
        "publish_date": "Mon, 10 Nov 2025 01:49:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "The small town of Kununurra, in far north Western Australia, is facing an unusual social dilemma — where to bury its dead when the cemetery closes.\n\nDespite being the Kimberley's newest town, gazetted in 1961, its cemetery is almost full.\n\nPart of the site, on the corner of Barringtonia Avenue and Hidden Valley Road, sits on a bed of rock, meaning graves can not be dug to the required depth.\n\nThe search for an alternative site for Kununurra cemetery is underway. (ABC Kimberley: Giulia Bertoglio)\n\nAnother portion floods regularly and can not be used for burials, while the region's annual monsoonal deluge adds complexity to the remaining plots.\n\nCoffin could not sink into ground\n\nKununurra resident Keith Wright, 83, said he remembered going to a funeral at the end of the dry season some years ago.\n\nHe said he watched as his friend's coffin refused to sink.\n\n\"It kept bobbing up,\" Mr Wright said.\n\n\"The water table was such that the coffin wasn't sinking. The shire had to bring in the backhoe and use the bucket to push the coffin down to the bottom.\n\n\" It was humorous at the time, but also quite an irreverent way to say goodbye. \"\n\nMr Wright said he wanted to be buried in the town he had called home since 1970, when he arrived from Wyndham to be Kununurra's first pharmacist.\n\nKeith Wright wants to be buried in the town he has called home since 1970. (ABC Kimberley: Giulia Bertoglio)\n\nHis first wife, who died in a vehicle crash in 1974, is buried in Kununurra.\n\nMr Wright said he was worried that once the cemetery reached capacity in 2027, he might be buried elsewhere.\n\n\"The thought does concern me and I think everybody who has been a resident of the town for any length should have the ability to be buried where they choose,\" he said.\n\n\" Of course, if I'm dead it won't bother me. \"\n\nKununurra is vulnerable to flooding and low-lying areas of the cemetery are unusable. (ABC Kimberley: Erin Parke)\n\nNo land available\n\nThe Shire of Wyndham East Kimberley has been searching for a new cemetery site \"for years\".\n\nThe requirements for a new cemetery include accessibility to town, appropriate zoning, geological and hydrological suitability, and having enough space.\n\n\"The shire doesn't have any land where we can start a new cemetery,\" shire chief executive officer Vernon Lawrence said.\n\n\"There's nothing within reasonable distance of town.\"\n\nVernon Lawrence says the state needs to make land available for a new town cemetery. (ABC Kimberley: Ted O'Connor)\n\nMr Lawrence wanted the state government and native title holders to help release potential sites on unallocated Crown land.\n\nHe said the only alternative for burials beyond 2027 was Wyndham, 100 kilometres away.\n\n\"Wyndham's got a lot of capacity … but if you have to drive 100km to visit relatives, that's not the best outcome for our community,\" Mr Lawrence said.\n\nThe cemetery is set to be full by 2027. (ABC Kimberley: Giulia Bertoglio)\n\n\"I think our community deserves something convenient, so I'd love government agencies to find a solution, one put together relatively quickly, and take this seriously.\"\n\n200km trip for a funeral 'unacceptable'\n\nKeith Wright says people should not be forced to drive to Wyndham for funerals. (ABC Kimberley: Giulia Bertoglio)\n\nMr Wright said Wyndham was an \"unacceptable\" option.\n\n\"For a community to have easy access where they can visit the burial site of their loved ones and friends, is vital,\" Mr Wright, who served for many years on the council, said.\n\n\"Travelling to Wyndham would be difficult; that road is not necessarily very safe, and it'd be absolutely disastrous if we ended up with an accident after people were attending a funeral in Wyndham.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/nobody-seems-to-want-an-afl-wildcard-round-so-why-is-it-here/105990976",
        "title": "Nobody seems to want an AFL Wildcard Round, so why is it here?",
        "publish_date": "Mon, 10 Nov 2025 01:48:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Say what you want about the tenure of AFL chief executive Andrew Dillon, but he has a remarkable ability to bring footy fans together and help them find common ground.\n\nClub loyalties may once have seemed an impenetrable bias to breach, but pause today for a casual glance across the usual battlegrounds of footy opinions and you will discover a ceasefire. Peace at last — a treaty forged from one resounding consensus.\n\nAlmost nobody wants a \"Wildcard Round\".\n\nLeaked on a Sunday afternoon and confirmed over Monday morning breakfast, Dillon has come in hot with the biggest shake-up to the AFL finals in 25 years.\n\nGone is the top eight with its familiar stakes and mechanisms. Here — in the fine print, at least — is a top 10 masquerading as an extra \"wildcard\" week of knockout fixtures.\n\nThe response from the general footy fan has been nearly unanimously negative. Few can see the value in extending post-season hope to the 10th-best team in an 18-team competition, and most can see through the confected drama it will apparently provide.\n\nThe Hawks and Swans played in Opening Round in 2025. (Getty Images: Michael Willson)\n\nWildcard Round is Dillon's latest calendar-extending innovation, following the equally maligned \"Opening Round\", which sees the season stutter into life with a handful of games on the east coast, at the small cost of throwing off the balance of the fixture entirely.\n\nThis year, if reports are to be believed, Opening Round will feature a game between St Kilda and Collingwood at the MCG, brought about because the Magpies told the league they did not want to travel for their first game again this season.\n\nIn that case, innovation has created a spiral of unintended consequences and issues to resolve — can any club simply tell the AFL when and where it feels like travelling now? How much of an advantage is two byes in a season?\n\nWildcard Round is another example of that flawed principle, a problematic solution to another problem the AFL created.\n\nThe pre-finals bye has been in place for nearly a decade now, and has become begrudgingly accepted by fans as part of the calendar.\n\nBut for a league determined to own 52 weeks and 365 days of the year, that black hole in the schedule is now unacceptable. And so a fifth week of finals has been created.\n\nAll of which takes us back to the main question at hand — why is any of this happening?\n\nDillon told the media on Monday he wanted \"more games of consequence\" each season, but you could safely trim that answer in half. Simply \"more games\" is the objective here.\n\nMore games means more tickets sold, more eyeballs on TVs, and a greater package to offer the broadcasters. More money, effectively.\n\nThe Lions claimed their second straight premiership in 2025. (Getty Images: Darrian Traynor)\n\nNext season, we will have State of Origin in February before Opening Round begins in early March. There will then be men's footy every week until the end of September, before we get straight into the all-consuming trade period and the November draft.\n\nIf 2026 mirrors the years before, the AFLW season will continue through those spring months. That time slot seems to be actively harming the success of that league, but the AFL's pursuit of omnipresence is currently outweighing a desire to make the women's competition all it could be.\n\nWith that in mind, any publicity is good publicity for the AFL. With summer creeping in and little more than a week out from an Ashes series, the AFL has still managed to command the sporting public and media's attention — an irony not lost during the compiling of the very words you are currently reading.\n\nIt is a slam dunk for AFL House, then. Debate and rancour in November 2025 and extra footy in September 2026 and beyond — everybody wins.\n\nThat the fans are unsettled by yet more innovation for innovation's sake is of little consequence.\n\nAfter all, they will all still turn up to watch 12th play 15th in round 22 as the heated season-long race for that coveted 10th spot captures the national imagination. Footy fans, it turns out, will still love footy no matter how bent out of shape it gets.\n\nThe sense that devotion is being exploited is palpable, though, and it would not be wise to test it too rigorously. Fans will forgive anything for the love of the game, up until the point they no longer recognise it.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/afl-richmond-sells-home-game-to-tasmania-first-time-ever/105991550",
        "title": "'Commercial considerations' see Tigers sell home AFL game to Tasmania",
        "publish_date": "Mon, 10 Nov 2025 01:38:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Richmond will host a nominal home AFL game in Tasmania for the next two seasons for the first time in the club's history.\n\nThe Tigers will play in Hobart in a multi-million-dollar deal, continue to host 10 MCG home fixtures, as well as an 11th MCG replacement game for members.\n\nThe deal comes ahead of Tasmania's scheduled entrance into the AFL in 2028.\n\nThe move means Richmond will not play home games at Melbourne's Docklands Stadium, a venue poorly attended by Tigers fans, but will play away games over the next two seasons.\n\nThree-time Richmond premiership coach Damien Hardwick made no secret of his dislike for Docklands Stadium during his tenure. (Getty Images: AFL Photos/Dylan Burns)\n\nRichmond has been vocal about its dislike for Melbourne's secondary AFL venue, with former coach Damien Hardwick saying in 2021: \"I hate coming here … our people don't come here, plain and simple.\"\n\nTigers chief Shane Dunne said the decision to play a nominal home game in Hobart was not taken lightly.\n\n\"Ultimately, it made sense on a number of levels,\" Dunne said in a statement on Monday.\n\n\"There are obviously commercial considerations, but the decision went well beyond that.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Importantly, this deal will give our members access to 11 games at the MCG — 10 home games and a replacement game — as well as our game in Tasmania.\n\n\"From a football perspective, we are hopeful that we can align our VFL fixture to this game, creating another opportunity for our developing list to travel together.\n\n\"These are invaluable experiences that will support the growth of the group.\"\n\nDunne said the club would tap into lengthy links with Tasmania, with club greats including Matthew Richardson, Jack Riewoldt, Royce Hart, Ian Stewart, Michael Roach, Brendon Gale and current captain Toby Nankervis all hailing from the island state.\n\nBut it would hope for a better result than the 48-point thrashing it copped in the away game in Hobart at the hands of North Melbourne in round 23 this year.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/us-president-donald-trump-booed-at-commanders-lions-nfl-game/105991162",
        "title": "Trump booed by crowd at NFL game in Washington",
        "publish_date": "Mon, 10 Nov 2025 00:51:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Donald Trump has become the first sitting US president in nearly half a century to attend a regular-season NFL game, appearing at the Washington Commanders' contest against the Detroit Lions.\n\nThere were loud boos from some spectators in the stands on Sunday when Mr Trump was shown on the video board late in the first half — standing in a suite with House Speaker Mike Johnson — and again when the president was introduced by the stadium announcer at half-time.\n\nThe jeering continued while Mr Trump read an oath for members of the military to recite as part of an on-field enlistment ceremony during the break in the game.\n\n\"I'm a little bit late,\" Mr Trump told reporters earlier when he got off Air Force One after landing at Joint Base Andrews, following a flyover of Northwest Stadium during the game.\n\nHe then got in his armoured car for the drive to the arena.\n\n\"We're gonna have a good game. Things are going along very well. The country's doing well. The Democrats have to open it up,\" he said — a reference to the government shutdown.\n\nIn the first quarter, before the president arrived, Lions receiver Amon-Ra St Brown celebrated a touchdown catch by pointing into the stands and moving his arms a la the \"Trump dance\" that several athletes began doing last year.\n\nDuring the third quarter, Mr Trump joined Fox broadcasters Kenny Albert and Jonathan Vilma for about eight minutes of lighthearted chat. Albert opened by asking Mr Trump about his time playing high school football at New York Military Academy.\n\n\"I played tight end, but it was not quite football like this. It was a little bit easier. It wasn't so tough,\" Mr Trump said.\n\nOnly two other times did a president go to an NFL game during the regular season while in office, according to the league: Richard Nixon in 1969 and Jimmy Carter in 1978.\n\nMr Trump became the first president to attend a Super Bowl while residing in the White House when he watched the Philadelphia Eagles beat the Kansas City Chiefs 40-22 in February.\n\nAccording to a report by ESPN on Saturday, an intermediary for the White House told the Commanders' ownership group that Mr Trump wanted the club's new stadium — part of a nearly $US4 billion ($6 billion) project in the nation's capital at the site of what was known as RFK Stadium — to bear his name.\n\nMr Trump has, from the 80s onwards, sought to become an owner of an NFL team, though he has never succeeded.\n\nHe did, however, become the team owner of the New Jersey Generals in the rival United States Football League (USFL), and led the league in a lawsuit against the NFL to attempt to force a merger, which the USFL nominally won before disbanding soon after.\n\nDonald Trump received a mixed reaction from the Washington crowd. (AP Photo: Jacquelyn Martin)\n\nIn Sunday's TV appearance, Mr Trump spoke about the team's plans to return to Washington.\n\n\"They're going to build a beautiful stadium. That's what I'm involved in, we're getting all the approvals and everything else,\" he said.\n\n\"And you have a wonderful owner, Josh [Harris] and his group, and you're going to see some very good things.\"\n\nSunday's visit was the latest in a series of high-profile appearances at sporting events by Mr Trump, including at golf's Ryder Cup, auto racing's Daytona 500 and tennis's US Open.\n\n\"I just love it. It's a microcosm of life,\" Mr Trump said about sports during Sunday's broadcast.\n\n\"It's sort of like life — the good, the bad and the ugly.\"\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nBefore the game, Defense Secretary Pete Hegseth chatted with Mr Harris — the leader of the group that purchased the Commanders from Daniel Snyder for about $US6 billion in 2023 — and took part in an on-field ceremony with members of the military.\n\nMr Hegseth was among those watching the game with Mr Trump, along with White House chief of staff Susie Wiles, Education Secretary Linda McMahon and Republican senator Steve Daines of Montana.\n\nThere was friction between Mr Trump and the NFL during his first presidential term, when he objected to players kneeling during the national anthem to protest social or racial injustice. That movement began in 2016 with then-49ers quarterback Colin Kaepernick.\n\nVia social media and other public comments, Mr Trump insisted that players should stand for the national anthem and called on team owners to fire anyone taking a knee.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/nsw-john-laws-radio-industry-tributes/105990642",
        "title": "'Radio has lost its king': Hosts pay tribute to John Laws",
        "publish_date": "Mon, 10 Nov 2025 00:47:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sydney's airwaves went live on a sombre note this morning following the death of radio titan John Laws.\n\nLaws's family said he died peacefully in his Woolloomooloo home in Sydney's inner-city over the weekend just two weeks after being released from hospital.\n\nHe was 90 years old.\n\nJohn Laws died peacefully in his Woolloomooloo home, his family said on Sunday. (ABC News: Keana Naughton)\n\nWhile his primary success came from talkback radio, Laws lent his iconic voice to radio and TV commercials, and at times appeared on the small screen as a presenter, interviewer and talk-show panellist.\n\nHe also released several singles as a country music singer and was a published poet.\n\nLaws dominates airwaves one last time\n\nOn Monday morning, both AM and FM radio stations dedicated air-time to broadcast snippets of his catalogue across his 71-year legacy.\n\n2SM, the network which the veteran broadcaster retired from just over a year ago after a 13-year stint, aired segments from Laws's popular morning show, including a chat with regular listener Dale, who was known for calling in to speak with the host every Thursday.\n\nOn 2GB host Ben Fordham opened his show with a lengthy tribute to Laws, declaring to listeners that \"radio has lost its king\".\n\nBen Fordham paid tribute to Laws as a \"master communicator\". (AAP: Joel Carrett)\n\nHe revealed the pair saw each other just 10 days ago, having met Laws at his home because he was \"too stubborn\" to cancel lunch due to his health.\n\n\"He was strong and stubborn and silly right to the very end,\" Fordham said.\n\n\"John Laws was a master communicator, he could have important conversations with politicians but he also connected with the truckies and the taxi drivers ... everyone felt like they knew Lawsy.\"\n\nTalkback marks 'end of an era'\n\n2GB presenter Mark Levy said it was a sad day. (Supplied: 2GB)\n\nFellow 2GB host Mark Levy paid tribute to both Laws and Labor statesman Graham Richardson, who died only the day before aged 76.\n\n\"It's a sad and sombre day,\" he said.\n\n\"They both left an indelible mark on this country and the outpouring of grief emphasises the respect and admiration they both built making and influencing the decisions that helped shape Australia today.\n\n\" The passing of these two giants marks the end of the era, a time when power in Australia was often not just wielded in parliament, but also through the sheer force of personality and the persuasive influence of the microphone. \"\n\nHe described Laws's show of national conversation and a daily public forum for politics.\n\n\"The public felt their concerns were not only heard but amplified [when] speaking to Lawsy,\" Levy said.\n\nBrendan Jones from WFSM recounted his relationship with Laws.\n\n\"I wasn't sure what he made of me,\" Jones said.\n\n\"I don't think we were great mates, but we did hang out.\"\n\nLoading Instagram content\n\nHe said Laws had \"the theatre of the mind\", which had inspired him early on his career.\n\n\"When I started in radio in 1990, we used to have to play his show, we used to have to record his show and replay it to WA because we were three hours behind,\" he said.\n\n\"That's when I really fell in love with broadcasting.\"\n\nKISS FM host Kyle Sandilands led tributes shortly after news of Laws's death emerged on Sunday night.\n\nSandliands was known for trading barbs with Laws over the years, but said he was devastated to lose \"a mentor and mate\".\n\nState funeral a possibility\n\nNSW Premier Chris Minns said he was open to holding a state funeral for the radio veteran.\n\nThe premier told Channel 9 he would discuss with Laws's family the best way to honour him.\n\n\"We do everything we can to acknowledge his legacy and reputation for Australia and broadcasting, so if they would like to do it, we'd love to offer it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/princes-highway-pothole-nar-nar-goon-damages-dozens-vehicles/105810482",
        "title": "'Mayhem' as dozens of cars hit pothole in Melbourne's east at high speeds",
        "publish_date": "Mon, 10 Nov 2025 00:36:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Pakenham woman says she will struggle to afford repairs to her tyres after hitting a \"half-a-metre\" deep pothole that forced more than 20 cars to pull over on the Princes Highway at Nar Nar Goon on Saturday.\n\nDrivers were forced into the emergency lane of the highway amid heavy rain to change their tyres or wait for help.\n\nBut with low visibility, drivers who had pulled over were frightened of further accidents.\n\n\"There were so many almost accidents, it was pretty scary, I thought we were going to get hit at one stage,\" Pakenham resident Bronwyn Drummond told the ABC.\n\nMs Drummond was driving with her three children in the car when she heard a loud bang.\n\n\"It was the biggest bang and we knew straight away we had to pull over,\" Ms Drummond said.\n\n\"At that stage there were probably 30 cars pulled over and it was just mayhem.\n\n\"We blew two tyres, the car in front of us had also hit it so they slammed on their brakes and pulled over.\"\n\nBronwyn Drummond says replacing damaged wheels will cost thousands of dollars. (Supplied: Bronwyn Drummond)\n\n'Going to cost us thousands'\n\nMs Drummond waited on the roadside for her husband to come.\n\nThe pothole is understood to have been half a metre deep. (Supplied: Facebook)\n\nIt was two hours before they could keep going.\n\n\"The poor thing was in the rain the whole time trying to change these tyres, he was drenched,\" Ms Drummond said.\n\n\"It was a really long line, there was tow trucks there, some people pulling over — car after car just checking.\"\n\nMs Drummond said she expected the damage to cost her family thousands of dollars.\n\n\"This is our main family car, it's going to cost us thousands and thousands,\" Ms Drummond said.\n\n\" We're already behind on bills, we don't know how we're going to fix it, we have to come up with the money before we can even try and claim for it. \"\n\nRoad maintenance skipped, opposition says\n\nVictorian National Party leader and Shadow Roads Minister Danny O'Brien said the Coalition believed resurfacing and resealing works had not been carried out in summer periods to prevent potholes.\n\n\"It's not the fact it opened up quickly … but it's how it got to this stage,\" Mr O'Brien said.\n\n\"We went a couple of summer seasons there with zero resealing programs.\n\n\"That's the work that actually seals the road and stops the water getting in and forming potholes in the first place.\"\n\nMore than 20 cars were damaged, with tyres blown and tow trucks called. (Supplied: Michelle Snape)\n\nMichelle Snape was on her way home to Warragul when she hit the pothole shortly after 4pm.\n\nDue to the influx of calls, she waited hours for roadside assistance.\n\nIt was 10pm before she could keep driving.\n\n\"I was talking to friends while waiting and I said, 'Look, the pothole is getting fixed before my car,'\" Ms Snape said.\n\nMs Snape called Triple Zero (000) straight away.\n\nThe pothole has been patched. (Supplied: Facebook)\n\n\"There's so many ambulances with passenger transport going up and down there … at least 10 that went past after the accident and they're so low, they'd be wrecked,\" Ms Snape said.\n\n\"If motorbikes went through, they would have flipped over, they would have been gone.\n\n\"It was at least a metre long, half a metre deep and just full of water.\n\n\"No-one would have seen it because it was the same colour as the road.\n\n\"Our poor roads, Gippsland just doesn't get looked after.\"\n\nThe Victorian Department of Transport has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/mental-health-patients-face-waits-in-sa-emergency-departments/105990492",
        "title": "Emergency department waits of 35 hours for some SA mental health patients, AMA warns",
        "publish_date": "Mon, 10 Nov 2025 00:33:13 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "One-in-10 mental health patients in South Australian hospital emergency departments are waiting \"more than 35 hours\" for a bed, according to an Australian Medical Association (AMA) report.\n\nThe wait times, equivalent to a day-and-a-half, were the \"worst result nationally for this metric\" in the AMA's Public Hospital Report Card: Mental Health Edition.\n\nSA Labor has pivoted from health to housing If Labor’s 2022 campaign was all about ambulance patients locked out of hospitals, then 2026 is all about young people locked out of home ownership.\n\nThe report, which compared wait times in 2023-24 to previous financial years, found an admitted mental health patient was waiting 11 hours and 18 minutes.\n\n\"That's not good, because we know the emergency department is not the best place for mental health conditions,\" AMA SA president Peter Subramaniam told ABC News.\n\nDr Subramaniam said a mental health patient's condition could often escalate during those long wait times.\n\n\"There is a certain group that will always require acute care,\" he said.\n\n\"[But] we need to see what we can do to provide the health care, the mental health care, or mental health support for patients before they require emergency departments.\"\n\nVascular surgeon Peter Subramaniam says new beds are welcome but additional hospital capacity alone will not fix the problem. (ABC News: Sarah Maunder)\n\nAccording to the AMA report, the number of mental health public hospital beds respective of the population was \"above the national average\" — but so was the rate of mental health-related ED presentations.\n\n\"The median patient who is eventually admitted now waits nearly four-and-a-half hours longer than they did four years ago (2019-20) — a 70 per cent increase over the past decade,\" the report stated.\n\n\"Extended ED wait times and ambulance ramping are symptoms of a system in gridlock, where overworked staff are unable to admit new patients due to exit block, under-resourced facilities, and broader systemic pressures.\"\n\n'Different model of care'\n\nThe report came ahead of 48 new hospital beds opening on Tuesday as part of a $74 million expansion of Noarlunga Hospital.\n\nThe extra beds include 24 new mental health beds which were first announced more than two years ago.\n\nHealth Minister Chris Picton said they would reduce pressure on the system.\n\n\"I wish we could have clicked our fingers and had these beds open three years ago, but building mental health beds and capacity takes a really long time,\" he told ABC Radio Adelaide on Monday.\n\n\" These are a different model of care, a lot of these extra beds, in that they're rehabilitation beds, so they're giving people a longer stay to make sure that when they leave hospital it doesn't become a revolving door and they bounce back into hospital shortly afterwards. \"\n\nThe SA government says new beds will soon be opening at Flinders Medical Centre, where the hospital is currently undergoing a major expansion. (ABC News: Che Chorley)\n\nMr Picton said 24 beds were \"about to open\" at Modbury Hospital, with another 12 at Flinders Medical Centre.\n\n\"The truth of the matter is, though, that the people who are … getting stuck waiting for beds in emergency departments, often they're people with conditions such as schizophrenia, people with acute psychosis,\" he said.\n\n\"They aren't necessarily the people we can easily get into a Medicare mental health centre or other service.\"\n\nDr Subramaniam said the new beds were welcome, but additional hospital capacity alone would not fix the problem.\n\nHe said increasing patient access to psychologists, acute care crisis teams and GP \"shared care programs\" were key to addressing the problem.\n\n\"You can't criticise the government for having additional beds because that's a step in the right direction,\" he said.\n\n\"But what we want — and seeing that we're coming up to a state election — is for both parties to have a clear community mental health program which is not just an announcement — it's funded, it's got the right workforce configuration, and has the capacity to [take] us into the future.\n\n\"This is a complex problem, but governments are elected to solve complex problems.\"\n\nAuditor-general says SA's big three hospital projects delayed The South Australian government's three costliest hospital projects have all had \"delays in starting construction\", according to the auditor-general — but the health minister says they remain on schedule.\n\nOpposition leader Vincent Tarzia said too many patients were \"still falling through the cracks\" and that there was a need for \"many more resources dedicated to mental health in this state\".\n\nHe said the opposition would be \"announcing a suite of policies dedicated to mental health\" but said ramping was a significant contributing factor to the excessive waiting times.\n\n\"For 41 months it's been the worst it's ever been and because of that you're now seeing that affect issues like mental health,\" Mr Tarzia said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/rba-warns-economic-growth-could-stay-in-slow-lane-rates/105989680",
        "title": "RBA warns economy in danger of being indefinitely trapped in slow growth lane",
        "publish_date": "Sun, 09 Nov 2025 23:30:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank has expressed concern the Australian economy may be trapped in the slow lane of economic growth, indefinitely.\n\nThis would suppress wage growth and household income for millions of Australians for decades.\n\nThe silver lining is that the central bank believes there is still time for the economy to break free, find clear air and grow faster than its long-term average.\n\n\"Could Australia find itself trapped on the economic rail like one of the riders in last week's Cup — boxed in by its own capacity constraints?\", deputy governor of the Reserve Bank Andrew Hauser asked a Sydney gathering of investment bankers and economists today.\n\n\"Or will it find ways to break free, through higher productivity and more investment in new capacity?\n\n\"If it does, we could be off to the races,\" he said.\n\nIn simple terms, Mr Hauser says if Australia can boost productivity, the capacity of the economy will expand, and it will be able to tolerate more demand without higher inflation.\n\nInflation tame, but there's a problem\n\nOfficial third-quarter inflation figures show some price hikes came roaring back in the economy.\n\nFingers were pointing at the cost of energy.\n\nIt had economists convinced the RBA would leave interest rates on hold at its November meeting.\n\nThe RBA, though, today has reiterated that it is not concerned about the medium-term inflation outlook.\n\n\"The further decline in inflation through the end of 2024 and into 2025 gave us greater confidence that it would return sustainably to target over the medium term,\" Mr Hauser said.\n\nThe problem is that unless productivity picks up, and the RBA inflation models assume it will, increased demand in the economy will put upward pressure on inflation.\n\nThat is because, as Mr Hauser puts it, the economy as it stands is operating at or close to full capacity.\n\n\"Most recoveries in GDP growth over the past 40 years typically start with some margin of spare capacity — a negative 'output gap' — as the preceding slowdown pushes the level of aggregate demand below estimates of the potential output of the economy,\" he said.\n\nHe is making the simple point that an economic growth phase requires some degree of spare capacity.\n\n\"As the economy recovers, that buffer typically provides room for a period of above-trend growth in activity and employment, as demand rises back towards potential output, without generating excessive inflationary pressures,\" Mr Hauser said.\n\nRight now, the Australian economy does not appear to have that, so if economic growth accelerates, it will be joined by higher inflation.\n\nMatter of urgency\n\nWorse still, it is possible, the Reserve Bank says, the Australian economy is currently operating above capacity, at the start of a hoped-for economic growth phase.\n\n\"This time looks different,\" Mr Hauser said.\n\n\"Our central estimate suggests that demand was slightly above potential output at the time GDP growth started to pick up last year — the tightest economic backdrop to a recovery since at least the early 1980s.\"\n\nMr Hauser believes the problem stems from the \"cumulative effect of rapid demand growth in 2021-2022, the deliberately cautious monetary policy strategy of more recent years, and — importantly — weak growth in supply\".\n\nCritical point for economy\n\nIt is possible, Mr Hauser points out, that \"there's more capacity today than the estimates suggest\".\n\nIn this world, \"further policy easing may be necessary at some horizon\", which would no doubt be welcomed by millions of mortgage borrowers.\n\nBut the deputy governor's second scenario is centred on a fear \"that the economy may find itself boxed in by its own capacity constraints, like a racehorse trapped against the course fence, unable to surge forward\".\n\n\"On that view, there may be little scope for demand growth to rise further without adding to inflationary pressures, and hence there may be little room for further policy easing.\"\n\nIn this environment, millions of households find it difficult to get ahead because any expansion of the economy results in higher inflation.\n\nThe Reserve Bank, however, wants to remind policy makers that Australia has what it takes to be a world-leading advanced economy, \"with extraordinary minerals resources, old and new\".\n\nMr Hauser described world-class universities and human capital, Australia enjoying a plumb geographical position in the Asia Pacific, huge domestic savings pool, the second largest median wealth per capita in the world, a strong banking system, proven political and economic institutions, and a long track record of welcoming foreign capital and labour.\n\n\"If that doesn't scream 'investment potential', I don't know what does,\" he said.\n\n\"Seize that opportunity, and we really could be off to the races.\"\n\nHousing versus productivity\n\nAustralia's extraordinary median wealth per capita, strong banking system, along with foreign capital and labour has also, according to analysts, assisted in pushing property prices to record highs.\n\nAnd economists say that, in turn, has sucked investment away from areas of the economy with more productive potential than the housing market.\n\n\"Yes, to a certain extent,\" RSM Australia economist Devika Shivadekar said.\n\n\"High demand for property means there's always a need for labour.\n\n\"Being a comparatively low-skilled sector, most of the younger talent naturally gravitates towards building jobs, easier to get working straight from high school, rather than developing technical skills that can help prop up other industries.\"\n\nOther economists say record property prices have stifled Australia's economic capacity more indirectly.\n\n\"The poor productivity growth in the housing sector has also hurt [Australia's] ability to supply,\" AMP's deputy chief economist Diana Mousina said.\n\n\"The two are so interconnected.\n\n\"I [also] think our tax system and our migration system has created the housing problem that we are in.\"\n\nMeanwhile, Betashares chief economist David Bassanese says incentives for share investors also deserve some of the blame for Australia's weak productivity.\n\n\"I would say the love affair with dividends and franking instead perhaps has [hurt productivity] as it encourages firms to pay out dividends [rather] than reinvest for growth,\" he said.\n\nFirms reinvesting for growth is precisely what the Reserve Bank believes is a critical pillar for supporting productivity in the Australian economy.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/f1-drivers-standings-oscar-piastri-lando-norris-max-verstappen/105990568",
        "title": "Equation tougher for Piastri as Norris extends lead in F1 championship",
        "publish_date": "Sun, 09 Nov 2025 23:14:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "On a weekend where a lot of things needed to go right for Oscar Piastri, pretty much everything went wrong for the Australian.\n\nPiastri entered the São Paulo Grand Prix weekend trailing his teammate Lando Norris by one point in the drivers' championship standings.\n\nAt the end of the weekend, Piastri's deficit is now 24 points, and his hopes of a maiden world championship appear to be fading fast.\n\nHere is how the championship standings are poised heading into the final three rounds of the season.\n\nLando Norris takes big lead in the F1 standings\n\nNorris was excellent in Brazil.\n\nHe was the fastest in the qualifying sessions for the sprint race and the grand prix.\n\nPiastri's F1 title hopes take massive blow Oscar Piastri's Formula 1 title challenge has taken another blow, with a controversial penalty costing the Australian in Brazil.\n\nOn both occasions, he converted pole position into victory to claim the maximum 33 points for the weekend.\n\nIn doing so, he extended his margin to both Piastri and Red Bull's Max Verstappen.\n\nPiastri crashed out on lap six of 24 in the sprint race, and a penalty in the grand prix restricted the Australian to finishing fifth. That netted the Australian 10 points for the weekend.\n\nMax Verstappen had a better weekend, placing fourth in the sprint race and finishing third in the grand prix.\n\nThat yielded Verstappen a total of 20 points, but the Dutchman may wonder what could have been.\n\nAfter a horrid qualifying for the grand prix, where he was 16th fastest, the Red Bull driver started the race on Monday morning AEDT from the pit lane.\n\nDespite that, Verstappen was just 10 seconds behind Norris at the end of the grand prix. Verstappen was not only the best driver on the track, but he also had the fastest car. With a better grid position, he could have won that race.\n\nAt the end of round 21, Norris leads the championship with 390 points.\n\nPiastri is 24 points behind on 366, while Verstappen is a further 25 points adrift on 341.\n\nWhat does Norris have to do to win the F1 title?\n\nLando Norris is in pole position to claim his maiden Formula 1 drivers' championship.\n\nWith three rounds remaining, his 24-point lead to Piastri is massive when you consider a driver receives 25 points for a grand prix win.\n\nThere are three grands prix and one sprint race left this season, with a maximum of 83 points available.\n\nAs it stands, Norris does not need to win another race this season to become champion.\n\nIf Piastri won all four remaining races this season, he would end the year on 449 points.\n\nIf Norris finished second in all four races, he would score 61 points and finish with a total of 451 points, winning the world championship by two.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\n\"I think in terms of the championship, there's no point thinking about it very much,\" Piastri said after the grand prix in Brazil.\n\n\"There's clearly some things we need to sort out. Just a tough weekend from a number of fronts, so I'll focus on that instead.\"\n\nVerstappen almost certainly would need to win every race remaining this season and have both McLarens struggle to claim the championship for a fifth consecutive year.\n\nThe next race is the Las Vegas Grand Prix, which will be held on Sunday, November 23.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/f1-brazil-oscar-piastri-penalty-explained/105990632",
        "title": "Why Piastri was handed a controversial 10-second penalty in Brazil",
        "publish_date": "Sun, 09 Nov 2025 23:09:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Oscar Piastri's hopes of winning his maiden Formula 1 drivers' championship this season have been severely damaged, and a contentious penalty in Brazil has worsened the blow.\n\nPiastri was penalised for causing a collision during Monday's (AEDT) São Paulo Grand Prix at Interlagos, which resulted in Ferrari's Charles Leclerc crashing out of the race.\n\nThe stewards handed Piastri a 10-second penalty, which robbed the Australian of the chance to finish on the podium and lessen the deficit to race winner and championship leader, Lando Norris.\n\nPost-race, Piastri was clearly frustrated by the penalty, while Leclerc, who had his race ended by the incident, believed the Australian should not be given all of the blame.\n\nWhat happened in the crash?\n\nThe flashpoint of the grand prix came on lap six of 71.\n\nThe drivers had been behind the safety car following a crash to Sauber driver Gabriel Bortoleto on the first lap.\n\nPiastri's F1 title hopes take massive blow Oscar Piastri's Formula 1 title challenge has taken another blow, with a controversial penalty costing the Australian in Brazil.\n\nAt the end of the fifth lap, the safety car pulled into the pits and race leader Norris was in control of the field to restart racing on lap six.\n\nWhen Norris put his foot down, it appeared to catch second-place driver Kimi Antonelli (Mercedes) off guard.\n\nAs Norris drove off to the first corner, Antonelli was swarmed by third-placed Leclerc and fourth-placed Piastri.\n\nThe trio arrived at the first corner together — a tight left-hand turn that goes downhill.\n\nLeclerc had gone around the outside of Antonelli, while Piastri had taken the inside line.\n\nAntonelli was marginally ahead of Piastri as they both went for the apex of the corner.\n\nAs Antonelli cut across Piastri's line, the Australian slammed on the brakes and briefly locked his front tyres.\n\nPiastri hit the side of Antonelli's car. The shunt forced Antonelli's Mercedes across the track and into the Ferrari of Leclerc, who was an innocent bystander.\n\nPiastri moved into second place as Antonelli and Leclerc went off the track.\n\nAntonelli was able to rejoin in third place, while Leclerc lost a wheel on his Ferrari and was forced to retire.\n\nWhy was Piastri penalised for the crash?\n\nPiastri, now in second place, immediately got onto his team radio to protest that the crash was not his fault.\n\n\"He left me no space,\" Piastri said, referring to Antonelli.\n\nBut the race stewards took a very different view.\n\nAfter investigating the incident, the stewards deemed that the Australian was \"wholly responsible for the collision\", and penalised him 10 seconds, which was served during Piastri's first pit stop.\n\nThis was the explanation given by the stewards:\n\nAt the Safety Car restart on Lap 6, Car 81 (Oscar Piastri) attempted to overtake Car 12 (Kimi Antonelli) on the inside of Turn 1. In doing so, PIA did not establish the required overlap prior to and at the apex, as his front axle was not alongside the mirror of Car 12, as defined in the Driving Standard Guidelines for overtaking on the inside of a corner. PIA locked the brakes as he attempted to avoid contact by slowing, but was unable to do so and made contact with ANT. This contact caused ANT to make secondary contact with Car 16 (Charles Leclerc), who was positioned on the outside and was forced to retire from the race as a result. PIA was therefore wholly responsible for the collision.\n\nThe main reason the stewards deemed Piastri at fault was for not being close enough to the front of Antonelli's car.\n\nFor several years, a guideline for any driver passing on the inside is to have the front axle at least alongside the mirror of the rival they are attempting to overtake.\n\nBy not meeting this, in the stewards' determination, Piastri was in the wrong spot and this is the reason contact was made between him and Antonelli.\n\nThe stewards also noted that Piastri had locked his brakes going into the corner. Having control of the car is something the stewards would have also considered when making their decision.\n\nDespite not being explicitly stated, the locking of the brakes from Piastri would not have helped his cause during the stewards' investigation.\n\nWas Piastri unlucky to receive a 10-second penalty?\n\nTo the letter of the law, the stewards probably made the right call.\n\nHowever, trying to have black-and-white rules in a sport that is in a state of perpetual grey areas is fraught with danger and inconsistency.\n\nAs the three drivers approached the corner, there was plenty of space for all three if they stayed in their lanes.\n\nPiastri clearly had a car's width of room as he approached the corner, and that was quickly taken away when Antonelli turned in on the Australian.\n\nDrivers are required to give opponents at least a car's width if they are battling.\n\nThree-time W Series champion, and Sky Sports pundit, Jamie Chadwick said she felt the only driver who did not use the space well was Antonelli.\n\n\"The person who hasn't used all the room is Kimi [Antonelli] for me,\" Chadwick said post-race.\n\n\"So I'm on the side where Oscar has been hard done by. I feel like he [Antonelli] could've held position but made his life easier.\"\n\nThe stewards could have also deemed the collision as a racing incident, something often cited when contact is made but no driver had necessarily done anything wrong.\n\nMany collisions, usually on the first lap of a race, are deemed racing incidents because so many cars are in a small section of the circuit.\n\nWith that precedent, there is an argument to be made that the collision between Piastri and Antonelli could have been deemed a racing incident because it was the first corner after a safety car restart.\n\nBut again, the stewards were not siding with the Australian and whacked him with the penalty.\n\nWhat did the drivers say about the crash?\n\nPiastri cut a frustrated figure in the media pen after the race.\n\nHis title hopes had been damaged, and he finished lower than hoped due to a contentious penalty.\n\nOscar Piastri moved into second after overtakeing Kimi Antonelli and Charlec Leclerc, but was penalised for making contact during the move. (Reuters: Amanda Perobelli)\n\nSpeaking to Sky Sports, Piastri did not believe he could have done anything else, and he was not given enough space by Antonelli.\n\n\"I had a very clear opportunity, I went for it,\" Piastri said.\n\n\"The other two [Antonelli and Leclerc] on the outside braked quite late.\n\n\"There was obviously a bit of a lock-up into the corner, but that was because I could see Kimi [Antonelli] wasn't going to give me any space.\n\n\"I can't disappear, but the decision is what it is.\"\n\nAntonelli, unsurprisingly, took a different view of the incident, with the teenager stating he needed to leave room for Leclerc on the outside.\n\n\"[Piastri] locked up and started to miss the apex,\" Antonelli said. \"It was a big hit, to be fair.\"\n\nPiastri did find an ally — of sorts — in Leclerc, who was taken out of the race by no fault of his own.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nAfter seeing the replay, Leclerc described Piastri's overtaking attempt as \"optimistic\", but, unlike the stewards, did not believe the crash was all on the Australian.\n\n\"Oscar was optimistic, but Kimi knew Oscar was on the inside … and he kind of did the corner like Oscar was never there,\" Lelcerc said.\n\n\"For me, the blame is not all on Oscar.\n\n\"Yes, it was optimistic. But this could have been avoided.\"\n\nWhat is next for Piastri's championship fight?\n\nThere are three rounds left in the Formula 1 season, and Oscar Piastri has an uphill battle to win the championship.\n\nNorris leads with 390 points, 24 points ahead of Piastri on 366.\n\nThere are three grands prix and one sprint race left this season, with a maximum of 83 points available.\n\nIf Piastri won all four remaining races this season, he would end the year on 449 points.\n\nIf Lando Norris finished second in all four races, he would score 61 points and finish with a total of 451 points — winning the world championship by two.\n\nPiastri almost certainly needs to win the three remaining grands prix, and then needs Norris to have a dip in form, to become Australia's first driver's champion in 45 years.\n\nThe next race is the Las Vegas Grand Prix, which will be held on Sunday, November 23.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/homelessness-in-regional-wa-depicted-in-exhibition-at-canberra/105979292",
        "title": "Homelessness in regional WA takes national stage in Canberra exhibition",
        "publish_date": "Sun, 09 Nov 2025 22:50:13 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Intimate portraits depicting homelessness in Western Australia's Midwest have been spotlighted on a national stage at Canberra Parliament House.\n\nThe Journey of Belongings exhibition, started by outreach service Centacare's Housing First team, displayed the powerful stories of people living on the streets of Geraldton, about 400 kilometres north of Perth.\n\nCentacare senior support worker Michelle Hall said the project aimed to spread awareness of the growing impact the housing crisis had on the region.\n\nRobert, who has experienced homelessness in Geraldton, had his portrait taken for the exhibition. (Supplied: Centacare/ Trevor Pickett)\n\nBreaking the stigma\n\nCreated for Homelessness Week in August, 19 portraits were captured to shed light on those living in the shadows.\n\n\"When you actually see a photo in front of you with their story, it's more than just somebody you walk past on the street,\" Ms Hall said.\n\n\"[This exhibit] is really opening the eyes to the community that everyone has a story and everybody deserves to belong.\"\n\nThe exhibit followed the stories of people who have been provided services by Centacare in Geraldton. (Supplied: Centacare/ Trevor Pickett)\n\nMs Hall said the housing crisis was forcing people onto the streets, but stigma was still rife in the community.\n\n\"There is a housing shortage … we've found a lot of new people are in situations without a roof over their head for the first time,\" she said.\n\n\"There's no set image of someone who is homeless; it can be an individual, right through to families.\n\n\" If you do see someone rough sleeping, it's OK to say hello and check in to make sure they're OK. \"\n\nTwo men who have experienced homelessness in Geraldton. (Supplied: Centacare/ Trevor Pickett)\n\nPhotographer Trevor Pickett, commissioned by Centacare to take the portraits, said the experience revealed to him how widespread homelessness was.\n\n\"It was quite an eye-opener for me because I didn't realise how many people were in those types of situations,\" he said.\n\nTrevor Pickett says the project exposed him to the prevalence of homelessness. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nMr Pickett said people felt comfortable opening up to him about their story.\n\n\"It's incredible what they've pushed through … it's pretty impressive,\" he said.\n\n\"Even after the little exhibition, the people [I took photos of] came up to me and would say, 'Man, those photos are perfect.'\"\n\nMichelle Hall (right) with colleagues at the exhibition showing at Parliament House. (Supplied: Centacare)\n\nExhibit goes national\n\nIn October, Centacare was invited by the Catholic Social Services of Australia to show the exhibition in Canberra for the parliamentary advocacy summit.\n\nThe images were unveiled alongside discussions of homelessness and the future of social services.\n\nMs Hall says she hopes the exhibition brings more awareness to the effects of homelessness. (Supplied: Centacare/ Trevor Pickett)\n\nMs Hall said there was still more awareness and investment needed for the sector.\n\n\"Each portrait in the exhibition highlights where someone's been and that we still have a lot left to do in the space of homelessness and housing,\" she said.\n\n\"We've definitely seen an increase [in homelessness] in Geraldton.\n\n\" I just want to keep those conversations going because it won't go away if we just ignore the situation. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/cable-car-kunanyi-mount-wellington-recommendations/105989592",
        "title": "Kunanyi/Mount Wellington cable car included in draft recommendations",
        "publish_date": "Sun, 09 Nov 2025 22:21:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "The managing authority for Hobart's Kunanyi/Mount Wellington has questioned why a draft plan for the mountain includes a recommendation for a cable car, documents released under Right to Information (RTI) laws show.\n\nWellington Park Management Trust's July minutes show the State Growth Department briefed the trust on a state government strategic review of management of the mountain and Wellington Park.\n\n\"Trust members questioned why the cable car was included as a draft recommendation,\" the minutes read.\n\n\"In response, the presenters advised that there was a recognised need for all-weather access and other methods of transport.\"\n\nTasmanian Greens deputy leader Vica Bayley said the draft recommendations were \"deeply disturbing\".\n\n\"It wasn't part of the consultation, a strong recommendation or theme that a cable car be built,\" Mr Bayley said.\n\nTransport review for Kunanyi/Mt Wellington announced Hobart's Kunanyi/Mt Wellington attracts more than 400,000 visitors per year, most who drive up a winding road to reach its summit. A review of transport options and the park's management will soon kick off — and will likely include talk of a cable-car.\n\nThe latest cable car proposal was rejected by the Hobart City Council, nine votes to three, in 2022.\n\nThe proponent, the Mount Wellington Cableway Company, appealed against the council's decision to the Tasmanian Civil and Administrative Tribunal (TASCAT), but the appeal failed.\n\nTASCAT found the proposal did not meet standards around noise, visual impact and impacts on geo heritage and biodiversity.\n\nThe Mount Wellington Cableway Company has since laid low. However, during the submission period last year for the strategic review, it called on the public to support its cable car plan.\n\nThe company has welcomed the news that a cable car may be recommended in the action plan for the mountain, but declined to comment on whether it planned to put forward another proposal for one.\n\nMr Bayley said the issue \"should have been settled\".\n\nVica Bayley has described the draft recommendations as \"deeply disturbing\". (ABC News: Ebony ten Broeke)\n\n\"This is an issue that's been rejected by the community and by the planning appeals tribunal, because it's not consistent with protecting the values of the mountain,\" Mr Bayley said.\n\nBusiness, Industry and Resources Minister Felix Ellis said the department was \"consulting on all potential options to feed into the strategic review's action plan\".\n\n\"The evidence is clear that we need sustainable, long-term solutions for transport on the mountain,\" Mr Ellis said.\n\nFeedback points out 'commercial' focus\n\nEach of the draft recommendations in the government's review were blacked out before the documents were released under RTI, but the documents did include the feedback given by the Wellington Park Management Trust.\n\nThere have been multiple proposals for a cable car on Kunanyi/Mount Wellington. (Supplied: MWCC)\n\nResponding to one of the recommendations, the trust said it did not support a focus on building visitation \"over and above organic growth, before current visitation can be supported\".\n\n\"The purposes for which WP [Wellington Park] was set aside include to provide recreational and tourism uses and opportunities, but not to proactively grow visitation,\" the trust wrote.\n\n\"There appears to be an overarching repositioning of Wellington Park as a commercial tourism product.\n\n\"Actively building visitation (over and above organic growth) before current visitation can be safely accommodated is not supported.\"\n\nMountain review reflects community split\n\nTasmanians have long been divided over the value of a cable car on Kunanyi/Mount Wellington.\n\nAboriginal Heritage Officers lodge anti-cable car submission Aboriginal Heritage Officers have criticised the Indigenous heritage assessment conducted by an interstate consultant.\n\nSince the first proposal in 1905, multiple plans have been put forward.\n\nWhen the latest iteration was rejected by the Hobart City Council, 10,000 people viewed the live stream of the meeting, while the development proposal received 16,537 public submissions.\n\nIn May 2024, the then-responsible minister, Eric Abetz, announced a \"strategic 12-month review\" into the management of the mountain and the broader Wellington Park.\n\nKunanyi/Mount Wellington attracts more than 400,000 locals and tourists each year.\n\nThe review intended to assess how to improve land management, transport options, visitor infrastructure and cultural experiences on the site.\n\nCable car proposals have divided the community. (Supplied: Rob Blakers)\n\nIn more than 9,000 public submissions to the review, support for and against a cable car featured heavily.\n\n30 per cent specifically mentioned their support for one, while 28 per cent mentioned their opposition.\n\nWhen the government's review was announced, some local residents feared it would reignite plans for a cable car. At the time, the government dismissed those concerns.\n\nThe government's plan for the mountain is due to be finalised early next year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/mildura-hospital-caught-copy-pasting-feedback-figures/105973940",
        "title": "Regional Victorian hospital caught copying and pasting complaints data",
        "publish_date": "Sun, 09 Nov 2025 21:51:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mildura Base Public Hospital (MBPH) has been caught copying and pasting data in its annual reports across a four-year period.\n\nIdentical figures on the amount of compliments and complaints the hospital received have appeared in the 2022, 2023, 2024 and 2025 reports.\n\nFor each of those years, the hospital told the state government it had received 247 compliments and 239 formal concerns.\n\nThe hospital has now acknowledged that it has failed to disclose up-to-date figures.\n\nThe initial data\n\nMBPH released its first annual report in November 2021, after transitioning from private to public management the year prior.\n\nIn doing so, it became one of 77 hospitals and health services obliged to publicly submit reports to the Victorian government annually.\n\nIn its first report in 2021, the hospital revealed the number of compliments and complaints it had received from September 15, 2020 to July 1, 2021.\n\n\"This year we received 46 compliments and 183 formal concerns. MBPH has worked closely with consumers to resolve concerns raised and welcome all feedback that improve our health service,\" the 2020–2021 annual report read.\n\nIn 2022, the section featured again, with updated figures.\n\n\"This year we received 247 compliments and 239 formal concerns. MBPH has worked with closely with consumers to resolve concerns raised and welcome all feedback that improve our health service,\" the 2021–2022 annual report read.\n\nThis was the last time the figures were updated.\n\nThe hospital's response\n\nAn identical feedback section featuring 247 compliments and 239 formal concerns appeared verbatim in the 2023, 2024 and 2025 annual reports from the hospital.\n\nIt is the only data that has no variation across the four annual reports.\n\nA hospital representative said the data for 2023 was correct, coincidentally being the same as the 2022 figures.\n\nThe hospital says it has informed the Department of Health. (ABC News: Wade Stephens)\n\nThey did not provide the accurate data for 2024, but said the correct data for the 2025 annual report was 256 compliments and 329 complaints.\n\n\"In the 2024 and 2025 annual reports, information relating to feedback on the number of compliments and formal concerns was not updated, resulting in the incorrect publication of figures,\" the spokesperson said.\n\n\"This was an administrative error which has since been identified, and the Department of Health has been informed.\n\n\"We are currently awaiting guidance on the appropriate steps to rectify the error, after which the correct figures will be published.\"\n\nHas it happened elsewhere?\n\nOnly six other hospitals in Victoria chose to publicly list their compliments and complaints statistics in 2025.\n\nFour of them are based in metropolitan Melbourne.\n\nComplaints outnumbered compliments at Alfred Health in 2022, 2023, 2024 and 2025.\n\nThe same goes for Austin Health, which had a higher number of complaints than compliments across each of the past four years.\n\nEastern Health and Western District Health only started sharing their compliments and complaints statistics this year.\n\nBoth had more compliments than complaints.\n\nIn western Victoria, the Beaufort and Skipton Health Service had more compliments than complaints for the past four years.\n\nThe number of compliments also outranks the number of complaints at Portland District Health.\n\nIn contrast, the data from Mildura Base Public Hospital shows no variation across the past four years.\n\nA minor or significant error?\n\nThe hospital's annual reports are official records of state parliament, and the process to correct errors in these reports is not necessarily straightforward.\n\nIf the hospital chooses to amend the incorrect data, it will need to advise the Legislative Assembly.\n\nThe clerks will then review that information and advise whether the error is minor or significant.\n\nMildura hospital concerns The Victorian health minister has told a parliamentary inquiry she has concerns about Mildura Base Public Hospital.\n\nIf it is classed as a minor error, the original version can be corrected by the Legislative Assembly clerk.\n\nIf the clerk determines the error to be significant, a corrected version needs to be tabled before parliament.\n\nAdvice from the clerk to agencies is that minor errors are clerical and typographical errors, while significant errors involve information that might be misleading and need to be corrected because the error has an impact on understanding the document.\n\nIf the report is amended, all members of parliament will receive an email advising them that a document has been corrected.\n\nAs of November 1, 2025, 19 documents had been corrected in the 60th Victorian Parliament.\n\nThe hospital may alternatively decide to correct the record in the next document it tables.\n\nIf the hospital decides not to correct the error using this process, it is advised not to publish a corrected document anywhere else.\n\nLocal member wants answers\n\nMildura MP Jade Benham said the repetition of data was an issue.\n\n\"It's a significant error,\" Ms Benham said.\n\n\"I think anything that goes towards a lack of transparency is very significant.\n\n\"In my mind, any error in a government document is significant.\"\n\nJade Benham says the hospital made a significant error. (Supplied: Jade Benham)\n\nShe said she would be asking the health department why the repeated data had not been flagged previously.\n\n\"Our hospital report needs to be impeccable,\" she said.\n\n\"It needs to be perfect because anything that leaves the hospital and the Department of Health, for that matter, is a reflection on the entire system.\n\n\"To see the attention to detail is not there, then that has to be a concern, doesn't it?\"\n\nThe Victorian health minister has also been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/john-laws-viral-interview/105989826",
        "title": "When Laws showed up with bourbon in hand, I knew we would get a show",
        "publish_date": "Sun, 09 Nov 2025 21:12:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "John Laws was above all things a performer — and a highly skilled one at that.\n\nIn 2012, Laws — who died on the weekend aged 90 — agreed to join me on the ABC's 7.30 program for an interview to discuss outrageous remarks made by another powerful radio announcer, Alan Jones, regarding then-prime minister, Julia Gillard.\n\nDuring the second half of the 1980s, the 1990s and most of the first decade of the 2000s, Alan Jones and John Laws were the dual titans of AM talkback radio in Australia.\n\nThere was plenty of rivalry between them and little love lost.\n\nSo when Jones landed at the centre of a national scandal after he told a Young Liberals dinner that John Gillard had \"died of shame\" because of his daughter's \"lies\", Laws was happy to comment.\n\nLaws agreed to the interview, but he didn't want to come into the studio and instead requested we send a camera to his penthouse on Sydney's Woolloomooloo wharf.\n\nBreaking: Veteran radio broadcaster John Laws has died aged 90 Known as the \"Golden Tonsils\", Laws was one of Australia's most recognisable voices in talkback radio.\n\nTechnology wasn't quite so slick then as it is now, and in those circumstances we preferred to pre-record the interview and then turn it around for the live program — just in case the line dropped out.\n\nI headed into the studio an hour or so before airtime and on the screen in front of me, up popped the transmission from Laws's apartment.\n\nThe sight of the then-77-year-old was instantly entertaining, before he said even a word.\n\nHe was seated indoors but was wearing sunglasses and had a scarf draped around his neck.\n\nIn his right hand, he swirled a glass with a huge pour of bourbon and Coke.\n\nVisible through the window behind him was an immense navy ship docked at the Garden Island military base.\n\n\"Please god,\" I thought to myself as we waited to roll, \"don't let the cameraman ask him to put down the drink or take off the glasses.\"\n\nThe universe answered my prayer and Laws stayed exactly as he was.\n\nJohn Laws on air in 2007. (AAP: Tracey Nearmy)\n\n'Did you enjoy it?'\n\nWe began the interview with me asking Laws about the Jones remark.\n\nLaws began to speak and he then removed the sunglasses with a flourish, before condemning the remark as careless, hasty and cruel.\n\nHe was surprisingly kind to his former 2UE stablemate and rival, though, saying — in effect — we all make mistakes.\n\nPerhaps Laws was circumspect, given he was no stranger to national disgrace himself.\n\nIn 2004, he was caught in a \"cash-for-comment\" scandal when he was revealed to have spruiked products and services for a fee, passing it off as his personal opinion without disclosing the kickbacks he received.\n\nOn 7.30 in 2012, Laws held forth with his customary flair and confidence and then, as I wrapped up, he delivered probably the most memorable and amusing ending to any interview I've done.\n\n\"John Laws, thank you very much for making time to speak to us tonight,\" I said.\n\n\"Did you enjoy it?\" Laws replied.\n\n\"I did enjoy it, did you?\"\n\nLaws chuckled gleefully.\n\n\"Yeah, I loved every minute,\" he said.\n\nThat interview went so viral that people still occasionally mention it to me. The week when it aired, strangers came up to me nonstop to share a laugh about it every time I left the house.\n\nOn the Friday night, I was meeting friends for a drink and the bartender unexpectedly presented me with a cocktail and said: \"I've made this bespoke for you; I'm calling it the John Laws Special.\" He'd crafted something bourbon-based.\n\nI'm sure some ABC viewers thought Laws was crazy to show up on 7.30 and attempt to flirt with me while sipping a Wild Turkey. Crazy like a fox if you ask me!\n\nJohn Laws presenting his last radio show in November 2024. (ABC News: Keana Naughton)\n\nLaws knew how to hold an audience\n\nWhy did the interview make such a splash? Because Laws was wildly entertaining. And that's the reason he lasted on Australian radio for about 70 years and why no other Australian broadcaster has come near his longevity or success.\n\nIt was why he was paid a fortune and even furnished by his network with a microphone made of gold.\n\nLike him or loathe him, he indisputably knew how to deliver an engaging broadcast and hold the attention of a loyal audience.\n\nHis interviews with prime ministers such as John Howard and Paul Keating were mandatory listening when I was a young reporter. He spoke to the top dogs the same way he spoke to his listeners when they rang in.\n\nLaws adored the attention that his 7.30 appearance delivered him. Ever after, he always warmly invited me on whatever radio program he was hosting if I had an ABC project or a book to promote. And he always finished our encounters by asking, of course, if it had been good for me.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-10/wallabies-not-looking-for-excuses-after-italy-defeat/105990480",
        "title": "Wallabies 'not looking for excuses' as 2025 season drags on",
        "publish_date": "Sun, 09 Nov 2025 20:54:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "Beleaguered coach Joe Schmidt is challenging his charges to show some resilience as the Wallabies limp towards the finish of a gruelling and tumultuous 2025 campaign.\n\nWith hopes of an all-important top-six seeding for the 2027 Rugby World Cup now seemingly in tatters, Australia heads to Ireland to face Schmidt's former European heavyweight on Saturday off the back of another dispiriting loss to Italy.\n\nABC Sport will have live blog coverage of the Wallabies' clash with Ireland from 5am AEDT on Sunday.\n\nWhile one defeat to the Azzurri was once considered unfathomable, the reality is the Wallabies have now lost two straight Tests against them and, at number seven in the world, Schmidt's side is ranked just three spots above the 2025 Six Nations tournament's second-bottom side.\n\nAfter a promising start to the year, which peaked with a seismic first victory over two-time defending world champion South Africa at Ellis Park altitude since 1963, the Wallabies have lost six of their past eight Tests.\n\nAnd they barely got home in the two they won, against Argentina and, three weeks ago, against Eddie Jones's 14th-ranked Japan.\n\nAgainst England, former Lions scrum half Matt Dawson unleashed on the Wallabies, describing them as \"woeful\" and \"the worst I have seen them, ever\".\n\nJoe Schmidt now has a win record of 42 per cent as Wallabies coach. (Getty Images: Timothy Rogers)\n\nAfter watching his strike rate as Wallabies coach slip to 42 per cent, one of the worst in history, Schmidt called for fans to remain patient ahead of Australia's hosting of the World Cup in less than two years' time.\n\n\"There's still a lot of work to do to get them to where they need to be,\" he said.\n\n\"I've had lots of experience coaching a lot of Test matches and had teams that have been number one in the world, and I know what it takes to get there.\n\n\"And I know the strength and depth that you need and we're setting about trying to build that.\n\n\"We'll reflect on what we put out there tonight, what we can build on and what we need to make sure we improve upon.\n\n\"All I can say to people is that we believe in what we can deliver. Don't lose faith because we will guarantee to keep working as hard as we can to try to demonstrate what it means to us, to try to be as competitive as possible.\"\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nAfter making his first, indifferent start for the Wallabies since his return from a one-season stint in the NRL, playmaker Carter Gordon hobbled off with a quad strain midway through the second half of Saturday's 26-19 loss in Udine.\n\nThe Wallabies will consider calling in England-based veteran James O'Connor as fly half cover for the remaining Tests of the tour against Ireland and France.\n\n\"James would probably add a bit of freshness,\" Schmidt said.\n\n\"I haven't spoken to him about coming in. I've stayed in touch with him. He's had a good break over the last week or so, so he's been able to freshen up a little bit.\n\n\"Those are the decisions, probably tomorrow morning when we meet up before we head to the airport for a long old travel day, that we'll have a bit of a chat about.\n\n\"Because what we'll be looking for first is just to get all the medical information so that we know who's fit to go and who we might need as cover.\"\n\nWhile no doubt a lucrative exercise for Rugby Australia, the Wallabies are enduring a 15-Test calendar year for the first time since 2016.\n\n\"We're not looking for excuses,\" Schmidt said.\n\n\"We're just going to dust ourselves off and fire into the next one.\n\n\"We have to demonstrate some character.\"\n\nAAP/ABC\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/big-brother-is-back-on-tv-but-does-it-live-up-to-its-promise-to-be-different-20251104-p5n7mb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Big Brother is back on TV. But does it live up to its promise to be different?",
        "publish_date": "Mon, 10 Nov 2025 13:05:38 +1100",
        "category": "entertainment",
        "authors": [
            "Jared Richards"
        ],
        "text": "Fans may be sad that original host Gretel Killeen is busy with The Traitors, but Tracina steamed ahead despite difficult circumstances. The episode, recorded the night before as is standard with previous premieres, had to pause for two hours due to lightning risks, with much of the crowd evidently dissipating in the time between. It won’t be the only surprise Big Brother throws at Tracina.\n\nIt’s early days, but the show has been refreshingly raw, with contestants eschewing rehearsed entrance lines, visibly nervous and shaken by the experience. As you would be, locked in a house with 11 strangers with conflicting beliefs and life experiences. With the premiere filmed on Saturday, we got to whizz through their first night, where connections formed fast – as did storm clouds, or what seemed to be slight friction between several housemates.\n\nLoading\n\nWhen Michael entered, for example, he didn’t introduce himself to Abiola, a 24-year-old “loud, fat, Black lesbian”. It could have been nerves, but the small moment stuck out. Abiola is one of two people of colour cast on Big Brother, alongside Mia, 23, a Sri Lankan woman whose slightly shrill excitement immediately seemed to put her on the outs with her housemates.\n\nHowever, the cast features more men with moustaches and people with names beginning with C than it does non-white housemates. It’s not at all representative of Australia – an odd, disappointing choice given how, as naff as it seems to say, reality shows can really allow audiences to understand different perspectives. The imbalance could also easily create an uncomfortable tension. (A spoiler from last night’s livestream: Abiola and Mia are voted two of the house’s most annoying contestants in a challenge.)",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/this-chinese-inspired-fried-chicken-burger-costs-less-than-8-20251110-p5n935.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This Chinese-inspired fried chicken burger costs less than $8",
        "publish_date": "Mon, 10 Nov 2025 13:02:10 +1100",
        "category": "finance",
        "authors": [
            "Quincy Malesovas"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nHanbaobao on Russell Street offers some of the best value burgers and fried snacks in the city.\n\nHanbaobao’s spicy chicken burger is only $7.90.\n\nChinese$$$$\n\nHanbaobao’s Chinese-inspired chicken burger is a refreshing change, made with hand-rolled sesame seed buns more akin to Turkish flatbread than supermarket brioche. Fried chicken, the hero, is available in spicy, Sichuan pepper or original. Tack on sweet and sour plum-spiced sweet potato chips or a taro pie to make it a meal.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-talkback-radio-veteran-john-laws-dies-aged-90-bbc-boss-and-news-chief-quit-over-trump-video-outrage-20251110-p5n8y4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Talkback radio veteran John Laws dies aged 90; BBC boss and news chief quit over Trump video outrage",
        "publish_date": "Mon, 10 Nov 2025 12:52:07 +1100",
        "category": "finance",
        "authors": [
            "Kayla Olaya"
        ],
        "text": "Former ANZ Bank chief executive Shayne Elliott missed out on $13.5 million in bonuses during his last two years at the bank, as the board determined he should not receive incentive payments due to the bank’s regulatory and governance woes.\n\nANZ’s annual report, published on Monday, said neither Elliott nor his successor, Nuno Matos, had received a short-term bonus for the 2025 year, and the bank had also cancelled incentives that Elliott had been due to receive.\n\nShayne Elliott forfeited $13.5 million in bonuses in his time as ANZ boss. Credit: Arsineh Houspian\n\nThe ANZ board took the action, and also decided to pay no short-term bonuses to its top Australian-based executives, due to problems with “non-financial risk” after a year of governance woes and the settlement of major regulatory court cases.\n\nThe moves came after ANZ earlier this year agreed to a $240 million penalty to settle four separate legal cases from the corporate watchdog, admitting to unconscionable conduct on a major government bond deal, incorrect reporting of trading data, and misconduct affecting nearly 65,000 customers.\n\nAt the time of the settlement, ANZ chairman Paul O’Sullivan said there would be consequences for bankers’ pay.\n\nRead the full story here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-wall-street-wavers-20251110-p5n8xs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX higher on hopes of end to US shutdown",
        "publish_date": "Mon, 10 Nov 2025 12:51:27 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket has made a positive start to the week after hopes of an end to the US government shutdown eased investor jitters.\n\nThe S&P/ASX 200 was up 53.6 points, or 0.6 per cent, to 8823.3 at 12.38pm AEDT, with six of 11 industry sectors in positive territory led by technology, energy and materials. Wall Street futures rose and the ASX was boosted on reports a group of moderate Senate Democrats have agreed to support a deal to reopen the government which would end the 40-day government shutdown.\n\nWall Street notched its first weekly loss in the last four. Credit: Bloomberg\n\nMining stocks are steady, with Rio Tinto up 0.3 per cent, BHP flat and Fortescue 0.1 per cent lower. Gold miners are higher after the price of the safe haven climbed over the weekend to settle at around $US4000 ($6150) an ounce. Evolution Mining jumped 2 per cent and Northern Star rose 1.9 per cent in early afternoon trade.\n\nEnergy stocks have made a strong start to the week after oil prices advanced with Woodside Energy (up 1 per cent), Santos (up 0.1 per cent), Yancoal (up 2.2 per cent) all in the green.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/weatheralds-short-lived-ashes-audition-20251110-p5n93y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Weatherald's short-lived Ashes audition",
        "publish_date": "Mon, 10 Nov 2025 12:43:42 +1100",
        "category": "finance",
        "authors": [],
        "text": "Weatherald's short-lived Ashes audition\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-man-allegedly-exposed-himself-to-girls-in-several-cities-20251107-p5n8h3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Man allegedly exposed himself to teen girls in Newstead, Springfield; Dingo snatches shark on K’gari; Princess Anne to arrive in Brisbane for Remembrance Day",
        "publish_date": "Mon, 10 Nov 2025 12:36:57 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Coffee drinkers could be protecting themselves from heart failure, stroke and premature death, new research suggests.\n\nAtrial fibrillation (AF)– an irregular heartbeat – affects one in three people at some point in their lifetime, but many are undiagnosed.\n\nNew research from the University of Adelaide and University of California shows just one cup of coffee a day could be highly beneficial for those with AF.\n\nA coffee a day could keep the doctor away. Credit: iStock\n\nA randomised clinical trial was carried out on 200 patients with an irregular heartbeat from Australia, the United States and Canada. Half of the participants were required to consume at least one cup of coffee or espresso shot each day, while the other group had to abstain from coffee and caffeinated products.\n\n“The results were astounding,” said Professor Christopher X from the University of Adelaide.\n\n“In contrast to conventional wisdom, we found the coffee drinkers experienced a significant reduction in AF compared to those who avoided coffee and caffeine.\n\n“This is surprising as it goes against the common assumption by doctors and patients that coffee worsens heart rhythm disorders such as AF.\n\nDoctors have always recommended patients with problematic AF minimise their coffee intake, but this trial suggests that coffee is not only safe but likely to be protective.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/the-story-of-the-victoria-cross-in-australia-20251110-p5n93g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The story of the Victoria Cross in Australia",
        "publish_date": "Mon, 10 Nov 2025 12:13:34 +1100",
        "category": "finance",
        "authors": [],
        "text": "The story of the Victoria Cross in Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-personification-of-mediocrity-why-afl-s-wildcard-round-is-a-bad-idea-20251110-p5n8z7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "At odds with the fans: Why AFL’s wildcard round is a bad idea",
        "publish_date": "Mon, 10 Nov 2025 12:06:58 +1100",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "The final eight lived, in different formats, for 32 seasons and was successful in winning the confidence of the public, the clubs and the players.\n\nWhich raises the question of why, given the success of the eight, it has been killed off and replaced by what should henceforth be known as the top 10.\n\nThe Swans finished 10th in 2025 with a percentage of less than 100. Credit: AFL Photos via Getty Images\n\nTo many fans, including this one, eight is enough.\n\nIn 1990, the AFL had a final five for a 14-team competition. This expanded to a final six for 15 teams when the Crows arrived the following year, and then the great leap forward was made in 1994 when the league introduced the top eight.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/riverfront-house-goes-for-8-42-million-as-bids-drop-to-as-low-as-50c-20251110-p5n8zd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Riverfront house goes for $8.42 million, as bids drop to as low as 50c",
        "publish_date": "Mon, 10 Nov 2025 12:05:20 +1100",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "One of Bulimba’s last original riverfront relics has sold under the hammer for $8.42 million after a fast and erratic auction where bids dropped as low as 50¢.\n\nComplete with an old Hills Hoist perfectly poised to soak up million-dollar river views and a bronze propeller out front paying homage to the suburb’s blue-collar wharfie roots, the five-bedroom brick and concrete house, at 49 McConnell Street, has set a street benchmark and a suburb record for price per square metre.\n\nIn front of a crowd of almost 120, five bidders battled before two punters turned the auction into high-stakes theatre.\n\n“Bidding opened at $5.5 million and rose in $100,000 increments until we hit $8 million … then it got wild,” said Carla Haddan, of Place Bulimba.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/succeeding-smith-the-top-contenders-and-afl-convert-building-test-cases-20251106-p5n8bq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Succeeding Smith: The top contenders – and AFL convert – building Test cases",
        "publish_date": "Mon, 10 Nov 2025 12:03:24 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Bulls batsman Jack Clayton has developed a reputation for rescuing Queensland from precarious situations. There was a time when he could see himself playing football for Brisbane Lions, before he begrudgingly accepted a local cricket call-up. But he has since shown his ability to counter-punch. In last summer’s Sheffield Shield final he notched a century in the face of a 166-run first innings’ deficit, with a resolve strikingly similar to batting legend Steve Smith. Jack Clayton celebrates a century at a Sheffield Shield match at the Gabba. Credit: Getty Images At 36, Smith is closer to the end of his illustrious career, preparing for what could be his final Ashes campaign on home soil. Clayton, 26, is in the discussion to one day replace him. En route to 113 against New South Wales last week at the Gabba, rebuilding the innings after Usman Khawaja (87) and Lachie Hearne (nine) fell in quick succession, the left-hander went some ways to vindicating that claim.\n\nAdvertisement\n\nAnd with Australian selectors showing a willingness to pick players well into their careers – 31-year-old Jake Weatherald earning an Ashes call-up – time is on Clayton’s side. “Obviously, I’d love to throw my name into that mix, but my focus is to score runs for Queensland, and the rest will take care of itself,” he said. Loading “I think previously when I’ve started to think about things like that, or in grade cricketing trying to play for Queensland, you get too worried about selection at a higher level, and you lose focus on the here and now. “My favourite player was Mike Hussey, and he didn’t debut until his 30s. “I’m just beginning my journey, but I think it definitely does give hope to anybody in state cricket who’s not necessarily young but a bit older and knocking the door down. “There are opportunities there, and selectors pick people who score runs – that’s your main currency.”\n\nAdvertisement\n\nClayton has slowly built his resume away from the spotlight. An off-season spent tightening his technique has paid dividends, working closely with Test star Marnus Labuschagne. Against the Blues, he looked rock solid defensively on the front foot, drove with precision, was quick to get into his hook and cut, and was unafraid to take on Test spinner Nathan Lyon. But despite a tendency to thrive the more challenging a situation, he remains frustrated by not converting promising starts into groundbreaking knocks. “Have you been talking to Uzzie [Khawaja]?” Clayton asks with a laugh. “After the last game, he said, ‘You’ve got a few hundreds now, I want a big hundred’. “I was having a think after the last game, and you can almost put too much pressure on yourself to go out there and make that hundred a really big one.\n\nAdvertisement\n\n“But you get to a hundred doing what you did. Keep doing that for as long as you can, and don’t get out of that bubble. “I definitely think it’s something I love when the game’s on the line. “I don’t know, it just seems to focus me on what I need to do, and I need to find a way to get into that mindset more often.” Clayton’s fate could have been so different. Loading A former member of the Brisbane Lions academy, Clayton’s junior sporting days were littered with schoolboy honours, and even a 2016 Rising Star nomination in the second division North East Australian Football League. His cricket return came by chance – playing third-grade for the University of Queensland in the footy off-season, before accepting a second division invitation with a sigh.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/15-martinis-midnight-spag-and-bloody-mary-salad-inside-a-lygon-street-public-house-20251107-p5n8mk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "$15 martinis, midnight spag and Bloody Mary salad. Inside Lygon Street’s new ‘public house’",
        "publish_date": "Mon, 10 Nov 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Advertisement\n\nEating outJust open $15 martinis, midnight spag and Bloody Mary salad. Inside Lygon Street’s new ‘public house’ The owner of hatted restaurant Etta has opened a more easygoing and economical venue, Daphne, just down the road. It’s “fun, loose and for you to use as you see fit”. Tomas Telegramma November 10, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nDaphne, the sophomore opening for Hannah Green – owner of hatted Brunswick East diner Etta – has been created as a chameleon. It’s not a pub or a wine bar or a restaurant. It’s all of the above and more, intended to be a neighbourhood institution. A few doors down from Etta on Lygon Street, Daphne is what Green calls her “public house”. The 125-seat bar and restaurant is “fun, loose and for you to use as you see fit”, she says. It’s a more easygoing – and economical – experience than what Etta has flourished into. Hannah Green’s Daphne is a pub, wine bar and restaurant rolled into one neighbourhood institution. Ashley Ludkin Designed by IF Architecture (Etta, Cutler, Baker Bleu), Daphne is a fresh face for the space once home to the longstanding Cafe Romantica, but known most recently as Bar Romantica. “I wanted to pay respect to the site because it was fairly iconic,” Green says. “But I also wanted to bring light in.”\n\nAdvertisement\n\nWhile the original terrazzo floor and popcorn-look vermiculite ceiling remain, the room has been brightened in a big way. “Everything is reflective,” Green says, from the iridescent 3D-printed lightshades to the stainless-steel open kitchen. New street-side seating flows into a casual front bar where you order at the counter. Beyond: a full-service bistro with clothed tables and a curtained-off private dining room. 1 / 9 From left: Pip Littore, chef Diana Desensi and owner Hannah Green. Kristoffer Paulsen 2 / 9 Wood-fire oven roasted half chook with blistered grapes and a salty-sweet agrodolce-like sauce. Kristoffer Paulsen 3 / 9 The former Bar Romantica space has been redesigned by IF Architecture. Shelley Horan 4 / 9 Daphne is Etta’s more affordable, casual sibling venue. Shelley Horan 5 / 9 Potato flatbread with mussels escabeche and whipped cod roe. Kristoffer Paulsen 6 / 9 Bloody Mary salad. Ashley Ludkin 7 / 9 Ricotta tortellini with artichoke, radicchio and milk sauce. Shelley Horan 8 / 9 A curtained-off private dining room lies at the rear. Shelley Horan 9 / 9 Olive oil cake. Shelley Horan Previous Slide Next Slide Presiding over the food is Diana Desensi, former head chef of Montalto and the now-closed Saint George, who has a simple motto: “If it hasn’t been done before, we’re not doing it.” But that’s not to say she isn’t putting her own flair and flourishes on familiar dishes. The same menu runs across the front bar and bistro, featuring a dish Desensi cooked for Green to help her get the gig. It’s a half chicken that’s brined, “dunked in herb butter so the whole thing kind of mummifies”, then roasted to golden perfection in the wood-fire oven before being served with blistered grapes and a salty-sweet agrodolce-like sauce.\n\nAdvertisement\n\n‘If it hasn’t been done before, we’re not doing it.’ Daphne chef Diana Desensi Other highlights include a fermented potato flatbread with mussels escabeche and whipped cod roe, and unusually exciting salads like a colourful cobb and an heirloom tomato medley with all the flavours of a Bloody Mary. Weekly “neighbourhood nights” each have a different hero item. Go for $15 martinis on Mondays (and get an olive stamp on your loyalty card so your 10th is free), $30 steak with fries on Tuesdays, and $25 handmade pasta on Wednesdays. There’s also a kids’ menu, and a supper menu on Fridays and Saturdays. With last orders at midnight, it appropriately stars a midnight spaghetti jam-packed with anchovies and capers. The Guinness Americano cocktail tastes like a “chocolate negroni”. Shelley Horan As at Etta, the cocktails are a cut above, curated by drinks maverick Sam Peasnell who also lent his expertise to the drinks lists at Barragunda and Dom’s Social Club. His take on the Americano Perfecto (topped with lager instead of the Americano’s usual soda) subs in Guinness, which floats atop the Campari and vermouth for a low-ABV drink that he says tastes like a chocolate negroni.\n\nAdvertisement\n\nRelated Article Lygon Street hatted restaurant Etta to open more affordable sibling (and it’s close by) Sommelier Ashley Boburka’s wine list puts Victoria centre stage, including pinot gris and chilled sangiovese by Yarra Valley winemaker Valentine, both on tap for $10 a glass. After dinner, the old Bar Romantica sound system cranks up for late-night DJ sets. Daphne opens today, November 10 at 52-54 Lygon Street, Brunswick East, daphne.melbourne Open dinner Mon-Sat\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/the-rising-threat-to-the-global-financial-system-20251110-p5n8zl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The rising threat to the global financial system",
        "publish_date": "Mon, 10 Nov 2025 11:58:42 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Until now, questioning of the boom in investment in artificial intelligence has largely been confined to whether it constitutes a stockmarket bubble. Increasingly, the conversation will shift to whether that boom represents a threat to financial system stability.\n\nThe first phase of the sector’s development has been largely, albeit not entirely, equity funded, with the mega techs – the so-called “hyperscalers” like Google, Microsoft, Meta Platforms and Amazon – funding their massive investments in chips and data centres from their massive cash flows.\n\nThe combination of frothy asset values and leverage is a combustible one. Credit: AP\n\nBetween them, those companies will spend $US375 billion ($577 billion) on AI infrastructure and chips this year and closer to $US450 billion next year. Given their cashflows, balance sheets and pristine credit ratings – between them, they had little to no net debt when this splurge in AI spending started – they can afford their investments.\n\nThere are others, like OpenAI and other AI start-ups, that are making massive commitments (in OpenAI’s case about $US1.4 trillion) without the funding for them in place, relying on access to the equity markets and, to some degree, on circular finance and financial engineering – securing funding from chipmakers, for instance, in return for agreeing to buy the equivalent value of chips.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/librarian-splashes-4-9-million-on-luxurious-sydney-house-20251110-p5n8za.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Librarian splashes $4.9 million on luxurious Sydney house",
        "publish_date": "Mon, 10 Nov 2025 11:58:16 +1100",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A determined librarian shelled out $4.9 million for a brand-new five-bedroom house in Burwood at auction on Saturday, paying $500,000 above its $4.4 million reserve to secure the keys.\n\nThe sleek inner west property at 21 Belgrave Street had also captured the heart of a neighbour from the same street who had watched the development from beginning to end, but just missed out by $50,000.\n\nBidding took a few minutes to start, then $3.8 million opened the action. Once it got started it was rapid fire in mostly $100,000 increments until $50,000 bids towards the end. Only two out of the six registered made offers on the home, which had a $4 million guide.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/it-shouldnt-be-painful-to-be-a-woman-victorian-report-lays-bare-health-care-battle/a2roecgtf",
        "title": "'It shouldn't be painful to be a woman': Victorian report lays bare health care battle",
        "publish_date": "Sun, 9 Nov 2025 20:53:53 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMeet Thea Baker.\n\n\n\n\n\nShe's a clinical psychologist who has heard plenty of stories of trauma, coming from the experiences of women and girls trying to navigate the Victorian health care system.\n\n\n\n\n\nBut Ms Baker says she has also been there herself.\n\n\n\n\n\n“I've had two gynaecological surgeries and four hip surgeries, including a hip replacement all in the last 10 years ... One of the things that I found most difficult though is postoperatively being not believed with the amount of pain that I've experienced as I've come out of anaesthetic and basically being told that I'm making a fuss and having to wait a really long time between doses.”\n\n\n\n\n\nThe Victorian state government has just released the final report of an inquiry into women's experiences of pain, an investigation prompted by stories just like this one.\n\n\n\n\n\nThe inquiry was conducted by the Women's Health Advisory Council and a panel of experts in 2024.\n\n\n\n\n\nIt received a massive number of submissions: 13,000 women and girls aged between 12 and 79, as well as their carers, clinicians, and associated organisations.\n\n\n\n\n\nPremier Jacinta Allan says women not being taken seriously was a common theme in many of the stories it heard.\n\n\n\n\n\n“There's a kind of pain that women and girls are just constantly told that they have to learn to live with it. The kind that we are all told is normal. Whether it's the heavy periods, the crippling cramps that come with that sort of pain. We're also told to push through it. We're taught that we just have to push through it and put up with it. And I know all this because I've lived through this experience myself.”\n\n\n\n\n\nThe repot has made clear just how extensive the problems are.\n\n\n\n\n\nThe most common conditions women experienced were menstrual and hormonal pain, endometriosis, and musculoskeletal problems, like arthritis.\n\n\n\n\n\nIt's found 90 per cent of submissions to the inquiry reported experiencing pain lasting more than a year, while over half had daily pain.\n\n\n\n\n\nProfessor Sonya Grover is the head of the department of Gynaecology at the Royal Children's Hospital - and she says that's deeply concerning.\n\n\n\n\n\n“We know that untreated pain affects everything: their sleep, their moods, their participation in sports, their schooling, their self confidence. But we also know that if we intervene early, we can change that.”\n\n\n\n\n\nBut the report says that finding early assistance has proved problematic.\n\n\n\n\n\nWhile 95 percent sought help for their pain, just over 70 percent said they'd been dismissed or faced discrimination when they sought care.\n\n\n\n\n\nThe situation was even worse for those with disabilities, or from the LGBTIQ plus community, people from different cultural backgrounds, and Aboriginal and Torres Strait Islander women and girls.\n\n\n\n\n\nVictoria's Health Minister, Mary-Anne Thomas, says as a result, many women and girls have not been properly diagnosed.\n\n\n\n\n\n“Now women have told us that when they go to seek treatment for their pain, it's often their mental health that is being treated. They're prescribed antidepressants but the cause of their pain is not being diagnosed.”\n\n\n\n\n\nThe Minister says that the report has identified a key barrier to treatment is the nature of the workforce itself.\n\n\n\n\n\nShe says some health care professionals just don't have the knowledge to help their female patients.\n\n\n\n\n\n“The body of knowledge that we have when it comes to delivering health care has been built on men's experience and their biology. This is just a fact. It's is not a judgement, it's just a fact. We do not yet know enough about the many causes of pain that women are experiencing. It hasn't been researched and it hasn't been taught.”\n\n\n\n\n\nThe state government plans to introduce a new standard of care.\n\n\n\n\n\nThe Premier says the Women's Pain Standard will be rolled out across Victoria's health system once it's been developed, to start to change things for the better.\n\n\n\n\n\n“This is understanding that the culture to date has been silence and not understanding women's pain. So by setting a new health care standard it is about sending a very, very clear message about the expectations that we set to support women to get the care they need across our health system.”\n\n\n\n\n\nThe Standard is likely to form part of the overall action plan for women's pain that the government says it will put together over the next six months.\n\n\n\n\n\nBut the Health Minister says they're not waiting to take action.\n\n\n\n\n\nA specialist clinic is to be established at the Royal Children's Hospital, and she's committed to a pilot of a device known as the 'green whistle', essentially an inhaler for pain relief that will give women a level of control over their pain during IUD insertion or removal.\n\n\n\n\n\nClinical Director of Obstetrics and Gynaecology at Peninsula Health, Dr Nisha Knot, says their service has already introduced the green whistle - and that a rollout of the device to all 20 Sexual and Reproductive Health Hubs in Victoria will be a welcome move.\n\n\n\n\n\n“We all know that an IUD is an excellent contraception. It's also good for heavy periods, it's also good for period pain. And it seemed like such a shame that women were not able to use an IUD because their experience of getting an IUD inserted or changed was so painful. So it seemed like a win-win for everyone.”\n\n\n\n\n\nFor Women's Health Victoria chief executive, Sally Hasler, the release of the report is a watershed moment.\n\n\n\n\n\nShe's called it a powerful collection of evidence from women that things need to change.\n\n\n\n\n\nShe says the Victorian and Commonwealth governments need to work together to implement the report's ambitious recommendations.\n\n\n\n\n\nThat's the hope of Thea Baker, too.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/bbc-bosses-resign-over-accusations-of-misleading-trump-edit/i4mb0zezl",
        "title": "BBC bosses resign over accusations of misleading Trump edit",
        "publish_date": "Sun, 9 Nov 2025 19:11:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "British Broadcasting Corporation (BBC) director-general Tim Davie and the chief executive of news, Deborah Turness, have resigned following criticism that a BBC documentary misled viewers by editing a speech by United States President Donald Trump.\n\n\n\n\n\n\"This is entirely my decision, and I remain very thankful to the chair and board for their unswerving and unanimous support throughout my entire tenure, including during recent days,\" Davie said in a statement.\n\n\n\n\n\n\"I have been reflecting on the very intense personal and professional demands of managing this role over many years in these febrile times, combined with the fact that I want to give a successor time to help shape the charter plans they will be delivering.\n\n\n\n\n\n\"Overall, the BBC is delivering well, but there have been some mistakes made and as director general I have to take ultimate responsibility,\" he said.\n\n\n\n\n\nTurness said the controversy about the Trump documentary \"has reached a stage where it is causing damage to the BBC — an institution that I love. As the CEO of BBC News and Current Affairs, the buck stops with me\".\n\n\n\nREAD MORE Free speech fears continue to roil US as Trump says unfair media coverage is 'illegal'\n\nThe Daily Telegraph had reported for days on an internal document produced by a former BBC adviser on standards who had listed a raft of errors, including in the way a speech by Trump on 6 January 2021 was edited.\n\n\n\n\n\nThe document suggested the Panorama program had edited two parts of Trump's speech together so he appeared to directly encourage the Capitol Hill riots of January 2021 — cutting out a section where Trump said he wanted supporters to demonstrate peacefully.\n\n\n\n\n\nAt the time, Trump was still disputing then-president Joe Biden's election victory, in a vote that resulted in him being ousted after his first term in office.\n\n\n\n\n\nThe edit was included in a documentary titled Trump: A Second Chance? that was broadcast by the BBC the week before last year's US election.\n\n\n\nAllegations of 'bias'\n\nUK culture, media and sport minister Lisa Nandy said the Trump edit was one of several concerns about editorial standards at the BBC.\n\n\n\n\n\n\"It isn't just about the Panorama program, although that is incredibly serious,\" she told BBC television in an interview.\n\n\n\n\n\n\"There are a series of very serious allegations made, the most serious of which is that there is systemic bias in the way that difficult issues are reported at the BBC,\" she said.\n\n\n\n\n\nNandy said she was concerned about a tendency for editorial standards and the language used in reports to be \"entirely inconsistent\" whether it be on \"Israel, Gaza ... trans people or on this issue about President Trump\".\n\n\n\n\n\nThe licence fee-funded broadcaster issued several apologies earlier this year for \"serious flaws\" in the making of another documentary, titled Gaza: How To Survive A Warzone, which was broadcast in February.\n\n\n\n\n\nIn October, it accepted a sanction from the UK media watchdog for what was deemed a \"materially misleading\" program, whose child narrator was later revealed to be the son of Hamas's former deputy agriculture minister.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-alzheimers-imbalance-this-australian-has-under-the-microscope/janflm0p2",
        "title": "The Alzheimer's 'imbalance' this Australian has under the microscope",
        "publish_date": "Sat, 8 Nov 2025 19:37:35 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Alzheimer’s disease disproportionately affects women — and now a new international project, involving an Australian researcher, has received a $4 million boost to try and find out why.\n\n\n\n\n\nProfessor Kaarin Anstey, the director of the University of NSW's Ageing Futures Institue, and the University of California's Professor Kristine Yaffe have been jointly awarded the funding to investigate the phenomenon of the disease, which some health bodies place as among Australia's leading causes of death.\n\n\n\n\n\nAnstey said a lot of research into Alzheimer's — the most common form of dementia — hasn't considered \"sex-specific factors\".\n\n\n\n\n\n\"We hope that by studying hormonal variability and aspects of women's health that have previously been dismissed, we may uncover clues to explain women's greater risk of Alzheimer's disease,\" she said.\n\n\n\nWhy are women more prone to Alzheimer's?\n\nAnstey, whose work is being funded by United States-based charity Wellcome Leap, said there are differences in brain structures between the binary sexes, which could explain the differences in the prevalence of Alzheimer's.\n\n\n\n\n\nShe said there are not enough study participants who identify as non-binary or transgender to have reliable data for those groups.\n\n\n\n\n\nWhile there could be a link between an increased risk of Alzheimer's and hormonal changes in women, the reason behind the \"imbalance\" is unclear.\n\n\n\nREAD MORE More than a million Australians could be living with dementia in 40 years. These are possible risk factors\n\nShe said one reason is that Alzheimer's statistics tend not to take sex into account, and treat men and women the same, despite \"the large differences in biology and risk of Alzheimer's\".\n\n\n\n\n\nShe said there are two main goals for her future studies.\n\n\n\n\n\n\"Overall, the most urgent priority is to learn how to reduce the risk of dementia and slow cognitive decline so that we can develop interventions to prevent it,\" she said.\n\n\n\n\n\n\"Second, making sure these women's health issues are given the same weight in our research as other factors like cardiovascular disease, so that they are not ignored or dismissed as unimportant,\" Anstey said.\n\n\n\n\n\n\"We need all the clues and information available to progress the massive task of preventing cognitive decline and impairment in ageing.\"\n\n\n\nDo men and women experience Alzheimer's differently?\n\nAssociate Professor Fiona Kumfor from the University of Sydney's Brain and Mind Centre and co-founder of the Dementia Law Network said understanding the differences in how men and women experience Alzheimer's is an \"important area for future research\".\n\n\n\n\n\n\"There hasn't been a lot of research examining sex differences, but some evidence suggests that women may have more depressive symptoms and changes in beliefs, such as delusions, whereas men may experience more loss in motivation which can lead to apathy,\" she said.\n\n\n\n\n\nBecause women tend to live longer than men, there is a higher number of women living with Alzheimer's.\n\n\n\nKumfor said that women are also more likely to be diagnosed with Alzheimer's than men.\n\n\n\n\n\n\"Although men are at greater risk of other dementia types like some types of frontotemporal dementia and vascular dementia,\" Kumfor said.\n\n\n\nAre there risk factors for dementia?\n\nAnstey said it's important to look at modifiable risk factors that can improve health outcomes for people with Alzheimer's.\n\n\n\n\n\n\"While we know that many risk factors for dementia are modifiable, the effect of each may not be the same in men and women. The more we can understand, the more we can intervene to prevent it,\" she said.\n\n\n\n\n\nThe Lancet, a prominent medical journal, has tracked 14 modifiable risk factors in its research into dementia .\n\n\n\n\n\nThe paper's authors state nearly half of all dementia cases worldwide could be prevented or delayed by addressing these risk factors.\n\n\n\nThe common mid-life risk factors include hearing loss, high LDL cholesterol, social isolation and depression. Source: SBS News The mid-life risk factors include hearing loss, high LDL cholesterol (or 'bad' cholesterol), social isolation and depression.\n\n\n\n\n\nManaging these risk factors, particularly in the early and middle stages of life, could potentially prevent or delay dementia cases by 45 per cent, according to the research published in 2024.\n\n\n\n\n\nSome academics have commended The Lancet study, but say it's not possible to conclusively link these risk factors directly to dementia .\n\n\n\nDiagnosis and prevention\n\nProfessor Scott Ayton, from the Florey Institute of Neuroscience and Mental Health, told SBS News there is a \"considerable challenge\" around the world when it comes to diagnosing Alzheimer's.\n\n\n\n\n\nBut recent research shows there is an over 90 per cent success rate in diagnosing Alzheimer's by looking at blood-based biomarkers, according to Ayton.\n\n\n\n\n\nKumfor said that while most cases of Alzheimer's start with changes in memory, that's not the case for everyone.\n\n\n\n\n\n\"For some people, the earliest changes might be in language, navigation, planning or behaviour,\" she said.\n\n\n\n\n\n\"Where the presentation is 'atypical', or if people develop symptoms at a younger age — under 65 years old — this can make diagnosis particularly difficult.\"\n\n\n\n\n\nWhile diagnosis continues to be an obstacle in Alzheimer's care, preventing symptoms like memory loss from worsening is also a focus for researchers.\n\n\n\n\n\nAyton said two drugs are now available in Australia — donanemab and lecanemab — which could help people with cognitive decline.\n\n\n\nHowever, Ayton said more research is needed to assess the impact of these medications, while there are widely accepted benefits for people with Alzheimer's when they make lifestyle changes.\n\n\n\n\n\n\"What's good for the heart is good for the brain,\" he said.\n\n\n\n\n\n\"Exercise, heart health and diet are shown to make a difference with prevention.\"\n\n\n\n\n\nHe said when addressing health concerns, it's \"earlier the better\" for the best outcomes.\n\n\n\n\n\n\"Hypertension has been shown to increase the risk of developing Alzheimer's. Dealing with hypertension at midlife will have better results than addressing it later on in life,\" he said.\n\n\n\n\n\nKumfor said speaking with psychologists and lawyers early on can help people with Alzheimer's to prepare for long-term challenges.\n\n\n\n\n\n\"Alzheimer's disease is progressive, and people will develop more severe symptoms over time, so it is also important to speak to someone for support and think about future planning,\" she said.\n\n\n\n\n\nThe information in this article is for general information purposes only and should not be relied on as a substitute for professional medical advice. Readers are advised to consult a qualified health professional for guidance specific to their situation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ukrainian-australians-call-for-further-action-on-russian-blood-oil/5imqsjgdu",
        "title": "Ukrainian-Australians call for further action on Russian 'blood oil' entering the country",
        "publish_date": "Sat, 8 Nov 2025 06:29:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Experts say a \"shadow fleet\" continues to bring Russian oil to Australia via refineries in third countries.\n\nMembers of the Ukrainian-Australian community say more should be done to stop Russian oil entering Australia via such channels.\n\nA recently launched Senate inquiry will look at how to stop the importation of fuels derived from Russian crude oil.\n\nOryssia Pryslak was born and raised in the small Ukrainian community in Victoria's port city of Geelong, where oil tankers were a common sight. Until recently, she had no idea that some of those ships might be carrying sanctioned oil from Russia.\n\n\n\n\n\n\"I was in disbelief, to be honest,\" the 26-year-old told SBS News.\n\n\n\n\n\nIn October, SBS revealed that Australia is the biggest importer of oil products refined from Russian crude oil in third countries.\n\n\n\n\n\nAustralia sanctioned the direct import of crude oil from Russia after the invasion of Ukraine in 2022, but experts say a \"shadow fleet\" of at least 25 ships continues to bring oil ashore via refineries in countries such as India and China.\n\n\n\n\n\n\"It's blood oil,\" said Oryssia's mother, Luba Pryslak, who is president of the Association of Ukrainians in Victoria.\n\n\n\nThe Ukrainian community held a protest in Geelong on Saturday that was timed to meet the arrival of a tanker they suspect is carrying products refined from Russian crude oil. Source: Supplied Oryssia and Luba were among roughly 50 protesters who stood at the jetty in Geelong on Saturday morning to protest the arrival of a tanker believed to be transporting products refined from sanctioned Russian crude oil.\n\n\n\n\n\nSpeaking after the rally, Luba told SBS News the Ukrainian community in Australia is calling on the government to close a loophole allowing such oil products to enter Australia and properly investigate whether current sanctions are effective.\n\n\n\n'Blood Oil'\n\nTo date, the government has sanctioned more than 150 \"shadow fleet\" ships, often uninsured vessels that avoid detection by regularly changing their nation of registry (a practice known as flag-hopping) and disabling their tracking systems, according to the Department of Foreign Affairs and Trade (DFAT).\n\n\n\n\n\nHowever, data provided to SBS News in October by the Centre of Research on Energy and Clean Air showed that 25 ships remain in the supply chain of Australian companies.\n\n\n\n\n\nForeign Minister Penny Wong has said there is no mechanism that would allow the government to track the origin of Russian crude oil that enters Australia via third-country refineries.\n\n\n\n\n\nAt Senate estimates on 10 October, Wong said the government expects the private sector to manage its own supply chains.\n\n\n\n\n\n\"Australians also expect businesses to prevent their supply chains from inadvertently funding Russia’s illegal and immoral invasion of Ukraine — and we ask businesses to uphold that responsibility,\" a DFAT spokesperson told SBS News.\n\n\n\nIn September, Tasmanian senator Jacqui Lambie likened the situation to that of diamonds mined in areas of conflict.\n\n\n\n\n\n\"Over 10 years ago, Australia was calling for blood diamonds to be included in the international definition of conflict diamonds, and now we're accepting Russian blood oil,\" she said in the Senate.\n\n\n\n\n\nOryssia, who recently returned from a visit to Ukraine, said knowing Australian money is going back to Russia gives her \"a sense of guilt\".\n\n\n\n\n\n\"All these people in Ukraine are like 'thank you so much for your help'. And in our backhand, we're actually sliding more money over to Russia.\"\n\n\n\n\n\n\"You're putting money into the pockets of people who are bombing civilians,\" Oryssia said.\n\n\n\nSince Russia's invasion of Ukraine in February 2022, over 14,000 Ukrainian civilians have been killed and more than 37,000 injured, according to the United Nations Human Rights Monitoring Mission in Ukraine (HRMMU).\n\n\n\n\n\nHRMMU head Danielle Bell said in early October: \"High civilian casualties last month confirm this year's disturbing pattern of intense violence in Ukraine, as virtually no day passes without civilian deaths or injuries, especially in frontline communities.\"\n\n\n\nMore transparency needed\n\nOn Wednesday, the Foreign Affairs, Defence and Trade References Committee launched a Senate inquiry into Russian sanctions, which will specifically look at how to stop the importation of fuels derived from Russian crude oil in Australia.\n\n\n\n\n\nIt will report back in March 2026.\n\n\n\n\n\nLuba said the Association of Ukrainians in Victoria want the inquiry to be moved forward.\n\n\n\n\n\n\"We won't wait until March until we get a report while people are dying and suffering,\" she said.\n\n\n\nA building in Kyiv following a drone attack the previous night, captured by Oryssia on a recent trip to Ukraine. Source: Supplied Luba also told SBS News the association wants greater transparency and accountability for private fossil fuel companies when it comes to their supply chain.\n\n\n\n\n\n\"Companies need to be more aware of their supply chain and where things are coming from, whether that comes from more government regulations [or somewhere else],\" she said.\n\n\n\n\n\n\"Let's just be more transparent about what's really happening,\" Oryssia said.\n\n\n\n\n\nDFAT told SBS News that \"Australia remains steadfast in its support for Ukraine as it defends itself against Russia’s illegal and immoral invasion.\"\n\n\n\n\n\n\"As a result of measures we have already taken, direct Australian imports of Russian energy products have fallen from $80 million to zero since before Russia’s invasion,\" the spokesperson said, adding that the government was \"evaluating options to place further pressure on Russia’s oil revenues\".\n\n\n\nKeeping Ukraine in 'eyesight'\n\nLuba said the Ukrainian community in Australia was mostly proud of how the Australian government has supported Ukraine.\n\n\n\n\n\n\"The Ukrainian diaspora has been proud that Australia has been able to support Ukraine, sending Bushmasters and humanitarian and military support,\" Luba said.\n\n\n\n\n\nIn February, DFAT said it has committed more than $1.5 billion to help Ukraine defend itself, including more than $1.3 billion in military support through equipment and training.\n\n\n\nA photograph taken by Oryssia on a recent trip to Ukraine. Source: Supplied / Oryssia Pryslak However, with the conflict soon heading into its fourth year, Oryssia is concerned that \"war fatigue\" could be setting in — \"especially with so many horrible things happening all around the world\".\n\n\n\n\n\n\"Australians say, 'oh you're Ukrainian, how's it all going'? And you have to say, 'it's going sh-t, actually'.\"\n\n\n\n\n\n\"I think Australians should really try to understand that we do need to keep it in our eyesight. We need to keep it in our minds.\"\n\n\n\n\n\n\"It's happening right now still.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/big-brother-is-back-on-tv-but-does-it-live-up-to-its-promise-to-be-different-20251104-p5n7mb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Big Brother is back on TV. But does it live up to its promise to be different?",
        "publish_date": "Mon, 10 Nov 2025 13:05:38 +1100",
        "category": "entertainment",
        "authors": [
            "Jared Richards"
        ],
        "text": "Fans may be sad that original host Gretel Killeen is busy with The Traitors, but Tracina steamed ahead despite difficult circumstances. The episode, recorded the night before as is standard with previous premieres, had to pause for two hours due to lightning risks, with much of the crowd evidently dissipating in the time between. It won’t be the only surprise Big Brother throws at Tracina.\n\nIt’s early days, but the show has been refreshingly raw, with contestants eschewing rehearsed entrance lines, visibly nervous and shaken by the experience. As you would be, locked in a house with 11 strangers with conflicting beliefs and life experiences. With the premiere filmed on Saturday, we got to whizz through their first night, where connections formed fast – as did storm clouds, or what seemed to be slight friction between several housemates.\n\nLoading\n\nWhen Michael entered, for example, he didn’t introduce himself to Abiola, a 24-year-old “loud, fat, Black lesbian”. It could have been nerves, but the small moment stuck out. Abiola is one of two people of colour cast on Big Brother, alongside Mia, 23, a Sri Lankan woman whose slightly shrill excitement immediately seemed to put her on the outs with her housemates.\n\nHowever, the cast features more men with moustaches and people with names beginning with C than it does non-white housemates. It’s not at all representative of Australia – an odd, disappointing choice given how, as naff as it seems to say, reality shows can really allow audiences to understand different perspectives. The imbalance could also easily create an uncomfortable tension. (A spoiler from last night’s livestream: Abiola and Mia are voted two of the house’s most annoying contestants in a challenge.)",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/this-chinese-inspired-fried-chicken-burger-costs-less-than-8-20251110-p5n935.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This Chinese-inspired fried chicken burger costs less than $8",
        "publish_date": "Mon, 10 Nov 2025 13:02:10 +1100",
        "category": "finance",
        "authors": [
            "Quincy Malesovas"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nHanbaobao on Russell Street offers some of the best value burgers and fried snacks in the city.\n\nHanbaobao’s spicy chicken burger is only $7.90.\n\nChinese$$$$\n\nHanbaobao’s Chinese-inspired chicken burger is a refreshing change, made with hand-rolled sesame seed buns more akin to Turkish flatbread than supermarket brioche. Fried chicken, the hero, is available in spicy, Sichuan pepper or original. Tack on sweet and sour plum-spiced sweet potato chips or a taro pie to make it a meal.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-talkback-radio-veteran-john-laws-dies-aged-90-bbc-boss-and-news-chief-quit-over-trump-video-outrage-20251110-p5n8y4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Talkback radio veteran John Laws dies aged 90; BBC boss and news chief quit over Trump video outrage",
        "publish_date": "Mon, 10 Nov 2025 12:52:07 +1100",
        "category": "finance",
        "authors": [
            "Kayla Olaya"
        ],
        "text": "Former ANZ Bank chief executive Shayne Elliott missed out on $13.5 million in bonuses during his last two years at the bank, as the board determined he should not receive incentive payments due to the bank’s regulatory and governance woes.\n\nANZ’s annual report, published on Monday, said neither Elliott nor his successor, Nuno Matos, had received a short-term bonus for the 2025 year, and the bank had also cancelled incentives that Elliott had been due to receive.\n\nShayne Elliott forfeited $13.5 million in bonuses in his time as ANZ boss. Credit: Arsineh Houspian\n\nThe ANZ board took the action, and also decided to pay no short-term bonuses to its top Australian-based executives, due to problems with “non-financial risk” after a year of governance woes and the settlement of major regulatory court cases.\n\nThe moves came after ANZ earlier this year agreed to a $240 million penalty to settle four separate legal cases from the corporate watchdog, admitting to unconscionable conduct on a major government bond deal, incorrect reporting of trading data, and misconduct affecting nearly 65,000 customers.\n\nAt the time of the settlement, ANZ chairman Paul O’Sullivan said there would be consequences for bankers’ pay.\n\nRead the full story here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-wall-street-wavers-20251110-p5n8xs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX higher on hopes of end to US shutdown",
        "publish_date": "Mon, 10 Nov 2025 12:51:27 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket has made a positive start to the week after hopes of an end to the US government shutdown eased investor jitters.\n\nThe S&P/ASX 200 was up 53.6 points, or 0.6 per cent, to 8823.3 at 12.38pm AEDT, with six of 11 industry sectors in positive territory led by technology, energy and materials. Wall Street futures rose and the ASX was boosted on reports a group of moderate Senate Democrats have agreed to support a deal to reopen the government which would end the 40-day government shutdown.\n\nWall Street notched its first weekly loss in the last four. Credit: Bloomberg\n\nMining stocks are steady, with Rio Tinto up 0.3 per cent, BHP flat and Fortescue 0.1 per cent lower. Gold miners are higher after the price of the safe haven climbed over the weekend to settle at around $US4000 ($6150) an ounce. Evolution Mining jumped 2 per cent and Northern Star rose 1.9 per cent in early afternoon trade.\n\nEnergy stocks have made a strong start to the week after oil prices advanced with Woodside Energy (up 1 per cent), Santos (up 0.1 per cent), Yancoal (up 2.2 per cent) all in the green.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/weatheralds-short-lived-ashes-audition-20251110-p5n93y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Weatherald's short-lived Ashes audition",
        "publish_date": "Mon, 10 Nov 2025 12:43:42 +1100",
        "category": "finance",
        "authors": [],
        "text": "Weatherald's short-lived Ashes audition\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-man-allegedly-exposed-himself-to-girls-in-several-cities-20251107-p5n8h3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Man allegedly exposed himself to teen girls in Newstead, Springfield; Dingo snatches shark on K’gari; Princess Anne to arrive in Brisbane for Remembrance Day",
        "publish_date": "Mon, 10 Nov 2025 12:36:57 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Coffee drinkers could be protecting themselves from heart failure, stroke and premature death, new research suggests.\n\nAtrial fibrillation (AF)– an irregular heartbeat – affects one in three people at some point in their lifetime, but many are undiagnosed.\n\nNew research from the University of Adelaide and University of California shows just one cup of coffee a day could be highly beneficial for those with AF.\n\nA coffee a day could keep the doctor away. Credit: iStock\n\nA randomised clinical trial was carried out on 200 patients with an irregular heartbeat from Australia, the United States and Canada. Half of the participants were required to consume at least one cup of coffee or espresso shot each day, while the other group had to abstain from coffee and caffeinated products.\n\n“The results were astounding,” said Professor Christopher X from the University of Adelaide.\n\n“In contrast to conventional wisdom, we found the coffee drinkers experienced a significant reduction in AF compared to those who avoided coffee and caffeine.\n\n“This is surprising as it goes against the common assumption by doctors and patients that coffee worsens heart rhythm disorders such as AF.\n\nDoctors have always recommended patients with problematic AF minimise their coffee intake, but this trial suggests that coffee is not only safe but likely to be protective.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/the-story-of-the-victoria-cross-in-australia-20251110-p5n93g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The story of the Victoria Cross in Australia",
        "publish_date": "Mon, 10 Nov 2025 12:13:34 +1100",
        "category": "finance",
        "authors": [],
        "text": "The story of the Victoria Cross in Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-personification-of-mediocrity-why-afl-s-wildcard-round-is-a-bad-idea-20251110-p5n8z7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "At odds with the fans: Why AFL’s wildcard round is a bad idea",
        "publish_date": "Mon, 10 Nov 2025 12:06:58 +1100",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "The final eight lived, in different formats, for 32 seasons and was successful in winning the confidence of the public, the clubs and the players.\n\nWhich raises the question of why, given the success of the eight, it has been killed off and replaced by what should henceforth be known as the top 10.\n\nThe Swans finished 10th in 2025 with a percentage of less than 100. Credit: AFL Photos via Getty Images\n\nTo many fans, including this one, eight is enough.\n\nIn 1990, the AFL had a final five for a 14-team competition. This expanded to a final six for 15 teams when the Crows arrived the following year, and then the great leap forward was made in 1994 when the league introduced the top eight.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/riverfront-house-goes-for-8-42-million-as-bids-drop-to-as-low-as-50c-20251110-p5n8zd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Riverfront house goes for $8.42 million, as bids drop to as low as 50c",
        "publish_date": "Mon, 10 Nov 2025 12:05:20 +1100",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "One of Bulimba’s last original riverfront relics has sold under the hammer for $8.42 million after a fast and erratic auction where bids dropped as low as 50¢.\n\nComplete with an old Hills Hoist perfectly poised to soak up million-dollar river views and a bronze propeller out front paying homage to the suburb’s blue-collar wharfie roots, the five-bedroom brick and concrete house, at 49 McConnell Street, has set a street benchmark and a suburb record for price per square metre.\n\nIn front of a crowd of almost 120, five bidders battled before two punters turned the auction into high-stakes theatre.\n\n“Bidding opened at $5.5 million and rose in $100,000 increments until we hit $8 million … then it got wild,” said Carla Haddan, of Place Bulimba.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/succeeding-smith-the-top-contenders-and-afl-convert-building-test-cases-20251106-p5n8bq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Succeeding Smith: The top contenders – and AFL convert – building Test cases",
        "publish_date": "Mon, 10 Nov 2025 12:03:24 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Bulls batsman Jack Clayton has developed a reputation for rescuing Queensland from precarious situations. There was a time when he could see himself playing football for Brisbane Lions, before he begrudgingly accepted a local cricket call-up. But he has since shown his ability to counter-punch. In last summer’s Sheffield Shield final he notched a century in the face of a 166-run first innings’ deficit, with a resolve strikingly similar to batting legend Steve Smith. Jack Clayton celebrates a century at a Sheffield Shield match at the Gabba. Credit: Getty Images At 36, Smith is closer to the end of his illustrious career, preparing for what could be his final Ashes campaign on home soil. Clayton, 26, is in the discussion to one day replace him. En route to 113 against New South Wales last week at the Gabba, rebuilding the innings after Usman Khawaja (87) and Lachie Hearne (nine) fell in quick succession, the left-hander went some ways to vindicating that claim.\n\nAdvertisement\n\nAnd with Australian selectors showing a willingness to pick players well into their careers – 31-year-old Jake Weatherald earning an Ashes call-up – time is on Clayton’s side. “Obviously, I’d love to throw my name into that mix, but my focus is to score runs for Queensland, and the rest will take care of itself,” he said. Loading “I think previously when I’ve started to think about things like that, or in grade cricketing trying to play for Queensland, you get too worried about selection at a higher level, and you lose focus on the here and now. “My favourite player was Mike Hussey, and he didn’t debut until his 30s. “I’m just beginning my journey, but I think it definitely does give hope to anybody in state cricket who’s not necessarily young but a bit older and knocking the door down. “There are opportunities there, and selectors pick people who score runs – that’s your main currency.”\n\nAdvertisement\n\nClayton has slowly built his resume away from the spotlight. An off-season spent tightening his technique has paid dividends, working closely with Test star Marnus Labuschagne. Against the Blues, he looked rock solid defensively on the front foot, drove with precision, was quick to get into his hook and cut, and was unafraid to take on Test spinner Nathan Lyon. But despite a tendency to thrive the more challenging a situation, he remains frustrated by not converting promising starts into groundbreaking knocks. “Have you been talking to Uzzie [Khawaja]?” Clayton asks with a laugh. “After the last game, he said, ‘You’ve got a few hundreds now, I want a big hundred’. “I was having a think after the last game, and you can almost put too much pressure on yourself to go out there and make that hundred a really big one.\n\nAdvertisement\n\n“But you get to a hundred doing what you did. Keep doing that for as long as you can, and don’t get out of that bubble. “I definitely think it’s something I love when the game’s on the line. “I don’t know, it just seems to focus me on what I need to do, and I need to find a way to get into that mindset more often.” Clayton’s fate could have been so different. Loading A former member of the Brisbane Lions academy, Clayton’s junior sporting days were littered with schoolboy honours, and even a 2016 Rising Star nomination in the second division North East Australian Football League. His cricket return came by chance – playing third-grade for the University of Queensland in the footy off-season, before accepting a second division invitation with a sigh.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/15-martinis-midnight-spag-and-bloody-mary-salad-inside-a-lygon-street-public-house-20251107-p5n8mk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "$15 martinis, midnight spag and Bloody Mary salad. Inside Lygon Street’s new ‘public house’",
        "publish_date": "Mon, 10 Nov 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Advertisement\n\nEating outJust open $15 martinis, midnight spag and Bloody Mary salad. Inside Lygon Street’s new ‘public house’ The owner of hatted restaurant Etta has opened a more easygoing and economical venue, Daphne, just down the road. It’s “fun, loose and for you to use as you see fit”. Tomas Telegramma November 10, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nDaphne, the sophomore opening for Hannah Green – owner of hatted Brunswick East diner Etta – has been created as a chameleon. It’s not a pub or a wine bar or a restaurant. It’s all of the above and more, intended to be a neighbourhood institution. A few doors down from Etta on Lygon Street, Daphne is what Green calls her “public house”. The 125-seat bar and restaurant is “fun, loose and for you to use as you see fit”, she says. It’s a more easygoing – and economical – experience than what Etta has flourished into. Hannah Green’s Daphne is a pub, wine bar and restaurant rolled into one neighbourhood institution. Ashley Ludkin Designed by IF Architecture (Etta, Cutler, Baker Bleu), Daphne is a fresh face for the space once home to the longstanding Cafe Romantica, but known most recently as Bar Romantica. “I wanted to pay respect to the site because it was fairly iconic,” Green says. “But I also wanted to bring light in.”\n\nAdvertisement\n\nWhile the original terrazzo floor and popcorn-look vermiculite ceiling remain, the room has been brightened in a big way. “Everything is reflective,” Green says, from the iridescent 3D-printed lightshades to the stainless-steel open kitchen. New street-side seating flows into a casual front bar where you order at the counter. Beyond: a full-service bistro with clothed tables and a curtained-off private dining room. 1 / 9 From left: Pip Littore, chef Diana Desensi and owner Hannah Green. Kristoffer Paulsen 2 / 9 Wood-fire oven roasted half chook with blistered grapes and a salty-sweet agrodolce-like sauce. Kristoffer Paulsen 3 / 9 The former Bar Romantica space has been redesigned by IF Architecture. Shelley Horan 4 / 9 Daphne is Etta’s more affordable, casual sibling venue. Shelley Horan 5 / 9 Potato flatbread with mussels escabeche and whipped cod roe. Kristoffer Paulsen 6 / 9 Bloody Mary salad. Ashley Ludkin 7 / 9 Ricotta tortellini with artichoke, radicchio and milk sauce. Shelley Horan 8 / 9 A curtained-off private dining room lies at the rear. Shelley Horan 9 / 9 Olive oil cake. Shelley Horan Previous Slide Next Slide Presiding over the food is Diana Desensi, former head chef of Montalto and the now-closed Saint George, who has a simple motto: “If it hasn’t been done before, we’re not doing it.” But that’s not to say she isn’t putting her own flair and flourishes on familiar dishes. The same menu runs across the front bar and bistro, featuring a dish Desensi cooked for Green to help her get the gig. It’s a half chicken that’s brined, “dunked in herb butter so the whole thing kind of mummifies”, then roasted to golden perfection in the wood-fire oven before being served with blistered grapes and a salty-sweet agrodolce-like sauce.\n\nAdvertisement\n\n‘If it hasn’t been done before, we’re not doing it.’ Daphne chef Diana Desensi Other highlights include a fermented potato flatbread with mussels escabeche and whipped cod roe, and unusually exciting salads like a colourful cobb and an heirloom tomato medley with all the flavours of a Bloody Mary. Weekly “neighbourhood nights” each have a different hero item. Go for $15 martinis on Mondays (and get an olive stamp on your loyalty card so your 10th is free), $30 steak with fries on Tuesdays, and $25 handmade pasta on Wednesdays. There’s also a kids’ menu, and a supper menu on Fridays and Saturdays. With last orders at midnight, it appropriately stars a midnight spaghetti jam-packed with anchovies and capers. The Guinness Americano cocktail tastes like a “chocolate negroni”. Shelley Horan As at Etta, the cocktails are a cut above, curated by drinks maverick Sam Peasnell who also lent his expertise to the drinks lists at Barragunda and Dom’s Social Club. His take on the Americano Perfecto (topped with lager instead of the Americano’s usual soda) subs in Guinness, which floats atop the Campari and vermouth for a low-ABV drink that he says tastes like a chocolate negroni.\n\nAdvertisement\n\nRelated Article Lygon Street hatted restaurant Etta to open more affordable sibling (and it’s close by) Sommelier Ashley Boburka’s wine list puts Victoria centre stage, including pinot gris and chilled sangiovese by Yarra Valley winemaker Valentine, both on tap for $10 a glass. After dinner, the old Bar Romantica sound system cranks up for late-night DJ sets. Daphne opens today, November 10 at 52-54 Lygon Street, Brunswick East, daphne.melbourne Open dinner Mon-Sat\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/the-rising-threat-to-the-global-financial-system-20251110-p5n8zl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The rising threat to the global financial system",
        "publish_date": "Mon, 10 Nov 2025 11:58:42 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Until now, questioning of the boom in investment in artificial intelligence has largely been confined to whether it constitutes a stockmarket bubble. Increasingly, the conversation will shift to whether that boom represents a threat to financial system stability.\n\nThe first phase of the sector’s development has been largely, albeit not entirely, equity funded, with the mega techs – the so-called “hyperscalers” like Google, Microsoft, Meta Platforms and Amazon – funding their massive investments in chips and data centres from their massive cash flows.\n\nThe combination of frothy asset values and leverage is a combustible one. Credit: AP\n\nBetween them, those companies will spend $US375 billion ($577 billion) on AI infrastructure and chips this year and closer to $US450 billion next year. Given their cashflows, balance sheets and pristine credit ratings – between them, they had little to no net debt when this splurge in AI spending started – they can afford their investments.\n\nThere are others, like OpenAI and other AI start-ups, that are making massive commitments (in OpenAI’s case about $US1.4 trillion) without the funding for them in place, relying on access to the equity markets and, to some degree, on circular finance and financial engineering – securing funding from chipmakers, for instance, in return for agreeing to buy the equivalent value of chips.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/librarian-splashes-4-9-million-on-luxurious-sydney-house-20251110-p5n8za.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Librarian splashes $4.9 million on luxurious Sydney house",
        "publish_date": "Mon, 10 Nov 2025 11:58:16 +1100",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A determined librarian shelled out $4.9 million for a brand-new five-bedroom house in Burwood at auction on Saturday, paying $500,000 above its $4.4 million reserve to secure the keys.\n\nThe sleek inner west property at 21 Belgrave Street had also captured the heart of a neighbour from the same street who had watched the development from beginning to end, but just missed out by $50,000.\n\nBidding took a few minutes to start, then $3.8 million opened the action. Once it got started it was rapid fire in mostly $100,000 increments until $50,000 bids towards the end. Only two out of the six registered made offers on the home, which had a $4 million guide.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/hated-european-item-finally-coming-to-australia-amid-new-ban-get-used-to-it-013928718.html",
        "title": "Hated European item finally coming to Australia amid new ban: 'Get used to it'",
        "publish_date": "2025-11-10T01:39:28Z",
        "category": "finance",
        "authors": [
            "Australian Authorities Push To Combat Plastic Litter"
        ],
        "text": "There are plenty of things in Europe those living in Australia wish we had. Its variety of cultures and languages, peppered with iconic landmarks, inspires thousands to travel there every year.\n\nAside from the huge crowds, and crippling exchange rate which put a dampener on European travels, there is one quirk people around the world don't like about visiting Europe, and soon, millions of Australians will have to deal with the same issue.\n\nIn a major crackdown on plastic, the New South Wales government announced this week it will be getting rid of many household items like plastic fruit and veg stickers, soy sauce fish bottles and plastic bread tags in a bid to be more sustainable.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut, in a major change sure to divide people, it will become mandatory by 2030 for lids to be tethered to plastic bottles, and while many will bemoan the inconvenience, environmental campaigners told Yahoo News it's solving a \"really big issue\".\n\nTethered plastic bottle lid a change everyone must get used to\n\nThe tethered bottle lid became associated with European travel after a directive on the lids being attached was issued by the European Union in 2019, before becoming law in July, 2024. Many people have taken to social media to express their disdain for the feature.\n\nVideos from Aussies, Americans and Europeans filming themselves highlighting how frustrating it is to have the lid sticking out of the bottle as they drink from it. The bottle-lid combo has already become increasingly frequent in the UK as well, and many Brits aren't happy about it.\n\nBut it's a move long pushed by environmental advocates, like Lottie Dalziel, who runs recycling plastic business Banish. She told Yahoo News plastic lids are a \"really big contributor\" to litter, and the change will ultimately give us less litter to contend with in Australia.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"It's a really big issue. We've seen a great reduction in litter with the Return & Earn scheme in NSW, but bottle top lids in general are one of the most commonly littered items,\" she told Yahoo, explaining they are very commonly washed ashore at beaches.\n\nShe welcomes the change and said it will make the recycling process easier as the lids won't \"pop\" off during the crushing process, meaning they will be easier to handle and recycling facilities can treat the bottle as one piece of litter, rather than two.\n\n\"It's just change, and eventually everyone will get used to it. It'll just take a second,\" she said.\n\nAustralian authorities push to combat plastic litter\n\nAustralia generates significant plastic waste, with 3.2 million tonnes produced over the 2023-2024 financial year, up from three million the previous year, according to the Department of Climate Change, Energy, the Environment and Water.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nStates and territories are trying to do their bit to reduce plastic waste, with NSW explaining the problem remains one of its biggest environmental challenges, with 74 per cent of litter in waterways being made up of plastic. Only 16 per cent of plastic waste is recycled in the state, with the remaining going to landfill.\n\n\"Microplastics are entering our bodies, and plastic is polluting our environment and oceans, killing our wildlife,\" NSW Minister for Environment, Penny Sharpe, said. \"Our plan has carefully considered actions we need to take to protect the environment and human health, while also considering how we can support industry to transition to recyclable or reusable alternatives.\"\n\nThe NSW Plastics Plan will be phased in over the coming years, and the following rules will be enacted:\n\nPlastic bread tags and pizza savers phased out by 2027\n\nTakeaway food service businesses must accept reusable cups by 2028\n\nNon-compostable plastic fruit and vegetable stickers phased out by 2030\n\nIntroduction of tethered lids for plastic bottles by 2030\n\nLarge food service businesses to provide reusable cup options by 2030\n\nSmall condiment containers, such as soy sauce fish bottles, will be phased out by 2030\n\nRedesign of takeaway food containers, such as plastic bowls with lids, bento boxes and sushi trays, to ensure they can be recycled safely\n\nRegulate harmful chemical additives in plastic food and beverage packaging to prevent toxins from entering soil, water and the food chain\n\nBan lighter-than-air (helium) balloon releases, in line with other states.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOther jurisdictions around the country are also taking steps to reduce plastic waste, with single-use plastic, such as cutlery and straws, being banned. Recently, South Australia introduced a state-wide ban on soy sauce fish bottles, something NSW is now following.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]