[
  {
    "url": "https://www.9news.com.au/national/cash-mandate-australia-what-is-it--explained/26e04d51-c6fd-4e47-8ade-4a802a97bbc0",
    "title": "Cash mandate for Aussie businesses just weeks away",
    "publish_date": "Tue, 16 Dec 2025 22:59:26 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Treasurer Jim Chalmers ﻿ has announced that Australia will be introducing a cash mandate for grocery and fuel retailers in 2026.\n\n\"We're delivering on our commitment to mandate cash acceptance for essential purchases ,\" he said in a statement.\n\n\"This will help to ensure Australians can continue to pay with cash for essentials if they want to.\"\n\nTreasurer Dr Jim Chalmers announced the cash mandate will come into effect on New Year's Day. (Alex Ellinghausen)\n\nChalmers said the mandate will ensure Australians who depend on cash for fuel and groceries \"aren't left behind\".\n\nBut the landmark mandate won't apply to all businesses.﻿\n\nHere's what you need to know about Australia's cash mandate and how it will work.﻿\n\nWhat is the cash mandate in Australia, and how will it work?\n\nUnder the new cash mandate, ﻿businesses that sell fuel and groceries must accept cash payments for these essential purchases.\n\nThe mandate will mostly apply to retailers like supermarkets and service stations.\n\n\"You should be able to pay with cash if you need to, and that's what these regulations are all about,\" Chalmers said.﻿\n\nHowever, there will be some exceptions.\n\nRetailers only have to accept cash payments for in-person purchases of $500 and less.\n\nThe transaction must also made between the hours of ﻿7am and 9pm.\n\nREAD MORE: Islamic State links at centre of terror attack probe\n\nMost retailers will be required to accept cash payments for essential purchases, like groceries. (Getty)\n\nRetailers can refuse cash for purchases made outside those hours, or for transactions of more than $500.﻿\n\nSmall businesses with aggregate annual turnover under $10 million will be exempted from the cash mandate.﻿\n\nThe mandate will still apply to small businesses that choose to share a trademark with a larger retailer.﻿\n\nAustralian consumers also retain the right to ﻿pay bills with cash at their local Australia Post outlet through Post Billpay.\n\nThis includes utilities, phone bills and council rates.\n\nWhen does the cash mandate start?﻿\n\nThe official cash mandate start date in January 1, 2026.﻿\n\nThat means most businesses that ﻿sell groceries or fuel must accept cash for in‑person transactions of $500 or less starting from 7am on New Year's Day.﻿\n\nREAD MORE: Radio saved the life of Bondi terror attack victim\n\nAussies who have resisted the transition to a cashless society will be thrilled by news of the cash mandate. (AFR)\n\nIs it legal to refuse cash payments in Australia?\n\nIt is still legal for ﻿businesses that don't sell fuel and groceries to refuse cash payments in Australia.\n\nIt is also legal for small businesses that sell those essentials but are exempt from the cash mandate to refuse cash payments.\n\nWill Australia ever go cashless?\n\nIt's unlikely that Australia will go totally cashless, at least while this new﻿ cash mandate is in effect.\n\nChalmers﻿ said the mandate will run for three years, at which point the government will review it to ensure it is functioning as intended.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/short-term-spending-rises-despite-overall-budget-improvement/106152498",
    "title": "Short-term spending rises despite overall budget improvement",
    "publish_date": "Wed, 17 Dec 2025 01:34:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal government has added to short-term spending but decreased it overall, while Treasury has upgraded its inflation forecast for the next two years, the mid-year budget update reveals.\n\nIn Canberra on Wednesday Treasurer Jim Chalmers and Finance Minister Katy Gallagher delivered the first comprehensive update to the nation's finances since the 2025 election.\n\nThe budget papers show the government's own decisions improved the bottom line by $2.2 billion over four years, despite the fact that the watering down of its super tax plans has wiped $3.8 billion off revenue.\n\nMost of these savings come in the later years of the budget forecast period. Overall, the government's decisions will increase spending by $1.8 billion this financial year, compared to Treasury's pre-election update (PEFO)\n\nThe largest savings come from the public service, where $6.8 billion will be saved over four years by further reducing reliance on consultants, as promised during the election, and by cutting down on travel and non-staffing expenses.\n\nOnce again, the budget has also been aided by a higher tax take, with $32.6 billion more expected over the next four years.\n\nThis has been propelled by higher-than-expected inflation, which results in more income tax, and by a boom in private investment. Inflation has also pushed up government payments, which are $35.1 billion higher overall.\n\nThe budget bottom line is better in each year, with an underlying cash deficit of $36.8 billion in the current financial year compared to $42.2 billion estimated at PEFO. Much of the change in this year is driven by the higher tax take.\n\nBudget papers predict higher inflation over the next two years compared to the last update. Treasury suggests some of the uptick in inflation is temporary, but says increases in prices for services and new homes will be \"more persistent\".\n\nGrowth forecasts for China and the US have been revised down, as has the estimate of Australia's real economic output in this financial year.\n\nNew spending includes housing and rollover of social programs\n\nMuch of this short-term increase in spending is to cover election commitments and subsequent policy announcements.\n\nNew funding has also been allocated to roll over programs that were due to \"terminate\" because they were only funded for a limited period of time. They include several health programs, domestic violence programs, and Closing the Gap initiatives.\n\nA handful of new decisions includes a $1.1 billion outlay for mental health, including new youth specialist centres and upgrades to existing Medicare and Headspace services, plus $233 million for science agency CSIRO.\n\nThe update also includes $10 billion over eight years for the government's election promise to support the construction of 100,000 new homes reserved for first home buyers.\n\nThis money is placed in a fund, which means it does not count towards the usual measure of the budget bottom line.\n\nIt will comprise $2 billion in grants and $8 billion in loans, delivered in tandem with states and territories on vacant or public land, with construction to start in the next financial year.\n\nBudget papers also reveal that 21,000 first home buyers have taken advantage of the expanded 5 per cent deposit scheme since it came online in October, in what appears to be an acceleration of interest in the scheme.\n\nEarlier government figures showed fewer than 6,000 people used the scheme in October.\n\nThe government has also had to substantially expand its liability for the social and affordable homes it is funding under the Housing Australia Future Fund, stretching the Commonwealth's commitment from $26 billion to $44 billion.\n\n$1.8 billion will be saved by changing the rules around \"deeming\", the process that estimates how much pensioners and other welfare recipients earn from their investments.\n\nThe less generous deeming method, which was announced in August, will achieve the saving by reducing the payments of some recipients through the means-testing system.\n\nThe government will also raise $720 million over four years by increasing international student visa charges to $2,000, an election promise.\n\nTobacco excise continues to fall\n\nWhile tax increased overall, the tobacco excise continued its tumble over successive budgets, despite a higher uptake of smoking. The excise will collect 23 per cent less this financial year than was expected at the last update, and 29 per cent less next year.\n\nExpected revenue from the petroleum resources and rent tax (PRRT) has also decreased by 23 per cent this year and by 17 per cent next year.",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/big-spotty-spotted-gum-north-brooman-state-forest/106135758",
    "title": "Push to recognise home of 70-metre-tall 'world champion' spotted gum",
    "publish_date": "Wed, 17 Dec 2025 01:09:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "It is the sort of place where it is difficult to see the \"tree\" for the forest — even if it is 70 metres tall.\n\nIn North Brooman State Forest, between Batemans Bay and Ulladulla on the NSW South Coast, a magnificent spotted gum peeks out of the canopy.\n\nAccording to the National Register of Big Trees, \"Big Spotty\" is the tallest recorded spotted gum in the world, and has a girth of just under 12 metres at chest height.\n\nThe towering spotted gum sits within North Brooman State Forest on the NSW south coast. (Supplied: Hayden Griffith)\n\nNick Hopkins from Friends of the Forest Mogo compares it to a blue whale.\n\n\"But even that's not a fair comparison because it's much longer than a whale,\" he said.\n\n\"It really defies words.\"\n\nCelebrating a giant\n\nThe general manager of Eurobodalla Regional Botanic Gardens, Michael Anlezark, said local estimates that put the age of Big Spotty at 500 years were an \"educated guess\" that could not be verified without invasive procedures.\n\n\"In the scheme of things, it doesn't matter how old it is,\" he said\n\n\"We just know it's very ancient.\"\n\nNorth Brooman State Forest lies between Batemans Bay and Ulladulla. (Supplied: Andrew Kaineder)\n\nLocal campaigners want the NSW government to protect and celebrate the giant gum by making North Brooman State Forest a nature reserve.\n\nMr Hopkins said the move would bring tourists to the local area to see the ancient tree.\n\nNick Hopkins says the scale of Big Spotty defies words. (ABC South East NSW: Toby Hemmings)\n\n\"We think the South Coast forests could be a potential hotspot for giant tree tourism and Big Spotty would be a centrepiece of that,\" he said.\n\n\"All it would really take for it to be a success would be improved road access, some signage, a car parking area and a boardwalk.\n\n\"Here we have a world champion that is completely unrecognised and uncelebrated, and we'd like to change that.\"\n\nHidden in forest\n\nThe giant gum stands about 100 metres into the bush, off a dirt road in the North Brooman State Forest.\n\nIts location is not marked on any local maps.\n\nCurrently, there's no signage to find the spotted gum hidden deep within North Brooman State Forest. (ABC South East NSW: Toby Hemmings)\n\nAccording to the Forestry Corporation New South Wales's (FCNSW) harvest plan, sections of North Brooman State Forest are scheduled to be logged within the next six months.\n\nFCNSW has previously designated the tree as significant, and gave it a 60-metre radius exclusion zone the last time logging occurred in the area.\n\nIn a statement, a FCNSW spokesperson said there were currently no plans to log near Big Spotty and that the tree had been protected in multiple harvesting operations over the past 70 years.\n\nThe NSW minister for agriculture, Tara Moriarty, said that Big Spotty would continue to be permanently protected into the future in an area of forest that is not being harvested.\n\nThe spotted gum is believed to be over 500 years old. (ABC South East NSW: Toby Hemmings)\n\nProtecting southern forests\n\nThe campaign for a nature reserve comes as local conservationists advocate for greater protection of South Coast native forests, following the announcement of the Great Koala National Park on the state's north coast in September.\n\n\"[The Great Koala National Park] is a tremendous win for nature and native animals,\" Forest Alliance NSW spokesperson Justin Field said.\n\n\"It'll be great for the economy through nature-based tourism and investing in visitor infrastructure and infrastructure for recreational users of our natural environment.\n\n\"Let's imagine a great southern forest as well, as a protected area down here for our gliders and birds and quolls, and all those in the community who want to enjoy nature.\"\n\nDoro Babeck said the time to protect native forests on the south coast is now. (ABC South East NSW: Toby Hemmings)\n\nDoro Babeck from the Bob Brown Foundation said giant trees like Big Spotty should be celebrated.\n\n\"In Europe, we have these old cathedrals that people worship like Notre Dame,\" she said.\n\n\"For me, the beauty in Australia is that we have these ancient pieces, luckily still left.\n\n\"These trees are the cathedrals of Australia.\"\n\nActivists want to see the giant spotted gum protected and made more accessible for tourists. (Supplied: Andrew Kaineder)",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/bulmers-vegetable-farm-charges/106022616",
    "title": "Victorian vegetable farmer accused of underpaying migrant workers",
    "publish_date": "Wed, 17 Dec 2025 00:23:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "An eastern Victorian vegetable farm will face court early next year accused of underpaying 28 migrant workers more than $645,000.\n\nBulmers Farms produces lettuce, spinach and broccoli at Lindenow in East Gippsland, about three hours east of Melbourne.\n\nThe company is owned by Bill Bulmer, the Victorian chair of the peak industry body, Ausveg.\n\nThe Fair Work Ombudsman alleges the company breached the Fair Work Act by paying workers a set weekly amount based on annual salaries, regardless of the number of hours they worked.\n\nThe workers from Kiribati, Timor Leste and the Solomon Islands were hired under the Pacific Australia Labour Mobility (PALM) scheme and worked in a range of roles, including as farm workers, forklift drivers and tractor operators.\n\nThe ombudsman said individual workers were underpaid amounts ranging between $1,500 and $39,000.\n\nThe underpayments allegedly occurred between December 2019 and December 2023.\n\nThe ombudsman says the workers were paid between $884 and $1,105 per week for a 38-hour week, but more than half the time were required to work additional hours.\n\nThis allegedly resulted in the workers being underpaid their minimum hourly rates, overtime rates and for public holiday work.\n\nThe ombudsman says that in 7 per cent of cases, the workers were required to put in more than 50 hours a week.\n\nThe company is also said to have made unlawful deductions from the workers' pay for airfares, accommodation and health insurance.\n\nFair Work Ombudsman Anna Booth says workers must be paid for every hour they work. (ABC News: Billy Cooper)\n\nUnderpayment unacceptable, ombudsman says\n\nFair Work Ombudsman Anna Booth said charges were warranted because of the scale of the underpayments.\n\n\"The alleged underpayments of migrant workers by Bulmer Farms across four years was entirely unacceptable, and we will be pursuing penalties to hold the company to account,\" Ms Booth said.\n\n\"Employees must be paid for every hour they work. We've been calling this issue out for years — the law demands that workers are paid for the actual hours they work and employers cannot rely on default annualised salary-based payments if they have not factored in all entitlements for any extra hours worked.\"\n\nThe ombudsman's investigation also uncovered alleged breaches of record-keeping and payslip laws.\n\nBulmer Farms is facing multiple breaches of the Fair Work Act, with each breach attracting fines of up to $93,900.\n\nThe company will face the Federal Circuit and Family Court in Melbourne for a directions hearing on January 21, 2026.\n\nUniting Church social justice advocate Mark Zirnsak says the ombudsman's action sends a message to employers. (Supplied: Uniting Church in Australia)\n\nHard for workers to speak up, campaigner says\n\nUniting Church social justice advocate Mark Zirnsak welcomed the charges.\n\n\"This kind of strong action by the Fair Work Ombudsman is necessary to make sure employers understand they can't rip off workers and get away with it,\" he said.\n\nMr Zirnsak said migrant workers were vulnerable and it was hard for them to speak up when they were not paid or treated properly.\n\n\"In some cases, they may fear retaliation, so they end up not pursuing cases.\"\n\nHe is keen to see changes to the way the PALM program is run to provide more support for workers.\n\n\"[Allow] workers to get that guarantee of being able to return to another employer should they raise something that is found to be a legitimate allegation,\" he said.\n\nAusveg says chairman not actively involved in company\n\nAusveg acknowledged the Fair Work Ombudsman's proceedings against Bulmer Farms.\n\n\"AUSVEG notes that its Chairman Bill Bulmer has not been actively involved in operational aspects of the Bulmer Farms business for close to a decade,\" a spokesperson said in a statement.\n\n\"As legal proceedings have commenced, AUSVEG cannot comment on the specific matter.\"\n\nThe spokesperson said Ausveg had been and remained a \"a tireless advocate for grower and worker wellbeing\".",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/ashes-2025-steve-smith-unwell-as-usman-khawaja-comes-into-team/106152450",
    "title": "CA explains Smith's shock withdrawal as Khawaja gets Test lifeline",
    "publish_date": "Wed, 17 Dec 2025 00:08:18 +0000",
    "category": "sports",
    "authors": [],
    "text": "Cricket Australia has confirmed Steve Smith had been suffering from \"nausea and dizziness\" in the lead-up to his shock withdrawal from the Adelaide Test.\n\nSmith warmed up on Adelaide Oval ahead of day one, but left the stadium after a brief chat with coach Andrew McDonald.\n\nThe star batter has battled with vertigo-like symptoms in the past.\n\n\"Steve Smith was ruled out of the third Ashes Test in Adelaide today. Over the past few days he has been feeling unwell, with symptoms including nausea and dizziness,\" a Cricket Australia statement said.\n\n\"He was assessed and monitored closely and was close to being available to play. However, given the persistence of symptoms, a decision was made not to proceed.\n\n\"He is being treated for a potential vestibular issue. This is something Steve has experienced intermittently in the past and is being managed accordingly. He is expected to be available for the Boxing Day Test in Melbourne.\"\n\nUsman Khawaja has won a Test lifeline with the late withdrawal of Steve Smith. (Getty Images: Mark Brake)\n\nThe withdrawal has handed Usman Khawaja a Test lifeline, with the veteran set to bat at number four.\n\n\"Steve is feeling a little bit unwell the last couple of days,\" captain Pat Cummins said.\n\n\"He came and gave it a crack this morning but didn't think he was going to get up for this one so he's headed off home.\n\n\"But we're pretty lucky we have got someone like Usman who can step right in.\"\n\nABC Sport's Darren Lehmann said the withdrawal would hurt, but Australia was lucky to have Khawaja waiting in the wings.\n\n\"Steve Smith out, that's a big hurt for the Australian team, but luckily enough they've got Usman to come in and bat four\" Lehmann said.\n\n\"I was really proud of the selectors. I thought they did a great job selecting the 11 … it's shown they were willing to move on to make sure they've made the right call.\n\n\"I think Usman will do a great job replacing Steve Smith.\"\n\nCummins has returned to Australia's side following his back issues, while Nathan Lyon is also back.\n\nSeamers Michael Neser and Brendan Doggett have missed out.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nKhawaja will turn 39 on day two of this Test, and had initially been overlooked for a return to the Test side after overcoming back spasms.\n\nThe hosts can wrap up the series with victory in Adelaide, but the absence of Smith comes as a huge blow.\n\nThe 36-year-old remains Australia's most reliable batter, with scores of 61 not out and 23 in the eight-wicket win in Brisbane earlier this month.\n\nWinning the toss, however, is a victory for the hosts.\n\nHot conditions are expected through the first two days, and England captain Ben Stokes had made no secret of the fact he intended to bat first if given the chance.\n\nEngland, meanwhile, have made the one change, with Josh Tongue coming in for Gus Atkinson.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AAP",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/high-court-appeal-light-rail-class-action-result/106152520",
    "title": "Court win for traders seeking compensation over Sydney light rail",
    "publish_date": "Wed, 17 Dec 2025 00:04:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "The High Court has cleared the way for traders along the Sydney CBD light rail corridor to seek compensation for disruption caused by the project.\n\nThe two lead businesses in a class action, Hunt Leather and a restaurant, were initially awarded $4 million.\n\nBut that was overturned on appeal.\n\nA stumbling block for the class action was that a law which authorised the development, protected the project from liability.\n\nElizabeth Hunt and Sophie Hunt of Hunt Leather in the CBD. (ABC News: Liv Casben)\n\nThe development began in 2016 and was not completed until 2020 — a year behind schedule.\n\nThe final cost was $2.96 billion — an overrun of $1.3 billion — from the initial estimate.\n\nThe initial court ruling found that once the delays began, the disruption from the project became unreasonable.\n\nThat disruption included dust and noise from jack hammers, trucks and diggers, and the hoardings around the construction areas.\n\nThe appeal court found the delays could not have been foreseen and the government project was not liable.\n\nThe cost of Sydney's light rail would eventually blow out to $2.9 billion. (ABC News: Keana Naughton)\n\nOn Wednesday, the High Court found there had been substantial interference in the use of the land by the traders, and Transport for New South Wales had failed to minimise the extent of the interference when it planned and procured the construction of the project.\n\nUp the 300 other businesses have been waiting on the ruling to see if they too could be eligible for some compensation.\n\nAnd the case is being watched carefully from other places, where light rail developments have caused significant disruptions to businesses.\n\nThat includes Canberra and the Gold Coast.\n\nBut a claim by the traders to secure funds for their litigation funders was rejected by the court.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/four-escape-after-jumping-from-three-storey-building-newcastle/106152060",
    "title": "Four people jump for their lives from burning apartment block",
    "publish_date": "Tue, 16 Dec 2025 23:39:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Four people have managed to escape without serious injury after they jumped from the third floor of a burning apartment building in Newcastle.\n\nAt 10pm on Tuesday night, emergency service crews were called to Parkway Avenue at Cooks Hill to reports of a unit complex on fire.\n\nFire crews battled the blaze at the unit on Tuesday night. (Supplied: Carey Harris)\n\nWhen crews arrived, they saw four people jump from the top level to the ground.\n\n\"It was pretty hectic when we got here, to have people that scared for their safety, they've jumped out of the third-storey building is quite dark and frightening,\" Inspector Craig Clark said.\n\nA 47-year-old woman, three men aged 43, 50 and 58 who jumped were treated for non-life-threatening injuries before being taken to John Hunter Hospital.\n\nFirefighters removed a 62-year-old man from the 2nd level with smoke inhalation.\n\nAdam Telfer, who lives in the building, jumped from the second floor of the apartment block. (Supplied: Carey Harris)\n\nNewcastle resident Adam Telfer was in bed on the second floor of the apartment block when the fire broke out.\n\n\"I heard someone yell out, 'fire,' and I ran to the lounge room. I went out the front door and this big flame came up the stairway, so I had to shut my door.\n\n\" I just ran and jumped out the window, \"\n\nMr Telfer said he was lucky to get away with a few grazes on his arms and legs and avoid going to hospital.\n\n\"People are a lot worse jumping out the window on this side,\" he said.\n\n\"The flames were coming up. There was no hope for us.\"\n\nSeveral rooms in the unit block have been destroyed. (ABC Newcastle: Nakita Jager)\n\nFire inspector Andrew Dunkin said jumping from the building was the best option.\n\n\"They did suffer injuries, but it's better than suffering smoke inhalation,\" he said.\n\n\"It could have been a lot worse. The injuries aren't life-threatening.\"\n\nDetectives are investigating the cause of the blaze. (ABC Newcastle: Nakita Jager)\n\nThe cause of the fire is under investigation.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/ashes-live-adelaide-oval-third-test-australia-england/106151318",
    "title": "Live: England drops 'simple' catch to give Khawaja a life after replacing Smith",
    "publish_date": "Tue, 16 Dec 2025 22:41:20 +0000",
    "category": "sports",
    "authors": [
      "Jon Healy",
      "Henry Hanson"
    ],
    "text": "(Getty Images)\n\nWell, England managed to prise two wickets in that opening session, but you'd imagine Australia will be quite happy heading into the lunch break at 2-94.\n\nThe moment of the session, of course, is the one pictured.\n\nUsman Khawaja was on five and struggling to find his feet in the middle when he edged one through to a diving Harry Brook at second slip.\n\nIt was a very catchable chance, but it was in and it was out of Brook's mitts in a flash.\n\nFrom there, Khawaja has looked sensational.\n\nHe has pulled with authority, swept with ease and clipped pleasingly.\n\nThe stand-in No. 4, who is only playing due to Steve Smith's late withdrawal, has raced to a 55-ball 41.\n\nUp the other end, Marnus Labuschagne has been solid enough, and reaches the break on 19*.\n\nFor England, Josh Tongue, playing his first Test of the series, has looked like a good addition, while Ben Stokes has been typically committed.\n\nWith the pitch already appearing to be dying a touch, they'll be hoping for a couple more poles ASAP when play resumes.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/fifa-cuts-world-cup-ticket-prices-for-2026-tournament/106151914",
    "title": "FIFA offers pool of lower-priced World Cup tickets following backlash",
    "publish_date": "Tue, 16 Dec 2025 21:27:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "Football Australia will be able to issue $90 tickets to the Socceroos' most loyal fans after FIFA agreed to slash the price of some World Cup tickets following a global backlash.\n\nSome fans will even get $US60 ($90) seats for the final instead of being asked to pay $US4,185 ($6,300).\n\nHowever, they are likely to only equate to around 500 tickets a match that Australia plays.\n\nFIFA said that the cheaper tickets would be made available for every game at the tournament, going to the national federations whose teams are playing. Those federations will decide how to distribute them to fans who have attended previous games at home and on the road.\n\nThe cheaper tickets, labelled \"Supporter Entry Tier\", will be 10 per cent of the federation's allocation — which itself will vary depending on stadium size.\n\nLoading...\n\nThe \"participant member association\" allocation is 8 per cent of stadium capacity per country per match.\n\nAustralia's group games are in Vancouver (54,000 capacity), Seattle (69,000) and Santa Clara (71,000), meaning it will respectively receive 432, 552, and 568 $90 tickets for its matches against a UEFA play-off winner (Turkey, Romania, Slovakia or Kosovo), USA and Paraguay.\n\nSo will its opponents. The next cheapest tickets are priced at around $400.\n\nFIFA's climbdown follows meetings between senior officials in Doha this week, where federations are understood to have pushed back at the pricing model.\n\nFans worldwide reacted with shock and anger last week on seeing FIFA's ticketing plans that gave participating teams no tickets in the lowest-priced category.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe co-hosts had pledged eight years ago — when they were bidding for the tournament — that hundreds of thousands of $US21 ($32) tickets would be made available.\n\nFIFA has also faced fierce criticism for a ticket pricing strategy that includes dynamic pricing, in which prices can increase due to demand, and acting as its own resale platform, taking a cut in the process.\n\nWhen the original pricing was announced Football Supporters Association Australia chairman Patrick Clancy said the prices were high but he thought many Socceroos' fans would still buy them.\n\n\"These are historically high prices — even the minimums,\" he said.\n\n\"I'm sure there will be some people who choose not (to go), and that's absolutely fine, but I suspect the large majority will not be put off.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/AP/PA",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/matthew-perry-ketamine-supply-doctor-eight-months-home-detention/106151902",
    "title": "Doctor who helped supply ketamine to Matthew Perry sentenced to home detention",
    "publish_date": "Tue, 16 Dec 2025 21:13:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "A doctor who pleaded guilty of being involved in a scheme to supply ketamine to actor Matthew Perry before his overdose death has been sentenced to eight months of home confinement.\n\nJudge Sherilyn Peace Garnett handed down the sentence that included three years of supervised release to 55-year-old Mark Chavez in a federal courtroom in Los Angeles.\n\nBefore the sentence was delivered, Chavez addressed the judge and said he had lost a loved one recently and understood the grief that Perry's death had caused.\n\n\"I just want to say my heart goes out to the Perry family,\" he said.\n\nHe acquired ketamine and gave it to Salvador Plasencia, who was sentenced to two and a half years in prison earlier this month for selling ketamine to Perry in the months leading up to his death.\n\nMark Chavez admitted to obtaining the ketamine from a wholesale distributor on false pretences. (AP Photo: Damian Dovarganes, File)\n\nChavez's attorneys emphasised the difference between the two doctors and said Chavez \"accepted responsibility early\" by cooperating with investigators and voluntarily giving up his medical licence ahead of his detention hearing.\n\nHis attorney Matthew Binninger said these were \"real steps that someone takes toward accountability\".\n\nHe called the sentence a \"fair and just outcome\" for the case.\n\nPerry had been taking ketamine, a surgical aesthetic, legally as a treatment for depression.\n\nWhen his regular doctor would not provide it in the amounts he wanted, he turned to Plasencia, who admitted to taking advantage of Perry, knowing he was an addict.\n\nPlasencia texted Chavez that Perry was a \"moron\" who could be exploited for money, according to court filings.\n\nSalvador Plasencia earlier pleaded guilty to four counts of distributing ketamine to the actor. (Reuters: David Swanson)\n\nChavez admitted to obtaining the ketamine from a wholesale distributor on false pretences and pleaded guilty to one count of conspiracy to distribute ketamine.\n\nHe has not been in custody.\n\nPerry struggled with addiction for years, dating back to his time on sitcom Friends, when he became one of the biggest TV stars of his generation.\n\nHe starred alongside Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc and David Schwimmer for 10 seasons from 1994 to 2004.\n\nChavez will also be expected to do community service.\n\nHe is the second person to be sentenced of the five defendants who have pleaded guilty in connection with Perry's death in 2023.\n\nThe other three defendants who reached deals to plead guilty will be sentenced at their own hearings in the coming months.\n\nThe medical examiner ruled ketamine was the primary cause of death.\n\nAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-17/drop-in-testing-behind-underdiagnosis-of-copd-lung-foundation/106115100",
    "title": "Thousands of Australians unaware they have serious lung condition",
    "publish_date": "Tue, 16 Dec 2025 21:00:42 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Bert Wessels takes exactly 22 wobbly steps to his car and leans on the door handle, staring fixedly at the ground while he catches his breath.\n\nAfter around 10 seconds, Bert wrenches the door open and slides into the driver's seat, where he sits for another minute, his heaving chest slowly giving way to normal breaths.\n\n\"OK, ready to go now,\" chirps the laconic 83-year-old before driving off to meet friends with the same lung condition.\n\nBert Wessels attends a weekly pulmonary rehabilitation course along with others living with COPD in Hervey Bay, Queensland. (ABC News: James C Taylor)\n\nThis torturous process of getting anything done is just a regular part of life for Bert and an estimated 526,000 other Australians.\n\nBert has chronic obstructive pulmonary disorder (COPD), a disease in which the tissue and airways in his lungs decay and constrict, causing his body to be starved of oxygen through everyday tasks such as making the bed, getting dressed and walking to his car.\n\nCOPD is the fifth highest cause of mortality and disease burden in Australia, causing 20 deaths every day and costing Australia $24.98 billion a year in direct healthcare costs, support costs, and lost productivity and years of life, according to modelling by health consultants Evohealth.\n\nHowever, a recent report by Evohealth, endorsed and launched by the Lung Foundation Australia (LFA), said up to 50 per cent of Australians living with COPD might not know they have it.\n\nChristine Jenkins says \"urgent\" action is needed by the healthcare system and government to improve the diagnosis of COPD in the community. (Supplied: The George Institute for Global Health)\n\nRespiratory medicine professor at the University of NSW Christine Jenkins, who contributed to the report, said it showed \"urgent\" action was needed by the healthcare system and government.\n\n\"The disease is under-recognised, underdiagnosed [and] undertreated,\" Professor Jenkins said.\n\n\"We have every reason to be very concerned in Australia that we are not doing well.\"\n\n'Alarmingly low' use of spirometry\n\nThe report said the disease was going undiagnosed due to an \"alarmingly low\" use of lung function tests, also known as spirometry.\n\nIn the test, usually administered by a GP or respiratory nurse, the patient blows into a device that measures their lung capacity by the amount of air they can blow in and out.\n\nThe report said spirometry was \"the gold standard to accurately diagnose and monitor COPD\".\n\nGPs were advised to stop providing spirometry tests during the COVID-19 pandemic. (Supplied: RHSQ)\n\nHowever, at the height of the COVID-19 pandemic in March 2020, the Australian and New Zealand Society of Respiratory Science (ANZSRS) advised GPs to stop providing the tests.\n\nThe ANZSRS advice said the risk of health workers being infected by aerosols breathed out by an infected patient was too great.\n\nOne month later, the ANZSRS issued updated advice saying the tests could be resumed for patients showing no COVID-19 symptoms, provided single-use filters that reduced the spread of aerosols were used.\n\nHowever, the rate of testing has not recovered to pre-pandemic levels.\n\nMedicare data shows spirometry testing in general practice declined by 64 per cent between 2019 and 2025.\n\nThe report said the low rate of testing meant COPD was being underdiagnosed, meaning COPD was not being detected in its early stages, when treatment was most effective.\n\nBert Wessels says his lungs are scarred after a bout of pneumonia following his COPD diagnosis in 2013. (ABC Wide Bay: James C Taylor)\n\nProfessor Jenkins said if the condition were diagnosed early, inhalers and vaccinations could be prescribed to reduce the risk of \"lung attacks\" — coughing episodes triggered by infection or pollution that could cause irreversible lung damage.\n\nBert said early detection could have helped him avoid the \"lung attacks\" he managed today, with the breathing devices prescribed by his GP giving him no relief.\n\n\"None of [them] actually help me at all, it just gets worse and worse and worse,\" he said.\n\nLFA chief executive Mark Brooke met with Health Minister Mark Butler at the report's Parliament House launch in November.\n\nMark Brooke says the current rate of spirometry testing is \"unacceptable\". (ABC News: Lucas Hill)\n\nHe said Mr Butler requested a brief on the underutilisation of spirometry, which the LFA delivered in early December.\n\n\"It's absolutely clear that we need to do much, much more to improve the quality of diagnosis,\" Mr Brooke said.\n\n\"It is completely unacceptable that the spirometry rates remain so stubbornly low.\"\n\nLow Medicare rebates a disincentive\n\nKerry Hancock is chair of the respiratory medicine group in the Royal Australian College of General Practitioners, the group that sets the standard for education and practice among Australian GPs.\n\nShe acknowledged there had been an unacceptable decline in spirometry testing by GPs.\n\n\"When you've got a [64] per cent drop in the GP-billed services, it's just incredible,\" Dr Hancock said.\n\nDr Kerry Hancock says the low Medicare rebate for spirometry testing is the greatest disincentive against providing the test. (Supplied: Kerry Hancock)\n\nDr Hancock said the ANZSRS advice to stop providing spirometry tests put a halt to testing that was already low.\n\nShe said the cost of providing the tests was the greatest disincentive and explained why spirometry testing was low even prior to the pandemic.\n\nThe Medicare rebate for a diagnostic spirometry test was $40, which Dr Hancock said left medical practices about $25 out of pocket.\n\nThe requirement to use $5 single-use filters, as advised by the ANZSRS, meant practices were losing even more money through the tests.\n\n\"General practice was pretty stretched anyway … so I think it was really hard to get GPs back on the ground again in doing spirometry,\" Dr Hancock said.\n\nMark Butler asked Lung Foundation Australia to prepare a brief on the underutilisation of spirometry. (AAP: Lukas Coch)\n\nA ministerial briefing note by the LFA detailing the underutilisation of spirometry testing raised in the report was sent to Health Minister Mark Butler in December.\n\nIt recommended raising the Medicare rebate for spirometry in primary care settings to between $85 and $100, and upskilling nurses, pharmacists and First Nations health workers in administering the test.\n\nThe ABC sent detailed questions to Mr Butler seeking a response to the Lung Foundation report, including calls for an increased Medicare rebate for spirometry, which were referred on to the Department of Health.\n\nThe government is considering a 2023 review by private consultants Ernst & Young into the national strategic framework for chronic conditions, including COPD.\n\n\"The framework will enable all levels of government and health professionals to work towards the delivery of a more effective and coordinated national approach to chronic conditions,\" a Department of Health spokesperson said.\n\nThe Department of Health says a review of the national strategy for chronic conditions will improve care for people living with COPD. (Shutterstock: Egor_Kulinich)\n\nThe spokesperson said considerations of an increase to the Medicare rebate for spirometry were the responsibility of the Medical Services Advisory Committee (MSAC), an independent group advising the health minister on health service funding.\n\nNone of the 634 applications under consideration for changes to rebates for existing Medicare services listed on the MSAC website were related to an increase in the rebate for spirometry.\n\nDr Hancock said the costs of not diagnosing COPD far outweighed the increased Medicare rebate.\n\n\"It's a false economy to not be doing this,\" she said.\n\n\"All of us are on the same page; it just requires somebody with the money to say: 'We're going to do this.'\"\n\nBert Wessels says he is resigned to the steady decline in his health since being diagnosed with COPD. (ABC Wide Bay: James C Taylor)\n\nBert attends weekly lung rehabilitation classes in Hervey Bay, mostly for the social pleasures of meeting other people living with COPD.\n\nFormerly \"one of the strongest guys in town\", Bert said he was resigned to the steady decline in his health since being diagnosed with COPD at the age of 71.\n\n\"It just gets worse and worse and worse,\" he said.\n\n\"You live with it, you manage it as best you can. I don't believe there's anything else that I could be doing, really, that would improve it.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/queenscliff-brewhouse-is-reborn-with-a-new-beer-garden-and-5-happy-hour-pots-20251217-p5noga.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Queenscliff Brewhouse is reborn with a new beer garden and $5 happy hour pots",
    "publish_date": "Wed, 17 Dec 2025 13:01:11 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe venue has a fresh, nautical-inspired look and its original name reinstated.\n\n1 / 8 The Esplanade Hotel in Queenscliff, reborn under Australian Venue Co, has an upgraded beer garden and kids’ play area. Supplied 2 / 8 Oysters by the ocean. Supplied 3 / 8 Outside the Queenscliff pub. Supplied 4 / 8 A classic pub feed. Supplied 5 / 8 Plenty of seating in the new courtyard. Supplied 6 / 8 There’s also a pool table. Supplied 7 / 8 Cajun fried chicken burger. Supplied 8 / 8 A kids’ playground adds to the appeal. Supplied Previous Slide Next Slide\n\nPub dining$$$$\n\nNot far from the foreshore, Queenscliff Brewhouse has been reborn by hospo mega-group Australian Venue Co. It’s had its original name reinstated while the new, nautical-inspired look includes an upgraded beer garden and kids’ play area. The weekday happy hour offers $5 pots, and if you caught the ferry over from Sorrento, flash your Searoad Ferries ticket to get 10 per cent off your bill.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/business/companies/we-always-bring-jared-trump-wants-his-son-in-law-in-the-middle-of-everything-20251217-p5noau.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘We always bring Jared’: Trump’s son-in-law can’t escape the president’s inner circle",
    "publish_date": "Wed, 17 Dec 2025 13:00:53 +1100",
    "category": "finance",
    "authors": [
      "Justin Sink"
    ],
    "text": "Kushner, meanwhile, hasn’t totally forgotten about his day job. Kushner’s return to the scene has raised familiar questions from his first stint in the White House, where his complex financial interests and relative inexperience in politics and diplomacy led critics to question both his competence and ethics. Credit: AP Filings in the takeover fight for Warner Bros. Discovery revealed that Affinity Partners — the private equity firm Kushner founded in 2021 with funding from a trio of Middle East sovereign wealth funds – was helping to finance Paramount Skydance’s hostile bid. But on Wednesday (Australian time), Affinity exited the battle. Kushner’s participation in a deal that the president has said he would personally review had drawn a lot of unwelcome attention to him, according to people familiar with the decision. Affinity’s $US200 million contribution to the financing was relatively minor, they said. Along with Affinity’s initial involvement in the bid, Kushner was involved in helping secure billions in funding for the deal from Middle East funds. Ethics and competence\n\nKushner’s return to the scene has raised familiar questions from his first stint in the White House, where his complex financial interests and relative inexperience in politics and diplomacy led critics to question both his competence and ethics. Loading Just this week, Affinity said it’s dropping plans for a Trump-branded luxury hotel in Serbia after tensions around the project culminated in the indictment of a government official who helped clear a path for its development. “He gets involved with government-run investment funds, and those governments also happen to want things from the American government,” said Jordan Libowitz, a vice president with Citizens for Responsibility and Ethics in Washington, a government watchdog. “So you have a president’s son-in-law financially entangled with foreign governments, and what’s good for him might not be what’s good for the American people.” But for Kushner, still known mononymously as “Jared” across the West Wing, Trump’s surprise return to the White House offers opportunity for redemption.\n\nDuring the first term, Kushner’s policy efforts — from immigration to infrastructure, criminal justice to government reform — became something of a punchline in Washington, unveiled with great fanfare at the White House only to be ignored on Capitol Hill or within the bureaucracy. His relationship with Saudi Crown Prince Mohammed bin Salman, forged over meetings and WhatsApp chats, became a flashpoint after the killing of dissident journalist Jamal Khashoggi at a Saudi consulate in Turkey. And his courting of celebrities — including a West Wing welcome for Kanye West — contributed to the often circus-like feel of Trump’s first term. Kushner and presidential envoy Steve Witkoff helped forge a truce between Israel and Hamas earlier this year. Credit: Getty Images During Trump’s second term, Kushner has narrowed his scope and stuck to more favourable terrain. In the Middle East, he’s positioned himself as an interlocutor that both sides can trust while seeking to find a way to end two years of bloodshed.\n\nHe emphasised to negotiators the relationships cultivated not only through his business dealings, but also a rare bright spot in his first-term policy portfolio: negotiating the Abraham Accords to normalise diplomatic relations with Israel. Tackling Benjamin Netanyahu was a bit easier. The Israeli prime minister is a longtime friend of Jared’s dad, Charles Kushner, and has even spent nights at the family’s New Jersey home. Loading Those involved in the talks credited Kushner with being able to sort the signal from the often cacophonous noise of the conflict, as threats and recriminations threatened to derail efforts to secure the release of hostages and a plan for post-war Gaza. “We always bring Jared when we want to get that deal closed,” Trump said while visiting the Knesset to celebrate the agreement.\n\nKushner has sought to again leverage his relationships from New York finance and real estate as he looks to tackle the war between Russia and Ukraine. In recent days, Kushner brought BlackRock’s Fink in for a discussion with Zelensky around rebuilding Ukraine’s economy, a key concern for Kyiv as it weighs a US proposal. But there have been challenges. A framework agreement drafted by Kushner, Witkoff and Russian officials has sparked alarm across Europe, calling for significant concessions from Kyiv that would be politically difficult — if not impossible — for Zelensky to deliver. “While Jared Kushner and Steve Witkoff are capable in their own right, I don’t think they have the depth of experience to fully appreciate how President Putin plans out these meetings, how he executes these meetings and he looks for ways to manipulate his friends across the table,” Julianne Smith, a former US Ambassador to NATO, told CNN. Trump, meanwhile, has made clear he’s tired of talks that seem to get repeatedly derailed.\n\n“We don’t want to waste a lot of time, we think it’s negative,” Trump told reporters on Thursday. “We want it to get settled.” White House spokeswoman Anna Kelly said Kushner was an “informal, unpaid adviser” trusted by the president and Witkoff for his “experience with complex negotiations.” ‘Nothing in my life has gone according to the plans I’ve set.’ Jared Kushner The president has sidestepped questions about Kushner’s role in the other big deal consuming attention at the White House: the battle between Netflix and Paramount for the future of Warner Bros. But Trump did offer signals that could bolster his son-in-law’s effort to derail the Netflix bid endorsed by the Warner Bros. board.\n\nTrump told reporters he’d look at whether a combination with Netflix would give the new company too high of a market share. He also indicated he wanted a deal that resulted in new owners who could pressure CNN management to make changes. Trump has already spoken to Paramount CEO David Ellison, whose offer would see CNN and other networks come under his roof, about the future of the cable network. But it has emerged that Warner Bros. Discovery is reportedly planning to reject Paramount’s bid due to concerns about financing and other terms. White House press secretary Karoline Leavitt called suggestions that Kushner may face conflicts of interest “despicable.” Credit: AP The threat — and the prospect of foreign sovereign wealth funds underwriting the acquisition of a major US news outlet — have prompted concern from Democrats in Washington. And the prospect of Kushner profiting off the decision comes despite Trump for years claiming former president Joe Biden’s son, Hunter, exploited his father’s influence. The potential deal isn’t even Kushner’s first large media acquisition effort in his father-in-law’s second term: Affinity Partners and Saudi Arabia’s Public Investment Fund worked with Silver Lake Partners to acquire video game giant Electronic Arts earlier this year.\n\nTrump has so far denied speaking to Kushner about the Warner Bros. deal – while praising his son-in-law’s work on global diplomacy. Loading Kushner has downplayed the notion that his financial entanglements were an issue. “What people call conflicts of interest, Steve and I call experience and trusted relationships that we have throughout the world,” he said in an interview with CBS News’ 60 Minutes. White House press secretary Karoline Leavitt called suggestions that Kushner may face conflicts of interest “despicable.”",
    "source": "SMH",
    "cluster_id": 12
  },
  {
    "url": "https://www.smh.com.au/national/queensland/the-audience-spoke-i-listened-why-robin-kip-and-corey-are-back-after-their-shock-sacking-20251217-p5noe5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The audience spoke, I listened’: Why Robin, Kip and Corey are back after their shock sacking",
    "publish_date": "Wed, 17 Dec 2025 13:00:44 +1100",
    "category": "finance",
    "authors": [
      "Marissa Calligeros",
      "Nick Dent"
    ],
    "text": "It’s not often radio hosts are sacked and then rehired weeks later – by the same station.\n\nBut that’s exactly what happened for KIIS97.3 Brisbane breakfast radio hosts Robin Bailey, Kip Wightman and former Broncos star Corey Oates, who were axed from their show in early October, only to be asked to return.\n\nThe decision to bring back the trio was driven by an overwhelming audience response, insisted ARN Media’s new chief executive, Michael Stephenson, who has been in the role for eight weeks.\n\nRobin Bailey, Kip Wightman and Corey Oates on KIIS97.3.\n\n“At the end of the day, we create and distribute content to attract audiences and the audience spoke, and I listened,” Stephenson told this masthead after this week’s announcement.",
    "source": "SMH",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/national/nsw/hero-cops-tv-appearance-20251217-p5nogg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hero cop's TV appearance",
    "publish_date": "Wed, 17 Dec 2025 13:00:24 +1100",
    "category": "finance",
    "authors": [],
    "text": "Hero cop's TV appearance\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/national/nsw/funeral-for-bondi-terror-attack-victim-rabbi-eli-schlanger-20251217-p5noed.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Funeral for Bondi terror attack victim Rabbi Eli Schlanger",
    "publish_date": "Wed, 17 Dec 2025 12:50:03 +1100",
    "category": "finance",
    "authors": [],
    "text": "Funeral for Bondi terror attack victim Rabbi Eli Schlanger\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/politics/western-australia/former-colleagues-turn-drive-rivals-as-6pr-elevates-weekends-presenter-20251217-p5nof6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Former colleagues turn drive rivals as 6PR elevates weekends presenter",
    "publish_date": "Wed, 17 Dec 2025 12:47:05 +1100",
    "category": "finance",
    "authors": [
      "Hamish Hastie"
    ],
    "text": "Perth talkback station 6PR’s weekend mornings presenter Jamie Burnett will take over the 3pm to 6pm drive shift from January next year.\n\nBurnett’s appointment completes the 2026 lineup for the station, which is owned by Nine Entertainment, also the owner of this masthead.\n\nJamie Burnett has been announced as the new 6PR Perth Live host. Credit: 6PR\n\nPresenters will have also shorter shifts next year as 6PR returns to a four-show weekday format.\n\nBurnett replaces Perth Live’s Oliver Peterson, who wrapped his final shift with 6PR earlier this month and departs for the ABC to replace Gary Adshead – also a former 6PR presenter – on the national broadcaster’s drive show next year.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/the-ashes-2025-third-test-day-one-live-coverage-20251217-p5nobi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Ashes 2025 third Test day one LIVE updates: Khawaja, Labuschagne take Australia to lunch after openers fall in successive overs",
    "publish_date": "Wed, 17 Dec 2025 12:45:57 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Usman Khawaja tucked into Will Jacks in his two overs before lunch, skating to 41 from 55 balls after he was a late replacement for Steve Smith.\n\nJacks will have to bowl a lot of overs for England on a hot day in Adelaide, and Khawaja’s use of the sweep shot in particular showed an eagerness to ensure the spinner does not settle.\n\nUsman Khawaja played assertively as lunch approached. Credit: Getty Images\n\nBut, as always in Adelaide, there is enough in the track if you get the ball in the right spot: one delivery Khawaja tried to defend bit nicely and took an edge that fell just short of slip. That moment will interest Jacks, but also the recalled Nathan Lyon.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/a-172-year-old-pub-has-been-restored-with-kitsch-couches-and-patterned-carpets-20251217-p5nog0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A 172-year-old pub has been restored with kitsch couches and patterned carpets",
    "publish_date": "Wed, 17 Dec 2025 12:42:09 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nAscot Vale’s Laurel Hotel now offers $15 pizzas, trivia and more.\n\n1 / 5 The restored Laurel Hotel on Mount Alexander Road has warmth and charm with kitsch touches. Supplied 2 / 5 Spanner crab and prawn spaghetti. Supplied 3 / 5 The space has been revitalised. Supplied 4 / 5 Relaxed on one of the retro couches. Supplied 5 / 5 Dishes at the Laurel. Supplied Previous Slide Next Slide\n\nPub dining$$$$\n\nPublican Sam Capogreco poured his first beer at the Laurel Hotel, a 172-year-old fixture of Melbourne’s north. He’s come full circle in restoring the Mount Alexander Road watering hole, adding warmth and charm with kitsch couches, artwork and patterned carpets. Capogreco comes from Kickon Group, where he was formerly chief operating officer. He’s introduced $15 wood-fired pizzas all day on Mondays, while Wednesdays are all about trivia, kicking off at 7pm.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/politics/federal/budget-update-shows-australia-s-debt-and-deficit-easing-thanks-to-higher-tax-take-20251217-p5noc6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Budget update shows Australia’s debt and deficit easing – thanks to higher tax take",
    "publish_date": "Wed, 17 Dec 2025 12:15:00 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "A surge in taxes on working people, companies and superannuation accounts plus longer-term spending restraint has improved the federal budget and reduced government debt by almost $30 billion in a single year.\n\nThe 2025-26 mid-year budget update, released on Wednesday by Treasurer Jim Chalmers and Finance Minister Katy Gallagher, shows this year’s deficit will be $5.3 billion lower than they expected when the budget was originally released in March.\n\nTreasurer Jim Chalmers and Finance Minister Katy Gallagher have revealed an improvement in the budget bottom line and total debt. Credit: AAP\n\nOver the next three years, they are forecasting cumulative deficits of $143.3 billion compared to the $151.9 billion predicted before the election. Each deficit is slightly smaller than previously expected, thanks largely to stronger tax collections.\n\nIn the current year alone, personal income tax has been revised up by $8.2 billion to a record $357.9 billion, while company tax is expected to raise $144.7 billion, a $4.3 billion lift on the budget forecast.",
    "source": "SMH",
    "cluster_id": 1
  },
  {
    "url": "https://www.smh.com.au/national/cummins-explains-smith-absence-at-the-toss-20251217-p5noft.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cummins explains Smith absence at the toss",
    "publish_date": "Wed, 17 Dec 2025 12:03:05 +1100",
    "category": "finance",
    "authors": [],
    "text": "Cummins explains Smith absence at the toss\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-s-two-americas-are-getting-further-apart-20251217-p5noch.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s two Americas are getting further apart",
    "publish_date": "Wed, 17 Dec 2025 11:59:20 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "The US unemployment rate is now at its highest since the pandemic, but the White House says “the best is yet to come”.\n\nThe disparity between the facts and their interpretation highlights how the 43-day shutdown of the US government, during which the Bureau of Labor Statistics (BLS) ceased collecting data, has left the reliability of the much-anticipated and much-delayed jobs report for October and November open to question and interpretation.\n\nThe divide between the haves and have-nots in Trump’s America is seemingly widening with each data release. Credit: AP\n\nWhat is undeniable, however, is that an unemployment rate that started the year at 4 per cent, when Donald Trump regained the presidency, is now at 4.6 per cent and has been creeping up in 10 basis point increments since mid-year. The US has lost more than 270,000 jobs this year.\n\nThe White House seized on an increase in private sector jobs in November, where 64,000 jobs were added, as a sign of progress, even as the unemployment rate rose to its highest level in more than four years and the number of people working part-time while wanting full-time employment rose to 8.7 per cent, a percentage point higher than at the same time last year. The unemployment rate for black Americans, at 8.3 per cent, is the highest since 2021.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/cba-nab-predict-february-rate-rise/id8hbdno8",
    "title": "CBA & NAB predict February rate rise",
    "publish_date": "Tue, 16 Dec 2025 06:40:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 21
  },
  {
    "url": "https://www.sbs.com.au/news/article/donald-trump-sues-bbc-defamation/xh5qs7jmo",
    "title": "Donald Trump sues the BBC, seeking billions in damages",
    "publish_date": "Tue, 16 Dec 2025 03:14:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States president Donald Trump has sued the BBC for defamation over edited clips of a speech that made it appear he directed supporters to storm the US Capitol, opening an international front in his fight against media coverage he deems untrue or unfair.\n\n\n\n\n\nTrump accused the UK's publicly owned broadcaster of defaming him by splicing together parts of a 6 January 2021 speech, including one section where he told supporters to march on the Capitol and another where he said \"fight like hell\". It omitted a section in which he called for peaceful protest.\n\n\n\n\n\nTrump's lawsuit alleges the BBC defamed him and violated a Florida law that bars deceptive and unfair trade practices. He is seeking US$5 billion ($7.5 billion) in damages for each of the lawsuit's two counts.\n\n\n\nREAD MORE BBC apologises to Donald Trump over documentary speech edit\n\nThe BBC has apologised to Trump, admitted an error of judgement and acknowledged that the edit gave the mistaken impression that he had made a direct call for violent action. But it has said there is no legal basis to sue.\n\n\n\n\n\nTrump, in his lawsuit filed on Monday (local time) in Miami federal court, said the BBC, despite its apology, \"has made no showing of actual remorse for its wrongdoing nor meaningful institutional changes to prevent future journalistic abuses\".\n\n\n\n\n\nThe BBC is funded through a mandatory licence fee on all TV viewers, which UK lawyers say could make any payout to Trump politically fraught.\n\n\n\n\n\nA spokesperson for Trump's legal team said in a statement the BBC \"has a long pattern of deceiving its audience in coverage of President Trump, all in service of its own leftist political agenda\".\n\n\n\nThe BBC's director general Tim Davie and head of news Deborah Turness both resigned following criticisms of the documentary edit. Source: Anadolu / Anadolu via Getty Images A BBC spokesperson told Reuters earlier on Monday that it had \"no further contact from President Trump's lawyers at this point. Our position remains the same\". The broadcaster did not immediately respond to a request for comment after the lawsuit was filed.\n\n\n\n\n\nFacing one of the biggest crises in its 103-year history, the BBC has said it has no plans to rebroadcast the documentary on any of its platforms.\n\n\n\n\n\nThe dispute over the clip, featured on the BBC's Panorama documentary show shortly before the 2024 presidential election, sparked a public relations crisis for the broadcaster, leading to the resignations of its two most senior officials.\n\n\n\n\n\nTrump’s lawyers say the BBC caused him overwhelming reputational and financial harm.\n\n\n\nREAD MORE BBC bosses resign over accusations of misleading Trump edit\n\nThe documentary drew scrutiny after the leak of a BBC memo by an external standards adviser that raised concerns about how it was edited, part of a wider investigation of political bias at the publicly funded broadcaster.\n\n\n\n\n\nThe documentary was not broadcast in the US.\n\n\n\n\n\nDefamation claims in the UK must be brought within a year of publication, a window that has closed for the Panorama episode.\n\n\n\n\n\nTo overcome the US Constitution’s legal protections for free speech and the press, Trump will need to prove not only that the edit was false and defamatory but also that the BBC knowingly misled viewers or acted recklessly.\n\n\n\n\n\nThe broadcaster could argue that the documentary was substantially true and its editing decisions did not create a false impression, legal experts said. It could also claim the program did not damage Trump's reputation.\n\n\n\n\n\nOther media have settled with Trump, including CBS and ABC when Trump sued them following his comeback win in the November 2024 election.\n\n\n\n\n\nTrump has filed lawsuits against the New York Times, the Wall Street Journal and a newspaper in Iowa, all three of which have denied wrongdoing.\n\n\n\n\n\nThe attack on the US Capitol in January 2021 was aimed at blocking Congress from certifying Joe Biden’s presidential win over Trump in the 2020 US election.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 22
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-what-needs-to-be-done-about-our-gun-laws/vtzajqd2z",
    "title": "INTERVIEW: What needs to be done about our gun laws?",
    "publish_date": "Mon, 15 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 21
  },
  {
    "url": "https://www.sbs.com.au/news/article/supermarkets-cheapest-groceries-australia/nzo613bkt",
    "title": "Which supermarket has the cheapest groceries? Choice reveals its latest price check",
    "publish_date": "Mon, 15 Dec 2025 18:36:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Aldi has once again come out on top as the supermarket with the cheapest groceries, according to a new comparison of a basket of products.\n\n\n\n\n\nConsumer group Choice found a basket of 20 items cost $72.41 at Aldi, $98.98 at Woolworths, $100.04 at Coles and $109.25 at IGA, excluding specials.\n\n\n\n\n\nThis represented \"quite a significant gap\" between Aldi and the second-cheapest store, Woolworths, Choice editorial director Mark Serrels said.\n\n\n\n\n\nThe quarterly government-backed supermarket survey focused its latest report on entertaining essentials ahead of Christmas in addition to grocery staples.\n\n\n\nThe basket contained items like milk, Weetbix, dried apples, carrots, bananas, chicken breast fillets, cherry tomatoes, bagged mixed salad, salted peanuts, plus other products for a festive gathering such as mineral water, crackers, camembert, stuffed olives and more.\n\n\n\n\n\nWhen comparing seven items of basics, including apples, bananas, strawberries, carrots, Weetbix, milk, and chicken breast fillets, and excluding specials, Aldi remained the cheapest at $31.41, followed by Woolworths at $32.20, Coles at $33.16, and IGA at $39.20.\n\n\n\nAldi has once again been found to contain the cheapest groceries in Australia, according to the latest supermarket survey by Choice. Source: AAP / Joel Carrett Aldi was still the cheapest when factoring in specials, with the price remaining the same as the basket without specials at $72.41. The Woolworths' specials basket was $93.17, Coles' $100.04, and IGA's $105.38.\n\n\n\n\n\nIt's not entirely a like-for-like comparison, with Choice saying that in order to compare the same products as often as it could, the baskets from Coles, Woolworths and IGA contained more name-brand products than the Aldi basket.\n\n\n\n\n\n\"Buying more home-brand products from these supermarkets would bring the cost down, but we also know that shoppers often choose national-brand products when entertaining,\" Choice said.\n\n\n\nWhere can you get the freshest lettuce?\n\nTo determine which supermarket had the freshest produce, the group also compared the freshness of mixed lettuce two days after buying across all four supermarkets.\n\n\n\n\n\nChoice said it can't answer the question for every item, but looked at lettuce because it shows signs of decay quickly.\n\n\n\nColes came out on top, with 77 per cent of its mystery shoppers saying its lettuce leaves were fresh after two days. Woolworths, IGA and Aldi followed respectively.\n\n\n\n\n\n\"In this survey, there was some evidence of decay in the mixed lettuce purchased at all supermarkets, but Coles ultimately received the highest score for freshness,\" Serrels said.\n\n\n\n\n\nChoice advised shoppers hoping to reduce their costs to shop around, check unit pricing, and opt for cheaper alternatives like meat cuts, frozen fruit and vegetables, and \"imperfect\" ranges.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/queenscliff-brewhouse-is-reborn-with-a-new-beer-garden-and-5-happy-hour-pots-20251217-p5noga.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Queenscliff Brewhouse is reborn with a new beer garden and $5 happy hour pots",
    "publish_date": "Wed, 17 Dec 2025 13:01:11 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe venue has a fresh, nautical-inspired look and its original name reinstated.\n\n1 / 8 The Esplanade Hotel in Queenscliff, reborn under Australian Venue Co, has an upgraded beer garden and kids’ play area. Supplied 2 / 8 Oysters by the ocean. Supplied 3 / 8 Outside the Queenscliff pub. Supplied 4 / 8 A classic pub feed. Supplied 5 / 8 Plenty of seating in the new courtyard. Supplied 6 / 8 There’s also a pool table. Supplied 7 / 8 Cajun fried chicken burger. Supplied 8 / 8 A kids’ playground adds to the appeal. Supplied Previous Slide Next Slide\n\nPub dining$$$$\n\nNot far from the foreshore, Queenscliff Brewhouse has been reborn by hospo mega-group Australian Venue Co. It’s had its original name reinstated while the new, nautical-inspired look includes an upgraded beer garden and kids’ play area. The weekday happy hour offers $5 pots, and if you caught the ferry over from Sorrento, flash your Searoad Ferries ticket to get 10 per cent off your bill.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://www.theage.com.au/business/companies/we-always-bring-jared-trump-wants-his-son-in-law-in-the-middle-of-everything-20251217-p5noau.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘We always bring Jared’: Trump’s son-in-law can’t escape the president’s inner circle",
    "publish_date": "Wed, 17 Dec 2025 13:00:53 +1100",
    "category": "finance",
    "authors": [
      "Justin Sink"
    ],
    "text": "Kushner, meanwhile, hasn’t totally forgotten about his day job. Kushner’s return to the scene has raised familiar questions from his first stint in the White House, where his complex financial interests and relative inexperience in politics and diplomacy led critics to question both his competence and ethics. Credit: AP Filings in the takeover fight for Warner Bros. Discovery revealed that Affinity Partners — the private equity firm Kushner founded in 2021 with funding from a trio of Middle East sovereign wealth funds – was helping to finance Paramount Skydance’s hostile bid. But on Wednesday (Australian time), Affinity exited the battle. Kushner’s participation in a deal that the president has said he would personally review had drawn a lot of unwelcome attention to him, according to people familiar with the decision. Affinity’s $US200 million contribution to the financing was relatively minor, they said. Along with Affinity’s initial involvement in the bid, Kushner was involved in helping secure billions in funding for the deal from Middle East funds. Ethics and competence\n\nKushner’s return to the scene has raised familiar questions from his first stint in the White House, where his complex financial interests and relative inexperience in politics and diplomacy led critics to question both his competence and ethics. Loading Just this week, Affinity said it’s dropping plans for a Trump-branded luxury hotel in Serbia after tensions around the project culminated in the indictment of a government official who helped clear a path for its development. “He gets involved with government-run investment funds, and those governments also happen to want things from the American government,” said Jordan Libowitz, a vice president with Citizens for Responsibility and Ethics in Washington, a government watchdog. “So you have a president’s son-in-law financially entangled with foreign governments, and what’s good for him might not be what’s good for the American people.” But for Kushner, still known mononymously as “Jared” across the West Wing, Trump’s surprise return to the White House offers opportunity for redemption.\n\nDuring the first term, Kushner’s policy efforts — from immigration to infrastructure, criminal justice to government reform — became something of a punchline in Washington, unveiled with great fanfare at the White House only to be ignored on Capitol Hill or within the bureaucracy. His relationship with Saudi Crown Prince Mohammed bin Salman, forged over meetings and WhatsApp chats, became a flashpoint after the killing of dissident journalist Jamal Khashoggi at a Saudi consulate in Turkey. And his courting of celebrities — including a West Wing welcome for Kanye West — contributed to the often circus-like feel of Trump’s first term. Kushner and presidential envoy Steve Witkoff helped forge a truce between Israel and Hamas earlier this year. Credit: Getty Images During Trump’s second term, Kushner has narrowed his scope and stuck to more favourable terrain. In the Middle East, he’s positioned himself as an interlocutor that both sides can trust while seeking to find a way to end two years of bloodshed.\n\nHe emphasised to negotiators the relationships cultivated not only through his business dealings, but also a rare bright spot in his first-term policy portfolio: negotiating the Abraham Accords to normalise diplomatic relations with Israel. Tackling Benjamin Netanyahu was a bit easier. The Israeli prime minister is a longtime friend of Jared’s dad, Charles Kushner, and has even spent nights at the family’s New Jersey home. Loading Those involved in the talks credited Kushner with being able to sort the signal from the often cacophonous noise of the conflict, as threats and recriminations threatened to derail efforts to secure the release of hostages and a plan for post-war Gaza. “We always bring Jared when we want to get that deal closed,” Trump said while visiting the Knesset to celebrate the agreement.\n\nKushner has sought to again leverage his relationships from New York finance and real estate as he looks to tackle the war between Russia and Ukraine. In recent days, Kushner brought BlackRock’s Fink in for a discussion with Zelensky around rebuilding Ukraine’s economy, a key concern for Kyiv as it weighs a US proposal. But there have been challenges. A framework agreement drafted by Kushner, Witkoff and Russian officials has sparked alarm across Europe, calling for significant concessions from Kyiv that would be politically difficult — if not impossible — for Zelensky to deliver. “While Jared Kushner and Steve Witkoff are capable in their own right, I don’t think they have the depth of experience to fully appreciate how President Putin plans out these meetings, how he executes these meetings and he looks for ways to manipulate his friends across the table,” Julianne Smith, a former US Ambassador to NATO, told CNN. Trump, meanwhile, has made clear he’s tired of talks that seem to get repeatedly derailed.\n\n“We don’t want to waste a lot of time, we think it’s negative,” Trump told reporters on Thursday. “We want it to get settled.” White House spokeswoman Anna Kelly said Kushner was an “informal, unpaid adviser” trusted by the president and Witkoff for his “experience with complex negotiations.” ‘Nothing in my life has gone according to the plans I’ve set.’ Jared Kushner The president has sidestepped questions about Kushner’s role in the other big deal consuming attention at the White House: the battle between Netflix and Paramount for the future of Warner Bros. But Trump did offer signals that could bolster his son-in-law’s effort to derail the Netflix bid endorsed by the Warner Bros. board.\n\nTrump told reporters he’d look at whether a combination with Netflix would give the new company too high of a market share. He also indicated he wanted a deal that resulted in new owners who could pressure CNN management to make changes. Trump has already spoken to Paramount CEO David Ellison, whose offer would see CNN and other networks come under his roof, about the future of the cable network. But it has emerged that Warner Bros. Discovery is reportedly planning to reject Paramount’s bid due to concerns about financing and other terms. White House press secretary Karoline Leavitt called suggestions that Kushner may face conflicts of interest “despicable.” Credit: AP The threat — and the prospect of foreign sovereign wealth funds underwriting the acquisition of a major US news outlet — have prompted concern from Democrats in Washington. And the prospect of Kushner profiting off the decision comes despite Trump for years claiming former president Joe Biden’s son, Hunter, exploited his father’s influence. The potential deal isn’t even Kushner’s first large media acquisition effort in his father-in-law’s second term: Affinity Partners and Saudi Arabia’s Public Investment Fund worked with Silver Lake Partners to acquire video game giant Electronic Arts earlier this year.\n\nTrump has so far denied speaking to Kushner about the Warner Bros. deal – while praising his son-in-law’s work on global diplomacy. Loading Kushner has downplayed the notion that his financial entanglements were an issue. “What people call conflicts of interest, Steve and I call experience and trusted relationships that we have throughout the world,” he said in an interview with CBS News’ 60 Minutes. White House press secretary Karoline Leavitt called suggestions that Kushner may face conflicts of interest “despicable.”",
    "source": "TheAge",
    "cluster_id": 12
  },
  {
    "url": "https://www.theage.com.au/national/queensland/the-audience-spoke-i-listened-why-robin-kip-and-corey-are-back-after-their-shock-sacking-20251217-p5noe5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The audience spoke, I listened’: Why Robin, Kip and Corey are back after their shock sacking",
    "publish_date": "Wed, 17 Dec 2025 13:00:44 +1100",
    "category": "finance",
    "authors": [
      "Marissa Calligeros",
      "Nick Dent"
    ],
    "text": "It’s not often radio hosts are sacked and then rehired weeks later – by the same station.\n\nBut that’s exactly what happened for KIIS97.3 Brisbane breakfast radio hosts Robin Bailey, Kip Wightman and former Broncos star Corey Oates, who were axed from their show in early October, only to be asked to return.\n\nThe decision to bring back the trio was driven by an overwhelming audience response, insisted ARN Media’s new chief executive, Michael Stephenson, who has been in the role for eight weeks.\n\nRobin Bailey, Kip Wightman and Corey Oates on KIIS97.3.\n\n“At the end of the day, we create and distribute content to attract audiences and the audience spoke, and I listened,” Stephenson told this masthead after this week’s announcement.",
    "source": "TheAge",
    "cluster_id": 13
  },
  {
    "url": "https://www.theage.com.au/national/nsw/hero-cops-tv-appearance-20251217-p5nogg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hero cop's TV appearance",
    "publish_date": "Wed, 17 Dec 2025 13:00:24 +1100",
    "category": "finance",
    "authors": [],
    "text": "Hero cop's TV appearance\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/national/nsw/funeral-for-bondi-terror-attack-victim-rabbi-eli-schlanger-20251217-p5noed.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Funeral for Bondi terror attack victim Rabbi Eli Schlanger",
    "publish_date": "Wed, 17 Dec 2025 12:50:03 +1100",
    "category": "finance",
    "authors": [],
    "text": "Funeral for Bondi terror attack victim Rabbi Eli Schlanger\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/politics/western-australia/former-colleagues-turn-drive-rivals-as-6pr-elevates-weekends-presenter-20251217-p5nof6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Former colleagues turn drive rivals as 6PR elevates weekends presenter",
    "publish_date": "Wed, 17 Dec 2025 12:47:05 +1100",
    "category": "finance",
    "authors": [
      "Hamish Hastie"
    ],
    "text": "Perth talkback station 6PR’s weekend mornings presenter Jamie Burnett will take over the 3pm to 6pm drive shift from January next year.\n\nBurnett’s appointment completes the 2026 lineup for the station, which is owned by Nine Entertainment, also the owner of this masthead.\n\nJamie Burnett has been announced as the new 6PR Perth Live host. Credit: 6PR\n\nPresenters will have also shorter shifts next year as 6PR returns to a four-show weekday format.\n\nBurnett replaces Perth Live’s Oliver Peterson, who wrapped his final shift with 6PR earlier this month and departs for the ABC to replace Gary Adshead – also a former 6PR presenter – on the national broadcaster’s drive show next year.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/the-ashes-2025-third-test-day-one-live-coverage-20251217-p5nobi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Ashes 2025 third Test day one LIVE updates: Khawaja, Labuschagne take Australia to lunch after openers fall in successive overs",
    "publish_date": "Wed, 17 Dec 2025 12:45:57 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Usman Khawaja tucked into Will Jacks in his two overs before lunch, skating to 41 from 55 balls after he was a late replacement for Steve Smith.\n\nJacks will have to bowl a lot of overs for England on a hot day in Adelaide, and Khawaja’s use of the sweep shot in particular showed an eagerness to ensure the spinner does not settle.\n\nUsman Khawaja played assertively as lunch approached. Credit: Getty Images\n\nBut, as always in Adelaide, there is enough in the track if you get the ball in the right spot: one delivery Khawaja tried to defend bit nicely and took an edge that fell just short of slip. That moment will interest Jacks, but also the recalled Nathan Lyon.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/a-172-year-old-pub-has-been-restored-with-kitsch-couches-and-patterned-carpets-20251217-p5nog0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A 172-year-old pub has been restored with kitsch couches and patterned carpets",
    "publish_date": "Wed, 17 Dec 2025 12:42:09 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nAscot Vale’s Laurel Hotel now offers $15 pizzas, trivia and more.\n\n1 / 5 The restored Laurel Hotel on Mount Alexander Road has warmth and charm with kitsch touches. Supplied 2 / 5 Spanner crab and prawn spaghetti. Supplied 3 / 5 The space has been revitalised. Supplied 4 / 5 Relaxed on one of the retro couches. Supplied 5 / 5 Dishes at the Laurel. Supplied Previous Slide Next Slide\n\nPub dining$$$$\n\nPublican Sam Capogreco poured his first beer at the Laurel Hotel, a 172-year-old fixture of Melbourne’s north. He’s come full circle in restoring the Mount Alexander Road watering hole, adding warmth and charm with kitsch couches, artwork and patterned carpets. Capogreco comes from Kickon Group, where he was formerly chief operating officer. He’s introduced $15 wood-fired pizzas all day on Mondays, while Wednesdays are all about trivia, kicking off at 7pm.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/politics/federal/budget-update-shows-australia-s-debt-and-deficit-easing-thanks-to-higher-tax-take-20251217-p5noc6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Budget update shows Australia’s debt and deficit easing – thanks to higher tax take",
    "publish_date": "Wed, 17 Dec 2025 12:15:00 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "A surge in taxes on working people, companies and superannuation accounts plus longer-term spending restraint has improved the federal budget and reduced government debt by almost $30 billion in a single year.\n\nThe 2025-26 mid-year budget update, released on Wednesday by Treasurer Jim Chalmers and Finance Minister Katy Gallagher, shows this year’s deficit will be $5.3 billion lower than they expected when the budget was originally released in March.\n\nTreasurer Jim Chalmers and Finance Minister Katy Gallagher have revealed an improvement in the budget bottom line and total debt. Credit: AAP\n\nOver the next three years, they are forecasting cumulative deficits of $143.3 billion compared to the $151.9 billion predicted before the election. Each deficit is slightly smaller than previously expected, thanks largely to stronger tax collections.\n\nIn the current year alone, personal income tax has been revised up by $8.2 billion to a record $357.9 billion, while company tax is expected to raise $144.7 billion, a $4.3 billion lift on the budget forecast.",
    "source": "TheAge",
    "cluster_id": 1
  },
  {
    "url": "https://www.theage.com.au/national/cummins-explains-smith-absence-at-the-toss-20251217-p5noft.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cummins explains Smith absence at the toss",
    "publish_date": "Wed, 17 Dec 2025 12:03:05 +1100",
    "category": "finance",
    "authors": [],
    "text": "Cummins explains Smith absence at the toss\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/trump-s-two-americas-are-getting-further-apart-20251217-p5noch.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s two Americas are getting further apart",
    "publish_date": "Wed, 17 Dec 2025 11:59:20 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "The US unemployment rate is now at its highest since the pandemic, but the White House says “the best is yet to come”.\n\nThe disparity between the facts and their interpretation highlights how the 43-day shutdown of the US government, during which the Bureau of Labor Statistics (BLS) ceased collecting data, has left the reliability of the much-anticipated and much-delayed jobs report for October and November open to question and interpretation.\n\nThe divide between the haves and have-nots in Trump’s America is seemingly widening with each data release. Credit: AP\n\nWhat is undeniable, however, is that an unemployment rate that started the year at 4 per cent, when Donald Trump regained the presidency, is now at 4.6 per cent and has been creeping up in 10 basis point increments since mid-year. The US has lost more than 270,000 jobs this year.\n\nThe White House seized on an increase in private sector jobs in November, where 64,000 jobs were added, as a sign of progress, even as the unemployment rate rose to its highest level in more than four years and the number of people working part-time while wanting full-time employment rose to 8.7 per cent, a percentage point higher than at the same time last year. The unemployment rate for black Americans, at 8.3 per cent, is the highest since 2021.",
    "source": "TheAge",
    "cluster_id": 20
  }
]