[
    {
        "url": "https://www.9news.com.au/national/netflix-price-change-australia-2025/c5fe021b-6a80-4fc7-88df-dd8bae7ce324",
        "title": "Netflix hikes up prices again for Australian users",
        "publish_date": "Wed, 13 Aug 2025 01:27:59 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "The price of every Netflix plan in Australia just became a little more expensive.\n\nJust over a year after hiking the cost for its three subscription tiers , the streaming giant has quietly updated its website again with new prices.\n\nThe standard Netflix plan with ads has jumped from $7.99 per month to $9.99, making it $24 more expensive per year.\n\nThe standard Netflix plan with ads has jumped from $7.99 per month to $9.99. (NurPhoto via Getty Images)\n\nThe standard plan without ads has also risen by $2 per month from $18.99 to $20.99.\n\nAnd the premium Netflix subscription plan, which is the most expensive, has been raised by $3 from $25.99 to $28.99 per month.\n\nAlong with new plan prices, Netflix has also increased the cost of adding an extra member to your plan.\n\nIt will now cost you $6.99 per month to add an extra user to the standard plan with ads, up from $5.99.\n\nThe cost of adding someone to the standard plan without ads will now cost $8.99, up from $7.99.\n\nREAD MORE: Dramatic arrest as Aussie airport temporarily locked down\n\nNetflix price changes are available on its website. (Supplied)\n\nCombined with the price change in May 2024, the cost of the cheapest Netflix plan has risen by nearly 43 per cent in just over 12 months.\n\nThe ad-free Netflix plan has also risen by 25 per cent in the same timeframe.\n\nNetflix axed its $12.99 basic plan in February this year, making it more expensive for users to enjoy streaming content without ads.\n\n9news.com.au has contacted Netflix for comment.﻿\n\nNine, the publisher of this website, owns competing streaming service Stan.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-apple-google-epic-games-fortnite-legal-court-win/045b432f-6a73-4463-b760-6afb12829dbe",
        "title": "Fortnite creators handed Australian court win over Apple and Google",
        "publish_date": "Wed, 13 Aug 2025 00:58:08 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Epic Games, the company behind the popular online game Fortnite, won a partial victory in an Australian court yesterday.\n\nThe case was brought by US billionaire chief executive Tim Sweeney, who claimed that Google and Apple engaged in anti-competitive conduct in running their app stores.\n\nFederal Court Justice Jonathan Beach upheld key parts of Epic’s claim that the tech giants breached Australian competition laws by misusing their market power against app developers and using restrictive trade practices.\n\nREAD MORE: Man arrested after police gun fired at Sydney Airport\n\nEpic Games are the creators of Fortnite, one of the most popular video games in the world. (Bloomberg via Getty Images)\n\nGoogle and Apple’s dominance of the app market had the effect of substantially lessening competition and breached Australian law, Beach found.\n\nBut the judge rejected some of Epic’s claims including that Google and Apple engaged in unconscionable conduct as defined by Australian law.\n\nSweeney is also challenging Google and Apple's dominance in the app markets through the courts in the United States and Britain.\n\nThe litigation began in August 2020 when Apple’s App Store and Google’s Play Store expelled Fortnite because Epic installed a direct payment feature in the extraordinarily popular game.\n\nThe court ruled both companies pressured app developers including Epic through contracts and technology to sell their products through the two dominant app stores.\n\nREAD MORE: Man charged with murder of pregnant woman and partner in Melbourne home\n\nEpic said that the ruling will allow its Epic Games Store and Fortnite to come to Apple's operating system iOS in Australia.\n\n“An Australian court just found that Apple and Google abuse their control over app distribution and in-app payments to limit competition,” Epic said in a statement.\n\n“There are 2,000+ pages of findings that we’ll need to dig into to fully understand the details,\" the statement added.\n\n\"This is a WIN for developers and consumers in Australia!”\n\nApple said the company “faces fierce competition in every market where we operate”.\n\n“We welcome the Australian court’s rejection of some of Epic’s claims, however, we strongly disagree with the Court’s ruling on others,” Apple said in a statement.\n\nApple could appeal the decision handed down by the Federal Court. (Mark Lennihan/AP)\n\nGoogle said it would review the judgment.\n\nGoogle and Apple could potentially appeal the ruling before the Federal Court full bench.\n\n“We disagree with the court’s characterisation of our billing policies and practices, as well as its findings regarding some of our historical partnerships, which were all shaped in a fiercely competitive mobile landscape on behalf of users and developers,” a Google statement said.\n\nBeach has yet to release a 952-page judgment on Epic’s case against Apple or his 914-page judgment on the case against Google.\n\nThe judge gave an oral summary of his findings during a 90-minute hearing yesterday.\n\nLawyers will return to court on a date yet to be set to argue what Epic is entitled to in terms of damages.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/slacks-creek-brisbane-queensland-man-dead-police/ac3c7745-7679-494c-93b2-c8dc208831a2",
        "title": "Man found dead on park footpath south of Brisbane",
        "publish_date": "Wed, 13 Aug 2025 00:16:57 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trump-tells-goldman-sachs-ceo-to-hire-a-new-economist-after-bank-says-consumers-will-pay-bulk-of-tariff-costs/a37b1cb9-b8e6-4b58-bde4-15a95adf8f87",
        "title": "Trump tells Goldman Sachs CEO to hire a new economist after bank's tariff findings",
        "publish_date": "Tue, 12 Aug 2025 22:16:28 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Days after Goldman Sachs' top economists published research claiming price increases stemming from higher tariffs are poised to soon be borne mostly by consumers, US President\n\nDonald Trump\n\nis urging the bank's CEO, David Solomon, to get a new economist.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/cadbury-australia-marvellous-creations-recall-health/1bbbdf60-bf72-4c04-b26b-a5acb24b453b",
        "title": "Recall notice issued for popular Cadbury product",
        "publish_date": "Tue, 12 Aug 2025 22:41:43 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Cadbury is\n\nrecalling\n\none of its most popular products all over\n\nAustralia\n\nafter it was found to potentially contain traces of plastic.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/four-day-work-week-australian-council-of-trade-unions/1eabc315-fe5b-4c2b-9822-a8927ad2c9ba",
        "title": "'A death blow': Unions are calling for a four-day work week. Some don't agree",
        "publish_date": "Wed, 13 Aug 2025 00:48:13 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "The Australian Council of Trade Unions (ACTU) is calling for Australia to adopt a four-day work week in response to Australians continuing to work record-long hours.\n\nResearch has shown that workers' productivity has slowed down post-pandemic and ﻿wage growth has stagnated, leaving many employees burnt out and struggling.\n\nThe solution, according to the ACTU, is working shorter hours at the same pay.\n\nREAD MORE: Gruesome scene as victims of horror double murder identified\n\nUnions are pushing for a shorter work week across Australia. (Getty)\n\nNext week, the peak union body will argue for shorter working hours and the implementation of a four-day work week across Australia at the Economic Reform Roundtable in Canberra.\n\nIt's a plan ACTU President Michele O'Neil says would benefit both workers and businesses.\n\n\"People want to be able to have a life as well as be able to work, and they don't want to live to work,\" she told 9news.com.au.\n\n\"We don't want to see improvements just go to profits, just go to shareholders or executive bonuses.\"\n\nThe ACTU has proposed ﻿businesses introduce a four-day week where possible and, where that model isn't appropriate, implement more rostered days off, increased annual leave, and redesigned rosters that prioritise employees' work-life balance.\n\nThese are top 10 'best' companies to work for in Australia View Gallery\n\nResearch from Australia and abroad suggests this plan would ﻿boost performance, reduce burnout and improve employee health and retention across the country.\n\nIt could also help shorten the gap between productivity growth and wage growth in Australia.\n\nAnalysis from the Centre for Future Work revealed that if real wages had grown at the same rate as productivity since 2000, Aussies would be making about $350 more per week in 2025.\n\n\"Wages improving is critically important for living standards, but workers having more time to live is also important,\" O'Neil said.\n\nA reduced work week would also benefit businesses.\n\n\"If we've got a better balance between our work life and our home life, then when we come to work, we're more effective, we're more able to focus, we're more able to get the job done,\" O'Neil said.\n\n\"All of these things are benefits for employers, and this is not just unions and the ACTU saying this.\"\n\nOne ﻿2023 study of ten Australian companies trialling the four-day week revealed that 70 per cent reported higher productivity.\n\nThe other 30 per cent ﻿reported productivity levels were the same as pre-trial.\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nThe ACTU argues that businesses across the country could see similar productivity boosts if only they would invest in capital, research and – most importantly – people.\n\nBut some sectors disagree.\n\n﻿The Australian Restaurant and Cafe Association (ARCA) said a four-day work week would slash productivity and take a toll on hospitality businesses, especially in CBD.\n\n\"We can't cram service into fewer days,\" ARCA CEO Wes Lambert said in a press release.\n\nHe said \"a blanket four-day rule\" would be \"a death blow for CBD cafés already struggling\" as one in 10 currently face closure.\n\nREAD MORE: Dramatic arrest as Aussie airport temporarily locked down\n\n﻿The Australian Restaurant and Cafe Association (ARCA) isn't keen on the idea. (Getty)\n\nBut ﻿ACTU isn't suggesting a blanket rule across all sectors and industries.\n\nRather, O'Neil is calling for Australian businesses to ﻿consider how shorter working hours for the same pay could be sustainably implemented at an industry and individual level.\n\n\"We want to see this change happen in a fast way, but also a fair way.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/advocates-criticise-australias-symbolic-recognition-of-palestinian-statehood/de1c3a60-b092-426f-8fda-efad363c4a86",
        "title": "Advocates criticise Australia's 'symbolic' recognition of Palestinian statehood",
        "publish_date": "Tue, 12 Aug 2025 19:59:13 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Pro-Palestine advocates have labelled Prime Minister Anthony Albanese's move to recognise Palestinian statehood as \"symbolic\" and a \"distraction\", saying it will not help the situation on the ground.\n\nMonday's announcement confirmed Australia will join the United Kingdom, Canada and France in recognising Palestine ﻿at the United Nations General Assembly in September.\n\nThe move is underpinned by commitments from the Palestinian Authority, including ﻿reaffirming recognition of Israel, the demilitarisation of Hamas, holding elections, governance and education reforms, and isolating Hamas from the future state.\n\nRamia Abdo Sultan, the executive member of the Australia Palestine Advocacy Network. (Supplied)\n\nRamia Abdo Sultan, the executive member of the Australia Palestine Advocacy Network, has been calling for action for her family members and others in Palestine.\n\nBut she said the government's recognition was merely a \"symbolic step\" that did not address the ﻿\"immediate and imminent\" issues faced by Palestinians.\n\n\"[My family] received news about Australia, as well as various other countries around the world, recognising Palestine in the next month, and they said, 'We want to hear about our right to actually exist first before an ocean of recognition. We want to know that we have a right to live, a right to self-determination and autonomy and agency, like every other person around the world',\" she said.\n\n\"That's what Palestinians on the ground in Gaza are saying.\"\n\nMussa Hijazi, a lawyer who spent some of his childhood growing up in Palestine, went further to call the prime minister's recognition \"a bit more sinister\" than a \"distraction\".\n\n\"Number one: it's very late. Two: it's symbolic. Three: it's creating a distraction from what is actually going on,\" he said. ﻿\n\n\"We end up with this half-arsed attempt to basically quieten the public down by proposing possibly recognising a state at some stage, later down the track, subject to conditions,\" he added.\n\nPrime Minister Anthony Albanese says Australia will recognise a Palestinian state. (Nine)\n\nAlbanese's sudden shift in policy followed building international momentum, sparked on July 25 when France announced it would be the first G7 country to move to recognise Palestine at the upcoming UN meeting.\n\nAlbanese ﻿then held phone calls with the UK Prime Minister Keir Starmer, Palestinian Authority President Mahmoud Abbas and Israeli Prime Minister Benjamin Netanyahu.\n\nBy August 3, a pro-Palestine protest saw a historic crowd of between 100,000 to 300,000 people march across the Sydney Harbour Bridge against the images of growing starvation in Gaza.\n\nAlbanese's decision has put him at odds with the United States, which was notified of Australia's plan to recognise Palestine ahead of the announcement. ﻿\n\nOrganisers of the mass bridge protest accused the government of acting with political motivation, adding that recognition is meaningless without sanctions.\n\n\"This decision is not borne of principle, but of political heat,\" Palestine Action Group Sydney said.\n\nPro-Palestine protesters march across the Sydney Harbour Bridge. (Janie Barrett)\n\nPro-Palestine protesters have been calling for the government to go further, to sanction Israel and stop any arms trade with Israel.\n\n\"We don't want symbolic steps and moves. We want actual tangible actions that are going to stop Israel from killing people again,\" Sultan said. ﻿\n\n\"Once we have got a ceasefire, once people are being fed, once the Israelis have withdrawn, we can talk about all sorts of things, including a two-state, but right now it's a distraction,\" Hijazi said.\n\nIsrael's security cabinet last week approved a plan to take over Gaza City, ramping up military action in the besieged enclave. ﻿\n\nThe United Nations has warned that this plan would trigger more calamity in Gaza, causing the \"unbearable suffering of the population\".﻿\n\nThe ﻿World Health Organisation said the number of starvation-related deaths and malnutrition rates have spiked, while the United Nations estimates that at least 1300 Palestinians have been killed trying to access food since May 27. ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/cancer-young-australians-redkite-coles-dare-to-dream-scholarship/8880b03a-82e3-4726-bd41-0d0515b8441d",
        "title": "One touching detail links these Aussie teens across more than 1600km",
        "publish_date": "Tue, 12 Aug 2025 00:12:57 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "W﻿hen Brandan was diagnosed with Acute Lymphoblastic Leukaemia last year it felt like everything else in his life \"went away in an instant\".\n\nThe 17-year-old was forced to move from Cairns to Brisbane for Leukaemia treatment and being separated from his friends, family and twin sister was devastating.\n\nBut while Brandan's cancer ﻿journey was just starting, Millie's was coming to a close more than 2000km away.\n\nBrandan was diagnosed with Acute Lymphoblastic Leukaemia at just 16. (Supplied)\n\nThe ﻿16-year-old from Sydney was diagnosed with stage 4 Hodgkins Lymphoma in 2023 and wrapped up six months of gruelling treatment earlier this year.\n\nHer cancer journey was made more complex by her ADHD, severe dyslexia, and anxiety diagnoses but Millie faced every challenge head-on.﻿\n\nNow both teens have been recognised for their remarkable journeys and ﻿named the winners of the 2025 Redkite and Coles Dare to Dream Scholarship.\n\nMore than 20,000 Australians live with the ﻿long-term impacts of childhood cancer, with up to 80 per cent experiencing lasting physical, psychological or social challenges.\n\nAbout one in three survivors have to repeat a year of school due to treatment-related interruptions and it can seriously affect their dreams for the future.\n\nThat's where the ﻿Dare to Dream Scholarship comes in, offering Australians aged 13 to 18 up to $5000 in funding to rebuild their futures during or after a cancer journey.\n\nIt's the kind of money that will help Brandan pursue his passion for film, while ﻿Millie kickstarts her own small business.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nWhere Australia ranks in countries with the greatest health freedoms View Gallery\n\nForced to move 1600km from home\n\n﻿Brandan was 16 when he received his diagnosis and had to relocate to Brisbane for cancer treatment.\n\nHe's been living almost 16000km from home ever since and is painfully aware of how costly his cancer journey has been for his whole family in the cost of living crisis.\n\n\"It can be very stressful financially, like no matter how much you have saved up, you're gonna lose a lot of money,\" he said.\n\nUnable to go to school and feeling isolated, Brandan has struggled.\n\nBut he's also found ﻿new purpose through his passion for film and photography, which he's really embraced while undergoing treatment.\n\nBrandan found ﻿new purpose through his passion for film and photography. (Supplied)\n\n\"It's good to have a passion when times do get tough,\" he said.\n\nThat passion led to him landing multiple segments on Juiced TV, a hospital entertainment program made by kids, for kids.\n\nIt was also the driving force behind his application for the Dare to Dream Scholarship.\n\nBut he never thought he'd actually win.\n\nNow, with an extra $5000 in his bank account, Brandan has big plans for his future.﻿\n\nHe intends to spend the cash on a \"good laptop for school\" which he'll take with him next year, when he hopes to start a media course at TAFE.\n\n\"I've missed out on a lot, like school and opportunities, and this scholarship just opens up a lot more for me,\" he said.\n\nWith an extra $5000 in his bank account, Brandan has big plans for his future.﻿ (Supplied)\n\nThe 17-year-old is especially excited by the prospect of starting TAFE and getting to socialise with groups of like-minded young people after so many months of isolation.\n\nWith his cancer treatment slated to end in late 2026, Brandan has his sights set on pursuing a film and media career in the near future.\n\nIt's a heartening goal after so many months of taking life one day at a time.﻿\n\n'It's not over when you ring the bell'﻿ ﻿\n\nAcross state lines, Millie is approaching one year cancer-free and looking to the future.\n\nShe ﻿underwent ﻿six months of intense chemotherapy and marked the end of her treatment by ringing a bell at the hospital in Sydney where she was treated.\n\nBut that wasn't the end of her cancer journey.\n\nREAD MORE: Innocent sight in IKEA stores across Australia speaks to harrowing reality of domestic and family violence\n\nMillie's family smiles as she rings the bell to celebrate being cancer-free. (Supplied)\n\n﻿\"It's not over when you ring the bell,\" she told 9news.\n\n\"It's a long, long process of getting better. I'm still not at school full time ... I'm going for tests every few months, it's not like everything's back to normal.\"\n\nThe hardest part is that she looks like a healthy teenager on the outside even though her mind and body are still reeling from intensive cancer treatment.\n\nChemotherapy left Millie with no hair and being isolated for months on end, unable to attend school or see friends, took a toll on her mental health.﻿\n\nEven now, almost a year after finishing treatment, she's struggling to cope.﻿\n\n\"You would think the actual cancer or the treatment part would be the hardest thing, but the recovery has been the hardest thing,\" she said.\n\n\"It's hard when you're a teenager, because you think 'I should be able to do this' ... it's a lot of little steps forward and big leaps back.\"\n\n\"You would think the actual cancer or the treatment part would be the hardest thing.\" (Supplied)\n\nBut the 16-year-old won't let that stop her from planning for the future.\n\n﻿She has big dreams of starting her own clothing line making accessible hoodies for teens going through a cancer journey.\n\nThe $5000 ﻿Dare to Dream Scholarship will help her make those dreams a reality.\n\n\"When I was in the hospital system they had a bunch of accessible clothes for children, for accessing ports and things like that, but none for teenagers,\" she said.\n\n\"I had to get a new wardrobe just so they'd be able to access my collarbone, which is where my port was.\"\n\nMillie has big dreams of starting her own clothing line with the scholarship money. (Supplied)\n\nThey will also feature charms on the hoods' drawstrings so neurodivergent teens like her have something to fidget with when they feel anxious or overstimulated.\n\n﻿It's just one small way Millie hopes to support other young Aussies facing a cancer journey like hers.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/jimboomba-carnival-showgoer-injured-by-fireworks-queensland-news/a316a5ad-ce86-450b-a1b6-52e39526e042",
        "title": "Malfunction sends explosives into crowd at Queensland community fair",
        "publish_date": "Mon, 11 Aug 2025 10:39:01 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Children were struck by shrapnel and a man suffered burns to his leg when fireworks malfunctioned at a community fair south of Brisbane last night.\n\nThe mishap sent explosives rocketing into patrons at the Jimboomba Family Carnival.﻿\n\n﻿The man who suffered burns to his leg received first aid before being taken to hospital.\n\nThe mishap sent explosives rocketing into patrons at the Jimboomba Family Carnival.﻿ (Nine)\n\n\"His trousers got a little bit singed and I think we're buying him a new pair of trousers, probably two,\" ACE Fireworks operator Robert Stevenson said.\n\n\"We're terribly sorry, it never should've happened.\"\n\nStevenson, who has been in the fireworks industry for 50 years, said the malfunction was a first.\n\n\"The fireworks exploded, obviously the item was faulty,\" he said.\n\n\"The fireworks went close to the fence and it scared everyone, I guess, including myself.\"\n\nFair organiser Paul Watkins apologised for the ordeal. (Nine)\n\nThe carnival confirmed on social media that the fireworks show scheduled for tonight would not be going ahead.﻿\n\nFair organiser Paul Watkins hosed down the drama and apologised for the ordeal.\n\n\"It's a misconception, because it was excitement and probably a little bit of scare, but there was no, there was nothing, we've got first aid right there,\" Watkins said.\n\n\"We can only say we're very sorry and hopefully it never happens again.\"\n\nAn investigation is under way by Resources Safety and Health Queensland.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/tasfoods-to-sell-pyengana-dairy-for-2-million/105646512",
        "title": "Pyengana Dairy the latest on the TasFoods chopping block",
        "publish_date": "Wed, 13 Aug 2025 02:00:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "A cash-strapped, publicly listed Tasmanian food company has announced plans to sell yet another of its businesses, following years of unprofitability.\n\nTasFoods Limited (TFL) has told the Australian Securities Exchange (ASX) it intends to offload artisan cheesemaker Pyengana Dairy for $2 million.\n\nThe company has also entered into a non-binding agreement with one of its shareholders, granting it an option until September to buy the dairy.\n\nIt told the ASX the proceeds would be reinvested in its poultry division.\n\nTasFoods Limited had bought the 130-year-old dairy in 2017 for $1.55 million.\n\nPyengana Dairy was acquired by TasFoods Limited in 2017. (ABC News: Laurissa Smith)\n\n\"The current TasFoods company structure is not the appropriate vehicle to develop and scale up the Pyengana Dairy premium brand and business,\" TasFoods' ASX announcement read.\n\n\"TFL believes that new ownership is most appropriate for Pyengana Dairy to continue its journey as Australia's favourite premium artisan cheese.\"\n\nCEO Joshua Fletcher declined to comment.\n\nThe sale would leave the shrinking company with flagship brand Nichols Poultry and its associated pet treats line Isle and Sky.\n\nTasFoods is selling Pyengana Dairy to re-invested in Nichols Poultry. (ABC News: Laurissa Smith)\n\nIt would also follow 10 years of net losses after tax.\n\nAnd it would not be the first sale TasFoods has made in its seemingly fruitless hunt for profitability.\n\nMainland dairy giant circling iconic Tasmanian milk brand Photo shows man with thumbs up next to betta milk It seems even the Betta Milk protection squad, which featured in TV advertising, has not been able to stop this iconic Tasmanian brand from being snapped up by a mainland dairy giant.\n\nThe Meander Valley Dairy, Shima Wasabi and Betta Milk were all sold at a loss.\n\nAccording to TasFoods' latest quarterly report, the sale of the now-empty Betta Milk factory at Burnie is due to settle in September.\n\nCurrently, TasFoods Limited shares are worth half a cent each, down from a high of $0.46.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/mountain-creek-residents-homes-resumption-decision-for-the-wave/105641172",
        "title": "Sunshine Coast residents in limbo over multi-billion-dollar transport plan",
        "publish_date": "Wed, 13 Aug 2025 01:59:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "A man on Queensland's Sunshine Coast says he and his neighbours have been forced into a \"horrible\" limbo as they wait to learn if the government will take their homes.\n\nShaun Taylor said he was told before last year's state election that his Mountain Creek home had been marked for resumption to allow for the eventual construction of a rail line.\n\nBut the LNP government said in March that it would renege on its election promise to build the line to Maroochydore, instead stopping construction at Birtinya and running a \"metro-style\" bus service the rest of the way as part of a new multi-billion-dollar public transport project dubbed The Wave.\n\nResidents told homes in way of major rail project Photo shows Man with paper in a garage A group of residents on Queensland's Sunshine Coast say they have been blindsided by a state government decision to redirect a major rail corridor through their properties.\n\nThat announcement was initially met with relief by about 10 property owners at Mountain Creek, including Mr Taylor.\n\nBut nearly six months on from The Wave announcement, and a year since discovering their homes were in the firing line, the residents are still struggling to get answers about the fate of their homes.\n\nMr Taylor said they were unable to move on with their lives until they did.\n\n\"It's horrible, your mental health is almost shot,\" Mr Taylor said.\n\nThe electrician settled in Causeway Court nine years ago with his young family.\n\nThey believed they had found their forever home, but Mr Taylor said they could not even sell it without losing a considerable amount of their initial housing investment.\n\nProperties along the impacted street were only built within the past decade. (ABC Sunshine Coast: Jessica Ross)\n\n\"We thought, 'Oh, let's just move', but we spoke to an agent and they said you won't get your value for your property. If anything, they'll low-ball you,\" Mr Taylor said.\n\n\"There's two people down the street from us whose houses weren't even on the [resumption] list, they want to sell up and retire. But they can't because nobody's interested. They've had their house on the market for almost six months.\n\n\" Three friends just took their homes off the market because they weren't getting their value. \"\n\nWrong number, try again\n\nMr Taylor said he spoke to local member Brent Mickelberg in March but had not spoken to him since.\n\nInstead, residents received a letter which included a \"direct line\" to someone within the transport department to talk to about the project.\n\n\"First of all the number didn't work, and then when I did get through about three weeks ago they didn't even have a design team or a planning team,\" Mr Taylor said.\n\n\" We would like to know what's happening, not be kept in the dark. \"\n\nMr Mickelberg was not available for an interview.\n\nIn a statement, a Department of Transport and Main Roads spokesperson said investigations were still underway into a preferred corridor for The Wave's \"metro-style\" bus service.\n\nAn artist's impression of The Wave public transport system. (Supplied: TMR)\n\n\"The Queensland government understands the impact this may have on property owners and is committed to progressing this work as quickly as possible,\" the spokesperson said.\n\n\"Investigations into the preferred corridor are expected to be completed in 2026 and our priority will be to confirm impacts on properties.\"\n\nThe Wave 'game-changer'\n\nAccording to state government figures, public transport patronage across the Sunshine Coast region stands at less than three per cent.\n\nA dedicated transport route, known as the CAMCOS corridor, has been set aside for 25 years.\n\nMr Jago says The Wave is essential to ensure the region's livability. (Supplied: Better Transport Queensland)\n\nBut new alignments, including the one that left the Mountain Creek residents in the firing line, have been made in recent years to support the technical requirements for Queensland Rail to safely operate trains.\n\nAlex Jago from advocacy group Better Transport Queensland said he did not want give affected residents \"false hope\" but it was possible that buses could run along the original corridor.\n\n\"The difficulty of putting a train line into Maroochydore was one of the drivers for going to a bus solution there,\" Mr Jago said.\n\n\"A bus is a lot more forgiving in terms of how steep it can go, how tight it can turn.\"\n\nThe Sunshine Coast will host several Olympic and Paralympic events in 2032, including the marathon. (Supplied: Jason Crowther)\n\nHe said The Wave would be a \"game-changer\" for the region — one of the largest urban areas in Australia by population to not have a dedicated, fixed-route public transport system.\n\n\"Not just for the Olympics but for everything we do from the 2030s onwards,\" Mr Jago said.\n\n\"There's a heck of a lot of people moving to the southern part of the Sunshine Coast. That does create massive travel demand, and a lot of those people will need to travel to Brisbane.\n\n\" The more time we can spend not stuck in traffic, the better. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/homesickness-takes-toll-on-australian-teen-archie-wilson/105646480",
        "title": "Homesickness takes toll on Australian chasing American football dream",
        "publish_date": "Wed, 13 Aug 2025 01:57:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian teenager Archie Wilson, living in the United States chasing his ambitions of being a punter in American football, has broken down when discussing living away from his family.\n\nWilson, from Melbourne and turning 19 next Wednesday, is preparing for the college season with the University of Nebraska.\n\nWilson joined in June, coming through the Prokick Australia program that has produced NFL punters Tory Taylor (Chicago Bears), Michael Dickson (Seattle Seahawks) and Mitch Wishnowsky (San Francisco 49ers).\n\nWilson was conducting a press conference on Tuesday when he was asked about life away from his family.\n\n\"That part's hard. I mean — I'm sorry,\" he said before breaking down at the podium.\n\n\"I love them a lot. I got two little brothers and my mum and dad. That's the tough part about being here. I love them a lot and I miss them.\"\n\nThe Victorian was able to quickly compose himself and then continued his press conference.\n\nArchie Wilson was emotional when discussing being away from home. (YouTube: HuskerOnline)\n\nHe said his family would be in attendance for Nebraska's first match, against Cincinnati.\n\n\"They know this is what's best for me,\" Wilson said.\n\n\"It's good I can still talk to them plenty over the phone.\n\n\"They're coming here to see the first few games, so I'm looking forward to that.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAustralian punters have been prominent in the college game for several years.\n\nOhio State and Notre Dame, the universities that played in the national championship game last season, both had Australian punters.\n\nJoe McGuire (Ohio State) and James Rendell (Notre Dame) also came through the Prokick program.\n\nShould Wilson take the field in the season opener, his first game of college football will be held at Arrowhead Stadium, the home ground for the Kansas City Chiefs in the NFL.\n\nNebraska will face Cincinnati on August 29 at 11am, AEST. Neither team is currently ranked inside the top 25 of the college football rankings.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/indigenous-trust-loses-millions-failed-el-caballo-blanco-housing/105645032",
        "title": "Indigenous trust loses millions in failed horse ranch social housing plan",
        "publish_date": "Wed, 13 Aug 2025 00:55:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "An Indigenous organisation has lost millions of dollars after failing to transform an ageing horse ranch on the outskirts of Perth into homelessness accommodation, an investigation has found.\n\nThe Spanish equine theme park El Caballo in Wooroloo was purchased in 2020 for $12 million, in order to provide a \"proof of concept\" of a social housing model to tackle homelessness for members of Western Australia’s Noongar community.\n\nAn additional $1.5 million was then spent on repairs, trying to turn it into liveable social housing.\n\nThree years later, with the property still sitting empty, the accommodation portion of the site was sold for $4 million, at a loss of $4.5 million.\n\nThe resort portion of the property remains on the market.\n\nEl Caballo was a Spanish equine themed park at the outskirts of Perth. (Supplied: State Library of Western Australia)\n\nThe purchase was funded out of the Noongar Charitable Trust, established in 2011 by the South West Aboriginal Land and Sea Council (SWALSC), as a way to distribute funds to projects supporting members of the Noongar claimant group in Western Australia.\n\nBut the purchase was referred to the WA ombudsman after concerns were raised by community members.\n\nThese included that the property was acquired without independent market valuation, evidence of a credible business plan or assessment of the ongoing operational funding requirements.\n\nThe purchase at the time represented around 50 per cent of the trust's value.\n\nAccording to the ombudsman’s investigation, headed up by WA's Charitable Trusts Commissioner Bevan Warner, a \"scoping\" report on the El Caballo site valued the property at $32 million, but it was unclear how this figure was obtained.\n\nThe ombudsman’s investigation was led by WA's Charitable Trusts Commissioner Bevan Warner. (ABC News: Daniel Fermer)\n\nA retrospective valuation undertaken found it was worth just $5.9 million at the time of purchase, leaving a shortfall of more than $6 million on the $12 million purchase price.\n\nASX-listed Equity Trustees (EQT) was responsible for distributing the funds on behalf of the Noongar trust.\n\nTrustee 'breached duties'\n\nIn a report tabled in WA's parliament yesterday, Mr Warner found EQT \"breached its duties as trustee\" in authorising the purchase, and has ordered the firm to pay restoration.\n\nMr Warner found EQT relied too heavily on the representations of a former chief executive officer of the SWALSC who proposed the plan, and did not \"independently and impartially\" consider the viability of the project.\n\n\"The trustees owed to the Noongar people the obligation of examining the proposal in some depth,\" Mr Warner wrote.\n\n\" This obligation was not met. \"\n\nThe investigation came about after the national charity regulator, the Australian Charities Not-for-Profits Commission (ACNC), found governance needed to be improved at EQT, but did not take further action.\n\nThe WA attorney-general then referred the matter to the ombudsman.\n\nConcerns were raised by EQT about the proposed purchase at the time, including querying why the property had remained on the market for so long.\n\nThe organisation also questioned whether an independent valuation should have been obtained.\n\nBut according to Mr Warner's investigation, these concerns were addressed by a consultant possibly arranged by the then SWALSC chief executive Wayne Nannup, writing to EQT that \"we believe that this purchase price represents excellent value of the site\" and it was \"better off saving the cost of obtaining an independent valuation\".\n\nWayne Nannup was the South West Aboriginal Land and Sea Council's chief executive at the time. (ABC News: Jake Sturmer)\n\nThe investigation found EQT did not carry through with seeking further assessment of the property's value, choosing to rely on valuations provided by consultants arranged by the SWALSC.\n\n\"The Commission considers the suggestion that the trustee forgo obtaining an independent valuation in relation to the purchase of an asset purportedly worth in excess of $12 million and requiring an application of half of the corpus of the trust fund, to avoid the cost of those valuations, which are likely to be modest compared to the purchase price, is unreasonable in the circumstances,\" Mr Warner wrote.\n\nFindings disputed\n\nEQT has always maintained it undertook sufficient due diligence.\n\nIt told Mr Warner's office that the uniqueness of the El Caballo property meant a standard property valuation could not be obtained, and that it relied on experts put forward by the SWALSC.\n\n\"We carefully considered the housing project put forward by the [SWALSC] and notably the social value it would bring to the Noongar people in the years to come,\" EQT said.\n\nEquity Trustees said it was committed to the intent of the Noongar trust. (ABC News: Jake Sturmer)\n\nIn a statement to the ABC, a spokesperson for Equity Trustees said they remained committed to the intent of the Noongar trust, to support projects directly benefiting the Noongar community.\n\n\"At its heart, these funds were always intended to enable and support a community-driven social housing strategy to contribute to the alleviation of homelessness, support domestic violence victims, and provide rehabilitation and aged care facilities for the Noongar community,\" the statement said.\n\n\" We disagree with the findings of the report and we are considering next steps. \"\n\nEQT has until mid-September to respond to the commission's decision that they owe reparations.\n\nThe commission has also referred matters relating to the SWALSC to the federal regulator of Indigenous organisations.\n\n\"Throughout the Commission's investigation various concerns have been raised by community members and on the information at hand about the conduct of current and former office-holders of [SWALSC],\" the report states.\n\n\"The Commission has determined that information obtained during its investigation warrants a proactive referral to ORIC (the Office of the Registrar of Indigenous Corporations), and this will be undertaken once this report is provided to the Attorney-General.\"\n\nThe ABC has approached the SWALSC for comment.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/iranian-american-comedian-maz-jobrani-jokes-about-donald-trump/105611144",
        "title": "'The emperor has no clothes': Comedian Maz Jobrani hits back at Trump",
        "publish_date": "Tue, 12 Aug 2025 22:58:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Iranian American comedy veteran Maz Jobrani believes US President Donald Trump is trying to censor free speech in America, and he intends to hit back.\n\nWith more jokes, that is.\n\nJobrani's been a long-time guest of Stephen Colbert's top-rating The Late Show, which was axed by CBS last month.\n\nHe believes the decision to end the show's three-decade run — which began with David Letterman in 1993 — was politically motivated.\n\nAccording to the network's parent company, Paramount, Colbert's cancellation was \"purely a financial decision\", and the US president has denied he had anything to do with it.\n\nThe axing came after Colbert criticised Paramount's controversial $US16 million ($25 million) legal settlement with Mr Trump over a 60 Minutes interview with Kamala Harris.\n\nIn the same week CBS announced Colbert's show would be cancelled, Paramount was in the final stages of a multi-billion-dollar merger with Skydance Media. In July, the deal was approved by the Trump administration.\n\nIn Jobrani's mind, the axing of Colbert's show is no coincidence.\n\n\"I love Colbert — I get my news from Colbert — he makes the news fun,\" he told ABC News in a Melbourne interview last month, after landing from Los Angeles for the start of his latest Australian tour.\n\nStephen Colbert's The Late Show will end its 11-year-run on CBS in May 2026. (AP: Scott Kowalchyk)\n\nThe tour across six Australian cities ended on Sunday, but Jobrani's been coming to Australia since 2008.\n\nHe says Melbourne, as home of the annual International Comedy Festival, has \"good comedy audiences\".\n\nColbert has vowed to continue speaking \"unvarnished truth to power\" and sharing \"what I really think about Donald Trump\".\n\nJobrani, who also regularly speaks out against Trump in his comedy skits — most commonly against the administration's deportation policies — says he intends to do the same.\n\n\"I knew that Trump was going to come after the late-night talk show host, but I didn't think it was going to be this way, where their own company can them,\" he said.\n\n\"I thought Trump would maybe send the IRS out to audit them or something, just make their lives hard, because Trump unfortunately does not have a sense of humour, he doesn't know how to take a joke, which is what dictatorships usually are like.\"\n\nMaz Jobrani is a comedy veteran. (ABC News: Darryl Torpy)\n\nThe job of the comedian\n\nSince CBS announced the axing in June, there's been much talk in the US entertainment and media industry about how far the Trump administration might go in censoring free speech.\n\nLoading Instagram content\n\nJobrani has united with some of the biggest names in entertainment and late-night television to show support for Colbert, and to fight for free speech.\n\n\"The job of the comedian is to reveal the emperor has no clothes. I think we need to keep doing that — if we don't, we're going to lose our democracy,\" he said.\n\nJobrani has called on others in comedy and the wider entertainment and media industry to stand their ground.\n\n\"I always say the whole point of America is, I can make fun of the president in America. I couldn't make fun of the president of Iran, that wouldn't work,\" he said.\n\n\" We are slowly seeing, maybe even fastly seeing, the American democracy crumble, and I think now it falls on our shoulders more and more as comedians to make fun of Trump, poke at him. \"\n\nJobrani's family left Iran for the US in 1978, when he was six years old.\n\nIt was just a year before Iran's Shah Mohammad Reza Pahlavi fell to Islamist rulers, and his family, like many others at the time, made the decision to flee.\n\nIn our interview, he talks of how growing up as an Iranian in California at that time was a struggle.\n\nBut he says it framed the backdrop to much of his comedy, which focuses on the weird and often hilarious events that occur as a child of immigrants.\n\nThe Shah of Iran and his wife visited the White House in 1962. (JFK Library & Museum)\n\nWhile his parents hoped the UC Berkeley graduate would become a doctor, lawyer, or engineer, he had other plans.\n\nAnd now he's among several Iranian Americans showcasing Iranian culture on stages around the world, and making audiences laugh with Iranians, instead of at them.\n\nThis was something Jobrani never envisaged back in November 1979 — when 52 Americans were taken hostage in the US Embassy in Tehran and held for 444 days.\n\n\"For my entire life in America, I've had to explain Iran … I just try to find funny ways to explain to people what I'm feeling. Like I say, 'I wish I were Swedish' because if you're Swedish, you wouldn't have to explain anything, right? You just talk about IKEA, ABBA.\n\n\"[Being Iranian] has been a challenge, but it also obviously is giving me plenty of material because I have been able to try and present people from Iran and other people from that part of the world, hopefully in a positive light versus what you see when they show us in the news.\"\n\nBlindfolded US hostages and their Iranian captors outside the American embassy in Tehran in 1979. (Reuters)\n\nA path for Iranian American entertainers\n\nJobrani's career took off in the post 9/11 era.\n\nYoung Australian actor backs scholarship for migrants Photo shows Two men standing outside with arms around each other Mojean Aria has starred alongside Hugh Jackman and Jason Momoa; now Mojean Aria wants to help Middle Eastern and North African youth get into the industry.\n\nHe had first toured with other \"brown comedians\", including Ahmed Ahmed, Aron Kader and Sam Tripoli, on a show called the Arabian Nights, which was aimed at showcasing the voice of Muslim/Middle Eastern people a year before 9/11 happened.\n\nBut as they toured under that name, they decided to change the title.\n\nAt that time, then-US president George Bush had called Iran, Iraq, and North Korea an \"Axis of Evil\".\n\nSo the trio settled on \"Axis of Evil Comedy Tour\" as the show's name.\n\nSince then, Jobrani has gained worldwide fame and in many ways paved the way for a new generation of comedians from Iranian backgrounds to make it to the world stage.\n\nOn his Australian tour, Jobrani was joined by another rising star, Iranian African American comedian Tehran Ghasri.\n\n\"Comedy is part of the Iranian heritage,\" Ghasri tells ABC News.\n\n\" To have representation is very important. Why not us, especially with all the tragedy that's going on in Iran right now. \"\n\nIranian American comedian Tehran Ghasri toured with Maz Jobrani in Australia in July 2025. (ABC News: Darryl Torpy)\n\nJobrani says when he started out, being a comedian was frowned upon by the Iranian diaspora, including his parents.\n\n\"I was of the generation where I should have been a doctor, lawyer, engineer, but I fell in love with comedy and performing at a young age,\" Jobrani explains.\n\nHe says he was an anomaly when he first started.\n\n\"Now 20-some-odd years later, there's Tehran and there's Max Amini, and there's Amir K … there's Melissa Shoshahi, and there's Peter the Persian, and there's Omid Djalili — and it really does make me happy to see all of these people in this business now.\n\n\"Once the next generations realise, 'Oh, you can make a living doing other things' or you should live your life doing what makes you happy, they start doing it.\n\n\"It's really something that's just great for our community … because until we're telling the stories, no-one's going to tell our stories the way we want to tell them. They're just going to keep making us the bad guy.\"\n\nMaz Jobrani started his career when Iranian American comedians were not common. (ABC News: Darryl Torpy)\n\nComedy can 'humanise'\n\nIn recent years Jobrani's played a prominent role in diaspora activism against the Islamic Republic, particularly in the aftermath of the #Women, Life, Freedom protests spurred by the death in custody of Mahsa Jina Amini.\n\nLoading Instagram content\n\n\"I grew up in America, so I always say that I'm not in Iran, but Iran is in me. I feel an affinity towards the country of Iran. I feel an affinity towards the soccer team when they play,\" he said.\n\n\" I feel an affinity towards the people [of Iran]. The Iranian people are some of the most hospitable people. It has a place in my heart. \"\n\nJobrani says the various waves of massive protests inside Iran, the recent Israel–Iran war, and people's suffering under Iran's regime is \"heartbreaking\".\n\nHe points to the forced veiling of women, \"discrimination against women, the discrimination against the LGBTQ community, the discrimination against religious minorities like the Baha'i's and others\" as examples of that.\n\n\"I do feel that I want to support the people of Iran, and I do pray and hope for a day where Iran can become a functioning part of the world.\"\n\nMaz Jobrani fears Trump's America is becoming more like Iran's repressive regime. (ABC News: Darryl Torpy)\n\nJobrani fears Trump's America is becoming more like Iran's repressive regime.\n\n\" Iran is a cautionary tale of what happens when you mix religion with politics, and currently living in America, we are moving closer to becoming the Christian Republic of America, the same way Iran is the Islamic Republic of Iran. \"\n\nHe says comedy can be a unifying force and a way to fight rising antisemitism and Islamophobia.\n\n\"I think that there's people out there that are waiting to pounce\" he said.\n\n\"Hate and hatred, it's easier to go that way and I think that comedy can counter that.\n\n\"Like when I do a show, I have people from all backgrounds, all religions in the room, we're laughing together and we're humanising each other. What war does is it dehumanises.\n\n\"You get a room where you have a Palestinian, and you have a Jew, and you have a Muslim — people from different backgrounds and we're laughing together — then people realise, 'Oh, he's human. I'm human.'\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/lancelin-port-denison-erosion-coastal-demolitions-wa/105639698",
        "title": "'Magic' views lost as coastal erosion forces demolition of popular lookout",
        "publish_date": "Tue, 12 Aug 2025 22:37:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Demolition work is underway to remove a lookout in Western Australia that has become synonymous with 360-degree views, sunsets and marriage proposals.\n\nIt comes after coastal erosion in Lancelin, on state's Midwest coast, put the structure at risk of crumbling into the ocean.\n\nLancelin, about 125 kilometres north of Perth, is home to fewer than 1,000 residents but swells to up 5,000 with tourists during the holiday season.\n\nPeter Murphy has lived in Lancelin for 12 years. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nPeter Murphy has lived in Lancelin for over a decade and is on the town's District Community Association.\n\nThe association was the driving force behind building the lookout in 2019.\n\nMr Murphy said the $245,000 jointly funded lookout became iconic for the town.\n\n\"It's the only place [in Lancelin] with a magic 360-degree view,\" Mr Murphy said.\n\n\"People congregate on the lookout with a glass of wine and a deck chair to watch the [New Year's Eve] fireworks.\"\n\nSand has eroded away, leaving the lookout at risk of falling away. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nBut the decision to remove the lookout before it crumbled away did not feel real to Mr Murphy.\n\n\"It's terrible, we never expected this sort of event to happen,\" he said.\n\n\"I think I, amongst other people, have in mind that this is temporary and we will get the lookout back.\"\n\nThe beach along Lancelin shows visible impacts of coastal erosion. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nRemoval 'emotional'\n\nGingin Shire president Linda Balcombe said the removal of Lancelin's lookout would be emotional for many people.\n\n\"I've been really sad about this whole thing, I wish we could save it,\" she said.\n\n\"I think it will make us realise what we can lose if we don't look after it.\"\n\nLinda Balcombe says the community is disheartened to lose their local lookout. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nLast month, council sounded the alarm on coastal erosion as predicted strong winter tides were putting homes and businesses at risk.\n\nFollowing ABC coverage of the damage erosion was causing Lancelin, the state government funded $150,000 to build a natural coastal barrier, designed to protect a local hotel for another few years once in place.\n\nBut Ms Balcombe said she felt not everyone understood the constant threat erosion posed to coastal communities.\n\nContractors and shire workers met on Tuesday morning before demolition works of the lookout began. (ABC Midwest & Wheatbelt: Chris Lewis)\n\n\"I don't think people understand enough what's been happening up and down the coast,\" she said.\n\n\"Some [residents] are quite surprised [at the erosion] and others will say it's cyclic and the beach will come back.\n\n\"And I understand that, but at the moment it's a concern.\"\n\nOther coastal towns such as Port Denison are also threatened by coastal erosion. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nWA coast under threat\n\nJust under a three-hour drive north of Lancelin, the town of Port Denison has the same battle.\n\nSix years ago, the shire worked with state government to control erosion in the area with stabilised earth procedures, which mixed existing beach sand with water and cement.\n\nBut Irwin Shire President Mark Leonard said a stretch of 600 metres was now at risk of eroding away.\n\n\"Behind that 600m stretch is around $40 million worth of public infrastructure, which is our rec centre, pump track, aged care units, roads, car parks,\" he said.\n\nMark Leonard says more funding is needed to continue mitigation works to slow the impact of erosion in Port Denison. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nIn July last year, extreme coastal erosion forced the demolition of Geraldton's marine rescue building, which cost $880,000 to reopen in 2016.\n\nThe shoreline of Point Moore, where the building sat, was lost to vicious waves rapidly.\n\nSeeing what had happened in Geraldton and now Lancelin, Mr Leonard said further mitigation works were needed in Port Denison before it was too late.\n\n\"Our point is that something needs to be done before your buildings are falling into the ocean, not while they're falling into the ocean,\" he said.\n\nMark Leonard says he thought the marina was playing a role in how the beach was behaving. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nErosion management 'complex'\n\nUniversity of WA coastal engineering lecturer Arnold Van Rooijen said shoreline erosion was not a new issue for sites along the state's coast.\n\n\"We see around some of these shorelines that have features that stick out into the ocean … nature essentially wanting to straighten the coastline,\" Dr Van Rooijen said.\n\n\"So it's quite common around the world and Australia to see areas experience ongoing retreat.\"\n\nArnold Van Rooijen says understanding the causes of coastal erosion is complex. (ABC Midwest & Wheatbelt ABC Midwest & Wheatbelt: Chris Lewis )\n\nBut Dr Van Rooijen said large coastal infrastructure like ports influenced coastal processes with \"erosion on one side and accretion on the other\".\n\nHe said although contributions to erosion along the coast had recurring themes, a holistic approach was needed to minimise impacts.\n\n\"[WA] os a very long coastline, it's sparsely populated and very complex with a lot of limestone … cliffs and marine ecosystems,\" Dr Van Rooijen said.\n\n\"I think governments are working very hard to deal with this issue, but it's definitely not straightforward and every site needs a tailored approach.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/meg-lanning-gets-the-better-of-ellyse-perry-in-the-hundred/105645984",
        "title": "Lanning gets the better of Perry in Hundred's battle of Aussie greats",
        "publish_date": "Tue, 12 Aug 2025 22:16:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "It is a rare experience for Australian bowlers to be clouted to all parts in the women's game but, if anyone can do it, it is former captain Meg Lanning.\n\nThe veteran played the leading role as Oval Invincibles smashed the best powerplay score in the five-year history of the Hundred Women, cracking 54 in 25 balls, the first 50 of which came from 20 balls bowled by a trio of Aussies.\n\nThat set Invincibles up for a 100-ball score of 5-174, the third-highest in Hundred history, and Birmingham Phoenix never looked like matching it.\n\nGeorgia Voll gave them brief hope with a scintillating start, making 22 off 15 balls, but was caught at mid wicket with a juggling catch by compatriot Amanda Jade-Wellington.\n\nEllyse Perry hit her first two balls for four but she had come to the crease with Phoenix 2-31 and needing a very demanding 144 off 74.\n\nThe all-rounder had just reached 29 off 16 balls by launching Jade-Wellington for six, but was caught behind next ball trying to cut. Six balls later, Jade-Wellington brilliantly ran out Emma Lamb (25) and, at 4-83 with 59 balls gone, the game was done.\n\nJade-Wellington finished with 2-27 off her 20 balls as the visitors won by 22 runs at Edgbaston, Phoenix closing on 6-152.\n\nPhoenix had opened up on Tuesday (local time) with a trio of Australians, Megan Schutt, skipper Perry and Voll, and Lanning tucked into them with English opening partner Lauren Wingfield-HIll.\n\nAll three bowlers were punished at a rate of more than 10-an-over, not helped by each conceding extras.\n\nPerry used seven bowlers to try to stem the flow, but only spinner Hannah Baker had any effect, dismissing both openers as she took 2-24 in her 20, by far the best economy rate.\n\nLanning was caught at deep midwicket by Lamb for a 19-ball 36, then Wingfield-Hill was taken by Perry at mid-off for 33 off 27.\n\nHowever, Alice Capsey had come in with the platform set and the big-hitting England batter, dropped on 21, thumped 52 off 29 balls.\n\nWhen she was out there were two balls left, Jade-Wellington was caught trying to hit the first for four, Ash Gardner then came in and hit her only ball to the boundary.\n\nPerry finished with 0-34 off 20 balls, Schutt 1-34 off her 20, and Voll's only five-ball set went for 20.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/regional-towns-losing-solstice-energy-gas-ask-for-financial-help/105629794",
        "title": "Residents hit with 'poorly planned' gas shutdown ask for compensation",
        "publish_date": "Tue, 12 Aug 2025 21:49:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Victorian government is being urged to subsidise regional Victorians who must convert their homes and businesses to bottled gas or electricity, after a major retailer's surprise decision to cut compressed gas supply next year.\n\nSolstice Energy announced it would switch off compressed gas networks and stop trucking gas into 10 regional Victorian towns by the end of next year.\n\nMore than 1,100 households at Heathcote, Maldon, Marong, Swan Hill, Kerang, Nathalia, Robinvale, Terang, Lakes Entrance and Orbost will be affected.\n\nJust spent $40,000 on gas\n\nJohn Maynard and his wife Janelle run a cafe and events venue at Nathalia in northern Victoria and last year spent $40,000 installing natural gas during a renovation.\n\nJohn and Janelle Maynard opened Broken Willow restaurant just over a year ago (Supplied: John Maynard)\n\nHe said his business relied on gas for heating, cooking and hot water.\n\nMr Maynard heard about the Solstice gas switch-off after the ABC contacted him last week.\n\n\"If I've got to put electricity in, I've got to then spend probably another $20,000, plus to get my whole wall pulled out and put electricity into my wall, which I don't have at the moment to do,\" he said.\n\nMr Maynard said he also worried that if he switched to bottle gas, it might run out during a large function.\n\n\"We'd be in a lot of trouble,\" he said.\n\nJohn Maynard says he installed a natural gas connection a year ago. (Supplied: John Maynard)\n\nSolstice Energy said it would support every household and business affected by the gas cuts, providing $1,000 up-front payments, gas appliance subsidies, and support to switch to bottled gas.\n\nThose who opt to convert their homes to electricity are advised to apply for Victorian government rebates.\n\nA Victorian government spokesperson said it was providing up to thousands of dollars in discounts for electric appliances through the Solar Homes and Victorian Energy Upgrades programs.\n\nBut Mr Maynard said that was not enough.\n\n\"A lot of small restaurants and businesses around the area are struggling as it is and we need any help we can get,\" he said.\n\nMr Maynard said he was already paying $1,500 to $3,000 a month on gas and he would lose money by closing his business to complete works for the transition.\n\n\"We'd have to be shut down for I reckon two or three weeks just to change everything over,\" he said.\n\nGas switch off 'poorly planned'\n\nThe Victorian government launched the gas substitution road map in 2022 to drive down gas usage across the state.\n\nVictoria Energy Policy Centre head Professor Bruce Mountain said it represented a drastic change in direction, given previous Victorian government policy encouraged households to use gas.\n\nBruce Mountain says households should consider switching from natural gas. (ABC News: Peter Garnish)\n\n\"Households have invested. As a consequence, they have been locked into those choices,\" he said.\n\nProfessor Mountain said he believed Victorians should consider switching away from natural gas, as more suppliers could begin turning off supply.\n\n\"Gas is becoming more scarce, and as consumers use less, the viability of lines becomes even harder to sustain, and so they are progressively cut off,\" he said.\n\nSt Vincent de Paul national energy director Gavin Dufty said the gas cuts in regional Victoria had been poorly planned.\n\nGavin Dufty says it is a \"huge ask\" for home owners to make the costly conversion. (ABC News: Clint Jasper)\n\n\"The lack of coordination between Solstice and the Victorian government to provide long-term, fit-for-purpose solutions for these communities is a glaring, glaring omission,\" he said.\n\n\"You've got these two different options to go to LPG — back to the future — or electrify.\n\n\"The big issue here is, they're only giving people a year and a half to make what is quite a huge decision for these households.\n\n\"In the next 20 years, we may see more gas cuts, depending on the size of the communities on the reticulated gas network and government policy.\n\n\"If you're on the gas network at the moment, when your appliance fails and all that, do consider alternatives.\"\n\n'Better off in the long run'\n\nSolstice Energy chief executive Phaedra Deckart said switching from piped gas to bottled gas or electricity would be \"better for customers in the long run\".\n\nPhaedra Deckart says customers will be better off switching to bottled gas or electricity. (Supplied: Solstice Energy)\n\n\"The basis upon which the network was built assumed a much larger demand and a much greater number of customers,\" she said.\n\n\" We have tried everything to make this network viable, however, it is a very high-cost network to truck compressed natural gas to each of these regional towns, and ultimately, costs are going up for customers. \"\n\nSolstice Energy announced a 50 per cent price increase to the 10 impacted towns last Monday.\n\nCustomers had already been hit with an 80 per cent increase in January 2023.\n\nMs Deckart said Solstice would need to continue raising prices every year for its compressed gas service to remain viable.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/asx-markets-business-live-news/105645906",
        "title": "Live: CBA shares slump despite bumper profit, dragging down ASX",
        "publish_date": "Tue, 12 Aug 2025 21:46:40 +0000",
        "category": "finance",
        "authors": [
            "David Chau",
            "David Taylor",
            "Yiying Li",
            "Chief Business Correspondent Ian Verrender"
        ],
        "text": "Oliver Twist has turned nasty, especially when it comes to the Commonwealth Bank.\n\nThe niceties and the deference have been chucked, replaced by a savage response to what investors clearly believe isn't enough. They wanted more.\n\nThe stock is being jettisoned this morning, down almost 5 per cent since trading opened.\n\nCBA's supersized $10.25 billion cash profit may have customers feeling as though they've been stung. But, even though it was in line with analyst expectations, it was still only a meagre 4 per cent up on last year's result.\n\nAnd that kind of growth simply isn't enough to justify the rocketing price of CBA shares during the past year. They somehow seem to have cut the shackles underpinning ordinary valuation methods and drifted off into outer space.\n\nIts market valuation is more than 30 times its earnings. The broader market is just under 20. And the long-term average for Australian stocks is around 15.\n\nThe other three of the big four banks are valued between 14 and 17 times earnings.\n\nGo figure.\n\nIn the past 12 months, CBA stock has jumped around 38 per cent. And that's after its recent declines.\n\nPartly because it was unaffected by global geopolitical tensions — including Donald Trump's tariff blitz — and partly because the exodus of cash from US markets, global investors went looking for alternatives and CBA took on the mantle as a safe haven.\n\nThe end result?\n\nNot only is it the biggest company on the ASX, it now accounts for a whopping 12 per cent of the entire Australian market.\n\nA minor dose of reality this morning.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/alexei-popyrin-andrey-rublev-cincinnati-open/105645860",
        "title": "Popyrin agonisingly short in gruelling Cincinnati battle with Rublev",
        "publish_date": "Tue, 12 Aug 2025 21:45:58 +0000",
        "category": "sports",
        "authors": [],
        "text": "After three-and-a-half hours in sweltering Ohio heat, Alexei Popyrin just ran out of gas in an epic Cincinnati Open third-round tie with ninth seed Andrey Rublev.\n\nPopyrin lost 7–6 (7/5), 6–7 (5/7), 5–7 after a seesaw encounter that could easily have gone the other way.\n\nThe Australian, himself ranked 19, will have the consolation of a very good workout ahead of the US Open, and may appreciate some rest after such a draining encounter. However, his chances of a top 16 ranking and better seeding slot in New York appear to be gone.\n\nWhen Rublev's passing shot beat him to seal victory with the Russian's first match point, Popyrin looked very weary, then smiled ruefully as he dragged himself to the net to give his opponent a hug.\n\nAnother Aussie ousted in round three was Adam Walton.\n\nThe 26-year-old Queenslander was beaten 7-6 (7/5), 7-6 (7/3) by Czech Jiri Lehecka, who is drawn to take on either number five seed Ben Shelton or Roberto Bautista Agut in the last 16.\n\nThe pair had slugged it out for three tight sets, interrupted in the last by a lengthy rain break.\n\nFirst up on Court 3, in front of a decent crowd mainly supporting Rublev, Popyrin's opening serve was broken from 40–0 up, but he broke back immediately, helped by a brace of double-faults by the Russian.\n\nThe first set thereafter went with serve to the tiebreak. After four mini-breaks, Popyrin served an ace at 5–5 then Rublev, facing set point, double-faulted.\n\nThe second set went with serve to the tiebreak, albeit Popyrin had to save three break points while forcing none. After double-faulting at 4–5 in the breaker he broke for 5–5, only for Rublev to sweep the next two points and the tiebreak.\n\nThe pair had been playing for more than 2 hours at this stage, in 32-degree heat. There followed an epic 28–point service game in which Popyrin forced but failed to take four break points.\n\nThe match had begun in fierce sunshine shortly after 11:00am, local time, but for some time humidity had been rising and clouds building.\n\nSuddenly, with the third set poised at 2–1 to Rublev, and 30–30 on Popyrin's serve, a cloudburst flooded the court and sent players and spectators rushing for cover.\n\nPopyrin immediately went a break point down when they resumed just under an hour later, but saved it before serving out with two aces.\n\nThe match then went with serve until, at 30–30 and 5–6 down, the Australian had to step away from his serve due to a ringing mobile phone. It may have made no difference but his subsequent serves were not quite there and Rublev pounced.\n\nThe Russian now meets Argentina's Francisco Comensana, who beat Reilly Opelka 6–7 (4/7), 6–4, 7–5.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/busselton-widow-proof-of-broken-wa-regional-health-system/105636280",
        "title": "Missed cancer diagnosis a symptom of crisis engulfing WA hospitals",
        "publish_date": "Tue, 12 Aug 2025 21:29:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Kevin Cross had lay bleeding while ramped outside a hospital, was shifted to five different beds in one day, was cared for by an exhausted staff and faced delay upon delay.\n\nHis wife, Jenny Cross, said that was the reality of navigating Western Australia's struggling public health system with her late husband.\n\nIt was a six-month ordeal of emotional distress as Ms Cross searched for answers to his deteriorating health.\n\n\"Just after Christmas last year he had started to lose a lot of weight for no known reason,\" Ms Cross said.\n\n\"He had a bad bleed in March so I took him to the emergency department in Busselton.\"\n\nMs Cross says her husband was moved multiple times during a short stay at Bunbury Regional Hospital. (ABC South West WA: Gian De Poloni)\n\nMr Cross waited 12 hours to be transferred from Busselton Health Campus to Bunbury Regional Hospital, only to spend another three hours ramped outside.\n\nWithin 24 hours he had been moved between five different beds.\n\nMs Cross said there was no communication between the hospitals about a blood transfusion Mr Cross desperately needed.\n\n\"They gave him a CT scan and couldn't see anything wrong so he was just sent home with a referral for a colonoscopy and a gastroscopy,\" she said.\n\n\"The results were nothing, apparently. I tried to book a PET scan he had a referral for but I never heard back.\n\n\" Every time we tried to get something done we just couldn't. Every test you wanted we had to wait 10 days. \"\n\nMr Cross was in and out of hospital over the next six months as his condition deteriorated.\n\nMs Cross recalled PA announcements in Bunbury Hospital asking for staff to work overtime.\n\nShe also said she had specialists advising them to have tests as outpatients to save time.\n\nFinally a diagnosis\n\nIn the end, the Cross family \"gave up\" on the public health system and took Kevin to St John of God Murdoch.\n\nAfter 15 days in the hospital he was diagnosed with pancreatic cancer on July 3.\n\nBy then his organs were failing and his heart was operating at just 10 per cent of its usual strength.\n\nMr Cross died two weeks later on July 18, leaving behind his wife, three children and eight grandchildren.\n\nKevin Cross died on July 18 from pancreatic cancer. (ABC South West WA: Pip Waller)\n\nMs Cross said Kevin would be remembered for his warm and friendly nature.\n\n\"Anyone you spoke to would say he was a really nice guy who would do anything to help you if he could,\" Ms Cross said.\n\n\"I don't know if an earlier diagnosis would have made any difference in the end, but he could have been a lot more comfortable and had more time.\"\n\nShe said she knew the system was bad but did not fully understand until she experienced it with her husband.\n\n\"And its not the staff's fault. They're trying their best,\" she said.\n\nSystem 'on its knees'\n\nAustralian Medical Association WA branch president Kyle Hoath said the issues described by Ms Cross, including ramping, bed shuffling and general delays, were apparent across the entire public health system.\n\nAmid record ambulance ramping WA faces a wicked problem Photo shows Three ambulances lined up in a row outside a hospital. Western Australia may have to shift its focus to making ambulance ramping safer until the health system is able to meet growing demand, writes state political reporter Keane Bourke.\n\n\"It breaks my heart when we hear this happening, particularly in the regions,\" Dr Hoath said.\n\n\"But unfortunately none of this surprises me anymore.\n\n\"It's a symptom of a larger problem — we don't have enough staff capacity and burnout rates are high in Bunbury.\"\n\nIn June, ambulances spent 240 hours ramped in regional areas, with Bunbury Hospital accounting for 85 per cent of total ramping.\n\nDr Hoath said the Cook government needed to acknowledge the problem so solutions could be found.\n\n\"What we're seeing with these ramping numbers, with these transfers between hospitals being delayed, is a system on its knees,\" he said.\n\n\"Bunbury is just under intense pressure right now.\"\n\n'We're not just statistics'\n\nThe state government and WA Country Health Service were contacted for comment.\n\nMs Cross says Kevin would do anything to help someone if he could. (Supplied: Jenny Cross)\n\nMeanwhile, Ms Cross said she and her family had been left to deal with losing Mr Cross.\n\n\"They [the state government] just need to listen and understand it's actual human beings they're dealing with,\" she said.\n\n\"And stop wasting so much money on stuff like that racetrack, the rugby and movie sets. Just listen to what people want.\n\n\"We're not just statistics, we're real people with real families and real lives to live.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/bullsbrook-pfas-contamination-defence-row-continues/105643938",
        "title": "Residents' row with Defence continues over 'forever' chemicals near Perth",
        "publish_date": "Tue, 12 Aug 2025 21:13:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Department of Defence is refusing to replace residential pipes and water systems in a Perth town it contaminated with \"forever chemicals\".\n\nBullsbrook, north of Perth, is home to one of several sites across the country which were contaminated with chemicals from firefighting foam used at military bases.\n\nPFAS — or per- and poly-fluoroalkyl substances — is an umbrella term for a group of chemicals that do not break down, and can accumulate in soil, water, and human bodies.\n\nThe federal government settled a class action in 2023 over PFAS contamination at seven sites, including Bullsbrook, and paid $132.7 million to about 30,000 claimants.\n\nDefence has been working to connect more than 200 properties in Bullsbrook to scheme water by March 2026, including installing devices to prevent water from properties flowing back into the mains system.\n\nThe project is part of the \"management and remediation\" of PFAS contamination around the Royal Australian Air Force (RAAF) Pearce air base.\n\nHowever, progress has reached a standstill for some residents who believe the internal pipework and hot water systems in their properties also need to be replaced, which the ABC understands the department has refused to do.\n\n'Our lives are still on hold'\n\nIn letters sent to residents in 2022, seen by the ABC, the Department of Defence outlined the funding arrangement for scheme water connections in West Bullsbrook.\n\n\"Defence will fund any infrastructure required to connect the property to the mains pipeline, as well as any necessary plumbing works on your property and dwelling,\" the letter said.\n\nBullsbrook resident Reannan Haswell said the \"necessary plumbing works\" should include pipes and water systems inside homes.\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\n\"I still can't believe we're having this conversation ... you've got a contaminated source, it sent water through pipes, it's contaminated your whole household,\" Ms Haswell said.\n\n\" We've been on bottled water since 2016 — our lives are still on hold 10 plus years later. \"\n\nThe department has agreed to fund the scheme water connection and the installation of back-flow prevention devices.\n\nMs Haswell was the lead applicant in the class action lawsuit against the Commonwealth.\n\nLast month, she raised concerns with Defence that residents would ultimately still be using potentially contaminated water if internal piping was not replaced.\n\nReannan Haswell says her family's lives are on hold as they wait for Defence Department remediation works. (ABC News: Nicolas Perpitch )\n\nIn an email response to Ms Haswell, the department said it had no record of any commitment to replace pipework or hot water systems in homes.\n\n\"At the time of water connection, Defence will provide instructions for the flushing of internal pipes in the residences where PFAS-impacted groundwater was previously used,\" the email read.\n\n\"Defence will offer to collect water samples from your taps for analysis to ensure the water meets the Australian standards for safe drinking with respect to PFAS concentrations.\"\n\nContamination 'not fixed'\n\nMs Haswell said she wasn't convinced they could flush the pipes clean of PFAS.\n\n\"You can't flush it ... hence why the original plan of a portable filtration device on everyone's premise back in 2016 was not an option,\" she said.\n\n\" It is a forever man-made chemical — it cannot be eradicated. \"\n\nThe Department of Defence had not responded to the ABC's enquiries by the time of publication.\n\nBullsbrook residents have been forced to drink and wash with bottled water for years because of the PFAS contamination. (ABC News: Rebecca Turner)\n\nMs Haswell said she felt compelled to speak out for impacted residents and taxpayers.\n\n\"I thought a class action would have had that nailed on the head ... it's still not fixed, it's still not resolved,\" she said.\n\n\"They're just woefully wasting money to give people scheme water that's not safe.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-13/blacktown-liverpool-hospitals-patient-survey-bhi-results/105644272",
        "title": "New data reveals two Western Sydney hospitals rank lower than average",
        "publish_date": "Tue, 12 Aug 2025 21:10:01 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Two overstretched hospitals in Sydney's west have consistently ranked \"significantly lower\" than average in a survey of patient satisfaction, according to new data released by the Bureau of Health Information (BHI).\n\nJust over half of patients treated at Blacktown or Liverpool hospitals rated their overall care as \"very good,\" compared to the 67 per cent statewide average of NSW public hospital patients.\n\nThough fewer than six out of 10 patients at Blacktown and Liverpool hospitals reported that their care was \"very well-organised\" or \"very clean\".\n\nBlacktown Hospital also scored poorly on patients' perceptions of how well health professionals gave them support with their worries or fears, while Liverpool Hospital ranked significantly lower on whether patients felt they were given enough information on how to manage their care at home.\n\nLast month, images from Blacktown Hospital sparked fresh outrage over the state of NSW Health's system, including photos of a 70-year-old man sleeping on the floor while waiting for a blood transfusion.\n\nA 70-year-old patient was photographed sleeping on the floor at Blacktown Hospital. (ABC News: Jak Rowland)\n\nLiverpool Hospital also has one of the state's busiest emergency departments, but this year the NSW government said it had success in significantly reducing emergency room wait times.\n\n\"Liverpool Hospital is one of the busiest hospitals in NSW, and we thank our dedicated staff for their incredible efforts in keeping the community safe and providing high quality compassionate care,\" A South West Sydney Local Health District (SWSLHD) spokeswoman said.\n\nThe SWSLHD manages Liverpool Hospital.\n\n\"Work to streamline patient care by improving access to diagnostic tests, ensuring faster discharge and enhancing patient safety is being undertaken,\" the spokeswoman said.\n\n\"We are trialling collaborations between our hospitals and our District's Primary and Community Health services to enhance our patients' experience of care through hospital discharge to continue their care in the community, including at home.\n\nA Western Sydney Local Health District (WSLHD) spokeswoman said Blacktown Hospital staff were \"dedicated\" to improving the experience there.\n\n\"WSLHD staff remain dedicated to improving patient experience and prioritising safe, high-quality and evidence-based care,\" the spokeswoman said.\n\n\"During the BHI survey period, January to December 2024, Blacktown Hospital delivered 47,235 episodes of care with an average acute length of stay of five days.\n\n\"Of the 303 patients surveyed by BHI for this period, 94 per cent expressed confidence and trust in our health professionals. Almost all (96 per cent) of surveyed patients said they were treated with respect and dignity while in hospital and 96 per cent said health professionals were kind and caring towards them.\"\n\n'There is room for improvement'\n\nActing chief executive of the BHI, Hilary Rowell, said despite its poor performance in the patient survey, Liverpool Hospital had lifted its game on some indicators since the last survey.\n\n\"When you do scrutinise the results, there are a number of hospitals where patients told us there is room for improvement,\" she said.\n\n\"But at Liverpool we saw a number of improvements in ratings too, and that was around health professionals working as a team and the way in which patients were involved in decisions about their discharge.\"\n\nMs Rowell said Liverpool Hospital had lifted its game on some indicators since the last survey. (ABC News: Keana Naughton)\n\nOverall, the survey shows NSW public hospital patients are generally satisfied with their care — with more than nine out of 10 public hospital patients in the state rating it as \"good or very good\".\n\n\"There were some highlights: More than seven in 10 patients said health professionals always listened carefully to their cares and concerns and that was one of the larger improvements with the 2023 survey,\" Ms Rowell said.\n\nRegional hospital patients were more likely to give higher rankings to their care in the survey, which was completed by more than 25,000 patients in 2024.\n\nBut one of the biggest drops has been in patient satisfaction since the last survey was conducted related to hospital food — with only 21 per cent of patients saying their meals in hospital had been \"very good\", down from 24 per cent in 2023.\n\n\"I think it is important to note that more than nine in 10 patients (92 per cent) rated their overall care as 'very good' or 'good',\" Health Minister Ryan Park said.\n\n\"Blacktown Hospital has made one of the most tremendous improvements in terms of T2 emergency treatment on time, almost tripling over the past two years.\n\n\"The number of T2 emergency patients at Liverpool Hospital are being treated on time has increased by a third compared to two years ago.\n\n\"But clearly there is a disconnect between the trends showing improvement in performance and the overall patient experience.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/lockyer-excited-to-see-hunt-control-broncos-20250813-p5mmmj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lockyer 'excited' to see Hunt control Broncos",
        "publish_date": "Wed, 13 Aug 2025 12:09:02 +1000",
        "category": "sports",
        "authors": [],
        "text": "Lockyer 'excited' to see Hunt control Broncos\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/what-drives-the-human-instinct-to-create-art-20250804-p5mka8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What drives the human instinct to create art?",
        "publish_date": "Wed, 13 Aug 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Gabriella Coslovich"
        ],
        "text": "Others include the uncompromising Mike Parr, known for his confronting performance art, in a fascinating essay about Parr’s collaboration and eventual falling-out with master printer John Loane. Another beautifully observed essay, “The House at Glenorie”, explores the relationships between lauded architect Glenn Murcutt and artists Sydney Ball and Lynne Eastaway, for whom he designed a house in the middle of the bush at the titular Glenorie, about an hour north-west of Sydney.\n\nThe effect is one of discovery, or rediscovery, of contemporary artists worthy of our attention such as Gill, who represented Australia at the Venice Biennale in 2013 (her artwork is on the book’s cover).\n\nIn a bold editorial (and marketing) move, the book’s 12 essays are not named after the artists they cover (apart from the essay on Indigenous artist the late Mirdidingkingathi Juwarnda Sally Gabori). Instead, the essays are given more cryptic titles, such as “The World is Made of Layers” (on Vivienne Binns), that relate in some way to the artists’ attitudes or work.\n\nSprague situates himself in the essays as he visits the artists at their homes and studios and reflects on the conversations they have about art (apart from Gabori, whom he met only briefly, and Helen Maudsley, who was not available for interview). He is a searching and solemn writer, but on no occasion cynical. Even when he is not particularly keen on an artist’s work – and he admits that he doesn’t love Gabori’s – he seeks to understand it. An art-school graduate and former artist who has worked as a curator and arts co-ordinator, Sprague continues to place art “somewhere close to the centre of my life”, and it’s this that gives his writing an unusual empathy.\n\nCritic Quentin Sprague. Credit: Ross Coulter\n\nAs Sprague explains in the introduction, his love of art was piqued as a child when his single mother would take him and his sister on the 300-kilometre round-trip from their home in Monaro, regional New South Wales, to the National Gallery of Australia in Canberra, leaving at dawn in the family’s “twin-cab Kombi utility”.\n\n“It was visits to the National Gallery of Australia that truly imprinted on my young consciousness,” he writes. He compares the “quiet awe – enveloping, gentle, deadly serious” of the gallery atmosphere back then to the galleries of today, which can sometimes seem as “mere extensions of some vast industrial entertainment system”.\n\nWhat Artists See is a counter to that “vast industrial entertainment system”; the pace is unhurried, reflective and psychologically probing – although at least one of the artists, abstract painter Karl Wiebke, seems to grow slightly impatient with Sprague’s insistent need to find the “lesson” in his art. Sprague hopes that “Wiebke might arrive at an overarching definition of his work”. But Wiebke is not interested in absolutes. If Sprague in this instance is guilty of over-complicating things, he is self-aware enough to recognise it: “If I was after the ‘lesson’ of his work, this was surely it: don’t expect a concrete revelation. Or, put another way, don’t expect for the puzzle to be solved.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/this-biography-does-fullest-justice-to-the-maddest-stories-imaginable-20250807-p5ml94.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This biography does fullest justice to the maddest stories imaginable",
        "publish_date": "Wed, 13 Aug 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Peter Craven"
        ],
        "text": "Frances Wilson has written about Thomas De Quincey and D.H. Lawrence and the Titanic. Now she has written about Spark with a brilliant recreative justice to the brilliant shot of lightning that illuminates everything Spark did, but also the formal brilliance of the work and the way it remained – in ways that are at once wacko and regally impressive – the imprint of a personality that was both magnificent and alarming.\n\nIt’s extraordinary the magnetism of Muriel Spark and the extent to which her work has such an extraordinary power of definition, even when it seems in its ravishing way minor and whole aspects of her life seem eccentric to the point of derangement. But this is the woman to whom the New Yorker devoted an entire issue which contained the text of The Prime of Miss Jean Brodie , subsequently made into a film starring Dame Maggie Smith and widely regarded as the greatest novella of the mid-20th century.\n\nWilson, who has a captivating analytical mind and an exceptional narrative power that goes along with it, tells the stories of how Spark ran the Poetry Society and the weird chaps (sometimes military gents) she had to fight again and again to gain control. If you’re going to read one work of criticism or critical biography this year read her: she’s some kind of genius.\n\nAnd she does the fullest justice to the maddest stories imaginable. At one point in the 1950s, Spark is not only sleeping with a fellow called Stanford, she’s sharing a journal with him – one that juxtaposes her cut-glass intensities with his smokey bombast. Then she becomes religious, embracing first Anglo then Roman Catholicism, and she is insistent that if they’re to keep up the sex he had better take on God. He won’t, but Spark (who has written a book about the Book of Job, The Only Question) does with great tolling bells on, while Stanford is possessive about her work.\n\nDame Muriel Spark in 1965.\n\nTogether, they edit Cardinal Newman’s wonderful sermons. Meanwhile, Spark, who is heavily into dexedrine – and who is at work on a life of Mary Shelley – gets it into her head that she is receiving secret coded messages from T.S. Eliot (who has just written The Confidential Clerk and was impressed by her review).\n\nSpark’s work goes from strength to strength even where it contains worlds within worlds as well as re-arranging the traditional hierarchies of leading men. There are devils and then there is Spark’s strange double act with Evelyn Waugh’s weird breakdown work The Ordeal of Gilbert Pinfold, which is full of parallel derangements to her own but which he celebrates with a generous blurb. It’s also the case that Graham Greene, who admired that uncanny panoramic coldness in Spark’s work and her command of the drama of introspection and self-annihilation, kept her alive with monthly cheques.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/the-type-of-negatively-geared-landlords-who-lose-the-most-money-20250808-p5mlif.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The type of negatively geared landlords who lose the most money",
        "publish_date": "Wed, 13 Aug 2025 11:58:41 +1000",
        "category": "finance",
        "authors": [
            "Caroline Zielinski"
        ],
        "text": "Paradoxically, such a proposal would not recoup as much money for taxpayers as removing deductions for single property investors, who ultimately cost the government more to subsidise. Loading The Australian Council of Social Services wants to phase out negative gearing entirely and halve the 50 per cent capital gains tax discount over five years. Meanwhile, the Grattan Institute recommends reducing the tax discount to 25 per cent and curbing negative gearing so that rental losses could no longer be offset against wage and salary income. Treasurer Jim Chalmers dismissed any changes to negative gearing or the capital gains tax discount in an interview on ABC News Breakfast on Thursday morning. He said the government was instead focusing on delivering more supply to help housing affordability. About 72 per cent of all investors own one property, ATO data shows, which some experts believe adds to rental insecurity. “Penalising large landlords and exempting small ones is a bad idea,” says Peter Tulip, chief economist at the Centre of Independent Studies.\n\n“Australia has a terrible problem with rental insecurity – huge numbers of people will have been evicted because their landlord has decided to sell the property. This is a much smaller problem in Europe or the United States, because their rental stock is owned by big corporations, who are happy for you to stay there for decades. “We have the wrong landlords, and ACTU wants to make that problem worse.” Treasurer Jim Chalmers has ruled out any changes to negative gearing or the capital gains tax in an interview with the ABC on Thursday. Credit: Oscar Colman Independent economist Saul Eslake says keeping negative gearing benefits to just one property would only affect 29 per cent of investors, meaning “most people who have a negatively geared property would continue to have it under the ACTU proposal”. Menzies Research Centre’s 2024 research found 18 per cent of negatively geared investors are trade union members, and 65 per cent of negatively geared residential property investors had a taxable income of $120,000 or less. Negative gearing is used by 27,600 nurses and 28,000 teachers.\n\nDavies says while it may be more politically palatable to target large investors, it would make more sense to remove negative gearing altogether. “If the goal is to make housing more affordable, this won’t make much difference to affordability,” he says. His 2024 paper argues that access to the tax breaks should be conditional on minimum five-year fixed-term leases, one rent increase and inspection per lease period, dwelling quality, and below-market rent. Tulip agrees that tax concessions for investors are unimportant to housing affordability. “Several good researchers have estimated their effect on affordability in different ways, and they find their effect is tiny – between 1 and 4 per cent.” He says there is scope for amendments to the investor taxes.\n\n“The 1999 Ralph Review suggested the capital gains tax discount to promote enterprise and risk taking, and my view is that applies more strongly to investment in shares or other business investment than real estate, where the huge capital gains accrued by landowners aren’t done so for any sacrifice or effort on their part,” he said. Loading Eslake says people should not be allowed to offset excess interest against their wage and salary income, and should instead “carry it forward as a deduction against the capital gains tax liability when they sell [their property].” He rubbished claims that eliminating negative gearing would make affordability worse. “If landlords were to sell their investment priorities, who would they sell to? First home buyers or other owner-occupiers trading up,” he says. “Yes, it would reduce the supply of rental housing, but it would also reduce the demand for rental housing by the same amount.” Eslake says, despite what they say publicly, politicians and most Australians don’t want the problem of housing affordability to be solved.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/wallabies-drop-major-surprise-as-o-connor-to-play-no-10-against-springboks-20250813-p5mmlt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wallabies drop major surprise as O’Connor to play No.10 against Springboks",
        "publish_date": "Wed, 13 Aug 2025 11:52:29 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Wallabies coach Joe Schmidt is set to pull a major surprise by selecting James O’Connor at No.10 for Australia’s opening Rugby Championship clash against South Africa in Johannesburg.\n\nO’Connor has not played a Test in nearly three years but is poised to wear the five-eighth jersey against the Springboks, according to informed sources speaking on the condition of anonymity as they did not have permission to discuss team selections.\n\nWith Noah Lolesio injured and Tom Lynagh out with a concussion, O’Connor will feature in his first international match since starting in the Wallabies’ 48-17 loss to Argentina in 2022 in San Juan.\n\nO’Connor, who had a strong season for the Crusaders, mostly off the bench, was initially on the outer with Schmidt but found himself parachuted into Australia’s squad for the Lions series after Lolesio went down with a neck injury.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/cba-profits-swell-to-10-25b-as-household-finances-improve-20250812-p5mma5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA shares tumble despite $10.25 billion profit",
        "publish_date": "Wed, 13 Aug 2025 11:50:24 +1000",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "Commonwealth Bank shares have slumped sharply despite its $10.25 billion profit, as analysts continued to question its high valuation and highlighted that its earnings had received a boost from lower bad debt charges.\n\nCBA, the biggest stock on the ASX, on Wednesday said cash profits rose 4 per cent to $10.25 billion for the year to June, as the banking giant benefited from growth in business loans and mortgages, while also posting lower bad debts.\n\nCBA CEO Matt Comyn. The high price of CBA shares has been an ongoing debate in the market. Credit: Oscar Colman\n\nThe high price of CBA shares has been an ongoing debate in the market, with CBA shares up close to 30 per cent in the past year. Investors dumped the stock on Wednesday, sending it 5.3 per cent lower by late morning.\n\nDelivering the full-year results on Wednesday, chief executive Matt Comyn said economic conditions had improved for many of its customers during the year, as household incomes rose due to interest rate cuts, tax cuts and lower inflation.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/cba-posts-best-ever-profit-20250813-p5mmm7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA posts best-ever profit",
        "publish_date": "Wed, 13 Aug 2025 11:48:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "CBA posts best-ever profit\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/union-movement-to-push-for-four-day-work-week-at-economic-roundtable-20250813-p5mmig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Union movement to push for four-day work week at economic roundtable",
        "publish_date": "Wed, 13 Aug 2025 11:46:34 +1000",
        "category": "finance",
        "authors": [
            "Olivia Ireland"
        ],
        "text": "The union movement will push for a four-day workweek at the Albanese government’s economic round table next week in a bid to improve work-life balance.\n\nAustralian Council of Trade Unions president Michele O’Neil will cite academic research that argues businesses can achieve greater levels of productivity if the policy is implemented.\n\nThe four-day model would apply to industries where appropriate, and sector-specific alternatives would be suggested where it would not be feasible.\n\nPresident of the Australian Council of Trade Unions, Michele O’Neil, is pushing for a broader discussion about the four-day week. Credit: Alex Ellinghausen\n\nO’Neil’s push for the popular workplace policy will likely cause a clash between unions and employers on what the best approach will be to improve productivity.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/china-is-playing-the-long-game-to-win-its-war-with-trump-20250813-p5mmhp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "China is playing the long game to win its war with Trump",
        "publish_date": "Wed, 13 Aug 2025 11:44:00 +1000",
        "category": "finance",
        "authors": [
            "Karishma Vaswani"
        ],
        "text": "US President Donald Trump’s trade war was meant to rebalance global power in the United States’ favour. Instead, China is playing the long game, enduring short-term economic pain to shape any eventual deal to its advantage.\n\nThe strategy appears to be working — for now. On Monday, Washington granted Beijing another 90-day reprieve, extending a pause on tariffs through November 10. China announced it would do the same. Markets welcomed the move, which offered some relief after months of tension. The delay will give Chinese President Xi Jinping’s policymakers more time to plan their next move.\n\nTime is on Xi Jinping’s side. Credit: AP\n\nTime is Xi’s ally. So far, the clearest outcome of each round of talks has been a commitment to meet again. Despite Trump’s insistence that China has taken significant steps to improve their trade relationship, Beijing has made no consequential concessions on any of his key concerns. (China has offered some small compromises, none on the scale of American demands.)\n\nThe extension has come at a delicate time for China’s economy, which is plagued by sluggish domestic demand and a slowdown in the property sector. Bloomberg Economics says that it is among the few major nations without a clear timeline or terms for a deal, while others have struck agreements to secure lower tariffs. Even with this reprieve, it notes, Beijing faces average US tariffs of 40 per cent — almost 25 percentage points above the global average.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/a-jockey-bought-a-horse-for-darren-weir-s-daughter-he-faced-a-two-year-ban-20250806-p5mkuf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A jockey bought a horse for Darren Weir’s daughter. He faced a two-year ban",
        "publish_date": "Wed, 13 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Danny Russell"
        ],
        "text": "$20,050 bill Gordon was living and working with Taige Weir, assisting his partner with her fledgling pre-training business, when he took his willingness to help a step too far. An accomplished horseman who breaks in young stock for Weir at their Ballarat property, charging $2500-$3000 an animal, he attended the William Inglis Yearling Sales in Oaklands with his girlfriend on March 4 this year. While there, he registered his name with the auction house, bid successfully on the 12-month-old Doubtland filly and then used his bank account to settle the $20,050 bill – $14,000 for the horse and $6050 in fees. Unbeknown to Gordon, he was being watched by Racing Victoria integrity liaison officer Frank De Rango.\n\n“I followed them into the auditorium and was in close proximity as Gordon and Weir stood at the rear of the auditorium, adjacent to the auctioneer’s box,” De Rango said in evidence. “I then witnessed Gordon raise his hand and place a bid on lot 644. The bid was successful, and the relevant horse was knocked down to Gordon.” Taige Weir has ambitions to become a trainer. Credit: Jason South De Rango, who attended the sales in a regulatory role relating to ownership and syndication, then tipped off Racing Victoria stewards. They charged Gordon with breaking AR 116 – “a jockey is not permitted to own, take a lease or have any interest in a horse” – which carries a mandatory two-year disqualification. Stewards offered him a three-month ban if he agreed to an early guilty plea.\n\nWeir’s horse When stewards first approached Gordon on March 26, he claimed he was only trying to help his girlfriend. He said she wanted to buy a horse to kickstart her training career, but because she was short of funds it was “agreed we would have a look together, but I would purchase the horse with her”. Paperwork showed the Doubtland filly was not signed over to Weir until March 25 – three weeks after it was bought at the Inglis sales. Gordon was listed by Inglis as the “purchaser”. But Gordon insisted the horse was always Weir’s “to pre-train and do whatever she wants with it”.\n\nLoading “Maybe I should have transferred Taige the money, and she could have put her name down,” Gordon told stewards. “I just didn’t think anything of it.” Weir agreed. She said Gordon bid at the auction on her behalf because she “gets nervous”. “He obviously signed for it because the money was coming out of his bank account because he was helping me out,” she told stewards. “I obviously didn’t know there was a rule involved, and I don’t think Will did, either. Looking back, we wish that I had just done it myself.”\n\nGordon pleaded not guilty to the ownership charge, his legal counsel barrister Damian Sheales told the tribunal, because he was only ever acting as Weir’s agent. Sheales said Gordon always intended “that he would be repaid or reimbursed by Ms Weir”. Trying to help Racing Victoria’s integrity department wanted Gordon disqualified. “Irrespective of whatever arrangement or understanding he may have had with his partner, the fact is, he on this day purchased this horse and was the owner,” legal counsel Marwan El-Asmar said on behalf of stewards.\n\n“This idea of a jockey appearing as an agent at an auction and bidding completely undermines the integrity of the industry. And that’s why it doesn’t happen. I’ve never heard of a jockey bidding at an auction. Never.” But the tribunal found that Gordon was acting as Weir’s agent at all relevant times. Will Gordon rides in this year’s May carnival at Warrnambool. Credit: Getty Images “That period [of agency] embraces registering for the sale, bidding and purchasing the horse,” VRT chairman Judge John Bowman said. “As you said when interviewed by the stewards: ‘I was just trying to help my partner ... when she didn’t have the funds. I don’t see how that damaged anyone or anything’.”\n\nThe tribunal dismissed the charge, pursuant to AR 116, against Gordon. Gordon pleaded guilty to the lesser charge of being involved in the buying of thoroughbred bloodstock (AR 118), and while stewards again called for a three-month disqualification, the tribunal settled on a $2500 fine. Fit and proper Whether Gordon ever rides in a race for his partner or for his prospective father-in-law remains to be seen. Taige Weir is yet to apply for a trainer’s licence. Her father cannot reapply until the eve of next year’s spring carnival. But even then, he has hurdles to overcome.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-push-for-a-four-day-work-week-ahead-of-key-economic-summit/5oydcfhjv",
        "title": "Inside the push for a four-day work week ahead of key economic summit",
        "publish_date": "Wed, 13 Aug 2025 01:28:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Australian Council for Trade Unions (ACTU) is joining the call for a four-day work week to become standard across Australia.\n\n\n\n\n\nThe peak body for trade unions says that reducing working hours is key to boosting productivity while lifting living standards.\n\n\n\n\n\nIt says that alternatives can be offered where a four-day work week is not possible, such as adding more rostered days off, increasing available annual leave, and redesigning rosters. It expects a four-day work week model to maintain the same level of pay through the protection of current pay and conditions.\n\n\n\nACTU president Michele O'Neil said the move would ensure that all Australians would benefit from increased productivity and \"not just those with money and power\".\n\n\n\n\n\n\"Shorter working hours are good for both workers and employers,\" she said\n\n\n\n\n\nThe announcement follows the Reserve Bank's economic outlook on Tuesday, which downgraded the productivity outlook from 1 per cent to 0.7 per cent, meaning the economy will grow by less than previously anticipated over the next two years.\n\n\n\n\n\nThe ACTU wants its productivity solution on the table at Treasurer Jim Chalmers' three-day economic reform summit next week .\n\n\n\nAustralians are working longer hours\n\nSince COVID-19, working hours in Australia have increased. A report from the Productivity Commission found that the record growth in hours did not result in increased output. Instead, productivity slumped overall.\n\n\n\n\n\nThe four-day work week is one proposed solution to this. A 2023 study from Swinburne University examined 10 Australian companies trialling a four-day work week. They found that 70 per cent of the companies reported higher productivity. The 30 per cent that reported no gains found that productivity remained equal to pre-trial levels.\n\n\n\n\n\nAnother peer-reviewed study found that a four-day work week can boost employee satisfaction as well as productivity. A survey of 2,896 employees working four-day weeks in organisations across Australia, New Zealand, Canada, the United States, the United Kingdom and Ireland found shorter working weeks resulted in higher performance, a reduction in burnout, and better employee health and retention.\n\n\n\n'Shaking the tree for ideas'\n\nThe ACTU joins the Australian Manufacturing Workers Union and the Australian Nursing and Midwifery Federation, who are also calling for a shorter work week ahead of the productivity roundtable next week.\n\n\n\nTreasurer Jim Chalmers says next week's economic reform roundtable aims to \"shake the tree for ideas\" when it comes to boosting productivity. Source: AAP / Mick Tsikas But not all workplaces are wanting to move in the same direction. The Australian Financial Review reported that some major banks are shifting their approaches to work culture after Westpac chief executive Anthony Miller sent a memo in December last year outlining his expectation for staff to work \"every day, including Christmas Day\".\n\n\n\n\n\nWestpac is one of the corporate entities contributing to the economic reform roundtable next week.\n\n\n\n\n\nTreasurer Jim Chalmers told ABC Radio on Wednesday morning that the roundtable is about \"shaking the tree for ideas\".\n\n\n\n\n\n\"This economic reform roundtable is not to make decisions, it's to inform the government's decisions,\" he said.\n\n\n\n\n\n\"We have an ambitious agenda that we're focused on delivering.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/would-you-seek-contraceptive-advice-from-tiktok/0wpprl6nw",
        "title": "Would you seek contraceptive advice from TikTok?",
        "publish_date": "Tue, 12 Aug 2025 21:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"I got the Kyleena coil, like the teeny tiny - and it's so cute - and I was like just put it in me, at this point anything to stop me from being this cray cray girl and they were like okay, we will sort it for you. Went to the clinic and got it done, amazing. You don't even notice that it's there. The insertion was perfect. No pain, I've seen so many people being like 'it's the worst thing don't get it'. It changes your life, it changed my life.\"\n\n\n\n\n\nSome for it..\n\n\n\n\n\n\"What I wish I knew before getting off hormonal birth control ten years ago. In case you don't know, my name is Evelyn and I'm holistic coach helping conscious women reclaim their bodies and take back control of their hormone health and fertility. So let's get into it, the first thing I wish I knew was that all of the problems that I had prior to going on birth control, like the hormonal acne and really painful periods, were all going to come back, and probably ten times worse than before.\"\n\n\n\n\n\n... and some against it.\n\n\n\n\n\nThe debate on birth control rages on TikTok.\n\n\n\n\n\n\"I'm an OBGYN and I'm going to tell you the worst form of birth control. Get ready to take notes, cause you can't miss this. The number one worst form of birth control is, the one that doesn't work for you. So while an IUD may be highly effective - if you don't want it or you don't like it, that's not good for you. Birth control pills work really well if you take them perfectly but if you can't remember how to take a pill every day, that's not going to work for you. The best form of birth control is the one that you want that works for your lifestyle and that you can access.\"\n\n\n\n\n\nThat's Dr Jennifer Lincoln from Portland, in the US state of Oregon, speaking in a 2023 TikTok video.\n\n\n\n\n\nResearch by La Trobe University analysed 100 TikTok videos on contraceptive health between August and September 2023 with the hashtags #birthcontrol, #contraception, #thepill, #naturalbirthcontrol and #cycletracking.\n\n\n\n\n\nThe researchers acknowledge the study is constrained by limitations including a potential for selection bias, the relatively small sample size, and the inclusion of English-language only videos.\n\n\n\n\n\nEven so, during that period those videos had collectively gained nearly five (4.85) billion views and 14.6 million likes.\n\n\n\n\n\nAccording to the study, published in the journal Perspectives on Sexual and Reproductive Health, only 10 per cent of the videos sampled were created by medical professionals.\n\n\n\n\n\nThe researchers found more than half - 53 per cent - of TikTok content creators clearly rejected hormonal birth control, while about a third - 34 per cent - expressed distrust in health professionals.\n\n\n\n\n\nMegan Bugden is the La Trobe report's co-author and a lecturer in public health.\n\n\n\n\n\nShe says a lot of the advice given on Tik Tok is based on personal experience and beliefs rather than medical advice or evidence.\n\n\n\n\n\n\"So there's a real opportunity for public health practitioners to join these platforms and disseminate accurate, reliable, non-judgemental content that's easily accessible to a huge range of individuals. We need to be partnering with trusted online voices that have this huge reach with young people and ensure that they're getting access to non-biased information that is informing their contraceptive beliefs and therefore then decision making.\"\n\n\n\n\n\nShe adds while videos by health professionals gained on average more likes and followers, TikTok’s algorithms amplify influencers’ voices, giving them greater reach than it gives medical experts.\n\n\n\n\n\nMs Budgen says most of the influencers they analysed were explicitly endorsing natural birth control methods, methods known as 'fertility awareness'.\n\n\n\n\n\n\"A good example of why these videos are unreliable or what makes them ineffective on their own can be seen in some of the trends that we saw around a growing desire for a hormonal-free form of contraception.\"\n\n\n\n\n\nBut she says the videos failed to disclose any potential limitations, which can include motivation, partner cooperation and biological variabilities.\n\n\n\n\n\nThe La Trobe lecturer in public health says what's worrying is that it will mislead a large proportion of young people by over-emphasising the reliability of the method - failing to discuss the potential risks of unplanned pregnancy or STIs.\n\n\n\n\n\nShe says social media is reshaping health care providers’ relationships with patients.\n\n\n\n\n\n\"It's really important that young people understand that a lot of the information online can be misleading or incomplete or biased. And so I would always encourage individuals to think about where the information's coming from. Always ask what could be informing that person's opinion. Has the uploader included any additional resources where you can go and find extra information or any evidence that supports the claims that they're making.\"\n\n\n\n\n\nThe study notes TikTok offers an excellent public health opportunity to disseminate accurate contraceptive information accessible to all individuals, regardless of their background or resources.\n\n\n\n\n\nMs Budgen says with TikTok’s widespread reach, women’s and public health organisations also have a significant role to play in countering misinformation.\n\n\n\n\n\nBut she urges people to seek credible contraceptive advice - that just because someone says they're a doctor or wears a lab coat, it doesn't mean they can be trusted.\n\n\n\n\n\n\"Always ask your medical practitioner as well. Go in and have a discussion around some of the ideas you've seen online and ask how credible they are and how reliable they are, and ask them for evidence. You can always ask your GP for the clinical guidelines relating to any sort of medical recommendation that they're suggesting.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/some-people-with-disability-feel-silenced-by-this-law-now-theres-a-fresh-push-for-change/l9mevdl4y",
        "title": "Some people with disability feel 'silenced' by this law. Now there's a fresh push for change",
        "publish_date": "Tue, 12 Aug 2025 19:42:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Members of Victoria's parliament are being urged to support proposed changes to a law that prevents some people with disability from speaking freely and publicly about their experiences.\n\n\n\n\n\nThe Greens are set to introduce a bill to parliament today, alongside disability advocate Uli Cartwright, seeking to amend the 'gag law' — known as clause 37 — affecting those under guardianship or administration orders.\n\n\n\n\n\nCartwright has long advocated for reform of this law based on his lived experience of such orders.\n\n\n\n\n\n\"It's just outdated. It needs to be changed,\" he told SBS News.\n\n\n\n\n\nIn Australia, guardianship laws vary state to state but gag laws, which restrict public comment on such arrangements, are enforced across most jurisdictions.\n\n\n\nREAD MORE Nicole was seeking justice. She says her disability was used to discredit her in court\n\nFor many Australians currently or formerly subject to guardianship, including Cartwright, this limits their ability to speak openly about their experiences.\n\n\n\n\n\nThe move by the Greens seeks to change that in Victoria. The proposed amendment adds to calls of support from disability sector organisations, along with the Victorian Office of the Public Advocate — the state body responsible for advocating for the rights of people living with disability — which backed amending the legislation in 2023.\n\n\n\n\n\n\"Not only are we listening to advocates in the sector, but the Office of Public Advocate has also made their position pretty clear on this exact reform,\" Greens MP Anasina Gray-Barberio said.\n\n\n\n\n\n\"We need to be ensuring that legislation as it stands does not constrain the rights of people with a disability.\"\n\n\n\nWhat is clause 37?\n\nIn Australia, a person may be placed under guardianship or administration orders if they require help with decision-making.\n\n\n\n\n\nAn appointed guardian then has legal authority to make decisions or support decision-making on behalf of an individual about personal and lifestyle matters specified in an order. An administrator is someone granted authority over financial and property matters.\n\n\n\n\n\nIn Victoria, the so-called gag law refers to clause 37 in schedule 1 of the Victorian Civil and Administrative Tribunal (VCAT) Act 1998, which states that, \"unless the Tribunal orders otherwise\", a person must not publish or broadcast information that could identify parties involved in guardianship and administration proceedings.\n\n\n\n\n\nThe tribunal may make an order, \"only if it considers it would be in the public interest to do so\".\n\n\n\nThe Greens' proposed amendment is set to be introduced to parliament in Victoria on Wednesday. Source: AAP / Con Chronis This provision can effectively stop people from talking publicly about any of their experiences of guardianship or administration orders. This can also extend to VCAT proceedings, according to a spotlight paper published by the Victorian Law Reform Commission (VLRC) in February.\n\n\n\nIn a letter to Victorian MPs, the state's peak advocacy organisation for adults with intellectual disability, VALID, said the \"unnecessary restriction\" is applied automatically and \"assumes the need to protect people with disabilities\".\n\n\n\n\n\n\"Their will and preference is not taken into account,\" the letter reads.\n\n\n\n\n\n\"It contradicts human rights principles, undermines transparency and public trust and curtails free speech.\"\n\n\n\nSBS News is investigating experiences of guardianship in Australia. Have you got a story to share?\n\nGet in touch at investigations@sbs.com.au or securely contact Emma Brancatisano at emmabrancatisano.journalist@protonmail.com .\n\nGray-Barberio said the current legislation has a \"silencing impact\" on those under guardianship or administration orders.\n\n\n\n\n\n\"It is so important for them to be able to have choice and control when it comes to their decision-making, to publicly share their lived experience and stories related to their guardianship. I think that is within public interest,\" she said.\n\n\n\n\n\n\"People living with disability or with chronic health [conditions] shouldn't have to ask for permission to tell their own story and lived experience.\"\n\n\n\nTelling Uli Cartwright's story\n\nCartwright, 30, is an advocate who lives with disability. He came up against the gag law several years ago when a documentary about his life became subject to it.\n\n\n\n\n\nLife is a Battlefield was acquired by SBS and broadcast in December 2021 as part of the International Day of People with Disability, after which it was available online via SBS' streaming service On Demand.\n\n\n\n\n\nTwo weeks after it screened, VCAT raised concerns relating to Cartwright having identified himself as someone previously under the control of the State Trustees. SBS decided to take the program down to allow legal concerns to be addressed.\n\n\n\nUli Cartwright has been a long-standing advocate for reform. Credit: Otis Filley Cartwright applied to VCAT for a declaration that clause 37 did not apply in his case, with a tribunal deputy president making an order allowing the material to be published. This meant the documentary could go back online, and Cartwright could be legally identified.\n\n\n\n\n\nCartwright has been advocating for reform in Victoria ever since.\n\n\n\n\n\nMost states and territories in Australia, except the ACT, ban the publication of information about guardianship proceedings in some way, according to the VLRC paper. This varies state by state, with Tasmania introducing changes last September.\n\n\n\n\n\nAmong the recommendations from the Disability Royal Commission was that states and territories should amend their laws to \"repeal provisions prohibiting publication of material identifying a party to the proceedings as the default position\".\n\n\n\nThe Victorian private member's bill, backed by Cartwright, proposes an amendment to clause 37 of the Act, which allows a represented person, or someone authorised by them, to disclose information about their proceedings without requiring tribunal approval.\n\n\n\n\n\n\"I think there is a place for it [the gag provision],\" Cartwright said.\n\n\n\n\n\n\"I do believe that there needs to be some protections in place to stop abuse and weaponisation of people's stories, whether that's with the media or with family members.\n\n\n\n\n\n\"But the bill says the silence mechanism is not the default. It's an extra step.\"\n\n\n\n\n\nThe Greens' Gray-Barberio said the change would ensure a \"human rights approach\" to legislation in the state.\n\n\n\n'Simply the right thing to do'\n\nIn a letter to Victoria's parliament on 6 August, VALID's chief executive Fionn Skiotis called on all members to support the upcoming bill.\n\n\n\n\n\n\"Provisions to protect privacy and limit the disclosure of sensitive and personal information, for example by parties other than the person subject to an order, will continue to exist,\" Skiotis said.\n\n\n\n\n\n\"In our view, supporting this change is simply the right thing to do, for any elected representative in Victoria, so that all citizens in the state can enjoy the same freedoms and rights, whether they are a person with disability or not.\"\n\n\n\nLISTEN TO Advocates 'devastated, disappointed' with government's disability royal commission response SBS News 04:07 English\n\nIt follows disability service providers Yooralla and Life Without Barriers supporting gag law reform in Victoria in late 2023.\n\n\n\n\n\n\"Freedom for people with disability to speak with the media and share their experiences under guardianship is an important step in transparency and accountability and can contribute to safeguarding by individuals and organisations responsible for providing safe and quality support,\" Life Without Barriers said in a statement.\n\n\n\n\n\nYooralla said current legislation is at odds with decision principles in the Guardianship and Administration Act 2019, which state that a person’s will and preference should only be overridden to prevent serious harm.\n\n\n\n\n\n\"While safety and privacy are a factor, the Act conflicts with the United Nations Convention on the Rights of People with Disability, which provides the rights of people with disability to freedom of expression and opinion and the participation in political and public life,\" its statement said.\n\n\n\nIn April 2023, the Office of the Public Advocate (OPA) also voiced support for reform.\n\n\n\n\n\nThe OPA recognised there are \"valid reasons\" to limit the disclosure of sensitive and personal information discussed in guardianship and administration proceedings to protect the privacy of those under orders.\n\n\n\n\n\nBut it said these should ensure the person's right to tell their own story is not inadvertently limited.\n\n\n\n\n\nIt called on the government to amend the legislation, saying: \"Ensuring people can freely tell their own stories will increase transparency and promote public trust in this essential safeguarding system.\"\n\n\n\n\n\nGray-Barberio said there has been \"no progress\" in reform since 2023.\n\n\n\nThis is one small section which we feel is really important, that we feel the government should recognise.\n\n\"The evidence is there, the calls are there from the community, from advocates, campaigners, as well as the Office of the Public Advocate. So really, it makes sense for them [the government] to come on board and support this reform,\" she said.\n\n\n\n\n\nThe Victorian government has been contacted for comment.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/federal-court-finds-apple-and-google-engaged-in-anti-competitive-conduct/ig5i6zl7u",
        "title": "Federal Court finds Apple and Google breached Australian competition laws",
        "publish_date": "Tue, 12 Aug 2025 11:41:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tech giants Apple and Google have been found to have engaged in anti-competitive conduct, paving the way for a payout that could be worth hundreds of millions of dollars.\n\n\n\n\n\nEpic Games, the developer of popular online game Fortnite, sued the two tech giants in the Federal Court, claiming they engaged in anti-competitive and unconscionable conduct against those developing apps distributed through iOS and Android devices.\n\n\n\n\n\nThe lawsuit was launched after Epic was booted from Apple's App Store and Google's Play Store after attempting to introduce its own payment system into Fortnite games in August 2020.\n\n\n\n\n\nOn Tuesday, Justice Jonathan Beach found Apple and Google had breached Australia's competition laws, upholding key elements of Epic's case.\n\n\n\n\n\nApple had a \"substantial degree of market power\" because of the restrictions placed on in-app payment systems and the distribution of iOS-compatible apps, he said.\n\n\n\nJustice Jonathan Beach said Apple had a \"substantial degree of market power\" because of the restrictions placed on in-app payment systems and the distribution of iOS-compatible apps. Source: AAP / AP/Patrick Semansky Google also had a significant degree of market power and was the predominant supplier of Android apps, the court was told.\n\n\n\n\n\nThe tech companies' dominance had the effect of substantially lessening competition and breached Australia's competition laws, Beach found.\n\n\n\n\n\nHowever, he rejected Epic's argument Apple had engaged in unconscionable conduct.\n\n\n\n\n\nBeach also found in favour of a class action lawsuit comprising Australian developers and gamers who claimed Apple and Google's monopolistic practices led to inflated prices.\n\n\n\n\n\nThe app developers had to pay higher commissions than they otherwise would have if there were more competition in the market.\n\n\n\n\n\nLawyers for the plaintiffs welcomed the result as a significant win for consumer rights and digital fairness that could have global implications for how digital platforms operate.\n\n\n\nEpic Games is the developer of popular online game Fortnite. Source: AAP / Bianca de Marchi \"This judgment is a turning point,\" said Kimi Nishimura from Maurice Blackburn Lawyers. \"It sends a clear message that even the most powerful corporations must play by the rules and respect the rights of consumers and developers alike.\"\n\n\n\n\n\nThe lawyers said the decision could result in \"one of the largest class action payouts in Australian legal history with potential compensation of several hundreds of millions of dollars to come from two global corporate Goliaths\".\n\n\n\n\n\nThe parties have been given time to consider the 2,000-page judgment and will return to the Federal Court at a later date to determine compensation and directives aimed at increasing transparency.\n\n\n\n\n\nA Google spokesperson said the company disagreed with the court's characterisation of its billing policies and practices and would review the full decision.\n\n\n\nA Google spokesperson said the company disagreed with the court's characterisation of its billing policies and pratices. Source: Getty / NurPhoto Apple welcomed the \"rejection of some of Epic's claims, however, we strongly disagree with the court's ruling on others\".\n\n\n\n\n\nEpic Games took to social media to herald the result and say Fortnite would return to iOS soon.\n\n\n\n\n\n\"A federal judge just found that Apple and Google both engaged in anti-competitive conduct,\" the company wrote.\n\n\n\n\n\n\"Another HUGE Win for Epic Games!\"\n\n\n\n\n\nEpic won a separate US case against Google in 2023 after a jury found it had engaged in anti-trust conduct through the Google Play Store.\n\n\n\n\n\nIt was less successful in its case against Apple, although the court found the tech giant had engaged in anti-competitive conduct.\n\n\n\n\n\nApple has also been forced to implement changes to its App Store in Europe, including allowing third-party payment systems.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/rodeo-showcasing-young-first-nations-riders/ro8v8o9hp",
        "title": "Rodeo showcasing young First Nations riders",
        "publish_date": "Tue, 12 Aug 2025 10:44:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "Rodeo showcasing young First Nations riders\n\nPublished 12 August 2025, 9:24 am\n\nRiders have travelled from across Australia to compete in this year's Mount Isa Indigenous Rodeo in outback Queensland. The annual event looks to provide opportunities to emerging First Nations riders, who are hoping to bring home a win.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/japanese-ultrarunner-begins-australian-leg-of-five-continent-running-challenge/8dl5z1ek3",
        "title": "Japanese ultrarunner begins Australian leg of five continent running challenge",
        "publish_date": "Tue, 12 Aug 2025 10:12:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/rba-interest-rate-mortgage/lkhlwdlxb",
        "title": "What the RBA's interest rate decision means for your mortgage",
        "publish_date": "Tue, 12 Aug 2025 08:03:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank's interest rate cut will be felt as good news for millions of mortgage holders across the country.\n\n\n\n\n\nThe RBA announced a reduction in the cash rate by 0.25 percentage points from 3.85 per cent to 3.6 per cent. It marks the third rate cut this year, following similar reductions in February and May.\n\n\n\n\n\nRBA governor Michele Bullock acknowledged the cut comes as \"households are still feeling the pain of higher costs\".\n\n\n\n\n\n\"The board will keep doing what it needs to do to keep inflation down and maintain a healthy jobs market because when inflation is low and stable and people can get jobs; it's good for households, it's good for the community, and it's good for the broader Australian economy.\"\n\n\n\nTreasurer Jim Chalmers said the decision was \"welcome relief\" for borrowers and would \"put more money in the pockets of people who are under pressure\" .\n\n\n\n\n\nSo how much will mortgage holders save?\n\n\n\nHousehold savings on the way\n\nAccording to financial comparison website Canstar, mortgage holders with a $500,000 loan can expect to save around $74 per month. This estimate is based on an owner-occupier paying principal and interest with 25 years remaining on the mortgage.\n\n\n\n\n\nThose with higher mortgages, up to $1 million, can expect to save around $148 per month.\n\n\n\n\n\nIncluding the two previous rate cuts in February and May, the accumulated savings are even higher. Those with a $500,000 loan could potentially save $226 per month, while those with a $1 million loan could save up to $453 per month.\n\n\n\nSource: SBS News\n\nWill the banks pass the savings on?\n\nA number of banks have promised to pass the rate cut in full to customers.\n\n\n\n\n\nFor Westpac customers, a -0.25 per cent rate adjustment will be passed on for variable interest rate home loans from 26 August.\n\n\n\n\n\nThe Commonwealth Bank says its cuts will come into effect on 22 August. Macquarie Bank announced its variable rates will be reduced as of 15 August.\n\n\n\n\n\nANZ and NAB have followed suit. Around 20 lenders also cut their variable rate ahead of the RBA's announcement.\n\n\n\nA number of major banks have promised to pass on the rate cut in full to customers. Source: AAP / Rick Rycroft Diana Mousina, deputy chief economist at AMP, urges caution as not all mortgage holders will be eligible for an automatic reduction.\n\n\n\n\n\n\"There's not this automatic reduction to mortgage rates just because of what the RBA does. It may take a few months for it to actually get passed through to mortgage repayments.\"\n\n\n\nPaying more now to save later\n\nCanstar data insights director Sally Tindall suggests that some mortgage holders may benefit from keeping their repayments the same.\n\n\n\n\n\n\"For those managing to hold their budgets together, consider keeping your repayments exactly the same,\" Tindall said.\n\n\n\n\n\n\"Every rate cut is another opportunity to invest back into your mortgage and potentially be debt-free months, if not years early.\"\n\n\n\nIf a mortgage holder who was sitting on a $600,000 loan in February kept their repayments steady, they would be paying $272 more per month in repayments than if they had lowered them to the minimum rate.\n\n\n\n\n\nBut it would also mean shaving off three years and three months from the length of their mortgage.\n\n\n\n\n\nUltimately, Tindall urges mortgage holders to weigh up what is best for them.\n\n\n\nA good time to talk to the bank\n\nMousina says, despite the cut announcement, mortgage holders are still paying more than they were a few years ago .\n\n\n\n\n\n\"Ultimately, any sort of rate cut can still be seen as relief, but given that rates were hiked so much it's just taking some of that increased pressure away. Mortgage holders are still paying more than they were a few years ago.\"\n\n\n\n\n\nMousina says that it's important to figure out if your current mortgage is appropriate for you.\n\n\n\n\n\n\"You want to make sure your variable rate is the lowest you can have.\"\n\n\n\n\n\nTindall says that after this rate cut, ambitious owner-occupiers should be able to set themselves a stretch target of 5.25 per cent.\n\n\n\n\n\n\"Your mortgage rate is one number where you want to be aiming for well below average.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-the-rbas-august-interest-rate-cut-means-for-you-and-markets/3hmlyvso9",
        "title": "What the RBA's August interest rate cut means for you and markets",
        "publish_date": "Tue, 12 Aug 2025 07:24:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/reserve-bank-cuts-interest-rates-as-expected-evening-news-bulletin-12-august-2025/81nyefu32",
        "title": "Reserve Bank cuts interest rates as expected | Evening News Bulletin 12 August 2025",
        "publish_date": "Tue, 12 Aug 2025 06:00:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nThe Reserve Bank delivers another cut to interest rates;\n\nThe Opposition says the PM's 'out of his depth' on the Palestinian statehood decision;\n\nDonnell Wallam returns to Australia for the Super Netball league.\n\nThe Reserve Bank has delivered a widely expected cut to the official cash rate.\n\n\n\n\n\nThe cut of 0.25 per cent is the third drop in the last six months and brings the interest rate down to 3.6 per cent.\n\n\n\n\n\nEconomists were expecting the change on the back of the latest inflation data.\n\n\n\n\n\nTreasurer Jim Chalmers says he's not surprised by the decision - and that the government can take full credit for paving the way.\n\n\n\n\n\n\"For the first time in almost two decade, we've seen three interest rate cuts in a calendar year with the unemployment rate still lower than 5 per cent. That gives you a sense that here in Australia, we've been able to get inflation down, we're seeing interest rates come down three times in six months, and at the same time as we have maintained historically low unemployment as well.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe leader of the Opposition says the Prime Minister is out of his depth in deciding that Australia will recognise a Palestinian state.\n\n\n\n\n\nSussan Ley has told 2GB Radio that the Coalition's position is recognition should come at the end of a peace process with Israel - and that doing it while Hamas is still fighting in Gaza makes it harder to achieve a two-state solution, and damages our relationships with allies.\n\n\n\n\n\n\"It dismisses that relationship in an appalling way, our friends, our allies. And most importantly it is disrespectful of the relationship with the U-S. Because any peace that happens in this region will be brokered by the U.S. And the prospects of a ceasefire are not good with this decision. The prospects take a step backwards.\"\n\n\n\n\n\nBut Foreign Minister Penny Wong says the Australian government has made a considered decision that now is the best time for Australia to contribute to the momentum for a two-state solution.\n\n\n\n\n\nShe has told Sky News that recognition could also be used to isolate Hamas, who the Minister says should have no role in governing Gaza.\n\n\n\n\n\n\"Success is not guaranteed, but success never comes from just doing the same thing over and over again and hoping for a different outcome. And that's the judgement countries of the world, including Australia, are making.\"\n\n\n\n\n\n.\n\n\n\n\n\nA date for the by-election in the New South Wales seat of Kiama has been announced.\n\n\n\n\n\nState Parliament speaker Greg Piper has confirmed the election will be held on September 13.\n\n\n\n\n\nThe previous MP Gareth Ward resigned on Friday as the parliament was preparing to vote to expel him after his conviction for sexual and indecent assault offences.\n\n\n\n\n\n.\n\n\n\n\n\nTropical reefs off the coast of Western Australia have suffered the worst coral bleaching ever recorded.\n\n\n\n\n\nIn the latest data collected by scientists, conditions have worsened across parts of the 1,500 kilometres of tropical reefs offshore.\n\n\n\n\n\nAreas including Ningaloo and north Kimberley, which have been rarely affected before, have recorded heavy losses on the back of record sea surface temperatures around Australia last summer which were the warmest on record.\n\n\n\n\n\nDr James Gilmour, from the Australian Institute of Marine Science, says the heat stress was more intense and widespread than previously.\n\n\n\n\n\n\"What we've seen is temperatures have increased by a degree or up to four, and that has remained for several months, so it is really that cumulative heat stress that have caused corals to bleach, and in some instances, to cook and die.\"\n\n\n\n\n\n.\n\n\n\n\n\nWashington DC officials have moved to reassure residents after the deployment of 800 National Guardsmen to the city, on the orders of US President Donald Trump.\n\n\n\n\n\nThe Trump administration has also temporarily taken over the city's police department in an extraordinary assertion of presidential power in the nation's capital.\n\n\n\n\n\nThe president says his actions are necessary to save the city from what he has described as a wave of lawlessness.\n\n\n\n\n\nMayor Muriel Bowser says there is no justification for what Trump has done.\n\n\n\n\n\n\"We don't believe or believe it's legal to use the American military against American citizens on American soil. I'm not a lawyer. And so but I think that's a fairly widely held fact. And so but we've seen them move, I think, the active military into California.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe military government in Mali has started to return home the historic manuscripts of Timbuktu, which were spirited out of their fabled northern city when it was occupied by al-Qaida-linked militants more than a decade ago.\n\n\n\n\n\nThe majority of the documents dating back to the 13th century were saved by the devotion of the Timbuktu library's Malian custodians, who carried them out of the occupied city in rice sacks, on donkey carts, by motorcycle, by boat and four-wheel drive vehicles.\n\n\n\n\n\n.\n\n\n\n\n\nTo sport and in netball news,\n\n\n\n\n\nDonnell Wallam is returning to Australia to play for the Sunshine Coast Lightning in the Super Netball League next year.\n\n\n\n\n\nShe has spent the last year in New Zealand.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/rba-announces-interest-rate-cut-august/rh3gqkhp8",
        "title": "'Welcome relief': Banks pass on cuts, as Reserve Bank lowers interest rate to 3.6 per cent",
        "publish_date": "Tue, 12 Aug 2025 04:30:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "All of Australia's 'big four' banks have vowed to pass on the 0.25 percentage point rate cut handed down by the Reserve Bank of Australia, after it announced a reduction in the cash rate from 3.85 to 3.6 per cent.\n\n\n\n\n\nCommonwealth Bank and Westpac were the first of the big four to announce they would pass the cut on in full to customers, with ANZ and NAB following. Macquarie also announced it would pass on the cut in full.\n\n\n\n\n\nTreasurer Jim Chalmers said the widely anticipated decision was \"welcome relief\" for borrowers and would \"put more money in the pockets of people who are under pressure\".\n\n\n\n\n\nChalmers said Australians could thank themselves for lowering inflation but acknowledged that a cut to the official cash rate \"won't solve every problem we have in our economy\".\n\n\n\n\n\nIt marks the third interest rate cut of the year, following similar reductions in February and May.\n\n\n\nTuesday's announcement marks the third interest rate cut this year. Source: SBS News In July, the RBA board surprised the market by voting 6-3 to hold rates steady as it waited for the Australian Bureau of Statistics' June quarter inflation figures .\n\n\n\n\n\nThose figures, released in late July, showed annual inflation easing from 2.4 to 2.1 per cent . June labour figures also showed unemployment had risen to 4.2 per cent, another precondition for reducing interest rates.\n\n\n\n\n\nMy Bui, an economist at financial services firm AMP, told SBS On the Money podcast the announcement is \"pretty much no surprise\".\n\n\n\n\n\nShe said the RBA economic outlook, also released today, points to more rate cuts in the coming months.\n\n\n\n\n\n\"The RBA still sees the unemployment rate peaking slightly higher from now as well as inflation sustainably landing in the midpoint of the target, so for me that's a sign of more rate cuts to come,\" she said.\n\n\n\nMeanwhile, some economists have criticised the central bank's decision to wait until August to announce the cut.\n\n\n\n\n\nDiana Mousina, deputy chief economist at AMP, said: \"I think it's the rate cut we didn't get in July.\"\n\n\n\n\n\n\"I don't think the Reserve Bank should have waited and caused disappointment, and also caused confusion in the markets.\"\n\n\n\nThreat of trade war easing\n\nIn a press conference announcing the decision, RBA governor Michele Bullock rejected questions about whether the board's rate-setting was restrictive.\n\n\n\n\n\n\"The board will keep doing what it needs to do to keep inflation down and maintain a healthy jobs market because when inflation is low and stable and people can get jobs, it's good for households, it's good for the community and it's good for the broader Australian economy,\" she said.\n\n\n\n\n\nThe RBA also pointed to global uncertainty caused by United States President Donald Trump's tariffs on the global economy .\n\n\n\nRBA governor Michele Bullock says global economic uncertainty remains even though the immediate threat of a trade war is easing. Source: AAP / Yuri Gripas \"The global outlook remains unpredictable even though it seems that the risk of a more damaging, widespread trade war has eased a bit.\"\n\n\n\n\n\nHowever, Bullock said the central bank still expected both global and domestic growth to slow over the rest of the year and into 2026 .\n\n\n\n\n\n\"We don't have a point estimate for where we might end up. You'll note in the forecasts we have inflation coming back down to target and the unemployment remaining where it is, with a couple more cash rate cuts in there. That's the best sort of guess. But things can change.\"\n\n\n\n\n\nThe board reiterated its commitment to maintaining full employment and price stability, though acknowledged that weak demand from consumers could lead to job losses.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/lockyer-excited-to-see-hunt-control-broncos-20250813-p5mmmj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lockyer 'excited' to see Hunt control Broncos",
        "publish_date": "Wed, 13 Aug 2025 12:09:02 +1000",
        "category": "sports",
        "authors": [],
        "text": "Lockyer 'excited' to see Hunt control Broncos\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/what-drives-the-human-instinct-to-create-art-20250804-p5mka8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What drives the human instinct to create art?",
        "publish_date": "Wed, 13 Aug 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Gabriella Coslovich"
        ],
        "text": "Others include the uncompromising Mike Parr, known for his confronting performance art, in a fascinating essay about Parr’s collaboration and eventual falling-out with master printer John Loane. Another beautifully observed essay, “The House at Glenorie”, explores the relationships between lauded architect Glenn Murcutt and artists Sydney Ball and Lynne Eastaway, for whom he designed a house in the middle of the bush at the titular Glenorie, about an hour north-west of Sydney.\n\nThe effect is one of discovery, or rediscovery, of contemporary artists worthy of our attention such as Gill, who represented Australia at the Venice Biennale in 2013 (her artwork is on the book’s cover).\n\nIn a bold editorial (and marketing) move, the book’s 12 essays are not named after the artists they cover (apart from the essay on Indigenous artist the late Mirdidingkingathi Juwarnda Sally Gabori). Instead, the essays are given more cryptic titles, such as “The World is Made of Layers” (on Vivienne Binns), that relate in some way to the artists’ attitudes or work.\n\nSprague situates himself in the essays as he visits the artists at their homes and studios and reflects on the conversations they have about art (apart from Gabori, whom he met only briefly, and Helen Maudsley, who was not available for interview). He is a searching and solemn writer, but on no occasion cynical. Even when he is not particularly keen on an artist’s work – and he admits that he doesn’t love Gabori’s – he seeks to understand it. An art-school graduate and former artist who has worked as a curator and arts co-ordinator, Sprague continues to place art “somewhere close to the centre of my life”, and it’s this that gives his writing an unusual empathy.\n\nCritic Quentin Sprague. Credit: Ross Coulter\n\nAs Sprague explains in the introduction, his love of art was piqued as a child when his single mother would take him and his sister on the 300-kilometre round-trip from their home in Monaro, regional New South Wales, to the National Gallery of Australia in Canberra, leaving at dawn in the family’s “twin-cab Kombi utility”.\n\n“It was visits to the National Gallery of Australia that truly imprinted on my young consciousness,” he writes. He compares the “quiet awe – enveloping, gentle, deadly serious” of the gallery atmosphere back then to the galleries of today, which can sometimes seem as “mere extensions of some vast industrial entertainment system”.\n\nWhat Artists See is a counter to that “vast industrial entertainment system”; the pace is unhurried, reflective and psychologically probing – although at least one of the artists, abstract painter Karl Wiebke, seems to grow slightly impatient with Sprague’s insistent need to find the “lesson” in his art. Sprague hopes that “Wiebke might arrive at an overarching definition of his work”. But Wiebke is not interested in absolutes. If Sprague in this instance is guilty of over-complicating things, he is self-aware enough to recognise it: “If I was after the ‘lesson’ of his work, this was surely it: don’t expect a concrete revelation. Or, put another way, don’t expect for the puzzle to be solved.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/this-biography-does-fullest-justice-to-the-maddest-stories-imaginable-20250807-p5ml94.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This biography does fullest justice to the maddest stories imaginable",
        "publish_date": "Wed, 13 Aug 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Peter Craven"
        ],
        "text": "Frances Wilson has written about Thomas De Quincey and D.H. Lawrence and the Titanic. Now she has written about Spark with a brilliant recreative justice to the brilliant shot of lightning that illuminates everything Spark did, but also the formal brilliance of the work and the way it remained – in ways that are at once wacko and regally impressive – the imprint of a personality that was both magnificent and alarming.\n\nIt’s extraordinary the magnetism of Muriel Spark and the extent to which her work has such an extraordinary power of definition, even when it seems in its ravishing way minor and whole aspects of her life seem eccentric to the point of derangement. But this is the woman to whom the New Yorker devoted an entire issue which contained the text of The Prime of Miss Jean Brodie , subsequently made into a film starring Dame Maggie Smith and widely regarded as the greatest novella of the mid-20th century.\n\nWilson, who has a captivating analytical mind and an exceptional narrative power that goes along with it, tells the stories of how Spark ran the Poetry Society and the weird chaps (sometimes military gents) she had to fight again and again to gain control. If you’re going to read one work of criticism or critical biography this year read her: she’s some kind of genius.\n\nAnd she does the fullest justice to the maddest stories imaginable. At one point in the 1950s, Spark is not only sleeping with a fellow called Stanford, she’s sharing a journal with him – one that juxtaposes her cut-glass intensities with his smokey bombast. Then she becomes religious, embracing first Anglo then Roman Catholicism, and she is insistent that if they’re to keep up the sex he had better take on God. He won’t, but Spark (who has written a book about the Book of Job, The Only Question) does with great tolling bells on, while Stanford is possessive about her work.\n\nDame Muriel Spark in 1965.\n\nTogether, they edit Cardinal Newman’s wonderful sermons. Meanwhile, Spark, who is heavily into dexedrine – and who is at work on a life of Mary Shelley – gets it into her head that she is receiving secret coded messages from T.S. Eliot (who has just written The Confidential Clerk and was impressed by her review).\n\nSpark’s work goes from strength to strength even where it contains worlds within worlds as well as re-arranging the traditional hierarchies of leading men. There are devils and then there is Spark’s strange double act with Evelyn Waugh’s weird breakdown work The Ordeal of Gilbert Pinfold, which is full of parallel derangements to her own but which he celebrates with a generous blurb. It’s also the case that Graham Greene, who admired that uncanny panoramic coldness in Spark’s work and her command of the drama of introspection and self-annihilation, kept her alive with monthly cheques.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/the-type-of-negatively-geared-landlords-who-lose-the-most-money-20250808-p5mlif.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The type of negatively geared landlords who lose the most money",
        "publish_date": "Wed, 13 Aug 2025 11:58:41 +1000",
        "category": "finance",
        "authors": [
            "Caroline Zielinski"
        ],
        "text": "Paradoxically, such a proposal would not recoup as much money for taxpayers as removing deductions for single property investors, who ultimately cost the government more to subsidise. Loading The Australian Council of Social Services wants to phase out negative gearing entirely and halve the 50 per cent capital gains tax discount over five years. Meanwhile, the Grattan Institute recommends reducing the tax discount to 25 per cent and curbing negative gearing so that rental losses could no longer be offset against wage and salary income. Treasurer Jim Chalmers dismissed any changes to negative gearing or the capital gains tax discount in an interview on ABC News Breakfast on Thursday morning. He said the government was instead focusing on delivering more supply to help housing affordability. About 72 per cent of all investors own one property, ATO data shows, which some experts believe adds to rental insecurity. “Penalising large landlords and exempting small ones is a bad idea,” says Peter Tulip, chief economist at the Centre of Independent Studies.\n\n“Australia has a terrible problem with rental insecurity – huge numbers of people will have been evicted because their landlord has decided to sell the property. This is a much smaller problem in Europe or the United States, because their rental stock is owned by big corporations, who are happy for you to stay there for decades. “We have the wrong landlords, and ACTU wants to make that problem worse.” Treasurer Jim Chalmers has ruled out any changes to negative gearing or the capital gains tax in an interview with the ABC on Thursday. Credit: Oscar Colman Independent economist Saul Eslake says keeping negative gearing benefits to just one property would only affect 29 per cent of investors, meaning “most people who have a negatively geared property would continue to have it under the ACTU proposal”. Menzies Research Centre’s 2024 research found 18 per cent of negatively geared investors are trade union members, and 65 per cent of negatively geared residential property investors had a taxable income of $120,000 or less. Negative gearing is used by 27,600 nurses and 28,000 teachers.\n\nDavies says while it may be more politically palatable to target large investors, it would make more sense to remove negative gearing altogether. “If the goal is to make housing more affordable, this won’t make much difference to affordability,” he says. His 2024 paper argues that access to the tax breaks should be conditional on minimum five-year fixed-term leases, one rent increase and inspection per lease period, dwelling quality, and below-market rent. Tulip agrees that tax concessions for investors are unimportant to housing affordability. “Several good researchers have estimated their effect on affordability in different ways, and they find their effect is tiny – between 1 and 4 per cent.” He says there is scope for amendments to the investor taxes.\n\n“The 1999 Ralph Review suggested the capital gains tax discount to promote enterprise and risk taking, and my view is that applies more strongly to investment in shares or other business investment than real estate, where the huge capital gains accrued by landowners aren’t done so for any sacrifice or effort on their part,” he said. Loading Eslake says people should not be allowed to offset excess interest against their wage and salary income, and should instead “carry it forward as a deduction against the capital gains tax liability when they sell [their property].” He rubbished claims that eliminating negative gearing would make affordability worse. “If landlords were to sell their investment priorities, who would they sell to? First home buyers or other owner-occupiers trading up,” he says. “Yes, it would reduce the supply of rental housing, but it would also reduce the demand for rental housing by the same amount.” Eslake says, despite what they say publicly, politicians and most Australians don’t want the problem of housing affordability to be solved.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/wallabies-drop-major-surprise-as-o-connor-to-play-no-10-against-springboks-20250813-p5mmlt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wallabies drop major surprise as O’Connor to play No.10 against Springboks",
        "publish_date": "Wed, 13 Aug 2025 11:52:29 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Wallabies coach Joe Schmidt is set to pull a major surprise by selecting James O’Connor at No.10 for Australia’s opening Rugby Championship clash against South Africa in Johannesburg.\n\nO’Connor has not played a Test in nearly three years but is poised to wear the five-eighth jersey against the Springboks, according to informed sources speaking on the condition of anonymity as they did not have permission to discuss team selections.\n\nWith Noah Lolesio injured and Tom Lynagh out with a concussion, O’Connor will feature in his first international match since starting in the Wallabies’ 48-17 loss to Argentina in 2022 in San Juan.\n\nO’Connor, who had a strong season for the Crusaders, mostly off the bench, was initially on the outer with Schmidt but found himself parachuted into Australia’s squad for the Lions series after Lolesio went down with a neck injury.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/cba-profits-swell-to-10-25b-as-household-finances-improve-20250812-p5mma5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA shares tumble despite $10.25 billion profit",
        "publish_date": "Wed, 13 Aug 2025 11:50:24 +1000",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "Commonwealth Bank shares have slumped sharply despite its $10.25 billion profit, as analysts continued to question its high valuation and highlighted that its earnings had received a boost from lower bad debt charges.\n\nCBA, the biggest stock on the ASX, on Wednesday said cash profits rose 4 per cent to $10.25 billion for the year to June, as the banking giant benefited from growth in business loans and mortgages, while also posting lower bad debts.\n\nCBA CEO Matt Comyn. The high price of CBA shares has been an ongoing debate in the market. Credit: Oscar Colman\n\nThe high price of CBA shares has been an ongoing debate in the market, with CBA shares up close to 30 per cent in the past year. Investors dumped the stock on Wednesday, sending it 5.3 per cent lower by late morning.\n\nDelivering the full-year results on Wednesday, chief executive Matt Comyn said economic conditions had improved for many of its customers during the year, as household incomes rose due to interest rate cuts, tax cuts and lower inflation.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-trump-doesn-t-criticise-albanese-s-palestine-state-call-financial-relief-after-reserve-bank-cuts-interest-rate-20250813-p5mmh7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Unions push for four-day work week; Trump declines to criticise Albanese’s Palestine state call",
        "publish_date": "Wed, 13 Aug 2025 11:49:12 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "The removal of China’s hefty trade tariffs on Australian wine has helped Penfolds maker Treasury Wine Estates sell more than $2.9 billion worth of wine in the 2025 financial year, and grow overall profits by 15.5 per cent to $470.6 million.\n\nThe result was underpinned by demand in Asia for flagship brand Penfolds, sending net sales revenue in the region 19.1 per cent higher to $749.6 million. The luxury red wine is now responsible for nearly 62 per cent of the company’s total earnings before interest and taxes (EBIT). Price increases have also helped: net sales revenue per case has risen by 11.8 per cent.\n\nTreasury Wine Estates chief executive Tim Ford. Credit: Eamon Gallagher\n\nChina’s tariffs of up to 218 per cent imposed in November 2020 wiped nearly $80 million from the global wine giant’s earnings in the country, its most lucrative market.\n\nThis is the final set of results led by chief executive Tim Ford, who executed a major company pivot to focus on other global markets such as the rest of Asia and the US. Ford will depart Treasury Wine at the end of September following 14 years with the company and five at the top.\n\n“Penfolds has restored its position as a leader in the China wine market,” the global wine giant declared in investor documents to the ASX.\n\nBut Chinese wine-drinking habits are changing, the company said.\n\n“Since June there has been a shift in alcohol consumption behaviour as preferences and occasions evolve from large-scale banqueting to smaller scale business and lifestyle-oriented occasions.”\n\nFord said he was incredibly proud of the transformation delivered over the past five years.\n\n“While we continued to face headwinds in a number of markets, we remained laser-focused on executing our business plans, further strengthening the business for long-term growth,” he said in a statement.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/cba-posts-best-ever-profit-20250813-p5mmm7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA posts best-ever profit",
        "publish_date": "Wed, 13 Aug 2025 11:48:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "CBA posts best-ever profit\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/union-movement-to-push-for-four-day-work-week-at-economic-roundtable-20250813-p5mmig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Union movement to push for four-day work week at economic roundtable",
        "publish_date": "Wed, 13 Aug 2025 11:46:34 +1000",
        "category": "finance",
        "authors": [
            "Olivia Ireland"
        ],
        "text": "The union movement will push for a four-day workweek at the Albanese government’s economic round table next week in a bid to improve work-life balance.\n\nAustralian Council of Trade Unions president Michele O’Neil will cite academic research that argues businesses can achieve greater levels of productivity if the policy is implemented.\n\nThe four-day model would apply to industries where appropriate, and sector-specific alternatives would be suggested where it would not be feasible.\n\nPresident of the Australian Council of Trade Unions, Michele O’Neil, is pushing for a broader discussion about the four-day week. Credit: Alex Ellinghausen\n\nO’Neil’s push for the popular workplace policy will likely cause a clash between unions and employers on what the best approach will be to improve productivity.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/china-is-playing-the-long-game-to-win-its-war-with-trump-20250813-p5mmhp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "China is playing the long game to win its war with Trump",
        "publish_date": "Wed, 13 Aug 2025 11:44:00 +1000",
        "category": "finance",
        "authors": [
            "Karishma Vaswani"
        ],
        "text": "US President Donald Trump’s trade war was meant to rebalance global power in the United States’ favour. Instead, China is playing the long game, enduring short-term economic pain to shape any eventual deal to its advantage.\n\nThe strategy appears to be working — for now. On Monday, Washington granted Beijing another 90-day reprieve, extending a pause on tariffs through November 10. China announced it would do the same. Markets welcomed the move, which offered some relief after months of tension. The delay will give Chinese President Xi Jinping’s policymakers more time to plan their next move.\n\nTime is on Xi Jinping’s side. Credit: AP\n\nTime is Xi’s ally. So far, the clearest outcome of each round of talks has been a commitment to meet again. Despite Trump’s insistence that China has taken significant steps to improve their trade relationship, Beijing has made no consequential concessions on any of his key concerns. (China has offered some small compromises, none on the scale of American demands.)\n\nThe extension has come at a delicate time for China’s economy, which is plagued by sluggish domestic demand and a slowdown in the property sector. Bloomberg Economics says that it is among the few major nations without a clear timeline or terms for a deal, while others have struck agreements to secure lower tariffs. Even with this reprieve, it notes, Beijing faces average US tariffs of 40 per cent — almost 25 percentage points above the global average.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/a-jockey-bought-a-horse-for-darren-weir-s-daughter-he-faced-a-two-year-ban-20250806-p5mkuf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A jockey bought a horse for Darren Weir’s daughter. He faced a two-year ban",
        "publish_date": "Wed, 13 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Danny Russell"
        ],
        "text": "$20,050 bill Gordon was living and working with Taige Weir, assisting his partner with her fledgling pre-training business, when he took his willingness to help a step too far. An accomplished horseman who breaks in young stock for Weir at their Ballarat property, charging $2500-$3000 an animal, he attended the William Inglis Yearling Sales in Oaklands with his girlfriend on March 4 this year. While there, he registered his name with the auction house, bid successfully on the 12-month-old Doubtland filly and then used his bank account to settle the $20,050 bill – $14,000 for the horse and $6050 in fees. Unbeknown to Gordon, he was being watched by Racing Victoria integrity liaison officer Frank De Rango.\n\n“I followed them into the auditorium and was in close proximity as Gordon and Weir stood at the rear of the auditorium, adjacent to the auctioneer’s box,” De Rango said in evidence. “I then witnessed Gordon raise his hand and place a bid on lot 644. The bid was successful, and the relevant horse was knocked down to Gordon.” Taige Weir has ambitions to become a trainer. Credit: Jason South De Rango, who attended the sales in a regulatory role relating to ownership and syndication, then tipped off Racing Victoria stewards. They charged Gordon with breaking AR 116 – “a jockey is not permitted to own, take a lease or have any interest in a horse” – which carries a mandatory two-year disqualification. Stewards offered him a three-month ban if he agreed to an early guilty plea.\n\nWeir’s horse When stewards first approached Gordon on March 26, he claimed he was only trying to help his girlfriend. He said she wanted to buy a horse to kickstart her training career, but because she was short of funds it was “agreed we would have a look together, but I would purchase the horse with her”. Paperwork showed the Doubtland filly was not signed over to Weir until March 25 – three weeks after it was bought at the Inglis sales. Gordon was listed by Inglis as the “purchaser”. But Gordon insisted the horse was always Weir’s “to pre-train and do whatever she wants with it”.\n\nLoading “Maybe I should have transferred Taige the money, and she could have put her name down,” Gordon told stewards. “I just didn’t think anything of it.” Weir agreed. She said Gordon bid at the auction on her behalf because she “gets nervous”. “He obviously signed for it because the money was coming out of his bank account because he was helping me out,” she told stewards. “I obviously didn’t know there was a rule involved, and I don’t think Will did, either. Looking back, we wish that I had just done it myself.”\n\nGordon pleaded not guilty to the ownership charge, his legal counsel barrister Damian Sheales told the tribunal, because he was only ever acting as Weir’s agent. Sheales said Gordon always intended “that he would be repaid or reimbursed by Ms Weir”. Trying to help Racing Victoria’s integrity department wanted Gordon disqualified. “Irrespective of whatever arrangement or understanding he may have had with his partner, the fact is, he on this day purchased this horse and was the owner,” legal counsel Marwan El-Asmar said on behalf of stewards.\n\n“This idea of a jockey appearing as an agent at an auction and bidding completely undermines the integrity of the industry. And that’s why it doesn’t happen. I’ve never heard of a jockey bidding at an auction. Never.” But the tribunal found that Gordon was acting as Weir’s agent at all relevant times. Will Gordon rides in this year’s May carnival at Warrnambool. Credit: Getty Images “That period [of agency] embraces registering for the sale, bidding and purchasing the horse,” VRT chairman Judge John Bowman said. “As you said when interviewed by the stewards: ‘I was just trying to help my partner ... when she didn’t have the funds. I don’t see how that damaged anyone or anything’.”\n\nThe tribunal dismissed the charge, pursuant to AR 116, against Gordon. Gordon pleaded guilty to the lesser charge of being involved in the buying of thoroughbred bloodstock (AR 118), and while stewards again called for a three-month disqualification, the tribunal settled on a $2500 fine. Fit and proper Whether Gordon ever rides in a race for his partner or for his prospective father-in-law remains to be seen. Taige Weir is yet to apply for a trainer’s licence. Her father cannot reapply until the eve of next year’s spring carnival. But even then, he has hurdles to overcome.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/councils-plan-for-new-driver-charge-as-aussie-tourist-town-being-loved-to-death-010322443.html",
        "title": "Council's plan for new driver charge as Aussie tourist town being 'loved to death'",
        "publish_date": "2025-08-13T01:03:22Z",
        "category": "finance",
        "authors": [],
        "text": "Motorists could soon be charged to travel through a popular Queensland beach town as locals demand something be done.\n\nMotorists could soon be charged to drive through one of Australia's busiest beach towns after its surge in popularity in recent years has left roads congested and parking options scarce, with the local council hoping the proposed fees will act as a deterrent to tourists.\n\nQueensland's Noosa Heads has long been a popular holiday destination, and during peak times roads such as Hastings Street on the beachfront can quite literally come to a standstill. These traffic jams have irked locals, who have pushed the council for a solution, and Noosa Shire Council has been consulting on plans to introduce a charge for those travelling in congestion-prone hotspots.\n\nIt is unclear how much the congestion fee would be or how it would be collected. However, there are suggestions that toll booths would be installed along the road where drivers would have to stop and pay, or drivers could pay via a tag in their car, most likely on weekends and school holidays to begin with.\n\nMore paid parking would also be introduced in busy areas, with lower costs for residents, and more transport infrastructure would be introduced to deter tourists from driving their cars along busy roads.\n\nADVERTISEMENT\n\nThe Destination Management Plan (DMP) claimed the town is \"being loved to death\" and the council acknowledged that it has to step in to mitigate the issues caused by tourists, while also accommodating them.\n\nAuthorities are now urging the public to provide feedback on the DMP, and have until September to do so. If given the green like, it will be the first congestion road charge of its kind in Australia. It's proved a successful idea in cities overseas such as New York which introduced congestion pricing on certain roads in January this year.\n\nVehicle recognition technology could be introduced to help\n\nThe council has proposed introducing vehicle recognition technology on its roads to help determine whether cars are owned by locals or are simply travelling through. This would be used to ensure residents aren't copping the brunt of the proposed changes.\n\nADVERTISEMENT\n\nProfessor Matthew Burke from Griffith University previously told Yahoo News that congestion charges for tourists is \"not a new idea\" as several towns in the UK and Europe have them. When asked if he thinks it would be appropriate for Noosa, Professor Burke said that \"it's not illogical\".\n\n\"[It would] free up that strip and discourage people from heading in and causing congestion to everyone else,\" he said.\n\nIllegal camping continues to put pressure on beach town\n\nWhile many coastal regions across the country have been grappling with illegal camping, Noosa in particular has been overrun with travellers sleeping overnight in car parks.\n\nThe issue has become so significant that the council announced $333 fines will be issued to anyone caught illegally camping along the Peregian Esplanade or at Victory Park along Lorikeet Drive. The rules were introduced on July 24, with 50 fines handed out during two weeks in the area.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]