[
  {
    "url": "https://www.9news.com.au/national/parcel-service-sendle-ceases-operations-in-australia/3744ab01-386d-45fa-a37b-deac2de7615d",
    "title": "Parcel service Sendle suddenly shuts down operations",
    "publish_date": "Mon, 12 Jan 2026 00:25:27 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "A﻿ustralian parcel and courier service Sendle has suddenly ceased operations, leaving small businesses in limbo.\n\nSendle, founded in 2014, ﻿sent an email to customers informing them that the service will be halting all bookings \"effective immediately\" from yesterday, January 11.\n\n\"If you have any existing or scheduled bookings with us: Any parcels that have already been picked up and are in transit will be delivered at the discretion of the delivery partner,\" the message reads.\n\nSendle, founded in 2014, ﻿sent an email to customers informing them that the service will be halting all bookings. (Sendle)\n\nREAD MORE: Man charged after man dies at Sydney immigration centre\n\n\"Any existing bookings scheduled for pickup on 12 January or later will be cancelled.\"\n\nSendle also apologised to users for the inconvenience﻿ but did not give a reason for the shutdown.\n\nThe parcel service said it has shipped more than 65 million parcels across three countries since it began operations.\n\nIt was primarily used by small businesses.\n\nSmall business owner Alicia Segal, ﻿the co-founder of Australian breast pump business Bubka, said she had been blindsided by the shutdown.\n\nSendle also apologised to users for the inconvenience﻿ but did not give a reason for the shutdown. (Supplied)\n\n\"We usually alternate between Sendle and Australia Post . With the ongoing frustrations around Australia Post, we were in the process of moving all our postage to Sendle - so this update has left us feeling high and dry,\" Segal told nine.com.au.\n\nSegal said Sendle was \"generally much cheaper\" than using Australia Post for all parcel deliveries.\n\n﻿On its website, Sendle bills itself as less expensive than parcel post and express post.\n\nA Sendle three-kilogram parcel is priced at $13.20.\n\nThe same weighted parcel costs $19.30 to ship with Australia Post.\n\n﻿Sendle raised $45 million during a funding round in 2021 to help it expand to the US.\n\nIn a statement, Sendle told nine.com.au it is no longer taking future bookings.\n\n\"We are not able to provide any further comment at this time,\" the spokesperson said.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/us-federal-reserve-chairman-jerome-powell-served-a-subpoena-from-department-of-justice-over-renovations/88c919f1-dae8-41ba-b3f0-09d8b1849915",
    "title": "One of Trump's top enemies threatened with 'criminal indictment'",
    "publish_date": "Mon, 12 Jan 2026 01:55:56 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "T﻿he chairman of the US Federal Reserve says he will \"stand firm in the face of threats\" amid a fresh eruption in his feud with US President Donald Trump.\n\nThe Department of Justice has threatened Jerome Powell with a \"criminal indictment\" over his comments at a Senate Banking Committee meeting in June﻿ last year, where the cost of rebuilding two federal government-owned buildings was discussed.\n\nIt comes ﻿after months of growing tensions between the Fed and Trump, which became public when he and Powell clashed on live television .\n\nTrump and Powell clashed on live TV after touring the US Federal Reserve's renovations in June last year. (AP)\n\nThe Federal Reserve is the equivalent of the Reserve Bank of Australia and sets the official cash rate in the US.﻿\n\nSince returning to office at the start of last year, Trump has repeatedly called for Powell to be fired and replaced with someone more willing to drastically cut the US cash rate.﻿\n\nIn an extremely rare statement issued late on Sunday night (Monday AEST), Powell﻿ said he had \"deep respect for the rule of law and for our accountability in our democracy\", but this threat of an indictment was not about a blowout in construction costs.\n\nPowell's time at the helm of the Federal Reserve is drawing to a close. (AP)\n\n\"This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings,\" he said.\n\n\"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president.\n\n\"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions — or whether instead monetary policy will be directed by political pressure or intimidation.﻿\"\n\nThe Fed in the second half of last year lowered rates three times in row, though officials have recently said they were unlikely to lower rates again for a while.\n\nTrump's pressure campaign has included a barrage of personal insults at Powell and an ongoing effort to oust Fed Governor Lisa Cook , appointed by then-president Joe Biden.\n\nThe federal probe comes as Trump prepares to announce his pick for who will replace Powell once his term ends in May. The decision will cap a months-long search process for arguably the most influential role in the global economy.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/australia-social-media-ban-meta-instagram-facebook/b4e1535d-6a02-4719-a230-d61174ad9053",
    "title": "Half a million Instagram and Facebook accounts wiped",
    "publish_date": "Mon, 12 Jan 2026 00:08:21 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "Walsh said the company was committed to ensuring their platforms comply with the new regulations, and also called on the\n\nfederal government\n\nto commit to an open dialogue with social media companies.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-references-to-impeachments-removed-from-smithsonian-us/c45728d0-ef67-4e65-8f21-d9018d53f1b1",
    "title": "Impeachments info removed from Smithsonian's Trump portrait",
    "publish_date": "Mon, 12 Jan 2026 01:03:47 +0000",
    "category": "entertainment",
    "authors": [
      "Jan"
    ],
    "text": "US President Donald Trump's photo portrait display at the Smithsonian's National Portrait Gallery has had references to his two impeachments removed, the latest apparent change at the collection of museums he has accused of bias as he asserts his influence over how official presentations document US history.\n\nThe wall text, which summarised Trump's first presidency and noted his 2024 comeback victory, was part of the museum's \"American Presidents\" exhibition. The description had been placed alongside a photograph of Trump taken during his first term.\n\nNow, a different photo appears without any accompanying text block, though the text was available online. Trump was the only president whose display in the gallery, as seen Sunday, did not include any extended text.\n\nUS President Donald Trump's new portrait in the Smithsonian. (AP)\n\nThe White House did not say whether it sought any changes.\n\nNor did a Smithsonian statement in response to Associated Press questions.\n\nBut Trump ordered in August that Smithsonian officials review all exhibits before the nation celebrates the 250th anniversary of the Declaration of Independence on July 4.\n\nhe Republican administration said the effort would \"ensure alignment with the president's directive to celebrate American exceptionalism, remove divisive or partisan narratives, and restore confidence in our shared cultural institutions.\"\n\nTrump's original \"portrait label,\" as the Smithsonian calls it, notes Trump's Supreme Court nominations and his administration's development of COVID-19 vaccines.\n\nThat section concludes: \"Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the US Capitol on January 6, 2021, he was acquitted by the Senate in both trials.\"\n\nThe exhibit has had text referring to Trump's impeachments removed. (AP)\n\nThen the text continues: \"After losing to Joe Biden in 2020, Trump mounted a historic comeback in the 2024 election. He is the only president aside from Grover Cleveland (1837– 1908) to have won a nonconsecutive second term.\"\n\nAsked about the display, White House spokesman Davis Ingle celebrated the new photograph, which shows Trump, brow furrowed, leaning over his Oval Office desk. Ingle said it ensures Trump's \"unmatched aura ... will be felt throughout the halls of the National Portrait Gallery\".\n\nThe portrait was taken by White House photographer Daniel Torok, who is credited in the display that includes medallions noting Trump is the 45th and 47th president.\n\nSimilar numerical medallions appear alongside other presidents' painted portraits that also include the more extended biographical summaries such as what had been part of Trump's display.\n\nThe Smithsonian in Washington, DC. (Getty)\n\nSitting presidents are represented by photographs until their official paintings are commissioned and completed.\n\nIngle did not answer questions about whether Trump or a White House aide, on his behalf, asked for anything related to the portrait label.\n\nThe gallery said in a statement that it had previously rotated two photographs of Trump from its collection before putting up Torok's work.\n\n\"The museum is beginning its planned update of the America's Presidents gallery which will undergo a larger refresh this Spring,\" the gallery statement said.\n\n\"For some new exhibitions and displays, the museum has been exploring quotes or tombstone labels, which provide only general information, such as the artist's name.\"\n\nOne of Trump's impeachments was over the US Capitol riot. (AP)\n\nFor now, references to Presidents Andrew Johnson and Bill Clinton being impeached in 1868 and 1998, respectively, remain as part of their portrait labels, as does President Richard Nixon's 1974 resignation as a result of the Watergate scandal.\n\nAnd, the gallery statement noted, \"The history of Presidential impeachments continues to be represented in our museums, including the National Museum of American History.\"\n\nTrump has made clear his intentions to shape how the federal government documents US history and culture.\n\nHe has offered an especially harsh assessment of how the Smithsonian and other museums have featured chattel slavery as a seminal variable in the nation's development but also taken steps to reshape how he and his contemporary rivals are depicted.\n\nTrump replaced Joe Biden's portrait in the White House with the picture of an autopen. (Margo Martin/X via CNN Newsource)\n\nIn the months before his order for a Smithsonian review, he fired the head archivist of the National Archives and said he was firing the National Portrait Gallery's director, Kim Sajet, as part of his overhaul. Sajet maintained the backing of the Smithsonian's governing board, but she ultimately resigned.\n\nAt the White House, Trump has designed a notably partisan and subjective \"Presidential Walk of Fame\" featuring gilded photographs of himself and his predecessors – with the exception of Biden, who is represented by an autopen – along with plaques describing their presidencies.\n\nThe White House said at the time that Trump himself was a primary author of the plaques.\n\nNotably, Trump's two plaques praise the 45th and 47th president as a historically successful figure while those under Biden's autopen stand-in describe the 46th executive as \"by far, the worst President in American History\" who \"brought our Nation to the brink of destruction.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/sinkhole-adelaide-couple-car-fall/b37708cb-98ca-4f15-980b-21c81186919b",
    "title": "Couple get hire car stuck in sinkhole on way to airport in Adelaide",
    "publish_date": "Sun, 11 Jan 2026 08:32:07 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "A couple's drive to the airport has taken a shocking turn after their hire car fell into a large sinkhole in Adelaide .\n\nThe crater at Hyde Park, caused by a burst water main, swallowed the front wheels of the Kia van, which then became stuck for two hours.\n\nA burst main also caused an early-morning deluge on Park Street.\n\nA couple's drive to the airport has taken a shocking turn after their hire car fell into a large sinkhole in Adelaide. (Nine)\n\n\"We're just standing here watching the car sink and there was no one here, like I was directing traffic initially,\" witness Sanja Nikolic said.\n\nThe water threatened homes and flowed into a cellar below a young family's home as other residents watched it move dangerously close.\n\nThe visitors caught on their way to the airport were from the Northern Territory and making their way to return the rental car before a flight home.\n\nThey first drove into what was a small ditch, and soon there was no turning back.\n\n\"We could still see the number plate of the car, like it was submerged maybe that much, but then over time, it's been maybe an hour,\" Nikolic said.\n\nBoth the driver and her passenger managed to get out of the van and caught an Uber to the airport.\n\nTwo hours later, SA Water crews finally cut the supply, leaving about 50 homes without water.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/victoria-bushfires-firefighter-brigade-commander-tyrone-rice-loses-harcourt-home/718c8e02-4f8c-4ece-896d-529653115e8d",
    "title": "'It was too late': Firefighter loses home while defending neighbouring properties",
    "publish_date": "Sat, 10 Jan 2026 07:57:32 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "A firefighter brigade commander and his brother are coming to terms with losing their homes, after a bushfire ﻿tore through their small town in Victoria's Central Highlands.\n\nTyrone Rice has worked with the County Fire Authority (CFA) for 48 years and was fighting one of the dozens of bushfires ravaging the state when he received news his own Harcourt home was in the firing line.\n\n\"It was too late, it was gone, it was already on fire,\" he told 9News.\n\nTyrone Rice lost his home while fighting a bushfire. (Nine)\n\nRice is ﻿now grappling with the loss.\n\n\"﻿Bit like a kick in the guts, but I'm not the first person to go through it, and I won't be the last,\" he said.\n\nAcross the road, ﻿his brother is facing the same devastation.\n\nRetirees Ray and Loretta Rice have lived in the town for 19 years and had their forever home demolished by the fire.\n\nNow, only charred brick remains. ﻿\n\n\"Probably hasn't hit me yet,\" Ray said.\n\n\"Our retirement has all gone up in smoke... You can rebuild houses. I've been broke before, so we start again, but 79 is a bit old to be starting again.\"\n\n\"This is all ours... was [ours],\" Loretta said, becoming visibly emotional.\n\n﻿ READ MORE: ﻿ Hundreds of firefighters on standby as Sydney tops 40 degrees\n\nRetirees Ray and Loretta Rice lost their forever home. (Nine)\n\nThe retirees' now have to start again. (Nine)\n\nThe fire swept through yesterday afternoon, with its speed catching locals by surprise.\n\nFor those who stayed behind, last night was a reprieve as temperatures dropped.\n\nThis morning, locals were able to see the extent of the damage after the fire burned through 30,000 hectares of land, destroying 50 structures, including homes and farms. ﻿\n\nVictorian Premier Jacinta Allan acknowledged the town's devastation.\n\n\"﻿This is a fabulous small community that has been hit really hard,\" she said.\n\nAustralians have poured their support behind the community to help them recover from their losses. ﻿\n\nTyrone said the response has been overwhelming. ﻿\n\n\"In fact, I haven't replied to them all. There's just too many,\" he said. ﻿\n\nTyrone has received support from the community. (Nine)\n\nOther frontline responders also lose their homes ﻿\n\nIn Alexandra, ﻿volunteer firefighter Michael Harper spent more than 20 hours on the frontline saving other people's homes.\n\nDuring that time, he lost his home of 10 years to a blaze.\n\nMeanwhile, the Mayor of Murrindindi, Damien Gallagher, who was part of the strike team fighting the fire, was also told his house had been destroyed.\n\n\"The intensity of the heat is incredible,\" he said.\n\n\"And with my crew, the guys on the back did an incredible job in some tough situations where they couldn't breathe.\"\n\nBut he came back to find a miracle - his home still standing.\n\n\"We really need to pour our hearts out to the community members, many of whom are coming home to no home,\" he said.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/marta-kostyuk-aryna-sabalenka-handshake-brisbane-international/106219864",
    "title": "'It's not OK to not talk about it': Kostyuk explains handshake stance",
    "publish_date": "Mon, 12 Jan 2026 01:41:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "Marta Kostyuk's run to the Brisbane International final was groundbreaking for many reasons.\n\nThe 23-year-old had a relatively disappointing 2025, only making three quarterfinal appearances across the season.\n\nKostyuk recorded consecutive victories over top-10-ranked opponents, beating number two seed Amanda Anisimova, number six seed Mirra Andreeva, and fourth seed Jessica Pegula to make her first WTA final appearance in 21 months.\n\nBut against world number one Aryna Sabalenka in the final, she came unstuck, losing in straight sets.\n\nPlaying Sabalenka has always been a challenge for Kostyuk.\n\nAryna Sabalenka claimed a second-straight Brisbane International trophy. (Getty Images: Bradley Kanaris)\n\nThe pair have met five times now, with the Belarusian winning on all five occasions.\n\nThere are also tensions between the pair off-court.\n\nSabalenka soars to second-successive Brisbane title Aryna Sabalenka has claimed her second-straight Brisbane International title, beating Marta Kostyuk 6-4, 6-3.\n\nBelarus has been an active supporter of Russia's aggression in Ukraine, prompting Kostyuk to take a stance of refusing to shake the hand of any Russian or Belarusian player she faced.\n\nBefore the final, organisers confirmed there would be no joint photograph of the players before or after the match to avoid any doubt.\n\nOn court, following the defeat, the world number 20 pointedly refused to acknowledge Sabalenka in any way, using her post-match on-court interview to instead highlight the plight of her fellow Ukranians in the midst of a tough winter.\n\n\"I want to say a few words about Ukraine,\" Kostyuk said.\n\n\"I play every day with a pain in my heart. There are thousands of people who are without light and warm water right now, it's minus-20 degrees outside right now, so it's very, very painful to live this reality every day.\n\n\"I was incredibly moved and happy to see so many Ukrainian fans and flags here this week … slava Ukraini.\"\n\nMarta Kostyuk has not beaten Aryna Sabalenka in five attempts. (Getty Images: Albert Perez)\n\nIn the post-match press conference, she elaborated further, saying it was her duty to talk about Ukraine.\n\n\"I think it's important for me to use my platform in the right way, and my platform is Ukraine, because I represent Ukraine, so I think it's really important to talk about that,\" she said.\n\n\"I think, I have such exposure, so many people follow me, so many people look up to me … I have just learned with the war and everything that's going on that it's really important to stand up for things and to talk about them, whether it's war, whether it's other beliefs, or the position that you have, no matter what it is, if it's what you believe in, you have to talk about it.\n\n\"I'm here, I do my job, of course, this is the most important thing, but at the same time, the reality back home is very, very different.\n\n\"So I just, I feel like I cannot ignore it, and I have to share it. I have platform for this, and I have voice.\n\n\"In my position, it's not OK to not talk about it. It's just, I mean, it's just gonna be inhumane for me.\"\n\nMarta Kostyuk said the reality for people in Ukraine is very difficult for her. (Getty Images: Albert Perez)\n\nSabalenka has spoken out against the war in the past.\n\n\"No-one in this world, Russian or Belarusian athletes, supports the war. Nobody,\" Sabalenka said in 2023 at the French Open, when Kostyuk was booed for not shaking Sabalenka's hand.\n\n\"If we could stop it, we would, but, unfortunately, it's not in our hands.\"\n\nIn Brisbane on Sunday, Sabalenka praised Kostyuk on court, before saying the stance of Ukraine's players on shaking her hand was their decision.\n\n\"It's their position. What can I do? I don't mind that. I don't care about that,\" Sabalenka said.\n\n\"When I go into the match, it's all about tennis and sport.\n\n\"When I go out there, I think about my tennis and the things I have to do to get the win. Doesn't matter if it's Marta Kostyuk or Jessica Pegula there. I still go out there, and I still try my best, and I'll still fight for the trophy.\n\n\"I have nothing to prove. I go there and I just compete as an athlete.\"\n\nThere was more off-court beef relating to the pair apart from geopolitical issues, too.\n\nLate last year, Kostyuk was quoted as saying players like Sabalenka and world number two Iga Świątek had an advantage because they had more testosterone than other players.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAs Sabalenka sealed the victory, she pointedly kissed both biceps while looking at her opponent, although she later said the gesture was an in-joke between members of her team.\n\nKostyuk said she had been misquoted and that the situation was \"sad\" when asked about it in Brisbane.\n\nBut she did not apologise.\n\n\"If I had said something wrong, I never have a problem to apologise, or to reach out to someone or whatever,\" Kostyuk said after her semifinal victory.\n\n\"But this was not the case at all … I knew what I said, so I was okay.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/golden-globes-awards-winners-list-2026/106199402",
    "title": "Full list of Golden Globes winners",
    "publish_date": "Mon, 12 Jan 2026 01:29:33 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Here is the full list of winners from the 2026 Golden Globe Awards.\n\nThe latest winner will be added to the top. Refresh this page to stay up to date.\n\nBest actor in a motion picture — musical/comedy\n\nEthan Hawke, Blue Moon\n\nGeorge Clooney, Jay Kelly\n\nJesse Plemons, Bugonia\n\nLee Byung-Hun, No Other Choice\n\nLeonardo DiCaprio, One Battle After Another\n\nWINNER: Timothée Chalamet, Marty Supreme\n\nBest actress in a motion picture — musical/comedy\n\nAmanda Seyfried, The Testament of Ann Lee\n\nChase Infiniti, One Battle After Another\n\nCynthia Ervio, Wicked: For Good\n\nEmma Stone, Bugonia\n\nKate Hudson, Song Sung Blue\n\nWINNER: Rose Byrne, If I Had Legs I'd Kick You\n\nBest screenplay — motion picture\n\nHamnet\n\nIt Was Just an Accident\n\nSentimental Value\n\nWINNER: Paul Thomas Anderson, One Battle After Another\n\nMarty Supreme\n\nSinners\n\nBest original song — motion picture\n\nDream As One (Avatar: Fire and Ash), Miley Cyrus, Andrew Wyatt, Mark Ronson, Simon Franglen\n\nWINNER: Golden (KPop Demon Hunters), Joong Gyu Kwak, Yu Han Lee, Hee Dong Nam, Jeong Hoon Seo, Park Hong Jun, Kim Eun-jae, Mark Sonnenblick\n\nI Lied to You (Sinners), Raphael Saadiq, Ludwig Göransson\n\nNo Place Like Home (Wicked: For Good), Stephen Schwartz\n\nThe Girl in the Bubble (Wicked: For Good), Stephen Schwartz\n\nTrain Dreams (Train Dreams), Nick Cave, Bryce Dessner\n\nBest podcast\n\nArmchair Expert with Dax Shepard\n\nCall Her Daddy\n\nWINNER: Good Hang with Amy Poehler\n\nSmartless\n\nThe Mel Robbins Podcast\n\nUp First\n\nBest actor — musical/comedy series\n\nAdam Brody, Nobody Wants This\n\nGlen Powell, Chad Powers\n\nJeremy Allen White, The Bear\n\nMartin Short, Only Murders in the Building\n\nWINNER: Seth Rogen, The Studio\n\nSteve Martin, Only Murders in the Building\n\nBest supporting actor — television series\n\nAshley Walters, Adolescence\n\nBilly Crudup, The Morning Show\n\nJason Isaacs, The White Lotus\n\nWINNER: Owen Cooper, Adolescence\n\nTramell Tillman, Severance\n\nWalton Goggins, The White Lotus\n\nBest actress — musical/comedy series\n\nAyo Edebiri, The Bear\n\nWINNER: Jean Smart, Hacks\n\nJenna Ortega, Wednesday\n\nKristen Bell, Nobody Wants This\n\nNatasha Lyonne, Poker Face\n\nSelena Gomez, Only Murders in the Building\n\nBest actor — drama series\n\nAdam Scott, Severance\n\nDiego Luna, Andor\n\nGary Oldman, Slow Horses\n\nMark Ruffalo, Task\n\nWINNER: Noah Wyle, The Pitt\n\nSterlin Brown, Paradise\n\nBest supporting actor — motion picture\n\nAdam Sandler, Jay Kelly\n\nBenicio del Toro, One Battle After Another\n\nJacob Elordi, Frankenstein\n\nPaul Mescal, Hamnet\n\nSean Penn, One Battle After Another\n\nWINNER: Stellan Skarsgård, Sentimental Value\n\nBest supporting actress — motion picture\n\nAmy Madigan, Weapons\n\nAriana Grande, Wicked: For Good\n\nElle Fanning, Sentimental Value\n\nEmily Blunt, The Smashing Machine\n\nInga Ibsdotter Lilleaas, Sentimental Value\n\nWINNER: Teyana Taylor, One Battle After Another\n\nBest picture — drama\n\nFrankenstein\n\nHamnet\n\nIt Was Just an Accident\n\nSentimental Value\n\nSinners\n\nThe Secret Agent\n\nBest picture — musical/comedy\n\nBlue Moon\n\nBugonia\n\nMarty Supreme\n\nNo Other Choice\n\nNouvelle Vague\n\nOne Battle After Another\n\nBest actress in a motion picture — drama\n\nEva Victor, Sorry, Baby\n\nJennifer Lawrence, Die My Love\n\nJessie Buckley, Hamnet\n\nJulia Roberts, After the Hunt\n\nRenate Reinsve, Sentimental Value\n\nTessa Thompson, Hedda\n\nBest actor in a motion picture — drama\n\nDwayne Johnson, The Smashing Machine\n\nJeremy Allen White, Springsteen: Deliver Me From Nowhere\n\nJoel Edgerton, Train Dreams\n\nMichael B Jordan, Sinners\n\nOscar Isaac, Frankenstein\n\nWagner Moura, The Secret Agent\n\nBest director — motion picture\n\nChloé Zhao, Hamnet\n\nGuillermo del Toro, Frankenstein\n\nJafar Panahi, It Was Just an Accident\n\nJoachim Trier, Sentimental Value\n\nPaul Thomas Anderson, One Battle After Another\n\nRyan Coogler, Sinners\n\nBest picture — animated\n\nArco\n\nDemon Slayer: Kimetsu No Yaibia — Infinity Castle\n\nElio\n\nKPop Demon Hunters\n\nLittle Amélie or the Character of Rain\n\nZootopia 2\n\nBest picture — non-English language\n\nIt was Just an Accident\n\nNo Other Choice\n\nSentimental Value\n\nSirāt\n\nThe Secret Agent\n\nThe Voice of Hind Rajab\n\nBest original score\n\nFrankenstein\n\nF1\n\nOne Battle After Another\n\nSirāt\n\nSinners\n\nHamnet\n\nCinematic and box office achievement\n\nAvatar: Fire and Ash\n\nF1\n\nKPop Demon Hunters\n\nMission Impossible — The Final Reckoning\n\nSinners\n\nWeapons\n\nWicked: For Good\n\nZootopia 2\n\nBest drama series\n\nThe Diplomat\n\nPluribus\n\nSeverance\n\nSlow Horses\n\nThe Pitt\n\nThe White Lotus\n\nBest musical/comedy series\n\nAbbott Elementary\n\nThe Bear\n\nHacks\n\nNobody Wants This\n\nOnly Murders in the Building\n\nThe Studio\n\nBest limited series, anthology series or television motion picture\n\nAdolescence\n\nAll Her Fault\n\nBlack Mirror\n\nDying for Sex\n\nThe Beast in Me\n\nThe Girlfriend\n\nBest actress — drama series\n\nBella Ramsey, The Last of Us\n\nBritt Lower, Severance\n\nHelen Mirren, MobLand\n\nKathy Bates, Matlock (2024 TV Series)\n\nKeri Russell, The Diplomat\n\nRhea Seehorn, Pluribus\n\nBest actress — limited series, anthology series or television motion picture\n\nAmanda Seyfried, Long Bright River\n\nClaire Danes, The Beast in Me\n\nMichelle Williams, Dying for Sex\n\nRashida Jones, Black Mirror\n\nRobin Wright, The Girlfriend\n\nSarah Snook, All Her Fault\n\nBest actor — limited series, anthology series or television motion picture\n\nCharlie Hunnam, Monster: The Ed Gein Story\n\nJacob Elordi, The Narrow Road to the Deep North\n\nJude Law, Black Rabbit\n\nMatthew Rhys, The Beast in Me\n\nPaul Giamatti, Black Mirror\n\nStephen Graham, Adolescene\n\nBest supporting actress — television series\n\nAimee Lou Wood, The White Lotus\n\nCarrie Coon, The White Lotus\n\nCatherine O'Hara, The Studio\n\nErin Doherty, Adolescence\n\nHannah Einbinder, Hacks\n\nParker Posey, The White Lotus\n\nBest stand-up comedian on television",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/criminal-investigation-opens-into-us-federal-reserve-chair/106220038",
    "title": "Breaking: US federal prosecutors open criminal inquiry into US Federal Reserve chair",
    "publish_date": "Mon, 12 Jan 2026 01:10:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "The US attorney's office in the District of Columbia has opened a criminal investigation into Jerome Powell, the chair of the Federal Reserve.\n\n\"On Friday, the Department of Justice served the Federal Reserve with grand jury subpoenas, threatening a criminal indictment related to my testimony before the Senate Banking Committee last June,\" Mr Powell said in a statement.\n\nThe testimony concerned, in part, a multi-year project to renovate historic Federal Reserve office buildings.\n\n\"But this unprecedented action should be seen in the broader context of the administration's threats and ongoing pressure,\" he said.\n\n\"This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings.\n\n\"I have deep respect for the rule of law and for accountability in our democracy. No-one — certainly not the chair of the Federal Reserve — is above the law.\"\n\nTrump fact-checked by Federal Reserve boss in exchange over renovations The US Federal Reserve chair pushes back on President Trump's criticism of renovation costs amid a campaign of growing pressure.\n\nThe inquiry, which was approved in November by the US attorney for the District of Columbia, Jeanine Pirro, includes an analysis of Mr Powell's public statements and an examination of spending records, The New York Times reported.\n\nMr Powell, whose Australian counterpart is Reserve Bank governor Michele Bullock, says the legal threat is directly related to the US Federal Reserve's monetary policy settings.\n\n\"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the President,\" he said.\n\n\"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions — or whether instead monetary policy will be directed by political pressure or intimidation.\"\n\nAn unprecedented move\n\nThe legal threat amounts to a dramatic escalation in the fight between Mr Powell and US President Donald Trump, which dates to Mr Powell's first year as chair in 2018.\n\nWestpac's chief economist and former RBA official, Luci Ellis, said it was an unprecedented move by the US government.\n\n\"It's shocking but not surprising and certainly unheard of in a major developed economy,\" she said.\n\nThe legal threat amounts to a dramatic escalation in the fight between Jerome Powell and Donald Trump.\n\nMs Ellis said it would make many Americans think twice about public service.\n\n\"[It] casts a pall on the attractiveness of US government service for Americans,\" she said.\n\nIndependent economist Saul Eslake said the action was what people had come to expect from the Trump administration.\n\n\"This reminds of a Peruvian dictator in the 1930s who famously said, 'for my friends, everything, for my enemies, the law',\" he said.\n\nABC News asked Mr Eslake if he thought the legal threat to Powell could affect the Reserve Bank's monetary policy.\n\n\"Indirectly, yes,\" he responded.\n\n\" It's another threat to the credibility of the US Federal Reserve. \"\n\nHowever, Mr Eslake said it was more likely to affect longer-term Australian interest rates.\n\nShorter-duration interest rates, such as the cash rate, influence what mortgage borrowers pay their lenders.\n\nLong-term interest rates affect government borrowings.\n\n\"Longer-term Australian interest rates will continue to rise,\" Mr Eslake said.\n\n\"This will affect the cost of borrowing for the Australian government.\"\n\nThe Reserve Bank has been contacted for comment.\n\nLoading\n\nABC/Reuters",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/danielle-scott-wins-aerials-gold-at-lake-placid/106219716",
    "title": "Aussie Danielle Scott ends World Cup drought just before Winter Olympics",
    "publish_date": "Mon, 12 Jan 2026 00:28:45 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian aerial skier Danielle Scott has broken through for her first World Cup triumph in nearly three years in a timely boost to her medal hopes at next month's Winter Olympics.\n\nThe 35-year-old three-time Olympian has had a particularly lean run this season but put her woes behind her with a morale-boosting triumph at Lake Placid in the United States less than a month before the start of the Games in Italy.\n\nScott scored 95.88 points in the super final to take top spot ahead of China's reigning Olympic champion Xu Mengtai, who scored 94.01.\n\nAmerica's 2025 world champion, Kaila Kuhn, was third with 92.29.\n\nLoading Instagram content\n\nLaura Peel, who won the last World Cup event in Canada, was unable to stick her landing and finished sixth, while fellow Australian Airleigh Frigo was seventh.\n\n\"I'm just letting this sink in. I've had a rough run this season,\" said Scott, with the victory her first in a World Cup event since March 2023 and the seventh of her career.\n\n\"A lot of highs and lows … today I just needed to go prove myself, and I did that, so I'm stoked.\"\n\nDanielle Scott won her first World Cup event since March 2023. (Getty Images: Al Bello)\n\nWith four out of six skiers in the medal round attempting triples, Scott's choice of a back double full-full proved a smart decision after assessing the tricky conditions of the day.\n\n\"I was hoping to do triples, and we made some hard decisions and decided to keep it on the double. I think it paid off,\" she said.\n\n\"I want to do them, so let's get Mother Nature on our side.\"\n\nIn the men's competition, China's Wang Xindi opted to go with five twists.\n\nDespite the conditions, he was rewarded with a win.\n\nWith landings proving to be challenging for many athletes, his back double full-full-double full earned a 103.50 and his first World Cup win of the season.\n\nCompetitors will line up for another World Cup at Lake Placid on Monday (local time) to wrap up their preparation for the Milan-Cortina Games, which start on February 6.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/golden-globes-red-carpet-2026/106219490",
    "title": "TV and movie stars arrive in style on the Golden Globes red carpet",
    "publish_date": "Sun, 11 Jan 2026 23:59:19 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "It's officially time to roll out the red carpet at the 83rd Golden Globes!\n\nThe night will celebrate the best of movies and television — and the spectacular fashion that comes with it.\n\nKeep scrolling for a look at the glitz and glamour, and follow more of the action on our live blog.\n\nSelena Gomez adds some feathery flair to the red carpet in this black and white dress. The red lip is perfection. (Reuters: Mike Blake)\n\nPriyanka Chopra Jonas looks timeless in a navy satin gown with a sapphire necklace to match. (Reuters: Daniel Cole)\n\nK-Pop star and The White Lotus actress LISA also wore her hair long and loose. Was there a group chat conversation to coordinate? (Reuters: Daniel Cole)\n\nLeighton Meester has gone for bold clashing colours and patterns while Adam Brody appears to have forgotten the steamer for his shirt. Nevertheless, the sunglasses at night bring up the cool factor. (Reuters: Daniel Cole)\n\nNobody Wants This star Justine Lupe is looking just peachy in this light pink frock. (Reuters: Daniel Cole)\n\nElle Fanning coordinates her necklace and dress perfectly in this gorgeous shade of blue. The dress definitely makes a delightful sound when she walks with all those beads swishing. Gus Wenner is her date. (Reuters: Mike Blake)\n\nPretty in pink is the only way to accurately describe host Nikki Glaser's dress. It looks like it could have been stolen from the set of Wicked. (Reuters: Daniel Cole)\n\nAimee Lou Wood shares her trademark big smile in a asymmetrical gothic-inspired gown. (Reuters: Mike Blake)\n\nTessa Thompson keeps the long hair and shimmery strapless gown trend going in this green number. (Reuters: Daniel Cole)\n\nOne Battle After Another star Teyana Taylor is in a perfectly draped black gown. The silver embellishments add the perfect touch to the look. (Reuters: Mike Blake)\n\nEmily Blunt stands out next to husband John Krasinki in her off-white get-up. The question is: is it a jacket or a cape? Is it both? (Reuters: Daniel Cole)\n\nWalton Goggins's shirt and tie looks like if Colonel Sanders wanted to dress like a Golden Globe statuette. I'm not mad about it. (Reuters: Daniel Cole)\n\nHamnet star Paul Mescal arrives on the red carpet in an understated black suit. (Reuters: Daniel Cole)\n\nGreek goddess is the phrase red-carpet correspondents used to describe this look from Jean Smart. She's nominated tonight for her performance on Hacks. (Reuters: Daniel Cole)\n\nAussie nominee Jacob Elordi looks drastically different from his performance in Frankenstein, which he is nominated for tonight. (Reuters: Daniel Cole)\n\nJulia Roberts accessorises with a strawberry necklace and ring. (Reuters: Daniel Cole)\n\nAriana Grande has swapped the pink from the Wicked press tour for an off-the-shoulder black gown. (Reuters: Daniel Cole)\n\nJennifer Lawrence in a sheer, floral cut-out dress. The matching shawl will keep her nice and toasty during the ceremony I hope! (Reuters: Daniel Cole)\n\nEmma Stone poses in a buttery-yellow two-piece set. No accessories needed when your skirt is that glittery. (Reuters: Daniel Cole)\n\nWicked director John M Chu pays tribute to the stars of the movie with custom brooches of Cynthia Erivo and Ariana Grande on his lapel. (AP: Jordan Strauss)\n\nMiley Cyrus rips off her big dark shades as she shows off her sparkly black gown on the carpet. (Reuters: Daniel Cole)\n\nJessie Buckley wears a bright blue gown. She's nominated for her performance in Hamnet. (Reuters: Daniel Cole )",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/southern-ports-failed-to-protect-degrading-leschenault-homestead/106178744",
    "title": "Report reveals ongoing damage, neglect of historic WA homestead",
    "publish_date": "Sun, 11 Jan 2026 23:58:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Inaction by a West Australian port authority may have accelerated the deterioration of one of the state's oldest homes, according to an internal report obtained by the ABC.\n\nThe heritage-listed Leschenault Homestead, about 160 kilometres south of Perth, was one of the earliest residences constructed in the South West after colonisation.\n\nIt was sold to the Bunbury port authority, now known as Southern Ports, in 1968.\n\nSignificant and progressive degradation has been consistently observed and flagged by local residents and councillors in recent years.\n\nArchitect Kent Lyon's report highlighted the ongoing deterioration at the homestead. (Supplied: Kent Lyon)\n\nIn May 2024, Southern Ports told a community committee the cottages had \"been reviewed by Kent Lyon, who will provide a report on the stabilisation of the buildings\".\n\nIn August 2024, the same committee was told \"a local heritage architect is working on steps on how to stabilise the buildings\".\n\nWhen the ABC asked Southern Ports for a copy of this report last year, a spokesperson said it would take some time to source.\n\nAfter a Freedom of Information application by the ABC, a copy was released.\n\n'Urgent' work required\n\nCompleted in April 2023, the report recommends a range of measures, several requiring urgent attention and the remainder requiring attention within 12 months.\n\nUrgent work included removal of plastic sheeting placed over the eastern wall of one cottage, which Mr Lyon said had \"exacerbated the deterioration [of the weatherboards] with a humid 'glasshouse' effect\".\n\nA photo from Kent Lyon's 2023 report shows damage to one of the cottage's bases. (Supplied: Kent Lyon)\n\nSouthern Ports said it had installed the black plastic \"with good intent; to preserve and weather protect the interior of the building\".\n\nAlmost three years later, this plastic sheeting remains in place.\n\nThe port authority said the conservation works should occur as a package, and the removal of the plastic sheeting was contingent on cladding being installed.\n\nOne of the Leschenault Homestead cottages on January 3, 2026. (ABC South West WA: Jacqueline Lynch)\n\nOther issues highlighted included dampness in brick fireplace and chimney walls, and the need to disperse rainwater away from buildings, with \"considerable conservation and reconstruction work\" required.\n\n\"The cottages have deteriorated extensively over the past two decades and remain unoccupied,\" the architect noted.\n\n\" Urgent work is required to fully weather seal the cottages … doing as little as possible is not feasible. \"\n\nMr Lyon noted several times in the report that previous reviews as far back as 2008 had produced similar recommendations.\n\nSouthern Ports stands by restoration timeline\n\nSouthern Ports told the ABC \"temporary stabilisation works\" on the cottages had been undertaken.\n\nBut the more substantial work recommended in the report had \"not been achievable in the 18-month time frame recommended\".\n\nFormer occupants, the Johnstons, pose for a portrait at the Leschenault Homestead in 1902. (ABC South West WA: Ezra Kaye)\n\n\"These works are extensive and take time to plan, scope and complete in a considered manner that also reflects broader port planning and heritage requirements,\" a spokesperson said.\n\n\"Southern Ports is committed to undertaking the next phase of these works, which is scheduled to commence later this year.\"\n\nThe port authority said it had inherited the homestead \"in a state of disrepair\" and had restored the main building, now being used as an office.\n\nStrict heritage requirements\n\nAs the owner of a heritage-listed site, Southern Ports is required to comply with obligations under the Heritage Act.\n\nThe Heritage Council can issue a repair notice compelling it to undertake certain works and, if they are not completed by the specified date, advise the relevant minister to make a repair order.\n\nA Department of Planning, Lands and Heritage (DPLH) spokesperson said Southern Ports had flagged its intention to pursue the required work this year.\n\nA painting of one of the original cottages of the Leschenault Homestead, which is now falling into disrepair. (ABC South West WA: Ezra Kaye)\n\n\"The department attended Leschenault Homestead in late 2025 to assess its general condition and record photographs for reference, and will continue to monitor the condition of Leschenault Homestead,\" they said.\n\nWarning on 'cheap' promises\n\nBunbury historian Brendan Kelly said promises felt \"cheap\" given how much time had passed.\n\n\"People are trusting that everything is being done and being done correctly,\" he said.\n\n\"Then you have a look and say, 'whoops, hang on a tick, nothing's being done'. You get new managers, you get new people on board, and sometimes the priorities slip down the list.\"\n\nMr Kelly, also a former Bunbury city councillor, called for more transparency around conservation efforts.\n\n\"What needs to be provided quite openly is how much progress the port authority has made over the last two years,\" he said.\n\n\"Preservation of heritage buildings and history is an ongoing process that passes on from generation to generation.\n\n\"At the moment, it's on the port authority's watch. They are responsible for ensuring that the Leschenault Homestead is looked after, and they must step up and do that.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/adult-swim-lessons-bryony-gray-lifeflight-fundraiser/106148700",
    "title": "Learning to swim as an adult inspires 5km fundraising challenge",
    "publish_date": "Sun, 11 Jan 2026 22:51:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "Bryony Gray spent the first four decades of her life with little to no confidence in the water.\n\nThat changed when she bought a home with a pool on the Sunshine Coast, which coincided with her becoming a grandparent.\n\n\"I was thinking the grandkids [will] learn to swim, so I wanted to be able to swim with them,\" Ms Gray said.\n\n\"I could kind of breaststroke but never put my face in the water … I'd never had swimming lessons as a kid or anything.\"\n\nIn 2018, at the age of 45, she mustered the courage to take part in her first adult swimming lesson and recalled the alien feeling of learning how to blow bubbles in the water.\n\n\"I still remember standing in the shallow end, having to put my face in the water and breathe, and completely hyperventilating and panicking and thinking, 'Oh my God, what am I doing?'\" Ms Gray said.\n\nBryony's biggest swim\n\nSix years ago, Ms Gray was celebrating completing one lap of an Olympic-size swimming pool.\n\nIn November, she took on a 100-lap challenge in honour of the LifeFlight Helicopter Rescue Service, which rescued her husband after a motorbike crash.\n\nAaron Gray kept a tally of his wife's laps. (ABC Sunshine Coast: Braedan Jason)\n\nAaron Gray had been riding his new motorbike on the Bruce Highway near Cooroy in 2024 when he collided with a truck.\n\nThe Grays reunited with the LifeFlight crew almost one year on from the accident to witness Ms Gray's 5 kilometre effort to raise funds for the rescue service.\n\nDamien Storiewood was the flight critical care paramedic who arrived at the scene, and he was on hand in November to help his former patient keep a tally of Ms Gray's lap count.\n\nAaron and Bryony Gray reunite with LifeFlight crew members Ben Reegan (left) and Damien Storiewood. (ABC Sunshine Coast: Braedan Jason)\n\n\"Seeing Aaron 12 months later is a bit of a miracle in regards to how he's come through at all because he had a lot of injuries: closed-head injuries, chest, then lower-limb injuries,\" Mr Storiewood said.\n\n\"But to see him up and walking and with it is quite amazing and it's probably the best part of our job is seeing these patients down the track.\n\nBryony Gray is proud of raising $3,500 after her endurance swim. (ABC Sunshine Coast: Braedan Jason)\n\n\"It's humbling that she's decided to take on this challenge and it is a big feat to swim 5km to raise funds for the helicopters so we can continue doing the work, so it's a massive paying it forward.\"\n\nMs Gray completed her endurance swim in just over two hours and raised $3,500.\n\nNever too old to learn\n\nWith record drownings, here's what experts say will save lives As the country heads into the summer holidays, experts are again warning Australians to be aware of swim safety at beaches, pools and other waterways\n\nMs Gray's swim coach at the Nambour Aquatic Centre, Andy Muller, said it was harder to learn to swim later in life, but it was a life skill all Australians should acquire.\n\n\"When you look at the statistics, there's so many people drowning still and it's an unnecessary statistic from my point of view because we have so much water around us,\" Mr Muller said.\n\n\"If you lose a soccer ball on a soccer field and you make a mistake, you're losing a ball. You make a mistake in the water … it can get very dangerous.\"\n\nBryony Gray touches the wall after her 5 kilometre fundraising swim. (ABC Sunshine Coast: Braedan Jason)\n\nMs Gray is one of a number of adult swimmers learning the skill later in life, but Mr Muller teaches his students that swimming is more than a great form of fitness.\n\n\"We're not looking for perfect technique. We're not looking at making an Olympic swimmer out of those adults. Of course not,\" he said.\n\n\"It's about, 'How am I safe in the water? How am I getting myself out of trouble if I get into trouble?'\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/golden-globes-live-blog-2026/106195414",
    "title": "Live: Golden Globes underway as Jacob Elordi misses out on first nomination",
    "publish_date": "Sun, 11 Jan 2026 22:39:13 +0000",
    "category": "entertainment",
    "authors": [
      "Jessica Riga",
      "Velvet Winter"
    ],
    "text": "The 83rd Golden Globe awards have kicked off, with One Battle After Another and Sentimental Value among the early winners.\n\nJacob Elordi missed out on his first nomination for Frankenstein, but has a second chance in a television category.\n\nFellow Australians Sarah Snook, Rose Byrne and Joel Edgerton are also vying for glory.\n\nFollow all the winners, losers and gag-worthy moments with our live blog.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/alex-carey-adelaide-strikers-bbl-return-daughter/106219170",
    "title": "Alex Carey pulls dad duty on explosive return to BBL",
    "publish_date": "Sun, 11 Jan 2026 22:08:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alex Carey has once again proven he can do it all, returning from the Ashes to star for the Adelaide Strikers in the Big Bash League, albeit in a 32-run loss to a Mitch Marsh-led Perth Scorchers.\n\nCarey top-scored for his Strikers with 71 off just 39 balls at the Adelaide Oval in his first game back in the BBL, while also trying his best to comfort his daughter on the field.\n\nThe wicketkeeper-batter returned to his home patch, where he scored 178 runs in the Ashes-clinching third Test, and was greeted by his two children as his team jogged onto the field.\n\nAn excited Carey ran to Louis and Clementine with his arms outstretched and embraced them in a big hug before it became clear his daughter was struggling a little after the pre-game pyrotechnics.\n\n\"I miss my mummy,\" she was heard saying through Carey's microphone.\n\nTrying to comfort her as she fought through tears, Carey replied: \"You miss your mummy? You get to see me, though.\n\n\"You'll go see mummy soon. Give me a cuddle. I love you, sweetie.\"\n\nHe gave a hug and a kiss to his slightly more relaxed eight-year-old son, saying: \"How good's this? This'll be you one day.\"\n\nOnce the game started, Carey also may have been seeking some comfort in the stands as he watched from behind the stumps while Perth openers Marsh (88 off 51) and Finn Allen (38 off 16) peeled off 81 runs inside five overs.\n\nLeg spinner Lloyd Pope removed Allen and Cooper Connolly in successive deliveries, but the rest of the Scorchers were almost unstoppable.\n\nCaptain Marsh clattered six fours and seven sixes in his powerful knock, with Josh Inglis (42 off 23), Aaron Hardie (34* off 22) and Ashton Turner (20* off 8) keeping the run rate high as the Scorchers notched 4-232 off 20 overs.\n\nAdelaide threatened to pull off a remarkable victory on reaching 2-139 after 12 overs thanks to Carey's half-century as part of a 93-run opening stand with captain Matt Short (52 off 31).\n\nBut a superb second over from debutant spinner Luke Holt, who conceded just four runs in the 13th over of the innings, helped turn the tide.\n\nAn increasingly desperate Adelaide lost 6-14 as the wheels fell off, and finished on 8-200.\n\nCarey's was the second wicket in that collapse, with the wicketkeeper well caught by a diving Turner off Mahli Beardman in the 16th over.\n\nTurner made a point to hold up the ball above the ground after Renegades post controversial win over Scorchers\n\nAshton Turner made a point of showing how fair his catch of Carey was after his controversy days earlier against the Renegades. (Getty Images: Mark Brake/Cricket Australia)\n\nEnglish paceman David Payne cashed in to finish with 3-35 from four overs, while Connolly (1-24 off three), Holt (0-18 off two) and Beardman (2-43 off four) played important roles.\n\nHolt bowled two half-trackers to start his BBL career, and they were dispatched for a four and a six by Short, but rebounded brilliantly from there.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"He did well to go for 10 off his first two. It should have been 12,\" Marsh joked to Fox Cricket when asked about Holt's horror start.\n\n\"That was amazing, the way he came back. You could tell he was nervous.\n\n\"He's worked extremely hard over the last four or five years. He's balanced work and study to try to get a crack at the Big Bash and to play for the Scorchers.\n\n\"He was in the fight, and really happy for him.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/cleanbill-bulk-bill-doctor-gp-report-medical/106212998",
    "title": "Bulk-billing rates have almost doubled, report indicates",
    "publish_date": "Sun, 11 Jan 2026 20:32:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "The national bulk-billing landscape is changing fast, according to a new survey that shows the percentage of fully bulk-billing medical clinics has almost doubled in a year.\n\nCleanbill, an online GP directory, has released its January Blue Report, which was informed by 6,900 GP clinics across the country and shows 40.2 per cent of available practices now fully bulk-bill standard weekday consultations for all adult patients.\n\nThat figure was about 21 per cent at the same time in 2025.\n\nA total of 1,007 clinics nationwide have switched from private or mixed billing to bulk-billing only since the start of last year, the report showed.\n\nNew South Wales and the Northern Territory, where the share of bulk-billing clinics has more than doubled, have the largest increases.\n\nHowever, the ACT remained an outlier, with only about one in 10 clinics fully bulk-billing.\n\nAnd the report showed the average out-of-pocket cost is creeping up nationally, with patients now paying about $49.30 if they are not bulk-billed.\n\n'Really encouraging' report\n\nCaroline Johnson, a GP and associate professor of General Practice and Primary Care at the University of Melbourne, said the increase to bulk-billing across the country would be \"very pleasing\" to the federal government.\n\nCaroline Johnson says more needs to be done to make medical care equitable. (Supplied: Peter Casamento)\n\n\"It suggests that the rates of bulk-billing are starting to change as a result of some of the interventions the government have made in 2025,\" Dr Johnson said.\n\n\" General practice is the quintessential population-level health intervention and you have to believe everybody should have access to affordable care, so on that front this is really encouraging. \"\n\nBut Dr Johnson said affordability was only part of the challenge.\n\n\"Affordability is just one of the five dimensions of access, and if we only focus on cost we risk overlooking whether people are getting care that is acceptable, appropriate and delivered at the right time,\" she said.\n\nDr Johnson said the surge in fully bulk-billing clinics across the country was an encouraging early sign but it was \"too early\" to call it a success.\n\n\"The real test will be whether people … feel their care has actually improved, not just become cheaper on paper,\" she said.\n\nFederal Minister for Health and Ageing Mark Butler said the data in the Cleanbill report \"should not be relied upon\".\n\n\"On clinic numbers, they failed, for example, to include clinics that did not answer their questions,\" he said.\n\n\"Since November 1, more than 3,200 practices are now fully bulk-billing. Almost 1,200 of these were previously mixed-billing practices.\n\n\"Close to 7,500 general practices are now registered with MyMedicare. This has increased significantly since 1 November 2025.\"\n\nRoyal Australian College of General Practitioners (RACGP) president Michael Wright said bulk-billing levels remained high and that most GPs were \"continuing to bulk-bill the majority of consultations\".\n\nHowever, Dr Wright said Medicare rebates were not keeping up with the true cost of care and that RACGP data indicated the average length of appointments was rising, along with consultation complexity.\n\n\"We need to make sure that all Australians have affordable access to GP services, particularly those people with complex health conditions who need more time with their GP,\" he said.\n\n\"That's why we're calling for a boost to Medicare funding for the long consults these patients need.\"\n\nCanberra paying more\n\nThe report showed only 11.1 per cent of ACT clinics were fully bulk-billing, while the average standard consultation fee had climbed to about $100.33, the highest in the country.\n\nMany Canberra patients told the ABC the numbers on paper matched what they were experiencing.\n\nJayde Parker and her children (Savannah and Wiliam) struggle to access medical care. (Supplied: Jayde Parker)\n\nNDIS support coordinator and practitioner Jayde Parker, from Gordon, about 30 kilometres south of Canberra's centre, said the majority of her patients had to choose between \"food or the doctor\".\n\n\"They might have to travel 35 or 40 minutes across town [to access a bulk-billing clinic] and they often don't have a car, they don't have the money for a taxi and public transport doesn't get them to the door,\" she said.\n\nShe said she paid the price personally in 2023 when she delayed care for pneumonia because she could not afford the doctor.\n\nMs Parker said she had to wait four days to access a bulk-billing doctor, who sent her straight to hospital.\n\nJayde Parker was hospitalised after delays accessing a bulk billing doctor. (Supplied: Jayde Parker)\n\n'How do they manage?'\n\nRetired public servant Robyn Shaw, 71, has lived in Canberra since the 1970s and said she remembered when GP visits were almost always bulk-billed.\n\nThese days, she said, she paid about $109 for a standard appointment in Casey, getting about $40 back from Medicare.\n\nRobyn Shaw remembers when most clinics in Canberra were bulk-billed. (Supplied: Robyn Shaw)\n\n\"I can afford it,\" Ms Shaw said.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/asx-markets-business-news-live-updates/106218522",
    "title": "Live: ACCC reportedly to sue Coles, Woolies as US Fed chair faces criminal probe",
    "publish_date": "Sun, 11 Jan 2026 20:31:10 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts",
      "Emilia Terzon",
      "Ben Butler"
    ],
    "text": "Wall Street's key S & P 500 index gained another 0.6% to propel it to yet another record close, little affected by weaker-than-expected jobs data.\n\nThe blue-chip Dow gained 0.5%, while tech-centric Nasdaq picked up 0.8% on strong demand for chipmakers and the likes of Broadcom (+3.8%), Alphabet (+1%) and Tesla (+2.1%).\n\nIntel jumped 11% after US President Donald Trump said he had a \"great meeting\" with the chipmaker's CEO, Lip-Bu Tan.\n\nWall Street shows little sign of a New Year's hangover, with the S & P 500, Dow and Nasdaq up 1.6%, 1.9% and 2.3% respectively in their first full week's trading of the year.\n\nEuropean stocks, as measured by the Eurostoxx 600, also closed at a record, as did the UK's FTSE.\n\nThe ASX looks like trailing along in that risk-on vibe, with futures trading pointing to a 0.3% gain on opening.\n\nThe US Bureau of Labor Statistics monthly report showed 50,000 workers were added to nonfarm payrolls in December, compared with expectations for a rise of 60,000.\n\nThe impact of soft job creation was offset by a slight decline in the unemployment rate, down a tick to 4.4% from 4.5% in November.\n\nOverall, the jobs figures were seen as giving the Fed some \"breathing space\" to leave rates on hold, with the chance of a January rate cut easing from 14% to just 5%.\n\nThat meant US Treasuries and the US dollar edged higher and the Aussie dollar lower.\n\nGold pushed back above $4,500/ounce, while copper also rose (+2.1%), clinching its fourth consecutive week of gains.\n\nOil also bubbled up, the global benchmark Brent crude gained 2.2% to $63.34/barrel to be up around 4% over the week.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/iga-swiatek-fitness-united-cup-poland-switzerland/106219014",
    "title": "'Super sore' Iga Świątek plays down fitness concerns on Australian Open eve",
    "publish_date": "Sun, 11 Jan 2026 19:58:55 +0000",
    "category": "sports",
    "authors": [],
    "text": "Concerns over Iga Świątek's fitness and form are overshadowing Poland's breakthrough United Cup final triumph over Switzerland in Sydney.\n\nKatarzyna Kawa and Jan Zielinski clinched Poland's maiden title with a typically steely 6-4, 6-3 victory over Belinda Bencic and Jakub Paul in the deciding mixed doubles rubber under a closed roof at Ken Rosewall Arena.\n\nThe Swiss defeat denied Bencic a perfect 10 out of 10 for the tournament, after the tournament MVP and Tokyo Olympics gold medallist had upset an ailing Świątek 3-6, 6-0, 6-3 for a fifth consecutive singles win to go with four doubles successes with the unheralded Paul.\n\nHubert Hurkacz levelled the tie at one rubber apiece with a pulsating 6-3, 3-6, 6-3 victory over Switzerland's inspired playing captain Stan Wawrinka.\n\nThe 40-year-old triple grand slam winner whipped fans into a frenzy and gestured love-heart signs to the delirious crowd after dragging his 16th-seeded Swiss underdogs to within a set of improbable Cup glory at the $17 million mixed showpiece.\n\nWawrinka wowed spectators as Hurkacz threatened to unravel under the crushing pressure of trying to keep the Poles in the tie.\n\nAlas, the retiring champion wilted after nabbing the second set as Poland stormed to a first United Cup crown after losing back-to-back finals in 2024 and 2025.\n\nBut while her team rejoiced, Świątek will arrive in Melbourne with her health and game under intense scrutiny after a series of mysterious meltdowns and lacklustre showings in Sydney.\n\nIga Świątek suffered two tough losses on the weekend. (Getty Images: Brendon Thorne)\n\nIn a worrying development just a week out from the Australian Open, the world number two left the court for treatment after suffering a rare bagel in her deflating loss to Bencic.\n\nŚwiątek was in state of complete despair by the end, tossing her racquet across the court and bursting into tears following her second straight defeat at the event.\n\nWorld number one Aryna Sabalenka underlined her Open favouritism with a third successive Brisbane International crown on Sunday, but second-ranked Świątek's defeat against the Swiss marked her second of the week after a straight-sets loss to world number four Coco Gauff on Saturday night.\n\nThe six-time grand slam winner was also seen crying at the first changeover during her victory over Australian Maya Joint on Friday night.\n\nEcstatic with Poland's victory, Świątek played down any issues.\n\n\"Everything is fine. Just super sore,\" she said.\n\n\"First tournament of the year, it causes the body [to feel] a bit different. Differently than during the season. But I had similar experience last year also, so I'll just get good recovery, a couple of days off.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Also, these team events, I really love them, but they really take a lot of energy from you. So I still need to figure out how to balance that maybe in the future because I get so excited on the bench.\n\n\"It's almost like playing a match, honestly, so, yeah, it's all good.\"\n\nBut after snaring the third leg of a fabled career grand slam with a famous 6-0, 6-0 Wimbledon final triumph last July, the state of the 24-year-old's health and game will be among the major talking points in the countdown to the season's first major starting next Sunday at Melbourne Park.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/camping-gear-abandoned-at-festivals-causing-huge-waste-problem/106210328",
    "title": "Walking through post-festival camp full of abandoned gear feels like 'shopping'",
    "publish_date": "Sun, 11 Jan 2026 19:56:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "When car trouble left Larissa Stubbings stranded at a music festival more than 1,000 kilometres from home, she had no trouble finding somewhere to sleep for the night.\n\nOn New Year's Day, music fans left the campsite at Victoria's Beyond The Valley event littered with abandoned tents and camping equipment.\n\nLarissa Stubbings collected abandoned camping gear while she was stranded at Beyond The Valley. (Supplied)\n\n\"We were able to gather literally everything we needed; new tents, blow-up mattresses, water and so much unopened food,\" Ms Stubbings said.\n\n\" It was really surreal. It felt like we were shopping because there was so much left behind. \"\n\nEntire campsites were left behind at New Year's Eve festivals. (Supplied: Beth Green)\n\nWhen the 20-year-old shared her experience on social media, the consensus among commenters was that the volume of trash was nothing unusual.\n\n\"I was so shocked to see how many people left their belongings, but it was even more shocking that it was normal for everyone online,\" she said.\n\n\"Everyone is really tired after a multi-day festival, but I didn't think people were that lazy or careless.\"\n\nPotential solutions\n\nGreen Music Australia chief executive Berish Bilander said that, despite being a long-standing and contentious issue, more work was needed to regulate campsites at music festivals.\n\nBerish Bilander says festival-goers need to keep each other accountable when it comes to waste. (Supplied)\n\n\"More than half of the waste that comes out of these events is from the campsites,\" he said.\n\n\"Thousands of pieces of very cheap camping gear come through the gates only to end up in the trash a day later.\n\n\"An initiative we've seen really work is the pre-made tent villages, so patrons don't have to bring their own camping gear.\"\n\nCampsites are responsible for more than half the rubbish accumulated at music festivals. (Supplied: Beth Green)\n\nMr Bilander said the biggest hurdle was creating a cultural shift among festival-goers.\n\n\"It's all about the ethics of the people at the event; if everyone is holding each other accountable, they'll leave the place cleaner than they found it,\" he said.\n\n\"We've seen that work when a festival has that energy, and there's a real commitment to either borrow or not bring low-cost camping gear.\"\n\n'Cultural shift' needed\n\nResearch by Green Music Australia has found one in three tents taken to a music festival is left behind.\n\nStatistics show that one in three tents entering a music festival will be left behind. (Supplied: Beth Green)\n\nThat statistic rings true for Joshua Davies from B-Alternative, who operated at this year's Lost Paradise event on the NSW Central Coast.\n\n\"It really is a growing culture of consumerism, buying something extremely cheap knowing you'll only use it once,\" he said.\n\n\"But it's nothing new — we've seen it for decades, but cheap products are easier than ever to obtain.\"\n\nJoshua Davies has been dropping off the forgotten festival camping gear to local rough sleepers and charities. (ABC Central Coast: Shauna Foley)\n\nSocial enterprise B-Alternative hosted a repair facility at Lost Paradise, where patrons could have problems with tents and other camping equipment fixed onsite.\n\nMr Davies said the space helped start conversations with festival-goers about their responsibility to \"leave no trace\".\n\nDozens of discarded tents and other camping gear were donated to local rough sleepers. (Supplied: Joshua Davies)\n\n\"It's a chain reaction,\" he said.\n\n\" If we can influence one person, they'll take that mindfulness with them and carry it on. \"\n\nAfter the event, Mr Davies and his team used several removalist trucks to deliver abandoned camping gear to charities, op shops and rough sleepers in the area.\n\n\"Until we see that cultural shift, we'll continue to see all this mountain of perfectly usable camping equipment go into landfill,\" he said.\n\n\"We were fortunate to have the right stakeholders in place this time to salvage what was left behind, though that's not always the case.\n\n\"But [festival organisers] need to be frank with patrons and show them the aftermath of their fun.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-12/supporting-your-child-when-starting-child-care-or-kindy/106115412",
    "title": "Your rights when settling your child into child care or kindy",
    "publish_date": "Sun, 11 Jan 2026 19:52:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prior to Brie's three-year-old son starting kindergarten, he had never been in the care of anyone other than his parents.\n\n\"Any new environment, or environment without us, obviously impacted him greatly,\" says the 44-year-old from Geelong/Djilang, who asked we keep her real name private.\n\nKnowing her son's temperament and needs, she worked with the kindergarten on how best to transition him.\n\n\"We met with the kindergarten initially and asked if we could stay for as long as we wanted.\n\n\"They did say 'yes, that's definitely an option', and that they have kids in this situation [who might struggle with adjusting] all the time.\"\n\nThe transition, as Brie and her husband had expected, was hard to begin with.\n\nThe pair took turns staying at the service with their son, sometimes up to five hours each day. They did that for six weeks.\n\nHow the childcare abuse crisis is rewriting parenthood The childcare abuse crisis has left some families questioning if their kids are safe in daycare. Will primary carers, mostly women, be the collateral damage?\n\nIt's natural to feel nervous about transitioning your baby or child into early childhood education, explains Nesha Hutchinson, vice president at the Australia Childcare Alliance.\n\n\"It's a really normal response and this is why childcare centres have their own processes they know work for their particular community.\"\n\nKnowing some settling techniques, as well as what you can advocate for on behalf of your child, can help their transition.\n\nGet to know the centre\n\nIt's important to spend as much time at the centre as possible in the lead up to starting there, says Ms Hutchinson, such as attending orientations.\n\nIf you feel your child needs more time to adjust, you can request more orientations or \"stay and plays\" than what is offered, she says.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nMs Hutchinson recommends attending the centre at different times too, so you can get to know all the educators employed there. Some may only be there at drop-off times, but not pick-ups, for example.\n\nAsk questions about the routines, such as where children will be sleeping, at what times of day, and where they will eat lunch.\n\n\"Get to know that routine … and talk about it positively with your child,\" Ms Hutchinson says.\n\nWith babies, she says you may be able to stay in the centre to put them to sleep and be there when they wake up. Then transition to putting them to sleep, but allowing an educator to wake them while you are in the room. And next time be present while an educator does both.\n\n\"All those sorts of things can be really helpful,\" Ms Hutchinson says.\n\nChildren will follow your lead\n\nSheila Degotardi is a professor and director of the Macquarie University Early Childhood Education Research Centre.\n\nShe says families spending time at the service helps prepare the child for days without a caregiver or parents present, rather than \"leaving them without warning\", which can raise their anxiety and distress.\n\nIt also means the child can see you establishing relationships with educators, enabling them to build trust.\n\nEvery child care or kindergarten will have processes when it comes to settling a child in. (Pexels)\n\nProfessor Degotardi says children, even babies, are \"very perceptive\" and will identify how the family and educators are relating and interacting.\n\n\"Take that time to be in the room with your child, so the child starts to see, 'OK, well my parents are chatting away to the educators, that seems to be OK, so maybe those educators are OK.'\n\n\"Relationships don't happen by chance, they happen over time with repeated, positive interactions.\"\n\nIf you can't spend much time in the centre, Professor Degotardi suggests tag teaming with a partner or other trusted family members.\n\nShe says parents and caregivers can take cues from educators on when it might be a good time to leave, even if that's for short periods of time to begin with.\n\nThat goodbye process can be difficult for parents and children.\n\nProfessor Degotardi says you know your child and their needs best. While some parents may decide a short goodbye process is best, others may choose to stay longer.\n\n\"If the child is really clinging on to their parent, and if the crying persists, that may indicate that the child is struggling,\" Professor Degotardi says.\n\n\"It's OK to say 'Well I don't need to leave right now, let's get on the floor and play together' and an educator can join in, to build that trust.\"\n\nMs Hutchinson recommends parents and caregivers work towards short and consistent drop-off routines, adding parents who leave while their child is upset can request a call from the centre for an update.\n\nShe says children often settle within five minutes of a parent leaving.\n\nTransitional objects and rituals\n\nTaking comfort toys, also known as transitional objects, to the service can help infants and young children feel calm, says Ms Hutchinson.\n\nIt might be a T-shirt mum puts under her arm in bed each night that absorbs familiar smells for the baby — \"especially if she is breastfeeding\" — or a favourite teddy or a family photo, she says.\n\n\"Photos from home can be really reassuring, many centres often have a family wall so kids feeling anxious can look at a photo.\"\n\nThere are different ways to think of transition objects, says Professor Degotardi, who used a \"ritual\" instead. She would give her son's hand a kiss through the fence as she was exiting the centre, leaving a lipstick mark.\n\n\"It helped him feel secure.\"\n\nThis dad's experience with separation anxiety On the eve of his son's first day at childcare, Dave Couri was in tears.\n\nSettling in can take time\n\nBrie hoped being present in the kindergarten with her son for long periods would help him feel safer to build connections with educators and children.\n\nWhile she says she didn't always feel her presence was supported by the centre, or that the educators were motivated to try alternative strategies, things eventually improved for her son.\n\n\"Our transition was more gentle and set him up for success.\n\n\"When we did leave, there was tears, but at least we knew he was familiar with the space, with the educators, he had made connections with the children, so he could seek comfort, whether that was an activity, a toy, a friend, or somebody.\n\n\"It was all about his temperament, and nurturing that, and not expecting him to change, but changing his environment to allow him to feel confident and comfortable.\"\n\nMs Hutchinson says open and honest communication with the educators and centre director is key.\n\nIf a child isn't settling well, \"it can take time to work out what is going on,\" she says.\n\n\"Talk to the educators, spend time there being positive. Kids read whether you are happy or not, and act accordingly.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/2026-golden-globes-opening-monologue-20260112-p5ntdw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2026 Golden Globes opening monologue",
    "publish_date": "Mon, 12 Jan 2026 13:08:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "2026 Golden Globes opening monologue\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/business/companies/dateline-drills-epic-gold-widths-in-california-20260112-p5ntd9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dateline drills epic gold widths in California",
    "publish_date": "Mon, 12 Jan 2026 13:06:20 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Dateline Resources has snagged another set of impressive, wide, and open gold intercepts from beyond the currently defined resource boundary at its Colosseum gold and rare earths project in California.\n\nThe company says results from six diamond and ten reverse circulation (RC) holes drilled around the South and North pits have improved the continuity of mineralisation beneath the North pits and, in several instances, returned results outside the current mineral resource envelope.\n\nDrilling at Dateline Resources’ Colosseum gold project in California.\n\nStandout intercepts were led by a massive 295.64-metre hit grading 1.04 grams per tonne gold (g/t) from surface. That was backed up with a second solid 105.15-metre strike going 0.66g/t gold from surface. A third hit measured a mammoth 300.21 metres running at 0.66g/t gold, potentially confirming a huge-scale mineralised system.\n\nDrilling has confirmed that the felsite breccia pipe, the primary host rock, extends beyond known limits. Better still, the mineralisation appears to line up neatly with the magneto-telluric (MT) resistivity model, tracking straight into the high-conductivity zones.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/get-a-taste-of-the-amalfi-coast-at-a-new-gelato-shop-on-grattan-street-20260112-p5ntdc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Get a taste of the Amalfi Coast at a new gelato shop on Grattan Street",
    "publish_date": "Mon, 12 Jan 2026 13:03:49 +1100",
    "category": "finance",
    "authors": [
      "Haymun Win"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSorbet is served in real, hollowed out fruit at Taste of Amalfi’s permanent Carlton store.\n\nSorbet is served in hollowed out fruits at Taste of Amalfi.\n\nCafe$$$$\n\nCouple Milos Kalajdzic and Nada Mandic visited the Amalfi Coast in 2023 and were enamoured with the tradition of serving lemon sorbet in real, hollowed-out lemons. Back in Melbourne, they started with a sorbet cart and pop-ups before opening this shop, where fresh fruit such as strawberries and mango are turned into sorbets and served in a frozen fruit cup. Coming up next: plum.\n\nMust-try scoop: The sorbet that started it all, made from locally grown lemons (occasionally from customers’ backyards).\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/consumer-affairs/halting-all-bookings-sendle-keeps-customers-in-the-dark-amid-abrupt-closure-20260112-p5ntbj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Halting all bookings’: Sendle keeps customers in the dark amid abrupt closure",
    "publish_date": "Mon, 12 Jan 2026 12:56:35 +1100",
    "category": "finance",
    "authors": [
      "Jessica Yun"
    ],
    "text": "Delivery software platform Sendle has left its customers in the dark about its sudden shutdown after a major investor froze funding following the discovery of “significant deficiencies” in Sendle’s parent company.\n\nThe courier network, which had been positioning itself as an alternative to Australia Post, issued an email to customers on Sunday morning stating it was ceasing operations.\n\n“I am sorry to let you know that, effective immediately, Sendle will be halting all bookings for parcel pickup and delivery,” the email said.\n\nSendle founder James Chin Moody. Sendle has abruptly ceased operations in Australia and Canada. Credit:\n\nDeliveries scheduled for today or a later date have been cancelled, while parcels that have already been picked up or were on their way may have been fulfilled “at the discretion of the delivery partner”.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/business/consumer-affairs/on-gelato-and-in-coffee-australian-olive-oil-s-health-led-boom-20260109-p5nsvp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "On gelato and in coffee: Australian olive oil’s health-led boom",
    "publish_date": "Mon, 12 Jan 2026 12:49:40 +1100",
    "category": "finance",
    "authors": [
      "Elias Visontay"
    ],
    "text": "Australian olive oil has a reputation as a premium, more expensive product, but the shortage has seen restaurants turn their searches to the local sector, Karam said. This past season, local production was roughly 20,000 tonnes, supplying about one third of domestic consumption. That contribution is expected to grow further, ANZ’s latest Food for Thought insight report found. “Global production will eventually normalise, but the market has fundamentally changed,” Karam said. ‘No longer a niche ingredient’ Australia’s olive oil industry’s focus remains on high-quality extra virgin oil (EVOO), the highest grade made with just one pressing, and without the need to refine the product to remove defects.\n\nBeyond its status as a gourmet cooking oil, EVOO has emerged as a health food. Its high polyphenol content – an antioxidant that helps reduce inflammation and improve cholesterol, among other benefits – is proving to be a lucrative attribute for EVOO producers. This was acknowledged by Cobram Estate when announcing its Californian expansion. Chairman Rob McGavin told the Australian Financial Review ″⁣every day there are articles on extra virgin olive oil and its benefits”. Richard Seymour, general manager of Mount Zero Olives Credit: Mount Zero Olives Health conscious consumers come from all walks of life. “For older consumers it may be seen as improving heart health and moderation, while for younger ones it ties in with natural eating, wellness and authenticity,” ANZ’s insights found. Karam said the publicity of olive oil as a health food has meant it’s “no longer a niche ingredient. It is part of daily cooking, supported by health trends, and the appeal of the Mediterranean diet.”\n\n“That shift is driving interest in provenance, freshness and trusted brands – areas where Australian producers excel,” Karam said. Adding to the appeal is that Australia’s counter-season harvests come to market just as northern hemisphere stocks run low. Gelato paired with extra virgin olive oil at a collaboration event between Bottega 1900 and Rivareno gelato. Credit: Rivareno Gelato Mount Zero Olives, which draws produce from Victoria’s Wimmera and Grampians, has been “flooded by inquiries”, said general manager Richard Seymour. “When the European supply really suffered, we noticed this almost insatiable demand to inquire about Australian olive oil,” said Seymour, whose premium olive oil business has largely moved to sourcing and pressing the fruits after his family sold properties where it previously farmed groves. “Suddenly we were going from hatted restaurants, our bread and butter for years, to pubs and all kinds of eateries we thought we’d never supply,” he said.\n\nBusiness is so strong, Mount Zero now has to reject some inquiries from restaurants to ensure they meet demand for long-time customers. However, Seymour cautions that while revenue might be up due to price rises, cost-conscious chefs and consumers might look to buy less in volume terms and move to alternatives if prices climb further. Seymour also notes the relatively small yield from each olive when making EVOO means margins are tight. “If you’re making grape juice, 90 per cent of the juice out of a grape is marketable, but with olives, it’s somewhere between 10-20 per cent,” he said. To make a standard 500ml bottle of EVOO can require as much as 5 kilograms of olives. Enea La Mantia, of Sydney’s Bottega 1900 and Olive Oil Hub, tasting extra virgin olive oil Early harvesting of the fruit leads to a smaller yield but more complex taste, while the producers of lower quality, flatter tasting products might wait for groves to mature to get higher yields from each press.\n\nMassaria, who imports largely from Italy and sells them with listings of their polyphenol content, said that awareness and interest in specialty EVOO has taken off in Australia in the past few years. As a qualified sommelier and wine director in Sydney’s restaurant scene, she is hoping to bring the same level of integrity to olive oil. Enea La Mantia at a recent extra virgin olive oil tasting event run by Bottega 1900 in Sydney. Credit: Bottega 1900 Since launching in 2020, Bottega 1900 also organises olive oil tasting evenings, similar to wine-style events. Initially it was chefs and specialised customers most involved with tastings, but Massaria said this has expanded. “Reactions [at tastings] are often revelatory for people,” she said. “They show that premium extra virgin olive oil isn’t limited to the kitchen bench…many Australians are only just beginning to discover its true potential.” Massaria – who spoke from Italy, where she is visiting producers ahead of new season European harvests arriving in Australia for sale from February – has previously collaborated with gelato chain Rivaereno in pairing different olive oils to drizzle over frozen scoops. One of its fine-dining restaurant customers also added EVOO-topped gelato to its menu.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/order-matcha-selected-by-a-tea-sommelier-at-this-sweet-japanese-cafe-20260112-p5ntd4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Order matcha selected by a tea sommelier at this sweet Japanese cafe",
    "publish_date": "Mon, 12 Jan 2026 12:40:35 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nFulfil any Japanese food cravings at Chayo in Clayton.\n\nThe matcha (green tea) is selected by Chayo’s tea sommelier.\n\nJapanese$$$$\n\nHere to fulfil any Japanese food cravings, sweet little Chayo starts with breakfasts such as matcha granola, continues with teishoku brunch sets and curry rice, and pushes the crave button with a karaage chicken burger. The drinks menu is great, too: matcha is selected by a tea sommelier and there are yuzu citrus drinks, both hot and iced.\n\nGood to know: Minimaru next door sells Japanese homewares and cooking gear.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/queensland/bulk-billing-clinics-balloon-across-queensland-but-patients-are-paying-more-20260112-p5ntb9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bulk-billing clinics balloon across Queensland, but patients are paying more",
    "publish_date": "Mon, 12 Jan 2026 12:35:01 +1100",
    "category": "lifestyle",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "Queenslanders are paying nearly $50 in out-of-pocket costs to visit a doctor, despite the number of bulk-billing services nearly doubling across the state in the past year, a report shows.\n\nThe data, released on Monday by healthcare directory Cleanbill, puts the average out-of-pocket cost to visit a GP in Queensland at $48.58 – $5.25 higher than in 2025.\n\nFederal government incentives have influenced a rise in bulk billing services across Australia, but many patients are still paying high out-of-pocket costs to see a GP. Credit: Joe Armao\n\nThis is despite the number of bulk-billing clinics nearly doubling, with more than 400 of the state’s 1361 practices offering bulk-billing services.\n\nThe release of Cleanbill’s report followed the federal government’s expansion of the Bulk Billing Practice Incentive Program (BBPIP) in November, which increased incentives for GP clinics to fully bulk bill.",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/sport/terrifying-scenes-as-three-us-bobsleigh-teammates-lose-grip-20260112-p5ntcz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Terrifying scenes as three US bobsleigh teammates lose grip",
    "publish_date": "Mon, 12 Jan 2026 12:32:16 +1100",
    "category": "sports",
    "authors": [],
    "text": "Terrifying scenes as three US bobsleigh teammates lose grip\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/cycling/wa-s-coupland-claims-road-championship-title-in-tight-finish-20260112-p5ntcn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA’s Coupland claims road championship title in tight finish",
    "publish_date": "Mon, 12 Jan 2026 12:28:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "A year after the favourites let the break out too far and Lucy Stewart capitalised, this time it was a much tighter race.\n\nIt was the second-straight year that a 20-year-old won the women’s road race, also claiming the under-23 category, but it came amid vastly different circumstances.\n\nCoupland rode a smart race on Sunday and capitalised on Liv AlUla Jayco’s strength to win the women’s elite road championship.\n\nWestern Australian cyclist Mackenzie Coupland has scored a popular hometown win after taking out the women’s elite road championship in Perth.\n\nCoupland’s teammate Josie Talbot was the last survivor of a three-rider break that had gone clear early in the 109km event, but was never allowed a gap of more than a minute 30 seconds.\n\nCoupland bridged to Talbot on the last of eight laps, initially thinking she would support her teammate.\n\nBut Talbot was exhausted and Coupland took the lead by herself with 8km left, quickly realising the race was hers to win.\n\nAsked what went through her mind at the point, Coupland said: “You know what? Just dig deep, you never know what can happen.\n\n“I knew I had really strong teammates behind me in the peloton. I knew even if I was caught, I had teammates to back it up.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/eagles-coach-separated-from-star-player-20260112-p5ntcw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Eagles coach separated from star player",
    "publish_date": "Mon, 12 Jan 2026 12:26:53 +1100",
    "category": "sports",
    "authors": [],
    "text": "Eagles coach separated from star player\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/chair-quits-adelaide-festival-board-as-writers-week-crisis-continues-20260112-p5nt9u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chair quits Adelaide Festival board as writers’ week crisis continues",
    "publish_date": "Mon, 12 Jan 2026 12:21:13 +1100",
    "category": "entertainment",
    "authors": [
      "Kerrie O'Brien"
    ],
    "text": "Adelaide Festival chair Tracey Whiting has resigned, becoming the fourth board member to quit over the decision to remove Dr Randa Abdel-Fattah from the Writers’ Week program.\n\nTracey Whiting has resigned as chair of the Adelaide Festival Board.\n\nWhiting announced her resignation in a post to LinkedIn on Sunday evening, writing “Recent decisions were bound by certain undertakings and my resignation enables the Adelaide Festival, as an organisation, to refresh its leadership and its approach to these circumstances.”\n\nShe did not offer further comment.\n\nWith only three remaining members – Leesa Chesser, Adelaide city councillor Mary Couros, and Brenton Cox – former Adelaide Writers’ Week director Jo Dyer said on BlueSKy the board was now in breach of the Adelaide Festival Corporation Act which states, “At least 2 members must be women and at least 2 must be men.”",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-most-and-least-expensive-places-to-see-a-doctor/g5llz5t01",
    "title": "Revealed: Where Australians are paying the most (and least) to see a doctor",
    "publish_date": "Mon, 12 Jan 2026 01:06:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "More medical clinics are fully bulk billing than a year ago, according to a new report, but patients are also facing higher out-of-pocket costs.\n\n\n\n\n\nCleanbill on Monday released the results of a national survey, which contacted 6,877 clinics across the country and found the proportion of fully bulk-billing clinics had almost doubled in a year, from 20.7 per cent to 40.2 per cent.\n\n\n\n\n\nThe survey, conducted between 1 November and mid-December 2025 and disputed by the federal government, also found that out-of-pocket costs have grown for patients who aren't bulk billed.\n\n\n\nWhat do the numbers show?\n\nCleanbill reports over 1,000 clinics switched from private/mixed billing to fully bulk billing in 2025.\n\n\n\n\n\nBut visiting one of the almost 60 per cent of clinics that aren't fully bulk-billing has become more expensive. The average out-of-pocket cost for a standard consultation has grown from $43.38 to $49.23 in a year, according to the report.\n\n\n\nThe report defines the bulk billing rate as the number of clinics that will bulk bill a new adult patient without concessions who attends a standard consultation during regular hours, divided by the total number of available clinics in the area.\n\n\n\n\n\nCleanbill collects this data by contacting clinics and inquiring whether they offer bulk billing to such patients.\n\n\n\n\n\nHealth Minister Mark Butler said \"specific data\" in the report \"cannot be relied upon\".\n\n\n\n\n\n\n\n\"On clinic numbers, they failed, for example, to include clinics that did not answer their questions,\" he said in a statement to SBS News on Monday morning.\n\n\n\n\n\nThe percentage of fully bulk billing clinics has almost doubled to over 40 per cent nationally, with this rate surpassing 50 per cent in NSW and the Northern Territory, according to the Cleanbill report. Source: SBS News Cleanbill's report said clinics that did not respond or refused to share pricing or availability details were recorded in its database but left out of its analysis where costs could not be verified.\n\n\n\nWhere are Australians spending the most on GPs?\n\nAustralia's smallest and least populous jurisdictions are the most expensive for an adult patient without concessions, according to the report.\n\n\n\n\n\nTasmania has the highest average out-of-pocket cost for a standard consultation at $60.76 in 2026, followed by the ACT and Northern Territory.\n\n\n\n\n\nNSW, Victoria, Queensland and South Australia all sit narrowly above or below the nationwide average out-of-pocket cost of $49.23, while Western Australia was the cheapest area at $46.63.\n\n\n\nTasmania has the highest average out-of-pocket cost for a standard consultation at $60.76, followed by the ACT and Northern Territory. Source: SBS News Meanwhile, the number of bulk-billing clinics rose by 19.5 per cent across the country, the report found.\n\n\n\n\n\nGovernment figures show that since 1 November, more than 3,200 practices are now fully bulk-billed. Almost 1,200 of these were previously mixed billing practices.\n\n\n\n\n\n\"Close to 7,500 General Practices are now registered with MyMedicare. This has increased significantly since 1 November 2025,\" Butler said.\n\n\n\n\n\n\"By 2030, the number of fully bulk-billed practices will be boosted to around 4,800 nationally.\"\n\n\n\n\n\nThe Royal Australian College of GPs (RACGP) said the availability of bulk billing indicated by both the Cleanbill report and federal government data was \"good news\", but added it was not surprising out-of-pocket costs were on the rise.\n\n\n\n\n\n\"Medicare data show that most GP visits continue to be delivered without cost. However, the RACGP’s Health of the Nation report highlights that consultation complexity and average length are both rising,\" said RACGP president Dr Michael Wright.\n\n\n\n\n\n\"At the same time, Medicare rebates haven't kept pace with the cost of care for many patients. So, it is not surprising to see that out-of-pocket costs are increasing where new incentives don't cover the cost of providing high-quality care.\"\n\n\n\n\n\nWright said improved access to GP services in rural areas was positive but warned affordability remained a barrier for patients needing longer consultations, particularly for complex or mental health conditions.\n\n\n\n\n\nHe said Medicare funding for extended appointments needed to be improved to ensure patients were not disadvantaged.\n\n\n\nWhat is the bulk billing scheme?\n\nThe government has expanded the bulk billing scheme to all Australians and is offering a 12.5 per cent incentive payment on Medicare rebates for clinics that bulk-bill all eligible patients, split between the GP and the practice, to boost accessibility and encourage fully bulk-billed services.\n\n\n\n\n\nThe government has said the policies will triple the number of fully bulk-billed practices to around 4,800 nationally by 2030 .\n\n\n\nREAD MORE Where Labor plans to build 50 new bulk billing urgent care clinics\n\nIt means the Medicare payment for a standard GP consultation at a bulk-billed, city practice will be almost two-thirds higher — from $42.85 to $69.56.\n\n\n\n\n\nFor a regional or rural practice, it will be almost doubled, from $42.85 to up to $84.86, depending on location.\n\n\n\n\n\nAt the time of the policy announcement last year, Australian Medical Association president Danielle McMullen said there would be a shift in the rates of no out-of-pocket consultations in parts of the country.\n\n\n\n\n\nHowever, some areas would see no difference.\n\n\n\n\n\n\"I do hope this will make a difference in rural and regional communities and in our areas of socio-economic disadvantage, where GPs have been really trying as hard as they can to keep those costs down,\" McMullen said at the time.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 14
  },
  {
    "url": "https://www.sbs.com.au/news/article/big-bill-for-taxpayers-but-cheaper-for-patients-wegovy-to-be-subsidised-says-minister/lfxblk2ck",
    "title": "'Big bill' for taxpayers but cheaper for patients: Wegovy to be subsidised, says minister",
    "publish_date": "Sun, 11 Jan 2026 21:59:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians could soon get cheaper access to the popular weight-loss drug Wegovy, with the federal government set to act on advice to list the Ozempic-like medication on the Pharmaceutical Benefits Scheme (PBS).\n\n\n\n\n\nHowever, it's unclear by how much it will be reduced, with Health Minister Mark Butler saying he's in the process of negotiating the price with the drugmaker Novo Nordisk.\n\n\n\n\n\nIt's also likely to cost the taxpayer a fair bit.\n\n\n\n\n\nButler on Friday confirmed he'd received advice to list the drug on the PBS from an advisory committee and would act soon on the matter.\n\n\n\n\n\n\"We'll start that process very quickly with the company, This is a pretty extraordinary class of drugs, the GLP-1s, not just for weight loss, but a range of other benefits as well,\" he said.\n\n\n\nCurrently, Ozempic — which is also a semaglutide injection — is listed on the PBS for those with Type 2 Diabetes under strict criteria, meaning a private fee of $134 comes down to $25 per unit.\n\n\n\nAustralians spending thousands of dollars out of pocket\n\nNearly 500,000 Australians — almost 2 per cent of the adult population — are using GLP-1, or Ozempic-like medications, for weight loss or medical reasons.\n\n\n\n\n\n\"Right now, more than 400,000 Australians are paying market prices for one of the GLP-1s, and that is as much as $4,000 or $5,000 a year, which is obviously beyond the means of many Australians,\" Butler said.\n\n\n\n\n\n\"This is not just a health issue for us. It's also an equity issue.\"\n\n\n\nButler said there is also likely to be a \"very big bill for taxpayers\".\n\n\n\n\n\n\"So it's incumbent on us as the government to negotiate a good price,\" he said.\n\n\n\nWhat have doctors and others said about listing?\n\nThe body representing GPs — the Royal Australian College of General Practitioners (RACGP) — has welcomed the move, but cautioned that funding for preventative health measures should not be sidelined.\n\n\n\n\n\nDr Michael Tam, a member of the RACGP expert committee, said: \"It's not a simple thing. We know these treatments are effective for individuals, but ideally, we want to reduce the burden of obesity from occurring in the first place.\"\n\n\n\n\n\nDietitians Australia expressed concern that without proper nutritional support, those on such medications could be at risk of malnutrition, loss of muscle and bone mass, and the development of disordered eating.\n\n\n\n\n\n\"Lasting improvements in health are achieved through comprehensive, multidisciplinary care that includes funded access to evidence-based nutrition support before, during and after treatment.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/cuba-defiant-after-trump-says-to-make-a-deal-before-it-is-too-late/3m6kmq4ia",
    "title": "Cuba defiant after Trump says to 'make a deal, before it is too late'",
    "publish_date": "Sun, 11 Jan 2026 20:45:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States President Donald Trump has said no more Venezuelan oil or money will go to Cuba and suggested the island should strike a deal with the US, ramping up pressure on its long-time nemesis and provoking defiant words from the island's leadership.\n\n\n\n\n\nVenezuela is Cuba's biggest oil supplier, but no cargoes have departed from Venezuelan ports to the Caribbean country since the capture of Venezuelan President Nicolás Maduro by US forces — widely seen as illegal by international law experts — in early January amid a strict US oil blockade on the OPEC country, shipping data shows.\n\n\n\n\n\nMeanwhile, Venezuela and the US are progressing on a US$2 billion ($3 billion) deal to supply up to 50 million barrels of Venezuelan oil to the US, with proceeds to be deposited in US treasury-supervised accounts, a major test of the emerging relationship between Trump and interim President Delcy Rodriguez.\n\n\n\n\n\n\"THERE WILL BE NO MORE OIL OR MONEY GOING TO CUBA — ZERO! I strongly suggest they make a deal, BEFORE IT IS TOO LATE,\" Trump wrote on his Truth Social platform on Sunday.\n\n\n\n\n\n\"Cuba lived, for many years, on large amounts of OIL and MONEY from Venezuela.\"\n\n\n\nCuban President Miguel Díaz-Canel rejected Trump's threat on social media, suggesting the US had no moral authority to force a deal on Cuba.\n\n\n\n\n\n\"Cuba is a free, independent, and sovereign nation. Nobody dictates what we do,\" he said on X.\n\n\n\n\n\n\"Cuba does not attack; it has been attacked by the US for 66 years, and it does not threaten; it prepares, ready to defend the homeland to the last drop of blood.\"\n\n\n\n\n\nTrump did not elaborate on his suggested deal.\n\n\n\nBut Trump's push on Cuba represents the latest escalation in his move to bring regional powers in line with the US and underscores the seriousness of the administration's ambition to dominate the Western Hemisphere.\n\n\n\n\n\nTrump's top officials, including secretary of state Marco Rubio, have made no secret of their expectation that the recent US intervention in Venezuela could push Cuba over the edge.\n\n\n\n\n\nUS officials have hardened their rhetoric against Cuba in recent weeks, though the two countries have been at odds since former leader Fidel Castro's 1959 revolution.\n\n\n\nCuba defends import rights\n\nCuban foreign minister Bruno Rodriguez said in another post on X on that Cuba had the right to import fuel from any suppliers willing to export it. He also denied Cuba had received financial or other \"material\" compensation in return for security services provided to any country.\n\n\n\n\n\nThirty-two members of Cuba's armed forces and intelligence services were killed during the US raid on Venezuela. Cuba said those killed were responsible for \"security and defence\" but did not provide details on the arrangement between the two long-time allies.\n\n\n\n\n\nCuba relies on imported crude and fuel, mainly from Venezuela and, in smaller volumes, from Mexico, bought on the open market to keep its power generators and vehicles running.\n\n\n\nAs Venezuela's refining capacity has dwindled in recent years, its supply of crude and fuel to Cuba has fallen. But the South American country is still the largest provider, with some 26,500 barrels per day exported last year, according to ship-tracking data and internal documents of state-run PDVSA, which covered roughly 50 per cent of Cuba's oil deficit.\n\n\n\n\n\nIt's hard for many Cubans to imagine a situation much worse. The island's government has been struggling to keep the lights on. A majority live without electricity for much of the day, and even the capital Havana has seen its economy crippled by hours-long rolling blackouts.\n\n\n\n\n\nShortages of food, fuel and medicine have put Cubans on edge and have prompted a record-breaking exodus, primarily to the US, in the past five years.\n\n\n\nMexico becomes key supplier\n\nMexico has emerged in recent weeks as a critical alternative oil supplier to the island, but the supply remains small, according to the shipping data.\n\n\n\n\n\nMexican President Claudia Sheinbaum said last week her country had not increased supply volumes, but given recent political events in Venezuela, Mexico had become an \"important supplier\" of crude to Cuba.\n\n\n\n\n\nUS intelligence has painted a grim picture of Cuba's economic and political situation, but its assessments offer no clear support for Trump's prediction that the island is \"ready to fall\", Reuters news agency reported on Saturday, citing three people familiar with the confidential assessments.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-is-australias-population-changing/5a2uxjpbt",
    "title": "Population growth, fertility rates and migration. What could Australia look like in 2035?",
    "publish_date": "Sun, 11 Jan 2026 18:32:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's population will grow by another four million people over the next decade despite falling migration and fertility rates.\n\n\n\n\n\nThe federal government's latest population statement predicts the current population of 27.5 million will grow to 31.5 million by the end of 2035. It's roughly 150,000 lower than projected in the previous population statement.\n\n\n\n\n\nThe Centre for Population, which collates the report, had previously predicted Australia would reach 31.65 million people by 2035.\n\n\n\n\n\nPopulation growth, which reflects migration trends and fertility rates, is expected to slow to 1.3 per cent in the coming year, falling short of earlier projections.\n\n\n\nSo what's behind the slowing growth, and which areas will witness the biggest change in population?\n\n\n\nNet overseas migration falls\n\nNet overseas migration is continuing to ease after reaching record highs in recent years, according to the report.\n\n\n\nThe Centre for Population had previously predicted Australia would reach 31.65 million people by 2035. Source: SBS News It is expected to total 260,000 people in 2025–26, well below the peak of 556,000 recorded in the 12 months to the September quarter of 2023.\n\n\n\n\n\nThe decline has been driven largely by fewer arrivals of temporary migrants, particularly those holding student and visitor visas.\n\n\n\n\n\nAlthough departures have increased overall since 2023–24, migrants on temporary visas are leaving Australia at lower rates than in the past.\n\n\n\nFertility rates continue long-term decline\n\nWhile two-child families remain the most common family size, smaller families are becoming more prevalent, and larger families continue to decline.\n\n\n\n\n\nAustralia's total fertility rate is projected to fall to 1.42 in 2025–26, remaining well below the \"replacement level\" of 2.1 children per woman.\n\n\n\nFertility has been below this benchmark for almost 50 years.\n\n\n\nLife expectancy on the rise\n\nAustralia continues to rank among countries with the highest life expectancy. By 2035–36, life expectancy is expected to reach 87.1 years for women and 83.4 years for men.\n\n\n\n\n\nThe collected data show health outcomes have shifted alongside longer life expectancy.\n\n\n\nThe five leading causes of death accounted for one-third of all registered deaths in 2024.\n\n\n\n\n\nIn order, these were: dementia (including Alzheimer's disease), ischaemic heart disease (reduced or blocked blood and oxygen supply to the heart), chronic lower respiratory diseases, cerebrovascular diseases (conditions that affect blood flow to the brain) and lung cancer.\n\n\n\nMedian age of Australians to increase\n\nWhile Australia remains younger than many comparable economies, the population continues to age due to lower fertility and longer life expectancy.\n\n\n\n\n\nThe median age is expected to rise by 1.8 years to 40.2 years by 2035–36, about half the rate of ageing experienced during the 1990s.\n\n\n\nThe number of very elderly Australians is projected to grow rapidly.\n\n\n\n\n\nBy 2065–66, there are expected to be 1.9 million people aged 85 and over — more than triple the current figure.\n\n\n\n\n\nRegional populations are generally older than those in capital cities across all states and territories, except for the Northern Territory.\n\n\n\nVarying rates of growth across the country\n\nPopulation growth and ageing patterns differ significantly across Australia.\n\n\n\n\n\nWestern Australia is projected to record the highest population growth rate at 1.8 per cent in 2025–26, while Tasmania is expected to grow the slowest at 0.1 per cent.\n\n\n\n\n\nCapital cities are projected to grow nearly twice as fast as regional areas, with Sydney and Melbourne both expected to surpass 8 million residents in the 2050s.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-you-need-to-know-about-the-super-k-flu-variant/tdpgmr6b2",
    "title": "The 'Super-K' flu variant is spreading in Australia. Here's what makes it 'unusual'",
    "publish_date": "Sun, 11 Jan 2026 00:13:41 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A new strain of influenza known as 'Super-K', or the subclade-K variant, could be responsible for an unusual spring and summer boost in flu cases, epidemiologists say.\n\n\n\n\n\n\"The unusual thing here for Australia is the timing,\" WHO Collaborating Centre for Reference and Research on Influenza director Patrick Reading told SBS News.\n\n\n\n\n\n\"The not unusual thing is probably the symptoms,\" he said.\n\n\n\n\n\nReading recalls the subclade-K variant emerged towards the end of Australia and New Zealand's typical flu season, circulating in September rather than the winter months.\n\n\n\n\n\n\"That was responsible for elevated influenza cases throughout the spring and actually throughout the start of our summer in December as well.\"\n\n\n\n\n\nAccording to the Global Initiative on Sharing All Influenza Data (GISAID), the total lab confirmed cases of subclade-K in Australia so far currently sits at 1,083.\n\n\n\n\n\nA new report by the Australian Centre for Disease Control (ACDC) stated that subclade-K's rapid spread has the potential to put increased pressure on Australian health care services over the summer and into the 2026 influenza season.\n\n\n\n\n\n\"Current case numbers for influenza are higher than usual for this time of year compared to previous seasons,\" an ACDC spokesperson said.\n\n\n\nSo far this year, over 4,100 cases of influenza have been confirmed by laboratories, with the true number of flu cases likely to be higher.\n\n\n\n\n\nBy comparison, in the first quarter of last year, an average of around 3,300 cases were confirmed weekly.\n\n\n\nWhat was the cause of the subclade-K flu variant?\n\n\"Every few decades, a flu virus can undergo a much larger genetic change called antigenic shift, which can lead to a pandemic, but this is not what has happened with super-K,\" University of South Australia epidemiology professor Adrian Esterman said.\n\n\n\n\n\n\"Instead, super-K is best understood as a drifted version of the familiar H3N2 virus, with enough changes to allow it to spread more widely in populations with existing immunity.\"\n\n\n\n\n\nThe ACDC report noted Australian subclade-K viruses may have originated in or been imported from the US, following detections in the US in June and July last year.\n\n\n\n\n\nReading said there's no current evidence that the variant is more severe than a regular flu. What experts are seeing, however, is that it easily transmits.\n\n\n\n\n\n\"It appears that it's probably going to have an ability to at least be slightly less sensitive to antibody or vaccine-mediated protection,\" he said.\n\n\n\n\n\nDeakin University epidemiology professor Catherine Bennett told SBS News: \"This new subvariant of the H3N2 is that bit more immune evasive with these latest mutations in the part of the virus that allows it to invade our cells, making us more susceptible.\"\n\n\n\n\n\nBennett said the 2025 flu vaccine included H3N2, but not this specific class.\n\n\n\nLISTEN TO Influenza cases surge: time to get vaccinated say experts SBS News 06:40 English\n\n\"Flu vaccines wane in effectiveness, so people vaccinated back in April-May and only getting infected now won't have the same benefit,\" she said.\n\n\n\n\n\nHowever, the 2026 flu vaccine for the southern hemisphere has already been updated to include this variant, and will likely be available around April, Bennett said.\n\n\n\n\n\nEsterman said the flu vaccine remains worthwhile and provides important protection.\n\n\n\n\n\n\"It still significantly reduces the risk of severe disease.\"\n\n\n\nWhat does a typical flu season look like in Australia?\n\n\"When we get seasonal influenza every year in Australia, or anywhere, it's a combination of three viruses,\" said Reading.\n\n\n\n\n\nThere are two influenza A viruses — a H3N2 and H1N1 — and one influenza B virus.\n\n\n\n\n\nAccording to the Australian Centre for Disease Control, there were 365,261 reports of the flu in 2024. Cases spiked between May and August, and drastically dropped following the winter.\n\n\n\n\"As we move into spring, flu generally comes down in Australia, and then it's very low during summer,\" said Reading.\n\n\n\n\n\nLast year there were 502,493 reports of influenza, with cases clearly continuing until the end of the year following those winter months.\n\n\n\n\n\nAccording to GISAID, H3N2 subclade-K is driving an estimated 90 per cent of cases in the United States.\n\n\n\n\n\n\"What we saw around September [in Australia] onwards is the H1N1s and B viruses decreased, but we saw an increase in H3N2 viruses,\" Reading said.\n\n\n\nHow can I avoid catching the flu?\n\n\"People who are unwell should consider testing and should avoid mixing with other people as much as possible,\" Bennett said.\n\n\n\nREAD MORE Is it COVID or the flu? A new test that just hit pharmacy shelves will give you the answer\n\n\"Keep homes well-ventilated, hold gatherings outdoor if possible, and wear a mask in busy public indoor spaces if susceptible to more severe respiratory infections.\"\n\n\n\n\n\nNSW Health advises getting the annual flu vaccine, as well as practising good hand hygiene — including handwashing.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/bushfire-crisis-claims-homes-and-livelihoods/xdni787mt",
    "title": "Bushfire crisis claims homes and livelihoods",
    "publish_date": "Sat, 10 Jan 2026 11:09:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "More than a hundred structures have been lost and at least 300,000 hectares razed by multiple fires burning throughout Victoria.\n\n\n\n\n\nA state of emergency was declared in 20 local government areas on Saturday, with fire-fighting efforts concentrated on the fiercest blazes, including one in the state's centre and another in the northeast.\n\n\n\n\n\nThree people feared missing were located, with the trio unaccounted for since Thursday after fire destroyed their house in the hard-hit town of Longwood, about 50km north of Melbourne.\n\n\n\n\n\nEmergency Management Commissioner Tim Wiebusch said an early estimate that 115 structures had gone up in flames was expected to climb.\n\n\n\n\n\nThe toll includes: Ravenswood-Harcourt (50 structures), Longwood (30), Grass Flat (20), Yarroweyah (10) and Streatham (five).\n\n\n\nSignificant losses of livestock, cropping land and vineyards have occurred at most of the locations listed.\n\n\n\n\n\n\"We've also seen impacts to critical infrastructure, in particular the Bendigo railway line that has been impacted by fire and is now closed,\" Mr Wiebusch said.\n\n\n\n\n\nPeter Cookson, Little Yarra Country Fire Authority captain, recounted the terrifying experience of defending properties on Friday night in the regional town of Yarck.\n\n\n\nVery confronting\n\n\"All hell broke loose\", he said, with conditions intensifying to the point that his unit was forced to withdraw due to the danger.\n\n\n\n\n\n\"It just got so intense, we all had to get out of there,\" he said.\n\n\n\n\n\nAs he left the burning town, images of the hills and properties ablaze stayed with him.\n\n\n\n\n\n\"It was very confronting,\" Mr Cookson said.\n\n\n\n\n\n\"One of my last visions were the homeowners in their utes out in their paddocks, driving around with their big water tanks.\"\n\n\n\n\n\n\"We couldn't tell them what to do, it's their property. It's up to them whether they stay and we can't force them to leave.\"\n\n\n\n\n\n\"But that does sit in my mind.\"\n\n\n\n\n\nHe confirmed homes had been lost in the small town.\n\n\n\nLong way to go\n\nThere were 14 relief centres open across Victoria on Saturday, host to shocked families who had lost their homes or were waiting to hear more.\n\n\n\n\n\nEmotional locals attended a community meeting in Castlemaine, just outside Harcourt on Saturday, where they were given updates on the raging fire.\n\n\n\n\n\nVictoria was under a total fire ban on Saturday that was set to stay in place on Sunday.\n\n\n\n\n\nCFA chief officer Jason Heffernan said conditions had eased but there was a long way to go before fires were brought under control.\n\n\n\n\n\n\"Understand how the increased fire risk will impact you and ensure your fire plan covers all possible contingencies,\" he said.\n\n\n\nREAD MORE Should Australia give names to heatwaves?\n\nAuthorities confirmed a firefighter had been hospitalised with third-degree burns to his hands and a volunteer needed hospital treatment after being hit in the face by a hose.\n\n\n\n\n\nAn interstate firefighter also suffered a medical episode and was airlifted to Melbourne.\n\n\n\n\n\nAll three were recovering from their injuries.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/cyclone-threat-looms-for-north-queensland/sr0pj689m",
    "title": "Residents 'smashed' as tropical Cyclone Koji makes landfall in north Queensland",
    "publish_date": "Sat, 10 Jan 2026 04:38:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Residents are being \"smashed\" by heavy rain and fierce wind gusts as tropical Cyclone Koji crosses the coast in far north Queensland.\n\n\n\n\n\nWind gusts up to 100km/h have brought down trees and fences as the cyclone tracks south to south west, with residents from Bowen to Mackay in the firing line as the system crosses the coast, according to the Bureau of Meteorology.\n\n\n\n\n\nResidents of Marian, about 30km west of Mackay, say roads are closed and water levels are rising after conditions intensified early Sunday morning.\n\n\n\n\n\n\"We are getting absolutely smashed,\" Stephanie, a mother of one, told the Australian Associated Press.\n\n\n\n\n\n\"Our fence is down, our neighbour's fence is down. The rain is just sideways. There's nothing we can do but just wait it out.\"\n\n\n\nHeavy rainfall has pummelled the town, with the Bureau of Meteorology reporting 146mm of rain in just two hours, just to the west at Gargutt.\n\n\n\n\n\n\"The back yard is flooded — it's worse here than we were expecting.\"\n\n\n\n\n\nIn Mackay, tourist Josephine Tobias is staying at the Mackay Caravan Park, and says locals know how to cope.\n\n\n\n\n\n\"Honestly, so far here it's not too bad at the moment. We chose to stay, and it's wet, and it's windy, but everything is okay,\" Tobias said.\n\n\n\n\n\n\"This is the first time I've been through a cyclone, but everyone keeps telling me it's just a category one and not to panic.\n\n\n\n\n\n\"It's like a really bad storm that just keeps going.\"\n\n\n\nFurther north in the town of Bowen, residents are on alert as the storm system approaches.\n\n\n\n\n\n\"The wind has just suddenly changed direction,\" said Karyn, manager of Coral Cove Apartments.\n\n\n\n\n\n\"It's been coming from the south all night, and it's just changed direction in the last 30 minutes,\" she said.\n\n\n\n\n\n\"It's been raining on and off, and it's pretty gusty, but we will have power.\"\n\n\n\n\n\nHeavy rain is hammering Ayr and Mackay, and damaging 100km/h wind gusts have slammed tourism hotspot the Whitsunday Islands.\n\n\n\nQueensland Premier David Crisafulli says his state is well-prepared for the cyclone. Source: AAP / Darren England \"Cyclone Koji is crossing the coast between Ayr and Bowen,\" senior forecaster Dean Narramore said on Sunday.\n\n\n\n\n\n\"We can see a lot of rainfall spiralling around the system — it's a very lopsided system with most of the heaviest rainfall near and well south of Tropical Cyclone Koji, and that's why we're particularly concerned about our residents and communities from around the Ayr and Bowen area, down through the Whitsundays.\"\n\n\n\n\n\n\"That's bringing strong to locally damaging winds and also widespread heavy rainfall that is going to lead to widespread flooding in the coming days, on top of what is already going on through parts of Queensland.\"\n\n\n\nQueensland Premier David Crisafulli praised the preparation of communities that have endured floods in the past.\n\n\n\n\n\n\"I do believe that people have prepared brilliantly for the rain that will come,\" he said on Sunday.\n\n\n\n\n\n\"If Queenslanders continue to do that then I have every faith we will respond following the event.\"\n\n\n\n\n\nWarnings are in place for much of the northeast Queensland coast from Townsville to Mackay, including Bowen, Proserpine and the Whitsunday Islands.\n\n\n\n\n\nHeavy rainfall leading to flash flooding is developing between Townsville and St Lawrence and tides are likely to be higher than normal between Cardwell and Mackay, the bureau noted.\n\n\n\n\n\nThe heavy downpours could add to already-soaked catchment areas.\n\n\n\n\n\nAfter crossing inland on Sunday morning, gales are expected to ease rapidly as Koji weakens and then tracks westwards.\n\n\n\n\n\nIn the northwest, major flooding that has already heavily affected Gulf Country communities - where livestock losses are projected to be significant - continues on the Flinders River.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/world/us-federal-reserve-chairman-served-doj-subpoena-20260112-p5nte4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "US Federal reserve chairman served DOJ subpoena",
    "publish_date": "Mon, 12 Jan 2026 13:21:54 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/culture/2026-golden-globes-opening-monologue-20260112-p5ntdw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "2026 Golden Globes opening monologue",
    "publish_date": "Mon, 12 Jan 2026 13:08:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/business/companies/dateline-drills-epic-gold-widths-in-california-20260112-p5ntd9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dateline drills epic gold widths in California",
    "publish_date": "Mon, 12 Jan 2026 13:06:20 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Dateline drills epic gold widths in California Brought to you by BULLS N’ BEARS Rowena Duckworth January 12, 2026 — 1:06pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nDateline Resources has snagged another set of impressive, wide, and open gold intercepts from beyond the currently defined resource boundary at its Colosseum gold and rare earths project in California. The company says results from six diamond and ten reverse circulation (RC) holes drilled around the South and North pits have improved the continuity of mineralisation beneath the North pits and, in several instances, returned results outside the current mineral resource envelope. Drilling at Dateline Resources’ Colosseum gold project in California. Standout intercepts were led by a massive 295.64-metre hit grading 1.04 grams per tonne gold (g/t) from surface. That was backed up with a second solid 105.15-metre strike going 0.66g/t gold from surface. A third hit measured a mammoth 300.21 metres running at 0.66g/t gold, potentially confirming a huge-scale mineralised system. Drilling has confirmed that the felsite breccia pipe, the primary host rock, extends beyond known limits. Better still, the mineralisation appears to line up neatly with the magneto-telluric (MT) resistivity model, tracking straight into the high-conductivity zones.\n\nAdvertisement\n\n‘These consistently strong intercepts confirm that wide zones of gold mineralisation extend beyond our current mineral resource boundaries,’ Dateline Resources managing director Stephen Baghdadi The company says the results have reinforced the MT survey as a high-confidence, broad-based targeting tool for identifying gold-bearing conductive anomalies across the property. RC drilling reached up to 300 metres deep, close to the practical limit of the rig. Notably, even at those depths, the drill bit never punched out of the breccia, strongly hinting that the system remains open at depth and that more mineralisation could be lurking beneath. To test that upside, diamond core drill rigs will now replace the RC rigs. Diamond drilling can penetrate significantly deeper and retrieve continuous core samples, enabling more detailed geological and grade analysis. Darteline Resources managing director Stephen Baghdadi said: “These consistently strong intercepts at the North Pit and surrounding areas confirm that wide zones of gold mineralisation extend beyond our current mineral resource boundaries, highlighting significant expansion potential.”\n\nAdvertisement\n\nDateline says starting mining beneath the North Pit could materially enhance production in the early years, with the area pencilled in as the first mining focus under the development plan. The pit is already partially developed, effectively stripping away years of pre-strip and access work and allowing faster, lower-cost access to ore. Recent drilling has also confirmed thick, continuous mineralisation sitting directly below the pit floor. By bringing these wide, near-surface zones into the schedule early, the operation could deliver strong tonnages at consistent grades, supporting a smooth ramp-up and helping the plant reach nameplate throughput sooner. The company’s drilling program is part of an ongoing campaign to support Dateline’s bankable feasibility study and progressively upgrade the resource into higher-confidence categories. The project already hosts 27.1 million tonnes grading 1.26g/t gold for 1.1 million ounces, with more than 67 per cent classified as measured and indicated. The project sits within the prolific Walker Lane Trend in eastern San Bernardino County, less than 10 kilometres from the Mountain Pass rare earths mine. The district has a rich mining pedigree dating back to the Californian gold rush of 1848 and hosts multiple multi-million-ounce gold deposits, along with scattered fluorite, antimony and tungsten prospects. Historically, exploration focused almost exclusively on two known breccia pipes, with 1.4 million ounces of gold defined in the upper 250 metres, including 344,000 ounces already mined and the existing 1.1-million-ounce resource.\n\nAdvertisement\n\nNotably, gold occurs predominantly as free gold with minor silver and is closely associated with sulphide mineralisation, chiefly pyrite. It typically resides in fractures within pyrite or along grain boundaries, a deportment style that is easy for efficient downstream processing. Economically, the project carries a post-tax net present value of US$550 million (A$850 million) and an internal rate of return above 60 per cent, based on a conservative gold price of US$2900 per ounce. With gold now trading well above US$4000 per ounce, those metrics could climb sharply as feasibility work progresses. Dateline has forecast total production of 635,000 ounces of gold over an initial 8.3-year mine life, with average annual output of 71,000 ounces grading 1.3g/t gold and a recovery rate of 92 per cent. With assays continuing to flow and deeper drilling ahead, the latest results reinforce the open-at-depth potential beneath the pits and point toward a larger, higher-quality resource base as the California gold story continues to unfold. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/get-a-taste-of-the-amalfi-coast-at-a-new-gelato-shop-on-grattan-street-20260112-p5ntdc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Get a taste of the Amalfi Coast at a new gelato shop on Grattan Street",
    "publish_date": "Mon, 12 Jan 2026 13:03:49 +1100",
    "category": "finance",
    "authors": [
      "Haymun Win"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSorbet is served in real, hollowed out fruit at Taste of Amalfi’s permanent Carlton store.\n\nSorbet is served in hollowed out fruits at Taste of Amalfi.\n\nCafe$$$$\n\nCouple Milos Kalajdzic and Nada Mandic visited the Amalfi Coast in 2023 and were enamoured with the tradition of serving lemon sorbet in real, hollowed-out lemons. Back in Melbourne, they started with a sorbet cart and pop-ups before opening this shop, where fresh fruit such as strawberries and mango are turned into sorbets and served in a frozen fruit cup. Coming up next: plum.\n\nMust-try scoop: The sorbet that started it all, made from locally grown lemons (occasionally from customers’ backyards).\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/consumer-affairs/halting-all-bookings-sendle-keeps-customers-in-the-dark-amid-abrupt-closure-20260112-p5ntbj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Halting all bookings’: Sendle keeps customers in the dark amid abrupt closure",
    "publish_date": "Mon, 12 Jan 2026 12:56:35 +1100",
    "category": "finance",
    "authors": [
      "Jessica Yun"
    ],
    "text": "Advertisement\n\nBusinessConsumer affairsE-commerce ‘Halting all bookings’: Sendle keeps customers in the dark amid abrupt closure Jessica Yun January 12, 2026 — 12:56pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nDelivery software platform Sendle has left its customers in the dark about its sudden shutdown after a major investor froze funding following the discovery of “significant deficiencies” in Sendle’s parent company. The courier network, which had been positioning itself as an alternative to Australia Post, issued an email to customers on Sunday morning stating it was ceasing operations. “I am sorry to let you know that, effective immediately, Sendle will be halting all bookings for parcel pickup and delivery,” the email said. Sendle founder James Chin Moody. Sendle has abruptly ceased operations in Australia and Canada. Deliveries scheduled for today or a later date have been cancelled, while parcels that have already been picked up or were on their way may have been fulfilled “at the discretion of the delivery partner”.\n\nAdvertisement\n\nSendle did not provide contact details for customers. Delivery questions should be directed to the “relevant delivery partner”, the email said. “We understand this may be disruptive to your business, and we apologise for any inconvenience caused.” Sendle was founded in 2014 in Sydney to challenge Australia Post’s monopoly by offering small business door-to-door delivery at a flat rate. Sendle does not own any trucks or warehouses of its own; it operates like an “Uber for parcels” as a platform connecting small businesses to logistics companies and couriers. It expanded to the US and Canada in 2025. The shutdown has been attributed to a major investor, Federation Asset Management, that froze funding after finding deficiencies and financial irregularities in a three-way merger in 2025, of which Sendle was a party.\n\nAdvertisement\n\nIn August last year, Sendle merged with two US logistics firms, FirstMile and ACI Logistix, to form a new group called FAST Group. Federation Asset Management was a key architect and backer of the merger, dedicating 64 per cent of its $100 million Alternatives Fund to the newly created FAST Group. However, Federation Asset Management froze the fund in late December and told investors it had uncovered “significant deficiencies” in ACI Logistix’s financial statements following the merger, reported US freight market publication FreightWaves. In total, Sendle raised about $110 million over its 12 years across investors including Giant Leap, Rampersand, Full Circle and NRMA. Co-founder James Chin Moody has been contacted for comment. PR representatives for Sendle declined to respond to further questions from this masthead.\n\nAdvertisement\n\n“Sendle has informed its customers that it is no longer taking any future bookings. We are not able to provide any further comment at this time.” More to come jyun@smh.com.au The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/business/consumer-affairs/on-gelato-and-in-coffee-australian-olive-oil-s-health-led-boom-20260109-p5nsvp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "On gelato and in coffee: Australian olive oil’s health-led boom",
    "publish_date": "Mon, 12 Jan 2026 12:49:40 +1100",
    "category": "finance",
    "authors": [
      "Elias Visontay"
    ],
    "text": "Advertisement\n\nBusinessConsumer affairsFood On gelato and in coffee: Australian olive oil’s health-led boom Elias Visontay January 12, 2026 — 12:49pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nAustralia’s olive oil industry is booming, as the Mediterranean diet’s popularity coincides with a global supply crisis that has led to soaring demand, including premium offerings of wine-style tastings and pairings with gelato and coffee. The momentum of Australia’s olive oil sector reached new heights in the past fortnight with news that ASX-listed heavyweight Cobram Estate had bought US producer California Olive Ranch in a $259 million deal that had been 11 years in the making. Cobram, which has a market capitalisation of more than $1.8 billion and has groves in Victoria and the United States, sells under a range of brands that also includes Red Island, with products stocked in Coles and Woolworths and increasingly exported. Harvesting of olives in Victoria to be pressed by Mount Zero Olives to produce its extra virgin olive oil. Mount Zero Olives The acquisition comes as Australian producers ramp up their output in response to an olive oil rush brought on by shortfalls out of Mediterranean countries.\n\nAdvertisement\n\nOlive oil makers in Italy, Spain and Greece – which have traditionally been responsible for more than two thirds of global production – are still reeling from years of severe heat and drought conditions that started in 2022. Spain, which typically produces about 1.4 million tonnes of olive oil each year, saw harvests plummet to below 700,000 tonnes. “Southern Europe has been hit by two extremely difficult seasons, and while production is improving, it remains well below earlier highs,” Gerry Karam, ANZ’s head of food, beverage and agribusiness, said. Prices eased through 2024 from record levels – at one point reaching about $15,000 a tonne – but appear to be climbing again, Karam said. ”That volatility has been challenging for consumers, but it has created genuine opportunity for newer producers such as Australia,” he said. Extra virgin olive oil being pressed by Mount Zero Olives during the 2025 harvest. Mount Zero Olives\n\nAdvertisement\n\nAustralian olive oil has a reputation as a premium, more expensive product, but the shortage has seen restaurants turn their searches to the local sector, Karam said. This past season, local production was roughly 20,000 tonnes, supplying about one third of domestic consumption. That contribution is expected to grow further, ANZ’s latest Food for Thought insight report found. “Global production will eventually normalise, but the market has fundamentally changed,” Karam said. ‘No longer a niche ingredient’ Australia’s olive oil industry’s focus remains on high-quality extra virgin oil (EVOO), the highest grade made with just one pressing, and without the need to refine the product to remove defects.\n\nAdvertisement\n\nBeyond its status as a gourmet cooking oil, EVOO has emerged as a health food. Its high polyphenol content – an antioxidant that helps reduce inflammation and improve cholesterol, among other benefits – is proving to be a lucrative attribute for EVOO producers. This was acknowledged by Cobram Estate when announcing its Californian expansion. Chairman Rob McGavin told the Australian Financial Review ″⁣every day there are articles on extra virgin olive oil and its benefits”. Richard Seymour, general manager of Mount Zero Olives Mount Zero Olives Health conscious consumers come from all walks of life. “For older consumers it may be seen as improving heart health and moderation, while for younger ones it ties in with natural eating, wellness and authenticity,” ANZ’s insights found. Karam said the publicity of olive oil as a health food has meant it’s “no longer a niche ingredient. It is part of daily cooking, supported by health trends, and the appeal of the Mediterranean diet.”\n\nAdvertisement\n\n“That shift is driving interest in provenance, freshness and trusted brands – areas where Australian producers excel,” Karam said. Adding to the appeal is that Australia’s counter-season harvests come to market just as northern hemisphere stocks run low. Gelato paired with extra virgin olive oil at a collaboration event between Bottega 1900 and Rivareno gelato. Rivareno Gelato Mount Zero Olives, which draws produce from Victoria’s Wimmera and Grampians, has been “flooded by inquiries”, said general manager Richard Seymour. “When the European supply really suffered, we noticed this almost insatiable demand to inquire about Australian olive oil,” said Seymour, whose premium olive oil business has largely moved to sourcing and pressing the fruits after his family sold properties where it previously farmed groves. “Suddenly we were going from hatted restaurants, our bread and butter for years, to pubs and all kinds of eateries we thought we’d never supply,” he said.\n\nAdvertisement\n\nBusiness is so strong, Mount Zero now has to reject some inquiries from restaurants to ensure they meet demand for long-time customers. However, Seymour cautions that while revenue might be up due to price rises, cost-conscious chefs and consumers might look to buy less in volume terms and move to alternatives if prices climb further. Seymour also notes the relatively small yield from each olive when making EVOO means margins are tight. “If you’re making grape juice, 90 per cent of the juice out of a grape is marketable, but with olives, it’s somewhere between 10-20 per cent,” he said. To make a standard 500ml bottle of EVOO can require as much as 5 kilograms of olives. Enea La Mantia, of Sydney’s Bottega 1900 and Olive Oil Hub, tasting extra virgin olive oil Early harvesting of the fruit leads to a smaller yield but more complex taste, while the producers of lower quality, flatter tasting products might wait for groves to mature to get higher yields from each press.\n\nAdvertisement\n\nAdvertisement\n\nMassaria, who imports largely from Italy and sells them with listings of their polyphenol content, said that awareness and interest in specialty EVOO has taken off in Australia in the past few years. As a qualified sommelier and wine director in Sydney’s restaurant scene, she is hoping to bring the same level of integrity to olive oil. Enea La Mantia at a recent extra virgin olive oil tasting event run by Bottega 1900 in Sydney. Bottega 1900 Since launching in 2020, Bottega 1900 also organises olive oil tasting evenings, similar to wine-style events. Initially it was chefs and specialised customers most involved with tastings, but Massaria said this has expanded. “Reactions [at tastings] are often revelatory for people,” she said. “They show that premium extra virgin olive oil isn’t limited to the kitchen bench…many Australians are only just beginning to discover its true potential.” Massaria – who spoke from Italy, where she is visiting producers ahead of new season European harvests arriving in Australia for sale from February – has previously collaborated with gelato chain Rivaereno in pairing different olive oils to drizzle over frozen scoops. One of its fine-dining restaurant customers also added EVOO-topped gelato to its menu.\n\nAdvertisement\n\nThese unorthodox pairings let the various flavour profiles of EVOO shine through, something she believes Australians are clocking onto. “Green, grassy notes, subtle pepperiness, and light bitterness, sensations that can initially feel unfamiliar … are increasingly recognised as positive sensory indicators rather than flaws,” Massaria said. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nCooking Elias Visontay is a National Consumer Affairs Reporter at The Sydney Morning Herald and The Age. Connect via email",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/order-matcha-selected-by-a-tea-sommelier-at-this-sweet-japanese-cafe-20260112-p5ntd4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Order matcha selected by a tea sommelier at this sweet Japanese cafe",
    "publish_date": "Mon, 12 Jan 2026 12:40:35 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nFulfil any Japanese food cravings at Chayo in Clayton.\n\nThe matcha (green tea) is selected by Chayo’s tea sommelier.\n\nJapanese$$$$\n\nHere to fulfil any Japanese food cravings, sweet little Chayo starts with breakfasts such as matcha granola, continues with teishoku brunch sets and curry rice, and pushes the crave button with a karaage chicken burger. The drinks menu is great, too: matcha is selected by a tea sommelier and there are yuzu citrus drinks, both hot and iced.\n\nGood to know: Minimaru next door sells Japanese homewares and cooking gear.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/patrick-dempsey-stars-in-the-official-trailer-for-memory-of-a-killer-20260112-p5ntd8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Patrick Dempsey stars in the official trailer for Memory of a Killer",
    "publish_date": "Mon, 12 Jan 2026 12:37:39 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/queensland/bulk-billing-clinics-balloon-across-queensland-but-patients-are-paying-more-20260112-p5ntb9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bulk-billing clinics balloon across Queensland, but patients are paying more",
    "publish_date": "Mon, 12 Jan 2026 12:35:01 +1100",
    "category": "finance",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "Advertisement\n\nNationalQueenslandMedicare Bulk-billing clinics balloon across Queensland, but patients are paying more Courtney Kruk January 12, 2026 — 12:35pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nQueenslanders are paying nearly $50 in out-of-pocket costs to visit a doctor, despite the number of bulk-billing services nearly doubling across the state in the past year, a report shows. The data, released on Monday by healthcare directory Cleanbill, puts the average out-of-pocket cost to visit a GP in Queensland at $48.58 – $5.25 higher than in 2025. Federal government incentives have influenced a rise in bulk billing services across Australia, but many patients are still paying high out-of-pocket costs to see a GP. Joe Armao This is despite the number of bulk-billing clinics nearly doubling, with more than 400 of the state’s 1361 practices offering bulk-billing services. The release of Cleanbill’s report followed the federal government’s expansion of the Bulk Billing Practice Incentive Program (BBPIP) in November, which increased incentives for GP clinics to fully bulk bill.\n\nAdvertisement\n\nRelated Article Healthcare This $8.5b Medicare promise was at the heart of Labor’s election pitch. How’s it working? According to the report’s analysis of GP clinics operating from the start of November to mid-December, the trend towards declining bulk-billing practices has been reversed, with the percentage of fully bulk-billing clinics increasing to more than 40 per cent nationally. But rising healthcare costs remain a concern for most Australians. In some states, the average cost of a standard GP appointment now costs more than $100, with out-of -pockets expenses totalling about $60 for patients in the ACT and Tasmania. The Royal College of General Practitioners 2025 Health of the Nation report found the proportion of patients always being bulk billed remained low, with more people delaying GP care to cost.\n\nAdvertisement\n\nWhile the Albanese government introduced a 12.5 per cent loading payment on Medicare rebates for clinics that fully bulk billed, RACGP has called for a 40 per cent increase in Medicare funding for consults that last more than 20 minutes. “Medicare data shows that most GP visits continue to be delivered without cost,” RACGP president Dr Michael Wright said. “However, [our] Health of the Nation report highlights that consultation complexity and average length are both rising. At the same time, Medicare rebates have not kept pace with the cost of care for many practices. “So it is not surprising to see that out-of-pocket costs are increasing where new incentives do not cover the cost of providing care.\n\nAdvertisement\n\n“We need to make sure that all Australians have affordable access to GP services, particularly those people with complex health conditions who need more time with their GP.” Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/sport/terrifying-scenes-as-three-us-bobsleigh-teammates-lose-grip-20260112-p5ntcz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Terrifying scenes as three US bobsleigh teammates lose grip",
    "publish_date": "Mon, 12 Jan 2026 12:32:16 +1100",
    "category": "sports",
    "authors": [],
    "text": "Terrifying scenes as three US bobsleigh teammates lose grip\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/cycling/wa-s-coupland-claims-road-championship-title-in-tight-finish-20260112-p5ntcn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA’s Coupland claims road championship title in tight finish",
    "publish_date": "Mon, 12 Jan 2026 12:28:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "A year after the favourites let the break out too far and Lucy Stewart capitalised, this time it was a much tighter race.\n\nIt was the second-straight year that a 20-year-old won the women’s road race, also claiming the under-23 category, but it came amid vastly different circumstances.\n\nCoupland rode a smart race on Sunday and capitalised on Liv AlUla Jayco’s strength to win the women’s elite road championship.\n\nWestern Australian cyclist Mackenzie Coupland has scored a popular hometown win after taking out the women’s elite road championship in Perth.\n\nCoupland’s teammate Josie Talbot was the last survivor of a three-rider break that had gone clear early in the 109km event, but was never allowed a gap of more than a minute 30 seconds.\n\nCoupland bridged to Talbot on the last of eight laps, initially thinking she would support her teammate.\n\nBut Talbot was exhausted and Coupland took the lead by herself with 8km left, quickly realising the race was hers to win.\n\nAsked what went through her mind at the point, Coupland said: “You know what? Just dig deep, you never know what can happen.\n\n“I knew I had really strong teammates behind me in the peloton. I knew even if I was caught, I had teammates to back it up.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/eagles-coach-separated-from-star-player-20260112-p5ntcw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Eagles coach separated from star player",
    "publish_date": "Mon, 12 Jan 2026 12:26:53 +1100",
    "category": "sports",
    "authors": [],
    "text": "Eagles coach separated from star player\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/hero-cop-who-stopped-bondi-junction-stabbing-attack-diagnosed-with-cancer-20260112-p5ntcs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hero cop who stopped Bondi Junction stabbing attack diagnosed with cancer",
    "publish_date": "Mon, 12 Jan 2026 12:22:39 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/chair-quits-adelaide-festival-board-as-writers-week-crisis-continues-20260112-p5nt9u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chair quits Adelaide Festival board as writers’ week crisis continues",
    "publish_date": "Mon, 12 Jan 2026 12:21:13 +1100",
    "category": "entertainment",
    "authors": [
      "Kerrie O'Brien"
    ],
    "text": "Advertisement\n\nNationalLiterature Chair quits Adelaide Festival board as writers’ week crisis continues Kerrie O'Brien January 12, 2026 — 12:21pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nAdelaide Festival chair Tracey Whiting has resigned, becoming the fourth board member to quit over the decision to remove Dr Randa Abdel-Fattah from the Writers’ Week program. Tracey Whiting has resigned as chair of the Adelaide Festival Board. Whiting announced her resignation in a post to LinkedIn on Sunday evening, writing “Recent decisions were bound by certain undertakings and my resignation enables the Adelaide Festival, as an organisation, to refresh its leadership and its approach to these circumstances.” She did not offer further comment. With only three remaining members – Leesa Chesser, Adelaide city councillor Mary Couros, and Brenton Cox – former Adelaide Writers’ Week director Jo Dyer said on BlueSKy the board was now in breach of the Adelaide Festival Corporation Act which states, “At least 2 members must be women and at least 2 must be men.”\n\nAdvertisement\n\nLast Thursday, the Adelaide Festival board announced that while it was not suggesting “in any way” that Abdel-Fattah or her writing had any connection with the Bondi attack, given her past statements “it would not be culturally sensitive to continue to program her at this unprecedented time so soon after Bondi”. Related Article Opinion\n\nCensorship Politicians shouldn’t decide who appears at writers’ festivals. It’s a dangerous path Richard Flanagan Writer The move prompted dozens of authors to pull out of the festival, including best-selling Australian author Trent Dalton. On Monday, Dyer – who ran the event from 2019 to 2020 – said on Radio National there had been pressure over the line-up in the past but that she and other directors pushed back. This time, however, she said the board had “buckled” and would no longer be able to legally function. “Clearly, it puts the board in an invidious position to their discredit. They were not able to withstand that pressure as they should have. But now we don’t have a functioning organisation, and it is the people of Adelaide and South Australia who are the victims of this debacle,” she said.\n\nAdvertisement\n\nIn 2024, Abdel-Fattah was among the signatories to a letter to Adelaide Writers’ Week requesting the removal of New York-based opinion writer Thomas Friedman from the line-up because of his comments in a New York Times article comparing the situation in the Middle East to the animal kingdom. However, in a response seen by this masthead, dated February 9, 2024, the festival board rejected this petition. Signed by the (now former) chair of the board Tracey Whiting, it reads: “Asking the Adelaide Festival and Adelaide Writers’ Week to cancel an artist or writer is an extremely serious request. We have an international reputation for supporting artistic freedom of expression.” Dr Randa Abdel-Fattah. Speaking to the Guardian on Sunday, Abdel-Fattah rejected any allegation of hypocrisy. “Friedman’s widely criticised NYT article compared various Arab and Muslim nations and groups to insects and vermin requiring eradication at a time when talk of ‘human animals’ was being used to justify wholesale slaughter in Gaza,” she said in a statement.\n\nAdvertisement\n\n“We were concerned about the impact of Friedman’s views on socially and historically marginalised people who have been dehumanised and discriminated against by the use of such racist tropes. Indeed, one of the examples we supplied was how Jewish people have historically been likened to vermin. Related Article Literature Board members quit Adelaide Festival as dumped writer calls in lawyer “In contrast, I was cancelled because my presence and identity as a Palestinian was deemed ‘culturally insensitive’ and linked to the Bondi atrocity. I was cancelled because I, a Palestinian, have been a vocal advocate against the actual extermination of my people.” The Adelaide Festival did not respond to questions about the incident. The Adelaide Advertiser reports that former Adelaide Festival board member Tony Berg resigned in October, citing concerns Writers’ Week director Louise Adler “did not warn the board that she had already made an offer to Randa Abdel-Fattah” and, given her anti-Zionist stance, he could not “in all conscience” remain.\n\nAdvertisement\n\nAbdel-Fattah sent a legal letter to the festival on Sunday, demanding to know why she had been disinvited from the event. The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "TheAge",
    "cluster_id": 27
  }
]