[
  {
    "url": "https://www.9news.com.au/national/nsw-bushfires-updates-firefighter-killed-by-fallen-tree/f8ef0de9-920a-4020-a213-9b6a451a9eb9",
    "title": "Firefighter, 59, killed by falling tree was 'experienced' national parks worker",
    "publish_date": "Mon, 08 Dec 2025 01:42:38 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A 59-year-old national parks firefighter has died after he was hit by a tree while fighting a bushfire north of Newcastle in NSW.\n\nThe \"absolutely devastating﻿\" death of the veteran firefighter happened around 11pm yesterday at Little Nugra Road in Nerong.\n\nHe had a heart attack after the tree fell, with colleagues desperately trying to save him.\n\nA 59-year-old national parks firefighter has died after he was hit by a tree while fighting a bushfire north of Newcastle in NSW. (Media Response Newcastle.)\n\n\"The firefighter was a field officer with the National Parks and Wildlife Service, and he started working for National Parks in 1996,\" Environment Minister Penny Sharpe said.\n\n\"He was an experienced firefighter and divisional commander.﻿\n\n\"Our dedicated National Parks staff show courage and commitment every day when they put on the uniform, they go out to protect all of us.\n\n\"And, unfortunately, on this occasion, one person hasn't come home.\"\n\nRFS Commissioner Trent Curtain said \"our hearts go out to his family, to his friends, and to our colleagues\".\n\nHe said the loss would be felt \"deeply\".\n\n﻿He said a backburn was being done as part of the Bulahdelah fire, which started last week on the NSW Mid North Coast and is now 3500 hectares in size.\n\nThe firefighter was checking on colleagues when the tree fell.\n\nThere are around 1000 NSW National Parks firefighters working alongside the RFS and Fire and Rescue.﻿\n\nFour homes have been lost in that fire.\n\nPremier Chris Minns told ﻿ Today the man's family was being contacted.\n\n\"We're heartbroken by this news,\" he said.\n\n\"It's devastating and it's a reminder of what keeps the public safe.\n\n\"This is many ways a dangerous profession, and we're deeply indebted to the men and women that devote their time to keeping us safe.\"\n\nPrime Minister Anthony Albanese said the firefighter's death was \"terrible news\" in a statement on social media.\n\n\"My heart goes out to the loved ones and colleagues of the firefighter who has tragically lost their life in the Bulahdelah bushfire,\" he posted on X.\n\nAt least 18 homes were damaged or destroyed in another fast-moving bushfire last Saturday in Koolewong, north of Sydney. (Nine)\n\nA man surveys the damage from the Koolewong bushfire. (Sitthixay Ditthavong)\n\n\"All Australians are thinking of you in your time of grief. This terrible news is a sombre reminder of the dangers that our emergency services﻿.\"\n\nPolice have set up a crime scene and WorkSafe has been notified.\n\nA report will be prepared for the coroner.\n\nAt least 18 homes were damaged or destroyed in another fast-moving bushfire on Saturday in Koolewong, a small waterside suburb near Woy Woy on the NSW Central Coast.\n\nLocals told how fast the ferocious flames came for the waterside houses.﻿\n\nThe NSW Rural Fire Service, in an update today, said 52 fires are continuing to burn.\n\nAround 500 firefighters are out working.﻿\n\nA Sikorsky S-61 helicopter tackles the Koolewong bushfire. (Sitthixay Ditthavong)\n\nCraig Saxon and Sarra Saxon-Gill return to see their destroyed home on the NSW Central Coast. (Sitthixay Ditthavong)\n\nAmong fires burning is a large fire north of Redhead, a coastal suburb of Lake Macquarie council, on the western side of Redhead Road and south of Oakdale Road . ﻿\n\nThe blaze spans 64 hectares, but is in the process of being controlled.﻿\n\nResidents in the areas of Dudley and Whitebridge and Gateshead are being advised to monitor conditions in case the situation changes.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/australia-top-uber-rider-rating-revealed/5ac8e2a7-9c56-45a6-8112-17b2e858b546",
    "title": "The Aussie city with the best Uber rating revealed",
    "publish_date": "Mon, 08 Dec 2025 00:26:15 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "The Gold Coast has been named the city with the best rideshare passengers, having the top Uber rider rating.\n\nThe city had an average rating of 4.88 out of five, level with the Sunshine Coast and Cairns as Queensland had a clean sweep of best rider rating across the country, according to data released by the company.\n\nOf the state capitals, Hobart had the best rating with 4.85, whilst Sydney was marginally ahead of Melbourne and Brisbane.\n\nSome major cities shone, whilst others floundered in the end of year ratings. (Supplied)\n\nThe harbour city's riders had an average rating of 4.83, just above the national average of 4.82, with Brisbane and Melbourne stuck on 4.80.\n\nPerth and Adelaide were down at the bottom of the list with the worst rider rating, with both states also found at the bottom of the rankings released today.\n\nThe Northern Territory topped this list, with New South Wales slipping from first to third.\n\nThe rating system on Uber is two-way, with both riders and drivers able to give ratings for each other.\n\nIt is based off of the last 500 trips a rider has taken, meaning it can change quickly.\n\nPassengers with a lower rating may find it harder to get a ride accepted by a driver.\n\nBoth drivers and riders are required to follow Uber's community guidelines, which include following the law, treating drivers and passengers with respect, and keeping safety front of mind at all times.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/jessica-stenson-breaks-australian-womens-marathon-record/106113722",
    "title": "'We just cried': Stenson breaks marathon record in emotional scenes",
    "publish_date": "Sun, 07 Dec 2025 22:27:54 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jessica Stenson has been left in tears after breaking the Australian marathon record in Spain.\n\nCommonwealth champion Stenson set a new national landmark of 2 hours, 21 minutes and 25 seconds at the Valencia Marathon to slice nine seconds off her friend Sinead Diver's record of 2:21.34.\n\nOn one of the world's fastest courses, the 38-year-old veteran enjoyed the race of her life to finish fifth, shattering her own personal best of 2:22:56 by a minute-and-a-half.\n\n\"I just got off the phone to Sinead, she called me right away and we just cried,\" Stenson said.\n\n\"She was so happy for me, and it was so nice to connect with her after the race.\n\n\"I'm so delighted and so satisfied. Everyone's always said Valencia is a magic place to run but I have to admit, I was really nervous coming into this race because I knew I was going to have a crack at the record and that it was going to hurt.\n\n\"I was expecting a lot of pain — mental pain more than anything — but it was one of those days that I was pleasantly surprised and I found my flow.\"\n\nOn track for the record throughout the race, Stenson made sure by surging through the final kilometres.\n\nShe crossed the line with a roar of delight as she enjoyed another magic moment in a career which has taken in three Olympics.\n\nRunning her third marathon of the year, Stenson also paid tribute to 48-year-old Diver, who had set her record four years ago.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I'm so grateful for Sinead and that record she set,\" Stenson said.\n\n\"When there was one kilometre left, I was thinking of her and trying to squeeze as much as I could out of myself, knowing what was possible to achieve.\n\n\"I have the highest level of respect for her, so she was there with me in a positive way.\"\n\nUp ahead, Kenyan Joyciline Jepkosgei won the race in a world-leading time of 2:14:00 — the fourth-fastest time in history by a woman — ahead of compatriot Peres Jepchirchir, who finished second, 43 seconds behind.\n\nKenya also celebrated victory in the men's race with John Korir winning in 2:02:24, bettering his personal best by 20 seconds. Thomas Do Canto was the first Australian home, clocking 2:11:14 for 40th place.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/perth-garbage-bins-leave-residents-unhappy/106112238",
    "title": "Perth's new bin rules bring maggots and bad smells to angry residents",
    "publish_date": "Sun, 07 Dec 2025 22:12:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Residents in outer Perth say they are dealing with an \"infestation of maggots\" and rotting rubbish after the introduction of a third bin for food and garden waste.\n\nThe City of Rockingham recently brought in the so-called \"FOGO\" (food organics garden organics) system — a three-bin service the WA government is keen to see implemented metropolitan-wide.\n\nIt has been criticised by councils and residents in the state's south-west, where all the waste from the organics bin has been going to landfill for a year because of high levels of contamination.\n\nWhen the City of Rockingham introduced the FOGO bin in June, it cut back red bin collection to fortnightly in line with WA Waste Authority guidelines and committed to a weekly FOGO pick-up.\n\nThere are concerns the maggots and flies will only get worse over summer. (Supplied)\n\nFather-of-two Daniel Prowse said it was problematic.\n\n\"There is still a fair amount of waste in our household that would go in the red bin, particularly from our two-year-old who is in nappies,\" he said\n\n\" Human waste in your bin for two weeks is pretty on the nose and no matter what you did … it was always fly-ridden, absolutely stunk and just [had] maggots. \"\n\nHe said he was happy for FOGO to continue, but wanted red bins to be collected weekly.\n\nDaniel Prowse and his family moved to the City of Rockingham just before the new bin system was introduced. (Supplied: Daniel Prowse)\n\nAs a mother of two young children, Clare Lee said her bins were \"overflowing\" well before collection time.\n\n\"It's just not enough space, and then you factor in relatives coming to stay and events like Christmas,\" she said.\n\n\"The council needs to be educated on the reality of what it means for families.\"\n\nFamilies with kids in nappies say their red bins are \"overflowing\" every fortnight. (Supplied)\n\n'No plans' for change\n\nCity of Rockingham Mayor Lorna Buchan has shut down calls from the community for changes.\n\n\"The city has no plans to revert to weekly red-lidded bin general waste collection,\" she said\n\n\"[The city] joins more than 25 other local government authorities in Western Australia that have already successfully adopted this approach to greatly reduce the amount of waste being sent to landfill.\n\n\"To help manage odours … residents are encouraged to wrap these items securely before disposal, using biodegradable bags where possible, and keep their bin sealed and in a shaded area.\"\n\nIn the past month, the city said more than 95 per cent of the FOGO waste collected had been processed.\n\nThe City of Rockingham says it has no plans to revert to weekly red bin collection. (Suppied: City of Rockingham)\n\n'Failing' on rubbish\n\nLong-time resident Simon Brown said the \"maggot infestation\" would only get worse over the summer.\n\n\"The first principles of any local government are roads, rates and rubbish, and Rockingham council is really failing on the rubbish part,\" he said.\n\n\"I have not seen a maggot infestation like that … I have never seen so many crows in my life; they are well fed and pulling all the rubbish out of the bins.\"\n\nSimon Brown says the council is failing to deliver on one of its core responsibilities to ratepayers. (Supplied: Simon Brown)\n\nHe said the council needed to look at \"lessons learnt\" in other areas.\n\n\"We're turning a blind eye to the failures of FOGO in other local governments [and] shoving our heads in the sand,\" Mr Brown said.\n\nFOGO still no-go in state's South West\n\nIn WA's South West, some residents missing their food organics bins are being offered rebates to set up their own composts or worm farms.\n\nA year ago, the FOGO system was put on hold in the region, and some councils are considering pulling the plug due to their FOGO waste being sent to landfill.\n\nProcessor Bunbury Harvey Regional Council is working on a solution.\n\nThe Shire of Augusta-Margaret River started offering rebates to residents who want to make worm-farms or compost at home. (ABC South West WA: Jacqueline Lynch)\n\nIn the Shire of Augusta-Margaret River, frustration with organics going to landfill prompted the council to bring in rebates of up to $80.\n\nIn two months, 45 people have accepted the offer.\n\nSustainability officer Kate Jameson said it was great to see residents taking matters into their own hands.\n\n\"Because of that happening, that has brought a lot more interest from people in looking at other ways they can dispose of their waste responsibly,\" she said.\n\n\" It's great to see already that we've had such a high uptake in the rebate. \"\n\nIn nearby Busselton, the city has held off introducing the organics bin, despite most of the South West jumping on board years ago.\n\nCity of Busselton local Valerie Frearson-Lane hopes FOGO issues can be sorted out. (ABC South West WA: Jacqueline Lynch)\n\nResident Valerie Frearson-Lane had been home-composting, but said she hoped the issues with the FOGO bin could be ironed out for others.\n\n\"It would be good if people could be encouraged to do it themselves, but not everyone is interested,\" she said.\n\n\"I'd really like the FOGO system if that can be made to work.\"",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/ashes-2025-brendon-mccullum-says-england-trained-too-hard/106113606",
    "title": "Coach says England 'over-prepared' as players go on Noosa getaway",
    "publish_date": "Sun, 07 Dec 2025 21:48:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "England coach Brendon McCullum has claimed his team trained too hard for the Gabba Test, which ended in a bruising eight-wicket loss that leaves the tourists' Ashes hopes in tatters.\n\nEngland's training regime has been a point of focus since the team arrived in Australia, with only internal fixtures and no official practice match scheduled ahead of their first-Test loss in Perth.\n\nHeading into the crucial pink-ball Test in Brisbane, Australia had played and won three day-night matches since England's last one in 2023.\n\nBut the entire XI from the loss in Perth opted to skip out on playing in a day-night tour match against the Prime Minister's XI in Canberra and head straight to Brisbane.\n\nThe decision prompted questions as to whether five days training in Brisbane was the best preparation for a clash with the day-night masters.\n\nAs \"Bazball\" architect McCullum saw it, England had the opposite issue.\n\n\"I actually felt like we over-prepared to be honest,\" McCullum said.\n\n\"I think sometimes when you're in the heat of the battle, as we all know, sometimes the most important thing is to feel a bit fresh.\"\n\nEngland will have that chance to freshen up when they head to Noosa for a getaway before the third Test match that begins in Adelaide on December 17.\n\nPaparazzi are set to be out in force trying to catch the tourists lounging around in the sun as their Ashes hopes hang by a thread.\n\nThe team already received plenty of scrutiny from the Australian press in Brisbane when three players, including captain Ben Stokes, were photographed riding e-scooters without helmets.\n\nStokes said the Sunshine Coast sojourn would be a chance for a much-needed physical and mental break.\n\n\"We have been here four weeks and they have been pretty full on,\" Stokes said.\n\nHow the internet reacted to the Aussies going 2-0 up Mitchell Starc was the hero, again, as the English were comprehensively outplayed in Brisbane — but how did the internet react?\n\n\"As physical as this game is, a huge part of it is also the mental side of it. I know that. I have experienced that. I know what the game can do to you when things aren't quite feeling right or going well.\n\n\"It is so important when teams, when they do get an occasion or opportunity, go away as a team and put the pressures of this aside for a couple of days.\"\n\nAsked for his opinion on McCullum's over-preparation comment, Stokes said England needed to prioritise training smarter, not harder.\n\n\"There is a great saying that I know: 'Are you going to train to train or train to dominate?',\" Stokes said.\n\n\"There is a lot of training that you see going on where you are doing it for the sake of doing it and not achieving anything.\n\n\"On the back of the first Test match, when we desperately want something like we do, maybe you can fall into that 'train to train'. I have been guilty of that myself. But I like to train to dominate.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/how-the-internet-reacted-to-the-second-ashes-test/106102100",
    "title": "How the internet reacted to the Aussies going 2-0 up",
    "publish_date": "Sun, 07 Dec 2025 21:31:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia have taken a commanding 2-0 lead in the Ashes, and in some style at the Gabba. The English were outplayed comprehensively, and Mitchell Starc was their destroyer-in-chief.\n\nHere's how the internet reacted to the second Test.\n\nDay one\n\nNathan Lyon was dropped for Michael Neser the morning of day one — 562 Test wickets removed in the blink of an eye.\n\nAnd like a rubber band on a sheep, the Neser inclusion also shortened the Australian tail.\n\nEngland won the toss, and elected to bat, Zak Crawley faced the first ball from Starc, and let it pass through to Alex Carey; the next two balls beat the bat, and fourth was struck handsomely to the boundary.\n\nAfter such a long break between Tests, it was a wonderful feeling to see battle resume.\n\nAnd Starc landed the first pulverising blow, another wicket in his first over, Duckett, for a golden duck.\n\nIn his next over, Starc had Pope chopping onto his stumps, also for a duck.\n\nEngland were yet again stumbling and groping wildly for something with which to steady themselves; Joe Root trotted out hoping to offer them that.\n\nCrawley was in attack mode, and although one suspects the switch on his back is permanently jammed thusly, he was keeping England from keeling over entirely, playing some fine shots around the ground, through the air and along the grass.\n\nEngland brought up their 52 balls quicker than they did in Perth, more fast-forward cricket.\n\nRoot was being very sensible, and save for a very difficult chance dropped by Steve Smith early on, he was looking assured at the crease.\n\nWhen the partnership reached 100-odd balls, it made it the longest of the series so far, by either team.\n\nIt felt like England were comfortably on top, but were still 2-84; Bazball, and the hyper-mode version we saw in Perth, seems to have disrupted the normal internal Test cricket intuitions.\n\nYou have to shake yourself free of its dizzying grips to remember how Test cricket usually feels, it's not some madcap dash where wickets fall in great juicy bunches and batters swing their bats from ankle to shoulder like heaving scythes.\n\nCrawley brought up his 50, after two ducks in the first Test, a fine response indeed. England were settled, 2-98 at lunch.\n\nCrawley set about racing toward his ton after lunch, hitting boundary after boundary, but was undone on 76 by a Neser ball that he feathered through to Carey.\n\nHarry Brook came in, scored a quick 16 off 11 balls, and was nearly stumped playing a ramp shot; traditionalists' molars were being ground down to dusty nubs around the UK, but it was fun to watch.\n\nRoot, meanwhile, got his half-century, halfway to that elusive ton on these shores.\n\nSome pressure was built by Scott Boland, and then Starc, coming back in, took out Brook, nicking wildly to Smith. That wicket took Starc into the all-time lead for Test wickets by a left arm quick.\n\nThe run-rate had been squashed slightly, the pace of the game was slowing, but Root and now Ben Stokes were largely untroubled, and the ball was soft.\n\nThen a disastrous Stokes run-out, where he took off for a run and was sent back, saw Josh Inglis throw the wicket down on the run with a single stump to aim at, a superb piece of fielding. Stokes was furious with himself.\n\nBoland then bowled Jamie Smith minutes later, and what had been a firm English grip on the match turned clammy and began to slip.\n\nBut Root was still there, the port in the storm for England, and he was creeping toward his century.\n\nWill Jacks decided to liven things up by slashing an edge to Smith off Starc with Root on 98.\n\n\"That was not a clever bit of cricket from Jacks,\" said Jim Maxwell.\n\nRoot, as he had all day, put the blinkers on those ice blue eyes and kept going, and he crashed through that milestone barrier that had kept him out for so long.\n\nIt was a joyous moment for English fans, but sudden wickets put a stop to it, as Starc picked up two more, one courtesy of a stunning catch by Carey that resembled more a contested Aussie Rules mark than any cricketing action.\n\nJofra Archer made a flashy entrance, swinging wildly and scoring well too — Stokes clearly had no intention of declaring to have a crack at the Aussie openers under lights, and was happy to have Archer and Root tonk the ball around the Gabba.\n\nAnd the final wicket partnership survived the evening, added 61 runs, a very valuable contribution indeed.\n\nStarc finished with six wickets, another Trojan performance where he carried the bowling without his three colleagues in Cummins, Hazlewood, and Lyon. But it was Root's day, and as he walked off the ground, the Australian team all shook his hand.\n\nDay two\n\nThe day resumed with Australia needing a single wicket to get before they could take to this pitch with the bat.\n\nIt took Labuschagne turning into SuperMarn, taking a flying catch to dismiss Archer, to end the innings.\n\nWith Usman Khawaja still laid up with an iffy back, Travis Head walked out again with Jake Weatherald.\n\nHead and Weatherald got Australia off to a good start, a partnership of 77, ended by a top edge that Head skied to a fielder.\n\nBut Weatherald went on with it, racing to a 50 off 45 balls, and Marnus came in with similar intent. They punished some wayward England bowling and Australia were 1-130 at lunch.\n\nWeatherald was cruising after the break, but a venomous Jofra Archer yorker crashed into his toe, and he walked off without even reviewing, for a very stylish 72.\n\nSteve Smith entered, and with Marnus there with him, the twitch-off began, idiosyncratic spasms abounded, as if the Aussie batters were being bitten by a great number of aggressive fleas between every delivery. Marnus eventually got out slashing at a wide ball.\n\nWithout the spurts of chaos that the English team provide when they bat, the placid nature of this wicket was revealed, as Smith and Cameron Green went to work scoring steadily, patiently and — save for a few typically flamboyant Smith shots -- in an orthodox manner.\n\nThe most interesting moment was when the England team asked for the ball to be looked at, more echoes of outrages past.\n\nThen the contest suddenly woke up in a single Carse over, as Green backed away expecting a bouncer, and was bowled by a yorker. Then the new man Alex Carey was dropped, a simple chance, by Duckett. But Carse then took out Steve Smith, his pull-shot spectacularly caught by Will Jacks.\n\nOut of nothing, England had the two set batters dismissed, and their vigour was refreshed.\n\nThe England team were lively, creating chance, but dropping more than they took; for every Jacks screamer, there was Carse putting down a chest-high dolly to give Neser a reprieve.\n\n\"I've noted five catches put down today,\" said Ric Finlay, ABC statistician.\n\n\"That's a lot of catches,\" replied Alison Mitchell.\n\nAustralia strode into the lead as the match stretched late into the evening; they had batted very well, more steadily, a collection of solid double-figure contributions. 6-378, and lead of 44, at stumps.\n\nEngland trudged off.\n\nDay three\n\nAustralia wanted to push the lead to triple figures, but Neser departing early, and then Alex Carey not long after England took the new ball, meant the recognised batters were gone within an hour.\n\nStarc was then the one to whom the run-making duties fell, and he was up to the task, scoring patiently, protecting Scott Boland from taking the strike too often, and further cementing his place as Australia's most valuable player in this series so far.\n\nAfter lunch, Starc got his 50. Boland blocked his way to double figures. This was the slowest-scoring period of play for the entire series, but it was superb fun for the Australian fans.\n\nStarc went on, he went into the 60s, the 70s, past Jake Weatherald to become the top scorer in the innings for his team, and all the while the Australian lead swelled, as did the beads of sweat on the English collective brow.\n\nHe was out for 77, his third-highest Test score. He walked off to an uproarious ovation.\n\nAnd it wasn't over for England, as Brendan Doggett also made it to double figures, meaning every Australian batter had scored 10 or more, the first time that had happened since 1992.\n\nAustralia finished up having made 511, a lead of 177.\n\nWould England look to survive the night, to defend, to preserve? No, Crawley and Duckett set out to attack, and were going at better than a run a ball when tea arrived.\n\nScott Boland got the breakthrough in his first over after the resumption, bowling Ben Duckett for 15, a ball that kept so low it clipped the toe of the bat before crashing into the stumps.\n\nEngland were scoring well, but in a typically haphazard way, with Ollie Pope slashing hard into the air and only barely missing diving fielders. His luck ran out when he eventually drove straight to Neser, out caught and bowled.\n\nIncredibly, that was the exact same way Crawley got out a few overs later, caught and bowled chipping a drive to Neser.\n\nAnd then the big one; Joe Root. Starc got him nicking to Carey for 15. The first innings hero who carried his bat for England was back in the sheds for a meagre total, his team now four down and still 56 runs away from making the hosts bat again.\n\nA few overs later, Boland had Brook nicking to Carey, also for just 15.\n\n\"That could be your lot, England,\" said Phil Tufnell on the ABC Sport call.\n\nAnd it was; England ended the day six wickets down, and still 43 runs short of Australia's total.\n\nDay four\n\nTwo types of English fans woke up on day four, feeling two different ways.\n\nStokes and Jacks got to work, and displayed a huge amount of patience and control at the crease, scoring at around three runs an over, which for Bazball is basically the same as leaving every ball.\n\nThey chipped away admirably, and after an hour and a half, they crept out of the red into the lead, and began to attempt to build a lead they could defend.\n\nTravis Head and Marnus Labuschagne bowled back-to-back overs just before tea; you could almost hear the frantic calls of television directors around the stadium to direct the cameras toward Lyon's face. But England got through the first session unscathed.\n\nThe day stretched on, the English partnership seemed to harden with each wicketless over, and the visitors' hope grew. Then it was shattered by a piece of individual brilliance by the Australian captain.\n\nSteve Smith, one of the greatest slip fielders of his era, took a bona fide screamer, diving and gripping to his left to secure a Jacks edge off the bowling of Neser.\n\nNeser then got Stokes, who had just reached his half-century, and those broken shards of English hope began to bubble and hiss and evaporate into the Brisbane evening. It was an edge wonderfully taken by Alex Carey, who was up at the stumps.\n\nThe quality of the Australian fielding and wicketkeeping was in such stark contrast to the English effort, it was almost comical, every wicket Australia took resembled exactly the kind of chance the English would have wasted.\n\nBen Stokes punched himself in the helmet as he walked off, and a huge shower of bitter perspiration sprayed off his furrowed brow at the impact.\n\nThe wickets then fell quickly, Atkinson, then Carse, and the English were all out, with a lead of 64.\n\nHead, Weatherald, Labuschagne and Smith made short work of the target. Smith even had time to have a bit of chirpy back-and-forth with Jofra Archer while hitting for 15 off an over.\n\nThere was a feeling the English supporters, and possibly the players and coaches, had, warm and soothing in the soul, when Stokes and Jacks were stolidly applying themselves with care and discretion in that first session.\n\nIt was a feeling that came not just because the batters were playing well, but how they were playing well. There was a security to that feeling, a sense of firm ground under your feet, instead of a frayed rope bridge over a ravine.\n\nIt was just normal, sensible cricket, no hijinks or mishaps, and it suited them. Had the top order played similarly the night before, maybe England wouldn't have lost this match, at least not so badly.\n\nThey could just simply play like this again, and enjoy that warm feeling once more, but the suspicion is they will actually choose not to.\n\nAustralia leads the Ashes 2-0.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/hitchhiking-pilbara-mechanic-recounts-life-on-the-road/105845782",
    "title": "Rain, hail or shine, Kevin would hitchhike 60km to work",
    "publish_date": "Sun, 07 Dec 2025 21:30:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's north is never short of a good yarn — if one knows where to look.\n\nAboriginal and Torres Strait Islander readers are advised that the following article may contain images of people who have died.\n\nTake the stranger at the roadside, his thumb stuck towards a sprawling night sky.\n\n\"Got up two or three in the morning, and then just wait out in the road probably two or three, four hours maybe before I get a ride to Dampier,\" Kevin Guiness recalled.\n\n\"Sometimes then I would start walking.\"\n\nMr Guiness would hitchhike to work from Roebourne as he did not own a car. (ABC News: Alistair Bates)\n\nFor more than 25 years, the Yindjibarndi elder has travelled the dusty roads between some of Australia's largest and most lucrative industrial ports.\n\nAt 17, he landed an apprenticeship as a diesel mechanic at Rio Tinto's Dampier Salt project, about 1,530 kilometres north of Perth.\n\nBut his home in the Pilbara town of Roebourne was 60 kilometres away, and he did not own a car.\n\n\"I ended up hitchhiking from Roebourne to Dampier Salt,\" Mr Guiness said.\n\n\"Sometimes when it's raining, for my coat, I'd use a rubbish bag.\n\n\" It was still pitch dark, but I was just quite happy there waiting for a lift. \"\n\nHitching through Pilbara history\n\nMr Guiness's journey began with the roar of an engine.\n\n\"I was seven years old and walking around with my dad and uncle,\" Mr Guiness said.\n\n\"We'd muck around with the old Land Rovers.\n\n\"My dad would maintain them and fix them up, and I would be there probably like an assistant.\"\n\nKevin Guiness (back row, second from right) moved from Mulga Downs to Wittenoom in the 1970s. (Supplied)\n\nMr Guiness was born on Mulga Downs Station at the foot of the Hamersley Ranges.\n\nDripping with pale spinifex yellows and deep earthy reds, the pastoral lease is often credited as the birthplace of the Pilbara mining industry.\n\nIt has long been held by the Hancock family: controversial patriarch Lang drove the region's first forays into blue asbestos and iron ore.\n\nHis daughter, Gina Rinehart, is still Australia's richest person.\n\nLoading...\n\nLife on Mulga Downs was hard, Mr Guiness said.\n\n\"Being out on the road, early hours of the morning, I think what … kept me going was my mum and dad.\n\n\"Because on the station, they work for nothing … basically tobacco and tea leaves.\n\n\"If my old people can do it for nothing, then I can do it for them.\"\n\nHard-earned lessons\n\nMany Aboriginal people worked on Pilbara pastoral stations for little or no pay.\n\nThe stockman who turned 'black pennies' into an Indigenous stolen wages settlement Mervyn told the stories of his old people. They led to a $180m settlement for Aboriginal stolen wages.\n\nEqual wages were only legislated by the Commonwealth in 1968, and exploitation remained rife through WA's north for years following.\n\nThe harsh conditions were not without their lessons.\n\nBy 12 years old, young Kevin could take apart and reassemble a car engine.\n\n\"You can put it [together] like a jigsaw puzzle,\" he said.\n\n\" If it's maybe a dead car, and then when you get it up and running and alive … you feel good. \"\n\nMr Guiness first began working at Rio Tinto's Dampier Salt operations at 17. (ABC News: Alistair Bates)\n\nIn search of better work, Mr Guiness's family moved to Wittenoom, where Lang Hancock opened a mine later catapulted into infamy.\n\nWhen the town was closed amid the spread of asbestos-related disease, Mr Guiness relocated to Port Hedland and eventually Roebourne.\n\nIt was there he would spend years hitching rides to work.\n\n\"[At] six o'clock, we would knock off, then back on the highway,\" he said.\n\n\"By the time I get back home to Roebourne, it would be about 10 o'clock in the evening.\"\n\nRecognised nationally\n\nNational construction company Tutt Bryant has named its inaugural apprentice of the year award after Mr Guiness, set to be awarded later in December.\n\n\"It's nothing short of inspirational, just what he's gone through … the odds that he faced in his own apprenticeship,\" managing director Chen Wei Ng told the ABC.\n\nKevin Guiness wants to inspire the next generation. (ABC News: Alistair Bates)\n\nTutt Bryant became aware of Mr Guiness's history during a now-defunct partnership with the Ngarluma-Yindjibarndi Foundation, where he was a director.\n\nMr Guiness hoped the prize would inspire the next generation of Indigenous tradespeople.\n\n\"The young people coming up, hopefully they look at it, and say, 'if Kevin can stay out on the road, I can do it, [I can] finish the apprenticeship,'\" he said.\n\nRich 'in my own way'\n\nMr Guiness has not been able to shake the rhythms of his old commute.\n\n\"Even now I still wake up early, on my days off, up and about early [around] three o'clock,\" he said.\n\n\"It's part of the body clock now.\"\n\nHe still works at an iron ore port, balancing his vocation with traditional responsibilities.\n\nKevin Guiness is a Yindjibarndi elder. (ABC News: Alistair Bates)\n\nRoebourne, or Ieramugadu, is home to a vibrant Aboriginal community, but elders there say social inequality and intergenerational disadvantage continue to be a challenge.\n\n\"In our culture, it's very important that we share what we got and that's what I've been doing with my family,\" Mr Guiness said.\n\n\"I'm sort of a rich in my own way … not so much a wealthy man, but I just got what I got.\"\n\nThese days, though, he catches the bus to Dampier.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/wa-power-producers-accused-overcharging-wholesale-electricity/106109294",
    "title": "WA's largest privately-owned power producer accused of hiking prices",
    "publish_date": "Sun, 07 Dec 2025 21:16:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "The cost of electricity is being driven up by tens of millions of dollars by some Western Australian power producers breaking the rules and charging more than they're allowed, the state's economic watchdog alleges.\n\nIn the latest alleged breach, WA's largest privately-owned generator, Bluewaters Power, hiked the wholesale price of electricity by about $30 million over eight months, the Economic Regulation Authority (ERA) claims.\n\nWholesale costs make up about 40 per cent of the average household power bill.\n\nJust 13pc of rooftop solar capacity realised, advocates say Renewable energy advocates are urging the West Australian government to throw more of its weight behind rooftop solar and batteries, saying the state is running out of time to replace coal with large-scale green power projects.\n\nIn WA, the state government shields households from the immediate impacts of spikes in wholesale prices, but the more they happen, the more they can trickle down to bills.\n\nA complex market\n\nThe ERA's chair Steve Edwell said the Bluewaters blowout was part of an \"increasing number\" of electricity generators using their power in a concentrated market to charge higher prices than they should.\n\nSuch behaviour is not allowed in WA as generators are only allowed to sell electricity to retailers, like Synergy, at-cost.\n\nBut the Japanese-owned company said its pricing was necessary to ensure it could reliably power the WA electricity grid, and argues its market impact was only a fraction of the $30 million claimed by the ERA.\n\n\"The alleged breaches relate to periods of time when Bluewaters faced coal and water shortages and was managing its generation,\" a Bluewaters spokesperson said.\n\nBluewaters Power Station was the first privately-owned, coal-fired power station in WA. (Supplied: Sumitomo)\n\nSupply shortages can lead to reduced production capacity, which is often reflected in the market with higher prices.\n\nBluewaters claimed the ERA had \"misunderstood the relevant facts\" and incorrectly applied the law.\n\nIt follows another case earlier this year, where the ERA found Alinta had increased the cost of generation by $66 million over a similar time span, which the company is also disputing.\n\nOne thing both the regulator and industry can agree on is the market, and the rules, have become increasingly complex with the uptake of renewable energy.\n\nGenerators 'take advantage' of market\n\nNationally, the Australian Energy Regulator's (AER) last market report found electricity prices were staying relatively high despite increasing renewable generation, which is cheaper.\n\nSeven WA energy retailers overcharged customers, inquiry finds Seven energy retailers in Western Australia has overcharged customers by taking automatic payments from closed accounts, an investigation finds.\n\nThat's in part because some generators were withholding electricity from the market, which can artificially drive up prices.\n\n\"Participants can take advantage of market conditions to make significant financial returns,\" the report said.\n\nIn a statement, an AER spokesperson said the practice of setting higher prices \"cannot be false or misleading\", but was otherwise allowed.\n\n\"However patterns of this kind of behaviour could lead to inefficiencies in the market and may not be in the best interests of energy consumers,\" the spokesperson said.\n\nCost of living concerns\n\nThe market behaviour noted by the AER is not allowed in Western Australia, where generators are only allowed to sell electricity to retailers at cost price.\n\nInstead, they are paid to be available on demand, such as in times of high need — a sort of insurance policy in what's called a capacity market.\n\nSteve Edwell is chair of the WA Economic Regulation Authority Western Australia. (ABC News: Cason Ho)\n\nMr Edwell acknowledged the energy market was becoming increasingly complex with the onset of renewables, which may be contributing to some market breaches.\n\nBut he warned those companies still had to ensure they \"only recover their legitimate costs\".\n\n\"It's important that we pay no more than we need to, and that's no more apparent than now with the cost pressures we're all facing,\" he said.\n\nWA Energy Minister Amber-Jade Sanderson said it was not appropriate for her to comment on the Bluewaters case while it was being considered by the regulator, and did not respond to questions about reforms to regulation.\n\nWA Energy Minister Amber-Jade Sanderson. (ABC News: Courtney Withers)\n\n\"It is my expectation that all generators operate lawfully to ensure customers are not disadvantaged,\" she said.\n\nGriffin uncertainty\n\n‘A brutal solution’: Premier defends propping up failing coal mine with $220m The WA government has extended its financial support propping up the stricken Griffin Coal mine south of Perth to protect the state's electricity supplies.\n\nBluewaters' alleged breach comes amid uncertainty about the future of its power plants in WA, as the coal mine that fuels them, operated by Griffin Coal, approaches the end of its government lifeline.\n\nIndian-owned Griffin Coal has been kept afloat by $308 million in taxpayer subsidies since entering receivership in 2022, with debts of about $1.5 billion.\n\nThe WA Government has committed to ending its funding of Griffin Coal by June 2026.\n\nGriffin Coal has continued to pay off some of its debt to Indian lenders since receiving the government payouts, raising concerns about WA taxpayer dollars being used to offset the losses of foreign investors.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/rory-mcilroy-restores-australian-open-prestige/106112750",
    "title": "McIlroy completes Australian Open mission even if he did not lift trophy",
    "publish_date": "Sun, 07 Dec 2025 21:04:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "When he arrived in Melbourne ahead of the Australian Open, Rory McIlroy would not have envisaged a 10:12am tee time to start his final round.\n\nThe Northern Irishman must have been hoping he would not need to step up to Royal Melbourne's first hole until closer to midday, which was about the time the leading contenders were scheduled to get underway.\n\nA patchy opening three rounds left McIlroy among the earlier starters on Sunday and he was too far back to launch a genuine challenge to the leaders, finishing in a share of 14th place on 7-under-par.\n\nSmith denied first Australian Open title A missed putt costs Cameron Smith the chance of winning his first Australian Open, as Denmark's Rasmus Neergaard-Petersen claimed a thrilling one-stroke victory at Royal Melbourne.\n\nWhile McIlroy's main goal was to lift the Stonehaven Cup for the second time in his career, he still achieved another of his ambitions: helping to restore the prestige of the Australian Open.\n\nWhether Jack Nicklaus truly meant the tournament was once golf's unofficial \"fifth major\" is up for debate, but some time has passed since it was regarded among the premier events on the international calendar.\n\nThe Australian Open's history and tradition have long been admired by McIlroy, who famously pipped Adam Scott by a stroke to win the 2013 edition when it was hosted by Royal Sydney.\n\nHe played an almost ambassadorial role while in Melbourne, spruiking the merits of the 121-year-old tournament at every opportunity, and his presence created a buzz around golf in Australia, not seen since Tiger Woods visited these shores.\n\n\"I think everyone really appreciated the atmosphere that they played in this week,\" McIlroy said on Sunday.\n\n\"Hopefully it'll be the same next year at Kingston Heath and hopefully the tournament sort of grows from here, and sort of gets back to the stature that it deserves.\"\n\nRory McIlroy was making his first Australian Open appearance in over a decade. (Getty Images: Andy Cheung)\n\nOf course, a significant amount of money was forked out to secure McIlroy's services for consecutive Australian Open appearances (he is due to return next year).\n\nBut the investment has surely paid off across several metrics, including increased global interest and — most importantly for national governing body Golf Australia — the possibility of a financial windfall on the back of staggering attendance numbers.\n\nMore than 100,000 spectators converged on Royal Melbourne across the four rounds, with 33,408 making their way to the famous Sandbelt course on Sunday.\n\nEvery vantage point was taken to see Rory McIlroy play at Royal Melbourne. (Getty Images: Josh Chadwick)\n\nSpeaking on Friday, McIlroy was blown away by the crowd response on the opening two days, which saw in excess of 40,000 come through the gates.\n\n\"I said to Adam [Scott] walking up in the first [hole], it didn't feel like a Friday afternoon round,\" McIlroy said.\n\n\"It felt like we were going out in the final group on a Sunday.\n\n\"Just that scene on the first tee was amazing. And then walking up the last [hole] and everyone's still here, and it's incredible.\"\n\nCrowds flock to see McIlroy\n\nEven though McIlroy was out of contention, the spectator gallery following the five-time major winner during his final round was heaving.\n\nFans crowded around the tees, lined the fairways and descended on the greens in greater numbers than those watching the lead group — consisting of winner Rasmus Neergaard-Petersen, runner-up Cameron Smith and third-placed Si Woo Kim — for much of its round.\n\nMcIlroy endeared himself to his legion of fans by politely acknowledging them and accepting their encouragement, which came via regular calls of \"Go Rory!\".\n\nThe reigning Masters champion even made the day of one of his youngest supporters when he gifted and signed the cap he wore during his final 18 holes.\n\nAttracting fans was only one part of the strategy underpinning McIlroy's recruitment.\n\nAustralian Open organisers would be hoping the success of the past four days will entice a larger number of the world's best players to contest the tournament in the coming years.\n\nFormer world number five Max Homa has already expressed interest and he surely will not be alone.\n\nA conversation with US professional Matt McCarty — who finished in a share of eighth place — convinced McIlroy more world-class players will come, given the atmosphere and quality of Australia's golf courses.\n\n\"Matt McCarty and I were talking about it out there and I said, 'What brought you down here?' McIlroy recalled.\n\n\"He said, 'The golf course. I really wanted to play a tournament at Royal Melbourne … you compare this to a majority of PGA Tour events; this is so much better.'\"\n\nRory McIlroy did not fail to notice spectators' interest in the tournament. (Getty images: Josh Chadwick)\n\nA congested international schedule and the jostling between competing tours creates a challenge to secure the best talent, with South Africa and Bahamas also hosting events during the past week.\n\nMcIlroy, though, is adamant the Australian Open should be the preferred option.\n\n\"If you compare this tournament to the other two tournaments going on in the world of golf this week, there's no comparison,\" McIlroy said on Sunday.\n\n\"Yes, the field in The Bahamas is stronger than the one here. But in terms of atmosphere, golf courses — basically everything else you're looking for in a tournament — I can't think of many better than this.\"\n\nMcIlroy may not have won the Australian Open, but his appearance in Melbourne will surely help put it back on the map.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/asx-markets-business-news-live-updates-dec-8/106112736",
    "title": "Live: ASX down ahead of RBA rates decision this week",
    "publish_date": "Sun, 07 Dec 2025 20:05:38 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts"
    ],
    "text": "The big news on Wall Street's Friday session was the hefty $US72 billion ($108 billion) bid Netflix pitched at another media giant, Warner Bros Discovery, a bid Warners was very happy to accept.\n\nWarner Bros' share price jumped 6.3% on the news, while Netflix's fell 2.9%.\n\nParamount, a rival bidder in the chase for Warners along with Comcast, tumbled close to 10%.\n\nWarners has been in play for some time, with the $US27.75/share bid roughly three times what the company was trading at six months ago.\n\nThat's good news for Warners's shareholders and even better news for its veteran and extremely well-paid CEO, David Zaslav, who will, according to Bloomberg, become a billionaire if the deal goes through.\n\nHowever, it has a few regulatory and political hurdles it needs to clear first.\n\nSome members of Congress have already declared Netflix's proposed acquisition of Warner Bros Discovery's studios and streaming unit an antitrust \"nightmare\" for consumers and creatives, while the company touted the deal as driving value for viewers, workers and shareholders.\n\nDemocrat Senator Elizabeth Warren said the deal, \"Would create one massive media giant with control of close to half of the streaming market — threatening to force Americans into higher subscription prices and fewer choices over what and how they watch, while putting American workers at risk.\"\n\nFellow Democrat and co-chair of the House Monopoly Busters Caucus Pramila Jayapa called the deal a \"nightmare\".\n\n\"It would mean more price hikes, ads, & cookie cutter content, less creative control for artists, and lower pay for workers,\" she said in a post on social media site X.\n\nThere's also considerable disquiet among some important Republicans.\n\nSenator Mike Lee, a Utah Republican who leads the antitrust committee, said a Netflix takeover of Warner Bros Discovery's streaming assets \"should send alarm to antitrust enforcers around the world\".\n\n\"Netflix built a great service, but increasing Netflix's dominance this way would mean the end of the Golden Age of streaming for content creators and consumers,\" Senator Lee wrote in a post on X.\n\nLast month, Republican Senator Roger Marshall of Kansas and Representative Darrell Issa of California also called on US antitrust enforcers to scrutinise any possible Netflix-Warner Bros deal, saying it could lead to fewer movies in theatres.\n\nWarner Bros Pictures Animation began its journey with the iconic Looney Tunes in 1930 and has produced classics such as The Iron Giant, The Lego Movie franchise and Happy Feet.\n\nHowever, the company has been in the doldrums recently, with its profit and sales falling 5% last year.\n\nNetflix is the giant of the streaming space, with its revenues rising about 16% to $39 billion last year. It had 301.6 million total subscribers in 2024.\n\nWith Reuters",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/oscar-piastri-praised-as-future-formula-1-world-champion/106113274",
    "title": "'Sadly I've got a lot more seasons with him': Piastri praised as future champ",
    "publish_date": "Sun, 07 Dec 2025 19:48:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "Oscar Piastri may have fallen short in his bid to become a Formula 1 world champion, but he has earned plenty of admirers this season, with many tipping him to be a future world champion.\n\nPiastri needed a win and for his rivals, Lando Norris and Max Verstappen, to have bad weekends at the Yas Marina circuit in Abu Dhabi to have any chance of him claiming the title.\n\nAnd although he managed to lead the race due to a gusty one-stop strategy call and a brilliant overtaking move over his teammate on lap one, he was unable to last the distance, finishing second to Verstappen, missing out on the title by just 13 points.\n\nEven had Piastri won, teammate Norris was able to claim the podium spot he needed to win his first drivers' championship title.\n\n\"I think today yes [I can be satisfied],\" Piastri said on Fox Sports.\n\n\"We gave it everything. We tried a bit of a gamble on strategy and tried absolutely everything to try and win the race and give ourselves the best chance to win a championship.\n\nIt didn't happen for him this year, but it seems the entire paddock believes that it is only a matter of time before Piastri claims a title of his own — especially his McLaren bosses.\n\nOscar Piastri passed Lando Norris on the first lap of the race around the outside of turn nine. (Getty Images: Clive Mason)\n\nPrinciple engineer Andrea Stella was full of praise for the 24-year-old Australian, saying the team could have had \"two champions this year\".\n\n\"The gap between the two was so small,\" Stella said.\n\n\"Oscar was a worthwhile champion. He learned so rapidly. His trajectory is phenomenal and no doubt we have a future multiple world champion.\n\nF1 Abu Dhabi Grand Prix Max Verstappen has won the Abu Dhabi Grand Prix ahead of Oscar Piastri, but Lando Norris finishes third to claim the world title.\n\n\"I'm just so proud being proud [being a member] of the team, is my main feeling at the moment. Being proud of everyone, and everyone responded to the call this season and the call to elevate the game compared to last season.\n\n\"The demand has been huge; two drivers in the contest and trying to do it the McLaren way, trying to be fair and respectful. It has been a lot of work.\n\n\"The team has been so united, even with bumps in the road.\"\n\nCommentator and former driver Martin Brundle was clear that Piastri had all the tools to become one of the best, while former world champion Nico Rosberg said the Australian had a \"superpower\" that made him so impressive.\n\n\"His superpower is his mental strength. He's so level headed,\" the 2016 world champion said.\n\n\"There's no reason why Oscar can't turn it around next year.\"\n\nOscar Piastri came close, but not close enough, to teammate Lando Norris despite beating him in their last two races. (Getty Images: Formula 1/Bryn Lennon)\n\nMcLaren boss Zak Brown agreed.\n\n\"Both our guys won seven races, drove brilliantly, they supported each other,\" he said.\n\n\"It's a cruel sport how some things don't go your way when they're out of your control, but I'm excited to go racing with him [Piastri].\"\n\nEven his teammate Norris, who said Piastri had made him dig \"deeper than ever before\", acknowledged it would not be long before Piastri would overhaul him.\n\n\"I don't think people understand how difficult it can be — as people have proven in the past — having teammates fighting for a world championship,\" Norris said.\n\n\"For Zak [Brown] and Andrea [Stella] to have control over those things, it's certainly tougher than just having one car.\n\n\"We take points off of each other, we make our lives harder, strategies more difficult, but the team would always take that over only having one car performing for a world championship.\n\n\"I have to give congrats to Oscar because he's driven incredibly.\n\n\"I'm glad I've had Oscar for the last three years because, even though he's a lot newer to it than me, I've learned a lot from him and he showed me up so many times and I've managed to learn a lot from him, and I wouldn't be the driver I am today without that.\n\nLando Norris and Oscar Piastri celebrated at the end of the Abu Dhabi Grand Prix. (Getty Images: LAT Images/Steven Tee)\n\n\"He's made me have to dig even deeper than I ever have before.\n\n\"By the mid-point of the season he was performing better than I was and doing a better job consistently.\n\n\"At some point he's going to get the better of me because he's an incredible driver.\n\n\"I've enjoyed it, I've learned a lot.\n\n\"Sadly, I've got a lot more seasons with him in the future so I look forward to those tough moments as well.\"\n\nPiastri also credited his teammate for making him a better driver and said that although he did not enjoy every moment of the season, he can't wait to resume battle next year.\n\n\"It's been a fun challenge. Obviously at certain points maybe it doesn't feel that fun,\" Piastri said of the season-long battle with Norris.\n\n\"I think it's been a really enjoyable season for both of us probably — and I'm saying that as the person who's not champion.\n\n\"There's plenty more years to come of intense weekends and tight battles. I think it's made both of us better drivers.\"\n\nAnd as for the future?\n\n\"I've learned a lot of lessons on dealing with tough moments [this year],\" Piastri said.\n\n\"Ultimately I've learned a lot about myself.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-08/oscar-piastri-missed-f1-world-title-through-minor-moments/106113184",
    "title": "Piastri came so close, but these minor moments are what let the F1 title slip away",
    "publish_date": "Sun, 07 Dec 2025 19:37:45 +0000",
    "category": "sports",
    "authors": [],
    "text": "Immediately after the season-ending Abu Dhabi Formula 1 Grand Prix, the three key combatants were ushered way from the noise and mayhem of the circuit to relax on a plush sofa behind the podium for a moment.\n\nAfter spending most of the last 90 minutes racing at an average of 200km/h with a 1.6-litre, V6-hybrid engine screaming behind them, a more incongruous setting you could not imagine.\n\nBut it was here that Oscar Piastri, Max Verstappen and Lando Norris sat, largely in companionable silence.\n\nPerhaps they were processing the 58 laps of excruciatingly tense racing they had just competed against each other.\n\nPerhaps they were exhausted from the tension of the past few days and hours.\n\nPerhaps they were casting their minds over the thousands of kilometres and 24 rounds of races that brought them to this point in the first place.\n\nFor the two drivers who came so close, perhaps they were wondering what might have been.\n\nMax Verstappen and Oscar Piastri both had their chances to win the title. (Getty Images: Clive Rose)\n\nThis is a season that has taken the Formula 1 circus from Melbourne in March to Abu Dhabi in December, crisscrossing the world in the battle for global supremacy.\n\nIn the end, after so many ups and downs, the three key protagonists in the closest world title race for 15 years could only be separated by 13 measly points.\n\nF1 Abu Dhabi Grand Prix Max Verstappen has won the Abu Dhabi Grand Prix ahead of Oscar Piastri, but Lando Norris finishes third to claim the world title.\n\nIt was Norris who claimed his first title after eight years in Formula 1, just two points ahead of four-time champion Verstappen, with Piastri third after their nerve-racking Abu Dhabi Grand Prix battle.\n\nPiastri was, amid the fireworks and tears, the blaring music and supporters' cheers, the first man over to his teammate to congratulate him on his win.\n\nBut in his heart, he may be wondering where it went wrong for him and why those roles were not reversed.\n\nOf the three drivers to have led the championship this year, none did so for longer than Piastri.\n\nFor 15 consecutive race weekends between Saudi Arabia and Mexico, the Aussie led the pack. After the Dutch Grand Prix in round 15, Piastri led the world title race by 34 points, with Verstappen a whopping 104 points further back.\n\nHow then, from there, did he lose it so dramatically?\n\nLando Norris got the chocolates this time around. Will next time be Oscar Piastri's turn? (Getty Images: Clive Mason)\n\nPiastri had won five of the first nine races. Then, he won two of the next six, including at Zandvoort at the Dutch Grand Prix, the first race after the summer break, where Norris did not score any points at all\n\nBut then, Piastri went off the boil — he didn't win any of the last nine races of the year and missed the podium in six of them.\n\nSo where did the wheels fall off?\n\nWas it at Monza at the Italian Grand Prix? It was there that Piastri was controversially asked to hand a position back to Norris after the British driver had a bad pit stop.\n\nYes, Norris had, reluctantly, done the same for Piastri at the Hungarian Grand Prix in 2024, which was Piastri's first-ever win in Formula 1.\n\nIt led to plenty of people suggesting that McLaren were favouring the Englishman over the Australian — an inferiority complex based on the painful experiences of Mark Webber being summarily relegated to second fiddle by Sebastian Vettel and Daniel Ricciardo's Verstappen woes — and that no matter how good Australian drivers are, they have to be better than their European counterparts to ever get an opportunity to fight for the biggest prize.\n\nLando Norris and Oscar Piastri promise plenty of battles to come. (Getty Images: Formula 1/Bryn Lennon)\n\nWhether McLaren were favouring one driver or the other — and outside of Australia the prevailing view is that they were not — the Monza mashup clearly unsettled Piastri.\n\nHe would go on to call it \"the worst weekend I've ever had in racing\" after all and, the very next race in Azerbaijan, during an error-strewn weekend, Piastri crashed and retired on the first lap, his only race retirement of the season.\n\nHe finished off the podium at the next four races in Singapore, Austin, Mexico and Brazil, before both McLarens were disqualified at the Las Vegas Grand Prix, making for a rough six race weekends in a row.\n\nFormer racer and commentator Martin Brundle noted that there were a number of moments outside what he called Piastri's \"fallow period\" late in the season, which it was noted came just as people began talking about him as a genuine title favourite.\n\nOscar Piastri's bash in Baku was a major error of judgement that cost him valuable points. (Getty Images: Rudy Carezzevoli)\n\nBut he noted that there were subtle missed opportunities or mistakes throughout the season that all added up to issues.\n\n\"One rainy corner in his backyard in Melbourne, he was so unlucky to go off onto the grass and lose so many points there,\" Brundle noted.\n\nPiastri lost control in the wet when running in the top few positions and dropped to 13th before recovering to finish ninth.\n\nThen there were the two \"hard penalties\" that Piastri had to serve at Silverstone and in Brazil, the first for \"erratic braking\" under the safety car, which led to Verstappen briefly overtaking him while preparing for the restart, the second for causing an accident when he locked up and crashed into Kimi Antonelli.\n\nThose penalties meant he finished second in Britain and fifth in Brazil, dropping more valuable points.\n\n\"Those could easily have been mitigated,\" Brundle said, suggesting that they could have been reduced to five-second infringements or not penalised at all.\n\nAdd the Vegas disqualification and the Qatar pit stop error — both mistakes by his team that Piastri had nothing to do with — and you can see why he'd feel hard done by.\n\nBut realistically, these mistakes are just the ebb and flow of a hard-fought season that takes place over the course of 10 gruelling months.\n\n\"There are a number of little turning points,\" Brundle said.\n\n\"You can't change that. He needs to work where he needs to be stronger … and draw a line under it.\n\n\"Easier said than done.\"\n\nLando Norris and Oscar Piastri hugged each other at the end. (Getty Images: Clive Rose)\n\nEasier said then done knowing that, with new regulations coming in next year, there is no guarantee that McLaren will again be the dominant car they were this campaign.\n\nMcLaren's return to the top of Formula 1 has not been an overnight sensation — their 2024 constructors title was a first in 26 years.\n\nJust because an ascent was hard fought, it doesn't mean that the descent will be just as gradual.\n\nEasier said than done knowing that, just because people have hailed you as a future world champion, until your name is on the trophy and the champagne is for you and you alone, those sentiments are worthless.\n\nJust look at his manager, Webber. He led the title race in 2010 but fell short in the closing couple of rounds. He never got another chance.\n\nPerhaps Piastri can take solace in knowing that it was not just he who was left to rue mistakes.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nVerstappen may look back on a rush of blood in Spain that cost him a 10-second penalty when he crashed into the side of George Russell's Mercedes.\n\nThat 10-second penalty essentially cost him 11 points. He finished the race 10th while he was fighting for fourth with Russell at the time of his mistake.\n\nBut Verstappen already has four world titles. He doesn't have to worry about his legacy being unfulfilled.\n\nBut there are plenty of minor moments that shape a season — it's what makes them so compelling.\n\nAnd every mistake or error is a learning moment for Piastri.\n\nSometimes coming close makes you stronger for a tilt at the top next time around.\n\nSometimes it's a scar that never heals.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/national/victoria/man-killed-and-woman-badly-injured-after-car-ploughs-into-melbourne-medical-centre-20251208-p5nlqx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Really upset’: Workers describe horror after man killed in medical centre crash",
    "publish_date": "Mon, 08 Dec 2025 12:59:49 +1100",
    "category": "finance",
    "authors": [
      "Cassandra Morgan"
    ],
    "text": "Restaurant workers have described their horror at finding a man unresponsive and bloodied after a car crashed into a medical centre in Melbourne’s north, also injuring a woman.\n\nEmergency services were called to the intersection of Keilor Road and Hoffmans Road after reports of a car mowing down a pedestrian on the footpath before crashing into the Essendon Health Medical Centre at about 9.30am.\n\nAn SES tent was erected in Niddrie after a car ploughed into a pedestrian and through a shopfront. Credit: Eddie Jim\n\nA woman, aged in her 50s, who was inside the building, was also struck and airlifted to hospital with serious injuries.\n\nShe has been taken to the Royal Melbourne Hospital with upper and lower body injuries. The pedestrian died at the scene.",
    "source": "SMH",
    "cluster_id": 12
  },
  {
    "url": "https://www.smh.com.au/national/queensland/museum-faces-heat-over-gas-company-sponsorship-of-education-program-20251207-p5nlkf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Museum faces heat over gas company sponsorship of education program",
    "publish_date": "Mon, 08 Dec 2025 12:57:59 +1100",
    "category": "finance",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "The Queensland Museum has been accused of allowing a sponsorship deal with one of the world’s largest gas corporations to influence educational materials it distributed that teach students about climate change without mentioning fossil fuels.\n\nComms Declare, a climate advocacy group, released a report on Monday criticising the materials available for teachers to use in Queensland classrooms, which come branded with the logo of Shell QGC – the division of the multinational energy company that drills for natural gas in Queensland.\n\nThe resources cover topics including extreme weather, threatened species and ocean acidification, but omit a focus on the role of fossil fuels, including coal and gas, in driving climate change.\n\nQueensland Museum at South Bank in Brisbane. Credit: Queensland Museum\n\nIn one example, a resource explains ocean acidification in relation to excess carbon dioxide, without identifying fossil fuels, such as coal, oil or gas combustion, as the cause.",
    "source": "SMH",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/culture/books/be-merry-be-bright-unbox-a-good-book-tonight-20251117-p5ng22.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Be merry. Be bright. Unbox a good book tonight.",
    "publish_date": "Mon, 08 Dec 2025 12:53:30 +1100",
    "category": "finance",
    "authors": [],
    "text": "This article contains links from our affiliate partners. We may receive a commission when you buy through links on our site.\n\nFirst-time app shopper? Get $10 off your first Amazon app purchase when you spend $100 or more. Use code APPYXMAS10 at checkout. T&Cs apply.\n\nThe Let Them Theory: A Life-Changing Tool That Millions of People Can’t Stop Talking About by Mel Robbins\n\nThe Let Them Theory: A Life-Changing Tool That Millions of People Can’t Stop Talking About by Mel Robbins Credit: Amazon\n\nKindle Colorsoft 16GB",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/national/queensland/a-little-bit-different-but-it-s-organic-bush-beef-the-answer-to-a-feral-queensland-problem-20251208-p5nlsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘A little bit different, but it’s organic’: Bush beef the answer to a feral Queensland problem",
    "publish_date": "Mon, 08 Dec 2025 12:45:06 +1100",
    "category": "finance",
    "authors": [
      "Keira Jenkins"
    ],
    "text": "For hundreds of years since white settlement, wild cattle have wreaked havoc on a remote 30,000-hectare property, creating environmental and cultural challenges for its First Nations custodians.\n\n“If they’re not caught, they just breed and breed ... erosion is a big problem and in culturally significant areas they move in there and destroy it,” Normanby Aboriginal Corporation managing director Vince Harrigan said.\n\nWild cattle on Balnggarrawarra Country in Cape York.\n\nBut Balnggarrawarra Traditional Owners and the corporation, which runs Normanby Station in Queensland’s Cape York region, have taken the problem and turned it into something more palatable.\n\n“We grew up eating this stuff,” Harrigan said.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/property/news/couple-drops-2-5m-on-home-with-pool-for-big-dog-who-likes-swimming-20251208-p5nlo7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Couple drops $2.5m on home with pool for ‘big dog who likes swimming’",
    "publish_date": "Mon, 08 Dec 2025 12:45:00 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A pair of devoted dog parents have dropped $2.5 million on a Camp Hill home so their water-loving pooch can finally live its best splash-and-paddle life.\n\nPerched on a 405-square-metre block at 13 Brisbane Avenue, the four-bedroom home comes with a designer kitchen and a resort-style saltwater pool with a waterfall that proved irresistible to the buyers and their large dog.\n\nHaving first seen the home 15 minutes before the auction, the pair opened bidding at $2.1 million, sparking a flurry of fast rises among three other active bidders until competition stalled at $2.4 million.\n\nOne brief chat between the buyer and seller later, and the hammer came down at $2.5 million – making it Brisbane’s highest recorded auction sale of the weekend.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/politics/federal/wells-billed-taxpayers-to-fly-husband-to-two-boxing-day-tests-20251206-p5nlf9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wells billed taxpayers to fly husband to two Boxing Day Tests, three Grand finals",
    "publish_date": "Mon, 08 Dec 2025 12:42:05 +1100",
    "category": "sports",
    "authors": [
      "James Massola"
    ],
    "text": "The cost of a seat in a corporate box on Grand Final day starts at $4500 per person, which suggests the potential cost of Wells’ six free grand final tickets over three years could be as much as $27,000. All of these claims are within the rules that govern family reunion flights and travel entitlements, but these latest revelations will prompt further questions about whether Wells’ use of the entitlements meet community expectations. It is not clear if Wells and her husband attended the 2025 grand final as expenses for this period have not yet been reported. Wells’ office has been contacted for comment. Earlier on Monday, this masthead revealed that in 2022 and 2024, Wells flew McCarthy from Brisbane to Melbourne under family reunion entitlements to attend the December 26 Test match, while enjoying the corporate hospitality of the sport’s governing body.\n\nCommunications and Sport Minister Anika Wells. Credit: Alex Ellinghausen The minister, who on Sunday was defending a separate use of taxpayer-funded entitlements to fly her husband and two of their three children to join her at the Thredbo ski resort this year, also flew McCarthy to Sydney for a cricket event hosted by Albanese. Wells and Albanese both defended her use of nearly $3000 in taxpayer-funded money after this masthead revealed her family had flown in to Thredbo while she undertook official business with the Australian Paralympic ski team. Under the family reunion rules, federal MPs are allowed up to three return business class flights per year for family members that are between the MP’s home base and a city other than Canberra. This is how Wells recorded the flights to the cricket, to Thredbo and to the grand finals. Loading\n\nThere is no suggestion Wells has contravened any rules, but the expenses claims raise questions about her use of entitlements and whether they are in line with “community expectations”. Wells told Sky News on Sunday in response to the Thredbo story that her claims were within the rules, but she said she could “absolutely appreciate that people have a gut reaction to these figures”. “I don’t resile from that, and that’s why I agreed that entitlements should be scrutinised. I’m happy for mine to be scrutinised,” she said, “but at the end of the day, I don’t write these rules.” Albanese told the ABC’s Insiders program it was “completely within the rules”. “There are family reunion entitlements available. All of the travel was within guidelines,” he said.\n\nOn Monday, fellow frontbencher Tanya Plibersek defended Wells on Nine’s Today. “There are so many weekends away from home, and if you’re sports minister, a lot of those are very deliberately weekend events that you’re required to attend because that’s when people watch sport. That’s when people play sport. She was in Thredbo to highlight the extra investment we’re making in the Paralympics.” Anika Wells and Anthony Albanese both defended the Thredbo trip. Credit: Alex Ellinghausen More than $4000 for three cricket trips During the 2022-23 Test cricket series against South Africa, Wells charged taxpayers for family reunion flights on December 26, so McCarthy could fly between Brisbane and Melbourne in one day. The two flights cost $1885.29. Wells also received three free corporate tickets from Cricket Australia.\n\nIn the 2023-24 season against Pakistan, Wells received only one free ticket to attend the Boxing Day Test. She did not charge taxpayers for her husband to fly to Melbourne that year. However, taxpayers were hit just a few days later, when Wells spent another $1274.72 for two more family reunion flights between Brisbane and Sydney, on January 1, so McCarthy could join her at Albanese’s reception for the Australian and Pakistani teams at Kirribilli House. During the 2024-25 season, Wells charged taxpayers for reunion flights that cost $983.82 so that McCarthy could fly return from Brisbane to Melbourne to join her at the MCG on December 26. The couple were guests of Cricket Australia. Loading The total cost to taxpayers for all flights was $4183.83 over three years, according to the Independent Parliamentary Expenses Authority website, and on all three occasions, the sports minister and her husband had been together for just one day.\n\nThe MCG charges up to $995 per person for a seat in a corporate box, which means the potential value of the six free tickets from Cricket Australia could be nearly $6000. Sports ministers and their opposition counterparts frequently attend high-profile events as guests of sporting organisations, and their attendance at these events is in keeping with the “dominant purpose” test, which determines whether an MP’s travel is appropriate. Wells said the hospitality she received from Cricket Australia is in line with the rules of parliament’s register of members’ interests. Wells under pressure as social media ban looms Wells has been under pressure since last week following revelations of the full cost of Wells’ ministerial trip to the United Nations General Assembly in September to showcase the social media ban for children.\n\nIt then emerged she had claimed $3600 in travel entitlements for trips to Adelaide, where she attended a friend’s birthday party as well as conducting official business; three trips to France in one year as sports minister at a combined cost $116,000, and the $2845.50 Thredbo family reunion. A government spokesman said: “The travel was in accordance with guidelines and in capacity as minister for sport.” The spokesman did not answer questions about why Wells needed to have three one-day reunions with her husband, whether the minister would repay any of the expenses claimed, or whether the trips met community expectations. The minister’s use of family reunion flights is similar to an Uluru trip that Tony Burke took in 2012, while environment minister, when he charged taxpayers close to $9000 so his wife and children could join him. Burke’s claim was also within the rules, but when details of the trip emerged in 2015, he said the trip was “beyond community expectations” and in 2020 paid the costs back.\n\nOpposition finance spokesman James Paterson said Wells’ travel and entitlement usage “failed the kitchen table test”. “She’s a minister who is not just out of touch with Australians, but she’s out of touch with reality,” Paterson said. In 2017, Opposition Leader Sussan Ley had to resign from her position then as health minister in the Turnbull government when it was revealed she had bought an apartment on the Gold Coast while on official trips. Read more on Wells’ expenses Rob Harris analysis: The optics on Wells’ $94,000 flights to New York are terrible\n\nThe optics on Wells’ $94,000 flights to New York are terrible Thredbo ski trip: Nearly $3000 of taxpayer money to bring husband and two children to resort\n\nNearly $3000 of taxpayer money to bring husband and two children to resort Birthday party: Wells attended friend’s soiree during $3600 taxpayer trip",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/when-the-party-s-over-why-you-break-emotionally-and-physically-at-year-s-end-20251201-p5njwb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When the party’s over: why you ‘break’ emotionally and physically at year’s end",
    "publish_date": "Mon, 08 Dec 2025 12:38:29 +1100",
    "category": "lifestyle",
    "authors": [
      "Franki Hobson"
    ],
    "text": "The people who hold it all together tend to break hardest when they finally stop.\n\nBeing the “strong one” becomes expected of them — it’s easier to keep going than admit overwhelm. Emotional labour, caregiving, household logistics, unresolved trauma, invisible responsibility… all of it accumulates quietly until it becomes physically impossible to maintain.\n\nYounger Australians are feeling it too, with three in four workers under 25 quietly cracking, compared with 35.7 per cent of those over 55, according to the ‘2025 Australia Workplace Report’. It’s a cross-generational pressure cooker: adults stretched thin by responsibility, younger workers strained by uncertainty.\n\n“For people who have substance use issues, complex relationships or childhood trauma, Christmas can be a time where the increased stress, expectations and family contact become overwhelming or lead to crisis,” explains Sutton. “It’s also a time of evaluation, offering a new year and an opportunity to focus on holistic recovery, addressing physical, emotional and spiritual well-being.”\n\nCoping culture and the slide into numbing\n\nWhen pressure builds and emotional space disappears, people turn to coping mechanisms without realising it: another drink, another late-night email, another overloaded week.\n\n“At Byron Private, we see people who have turned to alcohol, food or over-functioning because these behaviours give quick relief from stress or uncomfortable emotions,” Meighan says. “High stress dulls self-awareness. Coping becomes automatic before they recognise the long-term toll.”\n\nThe distinction between “coping” and “numbing” is subtle but crucial.\n\n“Coping is intentional and restorative, such as a walk, a conversation, journaling, boundaries,” she explains. “Numbing is avoidance. It may feel good temporarily but doesn’t address the underlying issue.”\n\nDecember is the perfect social enabler: indulgence without guilt, excess framed as normal, emotional load wrapped in celebrations and primed for collapse.\n\nRecognising the patterns early can prevent escalation. “Awareness is the foundation for change,” explains Kim. Credit: Byron Private\n\nWhen stopping makes everything catch up\n\nThe crash isn’t weakness; it’s biology. Many people run on stress hormones for most of the year. When the external pressure lifts, the body finally releases vigilance.\n\n“People often hold out until a safe point, like the holidays,” Meighan says. “Once they get there, their system collapses precisely because it finally can.”\n\nWhat happens next is all too familiar for many:\n\nthe adrenaline drop, which can leave people exhausted, weepy or ill\n\ndeferred emotions rising because the brain finally feels safe enough to release them\n\na cognitive hangover, where the mind struggles to shift gears and feels numb or flat\n\nThis is what some call the “December Mirror”, the moment when all the emotions and unmet needs that have been shelved for 12 months finally demand attention.\n\nIt’s no coincidence that people who have been “quietly cracking” are 6.2 times more likely to burn out, a statistic that mirrors what Meighan sees every year.\n\n“Stopping signals safety,” she explains. “But that can look like tears, irritability or total shutdown before rest actually begins.”\n\nShane adds: When stress responses are frequently activated, such as from overly anxious behaviour, it can prevent the body from fully recovering and result in emotional exhaustion.\n\nThe shift toward conscious recovery\n\nThere is a growing cultural shift away from numbing and toward conscious recovery, healing the root causes rather than escaping them.\n\n“Trauma-informed recovery focuses on safety and understanding why the coping behaviour developed,” Meighan says. “Removing the behaviour alone often leaves someone vulnerable. Recovery is about building resilience, not just stopping drinking or working too much.”\n\nTrue recovery, she says, is not stepping away from life, but “building a life you don’t need to escape from.”\n\nIt’s also deeply personal:\n\nrecognising red flags early\n\nnaming overwhelm without judgement\n\npractising self-compassion\n\nbuilding sustainable coping tools\n\nasking for support before collapse, not after\n\n“And for someone reading this who recognises themselves, recognising these patterns early can prevent escalation,” Meighan adds, “the first gentle step is simply noticing what’s happening. Acknowledge you’re overwhelmed and deserve care. That awareness is the foundation for change.”\n\nThe festive season will always ask something of us. But as more Australians recognise the emotional cost of running on empty, a new wellbeing movement is emerging: one centred in compassion, prevention, and understanding what our bodies and minds have been trying to tell us all year.\n\nByron Private is an integrated, trauma-informed recovery centre helping individuals with complex lives restore balance and resilience through personalised, evidence-based clinical care for mental health and addiction.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-dip-wall-street-hovers-near-record-20251208-p5nlm8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Miners fall as ASX slides lower",
    "publish_date": "Mon, 08 Dec 2025 12:38:14 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket has extended its losses to kick off the week as investors await the Reserve Bank’s interest rate decision on Tuesday.\n\nThe S&P/ASX 200 was down 27.9 points, or 0.3 per cent, just after midday, with nine of 11 sectors in the red. Utilities are proving to be the biggest weight on the bourse.\n\nWall Street advanced on Friday to the cusp of a new record. Credit: AP\n\nMiners have slumped with Rio Tinto shedding 2.1 per cent, BHP 0.7 per cent lower and Fortescue down 0.4 per cent. Gold miners are weaker, with Northern Star down 2.2 per cent and Evolution Mining sliding 1.6 per cent.\n\nThe big banks are mixed. Westpac was up 0.4 per cent and the Commonwealth Bank rose 0.4 per cent but the National Australia Bank (down 0.8 per cent) and ANZ Bank (down 0.7 per cent) lost ground.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/shane-richardson-to-walk-away-as-wests-tigers-chief-executive-20251208-p5nlov.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shane Richardson to walk away as Wests Tigers chief executive",
    "publish_date": "Mon, 08 Dec 2025 12:37:14 +1100",
    "category": "finance",
    "authors": [
      "Dan Walsh",
      "Michael Chammas"
    ],
    "text": "Wests Tigers chief executive Shane Richardson has informed staff that he will walk away from the joint-venture as the club’s front-office turmoil claims another high-profile scalp.\n\nRichardson is poised to quit his role less than 18 months into a four-year deal that began last July, in response to the removal of four independent directors from the Tigers board last week.\n\nShane Richardson. Credit: Getty Images\n\nRichardson called a meeting on Monday to tell staff of his decision. It is unclear at this stage when Richardson will end his tenure but his decision will leave the club without a chairman or CEO, given he follows former NSW premier and administrative ally Barry O’Farrell out the door.\n\nOutgoing Manly boss Tony Mestrov – whose tenure at the Sea Eagles is due to finish on December 19 – has been approached as a replacement but is yet to confirm his next move. Mestrov declined to comment on Monday.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/liverpool-press-officer-reacts-to-stars-bold-claims-20251208-p5nlst.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Liverpool press officer reacts to star's bold claims",
    "publish_date": "Mon, 08 Dec 2025 12:23:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Liverpool press officer reacts to star's bold claims\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/firefighter-killed-in-new-south-wales-midday-news-bulletin-8-december-2025/p4nyhzhtb",
    "title": "Firefighter killed in New South Wales | Midday News Bulletin 8 December 2025",
    "publish_date": "Mon, 8 Dec 2025 01:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nA firefighter dies while fighting a fire in New South Wales\n\nAid reaches hundreds of thousands of Palestinians in Gaza\n\nJessica Stenson breaks the Australian marathon record\n\nA firefighter has died on the Central Coast of New South Wales, after being struck by a tree while working to contain a fire.\n\n\n\n\n\nParamedics treated him at the scene on Little Nugra Road at Nerong, about 90 kilometres north of Newcastle - but he succumbed to his injuries.\n\n\n\n\n\nThe firefighter worked for the National Parks and Wildlife Service.\n\n\n\n\n\nDeputy Secretary Alex Graham says the organisation's thoughts are with the firefighter's family during this difficult time.\n\n\n\n\n\nPremier Chris Minns has told Channel Nine it is a very sad day.\n\n\n\n\n\n\"Authorities are in the process of contacting that firefighter's family. I can't say much more than that. We are heartbroken by this news. It is devastating. And it is a reminder of what firefighters have to do to keep the public safe. It is many ways a dangerous profession. And we are deeply indebted to the men and women who devote their time to keeping us safe. This is terrible news today.\"\n\n\n\n\n\nAt least 20 homes have been destroyed on the Central and Mid North Coasts over the weekend, with weather conditions easing overnight.\n\n\n\n\n\nHowever, the fire danger is expected to remain and increase again come Tuesday with high temperatures and wind forecast.\n\n\n\n_\n\n\n\nA senior federal minister is defending her taxpayer-funded trips as being within government guidelines, as new details emerge about other costs.\n\n\n\n\n\nAnika Wells has been criticised after it was revealed in Senate Estimates that her overseas trip to New York to promote Australia's social media age ban cost taxpayers $100,000 - which covered the cost of last-minute flights for herself and staff.\n\n\n\n\n\nMs Wells says the trip was booked at the last minute due to fallout from the deadly Optus triple-zero outage.\n\n\n\n\n\nFurther details have since emerged about trips she took to Paris, Thredbo and Adelaide.\n\n\n\n\n\nSocial Services Minister Tanya Plibersek has told Channel Seven, it was very important for Ms Wells to be in New York.\n\n\n\n\n\n\"When we're up against the big tech giants having that sort of global support really helps us in what we're doing. And the reason we're doing this of course is because we're being contacted by so many parents who are worried about the impact that social media has had on their kids - or is having on a whole generation of kids. Being in New York was valuable, important - it helps Australia's interests and it helps us do what we want to do, which is stand up to the big tech giants and protect our kids.\"\n\n\n\n_\n\n\n\nThe state governments in New South Wales and South Australia are joining the federal government to defend against a High Court challenge on the social media ban.\n\n\n\n\n\nThe case is being brought by two teenagers and supported by the \"Digital Freedom Project\".\n\n\n\n\n\nThey argue against banning kids from social media as it infringes on implied freedom of communication.\n\n\n\n\n\nThe social media ban takes effect on Wednesday and applies to 10 platforms, including Facebook, Instagram, TikTok, Snapchat and X.\n\n\n\n_\n\n\n\nMortgage holders aren't expected to get an early Christmas present from the Reserve Bank, with a cut to interest rates all but off the table.\n\n\n\n\n\nThe central bank will begin two days of talks on Monday in its final board meeting of the year, after which the official cash rate is expected to remain at 3.6 per cent.\n\n\n\n_\n\n\n\nNearly two months after a fragile ceasefire took hold in the Gaza Strip, international aid agencies say they have finally been able to reach hundreds of thousands of Palestinians with basic food supplies.\n\n\n\n\n\nIt marks a much needed change from the limited and sporadic aid permitted before the war was paused on the 10th of October and the months-long blockade was lifted.\n\n\n\n\n\nThe World Food Programme says it reached 1.1 million people in November, delivering food parcels and wheat flour to nearly half of Gaza’s 2.3 million residents.\n\n\n\n\n\nBoxes containing rice, lentils, canned beans, tomatoes and cooking oil are now being distributed across 59 sites, including in Gaza City.\n\n\n\n\n\nMaxime Le Lijour is the W-F-P communication officer in Gaza.\n\n\n\n\n\n\"I’m currently at the Kerem Shalom border crossing between Israel and Gaza, where today we picked up 47 trucks worth of lifesaving humanitarian aid. Thirty of these trucks contain WFP food supplies, while 17 are for other humanitarian partners that we are supporting through the logistics.\"\n\n\n\n_\n\n\n\nBritish photographer Martin Parr died at his home on Bristol at the age of 73.\n\n\n\n\n\nThe Martin Parr Foundation confirmed the news.\n\n\n\n\n\nA celebrated photographer, Parr was known for his documentary-style photography focusing on British social class that was often colourful and satirical, but also thought-provoking.\n\n\n\n\n\nHaving risen to prominence in the 1980s, his career went on to span decades.\n\n\n\n\n\nIn this interview, he says photography continues to play an important role in society.\n\n\n\n\n\n\"I think people still think of photography as something that's done as a craft rather than as an accessory to other arts. Whereas, if you look at the democracy of photography, you look at the incredible number of people who are posting images on Instagram, the support photography, photography shows are very popular. Photographic books sell very well. So, it's really just the establishment from the art world catching up and understanding how important photography is.\"\n\n\n\n_\n\n\n\nIn athletics, Jessica Stenson has broken the Australian marathon record with her race time in Spain.\n\n\n\n\n\nThe 38-year-old crossed the finish line in 2 hours, 21 minutes and 25 seconds at the Valencia Marathon - nine seconds faster than the previous record set by her friend Sinead Driver of 2 hours, 21 minutes and 34 seconds.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 22
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/migrant-workers-like-ethel-feel-abandoned-by-this-scrutinised-government-scheme/mpx0ie0pc",
    "title": "Migrant workers like Ethel feel abandoned by this scrutinised government scheme",
    "publish_date": "Sun, 7 Dec 2025 05:03:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nEthel, not her real name, has worked long days to pick Australia's fruits and vegetables.\n\n\n\n\n\nIn August, the 33-year-old fell off a tractor while working on a farm in Leeton, a regional town of New South Wales.\n\n\n\n\n\n\"I fell over and I struggled to stand so I think, I don't know what is happening.\"\n\n\n\n\n\nDespite the severe injury on her leg, there's no way for Ethel to seek government support.\n\n\n\n\n\nThat's not just because she's a migrant worker, but also because she's one of the over 7,000 workers who have disengaged from the Pacific Australia Labour Mobility scheme.\n\n\n\n\n\nOften known as the PALM scheme, the government initiative offers temporary visas for workers from nine Pacific island nations and Timor-Leste to take short-term or long-term roles in Australia.\n\n\n\n\n\nBut the scheme has been under scrutiny in recent years, due to allegations of worker exploitation and harsh working conditions.\n\n\n\n\n\nEthel, who came from the Solomon Islands via the PALM scheme in 2022, says during her four-month work on a farm in northern Queensland, she was only left with around 200 dollars to send back to family.\n\n\n\n\n\nThat's because under the PALM scheme, employers could make deductions from the wages of workers for rent and transport.\n\n\n\n\n\n\"Family at home (were) asking for more money and we would send but we (were) left with nothing and that's why we left the PALM scheme.\"\n\n\n\n\n\nEthel left the PALM scheme and became a worker with no visa.\n\n\n\n\n\nAfter her fall, she had no idea who she could turn to for help.\n\n\n\n\n\nPaul Maytom is a former fruit picker who's now the president of the Leeton Multicultural Support Group.\n\n\n\n\n\nHe took Ethel to hospital where she underwent three surgeries, sorting out her paperwork to apply for hardship and pay for her medication.\n\n\n\n\n\nMr Maytom says he's met many workers who are in similar conditions as Ethel.\n\n\n\n\n\n\"The people that I've worked with over the last 18 months, they're people that either don't have enough money because they've got sick, or they got injured and there's no cover.\"\n\n\n\n\n\nOnce leaving the PALM scheme, many Pacific workers will either hold no visa or only be eligible for a bridging visa.\n\n\n\n\n\nMr Maytom says many people who turned to him for help claim to have suffered from exploitation.\n\n\n\n\n\nAnd not everyone can feel safe to return home, like Constantino Waowao.\n\n\n\n\n\nThe 43-year-old from Solomon Island left the scheme due to mistreatment by his employer in 2022.\n\n\n\n\n\nHis sexual identity makes him scared of returning to Solomon Island, and since 2023, he's been on a bridging visa waiting to be granted a protection status.\n\n\n\n\n\n\"I'm gay, I will never go back, if I go back they will kill me, that's why I'm here\".\n\n\n\n\n\nKen Dachi is from Welcoming Australia, a non-for-profit organisation that has supported dozens of disengaged workers in Leeton.\n\n\n\n\n\nHe says because of limited protections, disengaged workers are at significant risk of exploitation including underpayment, forced labour and deceptive recruitment.\n\n\n\n\n\n\"A certain percentage of the food we buy everyday is from the hands of a disengaged workers. It's exploited labour that's contributed to its coming to the shelf.\"\n\n\n\n\n\nHe says allowing workers to move between employers on the PALM scheme would lead to fewer disengaged workers.\n\n\n\n\n\nLeeton has a reputation for welcoming newcomers, but Mr Dachi says their support systems aren't designed to manage the scale and complexity associated with widespread worker disengagement.\n\n\n\n\n\n\"Goodwill is not a strategy. Is it sustainable? No, there's donor fatigue, there's volunteer fatigue.\"\n\n\n\n\n\nJustin Davidson is a fifth-generation family farmer who grows oranges in Leeton.\n\n\n\n\n\nHe wants a model that better protects and employs disengaged workers.\n\n\n\n\n\n\"I think everyone can acknowledge it is a problem and we need to address it, it's not sustainable.\"\n\n\n\n\n\nPaul Maytom says there must be a safety net, such as interim health cover for disengaged workers, and an amnesty for the ghost workforce to be re-engaged into the scheme.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/article/disaster-payments-unlocked-as-nsw-battles-another-day-of-bushfires/wpvg7nf2g",
    "title": "'At a loss': NSW bushfire victims in shock as disaster payments unlocked",
    "publish_date": "Sun, 7 Dec 2025 02:44:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Janice Rattray has lived in her home in Koolewong on the NSW Central Coast for 11 years. It was completely destroyed on Saturday, with Janice having no time to recover a single possession — or save her pets.\n\n\n\n\n\n\"We took nothing. I didn't even have my purse. I just walked straight out,\" she told SBS News.\n\n\n\n\n\n\"I'm saddest about losing my cats\".\n\n\n\n\n\nJanice said the fire front moved alarmingly quickly towards her home, which she shared with her daughter Elise plus her daughter's partner Nick Gibbs and the couple's young son Oscar.\n\n\n\n\n\n\"We saw all that fire and Nick said: 'we've got to go, we've got to get out of here'.\"\n\n\n\n\n\n\"He didn't even put his shoes on and he walked down this tar road and burnt all the soles of his feet and spent the night in hospital,\" she said. \"He had the baby on his shoulders.\"\n\n\n\nREAD MORE NSW braces for worst bushfire risk in years amid hot and windy conditions\n\nShe said the family watched their home's destruction.\n\n\n\n\n\n\"We went down to the park and watched it all happen. We get a direct line from the park straight up to the house, so we could see it burn.\n\n\n\n\n\n\"It was devastating.\"\n\n\n\n\n\nJanice says the family has four nights of crisis accommodation through the Diggers while locals had offered them short-term accommodation.\n\n\n\n\n\n\"We've been here 11 years and never had to evacuate ... I'm at a loss,\" she said.\n\n\n\n\n\nTheir home was among around a dozen properties destroyed in Koolewong, with firefighters having now gained the upper hand on the fast-moving blaze as strong winds gave way to a cool change.\n\n\n\nNatural disasters have been declared in six NSW LGAs, unlocking federal and state assistance. Source: AAP / Dan Himbrechts About 76 bush and grass fires were still burning in NSW on Sunday morning following earlier extreme heatwave conditions. Another four homes were lost further north at Bulahdelah on the Mid North Coast.\n\n\n\n\n\nNSW Premier Chris Minns travelled to the bushfire-hit area earlier in the day, speaking to families who had lost their homes in the lead-up to Christmas.\n\n\n\n\n\n\"They were able to get as much as they possibly could in the car and evacuate in a short space of time,\" he told reporters at Gosford RSL Club's makeshift emergency evacuation centre.\n\n\n\n\n\nA fire at Milsons Gully, west of Muswellbrook, has scorched more than 11,050 hectares and another at Redhead, south of Newcastle, burned at emergency level on Sunday morning before the threat was lowered to watch and act.\n\n\n\n\n\nNatural disasters have now been declared in six NSW local government areas — including Central Coast, Mid Coast, Upper Hunter, Dubbo, Muswellbrook and Warrumbungle — unlocking federal and state assistance.\n\n\n\nA challenging season ahead\n\nForecasters warn this could be the start of a difficult summer.\n\n\n\n\n\nThe Bureau of Meteorology's (BoM) long-range outlook predicts above-average temperatures across most of Australia and below-average rainfall for large areas — creating drier conditions that elevate fire risk.\n\n\n\n\n\nThat combination means \"significant bushfires\" are possible in January and February, the BoM says.\n\n\n\n\n\nThe Australian and New Zealand Council for Fire and Emergency Services (AFAC) has also flagged a \"heightened risk\" for fires in parts of Western Australia, NSW, and Victoria, driven by long-term rainfall deficits, high fuel loads, and persistent soil moisture deficits.\n\n\n\n\n\nMinns said it remains difficult to predict the season's severity, but urged preparedness.\n\n\n\n\n\n\"We can't set in stone what summer will look like,\" he said on Sunday. \"Because of uncertain weather predictions, it's incredibly important you expect the unexpected.\n\n\n\n\n\n\"Have a bushfire preparedness plan in place and be ready to leave, maybe even at the drop of a hat.\"\n\n\n\nSeventy-six fires were still burning across NSW on Sunday morning. Source: AAP / Dan Himbrechts Prime Minister Anthony Albanese said he expected NSW to face \"quite a difficult\" fire season this summer, as destructive bushfires continue to burn across the state.\n\n\n\n\n\n\"This summer, of course, like all summers that would appear in recent times, is going to be a difficult one,\" Albanese told ABC's Insiders program on Sunday morning. \"But New South Wales in particular has a range of pre-conditions for being quite a difficult one.\n\n\n\n\n\n\"Houses [were] lost yesterday. Fortunately, [there was] no loss of life — that is always the priority.\"\n\n\n\nWhat disaster declarations mean\n\nA disaster declaration triggers access to funding that helps with both immediate relief and long-term recovery.\n\n\n\n\n\nResidents, businesses, primary producers and councils can access:\n\n\n\nPersonal hardship and distress assistance, including emergency accommodation and cash payments.\n\nRecovery loans and concessional loans for small businesses and primary producers.\n\nCounter-disaster operation support.\n\nCommunity recovery funds.\n\nCleanup and recovery grants.\n\nHardship grants will also be available for people who have lost their homes.\n\n\n\nREAD MORE No Australians immune: What 2050 and beyond will look like for your city\n\nMinns said the grants would allow businesses and local councils to access support, with state officials on the ground to help residents.\n\n\n\n\n\n\"They can supply immediate accommodation support, cash in some circumstances … that may be absolutely essential,\" he said on Sunday morning. \"I've spoken to some families that have lost their phone, lost everything, medications, the whole lot.\"\n\n\n\n\n\nMinister for Recovery Janelle Saffin said the government \"moved quickly\" to provide basic assistance.\n\n\n\n\n\n\"To the people who are today in shock and distress, I [send my] sympathy to them, and just give assurance that we will do everything we can to support them,\" she said.\n\n\n\nOngoing problems with disaster payments\n\nBut historically, access to disaster funding has been far from smooth for some.\n\n\n\n\n\nAfter 2019's Black Summer bushfires, the National Bushfire Recovery Agency told the Royal Commission that eligibility for disaster-recovery payments \"unfortunately\" depended on where you live, with support varying even across local government boundaries.\n\n\n\n\n\nEarlier this year, some communities also struggled to access adequate support off the back of Cyclone Alfred.\n\n\n\nREAD MORE Calls for more to be done to address natural disaster costs\n\nTaree local Holly Rankin told SBS News that many residents received a one-off federal payment of $1,000, but said it was nowhere near enough to address widespread loss.\n\n\n\n\n\n\"Thousands of families in Taree, Wingham and surrounds have lost everything,\" she said. \"Anyone who does a weekly budget knows that $1,000 will only last you a week.\"\n\n\n\n\n\n\"These people are standing in the face of an immense financial burden.\"\n\n\n\n\n\nIn the first six months of 2025, natural disasters cost the economy $2.2 billion, according to federal treasury analysis.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/article/afghan-embassy-australia-secrecy/0a6rsztq1",
    "title": "Fears for thousands of Afghans in Australia amid 'secrecy' over potential shutdown",
    "publish_date": "Sun, 7 Dec 2025 00:40:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Members of the Afghan Australian community are concerned about the future of Afghanistan's embassy, after reports the federal government has advised the current ambassador his diplomatic credentials won't be renewed in February.\n\n\n\n\n\nAmbassador Wahidullah Waissi, appointed in 2017, has stayed on at the Embassy of the Islamic Republic of Afghanistan since the Taliban took over the country in 2021.\n\n\n\n\n\nIt's considered an embassy-in-exile but has continued to issue official documents such as passports, visas, and verifying IDs to thousands of Afghan citizens living in Australia.\n\n\n\n\n\nBut its services haven't been operating as normal since the Taliban announced in July 2024 that it would no longer recognise consular documents issued by 14 embassies related to the former republic, including the Canberra facility.\n\n\n\n\n\nThe uncertainty has left the diaspora community feeling vulnerable, but crucial questions about the embassy's fate have been left unanswered.\n\n\n\nThe Embassy of the Islamic Republic of Afghanistan in Deakin, Canberra. Source: AAP / Lukas Coch\n\n'The second fall of Afghanistan'\n\nTravel agency Bamyan Air Travels, which has worked with the Afghan embassy for 19 years, said it hasn't been able to obtain a single document through the embassy since the Taliban's announcement.\n\n\n\n\n\n\"Even if they want to provide documents, what is the point if they're not accepted. They can't provide them,\" Bamyan's CEO, Ali Sarwari, said.\n\n\n\n\"They have no relationship or communication with the inside.\"\n\n\n\n\n\nJonathan Muir, chief of protocol at the Department of Foreign Affairs and Trade and a former ambassador to Qatar, told SBS News it's clear the embassy cannot continue to operate as it has been.\n\n\n\n\n\n\"The ambassador was sent and accredited to represent a sending state. In practice, that accreditation requires a subordinate of the sending state,\" he said.\n\n\n\n\n\n\"That state no longer exists and practical risks are accruing around the provision of the services of the embassy.\"\n\n\n\n\n\nHowever, Independent senator Fatima Payman, who was born in Kabul and fled to Australia as a child , said losing the embassy would be like \"the second fall of Afghanistan\".\n\n\n\n\n\n\"This will be the second fall of Afghanistan. We have already lost our country and this is our second home,\" she said.\n\n\n\nIndependent senator Fatima Payman has expressed concerns on behalf of Afghans in Australia. Source: AAP / Lukas Coch \"Under no circumstances, any Afghan across the country will support this idea of letting this happen.\"\n\n\n\nUnanswered questions\n\nOutside the embassy in Canberra's suburb of Deakin, Waissi had little to say about the future of the building he stood in front of.\n\n\n\n\n\nHe shook his head when asked what the Afghan community could expect in the coming months.\n\n\n\n\n\nWhen asked what services the embassy is currently providing, Waissi said: \"I'm not answering that question.\"\n\n\n\n\n\nThe secrecy is only adding to the confusion for the Afghan community in Australia.\n\n\n\n\n\nCurrently, the only way to access document services is through a Taliban delegate.\n\n\n\nHowever, with the Australian government stressing that it does not recognise the Taliban , people from Afghanistan risk being stranded — unless the federal government forms a diplomatic relationship with the Taliban.\n\n\n\n\n\nHowever, Professor William Maley from the Australian National University said forming such a relationship would be a potential security risk for Afghans who have fled the regime.\n\n\n\n\n\n\"Somebody acting in a consular fashion on behalf of the Taliban might then demand access to the personal records of people who have interacted with the embassy in the past,\" he said.\n\n\n\n\n\nOpposition foreign affairs spokesperson Michaelia Cash said a diplomatic relationship with the Taliban should not be on the table.\n\n\n\n\n\n\"The Taliban are a violent and oppressive regime that basically breach human rights on a daily basis,\" she said.\n\n\n\n\"Australia must absolutely maintain constant vigilance in relation to never recognising the Taliban regime.\"\n\n\n\n\n\nWithout clear answers from either the embassy or the federal government, Payman said the community is anxious about the future.\n\n\n\n\n\n\"There has been a void created by the government's secrecy and the department's lack of responses, and as you can imagine, the community is rightfully anxious.\"\n\n\n\n\n\nThis story was produced in collaboration with SBS Pashto.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/article/anika-wells-defends-taxpayer-funded-trip-costs/kc6e3jizp",
    "title": "Minister defends taxpayer-funded trips as Coalition pushes for independent review",
    "publish_date": "Sun, 7 Dec 2025 00:39:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "A senior federal minister is defending her taxpayer-funded trips as being within government guidelines, as new details emerge about other costs and the Coalition pushes for an independent review.\n\n\n\n\n\nAnika Wells came under fire for the $100,000 cost of flying herself and three staff to New York to promote Australia's social media age ban, with further details emerging about trips she took to Paris, Thredbo and Adelaide.\n\n\n\n\n\nShe accepted the spending would elicit a \"gut reaction\" in the average Australian, but said it was an independent agency booking flights, rather than her browsing \"Webjet\".\n\n\n\n\n\nWells was supposed to travel to New York on Prime Minister Anthony Albanese's Royal Air Force jet in September, but was delayed because of the fallout from a deadly Optus triple-zero outage.\n\n\n\nLISTEN TO What to expect as the under-16s social media ban begins SBS News 07:06 English\n\n\"People can have an opinion about whether it was worth the money,\" Wells told Sky News on Sunday.\n\n\n\n\n\n\"But for me, the policy imperative that the life-changing work that we are trying to do ... it was really important and I stand by it.\"\n\n\n\nAlbanese defends spending as details emerge about other trips\n\nAlbanese defended the spending as within the guidelines and said the New York trip to promote the social media ban, which will come into effect on Wednesday, was \"very significant\".\n\n\n\n\n\n\"This was an important event that led directly to the European Union taking action,\" he told ABC's Insiders on Sunday.\n\n\n\n\n\n\"One of the comments I heard from various UN officials was ... 'this is the first time I've been to a forum that has changed my mind'.\"\n\n\n\nWells, who is also the sports minister, reportedly took three trips to Paris in 12 months at a cost of $116,000, to attend major sporting events including the Rugby World Cup, Paris Olympics and Paris Paralympics.\n\n\n\n\n\nShe was authorised to spend $6,000 on meals for five days, with one dinner reportedly billed for $600.\n\n\n\n\n\n\"I recall sometimes I was eating a muesli bar in the car. These are big days,\" Wells said.\n\n\n\n\n\n\"I appreciate it looks a certain way because it's Paris, but that is where the Games were.\"\n\n\n\nCoalition pushing for review\n\nCoalition senator James Paterson said he was bewildered by the costs, which he said should be reviewed by the Independent Parliamentary Expenses Authority.\n\n\n\n\n\n\"That's an extraordinary expenditure of public money and it has to be publicly justified,\" Paterson told reporters on Sunday.\n\n\n\n\n\nIndustry spokesperson Alex Hawke said the spending did not pass the pub test, adding the expenses were so high they would \"make the royals blush\".\n\n\n\n\n\n\"It simply doesn't stack up and the minister's defences don't seem to stack up either,\" he told Sky News.\n\n\n\n\n\n\"If the minister is eating a muesli bar ... then why is the taxpayer being charged for expensive dinners ... if she's not partaking of them.\"\n\n\n\nWells was also questioned about using travel entitlements to attend a friend's birthday while on a three-day, $3,600 work trip to Adelaide in June.\n\n\n\n\n\n\"I met with my South Australian counterpart in part about the South Australian Sport Institute, where we opened a para unit,\" she said.\n\n\n\n\n\nThe minister also spent $3,000 on flights and allowances for her husband and children to join her at Thredbo in June 2024 while she attended meetings with Paralympics Australia and Adaptive Festival organisers.\n\n\n\n\n\nWells acknowledged her family went skiing, but said she was there to work and the trip was within the family reunion and travel guidelines.\n\n\n\n\n\nIn 2012, current Home Affairs Minister Tony Burke took a work trip to Uluru and claimed $12,000 so his family could join him.\n\n\n\n\n\nWhile within the rules, he repaid $8,656 of that trip when details emerged in 2015, admitting it was \"beyond community expectations\".\n\n\n\n\n\nWells did not indicate she would be paying any of the money back, and said \"I work really hard\" and that she will keep following the rules \"as I have in every single instance\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/palm-scheme-workers-face-modern-slavery-risks/xmy3993hk",
    "title": "Ethel took a job in Australia to support her family. She says she was 'left with nothing'",
    "publish_date": "Sat, 6 Dec 2025 19:31:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ethel used to work long days picking fruit in regional NSW. But after falling off a tractor four months ago, she can barely move.\n\n\n\n\n\nThe 33-year-old first came to Australia from Solomon Islands in 2022 under the federal government's Pacific Australia Labour Mobility (PALM) scheme.\n\n\n\n\n\nThe PALM scheme is a temporary visa program designed to plug Australia's labour shortages by recruiting workers from nine Pacific Island nations and Timor-Leste.\n\n\n\n\n\nEthel — whose name SBS News has changed for privacy reasons — was initially employed under the scheme to work on a farm in northern Queensland but left after just four months.\n\n\n\n\n\nThe take-home pay was more modest than she expected. After deductions, she says there was barely enough left to survive on, let alone support her family in Solomon Islands — the main reason she joined the scheme.\n\n\n\nEthel says $1,100 was deducted from her first pay for reasons that were unclear, leaving her with $500. Then, after paying rent and transport, she had only $200 left over.\n\n\n\n\n\n\"Family at home [were] asking for more money and we would send but we [were] left with nothing and that's why we left the PALM scheme,\" she tells SBS News.\n\n\n\n\n\nShe's among the thousands of workers who have absconded from the scheme , citing poor working conditions, exploitation and, in some instances, abuse. The Department of Home Affairs confirmed in a statement to SBS News that there are more than 7,000 disengaged PALM scheme workers in Australia. Many are living either unlawfully (without a visa) or on a bridging visa awaiting further determination.\n\n\n\n\n\nAs a disengaged worker without a visa, Ethel has no work rights or access to government support, relying instead on the help of the local community, volunteers, and charities.\n\n\n\n\n\nIt's a situation that has left her — and many others — vulnerable to exploitation and injury.\n\n\n\nAustralia's hidden workforce\n\nSince leaving the PALM scheme in 2022, Ethel has been working illegally in regional Australia, receiving cash in hand.\n\n\n\n\n\nIn August this year, while working at a farm in the regional NSW town of Leeton, she fell off a tractor and severely injured her leg.\n\n\n\nEthel has scars on her leg from an injury she sustained while working illegally on a farm in regional NSW. Source: Supplied Ethel spent a week in bed before the president of the volunteer-run Leeton Multicultural Support Group, Paul Maytom, was alerted. He took her to hospital where she spent three weeks and underwent three surgeries.\n\n\n\n\n\nWhen asked what would have happened if Maytom hadn't intervened, Ethel couldn't bring herself to answer, just shaking her head and pursing her lips.\n\n\n\n\n\n\"Paul helped me so much, I thank Paul so much and Red Cross,\" she says.\n\n\n\n\n\nMaytom first arrived in Leeton in 1967 to pick fruit. He served on the local council for 34 years and was mayor for 16 of those. Now retired, the 77-year-old spends his time helping disengaged workers like Ethel, even using his own money to pay for her medication.\n\n\n\n\n\n\"The people that I've worked with over the last 18 months, they're people that either don't have enough money because they've got sick, or they got injured and there's no cover,\" he tells SBS News.\n\n\n\n\n\nHe has dozens of notebooks filled with information about the people he's helped — detailing accounts of underpayment, mistreatment and exploitation. He points to the case of one woman whose employment picking strawberries was terminated because she became pregnant.\n\n\n\nWe have a process that clearly upfront says that you have the same rights as Australian workers but yet that [an unfair dismissal] can happen.\n\nMaytom says he wants Australians to know the hidden plight of these hidden workers.\n\n\n\n\n\n\"I believe if they understand what I know, they would accept and understand that these people are not really causing us any problem but they're caught in a trap and we need to help,\" he says.\n\n\n\nPaul Maytom has been supporting disengaged workers in Leeton in NSW for the past 18 months. Source: SBS News The number of disengaged workers in the PALM scheme ballooned during the COVID-19 pandemic. In response, the Department of Employment and Workplace Relations (DEWR), which, along with the Department of Foreign Affairs and Trade, is jointly responsible for the scheme, set up a disengagement taskforce.\n\n\n\n\n\nA spokesperson for DEWR declined to confirm the total number of disengaged workers but told SBS News in a statement that \"the employer-reported disengagement rate\" among PALM workers has declined \"from 10 per cent in 2020-21 to 3 per cent in 2024-25\".\n\n\n\n\n\n\"Addressing PALM worker disengagement is a priority for the Australian Government. Wherever possible, the Australian Government seeks to support the re-engagement of disengaged PALM workers,\" the spokesperson said, adding that a dedicated response team has been established to implement recommendations from the taskforce,\" they said.\n\n\n\n\n\nThe reasons why PALM workers have left the scheme vary, but many have pointed to problems arising from pay deductions, wage theft, mistreatment, insufficient work and being tied to a single employer.\n\n\n\n\n\nA report by the Immigration Advice and Rights Centre noted employers are allowed to make deductions from the wages of PALM workers, which means they are sometimes left with just $100-$200 per week.\n\n\n\nREAD MORE Labor criticised over worker visa rule backflip that could affect thousands\n\nPALM workers are also not allowed to leave their employer without approval from the DEWR.\n\n\n\n\n\nAs a result, many workers experiencing hardship are faced with three choices: to stick with their employer, leave the scheme and return home, or abscond and seek cash-in-hand work.\n\n\n\n\n\nBut returning home isn't a simple option for many, including Ethel.\n\n\n\n\n\n\"If we go back to Solomon Islands in five months, we have nothing because they give us more deduction,\" she says.\n\n\n\n\n\nFellow Solomon Islands-born PALM worker Constantino Waowao also feels his options are limited. He says mistreatment by his employer in regional NSW caused him to leave the scheme in 2022.\n\n\n\nConstantino Waowao is one of many disengaged workers who cannot return home. Source: SBS News / Apple Photos Clean Up But the 43-year-old says he can't go back to Solomon Islands out of fear.\n\n\n\n\n\n\"I'm gay, I will never go back, if I go back they will kill me, that's why I'm here,\" Waowao tells SBS News.\n\n\n\n\n\nSince January 2023, he has been on a bridging visa, awaiting a decision on his protection status.\n\n\n\n\n\n\"I don't feel happy about this because I need protection now,\" he says.\n\n\n\nIllegal work necessary, but risky\n\nDespite the lack of protections, there is no shortage of work for disengaged workers, especially in agriculture.\n\n\n\n\n\nJustin Davidson is a fifth-generation family farmer who grows oranges in Leeton and regularly employs seasonal workers. He tells SBS News he wants a better model for seasonal work that doesn’t rely on disengaged workers.\n\n\n\n\n\n\"I think everyone can acknowledge it is a problem and we need to address it, it's not sustainable,\"\" he says.\n\n\n\nFarmer Justin Davidson says disengaged PALM workers deserve a second chance. Source: SBS News Davidson says he wants to see better protections and employment opportunities offered to those who have disengaged from the PALM scheme, and that he empathises with those who seek out cash-in-hand jobs.\n\n\n\nThese people need a second chance, they need income.\n\nKen Dachi from not-for-profit multicultural support organisation Welcoming Australia says allowing workers to move more easily between employers signed up to the PALM scheme would lead to fewer disengaged workers.\n\n\n\n\n\n\"The name gives it away, it's the Pacific Australian Mobility Scheme, so the mobility component doesn't exist, it needs to be explicit and activated,\" he says.\n\n\n\n\n\nFar from an issue only affecting the regions or the towns dependent on this shadow workforce, Dachi points out that the fruit picked by disengaged workers ends up in homes across the country.\n\n\n\nWelcoming Australia's Ken Dachi wants to see more flexibility introduced to the scheme. Source: SBS News / Apple Photos Clean Up \"A certain percentage of the food we buy every day is from the hands of a disengaged worker; it's exploited labour that contributed to its coming to the shelf,\" he says.\n\n\n\nModern slavery risks\n\nIssues stemming from the PALM scheme have been well-documented, with corroborated reports of exploitation and work site fatalities prompting the NSW government to establish a parliamentary inquiry into modern slavery in 2024.\n\n\n\n\n\nAccording to a spokesperson for DEWR, there have been 104 deaths among workers participating in the PALM scheme (or its predecessors) dating back to 2012.\n\n\n\n\n\n\"The death of any PALM scheme worker is a tragedy, and the department extends its sympathies to the families, friends, employers and communities,\" the spokesperson said, adding that the majority of fatalities stemmed from \"medical conditions\".\n\n\n\n\n\nThe state's anti-slavery commissioner James Cockayne says disengaged workers are at significant risk of exploitation such as debt bondage, forced labour, deceptive recruitment, sexual harassment and violence and sexual servitude.\n\n\n\n\"At the margins, we see people, particularly when they disengage from the scheme, becoming very, very vulnerable to very serious exploitation, so serious that it rises to the level of modern slavery,\" Cockayne says.\n\n\n\n\n\nHe blames labour hire companies for \"overcharging people for certain services like laundry, transport, access to refrigeration\", which he says pushes people into \"a hamster wheel of debt\".\n\n\n\nSBS News is investigating experiences of modern slavery in Australia. Have you got a story to share?\n\nGet in touch at investigations@sbs.com.au or contact Catalina Florez at catalina.florez@sbs.com.au.\n\nCockayne says there is also no licensing requirement for labour hire companies in NSW, making it attractive for \"dodgy\" companies to move to NSW from states where they are required to get a licence.\n\n\n\n\n\n\"Companies are moving here because the lack of licensing means that it's easier to make more profit, which, of course, is a synonym for exploit more people more easily,\" he says.\n\n\n\nNSW anti-slavery commissioner James Cockayne describes the exploitation faced by some PALM workers as \"serious\". Source: SBS News A NSW government spokesperson told SBS News: \"NSW has been actively engaged with the Commonwealth Government and other jurisdictions with a view to establishing a National Labour Hire Licencing Scheme, as recommended by the 2019 Migrant Workers' Taskforce.\"\n\n\n\n\n\n\"SafeWork takes a proactive approach to addressing safety, including through information provision, engagement with industry, and proactive compliance checks across NSW,\" they said.\n\n\n\n\n\nCalls to a hotline run by Cockayne's office, 1800 Freedom, have increased by 116 per cent since this time last year, says the commissioner, adding that around half the calls received each week are connected to labour hire companies and, in many cases, the PALM scheme.\n\n\n\n\n\nAccording to Welcoming Australia, there are currently more than 30,000 PALM scheme workers in Australia. In the 2024–25 financial year, it's projected that workers participating in the scheme will pay more than $180 million in income tax.\n\n\n\n\n\nThe Australia Institute has found more than 230 Pacific Island workers were seriously injured and 45 died in Australia between 2020 and 2023.\n\n\n\nLISTEN TO 'It broke us, the whole feeling of shame, anger, despair': Modern slavery survivor SBS News 08:25 English\n\nGiven the high percentage of deaths among a relatively small number of participants, Cockayne is alarmed at the lack of political urgency to fix the scheme.\n\n\n\n\n\nHe puts it down to a lack of political pressure.\n\n\n\n\n\n\"Many of the stakeholders don't vote in Australia, the temporary migrant workers don't vote, their governments don't vote,\" he says.\n\n\n\nA history of migrant worker exploitation\n\nMoe Turaga arrived in Australia from Fiji in 1988 to help support his family.\n\n\n\n\n\nHis dad died when he was 13 years old, after which point Turaga says his mum struggled to make ends meet.\n\n\n\n\n\nHis cousin promised him he could study and earn more than $25 a week working in Australia.\n\n\n\n\n\n\"It felt like a good option to come out and help mum out as well and also to develop my young siblings' journey,\" he says.\n\n\n\nUpon arrival, Turaga's passport was confiscated, and he was told he owed a debt for travel and visa costs.\n\n\n\n\n\nHe worked at a regional grape farm in Victoria to earn money to pay off the debt and help his family. His cousin assured him his wages were being sent back to his family.\n\n\n\n\n\nBut after two years, Turaga decided to call his mum from a pay phone.\n\n\n\n\n\n\"That's when the penny dropped, that two years of our hard work, our families have never seen any money, nor did we,\" he says.\n\n\n\nTo this day, that question rings in my ears, when my mum asked me 'are you ever going to send money home?'\n\n\"To think that two years of our hard work — slogging it out in the middle of Victoria, in the winters and the summer — think that our families are not getting the fruits of our labour, we were absolutely devastated,\" Turaga says.\n\n\n\n\n\nHe escaped the farm and found refuge in a local church.\n\n\n\n\n\nTuraga eventually recovered his passport, secured a visa and appropriate work.\n\n\n\n\n\nHe's now a citizen, working as an advocate for others experiencing modern slavery.\n\n\n\nMoe Turaga says Australia has a long history of exploiting migrant workers. Source: SBS News Turaga regularly shares his story to make sure that what happened to him doesn't happen to other migrant workers. But he says he now gets hundreds of calls a week from exploited Pacific workers.\n\n\n\n\n\nHe says it's not easy for workers to just go home when they face hardship in the PALM scheme, largely for cultural and safety reasons.\n\n\n\n\n\n\"They're not going home with a bit of shame because if these guys go home with no money to their families and if they've been debt–bonded — if they've borrowed money to come over — that can be fatal,\" he says.\n\n\n\n\n\nWhile Leeton has a reputation for welcoming newcomers (signs in the town read \"Leeton welcomes refugees, migrants and new settlers\"), Dachi says their support systems aren't designed to manage the scale and complexity associated with widespread worker disengagement.\n\n\n\n\n\n\"Goodwill is not a strategy. Is it sustainable? No, there's donor fatigue, there's volunteer fatigue,\" he says.\n\n\n\n\n\nMaytom agrees more coordinated support is needed. He wants to see safety nets formalised for disengaged workers, such as interim health cover and an amnesty offered to allow the ghost workforce to be re-engaged into the scheme.\n\n\n\nLISTEN TO NSW inquiry finds more than 40,000 people trapped in modern slavery SBS News 00:57 English\n\n\"I have a good network of people around me, from their countries that do their best to support them while they can, but it can't go on forever,\" Maytom says.\n\n\n\n\n\n\"We're sort of getting overloaded at the moment, I'm grateful for whatever support we can get but we can't keep on doing what we're doing, we must find a way forward.\"\n\n\n\n\n\nSBS News also contacted the Department of Foreign Affairs and Trade for this story, but did not receive a response by the deadline.\n\n\n\n\n\nReaders who have concerns about modern slavery can contact 1800 FREEDOM on 1800 3733366 or at antislavery@dcj.nsw.gov.au for confidential support and assistance from the NSW anti-slavery Commissioner.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-fake-indian-wedding-tying-the-knot-between-trend-and-tradition/xiqestc3v",
    "title": "The fake Indian wedding tying the knot between trend and tradition",
    "publish_date": "Sat, 6 Dec 2025 19:31:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "On a Saturday in mid-November, seven-time bridesmaid Merlyn Romit geared up for another wedding, but one without a happy couple.\n\n\n\n\n\nIt was the first event hosted by the 29-year-old Indian Australian's wedding planning company — and, to her knowledge, the first of its kind in Australia.\n\n\n\n\n\n\"I came up with this idea three months ago , when one of my friends actually showed a similar event that's been done overseas,\" Romit told SBS Spice.\n\n\n\n\n\n\"The concept of immersive weddings and actually enjoying them for what they are, without the fuss of it, was actually done in India first, and then Ireland and London. I wanted to be one of the first to bring it to Australia.\"\n\n\n\n\n\nAfter months of planning, Romit saw her efforts come to life as over a hundred guests arrived at the event's waterfront location on Sydney's North Shore. They'd each paid between $90 and $109 to attend.\n\n\n\nMerlyn Romit, the founder of wedding planning company Desi Wed Australia, dazzled in a blush pink lehenga as she greeted guests at the Big Fat 'Fake' Indian Wedding. Source: Supplied / Sidd Rishi They ranged from engaged couples with pending nuptials to community members keen to experience the colour and vibrancy for which South Asian weddings are known.\n\n\n\n\n\nAttendee Abhijit, 33, said: \"I think for a long time they were like very traditional, family orientated. Now people let loose and actually have a good time.\"\n\n\n\n\n\nShoraye Khatter, co-director of event partner Brown Munde Events, said \"we're at an age right now where people are missing out [on attending weddings]\".\n\n\n\n\n\n\"Those people that don't go to weddings, they really want to experience it,\" he told SBS Spice.\n\n\n\n\n\nWhile marriage rates have now returned to roughly pre-pandemic levels, event vendors are keen to make up for lost time — something Romit also considered when planning her event.\n\n\n\n\"After being a bridesmaid seven times, I found out how difficult it was to plan a South Asian wedding in Australia. And so, I just wanted to create a space that really brings the top vendors in our industry together,\" Romit said.\n\n\n\n\n\nAttendee Nadisha, 36, said: \"I'm in the wedding industry, so I wanted to come along and see what all the vendors were up to ... see them showcasing all their beautiful efforts.\"\n\n\n\n\n\nFrom marigold flower garlands adorning the entrance, to a vibrant mehendi (henna) station and an abundant biryani bar, the fake wedding invited guests to participate in both familiar and new customs.\n\n\n\n\n\nMaree Whitlock from venue partner Zest Waterfront Venues said it's a good opportunity for people to learn about South Asian culture and have some fun.\n\n\n\nOne of the offerings exhibited by a vendor was a giant pavlova that newlyweds can help decorate for their wedding guests. Source: Supplied / Sidd Rishi \"I obviously don't come from [a South Asian] background so, for me culturally, it's so exciting to see something that's a little bit different that I kind of haven't been immersed in before,\" Whitlock told SBS Spice.\n\n\n\nMatrimony and money\n\nAside from the elephant archway framing the event's DJ booth, the buzz of the event was sobered by another elephant in the room — the rampant costs associated with South Asian weddings.\n\n\n\n\n\nIn Australia, the average wedding has been estimated to cost over $36,000.\n\n\n\n\n\nHowever, a South Asian wedding can be anything but average, often spanning over five days with various ceremonies depending on the cultural roots of the betrothed couple.\n\n\n\nAttendees also had the chance to briefly become Vogue cover models. Source: Supplied / Sidd Rishi Earlier this year, SBS Spice spoke to Sydney-based wedding planner Poonam Gururajan about how much her clients regularly shelled out.\n\n\n\n\n\n\"The smallest wedding I've ever worked on, I think it was around $45,000 to $50,000. That was just for the one day,\" Gururajan said.\n\n\n\n\n\n\"When you're looking at multi-day celebrations, it's anywhere from $150,000 to $500,000. When you talk about destination weddings, anywhere up to $800,000.\"\n\n\n\n\n\nThe extravagance of South Asian weddings is no secret — perhaps most clearly demonstrated by the lavish , extensive 2024 nuptial festivities of Indian tycoon Mukesh Ambani's son, Anant Ambani, with Radhika Merchant, which included performances by Rihanna and Justin Bieber.\n\n\n\nThe evening's celebrations included a classic game of musical chairs. Source: Supplied / Sidd Rishi Even before the Ambani wedding, the opulence of matrimonial ceremonies in the diaspora has progressively escalated in line with the rising cost of living, social media trends, and the improved accommodation of South Asian weddings by vendors outside the community.\n\n\n\n\n\nHowever, the core of any South Asian wedding is always community, as shown by the warmth among attendees at Sydney's recent fake wedding, even if they'd come together for different reasons.\n\n\n\n\n\nAnother attendee, 28-year-old Rahul, said: \"It's so rare to meet such a diverse group of people within our own community. And so, for me, that's what's important about it.\"\n\n\n\n\n\n\"We're bold, we're different, we're challenging the norm,\" Romit said.\n\n\n\n\n\nThis story was produced in collaboration with SBS Spice.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australia-up-against-world-cup-co-hosts-as-the-2026-draw-is-made/ndln6ludy",
    "title": "Australia up against World Cup co-hosts as the 2026 draw is made",
    "publish_date": "Sat, 6 Dec 2025 02:19:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPTS\n\n\n\n\n\n\"I will say this now in American English so everyone understands me, this is like 104 Super Bowls in one month. This is the magnitude of what we organise, ladies and gentlemen.\"\n\n\n\n\n\nFIFA boss Gianni Infantino... and, however you phrase it, the World Cup is the biggest show on earth.\n\n\n\n\n\nNow, we know a lot more about what that show in the US, Canada, and Mexico will look like next year, after the draw in Washington.\n\n\n\n\n\nUS President Donald Trump was there to draw his own country out of the bowl... and a cavalcade of stars of American sport were there, too.\n\n\n\n\n\nEven the Village People made an appearance.\n\n\n\n\n\nBut it was US basketball great Shaquille O'Neal who delivered Australia its moment of truth.\n\n\n\n\n\n\"I think he's getting the hang of it now... he is....Australia! Big noise there! The Socceroos have reached the knockout stage twice in six previous participations... 2006 and 2022.\"\n\n\n\n\n\nAustralia drawn in to Group D, alongside the United States, Paraguay, and a European team to be determined in a playoff next March and April - one of Turkiye, Kosovo, Romania, and Slovakia.\n\n\n\n\n\nPopovic is careful to point out there is no such thing as an easy group.\n\n\n\n\n\nBut it's being characterised as a fairly friendly draw for the Aussies... although not everyone always wants to be in the same group as a host nation at a World Cup.\n\n\n\n\n\nDon't put Socceroos coach Tony Popovic in that category, though.\n\n\n\n\n\n\"I'm actually excited about having that, because it increases the challenge. The focus will obviously be on the US team, the country will be behind them. And we've always punched well above our weight.\"\n\n\n\n\n\nIt's the first time Australia has been drawn in the same group as a host nation since the very first time they were in ever in a World Cup, in West Germany in 1974.\n\n\n\n\n\nAustralia played the US in a friendly in Denver in October, losing two goals to one.\n\n\n\n\n\nThe exact dates, times, and venues for the entire group stage will be confirmed by FIFA tomorrow.\n\n\n\n\n\nBut we have a fair idea of what the Australian World Cup campaign will look like - and the news is good for the Socceroos, as they'll likely be based on the west coast of North America.\n\n\n\n\n\nPopovic says that's a logistical advantage, amongst other things.\n\n\n\n\n\n\"Obviously, the east coast is a lot further for us- we have to land in the west and get another flight to the east. So, I'm sure the fans are a lot happier, and I anticipate they'd be going through their phones, and trying hard to get tickets.\"\n\n\n\n\n\nThe likely schedule - again, FIFA will confirm everything tomorrow - has Australia starting its campaign against the yet-to-be-determined European side in Vancouver on June the 14th.\n\n\n\n\n\nThey'll then play the United States in Seattle on June the 20th, before playing Paraguay in Santa Clara- about an hour's drive south-east of downtown San Francisco- on June the 26th.\n\n\n\n\n\nParaguay are a familiar opponent for Popovic- he played his last-ever game for the Socceroos against them, back in 2006 in Brisbane.\n\n\n\n\n\nAmongst a logjam of teams, they took the last automatic qualifying spot from South America this time around... and Popovic says he knows just how good they are.\n\n\n\n\n\n\"A lot of respect for South American teams. We saw how close they were to even getting second place in the group. So, a very good team. We anticipate a really tough match.\"\n\n\n\n\n\nAnd what of drawing a team from the European playoffs?\n\n\n\n\n\nTurkiye will start favourites to take that spot, but Popovic says he has no preferred opponent out of the four nations involved.\n\n\n\n\n\nHe also says not knowing the opponent until next year won't matter in the long run.\n\n\n\n\n\n\"It is harder. You can scout four teams. But, once March comes around, I'm sure there will be enough time for them, and us, to know the opposition well.\"\n\n\n\n\n\nIn this expanded 48-team men's World Cup, the top two teams in each of the twelve groups, as well as the eight best third-placed teams, go through to the knockout stage.\n\n\n\n\n\nA World Cup appearance - Australia's sixth in a row, and seventh overall - will provide a much-needed boost for the whole of Australian football.\n\n\n\n\n\nFootball Australia interim Chief Executive, Heather Garriock, says it should serve as a reminder of the importance of the domestic A-League competition, where many of the Australian squad started their careers.\n\n\n\n\n\n\"Yeah, it's a credit to Tony. He's obviously bled 13 players that have debuted for Australia in the last twelve months- that is really unheard of. So, to build the depth within Australian football, it's a credit to Tony, but also a credit to the A-Leagues back home. So, it plays a really crucial role. And to see the youth get an opportunity, week in and week out, under pressure, it's really important for us.\"\n\n\n\n\n\nSo, what will Popovic's Socceroos show the world in North America next year?\n\n\n\n\n\nPopovic acknowledges this bunch lack the sort of big names Australia had back in his playing days- but he says that won't hold Australia back, as they try to repeat their heroics in reaching the knockout stage of the last World Cup, in Qatar in 2022.\n\n\n\n\n\n\"We've got a lot of young, good players coming through. Players that I think will have big careers in years to come. And this is a chance for them to be on the world stage. They'll see an exciting group. A confident group. And one that will give their all for our country.\"\n\n\n\n\n\nThe World Cup opens on June the 12th...with a repeat of the 2010 World Cup's opening game...as Mexico hosts South Africa in Mexico City.\n\n\n\n\n\nThe other two teams in Group A are South Korea and a European playoff winner- either Denmark, Czechia, the Republic or Ireland, or North Macedonia.\n\n\n\n\n\nGroup B features co-hosts Canada, Asian champions Qatar, Switzerland, and another European playoff winner... one of Italy, Wales, Bosnia and Herzegovina, or Northern Ireland.\n\n\n\n\n\nGroup C has in it five-time champions Brazil, 2022 semi-finalists Morocco, Haiti, and Scotland.\n\n\n\n\n\nGroup E features heavyweights Germany, Ecuador, African champions the Ivory Coast, and the smallest country to ever make a World Cup,...Curacao... population, 158,000.\n\n\n\n\n\nGroup F shapes up as one of the toughest.... with the Netherlands, Japan, and Tunisia to be joined by whoever emerges from a playoff containing Ukraine, Poland, Albania, and Sweden.\n\n\n\n\n\nGroup G features Belgium, Egypt, Iran, and New Zealand.\n\n\n\n\n\nGroup H contains European champions Spain, Uruguay, Cape Verde, and Saudi Arabia.\n\n\n\n\n\nGroup I comprises France- who came oh-so-close to winning the world title four years ago- Senegal, Norway, and the winner of an intercontinental playoff comprising Iraq, Bolivia, and Suriname.\n\n\n\n\n\nGroup J is the group of defending world champions Argentina.\n\n\n\n\n\nTheir opposition comprises Austria, Algeria, and Jordan.\n\n\n\n\n\nGroup K features Portugal, Colombia, first-time qualifiers Uzbekistan, and the winner of playoff comprising Jamaica, New Caledonia, and the Democratic Republic of Congo.\n\n\n\n\n\nAnd Group L has provided England some tough opposition, as they look for the first world title since 1966.\n\n\n\n\n\nThey must face 2018 runners-up Croatia, African power Ghana, and Panama.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/victoria/man-killed-and-woman-badly-injured-after-car-ploughs-into-melbourne-medical-centre-20251208-p5nlqx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Really upset’: Workers describe horror after man killed in medical centre crash",
    "publish_date": "Mon, 08 Dec 2025 12:59:49 +1100",
    "category": "finance",
    "authors": [
      "Cassandra Morgan"
    ],
    "text": "Restaurant workers have described their horror at finding a man unresponsive and bloodied after a car crashed into a medical centre in Melbourne’s north, also injuring a woman.\n\nEmergency services were called to the intersection of Keilor Road and Hoffmans Road after reports of a car mowing down a pedestrian on the footpath before crashing into the Essendon Health Medical Centre at about 9.30am.\n\nAn SES tent was erected in Niddrie after a car ploughed into a pedestrian and through a shopfront. Credit: Eddie Jim\n\nA woman, aged in her 50s, who was inside the building, was also struck and airlifted to hospital with serious injuries.\n\nShe has been taken to the Royal Melbourne Hospital with upper and lower body injuries. The pedestrian died at the scene.",
    "source": "TheAge",
    "cluster_id": 12
  },
  {
    "url": "https://www.theage.com.au/national/queensland/museum-faces-heat-over-gas-company-sponsorship-of-education-program-20251207-p5nlkf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Museum faces heat over gas company sponsorship of education program",
    "publish_date": "Mon, 08 Dec 2025 12:57:59 +1100",
    "category": "finance",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "The Queensland Museum has been accused of allowing a sponsorship deal with one of the world’s largest gas corporations to influence educational materials it distributed that teach students about climate change without mentioning fossil fuels.\n\nComms Declare, a climate advocacy group, released a report on Monday criticising the materials available for teachers to use in Queensland classrooms, which come branded with the logo of Shell QGC – the division of the multinational energy company that drills for natural gas in Queensland.\n\nThe resources cover topics including extreme weather, threatened species and ocean acidification, but omit a focus on the role of fossil fuels, including coal and gas, in driving climate change.\n\nQueensland Museum at South Bank in Brisbane. Credit: Queensland Museum\n\nIn one example, a resource explains ocean acidification in relation to excess carbon dioxide, without identifying fossil fuels, such as coal, oil or gas combustion, as the cause.",
    "source": "TheAge",
    "cluster_id": 13
  },
  {
    "url": "https://www.theage.com.au/national/queensland/a-little-bit-different-but-it-s-organic-bush-beef-the-answer-to-a-feral-queensland-problem-20251208-p5nlsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘A little bit different, but it’s organic’: Bush beef the answer to a feral Queensland problem",
    "publish_date": "Mon, 08 Dec 2025 12:45:06 +1100",
    "category": "finance",
    "authors": [
      "Keira Jenkins"
    ],
    "text": "For hundreds of years since white settlement, wild cattle have wreaked havoc on a remote 30,000-hectare property, creating environmental and cultural challenges for its First Nations custodians.\n\n“If they’re not caught, they just breed and breed ... erosion is a big problem and in culturally significant areas they move in there and destroy it,” Normanby Aboriginal Corporation managing director Vince Harrigan said.\n\nWild cattle on Balnggarrawarra Country in Cape York.\n\nBut Balnggarrawarra Traditional Owners and the corporation, which runs Normanby Station in Queensland’s Cape York region, have taken the problem and turned it into something more palatable.\n\n“We grew up eating this stuff,” Harrigan said.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/property/news/couple-drops-2-5m-on-home-with-pool-for-big-dog-who-likes-swimming-20251208-p5nlo7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Couple drops $2.5m on home with pool for ‘big dog who likes swimming’",
    "publish_date": "Mon, 08 Dec 2025 12:45:00 +1100",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A pair of devoted dog parents have dropped $2.5 million on a Camp Hill home so their water-loving pooch can finally live its best splash-and-paddle life.\n\nPerched on a 405-square-metre block at 13 Brisbane Avenue, the four-bedroom home comes with a designer kitchen and a resort-style saltwater pool with a waterfall that proved irresistible to the buyers and their large dog.\n\nHaving first seen the home 15 minutes before the auction, the pair opened bidding at $2.1 million, sparking a flurry of fast rises among three other active bidders until competition stalled at $2.4 million.\n\nOne brief chat between the buyer and seller later, and the hammer came down at $2.5 million – making it Brisbane’s highest recorded auction sale of the weekend.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/unwrap-the-magic-your-guide-to-great-gifting-20251116-p5nfpl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unwrap the magic: Your guide to great gifting",
    "publish_date": "Mon, 08 Dec 2025 12:44:10 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "This article contains links from our affiliate partners. We may receive a commission when you buy through links on our site.\n\nOh, what fun it is to give! ’Tis the season to deliver joy, and Amazon makes it easy to give (and get) the perfect gift. With endless inspiration for every wish list, great prices, and delivery you can trust. Explore gift guides for every budget, vibe, purpose and style. From just-dropped tech to beauty icons, hard-working (and stylish) homewares and toys. So whether you’re planning, dreaming, or last-minute gifting, with Amazon you’re one click away from every gift, for every wish list.\n\nFirst-time app shopper? Get $10 off your first Amazon app purchase when you spend $100 or more. Use code APPYXMAS10 at checkout. T&Cs apply.\n\nPlug in. Power up. Play on.\n\nSmart sounds, sleek screens, trending tech, gaming and photo goodies. Discover gadgets and gifts to level up every merry moment.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/politics/federal/wells-billed-taxpayers-to-fly-husband-to-two-boxing-day-tests-20251206-p5nlf9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wells billed taxpayers to fly husband to two Boxing Day Tests, three Grand finals",
    "publish_date": "Mon, 08 Dec 2025 12:42:05 +1100",
    "category": "sports",
    "authors": [
      "James Massola"
    ],
    "text": "The cost of a seat in a corporate box on Grand Final day starts at $4500 per person, which suggests the potential cost of Wells’ six free grand final tickets over three years could be as much as $27,000. All of these claims are within the rules that govern family reunion flights and travel entitlements, but these latest revelations will prompt further questions about whether Wells’ use of the entitlements meet community expectations. It is not clear if Wells and her husband attended the 2025 grand final as expenses for this period have not yet been reported. Wells’ office has been contacted for comment. Earlier on Monday, this masthead revealed that in 2022 and 2024, Wells flew McCarthy from Brisbane to Melbourne under family reunion entitlements to attend the December 26 Test match, while enjoying the corporate hospitality of the sport’s governing body.\n\nCommunications and Sport Minister Anika Wells. Credit: Alex Ellinghausen The minister, who on Sunday was defending a separate use of taxpayer-funded entitlements to fly her husband and two of their three children to join her at the Thredbo ski resort this year, also flew McCarthy to Sydney for a cricket event hosted by Albanese. Wells and Albanese both defended her use of nearly $3000 in taxpayer-funded money after this masthead revealed her family had flown in to Thredbo while she undertook official business with the Australian Paralympic ski team. Under the family reunion rules, federal MPs are allowed up to three return business class flights per year for family members that are between the MP’s home base and a city other than Canberra. This is how Wells recorded the flights to the cricket, to Thredbo and to the grand finals. Loading\n\nThere is no suggestion Wells has contravened any rules, but the expenses claims raise questions about her use of entitlements and whether they are in line with “community expectations”. Wells told Sky News on Sunday in response to the Thredbo story that her claims were within the rules, but she said she could “absolutely appreciate that people have a gut reaction to these figures”. “I don’t resile from that, and that’s why I agreed that entitlements should be scrutinised. I’m happy for mine to be scrutinised,” she said, “but at the end of the day, I don’t write these rules.” Albanese told the ABC’s Insiders program it was “completely within the rules”. “There are family reunion entitlements available. All of the travel was within guidelines,” he said.\n\nOn Monday, fellow frontbencher Tanya Plibersek defended Wells on Nine’s Today. “There are so many weekends away from home, and if you’re sports minister, a lot of those are very deliberately weekend events that you’re required to attend because that’s when people watch sport. That’s when people play sport. She was in Thredbo to highlight the extra investment we’re making in the Paralympics.” Anika Wells and Anthony Albanese both defended the Thredbo trip. Credit: Alex Ellinghausen More than $4000 for three cricket trips During the 2022-23 Test cricket series against South Africa, Wells charged taxpayers for family reunion flights on December 26, so McCarthy could fly between Brisbane and Melbourne in one day. The two flights cost $1885.29. Wells also received three free corporate tickets from Cricket Australia.\n\nIn the 2023-24 season against Pakistan, Wells received only one free ticket to attend the Boxing Day Test. She did not charge taxpayers for her husband to fly to Melbourne that year. However, taxpayers were hit just a few days later, when Wells spent another $1274.72 for two more family reunion flights between Brisbane and Sydney, on January 1, so McCarthy could join her at Albanese’s reception for the Australian and Pakistani teams at Kirribilli House. During the 2024-25 season, Wells charged taxpayers for reunion flights that cost $983.82 so that McCarthy could fly return from Brisbane to Melbourne to join her at the MCG on December 26. The couple were guests of Cricket Australia. Loading The total cost to taxpayers for all flights was $4183.83 over three years, according to the Independent Parliamentary Expenses Authority website, and on all three occasions, the sports minister and her husband had been together for just one day.\n\nThe MCG charges up to $995 per person for a seat in a corporate box, which means the potential value of the six free tickets from Cricket Australia could be nearly $6000. Sports ministers and their opposition counterparts frequently attend high-profile events as guests of sporting organisations, and their attendance at these events is in keeping with the “dominant purpose” test, which determines whether an MP’s travel is appropriate. Wells said the hospitality she received from Cricket Australia is in line with the rules of parliament’s register of members’ interests. Wells under pressure as social media ban looms Wells has been under pressure since last week following revelations of the full cost of Wells’ ministerial trip to the United Nations General Assembly in September to showcase the social media ban for children.\n\nIt then emerged she had claimed $3600 in travel entitlements for trips to Adelaide, where she attended a friend’s birthday party as well as conducting official business; three trips to France in one year as sports minister at a combined cost $116,000, and the $2845.50 Thredbo family reunion. A government spokesman said: “The travel was in accordance with guidelines and in capacity as minister for sport.” The spokesman did not answer questions about why Wells needed to have three one-day reunions with her husband, whether the minister would repay any of the expenses claimed, or whether the trips met community expectations. The minister’s use of family reunion flights is similar to an Uluru trip that Tony Burke took in 2012, while environment minister, when he charged taxpayers close to $9000 so his wife and children could join him. Burke’s claim was also within the rules, but when details of the trip emerged in 2015, he said the trip was “beyond community expectations” and in 2020 paid the costs back.\n\nOpposition finance spokesman James Paterson said Wells’ travel and entitlement usage “failed the kitchen table test”. “She’s a minister who is not just out of touch with Australians, but she’s out of touch with reality,” Paterson said. In 2017, Opposition Leader Sussan Ley had to resign from her position then as health minister in the Turnbull government when it was revealed she had bought an apartment on the Gold Coast while on official trips. Read more on Wells’ expenses Rob Harris analysis: The optics on Wells’ $94,000 flights to New York are terrible\n\nThe optics on Wells’ $94,000 flights to New York are terrible Thredbo ski trip: Nearly $3000 of taxpayer money to bring husband and two children to resort\n\nNearly $3000 of taxpayer money to bring husband and two children to resort Birthday party: Wells attended friend’s soiree during $3600 taxpayer trip",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-dip-wall-street-hovers-near-record-20251208-p5nlm8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Miners fall as ASX slides lower",
    "publish_date": "Mon, 08 Dec 2025 12:38:14 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket has extended its losses to kick off the week as investors await the Reserve Bank’s interest rate decision on Tuesday.\n\nThe S&P/ASX 200 was down 27.9 points, or 0.3 per cent, just after midday, with nine of 11 sectors in the red. Utilities are proving to be the biggest weight on the bourse.\n\nWall Street advanced on Friday to the cusp of a new record. Credit: AP\n\nMiners have slumped with Rio Tinto shedding 2.1 per cent, BHP 0.7 per cent lower and Fortescue down 0.4 per cent. Gold miners are weaker, with Northern Star down 2.2 per cent and Evolution Mining sliding 1.6 per cent.\n\nThe big banks are mixed. Westpac was up 0.4 per cent and the Commonwealth Bank rose 0.4 per cent but the National Australia Bank (down 0.8 per cent) and ANZ Bank (down 0.7 per cent) lost ground.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/shane-richardson-to-walk-away-as-wests-tigers-chief-executive-20251208-p5nlov.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shane Richardson to walk away as Wests Tigers chief executive",
    "publish_date": "Mon, 08 Dec 2025 12:37:14 +1100",
    "category": "finance",
    "authors": [
      "Dan Walsh",
      "Michael Chammas"
    ],
    "text": "Wests Tigers chief executive Shane Richardson has informed staff that he will walk away from the joint-venture as the club’s front-office turmoil claims another high-profile scalp.\n\nRichardson is poised to quit his role less than 18 months into a four-year deal that began last July, in response to the removal of four independent directors from the Tigers board last week.\n\nShane Richardson. Credit: Getty Images\n\nRichardson called a meeting on Monday to tell staff of his decision. It is unclear at this stage when Richardson will end his tenure but his decision will leave the club without a chairman or CEO, given he follows former NSW premier and administrative ally Barry O’Farrell out the door.\n\nOutgoing Manly boss Tony Mestrov – whose tenure at the Sea Eagles is due to finish on December 19 – has been approached as a replacement but is yet to confirm his next move. Mestrov declined to comment on Monday.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/liverpool-press-officer-reacts-to-stars-bold-claims-20251208-p5nlst.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Liverpool press officer reacts to star's bold claims",
    "publish_date": "Mon, 08 Dec 2025 12:23:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Liverpool press officer reacts to star's bold claims\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/peter-dutton-s-us-trip-scores-a-hockey-goal-20251207-p5nlkm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Red faces at One Nation over Barnaby Joyce stubby holder",
    "publish_date": "Mon, 08 Dec 2025 12:17:57 +1100",
    "category": "finance",
    "authors": [
      "Stephen Brook",
      "Kishor Napier-Raman"
    ],
    "text": "Former deputy prime minister Barnaby Joyce was doing his utmost to stay relevant by keeping Australia waiting.\n\nAfter a protracted exit from the Nationals, the nation’s Greatest Retail Politician had refused to commit to joining One Nation, despite sitting down with Pauline Hanson for steak cooked on a sandwich press in the senator’s parliamentary office. Talk about an offer you can’t refuse!\n\nA stubby holder depicting Scott Morrison and Barnaby Joyce available to purchase on the Pauline Hanson’s One Nation online store. CBD Credit: Pauline Hanson’s One Nation online store\n\nJoyce confirmed he would be making the leap to One Nation during a Tamworth radio appearance on Monday morning alongside Hanson.\n\nNow Joyce has made his great defection, his new party might have a wee merch problem. Punters looking to line the One Nation coffers can purchase on the party’s website a stubby cooler featuring a cartoon of Joyce, depicted as a cranky, sentient beetroot in a suit, alongside a ukulele-strumming Scott Morrison.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/barnaby-joyce-defects-one-nation-004541106.html",
    "title": "Nats rocked by Barnaby’s One Nation move",
    "publish_date": "2025-12-08T01:47:31Z",
    "category": "finance",
    "authors": [],
    "text": "Former Nationals MP Barnaby Joyce has defected to Pauline Hanson’s One Nation.\n\nMr Joyce will continue to represent New England as a One Nation MP in parliament until the next federal election, at which he will lead the party’s New South Wales Senate ticket.\n\n“I am firmly of the view which I have considered over a long period of time that the best choice before me is to stand for One Nation as a Senator for NSW,” the former Nationals MP said in a statement on Monday morning.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I will let the voters be the ultimate arbiter of that decision.”\n\nThe New England MP’s decision to join One Nation was driven by two key points, including policies designed not to “placate sectional interests but rather put Australia first and centre”, and a breakdown in his relationship with the Nationals, he said.\n\nImmigration and energy were both critical areas, he said.\n\n“Currently at our centre we have eviscerated our energy platform on a ludicrous quest to change the weather,” he said.\n\nBarnaby Joyce confirmed the move in a statement on Monday. Picture: NewsWire / Martin Ollman\n\n“Energy is central to our standard of living, strength of an economy and resilience in defence.\n\n“We have tried to remove all risks with mountains of regulations that have reduced rights, not improved them.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe also claimed Labor was increasing population “through immigration” and had “removed the capacity for Australians to buy a home, have a family and increase our population by our own means”.\n\nAs part of the Nationals, he was no longer in an “effective” position to target these priorities, Mr Joyce said.\n\n“It is unfortunate, but my professional relationship within The Nationals between myself and the Leadership had become incongruous with me giving my best,” he said.\n\n“In the last two months no one has said to me that this breakdown in the relationship was not the case.\n\n“I had therefore decided to either resign from parliament or, if choosing to continue, find a more conducive way to achieve the best outcome in pursuing the task that is required to be done.”\n\nPauline Hanson travelled to Tamworth in the heart of New England to join Mr Joyce for the announcement. Picture: Supplied\n\nThis year, One Nation doubled its representation on the crossbench after clinching four seats in the election.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe two extra seats, in NSW and Western Australia, had earlier polled with Labor ahead, before the Australian Electoral Commission called them for the populist party’s candidates Warwick Stacey and Tyron Whitten, respectively.\n\nThe party’s popularity has also surged among voters, with a November Redbridge poll finding One Nation’s primary vote had risen to a poll-record 18 per cent, while the Coalition plummeted to 24 per cent.\n\nThe same polling found One Nation was regarded by voters as the party best suited to tackle immigration, leading by 27 per cent, followed by Labor’s 20 per cent and the Coalition’s 19 per cent.\n\nOne Nation leader Pauline Hanson welcomed Mr Joyce’s decision.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I have always been very straightforward about asking Mr Joyce to join our team, and on making it clear this was always his decision,” Senator Hanson said in a statement on Monday.\n\n“I am pleased he’s chosen One Nation, and I welcome his experience, his advice and his determination to get a fair go for farmers and regional Australia.\n\nPauline Hanson had publicly courted Mr Joyce to join the populist party. Picture: Supplied\n\n“Mr Joyce strengthens One Nation’s position in parliament just as many Australians are strengthening our position in the polls.\n\n“One Nation’s support is growing across the country.\n\n“Voters are looking for leadership on the issues which matter to them, like getting rid of net zero and Labor’s record immigration.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Voters know exactly where I stand on these issues, and in recent weeks I think Mr Joyce has been very clear where he stands too.\n\nSenator Hanson added One Nation’s commitment to abandon net zero, exit the Paris Agreement and focus on lowering power bills had been “an important factor in Mr Joyce’s decision”.\n\n“I look forward to working with Mr Joyce and One Nation’s Senate team as we continue to expose and oppose the Albanese Labor government’s agenda,” she said.\n\nNationals leader David Littleproud criticised Mr Joyce for his “disappointing” decision, saying the New England MP had turned his back on his electorate.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“One Nation is a party of protest, not a party of government,” he said.\n\nDavid Littleproud claimed Mr Joyce’s decision was driven by a desire for the job as party leader. Picture: NewsWire / Martin Ollman\n\n“Our regional representatives need to be able to get things done in government and that can only happen as part of a Coalition.\n\n“Today, Barnaby’s decision breaks the contract he made with the people of New England at the 2025 Federal Election.\n\n“It is disappointing for the people of New England and disappointing for the loyal National Party members who worked day and night volunteering to support him.”\n\nThe Nationals had supported Mr Joyce through his “darkest moments”, Mr Littleproud added.\n\n“Barnaby has chosen to turn his back on The Nationals and on his electorate and instead join a party of protest, which is never able to achieve anything other than headlines.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I have never had a personal issue or problem with Barnaby Joyce. This issue is about Barnaby wanting to be the Leader of a party.”\n\nHe said the Nationals would continue to fight for “real outcomes” for local communities.",
    "source": "Yahoo",
    "cluster_id": 31
  }
]