[
  {
    "url": "https://www.9news.com.au/national/tpg-went-eight-hours-before-notifying-telstra-about-outage-affecting-emergency-calls/a514fbcf-658b-4437-843d-f09c58a24595",
    "title": "TPG went eight hours before notifying Telstra about outage affecting emergency calls",
    "publish_date": "Mon, 30 Jun 2025 01:45:00 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "A﻿n investigation by the Australian telecommunications watchdog has found that TPG went almost eight hours before notifying Telstra about an outage affecting emergency service calls.\n\nThe Australian ﻿Communications and Media Authority (ACMA) found that the TPG network was down between 12.40am and 2am on August 15, which left most 4G customers unable to make voice calls, including emergency calls.\n\nMost triple-zero calls made during the outage went through because they hitched onto other networks.\n\nA﻿n investigation has found that TPG went about eight hours before notifying Telstra about an outage affecting emergency service calls. (Ranczandras/Stuff)\n\n﻿The ACMA said TPG became aware of the issue at 1.22am but did not report it to Telstra until 9.07am — breaching rules that specify telco carriers must contact Telstra \"as soon as practicable\" when they are aware of a disruption to emergency service calls.\n\n\"It's crucial that all telcos have their systems and processes in place to ensure any network outages impacting Triple Zero are identified and addressed as soon as possible,\" ACMA member Samantha Yorke said in a statement.\n\n\"They must also take timely action to alert other key stakeholders in the Triple Zero ecosystem where a problem is being experienced.\"\n\nThe investigation found no customers suffered any harm as a result of the company's failure to comply with the rules.\n\nACMA has issued a formal warning to TPG over the incident.\n\nTPG has advised that the cause of the breach was a result of human error, and all relevant staff have been trained.\n\n\"﻿TPG Telecom takes its regulatory responsibilities seriously and has implemented improved processes and training to prevent this happening again,\" a spokesperson said.\n\nThe ACMA said it is cracking down on ﻿compliance around emergency call services.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/trump-says-theres-a-tiktok-buyer-that-hell-reveal-in-about-two-weeks/fdfc11ff-df5a-4672-b2da-52ddc2186e73",
    "title": "Trump says there's a TikTok buyer that he'll reveal in 'about two weeks'",
    "publish_date": "Sun, 29 Jun 2025 21:58:53 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "President Donald Trump said in an interview there is a \"buyer for TikTok,\" teasing an announcement to come in \"about two weeks.\"\n\n\"We have a buyer for TikTok by the way. I think I'll need probably China approval, and I think President Xi will probably do it,\" the president said on Fox News' \"Sunday Morning Futures with Maria Bartiromo.\"\n\nAsked who the buyer is going to be, Trump said, \"I'll tell you in about two weeks.\"\n\n\"It's a group of very wealthy people,\" the president added.\n\nDonald Trump says a buyer for TikTok may be finalised soon. (iStock)\n\nIt's been about five months since a law requiring TikTok to be banned in the United States unless it was sold off by its China-based parent company, ByteDance, technically went into effect.\n\nBut thanks to President Donald Trump's promises not to enforce the law, neither of those things have happened, aside from an approximately 14-hour blackout in January.\n\nTrump has instead signed three orders delaying enforcement on the ban.\n\nAs a June 19 deadline to enforce the sale-or-ban law approached earlier this month, Trump granted TikTok a 90-day extension. The deadline for its parent company ByteDance to hand over control of TikTok's US operations is now September 17.\n\nThe delay raised questions about the status of a deal that could secure TikTok's long-term future in the US. The Chinese government has offered little public indication that it would be willing to approve a sale beyond suggesting that any deal could not include TikTok's \"algorithm,\" which has been called the app's secret sauce.\n\nREAD MORE: Teenager bitten by shark at popular holiday beach in NSW\n\n\"It's a group of very wealthy people,\" the president teased about the buyer. (AP)\n\nIn April, a deal that would have transferred majority control of TikTok's US operations to American ownership was nearly finalised.\n\nBut it fell apart after Trump announced additional tariffs on China, forcing the president to announce another 75-day delay to keep the app operational in the United States.\n\n\"There are key matters to be resolved. Any agreement will be subject to approval under Chinese law,\" TikTok parent company ByteDance said after Trump's tariff policy stalled progress on the deal in April.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/fair-work-commission-minimum-wage-increase-from-tomorrow-july-1/e306b4a7-4544-4941-88ae-eabf820abcaa",
    "title": "Pay boost for millions of Australians arrives tomorrow",
    "publish_date": "Sun, 29 Jun 2025 22:00:30 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "M﻿illions of Australians will start taking home more cash from tomorrow when the Fair Work Commission's decision to increase the national minimum wage takes effect.\n\nEarly last month, the commission ruled that the national minimum wage, and modern award minimum wages, should increase by 3.5 per cent.\n\nAbout three million people are estimated to stand to benefit from the increase from July 1.\n\nAbout three million people are estimated to stand to benefit from the increase from July 1. (Getty Images/iStockphoto)\n\nThe current national minimum wage is $24.10 per hour, or $915.90 per week. A 3.5 increase will increase that to $24.94 an hour, or just over $30 more a week.\n\n\"The principal consideration which has guided our decision is the fact that, since July 2021, employees who are reliant on modern award minimum wages or the national minimum wage have suffered a reduction in the real value of their wage rates,\" Fair Work Commission president Justice Adam Hatcher said.\n\nHatcher said that this had been due to the major spike in inflation which had begun in 2021.\n\n\"The result has been that living standards for employees dependent on modern award wages have been squeezed and the low paid have experienced greater difficulty in meeting their everyday needs,\" he said.\n\nHowever, with the Reserve Bank of Australia deeming inflation to be \"sustainably\" within the target rate of between 2 and 3 per cent, Hatcher said, it was appropriate to boost minimum wage payments above inflation.\n\nThe Australian Bureau of Statistics reported in March th﻿at inflation was at 2.4 per cent, unchanged from the previous quarter.\n\nThe five qualifications in hot demand for Australia's future jobs View Gallery\n\n﻿Australian Council of Trade Unions secretary Sally McManus praised the decision, despite the ACTU backing a larger 4.5 per cent increase.\n\n\"This decision delivers a 1.1 per cent real wage increase, one of the largest real wage increases the Fair Work Commission has awarded,\" McManus said.\n\n\"This wage increase means those who are paid award wages will start to get ahead again, easing pressure on their weekly budgets and part of the stress that comes from having to cut back on the basics.\"\n\nCreditorWatch chief economist Ivan Colhoun warned that the increase could \"put a floor\" under inflation.\n\n\"I'm not opposed to the increase – I see some real wage catch-up as another important part of rebalancing the economy, though I'm not as convinced by the commission's argument that this inflationary episode is now behind us,\" he said.\n\n\"Living costs and business costs remain very elevated and have been a very large part of the pressures on many businesses in this cycle. The rise makes it more important that businesses pursue productivity improvements.﻿\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/jeff-bezos-lauren-sanchez-alisters-wedding-of-the-century-final-day-of-celebrations/953750b9-92c6-4bbc-8c8c-25740474d036",
    "title": "A-listers step out for final day of Bezos' wedding celebrations as protests rage",
    "publish_date": "Sat, 28 Jun 2025 22:47:02 +0000",
    "category": "finance",
    "authors": [
      "June"
    ],
    "text": "1 of 13 Attribution: AP\n\nLauren Sanchez Bezos and Jeff Bezos packed on the PDA as they departed from the Aman hotel during their wedding celebrations in Venice.\n\nNearly 200 A-listers including the likes of Bill Gates, Oprah Winfrey and the Kardashians are on their way to what is believed to be the final event of the multi-day nuptials in Italy.\n\nTonight the stars are set to attend the Arsenale for the grand finale to the 'Wedding of the Century' which is rumoured to be a pyjama party.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/finance/wealthiest-professions-australia-ato-statistics-2022-23/c36aac20-a382-4b74-86dd-5359668cb621",
    "title": "Revealed: The highest-paying jobs in Australia",
    "publish_date": "Sat, 28 Jun 2025 21:16:25 +0000",
    "category": "finance",
    "authors": [
      "June"
    ],
    "text": "1 of 11 Attribution: Nine\n\nThe Australian Taxation Office has released its annual statistics for 2022-23.\n\nWhile much of the data is focused on how much tax revenue was collected for that financial year (hint: it's a lot), it also reveals how much, on average, someone in each profession earns.\n\nHere are the 10 best-paying ones.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/football-optus-sport-epl-transfer-stan-discounts-details/105476696",
    "title": "Optus Sport customers set for discounts after Premier League rights transfer",
    "publish_date": "Mon, 30 Jun 2025 02:13:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Existing Optus Sport customers are set to receive discounted pricing to watch the English Premier League after the transfer of broadcast rights to Stan.\n\nNine's Stan Sport streaming service will begin airing the football content from August 1, the date when Optus Sport shuts down, ending a nine-year run. The new Premier League season kicks off on August 16.\n\nIt is yet to be determined whether any football content will be broadcast on Nine's free to air channels at this stage.\n\nStan is paying Optus Sport an up-front fee of $20 million and making a contribution toward the first payment for the next Premier League rights cycles.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe agreement also includes the rights to FA Cup games, Japan's J.League and the US National Women's Soccer League.\n\n\"The Premier League is the most-watched football league on the planet, and alongside the FA Cup, this acquisition reinforces Nine's position as the home of sport in Australia,\" Nine CEO Matt Stanton said in a statement.\n\n\"We are proud to deliver these iconic competitions to Australian audiences through Stan Sport.\"\n\nExisting Optus Sport customers will receive detailed information and special offers in coming days to ensure the transition to Stan is as simple as possible.\n\nOptus CEO Stephen Rue said the decision to transfer the Premier League broadcast rights comes as the company shifts its focus to Optus's core operations in telecommunications, its commitment to customers, and unlocking further value for the business in its future.\n\n\"Optus Sport has delivered outstanding sports broadcasting to Australian football lovers for almost a decade,\" Rue said in a statement.\n\n\"One of our key priorities was to find a home for Optus Sport content which would take the game forward and enable all Optus Sport subscribers to continue to receive uninterrupted access to all their favourite football action.\n\n\"Optus Sport customers and the game of football will be in great hands at Stan, and we know the game will receive the broadcasting priority it deserves from an organisation whose speciality is delivering quality sports programming to its customers.\"\n\nExisting Optus Sport customers will still be able access the broadcast of the UEFA Women's Euro 2025 tournament, which commences on July 3.\n\nABC/AAP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/nrlw-canterbury-bulldogs-tayla-preston/105476330",
    "title": "Preston's NRLW Bulldogs dream decades in the making",
    "publish_date": "Mon, 30 Jun 2025 01:31:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Tayla Preston became Canterbury's inaugural NRLW signing, her mother went out to the garage and rummaged around for a specific family treasure from more than 20 years earlier.\n\nThe last time the club won the NRL premiership in 2004, the Preston family — Canterbury supporters living in Bulldogs heartland — had framed a signed poster of the team.\n\nNRL legends Sonny Bill Williams, Johnathan Thurston, Hazem El Masri and Willie Mason were in the squad that pipped the Sydney Roosters 16-13 in the grand final.\n\nTwo decades on, the Prestons hung the photo frame back up in the family home as a reminder of what Tayla could achieve, blazing a trail with the club's first NRLW team.\n\n\"We kind of said, 'We'll have to put that up around the house to set a goal,'\" said Preston, ahead Friday night's round-one match against Newcastle at Stadium Australia.\n\n\"It's pretty cool to be able to look at that. I'd love to be able to lift the trophy up for the Bulldogs one day.\"\n\nAlong with the Warriors, Canterbury are one of two NRLW additions in 2025, pushing the competition to 12 teams this season.\n\nThe Warriors re-join the NRLW, having last played in the competition in 2020.\n\nLoading Instagram content\n\nFor playmaker Preston — who is a co-captain alongside Angelina Teakaraanga-Katoa — representing the Bulldogs is an opportunity many years in the making.\n\nShe grew up playing touch football and idolising the likes of Josh Reynolds, Trent Hodkinson and Josh Morris as they wore the famous blue-and-white jersey.\n\nPreston played halfback for Cronulla in last year's NRLW grand final, which the Sharks lost 32-28 to the Sydney Roosters, and has previously appeared for Parramatta.\n\nShe insists a grand final appearance should not be off the cards for the youthful Bulldogs roster coached by ex-NRL player Brayden Wiliame.\n\nVeteran prop Holli Wheeler and Kiwi Ferns trio Alexis Tauaneai, Teakaraanga-Katoa and Ashleigh Quinlan will be essential to helping Canterbury realise that goal.\n\n\"There's no reason why we can't be there on grand final day. We believe we've got the squad to do so,\" Preston said.\n\n\"For us it's just about building that legacy and holding those standards really high for the young girls to be able to see there's a proper pathway now and they can play for the club that they idolise too.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/sandwich-generation-women-balance-caring-parents-children-work/105459272",
    "title": "Inside the complicated 'soup' of caring for parents, children and yourself",
    "publish_date": "Mon, 30 Jun 2025 01:16:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Phyllis Foundis is juggling two phones, two languages, and her 95-year-old mother on FaceTime.\n\nAttempting to update details on her mother Barbara's health insurance, she recites addresses, translates between Greek and English, and explains to the insurance call centre worker that she is the primary caregiver for her mother.\n\nAlso a parent to two teenage boys, Ms Foundis is a member of the \"sandwich generation\": people reaching middle age who switch constantly between intergenerational caregiving, paid work, and their own lives.\n\n'Sandwich carers' not getting adequate support Photo shows Black outline of woman with arms pressed up against the corner of two walls, against a pink background. Many Australians are caring for dependant kids and sick parents, and the physical and mental health impact is significant. What can be done about it?\n\nA sandwich generation-focused survey from Violet — an NGO focused on planning for end-of-life care — has heard hundreds of respondents detail their struggles and pressures in supporting parents, children and being able to find time for themselves.\n\nOne woman described it as a \"continual trade-off\" between caring for a parent and living her own life, as many others said caring for their own children was made difficult by the needs of aging parents.\n\nAnother described the extreme mental health aspects of being a full-time carer for a son living with psychosis while also caring for her 98-year-old mother as being \"insurmountable\".\n\nPhyllis Foundis sees her mother most days and helps her with navigating bureaucracy. (ABC News: Esther Linder)\n\n\"What I've learnt is I've got to be patient,\" Ms Foundis said of her own relationship with her mother.\n\n\"I have a long to-do list, I've got other demands on my time, I've got my own goals I want to achieve, but my mother needs me.\"\n\nMs Foundis's older brother lives several hours from Sydney, so she shoulders the primary care and organisation for Barbara's health and daily life, speaking with her almost every day on the phone and sometimes staying with her when she needs assistance.\n\nThe 54-year-old also co-parents with her ex-partner, with one of their two children still living at home.\n\nPhyllis Foundis with her two sons and her mother together. (Supplied: Phyllis Foundis)\n\nMs Foundis likened her myriad of roles and responsibilities to more of a \"soup\" than a sandwich.\n\n\"There are some days where it feels very chunky and messy and unpalatable; and other days when it's actually a really nourishing thing because it's multigenerational,\" she said.\n\n\"Everyone's connecting to you in a different way.\"\n\nMs Foundis is able to work from home part-time among her other responsibilities. (ABC News: Esther Linder)\n\n'Fifty-something sandwiches'\n\nDemographer Bernard Salt told 702 ABC Radio Sydney that parents in their 50s like Ms Foundis were the most squeezed generation.\n\nMr Salt said answers about unpaid caring work at home in the last census painted a picture of who was most likely to be caring for both their families' older and younger generations.\n\n\"People most likely to be caring for someone in an unpaid capacity [are] 57,\" Mr Salt said.\n\n\" Over the next six or seven years as baby boomers push beyond 80 … it's going to accelerate even further. \"\n\n\"Twenty-something kids, 80-something parents, 50-something sandwiches.\"\n\nMr Salt's analysis shows by 2031, 60,000 people each year will turn 85, a fivefold increase from today as the baby boomer generation ages.\n\nHe also said children were leaving home later in life as housing had become less affordable and the workforce demanded a greater level of tertiary qualifications compared to the 1960s, 70s and 80s.\n\n\"People aren't as enabled to go into the workforce and to establish their own household earlier,\" Mr Salt said.\n\nWomen mostly picking up caring responsibilities\n\nThe majority of caregivers for this bracket were female, Violet's survey found.\n\nCommittee of Sydney research published in February showed women in Sydney worked an average of 13 hours more a week across paid and unpaid work compared to men.\n\nThe committee's work found 4 per cent of Sydneysiders were formally caring for both parents and children, with nearly two-thirds of that figure women.\n\nPhyllis Foundis says patience is key at this stage of her life. (ABC News: Esther Linder)\n\nBack on the phone, Ms Foundis is successful in updating her mother's health insurance details, and the call winds up.\n\n\"She relies on me so much that it's important to be present with her rather than just seeing her as someone who's demanding more of me,\" she told 702 ABC Radio Sydney.\n\n\"I'm very proud [of her],\" Barbara said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/litchfield-national-park-expansion-nt-government-buys-silkwood/105475526",
    "title": "Popular waterfalls to join Litchfield National Park in 30,000ha expansion",
    "publish_date": "Mon, 30 Jun 2025 00:56:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Northern Territory's Litchfield National Park is set to grow by 20 per cent, in the largest addition to the popular tourist attraction in more than two decades.\n\nThe NT government has purchased Silkwood, a 30,000-hectare parcel of land that borders Litchfield's south-east boundary, which it says will give Territorians and visitors more places to camp, four-wheel drive, swim and hunt.\n\nRobin Falls, a popular swimming spot, will become part of Litchfield National Park. (Supplied: NT government)\n\nThe $7.5 million property is located 120 kilometres from Darwin near the regional town of Adelaide River, and includes the popular Robin Falls.\n\nThe government says the acquisition — the national park's biggest expansion in 25 years — will also make untouched waterfalls, gorges, hot springs and 4WD tracks available to visitors.\n\nThe NT government says the expansion will offer tourists more camping, swimming, hunting and four-wheel driving opportunities. (Supplied: NT government)\n\nNT Chief Minister Lia Finocchiaro said the multi-million-dollar deal would conserve \"what makes the territory special\".\n\n\"This is exactly what restoring the territory lifestyle looks like — protecting our wide-open spaces while making sure Territorians have more places to enjoy the activities we love,\" she said.\n\nLitchfield's Florence Falls has a plunge pool that allows visitors to swim below waterfalls in the dry season. (ABC News: Gemma Ferguson)\n\nLands, Planning and Environment Minister Josh Burgoyne said the purchase would secure long-term environmental protection for the pristine region.\n\n\"30,000 hectares of escarpments, woodlands and wetlands are being returned to public hands, protecting territory ecosystems and wildlife while opening up a range of incredible new recreational opportunities,\" he said.\n\n\"This isn't just a map change — this is a transformational and visionary investment in our lifestyle, livability, and landscape.\"\n\nThe NT government says the Silkwood parcel of land is equivalent to the size of 15,000 TIO Stadiums. (Supplied: NT government)\n\nParks and Wildlife Minister Marie-Clare Boothby said the government would work to identify opportunities within the new area, including \"a new dedicated hunting reserve\".\n\n\"We're proud to mark this historic purchase,\" she said.\n\n\"Silkwood has been on the market since last year, and there were real concerns that a private sale could limit future access.\"\n\nTourism, economic opportunities\n\nThe announcement follows a dip in NT tourism post-COVID, but recent data from the Australian government's trade and investment commission suggests the territory might be bouncing back.\n\nWhile most jurisdictions recorded a decrease in domestic travellers during the March 2025 quarter, the NT saw a 34 per cent increase — up 45,000 trips compared to the March 2024 quarter.\n\nLitchfield National Park is one of the territory's most popular tourist attractions, and the site is set to be expanded further. (ABC News: Gemma Ferguson)\n\nAccording to the NT government, more than 250,000 people visit Litchfield National Park each year to see much-loved sites including Wangi Falls, Buley Rockhole and Florence Falls.\n\nThe national park's southern expansion is expected to boost those numbers further, which the government said would create \"new opportunities for local tourism, services, and economic growth\" in nearby Adelaide River.\n\nAdelaide River is a small and historic town which was the site of a major military headquarters during World War II. (ABC: Back Roads)\n\nPublican Tim Carter, who owns the Adelaide River Inn Tourist Park, described the expansion as \"great for the Territorians that love to get out there every weekend\".\n\n\"It'll be very welcome to get [the land] back into government's hands and I think it should be huge for the area,\" he said.\n\n\"There's worries of people purchasing [regions like Silkwood] and closing them up, so for this to be open to all the punters, will be great.\"\n\nHe said the announcement came during a \"huge\" tourism season that has kept his business \"flat-out\" during the dry.\n\nMarty Bishop sells homemade rosella jam in Adelaide River. (ABC News: Lillian Watkins)\n\nAdelaide River local Marty Bishop told ABC Radio Darwin she was also \"very pleased\" to hear Litchfield's borders would be expanding.\n\n\"It'll be a good thing, it will stop any nasty developments over there,\" she said.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/srt-accc-takes-bupa-to-court-for-unconscionable-conduct/105476068",
    "title": "'We're deeply sorry': Bupa apologises for misleading consumers, agrees to repay $35m",
    "publish_date": "Mon, 30 Jun 2025 00:54:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of Australia's largest private health insurers has agreed to pay back tens of millions of dollars to thousands of members who had hospital claims incorrectly rejected.\n\nBupa has admitted to engaging in misleading or deceptive conduct and making false or misleading representations by advising members they were not entitled to private health insurance benefits when they were.\n\nThe ACCC said some Bupa customers financed their own medical treatments and were left thousands of dollars out of pocket while others upgraded to more expensive policies to ensure they were covered.\n\nSome consumers also faced potential medical risks, complications, physical pain and distress after not proceeding with medical treatment or undergoing multiple treatments after being told they were not covered.\n\nBupa APAC CEO Nick Stone said the issue should \"never have happened\".\n\nBupa reached an agreement with the ACCC on a proposed penalty of $35 million for incorrectly assessing thousands of mixed coverage and uncategorised item claims and related eligibility checks over a five-year period.\n\nThe company also admitted to engaging in unconscionable conduct relating to its assessment of 388 mixed coverage claims, which included treatment that was covered under a member's private health insurance policy as well as treatment that was not covered under their policy.\n\nIn a statement, Bupa APAC CEO Nick Stone said the issue should \"never have happened\" and the company was \"deeply sorry for failing to get things right for our customers\".\n\n\"Our priority has been to communicate and compensate our affected health insurance customers and providers, along with putting in place measures to help ensure this does not happen again,\" Mr Stone said.\n\nBupa, is Australia's second largest private health insurer and has more than four million members.\n\nIt has already started compensating affected members, medical providers and hospitals and has so far paid $14.3 million in relation to more than 4,100 affected claims.\n\nAustralian Competition and Consumer Commission chair Gina Cass-Gottlieb said Bupa's conduct affected thousands of members. (Four Corners: Rob Hill)\n\nACCC Chair Gina Cass-Gottlieb said the consumer watchdog had accepted Bupa's undertaking to continue compensating affected parties.\n\n\"Bupa's conduct ... caused harm to consumers some of whom delayed, cancelled or went without treatment for which they were, at least partially, covered under their health insurance policies,\" Ms Cass-Gottlieb said.\n\nBupa said the errors occurred as a result of inaccurate or unclear instructions, training or guidance which meant Bupa didn't always make correct assessments of claims and eligibility checks or act quickly enough to fix issues.\n\nBupa has reached an agreement with the ACCC on a proposed penalty of $35 million. (ABC News: Nic MacBean)\n\nAny customers who believe they may have had a historical claim or eligibility check incorrectly assessed can can visit www.bupa.com.au/mixedcoverage, or call Bupa on 134 135.\n\nAustralian private health insurance industry's peak representative body, Private Healthcare Australia has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/world-u20-championship-australia-thrashed-by-south-africa/105476148",
    "title": "Junior Wallabies thrashed 73-17 by South Africa at World U20 Championship",
    "publish_date": "Mon, 30 Jun 2025 00:51:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia has made a disastrous start to rugby union's World U20 Championship in Italy with an embarrassing 73-17 loss to South Africa in its opening match.\n\nAs the Wallabies prepare to host the British and Irish Lions in a three-Test series, Australian rugby's next generation of stars were given a reality check at Stadio San Michele, Calvisano.\n\nABC Sport will have live blog coverage of the British and Irish Lions' tour of Australia this July and August.\n\nCoached by ex-Wallabies scrum-half Chris Whitaker, Australia conceded 11 tries.\n\nFullback Sid Harvey scored a try and conversion for Australia, while winger Cooper Watters crossed for a double.\n\nSouth Africa led 33-5 at half-time.\n\nThe final scoreline came as a shock to many observers, given Australia defeated South Africa 29-24 in the four-team U20 Rugby Championship in Port Elizabeth last month.\n\nNew Zealand and Argentina also contested the tournament in South Africa.\n\nAustralia faces Scotland in its second World U20 Championship pool match, which will be played in Viadana on Friday night AEST.\n\nThe Australians finished sixth at last year's tournament, hosted by South Africa.\n\nThey have twice reached the World U20 Championship final, most recently in 2019.\n\nThe 2019 squad included Wallabies captain Harry Wilson, as well as the likes of Fraser McReight, Angus Bell, Noah Lolesio and Mark Nawaqanitawase.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/brett-whiteley-shepparton-art-exhibition-wendy-whiteley/105474096",
    "title": "Whiteley showcase reveals struggles with addiction and pursuit of beauty",
    "publish_date": "Mon, 30 Jun 2025 00:44:37 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Wendy Whiteley's best memories of her former husband, Archibald Prize winner Brett Whiteley, were the days he was making her laugh or as she was watching him work.\n\nIt was a long marriage with good and bad memories, she said.\n\nTheir life, with its turbulence and tenderness, is captured in a touring exhibition from the Brett Whiteley studio in New South Wales.\n\nThe Shepparton Art Museum is the final leg and only Victorian gallery to host the Inside The Studio exhibition, which includes drawings, ceramics, sketchbooks, photographs, Whiteley's famous painting of Sydney Harbour and his 1976 Archibald Prize-winning self-portrait.\n\nWhiteley is known not only for his celebrated art, but also for his friendships with famous musicians and a rocky personal life marked by drug addiction that led to his death in 1992.\n\nBrett Whiteley in his Surry Hills studio in Sydney, 1990. (Supplied: Andrew Fisher)\n\nMs Whiteley remembers he was happiest when he was working and took up large chunks of the family's living space for his craft.\n\n\"[He had a] pretty speedy, fairly manic personality, so when he wasn't working he was a very different person,\" she said.\n\nAt their shared London studio, Ms Whiteley, who is also an artist, remembers having to draw a chalk line on the floor and say \"don't cross over with the paint\".\n\n\"But he always did.\"\n\nWhiteley's Self Portrait at 36, Comedown. (ABC Shepparton: Charmaine Manuel)\n\nSome of her favourite works in the exhibition are sketches of her in the bathtub, inspired by French artist Pierre Bonnard who drew his own wife Martha in the bath.\n\nShe's had to buy many of them back as they proved to be incredibly popular with collectors.\n\nWhiteley's sketchbooks on display at the Shepparton Art Museum. (ABC Shepparton: Charmaine Manuel)\n\n\"As people have died off in England or Scotland, they've come back to be auctioned here and I've been able to buy some back.\n\n\"It's been really, really meaningful to me, very emotional, and I'm really happy to have them back again.\"\n\n'A servant of art'\n\nAccording to Whiteley's biographer, Ashleigh Wilson, he may have had a \"rock'n'roll lifestyle\", but he was \"above all an extraordinarily serious and dedicated artist\".\n\n\"The most striking aspects of his life and work was how rounded and full of an artist he was,\" Mr Wilson said.\n\nBiographer Ashleigh Wilson with Wendy Whiteley. (Supplied: Ashleigh Wilson)\n\n\"He was an extraordinarily dedicated thinker and practitioner of art.\n\n\"He was a student of art, he was a servant of art.\"\n\n\" But the reason that we keep coming back to him, the reason why his name still endures, is the power of his creativity. \"\n\nWhiteley spent years living in London, New York, Fiji and Italy, but by the mid 1970s he was living on the lower North Shore of Sydney.\n\nFrom his balcony in Lavender Bay, he created his best known works including his depiction of Sydney Harbour and his prize-winning self-portrait.\n\nWhiteley's depiction of Sydney Harbour from the view of his balcony in Lavender Bay. (Supplied: Shepparton Art Museum)\n\nThe face of addiction\n\nWhiteley's piece for the 1976 Archibald Prize used his iconic shade of ultramarine blue — one that he said had an \"ecstasy-like effect on his nervous system\", Mr Wilson said.\n\nHe added that if you spent time in Lavender Bay and looked out from Whiteley's window onto the harbour, \"the blue in front of you is one that has made its way into his paintings and almost become a colour that he's claimed for himself\".\n\nBrett Whiteley's 1976 Archibald Prize-winning self-portrait. (Supplied: Shepparton Art Museum)\n\n\"[The portrait] really combines a sense of calm and stillness, but there's also a certain unsettled feeling in the corner,\" Mr Wilson said.\n\n\"You can see his face in the mirror looking back.\n\n\"[It's] hard to miss the sense of something not quite right in his expression.\n\n\" There's an unease there, an insight into his life at the time — pursuit of beauty but also the turbulence within. \"\n\nWendy Whiteley says the self-portrait shows the face of Brett's addiction. (ABC Shepparton: Callum Marshall)\n\nFor his ex-wife, the portrait shows a \"warning\".\n\n\"It's a kind of warning picture too, the face in that, about the drug addiction,\" she said.\n\nMusic an important ingredient\n\nExhibition curator Nick Yelverton says what makes this exhibition unique is the musical component, with viewers able to download a playlist drawn from Whiteley's record collection.\n\n\"We've tried to replicate the rock'n'roll atmosphere of the studio in Surry Hills,\" Mr Yelverton said.\n\n\"The music informed the creation of these works, so it's actually quite complementary.\"\n\nNick Yelverton says Whiteley's musical influences are a key component of the exhibition. (ABC Shepparton: Charmaine Manuel)\n\nWhiteley rubbed shoulders with artists like Jimi Hendrix, Bob Dylan, Janis Joplin (who once babysat his daughter) and was close friends with members of Dire Straits.\n\nTheir live record Alchemy is named after one of Whiteley's paintings, which forms the cover for the record.\n\n\"Music was really central to his life and I think it's not an exaggeration, and certainly he said, that if it wasn't for art he would have loved to have gone into music,\" Mr Wilson said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/wilderness-society-agforce-clash-over-land-learing/105469832",
    "title": "Drone footage sparks clash over land clearing laws in Queensland",
    "publish_date": "Mon, 30 Jun 2025 00:18:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "A not-for-profit environmental group is calling for more clarity and enforcement after releasing drone footage of land in central Queensland it says may have been illegally cleared under federal law.\n\nThe Wilderness Society said it was alerted to instances of land clearing by users of its app, which it then documented with legally obtained drone footage filmed over 12 months.\n\nQueensland campaigns manger Hannah Schuch said the clearing was primarily for beef production at properties in the Marlborough and Emerald regions.\n\n\"[The] freshly bulldozed native forests and bushland are likely to be home of dozens of threatened species, including the koala, the greater glider and the red goshawk,\" she said.\n\nHannah Schuch says the EPBC laws need to be clearer. (Supplied: The Wilderness Society)\n\nBut the state's peak body for agriculture labelled the claims misleading and said no-one had done anything illegal.\n\n\"We're very conscious of our environmental credentials and of what we are allowed to clear and not allowed to clear,\" AgForce Queensland president Shane McCarthy said.\n\nThe Wilderness Society said the clearing of hundreds of hectares of land was legal at the state level but had been done without the mandatory assessment by the federal government.\n\nThe Wildnerness Society compiled the images over 12 months. (Supplied: The Wilderness Society)\n\nAny act that has a significant impact on matters of national environmental significance, such as clearing the habitat of a threatened species, requires a referral under the federal government's Environment Protection and Biodiversity Conservation Act (EPBC).\n\nThe society's claims follow allegations made by the Australian Conservation Foundation that 90,000 hectares of land across the nation had been illegally cleared for beef production.\n\nThe National Farmers' Federation has rejected that claim.\n\nA spokesperson for the federal Department of Climate Change, Energy, the Environment and Water said an investigation into the Marlborough matter had been closed with no enforcement action taken.\n\nIt said the matters in Emerald remained under investigation.\n\nThe Wilderness Society says the land was cleared primarily for beef production. (Supplied: The Wilderness Society)\n\n'A lot of confusion'\n\nMr McCarthy said much of the clearing on beef properties was conducted to manage regrowth on previously cleared land.\n\nShane McCarthy says the claims are misleading. (ABC Landline)\n\nHe said there was a lack of clarity in the EPBC Act.\n\n\"We know of cases where people have got these notices in the mail to say 'there could be an endangered habitat, but we don't know where it is', and when the producers go down and actually look at the area … there's no chance of that being there,\" Mr McCarthy said.\n\n\"There's a lot of confusion.\"\n\nHe said landowners were conscious of animals on their land and would never knowingly clear a threatened species habitat.\n\n\"Producers are the better stewards of that land … they live there, they manage it on a day-to-day basis,\" Mr McCarthy said.\n\n\"They don't sit in an office down in Sydney or Melbourne somewhere and look at it on a map and then decide what should or shouldn't be done there.\n\n\" These guys live and breathe that piece of country. \"\n\nCalls for overhaul\n\nThe Wilderness Society has called on the government to make sure the laws are understood properly and enforced.\n\n\"It really shouldn't be up to citizen scientists and not-for-profit independent organisations to monitor what's happening on the ground,\" Ms Schuch said.\n\nThe environment department said anyone found in breach of the EPBC Act could be fined, directed to remediate damage or face prison time.\n\nThe Wilderness Society said it was alerted to the clearing by contributors to its app. (Supplied: The Wilderness Society)\n\n\"The department routinely monitors and verifies compliance across our regulatory schemes and works to detect, disrupt and deter noncompliant activity,\" the spokesperson said.\n\nThe federal government has been working on reforming the act for several years.\n\nEnvironment Minister Murray Wyatt has admitted the laws are \"broken\" and held a roundtable meeting this month to discuss reform.\n\nNo change is expected before Christmas, but the minister is adamant there will be reform in the next 18 months.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/muster-dogs-icon-mourns-loss-of-wife-and-champion-dog/105475364",
    "title": "Muster Dogs icon mourns loss of wife and champion dog two days apart",
    "publish_date": "Mon, 30 Jun 2025 00:06:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "It was a bond that captured the hearts of Australians.\n\nFrank Finger and his champion muster dog Annie proved a gentle hand could be one of the most effective training tools when they were crowned champions of season one of the ABC's Muster Dogs series in 2022.\n\nBut within the space of two days, Mr Finger has lost both his beloved wife Catherine and his \"lovely dog\" Annie.\n\nFrank Finger says his wife Catherine lived a \"beautiful life\". (Supplied)\n\nMr and Mrs Finger had been married for 47 years and together have three sons and a daughter and 12 grandchildren.\n\nNot one for the spotlight, Mrs Finger was happy to leave the television fame to her husband but was a quiet, unwavering support for him.\n\nSharing the news, Mr Finger paid tribute to his wife.\n\n\"A life so beautifully lived deserves to be beautifully remembered,\" he said.\n\nHe said he believed somehow Annie knew his wife was gone.\n\nFrank Finger with his dogs Lucifer and Annie. (ABC/Muster Dogs)\n\n\"I think part of [Annie's] death was brought on by my wife Cathy [who] died last week, and she hasn't been the same since,\" Mr Finger said.\n\n\"Since Cathy died, she's just lived in [her crate] with the door open and doesn't come to meet anyone.\n\n\"She wouldn't understand what had happened, but she could feel that we were unsettled and unhappy … and she was fretting.\"\n\nA true community stalwart of Clermont in Central Queensland, Catherine Finger died on June 25.\n\nAnnie died suddenly on June 27 at the age of five from a brain aneurysm.\n\nFrank Finger surrounded by his loved ones commemorating Annie. (Supplied: Frank Finger)\n\nA funeral will be organised for Mrs Finger in coming days, while Annie was laid to rest at a family gathering on Sunday.\n\n\"[Annie is] a classic example of what you can get from a dog if you treat them with kindness,\" Mr Finger said.\n\n\"All I can do now is be thankful for the time I had her and if she had to go, it must have been meant to be.\n\n\"I've come to work out that 'Annies' are born and not bred. You can't set out to breed a dog like her, they just turn up, one in the litter now and again and I was just very fortunate.\"\n\nMr Finger thought getting a dog working on cattle in 12 months would be impossible. (ABC/Muster Dogs)\n\nMr Finger, a third-generation cattle farmer, was given Annie as a puppy for season one of Muster Dogs.\n\nThe five grazier contestants from across Australia were given an Australian kelpie puppy from the same litter to train into a working muster dog in 12 months.\n\nShe was given the name of Annie by Mr Finger, in honour of his late mother who he was close with and who was known for always having a beautiful vegetable garden.\n\nFrank Finger was given Annie as a puppy for season one of Muster Dogs. (ABC/Muster Dogs)\n\n\"I knew if I called her that I would have a bond just the same as I had with my mother,\" Mr Finger said.\n\n\"You can be the best trainer in the world but unless you care for that particular animal and have that bond you won't get what we had.\"\n\nMr Finger said choosing a meaningful name was a bonding secret and it needed to be something that was special to you, creating a special tone in your voice for the dog to pick up.\n\nAnnie was named after Mr Finger's late mother. (ABC/Muster Dogs)\n\nThroughout the show, Annie gained the nickname of \"princess\" and Mr Finger would often refer to her as a \"lovely dog\" in filming.\n\nAfter winning the television show, the pair went on to become celebrities, travelling across the nation to compete in muster dog trials and appear as guest stars in agricultural shows and events.\n\nMr Finger with muster dogs Lucky, Lucifer and Annie last year. (Supplied: Stock Chick Photography)\n\nWhen they weren't out on the road, Annie was in the paddocks at the Clermont property, working on mobs of cattle up to 350 head, or demonstrating in working dog schools hosted on the property.\n\nAnnie and her brother Lucifer, who also starred on the television show, were also popular guests during their regular visits to the aged care facility in Clermont, Montcler Nursing Home.\n\nThe residents loved having the canine visitors, providing uplifting pet therapy and companionship.\n\nMr Finger and Annie visiting Montcler Nursing Home at Clermont in 2022. (ABC Capricornia: Erin Semmler)\n\nMr Finger said his family and the Clermont community had rallied behind him.\n\n\"I'm overwhelmed by the support,\" he said.\n\n\"What will happen now, I will probably wait and get another pup and I'll call it Annie and will go again.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/state-of-origin-maroons-name-shibasaki-papalii-to-face-blues/105475602",
    "title": "Maroons name Broncos 'bolter' for Origin III, Papali'i makes shock return",
    "publish_date": "Sun, 29 Jun 2025 23:06:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Queensland has named a bolter for State of Origin III, with Brisbane Broncos journeyman Gehamat Shibasaki selected to debut in the series decider.\n\nVeteran prop Josh Papali'i has been recalled to make his Origin return on July 9 in Sydney, while Reece Walsh has been included in the extended squad following Kalyn Ponga's foot injury.\n\nBlues name To'o despite knee issue Photo shows Brian To'o shouts on the ground. NSW coach Laurie Daley names Brian To'o in his squad to face Queensland in the decisive third State of Origin match.\n\nShibasaki is set to start in the centres, with Hamiso Tabuai-Fidow shifting from wing to fullback to replace Ponga.\n\nValentine Holmes moves to the wing after appearing in the centres in the Maroons' 26-24 win over NSW in Origin II in Perth.\n\nFinishing last year without an NRL deal, Shibasaki was thrown a lifeline by the Broncos on a development contract.\n\nHe has played in all of the Broncos' 15 matches this year, scoring 12 tries in a blockbusting season at centre.\n\nThe 27-year-old has proven his many knockers and doubters wrong at club level and has been backed to do the same in the Origin cauldron next month.\n\n\"Gehamat's story is an inspiration,\" Maroons coach Billy Slater said.\n\n\"Only six months ago he was on a train-and-trial contract at the Broncos and playing Queensland Cup up at Townsville.\n\n\"The rise of his game over the past six months has been exceptional.\"\n\nABC Sport will have live blog coverage of State of Origin III on July 9.\n\nCanberra Raiders stalwart Papali'i \"retired\" from State of Origin before the 2023 season after 23 matches and six series wins.\n\nBut he was convinced by former Maroons teammate Billy Slater to make a return.\n\nRecalling Papali'i was an idea Slater said he had in the back of his mind \"for a couple of years now\".\n\n\"I was a little unsure of the response I would get,\" Slater said.\n\nI spoke to Papa (Papali'i) a few days ago and the response was pretty much where my head was at, which was fantastic.\n\n\"It shows he still has the fire to represent this footy team, he's got that fire to represent the people of Queensland and he's got that fire to go out and do a good job for his state.\"\n\nMaroons squad: Hamiso Tabuai-Fidow, Xavier Coates, Robert Toia, Gehamat Shibasaki, Valentine Holmes, Cameron Munster (c), Tom Dearden, Josh Papali'i, Harry Grant, Tino Fa'asuamaleaui, Reuben Cotter, Kurt Capewell, Trent Loiero, Kurt Mann, Lindsay Collins, Jeremiah Nanai, Pat Carrigan, Reece Walsh, J'maine Hopgood, Josh Kerr\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/molly-picklum-wins-rio-pro-brazil-championship-tour-wsl/105475752",
    "title": "'Scared' Picklum leads the way after Rio Pro victory",
    "publish_date": "Sun, 29 Jun 2025 23:02:31 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian surfer Molly Picklum has shown why she is top of the women's World Surfing League (WSL) standings, claiming her first win on tour this season in Saquarema, Brazil.\n\nAfter beating Canadian Erin Brooks 13.06 to 7.60 earlier on Monday AEST in the second semifinal, Picklum took on local Luana Silva in the Rio Pro decider.\n\nPicklum opened with a 6.83 and followed up with the highest single wave score of the event for the women, an 8.17.\n\nHer final total of 15.00 was also the highest of the event for the women at Praia de Itaúna.\n\nSilva's best two-wave score totalled 9.23, well short of being able to stop Picklum winning for the third time.\n\n\"She's [Silva] been surfing so well. I knew she's such a competitor and she's such a fighter,\" Gosford's Picklum said.\n\n\"I was pretty scared all the way till the end even though I had a couple of good scores.\n\n\"But she's capable of great things and I'm so happy to get that one over her.\"\n\nThe WSL Tour's most-consistent women's surfer in 2025 — reaching the quarterfinals in eight out of nine events — Picklum enjoys top spot on the standings with just two regular-season events remaining on the calendar.\n\n\"I've worked so hard this year to really put my best foot forward,\" Picklum said.\n\n\"I've dreamt so much of winning here in Rio, too. I'm a real energetic person, I love the Brazilian energy, and to get a win this year means so much for sure.\n\n\"Thank you so much and shout out to everyone back at home. I know you're all probably up watching and I felt all the love.\"\n\nIn the men's draw, Australia's Ethan Ewing was beaten in the semifinals by American Griffin Colapinto, 14.84 to 14.20, after earlier downing defending champion and local hope Italo Ferreira (14.43-13.30).\n\nColapinto was outgunned 16.90 to 14.40 by compatriot Cole Houshmand in the final.\n\nAAP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/when-is-tax-time-financial-year-2024-2025/105346992",
    "title": "The new financial year starts tomorrow. Here's what that means for your taxes",
    "publish_date": "Sun, 29 Jun 2025 22:55:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "A new financial year begins tomorrow, meaning it's time to start thinking about your tax return.\n\nSome people look towards this time with dread, while those who bank on getting a tax refund may be rubbing their hands together with glee.\n\nWhatever the motivation, many of us just want to get it over and done with.\n\nHere's what you need to know before you start.\n\nWhen does a new financial year start?\n\nEach new financial year starts on July 1 — which is tomorrow.\n\nIt'll be the 2025-26 financial year.\n\nWhen can I lodge my tax return?\n\nTechnically, you can lodge your tax return for the 2024-25 financial year from tomorrow.\n\nBut experts reckon it's best not to rush into it.\n\n\"Wait until the end of July,\" Australian Taxation Office (ATO) assistant commissioner Rob Thomson says.\n\nWhy should I wait to lodge my tax return?\n\n\"We'll have pre-filled a lot of the information in for you, [which] makes it easier to get it right the first time,\" Mr Thomson says.\n\nThis might include your earnings for the last financial year from your employment and interest you've earned from your bank account.\n\nWhen is my tax return due?\n\nThat depends on whether you're doing it yourself or if you're going through an accountant.\n\nIf you're lodging your tax return yourself, it's due October 31.\n\nBut if you're going through an accountant, you may get more time.\n\n\"You need to make sure that you are on their books by October 31,\" an ATO spokesperson said.\n\n\"You should contact your tax agent to discuss by when you will need to lodge your return.\"\n\nHow do I find my tax file number?\n\nIf you've already got a tax file number, you can find it in the federal government's myGov app if you've linked your account to the ATO.\n\nTap the \"Services\" icon on the bottom right-hand corner and click the \"Australian Taxation Office\" link.\n\nThe next screen that pops up should have a \"Find my TFN\" icon to press.\n\nYou can find your tax file number using the myGov app. (ABC News: Dannielle Maguire)\n\nBut you can also find it on your tax returns from previous years, your pay slips or an account statement from your super fund.\n\nWhat if I need help but can't afford an accountant?\n\nIf you earned less than $70,000, you may be eligible for a free service called Tax Help.\n\nThe program matches people up with accredited volunteers who help them lodge their tax returns online.\n\nYou can find out more about this free service on the ATO's website.\n\nWhat happens if I make a mistake on my tax return?\n\nYou can fix it after lodging.\n\n\"If you forgot to report any income, capital gains or deductions, don't worry,\" the ATO said on social media.\n\n\"You generally have up to two years to amend your tax return.\"\n\nHow much will I get back?\n\nThat depends on your personal circumstances.\n\nYou only get money from the ATO if you've paid more tax than you should have throughout the year.\n\nThis money is called a tax refund.\n\nBut if you've paid the right amount of tax, you won't get any money back from the ATO.\n\nAnd it's possible that your tax assessment will say you actually need to pay the ATO money and you'll end up with a tax bill.\n\nIf that's the case, there are options available to you if you can't afford to pay your bill off in one go — this ATO website lists the ways you can get help coping with a bill.\n\nWhen will I get my refund back?\n\nThat depends on how you lodge your tax return.\n\nHere's how long the ATO says it generally takes to process tax returns:\n\nLodged online: Two weeks\n\nTwo weeks Lodged by paper: 10 weeks from when the ATO receives the forms\n\n10 weeks from when the ATO receives the forms Lodged by a tax agent: Two weeks\n\nOnce the ATO processes your return, you'll get what's called a notice of assessment.\n\nIf you're entitled to a refund and you have provided the ATO with your bank details, that money will be transferred to your bank account.\n\n\"We usually see payment processing times of around three business days from when we issue the notice of assessment,\" an ATO spokesperson said.\n\n\"This timing is dependent on your bank and how long they take to process that into your account.\"\n\nBut if you've gone via an agent and didn't pay an up-front fee, it might take longer.\n\nThat's because some agents will instruct the ATO to pay the refund into their account, when they'll deduct their fee and then pass on the rest of the money to you.\n\nIf you haven't given the ATO your bank details and are expecting your refund via cheque, you'll probably be affected by the new rules that came into effect in January.\n\nThose rules state that the ATO can hold on to your refund for up to 90 days while they contact you, asking for your bank details.\n\nIf you give them your bank details — or your accountant's — the ATO will transfer your refund into that account.\n\nOtherwise, if you don't give the ATO your bank details within those 90 days, you'll eventually be sent a cheque.\n\nThe federal government is phasing out the use of cheques. (ABC News: Mark Leonardi)\n\nCan I still get my refund via cheque?\n\nYes.\n\nBut it could take much, much longer this year because of the new 90-day rule we talked about above.\n\nThis is part of the federal government's plan to phase out cheques.\n\nThe ATO will stop issuing refunds via cheque in 2028.\n\nIts preferred method of paying out refunds is via what's called an electronic funds transfer (EFT) — which means putting the money directly into your bank account.\n\n\"EFT payments are faster and more secure than cheques,\" the ATO's website says.\n\nBut, in order to do this, the ATO needs your bank details so it can specify which account to put that money into.\n\n\"We'll only use these account details to deposit refunds and ATO-held super,\" the ATO says.\n\n\"We don't use them for direct debits.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/the-care-squeeze-live-blog/105465494",
    "title": "Live: Caring costs the 'sandwich generation' $18k a year, report finds",
    "publish_date": "Sun, 29 Jun 2025 22:32:43 +0000",
    "category": "finance",
    "authors": [
      "Mikki Cusack",
      "Shelley Hadfield",
      "Gianfranco Di Giovanni",
      "Declan Bowring"
    ],
    "text": "Back with the forum in Melbourne here is a bit more from listeners who joined Raf Epstein.\n\nChristine from Box Hill looks after both her parents. She has been trying to get a care package assessment for them for four years and finally has one for her mum, who has dementia, today.\n\nChristine attended 774 ABC Radio Melbourne’s special live aged care forum today to ask how to ensure the aged care assessment is accurate and fit for purpose.\n\n“From our experience, the scenario has been the assessor comes out, they speak with mum and dad, they say they're all fine, but they don't speak to the family,\" Christine said.\n\nChristine from Box Hill (right) with ABC Radio Melbourne presenter Brigitte Duclos (ABC)\n\nBriony Underwood, education team lead for Elder Rights Australia, said it was really important that those being assessed had a support person with them to advocate for them.\n\nShe added that honesty was the best policy because you might need to wait another year to be reassessed if you are incorrectly assessed.\n\n\"A tip that I give people is that when you're talking to an assessor and you're being asked questions, answer them with the utmost honesty, but also think about your worst day,\" Ms Underwood said.\n\n\"So if somebody says, 'Can you hang out the washing?' and you think, 'Oh, sure, I can hang out the washing.' But what about on your worst day when your arthritis in your shoulder is just causing you that much pain that you can't even lift your arm above your shoulder?\"\n\nThe Care Squeeze forum panel of Briony Underwood from Elder Rights Australia, former Commissioner for Senior Victorians Gerard Mansour and Rachel Lanethe, principal of financial advice firm Aged Care Gurus (ABC)\n\nFormer Commissioner for Senior Victorians Gerard Mansour encourages family members to spend a couple of hours preparing for assessments and think of real-life examples.\n\n\"A real life experience was recently someone saying, yeah, mum, but do you remember when you put the steel bowl in the microwave and blew it up?,\" he said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/calls-for-more-universal-service-obligations-on-telstra/105458264",
    "title": "Calls to tighten Telstra's obligations after two-week mobile disruption",
    "publish_date": "Sun, 29 Jun 2025 21:59:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "There are calls for the government to tighten Telstra's obligation to its customers to include \"timely and to standard\" upgrades of its mobile services after towns were left disconnected for a fortnight.\n\nNationals leader David Littleproud said the government needed to make changes to the Universal Service Obligation (USO).\n\nUnder the USO, Telstra has an obligation to provide a \"standard telephone service\" within a reasonable timeframe.\n\n\"The USO was put in place when Telstra was privatised, over landlines and payphones because that's the only technology we had,\" Mr Littleproud said.\n\n\"Subsequent to that, we've seen technology shift … mobiles have now taken over.\n\n\"What we said in the last election is what the Coalition would do … extending that USO to cover the mobile phone infrastructure.\"\n\nDavid Littleproud says regional Australia was left without much of the services that people living in a city would expect. (ABC News: Matt Roberts)\n\nMore than 13,000 residents in Dalby, on Queensland's Western Downs, had mobile calls, internet and other services including EFTPOS and ATMs disrupted for two weeks this month due to Telstra upgrading a tower.\n\nTelstra told the ABC that customers needed to have a backup option available.\n\n\"This is when it's really important to have that second type of connection … such as NBN, satellite, or landline,\" regional general manager Ms Boisen said.\n\n\"We understand people are using the mobile network, that's why we're doing this massive upgrade on the tower in Dalby.\"\n\nMr Littleproud said the response was \"substandard\".\n\n\"We've seen this elsewhere … in St George, and in Goondiwindi, we had outages going well beyond days. That's why the government needs to step in,\" he said.\n\nThe upgrades are needed as demand on the network has grown by 30 per cent year-on-year, according to Telstra. (Four Corners)\n\nA spokesperson from the office of Communications Minister Anika Wells told the ABC the government was looking to include mobile coverage in its legislation.\n\n\"Through Universal Outdoor Mobile Obligation (UOMO), the government is putting mobile coverage right at the core of the Universal Services Obligation,\" they said.\n\n\"While the Coalition left USO reform to languish, Labor has taken real steps to ensure regional communities aren't forgotten when it comes to mobile coverage.\"\n\nWhen the ABC asked for additional information, the government sent a statement released in February by then-communications minister Michelle Rowland.\n\nIt stated the government would consult and introduce legislation this year to cover the mobile network.\n\n\"Implementation of outdoor SMS and voice will be expected by late 2027, with many Australians likely to obtain access before then,\" the release said.\n\n\"Basic mobile data will be considered in the future as technology road maps and capacity considerations develop.\"\n\nLocals left rattled\n\nTelstra switched off Dalby's mobile services on Monday, June 16 in order to upgrade its base tower to 5G.\n\nNBN, satellite, and landline connections were uninterrupted , but locals called it a safety issue, with many businesses and medical staff impacted in the town of about 13,000 people.\n\nMr Littleproud, also the member for Maranoa, said the regional town had been forgotten.\n\n\"If it was happening in Sydney, Melbourne, or Brisbane, Telstra would have fixed this by now. But because it's in Dalby, they don't care,\" he said.\n\nMobile services in Dalby and surrounds were restored after the two-week disruption, but the outage left businesses and residents shaken.\n\n\"It's a bit of a catch here — we have to rely on Telstra as once you leave town most other providers aren't available,\" Anna Story from Dalby's Chamber of Commerce said.\n\n\"They need to change their advice for future outages.\n\n\"[Saying] 'coverage is likely to be impacted' is a very different thing to no coverage for five days.\"\n\nIt was stressful for residents too.\n\n\"My elderly father-in-law has been in hospital for several weeks in the Scenic Rim and my husband — his power of attorney — has been uncontactable in the case that urgent medical and care decisions need to be made,\" Tina Burnett said.\n\n\"My husband works out of town, and he was unable to contact his employer or the other works to coordinate tasks as they had no service on their mobile phones.\"\n\nLocated four hours west of Brisbane, Dalby is an agricultural and industrial hub in the Western Downs. (Supplied: Southern Queensland Country Tourism)\n\nMs Burnett said the outage was poorly communicated.\n\n\"They provided a link to outage details which required me entering my address. When I did that, the website told me that there was no outage in my area,\" she said.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-30/matildas-slovenia-alanna-kennedy-friendly-perth/105475484",
    "title": "Kennedy keen on Matildas midfield role after Slovenia draw",
    "publish_date": "Sun, 29 Jun 2025 21:44:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "Matildas veteran Alanna Kennedy says she would welcome further opportunities to play in the midfield role she filled during Australia's 1-1 draw with Slovenia on Sunday night.\n\nCoach Joe Montemurro started Kennedy alongside Kyra Cooney-Cross in the middle of the park in his second match in charge in Perth, screening centre-backs Clare Hunt and Winonah Heatley.\n\nMontemurro made six changes to the side that secured a 3-0 win over the Slovenians on Thursday.\n\nThough unable to match the earlier result, the Matildas put in an improved performance with the ball.\n\nKennedy was substituted before Mirjam Kastelec's late strike cancelled out Michelle Heyman's 50th-minute opener.\n\nMatildas draw with Slovenia Photo shows Amy Sayer reacts against Slovenia. A 91st-minute goal earns Slovenia a 1-1 draw with the Matildas in Perth, denying Joe Montemurro two wins from as many matches as Australia coach.\n\n\"I love playing in the midfield, I was really excited to have the opportunity to play there,\" Kennedy told Paramount Plus.\n\n\"Hopefully, the first of many and I think it was a good start.\"\n\nKennedy was a midfielder as a junior and has been deployed there at a club level since making a move from Manchester City to NWSL side Angel City in January.\n\n\"I'm happy to play for Australia in any position, even if it means in goal,\" Kennedy said.\n\n\"But I'm not going to complain about playing in the midfield.\n\n\"I love being a defender, but I think for me, like my heart's a bit higher up the pitch and I'm happy to have the opportunity to play there.\"\n\nBeing able to use Kennedy in the midfield would give Montemurro another option heading into next year's Asian Cup, which will be staged in Australia.\n\n\"When you've got a player like Alanna who protects the back two, the fullbacks can come inside and have more freedom,\" Montemurro said.\n\n\"The wingers have more freedom to come inside into midfield and create overloads.\n\n\"When you've got that stability of one player, you can create the overloads.\"\n\nKennedy is one of eight players set to depart the Matildas set-up following the fixtures against Slovenia.\n\nAnother eight are jetting to Western Australia for friendlies against Panama on July 5 and 8.\n\nAAP",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-the-road-rules-changing-on-tuesday-20250627-p5maub.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Deal to buy out casino at risk of collapse; Translink journey planner crashes on Metro’s day one; Buranda train station reopens",
    "publish_date": "Mon, 30 Jun 2025 12:13:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "A group set to take over the floundering Brisbane Queen’s Wharf casino and hotel is now threatening to walk away from the deal.\n\nStar Entertainment has been under significant financial pressure, and an agreement for existing part-owners Chow Tai Fook Enterprises and Far East Consortium to buy out the complex was expected to bring relief.\n\nStar told the stock market today the investors had terminated a preliminary document outlining terms. Credit: Glenn Campbell\n\nStar told the stock market today the investors had terminated a preliminary document outlining terms, meaning the deal will collapse in five days unless a new agreement can be reached.\n\n“This morning, The Star received from the Joint Venture Partners a notice to terminate the HoA,” a statement to the ASX said.\n\n“Despite the receipt of this notice, The Star remains willing to continue negotiations.”\n\nThe Australian Financial Review reports insiders at the casino believe the move is a negotiating tactic, with parts of the original agreement in dispute.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/inside-the-investigation-into-merivale-s-mexican-mission-20250630-p5mbbw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside the investigation into Merivale’s Mexican mission",
    "publish_date": "Mon, 30 Jun 2025 12:05:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "Inside the investigation into Merivale’s Mexican mission\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-pm-very-happy-to-meet-trump-exports-at-risk-of-tumbling-30b-trump-pushes-for-ceasefire-in-gaza-20250630-p5mb7c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news live: PM ‘very happy’ to meet Trump; Exports at risk of tumbling $30b; Wong heads to Washington to meet US foreign minister",
    "publish_date": "Mon, 30 Jun 2025 12:05:19 +1000",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "Health insurance giant Bupa has admitted it misled thousands of customers about their entitlements for more than five years, leading some to forgo medical treatments and leaving others out of pocket by thousands of dollars.\n\nThe health insurer agreed to pay $35 million in penalties in response to legal action from the consumer watchdog over its practices, the Australian Competition and Consumer Commission said in a statement today.\n\nLoading\n\n“Bupa’s conduct is very serious and fell well short of what is expected of one of the largest health insurers in Australia,” ACCC chair Gina Cass-Gottlieb said.\n\nThe ACCC launched proceedings against Bupa in the Federal Court, alleging it breached consumer law by engaging in misleading or deceptive conduct, making false or misleading representations to its customers and engaging in unconscionable conduct in assessing mixed coverage claims.\n\nBupa has conceded to the watchdog that at various times between May 2018 and August 2023, it told customers they weren’t entitled to benefits for so-called mixed coverage claims and uncategorised item claims when, in fact, they were.\n\nThe ACCC said most of the cases involved claims for hospital treatments, in which two or more procedures were performed at the same time. “In cases where part of the treatment was covered by a member’s policy and part of the treatment was not covered, Bupa incorrectly rejected the entire claim,” it found.\n\nRead the full story here.",
    "source": "SMH",
    "cluster_id": 9
  },
  {
    "url": "https://www.smh.com.au/national/how-the-2022-flood-catastrophe-unfolded-20250627-p5max7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How the 2022 flood catastrophe unfolded",
    "publish_date": "Mon, 30 Jun 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [],
    "text": "How the 2022 flood catastrophe unfolded\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/music/glastonbury-2025-lewis-capaldi-s-epic-return-aussie-stars-and-the-death-of-brat-20250630-p5mb8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Glastonbury 2025: Lewis Capaldi’s epic return, Aussie stars and the death of brat",
    "publish_date": "Mon, 30 Jun 2025 11:56:33 +1000",
    "category": "entertainment",
    "authors": [
      "Nick Newling"
    ],
    "text": "The 2025 Glastonbury Festival has come to an end, with hundreds of thousands of guests flocking to Worthy Farm in southern England for arguably the most iconic music festival in the world. The three-day event saw up to 210,000 ticket holders camping out to hear thousands of artists perform on over 100 stages.\n\nWhile music was the main event, there was plenty of controversy, as well as wild weather and surprises, in store to make the festival one for the history books. Here are the biggest moments you might have missed from this year’s Glastonbury:\n\nGlastonbury has a capacity of 210,000 festivalgoers every year. Credit: Scott A Garfitt/Invision/AP\n\nRain and heat lash festivalgoers\n\nThe festival is renowned for its wild and varied weather, and this year was no different. The first day saw pouring rain and rivers of mud, but by the end of the festival organisers were issuing heat advice for temperatures north of 31 degrees (heaven forbid). It’s worth remembering that a mild Australian summer day can feel like an unbearable heatwave in Britain.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-s-america-exploits-its-revenge-tax-to-back-out-of-historic-deal-20250630-p5mb88.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s America exploits its ‘revenge tax’ to back out of historic deal",
    "publish_date": "Mon, 30 Jun 2025 11:54:34 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "The “revenge tax” is dead but the fate of a global tax deal that took more than 40 years to achieve is now up in the air.\n\nEarlier this month, the G7 countries – the US, Canada, France, Germany, Italy, Japan and the United Kingdom – announced a deal to exempt the US from the global minimum tax arrangements agreed by nearly 140 countries in 2021 after decades of discussions and a decade-and-a-half of detailed negotiations co-ordinated by the OECD.\n\nUS President Donald Trump has been a vocal critic of the global tax deal. Credit: AP\n\nIn exchange, the US will drop Section 899 of US President Donald Trump’s “One Big Beautiful Bill Act”, the so-called “revenge tax”, which would have enabled the US to impose retaliatory taxes of up to 20 per cent on companies and individuals from countries that have imposed “discriminatory” taxes on US companies.\n\nThe negotiated outcome creates what the parties described as a “side-by-side” system that excludes the US from the 15 per cent minimum global tax deal the Biden administration agreed to in 2021 and which was supposed to raise an extra $US150 billion ($230 billion) of annual global tax revenues.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/federal/senior-public-servant-allegedly-promoted-sister-s-fiance-forged-signature-20250630-p5mbb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Senior public servant promoted sister’s fiance, forged signature",
    "publish_date": "Mon, 30 Jun 2025 11:54:23 +1000",
    "category": "finance",
    "authors": [
      "Olivia Ireland"
    ],
    "text": "A senior public servant has been found to have committed corrupt conduct after she promoted her sister’s fiance for a high-ranking position in Home Affairs in the first public investigation completed by the National Anti-Corruption Commission in its two years of operation.\n\nThe NACC investigation found the public servant abused her office by promoting her sister’s fiance as a candidate for a position in Home Affairs, praising him to colleagues, creating the job requisition, approving it herself and forging a witness signature to fast-track onboarding.\n\nAn official from the Department of Home Affairs allegedly engaged in corrupt conduct. Credit: Alex Ellinghausen\n\nThe official did this “while deliberately concealing the family relationship”, and at no point did she disclose the relationship. In a separate incident, the official allegedly provided job interview questions to her sister in advance.\n\nThe NACC recommended the official’s employment be terminated, but she had already resigned. The finding, published on Monday, is the first publicly completed investigation by the NACC since its formation in June 2023.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/cameroon-player-dunks-ball-in-his-own-basket-to-help-australia-to-miracle-win-20250630-p5mbar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cameroon player dunks ball in his own basket to help Australia to miracle win",
    "publish_date": "Mon, 30 Jun 2025 11:51:51 +1000",
    "category": "sports",
    "authors": [
      "Jonathan Drennan"
    ],
    "text": "Australian Emus coach Robbie McKinlay had a list of plays drawn up with just 48 seconds left in the fourth quarter and his team down by six points to Cameroon at the under-19 basketball World Cup.\n\nMcKinlay’s playbook wasn’t needed to win the game, however. Cameroon’s Amadou Seini dunked the ball in his own basket to help send the game into overtime and Australia staged a remarkable comeback win.\n\nSeini’s mistake is extremely rare, but it has happened before in basketball.\n\nIn an exhibition game in 2013, University of Kentucky player Joe Young tried to save the ball from going out of bounds and as he flicked it behind his back, it landed in his own net.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/afl/carlton-crisis-deepens-with-silvagni-in-doubt-for-pies-clash-20250630-p5mb8n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Carlton crisis deepens with Silvagni in doubt for Pies clash",
    "publish_date": "Mon, 30 Jun 2025 11:51:06 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Carlton’s on-field woes have worsened with defender Jack Silvagni in doubt for Friday night’s clash with Collingwood at the MCG.\n\nSilvagni is nursing a groin issue, and did not join in training with the main group on Monday.\n\nHe was restricted to jogging alongside Harry McKay in the rehabilitation group, having been managed through the final term against Port Adelaide on Thursday night.\n\nIn doubt: Jack Silvagni is nursing a groin issue. Credit: Getty\n\nHe was seen in deep conversation with fitness and medical staff.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/property/news/time-portal-four-buyers-fight-for-11m-mid-century-modern-centennial-park-home-20250630-p5mb8x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Time portal: Four buyers fight for $11m mid-century modern Centennial Park home",
    "publish_date": "Mon, 30 Jun 2025 11:46:34 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "Four eastern suburbs locals contested a mid-century modern home in Centennial Park on Saturday, which sold for $11 million.\n\nThe four-bedroom property at 40 Martin Road was architecturally designed in 1967 and had a distinctive feel due to the flow of the layout, skylights and styling throughout.\n\nInitially guided at $10 million, during the four-week campaign interest was shown at $10.5 million and then progressed to $11 million, the updated guide. The reserve was set at the same level, which is also where it sold under the hammer.\n\nAll four registered buyers were local to the eastern suburbs and all actively competed for the chance to secure “Camelot” as their principal place of residence.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/end-your-night-with-mango-sago-at-this-hong-kong-inspired-dessert-spot-in-eastwood-20250630-p5mbak.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "End your night with mango sago at this Hong Kong-inspired dessert spot in Eastwood",
    "publish_date": "Mon, 30 Jun 2025 11:41:16 +1000",
    "category": "finance",
    "authors": [
      "David Matthews"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\n1 / 2 Mango and pomelo sago dessert from Hon Kee. Jennifer Soo 2 / 2 Hon Kee on Rowe Street, Eastwood. Jennifer Soo Previous Slide Next Slide\n\nHong Kongese$$$$\n\nThe last few blocks of Rowe Street’s restaurant strip buzz. Expect Chinese grocers, baked goods and dumplings, plus everything from stonepot fish to crisp-bottomed sheng jian bao, pork soup dumplings, (here’s looking at you, 257 Home Kitchen). Zheng’s Skewer BBQ – from the team behind Jin’s Grilled Meat Pies – is worth a stop, but if sweets are the order, there’s no going past Hon Kee Hong Kong Dessert.\n\nCome nightfall, tables heave with bowls of milk pudding or glutinous rice with coconut. Both are good picks, but the mango pomelo sago is the fan favourite: cool, refreshing, with bursts of citrus, there’s no better dish to close out an evening.\n\nThe menu features more than 50 desserts, many of them “sweet soups” – known as tong su (or “sugar water”) in Hong Kong – a syrupy, pudding-like sweet flavoured with ingredients like almonds, walnut, red bean and black sesame.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/culture/celebrity/all-the-glamour-and-pageantry-from-the-bezos-sanchez-wedding-20250630-p5mba5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "All the glamour and pageantry from the Bezos-Sanchez wedding",
    "publish_date": "Mon, 30 Jun 2025 11:39:15 +1000",
    "category": "finance",
    "authors": [],
    "text": "All the glamour and pageantry from the Bezos-Sanchez wedding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-perth-preps-for-seven-day-soaking-memorial-for-fallen-police-officer-20250629-p5mb5s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Perth preps for seven-day soaking; Memorial for fallen police officer",
    "publish_date": "Mon, 30 Jun 2025 11:30:06 +1000",
    "category": "finance",
    "authors": [],
    "text": "The couple of sunny winter days we had are well and truly in the rearview mirror for Perth this week with seven days of showers predicted.\n\nThe Bureau of Meteorology is forecasting a 90 per cent chance of 1-6 millimetres of showers today, most likely this afternoon and evening, and while the forecast eases tomorrow somewhat to only a shower or two, by Wednesday things are ramping up.\n\nHump day will see a 90 per cent chance of 2 to 15 millimetres and the chance of a thunderstorm, and again a high 80 per cent chance of significant showers continuing into Thursday morning. There are medium to high chances of showers also predicted through Friday, Saturday and Sunday.\n\nThe silver lining to all that cloud cover is that it will keep us relatively warm, with tops of 19 to 23 degrees throughout the week. And the UV index is at two, so you can give the sunscreen a miss.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-30-june-2025/f9yufx12l",
    "title": "PM pushes back on US calls to boost defence spending | Midday News Bulletin 30 June 2025",
    "publish_date": "Mon, 30 Jun 2025 02:00:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nAlbanese rules out increase to defence spending as Penny Wong heads to the US;\n\nWildfires break out in France and Turkiye as Europe swelters through a heatwave;\n\nAnd in Golf, Aldrich Potgieter outlasts Max Greyserman for his first PGA Tour title.\n\n\n\n—\n\nAnthony Albanese says Australia will not increase defence spending next April as part of the national defence strategy, after calls from the US to bolster the defence budget.\n\n\n\n\n\nThis comes as Foreign Minister Penny Wong heads to the United States for high level discussions with counterpart Marco Rubio ahead of a meeting of Quad leaders.\n\n\n\n\n\nThe US has been calling for Australia to lift its defence spending to 3.5 per cent of GDP.\n\n\n\n\n\nThe Trump administration also announced this month that it would take a 30-day review of the AUKUS agreement, which will see Australia purchase US nuclear submarines.\n\n\n\n\n\nMr Albanese says the government is engaging with the US on the matter.\n\n\n\n\n\n\"Every opportunity, Australia, raises our points that we have and AUKUS benefits three countries; Australia, the UK and the US. But it does something more than that, as well, it benefits the world, because it makes our region and the world, more secure.\"\n\n\n\n\n\nPenny Wong is also expected to discuss tariffs during her visit to the US.\n\n\n\n\n\n—\n\n\n\n\n\nFrom July 1 Australians will have greater access to paid parental leave, the minimum wage will go up and millions will see an increase in their Centrelink payments.\n\n\n\n\n\nAustralia’s lowest-paid workers will receive a pay boost, with the national minimum wage increasing by 3.5 per cent.\n\n\n\n\n\nMillions will also see a boost to Centrelink payments, with a 2.4 per cent increase to help ease the rising cost of living.\n\n\n\n\n\nAustralian families will benefit from a more generous paid parental leave scheme, with the amount of government-funded leave increasing from 20 to 22 weeks.\n\n\n\n\n\nSpeaking on Nine's Today Show, Finance Minister Katy Gallagher says the expected changes will ease pressure on Australians.\n\n\n\n\n\n\"We're not pretending that people aren't still continuing to do it pretty tough, which is why there's a whole range of support that comes in on the first of July. So it is about increasing the minimum wage and increase in super but there's also increases in payments that come from the government. There's increase in PPL, and we're paying super on PPL. There's a whole range of areas where we're providing additional assistance, there's the energy bill rebates come in.\"\n\n\n\n\n\n—\n\n\n\n\n\nGreens candidate Hannah Thomas could potentially be left without vision after suffering serious facial injuries during a police arrest at a pro-Palestinian protest.\n\n\n\n\n\nThe 35-year-old has been charged with resisting arrest and was among five arrested while protesting against the actions of Israel in Gaza.\n\n\n\n\n\nThe protest took place outside of an Australia firm allegedly linked to the manufacturing of fighter jet components used by the Israeli military.\n\n\n\n\n\nMs Thomas has slammed what she calls draconian anti-protest laws that allow police to violently crackdown on peaceful protest.\n\n\n\n\n\nNew South Wales Premier Chris Minns says he's concerned about Ms Thomas' wellbeing but denies that it was recent anti-protest laws to blame.\n\n\n\n\n\n\"I'm not prejudging the circumstances, relating to the injury, but I'm certainly not going to condemn police on the absence of information. All of the body worn camera footages, have been kept. We've got strong enforcement and oversight as well as investigation powers when it comes to police in the state and if anyone wants to make a statement. I know police will collect it straight away.\"\n\n\n\n\n\n—\n\n\n\n\n\nAuthorities across multiple European countries are urging people to take shelter as wildfires and a punishing heatwave hit the region.\n\n\n\n\n\nFires broke out in France and Turkiye over the weekend, with this summer's first major heatwave in Europe leaving others on high alert.\n\n\n\n\n\nAmbulances are standing by tourist hotspots as experts warn that such heatwaves, intensified by climate change, will only get worse.\n\n\n\n\n\nAttending the UN Development Summit in Spain, Nabeeha Kazi says it's very clear that climate action is needed.\n\n\n\n\n\n“The heat is incredible, no doubt about it. We are navigating it. We´ve been in a lot of indoor places. You know it is unfortunate that climate change is what it is. I don´t think they anticipated it will be this hot this year but we are here for an important mission which is about how we ensure that we are supporting countries that are also affected by climate change.”\n\n\n\n\n\n—\n\n\n\n\n\nTo sport now,\n\n\n\n\n\nAldrich Potgieter has ended the protracted Rocket Classic, making an 18-foot birdie putt on the fifth playoff hole to outlast Max Greyserman for his first PGA Tour title.\n\n\n\n\n\nHe celebrated on Sunday by embracing his caddie and shaking hands with Greyserman and his caddie before giving his father, Heinrich, a hug.\n\n\n\n\n\nThe 20-year-old Potgieter is the youngest player on the tour and its biggest hitter, averaging 326-plus yards off the tee.\n\n\n\n\n\nHe became the ninth player to win for the first time this season.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/who-will-be-the-next-dalai-lama-succession-plan-uncertain-ahead-of-his-90th-birthday/vu6vmtvct",
    "title": "Who will be the next Dalai Lama? Succession plan uncertain ahead of his 90th birthday",
    "publish_date": "Mon, 30 Jun 2025 01:37:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Who will be the next Dalai Lama? Succession plan uncertain ahead of his 90th birthday\n\nPublished 30 June 2025, 12:58 am\n\nThe Dalai Lama is set to mark his 90th birthday this week with the spiritual leader of Tibetan Buddhism having said he will reveal details about his 'reincarnate', or successor, around the July the 6th date. Tensions continue to surround a succession plan. The Dalai Lama has said his reincarnate would be born 'in the free world'. A notion at odds with China, with Beijing insisting it will choose its own successor.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/first-nations-festival-gives-a-taste-of-an-ancient-culture/ge0jgq9wy",
    "title": "First Nations festival gives a taste of an ancient culture",
    "publish_date": "Sun, 29 Jun 2025 07:47:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nOn a warm night in the town of Jabiru in the Northern Territory - locals and Traditional Owners are uncovering a ground oven, with food for hundreds of people.\n\n\n\n\n\nThe cook-up is part of an annual food event named Taste of Kakadu, connecting visitors with people who live in Jabiru.\n\n\n\n\n\nIt is an event though which First Nations' culture is shared and celebrated.\n\n\n\n\n\nAlthough buffalo is an animal that was introduced during colonisation - first on the Tiwi Islands around 1825 - today, this shared meal is opening conversations among people who have never been introduced to the delicacy.\n\n\n\n\n\n\"It's my first time tasting buffalo and I really like it. This is my first time really connecting with Aboriginal culture, and I really love it\"\n\n\n\n\n\nFor 22-year-old Siah Miargu, it's also a time to grow her skills as a junior ranger and guide.\n\n\n\n\n\nGuests are sharing a meal of barramundi, bush potatoes and a sweet treat, with Siah showing how to eat \"wunt wunt\".\n\n\n\n\n\n\"This is wunt wunt… we just open up, we normally just clean this out, or eat it like this. I tell them the story how our ancestors walked around this area to look for bush tuckers.\"\n\n\n\n\n\nYellow Water and the surrounding floodplain is the heart of Kakadu and is an important food source for those living on Country, including up to a million Magpie geese, a bird that is special to Traditional Owners.\n\n\n\n\n\nPaul Iskov is a chef from Western Australia who is cooking at the Taste of Kakadu.\n\n\n\n\n\nHis role involves not just preparing traditional cuisine, but understanding the origin of each ingredient.\n\n\n\n\n\n\"It's really nice to hear those stories about ingredients that connect country up here. The water lily’s are down where you catch the barramundi and this cheeky yam is pretty much on the side of the bank as well, so all those ingredients tie together.\"\n\n\n\n\n\nPaul is known among chefs as Yoda and has travelled to Kakadu many times to develop culinary dishes - and the Kakadu plum is one that has captured global attention.\n\n\n\n\n\nQueensland researchers in September last year, found the fruit has antioxidant properties.\n\n\n\n\n\nScientific research, now reinforcing traditional knowledge that has been known for thousands of years.\n\n\n\n\n\nAnd it is knowledge like this that has enriched the experience of visitors, experiencing the First Nations event.\n\n\n\n\n\n\"There definitely needs to be more stuff like this, if this was more frequent, you'd definitely get more people looking into it.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/federal-government-still-frustrated-by-nzyq-ruling-evening-news-bulletin-29-june-2025/yx21p6u35",
    "title": "Federal government still frustrated by NZYQ ruling | Evening News Bulletin 29 June 2025",
    "publish_date": "Sun, 29 Jun 2025 06:24:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nHome Affairs Minister Tony Burke says the government remains frustrated by a High Court ruling that the indefinite detention of people seeking asylum in Australia is illegal, regardless of whether they were considered a community safety risk.\n\n\n\n\n\nMr Burke says the N-Z-Y-Q ruling in 2023 has created a high legal threshold for the preventative detention of stateless asylum seekers, disrupting the government's efforts to lock them up.\n\n\n\n\n\nHe tells Sky News his department is trying to find a way around the ruling to ensure former detainees who do not hold a visa are forced to leave the country.\n\n\n\n\n\n\"The reality is the legal thresholds that we are stuck with, because of some decisions of the high court, are more difficult to be able to reach than I want them to be. That's why I introduced laws last year to have a different pathway. A pathway to say 'well if preventative detention is hard, I certainly don't want people who've had their visas cancelled to be in the community at all. Because, if your visas are cancelled, you should be leaving the country. And that's why we've introduced laws for third countries for people to be sent to.\"\n\n\n\n\n\n+++\n\n\n\n\n\nNew South Wales Premier Chris Minns says his government's priority is tackling the state's housing crisis by boosting supply with development-friendly policies.\n\n\n\n\n\nIt comes as a development in North Strathfield, in Sydney's inner-west, has become the first to deliver homes using the Minns government's infill affordable housing bonus.\n\n\n\n\n\nUnder the bonus, the government will offer height and floor space bonuses of up to 30 per cent for residential developments when at least 10 to 15 per cent of the total floor area is devoted to affordable housing.\n\n\n\n\n\nThe North Strathfield project has delivered 29 affordable homes and 143 market homes.\n\n\n\n\n\nMr Minns says the ability for young people to have a future in New South Wales will depend on how the state government tackles housing.\n\n\n\n\n\n\"If we wanna make sure the next generation are not, for the first time in perhaps a century, less well off and less economically able than their previous generation then we've gotta solve this housing crisis. And we are gonna have to accept this challenge head-on and do what Tokyo, Auckland and increasingly Vancouver have done and make major strides to let young people get a roof over their head and claim a bit of the future of the greatest place to live on earth.\"\n\n\n\n\n\n+++\n\n\n\n\n\nShutting down illegal tobacco shops, hefty fines, and jail terms have been floated as measures to curb the booming black market in tobacco in New South Wales.\n\n\n\n\n\nThe illegal tobacco trade has been linked the gang activity and firebombings in New South Wales, and around the country.\n\n\n\n\n\nThe move would give the health ministry and magistrates the power to close down businesses secretly selling the products and penalise landlords if their tenants carry the illegal items.\n\n\n\n\n\nFor serious offenders, state Opposition leader Mark Speakman says he wants prison sentences of up to seven years or $1.5 million fines.\n\n\n\n\n\n\"Illegal tobacco is a scourge in New South Wales. Some of our streets are starting to look like Underbelly and Chris Minns has opened the door. Families are fed up, honest shopkeepers are being priced out and criminals are walking away with bags of money. This is a scourge that has to stop. Chris Minns has been asleep at the wheel. Today, we're telling criminals that if you want to sell illegal tobacco you'll be facing million-dollar fines and facing seven years in jail. If you're a landlord looking the other way, we'll look at you next.\"\n\n\n\n\n\n+++\n\n\n\n\n\nTasmanian Premier Jeremy Rockliff has used his official campaign launch to warn Tasmanians against voting for what he calls single-issue independents in the upcoming state election.\n\n\n\n\n\nMr Rockliff says the fact the last two elections have been caused by the collapse of minority governments shows voting for independents simply causes uncertainty.\n\n\n\n\n\nHe says they are threatening Tasmania's future.\n\n\n\n\n\nOpinion polls show, though that both major parties may struggle top get to the 18 lower house seats needed to govern in their own right, meaning independents may again be very important.\n\n\n\n\n\nThe state election will be held on the 19th of July.\n\n\n\n\n\n+++\n\n\n\n\n\nOwners of machetes or swords have three months to surrender their weapons as another state falls into line with an Australia-wide crackdown on dangerous knives.\n\n\n\n\n\nThe surrender of the blades, to be classified as prohibited weapons, takes effect in South Australia from July.\n\n\n\n\n\nThey can be handed in anonymously until the end of September following the passage of tough new laws after a spate of stabbings in neighbouring Victoria.\n\n\n\n\n\nThe move also comes after Victoria, New South Wales, Queensland and W-A have all introduced tough laws in recent months in a bid to combat the growing number of knife crimes.\n\n\n\n\n\nAlong with the ban on machetes and swords, the South Australian government is raising the purchase age for all dangerous knives from 16 to 18.\n\n\n\n\n\n+++\n\n\n\n\n\nIn football, Chelsea coach Enzo Maresca claims the summer weather means the United States is not the appropriate place to hold the Club World Cup competition- just one year before the country co-hosts the men's World Cup.\n\n\n\n\n\nChelsea has advanced to the Club World Cup quarter-finals after beating Benfica, four goals to one, in Charlotte.\n\n\n\n\n\nThe match that was delayed two hours because of a storm warning- and it's not the first match in this competition that has been delayed under these circumstances... which Maresca says shows the U-S is unsuitable.\n\n\n\n\n\n\"It's already seven, eight, nine games that they've suspended here. I think it's a joke, to be honest. It's not football. I can understand that for security reasons, you have to suspend the game. But, if you suspend seven or eight games, that means that this is probably not the right place to do this competition.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/i-was-shocked-melbourne-mans-unbelievable-find-after-buying-house/m4sksfer8",
    "title": "'I was shocked': Melbourne man's 'unbelievable' find after buying house",
    "publish_date": "Sun, 29 Jun 2025 03:28:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points After finalising the purchase of a home in Melbourne's northern suburbs, a Melbourne man found something unexpected.\n\nThere had been no mention of the expansive model train network beneath the home's floors.\n\nCoincidentally, new owner Daniel Xu is a keen train enthusiast and engineer.\n\nAs any new homeowner will know, there are always unknown things to be found in a new place.\n\n\n\n\n\nFrom a kitchen cupboard that never seems to close properly, a curiously painted over area or the real performance of an air-conditioning unit, discoveries abound.\n\n\n\n\n\nBut after Daniel Xu and his wife finalised the purchase of their house in Melbourne's northern suburbs, he found what can only be described as a train enthusiast's dream beneath their feet.\n\n\n\n\n\nUnderneath his new home, Xu discovered a model train setup, designed around an extensive network of train lines and miniature landscapes.\n\n\n\nXu, a train enthusiast himself, had no idea this was what was under the home he ha just purchased. Source: SBS News With plans for renovations, Xu needed to get beneath his house, much of which is raised, sitting above a carport.\n\n\n\n\n\nEntering the undercroft of his new home via a small door, Xu was shocked to find the area, which is just tall enough to stand in, entirely taken up by the elaborate setup.\n\n\n\n\n\n\"To do the renovation, I would have to go downstairs to have a look and do some inspections and when I got down I saw this massive incredible train model just sitting there,\" he told SBS News.\n\n\n\n\n\n\"I was shocked and I immediately asked my wife to come down to have a look — she was shocked.\"\n\n\n\n\n\n\"It's unbelievable, so massive, so huge.\"\n\n\n\nThe model train set was put together by the former owner of the house Daniel Xu recently purchased and could be about 60 years old. Source: SBS News He said nothing had been mentioned about model trains during the open home inspections.\n\n\n\n\n\nCoincidentally, Xu is a train enthusiast.\n\n\n\n\n\nHe works as a rolling stock engineer for a company that manufactures new trains and designs and constructs new rail lines .\n\n\n\n\n\nHis love of rail started when he was young, through a Japanese cartoon about a crime-fighting train.\n\n\n\nREAD MORE The key changes homebuyers will need to keep an eye on in 2025\n\n\"It tells you how trains act like people to protect children,\" he said, describing the show.\n\n\n\n\n\nXu has since been in touch with the previous owner, who told them their father built the train network in the 1960s when they were a child.\n\n\n\n\n\nThe set had likely not been used for some years, with the area full of spiderwebs when Xu first went beneath the house and found the dusty set.\n\n\n\nIt is not the project he had in mind when buying his house, but Daniel Xu has committed himself to restoring the old model train network he found beneath his home and hopes to upgrade some of the technology. Source: SBS News Xu, who said he already had a number or train toys and model trains, plans on getting the lines cleaned up, in order to test what still works and get the entire network back up and running.\n\n\n\n\n\nWhile the separate control desks for each of the different zones of the train tracks likely represented modern technology when first installed, Xu hopes to upgrade it with some newer technology to share his love of trains.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/venice-protests-over-mass-tourism-and-inequality-overshadow-jeff-bezos-lavish-wedding/yump29zzu",
    "title": "'Eat the rich': Venice protests over mass tourism and inequality overshadow Bezos wedding",
    "publish_date": "Sat, 28 Jun 2025 22:08:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Mass tourism, impossibly high rents, worker exploitation, inequality and elitism: Venice protests in recent days against Jeff Bezos and Lauren Sanchez's high-profile wedding have highlighted growing global grievances.\n\n\n\n\n\nLocal politicians dismissed protesters as a fringe minority. Bezos's fame and Venice's stunning visual backdrop have offered them international visibility which they effectively exploited.\n\n\n\n\n\n\"No Space for Bezos\" banners draped over the iconic Rialto Bridge and a huge canvas laid out on St Mark's Square urging the tech billionaire to pay more taxes have been seen all over the world.\n\n\n\n\n\nConcerns of greater disruptions forced Bezos and his bride to move their final and biggest celebrity party from the central district to a more isolated venue in the eastern part of the lagoon city.\n\n\n\n\n\n\"The idea that the city should be seen as a set, a stage, or an amusement park has been highlighted like never before by Bezos' wedding,\" Tommaso Cacciari, a frontman for the No Space for Bezos movement, said.\n\n\n\nA thousand protesters from social centres and environmental associations participated in the demonstration against the exploitation of the city and marched through the streets. Source: SIPA USA / Roberto Brancolini In the final protest on Saturday (local time), around 1,000 residents and activists rallied in front of Venice's train station under a scorching sun, before marching roughly 1.5 kilometres to the Rialto Bridge.\n\n\n\n\n\n\"Bezos, out of the lagoon\", the demonstrators chanted as they wound through the city centre, some brandishing signs that read: \"Eat the rich\", \"Rejected\", and accusations that Venice's mayor is \"corrupt\".\n\n\n\n\n\nOne banner proclaimed \"Kisses yes, Bezos no\", playing on Venice's reputation as the city of love, and another one said \"No space for Bezos\" with a rocket, in a reference to his Blue Origin space technology company.\n\n\n\n\n\nVenetian businesses and politicians, however, welcomed the event, hailing its major boost for the local economy. Luca Zaia, the regional governor of Veneto around Venice, said the city should be proud of hosting the wedding.\n\n\n\nProtesters demand affordable housing, oppose overtourism\n\nAlice Bazzoli, a 24-year-old university student, called Bezos a \"hypocrite\" for donating 3 million euros ($5.38 million) to Venice while flooding its fragile ecosystem with high-polluting private jets and yachts.\n\n\n\n\n\nBezos and Sanchez have given 1 million euros ($1.79 million) each to three Venetian institutions: CORILA, an academic consortium that studies the lagoon, UNESCO's local office, and Venice International University.\n\n\n\n\n\n\"I'd love Venice to be tailored for citizens, not for tourists, with affordable housing,\" Bazzoli said, complaining that students were being priced out of the market, with the best accommodations offered to visitors.\n\n\n\nThe 'Moa' boat transporting Jeff Bezos and Lauren Sanchez Bezos is escorted on the Grand Canal, on the third day of their wedding festivities. Source: AFP / Marco Bertorello Andrea Segre, a 49-year-old Italian film director born in Venice, said the city was also pushing out ordinary residents.\n\n\n\n\n\n\"People aged 25 to 35 — the age group that starts families — cannot afford to live in Venice. The consequence is a lack of diversity and social liveliness,\" he said.\n\n\n\n\n\nVenice is rapidly depopulating, largely because of the cost of living crisis. Its historic city centre now has fewer than 50,000 residents, compared to more than 100,000 some 50 years ago.\n\n\n\n\n\nThe city has hosted scores of other VIP weddings, including that of actor George Clooney and human rights lawyer Amal Alamuddin in 2014, but the latest luxury nuptials have attracted far greater resentment because of Bezos' corporate and political role.\n\n\n\nJeff Bezos and Lauren Sanchez leave the Aman Hotel on the third day of their wedding festivities. Source: AFP / Marco Bertorello The Amazon founder is the world's fourth richest man, and has developed ties with US President Donald Trump, whose daughter Ivanka and son-in-law Jared Kushner were in attendance at the wedding.\n\n\n\n\n\n\"Bezos is the embodiment of the most absolute wealth gained through the exploitation of everything around you,\" 28-year-old student Giulia Cacopardo said in the run-up to Saturday's march.\n\n\n\n\n\nIn Italy, the e-commerce giant has faced criticism and strikes from trade unions over labour practices, and scrutiny over tax compliance. Reuters news agency reported in February that Italian prosecutors were investigating alleged tax evasion worth 1.2 billion ($2.15 billion) euros.\n\n\n\n\n\n\"I would have protested against Bezos even if he had come on a rowboat with just a handful of people ... because he contributed practically, materially and politically to Donald Trump's re-election,\" protest leader Cacciari said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-professor-andrew-sindone-talks-to-sbs-about-heart-failure/cye8669mn",
    "title": "INTERVIEW: Professor Andrew Sindone talks to SBS about heart failure",
    "publish_date": "Sat, 28 Jun 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-dodging-an-asteroid-attack/j2rz8qd0l",
    "title": "INTERVIEW: Dodging an asteroid attack",
    "publish_date": "Sat, 28 Jun 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/young-chinese-lgbt-australians-navigate-coming-out-to-parents/2b1jcc5qd",
    "title": "Lucy came out to her Chinese mum — and then took her to therapy",
    "publish_date": "Sat, 28 Jun 2025 20:36:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Lucy Xu came out to her mother as a bisexual at age 19, she didn't expect the response to be so painful.\n\n\n\n\n\nKnowing her mother's stance against same-sex marriage, Xu was mentally prepared that her mother might cut her off. But her response was much sadder than Xu had expected, which broke her heart.\n\n\n\n\n\nBorn in Melbourne to two Chinese migrants, Xu was close to her mum growing up. Her dad died when she was 13, leaving her mother to raise her and her elder brother solo.\n\n\n\n\n\nBut as Xu began to embrace her most authentic self in her late teens, the pain of being cut off from her mother added to the grief of having lost her father.\n\n\n\n\n\n\"It was the most painful thing of my life. I can't imagine ever going through that again,\" she says.\n\n\n\nYoung Chinese Australian Lucy Xu (pictured left as a child) says going no contact with her mother after coming out was the most painful period of her life. Source: Supplied / Lucy Xu The 24-year-old publishing and editing postgraduate student is one of many young Chinese Australians who struggle to balance being their authentic selves with being 'good' children to their first-generation Chinese Australian parents.\n\n\n\n\n\nShe explains the conflict stems from the divide between generally progressive values held by young Chinese Australians and the more traditional values often held by their parents.\n\n\n\n\n\nFor LGBTIQ+ young people like Xu, that divide can be particularly personal.\n\n\n\n\n\n\"If I don't have my mum in my life, then it's kind of like I'm just floating around,\" she tells Chinese-ish, an SBS podcast exploring the daily life of young Chinese people in Australia .\n\n\n\n\n\n\"I think also being Asian Australian, growing up in Australia, especially surrounded by a lot more majoritively white communities, you kind of feel like you exist in this third space where you are Australian, but you're not really, and you are Chinese, but you're also not really.\n\n\n\n\n\n\"So it feels like when you lose something, it's so much more impactful because you already didn't have as much as someone else who was white growing up in Australia.\"\n\n\n\nLucy Xu (pictured as a child) wants to embrace her authentic self with the support of her Chinese-Australian family. Source: Supplied / Lucy Xu\n\nFamily therapy and a letter\n\nOne year after her mum first cut contact, Xu decided to reach out to her and proposed an unusual request: they go to therapy together.\n\n\n\n\n\nHer mother had previously attended counselling sessions to process the loss of her husband, Xu's father. Understanding the benefits of talk therapy, she agreed to the request.\n\n\n\n\n\nBut finding the right therapist proved a challenging task for Xu, as her mother speaks Mandarin. While Xu can speak a little, she's not fluent. She also wasn't sure where to find therapists specialising in LGBTIQ+ mental health support while understanding intergenerational cultural dynamics.\n\n\n\n\n\n\"So I just googled 'Asian therapists who are in LGBTQ groups in Melbourne' and it came out with the contact of a Malaysian therapist who's also a gay man,\" she says.\n\n\n\nTo reconcile with her mother after coming out as a bisexual, Lucy Xu invited her mother to go through family therapy together. Source: Supplied / Lucy Xu Xu says the therapist — who speaks both Mandarin and English — has been key to helping her express feelings about her sexuality and communicate with her mother.\n\n\n\n\n\nBefore embarking on a six-month therapy journey, Xu wrote a letter to her mother. In it, she tells her that she loves her and hopes she will come to accept her for who she is, saying: \"I love myself and know myself.\"\n\n\n\n\n\n\"I just remember afterwards she had a lot more questions for me about my sexuality,\" Xu says.\n\n\n\nSo she wanted to understand more and know more about this part of me, which I was really grateful for\n\n\"She was much more open talking about the topic with me, even if she didn't fully accept it.\"\n\n\n\nGrowing up in a bilingual household, Lucy Xu (second from right) says it was challenging to figure out the exact words to use when coming out to her mother. Source: Supplied / Lucy Xu\n\n'This is who I am'\n\nWhen coming out as gay to his family, Hong Kong-Australian filmmaker Victor Wu also wrote a letter to his parents, who both worked as a public servant in Hong Kong before arriving in Australia.\n\n\n\n\n\n\"I just kind of spelled out exactly how I felt, what my position was, which was that I was not asking for approval, I was not asking for acceptance,\" the 39-year-old says.\n\n\n\n\n\n\"[I wrote that] this is who I am. Their decision is whether they accept it, but their decision affects whether they have a place in my life.\"\n\n\n\n\n\nWith support from his elder sibling, Wu's parents accepted his identity. But even before their son came out, Wu's parents already noticed stereotypes perpetuated against LGBTIQ+ people within certain parts of the Chinese-speaking expat community.\n\n\n\nHong Kong Australian filmmaker Victor Wu (right) says he wrote a letter to his parents when coming out as gay. Source: Supplied / Victor Wu He recalls that when his parents first arrived in Australia in 1994, they were introduced to an evangelical church that a longtime friend from Hong Kong also attended.\n\n\n\n\n\n\"We came back one day from church and mum was talking about how vicious the people at that church were about gay people, and how cruel they were,\" Wu says.\n\n\n\n\n\n\"But then she followed up saying that, 'you know, gay people are just mentally ill, they just needed to be treated'.\"\n\n\n\n\n\nThese conflicted views aren't uncommon within the Chinese community in Australia, Wu says, while noting progress on marriage equality and LGBTIQ+ rights more generally has made many Chinese Australians more accepting toward queer people.\n\n\n\nBut the Chinese diaspora was among the groups targeted during the 2017 Marriage Law Postal Survey, with leaflets containing misinformation about same-sex marriage that claimed it would threaten their cultural values and identities.\n\n\n\n\n\nWu says while homophobia still exists in the community, there has been a shift in terms of what people are fearful of.\n\n\n\n\n\n\"In the past, Chinese people or parents would see homosexuality as immoral,\" he says.\n\n\n\n\n\n\"But now gay marriage is legal, they won't think it's immoral, but rather, they are scared of how they would be viewed if other people know their kids are gay,\" Wu says, adding his parents once expressed concern about how coming out could affect his career.\n\n\n\nIncreasing everyday visibility within community\n\nWu believes the solution to counter lingering homophobia is to increase the everyday visibility of LGBTIQ+ people from the Chinese diaspora.\n\n\n\n[It's about] seeing people in our own communities, not seeing something in the media, but seeing some people in our schools, our workmates, weekend Chinese schools … that's going to change their minds.\n\nIt's a belief that underpins Wu's latest film, To Freely Flourish, which features a Chinese-Australian teenager coming out to his family at the height of the marriage equality debate.\n\n\n\n\n\nHe also wants a broader range of Chinese-focused LGBTIQ+ stories to be portrayed in Australian media and entertainment.\n\n\n\n\n\n\"I think part of the problem is because the narratives in the media and storytelling are still so much around pain and tragedy and loss, and it's because we don't have these positive stories that queerness is equated to sadness, death, tragedy and pain,\" he says.\n\n\n\nVictor Wu says his film, To Freely Flourish, aims to counter the stigma some LGBTIQ+ Chinese Australians face. Source: Supplied / Victor Wu According to the 2021 Census, around two in 10 LGBTIQ+ Australians were born overseas, with 4.9 per cent of them speaking a language other than English at home.\n\n\n\n\n\nHaving experienced the struggle of coming out in a cross-cultural setting firsthand, both Wu and Xu say getting involved with an LGBTIQ+ peer collective with shared cultural backgrounds has been helpful for them in navigating the challenges.\n\n\n\nAfter reading his letter, Victor Wu's parents decided to embrace their son's sexuality and gender identity. Source: Supplied / Victor Wu \"I think there's already people doing amazing things and leading the community, creating community … but we're not going to really learn about them as household names till much later,\" Wu says.\n\n\n\nHow to prepare for 'the talk'\n\nBefore broaching a conversation about sexuality or gender identity with parents, Ryan Qian from the health organisation for people of diverse sexualities and genders, ACON's peer education program, says it's important to know that coming out isn't \"necessary\".\n\n\n\n\n\n\"It feels like a social pressure to put on you that you have to come out, and it has to be a grounded thing,\" he says.\n\n\n\nThese things take time, and it's not just for you but also for your parents — some people can prepare for months or years.\n\nFor those considering coming out to their parents, Qian suggests joining a culturally specific LGBTIQ+ peer support group to navigate the balance between pursuing personal authenticity and maintaining cultural roots.\n\n\n\nLISTEN TO After Marriage Equality: Growing Up Queer with Chinese Parents SBS English 25/06/2025 27:00 English\n\nQian says writing a letter can also be helpful for young people from multicultural backgrounds in communicating sensitive and personal matters with their parents.\n\n\n\n\n\n\"Coming out has such a great impact when it comes to you and your family. It's a great challenge if you don't know how your parents are going to react, and sometimes language can be lost in translation,\" he says.\n\n\n\n\n\nHe stresses it's important to have a backup plan and prepare for adverse reactions before having the talk, such as researching emergency housing and counselling services to support the potential fallout with family.\n\n\n\n\n\n\"Having a support network is essential before you come out.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/printing-homes-3d-a-new-solution-for-australias-housing-crisis/mnweh9yk1",
    "title": "This home was printed using a computer. Could it be the fix for Australia's housing crisis?",
    "publish_date": "Sat, 28 Jun 2025 09:38:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points 3D printing new homes can improve construction times by 40 per cent, compared to building with traditional methods.\n\nAustralia has seen single-storey 3D printed homes constructed, but the first such multi-storey home is being built.\n\nWith supply of new housing at its lowest in nearly a decade, there's hope this method will assist in meeting demand.\n\nAt first glance, a construction site in Melbourne's outer-western suburbs looks like any other. But there's one huge difference: the house isn't being built traditionally — it's printed.\n\n\n\n\n\nThe property in the suburb of Wyndham is set to be Australia's first multi-storey 3D-printed home .\n\n\n\nHow do you print a house?\n\nPrinting a house starts the same way as building one, with a drawing from a draftsperson or architect.\n\n\n\n\n\nBut then things take a different turn.\n\n\n\n\n\nThe property's blueprint or drawing is fed into a printer, which creates a physical structure by printing the material in layers.\n\n\n\n\"With 3D printing, it all gets digitised... [The] working drawing goes into a printer as a geometric code, and then it gets done,\" Ahmed Mahil, the CEO of Luyten, the Melbourne-based company printing the house in Wyndham, told SBS News.\n\n\n\n\n\n\"All the other trades will come and their jobs will be easier ... it'll become just plug and play,\" Mahil added.\n\n\n\n\"There will be no more thinking on site or trying to go from one remedy to another.\n\n\n\n\n\n\"That obviously saves a lot of time in terms of workflow [as] it's just one material that you're dealing with.\"\n\n\n\n\n\nAccording to the builder, the entire process of building \"80 per cent of the house\" in Wyndham took approximately three weeks.\n\n\n\nA solution to the housing crisis?\n\nThis is not the only 3D-printed home in Australia.\n\n\n\n\n\nJust last month, two single-storey homes were built in the New South Wales town of Dubbo as part of a 3D-printed social housing project.\n\n\n\nTechnology now allows a property's blueprint to be digitised and 'built' in layers, using a large-scale 3D printer. Source: Supplied / guteksk7/Getty Images With the average build time for a stand-alone home having increased by 40 per cent, according to Master Build Australia, developers say this technology could be a faster solution for countries facing a housing crisis.\n\n\n\n\n\nIt comes as the supply of new housing falls to its lowest level in nearly a decade, according the National Housing Supply and Affordability Council report in May.\n\n\n\n\n\nThe report said 177,000 new homes were finished in 2024, a big gap from the estimated underlying demand of 223,000 for the same period.\n\n\n\nMahil believes 3D-printed homes could be the answer.\n\n\n\n\n\n\"I believe [they] will contribute significantly to reducing the issue with supply,\" he said.\n\n\n\n\n\n\"We're talking about increasing the efficiency and the productivity ... A traditional builder does 10 houses a year. We can up that to 50 houses.\"\n\n\n\nA more sustainable option?\n\nSome experts consider the 3D printing method to be a more sustainable alternative to traditional processes.\n\n\n\n\n\n\"There are really big benefits to 3D printing and sustainability in construction,\" Kate Dunn, an academic at UNSW, told SBS News.\n\n\n\nAhmed Mahil says printing this 3D house cost 30 per cent less than a traditional construction. Credit: Supplied \"One of the biggest benefits is [that] you use way less material than you do in traditional construction.\n\n\n\n\n\n\"3D printing gives us the opportunity to create quite customised forms that use substantially less concrete than traditional methods. So that's where the environmental impact happens, that reduction in material.\"\n\n\n\n\n\n3D-printed homes are also considered to be more affordable than traditionally built homes.\n\n\n\n\n\nMahil claims his 3D-printed house cost 30 per cent less than a traditional build. However, there's been no official Australian research into the cost difference.\n\n\n\n'Industry shock' on human labour\n\nDespite the benefits, others worry the use of technology may reduce the demand for human labour.\n\n\n\n\n\nAccording to 2023 research by academics at Charles Darwin and Monash universities, the 3D technologies will \"reduce opportunities for many people working onsite\", which \"may cause political instability in particular economies\".\n\n\n\nREAD MORE Why Australian homes are so cold — and what you can do about it\n\nHao Wu, an academic in Melbourne University's faculty of architecture, says the construction industry will have to adapt.\n\n\n\n\n\n\"The existing work-relation industry structure may be impacted [by] it and maybe gradually transform,\" he said.\n\n\n\n\n\n\"In some cases, it could be a industry shock.\"\n\n\n\n\n\nOn the other hand, Mahil suggests the new technology will help smaller businesses keep up with rising demand.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-the-road-rules-changing-on-tuesday-20250627-p5maub.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Deal to buy out casino at risk of collapse; Translink journey planner crashes on Metro’s day one; Buranda train station reopens",
    "publish_date": "Mon, 30 Jun 2025 12:13:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "A group set to take over the floundering Brisbane Queen’s Wharf casino and hotel is now threatening to walk away from the deal.\n\nStar Entertainment has been under significant financial pressure, and an agreement for existing part-owners Chow Tai Fook Enterprises and Far East Consortium to buy out the complex was expected to bring relief.\n\nStar told the stock market today the investors had terminated a preliminary document outlining terms. Credit: Glenn Campbell\n\nStar told the stock market today the investors had terminated a preliminary document outlining terms, meaning the deal will collapse in five days unless a new agreement can be reached.\n\n“This morning, The Star received from the Joint Venture Partners a notice to terminate the HoA,” a statement to the ASX said.\n\n“Despite the receipt of this notice, The Star remains willing to continue negotiations.”\n\nThe Australian Financial Review reports insiders at the casino believe the move is a negotiating tactic, with parts of the original agreement in dispute.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/inside-the-investigation-into-merivale-s-mexican-mission-20250630-p5mbbw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside the investigation into Merivale’s Mexican mission",
    "publish_date": "Mon, 30 Jun 2025 12:05:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "Inside the investigation into Merivale’s Mexican mission\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-pm-very-happy-to-meet-trump-exports-at-risk-of-tumbling-30b-trump-pushes-for-ceasefire-in-gaza-20250630-p5mb7c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news live: PM ‘very happy’ to meet Trump; Exports at risk of tumbling $30b; Wong heads to Washington to meet US foreign minister",
    "publish_date": "Mon, 30 Jun 2025 12:05:19 +1000",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "Health insurance giant Bupa has admitted it misled thousands of customers about their entitlements for more than five years, leading some to forgo medical treatments and leaving others out of pocket by thousands of dollars.\n\nThe health insurer agreed to pay $35 million in penalties in response to legal action from the consumer watchdog over its practices, the Australian Competition and Consumer Commission said in a statement today.\n\nLoading\n\n“Bupa’s conduct is very serious and fell well short of what is expected of one of the largest health insurers in Australia,” ACCC chair Gina Cass-Gottlieb said.\n\nThe ACCC launched proceedings against Bupa in the Federal Court, alleging it breached consumer law by engaging in misleading or deceptive conduct, making false or misleading representations to its customers and engaging in unconscionable conduct in assessing mixed coverage claims.\n\nBupa has conceded to the watchdog that at various times between May 2018 and August 2023, it told customers they weren’t entitled to benefits for so-called mixed coverage claims and uncategorised item claims when, in fact, they were.\n\nThe ACCC said most of the cases involved claims for hospital treatments, in which two or more procedures were performed at the same time. “In cases where part of the treatment was covered by a member’s policy and part of the treatment was not covered, Bupa incorrectly rejected the entire claim,” it found.\n\nRead the full story here.",
    "source": "TheAge",
    "cluster_id": 9
  },
  {
    "url": "https://www.theage.com.au/national/how-the-2022-flood-catastrophe-unfolded-20250627-p5max7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How the 2022 flood catastrophe unfolded",
    "publish_date": "Mon, 30 Jun 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [],
    "text": "How the 2022 flood catastrophe unfolded\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/culture/music/glastonbury-2025-lewis-capaldi-s-epic-return-aussie-stars-and-the-death-of-brat-20250630-p5mb8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Glastonbury 2025: Lewis Capaldi’s epic return, Aussie stars and the death of brat",
    "publish_date": "Mon, 30 Jun 2025 11:56:33 +1000",
    "category": "entertainment",
    "authors": [
      "Nick Newling"
    ],
    "text": "The 2025 Glastonbury Festival has come to an end, with hundreds of thousands of guests flocking to Worthy Farm in southern England for arguably the most iconic music festival in the world. The three-day event saw up to 210,000 ticket holders camping out to hear thousands of artists perform on over 100 stages.\n\nWhile music was the main event, there was plenty of controversy, as well as wild weather and surprises, in store to make the festival one for the history books. Here are the biggest moments you might have missed from this year’s Glastonbury:\n\nGlastonbury has a capacity of 210,000 festivalgoers every year. Credit: Scott A Garfitt/Invision/AP\n\nRain and heat lash festivalgoers\n\nThe festival is renowned for its wild and varied weather, and this year was no different. The first day saw pouring rain and rivers of mud, but by the end of the festival organisers were issuing heat advice for temperatures north of 31 degrees (heaven forbid). It’s worth remembering that a mild Australian summer day can feel like an unbearable heatwave in Britain.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/trump-s-america-exploits-its-revenge-tax-to-back-out-of-historic-deal-20250630-p5mb88.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s America exploits its ‘revenge tax’ to back out of historic deal",
    "publish_date": "Mon, 30 Jun 2025 11:54:34 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "The “revenge tax” is dead but the fate of a global tax deal that took more than 40 years to achieve is now up in the air.\n\nEarlier this month, the G7 countries – the US, Canada, France, Germany, Italy, Japan and the United Kingdom – announced a deal to exempt the US from the global minimum tax arrangements agreed by nearly 140 countries in 2021 after decades of discussions and a decade-and-a-half of detailed negotiations co-ordinated by the OECD.\n\nUS President Donald Trump has been a vocal critic of the global tax deal. Credit: AP\n\nIn exchange, the US will drop Section 899 of US President Donald Trump’s “One Big Beautiful Bill Act”, the so-called “revenge tax”, which would have enabled the US to impose retaliatory taxes of up to 20 per cent on companies and individuals from countries that have imposed “discriminatory” taxes on US companies.\n\nThe negotiated outcome creates what the parties described as a “side-by-side” system that excludes the US from the 15 per cent minimum global tax deal the Biden administration agreed to in 2021 and which was supposed to raise an extra $US150 billion ($230 billion) of annual global tax revenues.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/federal/senior-public-servant-allegedly-promoted-sister-s-fiance-forged-signature-20250630-p5mbb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Senior public servant promoted sister’s fiance, forged signature",
    "publish_date": "Mon, 30 Jun 2025 11:54:23 +1000",
    "category": "finance",
    "authors": [
      "Olivia Ireland"
    ],
    "text": "A senior public servant has been found to have committed corrupt conduct after she promoted her sister’s fiance for a high-ranking position in Home Affairs in the first public investigation completed by the National Anti-Corruption Commission in its two years of operation.\n\nThe NACC investigation found the public servant abused her office by promoting her sister’s fiance as a candidate for a position in Home Affairs, praising him to colleagues, creating the job requisition, approving it herself and forging a witness signature to fast-track onboarding.\n\nAn official from the Department of Home Affairs allegedly engaged in corrupt conduct. Credit: Alex Ellinghausen\n\nThe official did this “while deliberately concealing the family relationship”, and at no point did she disclose the relationship. In a separate incident, the official allegedly provided job interview questions to her sister in advance.\n\nThe NACC recommended the official’s employment be terminated, but she had already resigned. The finding, published on Monday, is the first publicly completed investigation by the NACC since its formation in June 2023.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/cameroon-player-dunks-ball-in-his-own-basket-to-help-australia-to-miracle-win-20250630-p5mbar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cameroon player dunks ball in his own basket to help Australia to miracle win",
    "publish_date": "Mon, 30 Jun 2025 11:51:51 +1000",
    "category": "sports",
    "authors": [
      "Jonathan Drennan"
    ],
    "text": "Australian Emus coach Robbie McKinlay had a list of plays drawn up with just 48 seconds left in the fourth quarter and his team down by six points to Cameroon at the under-19 basketball World Cup.\n\nMcKinlay’s playbook wasn’t needed to win the game, however. Cameroon’s Amadou Seini dunked the ball in his own basket to help send the game into overtime and Australia staged a remarkable comeback win.\n\nSeini’s mistake is extremely rare, but it has happened before in basketball.\n\nIn an exhibition game in 2013, University of Kentucky player Joe Young tried to save the ball from going out of bounds and as he flicked it behind his back, it landed in his own net.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/afl/carlton-crisis-deepens-with-silvagni-in-doubt-for-pies-clash-20250630-p5mb8n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Carlton crisis deepens with Silvagni in doubt for Pies clash",
    "publish_date": "Mon, 30 Jun 2025 11:51:06 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Carlton’s on-field woes have worsened with defender Jack Silvagni in doubt for Friday night’s clash with Collingwood at the MCG.\n\nSilvagni is nursing a groin issue, and did not join in training with the main group on Monday.\n\nHe was restricted to jogging alongside Harry McKay in the rehabilitation group, having been managed through the final term against Port Adelaide on Thursday night.\n\nIn doubt: Jack Silvagni is nursing a groin issue. Credit: Getty\n\nHe was seen in deep conversation with fitness and medical staff.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/property/news/time-portal-four-buyers-fight-for-11m-mid-century-modern-centennial-park-home-20250630-p5mb8x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Time portal: Four buyers fight for $11m mid-century modern Centennial Park home",
    "publish_date": "Mon, 30 Jun 2025 11:46:34 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "Four eastern suburbs locals contested a mid-century modern home in Centennial Park on Saturday, which sold for $11 million.\n\nThe four-bedroom property at 40 Martin Road was architecturally designed in 1967 and had a distinctive feel due to the flow of the layout, skylights and styling throughout.\n\nInitially guided at $10 million, during the four-week campaign interest was shown at $10.5 million and then progressed to $11 million, the updated guide. The reserve was set at the same level, which is also where it sold under the hammer.\n\nAll four registered buyers were local to the eastern suburbs and all actively competed for the chance to secure “Camelot” as their principal place of residence.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/end-your-night-with-mango-sago-at-this-hong-kong-inspired-dessert-spot-in-eastwood-20250630-p5mbak.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "End your night with mango sago at this Hong Kong-inspired dessert spot in Eastwood",
    "publish_date": "Mon, 30 Jun 2025 11:41:16 +1000",
    "category": "finance",
    "authors": [
      "David Matthews"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\n1 / 2 Mango and pomelo sago dessert from Hon Kee. Jennifer Soo 2 / 2 Hon Kee on Rowe Street, Eastwood. Jennifer Soo Previous Slide Next Slide\n\nHong Kongese$$$$\n\nThe last few blocks of Rowe Street’s restaurant strip buzz. Expect Chinese grocers, baked goods and dumplings, plus everything from stonepot fish to crisp-bottomed sheng jian bao, pork soup dumplings, (here’s looking at you, 257 Home Kitchen). Zheng’s Skewer BBQ – from the team behind Jin’s Grilled Meat Pies – is worth a stop, but if sweets are the order, there’s no going past Hon Kee Hong Kong Dessert.\n\nCome nightfall, tables heave with bowls of milk pudding or glutinous rice with coconut. Both are good picks, but the mango pomelo sago is the fan favourite: cool, refreshing, with bursts of citrus, there’s no better dish to close out an evening.\n\nThe menu features more than 50 desserts, many of them “sweet soups” – known as tong su (or “sugar water”) in Hong Kong – a syrupy, pudding-like sweet flavoured with ingredients like almonds, walnut, red bean and black sesame.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/culture/celebrity/all-the-glamour-and-pageantry-from-the-bezos-sanchez-wedding-20250630-p5mba5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "All the glamour and pageantry from the Bezos-Sanchez wedding",
    "publish_date": "Mon, 30 Jun 2025 11:39:15 +1000",
    "category": "finance",
    "authors": [],
    "text": "All the glamour and pageantry from the Bezos-Sanchez wedding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-perth-preps-for-seven-day-soaking-memorial-for-fallen-police-officer-20250629-p5mb5s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Perth preps for seven-day soaking; Memorial for fallen police officer",
    "publish_date": "Mon, 30 Jun 2025 11:30:06 +1000",
    "category": "finance",
    "authors": [],
    "text": "The couple of sunny winter days we had are well and truly in the rearview mirror for Perth this week with seven days of showers predicted.\n\nThe Bureau of Meteorology is forecasting a 90 per cent chance of 1-6 millimetres of showers today, most likely this afternoon and evening, and while the forecast eases tomorrow somewhat to only a shower or two, by Wednesday things are ramping up.\n\nHump day will see a 90 per cent chance of 2 to 15 millimetres and the chance of a thunderstorm, and again a high 80 per cent chance of significant showers continuing into Thursday morning. There are medium to high chances of showers also predicted through Friday, Saturday and Sunday.\n\nThe silver lining to all that cloud cover is that it will keep us relatively warm, with tops of 19 to 23 degrees throughout the week. And the UV index is at two, so you can give the sunscreen a miss.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/powerball-winners-first-words-after-division-one-jackpot-couldnt-form-proper-sentences-210439473.html",
    "title": "Powerball winner's first words after division one jackpot: 'Couldn’t form proper sentences'",
    "publish_date": "2025-06-29T21:04:39Z",
    "category": "finance",
    "authors": [],
    "text": "With officials still trying to track down June 12's mystery $100 million winner, here's how last year's millionaires spent their prizes.\n\nIn 2024, more than 195.3 million winners took home over $4.84 billion in prize money, The Lott claims.. Source: The Lott\n\nAs lottery officials reveal they're still no closer to finding the mystery $100 million Powerball winner, from a competition drawn now over two weeks ago, they've released some of the incredible ways Australians have benefited from their wins.\n\nWhile it remains extraordinarily unlikely that an individual will ever win a Division One prize, it has been the case for a few lucky Aussies over the years.\n\nAccording to The Lott's Annual Winners report, there were 441 division one winning entries across the country last year across all lottery games, collectively delivering more than $1.56 billion in prize money.\n\nHow the lucky lottery winners spent their newfound fortunes\n\nIn 2024, one winner said they ordered a pair of \"hand-crafted leather dress shoes for themselves,\" while another purchased a 1936 Oldsmobile. A third winner marked the occasion by \"buying watches for close family members\" to help celebrate, and another took off to Las Vegas to attend a friend’s Elvis-themed wedding. Another invested in electric mountain bikes to explore bush trails, while one recipient opted for a hair transplant in Istanbul, saying it boosted their self-confidence.\n\nADVERTISEMENT\n\nAmong their first reactions? Here’s how some reacted.\n\n\"Yelled out, 'You beauty!' and scared the dog with my excitement.\"\n\n\"I let out a number of swear words and then spent most of the night checking my numbers.\"\n\n\"I couldn’t form proper sentences and started stuttering. I couldn’t believe my prize money.\"\n\n\"I was emotional because of what it meant for my family.\"\n\nWinners remain anonymous, but many have issued advice for those lucky enough to pocket a big win.\n\n\"It’s very easy to go crazy early on, but my advice would be to calm down and carefully think about your future plans.\"\n\n\"Treat your win as an opportunity to improve your circumstances, so don’t waste it.\"\n\n\"Ride the wave of all your emotions. Don’t be afraid of the change. Trust your instincts.\"\n\n\"Sit back, think, and don’t make hasty decisions. Take time to process.\"\n\n\"Tell very few people and write down who you told.\"\n\nThe Lott spokeswoman Anna Hobdell said only about 8 per cent of winners keep their prize completely under wraps. Source: The Lott\n\nOfficial's advice for those with a stake in the game\n\nIn 2024, more than 195.3 million winners took home over $4.84 billion in prize money, The Lott claims.\n\nADVERTISEMENT\n\nWith June 12's $100 million Powerball prize still at large, the message from officials remains clear: keep your phone on. A quarter of winners (25 per cent) discovered their good fortune via a phone call, while 24 per cent found out by checking online.\n\nThe Lott spokeswoman Anna Hobdell said once the news sinks in, \"most winners can’t wait to share the joy with people in the know\". \"Only about 8 per cent keep it completely under wraps and tell absolutely nobody,\" she said. \"Winners often tell us their bodies go into overdrive the moment they hear the life-changing news, with hearts racing, hands trembling, and even a wave of nausea setting in.\n\n\"For many, the best part of winning is being able to give back — whether it’s helping their kids buy their first home, shouting a holiday for their friends, or even helping strangers who could use a hand.\"\n\nAccording to The Lott themselves, the chances of winning division one in Powerball, based on one standard game, are a vanishingly small one in 134,490,400.\n\nADVERTISEMENT\n\nIf gambling is a problem for you, go to Gambling Help Online or call 1800 858 858.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 41
  }
]