[
  {
    "url": "https://www.9news.com.au/national/dementia-now-leading-cause-of-death-in-australia/85713937-bb9f-4660-a0f6-71be97f114dd",
    "title": "Australia now has a new leading cause of death",
    "publish_date": "Fri, 14 Nov 2025 01:16:48 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "D﻿ementia\n\n, including Alzheimer's disease, is now the leading cause of death in\n\nAustralians\n\novertaking ischaemic heart disease for the first time in new data from the\n\nAustralian Bureau of Statistics\n\n.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/act-schools-shut-over-asbestos-find/d1440719-0e63-4e6c-9e04-793f74740a05",
    "title": "Schools closed across Australia over asbestos found in coloured sand",
    "publish_date": "Fri, 14 Nov 2025 00:54:34 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Fifteen schools in Canberra and one in Brisbane have closed today over ﻿potential asbestos contamination.\n\nThe alert is over a ﻿a decorative, coloured sand found to contain traces of chrysotile asbestos.\n\nMancel College, a specialist school in Brisbane, ﻿has said it will shut its campus for the day \"with immediate effect\" after the sand product was used at its junior and senior school.\n\nFifteen Canberra schools and one in Brisbane have been closed today over potential asbestos contamination. (Getty)\n\n\"While the advice is low risk and there are only minor traces, we are acting with an abundance of caution,\" it said in a social media statement.\n\n\"We are therefore advising parents that with immediate effect we are closing the entire college today.\"\n\nEarlier, 15 schools in the ACT were closed and more were partially shut over potential contamination.\n\nACT Education Minister Yvette Berry said ﻿testing for potential contamination at the schools started yesterday.\n\n\"I understand the news will be upsetting for some families, however WorkSafe have advised the risk of exposure to traces of chrysotile is low,\" she said.\n\n\"The safety of students staff and families is our priority which is why we are taking this action.\"\n\nBerry said the decision to close the schools was taken on the advice of WorkSafe ACT.\n\n﻿Remediation will continue across the weekend by licensed asbestos contractors.\n\nThe government is aiming to reopen schools from next Monday.\n\nACT Education Minister Yvette Berry. (Sydney Morning Herald)\n\n\"School communities will receive advice on Sunday afternoon or evening about arrangements for Monday so we are asking parents and school communities just to keep an eye on their phones and emails so that information can be provided and that they receive that in time for Monday morning,\" Berry said.\n\nAny new schools identified over potential contamination that need to be closed or partially closed that will be added listed on the Education ACT website.\n\nACT WorkSafe Commissioner Jacqueline Agius﻿ said there eight test results came back early today and all were negative for airborne fibres.\n\nThis week, the Australian Competition and Consumer Commission (ACCC) said Kadink Sand, Educational Colours Rainbow Sand and Creatistics Coloured Sand were being recalled because the sand could include asbestos.\n\nThe prohibited substance had been detected in some samples after lab testing.\n\nAnyone with queries about the closures and responses in ACT schools should call a government hotline on﻿ (02) 6205 5429.\n\nWhole school closures﻿\n\nBlack Mountain School\n\nCampbell Primary School\n\nCharles Weston School\n\nCharnwood-Dunlop Primary School\n\nEvatt Primary School\n\nFlorey Primary School\n\nLatham Primary School\n\nLyons Early Childhood School\n\nMalkara School\n\nNamadgi School\n\nChapman Primary School\n\nCranleigh School\n\nMiles Franklin Primary School\n\nFraser Primary School\n\nWanniassa Hills Primary School\n\nPartial school closures\n\nCharles Conder Primary School – Preschool and Small Group Program\n\nNorth Ainslie Primary School – Preschool and year 1\n\nTorrens Primary School – Preschool, Kindergarten and Year 1\n\nWanniassa School – Preschool to year 6\n\nYarralumla Primary School – Montessori, Kindergarten, Year 1, Small Group Program\n\n﻿Preschool closures only\n\nChapman Primary School — Preschool\n\nCranleigh School — Preschool\n\nCurtin Primary School — Preschool\n\nKingsford Smith School — Preschool including Koori Preschool\n\nNarrabundah Early Childhood School — Preschool",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/bbc-apologises-to-donald-trump-but-says-no-basis-for-defamation-claim/0029ca35-297b-4126-873f-367023f9f3be",
    "title": "BBC apologises to Donald Trump over misleading video edit",
    "publish_date": "Thu, 13 Nov 2025 21:51:15 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "The BBC has apologised to US President Donald Trump over a misleading edit of his speech on January 6, 2021, but said it strongly disagreed that there was a basis for a defamation lawsuit.\n\nThe BBC said Chair Samir Shah sent a personal letter to the White House saying that he and the corporation were sorry for the edit of the speech Trump gave before some of his supporters stormed the US Capitol.\n\nIt said there are no plans to re-broadcast the documentary that spliced together parts of his speech that came almost an hour apart.\n\nDonald Trump returning to the Oval Office on January 6, 2021. (AP)\n\n\"We accept that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action,\" the BBC wrote in a retraction.\n\nTrump's lawyer had sent the BBC a letter demanding an apology and threatened to file a US$1 billion ($1.53 billion) lawsuit.\n\nThe dispute was sparked by an edition of the BBC's flagship current affairs series Panorama , titled \"Trump: A Second Chance?\" broadcast days before the 2024 US presidential election.\n\nREAD MORE: Driver in deadly wedding bus crash to learn appeal fate ﻿\n\nFormer BBC director-general Tim Davie has resigned. (Getty)\n\nThe third-party production company that made the film spliced together three quotes from two sections of the 2021 speech, delivered almost an hour apart, into what appeared to be one quote in which Trump urged supporters to march with him and \"fight like hell.\"\n\nAmong the parts cut out was a section where Trump said he wanted supporters to demonstrate peacefully.\n\nDirector-general Tim Davie, along with news chief Deborah Turness, quit Sunday, saying the scandal was damaging the BBC and \"as the CEO of BBC News and Current Affairs, the buck stops with me.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/australias-stillbirth-crisis-why-have-rates-failed-to-improve-in-20-years/dc2390e3-5824-470f-97f2-3c2ea0ede53b",
    "title": "Australia's stillbirth crisis: Why have rates failed to improve in 20 years?",
    "publish_date": "Thu, 13 Nov 2025 18:46:23 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "﻿WARNING: This article discusses the issue of stillbirth and the death of a newborn.\n\nSydney nurse Nerida Rosenthal was 33 weeks pregnant with her first baby when she suddenly felt worried that she hadn't felt her daughter move in a long time.\n\n\"I was at work, and I remember it was a really busy day,\" she said.\n\n\"I sat down in the afternoon and thought, 'Oh, I haven't really been paying attention to the movements.'\"\n\nNerida Rosenthal pictured in hospital after the birth of her daughter Mia, who was stillborn. (Supplied)\n\nStressed, Rosenthal left work for a regular acupuncture appointment.\n\nIt was during this quiet time that she usually felt her daughter move.\n\nBut not this time.\n\n\"I just thought, 'No, I'm not feeling her',\" Rosenthal said.\n\nNow very concerned, Rosenthal called her husband, who took her to the hospital.\n\n\"I went in and was sat in the waiting room,\" Rosenthal said.\n\n\"It was obviously a very busy shift in the delivery suite.\"\n\nA staff member came out to the waiting room and put a cardiotocography (CTG) monitor on Rosenthal to measure the baby's heart rate.\n\nThe measurements reassured staff, who detected a heartbeat before returning to the ward.\n\nHowever, Nerida wasn't reassured and suspected it was her own heartbeat, elevated by anxiety, that was picked up by mistake.\n\nInstinct told Rosenthal something was very wrong, and she refused to leave the hospital despite being given the all clear.\n\n\"I knew it in my gut and I said, 'I'm not leaving here based on a CTG, I need a scan',\" she said.\n\nRosenthal's obstetrician arrived at the hospital and immediately performed an ultrasound, which confirmed her worst fears.\n\n\"The doctor just turned to me, and he had tears in his eyes. He said, 'You're right. There's no heartbeat',\" she said.\n\nREAD MORE: ﻿ First images of secretive Border Force operation\n\nNerida Rosenthal, pictured with her daughter Mia, who was stillborn. (Supplied)\n\nRosenthal's daughter had suffered an umbilical cord accident.\n\nThe cord was wrapped around her neck twice and kinked, stopping the blood flow.\n\nAround 2380 families are affected by stillbirth every year in Australia.\n\nIt's a rate that has remained largely unchanged over the last two decades.\n\nIn 2022, the rate of stillbirths even increased slightly to 8.0 per 1000 births, up from 7.2 per 1000 births a year earlier, according to the latest available data from the Australian Institute of Health and Welfare.\n\nIn 2018, a Senate inquiry examined the lack of movement on Australia's stillbirth rate.\n\nIn response, the National Stillbirth Action and Implementation Plan was launched in 2020, which included a federal government target to reduce the number of stillbirths by 20 per cent by December 2025.\n\nWhile Rosenthal believes her daughter Mia's death was unpreventable, she, alongside many other bereaved parents, is calling for change around this issue\n\n\"It's just crazy that the stats haven't changed in all of this time,\" she said.\n\n\"We know that some of these stillbirths are preventable. So what can we do to prevent them?\n\n\"You're not going to save everyone, but we still need to raise awareness for the type of early checks that can save someone.\"\n\nIn September, a parliamentary petition collected more than 6000 signatures, calling for a national stillbirth awareness campaign.\n\nThe petition was launched by Tim McCranor, who, along with his wife Michelle, lost their baby daughter Celeste in 2001.\n\nThe couple's advocacy has also included the making of a recently released documentary called Her Name is Celeste .\n\nWhy haven't stillbirth rates improved?\n\nDespite medical advancements in other areas of health, stillbirth rates have stagnated and even showed a slight uptick in 2022, when the highest rate in 20 years was recorded.\n\nIn its analysis, the Australian Institute of Health and Welfare (AIHW) said there had been no consistent trend over the past few decades when it came to the number of stillbirths.\n\nHowever, some fluctuations had coincided with key events, such as the COVID-19 pandemic, the 2019–20 bushfires, and changes in the underlying birth rate, AIHW said.\n\nA graph showing the rates of stillbirth in Australia over the past two decades. (Australian Institute of Health and Welfare)\n\nSome of the increase in 2022 could be attributed to the improved capture and inclusion of cases in some areas, it said.\n\nVicki Flenady is the director of the Stillbirth Centre of Research Excellence (CRE), a peak body leading the effort to prevent stillbirths in later gestation, from 28 weeks onwards.\n\nFlenady said possible factors which may have influenced stillbirth rates included disruptions to maternity care during the COVID-19 pandemic and inequity in care.\n\n\"Stillbirth disproportionately affects marginalised groups, including Aboriginal and Torres Strait Islander women, women from some migrant and refugee backgrounds, women under the age of 20, and women from rural and remote areas,\" Flenady said.\n\n\"These disparities are linked to factors like social disadvantage, intergenerational trauma, and limited access to culturally safe healthcare.\"\n\nIt is estimated that about 20-30 per cent of stillbirth deaths in late gestation are preventable.\n\nREAD MORE: ﻿ Woman charged with murder a month after elderly woman found dead in bed\n\nNerida Rosenthal and other bereaved parents are calling for the federal government to implement a national stillbirth awareness campaign. (Supplied)\n\nWhile the national overall figures for stillbirths measured deaths from 20 weeks onwards, one area which had shown improvement was in later gestation from 28 weeks, Flenady said.\n\n\"In this group, there has been a downward trend,\" Flenady said.\n\n\"The average annual rate reduction reveals a 3.1 per cent decrease in late gestation stillbirth rates in the decade to 2022.\"\n\nA key stillbirth prevention strategy in the National Stillbirth Action and Implementation Plan has been the rollout of a Safer Baby Bundle in higher-risk communities and clinical settings through Stillbirth CRE.\n\nThe bundle helps clinicians identify women at a higher risk for stillbirth and provides strategies for their care.\n\nModelled on the UK's National Health Service's (NHS) Saving Babies' Lives Care, the bundle has shown promising early results, Flenady said.\n\n\"Pre-COVID Victorian data show a 21 per cent reduction in stillbirths occurring at 28 weeks' gestation or more where the Safer Baby Bundle has been embedded.\"\n\nLack of real-time data hinders efforts\n\nOne major factor hampering the efforts to reduce the stillbirth rate is the lack of real-time data, Flenady said.\n\nThere is currently a three-year delay in the release of stillbirth statistics by the Australian Institute of Health and Welfare.\n\n\"Access to timely, comprehensive data limits the ability to measure, in real time, the impact of prevention initiatives or other factors that influence stillbirth rates,\" Flenady said.\n\n\"In addition, there is a two-year delay between the occurrence of a stillbirth and its inclusion in data sets made available for analysis.\"\n\nThe National Stillbirth Action and Implementation Plan identified the need to improve data collection on stillbirths and committed in the medium term to \"develop and implement a standardised approach to data collection on causes and contributing factors for perinatal deaths, across maternity services linked to perinatal mortality review committees to ensure timely review and reporting of stillbirth deaths\".",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/menulog-leaves-australia-restaurant-owners-not-surprised-as-delivery-apps-slash-profits-in-cost-of-living-crisis/270c4b14-6719-4b62-836c-bb662a8b3fd1",
    "title": "'Bad reviews': Restaurant owners ditched Menulog years before shock closure",
    "publish_date": "Thu, 13 Nov 2025 12:46:55 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "E﻿xclusive: Restaurant bosses say they aren't surprised Menulog didn't survive after the service ceased operations in Australia, as more owners decide to ditch food delivery apps altogether.\n\nAustralian-founded but now Dutch-owned Menulog will wrap up business by November 26 , ending a two-decade-long market share in the booming delivery app industry.\n\nWhile UberEats continues to have a chokehold on the local restaurants – with 4.18 million Australian users in 2024 – plenty of businesses have now turned their backs on the apps.\n\nOwner of Barry's Burgers, Chris Ratnaike. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nThe owner of Adelaide's Barry's Burgers Chris Ratnaike said he stopped using Menulog a few years ago after a surge of bad reviews due to missed or late deliveries.\n\n\"I'm not surprised it did shut down,\" Ratnaike told nine.com.au.\n\n\"We stopped using it because we got a few bad reviews.\n\n\"There would be times you'd have an order but no driver would accept it.\n\n\"﻿But I don't think it is a good thing that it's not going to be here because then it just gives Uber more market share.\"\n\nRatnaike stopped using the likes of UberEats and DoorDash last month, too, after eight years and introduced his own delivery system instead.\n\nBarry's Burgers has its own online app, which is then delivered to customers via a DoorDash driver.﻿\n\nThe popular burger joint uses its own delivery platform. (Supplied)\n\nREAD MORE: Why thousands of Australians are buying and selling snack vending machines\n\nHe said Uber's 30 per cent cut ﻿was simply not sustainable.\n\n\"When people are using these delivery apps, say something costs $30 on there, but it's $20 in store... you're paying $6 on delivery and a $4 service fee,\" he continued.\n\n\"You could pay 50 per cent extra, but the business is not getting that.\n\n\"We don't want to rip people off.\n\n\"We hate doing price increases, but we hate not being able to pay our bills.\"\n\nUber takes a 30 per cent cut from restaurants who use the company's app and ﻿drivers, 16 per cent for self-delivery and six per cent for restaurants who only offer pick-up.\n\n﻿Martin Prenga, who runs Italian restaurant Dolce Napoli in Balmain, also isn't a fan of the delivery giants.\n\nHe got rid of the apps after realising they were \"pointless\".\n\n\"I got tired of them,\" Prenga explained to 9news.com.au.\n\n\"It's literally no profit whatsoever.\"\n\nDolce Napoli's Martin Prenga. (Supplied)\n\nPrenga offers his customers 10 per cent off for pick-up orders and hasn't seen any downturn in business since stopping deliveries.\n\n﻿He expects other delivery apps with a similar model to Menulog may also struggle to keep afloat in Australia.﻿\n\n\"They will have only two choices: either pull out of Australia or drop the rate,\" he added.\n\n\"The rate needs to drop. The 30 per cent is mental.\"\n\nMario from Marios Cafe in Melbourne. (Supplied)\n\nThe owners of Melbourne institution Marios Cafe ﻿have never used delivery apps.\n\nCo-founder Mario Maccarone told 9news.com.au it just \"doesn't work\" for his restaurant.\n\n\"I think it would impact on customer experience,\" he said.\n\nMaccarone said he thinks Menulog's closure is a \"bit of a sign\".\n\n\"And I know at least one other business﻿ who has been disillusioned with the apps too,\" he added.\n\n9news.com.au has reached out to Menulog and UberEats for comment.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/trump-granddaughter-last-lpga-debut-after-receiving-wildcard/106009970",
    "title": "Trump's granddaughter last in LPGA debut after receiving wildcard",
    "publish_date": "Fri, 14 Nov 2025 01:53:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "Kai Trump says her first taste of LPGA Tour competition was \"amazing\" despite carding a 13-over-par 83 that left her in last place after the first round of The Annika tournament in Florida.\n\nThe 18-year-old granddaughter of President Donald Trump finished her first official LPGA Tour round with nine bogeys, two double bogeys and no birdies.\n\nTrump, who was handed a sponsor invitation to the event, is last in the 108-player field, four shots behind her closest competitor.\n\n\"I was definitely more nervous than I expected, but I thought I hit a lot of great shots out there,\" she said.\n\n\"I hit a lot of good shots just to the wrong spots.\n\n\"Obviously being, you know, my first LPGA event, now I kind of know how it goes.\"\n\nStarting on the back nine, Trump bogeyed her first four holes before carding her first par on the par-5 14th hole.\n\nShe added two more bogeys before a par on the daunting 18th hole put her at 6-over 41 at the turn.\n\n\"I felt like a little out of order in the beginning but I kind of got it going afterwards,\" Trump said.\n\n\"I learned a lot. It was amazing. I had a great time out there.\n\n\"Didn't play the way I wanted obviously, but for my first event ever, I think I played pretty good.\"\n\nSome have been critical that Trump, a high school senior with modest results in junior competitions, received a sponsor invite into the event.\n\nShe took part in Wednesday's pro-am, but acknowledged that Thursday was by far the biggest golf stage she had been on.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nThe youngest player in the field, Trump displayed solid distance while averaging 242 yards (221.3 metres) off the tee. However, she hit only 7 of 18 greens in regulation and needed 36 putts to get around the Pelican Golf Club.\n\n\"It was pretty cool because I know I hit it far, but kind of playing with the best players in the world and being literally right there or even out-driving on some of the holes, it felt pretty good,\" she said.\n\n\"Felt like my game is in a good spot, and especially only being a senior in high school. It was cool to see that.\"\n\nTrump, who has committed to play for the University of Miami next year, will begin her second round at 8:17am ET on Friday (12:36am AEDT on Saturday).\n\nReuters",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/ariana-grande-ambushed-wicked-red-carpet-cynthia-erivo/106009192",
    "title": "Cynthia Erivo praised for protecting co-star Ariana Grande from invader at Wicked event",
    "publish_date": "Fri, 14 Nov 2025 01:41:16 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Cynthia Erivo has been praised for coming to the aid of her Wicked co-star Ariana Grande after a spectator ran at her at the film's premier in Singapore.\n\nGrande and Erivo were walking with their fellow co-stars at Universal Studios Singapore, the walkway flanked on either side with fans cheering behind barricades.\n\nVideo shared across social media shows a man jumping over a crowd-control barrier, running towards Grande and putting their arms around the singer.\n\nErivo is seen rushing towards the intruder, pushing him away and separating Grande from his grip.\n\nFootage of the incident has been shared widely across social media, with footage shared by a user called lanagrandes viewed more than 2.2 million times in 10 hours.\n\nAnother angle of the incident shared on TikTok by usersofiarose showed the ambusher being forced back over a barrier by security staff within seconds.\n\nAs this is unfolding, the pair are seen continuing onwards with linked arms, with Erivo visibly shaken.\n\nCynthia Erivo and Ariana Grande walk off as security staff deal with the intruder. (TikTok: usersofiarose)\n\nFans took to the comments section to praise Erivo for her actions.\n\n\"Cynthia is protecting her omg,\" one user said.\n\n\"Cynthia's muscles came into play. No hesitation whatsoever. Yes girl,\" another said.\n\nVideo posted to TikTok by dinie_syahmi_ showed the man being led away by security staff after the stars had moved on, with other fans jeering and doing thumbs down gestures.\n\nSerial intruder identified\n\nFans identified the intruder as a man who goes by the username Pyjama Man on Instagram.\n\nHis profile also includes what's believed to be his real name, Johnson Wen, along with labels \"2023 WorId Cup FinaI Pitch lnvader\" and \"Troll Most Hated\".\n\nAlong with video from the Wicked premiere, his account also shows videos of him invading other events, including getting up on stage at concerts by Katy Perry, The Weeknd and The Chainsmokers.\n\nCynthia Erivo protects Ariana Grande from a person who ambushed her at the premiere. (TikTok: usersofiarose)\n\nHe posted a video of the incident on his account, with fans of Erivo and Grande calling for him to be arrested.\n\n\"There needs to be an action done against him as this is clearly a criminal offence,\" one user wrote, tagging the Singapore police in the comments section.\n\n\"After all the trauma Ari has been through, this is beyond disrespectful. Not just to her, but to the cast and to all the fans. It's literally infuriating. You should be ashamed,\" another wrote.\n\nPyjama Man's Instagram profile includes video of similar incidents at concerts. (TikTok: dinie_syahmi_)\n\nHe later posted a story saying, \"I'm free after being arrested.\"\n\nIn a message to US broadcaster NBC, he described himself as a \"mega fan\" of Grande.\n\nBut the broadcaster said he did not respond to their questions about the backlash to his actions.\n\nHis profile links to a crowdfunding page to help \"to pay off all my bills\", which has yet to receive a single donation.\n\nThe crowdfunding page lists his location as the inner-Sydney suburb of Haymarket.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/wallabies-team-announcement-ireland-test-match-dublin/106009408",
    "title": "Wallabies call in reinforcements to stem European slide in Dublin",
    "publish_date": "Fri, 14 Nov 2025 00:39:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Wallabies have recalled several big-name players for their penultimate Test of 2025, as coach Joe Schmidt returns to his old Irish stamping ground.\n\nAustralia will face world number three Ireland in Dublin on Sunday morning (AEDT), needing a win to revitalise its spring tour in Europe.\n\nHaving lost five of its last six Tests and following dismal defeats to England and Italy, Schmidt hopes James O'Connor, who orchestrated Australia's amazing win over the Springboks at Ellis Park, can \"refresh\" a battered-looking outfit at fly-half.\n\nWallabies out to avoid 67-year low After falling to England and Italy, the Wallabies are halfway towards becoming the first Australian tourists since 1958 to lose four straight Tests in Europe.\n\nLen Ikitau also returns to team up with Joseph Aukuso-Suaalii in the centres, and Max Jorgensen is fit again after tonsillitis to fire from fullback.\n\nJorgensen admitted the team wanted to repay Schmidt for what he has done for the game in Australia, after taking some stick following recent performances.\n\n\"Definitely. Joe's been great for us over these past two years and has really turned the team around from what it was,\" Jorgensen said.\n\n\"We can send him off on a high with these last two games [against Ireland and France], especially against Ireland, where he was coach. It's something we can definitely harness and put in a good shift for Joe.\"\n\nO'Connor looks key to any rejuvenation on Sunday at Lansdowne Road after ending his Moroccan holiday to take the reins in his first northern hemisphere Test for four years.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nBackrower Rob Valetini said the return of O'Connor to the squad was having a positive impact across the playing group.\n\n\"You see the experience he has, it gives you confidence you'll be able to use the ball well,\" Valetini said.\n\n\"That comes with experience. And you know how many games he's played at this level.\"\n\nIn the ever-revolving door of Wallaby fly-halves five different starting fly-halves have been employed this year — O'Connor comes in for Carter Gordon, who suffered quad tightness in the loss to Italy, with Schmidt not prepared to risk him in the 23.\n\nTane Edmed, who lost his place to Gordon after the England hammering, is again on the replacements bench.\n\nIn the front row, Allan Alaalatoa also returns, with Taniela Tupou rested after his \"decent workload\", but the added boost of fellow prop Angus Bell being fit to start.\n\nThere is a reshuffle with Tom Hooper shifting to lock alongside Jeremy Williams, while Valetini starts at blindside flanker to join familiar forces with Fraser McReight and skipper Harry Wilson in the back row.\n\nABC Sport will have a live blog of the Wallabies Test match against Ireland, with kick-off at 7:10am (AEDT) on Sunday, November 16.\n\nWallabies team vs Ireland\n\n1. Angus Bell, 2. Matt Faessler, 3. Allan Alaalatoa, 4. Jeremy Williams, 5. Tom Hooper, 6. Rob Valetini, 7. Fraser McReight, 8. Harry Wilson; 9. Jake Gordon, 10. James O'Connor, 11. Harry Potter, 12. Len Ikitau, 13. Joseph-Aukuso Suaalii, 14. Filipo Daugunu, 15. Max Jorgensen.\n\nReplacements: 16. Billy Pollard, 17. Tom Robertson, 18. Zane Nonggorr, 19. Nick Frost, 20. Carlo Tizzano, 21. Ryan Lonergan, 22. Tane Edmed, 23. Andrew Kellaway.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/monte-cristo-homestead-for-sale-in-junee/106004346",
    "title": "Buyers from across the country drawn to 140-year-old 'haunted' mansion",
    "publish_date": "Thu, 13 Nov 2025 23:58:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Perched on a hill overlooking the railway town of Junee in southern New South Wales, the Monte Cristo Homestead has long claimed to be Australia's most haunted house.\n\nFor the past 63 years, people have travelled from far and wide to visit the 140-year-old Victorian manor, drawn by whispers of ghostly encounters and chilling folklore.\n\nThe house is now on sale after the death of its former owner, with Junee Mayor Bob Callow saying its peculiar history was an attraction.\n\n\"People have said yes, they have experienced things here,\" he said.\n\n\"It has obviously drawn the attention of people with that sort of interest.\"\n\nOne of the bedrooms inside the Monte Cristo mansion in Junee. (ABC Riverina: Jostina Basta)\n\nCr Callow hopes any future buyers of the iconic house will honour its legacy.\n\n\"It would be hard for the town if someone came and just turned it into a house or an Airbnb,\" he said.\n\n\" To have it come back as a tourism venue would be the best outcome. \"\n\nThe Monte Cristo Homestead overlooks the railway town of Junee in southern New South Wales. (Supplied: Ray White Junee)\n\nFrom a slab hut to a mansion\n\nThe property started as a small slab hut, but Christopher Crawley and his wife Elizabeth turned the property into a Victorian-styled manor in 1885, where they raised their seven children.\n\nAt the time, the property was a testament to the couple's growing wealth and success, becoming a status symbol and one of the region's social centres, according to the homestead's official website.\n\nThe Crawleys hosted balls for the town's wealthy and powerful.\n\nBob Callow is hoping the next owners will breathe new life into the famous homestead. (ABC News: Rachel Holdsworth)\n\nCr Callow said the homestead was not the only legacy the Crawleys had left the town.\n\n\"They built the big Junee Hotel, they had a general store next door, and a theatrette,\" he said.\n\n\"They did a lot of things for the town itself.\"\n\nTragedy struck the family after Mr Crawley died of blood poisoning. Other family members also experienced untimely ends within the homestead's walls.\n\nGail Commens is the secretary of Junee's Roundhouse Railway Museum. (ABC News: Jostina Basta)\n\nGail Commens, from the town's Roundhouse Railway Museum, said as a local for more than 70 years, she had heard many different stories from visitors and tourists over the years.\n\n\"People swear and declare that they've seen things, they've heard things, they've felt something on their shoulder, like a hand,\" she said.\n\n\"It's what you believe, I guess.\"\n\nThe Monte Cristo homestead is fitted out with Victorian-era furniture. (Supplied: Ray White Junee)\n\nRestoring an almost-demolished property\n\nBy the time the late Reginald Ryan and his wife Olive purchased the 18-room property, it had been abandoned for more than a decade and on the brink of collapse.\n\nCr Callow said the couple did a lot of work to restore the home to its former glory, adding their own unique touch.\n\nAnd because Mr Ryan was a \"great storyteller\", he turned the property's history into a gripping tale.\n\n\"When they first picked it up, it was an absolute wreck … Reg rebuilt the place in such a way that it became an iconic part of the town and internationally known,\" Cr Callow said.\n\nDolls are the only current tenants in the homestead. (ABC News: Jostina Basta)\n\nThe couple turned the ramshackle mansion into a monument of the bygone Victorian era it was built in — both as an attraction and a home alongside their five children.\n\nVisitors could book ghost tours in the homestead, or if they dared, stay overnight to fully immerse themselves in its history.\n\nThe tour organisers claimed multiple ghosts haunted the house, including the ghost of Christopher Crawley.\n\nOne of the bedrooms in the Monte Cristo mansion with portraits on the wall. (ABC Riverina: Jostina Basta)\n\nVisitors have claimed to have had paranormal encounters, including objects moving on their own, figures visiting their bedrooms at night, ghostly apparitions and strange smells.\n\n'A pinnacle listing' with an uncertain future\n\nProperty manager Jason Barrett said it was not just the Monte Cristo's \"haunted\" reputation that was part of the appeal.\n\nAlongside the mannequins and dolls watching over visitors, whoever buys the house for the second time in its 140-year history will inherit its Victorian-styled decorative wallpaper, blood-red drapery curtains, quaint antiques and pink chandeliers.\n\nJason Barrett is a real estate agent at Ray White, Junee. (ABC News: Rachel Holdsworth)\n\nMr Barrett said the \"one of a kind\" listing had garnered lots of attention.\n\n\"I've been blown away by the interest … there's been enquiries from right across the country,\" he said.\n\nMrs Commens said it would be a \"shame for the whole town\" if the house lost its rich history because many people visited other attractions in Junee during their stay.\n\n\"Film crews came, people came all over the world to see it, and to see us ... you don't get a house like that everywhere,\" she said.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/what-is-this-asbestos-sand/106008884",
    "title": "What to do if you have recalled coloured sand product in your home",
    "publish_date": "Thu, 13 Nov 2025 23:06:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Several coloured educational sand products have been recalled after traces of asbestos were found in them.\n\nThe sand is sold at dozens of stores across Australia, including Woolworths and Officeworks, which have removed the products from their shelves.\n\nAs retailers work to remove the product, parents are being urged to dispose of any they have at home.\n\nHere's what you need to know.\n\nWhat is the product that was recalled?\n\nThe sand is brightly coloured and designed for play and educational purposes.\n\nThe products recalled are:\n\nA laboratory detected tremolite asbestos, a naturally occurring asbestos, in some samples.\n\nHow dangerous is tremolite asbestos?\n\nAsbestos is a prohibited substance in Australia because it is a highly carcinogenic mineral.\n\nInhalation of its fibres is associated with an increased incidence of a number of respiratory diseases, including asbestosis, mesothelioma, pleural and lung cancers.\n\nTremolite asbestos is a naturally occurring asbestos found in some rocks, sediments and soils throughout Australia.\n\nACCC deputy chair Catriona Lowe said the recall was a precautionary measure.\n\n\"What has been found is naturally occurring asbestos, in what's called fibre bundles,\" she said.\n\n\"Asbestos is a problem when it's inhaled and that means microscopic fibres.\n\n\"There isn't an indication that that is what we're dealing with here, however, it is an evolving situation and in an abundance of caution, the recall has been issued.\"\n\nWhat shops stock the sand?\n\nEighty-five stores around Australia have stocked the sand.\n\nOfficeworks has advised the ACCC it has already removed the product from its shelves.\n\nThe full list of stores is here:\n\nHow long has it been on shelves?\n\nAccording to the ACCC, the products were sold between 2020 and 2025.\n\nWhy are we only finding out about this now?\n\nIt is not yet clear why the testing was undertaken.\n\nIn a statement on its website, Officeworks said the asbestos was detected when it conducted analytical testing on Kadink sand supplies, which identified the presence of the asbestos fibres.\n\nHow is it being handled?\n\n\"We have engaged with Officeworks, who is a major supplier of these products, and they advised that the products have been removed from sale. We expect they will take all the necessary steps to alert their customers,\" ACCC deputy chair Catriona Lowe said.\n\n\"We continue to engage with suppliers and expect all to provide appropriate support to consumers, including responding to queries and providing advice about arranging a refund.\"\n\nThe ACT has taken the extraordinary step of closing 15 public schools today, with several others to be partially closed due to potential asbestos contamination.\n\nIn Brisbane's west, Mancel College has announced it will close its campus for the day \"effective immediately\" after finding the sand product at its junior and senior school.\n\nParents have been alerted to the use of the decorative sand as part of an after-school program run by Indooroopilly Outside School Hours Care (IOSHC).\n\nWhat should parents do?\n\nAnyone who has the sand in their homes is being urged to stop using it immediately and keep it out of reach of children.\n\nThe ACCC says it should not be put in general waste.\n\n\"We urge customers who own any of the products to stop using them immediately and place the sand in a heavy-duty plastic bag and double-tape it securely and keep it out of reach of children,\" Ms Lowe said.\n\n\"When doing so, in an abundance of caution, customers should take precautions such as wearing disposable gloves and a mask.\"\n\nYou can search for a local disposal facility for asbestos waste here.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/list-of-canberra-schools-closed-asbestos-coloured-sand/106009044",
    "title": "Canberra schools closed over asbestos risk; reopening update due Sunday",
    "publish_date": "Thu, 13 Nov 2025 22:57:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Fifteen public schools in Canberra are closed today and several others are partially closed due to potential asbestos exposure.\n\nThe risk relates to the use of a decorative coloured sand, which has been found this week to contain traces of chrysotile — a type of asbestos.\n\nEarlier this week, the Australian Competition and Consumer Commission (ACCC) issued a recall notice for Kadink Sand, Educational Colours Rainbow Sand and Creatistics Coloured Sand after laboratory testing detected asbestos.\n\nWhat to know about the coloured sand recall Fifteen public schools in Canberra are closed today and several others are partially closed due to potential asbestos contamination in coloured sand sold at dozens of stores across Australia. Here's what we know.\n\nACT Education Minister Yvette Berry spoke to reporters this morning. See how it unfolded live.\n\nMs Berry said Kadink Decorative Sand was used in some Canberra schools for sensory play and arts and craft.\n\n\"WorkSafe ACT have advised the risk of exposure to traces of chrysotile is low, however the safety of students, staff and families is our highest priority,\" Ms Berry said.\n\nThe ACCC issued a recall notice over colourful sand used in children's products. (Supplied: ACCC)\n\nTesting already underway\n\nMs Berry said the decision to shut schools was only made last night after a late meeting with the ACT Work Safety Commissioner and the Education Directorate.\n\n\"This is a low risk and I heard that firsthand from the WorkSafe Commissioner last night,\" she said.\n\n\"However, it is a type of asbestos fibre or dust and so we need to take it seriously and remediate it appropriately.\"\n\nYvette Berry says closing schools was a \"precautionary measure\". (ABC News: Monte Bovill)\n\nShe said testing had already started on the affected sites.\n\n\"So far, the testing is not showing that there are any airborne fibres or any issues like that,\" she said.\n\nWorkSafe notified last week\n\nACT Work Health and Safety Commissioner Jacqueline Agius said WorkSafe ACT had become aware of the potential asbestos risk late last week.\n\n\"That was an unverified test,\" she said.\n\n\"WorkSafe ACT seized some of the product from a premises in the ACT and had our own testing conducted.\n\n\"That testing came back on Wednesday. As soon as we were aware that the test showed a positive for chrysotile asbestos, we provided that information to the community.\"\n\nJacqueline Agius says \"tests are happening all over the country at the moment\". (ABC News: Monte Bovill)\n\nMs Agius said the Education Directorate was \"acting out of an abundance of caution\".\n\n\"Asbestos in sand is a naturally occurring substance because it comes from quartz and it's quite heavy so when asbestos is heavy then it's difficult to breath it in,\" she said.\n\n\" So that's why we say the risk is low. \"\n\nSand used in various settings\n\nEducation Directorate deputy director-general Angela Spence said schools had been using the sand for sensory activities in a variety of settings.\n\n\"It can be used as part of manipulative play materials. It can also be used to provide sensory support for young people as part of their regulation,\" she said.\n\n\"In terms of the location across a school setting, it can be used in trays, out on desks, it can be used in open-plan areas, in outside sensory areas as part of that particular support.\"\n\nAngela Spence says it was a \"significant\" operational effort to suddenly close the schools. (ABC News: Monte Bovill)\n\nMs Spence said the decision to close schools was not taken lightly and required a \"significant\" operational effort.\n\n\"In order to isolate the site and maintain business can often be challenging in a school-based environment,\" she said.\n\n\"We know that this is a disruption to the community and so when we do need to make those decisions, it is based on the information through our risk assessments that inform that.\"\n\nThe closures affect the following schools:\n\nWhole school closures:\n\nBlack Mountain School\n\nCampbell Primary School\n\nCharles Weston School\n\nCharnwood-Dunlop Primary School\n\nEvatt Primary School\n\nFlorey Primary School\n\nLatham Primary School\n\nLyons Early Childhood School\n\nMalkara School\n\nNamadgi School\n\nChapman Primary School\n\nCranleigh School\n\nMiles Franklin Primary School\n\nFraser Primary School\n\nWanniassa Hills Primary School\n\nPartial school closures impacting multiple cohorts:\n\nCharles Conder Primary School — Preschool and Small Group Program\n\nNorth Ainslie Primary School — Preschool and Year 1\n\nTorrens Primary School — Preschool, Kindergarten and Year 1\n\nWanniassa School — Preschool to Year 6\n\nYarralumla Primary School — Montessori, Kindergarten, Year 1, Small Group Program\n\nThrosby School – Kindergarten, Year 1 and Year 2\n\nAmaroo School – Small Group Program\n\nPreschool closures only:\n\nCurtin Primary School — Preschool\n\nKingsford Smith School — Preschool including Koori Preschool\n\nNarrabundah Early Childhood School — Preschool including Koori Preschool\n\nMount Rogers Preschool\n\nMonash Preschool\n\nDuffy Preschool\n\nTeddybears Childcare Centre\n\nBlack Mountain School is one of the schools closed in Canberra today. (ABC News: Monte Bovill)\n\nMs Berry said parents would be advised of the closures via email and text messages.\n\nShe also pointed parents to the ACT's education website, which is constantly being updated on the issue.\n\nParents of students impacted by the school closures should find out by Sunday afternoon if their school will reopen on Monday.\n\n\"We will be formalising communication through each of our schools of the impacted sites on Sunday afternoon,\" Ms Spence said.\n\n\" Should we be in a position to release information earlier we will do that because we know that the impact on families is pretty significant. \"\n\nWhy has the ACT closed so many schools?\n\nWhen asked why the ACT had closed so many schools compared to other jurisdictions, Ms Berry said it could be because the ACT's regulator was \"on the ball\".\n\nParents at Campbell Primary School were told to keep their children at home today. (ABC News: Monte Bovill)\n\n\"The information on WorkSafe equivalent sites across the country is very similar,\" she said.\n\n\"I think it was just that our WorkSafe Commission took the next step to do their own testing.\n\n\"We surveyed our schools to see how widespread it was and how much the sand was being used across our schools.\"\n\nOne school in Brisbane has been closed today, while a Queensland school has alerted parents of its use of the sand, though it remains open.",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/football-cristiano-ronaldo-red-card-elbow-portugal-vs-ireland/106008950",
    "title": "Swinging elbow earns Ronaldo first ever international red card",
    "publish_date": "Thu, 13 Nov 2025 22:31:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ireland stunned Portugal 2-0 on Friday (AEDT) to keep their narrow path to next year's World Cup open and make the Nations League winners wait to book an automatic spot on a night where their captain Cristiano Ronaldo was sent off.\n\nIreland, who have not qualified for a major tournament in a decade and last reached a World Cup in 2002, needed at least a draw to keep their qualification hopes alive and a first half Troy Parrott double capped their best performance in years.\n\nThey still need a win in Budapest on Sunday to claim a spot in next March's play-offs after second-placed Hungary won 1-0 in Armenia. A draw at home to bottom-placed Armenia is likely the most Portugal need to secure automatic qualification.\n\nBut they will have to do it without Ronaldo, whose initial yellow card for lashing out with an elbow to the back of Ireland defender Dara O'Shea was upgraded after review to his first-ever red card for Portugal in his 226th appearance.\n\nPortugal, who were moments away from securing their seventh successive World Cup appearance a month ago before a stoppage-time Hungarian equaliser in Lisbon, fell behind on 17 minutes after Liam Scales headed a fizzed-in corner back across goal, and Parrott could not miss.\n\nWell worth the lead, Ireland went inches from doubling it when Chiedozie Ogbene struck the post with a fine effort before in-form AZ Alkmaar striker Parrott found the bottom corner with a brilliant finish from a similar distance just before the break.\n\nIreland, who defended gallantly in the reverse fixture before going down to a late goal, did not require a repeat once Ronaldo received his marching orders on the hour, sarcastically clapping the delighted home fans as he departed.\n\nPortugal, who are assured at least a play-off spot, are two points clear of Hungary at the top of Group F with a superior goal difference. The Irish are one point further back.\n\nReuters",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/cricket-ben-stokes-reaction-six-wickets-ashes-warm-up-match/106008758",
    "title": "Stokes reactions tell full story of England's struggles in Ashes warm-up",
    "publish_date": "Thu, 13 Nov 2025 21:42:41 +0000",
    "category": "sports",
    "authors": [],
    "text": "Bowlers who take six wickets in an innings would usually class the outing as one of their best.\n\nIn the case of England skipper Ben Stokes, who took 6-52 against the England Lions in a tune-up match on Thursday, the performance is one he is likely to forget.\n\nStokes took the wickets of Tom Haines, Jacob Bethell, Jordan Cox, Rehan Ahmed, Will Jacks and Tom Lawes as the Lions amassed 382 off just 79.3 overs.\n\nThe tour match, England's sole outing prior to the first Test in Perth, was not televised, and as such, the truth about Stokes's six-wicket haul only came to light once England Cricket's X account began to release highlights of each wicket.\n\nStokes first removed Haines, the captain of the Lions, with a short delivery as the left-hander miscued a pull shot. The celebration was muted, as you'd expect given this is essentially an intra-squad match.\n\nNext up was Bethell, regarded by many as one of the most promising young batters in England.\n\nStokes came around the wicket and dug another one in short, Bethell pulled it away and like Haines, hit it straight to a fielder. This time, the Stokes reaction was brilliant, as he rested his head on one hand almost in embarrassment.\n\nThe theme continued for Stokes's next wicket as Cox was caught on the boundary pulling another short one from the England captain, before Ahmed fell in virtually identical fashion.\n\nStokes brought up his five-wicket haul with another short one on leg stump as Lawes was caught by Ollie Pope as he attempted to flick the ball away. Stokes again looked towards one of his fielders in sheer embarrassment.\n\nThe best reaction was left until the end as Stokes had Will Jacks caught on the boundary with another short one on the leg side after a well-made 84.\n\nAfter Jofra Archer took the catch, Stokes again sheepishly celebrated and extended his arms out as if to ask himself how he was getting all these wickets.\n\nThe bowling performance from England's vaunted pace attack against a second-string side is not going to inspire much confidence with the first Test just a week away.\n\nAll 10 wickets came via catches, with just two taken by wicketkeeper Jamie Smith.\n\nEngland speedster suffers hamstring injury in pre-Ashes tour match One of England's great bowling hopes for the summer cops a blow, as Mark Wood fails to finish the first day of a tour match.\n\nArcher, Gus Atkinson and Josh Tongue combined for three wickets despite bowling a combined 41.3 overs and conceded roughly four runs an over on a fairly lifeless Lilac Hill pitch.\n\nIn what is perhaps a nod to next week's playing XI, England played without a frontline spinner, as Joe Root was used as the spin option.\n\nRoot took one wicket, but was hammered at 8.35 runs an over in his 14 overs.\n\nIt remains to be seen whether the all-out pace attack's struggles, as well as Mark Wood's hamstring niggle, cause a rethink for England's brains trust.\n\nNevertheless, the half-trackers on leg stump approach is unlikely to have much success for Stokes and his men against Australia, even if the home side's batting line-up appears brittle.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/eliesa-katoa-concussion-surgery-sparks-calls-for-change/106005016",
    "title": "Neuroscientist calls for doctors at games following Katoa concussions",
    "publish_date": "Thu, 13 Nov 2025 21:26:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "One of Australia's leading concussion researchers has called on the NRL to strengthen its protocols to avoid players being concussed in warm-ups and then playing the match.\n\nEliesa Katoa was hospitalised and underwent brain surgery after suffering multiple blows to the head during Tonga's Pacific Championships match against New Zealand on November 2.\n\nKatoa suffered a brutal head knock in the warm-up but was allowed to play in the match, where he suffered two more head knocks.\n\nLoading...\n\nHe was in clear distress after suffering the third knock and subsequently had a seizure and later surgery for a brain bleed.\n\nHe remains in hospital in Auckland.\n\nThe NRL has reviewed the incident and interviewed relevant officials, but has said it would not release the findings until Katoa is out of hospital and in better health.\n\nNeuroscientist Alan Pearce, a professor at Swinburne University and a member of the Australian Sports Brain Bank team, said Katoa's incident should not have been allowed to happen.\n\nProfessor Pearce is an expert in chronic traumatic encephalopathy (CTE), a degenerative brain condition that can only be diagnosed after death, and said the initial impact head knock during the warm-up clearly showed he was concussed.\n\n\"He shouldn't have played,\" Professor Pearce said.\n\n\"It was really quite concerning about the intensity of that impact in the warm-up and the fact that he also went down and showed clear signs of concussion, which surprised me that he was then allowed to play.\"\n\nProfessor Pearce cited the Consensus Statement on Concussion in Sport, which lays out clear rules on what to do with a concussed player.\n\nIn response to Katoa's concerning incident, Professor Pearce said he hoped the NRL would strengthen its concussion protocols.\n\n\"I would like to see stronger protocols around not allowing the player to play the game, even if it's during the warm-up,\" he said.\n\n\"We know that warm-ups and training accidents occur, but we still have to have the same level of rigour that they would have in a game.\n\n\"To let a player continue on and start the game should just not happen.\n\n\"I hope the learning experience for the NRL is to change their policy around that or strengthen it up even more so that any concussion in a warm-up means no play.\"\n\nLoading...\n\nThe NRL has independent doctors monitoring all matches from the league's central bunker to ensure club doctors do not miss potential concussion incidents.\n\nBut those doctors are restricted to only watching the vision that is televised once the game begins.\n\nProfessor Pearce said the doctors should be located at the grounds where the matches are played.\n\n\"I would like to see that independent doctors actually come to the game at the same time so they can be there as part of the warm-up,\" he said.\n\n\"I'm sure there have been other incidents in the past, but not as high-profile as this.\n\n\"So, for an extra hour of an independent doctor's time — they would be renumerated for that time — so I can't see why it would be an issue that they only have to come on when the game starts.\n\n\"We shouldn't be talking about something like this in 2025, given that sport organisations like the NRL and AFL are putting athlete health front and centre and saying that the health and wellbeing of their players is the greatest priority — well, show it.\n\n\"This has been a terrible incident, and we don't want another one.\"\n\nThe NRL declined to comment on Professor Pearce's calls for changes before they released the findings of their review into Katoa's injury.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nProfessor Pearce is also calling on Australia's other major football code, the AFL, to change its in-game concussion protocols to have independent doctors monitoring games from the ground.\n\nThe league employs concussion \"spotters\" in its central AFL Review Centre (ARC) to watch for concussions and alert club doctors.\n\nA spokesman for the AFL told ABC Sport those concussion spotters were independent doctors.\n\nThe spokesman added doctors were better placed to monitor concussions in the ARC because of their access to multiple televisions and camera angles.\n\n\"Their role is to monitor the video, make real-time assessments and communicate directly with club doctors,\" the spokesman said.\n\n\"The AFL continues to invest in, and support, research into concussion, that work never ends.\"\n\nThe ABC understands that were an AFL or AFLW player concussed during a warm up, they would be subject to the normal concussion assessment.\n\nProfessor Pearce said all sporting codes had improved their concussion protocols, but added there was still work to do.\n\n\"We have made some real progress in this area, but it means that we still need to be vigilant, and we can't just sort of take things for granted anymore,\" he said.\n\n\"If this is happening at the professional level, what's happening at the community level?\n\n\"The game is played at a you know, much broader in the participation space, so we've got to be able to demonstrate at the elite level what the standard is in order for that community level to appreciate that this is a serious issue.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/edge-of-life-documentary-amazon-shaman-psychedelic-therapy/105995588",
    "title": "Near-death experience opens minds to a better way of dying",
    "publish_date": "Thu, 13 Nov 2025 21:18:33 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "When Edge of Life filmmaker and artist Lynette Wallworth was 11 years old, she had a near-death experience at her grandparents' house when she had a seizure and had to be resuscitated.\n\n\"I have always had an unusual relationship to death, because I technically died,\" Wallworth says, speaking at the Adelaide Film Festival.\n\nWhat: A breathtaking documentary about how ancient knowledge can help ease our way into death Directed by: Lynette Wallworth Starring: Muka Yawanawa, Margaret Ross, Justin Dwyer When: In cinemas November 13 Likely to make you feel: Like asking why so much of Western culture has shunned discussing the biggest deal we'll ever face\n\n\"It was a classic near-death experience. I left my body, saw it below me and travelled. I met relatives I didn't know, had an incredible sensation of the reality of where I was and an overwhelming sensation of compassion.\n\n\"Then I was back in my body.\"\n\nEven though Wallworth was raised Catholic, with its teachings of miracles, mysteries and an afterlife, she found that, not unlike Dorothy returning from Oz, adults dismissed everything she experienced.\n\n\"I tried to tell people, including my family doctor and the people doing brain scans on me, but I realised very quickly that I couldn't talk about these things,\" she says.\n\n\"There's no knowledge.\n\n\" The best way I can describe it is it's like everyone I knew had lived their whole lives on the surface of a lake, and one day I fell in. \"\n\nTrial and answer\n\nWhatever your beliefs (or not) about an afterlife, one thing we can probably all agree on is our desire to have as good a death as possible, one free from pain and fear.\n\nBut as Wallworth says, we have a very \"death-denying\" culture, where we're barely able to talk about the inevitable, let alone how best to manage it.\n\nThat includes a reluctance among medical practitioners, including those working in palliative care.\n\nEdge of Life introduces us to two such doctors who are open to new ways of approaching death: Margaret Ross and Justin Dwyer.\n\nLoading Instagram content\n\nWallworth read about the pair conducting an Australian-first trial, adopting the drug psilocybin to conduct psychedelic-assisted therapy that would ease the passing of terminally ill patients; an ancient practice revived in modern medicine that they say yields remarkable results.\n\nThe three-year trial, which studied 35 participants, showed rapid and sustained reductions in depression and anxiety, while improving overall quality of life.\n\nResearchers say more work still needs to be done to deliver this type of therapy more broadly.\n\nWallworth felt she had something to offer Ross and Dwyer.\n\nHer eye-opening experience as a young woman led her to walk other pathways, particularly those traced by First Nations cultures.\n\nShe met Yawanawá shaman Tashka, from the State of Acre in the Brazilian Amazon, at the Sundance Film Festival.\n\nThat led Wallworth to create the Emmy Award-winning virtual reality (VR) film Awavena, centred on the gender-norm smashing journey of Hushahu, the first woman to become a Yawanawá shaman.\n\nLynette Wallworth met with Yawanawá shaman Tashka, who taught her his his culture's approach to death. (Supplied: Kismet)\n\nThe Yawanawá people embrace death as the next step on our journey, using psychoactive drink ayahuasca to help ease the way.\n\n\"I wanted to show, in Edge of Life, that this fear of death is not universal,\" Wallworth says.\n\n\"There are cultural differences.\"\n\nSaying goodbye better\n\nWallworth reached out to Ross and Dwyer just before COVID shook the world, requiring us all to think more keenly about death.\n\n\"I knew every subject was only allowed two experiences of psilocybin, so I thought this VR tool might be helpful for them to extend that,\" Wallworth says.\n\nAs parts of Australia were plunged into rolling lockdowns, the technology came into its own.\n\n\"I was having Zoom calls with Marg and Justin covered in PPE [personal protective equipment], exhausted from being with people who were dying alone because their families were not allowed to visit,\" Wallworth recalls.\n\n\"Nurses were holding up iPads in front of their faces so their families could say goodbye. And I said, 'We can do better than this'.\"\n\nSo, Wallworth sent her VR kit to families who would place the camera where their missing relative would normally sit.\n\n\"Someone would play the piano or read a book, and the dog would be at their feet,\" Wallworth says.\n\n\"We would upload that to the person in the hospital via a headset, so [virtually] they were back where they belonged.\"\n\nBut it wasn't just about mimicking their home.\n\nThe Yawanawá people first agreed to work with Wallsworth on Awavena because the VR technology also aligns with their experience of vision states that help ease the way for dying people.\n\nRos took part in the psilocybin trial in an attempt to deal with anxiety around her cancer diagnosis. (Supplied: Kismet)\n\nThe VR set-up could help the doctors re-create the calming effect of psilocybin stimulation through simulation .\n\nThrough this remarkable partnership, Wallworth, Ross and Dwyer became fast friends.\n\nWhen the pandemic subsided, she convinced them to accompany her to the Amazon, to learn from Edge of Life co-writer Tashka and his fellow shaman, Muka.\n\n\"I didn't understand how they could be using an ancient medicine, even in this synthesised form, and not be speaking to the knowledge holders who have used it for so long,\" Wallworth says.\n\n\"As Marg says in the film, 'I don't have the language for this'.\"\n\nA generous gift\n\nWatching Ross and Dwyer's minds open in Edge of Life is remarkable, as is the peace the treatment brings to many of their patients, who share their stories in the luminous documentary.\n\n\"Justin ends up saying, 'We're like babies',\" Wallworth says.\n\n\"And honestly, I really think we could do with more humility in Western culture. We have lost a lot of capacity and are on a trajectory to move even further away from the contemplative state.\"\n\nMuka speaks beautifully on the subject.\n\n\"There are many different possibilities of us understanding death, between the white man's view and Indigenous peoples,\" he says.\n\n\" Naturally, I don't want to die either. I would like to live forever and have so many stories. But we must understand and accept it. \"\n\nMuka encouraged the doctors to embrace acceptance.\n\n\"For me, this connection was like bringing light into shadow,\" Muka says.\n\nLoading...\n\nThe Yawanawá share this wisdom freely, despite the terrible history of colonialism that has ravaged their lands and forcibly obscured their culture.\n\n\"Participating in this film strengthens the work we have done, which is asking that the original people must be respected,\" Muka says.\n\n\"When Lynette opened her heart with Tashka, and when they offered us this opportunity, I told myself, 'I'm going to take my values to the world'.\n\n\"I hope that this film may be like seeds planted in everyone's heart.\"\n\nEdge of Life is in cinemas now.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/bbc-apologises-donald-trump-over-edit-rejects-compensation-claim/106008794",
    "title": "BBC apologises to Trump, but rejects compensation demands",
    "publish_date": "Thu, 13 Nov 2025 21:11:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "The BBC has apologised to US President Donald Trump for a Panorama episode that spliced together parts of a speech he gave on January 6, 2021, but rejected his demands for compensation.\n\nThe corporation also said it would not show the programme again.\n\nLawyers for Mr Trump threatened to sue the BBC for $US1 billion ($1.5 billion) in damages unless the corporation issued a retraction, apologised and compensated him.\n\nThe BBC's legal team has responded to Mr Trump's lawyers and its chair, Samir Shah, has personally written to the US president to apologise.\n\n\"We accept that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action,\" the BBC wrote in a retraction.\n\nDonald Trump's lawyers have threatened to sue the BBC for $US1 billion over the edit of a \"salacious\" documentary. (Reuters: Jonathan Ernst)\n\nThe BBC has reported Mr Shah's letter to the White House made it clear to the US president that \"he and the corporation are sorry for the edit of the president's speech on 6 January 2021\".\n\n\"While the BBC sincerely regrets the manner in which the video clip was edited, we strongly disagree there is a basis for a defamation claim,\" a BBC spokesperson said to the broadcaster.\n\nThe apology comes after a second similarly edited clip, broadcast on Newsnight in 2022, was revealed by the Daily Telegraph.\n\nThe fallout from the scandal led to the resignations of BBC director general Tim Davie and head of news Deborah Turness.\n\nThe dispute was started by an edition of the BBC's flagship current affairs series Panorama, titled \"Trump: A Second Chance?\" and broadcast days before the 2024 US presidential election.\n\nThe criticism surrounds the BBC's edit of a speech Donald Trump delivered before protesters attacked the US Capitol on January 6, 2021. (Reuters: Leah Millis)\n\nThe third-party production company that made the film joined three quotes from two sections of the 2021 speech, delivered almost an hour apart, into what appeared to be one quote of Mr Trump urging supporters to march with him to the US Capitol and \"fight like hell\".\n\nAmong the parts cut was a section in which Mr Trump said he wanted supporters to demonstrate peacefully.\n\nMr Davie and Ms Turness resigned on Sunday, local time, saying the scandal was damaging the BBC.\n\nMr Trump, a frequent critic of media outlets that interrogate his administration and personal affairs, described the BBC as \"a terrible thing for democracy\" and accused it of having \"corrupt journalists\".\n\nThe letter from Mr Trump's lawyer demanded an apology to the president and a \"full and fair\" retraction of the documentary along with other \"false, defamatory, disparaging, misleading or inflammatory statements\" about him.\n\nIt also said the US president should be \"appropriately\" compensated for \"overwhelming financial and reputational harm\".\n\nLegal experts have said that Mr Trump would face challenges taking the case to court, but could use the mistake to try leverage a payout.\n\nTim Davie conceded the edit in the Panorama program was \"misleading\". (Reuters: Hannah McKay)\n\nPressure on the broadcaster's top executives has been growing since The Daily Telegraph newspaper in the UK published parts of a dossier compiled by Michael Prescott who had been hired to advise the BBC on standards and guidelines.\n\nAs well as the Trump edit, the dossier criticised the BBC's coverage of transgender issues and raised concerns of anti-Israeli bias in the BBC's Arabic service.\n\nThe BBC faces greater scrutiny than other broadcasters — and criticism from its commercial rivals — because of its status as a national institution funded through an annual licence fee of $354 paid by all households with a television.\n\nABC/AP",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-14/matildas-star-kyra-cooney-cross-nominated-for-marta-award/106008738",
    "title": "Matildas star up for goal of the year award after long-range stunner",
    "publish_date": "Thu, 13 Nov 2025 21:00:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "Kyra Cooney-Cross has been shortlisted to win the Marta award for the best goal scored by a female player last season — but the Matildas ace will first have to beat the Brazilian superstar after whom the FIFA honour is named.\n\nArsenal midfielder Cooney-Cross marked her 50th appearance for her country with the most stunning of long-range efforts that set the Matildas on their way to a 2-1 win over Germany in Duisburg, their first win over the European powerhouse in 19 years.\n\nThe goal, scored in October 2024 in a prestige friendly, came against the run of play just before half-time when Cooney-Cross spotted the German keeper off her line and struck a stunning shot from more than 40 yards.\n\nBut the 23-year-old rising star of the Champions League-winning Gunners may have her work cut out to win the accolade, especially as the great Marta, one of the greatest players in history, has also been nominated.\n\nThe Brazilian superstar, now 39, has been nominated for a US National Women's Soccer League match when, typically, she got on to the ball in the centre circle for Orlando Pride, then sprinted and dribbled past two Kansas City Current defenders before rounding the goalkeeper and slotting into an empty net.\n\nMarta also won the award in its inaugural year in 2024 with another startling effort against Jamaica for Brazil.\n\nOthers in contention include Ally Sentnor's swerving shot for the United States against Colombia at the SheBelieves Cup, and Dutch superstar Vivianne Miedema's floated shot for the Netherlands against Wales at the European Championships.\n\nThe shortlist for the FIFA Puskas award for best men's goal of the season features a special from Barcelona teenager Lamine Yamal, who scored a beauty against Espanyol in May — a curling left-foot shot after running across the defence from the right wing.\n\nThe list also includes the stunning Declan Rice free-kick for Arsenal against Real Madrid in the Champions League quarterfinals, and the solo effort from the halfway line from Lucas Ribeiro for South African side Mamelodi Sundowns against Germany's Borussia Dortmund at the Club World Cup.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/AP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/goodfood/tips-and-advice/the-one-thing-that-can-ruin-your-most-prized-bottle-of-wine-20251114-p5nfh4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The one thing that can ruin your most prized bottle of wine",
    "publish_date": "Fri, 14 Nov 2025 12:59:18 +1100",
    "category": "finance",
    "authors": [
      "Huon Hooke"
    ],
    "text": "Bottle variation is a reality, but it’s misnamed. Our impression of wine varies according to what else is going on around us.\n\nBottle variation is a reality, but it’s misnamed: it’s actually cork variation since each one is different and, consequently, admits different volumes of air. This, of course, affects the way a wine develops over time. Also important is our own variation. Let’s call it “occasion variation”, an expression I first heard used by Robin Day, the perceptive former chief winemaker at Orlando Wines in the Barossa. What he meant is that our impression of a wine varies according to what else is going on: what we’re eating, the ambience of the space we’re in, the company we’re keeping and many other external influences.\n\nLet’s start with ambience. This includes noise level, the smells emanating from the kitchen, the food on our plates, the scent of the person next to us at the table and whether we’re sitting comfortably. Our palates also vary with our mood and health: whether we’re feeling as fit as a Mallee bull or not quite 100 per cent; whether we’re feeling happy or sad. And our dining companions. Who hasn’t been at a table when somebody with a loud and confident voice raves about a wine and excites the entire group? Or the reverse: someone bad-mouths a wine, which causes everyone else to either dislike it or modify their opinion downwards? This sort of crowd opinion-influencing is very common. Even among professionals, sadly.\n\nIt has to be said, however, that the ’86 Grange is a very good vintage.\n\nGot a drinks question for Huon Hooke? thefullbottle@goodweekend.com.au",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-ley-avoids-leadership-challenge-formally-dumps-net-zero-target-fishing-boats-at-centre-of-controversial-border-force-operation-20251114-p5nfd7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Ley avoids leadership challenge, formally dumps net zero target; Fishing boats at centre of controversial Border Force operation",
    "publish_date": "Fri, 14 Nov 2025 12:51:54 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "A small special-needs school in Brisbane’s western suburbs has closed its campus for the day, effective immediately, after finding some of the recalled sand product on site.\n\n“We have reviewed the guidance published by the ACCC regarding a recall notice of a coloured sand used in sensory play activities,” Mancel College in Fig Tree Pocket said on social media.\n\n“We have some of the product on site at Mancel College and it has been used in some of the Junior School and we have now found some in the Senior School.”\n\n“While the advice is low risk and there are only minor traces, we are acting with an abundance of caution. We are therefore advising parents that with immediate effect we are closing the entire College today.”",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/the-best-christmas-gifts-from-7-to-100-for-2025-20251027-p5n5n9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The best Christmas gifts from $7 to $100 for 2025",
    "publish_date": "Fri, 14 Nov 2025 12:35:05 +1100",
    "category": "lifestyle",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "Nice Pickles Pickled Pineapple If they love a Hawaiian pizza, then they’ll love this jar of pickled pineapple ($15). Made in South Australia by self-professed “pickle nerds” Nice Pickles, they’re brined with mint, jalapeño and ginger, making the perfect sweet, sour and tangy addition to toasties, salsa, pizza or even avocado toast. Muji Soft Slippers\n\nThe Hultafors Fire Steel Flint ($25) is a great little tool for the habitual camper. Made from ultra-thick steel and designed for ergonomic use, both ends of the steel can be struck and it can be used in all weather conditions. Mesa Collections Fish Lemon Squeezer For the citrus lover in your life, consider this cute fish lemon squeezer ($20) from Mesa Collections. It’s a handy kitchen aide to have on hand – whether it’s juicing 10 lemons for a pitcher of lemonade or adding a final touch to a whole-baked fish – and looks pretty sitting on a kitchen shelf when not in use.\n\nThe best Christmas gifts under $50 Sabre Paris Bistrot Tortoise Tomato Knife, from Some Design Store With summer’s bounty of delicious tomatoes coming in hot, they’ll need a good knife to slice and dice them for salads and sandwiches. This Bistrot Tortoise Tomato Knife from Sabre Paris ($49), with a sharp serrated blade for slicing tomatoes cleanly without releasing all their juices, is a stylish option at the upper end of the price range. Other more affordable options include this one from Victorinox ($15) or this stainless steel one from Wiltshire ($16).\n\nStudio Roof Dutch Masters Bouquet A nice gift for someone who’s recently moved into a new home, Studio Roof’s Dutch Masters Bouquet ($40) are pretty flowers they won’t be able to kill. Printed on recycled cardboard with vegetable ink, this option is inspired by the traditional realism of painters like Rembrandt and Vermeer – but the range includes styles to suit any taste, from Monet to Van Gogh. Karst Goods Studio Muse Notebook\n\nKarst Goods’ notebooks are a great option for the accident-prone doodler or adventurer in your life. Their Studio Muse Notebook ($45) comes in a range of bold and graphic cover designs. Its clever paper, made from recycled stone, is waterproof and tear resistant and thread-bound to lay completely flat for comfortable note-taking. Produce Pod If you have someone in your life that loves a farmer’s market, Produce Pod’s Veggie Bags ($47) are a practical gift. Made with an inner cotton layer that retains moisture and a breathable outer later, they’re designed to extend the life of fruit and veggies. As a bonus, they can be thrown in the washing machine for easy cleaning. Stitched Up Embroidery Kits\n\nFor the person looking to take up a new hobby this Christmas, these embroidery kits from Australian brand Stitched Up, owned by two sisters, are a nice option. This mini lobster kit ($50), is perfect for food lovers, but the brand also sells larger sizes ($60) including this handsome Kookaburra. Kits are beginner-friendly and come with step-by-step printed instructions as well as video tutorials. Bon Lux Scallop Wheat Bag These wheat bags from Bon Lux ($40) are great for soothing cramps, sore muscles or for keeping warm come winter. Made from soft and durable linen and filled with Australian wheat and dried flowers, just put them in the microwave and heat as needed.\n\nLittle Tin Co Original Mixed 3-Pack If they love fish or have just returned from a holiday in Portugal and want to continue their tinned fish obsession, consider this Original Mixed Pack ($48) from Little Tin Co., which uses sustainably sourced seafood products using local Australian ingredients. This three pack is a nice little taster, with Port Lincoln sardines, smokey mussels and kingfish pate, but they also sell individual tins. The best Christmas gifts under $75\n\nPiecework Hors D’Ouevre Coasters For the habitual entertainer in your life, these Hors D’Ouevre Coasters from Piecework ($70) will make a fun and playful addition to their dining table. Sold as a set of four – including an oyster, olive, slice of brie and tin of sardines – they are made from soft linen (for soaking up condensation) and embroidered with cotton. Variety Hour “I Love Carbs” Cap\n\nIf bread, pasta or rice is their primary food group (and isn’t that all of us?), then they’ll love this slogan baseball cap. The “I Love Carbs” Cap from Variety Hour ($70) lets them wear their food philosophy on their sleeve (or head). It’s unisex with an adjustable back, embroidered in Melbourne and comes in this cobalt blue or a soft butter yellow. Home Lab Chilli Icon Glass Set of Four Perfect for the spice-lover in your life, these sweet Chilli Icon Glass Tumblers ($72 for a set of four) from Home Lab are perfect for serving spicy margaritas, gin and tonics or just plain old water. They come packaged in a nice gift box too for those who don’t have time for wrapping. Water and Wines Australia Wine Puzzle\n\nThis Australian Wine Puzzle ($75) from Water and Wine is a fun and hands-on gift for the aspiring sommelier in your life. Featuring colourful illustrations of Australia’s over 60 wine regions, flora, fauna and landmarks, each puzzle also comes with grape profiles and food-pairing tips. If wine isn’t their speed, Water and Wine also has puzzles for whisky, coffee and beer lovers. Toast Contrast Rim Enamel Oven Dish This enamel oven dish ($70) from Toast is a hardy kitchen workhorse and lovely gift for the busy home cook or person building out their kitchen tool kit. The contrasting blue and mahogany tones are an unusual twist on the classic blue and white enamelware, and makes an attractive serving dish straight from the oven.\n\nSanta Maria Novella Scented Wax Tablets For the person who is always impeccably dressed and appreciates the finer things in life, Italian apothecary Santa Maria Novella’s Scented Wax Tablets ($59) are a small indulgence to add a soft scent to their wardrobe. Available in a range of fragrances, tablets can be hung from wardrobe railings, nestled in the linen cupboard or packed in suitcases while travelling. The best Christmas gifts under $100\n\nSlip Zodiac Sleep Mask If they take their shut-eye seriously and also happen to be an obsessive reader of their horoscope each week, consider this sleep mask from Slip ($80). Made from pure silk, their Zodiac collection features fun and attractive designs tailored to each star sign. Green Life Table Top BBQ Grill\n\nThis Table Top Grill ($99) from Japanese brand Green Life is a great compact alternative to a Hibachi grill and ideal for kitchens large and small or taking on picnics or camping trips. Made in Niigata, Japan from a lightweight stainless steel, just add charcoal and grill yakitori, veggies, seafood. Nunu Avo Egg Cup and Bowl Smashed avo takes on a slightly different meaning with Nunu’s Avo Egg and Cup Bowl ($80). Made from hand blown glass, they can be used for eggs, as salt pinch pots or even as trinket holders. Just treat them with care and they’ll never be past their use-by date. The Strong Band Trio Set\n\nMost fitness junkies will have a resistance band or two in their arsenal. Australian personal trainers Matt and Cy noticed that traditional resistance bands lacked markers to help users track progress. Their new brand, Strong Band, makes resistance bands with measurements to fill this gap. Their trio set ($80) is a good starter kit for beginners or all-purpose base for strength training, stretching and mobility exercises. If you’re working with a smaller budget, their individual bands start at $25. Pluto Gin For the person who enjoys a good gin and tonic, South Australian distiller Pluto’s classic gin ($78), is a certified organic London dry style with delicious notes of juniper, citrus, coriander and pepper. The award-winning bottle is the perfect gift for the gin-lover with a discerning palate.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-for-heavy-losses-as-wall-street-weakens-20251114-p5nfd2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX hit hard after Wall Street tumbles; Gold miners dive",
    "publish_date": "Fri, 14 Nov 2025 12:24:11 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket is deep in the red at lunchtime after Wall Street sank to its second-worst day since April overnight amid questions over whether AI stocks are overvalued and whether the eagerly anticipated cuts to US interest rates will actually happen.\n\nThe S&P/ASX 200 was down 140.2 points, or 1.6 per cent, in early trade, with all 11 industry sectors in negative territory, led by technology and materials.\n\nThe ASX fell sharply on Friday morning. Credit: Louie Douvis\n\nFinancial stocks were punished and the big four banks are all sharply lower. ANZ Bank led the way with a 4 per cent drop while Commonwealth Bank (down 1.7 per cent), NAB (down 1.7 per cent), and Westpac (down 1.6 per cent) are also sharply lower.\n\nMining stocks lost ground, with gold miners heavily hit. Northern Star (down 3.2 per cent) Newmont (down 3.3 per cent) and Evolution Mining (down 3.3 per cent) plunged in early trade. Among the iron ore giants, Rio Tinto shed 2 per cent, Fortescue lost 1.8 per cent and BHP was down 2 per cent.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-queensland-resident-with-measles-attended-oasis-sydney-concert-storms-forecast-for-brisbane-20251113-p5nf26.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Asbestos-laced coloured sand used in Brisbane school; Gold Coast teen accused of terrorism offences; Queensland resident with measles attended Oasis concert",
    "publish_date": "Fri, 14 Nov 2025 12:23:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Mancel College in Fig Tree Pocket has closed its campus for the day, effective immediately, after discovering a toy used on campus might contain asbestos.\n\nKadink Sand, Educational Colours Rainbow Sand, and Creatistics Coloured Sand has been recalled nationally for containing asbestos.\n\nLoading\n\n“We have reviewed the guidance published by the ACCC regarding a recall notice of a coloured sand used in sensory play activities,” the school said on social media.\n\n“We have some of the product on site at Mancel College and it has been used in some of the Junior School and we have now found some in the Senior School.\n\n“While the advice is low risk and there are only minor traces, we are acting with an abundance of caution.\n\n“We are therefore advising parents that with immediate effect we are closing the entire College today.”\n\nMancel College is a special school with almost180 students enrolled at present.\n\nShortly after 11am, no additional schools had closed or reported finding the contaminated toy, although governing bodies were still performing checks across the Brisbane region.\n\nThere are more than 300 schools in the Brisbane City Council area.",
    "source": "SMH",
    "cluster_id": 1
  },
  {
    "url": "https://www.smh.com.au/business/consumer-affairs/sold-out-by-mid-november-the-black-friday-shopping-rules-are-shifting-again-20251027-p5n5o9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sold out by mid-November: The Black Friday shopping rules are shifting – again",
    "publish_date": "Fri, 14 Nov 2025 11:53:23 +1100",
    "category": "finance",
    "authors": [
      "Jessica Yun"
    ],
    "text": "But as shoppers hunt for bargains, the consumer watchdog is hunting for deceptive advertising – and scammers are hoping to exploit click-happy customers. Here’s what you should know about Black Friday this year, and what to watch out for. Black Friday FOMO is real: Moving earlier can pay off Most retailers are now flogging deals well before November 28, earning the shopping phenomenon the nickname “Black November”. “This year, the party has started even sooner. Amazon lit the fuse, launching its Prime Big Deal Days, and it was quickly followed by leading names like Myer, David Jones and Target - all before mid-October,” said Shippit joint CEO Rob Hango-Zada.\n\nFor the month, luggage brand July’s sales are 220 per cent higher than usual. “We wanted those cases, obviously, to last through Black Friday and the busy period, and we will be restocking, but not until December,” said Pitman. Meanwhile, customer demands for lower prices, rapid delivery and seamless service are higher than ever, thanks in part to ultra-cheap ecommerce giants Shein and Temu’s low prices and Amazon’s same-day and next-day delivery times. Gen Z, in particular, have grown up with expectations of infinite choice on demand, and those who meet the expectations of this demographic – which will be the largest retail spenders by 2030 – will find success, Hango-Zada believes. “They’ve learned that they can buy a $12 outfit at midnight and have it on their doorstep the next day delivered free of charge. The implication here is that they expect that same level of convenience everywhere else,” said the ecommerce executive. “Often, the difference between the retailers that are bustling and those that are struggling is the extent to which they understand - and meet the needs of - Gen Z shoppers.”\n\nGeo-targeted ads: Promos are getting up close and personal July luggage made a point of sending more personalised, targeted ads to encourage customers to shop in-store instead of online. Why? People interact with the physical product, interact with store staff, encounter other items – like handbags or accessories – that they weren’t planning to purchase. July encourages customers to shop in person, where people tend to buy more than they do online. “What we see is a real opportunity to upsell customers,” said Pitman.\n\nCustomers tend to spend more when they come into physical stores and can touch and feel the range of products, she confirmed. “It helps to see it in real life and test out if that bag sits on that suitcase well.” Loading Meanwhile, some businesses have ditched sitewide sales to get customers to shop with them more than once through the sales season. For example, specialty sportswear store Pace Athletic has run daily November deals to keep customers coming back. “Many brands have introduced early targeted offers and have been rotating these to encourage multiple purchase occasions,” said Carla Penn-Kahn, the chief of ecommerce software platform ProfitPeak. “This is a smart strategy, by driving repeat purchases within a short period, brands can build customer lifetime value more quickly and make their customer acquisition costs more efficient.”\n\nSmall businesses are under pressure – and opting out Markdowns are great news for consumers – but more than six in 10 small business owners report feeling pressured by the period of promotions driven predominantly by global and larger retailers. Just 39 per cent of 500 small business owners surveyed by Xero say they plan to hold Black Friday sales this year, down from 50 per cent last year, while 30 per cent say they can’t afford to offer discounts. “If you’re a smaller business, that discount is directly an impact on your bottom line, and you don’t have the benefit of being a larger business with purchasing power,” said Xero ANZ managing director Angad Soin. “There’s a day-to-day cash flow reality that large businesses don’t always have to feel, or don’t always feel as acutely as small businesses do.”\n\n‘Sitewide sale’, ‘everything 20% off’: The ACCC is watching Loading Jewellery chain Michael Hill, Webjet, MyHouse, and Hairhouse Online were some of the businesses found afoul of the law in the Australian Competition and Consumer Commission’s Black Friday blitz last year – and penalised for it. For example, Michael Hill held a “25 per cent sitewide” sale that actually excluded some products, while Webjet’s advertised airfares “from $18″ that were actually three times as much by checkout after the addition of compulsory fees that were not disclosed. “We expect the ACCC to go a step further this year,” said law firm Holding Redlich special counsel Emily Booth.\n\nSweeping “sitewide” claims, was/now pricing that lacked genuine previous sale history, and “up to X% per cent off” claims that only apply to a selection of products will be in the ACCC’s sights this year, Booth said. So will bait-and-switch tactics, like advertising pictures of clothing with a certain price tag, but finding that that item is not actually sold for the advertised price. “Consumers prefer to know that everything is 20 per cent off rather than hunt through to find what is 40 per cent off.” Most retailers are now flogging deals well before November 28, earning the shopping phenomenon the nickname “Black November”. Credit: Simon Schluter If you spot a dodgy deal, the consumer cop on the beat is asking citizens to report them – and bring receipts. “We are putting retailers on notice,” said ACCC deputy chair Catriona Lowe, who said customers waiting for a Black Friday deal should make a note of prices now so they can check they’re making a legitimate saving.\n\n“Consumers shopping during the Black Friday sales are encouraged to report promotions or ads that raise concerns to the ACCC, including images of the potential misconduct.” Scammers are lurking The shopping frenzy is fertile ground for scammers, who will fabricate fake websites, sponsored social media posts and ads to cloned websites that will collect your payment data. “In Australia, we’re seeing a rise in scam emails (which began to peak around November 5) and social media ads impersonating major brands and even luxury retailers,” said cybersecurity software Bitdefender security analyst Alina Bizga. Scammers will exploit shoppers’ sense of urgency and trick them into acting quickly without verifying the deal’s legitimacy. “Australians can also expect a wave of fake delivery notifications and smishing texts as November 28 approaches,” said Bizga.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/the-cautionary-tale-of-duchess-meghan-the-kardashians-and-the-missing-poppy-20251113-p5nfat.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The cautionary tale of Duchess Meghan, the Kardashians and the missing poppy",
    "publish_date": "Fri, 14 Nov 2025 11:30:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Just so we’re clear from the off, the Duchess of Sussex is a chancer, a phony and insufferably earnest in my book. I think she believed she could modernise the monarchy by guest editing Vogue, I think she’d be a whinger when camping and I think she’ll leave Harry within the decade.\n\nBut. For the zillionth time I find myself wondering how this woman can get a break. Especially in a world where powerful men are doing things which are evil, and her latest “crime” is leaving the house without a certain accessory.\n\nPrince Harry and Meghan, the Duchess of Sussex, with Serena Williams at the Baby2Baby Gala before Kris Jenner’s 70th birthday. Credit: Getty Images for Baby2Baby\n\nThe global headlines over Meghan not wearing a Remembrance Day poppy at Kris Jenner’s 70th would make you think she’d vandalised the Cenotaph in London. “Disrespectful.” “Pathetic.” “Shameful.” She really copped it.\n\nYes, her husband Harry wore a poppy – because he’s a veteran. The poppy means something to him. It’s his story.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/environment/climate-change/monash-ends-lucrative-partnership-with-fossil-fuel-giant-woodside-20251113-p5nf49.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Monash ends lucrative partnership with fossil fuel giant Woodside",
    "publish_date": "Fri, 14 Nov 2025 11:27:58 +1100",
    "category": "finance",
    "authors": [
      "Bianca Hall"
    ],
    "text": "Monash University has ended a $43 million partnership with Woodside Energy, seeking to remove any “ambiguity” about its relationship with the fossil fuel giant.\n\nThe university’s philanthropic partnership – which included naming rights over a building at its Clayton campus – had been the source of sustained criticism by staff and students.\n\nThe Woodside Building for Technology and Design at Monash University. Credit:\n\nThe multi-award winning Woodside Building for Technology and Design will now again be known as Building 94, until a new name is selected.\n\nThe announcement draws a spotlight on the growing tendency for fossil fuel companies to seek partnerships with organisations including universities.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/i-hated-the-sport-the-incredible-turnaround-that-delivered-de-minaur-a-career-defining-win-20251114-p5nfg1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I hated the sport’: The incredible turnaround that delivered de Minaur a career-defining win",
    "publish_date": "Fri, 14 Nov 2025 11:05:05 +1100",
    "category": "sports",
    "authors": [],
    "text": "Alex de Minaur has shown extraordinary resilience to bounce back from the depths of misery and book an “incredible” place in the last four of the ATP Finals in Turin.\n\nThe Australian No.1, a picture of despair just a couple of nights earlier after feeling he’d thrown away victory during defeat to Lorenzo Musetti, started his unlikely resurrection with a backs-to-the-wall 7-6 (7-3) 6-3 win over Taylor Fritz on Thursday, his first victory at the season-ending championship.\n\nThen after achieving the two-sets-to-nil triumph - the only way he could stay in the tournament - de Minaur owed a huge vote of thanks to Carlos Alcaraz, who sealed the end-of-season world No.1 ranking by beating home favourite Musetti 6-4 6-1.\n\n“I mean, sport,” de Minaur smiled, even before the Alcaraz match. “Couple of days ago was one of the toughest days I’ve had in my career. I was in a very, very dark spot.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/why-penrith-are-the-biggest-losers-with-the-2026-nrl-draw-20251113-p5nfc3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Penrith are the biggest losers with the 2026 NRL draw",
    "publish_date": "Fri, 14 Nov 2025 11:01:08 +1100",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Nathan Cleary will need to be at his magical best if Penrith are any hope of overcoming a nightmare 2026 schedule.\n\nThe NRL released its draw for next season on Friday, and it is not good news for the Panthers and their supporters.\n\nLast year’s preliminary finalists face a gruelling first six weeks with games against premiers the Broncos in Brisbane, followed by Cronulla, the Roosters, Parramatta, Melbourne, and the Bulldogs.\n\nThe Panthers then travel to Darwin in round seven for a clash against the Dolphins.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/culture/art-and-design/this-artist-is-a-celebrated-disruptor-but-does-her-latest-project-go-too-far-20251028-p5n5yc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This artist is a celebrated disruptor. But does her latest project go too far?",
    "publish_date": "Fri, 14 Nov 2025 11:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Loading The final designs, Hendry said, were finessed over a four-month-long exchange with her manufacturers, where they went through 35 “iterations and improvements”. But the eleventh doll in JuJu’s full line-up appears identical to what ChatGPT spat out after prompt 37. The plush toys will be sold in blind boxes from $US24 ($36). However, images created by AI are not considered copyrighted, unless the author significantly modifies it. When asked by a follower what significant modifications Hendry had made, she responded: “JuJu is for the people, I reckon.” One fan wrote on Instagram: “You’re such a great artist. I’m so disappointed to see you’re using AI, the result is a subpar mishmash of things we already have.”\n\nCan works created with AI be regarded as art at all? Sydney-based Australian multidisciplinary artist Timothy Johnston views generative AI as an extension of human expression. “The number of iterations that [Hendry] would have gone through, and prompts to learn … she’s such a perfectionist, she’s creating and creating, she’s like a potter with clay, she’s just not doing it by hand,” he says. “You still have to have the vision and put in the time to master the AI.” As Hendry noted on a video posted to Instagram: “AI is like porn, it does a job, but it does not do the job!”\n\nA representative for Hendry said the artist did not have time for an interview, a statement, or a response to this masthead’s emailed questions. Live illustrator and art teacher Cat Long, who believes art generated wholly by AI – though she is not suggesting JuJu was – is, for now at least, very distinguishable from human creation. That’s why she says the two aren’t comparable. ‘AI is like porn, it does a job, but it does not do the job!’ CJ Hendry “Does AI take the soul out of art? Does it take the spark and creativity?” Long wonders. “Things created wholly by AI, there’s probably a place for them, absolutely, in the art world … But I don’t think that they’re competing with art that’s created for the soul.” Not everyone agrees with that view.\n\nWhat it means for the artists if AI is using existing art Some commercial works are being created using already existing art and the artists are not being compensated. “Creative work can now be produced by anyone without requiring the development of skills and expertise, but this is only made possible by existing creative work underpinning the process,” warned federal arts body Creative Australia in a June submission to the Productivity Commission. “This work is often being used without consent or compensation, with significant potential impact on the financial viability of creative careers.” Aboriginal artist Emma Hollingsworth, who sells art by the name Mulganai, says one of the reasons she wanted to bring her art to the world stage was so she could bring awareness to her people and her culture. Credit: Emma Hollingsworth/Mulganai\n\nIt’s an impact felt keenly by some First Nations creatives artists, who refer to AI models training with and reproducing their art without consent as “double colonisation”. Kaanju, Kuku Ya’u and Girramay digital artist Emma Hollingsworth, also known as Mulganai, simply calls it “creative theft”. Loading “My art isn’t just a pretty picture, it comes from my identity as an Aboriginal woman,” says Hollingsworth. “It’s tied to my family, ancestors, Country and stories. AI has none of that: no lived experience, no cultural memory, no spirit or connection to Country. It can imitate styles, but it cannot carry our culture or our history.” In September, Hollingsworth found multiple replicas of her art being sold on Temu for $5 (the listings have since been taken down). Her art is a part of her, Hollingsworth says, but it also “keeps a roof over my head”.\n\nContemporary artist Blak Douglas has also seen AI-generated images resembling his art floating around, but he’s not concerned. Douglas, like Hendry, is a rebel – and his pop art-inspired portrait of Wiradjuri artist Karla Dickens won him the Archibald Prize in 2022. The Dunghutti man calls generative AI the “autotune of visual art”, and sees it as an opportunity “to reach the masses to tell them that Aboriginal art is different, modern, contemporary”. Since he started painting 26 years ago, the Dunghutti man says, First Nations art has been governed by the dot paintings stereotype. “It’s like this artistic analogy of keeping Aboriginal people within a mission,” says Douglas. “It would be nice if the layperson Googled Aboriginal art, they might see Blak Douglas.” Archibald Prize-winning modern contemporary artist Blak Douglas sees potential in generative AI to challenge people’s perceptions about what Aboriginal art is. Credit: Louise Kennerley\n\nIs it ‘autotune of visual art’ or something more sinister? A through-line of Hendry’s body of work is that, like Andy Warhol and Douglas, it disrupts the status quo and challenges what art is. Loading JuJu, Hendry says in an Instagram Story, is a commentary on how “extraordinary and ridiculous” the Labubu craze is. But long-time Hendry fan Ruby PH, a Sydney-based designer who admires Hendry’s commercial success, doesn’t see it. They say while it’s important to engage with AI and not turn away from conversations surrounding it, they were disappointed that Hendry implied other toy makers commonly used generative AI.\n\nPH says, in their experience, people making toys have storytelling backgrounds, and develop 3D animation and illustration skills to bring their characters to life. Labubu, after all, was an original character created by artist Kasing Lung before Pop Mart made it a toy. “If you were trying to make a statement about hyper-consumerism … why just do the exact thing that it’s doing? I don’t see the parody in that,” says PH, noting the final exhibit has yet to be unveiled. Where to now? Although Hendry has flirted with copyright infringement (she’s given T-shirts away for free to avoid being sued) since picking up a pencil, there is no suggestion of wrongdoing. Hendry has also been transparent about her use of generative AI, which is one of Creative Australia’s principles. Sydney-based designer Ruby PH says they admire Hendry for her commercial success and talent, but are disappointed with Hendry’s use of generative AI in the initial stages of designing her JuJu exhibit. Credit: Janie Barrett\n\nIn October, a proposed amendment to Australian copyright laws, which would have given tech firms carte blanche to train AI models on the work of local creatives, was quashed after a successful campaign fronted by artists including singer-songwriter Jack River (Holly Rankin). Loading This means that AI developers must seek permission before using creative works to train their models. Some visual artists, including Stephen Cornwell, are not taking any chances, using tools such as WebGlaze or Nightshade to protect their works from being scraped. Setting fair industry standards that protect creatives – such as the tech sector stepping up by remunerating, and seeking consent from, creatives to use their work – is critical to ensuring a future where both technology and culture can thrive, says Creative Australia’s head of public affairs, Nicola Grayson. “Being able to use AI in a safe, ethical way is potentially quite exciting,” says Grayson. “If we can work with the tech industry to really produce some great solutions, then the future will look bright.”",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/the-jet-lag-advice-you-ve-been-given-is-probably-wrong-20251106-p5n8b0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The jet lag advice you’ve been given is probably wrong",
    "publish_date": "Fri, 14 Nov 2025 11:00:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Sarah Berry"
    ],
    "text": "Heading to Europe When preparing for a big trip, however, the rules around light don’t always apply. Travelling somewhere with a time difference of several timezones or more requires a change in our light habits to help us adjust. Loading If you were preparing to travel to Europe, which is behind Australian time, you might start to slow your body clock by using bright light in the evening for about three days before you fly. Any longer is unnecessary, says Cain. “In this instance, turn the lights on, use your phone on max brightness: All the things you wouldn’t normally do,” says Cain. “It will gradually push your body with evening light, towards London time.”\n\nThis is because bright light in the morning pushes our body clock forward, while light in the evening pushes it back. Before a recent trip to London, Cain stayed up slightly later each night with bright lights on. Then, on the flight, he used light therapy glasses to keep himself awake until about 5am Australian time. “I was most of the way adjusted by the time I got there,” he says. When to avoid light Returning to Australia from Europe is trickier for our bodies.\n\nThe human clock tends to delay better than it advances, which is why people find it easier to travel west than east. This is compounded by the fact that we also often land in the morning when our bodies still think it is nighttime. Typical online advice is to get lots of bright light in our destination, especially if it’s morning there. Following this advice can make the jet lag worse. “In the middle of the night, there is a crossover point on the effect of light. You quickly go from maximum delaying effect of light (like a slowing of the clock) to maximum advancing (like a speeding up),” explains Cain. If we are exposed to light during this time, it can slow our clocks even further, or it can send the whole system into a state where it doesn’t know what time it is, says Cain: “We refer to it as light hitting the singularity.” The crossover point coincides with our core body temperature dropping to its lowest point, about 90 to 180 minutes before we normally wake up. So, for someone who typically rises at 6am, that will be somewhere between 3.30am and 4.30am.\n\nThis is the time when light is least likely to occur. When we’re travelling, it can be a different story. For instance, if someone travels from Paris to Perth and lands at around 10am Perth time, that corresponds to 3am Paris time, when their core body temperature is at its lowest. Loading “If a blanket recommendation is followed, and you seek sunlight immediately after arrival, this light exposure will push the clock in the wrong direction, causing it to shift later instead of earlier,” says Dr Dean Miller, a sleep and performance scientist at CQ University. “In effect, you’ve turned a manageable seven-hour advance into a much harder 17-hour delay – prolonging jet lag and making recovery slower.” The quickest route back to local time, says Miller, would require staying in relative darkness for the first couple of hours after landing until the body is out of the crossover period.\n\nBring on the sleep Like light, depending on how we time it, melatonin can help push our body towards the new time, or away from it, thereby prolonging our jet lag. “It’s essentially timing information,” says Cain. Specific and flexible timing information is what many apps and people offering advice get wrong, adds Cain. And if we can’t follow that advice perfectly (if we have no control over the light we are exposed to, for instance), then the advice needs to adjust. “The advice is different depending on where you’re coming from and where you’re going, but even the time of day of your flight,” says Cain. “There are so many moving parts, and you need to understand the underlying mechanisms to get it right.”\n\nWithout this understanding, “it’s dumb at its core”, says Cain, who is developing a jet lag app, which will use light sensors and adjust its advice based on the individual. With melatonin, taking it during the day when our body isn’t naturally releasing it will shift the timing of our clock, just like light. “If you’re travelling from west to east across six time zones, taking melatonin in the afternoon (in your body’s time) is good because it’ll advance your clock and that’s what you need,” he explains. “But if you took it in the late night or early morning, it delays your clock and can worsen jet lag.” Eat your way to a new destination Food and exercise may not shift our central clock, but they also work to 24-hour rhythms and can help align our peripheral clocks, such as in the liver.\n\n“Like light, food acts as a signal to our body to help set our circadian rhythms,” explains Dr Charlotte Gupta, a researcher and chrono-nutritionist at the Appleton Institute. “If we eat at a time when our body isn’t primed to be digesting food, like at night, this can contribute to misaligning our internal rhythms.” Good jet lag advice considers what time your body thinks it is, as well as what time it is in your destination. Credit: Getty Images And because our body is less able to digest what we eat, if our clocks are in sleep mode, it can make us feel more sluggish and prone to gastric upsets, common symptoms of jet lag. Gupta suggests eating (and exercising) in line with our light timing and sticking to light, unprocessed foods while our system adjusts. “Meal timing on flights is not necessarily designed around the optimal eating timing.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/it-would-be-the-best-achievement-of-my-career-joe-root-s-big-ashes-ambition-isn-t-what-you-think-20251112-p5neqn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It would be the best achievement of my career’: Joe Root’s big Ashes ambition isn’t what you think",
    "publish_date": "Fri, 14 Nov 2025 11:00:00 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Joe Root has what he calls a “stinking cold”, but his eyes are gleaming with anticipation. We’re speaking ahead of the Ashes, using Zoom – the video conferencing app by which Root spent far too much time conducting his captaincy duties during COVID-19. The Joe Root who appeared on so many of those calls during the 2021-22 Ashes tour looked harried, exhausted and frustrated. He knew that England had played more Test cricket under those conditions than anyone else, and that Australia were comparatively fresh. Joe Root after one of his 39 Test centuries. Credit: AP But he was also tearing his hair out at repeated errors from his troops, and also his own. Notably, a tendency to run deliveries through the gully and third-man regions had been a recurring area of weakness on bouncing Australian pitches. More broadly, those kinds of dismissals have contributed to a perception that Root, despite having soared to heights not reached by any other England batsman in history, is not quite a first-rate player in Australia. The empty hundreds column here was famously pointed to by former Australian coach Darren Lehmann last year when he compared Root unfavourably to Steve Smith, Virat Kohli and Kane Williamson.\n\nAdvertisement\n\nRoot laughed off Matthew Hayden’s recent pronouncement he would run nude around the MCG if the former skipper didn’t make a century this series, but he did speak with Lehmann, a sometime mentor, about the comments on ABC Radio. “He actually did reach out to me after saying that,” Root tells this masthead. “Everyone is entitled to their opinion. Your job as a commentator or a pundit is to give your opinion and if people don’t think I’m the best player in the world, it’s not going to help us win the Ashes by me getting angry about it. England star Joe Root has opened up on the Ashes battle ahead, and why it will be different. Credit: Philip Gostelow “My job is to score runs, and I’ve tried to make sure that’s always my main focus, and I’ve got five brilliant opportunities to do that in this series.” Root pauses briefly, then rolls through the past three Ashes tours of Australia, in 2013-14, 2017-18 and ’21-22. “[The] first one was a very difficult one, losing 5-0, and there was a lot of stuff going on there,” Root says. “The second one was very similar. It was my first tour as captain, there were a few off-the-field things with [Cameron] Bancroft and Jonny [Bairstow] and headbutts and a few beers flying around onto people’s heads and stuff.\n\nAdvertisement\n\n“And the last one was COVID and, as a team, we’d played 20-odd Test matches in those environments – everyone was absolutely cooked and it was a very difficult tour for a number of different reasons around that.” Before the interview, I’d been told that Root didn’t wish to spend much time ruminating on the last Ashes tour. But now he is speaking openly about the difficulties. “I remember getting to Sydney and we didn’t have a coaching staff,” he says. “We had me, Paul Collingwood and Graham Thorpe were the three coaches that were left, everyone else was isolating for two weeks. So there were a number of different things that didn’t help. “That’s not trying to take anything away from Australia and the fact they were far superior to us and outplayed us convincingly, but the fact is, this time around, I’ve got all that experience to lean on, I’m playing some nice cricket, I’ve not got the responsibility of captaincy and the extra workload that entails, and I’m determined to just enjoy what a brilliant tour it’s going to be.” I ask Root whether he thinks he will be able to walk to the middle with a clearer head this time, as a senior pro in Ben Stokes’ team but not a titled leader.\n\nAdvertisement\n\n“Yeah, potentially,” he says. “At least this time in Sydney I won’t be absolutely knackered from throwing balls at the rest of the squad trying to get them ready as well, not the amount I did last time anyway. It’s important to learn from previous experiences and tours, but it’s also important to be where you are right now. “This series is not about me, it’s about us winning an Ashes. If at any stage it starts to become that in my own mind, then I’m doing a disservice to this team by not being the senior player I need to be within it. The full focus has to be around us winning. If I’m scoring big runs, that’s going to help. “If we come away from this and I haven’t got a hundred, and we win the series, that would be probably the best achievement of my whole career. That’s where it sits with me.” Root with captain Ben Stokes. Credit: AP That’s a big pronouncement from Root, who has always tended to do his boldest talking with the bat. Since he handed over the captaincy to Stokes in 2022, his talents have been given room to flourish. In 41 Tests over that time, Root has purred to 3654 runs at 58, striking at nearly 67 runs per 100 balls, along with 14 hundreds. He has been the beating heart of the “Bazball” batting order, a master craftsman giving stability and security to the likes of Ben Duckett and Harry Brook around him. Partly, this is about what Root feels he owes to Stokes, a loyal deputy who put his body through plenty of pain to keep England’s Test match flag flying during a period when the white-ball teams of Eoin Morgan were the ECB’s priority.\n\nAdvertisement\n\n“He threw everything into helping me out when I was England captain, put his body through a lot, [and was able to] take on the big moments in games, [and] bowl long spells,” Root says of Stokes. “He would do everything he could to help my England team when I was captain, and it’s now my opportunity and my turn to repay that favour. “As a senior player, whether that’s in terms of performance on the field – that’s the most important one – but also whether it’s messaging [within the team], trying to create something outside of the norm over this period, that’s my role.” Something that was outside the norm for Root, as a Test player at least, was the use of the ramp or scoop shot. Sam Konstas used it to great effect on Boxing Day last year but has since struggled to pick the right moments. Root’s breakdown of the shot provides a window into his batting brain. Root practises a reverse sweep in the nets in Perth. Credit: Getty Images “If it can create a little bit of chaos and take a bowler off their length, that can not only benefit you, but the guy at the other end,” he says. “For the next three or four overs it could completely upset the rhythm of the game for the opposition. “You want to evaluate the risk but also see the upside of it as well. The reason you’re doing it is not for Instagram clicks or a few likes here and there. “One thing I always take into account is does this situation require it, and sometimes that might be when everything is in your favour, and sometimes it might be the opposite – when everything is in the bowler’s favour, and you’re trying to wrestle momentum back into your hands. I don’t think there’s an exact science to it. Sometimes the best time to do it is as randomly as possible because no one is anticipating it, and it’s hard to anticipate as a bowler. That’s how I try to use it.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/climate-change-authority-criticises-coalition-net-zero/i7ygs99y5",
    "title": "‘Popping champagne corks’: Climate change boss lashes Coalition for dumping net zero",
    "publish_date": "Fri, 14 Nov 2025 01:43:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "The head of Australia’s Climate Change Authority, Matt Kean, has fiercely criticised the Coalition’s decision to dump net zero by 2050, accusing his former party of ignoring science and \"lining up\" with global pariah states.\n\n\n\n\n\n\"This is not a policy, it’s just politics,\" Kean, a former Liberal NSW treasurer and environment minister, told SBS from the COP 30 climate summit in Brazil.\n\n\n\n\n\n\"Politics doesn't change physics, and just because the Coalition is walking away from evidence and science doesn't mean the rest of the world is,\" Kean said.\n\n\n\n\n\nThe former energy minister said while the global community was \"doubling down\" on efforts to lower emissions, the Coalition was pandering to mining lobbyists.\n\n\n\n\"The only people that will be popping champagne corks after the Coalition's announcement yesterday are the big coal companies who stand to benefit at the cost of Australian consumers,\" Kean said.\n\n\n\n\n\nOpposition leader Sussan Ley announced on Thursday that the Liberal Party would abandon net zero, following in the footsteps of its junior Coalition partner, the Nationals, which made its own announcement earlier this month.\n\n\n\n\n\nShe said the two parties would hold talks on Sunday to negotiate a joint climate and energy policy.\n\n\n\nREAD MORE Coalition meeting looms as Liberal rejects 'Nationals-lite' label after net zero dumped\n\nKean lashed the Coalition’s plan to subsidise the extension of coal-fired power stations — due to retire at the end of the decade — as \"hugely expensive\".\n\n\n\n\n\n\"If the Opposition want to underwrite coal, what they're actually underwriting is higher electricity bills for Australian consumers and businesses.\"\n\n\n\n\n\n\"The cheapest way to deliver new generation capacity into the grid is renewables. That's what the Australian Energy Market operator says. That's what the Australian Energy Market Commission says.\"\n\n\n\n'Gen Z and millennials' top priority, Ley says\n\nAt the heart of Ley’s energy pivot is a pledge that \"energy prices will always be more affordable under us\" — though she did not nominate an exact dollar amount that bills would drop by, as Labor did before the 2022 election .\n\n\n\n\n\nThe Liberal leader believes she can sell a cost-of-living argument to young Australians — who statistically left her party in droves at the last three elections.\n\n\n\n\n\n\"Young Australians have told me that they care about climate, and I care about climate too,\" Ley said on Friday.\n\n\n\n\"[Dumping net zero] is about the national interest. It’s about the right thing for our country, and most importantly, it’s about what’s right for gen Z and millennials who, right now, can’t afford to buy a home, can’t pay their power bills, and are looking at a government that is set to deliver them a worse standard of living than their parents.\"\n\n\n\n\n\nKean, a moderate who grew up in the blue-ribbon northern Sydney electorate of Bradfield — lost by the Liberal Party for the first time in its history to teal independent Nicolette Boele in 2025 — said the Coalition's energy offering was \"ideology trumping facts\".\n\n\n\n\n\n\"I think the Coalition wants to line up with Russia, with Iran and [US President Donald] Trump, and I think that's totally out of step with what the Australian community would expect from their government.\"\n\n\n\n'Modest' underwriting of coal\n\nOpposition energy spokesperson Dan Tehan has repeatedly refused to say whether the Liberals will release modelling to support its climate policy, or how much will be spent to extend the life of existing coal power stations.\n\n\n\n\n\n\"What we have said is that we will have a technology-neutral, affordable energy scheme so that there will be existing generations supported with modest and targeted underwriting, like what is occurring but only occurring for wind and solar under the Labor Party,\" he said.\n\n\n\n\n\n\"We will release our suite of policies and that will be done with plenty of time for the Australian people to be able to look at [and] address them [before the next election]”.\n\n\n\nFormer Liberal prime minister Malcolm Turnbull — whose party rolled him over energy policy — described the decision as \"Groundhog Day\".\n\n\n\n\n\n“[The Liberals] are guaranteeing that they will marginalise their vote. It’s as though they’re worried about competing with [One Nation leader] Pauline Hanson as opposed to holding [Prime Minister] Anthony Albanese to account,\" he said.\n\n\n\n\n\nAmong the key conundrums for the Coalition now is how its stated energy objectives will align with Australia’s obligations under the 2015 Paris Agreement, which does not allow for backsliding on climate targets.\n\n\n\n\n\nKean, speaking from COP — a summit Australia hopes to host alongside Pacific Nations next year — said he did not \"understand\" how the Coalition could feasibly stay in the Paris Agreement yet abandon net zero by 2050.\n\n\n\n\n\n\"I don't think they understand how they can stay in Paris and get rid of net zero,\" Kean said.\n\n\n\n\n\n\"What's clear to me is that even though the White House has flown the white flag, the rest of the world certainly hasn't given up.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/sudden-closure-of-several-canberra-schools-after-asbestos-found-in-childrens-coloured-sand/02ridnmhf",
    "title": "Schools in Canberra and Brisbane closed after asbestos found in children's coloured sand",
    "publish_date": "Thu, 13 Nov 2025 23:21:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Schools in Canberra and Brisbane have announced sudden closures over concerns that some children's play sand products may contain traces of asbestos.\n\n\n\n\n\nIt comes after the Australian Competition and Consumer Commission (ACCC) earlier this week issued a recall notice for a number of coloured play sand products. Two types of asbestos — chrysotile and tremolite — have been referenced and both are naturally occurring.\n\n\n\n\n\nThe sand is used for sensory play, education, and various arts and crafts activities.\n\n\n\n\n\nThe ACT announced on Friday that 15 schools and three pre-schools would be closed, while five other schools would be partially closed. Meanwhile, a Brisbane school announced it would also close.\n\n\n\n'Low risk', says ACT education minister\n\nACT Education Minister Yvette Berry said she understood the news might be \"upsetting\" for families, but insisted the issue was \"low risk\".\n\n\n\n\n\n\"I understand the news will be upsetting for some families, however, WorkSafe have advised the risk of exposure to traces of chrysotile [asbestos] is low,\" Berry told reporters on Friday morning.\n\n\n\n\n\nOn Tuesday, WorkSafe ACT said it had tested Kadink Decorative Sand sold in a six pack of 10 gram tubes and found traces of chrysolite asbestos. The ACCC has also referenced tremolite asbestos in its recall notice for several coloured play sand products. SBS News has contacted the consumer watchdog for clarity.\n\n\n\n\n\n\"We made the decision that this was the best action to take as a precautionary measure, noting again that it is a low risk.\"\n\n\n\n\n\n\"Closing schools will allow testing and remediation to occur as soon as possible.\"\n\n\n\nLISTEN TO Asbestos likely in one in three homes across Australia SBS Audio 01:12 English\n\nTesting of the sand started yesterday afternoon and will continue, Berry said, but noted that early results had come back negative for airborne asbestos fibres.\n\n\n\n\n\n\"There were eight test results back this morning and all eight test results were negative for airborne fibres,\" ACT Work Health and Safety commissioner Jacqueline Agius said.\n\n\n\n\n\nAgius said \"tests are happening all over the country at the moment\", but that WorkSafe ACT was only testing one type of sand in its jurisdiction.\n\n\n\n\n\nMore school closures are possible, with Berry saying it was an \"evolving situation\".\n\n\n\nBrisbane school closes\n\nMancel College, a specialist school for children and young people with language disorders, also announced on Friday that it would close.\n\n\n\n\n\nIn a statement posted on social media, Craig Duncan, head of college at the school in Brisbane's west, shared the ACCC's recall notice and said some of the product had been found in both the junior and senior schools.\n\n\n\n\n\n\"While the advice is low risk and there are only minor traces, we are acting with an abundance of caution,\" Duncan said.\n\n\n\n\n\n\"We are therefore advising parents that with immediate effect we are closing the entire college today.\"\n\n\n\nWhat are the sand products that have been recalled?\n\nThe recalled products, sold at retailers including Officeworks, Educating Kids, Modern Teaching Aids, and Zart Art, include:\n\n\n\n\n\n- Kadink Sand (1.3kg)\n\n\n\n- Educational Colours Rainbow Sand (1.3kg)\n\n\n\n- Creatistics Coloured Sand (1kg)\n\n\n\n- Kadink Decorative Sand (10g 6 pack)\n\n\n\n\n\nOfficeworks was a \"major supplier\" for the sand, the ACCC said, with the products sold in Australia between 2020 and 2025.\n\n\n\nAustralia's consumer watchdog recently issues a recall notice for Kadink Sand (1.3kg), Educational Colours — Rainbow Sand (1.3kg) and Creatistics — Coloured Sand (1kg). Source: Supplied / ACCC Asbestos, a hazardous material that can cause terminal diseases, has been banned in Australia since 2003 and is not allowed to be imported except in very limited circumstances.\n\n\n\n\n\nInhalation of asbestos can lead to an increased incidence of some respiratory diseases, including lung cancers.\n\n\n\n\n\nThe ACCC has said the release of respiratory fibres is unlikely to occur in its retailed state, a point echoed by Agius on Friday.\n\n\n\n\n\n\"Asbestos in sand is a naturally occurring substance because it comes from quartz and it's quite heavy, so when asbestos is heavy then it's difficult to breathe it in,\" she said.\n\n\n\n\n\n\"That's why we say the risk is low.\"\n\n\n\n\n\nACCC deputy chair Catriona Lowe said Officeworks has removed the products from sale.\n\n\n\n\n\nShe said any customers who own the product should stop using it immediately, place it in a heavy-duty plastic bag, and secure it with double tape.\n\n\n\n\n\n\"When doing so, in an abundance of caution, customers should take precautions such as wearing disposable gloves and a mask,\" Lowe said.\n\n\n\n\n\nAsbestos cannot be disposed of in general waste and must be taken to resource management facilities.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 1
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/having-a-crack-whats-the-go-with-the-social-media-ban/einc5zepz",
    "title": "Having 'a crack': What's the go with the social media ban?",
    "publish_date": "Thu, 13 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/health-star-rating-system-changes-criticism/g2el9r52i",
    "title": "3.5 stars for chips? Australia's health star ratings hit a deadline — and a crossroads",
    "publish_date": "Thu, 13 Nov 2025 18:34:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "It was meant to make healthy choices simple, but nutrition experts say the Health Star Rating system is falling short.\n\n\n\n\n\nAccording to its critics, the front-of-pack labelling system for food and drink lacks consistency across products, uses an algorithm that overlooks ultra-processed foods and artificial sweeteners, and — because displaying a rating is not mandatory — is more likely to be applied to products that score higher as a promotional tactic.\n\n\n\n\n\nAfter a five-year process in the wake of a 2019 review, Friday marks the final deadline for food and beverage manufacturers to voluntarily apply the rating to 70 per cent of relevant products.\n\n\n\n\n\nThe government vowed to consider mandating the system if the target wasn't met, which appears to be the case.\n\n\n\nResearch by the Sydney-based The George Institute for Global Health found that uptake across the industry in 2025 was just 37 per cent.\n\n\n\n\n\nUptake has stagnated in recent years. Last November, only 35 per cent of intended products in Australia displayed a star rating, according to government data, up just a fraction from 32 per cent the year before.\n\n\n\n\n\nAlexandra Jones, head of food governance at The George Institute, said the government targets were \"extremely generous, yet the multibillion-dollar packaged food industry has not even come anywhere close to meeting them\".\n\n\n\n\n\n\"This is an abject failure by the industry that suggests a blatant disregard for Australian consumers who buy their products.\"\n\n\n\n\n\nJulian Rait, vice president of the Australian Medical Association, told SBS News mandating the system is \"the only way to ensure that there will be a benefit to consumers and not just industry from the Health Star Ratings\".\n\n\n\n\n\n\"It seems as though food manufacturers are very selective in what they choose to use the Health Star Ratings on,\" he said. \"They tend to be using them for their healthier products and exploiting the HSR as a marketing tool, and avoiding putting it on unhealthy products.\"\n\n\n\nHow does the Health Star Rating system work?\n\nThe government initiative was introduced in Australia and New Zealand in 2014 in consultation with industry and public health stakeholders.\n\n\n\n\n\nIt rates the nutritional profile of a packaged food or drink product from 0.5 to 5 stars.\n\n\n\nSource: SBS News Using an online calculator, manufacturers plug in four key \"negative\" nutrients which lower the score of an item: kilojoules, saturated fat, sugars and sodium.\n\n\n\n\n\nThey can then add four \"positive\" inputs that increase the rating. These are:\n\n\n\n\n\n- Fibre\n\n\n\n- Protein\n\n\n\n- Fruit, vegetable, nuts and legume content (FVNL)\n\n\n\n- Concentrated fruit or vegetable ingredients such as tomato paste\n\n\n\n\n\nIt's intended to compare similar products — so cheese against other cheese products, but not cheese against muesli bars.\n\n\n\n\n\nSarah Dickie, a research fellow in the Department of Nutrition, Dietetics and Food at Monash University, told SBS News that allowing positive components to negate negative ones is not an ideal system.\n\n\n\n\n\n\"This idea of being able to add enough good ingredients in to balance that out, it doesn't really work. It's still a junk food.\"\n\n\n\nLow-rated products less likely to display a rating\n\nResearch from The George Institute across more than 21,000 products last year found that 61 per cent of five-star items displayed their rating.\n\n\n\n\n\nJust 16 per cent of products that would receive half a star were labelled, and only 24 per cent of products that scored three stars or lower showed a rating.\n\n\n\nSource: SBS News Jones, of The George Institute, said in August the lack of consistency makes it difficult for consumers to compare items.\n\n\n\n\n\nShe called for a \"clear and expedient timeline\" to mandate ratings in addition to regular, independent reviews of the algorithm underlying the system.\n\n\n\nProcessing not factored in\n\nUltra-processed foods (UPFs) are made with few whole foods, created using industrial techniques, modified substances and various additives. They include products such as chips, carbonated or artificially-sweetened drinks, lollies, certain cereals and energy bars.\n\n\n\n\n\nProcessing is not captured by the Health Star Rating algorithm, despite growing evidence linking UPFs to numerous harmful health outcomes including heart disease and diabetes.\n\n\n\n\n\n\"You're getting these ultra-processed foods that can go through the algorithm and say they're really healthy,\" said Dickie, whose research has looked specifically at the Health Star Rating system.\n\n\n\nSource: SBS News Artificial sweeteners are also not accounted for by the system, meaning zero-sugar soft drinks and cordials can rate up to 3.5 stars.\n\n\n\n\n\nWhile some positive adjustments were made to the rating system after a previous review, Dickie said there are still some \"fundamental flaws\" in the algorithm.\n\n\n\n\n\n\"You can go around the supermarket and find things that are heavily processed, you know, like Up & Go, or even artificially-sweetened soft drink — 3.5,\" she said.\n\n\n\n\n\n\"That does not make any sense, right?\" she added. \"There's no nutritional value [in artificially-sweetened soft drink].\"\n\n\n\n\n\nArtificial sweeteners have been linked to gut issues, she said, and can promote taste preferences for sweetened food and drinks.\n\n\n\n\"If you're having those from a young age, you're developing a taste for sweetness, which is not good for your dietary habits.\"\n\n\n\n\n\nUp & Go liquid breakfast products, which contain fibre and protein, rate between 4.5 to 5 stars. Various brands of packaged chips have ratings of up to 3.5 stars. Milo snack bars have ratings of 4 stars while other snack products like LCMs choc-chip display a 1-star label.\n\n\n\nConsumers want more transparency, surveys suggest\n\nA 2024 VicHealth survey of 1,100 Australians found that nutrition information was the second most important factor influencing food purchases after price, yet many respondents said they didn’t trust food labels to be transparent.\n\n\n\n\n\nSimilarly, a 2023 Cancer Council survey found 82 per cent of Australian adults believe Health Star Ratings should be included on all packaged foods.\n\n\n\n\n\nAbout two-thirds said making the system mandatory would make it more useful, and 65 per cent said it would help simplify their purchasing decisions.\n\n\n\nShould a flawed system be mandated?\n\nExperts agree that a compulsory system is crucial, but differ on where to go from here.\n\n\n\n\n\nMagriet Raxworthy, CEO of Dieticians Australia, said the peak body supports making the current system mandatory, but said \"there's still opportunity for improvements\" in future.\n\n\n\n\n\n\"I do believe it is going to set us on a motion in the right direction, and certainly enabling the Australian public to make more informed choices,\" she told SBS News.\n\n\n\n\n\nShe suggested that outlier products with inaccurate ratings make up only a small fraction of the picture, but said the large majority \"do provide the right information\". She called, however, for better messaging to the public on how to appropriately read the ratings.\n\n\n\nREAD MORE Sugar alternatives are on the rise. They might not be so sweet for the environment\n\n\"We know that people are comparing Health Star Ratings of products outside of groupings, and that means you're also not utilising the system correctly,\" she said.\n\n\n\n\n\nDickie, who is also an executive member of the advocacy group Healthy Food Systems Australia, said she doesn't believe the current model is fit for purpose.\n\n\n\n\n\nThat group would not want the system mandated in its current form.\n\n\n\n\n\n\"Our preference would be to change it to a warning-based system,\" she said.\n\n\n\nFood ministers meeting early next year\n\nA Department of Health spokesperson told SBS News that food ministers will meet early next year to review reporting on uptake and receive updates from Food Standards Australia New Zealand — the agency that develops food standards and policies for both countries — on preparatory work it has undertaken on potentially mandating the system.\n\n\n\n\n\n\"Based on this update, food ministers will further consider whether to mandate the HSR system,\" the spokesperson said.\n\n\n\n\n\nIf ministers decide to mandate the system, it could still take several years before consumers see the effects on the shelves.\n\n\n\nThe spokesperson noted the existing system was designed to align with the Australian Dietary Guidelines, which don't reference processing level.\n\n\n\n\n\nThose guidelines are under review, and once an updated version is released, \"consideration will be given to whether the HSR system remains aligned\".\n\n\n\n\n\n\"The HSR does not replace nutrition know-how. Unlike dietary guidelines, it doesn’t tell you what types of food to eat or in what quantities. Just because a product has a 5 star rating does not mean you should eat it every day or in large amounts,\" the spokesperson said.\n\n\n\n\n\n\"Health Stars help consumers to quickly and easily compare similar products. It won’t help you to choose between bacon and breakfast cereal. But if you’ve decided to buy breakfast cereal then it will help you to choose a healthier option.\"\n\n\n\nThe Australian Food and Grocery Council, the peak industry association for the food, beverage and grocery supply industry, told SBS News it \"supports the Health Star Rating system as a tool to help Australians make informed food choices\".\n\n\n\n\n\n\"For many companies, particularly small manufacturers, introducing or revising packaging involves considerable time, cost and logistical complexity,\" a spokesperson said.\n\n\n\n\n\n\"Any shift of the HSR to a mandatory measure would require adequate timeframes and support to ensure long-term planning and avoid unnecessary waste or disruption to production.”\n\n\n\nWhat could a different approach look like?\n\nDickie pointed out that the existing system is positively skewed — by design, every product technically has a positive star rating above 0.5, even those that rank most poorly.\n\n\n\n\n\nResearch on front-of-pack labelling suggests that a warning system or negatively-skewed system is more effective.\n\n\n\n\n\n\"Something that actually puts a warning label on junk foods and points out the products that we shouldn't be eating is going to be more effective than this kind of ranking-based system that is positive,\" she said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/video/what-does-australias-new-defence-pact-with-indonesia-mean-for-regional-security/9yp40vlro",
    "title": "What does Australia’s new defence pact with Indonesia mean for regional security?",
    "publish_date": "Thu, 13 Nov 2025 09:18:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/who-is-in-and-who-is-chasing-a-fifa-world-cup-2026-spot/oxr5s7wx3",
    "title": "FIFA World Cup qualifiers: Who is locked in, as former winners still chase a 2026 spot",
    "publish_date": "Thu, 13 Nov 2025 06:59:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "The FIFA World Cup qualifiers are entering a crucial stage, with some major teams battling to secure their tickets to the 2026 men's tournament in Canada, Mexico, and the US, while others are celebrating historic first-time qualifications.\n\n\n\n\n\nWith 28 teams already confirmed for the 2026 men's World Cup, 20 spots remain.\n\n\n\n\n\nStarting 14 November, a slew of qualifying games will be played, and 14 more spots will be locked in by the 19 November.\n\n\n\n\n\nThis is the first time the World Cup will feature 48 teams, following the tournament's expansion.\n\n\n\n\n\nSome smaller teams have already secured qualification, but several high-ranked footballing nations are yet to secure their berth, and past World Cup champions are currently facing an uphill battle.\n\n\n\nREAD MORE How to watch the FIFA World Cup 26™ Final Draw LIVE on SBS\n\nOn 6 December, Australia and 41 other nations will learn their group-stage fate at the FIFA World Cup 2026 Final Draw in Washington DC, and you can watch it all live on SBS and SBS On Demand.\n\n\n\n\n\nIn March, four other European teams will qualify, while six more teams will compete at the inter-confederation play-offs for the final two spots.\n\n\n\nWhich teams have already qualified for the 2026 FIFA World Cup?\n\nGood news, Australia has already qualified.\n\n\n\n\n\nAfter beating Japan for the first time in 16 years and winning against Saudi Arabia in June, the Socceroos secured their World Cup place .\n\n\n\n\n\nAll nine teams from the Asian Football Confederation (AFC) heading to the World Cup are already known.\n\n\n\n\n\nIran, Japan, Jordan, Saudi Arabia, South Korea, Qatar, and Uzbekistan are the other teams that have qualified from the AFC. This is the first time Uzbekistan and Jordan have qualified for the world's biggest football tournament.\n\n\n\nSource: SBS News Canada, Mexico, and the US automatically made the tournament as hosts and skipped the qualification stage.\n\n\n\n\n\nIn South America, Argentina, Brazil, Colombia, Ecuador, Paraguay, and Uruguay have qualified, and New Zealand will return to the World Cup following their last appearance in 2010 through Oceania.\n\n\n\n\n\nIn Africa, nine teams have already qualified, with a special team making history.\n\n\n\n\n\nCape Verde, an island country in West Africa with a population of nearly 600,000, secured its spot in the World Cup last month. After Iceland, Cape Verde is the second smallest country by population to qualify for the tournament.\n\n\n\nEngland is so far the only European national team that has guaranteed a spot.\n\n\n\nWhich qualifying matches will be closely watched?\n\nWith teams playing 48 qualifying matches from 14 to 19 November, 14 more teams will qualify for the World Cup directly.\n\n\n\n\n\nIn the European qualification system, nations are split into six groups of four teams and six groups of five teams, with the winners of each group qualifying automatically for the final tournament.\n\n\n\n\n\nThis means some of the teams at the top of their group, such as Austria, Belgium, Croatia, France, the Netherlands, Norway, Portugal, Spain, and Switzerland, can possibly secure World Cup qualification in the coming days.\n\n\n\nOne of the matches worth keeping an eye on is the Germany and Slovakia fixture in Group A. Both teams are deadlocked at the top of the standings with nine points, and next week's match will determine who qualifies.\n\n\n\n\n\nBut the biggest one to watch will be the Group I clash between Italy and Norway. Norway is currently leading the table with 3 points more than Italy. If they beat Estonia and Italy fails to defeat Moldova, they will return to the World Cup for the first time since 1998.\n\n\n\n\n\nHowever, if Italy beats its rival, the group will be decided in the final round of fixtures, when the two teams will play against each other on 17 November.\n\n\n\n\n\nMeanwhile, Austria will also qualify for their first World Cup since France 1998 if they beat Cyprus and Bosnia and Herzegovina fail to defeat Romania on 15 November.\n\n\n\n\n\nAlso in November, the final round of the Confederation of North, Central America and Caribbean Association Football will be played, and the three group winners will qualify directly to the World Cup.\n\n\n\n\n\nSuriname, Jamaica and Honduras are currently at the top of their groups, but standings could change quickly.\n\n\n\nNot entirely over for other teams\n\nThis won't be the end of the World Cup qualifiers excitement, as the fate of six more teams will be decided in March.\n\n\n\n\n\nDuring that period, all 12 group runners-up in Europe will compete in the second round of qualifying. The four best winners from these matches will move forward to the World Cup.\n\n\n\n\n\nSix other non-European teams will also contest in March’s inter-confederation play-offs, seeking their last chance to secure a spot in the 2026 World Cup.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-xeros-sukhinder-singh-cassidy-asx-tumbles-on-jobs-gain/ehl367j13",
    "title": "CEO Series: Xero's Sukhinder Singh Cassidy & ASX tumbles on jobs gain",
    "publish_date": "Thu, 13 Nov 2025 06:54:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/philippines-in-tatters-trump-taps-a-former-terrorist-and-well-bob-ross/sbweyrlv1",
    "title": "Philippines in tatters, Trump taps a former terrorist and, well, Bob Ross",
    "publish_date": "Thu, 13 Nov 2025 05:37:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/what-is-next-for-the-liberals-now-they-have-scrapped-their-net-zero-commitment/0wpdb6fjq",
    "title": "What is next for the Liberals now they have scrapped their net zero commitment?",
    "publish_date": "Thu, 13 Nov 2025 05:26:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"The Liberal Party will remove a net zero target from our policy, and if elected, we will remove the 2030 target and its net zero by 2050 target from the Climate Change Act.\"\n\n\n\n\n\nThat was Opposition Leader Sussan Ley, announcing the Liberal Party's long-awaited position after a party room meeting in Canberra - and weeks of discussion over the issue.\n\n\n\n\n\nBut the vote wasn't a clean sweep.\n\n\n\n\n\nIn the party room, 28 people came out swinging against the net zero target, including some senior members within opposition leader Sussan Ley's shadow cabinet like Michaelia Cash, James Patterson, Melissa McIntosh, Ted O'Brien and even Ms Ley's leadership rivals Angus Taylor and Andrew Hastie.\n\n\n\n\n\nSenator McIntosh says dropping the target is the right thing for her constituents.\n\n\n\n\n\n\"This morning I went into the party room yesterday really strong in my conviction on behalf of my community when it comes to dropping net zero and it was never about anti climate or anti environment ..it was pro reality... and people in the suburbs... it's literally survival in the suburbs, they are dying under the Albanese government's mistargets when it comes to emission reduction.\"\n\n\n\n\n\nMeanwhile, senior moderates such as Andrew Bragg, Maria Kovacic, Angie Bell and Paul Scar were in favour of net zero.\n\n\n\n\n\nOn Sunday, Andrew Bragg told ABC's David Speers he'd leave the shadow cabinet if the commitment to net zero emissions by 2050 was ditched.\n\n\n\n\n\n\"Well, sure, but I don't imagine that we would ever leave Paris. I mean, we're a party of government, right? We're not a fringe party. We're not fringe dwellers. Most Australians want us to play our fair role in terms of emissions reduction.\"\n\n\n\n\n\nTim Wilson has also been vocal about his support for the 2050 target.\n\n\n\n\n\n\"We just end up being the national party lite, or we can define the future of the country. We can fight for hope and opportunity and building out and re-industrialising our country with the energy sources that we need. Setting a sovereign target for our emissoins and of course building out our clean industrial future.\"\n\n\n\n\n\nSouth Australian senator Andrew McLachlan\n\n\n\nhas been asked what he would say to his colleagues who felt that dropping Net Zero was electorally advantageous.\n\n\n\n\n\nMr McLachlan, known as a vocal advocate for climate action, gave this response.\n\n\n\n\n\n\"You're wrong. What more can I say? I try to argue the case. I don't think I'm alone in in the community, not only from a grassroots level, but also, for example, the National Farmers Federation, certain business councils. I mean, if you're going to argue that we're going to abandon Net Zero, you're going to be very alone in the community, and also the business community.\"\n\n\n\n\n\nSo will Liberal frontbenchers like Andrew Bragg quit?\n\n\n\n\n\nAnd what does it mean for the party?\n\n\n\n\n\nThe shadow ministry is maintaining its support for staying in the Paris Agreement, and wants to set Nationally Determined Contributions (NDCs), which are five-year targets that are not legally binding under the internationally enforceable commitments.\n\n\n\n\n\nThe opposition leader has also tasked energy spokesman Dan Tehan, moderate Anne Ruston and conservative Jonno Duniam to negotiate with the Nationals on a joint coalition position on net zero.\n\n\n\n\n\nThey will enter discussions with Nationals senators Matt Canavan, Ross Cadell and Susan McDonald over coming days before a joint partyroom meeting on Sunday to rubber-stamp a policy.\n\n\n\n\n\nLiberal moderates have argued their chances of winning back vital inner-city electorates will be diminished as a result of scrapping their net zero commitment.\n\n\n\n\n\nBut frontbencher Alex Hawke disagrees.\n\n\n\n\n\n\"I've got no doubt a lot of people in the left, led by Labor and others, will make political claims about those sorts of things. The reality of net zero is the government has failed to put forward policies that will even achieve its own objectives.\"\n\n\n\n\n\nMeanwhile, teal independent MP Sophie Scamps has told Channel Nine's Today Show that the net zero debate shows the party has been influenced by Barnaby Joyce and Gina Rinehart for way too long.\n\n\n\n\n\n\"So they've been led around by the nose by the Nationals for way too long. And I think what we see now, if the Liberals really wanted, did want to have their own policies, then they should have stayed separate from the Nationals, but they didn't. They knew they've joined them. They're joining their policies, and they don't have their own, and they've showed, I think, a real lack of leadership on the biggest issue of our era, and have done so for decades now, and that's why we are seeing the demise of the Liberal party.\"\n\n\n\n\n\nOther independent MPs like Allegra Spender say the Liberals aren't just abandoning net zero but evidence-based policy thinking.\n\n\n\n\n\nClimate Council chief executive Amanda McKenzie says the Liberal party's decision will \"let climate change rip.\"\n\n\n\n\n\nPrime Minister Anthony Albanese says the Liberals' internal divisions are leaving Australians worse off.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/inside-the-etta-team-s-new-public-house-in-the-former-bar-romantica-space-20251114-p5nfh0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside the Etta team’s new ‘public house’ in the former Bar Romantica space",
    "publish_date": "Fri, 14 Nov 2025 13:03:11 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nDaphne is not a pub or a wine bar or a restaurant. It’s all of the above and more.\n\n1 / 11 Daphne is Etta’s more affordable, casual sibling venue. Shelley Horan 2 / 11 Hannah Green’s Daphne is a pub, wine bar and restaurant rolled into one neighbourhood institution. Ashley Ludkin 3 / 11 Wood-fire oven roasted half chook with blistered grapes and a salty-sweet agrodolce-like sauce. Kristoffer Paulsen 4 / 11 The former Bar Romantica space has been redesigned by IF Architecture. Shelley Horan 5 / 11 Potato flatbread with mussels escabeche and whipped cod roe. Kristoffer Paulsen 6 / 11 The Guinness Americano cocktail tastes like a “chocolate negroni”. Shelley Horan 7 / 11 Bloody Mary salad. Ashley Ludkin 8 / 11 Ricotta tortellini with artichoke, radicchio and milk sauce. Shelley Horan 9 / 11 From left: Pip Littore, chef Diana Desensi and owner Hannah Green. Kristoffer Paulsen 10 / 11 A curtained-off private dining room lies at the rear. Shelley Horan 11 / 11 Olive oil cake. Shelley Horan Previous Slide Next Slide\n\nContemporary$$$$\n\nDaphne, the sophomore opening for Hannah Green – owner of hatted Brunswick East diner Etta – has been created as a chameleon. It’s not a pub or a wine bar or a restaurant. It’s all of the above and more, intended to be a neighbourhood institution that Green calls her “public house” - just a few doors down from Etta on Lygon Street in the former Bar Romantica space.\n\nNew street-side seating flows into a casual front bar where you order at the counter. Beyond: a full-service bistro with clothed tables and a curtained-off private dining room. Presiding over the food is Diana Desensi (ex-Montalto, Saint George). The same menu runs across the front bar and bistro, featuring dishes like a fermented potato flatbread with mussels escabeche and whipped cod roe, and unusually exciting salads like a colourful cobb and an heirloom tomato medley with all the flavours of a Bloody Mary.\n\nGo for $15 martinis on Mondays (and get an olive stamp on your loyalty card so your 10th is free), $30 steak with fries on Tuesdays, and $25 handmade pasta on Wednesdays. There’s also a kids’ menu, and a supper menu on Fridays and Saturdays. With last orders at midnight, it appropriately stars a midnight spaghetti jam-packed with anchovies and capers. After dinner, the old Bar Romantica sound system cranks up for late-night DJ sets.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/goodfood/tips-and-advice/the-one-thing-that-can-ruin-your-most-prized-bottle-of-wine-20251114-p5nfh4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The one thing that can ruin your most prized bottle of wine",
    "publish_date": "Fri, 14 Nov 2025 12:59:18 +1100",
    "category": "finance",
    "authors": [
      "Huon Hooke"
    ],
    "text": "Bottle variation is a reality, but it’s misnamed. Our impression of wine varies according to what else is going on around us.\n\nBottle variation is a reality, but it’s misnamed: it’s actually cork variation since each one is different and, consequently, admits different volumes of air. This, of course, affects the way a wine develops over time. Also important is our own variation. Let’s call it “occasion variation”, an expression I first heard used by Robin Day, the perceptive former chief winemaker at Orlando Wines in the Barossa. What he meant is that our impression of a wine varies according to what else is going on: what we’re eating, the ambience of the space we’re in, the company we’re keeping and many other external influences.\n\nLet’s start with ambience. This includes noise level, the smells emanating from the kitchen, the food on our plates, the scent of the person next to us at the table and whether we’re sitting comfortably. Our palates also vary with our mood and health: whether we’re feeling as fit as a Mallee bull or not quite 100 per cent; whether we’re feeling happy or sad. And our dining companions. Who hasn’t been at a table when somebody with a loud and confident voice raves about a wine and excites the entire group? Or the reverse: someone bad-mouths a wine, which causes everyone else to either dislike it or modify their opinion downwards? This sort of crowd opinion-influencing is very common. Even among professionals, sadly.\n\nIt has to be said, however, that the ’86 Grange is a very good vintage.\n\nGot a drinks question for Huon Hooke? thefullbottle@goodweekend.com.au",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-ley-avoids-leadership-challenge-formally-dumps-net-zero-target-fishing-boats-at-centre-of-controversial-border-force-operation-20251114-p5nfd7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Ley avoids leadership challenge, formally dumps net zero target; Fishing boats at centre of controversial Border Force operation",
    "publish_date": "Fri, 14 Nov 2025 12:51:54 +1100",
    "category": "finance",
    "authors": [
      "Alexander Darling",
      "Emily Kaine"
    ],
    "text": "A small special-needs school in Brisbane’s western suburbs has closed its campus for the day, effective immediately, after finding some of the recalled sand product on site.\n\n“We have reviewed the guidance published by the ACCC regarding a recall notice of a coloured sand used in sensory play activities,” Mancel College in Fig Tree Pocket said on social media.\n\n“We have some of the product on site at Mancel College and it has been used in some of the Junior School and we have now found some in the Senior School.”\n\n“While the advice is low risk and there are only minor traces, we are acting with an abundance of caution. We are therefore advising parents that with immediate effect we are closing the entire College today.”",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/the-best-christmas-gifts-from-7-to-100-for-2025-20251027-p5n5n9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The best Christmas gifts from $7 to $100 for 2025",
    "publish_date": "Fri, 14 Nov 2025 12:35:05 +1100",
    "category": "lifestyle",
    "authors": [
      "Lauren Ironmonger"
    ],
    "text": "Nice Pickles Pickled Pineapple If they love a Hawaiian pizza, then they’ll love this jar of pickled pineapple ($15). Made in South Australia by self-professed “pickle nerds” Nice Pickles, they’re brined with mint, jalapeño and ginger, making the perfect sweet, sour and tangy addition to toasties, salsa, pizza or even avocado toast. Muji Soft Slippers\n\nThe Hultafors Fire Steel Flint ($25) is a great little tool for the habitual camper. Made from ultra-thick steel and designed for ergonomic use, both ends of the steel can be struck and it can be used in all weather conditions. Mesa Collections Fish Lemon Squeezer For the citrus lover in your life, consider this cute fish lemon squeezer ($20) from Mesa Collections. It’s a handy kitchen aide to have on hand – whether it’s juicing 10 lemons for a pitcher of lemonade or adding a final touch to a whole-baked fish – and looks pretty sitting on a kitchen shelf when not in use.\n\nThe best Christmas gifts under $50 Sabre Paris Bistrot Tortoise Tomato Knife, from Some Design Store With summer’s bounty of delicious tomatoes coming in hot, they’ll need a good knife to slice and dice them for salads and sandwiches. This Bistrot Tortoise Tomato Knife from Sabre Paris ($49), with a sharp serrated blade for slicing tomatoes cleanly without releasing all their juices, is a stylish option at the upper end of the price range. Other more affordable options include this one from Victorinox ($15) or this stainless steel one from Wiltshire ($16).\n\nStudio Roof Dutch Masters Bouquet A nice gift for someone who’s recently moved into a new home, Studio Roof’s Dutch Masters Bouquet ($40) are pretty flowers they won’t be able to kill. Printed on recycled cardboard with vegetable ink, this option is inspired by the traditional realism of painters like Rembrandt and Vermeer – but the range includes styles to suit any taste, from Monet to Van Gogh. Karst Goods Studio Muse Notebook\n\nKarst Goods’ notebooks are a great option for the accident-prone doodler or adventurer in your life. Their Studio Muse Notebook ($45) comes in a range of bold and graphic cover designs. Its clever paper, made from recycled stone, is waterproof and tear resistant and thread-bound to lay completely flat for comfortable note-taking. Produce Pod If you have someone in your life that loves a farmer’s market, Produce Pod’s Veggie Bags ($47) are a practical gift. Made with an inner cotton layer that retains moisture and a breathable outer later, they’re designed to extend the life of fruit and veggies. As a bonus, they can be thrown in the washing machine for easy cleaning. Stitched Up Embroidery Kits\n\nFor the person looking to take up a new hobby this Christmas, these embroidery kits from Australian brand Stitched Up, owned by two sisters, are a nice option. This mini lobster kit ($50), is perfect for food lovers, but the brand also sells larger sizes ($60) including this handsome Kookaburra. Kits are beginner-friendly and come with step-by-step printed instructions as well as video tutorials. Bon Lux Scallop Wheat Bag These wheat bags from Bon Lux ($40) are great for soothing cramps, sore muscles or for keeping warm come winter. Made from soft and durable linen and filled with Australian wheat and dried flowers, just put them in the microwave and heat as needed.\n\nLittle Tin Co Original Mixed 3-Pack If they love fish or have just returned from a holiday in Portugal and want to continue their tinned fish obsession, consider this Original Mixed Pack ($48) from Little Tin Co., which uses sustainably sourced seafood products using local Australian ingredients. This three pack is a nice little taster, with Port Lincoln sardines, smokey mussels and kingfish pate, but they also sell individual tins. The best Christmas gifts under $75\n\nPiecework Hors D’Ouevre Coasters For the habitual entertainer in your life, these Hors D’Ouevre Coasters from Piecework ($70) will make a fun and playful addition to their dining table. Sold as a set of four – including an oyster, olive, slice of brie and tin of sardines – they are made from soft linen (for soaking up condensation) and embroidered with cotton. Variety Hour “I Love Carbs” Cap\n\nIf bread, pasta or rice is their primary food group (and isn’t that all of us?), then they’ll love this slogan baseball cap. The “I Love Carbs” Cap from Variety Hour ($70) lets them wear their food philosophy on their sleeve (or head). It’s unisex with an adjustable back, embroidered in Melbourne and comes in this cobalt blue or a soft butter yellow. Home Lab Chilli Icon Glass Set of Four Perfect for the spice-lover in your life, these sweet Chilli Icon Glass Tumblers ($72 for a set of four) from Home Lab are perfect for serving spicy margaritas, gin and tonics or just plain old water. They come packaged in a nice gift box too for those who don’t have time for wrapping. Water and Wines Australia Wine Puzzle\n\nThis Australian Wine Puzzle ($75) from Water and Wine is a fun and hands-on gift for the aspiring sommelier in your life. Featuring colourful illustrations of Australia’s over 60 wine regions, flora, fauna and landmarks, each puzzle also comes with grape profiles and food-pairing tips. If wine isn’t their speed, Water and Wine also has puzzles for whisky, coffee and beer lovers. Toast Contrast Rim Enamel Oven Dish This enamel oven dish ($70) from Toast is a hardy kitchen workhorse and lovely gift for the busy home cook or person building out their kitchen tool kit. The contrasting blue and mahogany tones are an unusual twist on the classic blue and white enamelware, and makes an attractive serving dish straight from the oven.\n\nSanta Maria Novella Scented Wax Tablets For the person who is always impeccably dressed and appreciates the finer things in life, Italian apothecary Santa Maria Novella’s Scented Wax Tablets ($59) are a small indulgence to add a soft scent to their wardrobe. Available in a range of fragrances, tablets can be hung from wardrobe railings, nestled in the linen cupboard or packed in suitcases while travelling. The best Christmas gifts under $100\n\nSlip Zodiac Sleep Mask If they take their shut-eye seriously and also happen to be an obsessive reader of their horoscope each week, consider this sleep mask from Slip ($80). Made from pure silk, their Zodiac collection features fun and attractive designs tailored to each star sign. Green Life Table Top BBQ Grill\n\nThis Table Top Grill ($99) from Japanese brand Green Life is a great compact alternative to a Hibachi grill and ideal for kitchens large and small or taking on picnics or camping trips. Made in Niigata, Japan from a lightweight stainless steel, just add charcoal and grill yakitori, veggies, seafood. Nunu Avo Egg Cup and Bowl Smashed avo takes on a slightly different meaning with Nunu’s Avo Egg and Cup Bowl ($80). Made from hand blown glass, they can be used for eggs, as salt pinch pots or even as trinket holders. Just treat them with care and they’ll never be past their use-by date. The Strong Band Trio Set\n\nMost fitness junkies will have a resistance band or two in their arsenal. Australian personal trainers Matt and Cy noticed that traditional resistance bands lacked markers to help users track progress. Their new brand, Strong Band, makes resistance bands with measurements to fill this gap. Their trio set ($80) is a good starter kit for beginners or all-purpose base for strength training, stretching and mobility exercises. If you’re working with a smaller budget, their individual bands start at $25. Pluto Gin For the person who enjoys a good gin and tonic, South Australian distiller Pluto’s classic gin ($78), is a certified organic London dry style with delicious notes of juniper, citrus, coriander and pepper. The award-winning bottle is the perfect gift for the gin-lover with a discerning palate.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-for-heavy-losses-as-wall-street-weakens-20251114-p5nfd2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX hit hard after Wall Street tumbles; Gold miners dive",
    "publish_date": "Fri, 14 Nov 2025 12:24:11 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket is deep in the red at lunchtime after Wall Street sank to its second-worst day since April overnight amid questions over whether AI stocks are overvalued and whether the eagerly anticipated cuts to US interest rates will actually happen.\n\nThe S&P/ASX 200 was down 140.2 points, or 1.6 per cent, in early trade, with all 11 industry sectors in negative territory, led by technology and materials.\n\nThe ASX fell sharply on Friday morning. Credit: Louie Douvis\n\nFinancial stocks were punished and the big four banks are all sharply lower. ANZ Bank led the way with a 4 per cent drop while Commonwealth Bank (down 1.7 per cent), NAB (down 1.7 per cent), and Westpac (down 1.6 per cent) are also sharply lower.\n\nMining stocks lost ground, with gold miners heavily hit. Northern Star (down 3.2 per cent) Newmont (down 3.3 per cent) and Evolution Mining (down 3.3 per cent) plunged in early trade. Among the iron ore giants, Rio Tinto shed 2 per cent, Fortescue lost 1.8 per cent and BHP was down 2 per cent.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-queensland-resident-with-measles-attended-oasis-sydney-concert-storms-forecast-for-brisbane-20251113-p5nf26.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Asbestos-laced coloured sand used in Brisbane school; Gold Coast teen accused of terrorism offences; Queensland resident with measles attended Oasis concert",
    "publish_date": "Fri, 14 Nov 2025 12:23:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Mancel College in Fig Tree Pocket has closed its campus for the day, effective immediately, after discovering a toy used on campus might contain asbestos.\n\nKadink Sand, Educational Colours Rainbow Sand, and Creatistics Coloured Sand has been recalled nationally for containing asbestos.\n\nLoading\n\n“We have reviewed the guidance published by the ACCC regarding a recall notice of a coloured sand used in sensory play activities,” the school said on social media.\n\n“We have some of the product on site at Mancel College and it has been used in some of the Junior School and we have now found some in the Senior School.\n\n“While the advice is low risk and there are only minor traces, we are acting with an abundance of caution.\n\n“We are therefore advising parents that with immediate effect we are closing the entire College today.”\n\nMancel College is a special school with almost180 students enrolled at present.\n\nShortly after 11am, no additional schools had closed or reported finding the contaminated toy, although governing bodies were still performing checks across the Brisbane region.\n\nThere are more than 300 schools in the Brisbane City Council area.",
    "source": "TheAge",
    "cluster_id": 1
  },
  {
    "url": "https://www.theage.com.au/business/consumer-affairs/sold-out-by-mid-november-the-black-friday-shopping-rules-are-shifting-again-20251027-p5n5o9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sold out by mid-November: The Black Friday shopping rules are shifting – again",
    "publish_date": "Fri, 14 Nov 2025 11:53:23 +1100",
    "category": "finance",
    "authors": [
      "Jessica Yun"
    ],
    "text": "But as shoppers hunt for bargains, the consumer watchdog is hunting for deceptive advertising – and scammers are hoping to exploit click-happy customers. Here’s what you should know about Black Friday this year, and what to watch out for. Black Friday FOMO is real: Moving earlier can pay off Most retailers are now flogging deals well before November 28, earning the shopping phenomenon the nickname “Black November”. “This year, the party has started even sooner. Amazon lit the fuse, launching its Prime Big Deal Days, and it was quickly followed by leading names like Myer, David Jones and Target - all before mid-October,” said Shippit joint CEO Rob Hango-Zada.\n\nFor the month, luggage brand July’s sales are 220 per cent higher than usual. “We wanted those cases, obviously, to last through Black Friday and the busy period, and we will be restocking, but not until December,” said Pitman. Meanwhile, customer demands for lower prices, rapid delivery and seamless service are higher than ever, thanks in part to ultra-cheap ecommerce giants Shein and Temu’s low prices and Amazon’s same-day and next-day delivery times. Gen Z, in particular, have grown up with expectations of infinite choice on demand, and those who meet the expectations of this demographic – which will be the largest retail spenders by 2030 – will find success, Hango-Zada believes. “They’ve learned that they can buy a $12 outfit at midnight and have it on their doorstep the next day delivered free of charge. The implication here is that they expect that same level of convenience everywhere else,” said the ecommerce executive. “Often, the difference between the retailers that are bustling and those that are struggling is the extent to which they understand - and meet the needs of - Gen Z shoppers.”\n\nGeo-targeted ads: Promos are getting up close and personal July luggage made a point of sending more personalised, targeted ads to encourage customers to shop in-store instead of online. Why? People interact with the physical product, interact with store staff, encounter other items – like handbags or accessories – that they weren’t planning to purchase. July encourages customers to shop in person, where people tend to buy more than they do online. “What we see is a real opportunity to upsell customers,” said Pitman.\n\nCustomers tend to spend more when they come into physical stores and can touch and feel the range of products, she confirmed. “It helps to see it in real life and test out if that bag sits on that suitcase well.” Loading Meanwhile, some businesses have ditched sitewide sales to get customers to shop with them more than once through the sales season. For example, specialty sportswear store Pace Athletic has run daily November deals to keep customers coming back. “Many brands have introduced early targeted offers and have been rotating these to encourage multiple purchase occasions,” said Carla Penn-Kahn, the chief of ecommerce software platform ProfitPeak. “This is a smart strategy, by driving repeat purchases within a short period, brands can build customer lifetime value more quickly and make their customer acquisition costs more efficient.”\n\nSmall businesses are under pressure – and opting out Markdowns are great news for consumers – but more than six in 10 small business owners report feeling pressured by the period of promotions driven predominantly by global and larger retailers. Just 39 per cent of 500 small business owners surveyed by Xero say they plan to hold Black Friday sales this year, down from 50 per cent last year, while 30 per cent say they can’t afford to offer discounts. “If you’re a smaller business, that discount is directly an impact on your bottom line, and you don’t have the benefit of being a larger business with purchasing power,” said Xero ANZ managing director Angad Soin. “There’s a day-to-day cash flow reality that large businesses don’t always have to feel, or don’t always feel as acutely as small businesses do.”\n\n‘Sitewide sale’, ‘everything 20% off’: The ACCC is watching Loading Jewellery chain Michael Hill, Webjet, MyHouse, and Hairhouse Online were some of the businesses found afoul of the law in the Australian Competition and Consumer Commission’s Black Friday blitz last year – and penalised for it. For example, Michael Hill held a “25 per cent sitewide” sale that actually excluded some products, while Webjet’s advertised airfares “from $18″ that were actually three times as much by checkout after the addition of compulsory fees that were not disclosed. “We expect the ACCC to go a step further this year,” said law firm Holding Redlich special counsel Emily Booth.\n\nSweeping “sitewide” claims, was/now pricing that lacked genuine previous sale history, and “up to X% per cent off” claims that only apply to a selection of products will be in the ACCC’s sights this year, Booth said. So will bait-and-switch tactics, like advertising pictures of clothing with a certain price tag, but finding that that item is not actually sold for the advertised price. “Consumers prefer to know that everything is 20 per cent off rather than hunt through to find what is 40 per cent off.” Most retailers are now flogging deals well before November 28, earning the shopping phenomenon the nickname “Black November”. Credit: Simon Schluter If you spot a dodgy deal, the consumer cop on the beat is asking citizens to report them – and bring receipts. “We are putting retailers on notice,” said ACCC deputy chair Catriona Lowe, who said customers waiting for a Black Friday deal should make a note of prices now so they can check they’re making a legitimate saving.\n\n“Consumers shopping during the Black Friday sales are encouraged to report promotions or ads that raise concerns to the ACCC, including images of the potential misconduct.” Scammers are lurking The shopping frenzy is fertile ground for scammers, who will fabricate fake websites, sponsored social media posts and ads to cloned websites that will collect your payment data. “In Australia, we’re seeing a rise in scam emails (which began to peak around November 5) and social media ads impersonating major brands and even luxury retailers,” said cybersecurity software Bitdefender security analyst Alina Bizga. Scammers will exploit shoppers’ sense of urgency and trick them into acting quickly without verifying the deal’s legitimacy. “Australians can also expect a wave of fake delivery notifications and smishing texts as November 28 approaches,” said Bizga.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/the-cautionary-tale-of-duchess-meghan-the-kardashians-and-the-missing-poppy-20251113-p5nfat.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The cautionary tale of Duchess Meghan, the Kardashians and the missing poppy",
    "publish_date": "Fri, 14 Nov 2025 11:30:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Just so we’re clear from the off, the Duchess of Sussex is a chancer, a phony and insufferably earnest in my book. I think she believed she could modernise the monarchy by guest editing Vogue, I think she’d be a whinger when camping and I think she’ll leave Harry within the decade.\n\nBut. For the zillionth time I find myself wondering how this woman can get a break. Especially in a world where powerful men are doing things which are evil, and her latest “crime” is leaving the house without a certain accessory.\n\nPrince Harry and Meghan, the Duchess of Sussex, with Serena Williams at the Baby2Baby Gala before Kris Jenner’s 70th birthday. Credit: Getty Images for Baby2Baby\n\nThe global headlines over Meghan not wearing a Remembrance Day poppy at Kris Jenner’s 70th would make you think she’d vandalised the Cenotaph in London. “Disrespectful.” “Pathetic.” “Shameful.” She really copped it.\n\nYes, her husband Harry wore a poppy – because he’s a veteran. The poppy means something to him. It’s his story.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/environment/climate-change/monash-ends-lucrative-partnership-with-fossil-fuel-giant-woodside-20251113-p5nf49.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Monash ends lucrative partnership with fossil fuel giant Woodside",
    "publish_date": "Fri, 14 Nov 2025 11:27:58 +1100",
    "category": "finance",
    "authors": [
      "Bianca Hall"
    ],
    "text": "Monash University has ended a $43 million partnership with Woodside Energy, seeking to remove any “ambiguity” about its relationship with the fossil fuel giant.\n\nThe university’s philanthropic partnership – which included naming rights over a building at its Clayton campus – had been the source of sustained criticism by staff and students.\n\nThe Woodside Building for Technology and Design at Monash University. Credit:\n\nThe multi-award winning Woodside Building for Technology and Design will now again be known as Building 94, until a new name is selected.\n\nThe announcement draws a spotlight on the growing tendency for fossil fuel companies to seek partnerships with organisations including universities.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/i-hated-the-sport-the-incredible-turnaround-that-delivered-de-minaur-a-career-defining-win-20251114-p5nfg1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I hated the sport’: The incredible turnaround that delivered de Minaur a career-defining win",
    "publish_date": "Fri, 14 Nov 2025 11:05:05 +1100",
    "category": "sports",
    "authors": [],
    "text": "Alex de Minaur has shown extraordinary resilience to bounce back from the depths of misery and book an “incredible” place in the last four of the ATP Finals in Turin.\n\nThe Australian No.1, a picture of despair just a couple of nights earlier after feeling he’d thrown away victory during defeat to Lorenzo Musetti, started his unlikely resurrection with a backs-to-the-wall 7-6 (7-3) 6-3 win over Taylor Fritz on Thursday, his first victory at the season-ending championship.\n\nThen after achieving the two-sets-to-nil triumph - the only way he could stay in the tournament - de Minaur owed a huge vote of thanks to Carlos Alcaraz, who sealed the end-of-season world No.1 ranking by beating home favourite Musetti 6-4 6-1.\n\n“I mean, sport,” de Minaur smiled, even before the Alcaraz match. “Couple of days ago was one of the toughest days I’ve had in my career. I was in a very, very dark spot.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/why-penrith-are-the-biggest-losers-with-the-2026-nrl-draw-20251113-p5nfc3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Penrith are the biggest losers with the 2026 NRL draw",
    "publish_date": "Fri, 14 Nov 2025 11:01:08 +1100",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Nathan Cleary will need to be at his magical best if Penrith are any hope of overcoming a nightmare 2026 schedule.\n\nThe NRL released its draw for next season on Friday, and it is not good news for the Panthers and their supporters.\n\nLast year’s preliminary finalists face a gruelling first six weeks with games against premiers the Broncos in Brisbane, followed by Cronulla, the Roosters, Parramatta, Melbourne, and the Bulldogs.\n\nThe Panthers then travel to Darwin in round seven for a clash against the Dolphins.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/art-and-design/this-artist-is-a-celebrated-disruptor-but-does-her-latest-project-go-too-far-20251028-p5n5yc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This artist is a celebrated disruptor. But does her latest project go too far?",
    "publish_date": "Fri, 14 Nov 2025 11:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Loading The final designs, Hendry said, were finessed over a four-month-long exchange with her manufacturers, where they went through 35 “iterations and improvements”. But the eleventh doll in JuJu’s full line-up appears identical to what ChatGPT spat out after prompt 37. The plush toys will be sold in blind boxes from $US24 ($36). However, images created by AI are not considered copyrighted, unless the author significantly modifies it. When asked by a follower what significant modifications Hendry had made, she responded: “JuJu is for the people, I reckon.” One fan wrote on Instagram: “You’re such a great artist. I’m so disappointed to see you’re using AI, the result is a subpar mishmash of things we already have.”\n\nCan works created with AI be regarded as art at all? Sydney-based Australian multidisciplinary artist Timothy Johnston views generative AI as an extension of human expression. “The number of iterations that [Hendry] would have gone through, and prompts to learn … she’s such a perfectionist, she’s creating and creating, she’s like a potter with clay, she’s just not doing it by hand,” he says. “You still have to have the vision and put in the time to master the AI.” As Hendry noted on a video posted to Instagram: “AI is like porn, it does a job, but it does not do the job!”\n\nA representative for Hendry said the artist did not have time for an interview, a statement, or a response to this masthead’s emailed questions. Live illustrator and art teacher Cat Long, who believes art generated wholly by AI – though she is not suggesting JuJu was – is, for now at least, very distinguishable from human creation. That’s why she says the two aren’t comparable. ‘AI is like porn, it does a job, but it does not do the job!’ CJ Hendry “Does AI take the soul out of art? Does it take the spark and creativity?” Long wonders. “Things created wholly by AI, there’s probably a place for them, absolutely, in the art world … But I don’t think that they’re competing with art that’s created for the soul.” Not everyone agrees with that view.\n\nWhat it means for the artists if AI is using existing art Some commercial works are being created using already existing art and the artists are not being compensated. “Creative work can now be produced by anyone without requiring the development of skills and expertise, but this is only made possible by existing creative work underpinning the process,” warned federal arts body Creative Australia in a June submission to the Productivity Commission. “This work is often being used without consent or compensation, with significant potential impact on the financial viability of creative careers.” Aboriginal artist Emma Hollingsworth, who sells art by the name Mulganai, says one of the reasons she wanted to bring her art to the world stage was so she could bring awareness to her people and her culture. Credit: Emma Hollingsworth/Mulganai\n\nIt’s an impact felt keenly by some First Nations creatives artists, who refer to AI models training with and reproducing their art without consent as “double colonisation”. Kaanju, Kuku Ya’u and Girramay digital artist Emma Hollingsworth, also known as Mulganai, simply calls it “creative theft”. Loading “My art isn’t just a pretty picture, it comes from my identity as an Aboriginal woman,” says Hollingsworth. “It’s tied to my family, ancestors, Country and stories. AI has none of that: no lived experience, no cultural memory, no spirit or connection to Country. It can imitate styles, but it cannot carry our culture or our history.” In September, Hollingsworth found multiple replicas of her art being sold on Temu for $5 (the listings have since been taken down). Her art is a part of her, Hollingsworth says, but it also “keeps a roof over my head”.\n\nContemporary artist Blak Douglas has also seen AI-generated images resembling his art floating around, but he’s not concerned. Douglas, like Hendry, is a rebel – and his pop art-inspired portrait of Wiradjuri artist Karla Dickens won him the Archibald Prize in 2022. The Dunghutti man calls generative AI the “autotune of visual art”, and sees it as an opportunity “to reach the masses to tell them that Aboriginal art is different, modern, contemporary”. Since he started painting 26 years ago, the Dunghutti man says, First Nations art has been governed by the dot paintings stereotype. “It’s like this artistic analogy of keeping Aboriginal people within a mission,” says Douglas. “It would be nice if the layperson Googled Aboriginal art, they might see Blak Douglas.” Archibald Prize-winning modern contemporary artist Blak Douglas sees potential in generative AI to challenge people’s perceptions about what Aboriginal art is. Credit: Louise Kennerley\n\nIs it ‘autotune of visual art’ or something more sinister? A through-line of Hendry’s body of work is that, like Andy Warhol and Douglas, it disrupts the status quo and challenges what art is. Loading JuJu, Hendry says in an Instagram Story, is a commentary on how “extraordinary and ridiculous” the Labubu craze is. But long-time Hendry fan Ruby PH, a Sydney-based designer who admires Hendry’s commercial success, doesn’t see it. They say while it’s important to engage with AI and not turn away from conversations surrounding it, they were disappointed that Hendry implied other toy makers commonly used generative AI.\n\nPH says, in their experience, people making toys have storytelling backgrounds, and develop 3D animation and illustration skills to bring their characters to life. Labubu, after all, was an original character created by artist Kasing Lung before Pop Mart made it a toy. “If you were trying to make a statement about hyper-consumerism … why just do the exact thing that it’s doing? I don’t see the parody in that,” says PH, noting the final exhibit has yet to be unveiled. Where to now? Although Hendry has flirted with copyright infringement (she’s given T-shirts away for free to avoid being sued) since picking up a pencil, there is no suggestion of wrongdoing. Hendry has also been transparent about her use of generative AI, which is one of Creative Australia’s principles. Sydney-based designer Ruby PH says they admire Hendry for her commercial success and talent, but are disappointed with Hendry’s use of generative AI in the initial stages of designing her JuJu exhibit. Credit: Janie Barrett\n\nIn October, a proposed amendment to Australian copyright laws, which would have given tech firms carte blanche to train AI models on the work of local creatives, was quashed after a successful campaign fronted by artists including singer-songwriter Jack River (Holly Rankin). Loading This means that AI developers must seek permission before using creative works to train their models. Some visual artists, including Stephen Cornwell, are not taking any chances, using tools such as WebGlaze or Nightshade to protect their works from being scraped. Setting fair industry standards that protect creatives – such as the tech sector stepping up by remunerating, and seeking consent from, creatives to use their work – is critical to ensuring a future where both technology and culture can thrive, says Creative Australia’s head of public affairs, Nicola Grayson. “Being able to use AI in a safe, ethical way is potentially quite exciting,” says Grayson. “If we can work with the tech industry to really produce some great solutions, then the future will look bright.”",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/the-jet-lag-advice-you-ve-been-given-is-probably-wrong-20251106-p5n8b0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The jet lag advice you’ve been given is probably wrong",
    "publish_date": "Fri, 14 Nov 2025 11:00:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Sarah Berry"
    ],
    "text": "Heading to Europe When preparing for a big trip, however, the rules around light don’t always apply. Travelling somewhere with a time difference of several timezones or more requires a change in our light habits to help us adjust. Loading If you were preparing to travel to Europe, which is behind Australian time, you might start to slow your body clock by using bright light in the evening for about three days before you fly. Any longer is unnecessary, says Cain. “In this instance, turn the lights on, use your phone on max brightness: All the things you wouldn’t normally do,” says Cain. “It will gradually push your body with evening light, towards London time.”\n\nThis is because bright light in the morning pushes our body clock forward, while light in the evening pushes it back. Before a recent trip to London, Cain stayed up slightly later each night with bright lights on. Then, on the flight, he used light therapy glasses to keep himself awake until about 5am Australian time. “I was most of the way adjusted by the time I got there,” he says. When to avoid light Returning to Australia from Europe is trickier for our bodies.\n\nThe human clock tends to delay better than it advances, which is why people find it easier to travel west than east. This is compounded by the fact that we also often land in the morning when our bodies still think it is nighttime. Typical online advice is to get lots of bright light in our destination, especially if it’s morning there. Following this advice can make the jet lag worse. “In the middle of the night, there is a crossover point on the effect of light. You quickly go from maximum delaying effect of light (like a slowing of the clock) to maximum advancing (like a speeding up),” explains Cain. If we are exposed to light during this time, it can slow our clocks even further, or it can send the whole system into a state where it doesn’t know what time it is, says Cain: “We refer to it as light hitting the singularity.” The crossover point coincides with our core body temperature dropping to its lowest point, about 90 to 180 minutes before we normally wake up. So, for someone who typically rises at 6am, that will be somewhere between 3.30am and 4.30am.\n\nThis is the time when light is least likely to occur. When we’re travelling, it can be a different story. For instance, if someone travels from Paris to Perth and lands at around 10am Perth time, that corresponds to 3am Paris time, when their core body temperature is at its lowest. Loading “If a blanket recommendation is followed, and you seek sunlight immediately after arrival, this light exposure will push the clock in the wrong direction, causing it to shift later instead of earlier,” says Dr Dean Miller, a sleep and performance scientist at CQ University. “In effect, you’ve turned a manageable seven-hour advance into a much harder 17-hour delay – prolonging jet lag and making recovery slower.” The quickest route back to local time, says Miller, would require staying in relative darkness for the first couple of hours after landing until the body is out of the crossover period.\n\nBring on the sleep Like light, depending on how we time it, melatonin can help push our body towards the new time, or away from it, thereby prolonging our jet lag. “It’s essentially timing information,” says Cain. Specific and flexible timing information is what many apps and people offering advice get wrong, adds Cain. And if we can’t follow that advice perfectly (if we have no control over the light we are exposed to, for instance), then the advice needs to adjust. “The advice is different depending on where you’re coming from and where you’re going, but even the time of day of your flight,” says Cain. “There are so many moving parts, and you need to understand the underlying mechanisms to get it right.”\n\nWithout this understanding, “it’s dumb at its core”, says Cain, who is developing a jet lag app, which will use light sensors and adjust its advice based on the individual. With melatonin, taking it during the day when our body isn’t naturally releasing it will shift the timing of our clock, just like light. “If you’re travelling from west to east across six time zones, taking melatonin in the afternoon (in your body’s time) is good because it’ll advance your clock and that’s what you need,” he explains. “But if you took it in the late night or early morning, it delays your clock and can worsen jet lag.” Eat your way to a new destination Food and exercise may not shift our central clock, but they also work to 24-hour rhythms and can help align our peripheral clocks, such as in the liver.\n\n“Like light, food acts as a signal to our body to help set our circadian rhythms,” explains Dr Charlotte Gupta, a researcher and chrono-nutritionist at the Appleton Institute. “If we eat at a time when our body isn’t primed to be digesting food, like at night, this can contribute to misaligning our internal rhythms.” Good jet lag advice considers what time your body thinks it is, as well as what time it is in your destination. Credit: Getty Images And because our body is less able to digest what we eat, if our clocks are in sleep mode, it can make us feel more sluggish and prone to gastric upsets, common symptoms of jet lag. Gupta suggests eating (and exercising) in line with our light timing and sticking to light, unprocessed foods while our system adjusts. “Meal timing on flights is not necessarily designed around the optimal eating timing.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://au.news.yahoo.com/labor-makes-hay-coalition-abandon-163000807.html",
    "title": "Ley pledges to cut emissions despite scrapping net zero",
    "publish_date": "2025-11-14T00:51:07Z",
    "category": "finance",
    "authors": [],
    "text": "Liberal members are still committed to action on climate change, the opposition leader says, despite the party choosing to dump a net zero emissions by 2050 target from its platform.\n\nThe Liberals on Thursday unveiled a new climate policy that jettisoned the party's commitment to net-zero targets, with more taxpayer money poured into coal and gas power plants.\n\nThe party also committed to reduce emissions on average year-on-year, while scrapping legislated targets put in place by the Labor government.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nNegotiations over the climate policy will continue over coming days before a joint coalition party room meeting on Sunday to determine the final position.\n\nMs Ley said emission reduction efforts would be in line with comparable countries, even though net zero was being dumped.\n\n\"We care about emissions. That's why our policy is about reducing emissions year on year on average,\" she told reporters in Sydney on Friday.\n\n\"(Emission targets are) not just a set and forget, because we should, in the interest of Australian families and communities, look at what the reality is on the ground and how much of that reality is changing.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Liberals are still committed to the Paris climate agreement, a 2015 pact which requires countries to increase their action on emission reduction every five years.\n\nMs Ley said a different approach was needed with countries revising down their targets.\n\nThe opposition leader said the policy would focus on reducing energy bills for households and have a range of energy forms in the mix.\n\nMore gas is needed to supply Australia's energy grid, the coalition says. (Marion Rae/AAP PHOTOS)\n\nWhile she indicated more gas was needed for supply to the grid, she did not say how that would be achieved.\n\n\"Our energy mix, more broadly, is technology agnostic, so we want to use every opportunity that can be brought to bear to bring prices down to deliver a stable, reliable grid,\" she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"There are ways of injecting more gas into the system, and that supply is critical.\"\n\nEnergy Minister Chris Bowen says the coalition is avoiding action on climate. (Mick Tsikas/AAP PHOTOS)\n\nEnergy Minister Chris Bowen said climate deniers had won the battle over policy within the coalition.\n\n\"What we saw yesterday was a blaming of contradictory, internally inconsistent statements and claims, all an alibi to avoid action on the greatest environmental challenge and economic opportunity of our time,\" he told ABC Radio.\n\nOpposition energy spokesman Dan Tehan, who will be among the negotiators with the Nationals, said cheaper power bills was the priority of the policy.\n\n\"We are very, very confident that by bringing all of Australia's natural resources to this equation, that we will be able to put downward pressure on energy,\" he told ABC Radio.\n\nEnergy spokesman Dan Tehan says the Liberals' plan will be guided by a market-based approach. (Lukas Coch/AAP PHOTOS)\n\n\"We're going back to an approach where the market will determine the types of technologies and the pathways, and that is the traditional liberal approach to addressing these types of issues.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Liberal policy also reiterates support for removing a moratorium on nuclear energy in Australia.\n\nThe coalition took a proposal to May's federal election of building multiple nuclear power plants to expand the mix of the energy grid.\n\n\"Nuclear does make sense, by the way. We're going to have nuclear-powered submarines in this country,\" Ms Ley told Nine's Today program.",
    "source": "Yahoo",
    "cluster_id": 33
  }
]