[
  {
    "url": "https://www.9news.com.au/national/australian-youtube-family-announces-move-to-the-uk-to-avoid-upcoming-social-media-ban/fb06c972-d4fb-415b-87ea-6f932443961f",
    "title": "Australian YouTube family announces move to the UK to avoid upcoming social media ban",
    "publish_date": "Fri, 31 Oct 2025 00:30:00 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "A﻿n Australian YouTube family with almost 1.8 million followers have moved to the UK to avoid the upcoming social media ban for under-16s.\n\nFrom December 10, children and teenagers under the age of 16 will not be allowed ﻿to have accounts on a number of social media platforms including Facebook, Instagram, Snpachat, TikTok, X and YouTube.\n\nWestern Australia's Empire Family, made up of mums Beck and Bec Lea, 17-year-old son Prezley and 14-year-old Charli, revealed their decision in a video posted to their main channel.\n\nWestern Australia's Empire Family revealed their decision in a video posted to their main channel. (YouTube)\n\nThe family's main YouTube channel has a collective 1.79 million subscribers﻿, while Prezley's individual YouTube account has gained 2.8 million subscribers.\n\nCharli has just under 550,000 subscribers on YouTube﻿ and almost 330,000 followers on a TikTok account managed by her parents.\n\nThe 14-year-old's accounts would be impacted by the upcoming ban.﻿\n\n\"They haven't defined it exactly, of how it's going to work yet, but at the moment no under 16s are allowed to have social media, it's a protective thing﻿,\" mum Beck told subscribers.\n\n\"We understand that it is protecting young people from harm on the internet, but we use the internet for good.\n\n\"When we were looking at it, we were going to go travelling anyway, so we were like 'this is perfect' because we have dual citizenship and British passports.\n\nREAD MORE: Searchers draining dam today in renewed search for missing boy Gus\n\nThe Empire Family boast almost 1.8 million subscribers on Youtube. (YouTube)\n\n\"We've been wanting to travel for a while so now ﻿we go to the UK, we can still use our social media, Charlotte can still use her social media, Prezley is over 16, but it just kind of covers us while Australia figures out the logistics of that rule.\n\n\"I think there's going to be ﻿a lot of hiccups and a lot of ups and downs.\n\n\"We've got a massive UK audience, we've got our passports, so we thought why not?\"﻿\n\nThe family said they weren't against the social media ban and understood the proposed benefits.\n\n\"We understand that it's very important, that there's young people that are affected negatively from social media,\" Beck said.\n\n\"We're not naive to that, it's just that how it affects us and the way we use social media, where we would get caught up.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/bunnings-and-kmart-owner-reports-13500-threats-against-staff/cda03519-29a6-4b12-866c-620b02a42eee",
    "title": "Bunnings, Kmart workers facing more than 1000 physical assaults a month",
    "publish_date": "Thu, 30 Oct 2025 22:47:53 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "B﻿unnings and Kmart retail workers are facing more than 1000 physical assaults and threats from customers every month, with weapons involved in some cases.\n\nThe shocking figure was revealed yesterday by the retail giants' parent company, Wesfarmers.\n\nSpeaking at the group's annual general meeting, chief executive Rob Scott said incidents involving threats of serious harm in Bunnings stores jumped by 66 per cent while those at Kmart rose 29 per cent.\n\nBunnings and Kmart workers have been facing a wave of threats and physical assaults by customers. (Fairfax Media)\n\nShareholders heard there were 13,500 instances of customers threatening workers in the conglomerate's retail stores over 12 months.\n\nFrom more than 1000 of those incidents, physical assault or a serious threat of harm, often involving a weapon, were recorded.\n\nScott said the company has beefed up security at high-risk locations, trained workers in de-escalation tactics and introduced body-worn cameras.﻿\n\nIn an effort to combat the crisis, information had been shared with peer retailers, governments and police.﻿\n\n\"We support sensible reform, including tougher, nationally consistent penalties for violent retail crime and a national conversation to enable controlled, responsible use of technology to exclude known violent offenders from retail environments,\" Scott said.\n\nWesfarmers chief executive Rob Scott at the conglomerate's AGM in Perth, on Thursday October, 30, 2025 (Photo: AFR/Trevor Collens) (Nine)\n\nThe concerning Wesfarmers' figures coincided with new research showing Victoria was the country's retail crime hotspot, with many residents blasting the state government for a lack of action.﻿\n\nThe report by the ﻿Australian Retailers Association and National Retail Association found 79 per cent of Victorians were concerned over crime in stores and businesses.\n\nAlmost 90 per cent backed tougher penalties against offenders harming or threatening retail workers in the state.\n\nThe government of Victorian Premier Jacinta Allen has made bail laws tougher, but has come under fire from not doing more to target repeat offenders who threaten or attack retail workers.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/endometriosis-elite-athlete-katherine-smith-aflw-gws-giants/105952810",
    "title": "The invisible opponent Katherine Smith played AFLW against for years",
    "publish_date": "Fri, 31 Oct 2025 01:17:03 +0000",
    "category": "sports",
    "authors": [],
    "text": "Katherine Smith has been playing AFLW for the past eight years and through it all, has been battling severe pain.\n\nFrom training to game days, she endured painful cramps, migraines and heavy menstrual bleeding.\n\n\"It got really bad between when I was 20 and 23, where I was basically permanently bleeding,\" Smith told ABC Sport.\n\nWhite shorts were a big issue.\n\n\"There's been games when my period was so severe, one year I had to change at half-time at three games,\" she said.\n\nWith all the bleeding came iron deficiencies and exhaustion.\n\n\"The severity of it made it really difficult with sport,\" Smith said.\n\n\"I think a lot of the time I was resting so I could play.\"\n\nEndometriosis is associated with significant fatigue, which Smith has struggled with. (AFL Photos via Getty Images: Michael Willson)\n\nThrough it all, the 27-year-old knew something was not right.\n\nShe was only diagnosed with endometriosis three years ago.\n\nIt is a condition where tissue, such as the lining of the uterus, grows in other places and can cause serious pain.\n\nIt affects one in seven women, with new research putting diagnosis at around five years, instead of six and a half.\n\nSmith's diagnosis took a bit longer, despite speaking up about her symptoms.\n\nShe said the responses often came down to having a bad period that she would just have to live with.\n\nConditioned to push through pain\n\nIt is a sentiment AFLW clubs and other codes are set on changing.\n\nSports exercise and pelvic health physiotherapist Jess Cunningham has been working with the Giants to help identify players who may have endometriosis and put them on a path to treatment.\n\nIt took around seven seasons for Smith's diagnosis to come about. (AFL Photos via Getty Images: Michael Willson)\n\nShe has done similar work with AFLW clubs Geelong and the Gold Coast, Football Australia and Rugby Australia, and the Giants and NSW Swifts Super Netball teams.\n\n\"We screen all the athletes around menstrual health, pelvic health and breast health,\" Cunningham said.\n\n\"From there, we can find out who's flagging for those certain areas and then put in the processes, whether that be working with their existing team doctor, dietician or physios, facilitating specialist referrals or using my pelvic health physio services as well.\"\n\nCunningham said some athletes were reporting significant endometriosis symptoms.\n\n\"Whether it's period pain or [issues with] bladder, bowel or sexual function — they just thought that was their normal,\" she said.\n\nJess Cunningham has been working as a female athlete health consultant with the Giants. (ABC Sport: Jack Ailwood)\n\nIt took around seven seasons for Smith's endometriosis to be identified, but she was quick to point out that delay was no-one's fault, it simply was not discussed.\n\n\"Once we had Jess come on board and be open about the fact that irregular periods, severe cramping, that's not okay, that really hit home for me,\" Smith said.\n\nCunningham said along with trying to avoid stigma around their menstrual cycles, athletes could under-report symptoms.\n\n\"They may have a family member who has similar symptoms that have been considered normal,\" she said.\n\n\"It also might be they don't want to report it for fear of potentially not being selected or included.\n\n\"And often I find with athletes, if they were reporting six out of 10 for knee pain, that would be something they would flag.\n\n\"But if you ask them how painful their periods can be, they'll often think that a six out of 10 pain is okay.\"\n\nSmith has had surgery to address endometriosis, and says it has improved her performance. (Getty Images: James Worsfold)\n\nThe impact of endometriosis on performance\n\nCommon symptoms of endometriosis can include fatigue, period pain that interferes with daily life, pain during ovulation, pain in the pelvis, lower back or legs, pain when going to the toilet, pain during or after sex, and heavy or irregular bleeding.\n\nEndometriosis Australia medical director Associate Professor Anusch Yazdani said it was important to know that period pain was not normal.\n\n\"I think pain interfering with your life is never normal,\" Dr Yazdani said.\n\n\"Pain that stops you from going to work, stops you from going to university, needs to be investigated.\"\n\nAnusch Yazdani wants women to know that period pain is not normal. (Supplied)\n\nEndometriosis can have a big impact on an elite athlete's performance.\n\nSmith was often in pain when she needed to run or cycle hard, for about five to six minutes.\n\n\"Any time there was a time trial, you knew you were going to be in severe pain,\" she said.\n\n\"With that high intensity activity over a sustained period, it got to the point where the cramps were so severe I had to stop.\"\n\nGiants AFLW and netball head physiotherapist Gemma Vale said training was often modified to an athlete's comfort levels.\n\n\"There is a bit of a push for modifying training around different phases of the cycle,\" Vale said.\n\n\"But I think we do need to be very individualised in what they need, whether it's [adapting] volume of training [or] what they're lifting in the gym.\n\n\"It's more about [asking], 'How are you feeling today, what do you have the capacity for?'\"\n\nTraining is often modified to an athlete's comfort level. (Getty Images: Dylan Burns/AFL Photos)\n\nFighting the mental battle as well as the physical\n\nEndometriosis has typically only been diagnosed through a form of surgery called a laparoscopy.\n\nDr Yazdani said it no longer required that.\n\n\"We can make a very good diagnosis based on an ultrasound scan, but also on a lot of clinical presentation,\" he said.\n\nHowever, it is one of the mainstays of treatment, as it confirms a diagnosis while a surgeon removes tissue at the same time.\n\n\"It has a very good chance of reducing significant types of pain, for example, pain with intercourse, pain with periods,\" Dr Yazdani said.\n\n\"Other types of pain, it's less likely to help. So the bowel changes, the bladder changes, they all need to be addressed individually.\"\n\nThere were times Smith would only have two days in a month where she was not bleeding. (AAP: Darren England)\n\nSmith has had surgery and said she could now train harder and for longer.\n\n\"The symptoms have been so much better,\" she said.\n\n\"Now that I'm able to do those things with comfort, the ability to perform at that intensity for a longer period of time has impacted my performance.\"\n\nLooking forward, Smith wants to normalise conversations around women's health, so that others do not have to play through the pain like she did.\n\n\"Irregular periods, severe cramping, back pain, it isn't normal,\" she said.\n\n\"I guess as high achievers, people want to be like, 'I'm fine, I'm going to keep pushing', because you want to be the best you can.\n\n\"But that first step of acknowledging it is not normal and that we can do something to fix it, is important.\"",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/ley-visit-to-tomago-cancelled/105956788",
    "title": "Opposition infers Labor scuttled Ley's planned visit to Tomago smelter",
    "publish_date": "Fri, 31 Oct 2025 00:50:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sussan Ley has been barred from touring the troubled Tomago aluminium smelter, where she planned to hold a press conference, with the opposition leader suggesting political game-playing by the Albanese government.\n\nThe opposition leader's office alerted the media to the \"picture opportunity and doorstop\" at the Rio Tinto-owned smelter, to be held just after 10:00am on Friday.\n\nHowever, Ms Ley's office has revealed the tour of the plant, near Newcastle, was cancelled at the last minute, but she was still granted a meeting with the chief executive Jérôme Dozol.\n\n\"I'm very happy I was able to have the meeting, I'm not reflecting on the Albanese government other than to say they need to get their act together and come up with an energy policy that actually works,\" Ms Ley said.\n\n\"The Albanese government and their henchmen can play games all they like.\n\n\"I'm only interested in the workers, the production and the pride we should all have in an aluminium smelter that is the best in the world.\"\n\nLoading...\n\nThe opposition leader's office told the ABC: \"It's a worrying sign when businesses are too nervous to have an open conversation about policy for fear of political consequences.\"\n\nEarlier a spokesperson claimed the government had interfered in the scheduled visit. Labor flatly denies the accusation.\n\nTalks with Rio Tinto about smelter's future\n\nRio Tinto this week told the more than 1,000 workers that it was considering closing the 40-year-old plant because of high electricity costs.\n\nThe shock announcement has sparked opposition accusations that Labor's energy policies, and pursuit of a renewables-dominated grid, are \"killing\" heavy industry.\n\nTomago is Australia's largest aluminium manufacturer and largest single user of electricity, with its power bill accounting for 40 per cent of its costs.\n\nThe federal government is locked in negotiations with Rio Tinto and the New South Wales government to save the smelter, putting all options on the table, including a possible long-term power purchase agreement.",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/queensland-growers-trial-canola-with-strong-prices/105948370",
    "title": "Golden crop brings new opportunities for Queensland farmers",
    "publish_date": "Fri, 31 Oct 2025 00:02:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Comparatively strong prices and new heat tolerant varieties have encouraged Queensland farmers to expand into growing canola.\n\nThe oilseed, used to produce cooking oil and biofuels, is predominantly grown in southern states, where dry conditions have impacted plantings and yields.\n\nBut along the New South Wales/Queensland border, farmers like Nigel Corish are harvesting their first trial crops, and have been impressed with the results.\n\n\"I think we got $690 per tonne delivered to Boggabilla (NSW), which is about 200 kilometres south,\" he said.\n\n\"It's quite reasonable, given where the other commodity prices are.\"\n\nNigel Corish farms on Queensland's Western Downs. (ABC Landline)\n\nMr Corish said a 60-hectare trial crop on his property at Condamine, 330 kilometres west of Brisbane, was a success — yielding 1.5 tonnes per hectare — even though there was nowhere in Queensland to process the grain.\n\nHe said he planned to grow more next season, adding to his rotation for the lighter, gravelly, Western Downs soil that was unsuitable for other crops.\n\n\"I can see canola taking up around that 15 to 20 per cent of the area, particularly on poor soil type areas,\" he said.\n\n\"Particularly those soil types that aren't suitable for sorghum or dry land cotton when it does get hot during our summer.\n\n\"It helps with some soil disease and sort of changes the soil structure a little bit.\"\n\nFor most of the season, growers could sell their canola for more than $700 per tonne — hundreds of dollars higher than other winter crops.\n\nMr Corish said canola's improved profitability added to its appeal as a rotation crop.\n\n\"The price of canola actually factors into the gross margin of the [entire] cropping system,\" he said.\n\nHe said at least four other growers in his region intended to trial canola for the first time next season.\n\nCanola prices have been stronger than other commodities this growing season. (ABC Rural: Jane McNaughton)\n\nWhy canola?\n\nIndependent Commodity Management market advisor Matthew Leeson said the canola market was a strong performer when compared to other broadacre crops grown in Queensland such as wheat and barley.\n\nHe said demand in the export market and seasonal conditions had boosted production in Queensland.\n\n\"We've seen an increase in demand globally, which has supported prices domestically,\" he said.\n\n\"Production really hasn't kept up with that.\"\n\nHe said global market volatility was also a factor.\n\n\"We've also got a trade spat between Canada and China at the moment, which is limiting the canola that Canada can ship,\" he said.\n\n\"That's moved demand to Australia.\"\n\nAccording to the Australian Bureau of Statistics, Australian farmers planted 3.7 million hectares of canola in 2023-24, mostly in Western Australia, New South Wales, Victoria and South Australia.\n\nQueensland, by comparison, grew a total area of 7,036 hectares, but Mr Leeson said new varieties meant there was even more opportunity for that to grow.\n\n\"If we can get some more malleable varieties that can handle a warmer spring and the prices hold up, then it certainly does have a part in our rotation,\" he said.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/pacific-championships-australia-jillaroos-new-zealand-kiwi-ferns/105956360",
    "title": "Jillaroos dealt massive injury blow ahead of Kiwi Ferns Test",
    "publish_date": "Thu, 30 Oct 2025 23:56:21 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia is hopeful Tamika Upton will return from injury for the Pacific Championships final, after the Jillaroos fullback was ruled out of Sunday's group match against New Zealand in Auckland.\n\nTwo-time Dally M medallist Upton succumbed to a calf strain on Friday, opening the door for Abbi Church to make her Test debut at fullback at Auckland's Eden Park.\n\nThe Jillaroos and Kiwi Ferns have already qualified for the Pacific Championships final, which will be played in Parramatta on November 9.\n\nJillaroos thump Fetū Sāmoa The Jillaroos show why they are world champions, recording a dominant 60-0 victory over Fetū Sāmoa in Brisbane.\n\n\"Tamika pulled up on Tuesday's training with calf soreness, so our performance staff just took some precautionary actions and wanted to get that checked out,\" Jillaroos coach Jess Skinner said.\n\n\"It's been a really long season for Tamika and she has had issues with the calf previously.\n\n\"She's got a minor strain, so it's best that we look after her and work towards getting her back for next week.\"\n\nUpton scored two tries for the Jillaroos in their 60-0 thrashing of Fetū Sāmoa in last Sunday's Test in Brisbane.\n\nThe Jillaroos have also lost reserve forward Mackenzie Weale for the rest of the tournament with a pelvis injury.\n\nWeale had been named on an extended bench to face the Kiwi Ferns.\n\nAbbi Church will make her Test debut for the Jillaroos on Sunday. (Getty Images: Cameron Spencer)\n\nUpton's injury hands Church a fitting opportunity to debut.\n\nThe Parramatta star impressed for NSW in State of Origin this year and was part of Australia's extended squad for last year's Pacific Championships.\n\n\"It's a great opportunity for Abbi to make a debut, someone who's been part of the campaign over the last two years,\" Skinner said.\n\n\"She's been working really hard, has had a great season as well, so it's another opportunity for a debutant.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/snakes-becoming-more-prevalent-on-the-darling-downs/105953444",
    "title": "Darling Downs 'inundated' with reports of snakes, bites and near misses",
    "publish_date": "Thu, 30 Oct 2025 23:50:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Gunter Glasser has been catching snakes for almost 30 years across Southern Queensland, and October has been a busy month.\n\nSome days, he receives up to six calls to catch and relocate snakes from all manner of peculiar places.\n\nEmergency services have also received an uptick in snakebite presentations since August, and vets have been \"inundated\" with pets encountering the venomous reptiles.\n\nGunter Glasser removes an eastern brown snake from a home on the Darling Downs. (Supplied: Snake Catcher Darling Downs 24/7)\n\n\"This October has been busier than last October,\" Mr Glasser said.\n\n\"It's been probably two every day, but then I've had up to six and then sometimes I've had to refer to another catcher if he was available.\n\n\"This October, I've had quite a few more eastern browns than [the usual] carpet pythons.\"\n\nSnakes in backyards have been the most common call-outs, but Mr Glasser said he also removed snakes from inside cars and houses.\n\nHe urges people to keep an eye on the reptile after they first spot it to avoid a surprise when the snake catcher shows up and it is missing.\n\n\"Quite often you go to the people's place and they're not there, they're inside having a cuppa or something,\" Mr Glasser said.\n\nThe eastern brown snake was found hiding inside a home at Vale View. (Supplied: Snake Catcher Darling Downs 24/7)\n\nAmbos 'ready' for increase in snakebite call-outs\n\nIn August, Queensland Ambulance Service (QAS) recorded three snakebite presentations in the Darling Downs and south-west regions. That number jumped to 10 in September.\n\nWhile the official October data was yet to be finalised, QAS senior operations supervisor Peter Crooks said, with summer approaching, paramedics were prepared for an expected increase.\n\n\"It's something that's in the back of our mind, we're ready for any and all situations, but snakes in the warmer months do become active and move around, and we see a lot more bites and requests for service,\" Mr Crooks said.\n\n\"Previous years, like October last year … the Darling Downs saw 17 in total and, in November, [there were] eight in total and December [had] 22.\"\n\nPets also at risk\n\nHighfields vet Dr Alex Bailey said his clinic had been \"inundated\" with snake incidents at the start of October, with two to three confirmed cases on average a week.\n\nOne of those cases was Lottie, a golden retriever, who was brought in by her owner immediately after being bitten by a snake. She made a full recovery.\n\nLottie fully recovered after being bitten by a snake on the Darling Downs. (Supplied: Highfields Vet Surgery)\n\nDr Bailey said it was a good reminder that, while it can be difficult to determine if an animal has been bitten, there will be signs.\n\n\"If they have been bitten … things like sudden collapse, sitting, struggling to breathe or unable to get up, and things like that would be the main things,\" he said.\n\n\"Other things you can do is [check if] they might have pale gums and really big pupils in their eyes.\"\n\nDr Bailey said snake venom could act similarly in animals as it did in humans because \"they're both mammals\".\n\n\"With humans, often you know you've been bitten … whereas in dogs, they can't tell us that they've been bitten and we can catch it a little bit later and that's when we see the more profound effects of the venom working on their body with significant paralysis and things like that,\" he said.\n\n\"Another thing that often we find with dogs is that usually if a human gets bitten, it's a quick bite and the human moves away. Whereas, with a dog, they're going to bite back and often will attack the snake, and they have a bit of a fight, so there's probably multiple bites and a significant more amount of venom going into the body of the dog.\"\n\nTop tips if snakes are about\n\nQAS urged people to be vigilant when out and about in nature.\n\n\"Prevention is better than a cure when it comes to snakes,\" Mr Crooks said.\n\n\"Try and avoid them, wear long pants and clothes [and] enclosed shoes if you're walking through the long grass.\n\n\"Be aware of your surroundings, especially in rural areas like on farms and in gardens. They tend to hide amongst the leafy areas and a little bit of grass [so] you can't really see them.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/black-bearded-irises-bloom-on-flower-farm-in-time-for-halloween/105942068",
    "title": "'Near black' flowers that bloom just in time for Halloween",
    "publish_date": "Thu, 30 Oct 2025 23:36:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victorian flower farmer Caitie O'Grady has watched her black bearded irises bloom just in time for Halloween.\n\n\"When it comes out to bloom, it's usually near Halloween, which is really cool, and people are drawn to it because it's so unique.\"\n\nMs O'Grady said the bearded iris variety was called \"black suited\" but technically, it is not true black.\n\nThe \"black suited\" irises are actually deep purple. (ABC Rural: Annie Brown)\n\n\"There are no true blacks in terms of flowers, but they get very close, but this is the darkest I've seen,\" she said.\n\n\"It's near black, a very, very dark purple.\"\n\nThis is just one of the hundreds of varieties of bearded irises Ms O'Grady grows on her property, at Ebden, on the banks of Lake Hume in north-east Victoria.\n\nIrises come in a broad spectrum of colours. (ABC Rural: Annie Brown)\n\nShe has been specialising in bearded irises since 2018.\n\n\"There are probably less than a dozen growers left in Australia now, and it's not a common flower grown throughout Australia.\"\n\nCaitie O'Grady grows 800 varieties on her farm. (ABC Rural: Annie Brown)\n\nAfter the flowers have bloomed, Ms O'Grady digs up the rhizomes and sell them across the country.\n\n\"They are extremely tough — we don't have town water so we had to choose a flower which is hardy.\n\n\"They can survive prolonged dry periods for months and they also love frosts.\"\n\nThe rhizome is sold on to other growers. (ABC Rural: Annie Brown)\n\nFloriculture is on the rise in Victoria, and according to data from the state's department of agriculture, the sector's gross value is worth $1.2 billion.\n\nMs O'Grady said demand for her flowers was strong.\n\n\"We're supplying throughout Australia — we post the bare root rhizomes in March all the way up to Queensland.\"\n\nCaitie O'Grady says the flowers remind her of French cancan dancers. (ABC Rural: Annie Brown)\n\nCatching the 'iris virus'\n\nThe iris flower is named after the Greek goddess of the rainbow, Iris.\n\nAnd there is no shortage of colour combinations.\n\nCaitie O'Grady has always had a love for growing flowers. (ABC Rural: Annie Brown)\n\n\"We grow more than 800 different varieties of bearded iris, so there's certainly lots of colours,\" Ms O'Grady said.\n\nThe \"beard\" refers to the fuzzy, yellow stem that comes from the middle of the flower.\n\nThe \"beard\" is the yellow, fuzzy stem. (ABC Rural: Annie Brown)\n\n\"I would describe a bearded iris as looking like a French cancan dancer — the falls look like ruffled skirts.\n\nYellow and purple bearded irises. (ABC Rural: Annie Brown)\n\n\"Once people have started with one or two they see their beauty and the iris virus takes over.\n\n\"But there are worse addictions out there, so if I can buy a few more flowers then that's OK.\"\n\nThe \"black suited\" iris blooms towards the end of October. (ABC Rural: Annie Brown)",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/coastal-accommodation-down-amid-sa-algal-bloom/105938456",
    "title": "SA coastal tourism down, even in towns without algae",
    "publish_date": "Thu, 30 Oct 2025 23:10:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Accommodation providers in South Australia's south-east have seen a downturn in recent months, despite being free of the algal bloom impacting parts of the state.\n\nIn the tourist hotspot of Robe, council chief executive Nat Traeger said booking rates were down about 25 per cent compared to normal, despite no detections of harmful algae in the area.\n\nMs Traeger said some businesses attributed the downturn to messaging around the bloom.\n\nLong Beach at Robe is a popular location for tourists. (Supplied by @joshsilver95. )\n\n\"We also know from a council perspective in the month of September, compared to 2024, we were well over 1,000 visitors down in our visitor information centre,\" she said.\n\n\"In July and August 2025, compared to 2024, Robe was in the top three towns in Australia for increase in visitor spend.\n\n\" We think that the downturn can only relate to the algal bloom, when the two months before we were on the up and up. \"\n\nCape Jaffa Holiday Park's Mark Ireland. (ABC South East SA: Josh Brine)\n\nA difficult year for towns\n\nAbout half an hour's drive away, Mark and Rebecca Ireland run the holiday park in the small coastal town of Cape Jaffa.\n\nThe town has faced its fair share of challenges, with storms damaging the jetty and leading to a closure of the town's marina.\n\nMr Ireland said perceptions of the algal bloom just added to the woes.\n\nCape Jaffa's jetty has been repaired, after sustaining damage in storms earlier this year. (ABC South East SA: Josh Brine)\n\n\"There's a bit of a pre-conceived notion from a few people that the algae bloom is up here, but it's not,\" he said.\n\n\"We do keep telling people the bloom's not here, and fishing is great.\n\n\"Heading into summer, we hope we get a few more bookings start to come in, or it's going to make it a very difficult one.\"\n\nChris and Tracey Jensen became managers of the Kingston Foreshore Caravan Park earlier this year. (ABC South East SA: Josh Brine)\n\nVouchers a welcome boost\n\nAt nearby Kingston South East, caravan park managers Chris and Tracey Jensen took over operations of the park earlier this year.\n\nWhile they have not had anyone cancel bookings, some guests have asked questions about the bloom.\n\nMr Jensen said the state government's Coast is Calling vouchers have been helpful for the town.\n\n\"It's getting people in and around the state doing something, instead of gloom and doom,\" he said.\n\n\"I think it's a really good incentive from the government. I believe we've had about 50 applicants take up the deal.\"\n\nMark Ireland is hoping the summer period is busier in Cape Jaffa. (ABC South East SA: Josh Brine)\n\nWith the Cape Jaffa jetty repaired, and works to clear the marina entrance underway, Mr Ireland said he was looking forward to more bookings heading into summer.\n\n\"This time last year the phone was ringing a lot more … but all we can do is hope,\" he said.\n\nBack in Robe, the council is using naturally occurring foam at a local lake as an opportunity to let visitors know the town is algae-free.\n\n\"Unfortunately, the messaging is statewide and it does impact all of the state's coastline,\" Ms Traeger said.\n\nFor town's on the Limestone Coast like Kingston, tourism is important to the local economy. (ABC South East SA: Josh Brine)\n\nThe South Australian Tourism Commission said the majority of booking cancellations had come from travellers within South Australia.\n\n\"Parts of the Limestone Coast are included in the Coast is Calling travel voucher and Dining Cashback programs, which aim to boost visitation and economic activity along our state’s coastline by South Australians,\" a spokesperson said.\n\nA ballot for a second round of Coast is Calling vouchers is set to open for registration in December.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/wa-town-could-be-left-without-a-postcode-without-a-buyer/105951270",
    "title": "Why this popular WA tourist town could soon be left without a postcode",
    "publish_date": "Thu, 30 Oct 2025 22:28:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "A resource and tourism hub in WA's north-west could soon be without postal and banking services, as the owners consider closing the doors after failing to sell.\n\nIt is one of a string of regional businesses struggling to attract buyers.\n\nPosties General Store in Onslow, 1,300 kilometres north of Perth, operates as a post office, bank, newsagency, bottle shop and lottery office.\n\nGerard and Judy Carroll have owned the business for 27 years and have been trying to sell it for the past two.\n\n\"We will have to give Australia Post three months' notice, and we'll just have to close it down,\" Mr Carroll said.\n\nAbout 900 people live in the coastal community of Onslow. (ABC News: Mietta Adams)\n\nOnslow is one of four key towns in the Shire of Ashburton, all without a single bank branch.\n\nPersonal and business banking plays a large part in Posties.\n\n\"If there are no buyers, if we have to close down and they haven't got any alternatives, there will be an impact,\" Mr Carroll said.\n\nThe nearest town with post office and banking is Karratha, 300 kilometres away.\n\nOnslow Beach resort manager Ben Matters said the store was essential for the community of nearly 1,000 residents.\n\n\"It's a vital cog in a really bustling little community town,\" he said.\n\n\"We rely on it quite heavily, we're a long way from everywhere else, so they're a really important part of our local community.\"\n\nHe said the community should start thinking about \"strategies around what to do\" if it closed.\n\nOnslow is 300 kilometres from Karratha, its nearest large town. (ABC News: Mietta Adams)\n\nOthers struggle to sell\n\nThe struggle to find a buyer in Onslow is part of a larger trend of businesses struggling to attract investment across regional WA.\n\nCarnarvon automotive business owner, Ben Broeder, said he had been \"rattling cages\" for a buyer for his business since Christmas last year.\n\nHe said forced closures in regional areas were a \"sad reality\" with challenges attracting staff, housing shortages, and expensive freight and insurance costs.\n\n\"Everything's fighting against business owners,\" Mr Broeder said.\n\n\" The way things are going for regional Australia, there's going to be very little services and infrastructure left. \"\n\nSaving outback post offices Ashlee Gray saved her local store when she decided to buy the local post office.\n\nRegional Development Australia Pilbara CEO Daiva Gillam said that without a post office, the town would lose its postcode.\n\n\"With that, you can lose part of the cultural identity of the community,\" she said.\n\nMs Gillam said investing in small regional businesses had become less attractive in recent years.\n\n\"Those that have have invested their wellbeing and livelihoods in small businesses in the Pilbara are struggling to get out and they're closing their businesses down,\" she said.\n\n\"It's not unique in the Pilbara — it's replicated across Australia, and regional Australia in particular.\"\n\nShe said industry intervention may be required to ensure the general store can continue operating.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/aldi-investigates-static-shocks-nambour-store/105942226",
    "title": "Aldi shoppers report 'ripper' static shocks at supermarket",
    "publish_date": "Thu, 30 Oct 2025 22:00:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "For food delivery driver Louise Turner, shopping at her local supermarket on Queensland's Sunshine Coast has been a hair-raising experience.\n\n\"I keep getting zapped every time I go in there,\" Ms Turner said.\n\n\"I actually tried to film it once but when it zapped me I dropped my phone. I got a little video of my hair standing up and sent it to my children and they were like, 'Oh God, Mum!'\n\n\" It's like a full 'ow' and it drives me bonkers. I thought it was just me. \"\n\nLoading...\n\nBut when she took to her local online community board to see if anyone else had felt the same while visiting the Nambour Aldi store, her post sparked dozens of comments.\n\nWithin 12 hours, more than 80 people, including Tim Dixon, also reported experiencing regular shocks at the store.\n\n\"You go to touch something in there, anything metal there, and you'll just get a ripper shock,\" Mr Dixon said.\n\n\"Plenty of times when nothing's happened and other times you become afraid to touch anything, or I'll keep touching things so I don't build up too much static.\n\n\" A couple of times, it's physically hurt it's been that big of a shocker. \"\n\nMore than 80 people reported experiencing regular shocks at the store. (ABC Sunshine Coast: Dylan Morris)\n\nAn electrifying combination\n\nMs Turner said she raised the issue with a staff member who told her management was looking into it.\n\nAldi responded with a written statement.\n\n\"We take any concerns customers have about our store experience very seriously,\" an Aldi spokesperson said.\n\n\"We ask that customers share their feedback directly to Aldi via the [online] help centre.\"\n\nA quantum physics expert says the trolley wheels could be causing the static build-up. (ABC Sunshine Coast: Jessica Ross)\n\nMany of the shoppers who reported receiving regular shocks were pushing trolleys at the time.\n\nAssociate professor Jacq Romero, an experimental quantum physicist based at the University of Queensland, said the design of the store and the trolleys could be contributing factors.\n\n\"Humans are actually conductors,\" Dr Romero said.\n\n\"Electricity can travel through us so when you touch a shopping cart that has built up charge, the tendency would be for the charges to discharge through you.\n\n\"Some wheels and some floors are more susceptible to building up charges.\"\n\nAn Adelaide supermarket trialled anti-static wheels when it had similar issues in 2022.\n\nJacq Romero says some stores use anti-static wheels on trolleys to prevent shocks. (Supplied)\n\nCan you stop the shocks?\n\nThe Sunshine Coast has also experienced months of dry weather.\n\n\"Usually you get these charges when the air is so dry … that's because the water molecules in the air help to move the charges away from objects,\" Dr Romero said.\n\n\"When it's dry that doesn't happen.\"\n\nA run of wet weather has been predicted for the region in coming weeks, which should provide a welcome reprieve.\n\nStatic shocks are generally more of a nuisance than a danger to humans.\n\nDr Romero said shoppers could consider wearing gloves as an insulator.\n\nSome experts also recommend keeping skin moisturised, wearing leather-soled shoes instead of rubber-soled and dressing in natural fibres.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/labor-transparency-david-pocock-jobs-for-mates/105938080",
    "title": "Albanese government 'leans into a culture of secrecy'",
    "publish_date": "Thu, 30 Oct 2025 21:34:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "The government used to be quite cosy with independent ACT senator David Pocock. That was back at the start, when it needed his vote.\n\nIn its second term, Labor only requires the Greens or the Coalition to pass contested legislation in the upper house. Now, Pocock has become an irritant for Labor, as he and other crossbenchers need to demonstrate their relevance in changed circumstances.\n\nPocock is calling out the government's gross lack of transparency. \"When the numbers were crunched on the last parliament, they were more secretive than the Morrison government,\" he says, describing this as \"one of the most secretive governments in the last 30 years\".\n\nOn Wednesday, Pocock led a spectacular revolt that united, in a rare display, the Coalition, Greens and other crossbenchers.\n\nThe government used to be very cosy with ACT independent senator David Pocock. (ABC News: Matt Roberts)\n\nThe immediate trigger issue was the government's refusal to release a report by former public service commissioner Lynelle Briggs into jobs for mates. The government commissioned the report in 2023, spurred by the fact that one of the \"teals\", Sophie Scamps, was planning a private member's bill.\n\nThe report, titled Review of Public Sector Board Appointments Processes, was completed the same year. But it has been sat on ever since, presumably because it is embarrassing for Labor. Finance Minister Katy Gallagher says, improbably, that the government is still working on the report. If it is, it must have started the work very late and presumably will be accelerating it.\n\nOn Wednesday, the non-government senators passed a motion to extend the Senate's hour-long question time, until the issue is resolved, by about half an hour, with the additional questions all to be asked by non-Labor senators. (In a chaotic Thursday afternoon, question time ran three and a half hours.)\n\nLabor accused of threats after Senate stunt The Senate has erupted after a stunt yesterday where the Coaliton, Greens and crossbench teamed up to pressure the government to release a secret report — with claims Labor is vowing retribution.\n\nThe government reacted furiously. The opposition said the leader of the House of Representatives, Tony Burke, told the manager of opposition business, Alex Hawke, that the government was considering depriving Coalition lower house members of their positions as deputy chairs on various committees.\n\nLiberal frontbencher James Paterson said \"the government's response is more like that of a petty authoritarian government than a democratic one\".\n\nEnvironment Minister Murray Watt lashed Pocock on Thursday, accusing him of \"a dummy spit\". \"David Pocock was always in here lecturing the rest of us about the importance of Senate tradition and Senate convention, and he's just gone and chucked the toys out of the cot yesterday. So he should have a good, hard think about that.\"\n\nMurray Watt said Pocock \"chucked the toys out of the cot\" in leading a revolt against the government. (ABC News: Callum Flinn)\n\nThis incident is not just a bit of byplay. It's a test of strength between the Senate and the executive. Politically, it is important because it highlights a concerning feature of the Albanese government — its penchant for secrecy. While governments generally have secrecy as their default position, Labor came in promising to behave differently.\n\nObservers believe Anthony Albanese is the main driver of limiting information. We know for certain he is not a fan of freedom of information — the current bill for changes to FOI that the government has before parliament would (further) inhibit access to information about what is happening at senior levels of government.\n\nLabor plans to weaken FOI laws A new proposal would introduce a fee for Freedom of Information requests and tighten the rules around the release of documents related to government deliberations.\n\nThe inclination to secrecy is part of the government's disappointing record more generally on integrity issues, highlighted this week by the Centre for Public Integrity, an independent research institute chaired by Anthony Whealy, a respected legal figure.\n\nThe CPI issued \"The Albanese government's Integrity Report Card\", which showed poor results on various fronts.\n\nThe centre urges the government to \"reset course — to honour its commitments to transparency, respect for parliament, robust checks and balances, and action to stamp out corruption and undue influence\".\n\nThe CPI accuses the government of \"leaning into a culture of secrecy\", highlighting the flawed Freedom of Information Bill.\n\nLoading\n\nIt says the government has failed to rein in the power of lobbyists. One big thing that compromises both sides of politics is how political parties sell access to their senior figures for large sums. Labor has its Federal Labor Business Forum; the Liberals have their Australian Business Network. Companies sign up for meetings at party conferences and other events to get into decision-makers' ears. It is surely a distortion of democracy.\n\nFor an opposition to hold a government to account requires resources. The CPI report criticises the government's cut in the staff allocation it has provided to the opposition.\n\nSign up for Weekend Reads in your inbox Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nAlbanese has been particularly arbitrary when it comes to resources for Senate crossbenchers. Instead of a general rule, some crossbenchers (including Pocock) have received more staff than others, according to prime ministerial preference. Labor defector Senator Fatima Payman was given minimal staff.\n\nThe CPI criticises that the scrutiny of Indigenous Affairs has been reduced by removing the previous dedicated day at Senate estimates to examine this area. The government also \"continues to exempt major executive instruments from parliamentary review\".\n\nOn the issue of \"frank and fearless advice\" from the public service, the CPI points to the government ignoring key recommendations from the Thodey review, which reported under the Morrison government — notably recommending changes to the appointment and tenure of departmental secretaries. These would strengthen the independence of the public service, the CPI says.\n\nAnd what of jobs for mates? The CPI says the government has made little progress on, and has little appetite for, \"one of Australia's most pressing integrity reforms\".\n\nKaty Gallagher says the government is still working on the report into jobs for mates. (ABC News: Matt Roberts)\n\nIt quotes Gallagher's words when she announced the Briggs inquiry — she said it was \"all about putting an end to the jobs for mates culture that defined the previous Morrison government's public sector appointments\".\n\nABC Politics in your inbox Sign up to the ABC Politics newsletter with Brett Worthington\n\nUnder the Albanese government, \"appointments continue to be made without sufficient guardrails\", the CPI says. It points to the recent choice of the new head of the Office of National Intelligence, Kathy Klugman, who went straight from the Prime Minister's Office. (The government is enraged by this, seeing it as a slur, because she was a deputy secretary in the Department of Foreign Affairs seconded to the Prime Minister's Office.)\n\nThe CPI also notes legislation for the Australian Centre for Disease Control \"establishes a major public office with no provision for merit-based appointment\".\n\nThe CPI calls for the release of the Briggs report and for the government to \"legislate transparent, merit-based appointment processes across the public sector\".\n\nThe ball's in the government's court.\n\nMichelle Grattan is a professorial fellow at the University of Canberra and chief political correspondent at The Conversation, where this article first appeared.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/rugby-union-australia-wallabies-england-twickenham-test/105955734",
    "title": "Wallabies forced to play by World Rugby's rules in England Test",
    "publish_date": "Thu, 30 Oct 2025 21:30:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "Wallabies coach Joe Schmidt is not concerned about rules prohibiting some of his key overseas-based players from lining up against England at Twickenham on Sunday morning AEDT.\n\nThe Test falls outside World Rugby's three-week international window for the release of players from their clubs.\n\nThis means the Wallabies must do without European-based players Will Skelton, Len Ikitau, James O'Connor and Tom Hooper.\n\nBut England is fielding a full-strength squad, courtesy of an agreement struck between its national governing body, the Rugby Football Union, and its domestic league, the Premiership.\n\n\"We always try to favour home-based players anyway,\" Schmidt told reporters in London.\n\n\"We knew that beforehand. It was no different last year. We were in the same position last year and didn't have everyone available.\n\n\"It's not really a distraction for us, it's an opportunity. You often get dealt a set of cards and … try to put out your best hand.\"\n\nWallabies hold on against Japan The Wallabies hold on for a gritty 19-15 victory over Japan in wet conditions at Tokyo's National Stadium.\n\nSchmidt said the Wallabies had no choice but to respect World Rugby's rules.\n\n\"I guess if you're going to choose to play in a foreign competition, they [World Rugby] create the boundaries of that competition,\" he said.\n\n\"So, you have to play by their rules, and World Rugby has very clear rules on when players who are selected for international teams have to be made available.\"\n\nAfter resting a host of players in last Saturday's 19–15 win over Japan in Tokyo, Schmidt made eight changes to his starting XV to face England.\n\nJoseph-Aukuso Suaalii, Max Jorgensen and Fraser McReight are among those to return, while regular captain Harry Wilson will lead the Wallabies after coming off the reserves bench against Japan.\n\nJake Gordon and Tane Edmed will start in the halves for the third straight Test.\n\nWallabies squad: Andrew Kellaway, Max Jorgensen, Joseph-Aukuso Suaalii, Hunter Paisami, Harry Potter, Tane Edmed, Jake Gordon, Harry Wilson (c), Fraser McReight, Rob Valetini, Jeremy Williams, Nick Frost, Taniela Tupou, Billy Pollard, Angus Bell\n\nReserves: Josh Nasser, Tom Robertson, Allan Alaalatoa, Lukhan Salakaia-Loto, Nick Champion de Crespigny, Ryan Lonergan, Hamish Stewart, Filipo Daugunu\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/olympic-leisure-centre-heidelberg-west-pool-closure/105953220",
    "title": "Jennifer's brother drowned in her local pool. But even she's 'ashamed' it's closing",
    "publish_date": "Thu, 30 Oct 2025 21:29:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jennifer Loulie gets emotional talking about the closure of her local public pool in suburban Melbourne.\n\nIt's where her older brother, Jean-Pierre, drowned, 45 years ago.\n\n\"We lost my brother there, on the 25th of March 1980. He drowned in the big pool,\" she said, adding there wasn't a qualified lifeguard on duty when it happened.\n\nHer parents had only just moved from Mauritius to Heidelberg West, in Melbourne's north-east, to get better support for Jean-Pierre who was profoundly hearing-impaired.\n\n\"For him to just die months after migrating here, I can't even imagine what my parents would have been thinking and feeling,\" she said.\n\nThe Olympic Leisure Centre in Heidelberg West will close for good after nearly half a century in operation. (ABC News: Billy Draper)\n\nMs Loulie lives right near the pool, where she swam laps during her pregnancy, and hoped her children would learn to swim.\n\n\"I learned to swim here, knowing that he had drowned — it kind of just gave me more motivation to want to learn to swim,\" she said.\n\nBut the Olympic Leisure Centre pool will close for the final time today, after Banyule Council voted in June to decommission it, citing low patronage and high running costs.\n\nCouncil says the aging facilities at the leisure centre can no longer be maintained sustainably. (Supplied: Banyule Council)\n\nMs Loulie said she feels embarrassed for the council that local children, including her own, won't be able to learn to swim at the local pool.\n\n\"Thinking about the disinvestment in this facility — this could happen to another child in our area, not knowing how to swim,\" she said.\n\n\"We don't want any family to go through what we've gone through.\n\nShe said she would \"reluctantly\" take her children to learn to swim at Ivanhoe, about 3 kilometres away, but for many in the community, what happens next is not clear.\n\nResearch project to examine consequences of pool closure\n\nLiz Taylor from Monash University is researching the impact of the pool closure on the community's health.\n\n\"We know that people value them, and that it's really hard to keep them open, but there's actually no study that's looked at what happens to people after a swimming pool closes,\" Dr Taylor said.\n\nShe said many of Australia's public swimming pools were built after World War II, and many are now beyond their end-of-life date.\n\nThe leisure centre was built on the site of the athlete's village originally construction for the 1956 Melbourne Olympics. (ABC News: Billy Draper)\n\nAs those pools aged, into the 1990s, she said the idea and the value of a public pool changed.\n\n\"They became seen as really outdated and mainly understood as kind of liabilities,\" she said.\n\nShe said a really strong \"save our pool\" movement grew around this time, with successful protest movements around the Fitzroy Pool in 1994, the North Melbourne Pool, as well as ultimately failed campaigns in Flemington and Footscray.\n\nA public campaign to save the Fitzroy Swimming Pool in 1994 prevented its closure. (Supplied: City of Yarra)\n\nShe said the arguments around the Olympic Leisure Centre echo the debates around those inner-city pools in the 1990s.\n\n\"[They say] it's too expensive, it's old, nobody likes it — but the people who live there they use it and they like it,\" she said.\n\nShe said there is no doubt councils are under incredible financial pressure, but hopes the value of pools can be captured not just in budgets and numbers.\n\nCommunity seeking answers to women-only space\n\nThe Heidelberg West community knows the pool will close, but they are still fighting.\n\nThe day before the pool cover went on for the last time a group of about 20 residents took the fight to the Banyule Council offices in Greensborough — in the same building as the large WaterMarc leisure centre where two huge water slides snake around the outside.\n\nLocal residents took the protest to the council offices in a bid to keep the pool open. (ABC News: Margaret Paul)\n\nFatuma Abdullahi is part of a group of Muslim women who attend the pool every Friday evening for a women's-only swimming session.\n\n\"We don't know where we can go, we're in shock, we cry!\" she said.\n\n\"We can't go [swimming] in public places because we have the hijab, we are Muslim.\"\n\nFatuma Abdullahi says there is a lack of culturally appropriate options available for Muslim women looking to swim. (ABC News: Margaret Paul)\n\nInside the council offices, the group met with the council's director of community well-being, Joseph Tabacco, about the council's efforts to find a place for the women to swim regularly.\n\nThe council has found new venues for the women-only swimming program at Ivanhoe and Bundoora starting on November 9.\n\nThe council said the work will continue, acknowledging the women want a longer and earlier session than the 90-minute session on offer at Ivanhoe on Sunday nights.\n\nFowsiya Abdullahi said the pool was crucial for her mental health.\n\n\"When I'm stressed, that's where I go to feel better for my mental health. It's very important for me in my life,\" she said.\n\nFowsiya Abdullahi says her goal of learning to swim will now be more difficult without local facilities. (ABC News: Margaret Paul)\n\nAs a mother of five children, she said it will be hard to find somewhere else for them to swim in the summer.\n\n\"It is very important for my kids to know how to swim, even me. I don't know how to swim but I want to learn,\" she said.\n\nMargaret James is 83 years old and said she's \"pretty devastated\" the council is closing the pool.\n\nShe said she will have to keep swimming at one of the \"posh\" pools, but she will lose the community at Olympic Leisure Centre.\n\n\"Here, people will stop and say, \"I haven't seen you before!\" she said.\n\n\"And if you miss for a few weeks, \"are you alright? I haven't seen you!\"\n\nMargaret James says the pool's closure will be devastating. (ABC News: Margaret James)\n\nLawyers urge council to create new space\n\nThere is a legal team watching what happens next, too.\n\nBethany Moore is an associate at Maurice Blackburn lawyers, and she has written to the council, asking them to make sure the women's group has somewhere to swim.\n\n\"It's really about providing a service that continues this offering to the women of community connection and healthy lifestyle activities,\" Ms Moore said.\n\n\"If they can't offer that alternative, we're going to continue working with the community to see what other options they might have.\"\n\nIn a statement, Banyule mayor Elizabeth Nealy said the \"revitalised\" Olympic Leisure Centre will include a modern library, an expanded gym and flexible recreation and social spaces.\n\n\"We acknowledge and appreciate that the closure of the aging aquatic facilities at Olympic Leisure Centre marks the end of an era,\" she said.\n\n\"The decision to close the pool was not an easy one, but the facilities had ultimately reached the end of their life and could no longer operate safely or sustainably.\n\n\"While this is a farewell to the pool, it's also the beginning of something new — and we're excited to be delivering a revitalised space that will meet the changing needs of our community for generations to come.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-31/asx-markets-business-live-news-31-oct/105955602",
    "title": "Live: ASX on the rise but ANZ shares fall on profit hit",
    "publish_date": "Thu, 30 Oct 2025 21:26:02 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Gareth Hutchens",
      "Michael Janda"
    ],
    "text": "ANZ's economics team has circulated their \"Australian Macro Weekly\" note, which says something interesting.\n\nIt looks back at Wednesday's inflation data (which came in much higher than expected), and the team says we ought to be aware that there was a bit of \"noise\" in the 'trimmed mean' measure of inflation, which may be giving a false sense of how strong inflation really is.\n\nHere's how they make their argument:\n\n\"In the wake of the CPI [result], the hurdle for any [interest rate] easing [from the Reserve Bank] this year is now very high and would likely require a further move higher in the unemployment rate (with an unfriendly mix of details) and a weak Q3 GDP.\n\n\"The most likely path for interest rates remains a final 25 basis point easing in the first half of 2026, albeit now with risk that the final rate cut we expect in February ends up occurring later (possibly May after the next two quarterly CPIs) or not at all.\n\n\"We are not yet inclined to remove that final easing from our forecasts, given:\n\n1) The recent drift higher in the unemployment rate\n\n2) The tendency (over some recent years) for Q3 trimmed mean prints to come in higher than Q2 and Q4 outcomes, and\n\n3) What looks like a number of one-off factors coming together in the quarter to push the trimmed mean higher.\n\n\"Indeed, if property rates & charges, tobacco and electricity prices had all risen 2.5% q/q in original terms and petrol prices hadn’t changed, then trimmed mean would have printed about 0.14ppt lower.\n\n\"We focus on these items because they are either heavily influenced by government decisions or particularly volatile; but our broader point is that the trimmed mean inflation measure, like all data, can contain some noise alongside the underlying signal.\n\n\"We expect the RBA to express some concern about market sector services inflation next week, although the modest easing in the labour market over the past year does suggest a little downward pressure is still likely over the coming quarters.\n\n\"That’s also consistent with what price and cost measures from business surveys point to on inflation more broadly.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/10-quick-and-simple-new-midweek-friendly-meals-with-12-ingredients-or-less-20251031-p5n6ru.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "10 quick and simple new midweek-friendly meals with 12 ingredients or less",
    "publish_date": "Fri, 31 Oct 2025 12:55:10 +1100",
    "category": "sports",
    "authors": [],
    "text": "You have reached your maximum number of saved items.\n\nRemove items from your saved list to add more.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-andrew-to-lose-prince-title-and-leave-royal-lodge-buckingham-palace-says-trump-heads-back-to-the-us-after-xi-meeting-hamas-urges-australian-government-to-remove-its-terror-listing-20251031-p5n6om.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Andrew to lose prince title and leave Royal Lodge; Trump heads back to the US after Xi meeting; Hamas urges Australia to remove its terror listing",
    "publish_date": "Fri, 31 Oct 2025 12:40:47 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "As Hurricane Melissa takes aim at Bermuda, new satellite data of Jamaica has revealed devastation for tourist centre Montego Bay and much of the Western part of the country.\n\nAt least 40 per cent of the buildings and roads in the worst-hit areas on the island were severely damaged, according to a Bloomberg News analysis of satellite data processed by the Earth Observatory of Singapore.\n\nThe hurricane caused the most destruction in Jamaica’s western region, which includes the devastated town of Black River and the heavily-damaged tourist centre of Montego Bay. Analysis of satellite data shows that Saint James, Westmoreland and Saint Elizabeth parishes were most affected.\n\n“I have never seen anything like this before,” said Kerry-Lee Lynch, head of United Way of Jamaica, who drove from Kingston to Montego Bay on Wednesday past downed trees and power poles. She said the damage from Melissa was worse than the hurricanes that devastated island in years past.\n\nThe record-setting storm made landfall on Tuesday near New Hope, Jamaica, as a Category 5 hurricane packing winds of 298 kilometres per hour – the strongest storm to hit the island in more than 170 years of record keeping.\n\nAuthorities are still assessing the full extent of the damage, but economic losses are already estimated to be at least $8 billion, said Chuck Watson, a disaster modeller at Enki Research.\n\nBloomberg",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/traveller/travel-news/two-australian-hotels-named-in-world-s-50-best-list-20251031-p5n6qy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two Australian hotels named in World’s 50 Best list",
    "publish_date": "Fri, 31 Oct 2025 12:36:46 +1100",
    "category": "finance",
    "authors": [
      "Katherine Scott"
    ],
    "text": "Advertisement\n\nTravel newsLuxury holidays Two Australian hotels named in World’s 50 Best list Katherine Scott October 31, 2025 — 12:36pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share 0 Leave a comment\n\nTwo Australian hotels have been recognised in the coveted World’s 50 Best Hotels list by a global academy of well-travelled experts in the hotel and travel industry, with new entry Capella Sydney named Best Hotel in Oceania. Capella Sydney’s Edwardian baroque-style facade, in the former NSW Department of Education building. Timothy Kaye Capella Sydney’s glass-enclosed atrium with remotely operated artificial flowers that open and close above diners’ heads. Capella Sydney, operated by high-end Singapore-based Capella Hotels and Resorts group, ranked No.12 this year, with the former top-ranking Australian hotel for two years running, Brisbane’s The Calile, sliding down the list nine places to No.34. The Calile slid down the list to No.34 on the World’s 50 Best Hotels rankings for 2025.\n\nAdvertisement\n\nThe best hotels for 2025 were announced at a ceremony at London’s Old Billingsgate on Thursday, with luxury Chinese hotel Rosewood Hong Kong finally taking out the number one spot after featuring in the top three since the awards’ inception in 2023. It marks the third edition of the annual hotel rankings for the 50 Best group, best-known for its annual global top-50 restaurants and bars lists. Compiled by UK-based company William Reed Business Media, the hotel rankings’ debut in 2023 marked the group’s first global launch since turning its attention to bars in 2009. The World’s 50 Best Hotels No.1 … Rosewood Hong Kong. Wraparound terrace and pool at Rosewood Hong Kong. The Thai capital made a splash this year with two hotels in the top 3, and three in the top 10. Four Seasons Bangkok at Chao Phraya River came in second place, while last year’s No.1 Capella Bangkok followed in third, with Mandarin Oriental Bangkok rounding out the city list with a No.7 ranking.\n\nAdvertisement\n\nCapella Sydney’s general manager Marc von Arnim said the team was “humbled and proud to be part of this extraordinary list of the world’s finest hotels”. Since launching in 2023, Capella Sydney has quickly established itself as one of the city’s most luxurious properties. Capella Sydney’s 20-metre indoor rooftop pool on level six. Dominic Lorrimer The suite life … standalone bathtubs at Capella Sydney. The 192-room, $300 million hotel in the heart of Sydney’s heritage “sandstone precinct”, set within the early 1900s Edwardian baroque former NSW Department of Education building, spared no expense in its thoughtful restoration and reimagining of the property, with art-studded interiors, a luxury spa, indoor rooftop pool and luxury touches like standalone bathtubs.\n\nAdvertisement\n\nRelated Article ★★★★★\n\nHotel reviews No harbour views, but new $300 million Sydney hotel gets perfect score For dining and drinking, the street level has three places for guests and the public to congregate: Aperture, Brasserie 1930 and McRae Bar. The adjacent Lands by Capella in the historic Department of Lands building is currently under construction by Capella’s developer arm Pontiac, set to open as an events space in February, with plans for it to eventually house eateries, bars and boutiques. New South Wales and Queensland weren’t the only Australian states to receive a 50 Best nod. Baillie Lodges’ ultra-luxury all-inclusive retreat Southern Ocean Lodge on Kangaroo Island in South Australia was named the American Express Travel ‘One To Watch’ last month. Southern Ocean Lodge has been recognised in the World’s 50 Best Hotels as the “one to watch”. The high-end retreat was rebuilt following the devastating 2020 bushfires that ravaged Kangaroo Island.\n\nAdvertisement\n\nThe award marks a turning point for the property, which was destroyed in the January 2020 bushfires, and reopened a year ago following a long, painstaking clearing and rebuilding process. Hobart’s Marriott-run The Tasman, which ranked No.49 in 2024, didn’t make this year’s top-50 list. Related Article Luxury holidays Five years after being destroyed, iconic Aussie lodge is back to its best Beyond the top-50 rankings, some properties received special awards, with another former winner, Italy’s Passalacqua in Lake Como (No.4), nominated Best Boutique Hotel for a second year; Desa Potato Head in Bali taking out the Eco Hotel Award; Mandarin Oriental Qianmen in Beijing (No.14) singled out as the Nikka Best New Hotel Award, and Atlantis The Royal in Dubai (No.6) named Best Beach Hotel. The academy chair position for the Oceania region, which includes Australasia, Melanesia, Micronesia and Polynesia, is held by Melbourne-based food and travel critic Michael Harden, however it’s not known how many of the jurors voting in the awards are Australian or Oceania-based.\n\nAdvertisement\n\nThe World’s 50 Best Hotels rankings is based on the votes of a collective of 580 jurors spanning nine geographical regions and comprising hoteliers, travel journalists, hotel educators and seasoned luxury travellers. Panel members submit seven votes, in order of preference, based on stays over a two-year period ending in April 2024. The World’s 50 Best lists have been criticised for favouring European venues and demonstrating a lack of diversity, though measures have been taken to address some of these shortfalls, including mandating a 50/50 gender balance among jurors. Any hotel is eligible; there is no essential criterion for a property to qualify for a vote, and hotels aren’t required to “pay to play”. The World’s 50 Best Hotels for 2025 Rosewood Hong Kong, Hong Kong Four Seasons Bangkok at Chao Phraya River, Bangkok Capella Bangkok, Bangkok Passalacqua, Lake Como Raffles Singapore, Singapore Atlantis The Royal, Dubai Mandarin Oriental Bangkok, Bangkok Chablé Yucatán, Chocholá Four Seasons Firenze, Florence Upper House Hong Kong, Hong Kong Copacabana Palace, Rio de Janeiro Capella Sydney, Sydney Royal Mansour, Marrakech Mandarin Oriental Qianmen, Beijing Bulgari Tokyo, Tokyo Claridge’s, London Four Seasons Astir Palace, Athens Desa Potato Head, Bali Le Bristol, Paris Jumeirah Marsa Al Arab, Dubai Cheval Blanc Paris, Paris Bulgari Roma, Rome Hôtel de Crillon, Paris Rosewood São Paulo, São Paulo Aman Tokyo, Tokyo Hotel Il Pellicano, Porto Ercole Hôtel du Couvent, Nice Soneva Fushi, Maldives The Connaught, London La Mamounia, Marrakech Raffles London at The OWO, London The Emory, London Maroma, Riviera Maya The Calile, Brisbane The Lana, Dubai Hôtel de Paris Monte-Carlo, Monaco Janu Tokyo, Tokyo The Taj Mahal Palace, Mumbai One&Only Mandarina, Riviera Nayarit Singita – Kruger National Park, Kruger National Park Mandarin Oriental Hong Kong, Hong Kong Hotel Bel-Air, Los Angeles The Mark, New York Las Ventanas al Paraíso, Los Cabos The Tokyo Edition Toranomon, Tokyo Hotel The Mitsui, Kyoto Estelle Manor, Witney Grand Park Hotel Rovinj, Rovinj Hotel Sacher Vienna, Vienna Mandapa, Bali\n\nSign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/victorian-tasmania-cricketers-lead-tributes-to-ben-austin-amid-safety-focus-20251031-p5n6sb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victorian, Tasmania cricketers lead tributes to Ben Austin amid safety focus",
    "publish_date": "Fri, 31 Oct 2025 12:25:31 +1100",
    "category": "sports",
    "authors": [
      "Roy Ward"
    ],
    "text": "Victorian and Tasmanian cricketers have led solemn tributes to teenage player Ben Austin on Friday morning before play in their Sheffield Shield match at the Junction Oval.\n\nThe players leaned their bats and caps against the fence as a symbol of respect, wore black arm bands and held a minute’s silence as the cricket community continued to grieve the death of the Ferntree Gully teenager, who was struck on the neck by an accidental full toss while training with friends on Tuesday.\n\nVictorian players Sam Harper, Pete Handscomb, and David Moody observe a minute’s silence in honour of teenage cricketer Ben Austin. Credit: Getty Images\n\nAustin died later in hospital.\n\nThe accident has turned a spotlight on the safety of cricket and, in particular, on the use of “wangers”, a training device that launches the ball at varying speeds and lengths.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/australia-s-world-cup-reign-ended-by-indian-brilliance-20251030-p5n6nz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Un-Australian’: Sloppy display, record chase send Healy’s troops home early from World Cup",
    "publish_date": "Fri, 31 Oct 2025 11:58:35 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Alyssa Healy called it “un-Australian”. It was certainly unexpected, and unbecoming for the team that has until the past year or so boasted perhaps the most enviable winning record in world sport.\n\nFor the first time in nearly a decade, the Australian women’s team will not be in possession of either the ODI or Twenty20 World Cup after they were toppled by India in the semi-final of the Women’s World Cup on Thursday night.\n\nIndia celebrate. Credit: Getty Images\n\nThis is the last time Healy will be seen at the 50-over tournament, and coach Shelley Nitschke has some thinking to do about how to hand leadership to the next generation.\n\nAustralia’s elimination by India in Mumbai was brought about largely by an extraordinary century from Jemimah Rodrigues in her team’s world record chase, but what will stick in the craw of Healy’s team is the sloppiness that allowed her to get that far.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/racing/my-phone-beeped-with-devastating-news-the-joys-and-shattering-lows-of-being-a-1-per-cent-racehorse-owner-20251029-p5n69o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "My phone beeped with devastating news. The joys and shattering lows of being a 1 per cent racehorse owner",
    "publish_date": "Fri, 31 Oct 2025 11:45:02 +1100",
    "category": "sports",
    "authors": [
      "Heath Linton"
    ],
    "text": "November 26, 2024: it’s a day I’ll never forget.\n\nMy spirits had been high that morning. We had received a routine message from our trainers updating us our horse King Kirk’s performance in a trial and outlining a program we hoped would take him to victory in the Golden Slipper.\n\nKing Kirk (right) won the Breeders’ Plate on debut. Credit: Getty Images\n\nEver since he came from last to win the Breeders Plate on debut in Sydney in early October, we had been dreaming big. We being Dad, my brother Travers, one of my best mates Trent Wemyss, and me.\n\n“The King”, as I liked to call him, was the favourite for the Slipper, one of the most prestigious races in Australian racing.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/batter-up-how-does-your-australian-top-six-compare-to-our-experts-20251030-p5n6jm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Batter up: How does your Australian top six compare to our experts?",
    "publish_date": "Fri, 31 Oct 2025 11:44:00 +1100",
    "category": "sports",
    "authors": [
      "Tom Decent",
      "Daniel Brettig",
      "Jon Pierik",
      "Dan Walsh",
      "Chloe Saltau",
      "Andrew Wu"
    ],
    "text": "With the saga involving Pat Cummins’ availability settled (for the first Test at least), attention has turned to the actual problem with the Australian side that will play in Perth – who will bat in the top six, and where?\n\nIt’s been an issue for the Australian men’s Test side for an extended period, and there’s nothing like a home Ashes series to further stoke discussion.\n\nAhead of next week’s announcement of the Australian squad for the series opener, the cricket experts from the Sydney Morning Herald and The Age have come up with their preferred top six to face Jofra Archer and friends at Optus Stadium from November 21.\n\nWhile most of the conjecture surrounds who will open the batting, the all-rounder spot is also not settled.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/world/europe/revisit-that-car-crash-tv-interview-which-destroyed-prince-andrew-20251031-p5n6rz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Revisit that car crash TV interview which destroyed Prince Andrew",
    "publish_date": "Fri, 31 Oct 2025 11:37:01 +1100",
    "category": "finance",
    "authors": [],
    "text": "Revisit that car crash TV interview which destroyed Prince Andrew\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/swiss-cheese-reforms-whats-wrong-with-australias-nature-laws/vfmei8p1r",
    "title": "'Swiss cheese' reforms: What's wrong with Australia's nature laws?",
    "publish_date": "Thu, 30 Oct 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/graham-samuel-backs-labors-environment-bill-morning-news-bulletin-31-october-2025/blgokw7sk",
    "title": "Graeme Samuel backs Labor’s environment bill | Morning News Bulletin 31 October 2025",
    "publish_date": "Thu, 30 Oct 2025 19:56:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nThe Government's environment bill welcomed by the author of the report that triggered it\n\nThe bodies of two more hostages returned to Israel by Hamas\n\nThe grieving father of a teenager who died in a cricket training accident has spoken\n\nThe author of the review that triggered the government's environment reforms has fully endorsed Labor's nature legislation.\n\n\n\n\n\nGraeme Samuel has told SBS the bill implements the 'totality' of the recommendations he made in his report, five years after it was delivered.\n\n\n\n\n\nThe Greens and Coalition have objected to the bill, with Greens leader Larissa Waters describing it as 1400 pages gift-wrapped for big business.\n\n\n\n\n\nBut Mr Samuel says environmental groups and business interests alike had substantial input into his report, and their desires were fully taken into account in the recommendations.\n\n\n\n\n\n\"I say to the Greens and I say to the Coalition without wanting to be political, please please stop your political games and get on with this legislation. Because this is one way for our children - our grandchildren, our great grandchildren, for future generations - to now get effective environmental protection and environmental restoration.\"\n\n\n\n\n\n——\n\n\n\n\n\nMaverick Nationals MP Barnaby Joyce has denied accusations he abused a female staff member inside Parliament House in an incident on Wednesday.\n\n\n\n\n\nSky News has reported he raised his voice and physically entered the space of a female Nationals staffer, while lodging paperwork requesting time off to attend a funeral.\n\n\n\n\n\nIn a statement to SBS News, Mr Joyce denied the allegation and said he respects the Parliamentary Workplace Support Service investigation that's now underway.\n\n\n\n\n\nThe former deputy prime minister and two-time Nationals leader has been at odds with his party in recent weeks, announcing he will not re-contest his seat of New England, while leaving the door open for a move to One Nation.\n\n\n\n\n\n——\n\n\n\n\n\nHamas has handed over two bodies it says are those of deceased Israeli hostages, a day after the fragile Gaza ceasefire was shaken by a series of deadly Israeli strikes across the enclave.\n\n\n\n\n\nThe office of Israel's prime minister says two bodies were received by Israeli forces on Thursday in Gaza, and are being taken to Israel for identification.\n\n\n\n\n\nBenjamin Netanyahu has vowed to keep the pressure on.\n\n\n\n\n\n\"No one believed we would do it, but thanks to the combined effort, we did it together. And we are determined to also bring back all our fallen captives. If I'm not mistaken, the Chief of Staff, the Minister of Defense, two others are already being received now. We will not stop, we will not relent, until we bring everyone home.\"\n\n\n\n\n\nUnder the ceasefire, Hamas released all living hostages in exchange for nearly 2,000 Palestinian prisoners and detainees.\n\n\n\n\n\nIt committed to handing over the remains of all 28 hostages killed, in exchange for 360 Palestinian militants killed in the war.\n\n\n\n\n\nBy Thursday, it had delivered 15 bodies.\n\n\n\n\n\n——\n\n\n\n\n\nResidents of Brazil's capital Rio de Janeiro are outraged following a police operation in which at least 119 people were killed in the north of the city.\n\n\n\n\n\nRio de Janeiro's governor Claudio Castro has defended the operation, which targeted the Comando Vermelho drug gang, saying authorities wanted to arrest suspects alive.\n\n\n\n\n\nPublic defenders say the final body count of those killed in the favelas will rise to at least 132.\n\n\n\n\n\nJournalist and Rio de Janeiro resident Rosa Bittencourt has told SBS Portuguese the community needs to know who exactly was killed.\n\n\n\n\n\n“Of those 120 deaths, many were innocent people. Criminal or not, who are the people who died between yesterday and today? They’re the ones living in the favela - black people, poor people, the marginalised, the wage earners. Yes, there were drug traffickers among the dead, but nothing that justifies an operation of this scale, which killed everyone.”\n\n\n\n\n\n——\n\n\n\n\n\nUnited States President Donald Trump says he has agreed to reduce tariffs on China to 47 per cent.\n\n\n\n\n\nIn exchange, China is set to resume buying US soybean, keep rare earths exports flowing, and crack down on the illicit trade of fentanyl.\n\n\n\n\n\nMr Trump's meeting with Chinese President Xi Jinping in the South Korean city of Busan markes the end to the US leader's whirlwind diplomatic visit to Asia, where he also discussed trade deals with Korea, Japan and Southeast Asian nations.\n\n\n\n\n\nThe meeting, their first since 2019, lasted nearly two hours and focused largely on trade tensions.\n\n\n\n\n\nAfter leaving South Korea, Mr Trump told reporters on Air Force One that he thought it was an \"amazing meeting.\"\n\n\n\n\n\nChinese Foreign Ministry spokesperson Guo Jiakun says Mr Trump will visit China next year, and has invited Mr Xi to visit the US in 2026.\n\n\n\n\n\n“During the meeting, President Xi Jinping emphasised that the trade delegations of both countries exchanged in-depth views on important trade and economic issues and reached a consensus on resolving them. Both delegations should refine and finalise the follow-up work as soon as possible, uphold and implement the consensus that was reached.”\n\n\n\n\n\n——\n\n\n\n\n\nHurricane Melissa has torn through the northern Caribbean, causing widespread destruction and leaving thousands without power from Jamaica to Cuba and Haiti.\n\n\n\n\n\nThe storm has gained speed as it moves across open waters towards Bermuda.\n\n\n\n\n\nAuthorities have confirmed 25 deaths in Haiti, including 10 children, and four fatalities in Jamaica since Melissa made landfall.\n\n\n\n\n\nIt has since been downgraded from a Category Five to a Category Two storm.\n\n\n\n\n\n——\n\n\n\n\n\nThe devastated father of a teenage cricketer who died after a training accident has described his son as the shining light of their family.\n\n\n\n\n\nBen Austin died after being rushed to hospital in a critical condition on Tuesday, after he was struck in the neck by a ball at Ferntree Gully, in Melbourne's outer east.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-fuel-prices-turning-point/zlp3yj79y",
    "title": "Australia may be at a fuel price 'turning point'. Here's how global shocks could affect you",
    "publish_date": "Thu, 30 Oct 2025 18:45:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Recently-tightened European Union sanctions on Russian oil could drive prices up and continue to shake global markets, experts say, which could lead to Australian drivers paying more for fuel and have a flow-on effect of increasing goods prices.\n\n\n\n\n\nAustralia's inflation has risen again , up 1.3 per cent in the September quarter and 3.2 per cent over the year — the first increase in underlying inflation since late 2022, when the full-scale invasion of Ukraine sent global fuel prices soaring.\n\n\n\n\n\nJust as in 2022, higher power and transport costs remain key drivers of inflation.\n\n\n\n\n\nAt the same time, new data from the Centre for Research on Energy and Clean Air (CREA) shows several sanctioned Russian \"shadow fleet\" tankers continue to appear in Australian-linked supply chains .\n\n\n\n\n\nCREA analyst Vaibhav Raghunandan told SBS Russian that while Australia's direct exposure to Russian oil is limited, the EU's \"net importer\" sanctions model could restrict supply and push prices higher.\n\n\n\n\n\nWhile Australia doesn't buy oil directly from Russia, global benchmarks move quickly — and those shifts often reach local pumps within weeks.\n\n\n\nRipple effects travel fast\n\nTony Sycamore, market analyst at IG Australia, said recent United States and EU sanctions on Russian oil giants Rosneft and Lukoil have already started reshaping trade flows in Asia.\n\n\n\n\n\n\"China's state oil companies have reportedly suspended seaborne purchases of Russian oil, and Indian refiners are reassessing their imports,\" he said.\n\n\n\n\n\n\"We may now be at a turning point, where higher oil prices could begin to flow through to Australian motorists over the next few weeks.\"\n\n\n\nBrent crude, the global benchmark underpinning most imported fuel prices in the Asia-Pacific, climbed from lows nearing US$55 ($83) in September to about US$66 ($100) a barrel last week.\n\n\n\n\n\n\"Generally, a $1 change in crude translates to about a 1-cent change at the pump,\" Sycamore said.\n\n\n\n\n\nIn a statement to SBS Russian, the Australian Competition and Consumer Commission (ACCC) said retail fuel prices are \"largely determined by movements in international benchmark refined-fuel prices (which are driven by international crude-oil prices) and the AUD-USD exchange rate\".\n\n\n\n\n\nChanges in these benchmarks, the ACCC said, usually take about two weeks to filter through to major cities, and longer in regional areas.\n\n\n\n\n\nOil prices often rise and fall in response to geopolitical flare-ups, and Sycamore said recent events have shown how quickly those swings can reverse.\n\n\n\n\n\n\"Back in June, there were concerns that the 12-day conflict between Israel and Iran would push oil above $100. It peaked around $78, then dropped again once that conflict ended.\"\n\n\n\n\n\nBut not all shocks fade as fast. According to the Australian Institute of Petroleum, diesel prices in Australia hit record highs after Russia's full-scale invasion of Ukraine — surging above $2.20 a litre in late 2022, up from lows near $1.20 in 2020.\n\n\n\nPrices have stayed elevated since, hovering between the high $1.70s and low $2 range through 2023–24.\n\n\n\n\n\nWith recent sanctions and attacks on Russian energy infrastructure, analysts warn that volatility could intensify.\n\n\n\n\n\n\"The scope for Ukraine to ratchet up its attacks on Russian energy infrastructure, or stricter sanctions on Russian crude exports, could lead to a more significant market disruption and higher prices at the pump,\" said Saul Kavonic, head of energy research at financial services firm MST Marquee.\n\n\n\n\n\nDiesel powers Australia's trucks, farms and railway freight, forming the backbone of transport, mining and agriculture.\n\n\n\n\n\nWhen its price rises, it pushes up the cost of moving goods, growing food and running equipment, meaning consumers often feel it far beyond the pump.\n\n\n\n\n\nIt's also where global oil shocks are most sharply felt in Australia.\n\n\n\nAustralia's fuel dependence and limited storage\n\nAccording to the Australia Institute think tank, about 91 per cent of Australia's fuel consumption is met by imports.\n\n\n\n\n\nThat reliance is compounded by limited domestic storage. The Australian Financial Review reported this month, referring to government data, that Australia had oil stores equivalent to 49 days' worth of net imports, which is far below the 90-day requirement under the International Energy Agency treaty.\n\n\n\n\n\nThe Department of Climate Change, Energy, the Environment and Water (DCCEEW) reported that in July, Australia held just 20 days of jet fuel, 24 days of diesel and 28 days of petrol.\n\n\n\nHow global prices flow to Australian pumps\n\nMost of Australia's refined fuel imports come from Singapore, South Korea and Japan, with smaller volumes from India and Malaysia, according to the DCCEEW statistics.\n\n\n\n\n\nAs a result, Australian fuel prices are largely driven by the Singapore benchmark — a daily regional price guide published by S&P Global Commodity Insights, also known as Platts. When oil prices, refinery costs, or shipping rates rise in Singapore, those increases flow directly through to Australian wholesalers and, within about two weeks, to drivers at the pump.\n\n\n\n\n\nS&P Global's Premasish Das says sanctions on Russian oil usually redirect trade rather than reduce it, but that rerouting drives up freight and insurance costs.\n\n\n\n\n\n\"The EU sanctions on fuels produced from Russian oil could potentially displace more than 300,000 barrels a day of diesel shipments to the EU from India and Turkey,\" he said.\n\n\n\n\n\n\"This shift could fragment the diesel trade and clean-tanker [ships that carry refined fuel products] markets, making them more expensive. … Given Australia's reliance on imports, this will likely lead to increased fuel prices as well.\"\n\n\n\nRefiners and traders also use similar data from London-based firm Argus Media to monitor price trends across the region.\n\n\n\n\n\nCara Wong, Asia-Pacific associate editor at Argus Media, said those shifts are already visible in Russia's export data.\n\n\n\n\n\n\"We're seeing more damage to Russian refining infrastructure, and loading data is already showing a drop in diesel exports,\" she said.\n\n\n\n\n\n\"Although Australia doesn't buy directly from Russia, it affects the entire diesel market because it tightens supplies a little bit more … Further restrictions on fuels made from Russian crude would have an outsized impact on Singapore benchmarks.\"\n\n\n\nDisruptions to Russian oil refining\n\nBeyond sanctions, Russia's own refining sector has come under sustained attack. Ukrainian drone strikes have disabled a significant share of its capacity.\n\n\n\n\n\nBy late September, more than 38 per cent of refining infrastructure was offline, according to analysts cited by news agencies Reuters and Lenta.\n\n\n\n\n\nRussia has since extended its fuel-export ban until the end of 2025 to stabilise domestic supplies.\n\n\n\nTatiana Mitrova, global fellow at Columbia University's Center on Global Energy Policy, told SBS Russian that the cumulative impact of these strikes is proving difficult to reverse.\n\n\n\n\n\n\"Equipment shortages, sanctions on repairs and a new wave of attacks are prolonging Russia's recovery,\" she said.\n\n\n\n\n\n\"As a result, export volumes are shrinking just as demand rises into the Northern Hemisphere winter.\"\n\n\n\n\n\nAnalysts say these disruptions add to the broader mix of geopolitical and market pressures already shaping global prices.\n\n\n\n\n\nSycamore said that, as well as sanctions on Russia, other global shifts are also feeding volatility; namely, US-trade tensions affecting global demand for crude oil.\n\n\n\n\n\nHowever, recent signs of progress in US–China trade talks have lifted market confidence and pushed the Australian dollar higher against the US dollar, with some analysts predicting it could trade as high as 70 US cents.\n\n\n\nA stronger dollar can take some pressure off local fuel prices, Sycamore said.\n\n\n\n\n\n\"Importantly, OPEC has been increasing production — partly to offset the impact of Russian embargoes, but also to regain market share,\" he said.\n\n\n\n\n\nMitrova said the global market has so far proven resilient.\n\n\n\n\n\n\"When the EU restricted imports, it narrowed Russia's export niche, mainly for diesel. But the global oil products market is highly flexible,\" she said.\n\n\n\n\n\nShe said these measures create logistical difficulties rather than a genuine shortage.\n\n\n\n\n\n\"Finding new buyers, rearranging shipments, and processing transactions under sanctions takes time and money, but the trade continues,\" she said.\n\n\n\n\n\nA similar pattern occurred in 2022, when sanctions on Russian oil disrupted trade routes and raised freight and refining costs globally, contributing to Australian pump prices climbing above $2.20 a litre.\n\n\n\n\n\nAccording to the Australian Institute of Petroleum, wholesale diesel currently sits around $1.66–$1.67 a litre, while average retail prices in Sydney are about $1.82 a litre, based on the latest NRMA data.\n\n\n\n\n\nThis story was produced in collaboration with SBS Russian.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/video/labor-pushes-for-nature-deal-as-new-environment-reform-bill-unveiled/zcdrgntg9",
    "title": "Labor pushes for nature deal as new Environment Reform Bill unveiled",
    "publish_date": "Thu, 30 Oct 2025 09:33:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Labor pushes for nature deal as new Environment Reform Bill unveiled\n\nPublished 30 October 2025, 8:11 am\n\nThe major political parties are in agreement that Australia's environmental laws are broken. But can they find common ground on how to fix the 25 year old legislation? Today, the government introduced the new Environment Protection Reform Bill, as it piles pressure on the Opposition or the Greens to clinch a new nature deal.",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/video/more-from-the-apec-summit-as-albanese-dine-with-trump-and-other-leaders/pxgvdtwr7",
    "title": "More from the APEC summit as Albanese dine with Trump and other leaders",
    "publish_date": "Thu, 30 Oct 2025 08:48:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-future-of-ai-investment-if-interest-rates-dont-fall-as-much-as-expected/le6a4miut",
    "title": "The future of AI investment if interest rates don't fall as much as expected",
    "publish_date": "Thu, 30 Oct 2025 07:16:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/first-nations-businesses-forge-new-connections-in-india/c47i2gc9l",
    "title": "First Nations businesses forge new connections in India",
    "publish_date": "Thu, 30 Oct 2025 07:05:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAt a catwalk show in New Delhi, fashion models are showcasing designs from Kirrikin, a luxury garment brand that features artworks created by First Nations artists.\n\n\n\n\n\nThe brand was launched in 2014 by Amanda Healy, a proud Wonnarua woman from Hunter Valley in New South Wales, with only four staff.\n\n\n\n\n\nNow, it's representing Australia in a business showcase in India, alongside other businesses owned and operated by First Australians.\n\n\n\n\n\nMs Healy says she's excited to join the showcase.\n\n\n\n\n\n\"The similarities between our people are remarkable. When we look at the artisans in central India and the work they do. Very based on nature, culture, country and community. It's very sympathetic with the type of artwork our women do.\"\n\n\n\n\n\nThe brand's latest collection, Evoke, combines artworks from First Nations women with Indian-made silk and cashmere.\n\n\n\n\n\nMs Healy says she hopes the collection can reflect a natural partnership between Aboriginal and Indian cultures with deep artistic traditions.\n\n\n\n\n\nThe showcase of First Nations businesses in India is part of an initiative following a trade agreement between Australia and India in 2022.\n\n\n\n\n\nIt aims to expand opportunities for Indigenous participation in international trade.\n\n\n\n\n\nBesides Kirrikin, eight leading businesses owned and operated by Indigenous Australians are also part of the delegation to India.\n\n\n\n\n\nThey come from mining, energy and the renewables sector, forming what's been called the first ever First Nations Business Mission to India.\n\n\n\n\n\nLiza Fraser-Gooda is a Bidjara, Ghangulu and Iman woman and a co-founder of SafeSpear.\n\n\n\n\n\nShe says the engagements in India - including a mining conference in Kolkata* - represents an important chance to boost exposure to Aboriginal businesses in one of the world's fastest growing economies.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/barnaby-joyce-denies-female-staffer-abuse-allegations-ahead-of-parliamentary-investigation/d46wmb1vq",
    "title": "Barnaby Joyce denies female staffer abuse allegations ahead of parliamentary investigation",
    "publish_date": "Thu, 30 Oct 2025 06:30:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Nationals MP Barnaby Joyce has denied accusations he abused a female staff member inside Parliament House ahead of an investigation into the incident.\n\n\n\n\n\nJoyce allegedly launched a verbal tirade against a Nationals staffer on Wednesday while he attempted to log a leave request to attend a funeral on Thursday.\n\n\n\n\n\nShortly before Question Time, it is understood that the former deputy prime minister went into MP Michelle Landry's office to fill out the necessary paperwork.\n\n\n\n\n\nThe New England MP allegedly raised his voice at a female Nationals staffer, cursing and entering her physical space, according to a Sky News report.\n\n\n\n\n\nJoyce, who recently quit the National Party but intends to serve out his term, contests the allegations.\n\n\n\n\n\n\"I deny the allegations, and respect the PWSS process which is now in train,\" he said in a statement to SBS News.\n\n\n\nThe incident has been formally lodged with the Parliamentary Workplace Support Service (PWSS).\n\n\n\n\n\nNationals senator Bridget McKenzie said it was \"inappropriate\" for her to comment on the alleged incident.\n\n\n\n\n\nShe said \"hard work\" had been undertaken to ensure staff felt safe and respected working inside Parliament, with the PWSS established in response to the 2021 Jenkins review into Commonwealth parliamentary workplaces.\n\n\n\n\n\n\"There's been a lot of changes in my time here,\" she said.\n\n\n\n\n\n\"I started in 2011, and it is an incredibly different workplace than when I arrived, and so PWSS has been stood up for those reasons.\"\n\n\n\n\n\nThe PWSS expects all MPs and senators to treat staff with \"dignity, courtesy, fairness and respect\".\n\n\n\nBreaches of conduct are referred to the Independent Parliamentary Standards Commission (IPSC), an arm of the PWSS, which has the power to impose sanctions against parliamentarians.\n\n\n\n\n\nThese include a written reprimand, a decision to undertake training or a behaviour agreement with the IPSC.\n\n\n\n\n\nParliamentarians found in serious breach of the code can be suspended for a period of time or fined a percentage of their salary.\n\n\n\nJoyce's future with the Nationals uncertain\n\nEarlier this month, Joyce said he was leaving the Nationals, announcing he would not stand for his lower house seat at the next election.\n\n\n\n\n\nJoyce, who was demoted from the party's front bench by leader David Littleproud earlier this year, cited fractured relationships with party leadership.\n\n\n\n\n\nThere is speculation that he may join One Nation on a Senate ticket, an option he has not ruled out.\n\n\n\n\n\nWhile he remains part of the National Party, he refuses to attend party room briefings.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/government-introduces-environment-laws-to-parliament-but-hurdles-remain/di6dn84oi",
    "title": "Government introduces environment laws to Parliament - but hurdles remain",
    "publish_date": "Thu, 30 Oct 2025 06:13:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe historic overhaul of Australia's national environmental laws has been formally tabled in the House of Representatives.\n\n\n\n\n\nLeader of the house Tony Burke introduced the 1500 page document.\n\n\n\n\n\n\"This package of bills is a once in a generation opportunity to reform our environmental laws. We've been down this path before under governments of both sides, and we cannot afford to wait any longer. This bill is a product of work over many years by countless people, all of whom I know are keen to see this done.\"\n\n\n\n\n\nThe seven-part bill has arrived five years after the 2020 Samuel Review found the current environmental laws were failing the environment.\n\n\n\n\n\nThe bill is expected to pass through the House of Representatives by the end of next week.\n\n\n\n\n\nBut the government still needs to secure a deal with either the Greens or the Coalition to pass these environment reforms in the Senate.\n\n\n\n\n\nEnvironment minister Murray Watts has told the ABC that after 100 meetings with different stakeholders, when it comes to passing these bills it’s ‘now or never.'\n\n\n\n\n\n\"If we ever want to pass these reforms, we've got to get moving with them. We can't let this go around in circles for five more years, because every time we wait and every time we get delayed, we see the environment suffer, and we see really important housing, renewables and other projects get held up in red tape.\"\n\n\n\n\n\nThe urgency is compounded by the Opposition, Greens, and crossbench teaming up to force the bill into a Senate inquiry that will not hand down its final report until March 2026.\n\n\n\n\n\nMr Watts says that at this stage of the debate, both the Coalition and the Greens are trying to extract final concessions from the government.\n\n\n\n\n\nThe Greens are saying it doesn't go far enough to protect the environment, Greens Senator Sarah Hanson-Young arguing it is riddled with concessions.\n\n\n\n\n\n\"From what we have seen, this is weakening environmental protection and doing the bidding of big business, paving the way for new coal and gas to be fast tracked, paving the way for big developers and big business to make it easier and cheaper for them to get environmental approval. Meanwhile, no protection for our native forests and no protection for the climate.\"\n\n\n\n\n\nThe Coalition is worried the bill doesn't do enough for business.\n\n\n\n\n\nA core component of the government's reform is the establishment of a National Environmental Protection Agency (NEPA), but Opposition environment spokesperson Angie Bell has voiced concerns.\n\n\n\n\n\nMs Bell says the inclusion of emissions reporting in the EPBC Act could open the door to increased legal challenges - but she is most crtical of what she calls the \"EPA's sweeping powers.\"\n\n\n\n\n\n\"The wide ranging powers of the EPA, it'll be a statutory appointment that will not report directly to the minister. The minister won't be able to sack that individual. It'll have to be be the governor general that does that. And so that that is a problem in terms of what that outcome might look like in terms of broad, sweeping powers.\"\n\n\n\n\n\nEnvironmental groups, however, are expressing the opposite concern about the E-P-A.\n\n\n\n\n\nGroups like the Australian Conversation Foundation are worried that retaining the Minister's power of final approval over the EPA will leave environmental protection vulnerable to the political whims of whoever is currently in power.\n\n\n\n\n\nActing CEO of the A-C-F, Paul Sinclair, spoke to SBS.\n\n\n\n\n\n\"One of the things that we would love would be for it to be genuinely independent, where the CEO of the EPA would make approval decisions rather than the minister. That would mean that the minister could be the champion of the environment, rather than having to approve, as he's done recently, one of the largest gas polluting gas projects in the southern hemisphere. So we would like to see those approval decisions at a at arm's length from the minister, so that they can't a future Minister can't be influenced by industry, and we think it's a better decision making process.\"\n\n\n\n\n\n\n\nOne of the other major concerns expressed by environmental groups is around native forest logging.\n\n\n\n\n\nMurray Watt has told the ABC that the agricultural land clearing exemptions sought by environmental groups hadn't been addressed because some of those issues were not included in the Samuel Review.\n\n\n\n\n\n\"As we've said since my predecessor, Tanya Plibersek, began work on this package, is that we would apply the national environmental standards to regional forestry agreements under which native forestry occurs. That was the recommendation from Graham Samuel. So that's the direction we're intending to go. I am aware that some of the environment groups are also seeking removal of exemptions when it comes to agricultural land clearing. There's not anything in the bill on that front, mainly because my priority has been to focus on delivering those recommendations.\"\n\n\n\n\n\nHowever, Paul Sinclair says the government is ignoring elements of the Samuel Review that are related to native forest logging.\n\n\n\n\n\nHe says the Samuel Review explicitly labelled the Regional Forest Agreements (RFAs) as 'broken', and he argues the federal government must take over their management from the states to secure these protections through enforceable national standards.\n\n\n\n\n\nMr Sinclair has told SBS these issues haven't been addressed in the current bill.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/trump-touts-asia-triumph-and-a-third-term-gaza-ceasefire-tested-et-tu-queensland/em6e6nis3",
    "title": "Trump touts Asia triumph - and a third term, Russia's oil sanctions & 'et tu' Queensland?",
    "publish_date": "Thu, 30 Oct 2025 04:11:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/article/136-000-super-warning-as-australia-faces-a-silver-tsunami/evvouelwc",
    "title": "$136,000 superannuation warning as Australia faces a 'silver tsunami'",
    "publish_date": "Thu, 30 Oct 2025 03:36:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians could miss out on more than $130,000 in retirement because of the \"daunting complexity\" of the superannuation system, according to a new report.\n\n\n\n\n\nThe report by industry peak body the Super Members Council (SMC) calls for reform to simplify the system and make financial guidance more accessible as Australia faces what it has called a \"silver tsunami\".\n\n\n\n\n\nThis wave of retirement over the next decade will see 2.8 million Australians leave the workforce, according to the SMC, which predicts a doubling of the annual number of retirees from 150,000 to 300,000.\n\n\n\n\n\nIt estimates that over this same period, the collective amount these retirees will have in super will double from about $750-800 billion to about $1.5 trillion over that same period.\n\n\n\n\n\nBut it also predicts that a typical retiree could miss out on as much as $136,000 — or $6,500 a year — over the course of retirement unless changes are made.\n\n\n\nThe report cautions that \"without new solutions, our current retirement system will continue to impose too much complexity on retirees, which is overwhelming for all but the most financially confident\".\n\n\n\n\n\nSMC chief executive Misha Schubert said the findings highlight \"with fresh urgency\" the need for a simpler, more intuitive retirement system.\n\n\n\n\n\n\"We need to make the shift into retirement so much simpler, easier and more intuitive for everyday Australians,\" she said.\n\n\n\n\n\n\"This challenge is now incredibly urgent as almost three million Australians start to race towards retirement in coming years.\"\n\n\n\nRetiring 'with confidence'\n\nThe report also points to rising challenges as Australians live longer and retire with higher levels of debt.\n\n\n\n\n\nMore than 40 per cent of households approaching retirement now have a mortgage, while many struggle to navigate how super interacts with the age pension.\n\n\n\n\n\nDespite strong demand for assistance, few retirees seek professional advice. More than 80 per cent of pre-retirees said they would use free financial guidance from their super fund, but only half would pay for detailed advice.\n\n\n\nProposed reforms include automatically removing tax from eligible accounts at age 65, reviewing minimum drawdown rules for low-balance retirees, and introducing quality standards for retirement products.\n\n\n\n\n\nThe report also claims to dispel the \"persistent myth\" that retirees underspend their super.\n\n\n\n\n\nIn the 2024–25 financial year, 64 per cent of retirees with tax-free accounts withdrew more than the minimum required, rising to 78 per cent among those with balances below $50,000, according to the SMC report.\n\n\n\n\n\n\"Moving to a system of simpler, smarter pathways into retirement would mean every Australian could retire with confidence, knowing they're not missing out on money to pay the bills and enjoy their later years,\" Schubert said.\n\n\n\n\n\nThe Association of Superannuation Funds of Australia estimates that the lump sum needed at retirement to support a comfortable lifestyle is $690,000 for a couple and $595,000 for a single person, according to data from the March quarter 2025. This assumes home ownership and a partial age pension.\n\n\n\nMeanwhile, Treasurer Jim Chalmers has confirmed that a new round of consultation on the superannuation performance test — a regulatory assessment — is underway.\n\n\n\n\n\n\"The goal is to refine and strengthen the performance test to make sure it isn’t creating unnecessary obstacles to investment, particularly in key areas like housing and energy,\" he said at the Australian Chamber of Commerce and Industry gala dinner in Canberra on Wednesday night.\n\n\n\n\n\n\"It's about better aligning and unlocking investment that also boosts productivity, while maintaining a robust test and a primary focus on member returns.\"\n\n\n\n$19 billion in lost super\n\nThe new report comes after the Australian Taxation Office (ATO) revealed on Wednesday there is almost $19 billion in lost and unclaimed superannuation waiting to be reunited with more than 7 million people.\n\n\n\nREAD MORE The changes to your superannuation in Treasurer Jim Chalmers' surprise announcement\n\nATO deputy commissioner Ben Kelly said lost or unclaimed super can occur when accounts become inactive and funds lose contact with their members.\n\n\n\n\n\n\"Checking for lost or unclaimed super is like reaching into your pocket and finding a $50 note — it's your money, you just didn’t know it was there,\" he said.\n\n\n\n\n\nThe ATO estimates that around four million Australians hold two or more super accounts, increasing the risk of duplicated fees and lost balances.\n\n\n\n\n\nThe average amount of lost or unclaimed super is $2,590, which could grow to tens of thousands by retirement if left unclaimed, according to the ATO.\n\n\n\n\n\nThis article is general information. Please see a professional if you need financial advice.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/10-quick-and-simple-new-midweek-friendly-meals-with-12-ingredients-or-less-20251031-p5n6ru.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "10 quick and simple new midweek-friendly meals with 12 ingredients or less",
    "publish_date": "Fri, 31 Oct 2025 12:55:10 +1100",
    "category": "sports",
    "authors": [],
    "text": "You have reached your maximum number of saved items.\n\nRemove items from your saved list to add more.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-andrew-to-lose-prince-title-and-leave-royal-lodge-buckingham-palace-says-trump-heads-back-to-the-us-after-xi-meeting-hamas-urges-australian-government-to-remove-its-terror-listing-20251031-p5n6om.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Andrew to lose prince title and leave Royal Lodge; Trump heads back to the US after Xi meeting; Hamas urges Australia to remove its terror listing",
    "publish_date": "Fri, 31 Oct 2025 12:40:47 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "As Hurricane Melissa takes aim at Bermuda, new satellite data of Jamaica has revealed devastation for tourist centre Montego Bay and much of the Western part of the country.\n\nAt least 40 per cent of the buildings and roads in the worst-hit areas on the island were severely damaged, according to a Bloomberg News analysis of satellite data processed by the Earth Observatory of Singapore.\n\nThe hurricane caused the most destruction in Jamaica’s western region, which includes the devastated town of Black River and the heavily-damaged tourist centre of Montego Bay. Analysis of satellite data shows that Saint James, Westmoreland and Saint Elizabeth parishes were most affected.\n\n“I have never seen anything like this before,” said Kerry-Lee Lynch, head of United Way of Jamaica, who drove from Kingston to Montego Bay on Wednesday past downed trees and power poles. She said the damage from Melissa was worse than the hurricanes that devastated island in years past.\n\nThe record-setting storm made landfall on Tuesday near New Hope, Jamaica, as a Category 5 hurricane packing winds of 298 kilometres per hour – the strongest storm to hit the island in more than 170 years of record keeping.\n\nAuthorities are still assessing the full extent of the damage, but economic losses are already estimated to be at least $8 billion, said Chuck Watson, a disaster modeller at Enki Research.\n\nBloomberg",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/traveller/travel-news/two-australian-hotels-named-in-world-s-50-best-list-20251031-p5n6qy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two Australian hotels named in World’s 50 Best list",
    "publish_date": "Fri, 31 Oct 2025 12:36:46 +1100",
    "category": "finance",
    "authors": [
      "Katherine Scott"
    ],
    "text": "Advertisement\n\nTravel newsLuxury holidays Two Australian hotels named in World’s 50 Best list Katherine Scott October 31, 2025 — 12:36pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share 0 Leave a comment\n\nTwo Australian hotels have been recognised in the coveted World’s 50 Best Hotels list by a global academy of well-travelled experts in the hotel and travel industry, with new entry Capella Sydney named Best Hotel in Oceania. Capella Sydney’s Edwardian baroque-style facade, in the former NSW Department of Education building. Timothy Kaye Capella Sydney’s glass-enclosed atrium with remotely operated artificial flowers that open and close above diners’ heads. Capella Sydney, operated by high-end Singapore-based Capella Hotels and Resorts group, ranked No.12 this year, with the former top-ranking Australian hotel for two years running, Brisbane’s The Calile, sliding down the list nine places to No.34. The Calile slid down the list to No.34 on the World’s 50 Best Hotels rankings for 2025.\n\nAdvertisement\n\nThe best hotels for 2025 were announced at a ceremony at London’s Old Billingsgate on Thursday, with luxury Chinese hotel Rosewood Hong Kong finally taking out the number one spot after featuring in the top three since the awards’ inception in 2023. It marks the third edition of the annual hotel rankings for the 50 Best group, best-known for its annual global top-50 restaurants and bars lists. Compiled by UK-based company William Reed Business Media, the hotel rankings’ debut in 2023 marked the group’s first global launch since turning its attention to bars in 2009. The World’s 50 Best Hotels No.1 … Rosewood Hong Kong. Wraparound terrace and pool at Rosewood Hong Kong. The Thai capital made a splash this year with two hotels in the top 3, and three in the top 10. Four Seasons Bangkok at Chao Phraya River came in second place, while last year’s No.1 Capella Bangkok followed in third, with Mandarin Oriental Bangkok rounding out the city list with a No.7 ranking.\n\nAdvertisement\n\nCapella Sydney’s general manager Marc von Arnim said the team was “humbled and proud to be part of this extraordinary list of the world’s finest hotels”. Since launching in 2023, Capella Sydney has quickly established itself as one of the city’s most luxurious properties. Capella Sydney’s 20-metre indoor rooftop pool on level six. Dominic Lorrimer The suite life … standalone bathtubs at Capella Sydney. The 192-room, $300 million hotel in the heart of Sydney’s heritage “sandstone precinct”, set within the early 1900s Edwardian baroque former NSW Department of Education building, spared no expense in its thoughtful restoration and reimagining of the property, with art-studded interiors, a luxury spa, indoor rooftop pool and luxury touches like standalone bathtubs.\n\nAdvertisement\n\nRelated Article ★★★★★\n\nHotel reviews No harbour views, but new $300 million Sydney hotel gets perfect score For dining and drinking, the street level has three places for guests and the public to congregate: Aperture, Brasserie 1930 and McRae Bar. The adjacent Lands by Capella in the historic Department of Lands building is currently under construction by Capella’s developer arm Pontiac, set to open as an events space in February, with plans for it to eventually house eateries, bars and boutiques. New South Wales and Queensland weren’t the only Australian states to receive a 50 Best nod. Baillie Lodges’ ultra-luxury all-inclusive retreat Southern Ocean Lodge on Kangaroo Island in South Australia was named the American Express Travel ‘One To Watch’ last month. Southern Ocean Lodge has been recognised in the World’s 50 Best Hotels as the “one to watch”. The high-end retreat was rebuilt following the devastating 2020 bushfires that ravaged Kangaroo Island.\n\nAdvertisement\n\nThe award marks a turning point for the property, which was destroyed in the January 2020 bushfires, and reopened a year ago following a long, painstaking clearing and rebuilding process. Hobart’s Marriott-run The Tasman, which ranked No.49 in 2024, didn’t make this year’s top-50 list. Related Article Luxury holidays Five years after being destroyed, iconic Aussie lodge is back to its best Beyond the top-50 rankings, some properties received special awards, with another former winner, Italy’s Passalacqua in Lake Como (No.4), nominated Best Boutique Hotel for a second year; Desa Potato Head in Bali taking out the Eco Hotel Award; Mandarin Oriental Qianmen in Beijing (No.14) singled out as the Nikka Best New Hotel Award, and Atlantis The Royal in Dubai (No.6) named Best Beach Hotel. The academy chair position for the Oceania region, which includes Australasia, Melanesia, Micronesia and Polynesia, is held by Melbourne-based food and travel critic Michael Harden, however it’s not known how many of the jurors voting in the awards are Australian or Oceania-based.\n\nAdvertisement\n\nThe World’s 50 Best Hotels rankings is based on the votes of a collective of 580 jurors spanning nine geographical regions and comprising hoteliers, travel journalists, hotel educators and seasoned luxury travellers. Panel members submit seven votes, in order of preference, based on stays over a two-year period ending in April 2024. The World’s 50 Best lists have been criticised for favouring European venues and demonstrating a lack of diversity, though measures have been taken to address some of these shortfalls, including mandating a 50/50 gender balance among jurors. Any hotel is eligible; there is no essential criterion for a property to qualify for a vote, and hotels aren’t required to “pay to play”. The World’s 50 Best Hotels for 2025 Rosewood Hong Kong, Hong Kong Four Seasons Bangkok at Chao Phraya River, Bangkok Capella Bangkok, Bangkok Passalacqua, Lake Como Raffles Singapore, Singapore Atlantis The Royal, Dubai Mandarin Oriental Bangkok, Bangkok Chablé Yucatán, Chocholá Four Seasons Firenze, Florence Upper House Hong Kong, Hong Kong Copacabana Palace, Rio de Janeiro Capella Sydney, Sydney Royal Mansour, Marrakech Mandarin Oriental Qianmen, Beijing Bulgari Tokyo, Tokyo Claridge’s, London Four Seasons Astir Palace, Athens Desa Potato Head, Bali Le Bristol, Paris Jumeirah Marsa Al Arab, Dubai Cheval Blanc Paris, Paris Bulgari Roma, Rome Hôtel de Crillon, Paris Rosewood São Paulo, São Paulo Aman Tokyo, Tokyo Hotel Il Pellicano, Porto Ercole Hôtel du Couvent, Nice Soneva Fushi, Maldives The Connaught, London La Mamounia, Marrakech Raffles London at The OWO, London The Emory, London Maroma, Riviera Maya The Calile, Brisbane The Lana, Dubai Hôtel de Paris Monte-Carlo, Monaco Janu Tokyo, Tokyo The Taj Mahal Palace, Mumbai One&Only Mandarina, Riviera Nayarit Singita – Kruger National Park, Kruger National Park Mandarin Oriental Hong Kong, Hong Kong Hotel Bel-Air, Los Angeles The Mark, New York Las Ventanas al Paraíso, Los Cabos The Tokyo Edition Toranomon, Tokyo Hotel The Mitsui, Kyoto Estelle Manor, Witney Grand Park Hotel Rovinj, Rovinj Hotel Sacher Vienna, Vienna Mandapa, Bali\n\nSign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/victorian-tasmania-cricketers-lead-tributes-to-ben-austin-amid-safety-focus-20251031-p5n6sb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victorian, Tasmania cricketers lead tributes to Ben Austin amid safety focus",
    "publish_date": "Fri, 31 Oct 2025 12:25:31 +1100",
    "category": "sports",
    "authors": [
      "Roy Ward"
    ],
    "text": "Victorian and Tasmanian cricketers have led solemn tributes to teenage player Ben Austin on Friday morning before play in their Sheffield Shield match at the Junction Oval.\n\nThe players leaned their bats and caps against the fence as a symbol of respect, wore black arm bands and held a minute’s silence as the cricket community continued to grieve the death of the Ferntree Gully teenager, who was struck on the neck by an accidental full toss while training with friends on Tuesday.\n\nVictorian players Sam Harper, Pete Handscomb, and David Moody observe a minute’s silence in honour of teenage cricketer Ben Austin. Credit: Getty Images\n\nAustin died later in hospital.\n\nThe accident has turned a spotlight on the safety of cricket and, in particular, on the use of “wangers”, a training device that launches the ball at varying speeds and lengths.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/australia-s-world-cup-reign-ended-by-indian-brilliance-20251030-p5n6nz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Un-Australian’: Sloppy display, record chase send Healy’s troops home early from World Cup",
    "publish_date": "Fri, 31 Oct 2025 11:58:35 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Alyssa Healy called it “un-Australian”. It was certainly unexpected, and unbecoming for the team that has until the past year or so boasted perhaps the most enviable winning record in world sport.\n\nFor the first time in nearly a decade, the Australian women’s team will not be in possession of either the ODI or Twenty20 World Cup after they were toppled by India in the semi-final of the Women’s World Cup on Thursday night.\n\nIndia celebrate. Credit: Getty Images\n\nThis is the last time Healy will be seen at the 50-over tournament, and coach Shelley Nitschke has some thinking to do about how to hand leadership to the next generation.\n\nAustralia’s elimination by India in Mumbai was brought about largely by an extraordinary century from Jemimah Rodrigues in her team’s world record chase, but what will stick in the craw of Healy’s team is the sloppiness that allowed her to get that far.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/racing/my-phone-beeped-with-devastating-news-the-joys-and-shattering-lows-of-being-a-1-per-cent-racehorse-owner-20251029-p5n69o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "My phone beeped with devastating news. The joys and shattering lows of being a 1 per cent racehorse owner",
    "publish_date": "Fri, 31 Oct 2025 11:45:02 +1100",
    "category": "sports",
    "authors": [
      "Heath Linton"
    ],
    "text": "November 26, 2024: it’s a day I’ll never forget.\n\nMy spirits had been high that morning. We had received a routine message from our trainers updating us our horse King Kirk’s performance in a trial and outlining a program we hoped would take him to victory in the Golden Slipper.\n\nKing Kirk (right) won the Breeders’ Plate on debut. Credit: Getty Images\n\nEver since he came from last to win the Breeders Plate on debut in Sydney in early October, we had been dreaming big. We being Dad, my brother Travers, one of my best mates Trent Wemyss, and me.\n\n“The King”, as I liked to call him, was the favourite for the Slipper, one of the most prestigious races in Australian racing.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/batter-up-how-does-your-australian-top-six-compare-to-our-experts-20251030-p5n6jm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Batter up: How does your Australian top six compare to our experts?",
    "publish_date": "Fri, 31 Oct 2025 11:44:00 +1100",
    "category": "sports",
    "authors": [
      "Tom Decent",
      "Daniel Brettig",
      "Jon Pierik",
      "Dan Walsh",
      "Chloe Saltau",
      "Andrew Wu"
    ],
    "text": "Tom Decent Usman Khawaja\n\nMarnus Labuschagne\n\nSteve Smith\n\nCameron Green\n\nTravis Head\n\nBeau Webster Usman Khawaja’s big-game experience remains invaluable. The 38-year-old deserves the first two Tests at the top, but if he doesn’t make a significant score, a farewell at the Gabba looms. That is unless Australia record big wins in Perth and Brisbane. Khawaja peeled off 232 against Sri Lanka earlier this year, yet he has passed 90 just once in 44 Test innings since June 2023.\n\nMarnus Labuschagne’s runs for Queensland are encouraging, and facing the new ball won’t bother him. Green is well-suited to No.4 and is likely to make that spot his for a decade once Smith retires, so why not start now? Steve Smith reached triple figures for NSW this week. Credit: Getty Images It would also give Green a bit more of a breather if he’s bowling. Beau Webster stays in the team as insurance given there are questions over Green’s potential bowling loads. From seven Tests, Webster has done everything asked of him, averaging 34.63 with the bat. Mitch Marsh could be a smoky to open the batting but Labuschagne is firming to go up the top, with Green, Smith, Head, and Webster to follow.\n\nChloe Saltau Usman Khawaja\n\nMatt Renshaw\n\nMarnus Labuschagne\n\nSteve Smith\n\nTravis Head\n\nBeau Webster As doubts persist about Cameron Green’s capacity to bowl a meaningful number of overs, I’m leaving him out of the XI. It’s a tough call. Effectively, I’m picking a specialist opener in Renshaw ahead of him, and rewarding Labuschagne for doing exactly what was asked of him – going back to the Shield and scoring a mountain of runs. Beau Webster has done nothing wrong since coming in as an all-rounder – his bowling adds versatility and balance, and his big mitts are an asset in the field. Jon Pierik\n\nUsman Khawaja\n\nJake Weatherald\n\nMarnus Labuschagne\n\nSteve Smith\n\nTravis Head\n\nCameron Green Usman Khawaja is a lock to retain his spot at the top of the order, but who should be his partner has been a major debate. I am plumping for Tasmanian Jake Weatherald, last season’s leading Sheffield Shield run scorer, who has scores of 67, 57, and 94 among his innings so far this season. His time has arrived. Sam Konstas has not done enough to justify a return. Marnus Labuschagne has done what the selectors asked and lifted his scoring rate since he was axed from the Test team. He is ready to return in his customary role at No.3. I have Cameron Green at No.6. If he can deliver eight to 10 quality overs a day, it’s best if the all-rounder is given the chance to rest early when Australia are batting.\n\nDan Walsh Usman Khawaja\n\nMatt Renshaw\n\nMarnus Labuschagne\n\nSteve Smith\n\nTravis Head\n\nBeau Webster If Cameron Green isn’t bowling, and there’s a lot of faith required to see him adding to the four overs he managed before succumbing to side ‘soreness’ earlier this month, then Beau Webster deserves the all-rounder’s gig. He’s been a sure, steady hand with bat, ball, and in the field in much the same vein as a fully fit Green since his Test debut. Pat Cummins’ potential return offers a chance to recalibrate the fifth bowling option according to how Australia’s pacemen are holding up. But for the first two Tests, there’s just too much upheaval at the top already for Marnus Labuschagne to be shoehorned into opening, so Green can fit in at No.3 as well. Renshaw returns as a far more rounded opener than the ‘turtle’ he first answered to during his first stint in the Test side. Consistent runs for Queensland, Australia A, and a recent ODI debut complement recent county stints in England where he’s added scoring shots around the wicket, and get him the nod ahead of the impressive Jake Weatherald.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/world/europe/revisit-that-car-crash-tv-interview-which-destroyed-prince-andrew-20251031-p5n6rz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Revisit that car crash TV interview which destroyed Prince Andrew",
    "publish_date": "Fri, 31 Oct 2025 11:37:01 +1100",
    "category": "finance",
    "authors": [],
    "text": "Revisit that car crash TV interview which destroyed Prince Andrew\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  }
]