[
    {
        "url": "https://www.9news.com.au/national/cost-of-living-not-switching-energy-providers-could-cost-consumers-hundreds-extra-accc-warns/abf5eab8-5a94-454c-90d7-f2d197dc58bc",
        "title": "Aussies could save hundreds by doing one simple thing",
        "publish_date": "Sun, 28 Dec 2025 23:45:57 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Australians are being warned to switch energy providers to save extra cash.\n\nThe Australian Competition and Consumer Commission (ACCC) warns that not shopping around could leave people out of pocket.\n\nThe warning comes as the growing pressure of household bills weighs on families and fewer believe the government will be able to help.\n\nNot switching energy providers regularly could cost consumers hundreds extra on their bills, the Australian Competition and Consumer Commission has warned. (9News)\n\nThe latest mood of the nation report found the number of Australians who lack confidence in either major party to manage the cost of living crisis is up from 19 per cent in April to 30 per cent in November.\n\nBrian Tyson from research firm SEC Newgate said those numbers \"point to a growing concern about the future of the economy\".\n\nBut Federal MP Kristy McBain said plans were in motion.\n\n\"There are a range of investments that we're putting in place to help take pressure off Australians but there's always more to do in this space,\" she said.\n\nNational Leader David Littleproud said \"the reality is energy is the economy\".\n\n\"We have to tackle energy prices and focus on energy affordability,\" he said.\n\nThe latest mood of the nation report found the number of Australians who lack confidence either major party to manage the cost of living crisis (Getty)\n\nThe ACCC found household energy bills rose an average of 6 per cent nationwide over 12 months.\n\nAnd they say staying on the same energy deal for more than three years is costing consumers an extra $221.\n\n\"We've got energy providers who need to be mindful that in this day and age it is easier to switch than ever before,\" McBain said.\n\nMortgage costs are also front of mind.\n\nCommonwealth Bank and NAB predict the Reserve Bank will increase the cash rate as early as February, while the government's own forecasts predict inflation could stay above the target range until June.\n\nCommonwealth Bank and NAB predict the Reserve Bank will increase the cash rate as early as February (AFR)\n\n\"They know that if inflation isn't coming down, the prospect of future interest rate cuts are less likely,\" Tyson said.\n\nMcBain said the government would do its part in \"trying to keep interest rates low\" but said it was ultimately not its call.\n\n\"I think it's really important that we do our part and play our part in trying to keep interest rates low but at the end of the day that will be a decision for the independent reserve bank of Australia,\" she said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/accessible-beaches-austra-melbourne-beach-has-been-crowned-australias-best-for-one-crucial-reasonlia/c808de1f-c8b3-4319-abf5-053f08f660e6",
        "title": "This Melbourne beach has been crowned Australia's best for one crucial reason",
        "publish_date": "Sun, 28 Dec 2025 19:30:15 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "A quick dip to cool off on a scorching summer's day, or a casual wade through gentle waves with family and friends, is a pastime deeply rooted in the Australian experience.\n\nBut until this month, Carly Burns struggled to get past the beach car park.\n\nBorn with spina bifida, the 38-year-old from Frankston, on the outer eastern fringe of Melbourne, has used a wheelchair for most of her life.\n\nBeach matting allows people who use wheelchairs to reach the water's edge. (Supplied)\n\n\"I've never actually been able to get down onto the beach on my own… I would have to be up on the concrete just watching,\" she said.\n\nBut an Australian-first pilot to create the nation's first fully-accessible beach has given Burns, and 30,000 other Frankston residents living with a disability, a newfound ability to enjoy the beach in the same way millions of others across the country do.\n\n\"I have family that would carry me [in the past], but to be able to do it myself is amazing,\" Burns said.\n\nAccessible Beaches Australia and Frankston Council unveiled the nation's most accessible beach to users and supporters on December 5.\n\nThe three-month pilot includes 70 metres of beach matting running to the water's edge to allow wheelchairs to traverse the sand, daybeds with cabanas, five beach wheelchairs, two beach walkers, and a hoist to support transfers between wheelchairs.\n\nOut of the 160 accessible beaches in Australia, Frankston is the first to have staff and volunteers to help beachgoers enter and exit the water.\n\nFor participant Chris Wiggett, swimming at the beach was an opportunity more than seven years in the making.﻿\n\n\"Last time I was knocked over, which frightened me,\" she said at the pilot launch.\n\n\"This morning, a volunteer helped me down to the water. I put my feet in and walked along the sand, and I cried, because it was the first time in years I could do that.\"\n\n'A new level of inclusion'\n\nOther beaches across Australia are increasing their accessibility, with some offering beach mats, wheelchairs and accessible changerooms and parking.\n\nBut the mission to create a fully accessible beach in Australia was a dream first imagined nearly 10 years ago by Accessible Beaches Australia founder Shane Hryhorec.\n\nHryhorec grew up in South Australia, where he spent his days patrolling Grange Beach as a surf lifesaver.\n\nBut after breaking his neck in a swimming pool accident in 2007, Hryhorec became an incomplete quadriplegic aged 21.\n\nAfter his accident, he says the beach quickly became a place he avoided.\n\n\"I just instantly had to stop all the things that I liked to do that I would no longer be able to do, and one of those things that first came into my mind was the beach,\" he said.\n\n\"I just instantly wrote it off in my mind.\n\n\"I tried to go to the beach a few times after my accident, and I just found it very, very difficult, to the point where ... the challenge of it just became too great.\"\n\nAlmost 10 years later, Hryhorec was scrolling the internet when he came across a photo of a beach mat.\n\n\"I was blown away, and at that point I was like, we need this in Australia,\" he said.\n\nAccessible Beaches Australia founder Shane Hryhorec (left) with former Frankston City Council mayor Kris Bolam and Accessible Beaches Australia's Bern Walker. (Facebook)\n\nFrom there, he created Accessible Beaches Australia, which led him to visit the world's most accessible beach in Antibes, in the south of France, 18 months ago.\n\n\"They went to a new level of inclusion that I've never seen before,\" Hryhorec said.\n\n\"I didn't realise we could be doing so much better until I experienced the best.\"\n\nHryhorec hopes the inclusion of daybeds and volunteer staff can also encourage the ageing population to visit the beach - a sight he said \"warmed [his] heart\" in Antibes.\n\n\"Literally half of the people that were enjoying the beach were probably around their 80s or above, which I just thought was just so special,\" he said of the French Handiplage.\n\n\"People just assume when they get older is that they just can't go to the beach, especially if you don't have someone to go with, or a partner might have passed or something,\" he said.﻿\n\n\"When you're seeing our ageing population get to experience the beach, which they may not have been able to do for 10, 15, even 20 years, then that for me is what really grabs at my heartstrings.\"\n\nThe push for accessible beaches nationwide﻿\n\nHryhorec credits much of the success of the summer pilot program to Frankston City Council, which worked with the local community to raise $200,000 to bring it to fruition.\n\n\"I've been doing this work for nearly 10 years, making beaches accessible, and I've never seen a council and community get behind something with so much passion and enthusiasm and compassion,\" he said.\n\n\"If other communities could just be a smidgen of what Frankston is, what they could achieve for inclusion would be incredible around the country.\"\n\nThe Australian-first pilot features accessible beach amenities including beach wheelchairs and walkers. (Facebook)\n\nFrankston City councillor Kris Bolam, who just finished his tenure as mayor, said he hopes the pilot \"becomes the spark that inspires similar programs across Australia\".\n\n\"Hearing families say this is the first time they'll be able to visit the beach together is incredibly moving. That's the real success of today,\" he said.\n\nThat's a goal shared by Hryhorec and Burns.\n\n\"My hope is that every patrolled beach in the entire country has a level of accessibility on the beach, just like in Frankston,\" Hryhorec said.\n\n\"I hope that others would be able to get the same opportunity that I have been able to get, and I would recommend that they do it,\" Burns said.\n\nCarly Burns, 38, was the first person to use the beach wheelchairs at Frankston beach. (Frankston City Council)\n\nUntil then, Burns is looking forward to her first summer at the beach.\n\n\"I have young nieces and nephews, so it will be good to be able to join them in the water rather than having to just sit back and watch.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/superannuation-australia-victorian-woman-marilyn-late-husband-life-insurance-payout-and-super-both-lost/9fef3d02-1b93-444a-9698-0af6eda9b299",
        "title": "Marilyn lost retirement fund and husband's life insurance payout in one fell swoop",
        "publish_date": "Sun, 28 Dec 2025 19:43:17 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Exclusive: M﻿arilyn believed she was being financially responsible when she clicked on a Facebook advertisement for a superannuation health check two years ago.\n\nThe Victorian woman, 60, was looking to retire soon and pay herself a modest pension after a tough few years, including the death of her husband in 2016.\n\nShe had been paid a significant life insurance sum, along with both their superannuation funds, and wanted to protect her assets.\n\nMarilyn transferred two lots of super and her husband's life insurance payout after a financial health check. (Supplied)\n\nThe ﻿financial nightmare that followed left Marilyn feeling \"stupid\".\n\n\"﻿I thought, what a stupid thing I've done. So I felt angry with myself,\" Marilyn told nine.com.au.\n\n\"I felt so terrible that I had possibly wasted my husband's superannuation, my superannuation and the payout for his life insurance.\"\n\nBut how could 12,000 Australians make the very same costly \"mistake\"?\n\nMarilyn is among thousands who have either lost everything or had their superannuation funds frozen following the collapse of ﻿First Guardian Master Fund and Shield Master Fund.\n\nAfter a lengthy super \"health check\" with a financial advisor firm, Marilyn decided to transfer her fund from﻿ HESTA over to a fund known as AusPrac in November 2023.\n\nShe then rolled together all her money under the one account, hoping she could boost returns.﻿\n\nAusPrac, also known as Australian Practical Superannuation, is operated by parent company Sequoia Financial Group.\n\n9news.com.au has previously ﻿contacted Sequoia for comment but has not received a reply.\n\nASIC has commenced civil penalty proceedings in the Federal Court against Diversa Trustees Limited – the trustee for AusPrac – alleging failures relating to the First Guardian Master Fund. Diversa said it would \"vigorously defend\" the claims.\n\nOn December 23, ASIC imposed extra licence conditions on Diversa over what it alleges were a series of governance failures. Diversa acknowledged the new conditions but argued they were not \"necessary or warranted in the circumstances\".\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nMarilyn was left with just $10.49 in her super account. (Supplied)\n\nMarilyn was living off her savings and wanted to withdraw some of the funds 18 months later.\n\n\"I rang up to tell my superannuation body that I wanted to start drawing down a pension,\" Marilyn explained.\n\n\"And at the time, the man said, 'Oh look, I'm terribly sorry, haven't you heard your super is frozen and you can't access it?'\"\n\nMarilyn's heart sank.\n\nHer money had been funnelled into First Guardian, which went into liquidation ﻿in April this year.\n\nShe didn't have enough money in her savings account to keep going without the funds.\n\n\"﻿I thought, OK this is going to be difficult, but I've done difficult things before,\" she added.\n\nA recent check of her AusPrac super balance showed she had just $10.49 left in it.﻿\n\nMarilyn said a small part of her knew something was amiss after she ﻿jumped through the hoops during her \"health check\".\n\n\"I knew there was a bloody rat. I smelled the rat and I dismissed it... or allowed myself to be reassured.﻿\"\n\nAs the watchdog sues various entities and attempts to untangle First Guardian and Shield's failures﻿ in an investigation, people like Marilyn are playing the waiting game.\n\nHer money had been funnelled into First Guardian, which went into liquidation ﻿in April this year. (Supplied)\n\nAmid the heartbreak has been a bright spot: the Facebook community.\n\n﻿There are nearly 2000 Australians facing the same uncertain future who have joined forces to demand government intervention.\n\n\"That really helped,\" Marilyn said.\n\n\"And then I started to think, 'OK, maybe, you know, I wasn't so stupid making that decision'.\"\n\nMelinda Kee has been a pillar of support for thousands of Australians caught up in the twin super collapse. (Supplied)\n\nChief among the supportive Facebook group members taking action is Melinda Kee, who lost $360,000 in the First Guardian collapse.\n\nKee has become a voice for the thousands of confused and worried Australians who have lost a collective ﻿$1.2 billion in retirement savings.\n\n\"Melinda came and visited me here,\" Marilyn said.\n\n\"She was just so lovely. She gave me a hug and comforted me... I needed face and a name, having a human being in my kitchen saying, 'There's a whole lot of us, and we're already doing a whole lot of things'.\"\n\nAustralians like Marilyn and Melinda won't stop trying to find justice for the 12,000 people who have had their futures stolen.\n\n﻿Marilyn didn't want to tell anyone about the money she'd lost.\n\nNow, she hopes her vulnerability will help those financial victims still blaming themselves.\n\n\"﻿It shook trust in myself,\" she added.\n\n\"Now, I am finding out how to get back that integrity and dignity. ﻿I don't want to lose faith in myself... or feel I make bad choices.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/brigitte-bardot-death-1960s-sex-symbol-turned-militant-animal-rights-activist-dies-aged-91/6def262c-0bbf-446c-bdb8-328054e794bc",
        "title": "French film star Brigitte Bardot dies, aged 91",
        "publish_date": "Sun, 28 Dec 2025 12:13:56 +0000",
        "category": "entertainment",
        "authors": [
            "Dec"
        ],
        "text": "Brigitte Bardot, the French 1960s sex symbol who became one of the greatest screen sirens of the 20th century and later a militant animal rights activist, has died. She was 91.\n\nBardot died Sunday at her home in southern France, according to Bruno Jacquelin, of the Brigitte Bardot Foundation for the protection of animals.\n\nSpeaking to The Associated Press, he gave no cause of death, and said no arrangements have yet been made for funeral or memorial services.\n\nFrench actress Brigitte Bardot poses with a huge sombrero she brought back from Mexico, as she arrives at Orly Airport in Paris, France, on May 27, 1965 (AP Photo)\n\nShe had been hospitalised last month.\n\nBardot became an international celebrity as a sexualized teen bride in the 1956 movie And God Created Woman . Directed by her then-husband, Roger Vadim, it triggered a scandal with scenes of the long-legged beauty dancing on tables naked.\n\nAt the height of a cinema career that spanned some 28 films and three marriages, Bardot came to symbolise a nation bursting out of bourgeois respectability. Her tousled, blond hair, voluptuous figure and pouty irreverence made her one of France's best-known stars.\n\nSuch was her widespread appeal that in 1969 her features were chosen to be the model for \"Marianne\", a bare-breasted statue representing the French Republic, and the official Gallic seal. Bardot's face appeared on statues, postage stamps and even on coins.\n\n''We are mourning a legend,'' French President Emmanuel Macron wrote Sunday on X.\n\nFrench actress Brigitte Bardot poses in character from the motion picture \"Voulez-Vous Danser Avec Moi\" (Do you Want to Dance With Me), on Sept. 10, 1959. (AP)\n\nBardot's second career as an animal rights activist was equally sensational. She travelled to the Arctic to blow the whistle on the slaughter of baby seals; she condemned the use of animals in laboratory experiments; and she opposed Muslim slaughter rituals.\n\n\"Man is an insatiable predator,\" Bardot told The Associated Press on her 73rd birthday, in 2007.\n\n\"I don't care about my past glory. That means nothing in the face of an animal that suffers, since it has no power, no words to defend itself.\"\n\nHer activism earned her compatriots' respect and, in 1985, she was awarded the Legion of Honour, the nation's highest honour.\n\nA turn to the far right\n\nLater, however, she fell from public grace as her animal protection diatribes took on a decidedly extremist tone. She frequently decried the influx of immigrants into France, especially Muslims.\n\nShe was convicted and fined five times in French courts of inciting racial hatred, in incidents inspired by her opposition to the Muslim practice of slaughtering sheep during annual religious holidays.\n\nBardot's 1992 marriage to fourth husband Bernard d'Ormale, a onetime adviser to former National Front leader Jean-Marie Le Pen, contributed to her political shift. She described the outspoken nationalist as a \"lovely, intelligent man\".\n\nFrench film legend and animal rights activist Brigitte Bardot looks on prior to a march of various animal rights associations on March 24, 2007 in Paris (AP Photo/Jacques Brinon)\n\nIn 2012, she wrote a letter in support of the presidential bid of Marine Le Pen, who now leads her father's renamed National Rally party. Le Pen paid homage Sunday to an \"exceptional woman\" who was \"incredibly French\".\n\nIn 2018, at the height of the #MeToo movement, Bardot said in an interview that most actors protesting sexual harassment in the film industry were \"hypocritical\" and \"ridiculous\" because many played \"the teases\" with producers to land parts.\n\nShe said she had never had been a victim of sexual harassment and found it \"charming to be told that I was beautiful or that I had a nice little ass\".\n\nA privileged, but 'difficult' upbringing\n\nBrigitte Anne-Marie Bardot was born September 28, 1934, to a wealthy industrialist. A shy, secretive child, she studied classical ballet and was discovered by a family friend who put her on the cover of Elle magazine at age 14.\n\nBardot once described her childhood as \"difficult\" and said her father was a strict disciplinarian who would sometimes punish her with a horse whip.\n\nBut it was French movie producer Vadim, whom she married in 1952, who saw her potential and wrote And God Created Woman to showcase her provocative sensuality, an explosive cocktail of childlike innocence and raw sexuality.\n\nBrigitte Bardot in And God Created Woman (Criterion, Cocinor/ YouTube)\n\nThe film, which portrayed Bardot as a bored newlywed who beds her brother-in-law, had a decisive influence on New Wave directors Jean-Luc Godard and Francois Truffaut, and came to embody the hedonism and sexual freedom of the 1960s.\n\nThe film was a box-office hit, and it made Bardot a superstar. Her girlish pout, tiny waist and generous bust were often more appreciated than her talent.\n\n\"It's an embarrassment to have acted so badly,\" Bardot said of her early films.\n\n\"I suffered a lot in the beginning. I was really treated like someone less than nothing.\"\n\nBardot's unabashed, off-screen love affair with co-star Jean-Louis Trintignant further shocked the nation. It eradicated the boundaries between her public and private life and turned her into a hot prize for paparazzi.\n\nBrigitte Bardot, in a striped dress, in the 1950s. (Getty)\n\nBardot never adjusted to the limelight. She blamed the constant press attention for the suicide attempt that followed 10 months after the birth of her only child, Nicolas. Photographers had broke into her house only two weeks before she gave birth to snap a picture of her pregnant.\n\nNicolas' father was Jacques Charrier, a handsome French actor whom she married in 1959 but who never felt comfortable in his role as Monsieur Bardot. Bardot soon gave up her son to his father, and later said she had been chronically depressed and unready for the duties of being a mother.\n\n\"I was looking for roots then,\" she said in an interview. \"I had none to offer.\"\n\nIn her 1996 autobiography Initiales B.B. , she likened her pregnancy to \"a tumour growing inside me,\" and described Charrier as \"temperamental and abusive\".\n\nActress Brigitte Bardot, 23, gets a hug from her new husband, actor Jacques Charrier, also 23, following their wedding here, June 18th. The marriage was slightly delayed by a swarm of newsmen who were waiting for the pair to arrive gor their \"Secret wedding.\" Rumors that Brigitte and Charrier were married have blown hot and cold during the last five days, with the pair adding to the confusion by both denying and confirming reports. Now it is cer (Bettmann Archive)\n\nBardot married her third husband, West German millionaire playboy Gunther Sachs, in 1966, but the relationship again ended in divorce three years later.\n\nAmong her films were A Parisian (1957); In Case of Misfortune , in which she starred in 1958 with screen legend Jean Gabin; The Truth (1960); Private Life (1962); A Ravishing Idiot (1964); Shalako (1968); Women (1969); The Bear And The Doll (1970); Rum Boulevard (1971); and Don Juan (1973).\n\nWith the exception of 1963's critically acclaimed Contempt , directed by Godard, Bardot's films were rarely complicated by plots. Often they were vehicles to display Bardot's curves and legs in scanty dresses or frolicking nude in the sun.\n\n\"It was never a great passion of mine,\" she said of filmmaking.\n\n\"And it can be deadly sometimes. Marilyn [Monroe] perished because of it.\"\n\nBardot retired to her Riviera villa in St. Tropez at the age of 39 in 1973 after The Woman Grabber .\n\nFrench actress Brigitte Bardot relaxes in the back of a limousine upon her arrival at London's Heathrow Airport. She has flown in from Paris to attend the premiere of her latest film 'Shalako', in which she plays an alluring countess. (Photo by Central Press/Getty Images) (Getty)\n\nReinventing herself in middle age\n\nShe emerged a decade later with a new persona: An animal rights lobbyist, her face was wrinkled and her voice was deep following years of heavy smoking.\n\nShe abandoned her jet-set life and sold off movie memorabilia and jewellery to create a foundation devoted exclusively to the prevention of animal cruelty.\n\nHer activism knew no borders. She urged South Korea to ban the sale of dog meat and once wrote to US President Bill Clinton asking why the US Navy recaptured two dolphins it had released into the wild.\n\nShe attacked centuries-old French and Italian sporting traditions including the Palio, a free-for-all horse race, and campaigned on behalf of wolves, rabbits, kittens and turtle doves.\n\nFollowing news of her death, PETA Founder Ingrid Newkirk praised her activism and labelled the late actress \"a strong voice for all species\".\n\n\"From her rescued pigeons in Saint-Tropez to her beloved dogs, PETA will miss Brigitte, an angel for animals who went to bat and to court to protect them all,\" Newkirk said in a statement.﻿\n\nFormer Actress And Now Animals Rights Activist Brigitte Bardot Invited For A Meeting On The Environment With French President Nicolas Sarkozy, At The Elysee Palace In Paris, France On September 27, 2007 - (Photo by Gilles BASSIGNAC/Gamma-Rapho via Getty Images) (Gamma-Rapho via Getty Images)\n\nBy the late 1990s, Bardot was making headlines that would lose her many fans. She was convicted and fined five times between 1997 and 2008 for inciting racial hatred in incidents inspired by her anger at Muslim animal slaughtering rituals.\n\n\"It's true that sometimes I get carried away, but when I see how slowly things move forward ... and despite all the promises that have been made to me by all different governments put together — my distress takes over,\" Bardot told the AP.\n\nIn 1997, several towns removed Bardot-inspired statues of Marianne after the actress voiced anti-immigrant sentiment. Also that year, she received death threats after calling for a ban on the sale of horse meat.\n\nBardot once said that she identified with the animals that she was trying to save.\n\n\"I can understand hunted animals because of the way I was treated,\" Bardot said.\n\n\"What happened to me was inhuman. I was constantly surrounded by the world press.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/coral-adventurer-cruise-ship-hits-coral-reef-two-months-after-passenger-died-left-behind-lizard-island/a6be1a50-1555-4823-9a69-634f879b67b7",
        "title": "Cruise ship runs aground on first trip since passenger's death",
        "publish_date": "Sat, 27 Dec 2025 20:53:34 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "An embattled Cairns-based cruise ship has run aground while sailing around the South Pacific .\n\nThe vessel ran into trouble on Saturday morning, during its first trip back at sea after the death of an 80-year-old passenger on Lizard Island in October .\n\nAustralian-flagged vessel, the Coral Adventurer, hit a coral reef and ran aground off the Papua New Guinea coast, stuck around 30 kilometres from the city of Lae.\n\nREAD MORE: Body found inside a car on the Gold Coast\n\nCoral Adventurer ran into trouble off the Papua New Guinea coast during its first trip back at sea, after the death of an 80-year-old passenger on Lizard Island. (9News)\n\nCrew alerted relevant authorities around 6am.\n\n9News understands there are 123 people on board the luxury cruise ship, including 80 passengers and 43 crew.\n\nThe Australian Maritime Safety Authority (AMSA) said in a statement \"there are no injuries among the passengers and crew onboard\".\n\nThe PNG Maritime Rescue Coordination Centre also confirmed an officer has boarded the vessel and is assisting with the incident.\n\nREAD MORE: Further delays expected to remove snapped crane hovering over caravan park\n\nCoral Adventurer ran into trouble off the Papua New Guinea coast during its first trip back at sea, after the death of an 80-year-old passenger on Lizard Island. (9News)\n\nCrews were waiting for high tide to help re-float the ship, to assess if there's any damage.\n\nIt's been troubled waters for the luxury cruise ship that's already navigated a turbulent two months after it made headlines in October.\n\nSuzanne Rees, an 80-year-old New South Wales tourist, was found dead on remote Lizard Island several hours after being left behind by the Coral Adventurer.\n\nThe tragedy ultimately sparked several investigations, including by the AMSA and Workplace Health and Safety Queensland, which remains ongoing.\n\nSuzanne Rees, an 80-year-old New South Wales tourist, was found dead on remote Lizard Island several hours after being left behind by the Coral Adventurer. (9News)\n\nThis latest 12-night cruise, which costs $13,280 per person, departed from Cairns on December 18, reaching Papua New Guinea last Saturday on December 20.\n\nIt's then been cruising up the coastline over the past week before this latest bungle happened on December 27.\n\nPassengers were due to disembark on December 30.\n\nCoral Expeditions responded on Saturday evening, saying an initial inspection has found no damage to the vessel and further investigations will be undertaken.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ghostwriter-side-hustle-sydney-mum-cost-of-living-exclusive/d3c1d722-66b9-46f1-8a3e-e4ed20a7c1f7",
        "title": "Sydney mum made bank writing books she's never allowed to talk about",
        "publish_date": "Sat, 27 Dec 2025 19:17:18 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Ghostwriting was the last side hustle Kristy Lee Kelly thought she'd fall into after being made redundant in 2020.﻿\n\nThe 32-year-old from Sydney didn't even know ghostwriting existed until an old colleague suggested it could help her make ends meet.\n\nKelly figured there was no harm trying it, at least until she found a new job.\n\nKristy Lee Kelly is a self-described lover of words who fell into ghostwriting as a side hustle. (Supplied)\n\nInstead she ended up ghostwriting for ﻿more than four years.\n\n﻿For those not in the know, a ghostwriter is a professional author paid to write books (among other things) for other authors, celebrities, even royals.\n\nPrince Harry's Spare was ghostwritten by acclaimed journalist and author J. R. Moehringer, who reportedly charges seven figures per book.\n\nOther, less established ghostwriters make tens or even hundreds of thousands of dollars per book﻿.\n\nThe trade-off is that most receive no credit for what they write because it's published under someone else's name (celebrity ﻿ghostwriters such as Moehringer are outliers).\n\nBut Kelly, a self-proclaimed \"lover of words\", didn't mind writing for other people at first.\n\nREAD MORE: Three words this CEO swears will help you land a better job ﻿\n\nJ. R. Moehringer, the ghostwriter behind Prince Harry's Spare, is one of few ghostwriters who can be open about what they've ghostwritten. (AP)\n\nShe was just happy getting paid to do something she enjoyed.﻿\n\n\"You can't realistically live on one income anymore,\" she told 9news.com.au.\n\n\"It was a combination of extra cash while having a creative outlet that appealed to me.\"\n\nIt only took a few beginner projects to build her confidence and start landing bigger, well-paid contracts writing romance.\n\nIt's ﻿a booming genre, with Australians forking out $50 million on romance novels in 2024 alone, according to Nielsen BookScan.\n\nAnd Kelly was \"floored\" to realise how many authors in it and other popular genres don't write their own books.\n\n\"People don't know how much of the publishing industry is built on ghostwriters,\" she said.\n\nKelly was \"floored\" to realise how many authors use ghostwriters. (Supplied)\n\n﻿Like most jobs, ghostwriting gigs are advertised online with details such as the genre of the book, the level of experience required, and the rate of pay.\n\nAnd almost all of them require the hired ghostwriter to sign a non-disclosure agreement (NDA) prohibiting them from ever revealing they wrote it.\n\nKelly had to sign one for every single book she worked on, but the cash was worth it.\n\nBefore long, she was ghostwriting for ﻿major publishers in the US and UK, as well as a few authors directly.\n\nAs her profile increased, so did her pay.\n\n﻿\"I would negotiate the overall amount, then get paid in milestones,\" she explained.\n\n\"It started with the outline, then it was usually in 10,000- to 20,000-word increments, and then for any further edits.\"﻿\n\nGhostwriting can be a lucrative side hustle for Aussies willing to put in the work. (Getty)\n\nIt became a lucrative side hustle and when Kelly landed a ﻿full-time job in the disability sector in 2021, she decided to keep ghostwriting.\n\nHaving an extra income as the ﻿cost-of-living crisis was kicking off was a huge relief.\n\nEspecially when Kelly and her husband learned they were expecting their first child the following year.\n\nIt was a challenging juggle and Kelly had to ﻿write before and after work and on her lunch breaks to meet tight project deadlines.﻿\n\n\"Whenever I had a spare moment, I was writing,\" she said, describing it as \"exhausting but fulfilling\".\n\n\"Then on weekends I smashed out as much as I could.\"\n\nThe only drawback was that Kelly had no ownership of her writing, even on the projects where she was given almost total creative freedom.\n\nKelly had to ﻿write before and after work and on her lunch breaks while juggling ghostwriting with a full-time role. (Supplied)\n\nFor one project, she was given a vague theme and allowed to run wild with it for three books.\n\nBut as soon as the ink dried, her words were taken away to be published under a stranger's name.﻿\n\n\"That's the one series I wish I could've put my name on, because it had so much of me in it and I still to this day have no idea where it ended up,\" Kelly said.\n\nOf the 20 books she ghostwrote, Kelly has only ever found two on shelves – both by accident.\n\nWhat happened to the rest remains a mystery.﻿\n\nIt was only after becoming a mother that Kelly decided to finally step away from ghostwriting after more than four years.\n\n\"It was incredibly draining to give pieces of myself - my humour, my creativity, even my trauma - to other people's books,\" she explained.\n\n\"I started to question why I was bringing other people's stories to life but not the ones that I've been carrying around inside of me.\"﻿\n\nKelly decided to step away from ghostwriting after welcoming her daughter. (Supplied)\n\n﻿Hoping to show her daughter that it's never too late to chase your passions, Kelly is now writing original fiction between part-time work and raising a toddler.\n\nBut she doesn't regret her time as a ghostwriter.\n\n\"This has all led me to a path where I'm working on my own writing, and I'm excited to see where it leads me,\" she said.\n\n\"It could lead to a pile of books that never see the light of day, but at least I put pen to paper.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/khawaja-guaranteed-for-scg-future-unclear-after-that/106184310",
        "title": "Khawaja guaranteed for SCG, future unclear after that",
        "publish_date": "Mon, 29 Dec 2025 01:34:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia coach Andrew McDonald has guaranteed Usman Khawaja will play at the SCG, but is unsure if it will be the veteran's last Test.\n\nAfter turning 39 earlier in December, Khawaja's future will continue to be a talking point until he announces his retirement.\n\nA back injury ruled him out of Brisbane and the classy left-hander was then not picked for the third Test.\n\nSteve Smith's battle with vertigo symptoms handed Khawaja a late reprieve at the Adelaide Oval, with crucial knocks of 82 and 40 virtually locking him for the rest of the Ashes.\n\nBut with up to eight months until Australia's next Test — likely to be in Darwin and North Queensland against Bangladesh — selectors may have to force Khawaja's hand if he doesn't make a call on his own.\n\n\"We haven't had a conversation; the speculation has been from external (the media),\" McDonald said at the MCG on Monday.\n\n\"He's with his family at the moment having a couple of days off.\n\n\"We're always having conversations about where players are at … there's no indication at my end that he's calling it in Sydney.\n\n\"But his performance in this calendar year has been good enough to warrant selection, so I'd say he'll be there marking centre in Sydney.\"\n\nMcDonald admitted it would not be all Khawaja's decision if he decided to push on after the Ashes.\n\n\"He'll come to us if he's going to retire, there's no doubt about that,\" he said.\n\n\"We've got a lot of time as a selection group to make that decision.\n\nUsman Khawaja played his first Test for Australia against England at the SCG in 2011 - it's possible that he may play his last Test at the same venue against the same side. (Getty Images: Hamish Blair)\n\n\"It's sort of at an odd time, if there's a series straight on the back of this, then it would be a little bit different.\"\n\nEven though he has played more than a decade in Queensland, Khawaja grew up in Sydney after moving from Pakistan with his family at an early age and made his Test debut at the SCG back in 2011.\n\nThere have been numerous memorable farewells — Steve Waugh, Shane Warne, Glenn McGrath, Justin Langer — at the venue given it is usually the last Test of the summer.\n\nKhawaja would be warmly received by the Sydney crowd should he decide it is his last Test.\n\n\"We use Davey Warner as a test case, he got clapped off the SCG three years in a row because everyone thought it was going to be his last Test match,\" McDonald said.\n\n\"If Uz makes no statement around his future leading into that Test match, that crowd will still be very supportive of him.\n\n\"Our challenge is if any of our great players retire, is that you want to acknowledge them.\"\n\nAustralia's shaky batters face SCG selection scrutiny Jake Weatherald, Marnus Labuschagne and Cameron Green all face selection pressure following double failures in Australia's jarring loss at the MCG.\n\nAfter losing their first home Ashes Test for 15 years with a two-day defeat at the MCG, Australia are desperate to complete a 4-1 series win and bank valuable World Test Championship points.\n\nOpener Jake Weatherald, number three Marnus Labuschagne and all-rounder Cameron Green are all going through lean patches with the bat.\n\nBut Australia will almost certainly stick with the trio, with Green's potential replacement, Beau Webster, released to play in the Big Bash League before the SCG Test.\n\nOff-spinner Todd Murphy looms as a likely inclusion after Australia picked four specialist fast bowlers at the MCG.\n\nJhye Richardson, who was brought in for his first Test in four years, would likely make way for Murphy if the SCG pitch is not another paradise for seamers.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/quiet-confidence-aussie-rowers-who-shocked-the-world/106183784",
        "title": "'Quiet confidence': Aussie rowers who shocked the world",
        "publish_date": "Sun, 28 Dec 2025 23:26:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sophia Wightman only began coastal rowing in April after her friends tempted her to pick up the oars.\n\nNow she's a world championship medallist.\n\nAustralia claimed its first-ever senior medal at the world rowing beach sprint finals in November, when the mixed coxed quad sprinters won bronze.\n\nThe team, whose average age is about 20, had only trained together for a couple of months.\n\nIn fact, Wightman wouldn't have even made the competition if it weren't for a little encouragement.\n\nCoastal rowing Olympic surge Though she only tried the sport for the first time this year, the 18-year-old nursing student was one of several Australians taking home gold after competing in coastal rowing in Barbados, ahead of the sport's 2028 Olympic debut.\n\n\"I was doing flat water up until about April. My friends were trying coastal rowing one morning, and were like, 'Why don't you come?'\" Wightman said.\n\n​\"The first trials for the Australian team were that weekend, so I went, had a go, and then made the team halfway through the year.\"\n\nA few months later, Wightman was one of five Australians competing in the knockout-style world championships in Türkiye.\n\n​After beating the Netherlands in the quarter-finals but losing to eventual champions Spain in the semis, the Australians were pitted against the home team in a bid for bronze.\n\nLoading Instagram content\n\nOne rower from each crew sprinted across the sand and jumped in their boat, joining the other four before racing out to a yellow buoy.\n\nBoth teams then rounded the buoy, racing back to shore at about 20km/h, before another rower jumped out and sprinted to the finish line.\n\n​\"There's so much unknown, but that makes it more exciting being out in the waves,\" Wightman said.\n\n​\"You never actually know what to expect. You can plan for your perfect race, but things are bound to happen if you get hit by a wave, eat a buoy, or the wind's really bad.\"\n\nTeam cox Ryder Taylor knew the competition didn't expect the Australians to perform as well as they did because they rarely compete compared with their European counterparts.\n\n​\"We weren't really expected to medal, but as a crew we all knew we could do it. We had that quiet confidence,\" Taylor told AAP.\n\nThe athletes now turn their attention towards preparing for the Los Angeles Olympics, where coastal rowing beach sprints will make their Games debut.\n\n​Although the four-person format won't feature, mixed doubles sculls and singles will.\n\n\"LA is definitely on everyone's mind, especially in coastal rowing,\" Taylor said.\n\n\"The world championships were really important for us because it was the first senior medal for Australia, and it puts us on the radar for LA.\n\n\"We're going to be strong. We're going to compete there very well.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/cyclone-hayley-forms-off-wa-coast-broome-in-watch-zone/106182876",
        "title": "Broome residents told to prepare as cyclone forms off WA's north",
        "publish_date": "Sun, 28 Dec 2025 21:27:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents in the West Australian tourist town of Broome are being asked to prepare after a tropical cyclone formed off the state's north coast overnight.\n\nTropical Cyclone Hayley is about 460 kilometres north-west of Broome and is a category one system.\n\nThe Bureau of Meteorology (BOM) has established a watch zone from Broome to Kuri Bay, which includes the town of Derby.\n\nCurrent projections show Cyclone Hayley will intensify to a category two system by Monday and track further east towards the Dampier Peninsula on Tuesday.\n\nBOM senior forecaster Luke Huntington said Tropical Cyclone Hayley was expected to cross as a category two system but it should weaken as it nears the coast.\n\n\"It just depends what strength the system is while it is offshore,\" he said.\n\n\"A stronger system is going to take a longer time to weaken. If it is a weaker system, it's going to weaken more rapidly.\"\n\nPreparations underway\n\nDjarindjin Aboriginal Corporation chief executive Nathan McIvor, who manages the remote community on the Dampier Peninsula north of Broome, said preparations had been made.\n\n\"You always find there's been something that you've missed but we're as prepared as we possibly can be,\" he said.\n\nMr McIvor said loose items had been cleared ahead of the summer months, while water and dry goods had been stocked up.\n\nNathan McIvor says the community is well prepared for the cyclone. (ABC Kimberley: Andrew Seabourne)\n\nHe said the Dampier Peninsula had not historically been badly affected by cyclones.\n\n\"Normally, there's an umbrella hanging over the Dampier Peninsula. We don't get much,\" Mr McIvor said.\n\n\"I guess the climate is changing a little and we're seeing more heading in our direction. Maybe the umbrella is starting to break down.\"\n\nMr McIvor said there were plans in place to keep the community safe.\n\n\"We've got vehicles and buses. We can evacuate our residents if needs be,\" he said.\n\n\"If we're doing everything we can to make sure everyone is safe, that's the best thing for us.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/end-of-year-economics-analysis-wrap/106176480",
        "title": "Certainty in the rearview mirror as 2025 economy goes wild",
        "publish_date": "Sun, 28 Dec 2025 20:31:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "I don't know what I expected. Not this. I blame the robots. I blame the penguins.\n\nThe economy of 2025 has challenged people's certainty.\n\nA permacrisis. A flurry. Contradictions and causation, chaos and change.\n\nMarkets are at record highs, but it doesn't feel like a party because so many people aren't invited.\n\nWait, hold on — the World Trade Uncertainty Index is higher than it was during the COVID-19 pandemic or the global financial crisis. And gold is at record highs as well, up 67 per cent in a year!\n\nThat's what people buy when they fear the world will fall apart.\n\nMeanwhile, our corporate regulator is investigating our (essentially) monopoly stock market provider — the ASX — after \"repeated and serious failures\", a phrase you could have said about it any time for the past decade.\n\n(I reckon the time last year when ASIC sued the stock market operator for misleadingly saying a project to replace its systems was \"progressing well\" probably flagged that things weren't \"progressing well\").\n\nOur global collective worry rocketed after US President Donald Trump — who in words, advertisements and deeds had promised substantial tariffs on friends, neighbours and enemies — did something truly shocking to global traders: announcing tariffs on friends, neighbours and enemies.\n\nDonald Trump's first year back in the White House has been full of economic surprises. (Reuters: Elizabeth Frantz)\n\nMarkets slumped, chaos reigned, penguins on remote uninhabited islands shivered as tariffs were slapped on their non-existent exports to the United States.\n\nThe only certainty from then onwards: uncertainty.\n\nParty time — right?\n\nThe Nasdaq index of mega-tech stocks is up 17 per cent from the already elevated level where it started in January.\n\nChaotic 'up-crash' for markets in 2025 It's been a big year of economic shocks and surges as the international framework of global trade was shredded. Here's how key players saw the year than was.\n\nThe so-called Magnificent Seven artificial intelligence-exposed companies are pumping cash and optimism through markets. (Let's ignore the fact one of the most talked-about books this year is If Anyone Builds It, Everyone Dies: The Case Against Superintelligent AI).\n\nOur ASX 200 group of the 200 largest listed companies is up 4.5 per cent — and it would have been more but for a wobble since October.\n\nIt's what George Tharenou of global investment fund UBS told me was an \"up crash\", with assets like share markets and property just heading skywards.\n\n'It's almost a detachment from fundamentals'\n\nTharenou called it FOMO: the fear of missing out.\n\nAnd he's not the only one suspicious of what seems like an empty boom in a dangerous time.\n\nAnalysts and experts talk about \"2008 vibes\" — what things felt like in the time just before the global financial crisis crushed the world economy. (It took 12 years for the ASX 200 to again reach the level it was at before the crisis).\n\nThe government's sovereign wealth store, the Future Fund, has $250 billion under management. Chief executive Raphael Arndt told The Australian Financial Review the year felt like a \"perpetual inflection point — a permacrisis if you like\".\n\n\" The weaponisation of trade, the persistence of inflation, climate shocks and a rising cost of capital — these all have tested the very assumptions that underpin investment theory. \"\n\nWe keep shredding economic norms.\n\nThat crushing inflation requires unemployment to rise.\n\nThat increasing cost of trade, tariffs, will crimp gross domestic product (GDP) growth (although that still might happen).\n\nThat gold booms when the market is falling.\n\nAnd here's the biggest thing. We're talking about the \"business\" economy, the indices, the returns. They do affect people's lives. However, there's a lot more to it.\n\nThere are far bigger forces at play.\n\nYou aren't meant to know these incredibly obvious things people are talking about\n\nEvery time there's an election, the public service writes a manual for the incoming minister.\n\nThere's a \"Red Book\" in case of a Labor win and a \"Blue Book\" if the Coalition wins.\n\nIn May, Labor didn't just win; the Coalition was banished. In our two most populous cities, Sydney and Melbourne, there are collectively just three Liberal-held seats that don't include farmland in them. Three.\n\nThese so-called incoming government briefs are an honest look at issues facing the minister in their portfolio and are created for an audience of one: that person.\n\nSo I still kind of feel for the Treasury body that accidentally emailed me the one that only Jim Chalmers was meant to read.\n\nFearless and free, the Treasury isn't holding back — and that's good for everyone The persistence of Treasury officials in trying to get an innocuous document deleted served to highlight there was something there.\n\nBlunt doesn't cover what it told Jim, and we told you:\n\nYou need to lift taxes\n\nYou need to cut spending\n\nYour key election promise, building 1.2 million homes? Not going to happen (unless you massively change things immediately)\n\nChalmers said he was \"relaxed\" about the release of the advice, which described actions most government economists, journalists and the data were all across.\n\nJim Chalmers faces big challenges in 2026. (ABC News: David Sciasci)\n\n(Without labouring the point, the lawyers were less relaxed about it).\n\nBut it wasn't even the most impactful brief.\n\nBuried in the manual for Social Services Minister Tanya Plibersek was this missile: There's a boomer boom as poor and middle-income people subsidise the incomes of older rich people.\n\nLiterally:\n\n\" Low and middle-income earners are subsidising the retirement incomes of seniors with significant wealth in addition to their homes. \"\n\nThink about that. Poor people are subsidising the income of older non-working people who are significantly wealthy beyond owning their house.\n\nPeople who don't need help are getting support from people who do.\n\nBeyond being unfair, it is poisoning the well.\n\n\"The majority of Australians believe current income distribution is unfair,\" the brief reads, having been obtained using the Freedom of Information (FOI) process.\n\n\"This appears to be affecting views on democracy, as fewer people believe hard work leads to a better life.\"\n\nWe've tilted the playing field.\n\nJob mobility is at decades-low levels as people stay put, imperilled by a tax system that makes buying and selling houses extremely expensive, tying people to mortgages so massive they dissuade people from taking risks.\n\nMeanwhile, people with home loans are still getting smashed by high repayments.\n\nThe RBA dropped interest rates three times during 2025. (ABC News: John Gunn)\n\nFor all of 2024, the Reserve Bank's key interest rate stayed the same. Early this year it stuttered marginally lower — just as public anger was becoming white hot — going lower two more times, before flatlining again.\n\nThe RBA is now flagging its economy-throttling interest rates probably haven't beaten inflation.\n\nNo real shock. Lots of that cost-of-living pressure is driven by longer-term issues like the messy but necessary energy transition and climate-change-fuelled insurance cost surges.\n\nBeyond that, we're seeing the hard-to-squash price rises of an economy where productivity is increasingly reliant on services provided by humans rather than machines that can squeeze widgets out faster.\n\nWorkers get slapped with accusations of slackness as our productivity rate stutters, despite the obvious and contentious nature of even agreeing on the measurement of the concept in rapidly expanding fields like health care, the NDIS and teaching.\n\nLoading\n\nIncreasingly, your circumstances are divined by your housing situation, how you make your income (Wages? Schmuck. Assets? Genius) and are divorced from the effort you're putting in.\n\nYounger people are being saddled with debt (personal and government), face the dizzying cost of dealing with the climate crisis, and then there's housing … a crisis that is literally consuming the waking thoughts of millions.\n\nAI bubbles. Tariff turmoil. Market moves. They're all substantial, and they've shaped our lives in 2025.\n\nThis year, next year and beyond, the biggest question for an increasing number of Australians is less ethereal and more practical: How are we going to make this work?\n\nWith that, I wish you all the best for a wonderful 2026.\n\nThanks to our audience across Australia and beyond. A special thanks for all the people who've spoken to me and my ABC colleagues, so we that we can talk about business, the economy and how they impact your life.\n\nHere's to peace and joy for the year ahead.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/australias-travis-head-not-fazed-on-opening-role-in-future/106183666",
        "title": "Travis Head not fazed on opening role in future",
        "publish_date": "Sun, 28 Dec 2025 20:20:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Even after starring as an opener in the Ashes, Travis Head is not demanding he stays at the top, instead being happy to bat wherever Australia needs him.\n\nHead will remain as opener for the fifth and final Test at the SCG after starring with a series-high 437 runs. Beyond that, his role is uncertain.\n\nAustralia previously only considered him as an opener for Tests in Asia, believing the conditions suited his elevation better than at home.\n\nBut Head's chance ascension in Perth has given coach Andrew McDonald plenty to think about.\n\nAustralia's shaky batters face SCG selection scrutiny Jake Weatherald, Marnus Labuschagne and Cameron Green all face selection pressure following double failures in Australia's jarring loss at the MCG.\n\nAfter crashing a famous, matchwinning century to win the opening Test when sent out due to Usman Khawaja's back injury, the 31-year-old has been comfortably Australia's best batter of the series.\n\nHead smashed another hundred in Adelaide, then top-scored in the bowler-dominated two-day Test at the MCG.\n\n\"I see myself as this team's opening batter for the series,\" Head said.\n\n\"We've got a long gap between [Test series] to piece the puzzles together to where the team wants to go to.\n\n\"I felt good at the top, I felt like I've been batting well … I feel like I've been able to do a job for the team that's put us in winning positions.\n\n\"What I've always been open to is how can we make the team better.\n\n\"And if that means me at the top, and we're a better cricket team, and we're winning more, then I'm happy.\"\n\nHead's message to McDonald and captain Pat Cummins is put him in the order where they think it will help Australia win.\n\n\"I have full confidence in wherever they see me fit that, that's the best thing for the team, and that's how I'm more than pleased to set up,\" Head said.\n\nHead was already one of the world's best batters at number five, averaging 41.46 in that position.\n\nBut his average skyrockets to 52.64 when opening the batting, having done it before in Tests in India and Sri Lanka.\n\nHead has partnered with former South Australia teammate Jake Weatherald during the Ashes, with Khawaja slotting into the middle order on return from injury in Adelaide.\n\nBut just four Tests into his career, Weatherald may need a big score at the SCG to ensure he remains Head's opening partner for the rest of 2026.\n\nWeatherald has made three single-figure scores and only one half-century in eight innings, averaging 20.85\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/country-womens-association-cwa-in-sydney-young-women-joining/105941208",
        "title": "'More than just tea and scones': Why young members are joining city's CWA",
        "publish_date": "Sun, 28 Dec 2025 19:49:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "For a year now, Maddy Langabeer has been front and centre at Sydney's inner city market stalls and attending cookery days to make and package jams, chutneys and scones.\n\nGrowing up in Hervey Bay, Queensland, Ms Langabeer knew almost everyone in her \"tight-knit\" small town.\n\nBut when she moved to Sydney to study, she experienced social isolation for the first time.\n\n\"You can be surrounded by millions of people but still feel quite disconnected,\" she said.\n\nIn a bid to turn the tables, Ms Langabeer, who is in her 20s, joined the Country Women Association's (CWA) Sydney City branch.\n\n\"A lot of people think it's just tea and scones, but it's so much more than that.\n\n\"We all have the same goal — to tackle isolation and improve conditions for country women and children.\"\n\nMs Langabeer has been part of the Country Women Association for approximately one year now. (Supplied)\n\nGradually, Ms Langabeer said she had noticed a growing interest in young women looking for connection and purpose.\n\n\"I think our generation has a lot to bring to the table, while also learning from women who have been doing this kind of work for decades. Through the CWA we've all been reminded of what community spirit feels like.\"\n\nFrom handicraft to connection\n\nJemima Khoo has been with the CWA for a few months now after a recommendation from a family friend to join.\n\n\"I'm not from the country myself, but my grandmother grew up on a farm, and she was always involved in different community organisations related to charity and handicraft,\" the 27-year-old said.\n\n\"I now do a bit of knitting which my grandmother taught me.\"\n\nJemima Khoo (left) and Sonia Martin (right) both feel they have lots to learn from the respective members of their CWA branch. (ABC News: Patrick Thomas)\n\nWhile she is yet to make any jam, Ms Khoo is keen to have a go at it in the future.\n\nIn her downtime away from her job as a software engineer, she helps the branch prepare for and run their market stalls, where handicraft is sometimes sold.\n\nMs Khoo said getting to know people in her city and making new connections had been a positive experience.\n\nWith a passion for handicraft, Ms Khoo says she is keen to involve herself further in the CWA. (Supplied)\n\nThe role of city branches for a country organisation\n\nFor fellow member Sonia Martin, 33, who grew up in the Northern Rivers and moved to Sydney in her late schooling years, she too was looking for a sense of community.\n\n\"Sydney is so different — you don't know your neighbours, you don't have people around as much and I didn't have my parents or siblings here,\" she said.\n\nSo, six years ago, she joined the CWA.\n\n\"Being surrounded by a group of women who are both like-minded but also diverse in life experience is just something I haven't found before,\" Ms Martin said.\n\n\"I think because there are women of varying ages, there are those intergenerational conversations that you might not get anywhere other than the workplace or within your family.\"\n\nMs Martin (left) says having intergenerational conversations with other women in the branch has been a highlight. (Supplied)\n\nMs Martin sees the metropolitan branches' roles as garnering support for the wider CWA causes — namely, healthcare accessibility, domestic violence awareness, education, combating social isolation and supporting local communities.\n\n\"In New South Wales, the population is majority in the city. So if you're looking at metro areas, creating awareness of what the CWA is doing in the regions and rural areas is really important for the future of it.\"\n\nVice president of the CWA Sydney City Branch, Alicia Kell, said there were seven CWA branches in the metropolitan Sydney area, such as Eastwood and Georges River.\n\nAlicia Kell says the CWA hopes to represent women throughout NSW. (ABC News: Patrick Thomas)\n\nWith one member over 90 and about 10 members in the 18 to 34 bracket in the city branch, Ms Kell said she felt proud to be part of a diverse group.\n\n\"We need younger, middle-aged and older members. We all learn from each other and that's the lovely thing about it,\" she said.\n\n\"We want to represent women throughout NSW.\"\n\nAs Ms Martin said of joining a community group: \"Take a chance, check it out, and you might be really pleasantly surprised.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/juniper-telehealth-concerns-weight-loss-treatment-glp1/106114626",
        "title": "'Pesky Aussie laws' comment sparks scrutiny of weight-loss treatment marketing",
        "publish_date": "Sun, 28 Dec 2025 19:47:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Peak eating disorder bodies are raising concerns about the rapid rollout of GLP-1 weight-loss treatments through telehealth, and what they describe as aggressive social media marketing by some companies.\n\nIn one case, a company referred to \"pesky Aussie laws\" as having prevented it from providing more information about the medication to potential customers.\n\nThe Australia and New Zealand Academy for Eating Disorders said it was concerned such marketing techniques could target people who might not need the medication.\n\n\"Very, very little medical monitoring, or medical history [is] being taken [by telehealth],\" chief executive officer Jade Gooding said.\n\nLoading...\n\nBrisbane-based Ms Gooding said eating disorder groups were aware of people misusing the medication and accessing it when they should not have.\n\n\" We hold concerns about how these particular medications are being prescribed by [telehealth providers]. \"\n\nInternational company Juniper is among their concerns, having run a recent Black Friday sale.\n\nJuniper is part of EUC Management, also known as Eucalyptus, which has operations in Australia, the UK, Germany and Japan.\n\nIts revenue more than doubled to $248 million last financial year, according to accounts filed for 2025 with regulators.\n\nIt still lost $25 million last year, and its biggest cost was marketing at $86.1 million, almost tripling from the year before.\n\nA screenshot of a Black Friday sale advertisement on a website for telehealth company Juniper. (Supplied)\n\nA company that operates under the same umbrella, Pilot, sells similar medical weight-loss treatments but targets a male audience, while Juniper targets women.\n\nPractitioners from both companies can prescribe Ozempic-style drugs, including Wegovy (semaglutide) and Mounjaro (tirzepatide).\n\nBlack Friday sales and 'pesky Aussie laws'\n\nThe ABC asked Juniper about a past Black Friday sale and how it related to prescription medication, after advertisements promoting the sale included discount codes and marketing emails.\n\nEucalyptus clinical director Matt Vickers said in a statement, \"any promotional activity relates solely to the cost of accessing our medical service, not the cost of a prescription medication\".\n\nJuniper sent various \"Black Friday\" sale content to its patients. (Supplied)\n\nBrisbane student Evangeline Gardiner was among those who said they had been \"bombarded\" with advertisements.\n\n\"It does make me feel like they only care about sales; they don't care about me or my health as an individual person,\" she said.\n\nThe 30-year-old, who had previously experienced disordered eating, said she found the advertisements particularly triggering.\n\n\"You'd never see a Black Friday sale for a pap smear or a cancer screening or skin check,\" she said.\n\n\"It really doesn't sit right for me. You could have a Black Friday sale for something like that.\"\n\nLoading...\n\nThe ABC sighted comments on Juniper's Facebook page, which included one response that told a user the company would direct message them with further information because of \"pesky Aussie laws\".\n\nIn Australia, strict laws prohibit the public advertising of prescription medicines.\n\nThe ABC does not suggest that Eucalyptus is breaching the law.\n\nJuniper says \"we regret the remark and acknowledge that it may have caused concern\". (Facebook)\n\nThe advertising restrictions do not capture promotion of a health service that does not promote any therapeutic good and only refers to the type of consultation the service offers.\n\nJuniper said the comment the company made on social media did not reflect the organisation's view or approach to regulations.\n\nThe company frequently replied to social media users, asking them to message privately for more information about the medical weight loss treatment.\n\n\"We take compliance seriously and fully support Australia's regulatory framework governing telehealth and prescription medicines,\" Dr Vickers said in a statement.\n\n\"We regret the remark and acknowledge that it may have caused concern.\n\n\"The comment has been removed, and we have reviewed our internal processes to inform improvements.\n\n\" We remain committed to high standards of clinical governance and regulatory compliance. \"\n\nDr Vickers said the previous Black Friday sale \"did not influence a clinician's decision to prescribe; eligibility is always determined through a structured clinical assessment\".\n\n\"We recognise that promotional activity in this space must be handled carefully, which is why our clinical safeguards and screening processes remain unchanged and consistently applied to every patient,\" he said.\n\nMatt Vickers says \"any promotional activity relates solely to the cost of accessing our medical service\". (Supplied)\n\nThe ABC also sighted logos for organisations, including the Royal Australian College of General Practitioners (RACGP) and the Australian College of Nurse Practitioners, on Juniper's website.\n\nAfter the ABC raised questions, the logos were removed.\n\nIn a statement, a spokesperson for the RACGP said \"weight loss medications should only be prescribed within clear clinical criteria and ongoing monitoring frameworks\".\n\nRACGP, ACHS and ACNP logos (above) were removed from Juniper's website following ABC questioning (below). (Supplied)\n\nThe ABC understands the RACGP does not provide endorsement to Juniper.\n\nDr Vickers said \"we previously displayed the Royal Australian College of General Practitioners (RACGP) logo to acknowledge that our prescribing workforce includes Fellows of the College\".\n\nMarkets feel the Ozempic effect The rise of weight loss drugs is changing how we eat and pushing pharmaceutical giants into trillion-dollar valuations.\n\n\"To avoid any misunderstanding or perception that the college formally endorses our operations, the logo has now been removed,\" he said in a statement.\n\nThe Australian Council on Healthcare Standards logo was also removed after questioning.\n\nThe council said it accredited Eucalyptus.\n\nStronger safeguards needed\n\nExecutive director of Eating Disorders Families Australia Jane Rowan said stronger safeguards were needed to access medical weight-loss treatments.\n\nAustralia's medicines regulator recently issued a safety warning over the potential risk of suicidal thoughts and behaviours when taking these drugs.\n\nShe said there also needed to be \"more rigour\" around the advertising of medical weight-loss treatments and that, in her view, the federal government needed to be involved.\n\n\"I think when these companies are advertising as widely as they are without considerations of the vulnerable people out there — those who may be at risk of developing an eating disorder — that's a real problem, and we certainly need regulations to address.\"\n\nMs Rowan, who has type 1 diabetes, was prescribed Ozempic by her endocrinologist in September 2023 as part of her diabetes management.\n\nShe said her work in the eating disorder space meant she understood both the need for the medication and the importance of regulation.\n\n\"There's certainly a place for these medications, but they do need to be done under close supervision and for appropriate medical reasons.\"\n\nJane Rowan was prescribed Ozempic by her endocrinologist as part of her diabetes management. (ABC News: Shari Hams)\n\nThe Therapeutic Goods Administration (TGA) said the government was not able to comment on whether the companies mentioned were engaging in unlawful advertising of therapeutic goods.\n\nThe ABC also contacted federal Health Minister Mark Butler, who responded in conjunction with the TGA.\n\n\"Under the Therapeutic Goods Act 1989 [the act], it is an offence to advertise a therapeutic good where the advertisement 'refers to' a prescription-only medicine,\" a TGA spokesperson said in a statement.\n\nNone of the companies' advertising mentioned any prescription-only medicine.\n\nLoading...\n\nThe spokesperson said the TGA strongly urged Australians using or considering weight-loss products — especially from overseas or online — to check safety alerts and speak with a health professional to ensure their safety.\n\nThe TGA also said it did not regulate the advertising or provision of health services, with those matters falling under the remit of the Australian Health Practitioner Regulation Agency (AHPRA).\n\nAn AHPRA spokesperson said, in a statement, that legislation limited what the regulator could say about individual practitioners or matters, outside of information published on the register or in tribunal decisions.\n\nSpeaking generally, the regulator said disciplinary action had been taken against some practitioners, including cautions and conditions placed on their registration, over concerns about prescribing to vulnerable patients with disordered eating.\n\n\" We do not regulate companies or services, but our action against practitioners has also led telehealth providers to change their business practices. \"\n\nThe TGA says the government could not comment on whether the companies were engaging in unlawful advertising of therapeutic goods. (ABC News: Shari Hams)\n\nComprehensive clinical safeguards\n\nDr Vickers said Juniper and Pilot had comprehensive clinical safeguards to ensure people with active or emerging eating disorders were not prescribed weight-management medications.\n\n\"Every patient is required to undertake a detailed medical questionnaire, followed by an in-depth phone or video consultation with an AHPRA-registered healthcare practitioner, who conducts a full history, risk assessment, and eligibility screen, including assessing BMI via verified video or photos, before any treatment is considered,\" he said in a statement.\n\nThere are concerns people with restrictive eating disorders could access weight-loss treatments (Reuters: Hollie Adams)\n\n\"As part of our safeguard measures, we are also rolling out a live photo-verification system, further strengthening the clinical screening process. The system is scheduled to be fully implemented by the end of January 2026.\"\n\nWeight-loss drug manufacturers under fire for 'unethical' ads Two pharmaceutical giants have recently launched advertisements directing people towards their doctor for weight loss. Some experts warn this type of advertising may affect public health messaging.\n\nHe added that practitioners receive extra training to identify red flags, recognise early disordered eating, and manage weight stigma and body image concerns.\n\n\"Where concerns arise, medication is not prescribed, and patients are redirected to appropriate care and support,\" the statement said.\n\n\"Ongoing monitoring of medical weight-loss patients, follow-up and access to multidisciplinary support form part of our broader care model to ensure that treatment remains clinically appropriate and safe.\"\n\nBut eating disorder advocates said these measures were not enough and that in-person consultations should be mandated by law.\n\n\"What we are really concerned about is the ongoing medical monitoring of people who are taking these medications,\" Ms Gooding said.\n\n\"What we really need is for our government to implement legislation for the safe prescribing of these medications.\n\n\"With these business models, follow-ups don't always include the same doctor, and it certainly doesn't include the same clinician. There's a few things we are pushing for, that all appointments require a visual or face-to-face assessment.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/drink-driver-crashes-car-into-house-kurunjang/106183644",
        "title": "Drink driver crashes car into living room of house in Melbourne's west",
        "publish_date": "Sun, 28 Dec 2025 19:32:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "In short:\n\nA drink driver has crashed his car into the living room of a house in Kurunjang.\n\nThe 24-year-old driver failed a breath test at the scene and was taken to hospital with minor injuries on Sunday night.\n\nNobody was home at the time of the crash.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/sydney-to-hobart-yacht-race-enters-day-four/106183294",
        "title": "'Beat them by a minute': Nervous wait for overall Sydney to Hobart winner",
        "publish_date": "Sun, 28 Dec 2025 19:26:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Sydney to Hobart yacht race has entered the fourth day, after Master Lock Comanche claimed line honours late on Sunday.\n\nThe overall winner may not be known for several days as many of the fleet are still making their way to Hobart.\n\nBut Celestial V70, which crossed the finish line at 05:14:34 on Monday, is still a contender.\n\nCelestial V70 crossed the finish line early this morning. (CYCA/Salty Dingo)\n\nThe first yacht across the finish line is the line honours winner, not the overall winner. The overall or handicap winner is calculated by a number of factors, including the size of the boat.\n\nOrganisers said confirmation of the overall winner may take a day or two as so much was \"still in the hands of the wind gods\", with Borderline and Min River current overall leaders.\n\nLive: Sydney to Hobart yacht race Comanche crosses the finish line first, taking out line honours in the 80th Sydney to Hobart Yacht Race, after a speedy race up the River Derwent. Follow live.\n\nMaster Lock Comanche finished at 18:03:36 after a cat-and-mouse run down Tasmania's east coast.\n\nComanche was followed up Hobart's River Derwent by LawConnect, SHK Scallywag 100, Lucky and Palm Beach XI on Sunday, and Celestial V70 on Monday morning.\n\nComanche's competing time was 2 days, 5 hours, 3 minutes and 36 seconds — well shy of the line honours race record it set back in 2017.\n\nCo-owner and co-skipper James Mayo told ABC News Breakfast this morning that the crew had been reflecting on the big win.\n\n\"What a race. This year, it was on. It was neck and neck,\" he said.\n\nHe said the winning boat was an \"engineering feat\".\n\n\"This is a 100-foot boat. The mast is 150 feet high. The whole boat's made of carbon,\" he said.\n\n\"Master Lock Comanche is the most iconic boat in the world.\n\n\"To get through those conditions … are pretty brutal at times.\n\n\"When you're spearing off waves that are 10 or 15 metres, and then landing, and the whole boat just shatters, I think to myself, 'How do I explain this to people that aren't on here?'\"\n\nMaster Lock Comanche crosses the finish line. (Supplied: Sydney Hobart Yacht Race)\n\nMaster Lock Comanche came powering up the River Derwent to nab line honours. (ABC News: Maren Preuss)\n\nDuring last year's event, the boat was forced to retire early due to mainsail damage.\n\nMayo said this year's win was \"unfinished business\".\n\n\"Last year was brutal, but it was unfinished business,\" he said.\n\n\"We wanted redemption and we said, 'Let's do it again.'\n\n\"The crew are incredible. If you are going to achieve great sporting achievements, you can't do it without a fantastic team, and that is what we have.\"\n\nCo-owners of Master Lock Comanche, Matt Allen and James Mayo, celebrated docking in Hobart in the 2025 Sydney Hobart yacht race. (ABC News: Maren Preuss)\n\nComanche's competing time was 2 days, 5 hours, 3 minutes and 36 seconds. (ABC News: Maren Preuss)\n\nLawConnect crossed the finish line in second place — roughly 47 minutes behind at 18:50:40.\n\nThe owner and skipper of the line honours runner-up, Christian Beck, said they were leading on the first night, when they sustained some damage and broke a mainsheet.\n\nLawConnect crew taping sail tears at first light on Sunday. (Supplied: LawConnect)\n\n\"Those things — we fixed them but they took time,\" Beck said.\n\n\"If that didn't happen, we would have been leading up until the transition and then probably would be OK through there.\n\n\"But as soon as that heavier wind came in, Comanche was always going to overtake us.\n\n\"We did well at the start but made some errors.\"\n\nThe owner and skipper of Celestial V70, which arrived on Monday morning, said it was a hard race in \"really difficult conditions\".\n\nSam Haynes said Celestial V70 beat Lucky by a minute. (Supplied: CYCA/Salty Dingo)\n\n\"We got parked up off Tasman [Island], no wind, and it just died out there, and then we managed to get some really good breeze and went across Storm Bay really quickly,\" Sam Haynes said.\n\n\"And then as soon as we got in the Derwent [River], it just died out, and we were just going all over the place.\n\n\"We did get to the finish line with about, I don't know, 20 minutes on Lucky.\n\n\"But we couldn't cross the line because there's just no breeze right there. And then the current was just taking us away.\n\n\"The wind then came around from the other side … and we finally just got the hooter and our time's 1 minute less than [Lucky's].\n\n\" So we beat them by a minute. \"\n\nMost boats still at sea\n\nEighty-eight boats are still at sea, with one of them still in New South Wales.\n\nSix boats still have not reached half-way.\n\nDouble-handed boat Toucan has two skippers Henry Curry-Hyde and Lincoln Dews.\n\nCurrently off Flinders Island, Dews told the ABC it had been \"super tough\".\n\n\"This race is brutal two-handed,\" he said.\n\n\"Yesterday I got a two-hour nap in. This morning I got a two-hour nap which is the longest sleep we've both had. We're feeling fresh considering.\n\n\"We've done no damage, actually, we've both been in really good condition. We were we were actually quite surprised. We got through it completely unscathed.\"\n\nOther participants also described it as a tough race, with a quarter of competing yachts retiring by Sunday morning.\n\nParticipants described it as a tough race. (Supplied: Sydney Hobart Yacht Race)\n\nMultiple boats pulled out due to damage being sustained, as well as seasickness in crews.\n\nComanche's Mayo said the crew lost the bowman about 3 minutes after the start.\n\n\"He suffered a pretty bad injury,\" he said.\n\n\" Maybe he has some broken ribs. We're not quite sure yet, so he was out for the whole race from the first turning buoy. \"\n\nCruising Yacht Club of Australia vice-commodore David Jacobs said it felt like \"being on a five-storey building and doing a belly flop into a swimming pool\".\n\nSpeaking on Monday morning, he said competitors for the overall winner will have had the benefit of the northerly wind, giving them a very good run down the coast.\n\n\"The first two days were really tough. It was strong winds, 25 knots, sometimes gusting up to 30-35 [knots]. We even had some reports of 40-45 [knots]\" he said.\n\n\"They've been going straight into the wind.\n\n\"Now it's a bit nicer, the wind's moved around, the seas have dropped a bit. It's more pleasant sailing.\"\n\nThe overall winner is yet to be decided. (ABC News: Maren Preuss)\n\nFollow the yachts as they sail for Hobart with the official race tracker.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-29/australian-drivers-truckies-courtesy-wave/106152822",
        "title": "Experiment shows uncertain future for courtesy wave",
        "publish_date": "Sun, 28 Dec 2025 19:02:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "The ABC has travelled more than 550 kilometres across regional Victoria and South Australia to find out whether drivers are still giving courtesy waves along our highways and country roads.\n\nThe \"wave test drive\" started in Mildura in Victoria's north-west, through the towns of Ouyen, Speed, Patchewollock, Walpeup, and along the Mallee Highway before crossing the South Australian border, with the driver waving at every passing vehicle.\n\nFrom there, the ABC headed north to Loxton via Pinnaroo, through Swan Reach and Blanchetown before finally arriving at Truro, a town 80km north-east of Adelaide.\n\nThe results showed an uncertain future for the courtesy wave, with drivers from just 33 of the 374 vehicles the ABC passed waving back.\n\nOn the highways, 25 waved back from 362 vehicles, while eight out of 12 waved on the back roads.\n\nSome truck drivers and country people have noticed fewer drivers giving out courtesy waves. (ABC News: Amelia Walters)\n\nEven though the results were a small sample of Australia's road network, it highlighted that while the wave might be declining on highways, it remained strong on back roads between small towns.\n\nHowever, locals had differing opinions on the future of the wave.\n\nSpeed local Meredith Rowney said the wave had decreased in regularity over time, but the type of road a person was travelling on mattered.\n\n\"If you're in a small country town where you know people, you are more likely to wave than in the bigger centres where you don't know people,\" Ms Rowney said.\n\n\"I think living locally, we see our friends driving past us, or our neighbours, so we wave to many people that pass us, as well as those that give way to us or do something kind.\"\n\nThe ABC tested how many drivers gave courtesy waves during a trip through Victoria and South Australia. (ABC News: Will Hunter)\n\nOuyen fuel tank driver Paul Dean said the wave happened regularly, but more likely between towns.\n\n\"Country people are still country people; everyone waves to everyone,\" Mr Dean said.\n\n\" [If] I see a white ute, nine times out of 10 that's going to be a local farmer, so I better wave otherwise they might get crook at me later on and say you're bit of snob, you didn't wave, so I definitely try and wave and a lot of people wave back. \"\n\nNSW tourist Brad, who was travelling through Truro, said the gesture might be happening more often.\n\n\"My 13-year-old son is teaching me different forms of doing it, so if it's in his sphere, then more people are doing it,\" he said.\n\nInterstate driver sees a decline\n\nInterstate truck driver Pete Kelly has been in the industry for 40 years and said the wave had \"all but died off\".\n\n\"People seem to be in too much of a rush, without having any courtesy,\" Mr Kelly said.\n\n\"Back in the day, when I first started, it was there all the time, and drivers would acknowledge each other, whether you were overtaking or coming towards each other, you always acknowledged the other driver.\n\n\"[Even] car drivers … I rarely see [the wave] these days.\"\n\nPete Kelly says the friendly gesture has \"died off\". (Supplied: Pete Kelly)\n\nTruck driver and road safety advocate Rod Hannifey shared a similar view.\n\n\"[It] seems noticeable that it has dropped off,\" Mr Hannifey said.\n\n\"It's disappointing from the point of view that where we used to wave to truckies all the time, it was part of the mateship and the culture, and that seems to have died off … in one way that's a bad thing, [since] we are out there alone on the road.\n\nRod Hannifey is hoping to introduce a National Wave Day next year. (ABC News: Kenji Sato)\n\n\"There are a number of reasons for that; I suppose phones are probably a big one … in the past, we relied on UHF radio and before that CB [radio].\n\nMr Hannifey said a campaign had started in NSW called \"Wave to a Truckie\" to promote \"the wave\". He also hoped to introduce a National Wave Day next year.\n\nWave improves road safety\n\nAustralia Road Safety Foundation chair and founder Russell White said bringing back the wave could shift the road culture, which in recent years had dropped due to poor driver behaviour and increased road aggression.\n\nRussell White says bringing back the wave could help shift the road culture. (Supplied: ARSF)\n\n\"I guess there's been a general decrease in a whole stack of our more social connection mechanisms that we might have traditionally had,\" Mr White said.\n\n\"[The wave] resets that narrative a little bit … [and] could change the overall culture on the road, just one driver, one road user at a time.\"\n\nMr White said the friendly gesture would help with awareness on the road.\n\n\"I think anything that could re-establish a connection is probably a really good tool to improve the overall level of road safety awareness,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/the-queen-s-gambit-made-chess-cool-this-series-turns-it-into-a-psychological-thriller-20251229-p5nqhr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Queen’s Gambit made chess cool. This series turns it into a psychological thriller",
        "publish_date": "Mon, 29 Dec 2025 13:08:51 +1100",
        "category": "sports",
        "authors": [
            "Paul Kalina"
        ],
        "text": "Rematch ★★★½\n\nWatching a game of chess can be a thrilling experience – even for a novice with only a basic grasp of the game. Like Test cricket, classical chess is slow, contemplative, epic, thrilling and crushing. It’s the ultimate slow-burn; the decisive moments that alter the course of an hours-long match can happen at any given moment. There’s nowhere to hide when a player makes a fatal blunder or executes a winning move that their opponent didn’t see coming.\n\nOrion Lee (left) as PC and Christian Cooke as Garry Kasparov in Rematch.\n\nDespite its rich history and customs, chess doesn’t loom large in film and TV. In 2020, The Queen’s Gambit came out of nowhere, a super-charged, fictionalised story of a young prodigy with a troubled childhood, an addiction and a killer wardrobe who turns the stuffy world of competitive chess upside down.\n\nIt went on to become a critical and audience hit and was rightly applauded for its depictions of damaged personalities and insights to the dangers of obsession and competition.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/bus-driver-survives-crash-after-colliding-with-car-in-sydneys-north-west-20251229-p5nqi8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bus driver survives crash after colliding with car in Sydney's north-west",
        "publish_date": "Mon, 29 Dec 2025 12:03:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bus driver survives crash after colliding with car in Sydney's north-west\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/ghost-chicken-noodle-salad-20251229-p5nqha.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Ghost chicken’ noodle salad",
        "publish_date": "Mon, 29 Dec 2025 12:00:45 +1100",
        "category": "finance",
        "authors": [
            "Rosheen Kaul"
        ],
        "text": "This herb-strewn chicken and noodle salad is perfect in hot weather. Armelle Habib; STYLING: Lee Blaylock\n\nInspired by a classic Yunnanese dish known as “ghost chicken”, this delicious tumble of chicken and aromatic herbs doused in soy and fresh citrus juice is precisely what I want on a hot day.\n\nIt uses one of my favourite pantry staples, shirataki or konjac noodles, which have a fantastic firm texture and soak up sauces and marinades like nothing else. Available in the supermarket’s Asian section, the noodles are usually sold ready to eat – no boiling required. But give them a good rinse before use to remove the residual flavours of the soaking liquid.\n\nThe dish traditionally uses sawtooth coriander, available from Asian grocers, but I’ve substituted the regular kind, which is far easier to find. To make the salad vegan-friendly, swap the chicken for slices of firm tofu.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/beautiful-production-can-t-free-anastasia-from-trappings-of-history-20251229-p5nqhd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beautiful production can’t free Anastasia from trappings of history",
        "publish_date": "Mon, 29 Dec 2025 11:55:47 +1100",
        "category": "entertainment",
        "authors": [
            "Sonia Nair"
        ],
        "text": "MUSICAL\n\nAnastasia ★★★\n\nRegent Theatre, until February 20\n\nA perfect storm of misinformation, political turmoil and the collective desire for a fairytale culminated in the legend of Grand Duchess Anastasia Nikolaevna, who was rumoured for decades to be alive even as the rest of her family – the last reigning monarchs of Russia – were believed to have been executed by the Bolsheviks.\n\nGeorgina Hopson as the amnesiac street sweeper Anya in Anastasia. Credit: Jeff Busby\n\nFinding its expression in the 1956 film starring Ingrid Bergman and 20th Century Fox’s first animated feature in 1997, the myth of Anastasia then found its way to Broadway, culminating in the 2017 premiere of the namesake musical.\n\nWith music and lyrics by Stephen Flaherty and Lynn Ahrens – the same two who composed the animation’s score – and a book by Terrence McNally, there’s pedigree underpinning this stage production.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/australia-coach-provides-telling-khawaja-update-ahead-of-scg-test-20251229-p5nqh5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia coach provides telling Khawaja update ahead of SCG Test",
        "publish_date": "Mon, 29 Dec 2025 11:50:49 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Australia coach Andrew McDonald says Usman Khawaja will play in the final Ashes Test in Sydney but has stopped short of guaranteeing his future, saying the timing of his retirement may not be solely his decision.\n\nA day out from the third Test in Adelaide, Khawaja’s career appeared in limbo when he was initially left out of Australia’s XI. But Steve Smith’s late withdrawal saw him parachuted back into the team. He has contributed scores of 82, 40, 29 and 0 across Adelaide and Melbourne in the middle order.\n\nUsman Khawaja signs autographs on what should have been day three of the Boxing Day Test. Credit: Getty Images for Cricket Australia\n\nAmid modest returns across the past two years - Khawaja has scored one Test century since the 2023 Ashes - speculation has mounted the 39-year-old could retire at the SCG in the city where he grew up.\n\nWhile there has been no official announcement, McDonald said it would be up to Khawaja to let the team know of his intentions.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/less-may-be-more-as-zac-lomax-prepares-to-chase-a-dream-not-money-20251226-p5nq4p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Less may be more as Zac Lomax prepares to chase a dream, not money",
        "publish_date": "Mon, 29 Dec 2025 11:44:00 +1100",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "In an era when professional athletes are portrayed as mercenaries chasing the almighty dollar, the curious case of Zac Lomax is a reminder that sometimes less can be more.\n\nLomax could be earning close to $1 million next year if he were still contracted to St George Illawarra.\n\nHe had a deal with the Dragons for 2026, reported to be worth $875,000, and he could likely have supplemented that with match payments at representative level: $30,000 for a State of Origin appearance and $3000 for a Test.\n\nYet, more than 12 months ago, Lomax sought a release, and the Dragons agreed to terminate the final two years of his deal, allowing him to accept a four-season offer from Parramatta.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/bradman-and-co-knew-toughness-was-part-of-test-cricket-do-today-s-players-20251228-p5nqe7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bradman and co. knew toughness was part of Test cricket. Do today’s players?",
        "publish_date": "Mon, 29 Dec 2025 11:40:27 +1100",
        "category": "sports",
        "authors": [
            "Greg Chappell"
        ],
        "text": "These are not the first players to confront challenging conditions, and they will not be the last. Yet, in their petulance, they betray a profound ignorance of the game’s storied past. Test cricket is not a fleeting entertainment; it is a legacy built brick by brick over nearly a century and a half. To disregard that history is to disrespect the format itself, and in doing so, they imperil its future. How many of these modern stars, cocooned in their bio-bubbles and lucrative contracts, pause to reflect on the warriors who preceded them? A doctor inspects Ric McCosker’s broken jaw during the Centenary Test in 1977. Credit: Fairfax Media I doubt many of them recall the visceral heroism of Rick McCosker in the Centenary Test of 1977, a match that etched itself into the soul of Australian cricket. Let me take you back to that sweltering March at the MCG. The curator, Bill Watt, known fondly as ‘Grassy’ for his lush pitches, had been thwarted by unseasonal weather. The surface was damp, verdant, a bowler’s paradise that spat like a cornered cobra.\n\nEngland captain Tony Greig won the toss and inserted Australia, a decision that unleashed carnage. Bob Willis, that lanky spearhead, hurled a bouncer that reared unpredictably from the damp surface, striking McCosker square on the jaw. The crack echoed around the ground; blood sprayed, and in a cruel irony, the ball deflected onto the stumps, dismissing him. His jaw shattered, McCosker was rushed to a hospital, his face a mask of agony. Australia limped to 138, pilloried by the press as inadequate. Australian batsman Rick McCosker playing with a broken jaw during the 1977 Centenary Test at the MCG. Credit: Fairfax Media As captain, I knew better. We had fought tooth and nail against a strong seam attack of Willis, JK Lever and Chris Old and the best damp wicket bowler of his era, Derek Underwood, on a demon of a track. If we bowled with fire, England would falter too. Thanks to Dennis Lillee and Max Walker, they did, handing us a precious 43-run first-innings lead. The pitch was improving, but in the early hours of our second innings, it still promised trouble. I turned to Kerry O’Keeffe, a leg-spinner with a sound defensive technique, and implored him to open.\n\n“Play the innings of your life,” I said. He and Ian Davis grafted for hours, not for glory but for time, shielding our specialists until the demons subsided. Then came the spark: young David Hookes, a 19-year-old debutant with fire in his veins, smashed Greig for five consecutive boundaries, signalling the pitch’s taming. Doug Walters, Rod Marsh, and astonishingly, McCosker himself, built on that foundation. McCosker, his head swathed in bandages, insisted on batting. It was no captain’s order; he demanded it, partnering Marsh for a crucial 54 runs at number 10. Travis Head was baffled at his dismissal on day two of the Boxing Day Test. Credit: Getty Images Marsh became the first Australian keeper to score a Test century, and we set England 463 to win. They fell 45 runs short, despite Derek Randall’s masterful 174, mirroring the margin of the inaugural Test in 1877. That match lasted the distance, a testament to grit over glamour. O’Keeffe, now a commentator, surely remembers. But do today’s crop? Their shrugs and sighs suggest not. They forget that professionalism is not measured by the zeroes on a pay cheque, but by the passion for the game’s lore, the willingness to battle for team, nation, and honour.\n\nIn an era of T20 fireworks and instant gratification, these players risk unravelling 148 years of Ashes tapestry. They inherit a legacy of sacrifice, yet treat it as disposable. Without reverence for the past, how can they inspire the future? Consider another epic from the MCG’s vaults: the 1936-37 Ashes Test, a clash that unfolded in an age when pitches lay exposed to the heavens. Australia trailed 0-2 in the series. Don Bradman at the MCG in 1937. Credit: Fairfax Media A biblical downpour transformed the wicket into a ‘sticky dog’ – uneven, drying under the sun, causing the ball to jump, skid, and deviate at unholy angles. Don Bradman captained with cunning. Declaring at 9-200, he forced England to bat on the quagmire. Gubby Allen, England’s skipper, sniffed the ploy and declared at 9-76, thrusting Australia back in while the pitch remained a minefield.\n\nBradman, undeterred, inverted his batting order, sacrificing tailenders to preserve his aces for better times. After a rest day allowed some drying time, Australia amassed 547 in their second innings, Bradman stroking a majestic 270 from number 7. England crumbled, Australia won, and stormed back to claim the series 3-2. That Test went the distance, too, a symphony of strategy and endurance. Contrast this with the 2025 Boxing Day debacle. Two Tests in the series have failed to reach day three, not due to superior skill but a glaring absence of desire. Batters slashed wildly, abandoning technique for bravado, as if ‘playing their natural game’ excused capitulation. They let down predecessors who bled for this rivalry; they shortchanged fans who braved the holiday heat; they betrayed their own generation by forsaking cricket’s core tenets – playing each ball on merit, scrapping for every run, enduring bruises for the greater good. I cannot believe any player left the field thinking they had given their all.\n\nI get that white-ball cricket has changed the game and power is valued more in the marketplace today than the ability to absorb pressure, but if the modern player does value Test cricket, as they say, then they must show it by being able to bat collectively for a minimum of 100 overs in any conditions. If they can’t, or won’t, do that, then the format is doomed. Spare a thought for Page, the head groundsman, and his team under MCC boss Stuart Fox. They toiled to craft a competitive surface, thwarted perhaps by unseasonal weather in preparation. Yet the players are just as culpable. MCG curator Matt Page looks on during an Australia nets session on December 24. Credit: Getty Images They hurled Page under the bus, blaming the pitch rather than their own frailties. Few put their body on the line, gesturing, laughing and cursing as they departed as if the surface was unplayable. Appalling. This is Test cricket, not a casual net. Get over yourselves and honour the format that has elevated you. Fight for your comrades, your colours. Absorb blows to extend the contest, ensuring spectators witness the drama they crave.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/wa-residents-told-to-prepare-for-cyclone-20251229-p5nqhx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA residents told to prepare for cyclone",
        "publish_date": "Mon, 29 Dec 2025 11:37:17 +1100",
        "category": "finance",
        "authors": [],
        "text": "WA residents told to prepare for cyclone\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-small-addition-to-the-opera-house-steps-that-has-caused-a-big-backlash-20251212-p5nn8n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The small addition to the Opera House steps that has caused a big backlash",
        "publish_date": "Mon, 29 Dec 2025 11:30:00 +1100",
        "category": "entertainment",
        "authors": [
            "David Barwell"
        ],
        "text": "A proposal to install handrails on the grand stairs of the Sydney Opera House has snowballed into a debate over how to preserve the city’s heritage landmarks while ensuring they also comply with modern building standards.\n\nThe Opera House is facing calls to reconsider its plan to erect handrails down the middle of the monumental steps due to concerns that the project could “mar” the grandeur of the sandstone walkway and clash with architect Jorn Utzon’s original vision.\n\nThe proposed upgrade is part of accessibility improvements at the Sydney Opera House. Credit: Flavio Brancaleone\n\nThe proposal is part of broader accessibility upgrades aimed at improving safety and ease of access for the 10 million visitors to the site each year.\n\nIn a statement, an Opera House spokeswoman said the handrail would be trialled at “several locations towards the middle of the steps in different configurations, with the duration in each location still to be determined”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/screen-icon-and-animal-rights-activist-brigitte-bardot-has-died-20251229-p5nqhs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Screen icon and animal rights activist Brigitte Bardot has died",
        "publish_date": "Mon, 29 Dec 2025 11:24:46 +1100",
        "category": "finance",
        "authors": [],
        "text": "Screen icon and animal rights activist Brigitte Bardot has died\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-feyza-tuncay-on-helping-children-learn-about-ethics/2nm7kbgh1",
        "title": "INTERVIEW: Feyza Tuncay on helping children learn about ethics",
        "publish_date": "Mon, 29 Dec 2025 02:14:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/french-film-icon-brigitte-bardot-dies-aged-91/kp9kw8yfp",
        "title": "French film icon Brigitte Bardot dies aged 91",
        "publish_date": "Sun, 28 Dec 2025 19:24:01 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Brigitte Bardot, the French 1960s film star who became one of the greatest screen sirens of the 20th century and later a militant animal rights activist and far-right supporter, has died. She was 91.\n\n\n\n\n\nBardot died on Sunday local time at her home in southern France, according to Bruno Jacquelin, of the Brigitte Bardot Foundation for the protection of animals.\n\n\n\n\n\nSpeaking to The Associated Press, he gave no cause of death and said no arrangements had been made for funeral or memorial services. She had been hospitalised last month.\n\n\n\n\n\nBardot became an international celebrity as a teen bride in the 1956 movie And God Created Woman. Directed by then husband Roger Vadim, it triggered a scandal with scenes of the long-legged beauty dancing on tables naked.\n\n\n\nBardot's cinema career spanned more than two dozen films. Source: Getty / Franco Origlia At the height of a cinema career that spanned more than two dozen films and three marriages, Bardot came to symbolise a nation bursting out of bourgeois respectability. Her tousled, blonde hair and voluptuous figure made her one of France's best-known stars, even as she struggled with depression.\n\n\n\n\n\nSuch was her widespread appeal that, in 1969, her features were chosen as the model for Marianne, France's national emblem and the official Gallic seal. Bardot's face appeared on statues, postage stamps and coins.\n\n\n\n\n\nFrench President Emmanuel Macron said in an X post: ''We are mourning a legend.\"\n\n\n\n\n\nBardot's second career as an animal rights activist was equally sensational. She travelled to the Arctic to blow the whistle on the slaughter of baby seals. She also condemned the use of animals in laboratory experiments, and she opposed Muslim slaughter rituals.\n\n\n\n\n\n\"Man is an insatiable predator,\" Bardot told The Associated Press on her 73rd birthday in 2007.\n\n\n\nWhile Bardot was a popular star, her physical appearance was often appreciated more than her talent. Source: AP / Jean Jacques Levy \"I don't care about my past glory. That means nothing in the face of an animal that suffers, since it has no power, no words to defend itself,\" Bardot said.\n\n\n\n\n\nHer activism earned her the respect of her compatriots, and in 1985, she was awarded the Legion of Honour, the nation's highest honour.\n\n\n\n\n\nLater, however, she fell from public grace as her animal protection diatribes took on a decidedly extremist tone. She frequently decried the influx of immigrants into France, especially Muslims.\n\n\n\n\n\nShe was convicted and fined five times in French courts for inciting racial hatred.\n\n\n\n\n\nIn 2018, at the height of the #MeToo movement, Bardot said in an interview most actors protesting sexual harassment in the film industry were \"hypocritical\" because many played \"the teases\" with producers to land parts.\n\n\n\nBardot said she had never had been a victim of sexual harassment and found it \"charming to be told that I was beautiful or that I had a nice little ass\".\n\n\n\n\n\nAmong Bardot's films were A Parisian (1957); In Case of Misfortune, in which she starred in 1958 with screen legend Jean Gabin; The Truth (1960); Private Life (1962); A Ravishing Idiot (1964); Shalako (1968); Women (1969); The Bear And The Doll (1970); Rum Boulevard (1971); and Don Juan (1973).\n\n\n\n\n\nBut while she was a popular star, her physical appearance was often appreciated more than her talent.\n\n\n\n\n\n\"It's an embarrassment to have acted so badly,\" Bardot said of her early films.\n\n\n\n\n\nWith the exception of 1963's critically acclaimed Contempt, Bardot's films were rarely complicated by plots. Often, they were vehicles to display Bardot in scanty dresses or frolicking nude in the sun.\n\n\n\n\"It was never a great passion of mine,\" Bardot said of filmmaking.\n\n\n\n\n\n\"And it can be deadly sometimes. Marilyn [Monroe] perished because of it.\"\n\n\n\n\n\nBardot retired to her Riviera villa in St Tropez at the age of 39 in 1973 after The Woman Grabber.\n\n\n\n\n\nAs fans brought flowers to her home, the local St Tropez administration called for \"respect for the privacy of her family and the serenity of the places where she lived\".\n\n\n\n\n\n— With additional reporting by Associated Press via Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/stocks-super-or-mortgage-payments-how-to-make-the-most-of-some-extra-cash/pdkhxt49j",
        "title": "Got some spare cash in the bank? Here's what experts say you should do with it",
        "publish_date": "Sun, 28 Dec 2025 18:36:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "The holiday season can bring extra cash — whether it's an year-end bonus, unused leave payout, or a festive cash gift.\n\n\n\n\n\nBut while it can be tempting to splurge, experts say this is the perfect time to make your money work for you.\n\n\n\n\n\nFrom investing in stocks and boosting your superannuation to paying down your mortgage, there are several ways to put spare earnings to good use — just be sure to read the fine print, do your research, and seek professional advice if required.\n\n\n\n\n\nSBS News spoke with two finance experts to weigh up the pros and cons of each approach, helping you make the most of any spare cash this holiday season.\n\n\n\nIs stock investing a smart move?\n\nMardy Chiah, associate professor of finance at the University of Newcastle, said before building wealth, it can be a good idea to first pay off high-interest debt, as the interest on that debt could outweigh the benefits of investing elsewhere.\n\n\n\n\n\nHe recommended thinking about your priority, whether that is retirement, wealth building, paying off debt or a mortgage.\n\n\n\n\n\nIf you are unsure where to start, he said it's important to diversify your investments as a beginner.\n\n\n\n\"Decide whether you want to pick individual stocks or invest in a fund for easier diversification,\" Chiah told SBS News.\n\n\n\n\n\n\"For example, you can buy BHP shares directly on the ASX or invest in an Exchange Traded Fund (ETF) that includes BHP and other companies.\n\n\n\n\n\n\"Only invest the amount that you are prepared to lose and don't need in the short term, as markets are volatile in the short run.\"\n\n\n\n\n\nRakesh Gupta, an associate professor in accounting and finance at Charles Darwin University, said it's wise not to rush into any spending decisions.\n\n\n\n\n\n\"Markets swing in days. Wealth builds in years. Patience and diversification win,\" he told SBS News.\n\n\n\n\n\n\"The stock market can move very quickly. This year alone, we have seen days when the ASX200 has shifted 2 or 3 per cent in a single session because of overnight policy surprises or global news.\"\n\n\n\nWhat about superannuation?\n\nGupta said contributing extra to your superannuation can have long-term financial gains and remains one of the most tax-effective ways to build wealth over time.\n\n\n\n\n\n\"Extra contributions into a super work particularly well for people with many years until retirement,\" he said.\n\n\n\n\n\n\"The tax benefits are substantial, and consistent contributions build significant wealth over time.\"\n\n\n\nREAD MORE Calls for superannuation protections as some retirees could lose up to $205,000\n\nChiah said there are positives and negatives to this approach.\n\n\n\n\n\n\"Super is a type of managed fund that offers diversification and tax advantages. Contributions and earnings are taxed at 15 per cent, usually lower than personal income tax rates,\" he said.\n\n\n\n\n\n\"Downside: funds are locked until retirement.\"\n\n\n\nPaying down your mortgage\n\nChiah said both superannuation contributions and mortgage repayments are generally solid options for those who prefer a cautious approach to investing, as they typically don't require extensive research or active trading.\n\n\n\n\n\nWhen it comes to mortgage repayments, he said, if your mortgage interest rate is 5 per cent, you will need to earn at least a 5 per cent after-tax return elsewhere to come out ahead.\n\n\n\n\n\nGupta said putting cash towards your mortgage repayments can be a better option than superannuation contributions, because \"the return is guaranteed through interest saved\".\n\n\n\n\"It reduces financial stress, lowers required living costs in retirement and gives people a sense of security that is difficult to quantify but very real in practice,\" Gupta said.\n\n\n\n\n\n\"Extra super grows wealth. Extra mortgage payments grow certainty. Blending both works for many people.\"\n\n\n\nOther forms of investing\n\nChiah also flagged other forms of investing, typically lower in risk compared to the stock market.\n\n\n\n\n\n— Term deposits: Low risk and low return, but often below inflation.\n\n\n\n\n\n— Bonds: Lower risk than stocks, provide steady income.\n\n\n\n\n\n— Managed funds/ETFs: Quick diversification without picking individual stocks.\n\n\n\n\n\n— Real estate: Steady income via rental, but less liquidity. Also requires a large initial outlay, often 20 per cent deposit plus stamp duty.\n\n\n\n\n\n— Alternative investments: Private equity, commodities like gold, and cryptocurrencies such as Bitcoin. These can offer further diversification but are complex and carry unique risks.\n\n\n\nExtra super grows wealth. Extra mortgage payments grow certainty. Rakesh Gupta, Charles Darwin University\n\nWhether or not you choose to invest, spend or save, Gupta said having financial buffers where possible is a good idea.\n\n\n\n\n\n\"Investing without an emergency fund or while carrying high-cost debt tends to backfire.\n\n\n\n\n\n\"And circumstances change over time, so reviewing your plan each year is important.\"\n\n\n\n\n\nDisclaimer: The information in this article is general in nature and is not intended as financial advice. You should consult with a licensed professional to make the decisions that are right for you.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cyclone-alfred-among-most-costly-disasters-of-2025/5oh2c849g",
        "title": "Cyclone Alfred among top ten costliest climate-change-linked disasters of 2025",
        "publish_date": "Sun, 28 Dec 2025 05:20:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's destructive ex-tropical cyclone Alfred has been ranked among the world's most costly disasters fuelled by climate change in 2025.\n\n\n\n\n\nEconomic losses caused by the fierce storm that ravaged southeast Queensland and northern NSW clocked in at roughly $1.8 billion.\n\n\n\n\n\nThe 10 most economically catastrophic events listed by UK-based humanitarian relief charity Christian Aid totalled more than $180 billion in losses, with each costing more than $1.5 billion.\n\n\n\n\n\nThe costliest extreme event influenced by human-driven climate change was the Palisade and Eaton wildfires that ripped through suburban Los Angeles in January .\n\n\n\n\n\nEconomic losses from destroyed properties and other damage caused by the catastrophic blaze surpassed $89 billion.\n\n\n\nOther expensive disasters include cyclones in November that triggered destructive flooding and landslides in Thailand, Indonesia, Sri Lanka, Vietnam and Malaysia .\n\n\n\n\n\nThe tropical storms and extreme monsoon system was thought to cost around $37.2 billion, making it the second most expensive event of 2025.\n\n\n\n\n\nThe flooding disaster also claimed more than 1,750 lives, making it among the year's deadliest climate events.\n\n\n\nExtreme rainfall and flooding in China in June and August was the third most costly event.\n\n\n\n\n\nCataloguing extreme weather events is an annual undertaking for the charity seeking to underline the economic and human toll of a changing climate.\n\n\n\n\n\nIt draws on economic loss calculations made by insurance giant Aon, with most estimates based on insured losses and missing the full costs of lost income, environmental degradation and human displacement.\n\n\n\n\n\nThe growing body of research linking rising greenhouse gas emissions to specific weather events also informed the report.\n\n\n\nREAD MORE Cloud seeding and chemtrails: Debunking the wild theories circling Cyclone Alfred\n\nFollowing ex-tropical cyclone Alfred, which was the eighth most costly disaster listed, ClimaMeter's Rapid Attribution Study found the storm dumped more rain than it would have without human-driven climate change.\n\n\n\n\n\nThe storm, which threatened to barrel through densely-populated urban centres as a category four tropical cyclone before it was downgraded ahead of landfall, owed much of its intensity and rainfall extremes to above-average ocean temperatures.\n\n\n\n\n\nResearchers also noted Alfred tracked further south than was normal, sparking concerns warmer ocean temperatures would allow windstorms to veer into new territory and through settlements unprepared for them.\n\n\n\nScientists broadly expect fewer cyclones under a warming climate but the ones that do form are more likely to be more intense.\n\n\n\n\n\nDavide Faranda, research director at the Laboratoire de Science du Climat et de l'Environnement, said the documented events were not isolated disasters or natural.\n\n\n\n\n\n\"They are the predictable outcome of a warmer atmosphere and hotter oceans, driven by decades of fossil fuel emissions,\" he said.\n\n\n\n\n\nWealthy countries tend to place higher on the disaster cost ranking as they typically have higher property prices and residents are better able to afford insurance.\n\n\n\nYet the economies of poorer nations are usually hit harder by climate change extremes as these countries have fewer resources to respond.\n\n\n\n\n\nChristian Aid chief executive officer Patrick Watt said the findings underlined the urgent need for adaptation, particularly in the Global South where resources are stretched.\n\n\n\n\n\n\"The poorest communities are first and worst affected,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/how-young-birdwatchers-are-taking-flight-in-the-digital-age/z429mjnsn",
        "title": "How young birdwatchers are taking flight in the digital age",
        "publish_date": "Sat, 27 Dec 2025 21:02:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMeeting a three-time premiership winning rugby league player to look at birds on the outskirts of Western Sydney wasn't on my 2025 bucket list, but 27-year-old Penrith Panther's hooker, Mitch Kenny has agreed to show me his new hobby.\n\n\n\n\n\n“I like getting outside anyway and going on walks and stuff like that, so it's probably just an addition to that. I think it started out as a joke, but you can't joke birdwatching. You're either going out and looking for birds or you're not.”\n\n\n\n\n\nAs we walk down the track, which I'm told is a local favorite for the diversity of habitats, you can see in such a short space, he stops frequently to point out the birds we're seeing,\n\n\n\n\n\n“They were just a couple doves. I think they barred shoulder doves, just like pigeon looking birds, which we don't hate, but some we just don't care about that much. What is that? It might be blackface cuckoo shikes.”\n\n\n\n\n\n“How did you get into bird watching?”\n\n\n\n\n\n“Mainly through my brother. He's always been super keen on wildlife and he's always done this sort of stuff since I moved out here and he lives just up the mountains, started going out in these little expeditions and then tried to steal his hobby and make it a bit of my own and bought myself a pair of binoculars this year and started trying to get into this. And yeah, still just learning.”\n\n\n\n\n\nIt was in the Blue Mountains that he saw what's known as a spark bird - the term for a bird that gets someone seriously into bird watching after they see it.\n\n\n\n\n\n“I always used to go to this one lookout in the lower mountains anyway, but there was signage there that said lookout for the peregrine falcon, the world's fastest bird. It's a raptor. So it was pretty cool and I started going and taking my binoculars every time and it probably took me six or seven times before I finally saw it, and that was my first time feeling the rush of getting a good get.”\n\n\n\n\n\nHere's one of a growing number of young people getting into birdwatching. After operating for five years, the inner west based birdwatching group, Sydney Bird Clubs, saw one of its biggest ever turnouts In February, 2020,\n\n\n\n\n\n“Just before COVID, it felt to us like we were on the cusp of a birdwatching boom. So there was a curiosity among people, and then I think during the pandemic it turned into a hardcore passion for a lot of people.”\n\n\n\n\n\nThat’s co-founder Stephanie Chambers, who says the club was set up to break the barriers to getting into birdwatching. The club's seen an influx of younger members in recent years. Environmentalist and host of Death by Birding podcast, Dr Cesar Puechmarin says the pandemic was a catalyst for many new birders.\n\n\n\n\n\n“I think birds have been thrown into our orbit, especially post COVID. So during COVID, a lot of people were stuck indoors. A lot of people were unable to explore, to go outside, and people started noticing the birds in their local environment, their own backyard. You have a generation of people who grew up playing video games or playing games like Pokemon, and this hobby of birdwatching fits perfectly, right. It's a never ending hobby. You can't finish it, you can't complete it. It's not like a video game that you can complete and then that's it. There will always be more birds.”\n\n\n\n\n\nMs Chambers says birdwatching allows people to tap into something that's almost an antidote to the internet.\n\n\n\n\n\n“I view it as a form of resistance against technology and social media. With our modern world, with the internet and social media, we're losing something and when you bird watch, you're not only just watching birds, you're watching seasonal changes, you're observing migrations. And so I think it tunes you into something that you would be without if you didn't. So I think it strikes at the core of who we are as humans.”\n\n\n\n\n\nBut that act of resistance against social media is now popping up online. Senior public relations manager at Bird Life Australia, Sean Dooley says the new generation of birders are turning to social media\n\n\n\n\n\n“And we were certainly worried in the digital age that people were just on their screens and not out in nature. But the sort of, I dunno what you call it, like the nature TikTok or the naturegram bird Instagram has really taken over because birds are so beautiful to look at and you can actually have an adventure seeing them, that it has attracted a whole tribe of digital natives to it.”\n\n\n\n\n\nThat online community has moved into the real world for Mitch Kenny, who's been out on a number of bird dates since he started posting about birds online.\n\n\n\n\n\n“You meet someone, you talk a bit of shit, go for a walk and hopefully see a few birds. It is pretty fun. I think I'm pretty keen to go out with someone who knows what they're looking for. And then some people are pretty keen to meet a footy player and stuff like that, so there's a mutual exchange there. So everyone wins.”\n\n\n\n\n\nMr. Dooley says that transfer of knowledge is important.\n\n\n\n\n\n“When you move into the wild, there is a risk that you were disturbing the natural life cycle of birds. But I think when the community find each other, they do start to, that type of advice is like, Hey dude, you shouldn't really be going up to that nest because that eagle will abandon the chicks if you come too close. That sort of information starts to get shared.”\n\n\n\n\n\nHe says, when people get more interested in birds, it has flow on effects.\n\n\n\n\n\n“Hopefully that in a lot of people's birdwatching journey, they come to the realization that to continue the passion that they love because of the variety we have in Australia, we want to keep that variety and that people are going to have to do something about it to save the things that bring them joy.”\n\n\n\n\n\nSomething Mitch Kenny says he's already experiencing.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/summer-rental-property-market-heating-up/cgrp2mvbv",
        "title": "Inside Australia's rental crunch — and what the numbers say about 2026",
        "publish_date": "Sat, 27 Dec 2025 19:45:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Summer may bring more rental listings, but with demand still overwhelming supply, experts say soaring prices are cementing housing affordability as one of Australia's biggest economic flashpoints heading into 2026.\n\n\n\n\n\nRents for houses remain at record highs across the country, with unit prices not far behind, as Australia enters the peak lease-changeover period.\n\n\n\n\n\nThe summer months have long delivered the biggest surge in rental listings, but this year's activity has been intensified by the return of international students, new migrant workers, and local renters searching for more affordable options.\n\n\n\n\n\nNicola Powell, chief of research and economics at Domain, told SBS News summer consistently marks the busiest period for new leases and renewals.\n\n\n\n\n\n\"You tend to find that vacancies start to rise towards the end of the year as those listings come onto the rental market,\" she said.\n\n\n\nPowell said this follows a big changeover period early in the new year, when vacancy rates are expected to dip again once that wave of activity passes.\n\n\n\n\n\nShe said this pattern reflects the calendar for universities and graduate hiring, as well as landlords' preference to advertise during the holiday period when they have more time to organise maintenance and inspections.\n\n\n\nStill a 'landlord's market'\n\nEven with the seasonal boost in listings, renters are unlikely to feel real relief, according to Powell.\n\n\n\n\n\nVacancy rates across the country remain below 2 per cent — an exceptionally tight level that continues to favour a \"landlord's market\".\n\n\n\n\n\n\"The rental market is still competitive,\" she said.\n\n\n\n\n\n\"Tenants are going to find there is more choice, but more tenants are looking for rentals at this period of time as well.\"\n\n\n\nLISTEN TO INTERVIEW: Eliza Owen from Cotality on the RBA's impact on the property market SBS News 05:48 English\n\nRecord-low vacancies have also helped push both house and unit rents to new heights in most major cities.\n\n\n\n\n\n\"Some of our major capital cities are better than others, but I think we still have high rents. We still have house rents at record highs across all our capitals,\" Powell said.\n\n\n\n\n\n\"Most capital cities have high unit rents as well.\"\n\n\n\nWeekly rents remain high\n\nData from Domain shows rents for houses and units have steadily increased over the seven years to September 2025.\n\n\n\n\n\nSydney remains the most expensive city for units, averaging $750 a week, while Hobart is the cheapest at $490.\n\n\n\n\n\nFor houses, Sydney again tops the list at $780 a week. Hobart and Melbourne share the lowest average house rents at $580.\n\n\n\n\n\nAcross the combined capitals, the average weekly rent for houses and units sits at $650.\n\n\n\nSydney remains the most expensive city for units, averaging $750 a week, while Hobart is the cheapest at $490, according to Domain's September 2025 Rental Report. Source: SBS News Powell said the government's new first-home buyers' scheme could reduce pressure on the rental market — but not immediately.\n\n\n\n\n\n\"The scheme could take some element of demand away from the rental market, but whether or not it'll be felt as quickly as this changeover season is to be determined,\" she said.\n\n\n\n\n\n\"Over time, we should see more tenants transitioning to being homeowners. That's the aim of this policy.\"\n\n\n\nSydney has the highest average house rent at $780 per week, while Hobart and Melbourne have the lowest average house rents at $580 per week, according to Domain's September 2025 Rental Report. Source: SBS News\n\nNegotiating your rent in a tight market\n\nDespite strong competition, this moment of higher supply may give tenants a brief window to negotiate — particularly those with a reliable payment record or long-term tenancy.\n\n\n\n\n\nLeanne Pilkington, president of the Real Estate Institute of Australia, told SBS News both tenants and landlords should familiarise themselves with their rights, review comparable rental prices and start conversations early.\n\n\n\n\n\n\"Tenants should know their rights and start lease talks early,\" she said.\n\n\n\n\n\n\"Landlords should keep properties in top shape, follow the rules, and give proper notice for rent or lease changes.\"\n\n\n\n\n\nShe said landlords can increase rent according to state and territory rules, but they are required to provide proper written notice to tenants and adhere to the required notice periods.\n\n\n\n\n\nTenants, on the other hand, can negotiate before signing a lease renewal or accepting a rent increase.\n\n\n\n\"They can ask for a lower rent, get more information, or suggest terms based on what's fair in the current market or their personal situation,\" Pilkington said.\n\n\n\nSubletting on the rise — and the risks\n\nWith rising costs prompting some renters to consider subletting for the first time, Pilkington warned failing to follow legal requirements can lead to disputes, fines, or broken leases.\n\n\n\n\n\nIn most states and territories, tenants must obtain their landlord's written permission before subletting or adding occupants.\n\n\n\n\n\nSome leases prohibit subletting altogether, while others allow it with specific conditions.\n\n\n\nREAD MORE 'Unacceptable': The question nearly seven in 10 renters fear asking their landlord\n\n\"When putting the agreement in writing, it should clearly address: rent or contribution to utilities, access to shared spaces, length of stay, notice periods, responsibilities for cleaning, guests, noise and property maintenance and what happens if something is damaged or lost,\" Pilkington said.\n\n\n\nWhat does this mean for 2026?\n\nExperts say this year's supercharged summer market suggests affordability pressures will remain acute in 2026, even as new policies aim to gradually shift some renters into homeownership.\n\n\n\n\n\nKaytlin Ezzy, an economist at property analytics group Cotality, said it is \"unlikely\" property prices will fall in the near term.\n\n\n\n\n\n\"The same factors that have supported value growth over the past few months, including restricted advertised supply, lower borrowing costs and the expansion of the First Home Guarantee scheme, will likely continue to support growth in 2026,\" she said.\n\n\n\n\n\nEzzy said government policies around housing are likely to push values higher, unless they are specifically designed to increase supply or reduce demand.\n\n\n\n\n\n\"The expanded first home guarantee schemes, for example, while great at helping some first-time homeowners get into the market, have placed pressure on home values, not only from said first-time buyers but also from speculative investors chasing capital gains in these areas,\" she said.\n\n\n\n\n\nWhile property prices show no sign of falling, renters may experience some relief in the months following summer, when competition for rentals tends to decline, according to Ezzy.\n\n\n\n\n\n\"After rising on average around 9 per cent between December and March, the rolling 3-month count of new rental listings typically eases into a quieter winter period, declining on average by 8.5 per cent between March and June.\"\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/the-queen-s-gambit-made-chess-cool-this-series-turns-it-into-a-psychological-thriller-20251229-p5nqhr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Queen’s Gambit made chess cool. This series turns it into a psychological thriller",
        "publish_date": "Mon, 29 Dec 2025 13:08:51 +1100",
        "category": "sports",
        "authors": [
            "Paul Kalina"
        ],
        "text": "Rematch ★★★½\n\nWatching a game of chess can be a thrilling experience – even for a novice with only a basic grasp of the game. Like Test cricket, classical chess is slow, contemplative, epic, thrilling and crushing. It’s the ultimate slow-burn; the decisive moments that alter the course of an hours-long match can happen at any given moment. There’s nowhere to hide when a player makes a fatal blunder or executes a winning move that their opponent didn’t see coming.\n\nOrion Lee (left) as PC and Christian Cooke as Garry Kasparov in Rematch.\n\nDespite its rich history and customs, chess doesn’t loom large in film and TV. In 2020, The Queen’s Gambit came out of nowhere, a super-charged, fictionalised story of a young prodigy with a troubled childhood, an addiction and a killer wardrobe who turns the stuffy world of competitive chess upside down.\n\nIt went on to become a critical and audience hit and was rightly applauded for its depictions of damaged personalities and insights to the dangers of obsession and competition.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/bus-driver-survives-crash-after-colliding-with-car-in-sydneys-north-west-20251229-p5nqi8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bus driver survives crash after colliding with car in Sydney's north-west",
        "publish_date": "Mon, 29 Dec 2025 12:03:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Bus driver survives crash after colliding with car in Sydney's north-west\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/ghost-chicken-noodle-salad-20251229-p5nqha.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Ghost chicken’ noodle salad",
        "publish_date": "Mon, 29 Dec 2025 12:00:45 +1100",
        "category": "finance",
        "authors": [
            "Rosheen Kaul"
        ],
        "text": "This herb-strewn chicken and noodle salad is perfect in hot weather. Armelle Habib; STYLING: Lee Blaylock\n\nInspired by a classic Yunnanese dish known as “ghost chicken”, this delicious tumble of chicken and aromatic herbs doused in soy and fresh citrus juice is precisely what I want on a hot day.\n\nIt uses one of my favourite pantry staples, shirataki or konjac noodles, which have a fantastic firm texture and soak up sauces and marinades like nothing else. Available in the supermarket’s Asian section, the noodles are usually sold ready to eat – no boiling required. But give them a good rinse before use to remove the residual flavours of the soaking liquid.\n\nThe dish traditionally uses sawtooth coriander, available from Asian grocers, but I’ve substituted the regular kind, which is far easier to find. To make the salad vegan-friendly, swap the chicken for slices of firm tofu.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/beautiful-production-can-t-free-anastasia-from-trappings-of-history-20251229-p5nqhd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beautiful production can’t free Anastasia from trappings of history",
        "publish_date": "Mon, 29 Dec 2025 11:55:47 +1100",
        "category": "entertainment",
        "authors": [
            "Sonia Nair"
        ],
        "text": "MUSICAL\n\nAnastasia ★★★\n\nRegent Theatre, until February 20\n\nA perfect storm of misinformation, political turmoil and the collective desire for a fairytale culminated in the legend of Grand Duchess Anastasia Nikolaevna, who was rumoured for decades to be alive even as the rest of her family – the last reigning monarchs of Russia – were believed to have been executed by the Bolsheviks.\n\nGeorgina Hopson as the amnesiac street sweeper Anya in Anastasia. Credit: Jeff Busby\n\nFinding its expression in the 1956 film starring Ingrid Bergman and 20th Century Fox’s first animated feature in 1997, the myth of Anastasia then found its way to Broadway, culminating in the 2017 premiere of the namesake musical.\n\nWith music and lyrics by Stephen Flaherty and Lynn Ahrens – the same two who composed the animation’s score – and a book by Terrence McNally, there’s pedigree underpinning this stage production.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/australia-coach-provides-telling-khawaja-update-ahead-of-scg-test-20251229-p5nqh5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia coach provides telling Khawaja update ahead of SCG Test",
        "publish_date": "Mon, 29 Dec 2025 11:50:49 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Australia coach Andrew McDonald says Usman Khawaja will play in the final Ashes Test in Sydney but has stopped short of guaranteeing his future, saying the timing of his retirement may not be solely his decision.\n\nA day out from the third Test in Adelaide, Khawaja’s career appeared in limbo when he was initially left out of Australia’s XI. But Steve Smith’s late withdrawal saw him parachuted back into the team. He has contributed scores of 82, 40, 29 and 0 across Adelaide and Melbourne in the middle order.\n\nUsman Khawaja signs autographs on what should have been day three of the Boxing Day Test. Credit: Getty Images for Cricket Australia\n\nAmid modest returns across the past two years - Khawaja has scored one Test century since the 2023 Ashes - speculation has mounted the 39-year-old could retire at the SCG in the city where he grew up.\n\nWhile there has been no official announcement, McDonald said it would be up to Khawaja to let the team know of his intentions.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/less-may-be-more-as-zac-lomax-prepares-to-chase-a-dream-not-money-20251226-p5nq4p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Less may be more as Zac Lomax prepares to chase a dream, not money",
        "publish_date": "Mon, 29 Dec 2025 11:44:00 +1100",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "In an era when professional athletes are portrayed as mercenaries chasing the almighty dollar, the curious case of Zac Lomax is a reminder that sometimes less can be more.\n\nLomax could be earning close to $1 million next year if he were still contracted to St George Illawarra.\n\nHe had a deal with the Dragons for 2026, reported to be worth $875,000, and he could likely have supplemented that with match payments at representative level: $30,000 for a State of Origin appearance and $3000 for a Test.\n\nYet, more than 12 months ago, Lomax sought a release, and the Dragons agreed to terminate the final two years of his deal, allowing him to accept a four-season offer from Parramatta.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/bradman-and-co-knew-toughness-was-part-of-test-cricket-do-today-s-players-20251228-p5nqe7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bradman and co. knew toughness was part of Test cricket. Do today’s players?",
        "publish_date": "Mon, 29 Dec 2025 11:40:27 +1100",
        "category": "sports",
        "authors": [
            "Greg Chappell"
        ],
        "text": "These are not the first players to confront challenging conditions, and they will not be the last. Yet, in their petulance, they betray a profound ignorance of the game’s storied past. Test cricket is not a fleeting entertainment; it is a legacy built brick by brick over nearly a century and a half. To disregard that history is to disrespect the format itself, and in doing so, they imperil its future. How many of these modern stars, cocooned in their bio-bubbles and lucrative contracts, pause to reflect on the warriors who preceded them? A doctor inspects Ric McCosker’s broken jaw during the Centenary Test in 1977. Credit: Fairfax Media I doubt many of them recall the visceral heroism of Rick McCosker in the Centenary Test of 1977, a match that etched itself into the soul of Australian cricket. Let me take you back to that sweltering March at the MCG. The curator, Bill Watt, known fondly as ‘Grassy’ for his lush pitches, had been thwarted by unseasonal weather. The surface was damp, verdant, a bowler’s paradise that spat like a cornered cobra.\n\nEngland captain Tony Greig won the toss and inserted Australia, a decision that unleashed carnage. Bob Willis, that lanky spearhead, hurled a bouncer that reared unpredictably from the damp surface, striking McCosker square on the jaw. The crack echoed around the ground; blood sprayed, and in a cruel irony, the ball deflected onto the stumps, dismissing him. His jaw shattered, McCosker was rushed to a hospital, his face a mask of agony. Australia limped to 138, pilloried by the press as inadequate. Australian batsman Rick McCosker playing with a broken jaw during the 1977 Centenary Test at the MCG. Credit: Fairfax Media As captain, I knew better. We had fought tooth and nail against a strong seam attack of Willis, JK Lever and Chris Old and the best damp wicket bowler of his era, Derek Underwood, on a demon of a track. If we bowled with fire, England would falter too. Thanks to Dennis Lillee and Max Walker, they did, handing us a precious 43-run first-innings lead. The pitch was improving, but in the early hours of our second innings, it still promised trouble. I turned to Kerry O’Keeffe, a leg-spinner with a sound defensive technique, and implored him to open.\n\n“Play the innings of your life,” I said. He and Ian Davis grafted for hours, not for glory but for time, shielding our specialists until the demons subsided. Then came the spark: young David Hookes, a 19-year-old debutant with fire in his veins, smashed Greig for five consecutive boundaries, signalling the pitch’s taming. Doug Walters, Rod Marsh, and astonishingly, McCosker himself, built on that foundation. McCosker, his head swathed in bandages, insisted on batting. It was no captain’s order; he demanded it, partnering Marsh for a crucial 54 runs at number 10. Travis Head was baffled at his dismissal on day two of the Boxing Day Test. Credit: Getty Images Marsh became the first Australian keeper to score a Test century, and we set England 463 to win. They fell 45 runs short, despite Derek Randall’s masterful 174, mirroring the margin of the inaugural Test in 1877. That match lasted the distance, a testament to grit over glamour. O’Keeffe, now a commentator, surely remembers. But do today’s crop? Their shrugs and sighs suggest not. They forget that professionalism is not measured by the zeroes on a pay cheque, but by the passion for the game’s lore, the willingness to battle for team, nation, and honour.\n\nIn an era of T20 fireworks and instant gratification, these players risk unravelling 148 years of Ashes tapestry. They inherit a legacy of sacrifice, yet treat it as disposable. Without reverence for the past, how can they inspire the future? Consider another epic from the MCG’s vaults: the 1936-37 Ashes Test, a clash that unfolded in an age when pitches lay exposed to the heavens. Australia trailed 0-2 in the series. Don Bradman at the MCG in 1937. Credit: Fairfax Media A biblical downpour transformed the wicket into a ‘sticky dog’ – uneven, drying under the sun, causing the ball to jump, skid, and deviate at unholy angles. Don Bradman captained with cunning. Declaring at 9-200, he forced England to bat on the quagmire. Gubby Allen, England’s skipper, sniffed the ploy and declared at 9-76, thrusting Australia back in while the pitch remained a minefield.\n\nBradman, undeterred, inverted his batting order, sacrificing tailenders to preserve his aces for better times. After a rest day allowed some drying time, Australia amassed 547 in their second innings, Bradman stroking a majestic 270 from number 7. England crumbled, Australia won, and stormed back to claim the series 3-2. That Test went the distance, too, a symphony of strategy and endurance. Contrast this with the 2025 Boxing Day debacle. Two Tests in the series have failed to reach day three, not due to superior skill but a glaring absence of desire. Batters slashed wildly, abandoning technique for bravado, as if ‘playing their natural game’ excused capitulation. They let down predecessors who bled for this rivalry; they shortchanged fans who braved the holiday heat; they betrayed their own generation by forsaking cricket’s core tenets – playing each ball on merit, scrapping for every run, enduring bruises for the greater good. I cannot believe any player left the field thinking they had given their all.\n\nI get that white-ball cricket has changed the game and power is valued more in the marketplace today than the ability to absorb pressure, but if the modern player does value Test cricket, as they say, then they must show it by being able to bat collectively for a minimum of 100 overs in any conditions. If they can’t, or won’t, do that, then the format is doomed. Spare a thought for Page, the head groundsman, and his team under MCC boss Stuart Fox. They toiled to craft a competitive surface, thwarted perhaps by unseasonal weather in preparation. Yet the players are just as culpable. MCG curator Matt Page looks on during an Australia nets session on December 24. Credit: Getty Images They hurled Page under the bus, blaming the pitch rather than their own frailties. Few put their body on the line, gesturing, laughing and cursing as they departed as if the surface was unplayable. Appalling. This is Test cricket, not a casual net. Get over yourselves and honour the format that has elevated you. Fight for your comrades, your colours. Absorb blows to extend the contest, ensuring spectators witness the drama they crave.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/wa-residents-told-to-prepare-for-cyclone-20251229-p5nqhx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA residents told to prepare for cyclone",
        "publish_date": "Mon, 29 Dec 2025 11:37:17 +1100",
        "category": "finance",
        "authors": [],
        "text": "WA residents told to prepare for cyclone\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-small-addition-to-the-opera-house-steps-that-has-caused-a-big-backlash-20251212-p5nn8n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The small addition to the Opera House steps that has caused a big backlash",
        "publish_date": "Mon, 29 Dec 2025 11:30:00 +1100",
        "category": "entertainment",
        "authors": [
            "David Barwell"
        ],
        "text": "A proposal to install handrails on the grand stairs of the Sydney Opera House has snowballed into a debate over how to preserve the city’s heritage landmarks while ensuring they also comply with modern building standards.\n\nThe Opera House is facing calls to reconsider its plan to erect handrails down the middle of the monumental steps due to concerns that the project could “mar” the grandeur of the sandstone walkway and clash with architect Jorn Utzon’s original vision.\n\nThe proposed upgrade is part of accessibility improvements at the Sydney Opera House. Credit: Flavio Brancaleone\n\nThe proposal is part of broader accessibility upgrades aimed at improving safety and ease of access for the 10 million visitors to the site each year.\n\nIn a statement, an Opera House spokeswoman said the handrail would be trialled at “several locations towards the middle of the steps in different configurations, with the duration in each location still to be determined”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/screen-icon-and-animal-rights-activist-brigitte-bardot-has-died-20251229-p5nqhs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Screen icon and animal rights activist Brigitte Bardot has died",
        "publish_date": "Mon, 29 Dec 2025 11:24:46 +1100",
        "category": "finance",
        "authors": [],
        "text": "Screen icon and animal rights activist Brigitte Bardot has died\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/major-update-after-australian-cruise-ship-coral-adventurer-hits-reef-with-80-passengers-on-board-021836865.html",
        "title": "Major update after Australian cruise ship Coral Adventurer hits reef with 80 passengers on board",
        "publish_date": "2025-12-29T02:18:36Z",
        "category": "finance",
        "authors": [],
        "text": "Authorities have announced an update after a Cairns-based cruise ship hit a reef off the coast of Papua New Guinea with more than 80 passengers on board last week. The Australian Transport Safety Bureau (ATSB) has confirmed an investigation is underway after the Coral Adventurer ran aground off the Finschaffen Coast, east of Lae, Papua New Guinea.\n\nThe incident was reported to the ATSB around 5am local time on 27 December 2025. The grounded ship was heeled over about 6 degrees to port. It was the cruise ship's first trip since the death of an 80-year-old passenger.\n\nThe cruise, which costs $13,280 per person, departed from Cairns on December 18 and reached Papua New Guinea on December 20, where it continued along the coastline before passengers were scheduled to wrap up their journey and disembark on December 30.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe 80 passengers and 43 crew members were not injured, a cruise spokesman said.\n\nThe Australian cruise ship has hit a reef in Papua New Guinea. Picture: Brendan Radke\n\nAttempt to refloat cruise ship unsuccessful\n\nAccording to the ATSB, initial efforts were made to refloat the ship using its own engines, but these proved unsuccessful.\n\nThe ship’s operators later engaged a towage provider to assist refloating the ship, which is still underway.\n\nNo injuries have been reported to the ship’s 123 occupants (80 passengers and 43 crew).\n\nThe extent of any damage to the ship’s hull is not known, however water ingress is not reported.\n\nIn a statement, the ATSB is monitoring the situation and will \"conduct interviews and collect evidence and data once appropriate.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nData from the ship’s voyage data recorder has been quarantined and investigators are collecting other relevant recorded information, including ship tracking data, weather information, and crew, operator and maintenance records.\n\nCoral adventurer under investigation after death on remote island\n\nIt's the vessel's first voyage since 80-year-old NSW woman Suzanne Rees was discovered dead on remote Lizard Island on October 26. Source: Newswire\n\nThe Coral Adventurer is currently under investigation after 80-year-old NSW woman Suzanne Rees was discovered dead on remote Lizard Island on October 26.\n\nShe allegedly had not boarded the vessel and was found dead several hours later.\n\nHer death triggered several investigations from the AMSA and Workplace Health and Safety Queensland, which remains ongoing.\n\n— With Newswire\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-pet-owners-warned-about-overseas-product-illegal-to-import-into-australia-dispose-of-it-immediately-014617747.html",
        "title": "Aussie pet owners warned about overseas product illegal to import into Australia: 'Dispose of it immediately'",
        "publish_date": "2025-12-29T01:46:17Z",
        "category": "finance",
        "authors": [],
        "text": "Unsuspecting pet owners are being urged to avoid purchasing a line of “extremely cruel” training devices. Although metal pronged collars are illegal to import into Australia, they aren’t strictly prohibited in most states and are sold by “unscrupulous” dealers.\n\nThe metal collars control behaviour by pinching a dog’s neck with blunted points when pulled, but are considered by the RSPCA to be inhumane because they can cause injury, pain and suffering.\n\nWhen a juvenile dog was surrendered last week in NSW, it was discovered to be wearing one of the devices\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPictures supplied to Yahoo News show at least 16 prongs on the short, metal, chain collar.\n\nA woman with knowledge of the incident said the animal’s behavioural issues were so bad that it had gone through two owners, the second of whom had only lasted a couple of days.\n\nIt had been wearing the collar most of its short life, likely contributing to its ill temper.\n\n“The dog had major problems, but when vets removed the collar, its behaviour immediately changed,” she told Yahoo News.\n\nCurious about the collar, she placed it around her neck, but could only withstand the pain for any more than a minute.\n\n\"It's excruciating pain — it actually stabs your neck,\" she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"It can cause quite deep puncture wounds over time because it moves sideways and scrapes the top layer of skin away.\"\n\nMP reveals collars singled out in animal cruelty review\n\nBecause they train through negative reinforcement, the collars frequently result in pets fearing rather than trusting their owner.\n\nThe collars are prohibited for use in Victoria, Queensland and Tasmania, but not in other states.\n\nA simple search of major international retailers with a presence in Australia found them listed for sale at multiple online stores, with many manufactured in Germany and the USA.\n\nHowever, Emma Hurst, an MP with the Animal Justice Party, explained that if a collar is being used and causing an animal to suffer, then it could be breaching cruelty laws in NSW.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe collars have been repeatedly singled out during a review of the Prevention of Cruelty to Animals Act in NSW, leading to hope within pet welfare circles that they could soon be further restricted.\n\n“Experts in this space now recognise that they are extremely cruel,” Hurst told Yahoo News.\n\nIn 2025, dogs feel part of many Aussie families. Source: Getty\n\nPet owners urged to ditch pronged collars\n\nThe Christmas holidays are traditionally a time when people either spend more time with their pets or acquire new animals.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIf anyone has unsuspectingly bought a pronged collar without realising how harmful they are, then Hurst advises them to dispose of it immediately.\n\n“We need to make sure that people aren't using them, not realising how much they're causing a dog to suffer when it's entirely unnecessary,” she said.\n\nMost puppies require some sort of training, and Hurst urges their owners to seek out behavioural experts who use positive reinforcement, rather than “cruel” control devices.\n\n“We recognise dogs now as members of the family,” she said.\n\n“Causing them to develop pain and fear towards the people that are there to care for them is entirely unnecessary.”\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    }
]