[
    {
        "url": "https://www.9news.com.au/world/donald-trump-tariffs-australia-spared-import-taxes-usa-politics-news/cf426467-43dc-47d0-a9d5-28dda02ec6c2",
        "title": "Australia spared any new tariffs as Trump announces new import taxes",
        "publish_date": "Fri, 01 Aug 2025 01:44:17 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Australia has been spared another rise in tariffs as the White House announced a new round of import taxes.\n\nDonald Trump had hinted that the 10 per cent baseline tariff would rise on all countries.\n\nBut as a new list of countries to receive more tariffs was released this morning, Australia wasn't mentioned.\n\nDonald Trump has announced new tariffs on a long list of countries. (AP)\n\nThis means Australian exports to the US will remain at the 10 per cent baseline set in April.\n\n\"I think this is a vindication for the Albanese government and particularly the Prime Minister in the cool and calm way we have conducted diplomacy with the United States,\" Trade Minister Don Farrell said.\n\n\"This means products like wine, beef, lamb, wheat in a relative sense are cheaper into the United States.\n\n\"As a government, we will assist all of our exporters in ensuring we take advantage of this situation and increase the volume of exports, not just to the US, but all of those other countries that we have diversified with.\"\n\nThe hit list﻿\n\nThere was little explanation given for Trump's new tariff list, with the numbers varying dramatically from April's \"Liberation Day\" to today.\n\nNew Zealand has seen a substantial rise in tariffs, jumping from the baseline 10 per cent to 15 per cent.\n\nMeanwhile, Japan's tariff has dropped substantially from 24 per cent to 15 per cent.\n\nNot spared was Canada, which faced a big hike in tariffs.\n\nCanadian Prime Minister Mark Carney has a tense relationship with Donald Trump. (AP Photo/Evan Vucci)\n\nThe White House statement accused Canada of failing to \"cooperate in curbing the ongoing flood of fentanyl and other illicit drugs\".\n\n\"In response to Canada's continued inaction and retaliation, President Trump has found it necessary to increase the tariff on Canada from 25 per cent to 35 per cent to effectively address the existing emergency.\"\n\n\"Canada-based drug trafficking organisations maintain robust \"super labs,\" mostly in rural and dense areas in western Canada, some of which can produce 44 to 66 pounds of fentanyl weekly,\" the White House said in the statement.\n\n\"Fentanyl seizures at the northern border this fiscal year, with two months remaining, have surpassed total seizures of the past three years combined, underscoring Canada's escalating role in this crisis.\"\n\nIn February it was reported that just 0.2 per cent of fentanyl seized at US border crossings came from Canada.\n\nThe overwhelming majority came from Mexico.\n\nYet today Mexico was not subjected to any new tariffs.\n\nInstead the president announced a new 90-day delay for tariffs on Mexico.\n\n\"I have just concluded a telephone conversation with the President of Mexico, Claudia Sheinbaum, which was very successful in that, more and more, we are getting to know and understand each other,\" he said on Truth Social.\n\nWho pays for tariffs\n\nDespite much of the rhetoric about the import taxes, it is the purchaser who pays the tax.\n\nWhich means Australian businesses do not pay anything more to export to the US.\n\nInstead the American importer will pay the tax.\n\nHow it affects Australians is that American buyers may look elsewhere rather than pay more for imported goods - or not be able to buy as much.\n\nThe costs of the tariffs are then usually passed on to consumers, which is part of the reason why inflation remains high in the US, even as it eases in Australia.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bluey-episode-pulled-by-abc-over-bunnings-partnership/2c501b27-1f75-4bee-ad35-189544f56dc0",
        "title": "Popular 'Bluey' episode temporarily removed by ABC",
        "publish_date": "Fri, 01 Aug 2025 01:01:44 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "\"\n\nHammerbarn\n\nwill return to ABC iview at a later date. All other episodes of\n\nBluey\n\nseasons one to three remain on ABC iview for Bluey fans to enjoy.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/weather-news-sydney-shivers-through-the-coldest-day-year-as-nsw-expects-weather-lashing/7eaa3c11-8633-4cdf-9e31-8e0494a867ae",
        "title": "Sydney shivers through coldest day this year as NSW expects weather lashing",
        "publish_date": "Thu, 31 Jul 2025 22:52:36 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": "S﻿ydney\n\nhas shivered through its coldest day in over a year this week, with more\n\nwet weather\n\nto come on the east coast.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/brittany-groth-sam-groths-wife-publicly-slams-reporting-on-personal-relationship/c319549a-90bf-49ad-8739-6a315abf1a5b",
        "title": "Sam Groth's wife publicly slams 'despicable' reporting on personal relationship",
        "publish_date": "Thu, 31 Jul 2025 11:39:43 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "The wife of deputy Victorian Liberal leader Sam Groth has released a scathing statement after newspaper reports speculated over the timeline of their relationship.\n\nBrittany Groth today called a report by the Herald Sun \"a disgraceful smear campaign\" after it questioned whether she was underage when she commenced a relationship with Mr Groth in 2011.\n\n\"﻿The Herald Sun 's decision to speculate salaciously about my personal life from 14 years ago, when I was a teenager, is not journalism,\" she said.\n\nBrittany Groth today called a previous report by the Herald Sun \"a disgraceful smear campaign\", after it questioned whether she was underage when she commenced a relationship with Mr Groth in 2011. (Nine)\n\n\"It is a disgraceful smear campaign, devoid of fact, public interest or even basic decency.\"﻿\n\nMrs Groth labelled claims their relationship began when she was underage and Mr Groth was her tennis coach as \"baseless and false\".\n\nShe claims the Herald Sun \"never once tried to contact\" her regarding the story.\n\n\"Their conduct has amounted to pressure on me to disclose intimate details of my personal and private life, including when I first had sex with my husband, to defend myself against fiction,\" Mrs Groth said.\n\n\"It is despicable.\"\n\nSam Groth has threatened legal action against Labor MP Mary-Anne Thomas following her commentary on the matter. (Nine)\n\nBlasting the reporting, which included two articles and social media posts, Mrs Groth said the stories set \"a dangerous precedent\".\n\n\"No woman should live in fear that her private history will be picked apart and rewritten by strangers, let alone weaponised by media outlets desperate for clicks,\" she said.\n\n\"To the Herald Sun , your conduct is shameful.\n\n\"This was never about the truth. It was about manufacturing a scandal, and you did it at the expense of a young woman, a marriage and two innocent children.\"\n\nEarlier this week, Mary-Anne Thomas ﻿responded to media questions about the purported scandal. (Nine)\n\nIt comes as news emerged that the professional tennis player turned politician has threatened legal action against Labor MP Mary-Anne Thomas following her commentary on the matter.\n\nEarlier this week, Thomas ﻿responded to media questions about the purported scandal.\n\n\"If you can't govern yourselves, you can't govern the state,\" Thomas said.\n\n\"But if you're asking me if it's appropriate for a person in a position of influence or authority ... like a teacher or a coach to be dating a teenager, the answer is no.\n\n\"And I think most parents would stand with me.\"\n\nOpposition Leader Brad Battin declined to comment on the matter.\n\n\"Any matters now for Sam Groth are a private matter. I just won't be commenting further,\" he said.\n\nPremier Jacinta Allan said families should be \"very much off limits\" in the public sphere.\n\nThe Herald Sun has been contacted for comment.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/archibald-prize-2025-painting-of-william-barton-by-artist-loribelle-spirovski/8302fe2b-67a9-4f90-bcf9-d3d29533aaf4",
        "title": "Artist painted Archibald-winning portrait with fingers after nerve injury",
        "publish_date": "Thu, 31 Jul 2025 03:23:24 +0000",
        "category": "entertainment",
        "authors": [
            "Jul"
        ],
        "text": "R﻿enowned artist Loribelle Spirovski has won the 2025 Archibald Prize People's Choice award for a portrait made entirely by finger painting.\n\nPhillippines-born Spirovksi's oil-on-canvas portrait of﻿ Indigenous didgeridoo virtuoso William Barton was selected after 40,842 visitors to the Art Gallery of NSW voted during the Archibald, Wynne and Sulman Prizes 2025 exhibition.\n\nSpirovski is a four-time Archibald Prize finalist and sat down to paint Barton, a ﻿Kalkadunga man and acclaimed composer, while recovering from a nerve injury.\n\nREAD MORE: Millions of Sydney commuters ride free as gates turned off\n\nArchibald Prize ANZ People's Choice Award 2025 winner, finger painting of William Barton. (Supplied)\n\nShe said painting him using her fingers instead of a brush made her feel \"alive in a way I hadn't for a very long time\".\n\n\"When it came time to work on William's portrait, I played his composition Birdsong at dusk . As the music began, my hand set the brush aside and I dipped my finger into the soft, pliant paint,\" she said.\n\n\"I turned the volume up, the music guiding me. Without a brush, painting was almost painless.\"\n\nThe two first crossed paths in October last year during a concert featuring Barton and Spirovski's partner, concert pianist Simon Tedeschi.\n\nSpirovski said she was immediately taken with Barton's presence and was \"certain\" she would paint him.\n\n\"﻿I am infinitely grateful to William for allowing me to paint him and so humbled by everyone's responses to the work,\" Spirovski added.\n\nArtist Loribelle Spirovski posing with her award-winning portrait. (Instagram/@loribellespirovski)\n\n\"It has been a difficult few years and this whole experience is the most beautiful reprieve and reward.\"\n\nSpirovski ﻿is the ninth woman to win the People's Choice Award since its inception in 1988.\n\nA mostly self-taught artist﻿, Spirovki was also a finalist in the 2017 Archibald Prize for her painting John Bell at home , in 2018 for Villains always get the best lines and in 2019 for Meg and Amos (and Art).\n\n\"Congratulations to Loribelle Spirovski for her well-deserved win and for her magnetic portrait of William Barton, rendered with expressive paint strokes and lit by Barton's radiant smile,\" said Art Gallery of NSW director Maud Paige.\n\nThe finalists in Archibald, Wynne and Sulman Prizes 2025 will be exhibited at the Art Gallery until August 17.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/transmission-line-vni-west-cost-blow-out-victoria-farmers-fight/105599880",
        "title": "VNI West transmission network costs double as farmers fight project",
        "publish_date": "Fri, 01 Aug 2025 02:31:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "The cost of building a contentious overhead transmission line project in Victoria is expected to nearly double, triggering calls to cancel it.\n\nVNI West will run 475 kilometres from New South Wales to Victoria, connecting the Energy Connect transmission line that is under construction in NSW to the yet-to-be-built Western Renewables Link in Victoria.\n\nPreviously estimated to cost $3.9 billion, yesterday the Australian Energy Market Operator increased its cost estimate to $7.6 billion, and potentially as much as $11.4 billion.\n\nWhen complete, it will transmit renewable energy between the two states, and the Victorian government argues it is necessary to \"keep the lights on\" and push down power prices.\n\nThe project has faced Farmers vow to block developers , and recently its expected completion date was pushed back two years to 2030.\n\nPlans for new transmission lines for renewable energy are unpopular in farming communities. (ABC Rural: Angus Verley)\n\nCost blowout no surprise\n\nVictorian Farmers Federation (VFF) president Brett Hosking said the cost blowout came as no surprise.\n\n\"I think it's what farmers said right from the start, that it felt like the numbers were underdone,\" Mr Hosking said.\n\n\" It's a massive increase and we're not at the end of it. \"\n\nBrett Hosking says the cost blowout is no surprise. (ABC News)\n\nMr Hosking accused project developer Transmission Company Victoria of failing to engage properly with affected landowners.\n\n\"Unfortunately, the poor engagement and the poor management of the project has resulted in delays, and will continue to result in delays until we see a massive turnaround in the attitudes of the proponents,\" he said.\n\n\" We've got to have a very serious rethink about the viability of the project. \"\n\nHundreds of farmers travelled to Melbourne this week to rally against projects including VNI West. (ABC Rural: Angus Verley)\n\nThere have been numerous farmer-led protests against VNI West, including in regional towns and on the steps of parliament.\n\n\"The farmers weren't born protesters. They've been created as protesters because of poor engagement from these companies,\" Mr Hosking said.\n\nVNI needed 'to keep the lights on'\n\nTransmission Company Victoria was not available for an interview, but in a statement, spokesperson Claire Cass said the cost blowout was due to \"inflationary pressures that are affecting major infrastructure projects across Australia and the globe\".\n\n\"This update reflects the reality of delivering a vital and complex, large-scale energy infrastructure project today — balancing our obligations to landholders, traditional owners and local communities,\" Ms Cass said.\n\nVictorian Energy Minister Lily D'Ambrosio said, despite the inflated price tag, the benefit of VNI West would outweigh the cost, rejecting any suggestion the future of the project was uncertain.\n\nLily D'Ambrosio says VNI West is needed to \"keep the lights on\". (ABC News)\n\n\"It is a fact that without building transmission projects … that deliver that cheap, reliable electricity, bills would actually go up and our energy supply would be in danger,\" Ms D'Ambrosio said.\n\n\" If we want to keep the lights on, we need to build transmission. \"\n\nMs D'Ambrosio said the government would closely monitor the cost of transmission projects.\n\n\"I will always hold proponents of projects to account on costs,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/labor-tariff-vindication-after-escaping-higher-tariffs/105600688",
        "title": "Labor claims 'vindication' after escaping higher US tariff rate",
        "publish_date": "Fri, 01 Aug 2025 02:22:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia will seek to exploit its comparatively low tariff rate enacted by US President Donald Trump by exporting more products into the United States.\n\nThe order signed by Mr Trump has imposed new tariffs on some nations, but Australia has — for now — held onto its minimum 10 per cent \"baseline\" tariff rate, escaping a threat to lift that to 15 or 20 per cent suggested by the president.\n\nTrade Minister Don Farrell said Australian wine, beef, lamb, wheat and other products were now \"cheaper\" in a relative sense, and the government would seek to capitalise on that.\n\n\"As a government, we will assist all of our exporters in ensuring we take advantage of this situation and increase the volume of exports, not just to the US, but all of those other countries that we have diversified with,\" Senator Farrell said.\n\n\"I think this is a vindication for the Albanese government and particularly the prime minister in the cool and calm way we have conducted diplomacy with the United States,\" Senator Farrell said.\n\n\"I am hopeful this is the end of the matter now and the American government maintains that 10 per cent [tariff], and our producers, our wine makers, can get back to normal relations with the United States.\"\n\nThe Trump administration has taken umbrage against countries that were in a trade surplus with the US, or where it perceived countries had unfair trade barriers restricting US trade, in some cases imposing harsher tariffs as a retaliatory measure.\n\nMr Trump has also used the tariffs to encourage companies to move their operations to the US.\n\nSenator Farrell noted the US still exported more than double the value of goods into Australia than was sold by Australia to the US.\n\nA report by Meat and Livestock Australia released in June found the threat of tariffs on beef had not hurt trade, which had risen 32 per cent year-to-date.\n\nPossible 200 per cent drug tariff still hangs over Australia\n\nWhile the government has claimed victory for its tactics in the face of fierce criticism from the Coalition for still not securing a face-to-face meeting with Mr Trump, the president is still weighing further tariffs that could have a more significant impact on Australia.\n\nMr Trump is mulling a 200 per cent tariff on pharmaceuticals, one of Australia's largest export products to the US, which are currently exempt from the administration's tariff schedule.\n\nThe president said earlier this month he had held off from committing to that tariff to give manufacturers time to move their operations to the US to avoid the tax.\n\nLast year, Australia exported $2.2 billion in pharmaceutical products to the US, about 40 per cent of Australia's pharmaceutical exports, according to the UN's Comtrade database.\n\nOvernight, Mr Trump wrote to several pharmaceutical giants demanding they price US drugs no more expensive than prices negotiated overseas, asserting they would have to take a tougher negotiating position with foreign nations to do so.\n\nSenator Farrell said he did not expect that to affect Australian drug prices, repeating that the government would never put Australia's Pharmaceutical Benefits Scheme \"at risk\" in trade talks with the US.\n\nThe minister repeated the government's view that the Trump administration's tariffs were an act of economic self-harm by the states, and it did not support them.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/endangered-spotted-handfish-found-dead-on-street-in-hobart/105586134",
        "title": "Office worker finds endangered spotted handfish dead on Hobart street",
        "publish_date": "Fri, 01 Aug 2025 01:50:35 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A critically endangered spotted handfish found dead on a Hobart street was largely intact and looked as if it had just \"flopped out of the water\" when discovered by office worker John Retallick.\n\nMr Retallick found the fish, Brachionichthys hirsutus, on Victoria Street in the city centre last week when he briefly left his office to purchase groceries at a milk bar.\n\nHe has donated the unusual find to the Tasmanian Museum and Art Gallery, where genetic samples have been taken and the handfish preserved for future research.\n\nAn estimated 2,000 spotted handfish exist in the wild.\n\nMr Retallick remains shocked by his find.\n\n\" This takes the cake … it sure beats the pademelon that lives in our front yard. \"\n\nJohn Retallick with Richard Hale from the Tasmanian Museum and Art Gallery. (Supplied: John Retallick)\n\nCarlie Devine, principal investigator in spotted handfish research at the CSIRO, said the fish may have ended up on a city street after being taken by a seabird.\n\n\"It is a really interesting story: how did an iconic Tassie fish end up in the CBD?\" Ms Devine said.\n\n\"It's pretty incredible.\"\n\n'Still damp' and in good condition\n\nWhen Mr Retallick stumbled upon the dead fish, he immediately knew what it was.\n\n\"I went, 'Oh my god, that's a handfish!'\" he said.\n\n\" Part of me thought, 'Has someone stolen this?' \"\n\nHe rushed back to his office for a container and found a reusable glass coffee cup.\n\n\"I filled it with water and just got it [the fish] and popped it in,\" Mr Retallick said.\n\nIt's estimated there are 2,000 spotted handfish in the wild. (Supplied: John Retallick)\n\nHe said the handfish was \"still damp\" when he found it and later realised it was missing a fin.\n\nMr Retallick, who had previously worked at the museum, contacted friend and former colleague Richard Hale so he could donate the specimen.\n\n\"I called [Richard] and said, 'I'll give you a million-to-one odds if you can guess what I've just found on the street.'\"\n\nMr Retallick hopes its inclusion in the museum's collection will help improve knowledge of the species.\n\nHandfish likely died of natural causes\n\nThere are 14 handfish species, all of which are found only in southern Australia and mostly in Tasmania.\n\nThe spotted handfish inhabits the Derwent Estuary in Tasmania, where it lives in sheltered coastal bays.\n\nA spotted handfish in a tank at the CSIRO. (ABC News: Aneeta Bhole)\n\nThe elusive species uses its \"hands\" to walk, rather than swim, through the soft sediment it likes to inhabit.\n\nOnce common, the species has experienced a rapid decline and faces many threats.\n\nThese include water pollution, predation from introduced species such as the northern Pacific seastar, and habitat destruction by boat mooring chains and historical fishing practices.\n\nMs Devine thought it was likely the handfish found by Mr Retallick died of natural causes.\n\nCarlie Devine says it is plausible a seabird picked up the handfish and left it in the city. (ABC News: Luke Bowden)\n\nSpotted handfish have a short life span of five to 10 years.\n\nThe specimen's large size of approximately 11 centimetres suggests it reached a natural, albeit sad, endpoint as an adult handfish.\n\nMs Devine said it was likely there was a simple explanation for its death and discovery, particularly because of its missing upper fin.\n\n\"It looks like something has had a go at it,\" Ms Devine said.\n\n\"It possibly being translocated by a seabird sounds pretty plausible.\"\n\nShe said if a dead handfish was found, it should be put in a freezer straight away and reported to the Wildlife Incidents Hotline at NRE Tasmania or the National Handfish Recovery Team.\n\n\"We do get the occasional email from the public about seeing one.\n\n\" They're so precious, it's always sad when you hear one has washed up. \"\n\nRare specimen enters museum collection\n\nSenior curator at the museum David Hocking said the largely intact specimen was a rare example of an adult spotted handfish in the state collection.\n\nThe spotted handfish is now held by the Tasmanian Museum and Art Gallery. (Supplied: Tasmanian Museum and Art Gallery)\n\nIt now offers present and future opportunities for research on the species.\n\n\"These sorts of specimens are really valuable because they give us a record of the species at a moment in time,\" Dr Hocking said.\n\n\"It means that researchers in the future can keep coming back to these specimens to look at them to see how the population genetics might change over time.\"\n\nDr Hocking said there had been much speculation about how the handfish came to be on Victoria Street, but agreed with Ms Devine about what might have happened.\n\n\"It possibly washed up on a beach … [and] was probably picked up by a seabird, flown over, and dropped in town,\" he said.\n\n\" A seabird lost its lunch, but science has gained a specimen. \"\n\nHe encouraged the public to contact appropriate organisations if any \"rare\" or \"unusual\" animal specimens were found, but warned against touching birds because of avian influenza.\n\n\"Get in touch and someone can go and investigate it,\" Dr Hocking said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/one-third-townsville-residents-unprepared-for-flood/105586194",
        "title": "Survey finds confusion over evacuation zones in flood emergency",
        "publish_date": "Fri, 01 Aug 2025 01:40:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Research has revealed that about one-third of people were unprepared for north Queensland's most recent flooding disaster.\n\nThe data from James Cook University's (JCU) Centre for Disaster Studies also found confusion over evacuation orders and flood mapping in Townsville.\n\nThe survey included 233 people in Townsville and its surrounds impacted by the region's flood emergencies between late January and April this year.\n\nThe region saw severe flooding devastate the community of Ingham, while Townsville recorded its wettest year on record just three months into 2025.\n\nAbout 30 per cent of respondents said they did not have a disaster kit — a minimum of three days of essential supplies.\n\nThe north Queensland town of Ingham flooded in the first week of February 2025. (ABC News: Baz Ruddick)\n\nThe JCU report recorded more than $1.2 billion in damage, two fatalities from flooding, and now 35 deaths from an outbreak of the soil-borne disease melioidosis.\n\nThe findings showed a slight increase in preparedness from the last time the survey was conducted following Cyclone Kirrily in January 2024.\n\nJCU's Yetta Gurtner said disasters were becoming a \"day-to-day risk\" and results showed a long way to go in preparedness.\n\n\"We're finding members of the community are becoming more reliant on emergency services and other people to support them,\" Dr Gurtner said.\n\n\"The whole idea is that people should be self-sufficient, and emergency services are there as a priority need for those who can't help themselves.\"\n\nThe Ollera Creek bridge on the Bruce Highway collapsed into floodwaters in February. (ABC News: Aaron Kelly)\n\nThe Ollera Creek bridge — a vital supply route connecting Townsville and Ingham — collapsed into floodwaters in February.\n\nDr Gurtner said experience indicated people now needed a minimum of five to seven days' worth of supplies when road networks and power supplies were cut.\n\nEvacuation uncertainty\n\nDr Gurtner said there was also uncertainty over evacuation zones and flood mapping in Townsville.\n\n\"A lot of people didn't understand what the different colours meant, what that meant in terms of the evacuation messaging,\" she said.\n\nA Townsville City Council spokesperson said evacuation advice was issued using the coloured Ross River Evacuation Zones — related to flooding from the Ross River Dam — and that the zones had not changed since 2016.\n\n\"Due to the intensity and duration of the rainfall, some suburbs across Townsville experienced flash flooding outside of these zones,\" the spokesperson said.\n\nThe spokesperson said the Townsville local disaster management group issued updates using the nationally recognised Australian Warning System.\n\nFloodwater ripped through Ingham in the first week of February 2025. (ABC News: Baz Ruddick)\n\nDr Gurtner said findings also indicated a significant portion of people were using Facebook as their primary source of information, secondary to the Bureau of Meteorology and local council disaster dashboards.\n\n\"The problem with Facebook is we saw a lot of cases of misinformation,\" she said.\n\n\"People using photos of the 2019 floods and saying it was from this event … often they over-exaggerated the extent of the impacts.\"\n\nRecovery ongoing\n\nEstimates indicate the damage bill from the February floods to be in the vicinity of $40 to $50 million for the Hinchinbrook Shire.\n\nDeputy Mayor and recovery chair Mary Brown said the council was conducting its own surveys on preparedness.\n\nMary Brown says recovery is ongoing. (ABC News: Georgia Loney)\n\n\"It's really important to reflect on how the event progressed, what we did well out of it,\" she said.\n\n\"We're working through those results right now and trying to understand what we can learn from that and what we can do better leading into this season.\"\n\nCr Brown said recovery works were progressing, but the shire was looking at a minimum of a two-year recovery period until it transitioned into its \"new normal\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/heritage-cuttagee-bridge-replace-concrete-timber/105554548",
        "title": "Town fights to save 130yo timber bridge despite traffic hold-ups",
        "publish_date": "Fri, 01 Aug 2025 01:28:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sheena Boughen often travels over the single-lane timber bridge at Cuttagee on the New South Wales far south coast, stopping to give way to oncoming traffic.\n\n\"You have this little moment of just looking around,\" the Barragga Bay local said.\n\n\"There's a moment in time where you've got a chance to pause. You've got a chance to breathe.\"\n\nFor some, the 110-metre long Cuttagee bridge is considered tricky to manoeuvre, but most locals, like Ms Boughen, are used to its quirks.\n\nBuilt in 1892, the bridge features on a tourist drive from Bermagui south to Tathra.\n\nBut now it is nearing the end of its functional life span and could possibly be replaced with a two-lane concrete bridge next year.\n\nThe Cuttagee Bridge in the 1960s. (Supplied: Bermagui Historical Society)\n\nFor the small coastal community, the saying \"build a bridge and get over it\" is not that simple.\n\nAgeing bridge stock\n\nThe Bega Valley Shire Council — which is responsible for about 30 wooden bridges — announced in 2021 it would need to replace the aging timber structure.\n\nMayor Russell Fitzpatrick said most of the 133-year-old bridge had been renewed over time, but it could pose safety risks and be subject to further weight limits, impacting local industry and emergency service vehicles.\n\n\"We need to make sure they are safe and can be crossed at all times,\" Cr Fitzpatrick said.\n\n\" We need to make sure the school bus, when it goes across, it doesn't fall in. We need to have public safety. That's number one. And in a disaster, we need an evacuation route. \"\n\nRussell Fitzpatrick wants to see more funding for bridge restoration. (ABC South East NSW: Floss Adams)\n\nThe council is looking at three options: a single-lane hybrid concrete and timber bridge, a two-lane hybrid bridge, or a two-lane concrete bridge.\n\nMs Boughen opposed the concrete bridge option and said she was \"totally committed to keeping the slowness of the bridge\".\n\n\"We don't want to lose the character or the fabric of a timber bridge,\" she said.\n\n\"[A concrete bridge] has no identity and it doesn't embrace the magnificent setting of this place where nature really should be the dominant voice.\"\n\nThe Bega Valley Shire Council accepted a $15 million NSW government grant for the project in 2024. (ABC News)\n\nThe Cuttagee Bridge is one of five single-lane wooden bridges along a 43-kilometre stretch of the Bega Valley coastline and on the main road access for several small communities.\n\n\"Council's stuck with trying to fund a whole lot of themselves, it's not financially viable,\" Cr Fitzpatrick said.\n\nThe local council is required to preserve heritage in the new bridge design, which will be chosen after an external engineering study outlines options this year.\n\n\"You'll always have people for and against different things … what you've got to balance is what is in the best interest of the community,\" Cr Fitzpatrick said.\n\nParts of the Cuttagee Bridge have been replaced over the past century. (ABC South East NSW: Floss Adams)\n\nSheena Boughen helped start the community advocacy group \"Save Cuttagee Bridge\" in 2021 and amassed more than 14,000 online signatures over four years, supporting a one-lane timber bridge.\n\nMs Boughen also has concerns that a two-lane bridge would be unsafe in an area busy with beach users during the summer.\n\n\"As soon as you put in a two-lane road, that doesn't encourage people — or necessitate them — to stop. Speed happens, it's just unsafe,\" she said.\n\nSheena Boughen says the Cuttagee Bridge is \"iconic\" to the far south coast. (ABC South East NSW: Floss Adams)\n\nConcrete vs timber\n\nBridge designer John Hilton said there were up to 5,000 timber bridges still in use across the country, and councils were grappling with financing the \"aged bridge stock\".\n\nMr Hilton said the modern bridge industry was focused on concrete bridges and was not \"well-acquainted\" with timber anymore.\n\nThe single-lane bridge requires people to give way to oncoming traffic. (ABC South East NSW: Floss Adams)\n\n\"We're not in a position to replace all the timber bridges in Australia with new timber bridges,\" he said.\n\n\"We don't have the materials to do that. The industry's not set up for it and it would be very, very difficult and costly to get the industry set up for it.\n\n\"It's a matter of picking which bridges we're going to keep as timber and which bridges that we will replace in concrete.\"\n\nJohn Hilton says the wooden bridges are deteriorating, especially in northern NSW, which has seen harsh weather in recent years. (ABC News: Liam Patrick)\n\nMr Hilton said, despite a scarcity of good timber, he wanted to see councils \"retain a representative number\".\n\n\"The feel of timber, the smell of timber, the sound that vehicles make when they cross a timber bridge,\" he said.\n\n\"It just has some magic there.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/tour-de-france-femmes-stage-six-maeva-squiban/105600360",
        "title": "Local hero Squiban aces mountain test to win Tour de France Femmes stage six",
        "publish_date": "Fri, 01 Aug 2025 01:22:39 +0000",
        "category": "sports",
        "authors": [],
        "text": "Frenchwoman Maeva Squiban has made a solo ride to the finish line with a perfectly timed attack on the final major climb to win the mountainous stage six of the Tour de France Femmes.\n\nSquiban of UAE Team ADQ finished one minute and nine seconds ahead of compatriot Juliette Labous (FDJ-Suez) in the first French one-two in the history of the competition.\n\n\"It's an amazing feeling. I didn't expect to do that,\" Squiban told reporters after becoming the second French rider to claim a stage in the event after Cedrine Kerbaol took stage six last year.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nSquiban stayed in the peloton led by yellow jersey holder Kimberley Le Court Pienaar (AG Insurance-Soudal), as mountains classification leader Elise Chabbey (FDJ-Suez) led the arduous 10km climb to Col du Beal.\n\nThe 23-year-old broke away on the ascent to Col du Chansert and soon built a lead of over a minute and comfortably took the win in the 123.7km ride from Clermont-Ferrand to Ambert.\n\nMauritian Le Court, who won stage five, was the third to cross the finish line as she retained her lead in the general classification.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPauline Ferrand-Prevot (Visma-Lease a Bike), another home favourite, finished seventh in the stage to remain second in the race for the yellow jersey, 26 seconds behind Le Court.\n\nPoints classification leader Lorena Wiebes (SD Worx-Protime) fell back from the peloton during the first half of the stage and appeared to be content conserving her energy, as she retained the green jersey.\n\nThe Tour continues with a hilly 159.7km ride from Bourg-en-Bresse to Chambery.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/chris-woakes-injures-shoulder-in-rain-hit-day-one-of-fifth-test/105600134",
        "title": "England loses only experienced bowler on day one of India finale",
        "publish_date": "Fri, 01 Aug 2025 00:54:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "Frustrated by a defiant India last time out, England's attack has had more success on the first day of the fifth and final Test but still has work to do after the visitors closed on 6-204 at The Oval.\n\nGus Atkinson (2-31) and Josh Tongue (2-47) claimed a pair of wickets each at the Oval and on an impressive day for Atkinson on his return to the Test team, he also ran out series-leading run-maker and India captain Shubman Gill (21).\n\nBut Karun Nair's 52 not out on a rain-impacted day helped India recover from 38-2 when the wickets of Yashasvi Jaiswal (2) and KL Rahul (14) went before lunch.\n\nNair's stand was his first trip past 50 since scoring a triple century in his third Test in 2016, and was typical of India's resilience this series, which was showcased to great effect at Old Trafford last week.\n\nIndia needs to win the match to tie the series, which England leads 2-1, but the already-depleted English bowling attack suffered a blow when Chris Woakes fell awkwardly as he tried to prevent a four late in the day.\n\nThe 61-Test veteran, who also claimed the wicket of Rahul, was clearly in pain as he held his left shoulder outside the boundary.\n\nHe was treated by medical staff and left the field with his arm cradled in a makeshift sling fashioned out of his sweater.\n\nWith all-rounder and captain Ben Stokes missing due to his own shoulder injury, and pace spearheads Brydon Carse and Jofra Archer rested for this game, Woakes's injury strips England of its only bowler with more than 12 Tests under his belt.\n\n\"It doesn't look great. We haven't really spoken about it yet. I will be surprised if he takes any part in the game,\" Atkinson said.\n\nOn a rain-hit day one at The Oval, England was far more effective with the ball at the Oval than in previous games, largely thanks to Atkinson.\n\nThe fast bowler took the first and last wickets of the day — trapping Jaiswal LBW early on and it was off his ball that Dhruv Jurel (19) was caught by Harry Brook.\n\nPerhaps most impressive was his run-out of Gill, gathering the ball in his follow-through and throwing the wicket down.\n\n\"There was pressure on for the bowling side with the conditions that were overhead. We didn't want to get too far ahead of ourselves,\" Atkinson told the BBC.\n\n\"6-200, we are happy with that. An early wicket tomorrow and we will be in good position.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/justin-timberlake-diagnosed-with-lyme-disease/105599742",
        "title": "What to know about Justin Timberlake's Lyme disease diagnosis",
        "publish_date": "Fri, 01 Aug 2025 00:54:21 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Justin Timberlake has revealed he has been diagnosed with Lyme disease.\n\nIn a post on Instagram, the singer said he had been dealing with health issues during his recent world tour.\n\n\"Among other things, I've been battling some health issues, and was diagnosed with Lyme disease — which I don't say so you feel bad for me — but to shed some light on what I've been up against behind the scenes,\" he said.\n\n\"If you've experienced this disease or know someone who has — then you're aware: living with this can be relentlessly debilitating, both mentally and physically.\"\n\nLoading Instagram content\n\nTimberlake said he was shocked when he received the diagnosis.\n\n\"But, at least I could understand why I would be onstage and in a massive amount of nerve pain or, just feeling crazy fatigue or sickness.\"\n\nHis post comes after online speculation about his lacklustre performances during the final stretch of his tour.\n\nTimberlake said he was usually a pretty private person but felt compelled to share what he had been dealing with since his tour kicked off in April 2024.\n\n\"Not only did I prove my mental tenacity to myself but, I now have so many special moments with all of you that I will never forget,\" he said.\n\n\" I was reluctant to talk about this because I was always raised to keep something like this to yourself. But I am trying to be more transparent about my struggles so that they aren't misinterpreted. \"\n\nSeveral other well-known celebrities have revealed their struggles with the disease.\n\nIn 2023, the actress and granddaughter of Elvis Presley, Riley Keogh, revealed she had the disease.\n\nAmy Schumer posted on Instagram about living with the disease in 2020.\n\nIn January 2020, Justin Bieber shared a photo from 2019 that fans had speculated about, and said it was taken while he was struggling with Lyme disease.\n\nLoading Instagram content\n\nAvril Lavigne, Ben Stiller, Bella Hadid and Shania Twain have also spoken about living with the disease.\n\nWhat is Lyme disease?\n\nLyme disease is spread by ticks carrying Borrelia burgdorferi bacteria.\n\nA human can contract the disease if they are bitten by a tick carrying the bacteria.\n\nThere is no evidence that it can be spread from person to person.\n\nWhere can you get Lyme disease?\n\nIt is not likely that you will catch Lyme disease in Australia.\n\nLoading...\n\nScientists have not found Borrelia burgdorferi in Australian ticks, or any other Australian insect that could pass the disease to humans (called a vector).\n\nLyme disease is commonly found in parts of the United Kingdom, the United States and Asia, according to the Federal Department of Health.\n\nVisitors to these areas can become infected and return to Australia with the disease.\n\nWhat are the symptoms of Lyme disease?\n\nSymptoms typically appear within the first 30 days of being bitten, according to Health Direct.\n\nMost people notice a rash that appears between seven and 14 days after a tick bite.\n\nTypically, the rash is target-shaped and centred around the tick bite.\n\nThe rash may be tender, but it usually isn't itchy or painful. About eight in 10 people develop a rash.\n\nNot everybody with the disease gets a rash.\n\nIn the later stages of the disease, you may develop symptoms that affect your heart, nervous system or joints.\n\nSymptoms can include:\n\nHeadache\n\nmuscle and joint aches\n\nfever\n\nfeeling tired\n\nstiff neck\n\ntrouble concentrating\n\nHow is Lyme disease treated?\n\nIf you think you have Lyme disease, you should visit your doctor.\n\nIt can be treated with antibiotics and is diagnosed by a blood test.\n\nAlso, see your doctor if you think you have a tick and you need help or advice on removing it.\n\nWhat are the complications of Lyme disease?\n\nLyme disease has three stages.\n\nStage 1 — Early Stage\n\nStage 2 — Early Dissemination\n\nStage 3 — Late Dissemination\n\nThe symptoms experienced in each stage depend on:\n\nThe type of bacteria causing the infection\n\nWhere were you infected\n\nNeurological complications most often occur in the second stage of Lyme disease. They include:\n\nnumbness\n\npain\n\nweakness\n\nBell's palsy\n\nproblems with your eyesight\n\nmeningitis-like symptoms such as fever, stiff neck, and a bad headache\n\nSome patients can experience neurological symptoms in the weeks, months and years after a bite.\n\nThese include:\n\nFinding it hard to concentrate\n\nMemory and sleep disorders\n\nNerve damage in the arms and legs\n\nSome people believe that a form of \"chronic Lyme disease\" exists in Australia.\n\nHowever, this is a disputed diagnosis as there is a lack of supporting evidence.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/starentertainment-casino-misses-deadline-brisbane-queens-wharf/105591244",
        "title": "Star Entertainment misses deadline to offload stake in Brisbane's Queen's Wharf",
        "publish_date": "Fri, 01 Aug 2025 00:40:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Embattled casino operator Star Entertainment will be forced to pay about $41 million to overseas investors after failing to meet a deadline to offload its stake in Brisbane's Queen's Wharf development.\n\nIn a statement to the Australian Securities Exchange (ASX) on Friday morning, Star Entertainment said it had been \"unable to reach an agreement\" with its joint venture partners Chow Tai Fook Enterprises and Far East Consortium International Limited.\n\nThe Star statement said it had proposed an extension of the talks to August 6, but that was not accepted by the Hong Kong-based joint venture partners.\n\nThe heads of agreement was terminated as a result, and Star will retain its 50 per cent equity in Destination Brisbane Consortium (DBC) and Destination Gold Coast Consortium, as well as the Treasury hotel in Brisbane.\n\nIn March, Star, which operates casinos in Brisbane, the Gold Coast and Sydney, had reached an agreement with the owners of the other half of Brisbane's Queen's Wharf casino and hotel development to take over its 50 per cent stake.\n\nStar said on Wednesday the deal was \"unlikely\" to be done by July 31. (Supplied: Star Entertainment Group)\n\nIn its quarterly update posted to the ASX on Wednesday, the company flagged a deal was \"unlikely\" to go through before the July 31 deadline.\n\nThe termination of the deal means Star will have to pay their partners $10 million in proceeds from the DBC venture on top of the estimated $31 million for the payments made by the joint venture partners for their DBC equity.\n\nThe due date for the $10 million is August 6, while the larger payment for the equity must be paid by September 5.\n\nFinancial commentator Stephen Mayne said the company would likely be able to manage those repayments thanks to a $300 million injection of cash it received earlier this year from US company Bally's and major shareholder Bruce Mathieson.\n\nBut he warned Star's troubles were far from over.\n\n\"The problem is that they're losing $27 million a quarter just in an operating sense,\" he said.\n\n'Cost-cutting like never before'\n\nGriffith University Business School's Graeme Hughes said \"it's not looking good\" for Star.\n\nHe said the company's options are \"limited\" and a \"Hail Mary\" to get the joint venture partners back at the table would be front of mind for its executives.\n\n\"I would say they would be doing all that they can, even though that timeline has passed to still sit down,\" he said\n\n\"Given where everything is at, it's quite precarious. Any elongation by that consortium really is pushing things to the brink.\n\n\" They are going to have to look at immediate restructuring and cost-cutting like never before. \"\n\nGraeme Hughes says Star's options are becoming increasingly limited. (ABC News)\n\nContinued investment to finish Queen's Wharf\n\nIn addition to those short-term payments, the termination means Star will be on the hook for future contributions to DBC, estimated to be around $200 million.\n\n\"Additional equity may also be required as part of the the refinancing of the DBC debt facility which is due to expire in December,\" the statement said.\n\nThat debt facility, of which Star owns 50 per cent, has a current drawn balance of $1.4 billion.\n\nStar signs lifeline deal Photo shows An intricate golden star shape above capital letters that spell out \"The Star\" advertising a casino. Star has warned for months it could fall into administration if a financier wasn't found.\n\nStar is also facing potential penalties after a 2021 investigation by Australia's financial intelligence agency (AUSTRAC) and the New South Wales Independent Casino Commission, found it breached anti-money laundering regulations.\n\nMr Hughes said Star would have to address the \"cash burn\" of future investments in Queen's Wharf, particularly with a possible AUSTRAC penalty hanging above them.\n\n\"Whilst [AUSTRAC] are not in the business of crippling businesses, it's got a potential $400 million- esque number attached to it, and Star have indicated anything in excess of $100 million is going to create immense pressure,\" he said.\n\n\"There's concern from all corners, I certainly wouldn't like to be in the executive ranks there at the moment, I think they'd be working day and night.\"\n\nStar Entertainment said it would continue to engage with the joint partners and \"provide an update if there are any material developments regarding the parties' respective interests in DBC and DGCC\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/monash-medical-centre-black-mould-cancer/105595666",
        "title": "Major Melbourne hospital discovers black mould in cancer treatment area",
        "publish_date": "Fri, 01 Aug 2025 00:40:15 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A major hospital in Melbourne's south-east has discovered black mould in an area where cancer patients are treated.\n\nMonash Health told the ABC the mould was detected in bathrooms of two adjoining wards at the Monash Medical Centre in Clayton in June, and was caused by a leak in a wall.\n\nThe ABC understands the mould affected the haematology ward, where patients with blood disorders such as leukaemia are cared for.\n\n\"To protect patients and staff, we have installed hoarding across the affected areas to prevent access during the repair works,\" the health body said in a statement.\n\nHoarding is a type of temporary fencing.\n\n\"In addition, patients have been moved into a different area of the ward, away from the affected space and repair works.\"\n\nRepair works are now taking place, with patients moved to a different area, says Monash Health. (ABC News: Danielle Bonica)\n\nMonash Health said it had provided vulnerable patients with anti-fungal medication.\n\n\"As a standard of care, we routinely provide immunosuppressed patients with precautionary anti-yeast or anti-mould prophylaxis medication, due to their clinical risk determined by their underlying disease and intensity of treatment,\" it said.\n\n\"This practice remains ongoing to protect our patients.\"\n\nIt said the hospital had not seen a rise in fungal infections in patients in the affected area.\n\nMould outbreaks can pose serious problem for hospitals, expert says\n\nUniversity of Adelaide pharmacologist and toxicologist Dr Ian Musgrave said mould outbreaks could be a serious problem for hospitals.\n\n\"The problem with hospitals is they have lots of areas where there are good for mould to grow and mould is really hard to get rid of,\" he said.\n\nHe explained that mould doesn't just sit on the surface of an area but gets into the very material it has attached to.\n\n\"It goes into the plasterboard, into the grouting between the surfaces, you have the spores there,\" he said.\n\n\"It will be very difficult to get out because the spores are designed to be resistant to attack — it is how the mould survives.\"\n\nIn bathrooms, he said this could mean showers and other structural elements needed to be removed to get to the source of the mould outbreak.\n\nHe said the hospital had done the right thing by moving patients away from the mould outbreak, closing the area off and starting remediation work.\n\nAnd while Dr Musgrave said some people in their homes might be happy to simply clean mould away from a surface whenever an outbreak returns, in a hospital an outbreak was far more serious.\n\n\"In a hospital environment mould can kill people so you want to make sure it is not there,\" he said.\n\nThe ABC has contacted the Australian Medical Association for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/exmouth-water-desalination-plant-economic-expansion/105586174",
        "title": "Desalination plant to shore up water supplies in tourist town",
        "publish_date": "Fri, 01 Aug 2025 00:30:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "A remote West Australian town is set to host one of the state's first regional seawater desalination plants, as thousands of visitors, a growing US military presence and a warming climate increase pressure on local supplies.\n\nIt follows a lengthy investigation by the state's Water Corporation of the near-exhausted drinking water source in Exmouth, 1,230 kilometres north of Perth.\n\nAbout 3,000 residents are currently supplied with water by 34 production bores that are dependent on heavy rainfall to recharge local aquifers.\n\nExmouth's groundwater reserves are often close to capacity, according to the Water Corporation. (ABC Pilbara: Alistair Bates)\n\nThe state-run utility forecasts Exmouth will need an additional 1.5 billion litres each year by 2060, while climate modelling shows the region is likely to grow drier.\n\nThe plan has been welcomed by local government and industry groups, who are calling for a quicker turnaround to support the town's growth.\n\nAt capacity\n\nThe Water Corporation expects to complete the desalination plant in stages by 2030, pending environmental approval.\n\nIt found additional groundwater sources south of Exmouth were insufficient to meet long-term demand and put cultural sites in the Cape Range National Park at risk.\n\n\"That's why desalination is the right choice,\" said Evan Hambleton, general manager of assets, planning and delivery.\n\n\" It's a secure, climate-independent source that can be scaled over time and helps reduce reliance on groundwater supplies. \"\n\nSeasonal influxes of tourists see Exmouth's population swell. (ABC News: Bridget McArthur)\n\nExmouth's population more than doubles during the peak winter months, with an average of 150,000 tourists passing through the town annually.\n\nShire President Matthew Niikkula said the seasonal influx meant Exmouth's drinking water scheme was often operating close to capacity.\n\n\"We're seeing numbers come through Exmouth like we've never seen before,\" he said.\n\n\"It's put our infrastructure at critical bursting point for a long time.\"\n\nMatthew Niikkula says Exmouth's infrastructure is at \"critical bursting point\". (ABC News: Glyn Jones)\n\nHe argued that the Water Corporation should commit to a shorter time frame to deliver the project.\n\n\"It is an urgent need. [The] council has been heavily advocating to government that this needs to be a one to three-year solution, not a three to five-year solution,\" Cr Niikkula said.\n\n\" Exmouth really is at a precipice. \"\n\nA seawater desalination plant is hoped to support Exmouth's rapid growth. (ABC News: Alistair Bates)\n\nFuture-proofing\n\nWhile the technology has played a critical role in securing Perth's water supply, large-scale seawater desalination is a relatively new concept in regional WA.\n\nThe process has been used on a smaller scale to secure farm water supplies and restore salt-damaged land.\n\nBut a large-scale plant proposed for Albany prompted public outcry and was scrapped earlier this year.\n\nAnother plant is under construction in Onslow, four hours north of Exmouth.\n\nSteve Riley says the seawater desalination plant will help the town expand. (ABC News: Alistair Bates)\n\nExmouth Chamber of Commerce and Industry president Steve Riley welcomed the decision, which he believed primed Exmouth for expansion and sewage upgrades.\n\n\"There's no housing up and down the whole coastline,\" he said.\n\n\"We literally can't build any more houses because we're out of water.\n\n\"This [desalination plant] opens up that freedom a little bit to take those steps.\"\n\nCr Niikkula said the desalination plant was part of a suite of technologies being rolled out in Exmouth to secure its future.\n\nThe WA electricity utility Horizon Power expects to complete three-quarters of a 9.6-megawatt solar farm by mid-August.\n\nIt aims to supply up to 80 per cent of Exmouth's electricity by next year.\n\nEnvironmental fears\n\nThe burgeoning infrastructure will support a greater military presence in Exmouth, with the United States flagging its interest in the RAAF's nearby Learmonth base.\n\nThe town's secretive Harold E Holt naval communication base, jointly run by Australian and US forces, began its first major upgrade since 1967 in March.\n\nCr Niikkula, who also chairs the North-West Defence Alliance lobby group, said water shortages in Exmouth directly threatened national security.\n\n\"We just all need to make sure that we're working together to ensure that the infrastructure is in place to be able to handle whatever comes along,\" he said.\n\nA secure water future could also accommodate the area's growing military presence. (ABC News: Alistair Bates)\n\nHanging in the balance with these strategic interests, however, are serious environmental concerns.\n\nThe Water Corporation said it had identified three potential sites for the desalination plant to the north, centre, and south of the town.\n\nMr Hambleton told the ABC at least a year of further study would be undertaken to decide where to lay piping for seawater intake and outfalls.\n\nThe facility's design will mirror what is under construction in Onslow, with water about twice as saline as normal seawater pumped back out to the ocean.\n\n\"That's where a lot of work's going on at the moment — to make sure exactly how we put those in [to] minimise any sort of environmental impacts,\" Mr Hambleton said.\n\n\"Within 30 or 50 metres of where we put the seawater back … you couldn't tell the difference between what is just regular seawater and what is the brine area.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/piprahwa-gems-return-to-india-after-legal-threat/105593672",
        "title": "Ancient Buddha jewels return to India after legal threat",
        "publish_date": "Fri, 01 Aug 2025 00:11:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "A collection of ancient jewels from one of the most significant finds in the history of Buddhism has been returned to India, but questions and ethical concerns linger about the process.\n\nThe Piprahwa gems were obtained by British estate agent William Claxton Peppé in 1898 and are more than 2,000 years old.\n\nThe collection was believed to have been found with the ash and bone of the Buddha in northern India, near the border with Nepal.\n\nThe part of the haul kept by Mr Peppé was passed down through his family to his great-grandson, Chris Peppé.\n\nHe then listed the collection for sale with Sotheby's auction house in Hong Kong this year, telling the BBC in May he felt it was the \"fairest and most transparent way\" to return the relics to Buddhists.\n\nIndia threatens legal action over sale of ancient jewels Photo shows Dozens of sparkling jewls sit against a blue and black background arranged in circles Sotheby's has postponed its sale of jewels linked to the physical remains of the Buddha after a legal threat from India and moral questions about the sale of religious antiquities.\n\nThe public auction prompted New Delhi to threaten legal action to prevent the sale going ahead, arguing it violated \"Indian and international laws as well as UN conventions\".\n\nThe auction house then entered negotiations with the Indian government.\n\nOn Wednesday, local time, Indian Prime Minister Narendra Modi announced the 349 jewels had been returned to India.\n\n\"These sacred relics highlight India's close association with Bhagwan Buddha and his noble teachings,\" Mr Modi said on X.\n\n\" It also illustrates our commitment to preserving and protecting different aspects of our glorious culture. \"\n\nThe buyer was Indian industrialist, Pirojsha Godrej, executive vice chair of consumer goods giant Godrej Industries Group.\n\nMr Godrej said in a statement the gems were \"not just artefacts\" but \"symbols of peace, compassion, and the shared heritage of humanity\".\n\nThe Godrej family is one of India's wealthiest, with Forbes estimating its net worth at $US16.7 billion ($25.8b) in 2023.\n\nA selection of the Piprahwa gems on sale at Sotheby's earlier this year. (Supplied: Sotheby's)\n\nCulture Minister Gajendra Singh Shekhawat was reported as describing the arrangement as \"an exemplary case of public-private partnership\".\n\n\"This is one of the most significant instances of repatriation of our lost heritage,\" Mr Shekhawat said.\n\nColonialism 'gift that keeps on giving'\n\nAshley Thompson, the chair of South-East Asian art history at SOAS University of London, welcomed the return of the gems to India, but questioned the process.\n\n\"How different is such a transaction from that originally envisaged by Sotheby's and the Peppé family?\" Professor Thompson told the ABC.\n\n\"Should ex-colonised countries be required to purchase their own heritage taken from them in colonial contexts? Should Buddha relics be bought at all?\n\n\" In the end, with the Piprahwa case, it appears that colonialism is truly the gift that keeps on giving. \"\n\nThe value of the transaction was not disclosed, but some estimated the collection to be worth $20 million at the time of its initial auction.\n\nIn a statement, Sotheby's said it was \"delighted to have facilitated the return of the Piprahwa gems to India\".\n\nThe Peppé family's collection of Piprawha gems are back in India for the first time since they were unearthed 127 years ago. (X: @narendramodi)\n\nAt the time the haul was unearthed, the British colonial government took ownership of it and gave it to the king of modern-day Thailand.\n\nHe then gave parts of the collection as gifts to other countries, including Myanmar and Sri Lanka, where they continue to be venerated.\n\nWilliam Claxton Peppé was allowed to keep a fifth of the total collection.\n\nProfessor Thompson said she looked forward to seeing how the Indian government might collaborate with other Buddhist communities around Asia to care for the relics.\n\n\"There is a window here for developing new models of equitable custodianship of shared heritage which would surpass national borders and the associated models of ownership which so frequently provoke conflict,\" she said.\n\nThe Indian Express reported that a portion of the gems would be on loan to the National Museum for five years, and that Godrej Industries had agreed to display the entire collection upon its arrival in India for three months.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/afl-adelaide-crows-player-isaac-cumming-100th-game-hawthorn/105568904",
        "title": "Crows' Isaac Cumming to mark 100 games alongside childhood idol",
        "publish_date": "Thu, 31 Jul 2025 23:56:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Running out for his 100th game at a packed Adelaide Oval against Hawthorn tonight will be a \"surreal\" moment for Isaac Cumming — better known to his mates as \"Cheese\".\n\nMaking the moment even more special, he will be there alongside his childhood idol Taylor \"Tex\" Walker, who is now his Adelaide Crows teammate.\n\nIt is a far cry from Broken Hill's Picton Oval, where he trained with Walker as a 14-year-old during the older Crows player's off-season break.\n\nTaylor Walker (left) and Isaac Cumming both grew up playing for the North Broken Hill Bulldogs. (Supplied: AFC Media)\n\n\"He's been massive, that sort of mentorship slash idolism stems back a long, long way,\" Cumming said.\n\nIt was \"always a dream\" to play in the AFL, and the now 26-year-old wingman is one of four players from the outback mining city to make it to 100 games.\n\nCumming will also join the likes of former Essendon Bombers premiership player Dean Solomon, and former West Coast Eagles and Brisbane Lions player Brent Staker.\n\nAdelaide signals its arrival as a genuine AFL flag contender Photo shows Jordan Dawson holds his arms out to his side with another man placing a hand on his head and shoulder Adelaide has soared into premiership contention as one of the in-form teams late in the AFL season. Winning seven of their last eight games, the Crows are perfectly placed for a September charge.\n\n\"It's an honour to be mentioned in the same conversation as some of those guys,\" he said.\n\n\"They've achieved a lot more in the game than I have.\"\n\nCumming would prefer the attention to be on the Crows' match with Hawthorn, rather than his 100th.\n\n\"Everyone's focus is just going to be on a nice team win and not individual milestones, which is the way I like it,\" he said.\n\nBut he did admit it was \"pretty cool\" to see how far he had come.\n\n\"There's a lot of people that helped me get here, which I'm super grateful for,\" Cumming said.\n\nBig things from little things grow\n\nCumming always hoped to play professionally, but it was not until the age of 18 that he thought it might be a real possibility.\n\nSome of Isaac Cumming's favourite memories are playing in the blue and white for North Broken Hill. (Supplied: Melissa Cumming)\n\nDrafted by the GWS Giants at pick 20 in the 2016 draft, it has not been a straightforward route to the 100-game milestone.\n\nCumming played just 10 games in his first five seasons.\n\n\"I was a pretty raw kid … [I had] to put on a lot of weight and actually be able to run out a game of footy, which took a few pre-seasons to do,\" he said.\n\nBut that hard work has paid off, and he has played 90 games in the last five seasons.\n\n'Memorable and special'\n\nCumming will have support from home at tonight's game, with his family travelling from Broken Hill to witness his milestone.\n\nHis father Brett Cumming, who has not missed a single Crows home game this season, said it would be \"something memorable and special.\"\n\n\"I may or may not hold it together,\" he admitted, adding he \"might need a beach towel\" to mop up the torrent of tears he expected to shed.\n\nAnd in Far West NSW, friends and former teammates will cheer on the man they call \"Cheese\" at North Broken Hill Football Club.\n\nIt is a place of special memories for the milestone man.\n\n\"Some of my favourite nights I've ever had is just being at the footy club on a Saturday night,\" Cumming said.\n\n\"Getting around those old boys like Jayden Kelly, Matt Garrick, Bolace, Cody Howard … those are guys I've looked up to since I was 10 to 11 years old.\"\n\nAmong those driving down to cheer Cumming on will be childhood friend and former teammate Nash Mitchell.\n\nIsaac Cumming (left) and Nash Mitchell as teenagers tackling a South Broken Hill player. (Supplied)\n\n\"To achieve 100 games ... [is] a great achievement,\" he said.\n\nIt did not surprise Mr Mitchell to hear his friend had deflected attention away from his 100th game and onto a team win.\n\n\"It's never about him, he's so humble,\" he said.\n\n\"He's a very caring friend off the field and, yeah, he looks after his teammates on the field as well.\n\n\"Growing up, he was a captain of most of our teams, and you can tell through his personality.\"\n\nAs for Brett Cumming, while he is looking forward to celebrating his son's milestone, he is more proud of the man the 26-year-old has become.\n\n\"I'm more proud of who he is than what he does,\" he said.\n\n\"[Despite] being involved in that professional sport level, he hasn't lost sight of who he is and where he comes from.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/youtube-social-media-ban-backflip-analysis/105590400",
        "title": "Government backflip on YouTube social media ban is one of Olympic proportions",
        "publish_date": "Thu, 31 Jul 2025 23:44:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "As any gymnast will tell you, it's not easy landing a backflip, and as any politician will tell you, a political backflip is harder again.\n\nIt's also less likely that people will applaud you when you land, even if you nail it.\n\nThe government's announcement this week that YouTube would be included in the teen social media ban is a political backflip of Olympic proportions, and its first since the election.\n\nIn late April, the then-minister for communications, Michelle Rowland, was still doubling down on her commitment to the company's CEO to do the exact opposite, citing YouTube's educational benefits and community expectations, but little else.\n\nGovernment's mixed messaging on YouTube Photo shows Woman on computer, generic The federal government has doubled down on its decision to give YouTube a carve-out from the teen social media ban, despite privately assuring rival platforms that \"no final decisions\" have been made, the ABC can reveal.\n\nA spokesperson for Ms Rowland told the ABC in April the decision \"was made in November last year, publicly stated in a media release and reflected in the second reading of the legislation\".\n\n\"That decision has been made and there has been zero reconsideration or communication to suggest otherwise,\" the spokesperson said.\n\nThree months on, the new minister, Annika Wells, is just as resolute that YouTube will in fact be part of the ban, citing strongly worded advice from the eSafety Commissioner Julie Inman Grant in late June.\n\nNew communications minister Anika Wells is adamant YouTube will in fact be part of the ban, despite what her predecessor said three months ago. (ABC News: Adam Kennedy)\n\n\"The eSafety Commissioner's advice was clear,\" Ms Wells told Question Time in Parliament on Wednesday.\n\n\"Four out of 10 Australian kids have had their most recent or most harmful experience on YouTube,\" she said.\n\n\"On top of that, YouTube uses the same persuasive design features as other social media platforms like infinite scroll… auto-play and algorithmic feeds.\"\n\nLabor won't be 'intimidated' out of banning YouTube for under 16s Photo shows A smartphone with the YouTube logo, with the website in the background behind it. The prime minister vows not to be intimidated by Google, as the tech giant threatens to sue over the government's decision to ban YouTube for children under 16.\n\nDespite the famed difficulty of publicly changing your mind in politics, the government seems to have pulled off the manoeuvre with a surprising amount of grace.\n\nIt could have been a more awkward landing if their final position was less well supported by the eSafety Commissioner, policy experts, and the well-documented harm being visited upon younger YouTube users.\n\nAdditionally, the fact Ms Rowland had said so little about her reasons for promising YouTube a carve out in the first place means Labor now finds itself with relatively few words to eat.\n\nBut no landing is perfect.\n\nAt their media conference on Wednesday morning, Ms Wells and Prime Minister Anthony Albanese were asked what might be the biggest question of all on social media policy, by a somewhat frustrated Mark Riley from Seven News:\n\n\"Parents will be hearing this and thinking it's a great thing to limit kids' access to this harmful content, but they'll also be asking, 'why is that harmful content there in the first place?' If any of us in our media organisations were to publish or broadcast this stuff, we'd be straight up in front of ACMA or the courts, justifiably. When will the day come when governments can stop these organisations allowing this stuff to be posted in the first place?\"\n\n\"That's a great question, Mark,\" Ms Wells began, displaying immaculate technique for the judges. \"… and ultimately one for the social media platforms to answer,\" she continued.\n\nLoading...\n\nUsually, thrusting responsibility solely back into the hands of social media giants is not a bad political instinct.\n\nBut to do so at a press conference otherwise devoted to \"cracking down\" on those same companies is a different kind of gymnastics — it's contortion.\n\nAfter all, the teen social media ban depends on the assumption that the government can force social media companies to change their dealings with Australians, and that asking nicely won't achieve the desired result.\n\nSo when faced with the question: \"Why is the harmful content there at all and when will governments intervene?\", it was arguably the perfect moment for the new minister to mention the government's own plan, announced in November last year, to implement a Digital Duty of Care on social media companies.\n\nWill it materialise?\n\nThe Digital Duty of Care is designed to place an obligation on social media companies themselves to actively prevent foreseeable harms to Australian users of all ages.\n\nLaunching the policy eight months ago, Ms Rowland described it as \"a shift away from reacting to harms…. and moving towards systems-based prevention\".\n\nIt was one of more than 60 recommendations made by Delia Rickard after a year-long statutory review of the Online Safety Act.\n\nBut unlike the teen social media ban, it has rarely been mentioned in public since it was first announced.\n\nLoading...\n\nThe government's reticence on the proposal this year has prompted quiet speculation among policy experts that it would never materialise, but Ms Wells told the ABC the government was still committed to legislating the change.\n\n\"I'm looking forward to doing more work on it,\" Ms Wells told 7:30 this week, before adding: \"I'm still a new minister\".\n\nNeither Ms Wells nor her predecessor have given a timeline for implementing the change.\n\nThe government is also yet to reveal when it will respond to the rest of Delia Rickard's recommendations.\n\nAs for why the minister opted not to mention the government's own policy when the opportunity came on Wednesday morning, it's worth remembering how tricky these political backflips can be.\n\nBringing up an eight-month-old plan that hasn't visibly progressed since it was first announced comes with its own risks.\n\nWith a new minister in the portfolio and less than three months before the teen social media ban comes into effect, it might be a while still before the government is eager to broach the topic unprompted.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/donald-trump-signs-tariff-policy-order/105588612",
        "title": "Trump reveals new tariffs to hit dozens of countries in seven days",
        "publish_date": "Thu, 31 Jul 2025 23:25:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump has unveiled new tariffs for dozens of countries — but Australia has been spared, for now.\n\nThe \"baseline\" tariff on Australian exports remains unchanged, at 10 per cent, despite the president's recent suggestion he would increase it.\n\nBut Mr Trump has ordered changes to the \"reciprocal\" tariffs on dozens of countries, which have been paused since April but were set to take effect on Friday.\n\nTrade Minister Don Farrell said the unchanged baseline tariff combined with higher levies on other countries would give Australia a competitive advantage in the US.\n\n\"We will assist all of our exporters in ensuring we take advantage of this situation and increase the volume of exports,\" Senator Farrell said.\n\nHe said Australia would continue to argue to be exempt from tariffs. \"We do not want to leave the issue here. We believe in free and fair trade.\"\n\nThe new reciprocal tariffs on US trading partners will apply from August 7.\n\n\"The president has determined that it is necessary and appropriate to modify the reciprocal tariff rates for certain countries,\" a White House statement said.\n\nIt said some countries had agreed to meaningful deals, but others had offered insufficient terms or not negotiated at all.\n\nUnder the new order, the hardest hit countries are Syria (41 per cent), Myanmar (40 per cent), Laos (40 per cent) and Switzerland (39 per cent).\n\nA separate order has hiked the tariff on Canadian products from 25 per cent to 35 per cent.\n\nThe White House said that was because Canada had \"failed to cooperate in curbing the ongoing flood of fentanyl and other illicit drugs\".\n\nEarlier, Mr Trump said Canada's decision to recognise a Palestinian state would \"make it very hard for us to make a trade deal with them\".\n\nIn recent days, the US has announced agreements with the UK, the EU and six Asian nations, which will all be subject to tariffs between 10-20 per cent.\n\nAustralia watching for movement\n\nSince April, Australia's exports to the US have been subject to the 10 per cent \"baseline\" tariff — the minimum placed on trading partners.\n\nMr Trump recently suggested the baseline tariff could increase to 15 or 20 per cent.\n\nAustralia may no longer be Trump's least badly treated friend Under Donald Trump's tariff program, Australia appeared to be one of America's least badly treated friends. But, without a new deal, the president's latest idea would change that.\n\n\"We're going to be setting a tariff for, essentially, the rest of the world,\" he said on Monday.\n\n\"That's what they're going to pay if they want to do business in the United States, because you can't sit down and make 200 deals.\"\n\nAsked about the baseline tariff on Thursday, White House spokeswoman Karoline Leavitt said: \"I won't get ahead of the president on that baseline announcement.\"\n\nBut the White House later confirmed the baseline tariff was not immediately changing, meaning the tariff on Australian products remains at 10 per cent for now.\n\nNew Zealand was not so lucky. It has been hit with a 15 per cent tariff, up from 10 per cent.\n\n“We’re getting some pretty urgent advice now,\" New Zealand Trade Minister Todd McClay told Radio New Zealand.\n\nThe Australian government says any tariff on Australian exports is unjustified. It has been pushing for their removal in line with the two nations' free trade agreement.\n\nTracking Trump's tariffs \"Reciprocal\" tariffs: Country-specific tariffs between 11-50pc were imposed in April, then paused. Some have now been modified. They are due to take effect on August 7. \"Fentanyl\" tariffs: 25pc tariffs on Canada and Mexico have been in place since March, with some exemptions. The tariff on Canadian goods is increasing to 35pc. China tariffs: A 145pc tariff on Chinese imports has been paused until mid-August. For now, minimum 30pc tariffs apply, with some exemptions. Sector-specific tariffs: Steel, aluminium and (from August 1) copper products have 50pc tariffs. Imported cars and parts have 25pc tariffs. Deals: The US say it has made deals with at least eight trading partners, including the UK, EU and six Asian nations. They include tariffs of 10-20pc. \"Baseline\" tariff: Almost all other imports, including those from Australia, are subject to the 10pc \"baseline\" tariff. Donald Trump has suggested it could rise to 15-20pc, but it remains unchanged for now.\n\nTariffs under legal cloud\n\nMr Trump has used an economic emergency law to implement the tariffs.\n\nThat was ruled unlawful by the US Court of International Trade in May, but an appeals court temporarily paused that ruling a day later.\n\nOn Thursday, the US Federal Circuit appeal court's judges pressed White House lawyers to explain how the law gave the president the power to impose tariffs.\n\nTrump makes deal with South Korea but slaps India with 25pc tariff Photo shows rows of white cars parked behind nose to tail. a man in green high vis vest walks alongside. South Korean imports into the United States will attract a 15 per cent tariff but Donald Trump says he will impose a 25 per cent tariff on Indian goods from August 1.\n\nThe 1977 law, called the International Emergency Economic Powers Act (IEEPA), has historically been used to sanction enemies or freeze their assets. It was invoked during the Iran hostage crisis and after the September 11 attacks.\n\n\"IEEPA doesn't even mention the word 'tariffs' anywhere,\" Circuit Judge Jimmie Reyna said, in a sign of the panel's apparent incredulity to a government lawyers arguments.\n\nBrett Shumate, representing the Trump administration, acknowledged \"no president has ever read IEEPA this way\" but argued it was nonetheless lawful.\n\nHe said the IEEPA authorises tariffs because it allows a president to \"regulate\" imports in a crisis.\n\nThe 11-judge panel has not said when it will rule on the issue.\n\nMexico on pause, Brazil punished\n\nAs the Friday deadline approached, Mr Trump spoke with Mexican President Claudia Sheinbaum and said they agreed to keep a pause on any new tariffs in place.\n\nThat means Mexico has avoided a tariff increase from 25 per cent to 30 per cent.\n\nMr Trump said the countries would look to reach a trade deal within the next 90 days, despite saying earlier that the deadline would not be moved.\n\nOn Wednesday, Mr Trump hit Brazil with a steep 50 per cent tariff as he escalated a fight over the prosecution of his friend, former president Jair Bolsonaro.\n\nBut he softened the blow by excluding sectors such as aircraft, energy and orange juice from the tariff increase. He also delayed its implementation from Friday to August 6.\n\nBrazilian President Luiz Inacio Lula da Silva said he would defend \"the sovereignty of the Brazilian people in the face of measures announced by the president of the United States\".\n\nABC/wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-01/tasmania-marinus-deal-signed/105599792",
        "title": "Tasmania signs Marinus Link deal, energy minister confirms",
        "publish_date": "Thu, 31 Jul 2025 23:14:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tasmanian Energy Minister Nick Duigan has confirmed the state has signed up to the multi-billion-dollar Marinus Link project.\n\nSpeaking to ABC Radio Hobart on Friday morning, Mr Duigan said he signed a new deal with the federal government on Thursday night.\n\n\"I'm very pleased to say that as of last night I was able to sign that new deal having received advice and that has resulted in a significantly better deal for Tasmania,\" he said.\n\n\"This is a massive deal for Tasmania, our future energy security, our energy supply — but also the Tasmanian bottom line and prosperity for our state.\"\n\nLoading...\n\nThe Marinus project will see a second underwater electricity cable and transmission line built in the Bass Strait between Victoria and Tasmania.\n\nIt is designed to give the mainland greater reciprocal access to Tasmania's renewable energy resources.\n\nLabor call out 'sham consultation'\n\nThe state government has yet to release the business case for the project, but has indicated it will be released on Friday afternoon.\n\nEarlier in the year, the government promised to release it 30 days before a final investment decision.\n\nSpeaking on Friday morning, Labor leader Dean Winter said this entire week had been a \"sham consultation\".\n\n\"A sham consultation with the parliament and a sham consultation with the Tasmanian people,\" Mr Winter said.\n\nThe Marinus Link will be a second underwater electricity cable and transmission line between Victoria and Tasmania. (Supplied: Marinus Link)\n\n\"Tasmanians aren't going to have confidence in this project until [Tasmanian premier] Jeremy Rockliff releases the business case in full, so people can see what's in it.\"\n\nMr Winter said he and other members of parliament were told they could not publicly discuss information in the business case, when they were briefed on it earlier this week.\n\n\"There are opportunities in this deal and there are risks and Tasmanians deserve to be aware of what they are,\" he said.\n\n\"There are risks around our major industrials and their ongoing viability. There are opportunities in terms of building new renewable energy.\"\n\nLabor leader Dean Winter is urging the government to release the business case. (ABC News: By Paul Verne)\n\nMr Duigan said the government had not released the business case yet because it was engaged in a \"hard-nosed negotiation\" with the Commonwealth.\n\n\"[The business case] contains some pretty sensitive information around the Tasmanian energy landscape and Tasmanian energy businesses,\" he said.\n\n\"We have been fighting tooth and nail to keep that information out of the hands of the people who we are negotiating with.\"\n\nCaretaker period causes confusion\n\nThe decision to sign onto the project comes while the Tasmanian government is in caretaker period, almost two weeks after a state election in which no party has yet formed a new government.\n\nThe project will give the mainland greater reciprocal access to Tasmania's renewable energy resources. (Supplied: Marinus Link)\n\nPremier Jeremy Rockliff previously said the government would require Labor leader Dean Winter to sign off on the deal while in the caretaker period.\n\nThe government presented Labor and the crossbench with thousands of pages of detailed documentation, including modelling and legal advice, before the premier gave Labor fewer than 24 hours to make a decision.\n\nThe process was described as a \"sham\" and \"document dump\" by crossbenchers while Labor ignored the deadline and refuted the claim they were required to sign off on the deal.\n\nThe premier said he would seek further advice, ahead of the government ultimately signing the deal.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-08-01/kimberley-pastoralist-wants-more-accessible-flood-relief/105590402",
        "title": "Pastoralist hit by worst WA flood says aid application a full-time job",
        "publish_date": "Thu, 31 Jul 2025 23:01:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "A pastoralist affected by Western Australia's worst-ever flood is calling for better access to government aid following a long and challenging application process.\n\nEx-Tropical Cyclone Ellie brought catastrophic flooding to the Fitzroy River in January 2023, tearing through Kimberley pastoral properties and destroying infrastructure.\n\nCamille McClymont (nee Camp) was assistant manager at Kalyeeda when the flood hit. (ABC Rural: Courtney Fowler)\n\nFourth-generation stockwoman Camille McClymont said she remembered seeing cattle being swept through a river that had swallowed the airstrip at her family's station, Kalyeeda, 220 kilometres south-east of Derby on the edge of the Great Sandy Desert.\n\n\"I've lived in the Kimberley my whole life, my dad's been here for most of his life, and we'd never seen floods like this,\" she said.\n\n\" Within a couple of hours, our homestead was an island. \"\n\nWorkers hurried to move cattle, but the station lost several hundred head, along with fencing, trailers, a water tank, and the airstrip.\n\nKalyeeda Station suffered stock losses and infrastructure damage in the 2023 floods. (Supplied: Kalyeeda Station)\n\nRecovery efforts were extensive and included hiring two additional workers to rebuild fences.\n\nBut, the most significant cost and highest priority, given the remoteness of the station, quickly became clear: building a new airstrip.\n\nFor this, the station was facing a bill of up to $80,000.\n\nFlood recovery grants\n\nIn the aftermath of the flood, the state government offered financial assistance to those affected through a range of programs and grants.\n\nHowever, one of the first difficulties those at Kalyeeda faced was working out which grant they would be eligible for.\n\nThen came the challenges of submitting the correct paperwork, meeting tight deadlines, waiting for approval, and navigating the ongoing back-and-forth with bureaucrats.\n\nPastoral stations in the Central Kimberley like Kalyeeda were inundated. (Supplied: Camille McClymont)\n\nMs McClymont said a staff member worked full-time just to apply for support.\n\n\"For a family-owned business, it made it hard because we had to keep operating … whilst waiting for that funding,\" she said.\n\n\"If we didn't have this lady who got us the grant through hard work, I don't know if we would have persevered with it because it was so time-consuming.\n\n\"There were definitely points when it looked like we weren't going to get it and if she hadn't persevered, we wouldn't have.\"\n\nDespite the challenges of the application process, Ms McClymont said Kalyeeda was grateful to receive funding, which allowed it to build a new airstrip in October 2024.\n\nBut she hoped if similar situations arose in the future, pastoralists seeking government support would be better assisted.\n\nKalyeeda Station suffered damaged fences, sheds and a destroyed airstrip in the floods. (Supplied: Camille McClymont)\n\n'Onerous' application process\n\nAbout 50 pastoral leases were impacted by the floods in 2023, Minister for Agriculture and Food Jackie Jarvis told WA's parliament in June.\n\nKimberley Pilbara Cattlemen's Association (KPCA) chief executive Bron Christensen said the consequences were \"substantial\", with some stations losing up to 1,000 head of cattle.\n\nBron Christensen says the 2023 floods had a devastating impact on WA cattle stations. (ABC News: Alys Marshall)\n\nShe said flood-affected pastoralists needed \"a fair bit of dedication\" to successfully apply for government grants.\n\n\"The feedback at the time was some of the application process was quite onerous, which I think any sort of assistance program really needs to be,\" Ms Christensen said.\n\n\"But when you couple that with the devastation they're facing and then try and address all of that while they're trying to get back on their feet … it can always be quite onerous.\"\n\nA state government spokesperson said funding had been provided to KPCA to engage an industry recovery officer to work with and support pastoralists.\n\n\"A review of the Primary Producer Recovery Grants Program will be conducted, in line with all Commonwealth and State recovery program requirements,\" they said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/and-just-like-that-recap-justice-for-steve-20250729-p5mio9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "And Just Like That recap: Justice for Steve!",
        "publish_date": "Fri, 01 Aug 2025 12:30:00 +1000",
        "category": "finance",
        "authors": [
            "Brodie Lancaster"
        ],
        "text": "This story contains spoilers for season three, episode 10 of And Just Like That...\n\nI woke up today excited to watch a new episode of And Just Like That... – something that hasn’t happened in almost four years. It’s been a long road, but here we are! Carrie’s going out at night and pashing someone hot! Praise be to The Woman.\n\nAlso: STEVE’S BACK. God, they really had me thinking he’d been put out to pasture (aka Coney Island).\n\n“MIRANDA??” David Eigenberg returns to And Just Like That. Credit: HBO Max\n\nBrady’s got his parents together to tell them he’s both going to culinary school – he’s been inspired by The Bear and falls asleep with Anthony Bourdain’s memoir on his chest – and going to be a dad. He got a girl pregnant, and she’s too far along to have an abortion.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/alex-noble-i-fight-you-fight-20250801-p5mjkk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alex Noble: 'I fight, you fight'",
        "publish_date": "Fri, 01 Aug 2025 12:28:41 +1000",
        "category": "sports",
        "authors": [],
        "text": "Alex Noble: 'I fight, you fight'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/we-have-a-bit-of-money-bulldogs-reveal-they-are-prepared-to-splash-the-cash-on-silvagni-20250801-p5mjiy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We have a bit of money’: Bulldogs reveal they are prepared to splash the cash on Silvagni",
        "publish_date": "Fri, 01 Aug 2025 12:20:45 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Western Bulldogs football boss Matthew Egan says Jack Silvagni is a tremendous talent, and the club has room in its salary cap to pursue the Carlton defender.\n\nSilvagni, 27, is weighing up a four-year offer from the Blues, but has met with Collingwood coach Craig McRae about a possible move to the Magpies.\n\nPlenty to ponder: Jack Silvagni is weighing up where to play next season. Credit: Getty Images\n\nThis masthead revealed on Wednesday that the Bulldogs had emerged as another potential suitor, and Egan confirmed their interest.\n\nHe said Silvagni’s excellent job on Aaron Naughton in round three, when the Bulldogs’ star was held to a late goal in an eight-point win, had not gone unnoticed.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/i-m-no-he-man-but-i-m-more-useful-than-those-muscly-posers-any-day-20250725-p5mhsd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m no he-man, but I’m more useful than those muscly posers any day",
        "publish_date": "Fri, 01 Aug 2025 12:15:19 +1000",
        "category": "lifestyle",
        "authors": [
            "Anson Cameron"
        ],
        "text": "I haven’t entered a gym since the last millennium, when an instructor took my shilling and promised to turn me into a he-man. At least, I thought he said “he-man”. He might have said “human”. Anyway, I got no closer to becoming a he-man than I did to becoming emperor of China. This failure has rankled. And I blame him.\n\nLately, gyms have emigrated from shopping centres and high streets to light industrial zones alongside car wreckers, chemical storage facilities and bikie HQs. You see muscled fellows wearing wisp singlets plodding along the backstreets like the strongest, simplest superhero in any franchise – the Hulk, the Thing – the type of erratic champion needing close and constant instruction from the mastermind of the gang lest he accidentally break North America.\n\nCredit: Robin Cowcher\n\nA whiff of the underworld accompanies bodybuilding for me. Is it the thuggishness muscle implies? The fact it can be turned so readily to standover work? Or the fact bikies and crime bosses have recently got so massive? Watching a cop trying to cuff a Coffin Cheater these days is like watching a toddler attempt a Rubik’s Cube.\n\nMaybe muscle gym membership should come with an ankle tracker. One of those devices parolees wear so they can’t slip down to the pub on Tuesday arvo, slurp daytime beers and slide back into the life. You want the Gold Class membership that comes with caramel flavoured “protein shakes”? OK, put this anklet on and surrender your passport.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/the-ultimate-comfort-food-julia-busuttil-nishimura-s-bean-porcini-and-pasta-soup-20250729-p5mik3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The ultimate comfort food’: Julia Busuttil Nishimura’s bean, porcini and pasta soup",
        "publish_date": "Fri, 01 Aug 2025 12:08:33 +1000",
        "category": "lifestyle",
        "authors": [
            "Julia Busuttil Nishimura"
        ],
        "text": "Finish the soup with a drizzle of good-quality extra virgin olive oil. William Meppem\n\nFor me, beans or chickpeas cooked in broth with pasta is the ultimate comfort food. Here, tinned borlotti beans are met with a broth made from soaking dried porcini, which creates an earthy and warming dish. I’ve used fresh bay leaves, but a sprig of rosemary would be a lovely addition, too. A short pasta shape is best to use so you get some with each spoonful. Don’t skip the drizzle of good-quality extra virgin olive oil at the very end; it makes the dish.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/famous-names-and-exciting-prospects-we-name-the-top-25-prospects-for-this-year-s-afl-draft-20250728-p5migh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Famous names and exciting prospects: We name the top 25 prospects for this year’s AFL draft",
        "publish_date": "Fri, 01 Aug 2025 12:08:05 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Willem Duursma is the younger brother of Xavier (Essendon), Yasmin (Carlton AFLW), and Zane (North Melbourne). Credit: AFL Photos Gippsland Power/Victoria Country\n\nMidfielder/defender, 191cm, 21/6/2006\n\nU18 champs stats (avg): 24.3 disposals, 13.5 uncontested possessions, 2 clearances\n\n2025 All-Australian The latest AFL/W prospect from the Duursma clan – behind Xavier, Yasmin and Zane – is arguably the most talented player in this class. Duursma tends to take too many risky kicks, but that is purely about decision-making because he is technically excellent, which is why he regularly took kick-in duties for Country. Some recruiters see Duursma’s bold play as another tick rather than a red flag, but would like to see his contested game improve. He saved his best for last at the championships, producing a 27-disposal effort against Vic Metro before impressing for Casey last weekend, too. Duursma is in the No.1 mix, but not everyone has him in the top five. 3. Daniel Annable\n\nBrisbane Lions Academy/Allies\n\nMidfielder, 184cm, 5/4/2007\n\nU18 champs stats (avg): 24.8 disposals, 4.3 clearances, 5.5 inside 50s\n\n2025 All-Australian Daniel Annable playing in the Marsh AFL National Academy boys match between Australia U18 and Richmond VFL in April. Credit: via Getty Images It speaks volumes for how bulletproof Annable is as a prospect that he was not as efficient as usual with his kicking at the championships, but still finished just one vote behind Dyson Sharp for this year’s Larke Medal. The expectation is he will step straight into the Lions’ senior side next year and help them immediately, just like Will Ashcroft before him. His 28-touch, four-clearance performance in the VFL last weekend only confirmed those suspicions. Annable rarely fumbles, and makes quick decisions in congestion, where his handballing, in particular, releases teammates and creates scoring opportunities. Some even see a bit of Simon Black in him. 4. Cooper Duff-Tytler\n\nLoading Calder Cannons/Victoria Metro\n\nRuckman/forward, 200cm, 22/8/2007\n\nU18 champs stats (avg): 14.5 disposals, 4 marks, 0.8 goals\n\n2025 All-Australian The upside is tantalising with Duff-Tytler, whose athleticism and follow-up work remind scouts of Fremantle star Luke Jackson. His running goal from barely inside 50, off a handball receive, against Oakleigh in the opening round of the Talent League was one such example. There are some doubts that Duff-Tytler can be a No.1 ruckman in the AFL, given his relative lack of height and queries on his ruck craft. However, there is confidence he can be highly valuable as a forward-ruck, if that was how his career panned out. Duff-Tytler took some strong contested marks in the championships and has good skills for a big man. 5. Harry Dean Murray Bushrangers/Victoria Country\n\nDefender, 193cm, 13/11/2007\n\nU18 champs stats (avg): 15.3 disposals, 3.5 intercept marks, 7.8 intercept possessions\n\n2025 All-Australian\n\nThe son of dual Carlton premiership backman Peter is set to continue the family’s legacy at the Blues. He will eventually be a wonderful complement to Jacob Weitering down back with his intercepting skills, athleticism, competitiveness, aggression, skill and composure. The consensus was that Dean would be viewed as a top-15 pick by the end of the championships – but that prediction sold him short. The standout defender in this year’s crop is considered a top-10 lock now, and many rate him even higher. Dean’s height means he is less likely to be an option on the Sam Darcys and Riley Thilthorpes of the league, but he projects as a gun No.2 defender. 6. Dylan Patterson Gold Coast Suns Academy/Allies\n\nDefender/wingman, 183cm, 1/9/2007\n\nU18 champs stats (avg): 19.8 disposals, 5 rebound 50s, 400 metres gained\n\n2025 All-Australian There is no one more exciting in this class than Patterson, whose brilliant goose step is a nod to his rugby league background. He is a triumph for the AFL’s northern academies, given several NRL-aligned clubs were desperate for his signature by the time he turned 15. He has difference-making speed, loves taking opponents on, is always trying to create something, and has even drawn Andrew McLeod comparisons for the way he moves. Patterson’s decision-making needs work, and he can fade in and out of games, but he should be a serious weapon for Gold Coast for a very long time. This ranking might be too conservative.\n\n7. Dyson Sharp Central District/South Australia\n\nMidfielder, 188cm, 23/5/2007\n\nU18 champs stats (avg): 27 disposals, 3.3 centre clearances, 6.5 inside 50s\n\n2025 All-Australian (captain) Sharp has silenced critics who once considered him just a “man-child”. The powerful onballer was outstanding in trial games pre-championships, and went on to dominate throughout the carnival to win the Larke Medal and stamp himself as a top-10 selection. Sharp is physical and competitive in the contest, wins centre clearances for fun – in part thanks to his high football IQ – has underrated burst with his first few steps out of stoppages, and is more athletic than some gave him credit for. He can rush at times and not be as clean with his disposals, but that is common with inside midfielders, given the job description. Sharp is also highly regarded for his leadership. 8. Josh Lindsay Geelong Falcons/Victoria Country\n\nDefender/midfielder, 183cm, 7/4/2007\n\nU18 champs stats (avg): 22.3 disposals, 4.8 intercept possessions, 444 metres gained\n\n2025 All-Australian Perhaps, only Willem Duursma rivals Lindsay as the best kick in the 2025 class. Lindsay has played as a midfielder at times, but is more likely to play at half-back and on a wing at AFL level, where his kicking skills, elite endurance and reliability come to the fore. He has already proven himself as a big-game player – including being Team Heppell’s best player in the 2024 Futures game on grand final day – and is viewed as one of the safest picks in the draft. One scout described Lindsay as “pretty bulletproof”. The Falcons product makes up for not having breakneck speed with his game sense and ability to see opportunities before others. 9. Mitch Marsh West Adelaide/South Australia\n\nForward, 191cm, 15/2/2007\n\nU18 champs stats (avg): 8.5 disposals, 6 marks, 3 goals\n\n2025 All-Australian Marsh surged up draft boards with a series of impressive championships performances that saw him lead all players with 12 total goals, including bags of five and four against Vic Country and the Allies, respectively. He is not key-position height, so he will be a third tall up forward in the AFL, but is excellent overhead, finishes well and has genuine range on his left boot. What also appeals about Marsh is the belief he can be much more than just a forward – and there is talk he will perform different roles late in the season, including on a wing. There are scouts who see similarities in Marsh to a young Jordan Dawson, and his coachability also received a tick.\n\n10. Sam Cumming North Adelaide/South Australia\n\nMidfielder/forward, 186cm, 27/7/2007\n\nU18 champs stats (avg): 17 disposals, 3.3 inside 50s, 1 goal\n\n2025 All-Australian You will struggle to find a recruiter who places Cumming outside the top 15, but an increasing number have him in the top 10, even while accepting there are rough edges on him as a prospect. He rotated between the midfield and attack for South Australia, and made an impact in both areas – blending toughness, strength, power and aggression with a defensive commitment that is rare in teenage prospects. As a forward, Cumming is good overhead and kicks plenty of goals. There are question marks on his running ability and kicking, but he has performed strongly at SANFL league level, on top of his championships output, and there is upside here. 11. Aidan Schubert Central District/South Australia\n\nForward/ruckman, 198cm, 21/12/2007\n\nU18 champs stats (avg): 17 disposals, 3.3 F50 marks, 2.5 goals\n\n2025 All-Australian Few players, if any, improved their draft stock more at the championships than Schubert, who established himself as a standout in a class thin on key forwards. He is a strong runner – the attribute most recruiters bring up first about him – takes lots of marks as a result, competes hard, is agile, and can go in the ruck. Schubert took six contested grabs against Metro and no fewer than three marks inside 50 in any of his four championships matches. His awkward kicking style is the other talking point with Schubert, but bothers some more than others. 12. Jacob Farrow West Perth/Western Australia\n\nDefender/midfielder, 188cm, 21/9/2007\n\nU18 champs stats (avg): 19 disposals, 1.8 intercept marks, 464 metres gained\n\n2025 All-Australian There is a lot of love in recruiting ranks for Farrow, who looks set to be the first West Australian drafted. He is the modern prototype for a half-back flanker: laser-like left boot with easy power – he went at almost 87 per cent kicking efficiency at the championships – racks up intercepts with his ability to read the play, marks well overhead, and moves the ball quickly. Farrow is also a sharp handballer. There is a chance he pushes into top-10 contention as the year progresses, particularly if he proves he can play impactful midfield minutes.\n\n13. Oliver Greeves Eastern Ranges/Victoria Metro\n\nMidfielder, 191cm, 7/2/2007\n\nU18 champs stats (avg): 25 disposals, 11.8 contested possessions, 4.5 clearances\n\n2025 All-Australian Only Dyson Sharp won more disposals at the championships than Greeves, who finished runner-up to the South Australian for the Larke Medal. He boasts great size and strength for a midfielder, and his football smarts come to the fore in contested situations, which is a significant reason he is such a consistently big ball-winner. Recruiters would like to see Greeves place more emphasis on his defensive running and improve his decision-making with his kicking, but believe he is the type of player who will be able to adjust once he graduates to AFL level. 14. Lachy Dovaston Eastern Ranges/Victoria Metro\n\nForward, 177cm, 29/5/2007\n\nU18 champs stats (avg): 12.8 disposals, 5 contested possessions, 2.3 goals\n\n2025 All-Australian\n\nIf you want a small forward this year, then Dovaston is the one to target. Hailing from the same Talent League club as Nick Watson, recruiters believe the mulleted goalsneak is more advanced than the Hawk at the same age with his forward-50 pressure and tackling. He is equally comfortable slotting a set shot as dribbling one through or snapping. What has impressed recruiters about Dovaston’s development is his greater willingness to involve others, and his improved running capacity is evidenced in how hard he works getting up and down the ground. 15. Xavier Taylor Eastern Ranges/Victoria Metro\n\nDefender, 191cm, 30/1/2007\n\nU18 champs stats (avg): 15 disposals, 1.5 intercept marks, 5.8 intercept possessions This ranking reflects the value of what Taylor does well: he can play on taller and smaller forwards, has a knack for being in the right spots to intercept, is aggressive, competitive, agile and athletic, and has a safe pair of hands. As it was put to this masthead, every club needs a versatile defender like him. However, Taylor is polarising. Some clubs rate him around here, and others have him much lower, in large part because of his at-times dubious decision-making, including an unfortunate tendency to kick into the man on the mark.\n\n16. Max King Sydney Swans Academy/Allies\n\nForward/midfielder, 192cm, 1/9/2007\n\nU18 champs stats (avg): 7.3 disposals, 2.7 marks, 0.7 goals The most common perspective on King is you have to envision what he could become when rating him as a prospect rather than focusing too much on his current output. The breakout game recruiters hoped for at the championships did not occur, but he is an exceptional athlete, and it is easy to fall in love with his potential when he pulls down one of his sky-scraping marks. King remains a low possession-winner, but if that does not change, he could still be valuable as a high-impact forward. That said, there is risk here. 17. Harley Barker Sturt/South Australia\n\nWingman, 187cm, 2/5/2007\n\nU18 champs stats (avg): 16 disposals, 3.3 inside 50s, 5.8 score involvements\n\n2025 All-Australian\n\nSam Grlj is in the frame to be a first round selection. Credit: via Getty Images Barker loomed as a top-10 smokey if he finished the season strongly, but suffered an ACL rupture after the championships, playing in the under-18s for Sturt. That setback makes it difficult now to rank him because recruiters like him and feel like he boasts similar attributes to fellow wingman Caleb Windsor, a top-10 selection two years ago. Barker’s size, speed, endurance and skill combination made him a weapon for South Australia, repeatedly involved in scoring chains but also willing to push hard into defence to offer support. 18. Sam Grlj Oakleigh Chargers/Victoria Metro\n\nMidfielder/defender, 182cm, 26/7/2007\n\nU18 champs stats (avg): 17 disposals, 12.3 uncontested possessions, 2.3 intercept possessions Once viewed as a potential top-five pick, Grlj has work to do to prove he even warrants being taken here. His first month of the season was electric, where his speed, line-breaking run and intensity had scouts likening him to Max Holmes. Those traits are coveted and mean Grlj is unlikely to fall too far, but there are concerns about his lack of polish and habit of rushing when he has the ball. There was also disappointment about his lack of midfield time for Metro at the championships, but there is still a good chance he climbs the order again.\n\n19. Louis Emmett Oakleigh Chargers/Victoria Metro\n\nRuckman/forward, 199cm, 23/3/2007\n\nU18 champs stats (avg): 12.7 disposals, 4.3 marks, 2 clearances Emmett’s endurance for a big man is outstanding and means he should become a valuable link-up man, whether playing in the ruck or in attack. Like Cooper Duff-Tytler, he lacks genuine ruck height, so he might need to make his AFL living as a forward-ruck – and scouts are encouraged with how his forward craft is coming along. Recruiters were a tad underwhelmed by his championships performances, but his last match for Oakleigh, where he amassed 22 disposals, 15 contested possessions and kicked two goals highlighted his upside. 20. Adam Sweid Calder Cannons/Victoria Metro\n\nMidfielder/forward, 175cm, 14/9/2007\n\nU18 champs stats (avg): 17 disposals, 4.3 clearances, 1 goal\n\n2025 All-Australian\n\nSweid is tied to Essendon as a next generation academy product, and almost everyone you speak to raves about him. He is tough, strong, smart, consistent, uses the ball well and is a regular goalkicker. As always with someone of Sweid’s height, there are queries on his ability to be a full-time midfielder, but the expectation is he will become a useful high half-forward who can go through the midfield, where his clearance-winning ability is proven. Sweid is also a regular goalkicker. He is a popular teammate, too, which only adds to his appeal. 21. Archie Ludowyke Sandringham Dragons/Victoria Metro\n\nForward, 197cm, 19/11/2007\n\nU18 champs stats (avg): 4 disposals, 1 mark, 1.7 score involvements One of the toughest players to assess in the draft pool. Ludowyke’s had an interrupted season, and won’t play again this year because of a PCL injury he sustained in Metro’s win over the Allies, so talent scouts will have to project what he could be. He failed to kick a goal in any of his three championships matches, but has hauls of five and four goals this season for the Dragons. Ludowyke has good size and athleticism for a key forward, and flies for marks, so it would not surprise if a forward-needy club takes him higher than this. 22. Harry Kyle\n\nSydney Academy/Allies\n\nDefender/midfielder, 188cm, 16/7/2007\n\nU18 champs stats (avg): 12.5 disposals, 10.3 uncontested possessions, 1.3 intercept possessions There are scouts who have him above Max King as Sydney’s best academy prospect, and he could be a riser in the second half of the season. Kyle is in his first year in the academy, so there is enormous upside here – and his size, running ability and versatility all appeal to recruiters. The belief is he could play anywhere from the wing to half-back or even an inside midfield role eventually. As with some others, there is a greater focus on projection than his performance this season, but he is working his way into first-round calculations. 23. Sam Swadling West Perth/Western Australia\n\nMidfielder, 187cm, 16/1/2007\n\nU18 champs stats (avg): 19 disposals, 12 uncontested possessions, 2.8 clearances\n\n2025 All-Australian Loading\n\nSwadling has little trouble getting his hands on the ball and was one of Western Australia’s most consistent performers at the championships, resulting in All-Australian selection. He tends to handball more than kick, but does so in an attacking manner that releases his teammates to create opportunities, and has the power scouts like to see from midfielders. Swadling can be prone to kicking errors with aggressive decision-making, but he has plenty of fans in recruiting ranks and is already being exposed to senior football in the WAFL. 24. Riley Onley Murray Bushrangers/Victoria Country\n\nMidfielder, 194cm, 30/3/2007\n\nU18 champs stats (avg): 23 disposals, 4 clearances, 6.8 score involvements\n\n2025 All-Australian Onley is huge for a midfielder and uses that height to his advantage to make his mark in the contest. He is highly talented, good athletically and typically makes good decisions with the ball, and his best deserves a higher ranking than this. Onley’s impressive championships campaign helped his cause. The shame for him is a serious hamstring tendon injury sustained in the final term against Vic Metro means he won’t play again this season. 25. Beau Addinsall",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/collingwood-s-star-recruit-was-struggling-how-shooter-d-mac-and-fly-came-to-the-rescue-20250731-p5mjd1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Collingwood’s star recruit was struggling. How Shooter, D-Mac and Fly came to the rescue",
        "publish_date": "Fri, 01 Aug 2025 12:00:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "Collingwood coach Craig McRae can see the wheel starting to turn for high-profile recruit Dan Houston.\n\nHis positioning is becoming sharper. His running patterns are becoming more instinctive. And his mind seems less cluttered.\n\nThe Magpies want to find ways to give Dan Houston more of the ball Credit: AFL Photos via Getty Images\n\nAlthough such shifts are often barely recognisable to anyone but the trained coach’s eye, there were positive signs in the second half against Richmond, when he helped Collingwood open up a break on the Tigers.\n\n“He is going forward,” McRae said. “If you watch him closely enough he is heading towards [becoming] a player who could have a significant impact for the rest of the year.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/conferences-mid-week-games-and-10-team-finals-how-a-20-team-nrl-competition-could-work-20250731-p5mj90.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Conferences, mid-week games and 10-team finals: How a 20-team NRL competition could work",
        "publish_date": "Fri, 01 Aug 2025 11:57:25 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "The model posed by this masthead is based on a four-conference system consisting of five teams in each conference.\n\nThat model, however, raises issues with the number of games played in a regular season. If teams played the other teams in their conference twice, and the other conference once, the competition would be extended from 24 to a 28-game season. That’s never happening.\n\nWhat the conferences could look like. Credit: SMH\n\nIn a 20-team competition, there are two viable options. One option is to split the competition into two 10-team conferences.\n\nThere has been considerable debate in recent years about the NRL transitioning to a conference-based system, similar to those of several major American sports.\n\nThe NRL has started sitting down with potential broadcast partners to open discussions about the future of the sport. With a team in Perth entering the competition in 2027 and a team in Papua New Guinea the following year, the NRL is just one team away from reaching its desired 20-team competition. That could come as early as 2030. This masthead has spoken to the key stakeholders in the sport to map out what a 20-team competition could look like, including the introduction of conferences and a change to the State of Origin period.\n\nAdd articles to your saved list and come back to them any time.\n\nWith nine Sydney teams, it makes it difficult to place them into two clear conferences. By placing the “Big Six” Sydney teams in terms of fan bases and history (Roosters, Dragons, Rabbitohs, Bulldogs, Tigers and Eels) into two separate groups, you ensure more blockbuster games for broadcasters and fans.\n\n“Conferences done correctly, yeah, absolutely, I like it. When I first started as chairman, I had a delegation of high-profile coaches and administrators. They wanted conferences, so I’ve always had it in the back of my head. Tribalism is the main ingredient in our sport.”\n\n“It’s just a matter of when and how we can get there. We want to ensure the first two teams are successful. The Dolphins were successful. We want to make sure the Perth Bears and PNG are equally successful. That might bring the 20th team forward. The success of the two teams will determine how quickly we can move to a 20-team comp.\n\nThe current draw sees some teams play opponents twice, with no formula or fairness behind the selections.\n\nThat allows teams to play each other once (19 rounds), then a rivalry month leading into the finals series, when teams square off against their conference opponents for the second leg of their home-and-away fixtures.\n\nThis masthead placed the Perth Bears into a Sydney conference due to their North Sydney fan base. Placing them in another conference with teams like the Warriors, Cowboys or Papua New Guinea will only add to the extensive travel those teams will undertake. The 20th team has also been given to a second New Zealand team.\n\n“We get back to playing a proper draw, not all over the place like it is now. That’s fairness. Now, the top clubs play each other twice, and the bottom teams play each other twice, and we end up somewhere in the middle and get a close comp. Everyone says we’re geniuses, but we’re not. It’s engineered.”\n\n“Playing the Sydney teams twice is better for us than playing the Titans or Dolphins at home. Revenue will go through the roof. You’ll get better crowds. It’s fair.\n\nThe NRL could be in for huge changes. Credit: Getty/Michael Howard\n\n“We know they’re concentrating on the most compelling competition they can and getting full value for our broadcast rights. One of the great things about the conference system is the certainty it provides you year in, year out.\n\n“Peter and Andrew have our complete support and confidence as they go into these broadcast negotiations,” South Sydney chief executive Blake Solly said.\n\n“That would drive broadcast and Pay TV revenue for all parties. Ten games aren’t easy to schedule each week, but achievable. There are exciting times ahead for rugby league.\n\n“I wouldn’t want another team in New Zealand, I would want another southern Queensland team,” former Channel Nine boss David Gyngell said.\n\nThe same goes with the clubs, who would be significantly impacted by a draw that would only see teams play each other once (19 rounds).\n\nMost would agree that the current NRL season, at 24 games with three byes, is too long. However, broadcasters pay top dollar for a product that provides commercial partners a substantial window of promotion.\n\n“We would need convincing as an out-of-town club whether a conference system would be good or not,” Raiders chief executive Don Furner said in fear of the disadvantage of the additional travel.\n\nWhile the teams in the southern conference would be required to travel further distances than the teams in the Sydney conferences, it is no more travel than they are currently being asked to undertake.\n\n“Particularly the opportunity to build strong rivalries inside your conference. Anyone who has an interest in the NFL knows how passionate those rivalries can be in the conference and how much fans look forward to the fact they are taking place home and away every year.”\n\nThe Rugby League Players’ Association believes a 19-20 game regular season is an optimal amount to reduce the workload on players and minimise injuries.\n\n“The season schedule has desperately needed serious innovation for years, and we are and have always been up for that discussion,” RLPA chief executive Clint Newton said.\n\n“With a new broadcast deal approaching, we’ve got the best chance in a long time to stop patching problems and start building something progressive and transformative, but sustainable.\n\n“Fewer games per NRL club, a better-aligned Origin period, and a genuine international window. If we get those right, we can deliver the content broadcasters need, grow the game globally, and better protect players’ welfare and careers.”\n\nClubs are mindful, however, that reducing the season to 19-20 games will impact their corporate revenue, sponsorship deals and the income from tickets and membership.\n\n“I understand the need to protect the players and the increasing demands of the game, but that would be a major change from where we are right now,” Eels chief executive Jim Sarantinos said.\n\nThe proposed NRL calendar. Credit: SMH\n\n“Reducing the number of home games for each club from 12 to 9 would have a significant impact on how clubs engage with fans, members and sponsors, and the business model across the whole game would need to change.”\n\nThere are currently 204 games in the NRL regular season. Even if the competition is reduced by one round, the NRL will increase the number of regular-season games to 230 (13 per cent increase) with the addition of two extra games per round with the new teams.\n\n“Personally, I’d like to see the season shorter,” Furner said.\n\n“It’s such a long season with rep football and trial matches. If there was a way to satisfy the broadcasters with less NRL games, that would be an ideal outcome. I look at the amount of games in the NFL, and it works for them.”\n\nComparing the difference between the current season structure and what it would be like under the proposed 20-team, four-conference system. Credit: SMH\n\nFinals format\n\nIt’s imperative to place a greater importance on conference rivalry games. Incentivising the conference champion will only add to the spectacle of some of the blockbuster matches.\n\nThe reward for the highest-ranked team in each conference (based on the overall ladder) is a direct pathway into the finals series.\n\nThose teams would be seeded from 1-4 based on the best overall win/loss record throughout the season.\n\nThat would guarantee the conference champion a second chance if they lose their opening game of the finals. Those teams, based on the current NRL ladder after 21 rounds, would be the Raiders, Bulldogs, Broncos and Sharks.\n\nThe other six teams would be seeded from 5-10 in order of their overall standing on the combined ladder.\n\nIn the first week of the finals, 7th would play 10th and 8th would play 9th for the right to progress into the final eight the following week.\n\nTeams 1-6 would be given the week off in the first week of the finals. This would help negate the current situation, which sees many teams resting their players in the final round of the regular season to prepare for the finals at the expense of the integrity of the competition.\n\nThe 10-team finals series format based on the 2025 calendar. Credit: SMH\n\nThe opening weekend of the finals would determine the two teams that would join the remaining six teams in week two of the finals. From that point, the current top eight finals system would be applied.\n\nIt gives broadcasters an additional two sudden-death finals games to sell to commercial partners and provides the game with an uplift in attendance and television viewers.\n\nBy reducing the regular season by one round and extending the finals series by one week, the NRL grand final will remain on the October long weekend.\n\n“I used to think the ideal model was to split the competition into two conferences and have your Sydney grand final and out-of-Sydney grand final, with the two teams playing in some sort of Super Bowl,” South Sydney coach Wayne Bennett said.\n\n“Once we get to 20 teams, there will be too many teams for that. Maybe the four conference system is the way to go because we need more rivalry games.”\n\nState of Origin period\n\nThe television ratings speak to the beast that is State of Origin, but often the representative fixture comes at the detriment of the NRL competition.\n\nClubs pay their premium players top dollar, only to lose some of them to State of Origin, often picking up injuries or returning both physically and mentally fatigued.\n\nQueensland celebrate winning this year’s State of Origin series. Credit: Getty Images\n\n“Currently, it’s the worst model we can have,” Bennett said.\n\n“It’s the timing of it and how it least impacts the clubs. One of the great fallacies of our game is that the best team doesn’t always win the grand final. Not every season, but Origin has impacted on the finals and the premiers. I laugh because I’ve coached all these years and with a high number of Origin players in my teams.\n\n“I’m qualified to tell you how much it takes a toll. I have no doubt we should have gone back-to-back premierships at the Dragons, but Origin killed us. When the players came back they were physically drained and mentally shot after a brutal series. We never recovered from that.”\n\nWayne Bennett with players Jamie Soward and Dean Young at the Dragons after the 2010 grand final win. Credit: Getty\n\nState of Origin belongs in the middle of the season, but does it have to last so long? Does it have to have such a significant impact on the NRL teams?\n\nThere are currently 53 days between when the players arrive in camp for game one and when they leave after game three.\n\nThey do return to their clubs in between matches, but the NRL can’t continue to allow Origin to have such a major impact on clubs.\n\n“The Origin schedule is a bit like Frankenstein’s monster,” Solly said.\n\n“The NRL competition provides the ARLC with 90 per cent of its revenue, yet a three-game series disrupts it for almost 30 per cent of it. No other premier sporting club competition would accept that disruption. People at the NFL, the NBA, the Premier League think we clubs are mad in accepting that position.\n\nPayne Haas was on light duties leading into all three Origin games this year. Credit: Getty Images\n\n“The current Origin window is a complete disaster for clubs. It takes our best players away too often and for too long. We understand that this current system was a product of this TV cycle.”\n\n“We much preferred the Wednesday-Sunday-Wednesday schedule of the previous system, and we’ve been vocal in seeking change from the NRL. We respect that Andrew and Peter can’t do anything in this cycle, but everyone in the game wants a shorter Origin period with less disruption to the NRL competition.”\n\nHow the State of Origin period would work, based on the 2025 calendar. Credit: SMH\n\nUnder the model proposed, the Origin period would be reduced from 53 days to 29.\n\nPlayers would remain in camp for the duration of the series, playing the first game on a Wednesday, the second game 10 days later on a Sunday, and the third 10 days later on a Wednesday.\n\n“I would debate the duration of the State of Origin as that’s a critical component,” Gyngell said.\n\nThe model proposed would see NRL clubs lose Origin players for just one game each.\n\nSplit rounds and mid-week matches, similar to the English Premier League over the Christmas period, would give broadcasters an 18-day footy festival each May (combination of NRL games, men’s Origin, women’s Origin, under 19’s Origin and under 21 Test matches involving Australia, New Zealand, Tonga and Samoa).\n\n“I think the system we have now is working,” NSWRL boss Dave Trodden said.\n\n“I think under any model that will be satisfactory for the broadcasters, there’ll be a consequence to the clubs. The most important consideration is going to be what the broadcasters think of the schedule.\n\n“State of Origin drives so much of the commercial value in the broadcast deal, so that will be in the minds of the decision makers. With the massive ratings they have been getting the last couple of years, broadcasters will be reluctant to mess around with the schedule too much.”\n\nThe proposed changes would ensure Origin players remain in camp throughout the series, negating the risk of injuries suffered when returning to club land and continually building on the hype of the series without the stoppages that currently exist.\n\n“As long as the solution doesn’t compromise the quality of the product, because Origin is so big and so unique, it needs to be taken into account,” Queensland Rugby League boss Ben Ikin said.\n\n“But more importantly, as long as the rules that they change advantage Queensland and not NSW, we’ll be fine.”\n\nInternational window\n\nLike the Six Nations in European rugby union, there is an opportunity to build an annual competition that helps grow the international game.\n\nA Five Nations tournament involving England, Australia, Samoa, Tonga and New Zealand would be played each year (non World Cup years) over five weeks, starting a fortnight after the grand final.\n\nThe proposed Five Nations tournament. Credit: SMH\n\nThe annual leave entitlements of the players would prohibit the competition running longer than five weeks (mid-November), therefore, the winner of the Five Nations would be determined by the ladder and not a final.\n\n“Because of the club’s success we’ve gone deep into the year, and that has been compounded by representative player selection,” Panthers rugby league chief executive Matt Cameron said.\n\n“Although we’re really proud of this success, it does put pressure on the preseason time frame and any future model that would help alleviate these pressures would certainly be a benefit to all clubs.”\n\nNRL is Live and Free on Channel 9 & 9Now\n\nMichael Chammas and Andrew “Joey” Johns dissect the upcoming NRL round, plus the latest footy news, results and analysis. Sign up for the Sin Bin newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/australia-dodges-tariff-increase-as-trump-keeps-rate-at-10-per-cent-20250801-p5mji6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia dodges tariff increase as Trump keeps rate at 10 per cent",
        "publish_date": "Fri, 01 Aug 2025 11:47:19 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Washington: Australian goods will continue to be subject to a US tariff of 10 per cent after President Donald Trump maintained the current “baseline” rate – despite earlier threats to hike the levy to 15 or 20 per cent.\n\nTrump issued an executive order on Thursday night, Washington time, confirming new tariff rates for several trading partners following “deals” struck with their leaders, as well as revised tariffs for a number of other countries.\n\nOut with the old: the “reciprocal tariffs” announced on April 2 have been replaced with different rates. Credit: Bloomberg\n\nAustralia received the lowest rate, 10 per cent, when the so-called reciprocal tariffs were announced on April 2. Australia was not named among the changes on Friday (AEST), and a White House fact sheet confirmed any countries not on the new list would remain on 10 per cent.\n\nAustralian officials also confirmed the rate would remain at 10 per cent, the same as the United Kingdom. But some countries faced increases: Trump hiked the tariff on goods from New Zealand to 15 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/how-a-155-billion-eco-paradise-fell-short-of-its-promise-20250730-p5mj3k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How a $155 billion ‘eco-paradise’ fell short of its promise",
        "publish_date": "Fri, 01 Aug 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin"
        ],
        "text": "At 9am, the beachfront was empty, except for a Malaysian couple and their grandson playing near a white concrete staircase jutting out over the sand. Dubbed the “stairway to heaven”, it’s intended to be an Instagrammable spot, but it’s difficult to pass over its metaphor as a boondoggle leading nowhere. While waiting to check in, I wandered the grounds for five hours, encountering maybe 20 visitors or residents. This paucity contrasted with the number of groundskeepers, maintenance workers and security staff roaming the facility, ensuring every fallen leaf was swept, hedge trimmed and pool sparkling to maintain the vision of a safe and immaculate paradise. The Stairway to Heaven attraction at Forest City is designed to be an Instagrammable spot, but it could be interpreted another way: A project leading to nowhere. Credit: Lisa Visentin At the centre of the estate, an entire building has been dedicated to selling this dream. A large-scale model of the project spans the length of a salesroom floor, capturing the grandeur of the four-island plan spanning 14 square kilometres that seems destined to remain a fantasy. A promotional video playing in the background claims the city is home to 15,000 residents and “gradually growing”. By midmorning, a few Chinese buyers were flipping through brochures, outnumbered by staff ready to lock in a sale.\n\nFrom the outset, Country Garden gambled the success of its venture on the burgeoning Chinese middle class’ seemingly insatiable appetite for real estate. It pitched Forest City as a way for Chinese investors to diversify their assets offshore, while dangling visa incentives and the prospect of residency in Malaysia. It has proved a bad bet. In 2020, Chinese President Xi Jinping began cracking down on the credit binge that the country’s heavily leveraged developers had gorged on, setting in train a property-bubble bust that has wiped out wealth and confidence. A large-scale model of Chinese developer Country Garden’s four-island vision for Forest City in Malaysia, which takes up the floor of the salesroom. Credit: Lisa Visentin Across China, cities are now littered with the abandoned ambitions of its developers, many of them falling into ruin. Country Garden has more than 3000 unfinished projects and nearly 1 million outstanding homes to complete, according to Japanese investment bank Nomura. It did not respond to a request for comment. Forest City has also suffered from lingering resentment in Malaysia at the idea of a massive project being built for Chinese buyers. This was fuelled by then-prime minister Mahathir Mohamad, who in 2018 said foreigners would not be granted visas to live there, further dampening demand.\n\nVisa controls have since been eased under current Prime Minister Anwar Ibrahim. Even with price decreases – a one-bedroom apartment starts at 500,000 Malaysian ringgit ($182,190) – Forest City is unaffordable for many locals and remains pitched at overseas buyers. Forest City may not be the total ghost town it’s pegged as by the press, but it’s far from the portrait of a vibrant, thriving community. Forest City says its community has about 15,000 residents, but its grounds are quiet and many apartments empty. Credit: Lisa Visentin At midday, many of the shops in the mall next to the hotel were still shuttered, some seemingly permanently. Those that were open had no customers, and bored shop assistants sat glued to their phones at vacant counters. At one coffee shop, the server was slumped across a table, asleep. A prime selling point for Forest City is its duty-free status. But a licensing issue meant none of the four duty-free shops in the mall were selling alcohol − one of the main drawcards for visitors, especially those from Singapore, where extortionate taxes make a tipple all but a luxury.\n\nOne store was reduced to selling only chocolates, though upon entry its shelves were bare save for several boxes of wafer biscuits − a sales challenge that apparently required two shop assistants. One of them, a woman in her 40s, said she had lived in Forest City with her children for four years in an apartment tower behind the mall, having relocated from Kuala Lumpur. About 26,000 apartments have been built across dozens of towers in Forest City, many of them unsold. Credit: Lisa Visentin “There are many people who live in my tower,” she says, explaining that most of them were Malaysian renters who commuted into Singapore daily for work. “I like it here. It’s very quiet.” By sundown, foot traffic has picked up. A modest number of people have filtered onto the beach and a volleyball game is under way. The hotel seems reasonably buzzy, due partly to the fact that a tech school, led by US cryptocurrency investor Balaji Srinivasan, has set up shop in the lobby.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/you-ve-got-a-crazy-talent-on-your-hands-o-driscoll-backs-suaalii-to-thrive-in-rugby-20250728-p5miev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You’ve got a crazy talent on your hands’: O’Driscoll backs Suaalii to thrive in rugby",
        "publish_date": "Fri, 01 Aug 2025 11:40:29 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "“I know he’s been playing a bit of 15 for the Waratahs and he’s obviously so athletic, so from an aerial point of view, he’s a little bit like Israel Folau, giving him ownership of that backfield and that’s a great starting point,” O’Driscoll said. “I don’t know what his kicking game is really like, we haven’t seen much of it in union, but when you’re elusive and you’re strong, maybe you don’t have to pigeonhole him into being in one position, maybe he can play multiple positions. “The thing at 13 is he can be creative and destructive, but at 15, if you’ve got a good team that doesn’t kick the ball stupidly to players like him and you press hard, it can be difficult to really make a difference. “Whereas at 13, if you get a reasonable platform, you should be able to show off your skill set.” Joseph-Aukuso Suaalii has received a ringing endorsement from one of the greatest centres to play the game Credit: Getty Images\n\nO’Driscoll was in the stands at the MCG to see the Lions stage a memorable comeback and seal the series. As a player, he excelled at turnovers at rucks, understanding the physical risks involved in putting your head and neck over the ball. The Dubliner has watched the Carlo Tizzano and Jac Morgan penalty incident and understands both the Wallabies’ and the Lions’ arguments. “My gut was, and it’s very hard to say, biased. I think a year ago, that could have been a penalty, but I think the laws have recalibrated a little bit around understanding the confrontational part of the game,” O’Driscoll said. “It’s a very, very close call on both fronts, don’t get me wrong. We (the Lions) probably would have been annoyed, but it felt like I was happy to see it, but I don’t know if that’s just my bias. “You won’t see too many Lions or their supporters saying it was a penalty. I asked one Australian friend, whose opinion I would count, and he said, ‘no penalty for me, mate’. He’s the only Aussie that I’ve heard saying that. I’m not telling you who it was, but a very credible individual in my book. “So listen, it was one of those (incidents), I think we’ll argue forevermore. But I think from a technique point of view, Jac Morgan is spot on and from a Lions point of view, it’s a great clear out.”\n\nThe former Ireland great understands that with a high possibility of the Lions’ first Test series whitewash in Australia since 1904 ahead of Saturday, it puts the Wallabies’ place on the touring side’s schedule into question. O’Driscoll was impressed by the Wallabies’ fightback in the second Test and believes that while Lions tours may evolve from their current rota in the Southern Hemisphere, the quality of rugby in this country can never be taken for granted in the future. Carlo Tizzano of the Wallabies receives medical attention after the clash with Jac Morgan. Credit: Getty Images “It’s funny, we’re in a world now that you can’t just be hell-bent on tradition, you have to have a malleability to circumstances changing and maybe looking at new opportunities and new options,” O’Driscoll said. “I just think at the moment, this particular Aussie team isn’t as strong as others, but in a cycle of 12 years time, the game changes.\n\n“They (the Wallabies and Lions) were probably even enough teams 12 years ago and they were very even teams 24 years ago, I think this is just a better Lions outfit now, but that’ll change. “The only thing is, Australia has struggled for a while. It was the first time being knocked out of the group stage of the World Cup, and it’s just gotten away from them a little bit. “I don’t know what the participation level is, but interest levels have definitely waned a bit, so it’s just on a bit of a slide at the moment. “But that’s not to say you can’t get that back. So I wouldn’t be in a mad rush to be writing Australia off just yet. “But is there the potential for an alternative? People have talked about a Lions tour to France. Who knows? I think you’ve got to have an open mind to these things, but I wouldn’t be in a rush to write off Australia either.”\n\nBrian O’Driscoll speaks to the Sydney Morning Herald in Sydney ahead of the third Test between the British and Irish Lions. Credit: INPHO/Tom Maher O’Driscoll lost 36 of his 84 Tests as captain of the Lions and Ireland, joking that he should “have a PhD in panic”. The Irishman is thus well qualified to deal with a distraught dressing room and understand how Wallabies captain Harry Wilson can generate a final memorable performance from his team in Sydney. “You’re allowed 48 hours to grieve. Just 48 hours, that’s fine, you’ve got to feel sorry for yourself and lick your wounds a little bit and then pick yourself up...it’s not about the result, it’s about putting together a similar performance,” O’Driscoll said. “They (the Wallabies) really were unlucky not to get the result, they played a great game and I think there’s so much positive to take from that... “You can’t be a flash in the pan, you can’t just get yourselves up for a test match that really matters, sometimes the hardest ones are the ones that, on the face of it, don’t matter because there’s no outcome at the end and you can’t win from it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/swimming/summer-bummer-mcintosh-to-skip-commonwealth-games-20250801-p5mjgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Summer bummer: McIntosh to skip Commonwealth Games",
        "publish_date": "Fri, 01 Aug 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Singapore: The Commonwealth Games’ battle for relevance has taken a hit, with Canadian swimming sensation Summer McIntosh set to skip next year’s event.\n\nThe 18-year-old, widely regarded as the best female swimmer on the planet, claimed another gold medal at the world championships in Singapore on Thursday night, powering to victory in the 200m butterfly ahead of Australia’s Lizzy Dekkers, who took bronze.\n\nMcIntosh’s star power is undeniable, but a scheduling clash appears set to rob the 2026 Games of one of its biggest drawcards – unless there’s a last-minute change of heart or a campaign to lure her back.\n\nThree well-placed swimming sources, speaking on the condition of anonymity due to the sensitive nature of the issue, told this masthead McIntosh will not represent Canada at the Games, which run from July 23 to August 2 in Glasgow.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/opera/sexy-and-delicious-this-mozart-opera-is-made-for-our-times-20250728-p5mibu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sexy and delicious, this Mozart opera is made for our times",
        "publish_date": "Fri, 01 Aug 2025 11:37:23 +1000",
        "category": "entertainment",
        "authors": [
            "Barney Zwartz"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In 1781, Wolfgang Amadeus Mozart – one of the most profound geniuses the human race has produced – sat as a servant at the table of the Archbishop of Salzburg, above the cooks but below the valets. Already a much-travelled and admired child prodigy, he felt the humiliation acutely. He could hardly have imagined that within a year he would have left the Archbishop’s service, propelled literally by a boot up the backside from the Archbishop’s secretary, and be revelling in the massive success of his first really great opera, The Abduction from the Seraglio. He had taken his first trailblazing steps from musician as servant to musician as entrepreneur. Now, 244 years later, Victorian Opera is launching a new production of the opera, very much designed for 2025 Melbourne, with a shortened title, a brand new libretto and some musical cuts and additions. Abduction is what director Con Costi calls a “delicious dark rom-com”. The original story tells of two women, Konstanze and Blonde, abducted and taken to a Turkish harem. When their boyfriends, Belmonte and Pedrillo, try to steal them away, they are caught, but released, along with the women, by the merciful pasha. Lyndon Watts and Cleo Lee-McGowan during rehearsals for Victorian Opera’s Abduction. Credit: Casey Horsfield In Costi’s retelling, the pasha becomes a Great Gatsby figure who holds elaborate and debauched parties, which the two women enter voluntarily due to possible dissatisfaction with their metrosexual boyfriends, who venture in to “save” them. Costi has Belmonte ask his sidekick: “Do you think they are having doubts?” Pedrillo replies: “Surely not. I mean look at us – we’re young, we meditate, we moisturise.” Delightful gentle mockery that is definitely not in the original text, but highlights Costi’s trajectory.\n\nAdvertisement\n\n“At its heart, it is a sex comedy,” says Costi, 35. “It’s some of the most exciting, dynamic and beautiful music Mozart has in his canon. Then the characters are incredibly rich and witty and funny, and dealing with an extremely contemporary conundrum: how best to live.” Victorian Opera has gone with a vibrant young cast to keep the energy high. Pasha Selim, a non-singing role, is played by Lyndon Watts, 30, who made his name as Aaron Burr in Hamilton, then as Candide in last year’s VO production. He is equally noted in the realms of theatre and musical theatre. Have others traversed such a wide path? “Melbourne is full of them, actually,” he says. “In the art spaces in Australia, you have to diversify or there’s not enough work. I am surrounded by a lot of artists who straddle various worlds.” This is Watts’ first mainstream opera, and he is excited. “I’m sort of pinching myself to be part of this incredible music. It’s a dream – it’s like doing Shakespeare, it’s like the mastery of Hamilton or Sondheim,” he says. Mercy and empathy are the keys to opening the Pasha’s character, he says. “As long as you’re honouring the human being, if it’s larger than life or different from the original, I enjoy it for what it is.” Emerging soprano Cleo Lee-McGowan, also 30, has the most difficult role, Konstanze, with its formidable technical and emotional demands. “It’s a beast of a role,” she says. “It’s very long and it’s very high, but it’s also very low. Mozart wrote it for a friend [the diva Caterina Cavalieri] to showcase her virtuosity and the extremes of the human voice, so the challenge is how do I achieve these extreme technical demands while also keeping the beauty.”\n\nAdvertisement\n\nHer answer is not to think about it too much but to dive into the character and trust her musical preparation. “I prepare brick by brick, focusing on the coloratura [virtuoso] passages and working out where I can take a breath, where I can reset, and just figuring out a strategy to get through this marathon. I must say it’s the most challenging role I’ve ever sung, and possibly will sing.” Lyndon Watts with costumier David Anderson during rehearsals for Victorian Opera’s Abduction. Credit: Casey Horsfield Lee-McGowan says the original setting may be strange, but it’s highly relatable. Konstanze and Blonde are asking questions every young person is asking and probably through every stage of life: “Who am I, and what do I really want?” The pair are the first of Mozart’s canny, complicated women, prominent in his later operas, Costi says. “You can’t help but notice the music and the time that he gives to the female characters across his operas. He gives so many women … musical dignity, and that’s why he is the great enlightenment humanist composer.” Costi says the big question he took a long time to grapple with, is what is the genre? The opera is not just a comedy but at times deeply serious, reflective and moving. “It’s not just a raucous comedic opera buffa, but it’s not an opera seria where we are dealing with the plight of emperors and kings and queens.” Both forms had strict conventions which Mozart defied to produce something new. “The game I really want to play with the audience is this oscillation between things that are comedic and witty, and you’re hopefully laughing, but at the same time grappling with quite serious things. “It’s an exciting challenge of really gear-shifting between comedy and human beings at the end of their tether. It has the tropes for romantic comedy, but there’s so much threat and menace hanging over the world that they’re in – I can’t really think of a parallel.”\n\nAdvertisement\n\nThe set model for Victorian Opera’s “exciting and fun” Abduction. Credit: Casey Horsfield There is a joy, he says, in embracing what is wild and dark about being human and also unravelling the complications of control in a relationship. “Where does love and commitment transform into something controlling? These things are very interesting to me, particularly in the contemporary climate of a modern Victorian age of ethics and etiquette.” Costi says the contemporary, cult-like, world he has chosen lets him reflect the sexual allure, danger and strangeness of a harem. Loading He is categorical that his revision is not about having the audience going away talking about the director – a charge levelled at some directors in Europe. “I’m an opera fan. I’m a Mozart obsessive,” he says. “Wunderkind directors throwing arbitrary grenades at things for shock value is actually kind of passé. That was interesting in the 1980s. There’s now something much more interesting in how do I actually tap into what I think is the intention of the composer and the essential qualities of what makes this a fantastic opera, but treating opera as a living, dynamic medium.” This production, he believes, is an ideal introduction for people who are not regular opera goers. “I like to think there’s something in it for connoisseurs and for first-time opera goers. I want both to leave having had an exciting and fun and moving experience.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australia-avoids-latest-round-of-us-tariffs-midday-news-bulletin-1-august-2025/wgkpdt8ya",
        "title": "Australia avoids latest round of US tariffs | Midday News Bulletin 1 August 2025",
        "publish_date": "Fri, 1 Aug 2025 01:59:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Australia avoids latest round of US tariffs\n\nUluru Dialogue condemns lack of progress on Closing the Gap targets\n\nAustralia wins women's 200 metre freestyle final at World Championships\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia has avoided a fresh wave of tariffs, after the Trump administration announced new import taxes targeting dozens of other countries.\n\n\n\n\n\nThe White House confirmed that President Trump would raise tariffs on products from nations that, in his words, failed to engage in negotiations with the United States or to align on economic and national security matters.\n\n\n\n\n\nAustralia has been spared, with its goods to remain under a baseline 10 per cent tariff.\n\n\n\n\n\nBy contrast, New Zealand imports will face a 15 per cent rate, while Canada and others have been hit with even harsher penalties.\n\n\n\n\n\nThe decision comes amid ongoing U-S concerns over non-tariff trade barriers, including Australia’s biosecurity rules.\n\n\n\n\n\nCanberra recently eased restrictions on American beef, but ministers insist the timing was unrelated to the tariff announcement.\n\n\n\n---\n\n\n\n\n\nThe Uluru Dialogue has issued a strong statement ahead of the Garma Festival, declaring 'enough is enough' on Closing the Gap.\n\n\n\n\n\nIt says progress has stalled, and in some areas, is going backwards.\n\n\n\n\n\nIt blames government inaction, outdated bureaucracy, and the ongoing exclusion of Indigenous voices.\n\n\n\n\n\nIn a statement, the Uluru Dialogue says without a Voice to Parliament, decisions are still being made without Indigenous input.\n\n\n\n\n\n\"We continue to be sold the status quo as the solution, but how can we see any progress on Closing the Gap by doing more of the same? Our children are being locked up, our Elders are dying, and our people are continuing to live in a country where their rights are neglected. Their voices and calls for help falling on deaf ears.\"\n\n\n\n\n\nClosing the Gap is a national plan to improve health, education, and life expectancy for First Nations people, but only four of 19 targets are on track.\n\n\n\n\n\nThe government is expected to highlight progress on 10 of 15 measures at Garma, but the group says that won’t resonate with struggling communities.\n\n\n\n\n\nThe Garma Festival runs from today to the 4th of August in northeast Arnhem Land, on Yolngu country.\n\n\n\n---\n\n\n\n\n\nAn underworld war looms in Melbourne after the daylight execution of 26-year-old Athan Boursinos, who had known links to organised crime.\n\n\n\n\n\nThe son of a former police officer, he was gunned down around 9:30am yesterday outside his home in Wollert as he was heading to court, a tactic often used by gangs to ambush rivals.\n\n\n\n\n\nEight shots were heard by neighbours.\n\n\n\n\n\nDetective Inspector Dean Thomas is with the Victoria Police.\n\n\n\n\n\n\"This is deliberate and obviously targeted. We will work now to piece together what has gone on.\"\n\n\n\n\n\nAthan Boursinos had been a person of interest in the killing of underworld figure Sam Abdul Rahim, and his death has sparked concerns of violent retaliation linked to the ongoing illicit tobacco wars.\n\n\n\n\n\nPolice says investigators are now working to prevent further bloodshed.\n\n\n\n---\n\n\n\n\n\nRussian missile and drone attacks have killed at least 15 people and injured 155 others in Kyiv, as Russia's President defies United States President Donald Trump's ceasefire deadline.\n\n\n\n\n\nRescue crews were seen sifting through the debris following attacks on 27 locations across four Kyiv districts Thursday night.\n\n\n\n\n\nSenior US diplomat John Kelley tells the 15-member United Nations Security Council that President Trump wants a deal to end Russia’s war in Ukraine within one week.\n\n\n\n\n\n\"Both Russia and Ukraine must negotiate a ceasefire and durable peace. It is time to make a deal. President Trump has made clear this must be done by August 8. The United States is prepared to implement additional measures to secure peace.\"\n\n\n\n---\n\n\n\n\n\nTwo Australians arrested by Israeli forces aboard the Freedom Flotilla boat Handala have returned safely to Australia.\n\n\n\n\n\nTan Safi and Robert Martin were among 19 activists trying to breach Israel’s blockade of Gaza to deliver aid including nappies and baby formula.\n\n\n\n\n\nThe boat was intercepted in international waters on the 26th of July by Israeli soldiers and towed to Ashdod.\n\n\n\n\n\nThis morning, supporters greeted them at the airport waving Palestinian flags and chanting as they reunited with loved ones.\n\n\n\n\n\nMs Safi describes the treatment they faced in Israeli custody, especially that of fellow activist Chris Smalls, co-founder of the Amazon Labor Union.\n\n\n\n\n\n\"They pinned him down on the floor, seven or eight of them, and when i asked about him, they came into the room and dragged me out by my arms. I'm still bruised here on my arms from it. They pulled me out and threw me down on the floor, and they made me take off all my clothes. They strip searched me right there, made me, squat, up and down, and then go through all my things. And after that, maybe an hour passed, and we were able to see someone from the Australian Embassy.\"\n\n\n\n\n\nThe Handala was part of a wider Freedom Flotilla effort to raise awareness about conditions in Gaza.\n\n\n\n\n\nAll foreign nationals have since been deported from Israel.\n\n\n\n---\n\n\n\n\n\nTo sport and in swimming, Australia has won the women’s four by 200 metre freestyle relay final at the World Championships in Singapore.\n\n\n\n\n\nThe victory, securing Mollie O’Callaghan 11 world titles - equal to the record set by legend of the pool, fellow Australian Ian Thorpe.\n\n\n\n\n\nKyle Chalmers placed third 100 metres freestyle final at the event overnight.\n\n\n\n\n\nThe Australian came close to breaking the 46-second barrier in the race but fell just short of the mark.\n\n\n\n\n\nChalmers tells Channel 9 he is content with the result as he focuses on the arrival of his child.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/why-gaza-is-dominating-australian-politics-right-now/pbrq3t8ba",
        "title": "Why Gaza is dominating Australian politics right now",
        "publish_date": "Thu, 31 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-is-garma-and-why-is-it-important/b88hxx8ry",
        "title": "What is Garma? And why is it important?",
        "publish_date": "Thu, 31 Jul 2025 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"So it's a great honour to welcome you all here today..”\n\n\n\n\n\nAround 2,000 people each year descend on Gulkula, a sacred place perched on top of an escarpment on the lands of the Gumatj clan in the Northern Territory.\n\n\n\n\n\nThey are here for the Garma festival, the largest cultural exchange on the First Nations calendar.\n\n\n\n\n\nThe 2025 theme is ‘Rom ga Waŋa Wataŋu, or ‘The Law of the Land, Standing Firm’ in one of the local Aboriginal languages, Yolŋu Matha.\n\n\n\n\n\nThe word 'Garma' means \"two-way learning process\" - and it's an invitation for non-Indigenous leaders to meet with and listen to First Nations voices on issues affecting them.\n\n\n\n\n\nVisitors are given a traditional welcome before guests are invited to the Bunggul ceremonial grounds, for the ritual opening ceremony.\n\n\n\n\n\nIt's the start of a four-day festival with a packed schedule of agenda-setting political discussions and cultural celebrations.\n\n\n\n\n\nThe annual event was conceived by the Yothu Yindi Foundation with the aim of improving standards of living for all First Nations people, as the late Djawa Yunupingu explained at the 22nd Garma festival:\n\n\n\n\n\n\"As I have said many times, all of our countrymen are linked together by our songlines. These songlines join us all and though so much has been taken, so much power remains in all of us. We can feel what has been taken from our countrymen, we can feel your pain and we stand together with you to find that pathway to unity.\"\n\n\n\n\n\nPoliticians, academics, and community figures highlight the major issues of the year at the Garrtjambal Auditorium - a key location at Garma.\n\n\n\n\n\nPoliticians from all sides are invited.\n\n\n\n\n\nPrime Minister Anthony Albanese says he sees Garma as a cornerstone for First Nations politics, and a space where politicians, academics and community leaders highlight and discuss key issues.\n\n\n\n\n\n\"We will not abandon substance for symbolism or retreat to platitudes at the expense of progress.\"\n\n\n\n\n\nBut it's not just a place for leaders.\n\n\n\n\n\nAs the sun sets each night, there's an eruption of movement on the sands of the sacred Bunggul site, a ceremonial close to the day's proceedings.\n\n\n\n\n\nThe sounds of the Bilma or clapsticks echo through the leaves of the surrounding stringy bark forest.\n\n\n\n\n\nMusic, dancing, and yarning continues throughout the night, as many make the most of the magic of the festival.\n\n\n\n\n\nDeeper in the bush among the stringy-bark trees hangs the Gapan Gallery, an outpost of the Yirrkala art centre print studio.\n\n\n\n\n\nYothu Yindi Foundation CEO, Denise Bowden, says Garma is an invitation for ordinary people to experience a cultural exchange like no other.\n\n\n\n\n\n\"Music and dance and art, song, a love of learning of a different culture. It's a really healthy platform upon which we can get through some challenging discussions.\"\n\n\n\n\n\nGuests experience a rich cultural immersion.\n\n\n\nFrom weaving workshops to wood carving, traditional art, music and dance is the heartbeat of the four day festivities.\n\n\n\nDenise Bowden says Garma has become an important part of Australian life.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-1-august-2025/g19ri3jg8",
        "title": "The multibillion-dollar cost of foreign espionage revealed | Morning News Bulletin 1 August 2025",
        "publish_date": "Thu, 31 Jul 2025 20:21:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nThe multi-billion-dollar cost of espionage and foreign interference targeting Australia revealed;\n\nAustralia's largest Indigenous gathering begins in northeast Arnhem Land;\n\nAnd in golf, Grace Kim among nine Australians competing at the Women's British Open in Wales.\n\n\n\nThe director-general of Australia's domestic intelligence agency says foreign espionage is costing the economy at least $12.5 billion a year.\n\n\n\n\n\nDelivering the University of South Australia’s Hawke lecture, Mike Burgess says ASIO has stopped 24 foreign intelligence operations in the last three years.\n\n\n\n\n\nHe says China, Russia and Iran are the main countries behind espionage in Australia, but said a number of others are using similar tactics.\n\n\n\n\n\n\"24 major espionage and foreign interference interruptions in the last three years alone. More than the previous 8 years combined. They are just the major disruptions. There have been many other cases. Spies have successfully recruited a security clearance holder who handed over official documents on free trade negotiations. In another case they hacked into the systems of a law firm involved in a sensitive government litigation. ASIO investigated all these plots. They are just the tip of an espionage iceberg.\"\n\n\n\n\n\n—\n\n\n\n\n\nPrime Minister Anthony Albanese is travelling to the Northern Territory to attend Australia's largest Indigenous gathering.\n\n\n\n\n\nThe Garma Festival is held over the next four days in remote northeast Arnhem Land - on the land of the Yolngu people.\n\n\n\n\n\nYothu Yindi Foundation hosts the Garma Festival, and the foundation's chief executive, Denise Bowden, told NITV this year celebrates 25 years of the event.\n\n\n\n\n\n\"I think when those Yunupingu men first hatched the Garma idea, I do think they did understand it would be nationally siginificant. But maybe it needed some years to brew a little. Just imagine how incredibly difficult it is, given its very remote location and the logistics of barging supplies to Gove. And I am very pleased to say the 25th anniversary - it really is quite an honour.\"\n\n\n\n\n\n—\n\n\n\n\n\nStudents have welcomed the passage of legislation to reduce student debt.\n\n\n\n\n\nFederal Education Minister Jason Clare says the passage of the legislation would see those affected save an average of $5,500.\n\n\n\n\n\nThe change will take a few months for the Australian Tax Office to implement, with HECS balances expected to be updated by the end of the year.\n\n\n\n\n\nThe students in Melbourne say it is welcome relief, but more needs to be done to help alleviate the cost-of-living pressures.\n\n\n\n\n\nFemale student: \"HECS is a very pressing issue that we all think about. So it is great that it has gone through.\n\n\n\n\n\nMale student 1: Yeah, I think the big thing is reversing the changes that were introduced by the Liberal-National government a few years back. The Jobs Ready Scheme package. I know that has had a big impact on access to education.\n\n\n\n\n\nMale student 2: It is a big issue for students, particularly because a lot of students are either working full-time or part-time - without more support going into student state of living then it could be a little bit difficult.\"\n\n\n\n\n\n—\n\n\n\n\n\nThe United States Special Envoy to the Middle East is to travel to Gaza today to inspect the food aid delivery situation.\n\n\n\n\n\nThis comes as Gaza is experiencing its worst period of starvation in the conflict, and as a global hunger monitor says famine is unfolding in the Strip.\n\n\n\n\n\nThe Gaza Health Ministry reports 154 people, including 89 children, have died of malnutrition since the start of the conflict - most in the last few weeks alone.\n\n\n\n\n\nWhite House Press Secretary Karoline Leavitt says the US Special Envoy to the Middle East is travelling to Gaza to inspect the aid distribution process and present a plan to President Trump to deliver more food to Gazans.\n\n\n\n\n\n\"Special envoy Steve Witkoff and Ambassador Huckabee had a very productive meeting with Prime Minister Netanyahu and other officials today in Israel on the topic of delivering much-needed food and aid to Gaza. President Trump is a humanitarian with a big heart and that's why he spent sent special envoy Witkoff to the region in an effort to save lives and end this crisis.\"\n\n\n\n\n\n—\n\n\n\n\n\nIn golf, Australian Grace Kim is hoping follow her Evian Championship success with a win at the Women's British Open in Wales.\n\n\n\n\n\nShe is among nine Australians competing at the event, including Hannah Green and Minjee Lee - who is in pursuit of a win at the tournament, the only major she is yet to win.\n\n\n\n\n\nKim says she has prepared well and now it is time to see how it all unfolds in the competition.\n\n\n\n\n\n\"It is the last major of the season. But yeah, I am going to try and carry on the mentality that I had which was worry-free. And I know my game is good enough. My team has been put into a lot of effort into my own game. My physical, everything behind the scenes. So hopefully, we just showcase that.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-femmes-stage-six-gigante-keeps-pace-as-squiban-delights-home-crowd/27pfzy3b6",
        "title": "Tour de France Femmes: Gigante keeps pace as Squiban delights home crowd",
        "publish_date": "Thu, 31 Jul 2025 20:15:42 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Sarah Gigante has kept pace with the Tour de France Femmes leaders as France's Maeva Squiban made a solo ride to the finish line with a perfectly-timed attack on the final major climb to win the mountainous stage six.\n\n\n\n\n\nGigante, who moved into the leading group after finishing in the leading pack on Wednesday, came home 16th — one minute 13 seconds behind the winner.\n\n\n\n\n\nIt meant the AG Insurance-Soudal rider moved up a place to seventh in the general classification, 1.3 behind yellow jersey wearer Kimberley Le Court Pienaar.\n\n\n\n\n\nSquiban, of UAE Team ADQ, finished 1.9 ahead of compatriot Juliette Labous (FDJ-Suez) in the first French one-two in the history of the competition.\n\n\n\n\n\n\"It's an amazing feeling. I didn't expect to do that,\" Squiban said after becoming the second French rider to claim a stage in the event after Cedrine Kerbaol took stage six last year.\n\n\n\nSquiban stayed in the peloton led by Le Court, as mountains classification leader Elise Chabbey (FDJ-Suez) led the 10km climb to Col du Beal.\n\n\n\n\n\nThe 23-year-old broke away on the ascent to Col du Chansert and soon built a lead of over a minute and comfortably took the win in the 123.7km ride from Clermont-Ferrand to Ambert.\n\n\n\n\n\nMauritian Le Court, who won stage five, was the third to cross the finish line as she retained her lead in the general classification.\n\n\n\nPauline Ferrand-Prevot (Visma-Lease a Bike), another home favourite, finished seventh in the stage to remain second in the race for the yellow jersey, 26 seconds behind Le Court.\n\n\n\n\n\nPoints classification leader Lorena Wiebes (SD Worx-Protime) fell back from the peloton during the first half of the stage and appeared to be content conserving her energy, as she retained the green jersey.\n\n\n\n\n\nAustralia's Neve Bradbury was 49th on the stage while Brodie Chapman was back in 63rd after winning the combativity award 24 hours earlier.\n\n\n\nChapman backed that up with another top performance, contributing to her teammate Squiban's victory with a strong ride in the breakaway.\n\n\n\n\n\nThe Tour continues on Friday with a hilly 159.7km ride from Bourg-en-Bresse to Chambery.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-is-garma-festival-the-cultural-gathering-shaping-australias-future/c48rdf1gw",
        "title": "What is Garma Festival? The cultural gathering shaping Australia's future",
        "publish_date": "Thu, 31 Jul 2025 19:39:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Each year in north-east Arnhem Land, the Garma Festival brings together Yolŋu leaders, families, cultural custodians and guests from across Australia for four days of learning, ceremony and exchange.\n\n\n\n\n\nHeld on Gumatj country at Gulkula, a remote ceremonial site near Nhulunbuy in the Northern Territory, Garma is Australia's largest First Nations cultural gathering and one of the country's most significant forums on Indigenous affairs.\n\n\n\n\n\nIt's a place where cultural traditions meet pressing national conversations, and where the future is shaped in dialogue with the past.\n\n\n\nA deeply cultural event\n\nGarma is hosted by the Yothu Yindi Foundation and has been running since 1999.\n\n\n\n\n\nIt was established to celebrate Yolŋu culture and share it with the broader Australian community.\n\n\n\n\n\nFrom the beginning, it has been led by Yolŋu people, on Yolŋu terms.\n\n\n\n\n\nYothu Yindi Foundation CEO Denise Bowden said that Garma was established not only to preserve Yolŋu cultural practices, but also to create a national platform for conversation and leadership grounded in cultural authority.\n\n\n\n\n\n\"But the Yunupiŋu brothers also envisaged that Garma would be a place of serious business – a home to high-level discussion and debate, and a forum to test policy and present Yolŋu knowledge systems. A catalyst for new ideas and fresh thinking,\" Bowden said.\n\n\n\n\n\nThe festival is grounded in traditional ceremony, with daily bunggul (dance), manikay (song), and miny’tji (art) shared in the open air.\n\n\n\nREAD MORE The law of the land standing firm for this year's Garma\n\nStorytelling, intergenerational learning and the continuation of songlines are central to the event, offering an immersive cultural experience that invites guests to listen, witness and learn.\n\n\n\n\n\nTanya Denning-Orman, SBS Director of Indigenous Content, describes Garma as a significant moment on the national calendar and a privilege to experience.\n\n\n\n\n\n\"Each year, the Yolŋu people open their arms and their hearts to more than 2,500 people at Gulkula, and we're honoured to extend that invitation to all Australians through our coverage of this significant event,\" she said.\n\n\n\nHow Garma began\n\nThe first Garma Festival was held in 1999, initiated by the Yunupingu family and the Yothu Yindi Foundation.\n\n\n\n\n\nIt was conceived as a way to protect and promote Yolŋu cultural knowledge at a time when many Elders feared it was being lost. Gulkula, the festival site, was chosen for its cultural and ceremonial importance, the place where the Yolngu ancestor Ganbulabula brought the yidaki (didgeridoo or an Aboriginal wind instrument) into Yolŋu life.\n\n\n\nREAD MORE The cultural significance of Garma\n\nThe late Yolnu leader Dr Galarrwuy Yunupingu AC, a founding member of the Yothu Yindi Foundation and a prominent land rights leader, played a central role in establishing Garma as a space where cultural strength and political advocacy could come together.\n\n\n\n\n\nHis legacy continues to shape the event.\n\n\n\nWhen is Garma?\n\nThe Garma Festival takes place annually in early August. The 2025 event will run from 1 to 4 August at the Gulkula site, which overlooks the Gulf of Carpentaria.\n\n\n\n\n\nGulkula is a sacred site for the Gumatj clan and holds deep ceremonial and cultural significance. The festival is staged in bushland, with participants camping on site and following cultural protocols throughout the event.\n\n\n\nA young child performs the bungul surrounded by family. Source: Supplied / yyf.com.au\n\nWhy 2025 is a milestone year\n\nThis year marks the 25th anniversary of Garma, a significant milestone in its evolution from a regional cultural gathering into a nationally respected event that shapes public dialogue.\n\n\n\n\n\nThe 2025 theme is 'Law of the Land: Standing Firm', or in Yolŋu: Matha, 'Rom ga Waŋa Wataŋu'.\n\n\n\n\n\nYothu Yindi Foundation chair Djawa Yunupingu said: \"This year's anniversary theme acknowledges 25 years of achievement and success, and a milestone moment in the life of our event.\"\n\n\n\n\n\nNITV and SBS will be the official media partners, providing coverage across television, radio and digital platforms. This includes daily highlights, special broadcasts and reporting from the ground, allowing audiences around the country to experience Garma from wherever they are.\n\n\n\n\n\nYou can watch every piece of Garma 2025 coverage on SBS, NITV and SBS On Demand this year.\n\n\n\nA space for conversation and change\n\nWhile Garma is first and foremost a celebration of culture and Country, it is also a respected platform for policy discussion and leadership.\n\n\n\n\n\nThe key forum, held each year during the festival, brings together Indigenous community leaders, policymakers, academics and corporate figures to discuss issues such as truth-telling, treaty, education, economic development and land rights.\n\n\n\n\n\nThe festival has played a pivotal role in amplifying Yolŋu voices and advocating for Indigenous-led solutions in areas such as governance, health and community empowerment.\n\n\n\nGarma, the annual festival and celebration of Yolŋu life and culture, is marking 25 years. Credit: Melanie Faith Dove/Yothu Yindi Foundation Conversations held at Garma often ripple outward into national policy circles.\n\n\n\n\n\nDenise Bowden, CEO of Yothu Yindi Foundation, said: \"Garma continues to play a really important educational role, helping Australians to better understand Yolngu culture, and ensuring that its practices remain strong and continue to be passed down from one generation to the next.\"\n\n\n\nWho attends Garma?\n\nGarma brings together a diverse cross-section of Australia: Elders, young people, artists, political leaders, journalists, educators and members of the broader public.\n\n\n\n\n\nSome come for the music and art, others for the chance to engage in meaningful dialogue. All are invited to participate respectfully and learn from Yolŋu hosts and the broader Arnhem Land community.\n\n\n\n\n\nOver 25 years, the festival has grown in scale and impact, but its purpose remains the same: to celebrate Yolŋu culture, to uphold traditional knowledge, and to invite others to walk alongside in the spirit of listening and learning.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/finger-painter-with-chronic-pain-wins-the-peoples-choice-archibald-prize/yfn5ukdyb",
        "title": "Finger painter with chronic pain wins the People's Choice Archibald Prize",
        "publish_date": "Thu, 31 Jul 2025 09:44:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/governments-student-loan-relief-bill-passes-but-its-a-far-cry-from-the-free-education-of-the-past/q35z15tke",
        "title": "Government's student loan relief bill passes, but it's a far cry from the free education of the past",
        "publish_date": "Thu, 31 Jul 2025 09:38:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Government's student loan relief bill passes, but it's a far cry from the free education of the past\n\nPublished 31 July 2025, 8:04 am\n\nStudent debt relief and childcare reforms have become the first of the Albanese government's election promises to pass the new parliament. The reduction on student repayments assures a 20 per cent cut to all outstanding debts for current and past university students.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/calls-to-close-russian-oil-loophole-after-tanker-protest-off-perth-sparks-outrage-and-concern/zlso86369",
        "title": "Calls to close Russian oil loophole after tanker protest off Perth sparks outrage and concern",
        "publish_date": "Thu, 31 Jul 2025 08:37:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/us-delays-interest-rate-cut-copper-prices-crash/68fr7szzt",
        "title": "US delays interest rate cut & copper prices crash",
        "publish_date": "Thu, 31 Jul 2025 07:29:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/are-you-delaying-the-dentist-because-of-cost-your-children-shouldnt-be/gizi84g5z",
        "title": "Are you delaying the dentist because of cost? Your children shouldn't be.",
        "publish_date": "Thu, 31 Jul 2025 04:03:35 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAs an increasing number of Australian adults are delaying routine dental checkups due to costs, Australian dentists are urging parents not to make the same mistake with their kids.\n\n\n\n\n\nThis Dental Health Week, the Australian Dental Association says that around 1.5 million Australian kids are missing out on free dental care every year.\n\n\n\n\n\nIn a survey of 25,000 Australian adults, around 40 per cent say two is an appropriate age for a child's first dental visit.\n\n\n\n\n\nDr Chris Sanzaro is the President of the Australian Dental Association.\n\n\n\n\n\nHe says children should start seeing a dentist when their first tooth comes through.\n\n\n\n\n\n\"And a few people think it should be older than that. 20 to 30 per cent of people think three to four years of age is appropriate, but the recommendation from the association is that children are taken to the dentist at age one or before age one, or when the first tooth comes through into the mouth.\"\n\n\n\n\n\nA routine checkup and clean can cost between $150 and $300 dollars for an adult, and research shows that around 2 million Australian adults are skipping or delaying dentist checkups.\n\n\n\n\n\nBut, while dental for adults is not covered by Medicare, the government does offer eligible families up to $1,132 in dental care for children every two years.\n\n\n\n\n\nTo be eligible for the Child Dental Benefit Schedule, children must be 17 or younger, eligible for Medicare, and have one parent or guardian receiving a government payment at least once that year.\n\n\n\n\n\nWith only 38 per cent of those eligible actually claiming it, the Australian Dental Association says it's important that parents know if they're eligible and how to access it.\n\n\n\n\n\nDr Sanzaro says delaying treatment for children reduces their options for treatment.\n\n\n\n\n\n\"Children who attend the dentist early, we can find the holes in their teeth. If there's any decay developing, we can find that much earlier when it's smaller. When they're really small, that's a reversible condition. And when they're still quite small, that's something that's relatively easy to fix with fillings. Problem with waiting for children to get to the dentist when they're experiencing pain or discomfort is often those holes are so deep into the teeth. There's much less reduced options for treatment, including the need to potentially extract teeth. And that's not a fun experience for kids or for the dentist or parents. So it's much easier and better to get the kids in earlier when we can find these problems before they develop into something larger.\"\n\n\n\n\n\nBetween 2018 and 2022, the data reveals that First Nations children were accessing the scheme at consistently lower rates than non-Indigenous children.\n\n\n\n\n\nAnd while a lack of awareness around the program is one key factor in its low uptake rate, it's not the only one.\n\n\n\n\n\nAbe Ropitini is the Executive Director of Population Health at VACCHO, or the Victorian Aboriginal Community Controlled Health Organisation.\n\n\n\n\n\nHe has told SBS that there are two key issues that make the scheme inadequate for First Nations people.\n\n\n\n\n\n\"One is that regardless of the fact that we have the scheme, there is an overall lack of choice that Aboriginal and Torres Strait Islander families have in terms of getting access to culturally safe oral health and dental health services... So if you don't have a choice of provider that you and your family consider to be acceptable, then you won't have access to services and you won't ever utilise the scheme that's available to you.\"\n\n\n\n\n\nAs well as the lack of culturally safe services, Mr Ropitini says it should not be on families to navigate complex funding programs in order to access primary healthcare.\n\n\n\n\n\n\"It should really be simplified. It should be made more accessible in terms of understanding what your entitlements are, being able to have priority access to things without having to go into your records on how much you've been billed under that scheme in the past, whether your entitlements have renewed, whether or not you can still draw down from a particular budget or whether you're even eligible for it.\"\n\n\n\n\n\nDr Madhan Balasubramanian is a Senior Lecturer in Health Care Management at Flinders University.\n\n\n\n\n\nIn his research, he's studied why families from culturally and linguistically diverse backgrounds experience widespread inequalities in dental care.\n\n\n\n\n\nHe says there are a variety of reasons this demographic of people might not be going to the dentist.\n\n\n\n\n\n\"So what we actually found out was in addition to cost is also confidence in quality care. So how confident are migrant groups in terms of availing dental care services over here, that is an issue. Even greater is a confusing healthcare system for them. But they have to navigate through the different loops of the healthcare system to understand how to actually avail care and considering dental care, a large proportion of it is offered in private services for them to really understand how to actually use different benefits schemes. And also costs is a barrier for them as well. Public system, they have a big waiting list for them to be eligible they would need to meet certain criteria.\"\n\n\n\n\n\nHaving healthy teeth and gums impacts more than just what's in your mouth.\n\n\n\n\n\nOral hygiene and dental health is essential to our wellbeing, both mental and physical.\n\n\n\n\n\nOne key suggestion given by both Dr Balasubramanian and Mr Ropitini was to better integrate dental into the primary health system.\n\n\n\n\n\n\"Primary healthcare is extremely vital in migrants, who often go to GPs, GP clinics, doctors as the primary point of of consultation. So that's been that gateway to the healthcare system in Australia. So dental providers need to collaborate more actively with GPs, they need to collaborate more actively with other primary healthcare providers.\"\n\n\n\n\n\nThings like missing or decayed teeth can impact a person’s self-esteem and according to some studies, even lower their employment prospects in customer facing roles.\n\n\n\n\n\nMr Ropitini says the importance of oral health can't be understated.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/hecs-debt-bill-passes-through-parliament-midday-news-bulletin-31-july-2025/d1smyyijc",
        "title": "HECS debt bill passes through parliament | Midday News Bulletin 31 July 2025",
        "publish_date": "Thu, 31 Jul 2025 02:13:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMillions of students will have their debts reduced, after a HECS debt bill passed through parliament\n\nIsrael under increasing pressure over Gaza, ahead of US talks in coming hours...\n\nHarrison Turner claims Australia's first-ever world championship medal for 200 metre butterfly\n\n\n\nThree million Australian students will have their education debts reduced, after Labor's highly-anticipated student debt bill passed through Parliament today.\n\n\n\n\n\nThe Albanese government introduced the HECS debt bill to cut 20 per cent from existing university and TAFE debts as its first order of business last week.\n\n\n\n\n\nThe laws aim to reduce student debt as well as reform the repayment system.\n\n\n\n\n\nThe cut will apply to debt levels retrospectively, before the 1 June indexation, but will take a few months for the Australian Tax Office to implement.\n\n\n\n\n\nBalances are expected to be revised by the end of the year, saving students and graduates roughly $16 billion.\n\n\n\n\n\nIsrael is under increasing pressure to ease the deepening humanitarian crisis in Gaza, with Canada the latest country to move to recognise Palestinian statehood and a U-S envoy en route to the Middle East.\n\n\n\n\n\nThe Trump Administration's representative, Steve Witkoff, is due to arrive in Israel later today for talks on the situation in Gaza.\n\n\n\n\n\nThe Israeli military has reported that 220 aid trucks have entered Gaza on Tuesday.\n\n\n\n\n\nUN agencies are calling for 500 to 600 a day, to meet the needs of a population aid agencies say is starving.\n\n\n\n\n\nCanada's intention to recognise Palestinian statehood was announced in recent hours and Prime Minister Mark Carney says it is subject to conditions.\n\n\n\n\n\n\"This intention is predicated on the Palestinian Authority's commitment to much-needed reforms, including commitments by its president, Mahmoud Abbas, to reform its governance and to hold general elections in 2026 in which Hamas can take no part and to demilitarize the Palestinian state. Canada will increase its efforts to support strong democratic governance in Palestine and contributions of its people to a more peaceful and hopeful future.\"\n\n\n\n\n\nThe World Health Organisation says it has helped evacuate 47 critically ill patients and 129 of their companions from Gaza this week.\n\n\n\n\n\nUnited Nations spokesperson Farhan Haq says the Office for the Coordination of Humanitarian Affairs is alarmed by an increase in hunger, disease and displacement in famine-stricken regions of Sudan.\n\n\n\n\n\nThe Sudan Doctors Network says thirteen children died of malnutrition-related causes last month in a camp for displaced people in the western Darfur region of Sudan, where civil war has created the world’s worst humanitarian crisis.\n\n\n\n\n\nUNICEF reports a 46 per cent increase in the most deadly form of malnutrition among children in Darfur, compared with the same period last year.\n\n\n\n\n\nAid groups have pleaded for the warring sides to allow in more humanitarian assistance.\n\n\n\n\n\nMr Haq says the besieged city of Al-Fashir in Darfur is one of the worst-affected sites.\n\n\n\n\n\n\"In the besieged city of Al-Fashir, the state capital of North Darfur, local sources report that people are dying from hunger and malnutrition. Community-run kitchens have shut down due to lack of food stocks, and some residents have reportedly resorted to consuming animal feed. These cascading crises demand increased international support. The 2025 response plan seeking $4.2 billion to assist 21 million of the most vulnerable people across Sudan is currently 23 per cent funded.”\n\n\n\n\n\nMillions of people on coastlines across 12 countries, have returned home after being evacuated overnight.\n\n\n\n\n\nA tsunami warning has been downgraded in Japan and Hawaiian authorities are reporting minimal damage, after one of the strongest ever earthquakes was recorded off Russia.\n\n\n\n\n\nParts of Japan, including Hokkaido Prefecture and the Tohoku region, recorded a 60 centimetre swell.\n\n\n\n\n\nThere had been fears of a life-threatening tsunami for a number of countries after the 8.8 magnitude quake, but so far there have been only few minor injuries reported.\n\n\n\n\n\nWhat could be Australia's heaviest insect has been identified in northern Australia's high altitude rainforests.\n\n\n\n\n\nThe supersized stick insect, which is about 40cm long, was discovered in high altitude trees in Millaa Millaa in Queensland's Atherton Tablelands.\n\n\n\n\n\nIdentified by James Cook University researchers, the female specimen weighed 44g, significantly heftier than Australia's heaviest insect, the up-to 30g giant wood moth.\n\n\n\n\n\nThe next step in identifying and eventually naming the species is finding a male, which is proving difficult, due to the male's significantly smaller size.\n\n\n\n\n\nTo sport now and in swimming,\n\n\n\n\n\n21 year-old Harrison Turner has made history, securing Australia's first world championship medal in the mens' 200-metre butterfly.\n\n\n\n\n\nTaking the bronze medal, Turner toppled a 16-year national record, despite only just scraping into the finals of the event.\n\n\n\n\n\n\"If you told me I was gonna win a, sorry a bronze medal at the start of the year with a pb (personal best) of 1.57 (minutes) I would have said nah you're dreaming. So, I am lost for words.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-femmes-gigante-makes-big-move-as-chapman-shows-her-fight/exabrhvml",
        "title": "Tour de France Femmes: Gigante makes big move as Chapman shows her fight",
        "publish_date": "Thu, 31 Jul 2025 02:05:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Sarah Gigante has powered into the leading group at the Tour de France Femmes after a battling display during a marathon 165.8km ride from Jaunay-Marigny to Gueret.\n\n\n\n\n\nShe crossed the line at the end of the fifth stage just behind AG Insurance-Soudal teammate Kimberley Le Court Pienaar, the Mauritian who thus became the first African to win a stage at the Tour de France Femmes.\n\n\n\n\n\nIt meant a big move up the general classification for Gigante, the 24-year-old Victorian who climbed from 19th at the start of the day to eighth place, 55 seconds behind Le Court.\n\n\n\nChapman dropped back to finish 54th and and is 76th overall, 24:23 behind Le Court. But her efforts secured her the award for the most combative rider of the day.\n\n\n\n\n\nThe 29-year-old Le Court, who led the general classification after stage two but was overtaken by Marianne Vos (Visma-Lease a Bike), won a breakneck downhill push to the finish that included Gigante, edging out 2023 champion Demi Vollering.\n\n\n\n\n\nThe fifth stage, the longest in the Tour this year, went through relatively flat terrain before three climbs in the final 35km and saw several failed breakaway attempts as the peloton covered 46.5km in the first hour despite multiple crashes.\n\n\n\nGreen jersey holder Lorena Wiebes (SD Worx-Protime) recovered from a crash to rejoin the peloton, but struggled to keep up after the first climb, ultimately finishing 58th.\n\n\n\n\n\nAmerican Olympic champion Kristen Faulkner (EF Education-Oatly) abandoned the race after her third crash in three days. Maria Giulia Confalonieri, Elisa Balsamo and Monica Trinca Colonel also quit the race.\n\n\n\n\n\nVos, who stayed in the peloton behind a leading group for most of the race, attacked in the final 15km during the mountainous part of the stage, but fell behind during the final uphill push, dropping to sixth in the general classification.\n\n\n\n\n\nVollering (FDJ-Suez) rose to third overall, while Pauline Ferrand Prevot (Visma-Lease a Bike) moved up to second, sitting 18 seconds behind Le Court in the general classification.\n\n\n\n\n\nThe Tour continues on Thursday with a mountainous 123.7km ride from Clermont-Ferrand to Ambert.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/labor-has-passed-its-student-debt-cut-when-will-you-see-the-changes/73zlarrnq",
        "title": "Labor has passed its student debt cuts. When will you see the changes?",
        "publish_date": "Thu, 31 Jul 2025 01:02:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Three million Australians will have their student debt slashed as Labor passed the highly anticipated legislation through parliament.\n\n\n\n\n\nAs promised to voters, the Albanese government introduced the HECS debt bill to cut 20 per cent from existing university and TAFE debts as its first order of business last week.\n\n\n\n\n\nIt passed the Senate on Thursday morning, 36 votes to three. Crossbenchers David Pocock, Fatima Payman, and Tammy Tyrrell all voted with the government and the Greens.\n\n\n\n\n\nEducation Minister Jason Clare said the average $5,500 that Australians would save is a \"big deal\".\n\n\n\n\"That's a lot of weight off their back, and it will help a lot of young people that might be just out of uni, just out of home, just getting started,\" he told reporters before introducing the bill in the House of Representatives.\n\n\n\n\n\nThe laws aim to reduce student debt as well as reform the repayment system.\n\n\n\n\n\nHere's how they'll work.\n\n\n\nWhen can I expect my student debt reduction?\n\nThe Universities Accord Bill will apply a one-off reduction to student support loans including HELP, VET Student Loan and the Australian Apprenticeship Support Loan.\n\n\n\n\n\nThe cut will apply to debt levels retrospectively, before the 1 June indexation, but will take a few months for the Australian Tax Office to implement.\n\n\n\n\n\nBalances are expected to be revised by the end of the year, saving students and graduates roughly $16 billion.\n\n\n\nOpposition education spokesperson Jonno Duniam admitted the Coalition's position was \"a view that was not supported by Australians\", conceding \"we'll work\" with the government.\n\n\n\nHow is the repayment system changing?\n\nThe changes include reforms to the repayment system, ensuring compulsory repayments are marginal, as recommended by the Australian University Accord.\n\n\n\n\n\nThe threshold at which students are required to start paying back their loans will be lifted from $54,435 to $67,000.\n\n\n\n\n\nUnder the old system, an Australian earning $70,000 would have paid back $1,750 annually. Following the changes, this will be reduced by $1,300 to $450.\n\n\n\nREAD MORE How does a HECS debt affect your home loan borrowing power?\n\nThe measures are a recognition that course fees have increased — spiking under the Morrison government's Jobs-ready Graduates package — and younger Australians are paying high fees at a time when they are also looking to buy their first homes and start a family.\n\n\n\n\n\nThe adjustments do not apply to people earning above $180,000.\n\n\n\nCould other reforms be on the way?\n\nClare has flagged that further reforms are being looked at, particularly concerning the former Liberal government's job-ready graduates program.\n\n\n\n\n\nThe program aimed to fill skills shortages by making it cheaper to take courses such as teaching, nursing and psychology, while doubling the cost of popular degrees including law, communications, business, humanities and the arts.\n\n\n\n\n\nThe universities' accord final report branded the program \"deeply unfair\" last year, recommending that fees reflect future earning potential as part of 47 recommendations to reform the sector.\n\n\n\n\n\nUniversities Australia chief executive Luke Sheehy has welcomed the HECS bill but called on the government to repeal the jobs-ready graduates scheme.\n\n\n\n\n\nBruce Chapman, the economist who developed the HECS system, similarly said the top priority should be reviewing the price of each degree, because humanities students finish with the highest level of debt and end up being the lowest-paid graduates.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/and-just-like-that-recap-justice-for-steve-20250729-p5mio9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "And Just Like That recap: Justice for Steve!",
        "publish_date": "Fri, 01 Aug 2025 12:30:00 +1000",
        "category": "finance",
        "authors": [
            "Brodie Lancaster"
        ],
        "text": "This story contains spoilers for season three, episode 10 of And Just Like That...\n\nI woke up today excited to watch a new episode of And Just Like That... – something that hasn’t happened in almost four years. It’s been a long road, but here we are! Carrie’s going out at night and pashing someone hot! Praise be to The Woman.\n\nAlso: STEVE’S BACK. God, they really had me thinking he’d been put out to pasture (aka Coney Island).\n\n“MIRANDA??” David Eigenberg returns to And Just Like That. Credit: HBO Max\n\nBrady’s got his parents together to tell them he’s both going to culinary school – he’s been inspired by The Bear and falls asleep with Anthony Bourdain’s memoir on his chest – and going to be a dad. He got a girl pregnant, and she’s too far along to have an abortion.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/alex-noble-i-fight-you-fight-20250801-p5mjkk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alex Noble: 'I fight, you fight'",
        "publish_date": "Fri, 01 Aug 2025 12:28:41 +1000",
        "category": "sports",
        "authors": [],
        "text": "Alex Noble: 'I fight, you fight'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/we-have-a-bit-of-money-bulldogs-reveal-they-are-prepared-to-splash-the-cash-on-silvagni-20250801-p5mjiy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We have a bit of money’: Bulldogs reveal they are prepared to splash the cash on Silvagni",
        "publish_date": "Fri, 01 Aug 2025 12:20:45 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Western Bulldogs football boss Matthew Egan says Jack Silvagni is a tremendous talent, and the club has room in its salary cap to pursue the Carlton defender.\n\nSilvagni, 27, is weighing up a four-year offer from the Blues, but has met with Collingwood coach Craig McRae about a possible move to the Magpies.\n\nPlenty to ponder: Jack Silvagni is weighing up where to play next season. Credit: Getty Images\n\nThis masthead revealed on Wednesday that the Bulldogs had emerged as another potential suitor, and Egan confirmed their interest.\n\nHe said Silvagni’s excellent job on Aaron Naughton in round three, when the Bulldogs’ star was held to a late goal in an eight-point win, had not gone unnoticed.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/i-m-no-he-man-but-i-m-more-useful-than-those-muscly-posers-any-day-20250725-p5mhsd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I’m no he-man, but I’m more useful than those muscly posers any day",
        "publish_date": "Fri, 01 Aug 2025 12:15:19 +1000",
        "category": "lifestyle",
        "authors": [
            "Anson Cameron"
        ],
        "text": "I haven’t entered a gym since the last millennium, when an instructor took my shilling and promised to turn me into a he-man. At least, I thought he said “he-man”. He might have said “human”. Anyway, I got no closer to becoming a he-man than I did to becoming emperor of China. This failure has rankled. And I blame him.\n\nLately, gyms have emigrated from shopping centres and high streets to light industrial zones alongside car wreckers, chemical storage facilities and bikie HQs. You see muscled fellows wearing wisp singlets plodding along the backstreets like the strongest, simplest superhero in any franchise – the Hulk, the Thing – the type of erratic champion needing close and constant instruction from the mastermind of the gang lest he accidentally break North America.\n\nCredit: Robin Cowcher\n\nA whiff of the underworld accompanies bodybuilding for me. Is it the thuggishness muscle implies? The fact it can be turned so readily to standover work? Or the fact bikies and crime bosses have recently got so massive? Watching a cop trying to cuff a Coffin Cheater these days is like watching a toddler attempt a Rubik’s Cube.\n\nMaybe muscle gym membership should come with an ankle tracker. One of those devices parolees wear so they can’t slip down to the pub on Tuesday arvo, slurp daytime beers and slide back into the life. You want the Gold Class membership that comes with caramel flavoured “protein shakes”? OK, put this anklet on and surrender your passport.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/the-ultimate-comfort-food-julia-busuttil-nishimura-s-bean-porcini-and-pasta-soup-20250729-p5mik3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The ultimate comfort food’: Julia Busuttil Nishimura’s bean, porcini and pasta soup",
        "publish_date": "Fri, 01 Aug 2025 12:08:33 +1000",
        "category": "lifestyle",
        "authors": [
            "Julia Busuttil Nishimura"
        ],
        "text": "Finish the soup with a drizzle of good-quality extra virgin olive oil. William Meppem\n\nFor me, beans or chickpeas cooked in broth with pasta is the ultimate comfort food. Here, tinned borlotti beans are met with a broth made from soaking dried porcini, which creates an earthy and warming dish. I’ve used fresh bay leaves, but a sprig of rosemary would be a lovely addition, too. A short pasta shape is best to use so you get some with each spoonful. Don’t skip the drizzle of good-quality extra virgin olive oil at the very end; it makes the dish.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/famous-names-and-exciting-prospects-we-name-the-top-25-prospects-for-this-year-s-afl-draft-20250728-p5migh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Famous names and exciting prospects: We name the top 25 prospects for this year’s AFL draft",
        "publish_date": "Fri, 01 Aug 2025 12:08:05 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Willem Duursma is the younger brother of Xavier (Essendon), Yasmin (Carlton AFLW), and Zane (North Melbourne). Credit: AFL Photos Gippsland Power/Victoria Country\n\nMidfielder/defender, 191cm, 21/6/2006\n\nU18 champs stats (avg): 24.3 disposals, 13.5 uncontested possessions, 2 clearances\n\n2025 All-Australian The latest AFL/W prospect from the Duursma clan – behind Xavier, Yasmin and Zane – is arguably the most talented player in this class. Duursma tends to take too many risky kicks, but that is purely about decision-making because he is technically excellent, which is why he regularly took kick-in duties for Country. Some recruiters see Duursma’s bold play as another tick rather than a red flag, but would like to see his contested game improve. He saved his best for last at the championships, producing a 27-disposal effort against Vic Metro before impressing for Casey last weekend, too. Duursma is in the No.1 mix, but not everyone has him in the top five. 3. Daniel Annable\n\nBrisbane Lions Academy/Allies\n\nMidfielder, 184cm, 5/4/2007\n\nU18 champs stats (avg): 24.8 disposals, 4.3 clearances, 5.5 inside 50s\n\n2025 All-Australian Daniel Annable playing in the Marsh AFL National Academy boys match between Australia U18 and Richmond VFL in April. Credit: via Getty Images It speaks volumes for how bulletproof Annable is as a prospect that he was not as efficient as usual with his kicking at the championships, but still finished just one vote behind Dyson Sharp for this year’s Larke Medal. The expectation is he will step straight into the Lions’ senior side next year and help them immediately, just like Will Ashcroft before him. His 28-touch, four-clearance performance in the VFL last weekend only confirmed those suspicions. Annable rarely fumbles, and makes quick decisions in congestion, where his handballing, in particular, releases teammates and creates scoring opportunities. Some even see a bit of Simon Black in him. 4. Cooper Duff-Tytler\n\nLoading Calder Cannons/Victoria Metro\n\nRuckman/forward, 200cm, 22/8/2007\n\nU18 champs stats (avg): 14.5 disposals, 4 marks, 0.8 goals\n\n2025 All-Australian The upside is tantalising with Duff-Tytler, whose athleticism and follow-up work remind scouts of Fremantle star Luke Jackson. His running goal from barely inside 50, off a handball receive, against Oakleigh in the opening round of the Talent League was one such example. There are some doubts that Duff-Tytler can be a No.1 ruckman in the AFL, given his relative lack of height and queries on his ruck craft. However, there is confidence he can be highly valuable as a forward-ruck, if that was how his career panned out. Duff-Tytler took some strong contested marks in the championships and has good skills for a big man. 5. Harry Dean Murray Bushrangers/Victoria Country\n\nDefender, 193cm, 13/11/2007\n\nU18 champs stats (avg): 15.3 disposals, 3.5 intercept marks, 7.8 intercept possessions\n\n2025 All-Australian\n\nThe son of dual Carlton premiership backman Peter is set to continue the family’s legacy at the Blues. He will eventually be a wonderful complement to Jacob Weitering down back with his intercepting skills, athleticism, competitiveness, aggression, skill and composure. The consensus was that Dean would be viewed as a top-15 pick by the end of the championships – but that prediction sold him short. The standout defender in this year’s crop is considered a top-10 lock now, and many rate him even higher. Dean’s height means he is less likely to be an option on the Sam Darcys and Riley Thilthorpes of the league, but he projects as a gun No.2 defender. 6. Dylan Patterson Gold Coast Suns Academy/Allies\n\nDefender/wingman, 183cm, 1/9/2007\n\nU18 champs stats (avg): 19.8 disposals, 5 rebound 50s, 400 metres gained\n\n2025 All-Australian There is no one more exciting in this class than Patterson, whose brilliant goose step is a nod to his rugby league background. He is a triumph for the AFL’s northern academies, given several NRL-aligned clubs were desperate for his signature by the time he turned 15. He has difference-making speed, loves taking opponents on, is always trying to create something, and has even drawn Andrew McLeod comparisons for the way he moves. Patterson’s decision-making needs work, and he can fade in and out of games, but he should be a serious weapon for Gold Coast for a very long time. This ranking might be too conservative.\n\n7. Dyson Sharp Central District/South Australia\n\nMidfielder, 188cm, 23/5/2007\n\nU18 champs stats (avg): 27 disposals, 3.3 centre clearances, 6.5 inside 50s\n\n2025 All-Australian (captain) Sharp has silenced critics who once considered him just a “man-child”. The powerful onballer was outstanding in trial games pre-championships, and went on to dominate throughout the carnival to win the Larke Medal and stamp himself as a top-10 selection. Sharp is physical and competitive in the contest, wins centre clearances for fun – in part thanks to his high football IQ – has underrated burst with his first few steps out of stoppages, and is more athletic than some gave him credit for. He can rush at times and not be as clean with his disposals, but that is common with inside midfielders, given the job description. Sharp is also highly regarded for his leadership. 8. Josh Lindsay Geelong Falcons/Victoria Country\n\nDefender/midfielder, 183cm, 7/4/2007\n\nU18 champs stats (avg): 22.3 disposals, 4.8 intercept possessions, 444 metres gained\n\n2025 All-Australian Perhaps, only Willem Duursma rivals Lindsay as the best kick in the 2025 class. Lindsay has played as a midfielder at times, but is more likely to play at half-back and on a wing at AFL level, where his kicking skills, elite endurance and reliability come to the fore. He has already proven himself as a big-game player – including being Team Heppell’s best player in the 2024 Futures game on grand final day – and is viewed as one of the safest picks in the draft. One scout described Lindsay as “pretty bulletproof”. The Falcons product makes up for not having breakneck speed with his game sense and ability to see opportunities before others. 9. Mitch Marsh West Adelaide/South Australia\n\nForward, 191cm, 15/2/2007\n\nU18 champs stats (avg): 8.5 disposals, 6 marks, 3 goals\n\n2025 All-Australian Marsh surged up draft boards with a series of impressive championships performances that saw him lead all players with 12 total goals, including bags of five and four against Vic Country and the Allies, respectively. He is not key-position height, so he will be a third tall up forward in the AFL, but is excellent overhead, finishes well and has genuine range on his left boot. What also appeals about Marsh is the belief he can be much more than just a forward – and there is talk he will perform different roles late in the season, including on a wing. There are scouts who see similarities in Marsh to a young Jordan Dawson, and his coachability also received a tick.\n\n10. Sam Cumming North Adelaide/South Australia\n\nMidfielder/forward, 186cm, 27/7/2007\n\nU18 champs stats (avg): 17 disposals, 3.3 inside 50s, 1 goal\n\n2025 All-Australian You will struggle to find a recruiter who places Cumming outside the top 15, but an increasing number have him in the top 10, even while accepting there are rough edges on him as a prospect. He rotated between the midfield and attack for South Australia, and made an impact in both areas – blending toughness, strength, power and aggression with a defensive commitment that is rare in teenage prospects. As a forward, Cumming is good overhead and kicks plenty of goals. There are question marks on his running ability and kicking, but he has performed strongly at SANFL league level, on top of his championships output, and there is upside here. 11. Aidan Schubert Central District/South Australia\n\nForward/ruckman, 198cm, 21/12/2007\n\nU18 champs stats (avg): 17 disposals, 3.3 F50 marks, 2.5 goals\n\n2025 All-Australian Few players, if any, improved their draft stock more at the championships than Schubert, who established himself as a standout in a class thin on key forwards. He is a strong runner – the attribute most recruiters bring up first about him – takes lots of marks as a result, competes hard, is agile, and can go in the ruck. Schubert took six contested grabs against Metro and no fewer than three marks inside 50 in any of his four championships matches. His awkward kicking style is the other talking point with Schubert, but bothers some more than others. 12. Jacob Farrow West Perth/Western Australia\n\nDefender/midfielder, 188cm, 21/9/2007\n\nU18 champs stats (avg): 19 disposals, 1.8 intercept marks, 464 metres gained\n\n2025 All-Australian There is a lot of love in recruiting ranks for Farrow, who looks set to be the first West Australian drafted. He is the modern prototype for a half-back flanker: laser-like left boot with easy power – he went at almost 87 per cent kicking efficiency at the championships – racks up intercepts with his ability to read the play, marks well overhead, and moves the ball quickly. Farrow is also a sharp handballer. There is a chance he pushes into top-10 contention as the year progresses, particularly if he proves he can play impactful midfield minutes.\n\n13. Oliver Greeves Eastern Ranges/Victoria Metro\n\nMidfielder, 191cm, 7/2/2007\n\nU18 champs stats (avg): 25 disposals, 11.8 contested possessions, 4.5 clearances\n\n2025 All-Australian Only Dyson Sharp won more disposals at the championships than Greeves, who finished runner-up to the South Australian for the Larke Medal. He boasts great size and strength for a midfielder, and his football smarts come to the fore in contested situations, which is a significant reason he is such a consistently big ball-winner. Recruiters would like to see Greeves place more emphasis on his defensive running and improve his decision-making with his kicking, but believe he is the type of player who will be able to adjust once he graduates to AFL level. 14. Lachy Dovaston Eastern Ranges/Victoria Metro\n\nForward, 177cm, 29/5/2007\n\nU18 champs stats (avg): 12.8 disposals, 5 contested possessions, 2.3 goals\n\n2025 All-Australian\n\nIf you want a small forward this year, then Dovaston is the one to target. Hailing from the same Talent League club as Nick Watson, recruiters believe the mulleted goalsneak is more advanced than the Hawk at the same age with his forward-50 pressure and tackling. He is equally comfortable slotting a set shot as dribbling one through or snapping. What has impressed recruiters about Dovaston’s development is his greater willingness to involve others, and his improved running capacity is evidenced in how hard he works getting up and down the ground. 15. Xavier Taylor Eastern Ranges/Victoria Metro\n\nDefender, 191cm, 30/1/2007\n\nU18 champs stats (avg): 15 disposals, 1.5 intercept marks, 5.8 intercept possessions This ranking reflects the value of what Taylor does well: he can play on taller and smaller forwards, has a knack for being in the right spots to intercept, is aggressive, competitive, agile and athletic, and has a safe pair of hands. As it was put to this masthead, every club needs a versatile defender like him. However, Taylor is polarising. Some clubs rate him around here, and others have him much lower, in large part because of his at-times dubious decision-making, including an unfortunate tendency to kick into the man on the mark.\n\n16. Max King Sydney Swans Academy/Allies\n\nForward/midfielder, 192cm, 1/9/2007\n\nU18 champs stats (avg): 7.3 disposals, 2.7 marks, 0.7 goals The most common perspective on King is you have to envision what he could become when rating him as a prospect rather than focusing too much on his current output. The breakout game recruiters hoped for at the championships did not occur, but he is an exceptional athlete, and it is easy to fall in love with his potential when he pulls down one of his sky-scraping marks. King remains a low possession-winner, but if that does not change, he could still be valuable as a high-impact forward. That said, there is risk here. 17. Harley Barker Sturt/South Australia\n\nWingman, 187cm, 2/5/2007\n\nU18 champs stats (avg): 16 disposals, 3.3 inside 50s, 5.8 score involvements\n\n2025 All-Australian\n\nSam Grlj is in the frame to be a first round selection. Credit: via Getty Images Barker loomed as a top-10 smokey if he finished the season strongly, but suffered an ACL rupture after the championships, playing in the under-18s for Sturt. That setback makes it difficult now to rank him because recruiters like him and feel like he boasts similar attributes to fellow wingman Caleb Windsor, a top-10 selection two years ago. Barker’s size, speed, endurance and skill combination made him a weapon for South Australia, repeatedly involved in scoring chains but also willing to push hard into defence to offer support. 18. Sam Grlj Oakleigh Chargers/Victoria Metro\n\nMidfielder/defender, 182cm, 26/7/2007\n\nU18 champs stats (avg): 17 disposals, 12.3 uncontested possessions, 2.3 intercept possessions Once viewed as a potential top-five pick, Grlj has work to do to prove he even warrants being taken here. His first month of the season was electric, where his speed, line-breaking run and intensity had scouts likening him to Max Holmes. Those traits are coveted and mean Grlj is unlikely to fall too far, but there are concerns about his lack of polish and habit of rushing when he has the ball. There was also disappointment about his lack of midfield time for Metro at the championships, but there is still a good chance he climbs the order again.\n\n19. Louis Emmett Oakleigh Chargers/Victoria Metro\n\nRuckman/forward, 199cm, 23/3/2007\n\nU18 champs stats (avg): 12.7 disposals, 4.3 marks, 2 clearances Emmett’s endurance for a big man is outstanding and means he should become a valuable link-up man, whether playing in the ruck or in attack. Like Cooper Duff-Tytler, he lacks genuine ruck height, so he might need to make his AFL living as a forward-ruck – and scouts are encouraged with how his forward craft is coming along. Recruiters were a tad underwhelmed by his championships performances, but his last match for Oakleigh, where he amassed 22 disposals, 15 contested possessions and kicked two goals highlighted his upside. 20. Adam Sweid Calder Cannons/Victoria Metro\n\nMidfielder/forward, 175cm, 14/9/2007\n\nU18 champs stats (avg): 17 disposals, 4.3 clearances, 1 goal\n\n2025 All-Australian\n\nSweid is tied to Essendon as a next generation academy product, and almost everyone you speak to raves about him. He is tough, strong, smart, consistent, uses the ball well and is a regular goalkicker. As always with someone of Sweid’s height, there are queries on his ability to be a full-time midfielder, but the expectation is he will become a useful high half-forward who can go through the midfield, where his clearance-winning ability is proven. Sweid is also a regular goalkicker. He is a popular teammate, too, which only adds to his appeal. 21. Archie Ludowyke Sandringham Dragons/Victoria Metro\n\nForward, 197cm, 19/11/2007\n\nU18 champs stats (avg): 4 disposals, 1 mark, 1.7 score involvements One of the toughest players to assess in the draft pool. Ludowyke’s had an interrupted season, and won’t play again this year because of a PCL injury he sustained in Metro’s win over the Allies, so talent scouts will have to project what he could be. He failed to kick a goal in any of his three championships matches, but has hauls of five and four goals this season for the Dragons. Ludowyke has good size and athleticism for a key forward, and flies for marks, so it would not surprise if a forward-needy club takes him higher than this. 22. Harry Kyle\n\nSydney Academy/Allies\n\nDefender/midfielder, 188cm, 16/7/2007\n\nU18 champs stats (avg): 12.5 disposals, 10.3 uncontested possessions, 1.3 intercept possessions There are scouts who have him above Max King as Sydney’s best academy prospect, and he could be a riser in the second half of the season. Kyle is in his first year in the academy, so there is enormous upside here – and his size, running ability and versatility all appeal to recruiters. The belief is he could play anywhere from the wing to half-back or even an inside midfield role eventually. As with some others, there is a greater focus on projection than his performance this season, but he is working his way into first-round calculations. 23. Sam Swadling West Perth/Western Australia\n\nMidfielder, 187cm, 16/1/2007\n\nU18 champs stats (avg): 19 disposals, 12 uncontested possessions, 2.8 clearances\n\n2025 All-Australian Loading\n\nSwadling has little trouble getting his hands on the ball and was one of Western Australia’s most consistent performers at the championships, resulting in All-Australian selection. He tends to handball more than kick, but does so in an attacking manner that releases his teammates to create opportunities, and has the power scouts like to see from midfielders. Swadling can be prone to kicking errors with aggressive decision-making, but he has plenty of fans in recruiting ranks and is already being exposed to senior football in the WAFL. 24. Riley Onley Murray Bushrangers/Victoria Country\n\nMidfielder, 194cm, 30/3/2007\n\nU18 champs stats (avg): 23 disposals, 4 clearances, 6.8 score involvements\n\n2025 All-Australian Onley is huge for a midfielder and uses that height to his advantage to make his mark in the contest. He is highly talented, good athletically and typically makes good decisions with the ball, and his best deserves a higher ranking than this. Onley’s impressive championships campaign helped his cause. The shame for him is a serious hamstring tendon injury sustained in the final term against Vic Metro means he won’t play again this season. 25. Beau Addinsall",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/collingwood-s-star-recruit-was-struggling-how-shooter-d-mac-and-fly-came-to-the-rescue-20250731-p5mjd1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Collingwood’s star recruit was struggling. How Shooter, D-Mac and Fly came to the rescue",
        "publish_date": "Fri, 01 Aug 2025 12:00:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "Collingwood coach Craig McRae can see the wheel starting to turn for high-profile recruit Dan Houston.\n\nHis positioning is becoming sharper. His running patterns are becoming more instinctive. And his mind seems less cluttered.\n\nThe Magpies want to find ways to give Dan Houston more of the ball Credit: AFL Photos via Getty Images\n\nAlthough such shifts are often barely recognisable to anyone but the trained coach’s eye, there were positive signs in the second half against Richmond, when he helped Collingwood open up a break on the Tigers.\n\n“He is going forward,” McRae said. “If you watch him closely enough he is heading towards [becoming] a player who could have a significant impact for the rest of the year.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/conferences-mid-week-games-and-10-team-finals-how-a-20-team-nrl-competition-could-work-20250731-p5mj90.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Conferences, mid-week games and 10-team finals: How a 20-team NRL competition could work",
        "publish_date": "Fri, 01 Aug 2025 11:57:25 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "The model posed by this masthead is based on a four-conference system consisting of five teams in each conference.\n\nThat model, however, raises issues with the number of games played in a regular season. If teams played the other teams in their conference twice, and the other conference once, the competition would be extended from 24 to a 28-game season. That’s never happening.\n\nWhat the conferences could look like. Credit: SMH\n\nIn a 20-team competition, there are two viable options. One option is to split the competition into two 10-team conferences.\n\nThere has been considerable debate in recent years about the NRL transitioning to a conference-based system, similar to those of several major American sports.\n\nThe NRL has started sitting down with potential broadcast partners to open discussions about the future of the sport. With a team in Perth entering the competition in 2027 and a team in Papua New Guinea the following year, the NRL is just one team away from reaching its desired 20-team competition. That could come as early as 2030. This masthead has spoken to the key stakeholders in the sport to map out what a 20-team competition could look like, including the introduction of conferences and a change to the State of Origin period.\n\nAdd articles to your saved list and come back to them any time.\n\nWith nine Sydney teams, it makes it difficult to place them into two clear conferences. By placing the “Big Six” Sydney teams in terms of fan bases and history (Roosters, Dragons, Rabbitohs, Bulldogs, Tigers and Eels) into two separate groups, you ensure more blockbuster games for broadcasters and fans.\n\n“Conferences done correctly, yeah, absolutely, I like it. When I first started as chairman, I had a delegation of high-profile coaches and administrators. They wanted conferences, so I’ve always had it in the back of my head. Tribalism is the main ingredient in our sport.”\n\n“It’s just a matter of when and how we can get there. We want to ensure the first two teams are successful. The Dolphins were successful. We want to make sure the Perth Bears and PNG are equally successful. That might bring the 20th team forward. The success of the two teams will determine how quickly we can move to a 20-team comp.\n\nThe current draw sees some teams play opponents twice, with no formula or fairness behind the selections.\n\nThat allows teams to play each other once (19 rounds), then a rivalry month leading into the finals series, when teams square off against their conference opponents for the second leg of their home-and-away fixtures.\n\nThis masthead placed the Perth Bears into a Sydney conference due to their North Sydney fan base. Placing them in another conference with teams like the Warriors, Cowboys or Papua New Guinea will only add to the extensive travel those teams will undertake. The 20th team has also been given to a second New Zealand team.\n\n“We get back to playing a proper draw, not all over the place like it is now. That’s fairness. Now, the top clubs play each other twice, and the bottom teams play each other twice, and we end up somewhere in the middle and get a close comp. Everyone says we’re geniuses, but we’re not. It’s engineered.”\n\n“Playing the Sydney teams twice is better for us than playing the Titans or Dolphins at home. Revenue will go through the roof. You’ll get better crowds. It’s fair.\n\nThe NRL could be in for huge changes. Credit: Getty/Michael Howard\n\n“We know they’re concentrating on the most compelling competition they can and getting full value for our broadcast rights. One of the great things about the conference system is the certainty it provides you year in, year out.\n\n“Peter and Andrew have our complete support and confidence as they go into these broadcast negotiations,” South Sydney chief executive Blake Solly said.\n\n“That would drive broadcast and Pay TV revenue for all parties. Ten games aren’t easy to schedule each week, but achievable. There are exciting times ahead for rugby league.\n\n“I wouldn’t want another team in New Zealand, I would want another southern Queensland team,” former Channel Nine boss David Gyngell said.\n\nThe same goes with the clubs, who would be significantly impacted by a draw that would only see teams play each other once (19 rounds).\n\nMost would agree that the current NRL season, at 24 games with three byes, is too long. However, broadcasters pay top dollar for a product that provides commercial partners a substantial window of promotion.\n\n“We would need convincing as an out-of-town club whether a conference system would be good or not,” Raiders chief executive Don Furner said in fear of the disadvantage of the additional travel.\n\nWhile the teams in the southern conference would be required to travel further distances than the teams in the Sydney conferences, it is no more travel than they are currently being asked to undertake.\n\n“Particularly the opportunity to build strong rivalries inside your conference. Anyone who has an interest in the NFL knows how passionate those rivalries can be in the conference and how much fans look forward to the fact they are taking place home and away every year.”\n\nThe Rugby League Players’ Association believes a 19-20 game regular season is an optimal amount to reduce the workload on players and minimise injuries.\n\n“The season schedule has desperately needed serious innovation for years, and we are and have always been up for that discussion,” RLPA chief executive Clint Newton said.\n\n“With a new broadcast deal approaching, we’ve got the best chance in a long time to stop patching problems and start building something progressive and transformative, but sustainable.\n\n“Fewer games per NRL club, a better-aligned Origin period, and a genuine international window. If we get those right, we can deliver the content broadcasters need, grow the game globally, and better protect players’ welfare and careers.”\n\nClubs are mindful, however, that reducing the season to 19-20 games will impact their corporate revenue, sponsorship deals and the income from tickets and membership.\n\n“I understand the need to protect the players and the increasing demands of the game, but that would be a major change from where we are right now,” Eels chief executive Jim Sarantinos said.\n\nThe proposed NRL calendar. Credit: SMH\n\n“Reducing the number of home games for each club from 12 to 9 would have a significant impact on how clubs engage with fans, members and sponsors, and the business model across the whole game would need to change.”\n\nThere are currently 204 games in the NRL regular season. Even if the competition is reduced by one round, the NRL will increase the number of regular-season games to 230 (13 per cent increase) with the addition of two extra games per round with the new teams.\n\n“Personally, I’d like to see the season shorter,” Furner said.\n\n“It’s such a long season with rep football and trial matches. If there was a way to satisfy the broadcasters with less NRL games, that would be an ideal outcome. I look at the amount of games in the NFL, and it works for them.”\n\nComparing the difference between the current season structure and what it would be like under the proposed 20-team, four-conference system. Credit: SMH\n\nFinals format\n\nIt’s imperative to place a greater importance on conference rivalry games. Incentivising the conference champion will only add to the spectacle of some of the blockbuster matches.\n\nThe reward for the highest-ranked team in each conference (based on the overall ladder) is a direct pathway into the finals series.\n\nThose teams would be seeded from 1-4 based on the best overall win/loss record throughout the season.\n\nThat would guarantee the conference champion a second chance if they lose their opening game of the finals. Those teams, based on the current NRL ladder after 21 rounds, would be the Raiders, Bulldogs, Broncos and Sharks.\n\nThe other six teams would be seeded from 5-10 in order of their overall standing on the combined ladder.\n\nIn the first week of the finals, 7th would play 10th and 8th would play 9th for the right to progress into the final eight the following week.\n\nTeams 1-6 would be given the week off in the first week of the finals. This would help negate the current situation, which sees many teams resting their players in the final round of the regular season to prepare for the finals at the expense of the integrity of the competition.\n\nThe 10-team finals series format based on the 2025 calendar. Credit: SMH\n\nThe opening weekend of the finals would determine the two teams that would join the remaining six teams in week two of the finals. From that point, the current top eight finals system would be applied.\n\nIt gives broadcasters an additional two sudden-death finals games to sell to commercial partners and provides the game with an uplift in attendance and television viewers.\n\nBy reducing the regular season by one round and extending the finals series by one week, the NRL grand final will remain on the October long weekend.\n\n“I used to think the ideal model was to split the competition into two conferences and have your Sydney grand final and out-of-Sydney grand final, with the two teams playing in some sort of Super Bowl,” South Sydney coach Wayne Bennett said.\n\n“Once we get to 20 teams, there will be too many teams for that. Maybe the four conference system is the way to go because we need more rivalry games.”\n\nState of Origin period\n\nThe television ratings speak to the beast that is State of Origin, but often the representative fixture comes at the detriment of the NRL competition.\n\nClubs pay their premium players top dollar, only to lose some of them to State of Origin, often picking up injuries or returning both physically and mentally fatigued.\n\nQueensland celebrate winning this year’s State of Origin series. Credit: Getty Images\n\n“Currently, it’s the worst model we can have,” Bennett said.\n\n“It’s the timing of it and how it least impacts the clubs. One of the great fallacies of our game is that the best team doesn’t always win the grand final. Not every season, but Origin has impacted on the finals and the premiers. I laugh because I’ve coached all these years and with a high number of Origin players in my teams.\n\n“I’m qualified to tell you how much it takes a toll. I have no doubt we should have gone back-to-back premierships at the Dragons, but Origin killed us. When the players came back they were physically drained and mentally shot after a brutal series. We never recovered from that.”\n\nWayne Bennett with players Jamie Soward and Dean Young at the Dragons after the 2010 grand final win. Credit: Getty\n\nState of Origin belongs in the middle of the season, but does it have to last so long? Does it have to have such a significant impact on the NRL teams?\n\nThere are currently 53 days between when the players arrive in camp for game one and when they leave after game three.\n\nThey do return to their clubs in between matches, but the NRL can’t continue to allow Origin to have such a major impact on clubs.\n\n“The Origin schedule is a bit like Frankenstein’s monster,” Solly said.\n\n“The NRL competition provides the ARLC with 90 per cent of its revenue, yet a three-game series disrupts it for almost 30 per cent of it. No other premier sporting club competition would accept that disruption. People at the NFL, the NBA, the Premier League think we clubs are mad in accepting that position.\n\nPayne Haas was on light duties leading into all three Origin games this year. Credit: Getty Images\n\n“The current Origin window is a complete disaster for clubs. It takes our best players away too often and for too long. We understand that this current system was a product of this TV cycle.”\n\n“We much preferred the Wednesday-Sunday-Wednesday schedule of the previous system, and we’ve been vocal in seeking change from the NRL. We respect that Andrew and Peter can’t do anything in this cycle, but everyone in the game wants a shorter Origin period with less disruption to the NRL competition.”\n\nHow the State of Origin period would work, based on the 2025 calendar. Credit: SMH\n\nUnder the model proposed, the Origin period would be reduced from 53 days to 29.\n\nPlayers would remain in camp for the duration of the series, playing the first game on a Wednesday, the second game 10 days later on a Sunday, and the third 10 days later on a Wednesday.\n\n“I would debate the duration of the State of Origin as that’s a critical component,” Gyngell said.\n\nThe model proposed would see NRL clubs lose Origin players for just one game each.\n\nSplit rounds and mid-week matches, similar to the English Premier League over the Christmas period, would give broadcasters an 18-day footy festival each May (combination of NRL games, men’s Origin, women’s Origin, under 19’s Origin and under 21 Test matches involving Australia, New Zealand, Tonga and Samoa).\n\n“I think the system we have now is working,” NSWRL boss Dave Trodden said.\n\n“I think under any model that will be satisfactory for the broadcasters, there’ll be a consequence to the clubs. The most important consideration is going to be what the broadcasters think of the schedule.\n\n“State of Origin drives so much of the commercial value in the broadcast deal, so that will be in the minds of the decision makers. With the massive ratings they have been getting the last couple of years, broadcasters will be reluctant to mess around with the schedule too much.”\n\nThe proposed changes would ensure Origin players remain in camp throughout the series, negating the risk of injuries suffered when returning to club land and continually building on the hype of the series without the stoppages that currently exist.\n\n“As long as the solution doesn’t compromise the quality of the product, because Origin is so big and so unique, it needs to be taken into account,” Queensland Rugby League boss Ben Ikin said.\n\n“But more importantly, as long as the rules that they change advantage Queensland and not NSW, we’ll be fine.”\n\nInternational window\n\nLike the Six Nations in European rugby union, there is an opportunity to build an annual competition that helps grow the international game.\n\nA Five Nations tournament involving England, Australia, Samoa, Tonga and New Zealand would be played each year (non World Cup years) over five weeks, starting a fortnight after the grand final.\n\nThe proposed Five Nations tournament. Credit: SMH\n\nThe annual leave entitlements of the players would prohibit the competition running longer than five weeks (mid-November), therefore, the winner of the Five Nations would be determined by the ladder and not a final.\n\n“Because of the club’s success we’ve gone deep into the year, and that has been compounded by representative player selection,” Panthers rugby league chief executive Matt Cameron said.\n\n“Although we’re really proud of this success, it does put pressure on the preseason time frame and any future model that would help alleviate these pressures would certainly be a benefit to all clubs.”\n\nNRL is Live and Free on Channel 9 & 9Now\n\nMichael Chammas and Andrew “Joey” Johns dissect the upcoming NRL round, plus the latest footy news, results and analysis. Sign up for the Sin Bin newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/australia-dodges-tariff-increase-as-trump-keeps-rate-at-10-per-cent-20250801-p5mji6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia dodges tariff increase as Trump keeps rate at 10 per cent",
        "publish_date": "Fri, 01 Aug 2025 11:47:19 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Washington: Australian goods will continue to be subject to a US tariff of 10 per cent after President Donald Trump maintained the current “baseline” rate – despite earlier threats to hike the levy to 15 or 20 per cent.\n\nTrump issued an executive order on Thursday night, Washington time, confirming new tariff rates for several trading partners following “deals” struck with their leaders, as well as revised tariffs for a number of other countries.\n\nOut with the old: the “reciprocal tariffs” announced on April 2 have been replaced with different rates. Credit: Bloomberg\n\nAustralia received the lowest rate, 10 per cent, when the so-called reciprocal tariffs were announced on April 2. Australia was not named among the changes on Friday (AEST), and a White House fact sheet confirmed any countries not on the new list would remain on 10 per cent.\n\nAustralian officials also confirmed the rate would remain at 10 per cent, the same as the United Kingdom. But some countries faced increases: Trump hiked the tariff on goods from New Zealand to 15 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/how-a-155-billion-eco-paradise-fell-short-of-its-promise-20250730-p5mj3k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How a $155 billion ‘eco-paradise’ fell short of its promise",
        "publish_date": "Fri, 01 Aug 2025 11:45:00 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin"
        ],
        "text": "At 9am, the beachfront was empty, except for a Malaysian couple and their grandson playing near a white concrete staircase jutting out over the sand. Dubbed the “stairway to heaven”, it’s intended to be an Instagrammable spot, but it’s difficult to pass over its metaphor as a boondoggle leading nowhere. While waiting to check in, I wandered the grounds for five hours, encountering maybe 20 visitors or residents. This paucity contrasted with the number of groundskeepers, maintenance workers and security staff roaming the facility, ensuring every fallen leaf was swept, hedge trimmed and pool sparkling to maintain the vision of a safe and immaculate paradise. The Stairway to Heaven attraction at Forest City is designed to be an Instagrammable spot, but it could be interpreted another way: A project leading to nowhere. Credit: Lisa Visentin At the centre of the estate, an entire building has been dedicated to selling this dream. A large-scale model of the project spans the length of a salesroom floor, capturing the grandeur of the four-island plan spanning 14 square kilometres that seems destined to remain a fantasy. A promotional video playing in the background claims the city is home to 15,000 residents and “gradually growing”. By midmorning, a few Chinese buyers were flipping through brochures, outnumbered by staff ready to lock in a sale.\n\nFrom the outset, Country Garden gambled the success of its venture on the burgeoning Chinese middle class’ seemingly insatiable appetite for real estate. It pitched Forest City as a way for Chinese investors to diversify their assets offshore, while dangling visa incentives and the prospect of residency in Malaysia. It has proved a bad bet. In 2020, Chinese President Xi Jinping began cracking down on the credit binge that the country’s heavily leveraged developers had gorged on, setting in train a property-bubble bust that has wiped out wealth and confidence. A large-scale model of Chinese developer Country Garden’s four-island vision for Forest City in Malaysia, which takes up the floor of the salesroom. Credit: Lisa Visentin Across China, cities are now littered with the abandoned ambitions of its developers, many of them falling into ruin. Country Garden has more than 3000 unfinished projects and nearly 1 million outstanding homes to complete, according to Japanese investment bank Nomura. It did not respond to a request for comment. Forest City has also suffered from lingering resentment in Malaysia at the idea of a massive project being built for Chinese buyers. This was fuelled by then-prime minister Mahathir Mohamad, who in 2018 said foreigners would not be granted visas to live there, further dampening demand.\n\nVisa controls have since been eased under current Prime Minister Anwar Ibrahim. Even with price decreases – a one-bedroom apartment starts at 500,000 Malaysian ringgit ($182,190) – Forest City is unaffordable for many locals and remains pitched at overseas buyers. Forest City may not be the total ghost town it’s pegged as by the press, but it’s far from the portrait of a vibrant, thriving community. Forest City says its community has about 15,000 residents, but its grounds are quiet and many apartments empty. Credit: Lisa Visentin At midday, many of the shops in the mall next to the hotel were still shuttered, some seemingly permanently. Those that were open had no customers, and bored shop assistants sat glued to their phones at vacant counters. At one coffee shop, the server was slumped across a table, asleep. A prime selling point for Forest City is its duty-free status. But a licensing issue meant none of the four duty-free shops in the mall were selling alcohol − one of the main drawcards for visitors, especially those from Singapore, where extortionate taxes make a tipple all but a luxury.\n\nOne store was reduced to selling only chocolates, though upon entry its shelves were bare save for several boxes of wafer biscuits − a sales challenge that apparently required two shop assistants. One of them, a woman in her 40s, said she had lived in Forest City with her children for four years in an apartment tower behind the mall, having relocated from Kuala Lumpur. About 26,000 apartments have been built across dozens of towers in Forest City, many of them unsold. Credit: Lisa Visentin “There are many people who live in my tower,” she says, explaining that most of them were Malaysian renters who commuted into Singapore daily for work. “I like it here. It’s very quiet.” By sundown, foot traffic has picked up. A modest number of people have filtered onto the beach and a volleyball game is under way. The hotel seems reasonably buzzy, due partly to the fact that a tech school, led by US cryptocurrency investor Balaji Srinivasan, has set up shop in the lobby.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/you-ve-got-a-crazy-talent-on-your-hands-o-driscoll-backs-suaalii-to-thrive-in-rugby-20250728-p5miev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You’ve got a crazy talent on your hands’: O’Driscoll backs Suaalii to thrive in rugby",
        "publish_date": "Fri, 01 Aug 2025 11:40:29 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "“I know he’s been playing a bit of 15 for the Waratahs and he’s obviously so athletic, so from an aerial point of view, he’s a little bit like Israel Folau, giving him ownership of that backfield and that’s a great starting point,” O’Driscoll said. “I don’t know what his kicking game is really like, we haven’t seen much of it in union, but when you’re elusive and you’re strong, maybe you don’t have to pigeonhole him into being in one position, maybe he can play multiple positions. “The thing at 13 is he can be creative and destructive, but at 15, if you’ve got a good team that doesn’t kick the ball stupidly to players like him and you press hard, it can be difficult to really make a difference. “Whereas at 13, if you get a reasonable platform, you should be able to show off your skill set.” Joseph-Aukuso Suaalii has received a ringing endorsement from one of the greatest centres to play the game Credit: Getty Images\n\nO’Driscoll was in the stands at the MCG to see the Lions stage a memorable comeback and seal the series. As a player, he excelled at turnovers at rucks, understanding the physical risks involved in putting your head and neck over the ball. The Dubliner has watched the Carlo Tizzano and Jac Morgan penalty incident and understands both the Wallabies’ and the Lions’ arguments. “My gut was, and it’s very hard to say, biased. I think a year ago, that could have been a penalty, but I think the laws have recalibrated a little bit around understanding the confrontational part of the game,” O’Driscoll said. “It’s a very, very close call on both fronts, don’t get me wrong. We (the Lions) probably would have been annoyed, but it felt like I was happy to see it, but I don’t know if that’s just my bias. “You won’t see too many Lions or their supporters saying it was a penalty. I asked one Australian friend, whose opinion I would count, and he said, ‘no penalty for me, mate’. He’s the only Aussie that I’ve heard saying that. I’m not telling you who it was, but a very credible individual in my book. “So listen, it was one of those (incidents), I think we’ll argue forevermore. But I think from a technique point of view, Jac Morgan is spot on and from a Lions point of view, it’s a great clear out.”\n\nThe former Ireland great understands that with a high possibility of the Lions’ first Test series whitewash in Australia since 1904 ahead of Saturday, it puts the Wallabies’ place on the touring side’s schedule into question. O’Driscoll was impressed by the Wallabies’ fightback in the second Test and believes that while Lions tours may evolve from their current rota in the Southern Hemisphere, the quality of rugby in this country can never be taken for granted in the future. Carlo Tizzano of the Wallabies receives medical attention after the clash with Jac Morgan. Credit: Getty Images “It’s funny, we’re in a world now that you can’t just be hell-bent on tradition, you have to have a malleability to circumstances changing and maybe looking at new opportunities and new options,” O’Driscoll said. “I just think at the moment, this particular Aussie team isn’t as strong as others, but in a cycle of 12 years time, the game changes.\n\n“They (the Wallabies and Lions) were probably even enough teams 12 years ago and they were very even teams 24 years ago, I think this is just a better Lions outfit now, but that’ll change. “The only thing is, Australia has struggled for a while. It was the first time being knocked out of the group stage of the World Cup, and it’s just gotten away from them a little bit. “I don’t know what the participation level is, but interest levels have definitely waned a bit, so it’s just on a bit of a slide at the moment. “But that’s not to say you can’t get that back. So I wouldn’t be in a mad rush to be writing Australia off just yet. “But is there the potential for an alternative? People have talked about a Lions tour to France. Who knows? I think you’ve got to have an open mind to these things, but I wouldn’t be in a rush to write off Australia either.”\n\nBrian O’Driscoll speaks to the Sydney Morning Herald in Sydney ahead of the third Test between the British and Irish Lions. Credit: INPHO/Tom Maher O’Driscoll lost 36 of his 84 Tests as captain of the Lions and Ireland, joking that he should “have a PhD in panic”. The Irishman is thus well qualified to deal with a distraught dressing room and understand how Wallabies captain Harry Wilson can generate a final memorable performance from his team in Sydney. “You’re allowed 48 hours to grieve. Just 48 hours, that’s fine, you’ve got to feel sorry for yourself and lick your wounds a little bit and then pick yourself up...it’s not about the result, it’s about putting together a similar performance,” O’Driscoll said. “They (the Wallabies) really were unlucky not to get the result, they played a great game and I think there’s so much positive to take from that... “You can’t be a flash in the pan, you can’t just get yourselves up for a test match that really matters, sometimes the hardest ones are the ones that, on the face of it, don’t matter because there’s no outcome at the end and you can’t win from it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/swimming/summer-bummer-mcintosh-to-skip-commonwealth-games-20250801-p5mjgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Summer bummer: McIntosh to skip Commonwealth Games",
        "publish_date": "Fri, 01 Aug 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Singapore: The Commonwealth Games’ battle for relevance has taken a hit, with Canadian swimming sensation Summer McIntosh set to skip next year’s event.\n\nThe 18-year-old, widely regarded as the best female swimmer on the planet, claimed another gold medal at the world championships in Singapore on Thursday night, powering to victory in the 200m butterfly ahead of Australia’s Lizzy Dekkers, who took bronze.\n\nMcIntosh’s star power is undeniable, but a scheduling clash appears set to rob the 2026 Games of one of its biggest drawcards – unless there’s a last-minute change of heart or a campaign to lure her back.\n\nThree well-placed swimming sources, speaking on the condition of anonymity due to the sensitive nature of the issue, told this masthead McIntosh will not represent Canada at the Games, which run from July 23 to August 2 in Glasgow.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/opera/sexy-and-delicious-this-mozart-opera-is-made-for-our-times-20250728-p5mibu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sexy and delicious, this Mozart opera is made for our times",
        "publish_date": "Fri, 01 Aug 2025 11:37:23 +1000",
        "category": "entertainment",
        "authors": [
            "Barney Zwartz"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In 1781, Wolfgang Amadeus Mozart – one of the most profound geniuses the human race has produced – sat as a servant at the table of the Archbishop of Salzburg, above the cooks but below the valets. Already a much-travelled and admired child prodigy, he felt the humiliation acutely. He could hardly have imagined that within a year he would have left the Archbishop’s service, propelled literally by a boot up the backside from the Archbishop’s secretary, and be revelling in the massive success of his first really great opera, The Abduction from the Seraglio. He had taken his first trailblazing steps from musician as servant to musician as entrepreneur. Now, 244 years later, Victorian Opera is launching a new production of the opera, very much designed for 2025 Melbourne, with a shortened title, a brand new libretto and some musical cuts and additions. Abduction is what director Con Costi calls a “delicious dark rom-com”. The original story tells of two women, Konstanze and Blonde, abducted and taken to a Turkish harem. When their boyfriends, Belmonte and Pedrillo, try to steal them away, they are caught, but released, along with the women, by the merciful pasha. Lyndon Watts and Cleo Lee-McGowan during rehearsals for Victorian Opera’s Abduction. Credit: Casey Horsfield In Costi’s retelling, the pasha becomes a Great Gatsby figure who holds elaborate and debauched parties, which the two women enter voluntarily due to possible dissatisfaction with their metrosexual boyfriends, who venture in to “save” them. Costi has Belmonte ask his sidekick: “Do you think they are having doubts?” Pedrillo replies: “Surely not. I mean look at us – we’re young, we meditate, we moisturise.” Delightful gentle mockery that is definitely not in the original text, but highlights Costi’s trajectory.\n\nAdvertisement\n\n“At its heart, it is a sex comedy,” says Costi, 35. “It’s some of the most exciting, dynamic and beautiful music Mozart has in his canon. Then the characters are incredibly rich and witty and funny, and dealing with an extremely contemporary conundrum: how best to live.” Victorian Opera has gone with a vibrant young cast to keep the energy high. Pasha Selim, a non-singing role, is played by Lyndon Watts, 30, who made his name as Aaron Burr in Hamilton, then as Candide in last year’s VO production. He is equally noted in the realms of theatre and musical theatre. Have others traversed such a wide path? “Melbourne is full of them, actually,” he says. “In the art spaces in Australia, you have to diversify or there’s not enough work. I am surrounded by a lot of artists who straddle various worlds.” This is Watts’ first mainstream opera, and he is excited. “I’m sort of pinching myself to be part of this incredible music. It’s a dream – it’s like doing Shakespeare, it’s like the mastery of Hamilton or Sondheim,” he says. Mercy and empathy are the keys to opening the Pasha’s character, he says. “As long as you’re honouring the human being, if it’s larger than life or different from the original, I enjoy it for what it is.” Emerging soprano Cleo Lee-McGowan, also 30, has the most difficult role, Konstanze, with its formidable technical and emotional demands. “It’s a beast of a role,” she says. “It’s very long and it’s very high, but it’s also very low. Mozart wrote it for a friend [the diva Caterina Cavalieri] to showcase her virtuosity and the extremes of the human voice, so the challenge is how do I achieve these extreme technical demands while also keeping the beauty.”\n\nAdvertisement\n\nHer answer is not to think about it too much but to dive into the character and trust her musical preparation. “I prepare brick by brick, focusing on the coloratura [virtuoso] passages and working out where I can take a breath, where I can reset, and just figuring out a strategy to get through this marathon. I must say it’s the most challenging role I’ve ever sung, and possibly will sing.” Lyndon Watts with costumier David Anderson during rehearsals for Victorian Opera’s Abduction. Credit: Casey Horsfield Lee-McGowan says the original setting may be strange, but it’s highly relatable. Konstanze and Blonde are asking questions every young person is asking and probably through every stage of life: “Who am I, and what do I really want?” The pair are the first of Mozart’s canny, complicated women, prominent in his later operas, Costi says. “You can’t help but notice the music and the time that he gives to the female characters across his operas. He gives so many women … musical dignity, and that’s why he is the great enlightenment humanist composer.” Costi says the big question he took a long time to grapple with, is what is the genre? The opera is not just a comedy but at times deeply serious, reflective and moving. “It’s not just a raucous comedic opera buffa, but it’s not an opera seria where we are dealing with the plight of emperors and kings and queens.” Both forms had strict conventions which Mozart defied to produce something new. “The game I really want to play with the audience is this oscillation between things that are comedic and witty, and you’re hopefully laughing, but at the same time grappling with quite serious things. “It’s an exciting challenge of really gear-shifting between comedy and human beings at the end of their tether. It has the tropes for romantic comedy, but there’s so much threat and menace hanging over the world that they’re in – I can’t really think of a parallel.”\n\nAdvertisement\n\nThe set model for Victorian Opera’s “exciting and fun” Abduction. Credit: Casey Horsfield There is a joy, he says, in embracing what is wild and dark about being human and also unravelling the complications of control in a relationship. “Where does love and commitment transform into something controlling? These things are very interesting to me, particularly in the contemporary climate of a modern Victorian age of ethics and etiquette.” Costi says the contemporary, cult-like, world he has chosen lets him reflect the sexual allure, danger and strangeness of a harem. Loading He is categorical that his revision is not about having the audience going away talking about the director – a charge levelled at some directors in Europe. “I’m an opera fan. I’m a Mozart obsessive,” he says. “Wunderkind directors throwing arbitrary grenades at things for shock value is actually kind of passé. That was interesting in the 1980s. There’s now something much more interesting in how do I actually tap into what I think is the intention of the composer and the essential qualities of what makes this a fantastic opera, but treating opera as a living, dynamic medium.” This production, he believes, is an ideal introduction for people who are not regular opera goers. “I like to think there’s something in it for connoisseurs and for first-time opera goers. I want both to leave having had an exciting and fun and moving experience.”\n\nAdvertisement",
        "source": "TheAge"
    }
]