[
    {
        "url": "https://www.9news.com.au/finance/australia-finance-money-missing-super-19-billion/c16d3ca1-86cc-45a3-bb73-b81f5017b9d1",
        "title": "Seven million Aussies don't know they're sitting on enormous pile of cash",
        "publish_date": "Wed, 29 Oct 2025 00:13:30 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "The Australian Taxation Office (ATO) has revealed there is $19 billion in lost and unclaimed super in Australia.\n\nData released today confirmed over seven million Australians are impacted, and they are now being urged to double-check their accounts.\n\nThe ATO said the average amount of unclaimed super per Australian stands at $2590, but said this could grow to tens of thousands of dollars by the time affected Aussies reach retirement age.\n\nOver seven billion Aussies have unclaimed super. (Fairfax)\n\nATO Deputy Commissioner Ben Kelly said many Aussies aren't even aware they have missing super.\n\n\"Checking for lost or unclaimed super is like reaching into your pocket and finding a $50 note, it's your money, you just didn't know it was there,\" he said.\n\n\"Your super can become lost if your account is inactive, and your fund can't contact you. If you've changed jobs, moved house or simply forgotten to update your details, you may have lost or unclaimed super.\"\n\nAssistant Treasurer Daniel Mulino said there were many reasons why Aussies could lose track of their super or fail to claim it.\n\n\"It could be that you've changed your name, that you changed jobs, or even that you've worked overseas,\" he told media this morning.\n\n\"What this can mean is that people can find themselves paying multiple fees, which will obviously have a bad effect on people's end balances.\"\n\nDaniel Mulino is urging Aussies to check if they are keeping track of their super. (Alex Ellinghausen)\n\nHowever, the ATO was quick to point out the solution is simpler than some may realise.\n\n\"This super is not lost forever. The ATO wants to get this lost and unclaimed money back into your account,\" Kelly said.\n\n\"While we're working hard to ensure people get full access to the super they have worked for, it is important for people to keep their information up to date in myGov.\n\n\"Your super follows you through your career, so you should keep a check on your account.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/inflation-australia-september-quarter-cpi/7e486a55-1073-4e32-877b-bce90690255f",
        "title": "Rate cut hopes dealt massive blow as inflation surges again",
        "publish_date": "Wed, 29 Oct 2025 01:19:10 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Australians hoping for an interest rate cut in November will likely have to wait a while longer after crucial inflation data came in far hotter than expected.\n\nThe new figures from the ABS revealed the consumer price index rose 1.3 per cent ﻿in the September quarter, the largest quarterly rise since March 2023, while the trimmed mean – the RBA's preferred measure of underlying inflation – was up 1.0 per cent.\n\nReserve Bank Governor Michele Bullock said on Monday that even a 0.9 per cent result on the latter measure ﻿would be a \"material miss\".\n\nThe ABS has released fresh inflation data which has all but scuppered any chance of a rate cut in November. (Getty)\n\nOver the 12 months to September, headline inflation rose to outside the RBA's target range at 3.2 per cent – up from 2.1 per cent in June and the highest level since June 2024 – while the trimmed mean reached 3.0 per cent, up from 2.7.\n\nIt's also the first time the annual trimmed mean measure has risen quarter-to-quarter since December 2022.﻿\n\nEconomists had been expecting the CPI to come in at 3.0 per cent, while core inflation had been forecast to stay at 2.7 per cent.\n\nREAD MORE: Eight schools taught kids about wrong Roman leader for whole semester ﻿\n\n9News money editor Effie Zahos said the unexpected surge had ended any chance of a rate cut in November.\n\n\"This was the missing piece of the puzzle before the RBA meets next week on Melbourne Cup day,\" she said.\n\n\"And you can guarantee there'll be no rate cut. I mean, that's my opinion. It'd be interesting to see the commentary flowing...\n\n\"These are not the numbers we wanted to see. So the chance of a rate cut, now the market is saying just 12 per cent for next Tuesday.\"\n\nREAD MORE: Shark feeding frenzy off popular surfing beach ﻿\n\nRBA Governor Michelle Bullock and her monetary policy board look almost certain to keep rates on hold next week. (Renee Nowytarger)\n\nLess than two weeks ago, the market had priced in an 81 per cent chance of a cut.﻿\n\nThe main driver of the surge in inflation was rising electricity costs﻿, as state rebates in Queensland, Western Australia and Tasmania finished while federal energy relief payments were distributed in some jurisdictions but not NSW and the ACT.\n\nMeanwhile, annual energy price increases came into effect in July, pushing costs up across the country.﻿\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bureau-of-meteorology-website-changes-australia-weather-murray-watt/1a192fda-848c-4d92-8d7d-db6621108962",
        "title": "BOM ordered to make changes by minister after new website's backlash",
        "publish_date": "Tue, 28 Oct 2025 23:29:24 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "The government weather agency has been urged to make changes to its website after an overhaul has been criticised by the public and politicians alike.\n\nThe Bureau of Meteorology (BoM) published wide-scale changes to its website last week, but a number of users complained about issues with accessibility and user-friendliness.\n\nSome residents in Queensland even claimed the changes left them unprepared for wild weather in the state over the past week, with the state's Premier David Crisafulli claiming: \"The changes to the website don't make sense… the website is flawed\".\n\nThe new Bureau of Meteorology website. (Bureau of Meteorology)\n\nFederal Environment Minister Murray Watt said he had asked for a meeting with Bureau CEO Peter Stone, admitting the website was falling short of serving Australians well.\n\n\"It's clear that the new BOM website is not meeting many users' expectations,\" Watt said in a statement today.\n\n\"I requested a meeting with the Bureau of Meteorology Acting CEO, Mr Peter Stone, to discuss the public's concerns with its updated website.\n\n\"In the meeting, I made clear my expectations that the BOM needed to consider this feedback and, where appropriate, adjust the website's settings as soon as possible. This includes urgent consideration of improvements to the website's functionality and useability.\"\n\nThe upgrade cost an estimated $4.1 million.﻿\n\nA particular source of frustration were changes in the site's rain radar, which was criticised for making the recent storms in Queensland appearing weaker than they actually were.\n\nMajor storms left tens of thousands without power in south-east Queensland. (9News)\n\nA tree smashed into a home during Queensland's wild weather. (9News)\n\nSunday's storm left tens of thousands of people without power and saw 11,000 insurance claims made in Brisbane alone as winds, rain and hail battered the sunshine state.\n\nWatt said due to the wild weather that can hit all parts of Australia, the BoM website must function properly to ensure all Australians can be safe and prepare accordingly.\n\n\"The BOM website is a critical tool to ensure public safety, particularly during the High Risk Weather Season and it must deliver the quality information our hardworking BOM staff are known for,\" he said.\n\n\"Australians deserve to have confidence in these important services.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-gambling-study/29fd29b0-19d1-44dd-95cb-6b994525afc3",
        "title": "A $31 billion issue: The number of problem gamblers in Australia is increasing",
        "publish_date": "Tue, 28 Oct 2025 21:59:08 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Nearly 3.5 million Australians admit they are problem or at-risk gamblers, according to a new study.\n\nOf this, 622,000 people confessed they are problem gamblers, a figure that has risen 22 per cent from last year, the survey of nearly 17,000 Aussies over 18 by Roy Morgan said.\n\nProblem gambling can be defined as a compulsive urge to gamble despite the negative impacts it could have on your financial, physical or mental health.\n\nMore Aussies admit they are problem gamblers. (Edwina Pickles)\n\nThe research reveals younger Australians are more susceptible to problem gambling.\n\nA majority of those who say they are problem gamblers are under 35, with 4.6 per cent of them being between 18-24-years-old.\n\n\"A look at who the 'problem gamblers' are shows a concentration among younger Australians aged under 50,\" CEO of Roy Morgan Michele Levine said.\n\nYounger Aussies are becoming stuck in a cycle of gambling. (Roy Morgan)\n\nThe most recent government data revealed Australians spent over $31 billion on gambling, the highest figure ever.\n\nThis leads to significant financial stress and challenges for some.\n\nAround 3.7 per cent of Aussies at risk of mortgage stress and 4.1 per cent of people at extreme risk of mortgage stress are problem gamblers.\n\n\"[This shows] problem gamblers are also likely to face other challenges,\" Levine added.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/luke-bateman-tiktok-book-podcast-in-the-good-books-exclusive-interview/aeb1e811-261f-4a44-adb1-f96f400b2e08",
        "title": "A 90-second video made Luke a viral sensation - but it came at a cost",
        "publish_date": "Tue, 28 Oct 2025 20:13:58 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Exclusive: Luke Bateman posted a 90-second TikTok about books in April and accidentally sparked a saga in the process.\n\nWithin six months, he'd ﻿amassed almost half a million social media followers, scored a book deal, started an audio book club, and announced his exclusive book podcast with Nine, In The Good Books.\n\nBut some critics claimed the former NRL player and TV bachelor didn't deserve it.\n\nLISTEN NOW: ﻿You can download In The Good Books with Luke Bateman on Apple here and Spotify here.\n\nLuke Bateman went viral on TikTok after joining BookTok, the platform's reading community. (Instagram/@lukebateman_)\n\nBateman, 30, was accused of capitalising on his privilege as a ﻿straight, white man for a golden ticket into the Australian publishing industry, which is notoriously difficult to break into.\n\nDetractors demanded to know why someone with no manuscript or prior publishing experience deserved a two-book deal with ﻿major publishing house Simon & Schuster.\n\nOthers engaged in personal attacks, flooding his social media accounts with angry comments and messages.﻿\n\n\"It really, really skyrocketed my anxiety,\" Bateman told 9news.com.au.\n\nAnd with the first episode of In The Good Books dropping today, there could be more backlash on the horizon.\n\nThis time, Bateman is prepared for it.\n\n\"It doesn't bother me,\" he said, adding that he could \"understand people's issues\".﻿\n\nREAD MORE: ﻿ Hurricane Melissa makes landfall in Jamaica as devastating Category 5 storm\n\nSome critics claimed the former NRL player and TV bachelor didn't deserve his recent wins. (Mark Kolbe/Getty)\n\n﻿More than ﻿70 per cent of people working in Australian publishing identify as white, according to a 2022 ﻿survey, and authors of colour (especially women) face myriad challenges getting published.\n\nBateman acknowledges those disparities and is aware of his own privilege.\n\n\"But we can hold two truths at one time,\" he said.\n\n\"I can be very happy for myself, and also understand that other people see barriers to entry that they don't believe that I have.\"\n\nAnd Bateman is genuinely happy with all that he has achieved over the last six months, particularly because ﻿he's a man.\n\nGrowing up in western Queensland, Bateman's childhood love of fantasy books put him at odds with the \"culture of very hard-working country men\" he describes in the first episode of In The Good Books .\n\nBateman (pictured with his dad) grew up in western Queensland surrounded by \"hard-working country man\" culture. (Instagram/@lukebateman_)\n\n﻿\"I had a really dark season of life growing up [and] books were always the place where I felt like I belonged,\" he said.\n\n\"I felt so weird as a kid because I was in circles and cultures where ... I really had to hide those parts of myself.\"\n\nBateman developed a deep shame over his love of reading and wants to make sure it doesn't happen to other Aussie blokes.\n\n\"Having men and boys read is a really deep passion of mine,\" he said.\n\nMales aged 15 to 24 read less than any other population cohort in the country, according to data from the Australian Bureau of Statistics (ABS).\n\nBarely 10 per cent of them read on any given day﻿, and even the male demographic which reads the most – men aged 75 or over – lagged behind their female counterparts.\n\nWomen read more than men in every single age category.﻿\n\nBateman wants to get the male number up, not just for the boys but for the men, too.\n\nAs an adult, he struggled with gambling addiction and previously estimated he lost half a million dollars in just a few years.\n\nHe also faced depression after a serious knee injury ended his NRL career.﻿\n\nIn his darkest moments, he returned to reading as a way to escape and he wants to empower other men to do the same.﻿\n\n﻿\"Books were the thing that gave me the ability to return to myself, and I want to ensure that other men and other boys can live out their imaginations and their dreams through books,\" he said.\n\n\"It's just so important to me to ensure that other people understand that joy.\n\n\"So that they too – whenever they're feeling disconnected, whenever they're feeling like the world doesn't see them – they have a place where they feel seen, and they feel heard, and they feel connected to themselves.\"\n\nREAD MORE: ﻿ Eight schools taught kids about wrong Roman leader for whole semester\n\nSince joining BookTok earlier this year, Aussies have seen a new side to Bateman.\n\nGone is the grass-stained NRL player, or the suited-up Bachelor looking for love.\n\nIn his place is a version of Bateman who gets teary-eyed over fictional characters in the cab of his tractor on a farm in Western Queensland, who dances to Taylor Swift's latest releases and waxes poetic about his favourite fantasy epics.\n\nThis, Bateman says, is the real him – and it's the reason he's been so successful online.﻿\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\n\"I lived as a character for a very long time,\" he said.\n\n\"I just wanted to embody my joys and what's true to me and very meaningful to my soul, and I feel as though people can see that through a screen.\n\n\"People feel that, and they resonate with that.\"\n\nHe believes it's that \"authenticity\" that has drawn Aussies to his TikTok and will have them tuning into In The Good Books.\n\nBateman isn't afraid to cry on camera over his favourite fictional characters. (Instagram/@lukebateman_)\n\nEpisodes drop weekly starting today and Bateman has promised fans everything from book recommendations, to author interviews, and even a chat with the woman responsible for his love of reading; his mum.\n\nHe also teased that he might reveal some details from his debut novel, which he just finished the manuscript for.\n\n\"I've been pouring my heart and my soul into my writing and into my characters, into my story,\" he said.\n\n\"To release that into the world will be very meaningful to me, and I'm very proud.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/plane-trees-neutral-bay-health-issues-council-response/9dc6af55-0581-430f-9c72-bdee3718f27f",
        "title": "Ritzy Sydney suburb where 'tree pollution' is so bad they have to wear masks",
        "publish_date": "Tue, 28 Oct 2025 18:52:30 +0000",
        "category": "lifestyle",
        "authors": [
            "Oct"
        ],
        "text": "Exclusive: When Aden Barclay moved to Neutral Bay in Sydney's north about five years ago, he thought his new place had a gas leak.\n\nPlagued with mystery ﻿respiratory symptoms for months on end, he never suspected the trees on the road outside were to blame.\n\n\"I honestly didn't know what it was so I started panic, I couldn't sleep at night,\" he told 9news.com.au.\n\nLIVE UPDATES: Hurricane Melissa makes landfall in Jamaica\n\nAden Barclay claims these plane trees along Military Road in Neutral Bay are making him and other locals sick. (Supplied)\n\nHe said it was only when he noticed all the ﻿pollen, seed coatings and dust from the plane trees growing near his property that he realised they were making him sick.\n\n﻿And half a decade on, they're still causing problems in Neutral Bay.\n\nPlane trees were planted throughout Sydney in the late 19th and early 20th century.﻿\n\nThey provide shade in summer and sun in winter, but they also shed dust and fine trichomes (hairs) that can cause shortness of breath, coughing, and eye, nose and throat irritation in humans.\n\nThey currently grow all over Neutral Bay and line Military Road.\n\nSome locals have taken drastic measures ﻿to avoid their dust, like Muhammad at the local Agha Grill, who was spotted working the counter in a respirator mask.\n\nStaff at a local kebab shop in Neutral Bay have taken to working in masks. (Change.Org)\n\nBarclay also claimed the plane trees are making him and other locals ill.\n\nHe said residents have suffered ﻿asthma attacks, coughing fits, sinus blockages and infections, bronchitis and panic attacks linked to plane trees.\n\n\"People around here are getting so sick,\" he claimed.\n\nHe said fallout from the trees often ends up inside businesses and homes as well.\n\n\"They're just a waste of space, they actually contribute to the pollution rather than stopping it, it's ridiculous.\"\n\nHe can't leave his windows open in summer and the filter on the fan he uses to keep his home and business cool is constantly clogged with plane tree dust.﻿\n\nREAD MORE: ﻿ Eight schools taught kids about wrong Roman leader for whole semester\n\nThe filter on the fan Aden Barclay relies on in summer is constantly caked in plane tree dust. (Supplied)\n\nPlane trees are also one of many tree species that emit isoprene﻿, a volatile organic compound (VOC) that is possibly carcinogenic.\n\nWhile it's not dangerous on its own, in hot weather, ﻿isoprene﻿ can react with nitrogen oxides from cars to form ozone, which can negatively impact air quality and lung health.﻿\n\nSydney announced that plane trees would be phased out in streets and parks ﻿back in 2023, but not for health reasons.\n\nResearch showed ﻿they're among the tree species most vulnerable ﻿to drought.\n\nThat's a problem when Sydney is experiencing higher temperatures and increased weather events due to climate change.\n\nClimate scientist Dr Georgina Falster previously told 9news.com.au Australia could even see 20-year megadroughts in the future.\n\nThe city decided that plane trees that needed to be removed (for example, dead trees) would be replaced with species better suited to warm weather and climate change.\n\nBut Barclay doesn't want to wait.\n\nPlane trees shed dust and fine trichomes (hairs) that can cause shortness of breath, coughing, and eye, nose and throat irritation in humans. (Getty Images/iStockphoto)\n\nHe ﻿has started a petition on Change.org to ﻿have seven plane trees along a 200-metre stretch of Military Road removed and replaced with native trees.\n\nThe petition has already attracted almost 100 signatures.\n\nNorth Sydney Council said that won't be happening.\n\n\"Council no longer plants any plane trees and will gradually phase out existing plane trees in the Local Government Area,\" a council spokesperson said.\n\n\"However, immediately removing and replacing established plane trees is not feasible in the short term, as it would have a significant impact on the canopy cover.\n\n\"When removals are required due to poor tree health or safety risks, where feasible they are replaced with more suitable species for the streetscape and site conditions.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sussan-ley-call-apology-anthony-albanese-joy-division-t-shirt/ef92b335-06d7-46da-851e-b4bd43bf24f5",
        "title": "Sussan Ley wants apology from Anthony Albanese for wearing Joy Division T-shirt",
        "publish_date": "Tue, 28 Oct 2025 06:19:00 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Opposition Leader Sussan Ley has made an extraordinary speech calling for an apology from the prime minister for wearing a popular rock band's T-shirt when he touched down in Australia after last week's visit to the United States.\n\nAlbanese was snapped disembarking from his Air Force charter jet on Thursday wearing a tee of Unknown Pleasures , the 1979 debut album of British post-punk band Joy Division.\n\nIn parliament today, Ley – who has previously spoken about her own \"punk phase\" she went through – gave a speech calling for Albanese to apologise for his choice of shirt, saying it was a \"profound failure of judgment\".\n\nREAD MORE: Indigenous crisis hotline records surge after March for Australia protests ﻿\n\nSussan Ley wants an apology from Anthony Albanese for wearing a Joy Division T-shirt. (Alex Ellinghausen)\n\n\"The prime minister stepped off the plane proudly wearing a T-shirt with the name of a band, Joy Division, whose origins are steeped in antisemitism,\" the opposition leader said.\n\n\"The name was taken from a wing of a Nazi concentration camp where Jewish women were forced into sexual slavery.\n\n\"At a time when Jewish Australians are facing a rise in antisemitism, when families are asking for reassurance and unity, the prime minister chose to parade an image derived from hatred and suffering.\"\n\nThe origins of Joy Division's name have been well-known for some time now.\n\nAlbanese wore the shirt while disembarking from his plane last week. (Dominic Lorrimer)\n\nOriginally called Warsaw, the band changed its name, with its new moniker taken from the name given to the wings of Nazi concentration camps where women were forced into prostitution.\n\nThe band discovered the name from House of Dolls , a novella written by Holocaust survivor Yehiel De-Nur.\n\nSome of Australia's biggest retailers, including Knart and JB-HiFi, have sold, or continue to sell, Joy Division T-shirts.\n\n﻿ However, Ley said Albanese should apologise for and explain why he wore the shirt.\n\n\"He cannot claim ignorance, he was told about the dark origins of this band on a podcast in 2022,\" she said.\n\nThe T-shirt is sold widely across Australia. (Supplied)\n\n\"He even admitted, 'that is very dark'... so to wear that name across your chest is not just a statement of musical taste, and it is more than bad taste, it raises questions about values.\"\n\nAlbanese is currently on another diplomatic trip outside of Australia, visiting Malaysia during the ASEAN Summit.\n\n9news.com.au has contacted his office for comment.﻿\n\nFormed in 1976, Joy Division split in 1980 following the death of vocalist Ian Curtis, but still influenced a raft of other bands, including U2, the Cure and Soundgarden. The remaining band members reformed as New Order.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/football-matildas-defend-sam-captaincy-call/105947148",
        "title": "Matildas launch fierce defence of Sam Kerr amid criticism of captaincy call",
        "publish_date": "Wed, 29 Oct 2025 02:01:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sam Kerr's teammates and coach have rallied behind their star after a backlash at her reclaiming the captain's armband for the Matildas' friendly match with England.\n\nTeammate Caitlin Foord said Kerr's critics \"don't know who Sam is as a person\", while coach Joe Montemurro said Kerr being captain was the best scenario for the team.\n\nDuring Kerr's two-year absence with injury, she was involved in a high-profile court case in London, during which video was released of her arguing with a Metropolitan policeman.\n\n'One we want to forget': 10-player Matildas humbled by England The Matildas were criticised for playing at \"walking pace\" as two-time European champions England dominate at Derby's Pride Park.\n\nKerr, who admitted she was very drunk, was seen talking about involving lawyers from her club Chelsea and acting in a way that many perceived as \"don't you know who I am?'' behaviour.\n\nLess attention was paid to the fact that the following day she reported to the police station as asked, on her own without any lawyer.\n\nThe charges against her were dismissed by a jury within four hours of deliberations, but memories of the case have lingered.\n\nAfter the Matildas were beaten 3-0 by England in Derby, Montemurro was incredulous when asked what he had to say to people who don't think Kerr should be captain.\n\nAfter having the question repeated because he thought he'd misheard, he said: \"We've made a decision internally for what we believe is the best for a football performance and for the group.\n\n\"I make football decisions. I'm not going to make any political decisions. I'm purely football. Sam is an important part of what we're trying to do.\n\n\"As far as we're concerned, we just kept the status quo. Going forward we're happy with her continuing on as captain.''\n\nFoord also dismissed the argument that Kerr should not be skipper.\n\n\"People don't know who Sam is as a person, so that's probably where that comes in,'' she said.\n\n\"She's a leader. If Australia is watching football, it's pretty clear what she brings. And the real football fans would be able to see that. For us internally, we know what that's about.\"\n\nChelsea teammate Ellie Carpenter also backed Kerr.\n\nEllie Carpenter, Kerr's teammate for both club and country, launched a passionate defence of her skipper. (Getty Images: Chelsea FC/Darren Walsh)\n\n\"Sam's always been our captain,'' she said.\n\n\"She was out for a very long time. Having her presence back in this squad is very important for us.\n\n\"She's a big player, she's very important to the team, she brings a lot of experience.\n\n\"She's changed football in Australia. For us having her on the team is a massive boost for us.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nCarpenter stressed Kerr would need time to get back to full sharpness.\n\n\"She's just coming back from a long injury, so she's trying to find her feet, hit the ground running again,\" Carpenter said.\n\n\"Having multiple minutes in the national team, she's probably very happy with that and hopefully can build on that for the next game at Chelsea.\"\n\nFoord said she expected Kerr to have a renewed hunger for the game.\n\n\"She's had a long injury, she's had a lot of time to miss the game,\" the Arsenal forward said.\n\n\"She won't take a game for granted now when she puts on the green and gold, any shirt in general, because it can be taken away from you very quickly.''\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/sheffield-shield-sam-konstas-bowled-ahses-selection/105947052",
        "title": "Sam Konstas bowled cheaply after leaving a ball that hit middle stump",
        "publish_date": "Wed, 29 Oct 2025 01:47:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "NSW opener Sam Konstas's bid to open the batting for Australia in the first Ashes Test has taken another hit, after the 20-year-old was dismissed early on day two of the Sheffield Shield match against Queensland.\n\nThe opening day of play at the Gabba was washed out due to rain in Brisbane, leaving several hopefuls including Konstas and Queenslanders Matthew Renshaw and Marnus Labuschagne, stranded in the rooms.\n\nKonstas got the first chance of the Test hopefuls on Wednesday morning when Queensland won the toss and sent NSW into bat.\n\nKonstas had scored 10 runs from 23 balls, including a pair of boundaries, before he left a delivery from Hayden Kerr that clattered into the top of middle stump.\n\nThe make-up of Australia's top order is yet to be locked in ahead of the first Ashes Test in Perth, beginning on November 21. Who will partner Usman Khawaja has been one of the most interesting decisions for the Australian selectors.\n\nKonstas is the incumbent opener with Khawaja, playing all three Test matches in Australia's tour of the West Indies in July.\n\nThe NSW batter made his Test debut in Melbourne last summer, scoring a breathtaking 60 in his first innings.\n\nIn his next nine innings in Test cricket, Konstas has only amassed another 103 runs.\n\nRenshaw and Labuschagne have made promising starts to the Australian domestic season.\n\nBatting at three in the Queensland order, Labuschagne is the leading run scorer across the opening two rounds with 337 runs.\n\nRenshaw opened the batting for Queensland with Khawaja in its second round match against Tasmania, scoring 128.\n\nTasmania's Jake Weatherald has also made his case for selection with a strong start to the season, but was dismissed for a duck late on Tuesday against Victoria.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/john-cleese-tributes-prunella-scales-fawlty-towers/105946292",
        "title": "John Cleese leads tributes to 'perfect' on-screen wife Prunella Scales",
        "publish_date": "Wed, 29 Oct 2025 01:26:01 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "John Cleese has remembered his on-screen wife, Prunella Scales, as \"absolutely perfect\" in a heartwarming tribute to his Fawlty Towers co-star.\n\nBritish actor Scales, best known for her role as Sybil Fawlty, died aged 93 on Monday.\n\nCleese, who played Basil Fawlty in the two-season 70s comedy, remembered Scales as a \"really wonderful comic actress\".\n\nJohn Cleese says scene after scene in Fawlty Towers, Prunella Scales was perfect. (Getty: Don Smith/Radio Times)\n\n\"I've recently been watching a number of clips of Fawlty Towers whilst researching a book,\" Cleese said in a statement.\n\n\"Scene after scene she was absolutely perfect.\n\n\"She was a very sweet lady, who spent a lot of her life apologising.\n\n\"I used to tease her about it. I was very, very fond of her.\"\n\nNumerous writers, actors and presenters have joined Cleese in paying tribute to Scales, whose acting résumé includes TV, film and theatre roles.\n\nShe starred as Elizabeth Mapp in the 1985 TV adaptation of Mapp & Lucia, Queen Elizabeth II in A Question of Attribution and as another royal playing Queen Victoria more than 400 times in one-woman show An Evening with Queen Victoria.\n\nBritish broadcaster Gyles Brandreth said Scales was brilliant.\n\nLoading Instagram content\n\n\"Prunella was a wonderful actress who brought her high intelligence to every part she played — from Sybil Fawlty to Elizabeth II,\" Brandreth said.\n\n\"She was funny, intrepid, interesting, interested, challenging, huge fun.\"\n\nPrunella Scales was best known for playing Sybil Fawlty in Fawlty Towers. (Youtube)\n\nBritish Prime Minister Sir Keir Starmer passed on his condolences to Scales's family.\n\n\"Clearly Prunella Scales was part of a golden era for British comedy,\" a spokesperson for Sir Keir said.\n\n\"Someone whose talent was beamed into people's homes over many years and gave many people a huge amount of enjoyment.\"\n\nScales was diagnosed with vascular dementia in 2013, but continued working for many years after.\n\nBetween 2014 and 2019, she and her husband, actor Timothy West, who died in November 2024, explored waterways in Britain and abroad in the travel show Great Canal Journeys.\n\nPrunella Scales (left) starred alongside John Cleese, Connie Booth and Andrew Sachs in Fawlty Towers. (Supplied)\n\nThe program was praised for the way it honestly depicted Scales's dementia.\n\nThe British Alzheimer's Society interim chief executive, Corinne Mills, described Scales as \"a true British icon\".\n\n\"Prunella was an inspiration not just for her achievements on screen, but because she spoke so openly about living with dementia.\n\n\"We are profoundly grateful for the awareness she helped to raise and send our heartfelt condolences to her loved ones.\"\n\nScales's sons Alex and Samuel announced their mother had died peacefully in London in a statement on Tuesday.\n\n\"She was watching Fawlty Towers the day before she died,\" the statement said.\n\nShe is also survived by a stepdaughter, seven grandchildren and four great-grandchildren.\n\nABC/Wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/september-quarter-inflation-2025-australia/105946244",
        "title": "Breaking: Annual inflation hits 3.2pc in September quarter, up from 2.1pc in June",
        "publish_date": "Wed, 29 Oct 2025 00:44:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Inflation has surged in the September quarter with consumer prices rising at an annual pace of 3.2 per cent, up from 2.1 per cent in the June quarter.\n\nThat level of inflation came in much hotter than economists were expecting, squashing hopes of a rate cut next week.\n\n\"With inflation vastly overshooting the RBA's forecasts the bank won't cut interest rates at its November meeting, and the chances that it won't loosen policy any further are rising,\" said Marcel Thieliant, head of Asia Pacific at Capital Economics.\n\nHeadline inflation rose by 1.3 per cent in the quarter, which was the highest quarterly rise since March 2023.\n\nMichelle Marquardt, ABS head of prices statistics, said the largest contributor to the quarterly movement in prices was electricity costs, which rose by 9 per cent.\n\nAnnual electricity price reviews came into effect from July 2025 and increased electricity across all capital cities.\n\nFinancial risks 'rising' warns RBA The Reserve Bank warns risks to the global financial system are \"rising\", not receding, and Australia is not immune from any fallout.\n\nThe \"trimmed mean\" measure of inflation, which is the Reserve Bank's preferred measure of underlying inflation, also rose in September, from 2.7 per cent to 3 per cent.\n\nThe RBA had forecast that headline inflation would rise quite sharply at this point in the cycle, with various government electricity rebates wearing off.\n\nBut it was not forecasting underlying inflation to rise from 2.7 to 3 per cent. It was forecasting underlying inflation to be 2.6 per cent by the end of December.\n\nBen Udy, lead economist for Oxford Economics Australia, said the sharp rise in inflation had delivered \"the knockout blow\" to any remaining hope of a November rate cut.\n\nHowever, he said he did not think it was anything to panic about.\n\nHe said inflationary pressures would still subside over the next 12 months and the RBA would likely still cut rates next year.\n\n\"The strength in today's inflation data is largely temporary,\" Mr Udy said.\n\n\"As the impact of the unwind in electricity rebates fades, wage growth continues to cool, and global trade disruption increases the flow of cheaper imports into Australia, we expect inflation to ease meaningfully over the year ahead.\n\n\"At the same time we expect the deterioration in the labour market to persist, forcing the bank to cut rates toward neutral.\n\n\"We've pencilled in two rate cuts in the first half of 2026.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/test-skipper-pat-cummins-makes-tentative-bowling-return/105946422",
        "title": "Test skipper Pat Cummins makes tentative bowling return",
        "publish_date": "Wed, 29 Oct 2025 00:43:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Pat Cummins has made a tentative return to bowling as he accelerates his bid to play in the Ashes.\n\nAustralia's Test captain bowled off a five-step run-up in a brief net session in Sydney on Wednesday.\n\nThe skipper has been ruled of out of the first Test against England starting on November 21 in Perth.\n\nBut Cummins, who has said he would need four to six weeks of bowling before returning to match action, hopes to return in the middle sector of the five-Test series.\n\nThe second Test in Brisbane starts on December 4 and the third Test in Adelaide on December 17.\n\nCummins bowled off a short run-up at Cricket NSW's Silverwater headquarters on Wednesday, watched by renowned physio Patrick Farhart and the Blues' strength and conditioning coach, Dean McNamara.\n\nHis bowling return came two days after Australia coach Andrew McDonald expressed hope the inspirational captain could prove his fitness for the second Test.\n\n\"We flagged this a week or so ago, that it would take sort of four-plus weeks to get him up and running,\" McDonald told reporters on Monday.\n\nSmith named skipper for Perth as Cummins ruled out Pat Cummins is officially ruled out of the first Ashes Test against England, with Steve Smith named to step in as skipper in Perth.\n\n\"We've run out of time [for the first Test] unfortunately, but really optimistic and hopeful for the second Test match.\n\n\"The next question is, what's the time frame, what does it look like for the second Test?\n\n\"[I am] not really going to be able to answer that, other than to say that he'll be back bowling this week, and that's a huge step.\n\n\"That was the big variable that we wanted to add in and get that information.\n\n\"So we're on the journey to that second Test and very hopeful that that will be a positive outcome.\"\n\nCummins last played in mid-July on Australia's Test tour of the West Indies.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nThe 32-year-old reported back soreness after returning to Australia and was diagnosed with a lumbar stress injury in September.\n\nMcDonald said how Cummins recovered from his return to bowling would be vital.\n\n\"We will see how he pulls up and then we'll make decisions moving forward,\" he said.\n\n\"With the nature of this injury, it's never going to be a clear time frame … I would never put the medical team under that sort of duress either.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/hughenden-water-quality-issues/105937874",
        "title": "Water quality woes in small town at centre of major energy project",
        "publish_date": "Wed, 29 Oct 2025 00:36:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Dirty, cloudy and tasting of chlorine is how some locals in a north-west Queensland town describe their drinking water.\n\nBusiness owner Jodie Coward has lived in the rural community of Hughenden, south-west of Townsville, for more than 30 years.\n\nShe said the current water quality was the worst she had seen.\n\n\"I haven't drunk our tap water now for probably over two years,\" she said.\n\n\"Here at the shop, I have filters on my drinking taps.\n\n\"At home, I boil the water and use activated carbon to get rid of the contaminants.\"\n\nJodie Coward says the current water quality is the worst she has seen. (ABC North Qld: Brooke Tindall)\n\nThe small town in the Flinders Shire, with a population of just over 1,000 people, has been plagued by water quality issues for years.\n\nSome experience a strong chlorine taste or brown discolouration, while others report no issues.\n\nThe township faced six weeks of boil-water notices last December after the detection of E. Coli.\n\nSome locals report dirty and brown water in Hughenden. (Supplied)\n\nTownsville Hospital and Health Service acting chief executive Rex O'Rourke said there were no reports that chlorine was breaching maximum levels.\n\nFlinders Shire Mayor Kate Peddle said the water met drinking quality standards but acknowledged issues with the town's water treatment plant and network system.\n\nResidents want the problem fixed urgently, as the town is preparing to become the centre of the state government's multi-billion-dollar CopperString project.\n\nSome residents in Hughenden complain of cloudy water. (ABC North Qld: Brooke Tindall)\n\nHeart of CopperString\n\nHughenden is set to become the heart of CopperString, with early works already beginning on a $225 million Flinders substation.\n\nHundreds of people are set to move into a workers' camp in the town.\n\nThe planned 1,100 kilometres of powerline from Townsville to Mount Isa will connect mines and towns in the north-west to the national electricity grid.\n\nDavid Janetzki says Hughenden will remain the heart of CopperString in the government's energy roadmap. (ABC News)\n\nLast month, Treasurer David Janetzki reaffirmed CopperString would be delivered, and that work on the \"eastern link\" — between Charters Towers and Hughenden — would start first.\n\nWithin that announcement was an expanded $50-million community benefits fund for water and sewerage infrastructure in Hughenden, as well as road maintenance and other council initiatives.\n\nIn a statement, Mr Janetzki said the state government would work closely with councils to prioritise and allocate money from that fund, but did not provide a time frame for the delivery of works.\n\nNew infrastructure needed\n\nCr Kate Peddle said the council was facing at least $35 million to replace water treatment plants, while also dealing with piping issues.\n\n\"Our network that delivers the water, that's providing the turbidity issues we have, so the discolouration that the community is seeing,\" she said.\n\nKate Peddle says the council needs to replace its water treatment plants. (ABC News: Georgia Loney)\n\nCr Peddle said many of the problems were compounded by historical underinvestment in core infrastructure and diminished funding or grants from the state and federal governments over the years.\n\nShe welcomed the recent funding announcement and said there was now an urgency to begin work.\n\n\"CopperString is an incredible, catalytic project for our communities, but in order for us to support them our core infrastructure really needs to be strong,\" she said.\n\n\"We know that potentially 500 men and women are going to be in that camp over the next six years and that’s going to put a lot of pressure on our already frail and challenging infrastructure.\"\n\n'Tastes like pool water'\n\nIn the meantime, residents like Jodie Coward said the trust in Hughenden's water was gone.\n\n\"I don't think that in today's day and age we should be living in an area where you have to boil the water, or drink bottled water, to be able to drink palatable water,\" she said.\n\nLocal Aaron Zammit said he had been buying bottled water in Hughenden for just over four years.\n\n\"On a bad day, you don’t drink it because it’s brown, so you don’t really want to taste that,\" he said.\n\nAaron Zammit says issues with water quality are widely known. (ABC News: Georgia Loney)\n\n\"Sometimes you pour it and it's a really white sediment that you can't see through.\n\n\"It just tastes like chlorine. It tastes like pool water.\"\n\nMr Zammit said the issues with Hughenden's water were widely known.\n\n\"You see it online all the time, on Facebook, people that move to the town,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/indoor-cricket-to-be-cut-from-cricket-australia/105946412",
        "title": "Cricket Australia to cut indoor cricket due to 'unsustainable' cost base",
        "publish_date": "Wed, 29 Oct 2025 00:27:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Cricket Australia (CA) has conceded it has an \"unsustainable\" cost base after cutting operational and financial support for indoor cricket and leaving the sport to manage itself.\n\nCA told indoor cricket officials around the country this week it would no longer support the sport after a handover period in the latest round of cost-cutting from head office.\n\nCA started running indoor cricket in 2009 and acquired the sport's participation numbers at the same time.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nAs of last year that figure stood at close to 100,000.\n\nThis week CA said the decision was made due to cost-cutting measures and the need to free up operational resources.\n\nIn a letter sent to the heads of indoor cricket in each state the organisation conceded it needed to make changes.\n\n\"Cricket Australia has been reviewing its cost base, which is currently unsustainable,\" the email read.\n\n\"We have already made some difficult decisions involving people changes and now need to ensure our limited resources are focused on Australian Cricket's most critical strategic priorities in the most effective and efficient way.\n\n\"As part of this, Cricket Australia is no longer able to continue its current commitment to indoor cricket.\"\n\nIncluded in the cuts are funding of national championships, Australian teams and all indoor cricket operations.\n\nThe decision comes ahead of expectations that CA will post a loss of close to $11 million for the 2024-25 financial year.\n\nLast weekend chief executive Todd Greenberg launched an initiative aimed at driving up player numbers in the form of the six-a-side Smash Series Cricket.\n\nIn that form of the game players bat in pairs for three overs each and continue batting even after getting out.\n\nThe format is seen as attractive to young players.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nIndoor cricket follows a similar approach, with pairs batting for four overs and matches lasting about 80 minutes.\n\nIndoor cricket experienced a peak through the 1980s and early 1990s, when centres were commonplace around the country.\n\nThe likes of Steve and Mark Waugh represented NSW in the sport growing up.\n\nSteve Smith, Jhye Richardson, Josh Phillippe and Jake Fraser McGurk are among current graduates.\n\nHeather Graham, Sarah Coyte and Amanda-Jade Wellington headline a long list of WBBL players to have played the sport at state level.\n\nBut the game has endured a difficult run following the COVID-19 pandemic, which accelerated centre closures around the country.\n\nCA has promised indoor cricket leaders it will assist in setting up new governance, including the establishment of a steering committee.\n\n\"We respect the contribution indoor cricket makes to the game and have established an advisory committee to ensure the long-term vision and sustainability of indoor cricket are maintained,\" a spokesperson said.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/qld-nine-schools-year-12-ancient-history-exam-wrong-topic/105945826",
        "title": "Number of schools impacted by year 12 history exam error rises to nine",
        "publish_date": "Wed, 29 Oct 2025 00:03:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland's education minister has put authorities on notice after nine high schools taught year 12 students the wrong topic for today's ancient history exam.\n\nAt least 140 students had been preparing for an exam on Augustus instead of Julius Caesar, with several schools revealed to be impacted by the bungle on Tuesday.\n\nEducation Minister John-Paul Langbroek has ordered an investigation into the Queensland Curriculum and Assessment Authority (QCAA), which sets the topics for year 12 exams, to ensure the issue is not repeated.\n\nHe said he wanted to see the authority's communication guidelines as well as details about the \"processes\" which were followed when the curriculum was changed, and how those changes were communicated to schools.\n\nHe said he was aware there had been \"communication issues\" at the QCAA, especially during ex-Tropical Cyclone Alfred in March, and changes to its board in the past six months.\n\nMr Langbroek said the exam results of those impacted would be scaled with the internal assessments they had already completed, worth 75 per cent, to make sure the students \"are not disadvantaged in any way\".\n\n\"For all of us, as parents or students, who have been through situations like this it would be extremely traumatic,\" he said.\n\n\"I want to reassure these students and their parents and the teachers affected that we'll be making every investigation into how this happened.\"\n\n\" I'm very unhappy about the situation developing as it has, for the stress it will have caused for everyone. \"\n\nThe schools impacted include Brisbane State High School, Flagstone State Community College, Meridan State College, Redcliffe State High School, Yeronga State High School, St Teresa's Catholic College, West Moreton Anglican College, James Nash State High School and Kuranda District State College.\n\nLoading...\n\nSchools were notified of the external exam topics for ancient history more than two years ago in August 2023 and again in April 2024, the ABC has confirmed.\n\nThe information is also available to schools through the Queensland Curriculum and Assessment Authority's (QCAA) internal portal.\n\nAugustus was the topic for the ancient history exam between 2020 and 2024. The topic changed to Julius Caesar in 2025.\n\nMr Langbroek confirmed the error did not occur for any other subject because there were no other changes to the syllabus in other subjects.\n\nHe said there would be an investigation into the resources and planning by the QCAA \"to make sure that we don't see a repeat of these situations\".\n\nThe QCAA said all of the schools impacted would submit a \"misadventure\" application so that special consideration could be taken into account.\n\nMother says daughter's hard work 'thrown out the window'\n\nA parent of a Redcliffe State High School student, who spoke on the condition of anonymity, told the ABC that her daughter found out about 1pm on Tuesday she had been learning all of the wrong content, prompting her to make \"a frantic phone call\" to her mother.\n\n\"I spent a considerable amount of time talking to her, trying to calm her down yesterday,\" she said on Wednesday morning.\n\nAt least eight Queensland state high schools taught wrong topic for year 12 exam The state's education minister has ordered an investigation into the blunder, which was initially believed to affect one school, before that number grew.\n\nThe mother said her daughter panicked because she had been told she needed to work hard for a good ATAR to be accepted into university.\n\n\"All of that hard work could have been thrown out of the window for something [the students] had no control over,\" she said.\n\n\"It was about trying to get her into the right headspace, especially because she has another exam this morning.\"\n\nThe mother told the ABC the school had been communicative with parents and students about the error and sent students \"hundreds\" of pages of content about Julius Caesar on Tuesday in an effort to help prepare for the exam.\n\n\"She has another exam this morning, but spent all of last night trying to cram hundreds of pages of content that they were sent yesterday about Julius Caesar, the mother said.\n\n\"They received effectively four months' worth of content and were expected to do the best they can within 24 hours.\"\n\nShe said the biggest concern was the knock-on effects it would have for the students who had another exam this morning, but had spent their time and energy focusing on their ancient history exam instead.\n\n\"I am annoyed … these kids started high school through COVID, so to finish off with something big like this is sad for them,\" she said.\n\n\"It's not a smooth finish to a pretty unsettled high schooling. It's just amazing it got to this point before somebody realised the kids were learning the wrong content.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/tahmoor-mine-workers-stood-down-without-pay/105941446",
        "title": "Future uncertain for workers stood down from mothballed coal mine",
        "publish_date": "Wed, 29 Oct 2025 00:00:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Holding his sixth child, Annie, in his arms, Mark Bryant is acutely aware of what being out of work means for him and his family.\n\nThe operator at the Tahmoor coal mine, south of Sydney, is one of 250 contractors who have been told they will no longer be receiving a pay cheque.\n\n\"It's going to get very difficult for families, especially depending on their situations if they haven't been able to put extra money away,\" he said.\n\n\"Me personally, I can absorb it for a couple of weeks, beyond that I'm not too sure. That's only because during the situation I've realised that this could have happened at any time.\n\n\" I believe that if this was to continue for an extended period, beyond two weeks, you'd start to see effects on families and communities. \"\n\nTahmoor coal mine is owned by SIMEC, part of GFG Alliance. (ABC Illawarra: Kelly Fuller)\n\nLabour hire workers on Friday received an email from mining contractor RStar explaining the decision to stand down workers without pay.\n\n\"Over the past 36 weeks, RStar has explored every possible avenue to avoid taking this step. Unfortunately, we can no longer continue operating under the current condition,\" the email read.\n\n\" We fully understand and appreciate the impact this decision may have on you, your family, and the communities we serve. \"\n\nTahmoor Colliery has been closed for the past nine months since the mine ran out of critical materials after it failed to pay its suppliers.\n\nThe mine is owned by a subsidiary of GFG Alliance, the company owned by billionaire metals magnate Sanjeev Gupta.\n\nThe consortium, which includes the Whyalla Steelworks, has faced a financial reckoning since the collapse of its largest lender, Greensill Capital.\n\nTahmoor coal mine workers hear from RStar management after being stood down without pay. (ABC Illawarra: Justin Huntsdale)\n\nWorkers meet\n\nMr Bryant and his colleagues gathered at a local inn to hear directly from RStar management about their futures.\n\nHe described the meeting as serious but constructive, with workers able to ask questions and seek clarity about their situation.\n\n\"RStar is continuing to work with the mine and its business operations, and they've committed to doing so,\" he said.\n\n\"They're very supportive and available to any of the workers who have questions. We just need to work together to get this resolved and get back underground.\"\n\nUpbeat about future\n\nMr Bryant was confident the mine would reopen.\n\n\"There are eight or nine longwall blocks approved for extraction, really good quality coal and the best people to get it out are those who have been here for years,\" he said.\n\nThe Mining and Energy Union has called on Natural Resources Minister Courtney Houssos to revoke Mr Gupta's lease on the mine, saying he was not a fit and proper person under state law.\n\n\"I'm calling on the state government to intervene and, under whatever powers they can apply, take the lease off Sanjeev Gupta, force him into administration, do something,\" the union's Bob Timms said.\n\nSanjeev Gupta's company holds the Tahmoor coal mine lease. (ABC News: Che Chorley)\n\nGFG Alliance said it was finalising funding arrangements to restart the mine and remained committed to resolving payment delays.\n\nDeep concern\n\nMs Houssos said she was monitoring the situation at Tahmoor Colliery and had taken steps to protect taxpayers and workers, but had not responded to calls to revoke GFG Alliance's mining lease.\n\n\"I am deeply concerned about the ongoing uncertainty at GFG's Tahmoor Colliery and the impact it is having on workers, their families and the local community,\" she said in a statement.\n\nShe said she would meet with the Mining and Energy Union again next week on the issue.\n\nA total of 250 workers were stood down without pay from the Tahmoor Colliery. (Supplied: SIMEC)\n\n\"I share the frustration many are feeling,\" she said.\n\n\"The lack of progress is unacceptable and there is urgent need for clarity about the future of the mine.\"\n\nMs Houssos said she made an order last month under the Mining Act placing a charge on the Tahmoor mining lease to secure the royalty liability owed.\n\n\"Placing the charge on the mining lease is an important action to protect the interests of NSW taxpayers and the mine's workers, as it safeguards the asset and provides a clearer path to the mine's reopening,\" she said.\n\n\"It is in everyone's best interests for GFG to resolve its financial issues, end the uncertainty, and either recommence operations or facilitate a sale of the mine to a capable operator.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/dozens-of-homes-now-worthless-after-council-van-park-decision/105916100",
        "title": "Dozens of homes now 'worthless' after council's van park decision",
        "publish_date": "Tue, 28 Oct 2025 23:36:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Gus Philpot thought he had landed a good deal on a home in the middle of the COVID-19 pandemic and the housing crunch on Queensland's Sunshine Coast.\n\nWhat he did not know was that five years later, his dwelling would be \"worth nothing\", after the local council introduced rules preventing permanent residents at Caloundra's Dicky Beach Family Holiday Park from on-selling.\n\nThe decision has left more than 100 residents at the park facing an uncertain future.\n\nPermanent residents will have to relocate or demolish their home if they decide to leave. (ABC Sunshine Coast: Jay Carstens)\n\n\"I put everything I had into this place and to be told that now I can't even sell it or even hand it on to my children … if I decide to venture on and do something else [I can't],\" Mr Philpot said.\n\n\"If I'd been told straight away that, 'You're not going to be able to sell', I wouldn't have bought it.\n\n\"I've invested all [my] money.\"\n\nThe 59-year-old is recovering from surgery and worries he could become a financial burden on his children.\n\n\"Now I can't even contribute to them, to help them along and to pretty much look after me,\" he said.\n\n'Poor decision-making' from past councils\n\nSunshine Coast Council said the move brought Dicky Beach in line with the rest of the region's publicly owned holiday parks.\n\nPermission to on-sell at other parks was removed two decades ago.\n\nBut some within the council fear it will only deepen the region's housing crisis.\n\nMayor Rosanna Natoli and Caloundra division councillor Terry Landsberg were among those who argued against the changes at a council meeting on October 16.\n\nTerry Landsberg says the permanent homes benefit the fabric of the local community. (ABC Sunshine Coast: Jay Carstens)\n\nCouncil officers said the move was required to bring the park in line with the Land Act of 1994.\n\nThe motion was passed six votes to four.\n\nCouncillor Taylor Bunnag supported the changes and said Dicky Beach's historical exemption should never have happened.\n\n\"We've also got 39 permanent dwellings in all our other holiday parks across the Sunshine Coast and [they] … have been restricted from on-selling their caravans in those locations,\" Cr Bunnag said.\n\n\"Dicky Beach has been an outlier for 20 years, which … is an unfair and unequal approach.\n\n\"[It's the result of] very poor decision-making by previous councils.\"\n\nHowever, Cr Landsberg said the park provided much-needed affordable housing.\n\n\"These people are not just retirees — they are key critical workers of our economy, they're carers [and] grandparents looking after their [grand] kids so that their parents can continue to work full time,\" he said.\n\nInvestments 'now worthless'\n\nPensioner Howard Hill, 80, purchased a non-fixed home in the park 30 years ago after a cancer diagnosis limited his ability to work.\n\n\"I spent $110,000 on my house four years ago to rebuild it … now it's worthless,\" Mr Hill said.\n\nHoward Hill has lived in the Dicky Beach park for three decades. (ABC Sunshine Coast: Jay Carstens)\n\n\"[Council] are not kicking people out, but it's the idea that you won't be able to resell if you were to move … you will have no way to recoup the costs of buying the house.\"\n\nCr Landsberg said the council had approved changes to dwellings for decades.\n\n\"[Past guidelines allowed for] the ability for park residents to gain building approvals certification, which was all ticked off by the council,\" Cr Landsberg said.\n\nQUT property law professor Sharon Christensen said the tenancy agreements for the land underneath the non-fixed homes would have set the rules for modification.\n\n\"[That agreement] will regulate, consistent with the Residential Tenancies Act, how long you can stay, what you can do on the site, whether you can attach fixtures,\" Professor Christensen said.\n\nShe said that despite permanent residency being listed as an inconsistent use of land set aside for camping, historical arrangements in place before those laws were introduced could continue to exist.\n\nHoward Hill and his wife Shirley are among those facing a financial loss. (ABC Sunshine Coast: Jay Carstens)\n\nAdding to housing pressures\n\nResidents of the park must relocate or demolish their homes when they decide to leave and will not receive compensation from the council, despite some dwellings being sold for upwards of $150,000 in recent years.\n\nMr Philpot said the council's actions did not match its rhetoric about addressing the housing crisis.\n\n\"They talk about affordable housing and trying to place people in affordable housing. We have affordable housing, we have our infrastructure set up and they're pretty much saying to us that they're not worth anything,\" he said.\n\n\"It's just ludicrous.\"\n\nCr Bunnag rejected the claim and said the council had been working on building new homes.\n\n\"We've delivered 22 affordable dwellings in partnership with the state government in Marcoola, but there's more to do — I absolutely recognise that,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/preterm-birth-prevention-program/105938716",
        "title": "A study of two million Australian births led doctors to world-first discovery",
        "publish_date": "Tue, 28 Oct 2025 23:32:41 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Thousands of early births have been avoided with improved outcomes for women and babies, according to analysis of a world-first Australian initiative.\n\nA study recently published in The Lancet Obstetrics, Gynaecology, & Women's Health, examined the impact of a national preterm birth prevention program introduced in Australia in 2018.\n\nIt found since the prevention measures were introduced, the rate of preterm and early term births — a major cause of death and disability — had lowered by between 7 and 10 per cent, or about 4,000 fewer early births a year.\n\nUniversity of Western Australia Professor of Obstetrics and Chair of the Australian Preterm Birth Prevention Alliance, John Newnham, spearheaded the preterm birth prevention program and was lead author of the study, which examined nearly two million Australian births.\n\nProfessor John Newnham was lead author of the study. (ABC News: Jack Stevenson)\n\nHe said the lessons learned would significantly change the lives of many Australian families.\n\n\"No-one in the world has ever been able to lower their rate of pre-term birth across the nation, and Australia's rate, like all similar countries, has been rising dramatically in recent years,\" Professor Newnham said.\n\n\"We set out to form a national program to lower Australia's rate of pre-term birth, funded by the federal government, but with support all the way down through to individual hospitals, and we were successful.\"\n\nPreterm birth — which is defined as birth between 20 and 37 weeks of pregnancy — is the leading cause of death and one of the major causes of disability in children across the world. Early term birth is defined as between 37 and 39 weeks of pregnancy.\n\nAva only weighed 580 grams when she was born. (Supplied)\n\nProfessor Newnham said while 37 weeks used to be considered full-term, there was evidence to suggest planned births between 37 and 39 weeks — without medical justification — put babies at additional risk of having issues like having respiratory problems or needing neonatal care.\n\nThe six-year program was run in two three-year phases.\n\nThe first phase saw the rate of preterm births fall by 8 per cent, the equivalent of 1,342 cases each year.\n\nWhile the second phase looked at the rate of early term births, showing a reduction of 10 per cent over a 16-month period, which equated to about 5,300 fewer cases.\n\nThe initiative involved implementing seven clinical strategies, including avoiding births being planned before 39 weeks without medical justification.\n\nAva spent 101 days in the neonatal intensive care unit after being born at 25 weeks. (Supplied: Yasmine Phillips)\n\n\"There are medical reasons such as high blood pressure, but in the absence of those reasons, babies should be left where they belong until at least 39 weeks,\" Professor Newnham said.\n\nThe clinical strategies also include measuring the length of the cervix during pregnancy scans and using vaginal progesterone — which can help prevent the uterine contractions that can lead to early birth — for women with a short cervix or a history of preterm birth.\n\nHealth professionals were also encouraged to help women who smoke to quit and provide expectant parents with access to continuity of care — where they see the same health professional during their pregnancy.\n\n\"Australia for many years has been a very safe place for women to have babies. This program has made it even safer,\" he said.\n\nBaby born 'the size of a tub of butter'\n\nFor Perth mother Yasmine Phillips, the research has been \"truly life saving\".\n\nHer eldest daughter Ava, now five, was born via an emergency caesarean at 25 weeks after Ms Phillips developed a severe form of life-threatening pre-eclampsia.\n\n\"I was quite unwell and the future was really unknown for Ava at that point as well,\" Ms Phillips said.\n\nMs Phillip's experience with Ava (pictured) helped guide doctors to reduce her chance of another premature birth. (Supplied)\n\n\"[Ava] only weighed 580 grams when she was born, which is basically the size of a tub of butter that you might have in your fridge at home.\"\n\nAva spent 101 days in the neonatal intensive care unit. While her lungs will never be as strong as a child born at full term, she is now a \"happy and healthy\" little girl, Ms Phillips said.\n\nWhen Ms Phillips and her husband Chris Robinson decided to try for a second baby, Australian research into preventing preterm births gave doctors clear guidance on how to reduce the chance of another premature birth.\n\n\"We managed to make it safely to 37 weeks … that was all thanks to the knowledge that has come out of this world-first initiative,\" Ms Phillips said.\n\nSisters Ava (left) and baby Sage. (Supplied: Yasmine Phillips)\n\nShe believed the research was a game changer for her second daughter Sage.\n\n\"It's genuinely life saving work and we are so lucky to have these teams of people working together not only on the research side but with hospitals all over Australia to ensure that the life saving work that they are coming up with is being enacted in real life.\"\n\nDoctors are now implementing the strategies\n\nRoyal Australian and New Zealand College of Obstetricians and Gynaecologists president Nisha Khot said doctors were already implementing the strategies.\n\n\"Looking at the length of the cervix every time you do a morphology scan at 20 to 22 weeks is something that has now pretty much become routine across the country,\" Dr Khot said.\n\n\"Doctors will definitely take a lot out of this … and already I see doctors have changed practice.\n\nNisha Knot says doctors are already implementing the strategies. (Supplied)\n\n\"I think the other really important thing that obstetricians have taken from this is that we must not plan to deliver babies before 39 weeks if there isn't a good reason to do it.\"\n\nDr Khot said while she was \"very excited\" about the study's success, more work was needed to prevent births of babies prior to 32 weeks gestation.\n\n\"We know that babies that are born at less than 32 weeks are more likely to have … physical disability, learning difficulties, other issues throughout their lifetime.\"\n\nProfessor Newnham said he would keep working to continue to reduce harmful early births, saying he first started the work as an obstetrician in Perth in the 1980s.\n\n\"This has been my career-long project and I started it and I still run it, but I'm surrounded by wonderful people all over the country who really have put their shoulder to the wheel to make it work,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/powerhouse-new-time-capsule-in-parramatta/105945680",
        "title": "Why the Powerhouse is calling for ideas to be buried for 100 years",
        "publish_date": "Tue, 28 Oct 2025 22:49:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "A solar powered calculator, a digital wristwatch, a cardboard box camera and the computer game Space Invaders.\n\nThese were some of the technologies the Powerhouse Museum buried in a stainless steel time capsule during the Ultimo institution's opening in 1981.\n\nA Hewlett-Packard 41CV handheld computer was one of the technologies buried in the 1981 time capsule. (Wikimedia Commons: Pittigrilli)\n\nNow the applied sciences museum is looking for what it will bury in another time capsule to represent the celebrated technological achievements of 2025.\n\nPowerhouse Parramatta plans to bury the time capsule for 100 years at the opening ceremony of its Western Sydney premises in 2026.\n\nPowerhouse CEO Lisa Havilah told ABC Radio Sydney Mornings they are looking for suggestions from the public of what is frequently used in daily life.\n\n\"We really want to have a mix of the great innovations of our time with the objects that create meaning for people,\" Ms Havilah said.\n\n\"It might be our great obsession and our great distraction … [like] the iPhone of the moment.\"\n\n\" What is having an impact on your life? What technology engages or contributes to your life? \"\n\nThe new time capsule to be buried at Powerhouse Parramatta in 2026. (Supplied: Powerhouse Museum)\n\nMs Havilah said the museum was after examples of new innovations being worked on now by the science, engineering and manufacturing sectors.\n\nOne example already proposed for the new time capsule is a solar cell donated by Australian engineer Martin Green who led a team that invented the PERC solar cell.\n\nNSW Arts Minister John Graham said the time capsule would be a great way to demonstrate Australia's achievements in innovation and science.\n\n\"The third time capsule, will capture this moment in our history,\" Mr Graham said.\n\n\"As we stand on the cusp of enjoying the new Powerhouse Parramatta it's a great time to reflect on what future visitors and Sydneysiders will want to know about, which of our ideas and stories will be of great interest.\"\n\nThe Ultimo time capsule will be opened in 2081, 100 years after its burial. (Supplied: Powerhouse Archive)\n\nThird time capsule continues tradition\n\nThe new capsule, that will be 900 millimetres wide and 400mm high, is the third one buried by the Powerhouse since it was founded in 1879 as part of the Sydney International Exhibition.\n\nA glass jar was buried in the foundation stone of the Tecnological and Sanitary Museum in 1879. (Supplied: State Library of New South Wales)\n\nThe first was a glass jar buried in the foundation stone in the Garden Palace in Sydney which housed the foundation collections of the Technological and Sanitary Museum.\n\nContained in the jar were newspapers, an official program of the exhibition, and a document detailing attendees of the opening ceremony.\n\nThe 1981 time capsule buried at the Powerhouse's Ultimo site is a much larger yellow cylinder of stainless steel and contains both technologies and documents of the time.\n\nSome of those documents include a Ansett and TAA flight timetable, a UBD Sydney street directory, Sydney telephone books and aerial photographs from the State Lands Department.\n\n\"It was really a reflection of the '80s,\" Ms Havilah said.\n\nAlso included were more everyday items like bus and train tickets, ferry tokens, bumper stickers and a proof set of 1981 coins.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-29/bureau-of-meteorology-ordered-to-fix-website-after-backlash/105945832",
        "title": "Bureau of Meteorology ordered to fix new website after torrent of complaints",
        "publish_date": "Tue, 28 Oct 2025 22:39:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government has told the Bureau of Meteorology (BOM) to fix its new $4.1 million website after a torrent of complaints by Australians, including farmers who are finding it difficult to use.\n\nThe BOM described the changes as \"modern and sleek\" when the new website went live last week, during wild weather in Victoria and extreme heat across Australia.\n\nBut Energy Minister Chris Bowen told ABC Radio National Breakfast the changes missed the mark.\n\n\"The bureau clearly has work to do in that it has lost community confidence in the new website,\" Mr Bowen said.\n\nThe Bureau of Meteorology's new website has been widely criticised. (ABC Rural: Justine Longmore)\n\n'Not meeting expectations'\n\nEnvironment Minister Murray Watt has discussed the issue with BOM acting chief executive Peter Stone, saying the site was \"not meeting many users' expectations\".\n\n\"I made clear my expectations that the BOM needed to consider this feedback and, where appropriate, adjust the website's settings as soon as possible,\" Mr Watt said in a statement.\n\n\"This includes urgent consideration of improvements to the website's functionality and usability.\"\n\nMr Watt said Mr Stone was considering the feedback and what adjustments could be made.\n\nThe bureau has been asked to provide a briefing to state and territory emergency services ministers this week on the new website and the steps it is taking to improve it.\n\n\"Australians deserve to have confidence in these important services,\" Mr Watt said.\n\n\"My office and I will continue to engage closely with the BOM and ensure public safety is its foremost priority.\"\n\nThe new BOM website has not been well received. (Supplied: Bureau of Meteorology)\n\nFarmers not happy\n\nNorthern Victorian agronomist Malcolm Taylor relies on the website for his work and said the redesign was a \"complete cock-up\".\n\n\"I'm the person who needs it and it's not giving me the information I need,\" he said.\n\nMalcolm Taylor says the new website doesn't give him the information he needs. (Supplied: Malcolm Taylor)\n\nMr Taylor said weather had a \"strong influence\" on what farmers do \"on a day-to-day and hourly basis.\"\n\n\"It's clearly been designed by IT nerds who've got no understanding of the client's needs,\" he said.\n\nHe said the BOM needed to be held accountable.\n\n\"I wouldn't tell a minister how to do his job, but I would expect some resignation notices over it,\" Mr Taylor said.\n\nNationals leader David Littleproud is calling for a review after locals in his Queensland electorate of Maranoa struggled to find information they needed after a recent rain event.\n\n\"I am hearing from many locals that the new platform no longer allows them to enter GPS coordinates for their specific property locations, restricting searches to towns or postcodes,\" he said in a statement.\n\nMr Littleproud said farmers were unable to access localised river heights and rainfall information data.\n\n\"Others have found the website difficult to navigate and note they cannot locate the radar function without extensive exploration of the site,\" he said.\n\nAlmost 2 million daily users\n\nThe bureau website receives about 1.8 million visits every day.\n\nThose numbers can increase to 5.7 million during extreme weather.\n\nA BOM spokesperson said the new website was the \"most complex technological transformation ever undertaken by the bureau\".\n\nThe spokesperson said community feedback on the new website had been \"overwhelmingly positive\" during a 12-month beta testing phase.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/messy-film-documents-screen-legend-s-dying-wish-20251029-p5n655.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Messy’ film documents screen legend’s dying wish",
        "publish_date": "Wed, 29 Oct 2025 12:58:58 +1100",
        "category": "entertainment",
        "authors": [
            "Jake Wilson"
        ],
        "text": "Warning: This story contains the name and image of an Indigenous person who has died.\n\nFILM\n\nJourney Home, David Gulpilil ★★★½\n\n(PG) 88 minutes\n\nIt’s been almost four years since the death of the great Yolngu actor, dancer and storyteller David Gulpilil. His extraordinary film career began in his teens when he was “discovered” by the British director Nicolas Roeg, who cast him in a starring role in the 1971 drama Walkabout.\n\nGulpilil, who was diagnosed with lung cancer in 2017, spent his last years primarily in the town of Murray Bridge, south of Adelaide. However, as his eldest son Jida Gulpilil testifies in this documentary, his dying wish was to be buried in accordance with tradition in his homeland of Gupulul in East Arnhem Land, near the sacred waterhole of Marayuwu, from which his spirit emerged.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-matildas-face-england-for-first-time-since-world-cup-loss-hurricane-melissa-makes-landfall-in-jamaica-netanyahu-orders-powerful-attacks-on-gaza-as-hamas-delays-body-handover-20251029-p5n62q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Netanyahu orders ‘powerful attacks’ on Gaza as Hamas delays body handover; Ley’s attack on PM’s Joy Division shirt a ‘weird frolic’, says O’Neil",
        "publish_date": "Wed, 29 Oct 2025 12:50:44 +1100",
        "category": "finance",
        "authors": [
            "Alexander Darling",
            "Emily Kaine"
        ],
        "text": "Independent Sydney MP Alex Greenwich has asked an appeal court to increase the damages awarded to him in his successful defamation case against former NSW One Nation leader Mark Latham, over an offensive tweet.\n\nA court found Sydney MP Alex Greenwich was defamed in a tweet by former NSW One Nation leader Mark Latham. Latham has appealed the decision. Credit: SMH\n\nGreenwich launched defamation proceedings in 2023 against Latham, now an independent NSW upper house MP, over a highly graphic and offensive comment on Twitter, now X.\n\nGreenwich has described the tweet, which this masthead has chosen not to reproduce, as “defamatory and homophobic”.\n\nLoading\n\nIn a decision in September last year, Federal Court Justice David O’Callaghan found Greenwich was defamed by the tweet and awarded him $140,000 in damages. O’Callaghan found the tweet conveyed the defamatory claim that Greenwich engages in “disgusting sexual activities”.\n\nLatham is now seeking to overturn that decision before a Full Court of the Federal Court. The appeal hearing is slated to run over three days from November 25.\n\nIn response to Latham’s appeal, Greenwich has filed a cross-claim.\n\nHe has asked the appeal court to find that the tweet conveyed an additional defamatory meaning that O’Callaghan did not find was conveyed, namely that Greenwich is “not a fit and proper person to be a member of the NSW Parliament because he engages in disgusting sexual activities”.\n\nGreenwich’s legal team said in submissions filed in court that a “higher award of damages is warranted”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/this-savoury-danish-roll-is-worth-queuing-for-at-a-new-bakery-by-a-fine-dining-pastry-chef-20251029-p5n682.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This savoury Danish roll is worth queuing for at a new bakery by a fine dining pastry chef",
        "publish_date": "Wed, 29 Oct 2025 12:50:43 +1100",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nButter Days Bakery in Malvern is run by Dessert Masters winner John Demetrios and his wife Martina.\n\n1 / 5 The BMO cheese roll. Luis Enrique Ascui 2 / 5 The Glenferrie Road bakery features a central communal table. Luis Enrique Ascui 3 / 5 The signature sunshine bun. Luis Enrique Ascui 4 / 5 Baked sweets. Luis Enrique Ascui 5 / 5 John Demetrios put his Dessert Masters prize money towards opening Butter Days. Luis Enrique Ascui Previous Slide Next Slide\n\nBakery$$$$\n\nAt Butter Days, Melbourne bakery fans have one more FOMO item to queue for: the BMO. “It stands for ‘bolle med ost’ or ‘bun with cheese’ in Danish,” says chef and baker John Demetrios (ex-Vue de Monde, Omnia). Demetrios runs the business with wife Martina Cissig Demetrios, a front-of-house professional who may have looked after you at Embla, Cumulus Inc. or Morning Market.\n\nNutty khorasan flour is used to make the chewy sourdough roll, which is spread with cultured butter thick enough to show teeth marks, filled with two slices of gruyere cheese, and seasoned with pink salt flakes.\n\nAt the bright Malvern shop, there’s a communal high table at the front, a pastry-laden display in the middle, and a huge marble baking bench at the back. There’s coffee, too.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/set-pieces-taking-over-premier-league-20251029-p5n67y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Set pieces taking over Premier League",
        "publish_date": "Wed, 29 Oct 2025 12:34:21 +1100",
        "category": "sports",
        "authors": [],
        "text": "Set pieces taking over Premier League\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/fitzroy-s-el-columpio-opens-surf-n-turf-taco-kiosk-on-st-kilda-beach-20251029-p5n67r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fitzroy’s El Columpio opens surf ‘n’ turf taco kiosk on St Kilda Beach",
        "publish_date": "Wed, 29 Oct 2025 12:33:38 +1100",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe northside favourite has ventured south of the river with a seafood spin-off.\n\n1 / 7 The finished torre de mariscos, ready to be piled onto tostadas. Swipe to see how the seafood tower is assembled. Penny Stephens 2 / 7 The seafood tower is layered with cooked and raw prawns, raw scallops and diced tuna, cucumber and avocado. Penny Stephens 3 / 7 Tostadas (crisp corn tortillas). Penny Stephens 4 / 7 Horchata drink. Penny Stephens 5 / 7 The mar y tierra taco with porterhouse, prawn, guacamole, melty Oaxacan cheese and a special chiltepin salsa (right). Penny Stephens 6 / 7 The flan Napolitano dish. Penny Stephens 7 / 7 El Columpio’s Ricardo Garcia Flores at his new “taqueria and marisqueria” in St Kilda. Penny Stephens Previous Slide Next Slide\n\nMexican$$$$\n\nMelbourne’s Mexican game is surging for summer with a new El Columpio “taqueria and marisqueria” (taco and seafood restaurant) on St Kilda Beach. The kiosk is between the St Kilda Sea Baths and Catani Gardens, overlooking a lawn that gives onto the promenade and the beach itself. It was previously home to Claw & Tail. The seating is all outdoors, or you can take your spoils to the sand.\n\nHere, the team use more expensive ingredients, such as seafood, prime steak and prized chiltepin chillies, a tiny wild-grown red pepper with an intense but short-lived burn. Those ingredients are brought together in dishes such as the taco mar y tierra (sea and land), with porterhouse, prawn, guacamole, melty Oaxacan cheese and a chiltepin salsa.\n\nAnother signature dish is the torre de mariscos, a seafood tower for two people ($50) presented in a stainless steel tube that is removed at the table, revealing a layered stack of cooked and raw prawns, raw scallops and diced tuna, cucumber (or mango in season) and avocado. It’s then toppled into a marvellous messy pile before being lavishly sauced for diners to pile over crisp tortillas.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-p-plater-nabbed-at-193km-h-20251028-p5n5vt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Nine schools taught the wrong topic for ancient history exam; Woman missing from Noosa Private Hospital; Shark feeding frenzy on the Gold Coast; Walking longer, not faster, better for heart health",
        "publish_date": "Wed, 29 Oct 2025 12:30:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Education Minister Johh-Paul Langbroek accepted there was no way as a senior student that he would be expected to learn a semester’s worth of work in a couple of days.\n\n“What we’ve done is tried to make sure that we identify which schools are affected ... and then provide the reassurance that senior students will need,” he said.\n\nBrisbane State High School in South Brisbane. Credit: Dan Peled\n\n“I would not expect any student to do an exam after they’ve received lectures or information about something that they’ve had two days’ notice for.”\n\nHe said students’ previous assessment results would be scaled up to account for the bungle on the ancient history exam.\n\n“I’m very unhappy about the situation developing as it has and for the stress that it will have caused for everyone,” Langbroek said.\n\nRead more here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/sydney-tennis-coach-barred-over-child-sexual-harassment-abuse-allegations-20251014-p5n2in.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney tennis coach barred over child grooming allegations",
        "publish_date": "Wed, 29 Oct 2025 12:27:45 +1100",
        "category": "sports",
        "authors": [
            "Amber Schultz"
        ],
        "text": "A Sydney tennis coach who allegedly groomed and sexually harassed a child and committed sexual misconduct against a staff member was able to continue coaching for two years after the complaints were made to Tennis Australia.\n\nBrenton Dumbrell, who owns and coaches at Inspire Tennis, has been suspended from coaching activities until October 2027 following incidents alleged to have occurred at Killara Lawn Tennis Club. His lawyer said he had no comment.\n\nBrenton Dumbrell, pictured at a members-only club event in November, had the allegations upheld by an independent tribunal. Credit: Instagram: thepillars.au\n\nThere is no suggestion that Dumbrell has committed any criminal offence. He is not facing any police investigation or charges.\n\nHis Working with Children Check (WWCC) has been under review since the allegations were first reported to Tennis Australia in 2023. Tennis Australia convened an independent tribunal, which began hearings in December 2024, with a decision reached in August this year and sanctions implemented this month.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/hurricane-melissa-live-category-5-storm-of-the-century-set-to-make-landfall-in-jamaica-20251028-p5n5ys.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hurricane Melissa live updates: Category 5 storm makes landfall near Jamaica’s New Hope, winds up to 300km/h; Jamaican PM declares nation ‘disaster area’ as deaths reported in neighbouring countries",
        "publish_date": "Wed, 29 Oct 2025 12:25:57 +1100",
        "category": "finance",
        "authors": [
            "Marta Pascual Juanola",
            "Ellen Connolly"
        ],
        "text": "Hurricane Melissa is slowly moving towards Cuba where it’s predicted to cause catastrophic flash flooding and multiple landslides in the coming hours.\n\nAbout 281,000 people in the eastern province of Santiago de Cuba have been evacuated to shelters or are staying with neighbours and relatives.\n\nSome low-lying or coastal communities have been completely evacuated, with only the personnel in charge of safeguarding property remaining.\n\nThe weather front – now category 4 after crossing Jamaica and packing winds of more than 200km/h – is moving north-east towards Cuba at 8km/h, but is expected to pick up speed as it nears, National Hurricane Centre director Dr Michael Brennan said.\n\nThe weather front is expected to hit south-eastern Cuba sometime about 2am on Wednesday local time (7pm AEDT) “as a powerful major hurricane”. It is expected to make landfall somewhere between the provinces of Santiago de Cuba and Manzanillo.\n\nBrennan said storm surges of 30 centimetres above normal tide levels were likely to hit the areas where the hurricane will cross the coast.\n\n“Catastrophic flash flooding” and multiple landslides are also likely in the Manzanillo, Santiago de Cuba and Guantànamo provinces in south-east Cuba, where isolated rainfall amounts could reach 63 centimetres.\n\nCuban President Miguel Díaz-Canel said every effort will be made to protect residents despite the fragility of the island’s economy.\n\nIn a televised address to the nation and wearing an olive-green uniform, Díaz-Canel urged the population to not underestimate the power of the storm, calling it “the strongest ever to hit national territory”.\n\nHe asked residents to avoid bathing in swollen rivers and urged them not to leave evacuation sites “until the order has been given”.\n\n“There will be a lot of work to do. We know there will be a lot of damage.”\n\nWith AP",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-wobbles-ahead-of-inflation-data-miners-bounce-back-as-woolies-gains-20251029-p5n62j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX drops after inflation shock; Banks decline, Woolworths gains",
        "publish_date": "Wed, 29 Oct 2025 12:23:05 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "However, “there appear to be some (very early) green shoots,” Jarden analyst Ben Gilbert wrote in a note to clients, pointing to the supermarket’s October food sales of 3.2 per cent. If the September quarter “proves to be the trough and October to-date trends continue, the stock should do well.” Pressure is rising on the Woolworths CEO, who will face shareholders at the company’s annual general meeting on Thursday, just as arch rival Coles will report its quarterly sales. Coles has been gaining market share on Woolworths. Coles shares dropped 0.6 per cent. Oil and gas giants Woodside and Santos fell for a second session as oil declined further amid mounting signs of oversupply, which quelled a bumper rally triggered by US sanctions on key Russian producers last week. West Texas Intermediate fell 1.9 per cent to again settle close to $US60 a barrel, the steepest daily drop in more than two weeks. Woodside was down 1.2 per cent and Santos shed 0.8 per cent in early trade. CSL also continued its slide, losing a further 5 per cent. The nation’s biggest health company slumped 15.9 per cent on Tuesday after vaccine scepticism led to a plunge in influenza vaccinations in the US, a key market, forcing it to issue a profit warning for its Seqirus vaccine business and delaying the unit’s planned spin-off into a separate company. Building products maker James Hardie shed 1 per cent after US homebuilder D.R. Horton reported weaker profit for the Northern hemisphere summer than expected amid cautious consumer sentiment. James Hardie makes about three quarters of its sales in the US.\n\nMining heavyweights BHP and Rio Tinto advanced, up 0.7 per cent and 0.2 per cent, respectively, while gold miners got some reprieve after their recent losses. Northern Star climbed 2.7 per cent, Evolution Mining added 2.9 per cent and Newmont was up 1.8 per cent as gold steadied after a three-day rout to trade near $US3950 an ounce. On Wall Street overnight, the S&P 500 added 0.2 per cent. The Dow Jones rose 0.3 per cent, and the Nasdaq composite climbed 0.8 per cent. All three indexes set all-time highs for a third straight day. Loading Moves were also relatively modest in the bond market as investors waits for a few events that could shake things up. On Wednesday, the Federal Reserve will announce its latest move on interest rates, while some of the US bourse’s most influential companies will report how much profit they made during the summer. On Thursday, President Donald Trump will meet China’s leader Xi Jinping in hopes of smoothing tensions between the world’s two largest economies. Tech giants Apple (up 0.1 per cent) and Microsoft (up 2 per cent) both climbed, with both companies hitting a valuation of $US4 trillion during the session, joining AI giant Nvidia as the only publicly traded companies worth that figure. Microsoft hit the mark earlier in the year.\n\n“We expect another strong round of megacap tech earnings reports, given the relentless demand for AI technology and infrastructure,” said Clark Bellin at Bellwether Wealth. “While profitability in AI remains an unknown, investors for now are willing to overlook this as the AI arms race heats up.” Amazon, meanwhile, rose 1 per cent after saying it will cut about 14,000 corporate jobs, or about 4 per cent of its corporate workforce, as it ramps up spending on artificial intelligence while cutting costs elsewhere. Until then, profit reports from overnight and the morning were the main drivers of Tuesday’s action. United Parcel Service rallied 8 per cent after delivering stronger profit and revenue for the latest quarter than analysts expected. UPS also gave a forecast for revenue in the all-important holiday shipping season that was slightly above analysts’ expectations. PayPal climbed 3.9 per cent after saying it made a bigger profit during the summer than analysts expected. It also said it plans to pay its shareholders a dividend every three months, while announcing a deal where internet users will be able to pay for purchases through OpenAI’s ChatGPT.\n\nOn the losing end of Wall Street was Royal Caribbean, which lost 8.5 per cent despite reporting a stronger profit than analysts expected. Its revenue for the latest quarter fell short of expectations. The cruise operator also said it’s seen a “minimal” hit to its business this quarter because of bad weather, along with the temporary closure of one of its exclusive destinations in Haiti. Loading A slowing job market is one of the main reasons Wall Street expects the Fed to announce another cut to interest rates on Wednesday. It would be the second time this year that it’s lowered the federal funds rate in hopes of helping the job market. The widespread expectation is that the Fed will also cut rates for a third time at its final meeting of the year. A lot is riding on that, in part because US stock prices have already rallied to records on expectations for it. That means the most important part of Wednesday’s announcement for Wall Street will be whether Fed Chair Jerome Powell gives any hints about upcoming moves. Fed officials have indicated that they’re likely to keep cutting interest rates next year, but they may have to change course if inflation accelerates beyond its still-high level. That’s because low interest rates can make inflation worse.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/chance-of-rate-cut-sinks-after-inflation-surges-20251029-p5n63c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chance of rate cut sinks after inflation surges",
        "publish_date": "Wed, 29 Oct 2025 12:21:57 +1100",
        "category": "finance",
        "authors": [
            "Shane Wright",
            "Millie Muroi"
        ],
        "text": "The chance of a rate cut at the Reserve Bank’s next meeting has plummeted after annual inflation jumped to its highest level in more than a year and recorded its sharpest quarterly rise since 2022.\n\nInflation for the year to September was 3.2 per cent, according to data released by the Australian Bureau of Statistics on Wednesday, a rise in the headline inflation rate of 1.1 per cent.\n\nRBA governor Michele Bullock said a difference of more than 0.3 percentage points between the bank’s forecast and the data on Wednesday would be a “material miss”. Credit: Dominic Lorrimer\n\nTrimmed mean inflation, which removes the impact of the highest and lowest price changes and is a key measure for the Reserve Bank, came in at 1 per cent for the three months to September and 3 per cent over the year.\n\nIn its latest statement on monetary policy, the Reserve Bank said it expected headline inflation to climb to 3 per cent by the end of the year and for trimmed mean inflation to drop from 2.7 per cent to 2.6 per cent, closer to the middle of its target range of 2 to 3 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/bill-shorten-on-antisemitism-at-australian-universities-20251029-p5n67p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "BIll Shorten on antisemitism at Australian universities",
        "publish_date": "Wed, 29 Oct 2025 12:17:17 +1100",
        "category": "finance",
        "authors": [],
        "text": "BIll Shorten on antisemitism at Australian universities\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/asian-beef-salad-20251029-p5n677.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Asian beef salad",
        "publish_date": "Wed, 29 Oct 2025 12:11:58 +1100",
        "category": "lifestyle",
        "authors": [
            "Sarah Pound"
        ],
        "text": "Step 1 To marinate the steak, whisk the fish sauce, sugar, garlic, and lime in a medium bowl. Add the beef, tossing to coat thoroughly. For a quick infusion, marinate for 30 minutes; for the best flavour, cover and chill overnight.\n\nStep 2 Place a medium frying pan or barbecue over high heat. Cook the steaks for about 5 minutes on each side for rare, adjusting based on thickness and your preferred level of doneness. Once cooked, remove the beef and let it rest for 10 minutes before slicing it into strips.\n\nStep 3 Prepare the vermicelli noodles according to the packet instructions (I usually soak them in a bowl of boiling water for 3-5 minutes with a plate on top). Drain and rinse them in cold water. If they’re still wet, drain them on a paper towel.\n\nStep 4 For the chilli-lime dressing, mix ingredients in a small bowl or lidded jar and adjust to taste. It should be tangy with a little heat and sweetness.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/konstas-castled-in-horror-fashion-20251029-p5n67m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Konstas castled in horror fashion",
        "publish_date": "Wed, 29 Oct 2025 12:07:10 +1100",
        "category": "finance",
        "authors": [],
        "text": "Konstas castled in horror fashion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/influencer-shares-update-from-jamaica-as-hurricane-melissa-hits-20251029-p5n67l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Influencer shares update from Jamaica as Hurricane Melissa hits",
        "publish_date": "Wed, 29 Oct 2025 12:02:06 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Influencer shares update from Jamaica as Hurricane Melissa hits\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/a-rollicking-tale-of-the-life-of-a-secret-gold-coast-poet-20251016-p5n359.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A rollicking tale of the life of a secret Gold Coast poet",
        "publish_date": "Wed, 29 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Thuy On"
        ],
        "text": "As a genre, memoirs can sometimes be lugubrious and self-indulgent, with the reader forced to listen to long stretches of dramatic peaks and scabrous lows, but Brown’s storytelling is brisk and playful, and it’s a pleasure to be in his company.\n\nBoth photos display Brown as a serious fellow, but such gravitas is undermined by the actual contents of this memoir: despite some of the heavier material, (substance abuse, bad health, familial woes and a nervous breakdown, aka “existentialitis”), a rich vein of humour courses through the book. The tone of Confessions of a Minor Poet is conversational banter, an extended yarn to a mate over a pint or three.\n\nThe cover photo of Confessions of a Minor Poet features Phil Brown: floofy white-haired, black-rimmed glasses, with his hands on his face staring directly and unsmilingly at us. The one on the back is a portrait of him as a young man, tapping away on his trusty typewriter with a reference book nearby. He looks for all the world like a prim, industrious journo focused on breaking a story, or maybe he is in the midst of translating poetic snippets from handwriting to print.\n\nThe author’s previous books have ranged in scope from poetry, travel writing, and even an ambitious search for the meaning of life. In 2019, he wrote a memoir about his childhood in Hong Kong during the 1960s. This latest offering is a sequel of sorts, picking up a decade later upon his return to Australia.\n\nJournalist, jobbing writer and poet Phil Brown in 2004.\n\nIt starts with 18-year-old “Browneye” (an unfortunate travesty of his name bestowed by fellow surfers), at home in the Gold Coast. Picture this dope-smoking, ratbag teenager who had to repeat year 10 twice because of classroom misdemeanours and a surfing obsession. And yet, the lad was also a bookish maladroit whose companions included Ernest Hemingway, D. H. Lawrence and Patrick White. Oh, and inspired by unrequited love and the lyrics of The Beatles and The Doors, Brown also wrote his first poem – printed on the back of his surfboard.\n\nFrom this juvenilia period of experimentation (in drugs, booze and verse), the book tracks Brown’s life as he serendipitously falls into journalism almost as an afterthought – when what he really wanted was to develop his poetic sensibility. His getting of literary wisdom was aided not only by emulating the style of his heroes, but by friendships with esteemed men of letters like “The Bard of Bunyah”, Les Murray, and “the Poet of Ordinary Australia”, Bruce Dawe. (It was fitting that Brown, the erstwhile disciple would, decades later, pen Dawe’s obituary in The Courier-Mail.)\n\nThe title of this memoir could easily be thus: Confessions of a Knockabout Journalist and a Minor Poet, Brown’s peripatetic lifestyle in his 20s and beyond led him to work for numerous media outlets: apart from a stint as a radio copywriter, he reported for various publications and across different editorial capacities in and beyond his home state. There are amusing tales of his time in rural newspapers (think bull sales, CWA jubilees, dairy festivals) and plenty of celebrity name-dropping when he was a social gadfly-about-town, with encounters with luminaries including Split Enz, Australian Crawl, Manning Clark, Eric Bana, Alain de Botton and Barry Humphries.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/traditional-bedtime-fairytales-are-being-replaced-by-machine-driven-content-20251023-p5n4rl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Traditional bedtime fairytales are being replaced by machine-driven content",
        "publish_date": "Wed, 29 Oct 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Jane Sullivan"
        ],
        "text": "Why aren’t more young people reading for pleasure? International studies reveal that their reading skills and enjoyment are falling. The trend is also apparent in Australia: recent data shows that one in three Australian children aren’t proficient readers, and that 29 per cent of teens don’t choose to read at all.\n\nWe can all point to reasons: the rival attractions of the internet and social media, limitations to literacy, peer group pressure, and so on. It’s a given that children develop an attachment to books at a very early age, long before they can read, through picture books and the voice of a parent or caregiver reading aloud. But parents these days are often too time-poor and tired to pick out the right books and to give their children this kind of attention.\n\nAuthors worry about the implications - both legal and ethical - of AI-generated books for children. Credit: Getty Images\n\nGuess what? AI has come up with a solution that at first glance seems quite a boon for frazzled parents. Google has launched Gemini Storybook, an app that creates personalised stories that you can read aloud to if you choose. Feed in a few prompts for story and art style and in 10 seconds, Storybook is back with a 10-page digital picture book in any one of 45 languages.\n\nOne fan, Sarah Dooley, told the US journal Publishers Weekly she wanted a story about twins starting kindergarten for her children. “Gemini created the sweetest storybook about squirrel sisters starting school together. Sharing it with my girls opened up a conversation about their nerves.”",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/bureau-of-meteorology-website/vya3xrizg",
        "title": "'Fail and ask for more': Backlash grows over BoM's $4.1m redesign as changes urged",
        "publish_date": "Wed, 29 Oct 2025 00:45:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Nationals leader David Littleproud has called for a review of the Bureau of Meteorology's (BoM) new website as the storm over its $4 million redesign continues to intensify.\n\n\n\n\n\nLittleproud said in a statement on Wednesday his office had received many complaints from locals in his regional Queensland electorate of Marnoa, who he said had complained the new website was difficult to navigate and lacked key tools, including the ability to enter GPS coordinates for specific property locations.\n\n\n\n\n\n\"As a result, families, business and farmers are unable to access vital localised data such as river heights and rainfall information,\" he said.\n\n\n\n\n\nHe said he had asked Environment Minister Murray Watt \"to review the functionality of the updated BoM website and consider restoring key tools relied upon by farmers and rural communities\".\n\n\n\n\n\nLater on Wednesday morning, Watt accused the suggested BoM's management needed to improve and accused them of running a business model of \"fail and simply ask for more money\", and of poor forecasting that had, at times, caused confusion among farmers.\n\n\n\n\n\n\"They can't even manage to put a simple website together,\" Littleproud told reporters.\n\n\n\n\n\n\"It's time that Minister Watt simply send them on their way to fix this and to get their house in order, because they are having a significant impact on Australian agriculture,\" he added.\n\n\n\nThe $4.1 million revamped BoM website was launched last week and quickly came under fire after savage storms left a trail of destruction across the eastern seaboard.\n\n\n\n\n\nUsers complained the new website — the BoM's first in 12 years — did not indicate storm severity after wild weather wreaked havoc across Queensland and Victoria at the weekend.\n\n\n\n\n\nAnthony Cornelius, managing director at forecasting company Weatherwatch, wrote on LinkedIn there were three major issues users were finding: the new radar underestimated the intensity of the storms, the new radar was lagging, and the new design made it difficult to find information when it was needed.\n\n\n\n\n\n\"It beggars belief that the BoM would roll out such a significant change to an essential infrastructure service just as the main storm season is about to start,\" Cornelius wrote on Monday.\n\n\n\n\n\nAlong with Littleproud, Queensland treasurer David Janetzki has also written to Watt, demanding changes to the website as the clean-up from the storms continues.\n\n\n\n\n\n\"The decision to make the site live on 22 October, just as Queensland and Australia enter storm season, can, at its best, be described as short-sighted,\" he wrote in his letter to Watt.\n\n\n\n\n\nThe environment minister said on Tuesday that he called a meeting with BoM's acting CEO, Peter Stone, to discuss the public's concerns about the updated website.\n\n\n\n\n\n\"It's clear that the new BoM website is not meeting many users' expectations, with a significant range of feedback provided to the bureau in recent days,\" Watt said.\n\n\n\n\n\n\"In the meeting, I made clear my expectations that the BoM needed to consider this feedback and, where appropriate, adjust the website’s settings as soon as possible. This includes urgent consideration of improvements to the website’s functionality and useability.\"\n\n\n\nA BoM spokesperson defended the website's rollout on Wednesday, but acknowledged there had been challenges with the change.\n\n\n\n\n\nThe spokesperson told the Australian Associated Press forecasts and warnings were not affected during the 22 October rollout and remained available throughout the day during the storms.\n\n\n\n\n\n\"(We) assure the community that the new site has been designed with public safety at its core ,\" they said.\n\n\n\n\n\nThe radar functionality is one of the tools that prompted feedback from users, the spokesperson said.\n\n\n\n\n\n\"This is just the beginning of our journey to improve our online services,\" they said.\n\n\n\n\n\n\"We will continue to deliver website improvements based on feedback which we are taking seriously, just as we have done throughout the development phase.\"\n\n\n\n\n\n— With reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/housing-and-migration-the-big-issues-as-dutch-voters-cast-their-ballots/q3d1mo0fv",
        "title": "Housing and migration the big issues as Dutch voters cast their ballots",
        "publish_date": "Tue, 28 Oct 2025 22:22:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe anti-immigration, anti-Islam populist provocateur of Dutch Politics is walking along the seaside, surrounded by security, supporters, protestors and press.\n\n\n\n\n\nA chaotic scene but it’s a normal day on the campaign trail for Geert Wilders, leader of the far-right Party for Freedom, who triggered this election when he withdrew from the shaky coalition government in June.\n\n\n\n\n\nIt was a risky move that could backfire.\n\n\n\n\n\nOther parties are refusing to work with him again but he insists, unlikely as it may be, he could still become Prime Minister - or at least, play a key role in Government.\n\n\n\n\n\n\"How will you get into government if nobody's going to work with you?\"\n\n\n\n\n\nW: \"Well, let's first see what the outcome of the election is, Wednesday, the voter is in charge, not the other parties, and it really depends on the outcome, how big we would be become, what would be the alternatives, is it feasible or is it not feasible? So they are in charge now, I'm not predicting anything. I hope we will win, it looks good, but you never know. So we never cheer before the end of Wednesday any election day.\"\n\n\n\n\n\nWhile his party may win the most seats, a functioning coalition needs to be built, meaning a more centrist government appears likely.\n\n\n\n\n\nThe new prime minister could be conservative Henri Bontenbal, who has pledged to restore decency to Dutch politics.\n\n\n\n\n\n”What we have seen is two years of (the) politics of division and chaos. What we want do want to present is a politics of hope and responsibility.\"\n\n\n\n\n\nFrans Timmermans is another contender.\n\n\n\n\n\nThe former European commissioner leads the recently merged Social Democrats and Greens.\n\n\n\n\n\n“What we need to do is ... get this country working again and put this country on a social track, on a track of fairer distribution, on a track where we reinstate the state that we needed on education, on health care, on housing, on social benefits.”\n\n\n\n\n\nThe progressive D66 could also play a role in the next government.\n\n\n\n\n\nIts leader Rob Jetten’s slogan is ‘yes we can’ with a campaign focused on building 10 new cities.\n\n\n\n\n\nYet it’s Geert Wilders who has largely set the election agenda.\n\n\n\n\n\nLinking the cost-of-living crisis to migration, he’s proposed a total ban on asylum seekers.\n\n\n\n\n\nJaap Schilder is planning to vote for him.\n\n\n\n\n\n“With the asylum crisis, so to speak, these people all need to eat, they need to live. But we need to be able to take care of ourselves, and that's why I'm voting for the PVV. Our own people first.\"\n\n\n\n\n\nIn recent months, violent protests have occurred outside new migrant processing centre, while in August, Wilders posted an illustration on social media showing a woman’s face - half blonde, half brown and wearing a headscarf, with the caption: ‘the choice is yours’.\n\n\n\n\n\nIt prompted a record number of complaints to the Dutch anti-discrimination hotline.\n\n\n\n\n\nPalwasha Hamzad is running for the Greens.\n\n\n\n\n\nHer family fled Afghanistan when she was a child and settled in Haarlem, near Amsterdam.\n\n\n\n\n\nShe’s concerned about where her adopted homeland is headed.\n\n\n\n\n\n“I see increasing racism and discrimination and there can be various reasons for this. Poverty could be a reason. The housing crisis could also be a reason that these problems are used by certain political parties wanting division to arise in our society and set people against each other.\"\n\n\n\n\n\nAnd it appears it has worked.\n\n\n\n\n\nDespite asylum seekers representing a small portion of total migrants, and migration being down year on year, a record number of people are expected to back far-right parties, including voter Gina Swarthoed.\n\n\n\n\n\n\"(I am worried) about the integration of many foreigners. I can see my grandchildren wearing a burka in a few years. I really think so.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-diseases-that-dominate-australias-270-billion-health-bill/ym74nnf8o",
        "title": "The diseases that dominate Australia's $270 billion health bill",
        "publish_date": "Tue, 28 Oct 2025 18:47:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's real spending on health has increased slightly after a one-year plateau, while cancer remains the disease Australia spends the most on, newly released data shows.\n\n\n\n\n\nThe country's total health spend sat at $270.5 billion in 2023-24, according to Australian Institute of Health and Welfare (AIHW) reports released on Wednesday.\n\n\n\n\n\nIn nominal terms, it's an increase from $244.9 billion in 2021-22 and $255.1 billion in 2022-23, but when adjusted for inflation, the figure was $267.7 billion in both those periods.\n\n\n\n\n\nAround 69 per cent of this was paid for by the government — $106.2 billion coming from Canberra and $82 billion from state and territory governments.\n\n\n\n\n\nAs a share of total government expenses, health spending decreased from 17.1 per cent in 2022-23 to 16.8 per cent in 2023-24, which \"suggests health spending grew more slowly than other areas of government expenditure\", the report reads.\n\n\n\nIn 2023–24, total health spending entered a post-pandemic period, totalling $270.5 billion, which equates to 10.1 per cent of the gross domestic product. Source: SBS News The AIHW also breaks down health expenditure into 17 disease and injury categories, and spending within these categories increased from $170.2 billion in 2022–23 to $180.4 billion in 2023–24.\n\n\n\n\n\nThe discrepancy between this figure and the nation's total health expenditure is due to $73.9 billion in costs such as administration and public health programs that can't be attributed to the treatment of any particular disease.\n\n\n\nWhich diseases do we spend the most on?\n\nCancer has remained the disease Australia spends the most on, a position it's held since 2017-2018. Spending on cancer has more than doubled since 2013-14 and now sits at $19.7 billion.\n\n\n\n\n\nAmong specific types of cancer, Australia spent the most on lung cancer and non-melanoma skin cancer ($1.87 billion each), bowel cancer ($1.85 billion) and breast cancer ($1.84 billion).\n\n\n\n\n\nCancer also had the highest burden, accounting for 16.4 per cent of the overall reduction in the total of disability adjusted life years caused by the 17 disease and injury categories.\n\n\n\n\n\nDisability-adjusted life years, also known as health loss, is a metric calculated from the years of life people lose due to premature death or disability caused by illness or injury.\n\n\n\nIn 2023–24, cancer was the disease group with the highest spending ($19.7 billion), followed by cardiovascular diseases ($16.9 billion) and musculoskeletal disorders ($16.3 billion). Source: SBS News In second and third place are cardiovascular diseases at $16.9 billion and musculoskeletal disorders at $16.3 billion.\n\n\n\n\n\nCoronary heart disease ($3.8 billion), atrial fibrillation and flutter ($2.1 billion) and stroke ($2 billion) had the highest spending levels among cardiovascular diseases.\n\n\n\n\n\nAmong musculoskeletal disorders, osteoarthritis ($4.8 billion) and back pain and problems ($4 billion) attracted the most expenditure.\n\n\n\n\n\nCancer, cardiovascular diseases and musculoskeletal disorders have been the top three spending groups in all but one year since 2013-14.\n\n\n\nLISTEN TO INTERVIEW: Australia among first countries to launch lung cancer screening program SBS News 12:37 English\n\nBeyond that, the next most costly disease categories were well care ($13.9 billion) — encompassing things like routine dental work and pregnancy/postpartum care — infectious diseases ($13.3 billion), and gastrointestinal disorders ($13.1 billion).\n\n\n\n\n\nMental health conditions and substance use disorders ranked seventh in terms of overall spending, at $12.4 billion, but had the second-highest health loss, accounting for 14.8 per cent of the reduction in disability adjusted life years.\n\n\n\n\n\nCommon mental health conditions like depression and anxiety accounted for the most spending in this category — $2.7 billion and $2.6 billion, respectively — but per case, schizophrenia was the most expensive at roughly $29,000.\n\n\n\n\n\nThe AIHW report notes there can be many reasons why certain disease categories have steeply divergent costs and spending levels.\n\n\n\nCancer was the disease group with the highest disease burden in Australia in 2024, accounting for 16.4 per cent of total disability-adjusted life years. Source: SBS News \"In cases where a particular disease has relatively high human cost but low spending, it does not necessarily mean that health spending should be increased,\" the authors write.\n\n\n\n\n\n\"Road transport injuries or smoking-related diseases, for example, may be also addressed by investments and responses outside the health system, such as through education, transport, environmental health or other social services.\"\n\n\n\n\n\nThe estimates in the recently released report are compiled from more than 50 data sources and capture spending by governments, individuals, private health insurers and other private sources.\n\n\n\n\n\nThey only include spending within the healthcare sector, but the AIHW notes that the costs of disease extend far beyond this into people's lives.\n\n\n\nWhat's killing us?\n\nThe most recently updated AIHW data, covering 2023, shows Australia's leading underlying causes of death vary by sex.\n\n\n\n\n\nCoronary heart disease was the biggest underlying killer of men, accounting for 10.8 per cent of deaths, while dementia was fatal to most women, accounting for around 12.2 per cent of deaths in that year.\n\n\n\nREAD MORE Dead before 50: The Australians dying young at the edge of the system\n\nIn second place for both sexes, these underlying causes switch positions, accounting for between 6.4 per cent of male deaths and 7.6 per cent of female deaths.\n\n\n\n\n\nIn third place for men is lung cancer at 5.4 per cent, while for women it is cerebrovascular disease at 6.1 per cent.\n\n\n\n\n\nLeading causes of death also varied by age, with land transport accidents the most common cause of death among children aged 1–14 and chronic diseases the leading cause among people aged 45 and over.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/kidney-disease-drug-now-available-on-pharmaceutical-benefits-scheme/lumr4ao6v",
        "title": "Kidney disease drug now available on Pharmaceutical Benefits Scheme",
        "publish_date": "Tue, 28 Oct 2025 08:44:20 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Kidney disease drug now available on Pharmaceutical Benefits Scheme\n\nPublished 28 October 2025, 4:05 am\n\nTens of thousands of Australians with chronic kidney disease will be able to access a cheaper and more accessible treatment now available on the PBS. Kidney disease is responsible for one in six hospitalisations each year, and it's hoped the drug’s listing will help curb what experts are calling a national health emergency.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/government-races-to-keep-aluminium-giant-open-as-opposition-blames-energy-policy/dbb7h36qu",
        "title": "Government races to keep aluminium giant open as opposition blames energy policy",
        "publish_date": "Tue, 28 Oct 2025 08:29:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Government races to keep aluminium giant open as opposition blames energy policy\n\nPublished 28 October 2025, 4:04 am\n\nAustralia's biggest aluminium smelter, Tomago, in the New South Wales Hunter Valley, is considering shutting its doors within three years. The federal government has tried to secure the continued operations with a support package for one thousand workers, but the opposition says rising energy costs are sinking the industry.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/china-upgrades-asean-trade-pact-accuses-major-powers-of-economic-bullying/kapzvwg0p",
        "title": "China upgrades ASEAN trade pact, accuses major powers of ‘Economic Bullying’",
        "publish_date": "Tue, 28 Oct 2025 08:17:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "China upgrades ASEAN trade pact, accuses major powers of ‘Economic Bullying’\n\nPublished 28 October 2025, 4:03 am\n\nChina has renewed its free trade agreement with Southeast Asian nations at the ASEAN summit in Malaysia. Premier Li Qiang called out \"economic bullying\" by major powers, in a thinly veiled swipe at the U.S. While Australia sought to deepen trade and defence ties with the bloc.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/csl-and-wisetech-shares-smashed-australias-asean-opportuntties/jii8rdy49",
        "title": "CSL and Wisetech shares smashed & Australia's ASEAN opportunities",
        "publish_date": "Tue, 28 Oct 2025 07:49:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/kidney-disease-drug-added-to-pbs-helping-65-000-australians/89175q6wh",
        "title": "Kidney disease drug added to PBS, helping 65,000 Australians",
        "publish_date": "Tue, 28 Oct 2025 07:45:45 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPeter Brown was diagnosed with kidney disease two years ago. For him, the treatment process has been overwhelming.\n\n\n\n\n\n\"A very debilitating, a very overwhelming feeling of being sick and not being able to do anything. The doctors told me I'd maybe end up being on dialysis, which is a sort of scary proposition.\"\n\n\n\n\n\nSince then, Mr Brown has been relying on medication to improve his condition.\n\n\n\n\n\nHe's pleased to learn his upcoming medication bill can be cheaper, as the federal government announces that it will include a drug for kidney disease into the Pharmaceutical Benefits Scheme.\n\n\n\n\n\nJardiance is a medication that can slow kidney damage over time and help preserve kidney function for longer.\n\n\n\n\n\nAs a concession card holder, it means Mr Brown will only need to pay $7.70 per script to access Jardiance from now on.\n\n\n\n\n\n\"It's gonna make a big difference, and the fact that $7.70 is a big difference when you work it out over 12 months.\"\n\n\n\n\n\nFor eligible patients without a concession card, the script will only cost $31.60.\n\n\n\n\n\nAnd from January 1 next year, the price will be further lowered to $25.\n\n\n\n\n\nFederal Health Minister Mark Butler says Jardiance is a life-changing drug for many Australians.\n\n\n\n\n\n\"Last year, we listed Jardiance for a limited group of Australians with a particular type of kidney disease. But from Saturday, we think another 70,000 Australians with kidney disease will become eligible for this life-changing drug.\"]]\n\n\n\n\n\nAccording to 2021 census, around 1 per cent of Australian population are living with kidney disease, with one in twenty Australians aged 75 and above being diagnosed with the disease.\n\n\n\n\n\nMr Butler describes kidney disease as a silent epidemic in Australia.\n\n\n\n\n\n\"We think more than two and a half million Australians have kidney disease, but less than 10 per cent of them know about it, because the sign and symptoms of kidney disease usually only become apparent when it's as much as 90 per cent of loss of kidney function has already taken place.\"\n\n\n\n\n\nProfessor Carol Pollock, who is the chair of Kidney Health Australia, also stresses the importance of conducting health checks to detect the asymptomatic disease.\n\n\n\n\n\n\"To pick up kidney disease, what we really need is a blood test, a blood pressure check and a urine test. And some people will have some of these tests done, but not always together, and we really need the three of them to be done. And what we would like to see is a kidney health check that meant that people would have those things done and then have an understanding of what the risk the kidney disease could be and allow it to be appropriately treated.\"\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/jamaica-braces-for-hurricane-melissa-strongest-storm-in-a-century/a9sqwiot2",
        "title": "Jamaica braces for Hurricane Melissa, strongest storm in a century",
        "publish_date": "Tue, 28 Oct 2025 06:44:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nJamaica is bracing for what's expected be one of its strongest storms on record.\n\n\n\nThe US National Hurricane centre's director Michael Brennan says there will be multiple, life-threatening level hazards. “\n\n\n\n\n\nWe're expecting catastrophic wind impacts with total structural failure near where that eye wall moves across the island, especially in areas of higher terrain, we could see complete tree falls in the mountainous areas and just complete and total destruction of some structures in those regions.”\n\n\n\n\n\nIn Jamaica, residents are battening down for what's to come.\n\n\n\n\n\nIn the Harbour view community of the capital Kingston, Susan Brown gestures towards a large wave hitting the shore.\n\n\n\n\n\n“Massive, massive, massive. It's coming, it's coming.”\n\n\n\n\n\n“As a human being, I think they should evacuate and leave down here. Because down here does not look safe.”\n\n\n\n\n\nA view shared by local resident Earl Cameron.\n\n\n\n\n\n“This is not a joke. This is very serious guys. And this is going to be something different, will be astronomical. This will be hard to digest when this is over.”\n\n\n\n\n\nMany have chosen to ride out the storm, prompting Jamaica's Prime Minister Andrew Holness to issue mandatory evacuation orders for several south coast communities.\n\n\n\n\n\n“We have always had a very slow, if not non-response to the call for evacuation ... And that is why we emphasise preparation, because preparation lessens the damage.”\n\n\n\n\n\nAt a school-turned evacuation centre in Montego Bay, shelter manager Sandra Simon Clarke is preparing for impact.\n\n\n\n\n\n\"We have seen and heard that it's going to be very catastrophic. So we are expecting that persons will come to the shelter. So we are ready. So please don't be afraid. But remember, you need to pack your medication. Remember, you need to take a little food items with you because we don't have that at the shelter just now. \"\n\n\n\n\n\nMeanwhile, in Santiago de Cuba, evacuation centres are already receiving visitors, including evacuee Beatriz Caballero.\n\n\n\n\n\n“The government quickly told me that I had to evacuate as soon as possible due to the proximity of this Category 5 hurricane. It is very dangerous.”\n\n\n\n\n\nCuba's president Miguel Diaz-Canel says the focus is on saving lives.\n\n\n\n\n\n“And protecting the population is guaranteed if there's proper evacuation. Anything that's a flood zone, areas below dams, micro-dams, all of that must be protected.”\n\n\n\n\n\nChief Meteorologist at Climate Central, Bernadette Woods Placky, attributes the storm's increasing ferocity to warming oceans.\n\n\n\n\n\n“Over 90 per cent of the extra heat that we trap in our Earth system goes into the oceans. And what that means is that our oceans are warming up. It plays out in many different ways, one of them being more fuel for these storms to intensify more rapidly.”\n\n\n\n\n\nIn Haiti's capital of Port-Au-Prince, Fortune Vital, who was displaced by the island nation's chronic gang violence now fears for his very survival.\n\n\n\n\n\n“If the hurricane comes on top of all the problems we already have, we'll simply die. My kids, my wife, and my family are somewhere else; we have nothing to eat to survive.”\n\n\n\n\n\nHurricane Melissa is expected to make landfall early on Wednesday morning, Australian time.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/environmental-law-overhaul-sparks-political-storm-in-canberra/9up0q8zqm",
        "title": "Environmental law overhaul sparks political storm in Canberra",
        "publish_date": "Tue, 28 Oct 2025 06:13:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Environment Protection and Biodiversity Conservation Act is facing its first major reform in twenty-six years.\n\n\n\n\n\nThe long-awaited overhaul of Australia’s national environmental law will take centre stage in Parliament this week.\n\n\n\n\n\nThis is the second iteration of the package, following the 2020 review authored by Graham Samuel.\n\n\n\n\n\nEnvironment Minister Murray Watt's predecessor, Tanya Plibersek, was previously accused of breaking a 2022 election promise after she pushed back tabling the initial reforms.\n\n\n\n\n\nKey parts of these reforms include setting up an independent Environmental Protection Agency, though the Minister still gets the final say, and there's a major push for state agreements to speed up approvals.\n\n\n\n\n\nOn Sunday, Opposition Leader Sussan Ley and Shadow Environment Minister Angie Bell formally asked Labor to split the bill.\n\n\n\n\n\nMs Bell told the ABC yesterday that doing so would immediately fast-track pro-business initiatives.\n\n\n\n\n\n“Well, we want to see some movement on this bill, and we don't want to stand in the way of environmental reform, and so we've suggested to the government overnight how to improve their bills. So we want to see the bill split, so we can streamline approvals and we can improve environmental protections separately. And what we've seen from the government is a flat refusal immediately...\"\n\n\n\n\n\nMs Bell was correct on the flat refusal...\n\n\n\n\n\nMr Watt was quick to label the split 'the maddest idea', rejecting the demands, which he argues would lead to more habitat destruction, more species threatened, no independent regulator and slower approval times.\n\n\n\n\n\n“We need to have a clear definition of the types of projects that would simply be unacceptable to the impact they would have on the environment - of course that would be beneficial for the environment in stopping unacceptable developments going ahead but it’s also really important for business to have the kind of clear definition so they get a fast no on a project and know that a particular project isn’t going to get approved.”\n\n\n\n\n\nMs Ley's pitch also seems to be out of step with the Business Council of Australia (BCA), which said one big bill would offer more certainty to businesses.\n\n\n\n\n\nDespite these concerns however, BCA CEO Bran Black indicated the council would prefer Labor to negotiate a deal with the opposition rather than the Greens,\n\n\n\n\n\nHe says there are a range of concerns with Labor's proposed reforms.\n\n\n\n\n\n“Those concerns relate to matters like the definition of unacceptable impacts and net gain the powers of the CEO of the EPA with respect to stop work orders, the circumstances in which disclosures with respect to emissions are relevant to assessments and of course, the fundamental point for us is how we can go about ensuring that at the end of the day, there is a more streamlined faster and more certain approach to assessments of application. “\n\n\n\n\n\nThe government's plans will include a 'National Interest Exemption,' so the Minister can fast track certain approvals for matters of 'national significance', and a 28 day limit for appealing decisions where environmental improvement approvals are not required.\n\n\n\n\n\nIn a Labor party caucus meeting today, Murray Watt responded to concerns about the national interest provision.\n\n\n\n\n\nHe explains that it is a direct recommendation from Graham Samuel and its use is primarily for defence and security reasons.\n\n\n\n\n\nThe Greens pre-empted the announcement last week.\n\n\n\n\n\nThey pointed to a similar carve-out for nuclear waste management from environmental laws in 2023, to get AUKUS across the line.\n\n\n\n\n\nGreens leader Larissa Waters told the ABC what she thought of the exemption.\n\n\n\n\n\n“They're already riddled with loopholes. But rather than fix those loopholes, the proposal by this environment minister under this government is to add additional loopholes and yet more fast track mechanisms for coal and gas. “\n\n\n\n\n\nThe government has already rejected a key Greens proposal for a climate trigger in the bill, instead following the Samuel Review's advice to require only emissions disclosure.\n\n\n\n\n\nMs Waters suggests a deal was far more likely to be struck between the Government and the Coalition than with the Greens.\n\n\n\n\n\n“The coalition, I think, are posturing and probably will end up doing a deal with labor on this. The Greens want to see environment laws that work for nature. We're willing to talk to government about that. Government's got the choice on who they want to work with. They can either protect nature and work with the greens, or they can deliver for big business trash the place, not stop logging, continue to fuel and fast track coal and gas. And I'm sure the coalition will be very happy to facilitate that.”\n\n\n\n\n\nAfter a Labour party room caucus meeting today, SBS was informed that the reforms will be introduced in a series of seven bills.\n\n\n\n\n\nMurray Watt plans to present the draft legislation to Parliament on Thursday, but the government needs to strike a deal with either the Coalition or the Greens to get it over the line.\n\n\n\n\n\nREAD MORE ABOUT THIS STORY Labor moves to create Australia's first national environment watchdog\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/unclaimed-money-australia/azyrlgtyc",
        "title": "Are you owed a slice of Australia's unclaimed billions? Here's how to find out",
        "publish_date": "Tue, 28 Oct 2025 06:04:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Many Australians plan to rein in Christmas spending this year, a new survey suggests.\n\n\n\n\n\nSome 78 per cent are planning to adjust their spending this Christmas, according to a survey of 1,000 Australians by market researcher Pureprofile.\n\n\n\n\n\nAround 38 per cent respondents said they'll cut back spending on gifts, 21 per cent will choose budget-friendly food and drink, and 18 per cent will focus gift-giving on children.\n\n\n\n\n\nRising costs are top of mind, with one in five wishing for relief from soaring food prices this Christmas. They estimate they'll spend $506 on food and drink this year, a 25 per cent increase from $406 in 2024.\n\n\n\nBut while households tighten their budgets, billions of dollars in unclaimed money remains untouched — and the funds could provide some relief for those eligible amid ongoing cost-of-living pressures.\n\n\n\nUnclaimed superannuation money could be your festive boost\n\nRecent data from the Australian Taxation Office (ATO) shows that the pool of lost and unclaimed superannuation has risen by $1.8 billion over the last financial year, taking the total to $17.8 billion.\n\n\n\n\n\nLost super includes both uncontactable (funds that can't reach you and haven't received contributions in 12 months) and inactive super (no contributions in five years).\n\n\n\n\n\nIf your fund can't get in touch, they may transfer your balance to the ATO as unclaimed super, which is held until it can be returned or moved to a new fund account.\n\n\n\n\n\nYou might have unclaimed super if you've changed jobs, moved house, or forgotten to update your details, or if you simply have multiple superannuation accounts.\n\n\n\nHow to check if you have unclaimed superannuation\n\nYou can check if you have lost or unclaimed super by checking your myGov account, using the ATO app, or phoning the lost super search line on 13 28 65.\n\n\n\n\n\nA full ATO guide on how to check for lost or unclaimed super can be found here .\n\n\n\nLost bank accounts, life insurance, shares, and investments\n\nOn top of that, you could have a slice of an additional $2.3 billion of lost money to be claimed from bank accounts, shares, investments and life insurance policies, according to the Australian Securities and Investments Commission (ASIC).\n\n\n\n\n\nThis money is managed by the ASIC and comes from accounts that haven't been touched for a certain period, usually seven years of inactivity.\n\n\n\nCash is transferred to ASIC if the account or policy isn't claimed, which can happen if you move, change address, or forget to update your details.\n\n\n\n\n\nOther potential sources include energy companies, universities and health funds, among plenty of others.\n\n\n\nHow to check if you have unclaimed money\n\nTo check if you have unclaimed money, you can use the unclaimed money search on ASIC's Moneysmart website .\n\n\n\n\n\nState governments will also have their own records where you might find lost money from deceased estates, lost share dividends, salaries and wages, cheques, overpayments and more.\n\n\n\n\n\nTo check for unclaimed money in your state's database, head to the relevant state website below:\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/messy-film-documents-screen-legend-s-dying-wish-20251029-p5n655.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Messy’ film documents screen legend’s dying wish",
        "publish_date": "Wed, 29 Oct 2025 12:58:58 +1100",
        "category": "entertainment",
        "authors": [
            "Jake Wilson"
        ],
        "text": "Warning: This story contains the name and image of an Indigenous person who has died.\n\nFILM\n\nJourney Home, David Gulpilil ★★★½\n\n(PG) 88 minutes\n\nIt’s been almost four years since the death of the great Yolngu actor, dancer and storyteller David Gulpilil. His extraordinary film career began in his teens when he was “discovered” by the British director Nicolas Roeg, who cast him in a starring role in the 1971 drama Walkabout.\n\nGulpilil, who was diagnosed with lung cancer in 2017, spent his last years primarily in the town of Murray Bridge, south of Adelaide. However, as his eldest son Jida Gulpilil testifies in this documentary, his dying wish was to be buried in accordance with tradition in his homeland of Gupulul in East Arnhem Land, near the sacred waterhole of Marayuwu, from which his spirit emerged.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-matildas-face-england-for-first-time-since-world-cup-loss-hurricane-melissa-makes-landfall-in-jamaica-netanyahu-orders-powerful-attacks-on-gaza-as-hamas-delays-body-handover-20251029-p5n62q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Netanyahu orders ‘powerful attacks’ on Gaza as Hamas delays body handover; Ley’s attack on PM’s Joy Division shirt a ‘weird frolic’, says O’Neil",
        "publish_date": "Wed, 29 Oct 2025 12:50:44 +1100",
        "category": "finance",
        "authors": [
            "Alexander Darling",
            "Emily Kaine"
        ],
        "text": "Independent Sydney MP Alex Greenwich has asked an appeal court to increase the damages awarded to him in his successful defamation case against former NSW One Nation leader Mark Latham, over an offensive tweet.\n\nA court found Sydney MP Alex Greenwich was defamed in a tweet by former NSW One Nation leader Mark Latham. Latham has appealed the decision. Credit: SMH\n\nGreenwich launched defamation proceedings in 2023 against Latham, now an independent NSW upper house MP, over a highly graphic and offensive comment on Twitter, now X.\n\nGreenwich has described the tweet, which this masthead has chosen not to reproduce, as “defamatory and homophobic”.\n\nLoading\n\nIn a decision in September last year, Federal Court Justice David O’Callaghan found Greenwich was defamed by the tweet and awarded him $140,000 in damages. O’Callaghan found the tweet conveyed the defamatory claim that Greenwich engages in “disgusting sexual activities”.\n\nLatham is now seeking to overturn that decision before a Full Court of the Federal Court. The appeal hearing is slated to run over three days from November 25.\n\nIn response to Latham’s appeal, Greenwich has filed a cross-claim.\n\nHe has asked the appeal court to find that the tweet conveyed an additional defamatory meaning that O’Callaghan did not find was conveyed, namely that Greenwich is “not a fit and proper person to be a member of the NSW Parliament because he engages in disgusting sexual activities”.\n\nGreenwich’s legal team said in submissions filed in court that a “higher award of damages is warranted”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/this-savoury-danish-roll-is-worth-queuing-for-at-a-new-bakery-by-a-fine-dining-pastry-chef-20251029-p5n682.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This savoury Danish roll is worth queuing for at a new bakery by a fine dining pastry chef",
        "publish_date": "Wed, 29 Oct 2025 12:50:43 +1100",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nButter Days Bakery in Malvern is run by Dessert Masters winner John Demetrios and his wife Martina.\n\n1 / 5 The BMO cheese roll. Luis Enrique Ascui 2 / 5 The Glenferrie Road bakery features a central communal table. Luis Enrique Ascui 3 / 5 The signature sunshine bun. Luis Enrique Ascui 4 / 5 Baked sweets. Luis Enrique Ascui 5 / 5 John Demetrios put his Dessert Masters prize money towards opening Butter Days. Luis Enrique Ascui Previous Slide Next Slide\n\nBakery$$$$\n\nAt Butter Days, Melbourne bakery fans have one more FOMO item to queue for: the BMO. “It stands for ‘bolle med ost’ or ‘bun with cheese’ in Danish,” says chef and baker John Demetrios (ex-Vue de Monde, Omnia). Demetrios runs the business with wife Martina Cissig Demetrios, a front-of-house professional who may have looked after you at Embla, Cumulus Inc. or Morning Market.\n\nNutty khorasan flour is used to make the chewy sourdough roll, which is spread with cultured butter thick enough to show teeth marks, filled with two slices of gruyere cheese, and seasoned with pink salt flakes.\n\nAt the bright Malvern shop, there’s a communal high table at the front, a pastry-laden display in the middle, and a huge marble baking bench at the back. There’s coffee, too.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/set-pieces-taking-over-premier-league-20251029-p5n67y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Set pieces taking over Premier League",
        "publish_date": "Wed, 29 Oct 2025 12:34:21 +1100",
        "category": "sports",
        "authors": [],
        "text": "Set pieces taking over Premier League\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/fitzroy-s-el-columpio-opens-surf-n-turf-taco-kiosk-on-st-kilda-beach-20251029-p5n67r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fitzroy’s El Columpio opens surf ‘n’ turf taco kiosk on St Kilda Beach",
        "publish_date": "Wed, 29 Oct 2025 12:33:38 +1100",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe northside favourite has ventured south of the river with a seafood spin-off.\n\n1 / 7 The finished torre de mariscos, ready to be piled onto tostadas. Swipe to see how the seafood tower is assembled. Penny Stephens 2 / 7 The seafood tower is layered with cooked and raw prawns, raw scallops and diced tuna, cucumber and avocado. Penny Stephens 3 / 7 Tostadas (crisp corn tortillas). Penny Stephens 4 / 7 Horchata drink. Penny Stephens 5 / 7 The mar y tierra taco with porterhouse, prawn, guacamole, melty Oaxacan cheese and a special chiltepin salsa (right). Penny Stephens 6 / 7 The flan Napolitano dish. Penny Stephens 7 / 7 El Columpio’s Ricardo Garcia Flores at his new “taqueria and marisqueria” in St Kilda. Penny Stephens Previous Slide Next Slide\n\nMexican$$$$\n\nMelbourne’s Mexican game is surging for summer with a new El Columpio “taqueria and marisqueria” (taco and seafood restaurant) on St Kilda Beach. The kiosk is between the St Kilda Sea Baths and Catani Gardens, overlooking a lawn that gives onto the promenade and the beach itself. It was previously home to Claw & Tail. The seating is all outdoors, or you can take your spoils to the sand.\n\nHere, the team use more expensive ingredients, such as seafood, prime steak and prized chiltepin chillies, a tiny wild-grown red pepper with an intense but short-lived burn. Those ingredients are brought together in dishes such as the taco mar y tierra (sea and land), with porterhouse, prawn, guacamole, melty Oaxacan cheese and a chiltepin salsa.\n\nAnother signature dish is the torre de mariscos, a seafood tower for two people ($50) presented in a stainless steel tube that is removed at the table, revealing a layered stack of cooked and raw prawns, raw scallops and diced tuna, cucumber (or mango in season) and avocado. It’s then toppled into a marvellous messy pile before being lavishly sauced for diners to pile over crisp tortillas.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-p-plater-nabbed-at-193km-h-20251028-p5n5vt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Nine schools taught the wrong topic for ancient history exam; Woman missing from Noosa Private Hospital; Shark feeding frenzy on the Gold Coast; Walking longer, not faster, better for heart health",
        "publish_date": "Wed, 29 Oct 2025 12:30:58 +1100",
        "category": "finance",
        "authors": [],
        "text": "Education Minister Johh-Paul Langbroek accepted there was no way as a senior student that he would be expected to learn a semester’s worth of work in a couple of days.\n\n“What we’ve done is tried to make sure that we identify which schools are affected ... and then provide the reassurance that senior students will need,” he said.\n\nBrisbane State High School in South Brisbane. Credit: Dan Peled\n\n“I would not expect any student to do an exam after they’ve received lectures or information about something that they’ve had two days’ notice for.”\n\nHe said students’ previous assessment results would be scaled up to account for the bungle on the ancient history exam.\n\n“I’m very unhappy about the situation developing as it has and for the stress that it will have caused for everyone,” Langbroek said.\n\nRead more here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/sydney-tennis-coach-barred-over-child-sexual-harassment-abuse-allegations-20251014-p5n2in.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney tennis coach barred over child grooming allegations",
        "publish_date": "Wed, 29 Oct 2025 12:27:45 +1100",
        "category": "sports",
        "authors": [
            "Amber Schultz"
        ],
        "text": "A Sydney tennis coach who allegedly groomed and sexually harassed a child and committed sexual misconduct against a staff member was able to continue coaching for two years after the complaints were made to Tennis Australia.\n\nBrenton Dumbrell, who owns and coaches at Inspire Tennis, has been suspended from coaching activities until October 2027 following incidents alleged to have occurred at Killara Lawn Tennis Club. His lawyer said he had no comment.\n\nBrenton Dumbrell, pictured at a members-only club event in November, had the allegations upheld by an independent tribunal. Credit: Instagram: thepillars.au\n\nThere is no suggestion that Dumbrell has committed any criminal offence. He is not facing any police investigation or charges.\n\nHis Working with Children Check (WWCC) has been under review since the allegations were first reported to Tennis Australia in 2023. Tennis Australia convened an independent tribunal, which began hearings in December 2024, with a decision reached in August this year and sanctions implemented this month.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/hurricane-melissa-live-category-5-storm-of-the-century-set-to-make-landfall-in-jamaica-20251028-p5n5ys.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hurricane Melissa live updates: Category 5 storm makes landfall near Jamaica’s New Hope, winds up to 300km/h; Jamaican PM declares nation ‘disaster area’ as deaths reported in neighbouring countries",
        "publish_date": "Wed, 29 Oct 2025 12:25:57 +1100",
        "category": "finance",
        "authors": [
            "Marta Pascual Juanola",
            "Ellen Connolly"
        ],
        "text": "Hurricane Melissa is slowly moving towards Cuba where it’s predicted to cause catastrophic flash flooding and multiple landslides in the coming hours.\n\nAbout 281,000 people in the eastern province of Santiago de Cuba have been evacuated to shelters or are staying with neighbours and relatives.\n\nSome low-lying or coastal communities have been completely evacuated, with only the personnel in charge of safeguarding property remaining.\n\nThe weather front – now category 4 after crossing Jamaica and packing winds of more than 200km/h – is moving north-east towards Cuba at 8km/h, but is expected to pick up speed as it nears, National Hurricane Centre director Dr Michael Brennan said.\n\nThe weather front is expected to hit south-eastern Cuba sometime about 2am on Wednesday local time (7pm AEDT) “as a powerful major hurricane”. It is expected to make landfall somewhere between the provinces of Santiago de Cuba and Manzanillo.\n\nBrennan said storm surges of 30 centimetres above normal tide levels were likely to hit the areas where the hurricane will cross the coast.\n\n“Catastrophic flash flooding” and multiple landslides are also likely in the Manzanillo, Santiago de Cuba and Guantànamo provinces in south-east Cuba, where isolated rainfall amounts could reach 63 centimetres.\n\nCuban President Miguel Díaz-Canel said every effort will be made to protect residents despite the fragility of the island’s economy.\n\nIn a televised address to the nation and wearing an olive-green uniform, Díaz-Canel urged the population to not underestimate the power of the storm, calling it “the strongest ever to hit national territory”.\n\nHe asked residents to avoid bathing in swollen rivers and urged them not to leave evacuation sites “until the order has been given”.\n\n“There will be a lot of work to do. We know there will be a lot of damage.”\n\nWith AP",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-wobbles-ahead-of-inflation-data-miners-bounce-back-as-woolies-gains-20251029-p5n62j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX drops after inflation shock; Banks decline, Woolworths gains",
        "publish_date": "Wed, 29 Oct 2025 12:23:05 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "However, “there appear to be some (very early) green shoots,” Jarden analyst Ben Gilbert wrote in a note to clients, pointing to the supermarket’s October food sales of 3.2 per cent. If the September quarter “proves to be the trough and October to-date trends continue, the stock should do well.” Pressure is rising on the Woolworths CEO, who will face shareholders at the company’s annual general meeting on Thursday, just as arch rival Coles will report its quarterly sales. Coles has been gaining market share on Woolworths. Coles shares dropped 0.6 per cent. Oil and gas giants Woodside and Santos fell for a second session as oil declined further amid mounting signs of oversupply, which quelled a bumper rally triggered by US sanctions on key Russian producers last week. West Texas Intermediate fell 1.9 per cent to again settle close to $US60 a barrel, the steepest daily drop in more than two weeks. Woodside was down 1.2 per cent and Santos shed 0.8 per cent in early trade. CSL also continued its slide, losing a further 5 per cent. The nation’s biggest health company slumped 15.9 per cent on Tuesday after vaccine scepticism led to a plunge in influenza vaccinations in the US, a key market, forcing it to issue a profit warning for its Seqirus vaccine business and delaying the unit’s planned spin-off into a separate company. Building products maker James Hardie shed 1 per cent after US homebuilder D.R. Horton reported weaker profit for the Northern hemisphere summer than expected amid cautious consumer sentiment. James Hardie makes about three quarters of its sales in the US.\n\nMining heavyweights BHP and Rio Tinto advanced, up 0.7 per cent and 0.2 per cent, respectively, while gold miners got some reprieve after their recent losses. Northern Star climbed 2.7 per cent, Evolution Mining added 2.9 per cent and Newmont was up 1.8 per cent as gold steadied after a three-day rout to trade near $US3950 an ounce. On Wall Street overnight, the S&P 500 added 0.2 per cent. The Dow Jones rose 0.3 per cent, and the Nasdaq composite climbed 0.8 per cent. All three indexes set all-time highs for a third straight day. Loading Moves were also relatively modest in the bond market as investors waits for a few events that could shake things up. On Wednesday, the Federal Reserve will announce its latest move on interest rates, while some of the US bourse’s most influential companies will report how much profit they made during the summer. On Thursday, President Donald Trump will meet China’s leader Xi Jinping in hopes of smoothing tensions between the world’s two largest economies. Tech giants Apple (up 0.1 per cent) and Microsoft (up 2 per cent) both climbed, with both companies hitting a valuation of $US4 trillion during the session, joining AI giant Nvidia as the only publicly traded companies worth that figure. Microsoft hit the mark earlier in the year.\n\n“We expect another strong round of megacap tech earnings reports, given the relentless demand for AI technology and infrastructure,” said Clark Bellin at Bellwether Wealth. “While profitability in AI remains an unknown, investors for now are willing to overlook this as the AI arms race heats up.” Amazon, meanwhile, rose 1 per cent after saying it will cut about 14,000 corporate jobs, or about 4 per cent of its corporate workforce, as it ramps up spending on artificial intelligence while cutting costs elsewhere. Until then, profit reports from overnight and the morning were the main drivers of Tuesday’s action. United Parcel Service rallied 8 per cent after delivering stronger profit and revenue for the latest quarter than analysts expected. UPS also gave a forecast for revenue in the all-important holiday shipping season that was slightly above analysts’ expectations. PayPal climbed 3.9 per cent after saying it made a bigger profit during the summer than analysts expected. It also said it plans to pay its shareholders a dividend every three months, while announcing a deal where internet users will be able to pay for purchases through OpenAI’s ChatGPT.\n\nOn the losing end of Wall Street was Royal Caribbean, which lost 8.5 per cent despite reporting a stronger profit than analysts expected. Its revenue for the latest quarter fell short of expectations. The cruise operator also said it’s seen a “minimal” hit to its business this quarter because of bad weather, along with the temporary closure of one of its exclusive destinations in Haiti. Loading A slowing job market is one of the main reasons Wall Street expects the Fed to announce another cut to interest rates on Wednesday. It would be the second time this year that it’s lowered the federal funds rate in hopes of helping the job market. The widespread expectation is that the Fed will also cut rates for a third time at its final meeting of the year. A lot is riding on that, in part because US stock prices have already rallied to records on expectations for it. That means the most important part of Wednesday’s announcement for Wall Street will be whether Fed Chair Jerome Powell gives any hints about upcoming moves. Fed officials have indicated that they’re likely to keep cutting interest rates next year, but they may have to change course if inflation accelerates beyond its still-high level. That’s because low interest rates can make inflation worse.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/chance-of-rate-cut-sinks-after-inflation-surges-20251029-p5n63c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chance of rate cut sinks after inflation surges",
        "publish_date": "Wed, 29 Oct 2025 12:21:57 +1100",
        "category": "finance",
        "authors": [
            "Shane Wright",
            "Millie Muroi"
        ],
        "text": "The chance of a rate cut at the Reserve Bank’s next meeting has plummeted after annual inflation jumped to its highest level in more than a year and recorded its sharpest quarterly rise since 2022.\n\nInflation for the year to September was 3.2 per cent, according to data released by the Australian Bureau of Statistics on Wednesday, a rise in the headline inflation rate of 1.1 per cent.\n\nRBA governor Michele Bullock said a difference of more than 0.3 percentage points between the bank’s forecast and the data on Wednesday would be a “material miss”. Credit: Dominic Lorrimer\n\nTrimmed mean inflation, which removes the impact of the highest and lowest price changes and is a key measure for the Reserve Bank, came in at 1 per cent for the three months to September and 3 per cent over the year.\n\nIn its latest statement on monetary policy, the Reserve Bank said it expected headline inflation to climb to 3 per cent by the end of the year and for trimmed mean inflation to drop from 2.7 per cent to 2.6 per cent, closer to the middle of its target range of 2 to 3 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/bill-shorten-on-antisemitism-at-australian-universities-20251029-p5n67p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "BIll Shorten on antisemitism at Australian universities",
        "publish_date": "Wed, 29 Oct 2025 12:17:17 +1100",
        "category": "finance",
        "authors": [],
        "text": "BIll Shorten on antisemitism at Australian universities\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/asian-beef-salad-20251029-p5n677.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Asian beef salad",
        "publish_date": "Wed, 29 Oct 2025 12:11:58 +1100",
        "category": "lifestyle",
        "authors": [
            "Sarah Pound"
        ],
        "text": "Step 1 To marinate the steak, whisk the fish sauce, sugar, garlic, and lime in a medium bowl. Add the beef, tossing to coat thoroughly. For a quick infusion, marinate for 30 minutes; for the best flavour, cover and chill overnight.\n\nStep 2 Place a medium frying pan or barbecue over high heat. Cook the steaks for about 5 minutes on each side for rare, adjusting based on thickness and your preferred level of doneness. Once cooked, remove the beef and let it rest for 10 minutes before slicing it into strips.\n\nStep 3 Prepare the vermicelli noodles according to the packet instructions (I usually soak them in a bowl of boiling water for 3-5 minutes with a plate on top). Drain and rinse them in cold water. If they’re still wet, drain them on a paper towel.\n\nStep 4 For the chilli-lime dressing, mix ingredients in a small bowl or lidded jar and adjust to taste. It should be tangy with a little heat and sweetness.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/konstas-castled-in-horror-fashion-20251029-p5n67m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Konstas castled in horror fashion",
        "publish_date": "Wed, 29 Oct 2025 12:07:10 +1100",
        "category": "finance",
        "authors": [],
        "text": "Konstas castled in horror fashion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/influencer-shares-update-from-jamaica-as-hurricane-melissa-hits-20251029-p5n67l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Influencer shares update from Jamaica as Hurricane Melissa hits",
        "publish_date": "Wed, 29 Oct 2025 12:02:06 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Influencer shares update from Jamaica as Hurricane Melissa hits\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/a-rollicking-tale-of-the-life-of-a-secret-gold-coast-poet-20251016-p5n359.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A rollicking tale of the life of a secret Gold Coast poet",
        "publish_date": "Wed, 29 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Thuy On"
        ],
        "text": "As a genre, memoirs can sometimes be lugubrious and self-indulgent, with the reader forced to listen to long stretches of dramatic peaks and scabrous lows, but Brown’s storytelling is brisk and playful, and it’s a pleasure to be in his company.\n\nBoth photos display Brown as a serious fellow, but such gravitas is undermined by the actual contents of this memoir: despite some of the heavier material, (substance abuse, bad health, familial woes and a nervous breakdown, aka “existentialitis”), a rich vein of humour courses through the book. The tone of Confessions of a Minor Poet is conversational banter, an extended yarn to a mate over a pint or three.\n\nThe cover photo of Confessions of a Minor Poet features Phil Brown: floofy white-haired, black-rimmed glasses, with his hands on his face staring directly and unsmilingly at us. The one on the back is a portrait of him as a young man, tapping away on his trusty typewriter with a reference book nearby. He looks for all the world like a prim, industrious journo focused on breaking a story, or maybe he is in the midst of translating poetic snippets from handwriting to print.\n\nThe author’s previous books have ranged in scope from poetry, travel writing, and even an ambitious search for the meaning of life. In 2019, he wrote a memoir about his childhood in Hong Kong during the 1960s. This latest offering is a sequel of sorts, picking up a decade later upon his return to Australia.\n\nJournalist, jobbing writer and poet Phil Brown in 2004.\n\nIt starts with 18-year-old “Browneye” (an unfortunate travesty of his name bestowed by fellow surfers), at home in the Gold Coast. Picture this dope-smoking, ratbag teenager who had to repeat year 10 twice because of classroom misdemeanours and a surfing obsession. And yet, the lad was also a bookish maladroit whose companions included Ernest Hemingway, D. H. Lawrence and Patrick White. Oh, and inspired by unrequited love and the lyrics of The Beatles and The Doors, Brown also wrote his first poem – printed on the back of his surfboard.\n\nFrom this juvenilia period of experimentation (in drugs, booze and verse), the book tracks Brown’s life as he serendipitously falls into journalism almost as an afterthought – when what he really wanted was to develop his poetic sensibility. His getting of literary wisdom was aided not only by emulating the style of his heroes, but by friendships with esteemed men of letters like “The Bard of Bunyah”, Les Murray, and “the Poet of Ordinary Australia”, Bruce Dawe. (It was fitting that Brown, the erstwhile disciple would, decades later, pen Dawe’s obituary in The Courier-Mail.)\n\nThe title of this memoir could easily be thus: Confessions of a Knockabout Journalist and a Minor Poet, Brown’s peripatetic lifestyle in his 20s and beyond led him to work for numerous media outlets: apart from a stint as a radio copywriter, he reported for various publications and across different editorial capacities in and beyond his home state. There are amusing tales of his time in rural newspapers (think bull sales, CWA jubilees, dairy festivals) and plenty of celebrity name-dropping when he was a social gadfly-about-town, with encounters with luminaries including Split Enz, Australian Crawl, Manning Clark, Eric Bana, Alain de Botton and Barry Humphries.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/traditional-bedtime-fairytales-are-being-replaced-by-machine-driven-content-20251023-p5n4rl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Traditional bedtime fairytales are being replaced by machine-driven content",
        "publish_date": "Wed, 29 Oct 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Jane Sullivan"
        ],
        "text": "Why aren’t more young people reading for pleasure? International studies reveal that their reading skills and enjoyment are falling. The trend is also apparent in Australia: recent data shows that one in three Australian children aren’t proficient readers, and that 29 per cent of teens don’t choose to read at all.\n\nWe can all point to reasons: the rival attractions of the internet and social media, limitations to literacy, peer group pressure, and so on. It’s a given that children develop an attachment to books at a very early age, long before they can read, through picture books and the voice of a parent or caregiver reading aloud. But parents these days are often too time-poor and tired to pick out the right books and to give their children this kind of attention.\n\nAuthors worry about the implications - both legal and ethical - of AI-generated books for children. Credit: Getty Images\n\nGuess what? AI has come up with a solution that at first glance seems quite a boon for frazzled parents. Google has launched Gemini Storybook, an app that creates personalised stories that you can read aloud to if you choose. Feed in a few prompts for story and art style and in 10 seconds, Storybook is back with a 10-page digital picture book in any one of 45 languages.\n\nOne fan, Sarah Dooley, told the US journal Publishers Weekly she wanted a story about twins starting kindergarten for her children. “Gemini created the sweetest storybook about squirrel sisters starting school together. Sharing it with my girls opened up a conversation about their nerves.”",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/don-t-care-coalition-split-012844478.html",
        "title": "‘Don’t care’: Coalition split over Albo’s attire",
        "publish_date": "2025-10-29T01:33:15Z",
        "category": "finance",
        "authors": [],
        "text": "Coalition members are divided over Sussan Ley’s criticism of Anthony Albanese for wearing a Joy Division T-shirt.\n\nThe Prime Minister had disembarked from a Royal Australian Air Force Airbus last week, dressed in the band shirt, which sparked criticism from the Opposition Leader on Tuesday.\n\n“Arriving back in Australia from his overseas trip, the Prime Minister stepped off the plane proudly wearing a T-shirt with the name of a band, Joy Division, whose origins are steeped in anti-Semitism,” she told the House of Representatives during question time.\n\nSussan Ley attacked Anthony Albanese for wearing a Joy Division T-shirt. Picture: NewsWire / Martin Ollman\n\nMr Albanese wore the shirt as he got off a plane last week. Picture: Screengrab\n\n“The name was taken from a wing of a Nazi concentration camp where Jewish women were forced into sexual slavery.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“At a time when Jewish Australians are facing a rise in anti-Semitism, when families are asking for reassurance and unity, the Prime Minister chose to parade an image derived from hatred and suffering.”\n\nMr Albanese “understood” the history of the band’s name because he was told about it on a podcast in 2022, Ms Ley said.\n\nHowever, Liberal backbencher Jane Hume told Sky News that she had “no idea” of the backstory of the band’s name but said if the Prime Minister knew about it, wearing it was “bad taste”.\n\n“If there are people who are offended, if it is in bad taste … the Prime Minister can reflect on that,” she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHowever, Senator Hume said ultimately she didn’t “tell people what to wear”.\n\nJane Hume said it was up to Mr Albanese to ‘make the call’ on the shirt’s appropriateness. Picture: NewsWire / Martin Ollman\n\n“There’s some pretty offensive things that people wear in parliament, let alone around the streets, but this is up to the Prime Minister to make the call.\n\n“I wouldn’t wear it, but then, I don’t like Joy Division.”\n\nEarlier, Nationals senator Bridget McKenzie also downplayed the Coalition leader’s comments, claiming she herself “came of age, listening and dancing to Joy Division and New Order” in a Sunrise interview.\n\n“Get on with anti-Semitism instead of using this as a shield,” Senator McKenzie said.\n\n“There’s a lot to legitimately criticise the Prime Minister about. Trillion-dollar debt, skyrocketing house prices and job losses in our heavy industrial sector. Wearing a T-shirt isn’t one of them.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSenator McKenzie’s colleague, Matt Canavan, also shot down Ms Ley’s comments by declaring to the Today show: “I don’t really care what T-shirt he wears. I really don’t.”\n\nOn the flip side, Liberal frontbencher Andrew Bragg told the ABC that Mr Albanese’s role as an “ambassador for our nation” meant he needed to take “great care in whatever he wears”.\n\n“Certainly, some people have been offended by the wearing of that shirt, so that’s a matter for him to consider,” Senator Bragg said.\n\nJewish groups, including the Executive Council of Australian Jewry, were approached by NewsWire after Ms Ley’s statements on Tuesday but declined to comment.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/gas-banned-major-aussie-city-013006172.html",
        "title": "Gas to be banned in major Aussie city",
        "publish_date": "2025-10-29T01:30:06Z",
        "category": "finance",
        "authors": [],
        "text": "All gas appliances will be outlawed in new buildings in the heart of Sydney in a little more than a year.\n\nOn Monday, the City of Sydney formally endorsed the ban on gas appliances on new homes and businesses.\n\nIt comes off the back of the council’s decision in June to restricted indoor gas appliances in new homes, including cooktops, ovens and heaters.\n\nGas appliances will be banned from all new builds in Sydney. Picture: NewsWire/ David Crosling\n\nThe City of Sydney said the move was a “win for health, climate and cost-of-living, according to climate and health organisations”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe new rules will come into effect on January 1, 2027, and will apply for newly-built offices larger than 1000 sqm, hotels and serviced apartments with more than 100 rooms.\n\nThe change will not apply to existing buildings, renovations or industrial buildings that cannot be electrified easily.\n\nRenewable gas will also continue to be allowed in new developments.\n\nNewly-built cafes and restaurants will still be allowed to use a gas connection, as long as there are pipes and space for future electrification.\n\nSydney Lord Mayor Clover Moore said the reform would benefit the public’s health and the planet. Picture: NewsWire / Monique Harmer\n\nSwitching off the gas was given the green light during the council meeting on Monday, with 60 out of 84 submissions supporting the proposal.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSydney Lord Mayor Clover Moore said the reform would be better for the environment and public’s health, stating that gas stoves had been linked to about 12 per cent of asthma cases in children.\n\n“Relying on gas is bad for the planet, bad for our finances and bad for our health,” she said.\n\n“It is why the move has been met with broad approval from a diverse variety of stakeholders.”\n\nThe change is coming into effect in January 2027. Picture:NewsWire/ Monique Harmer\n\nDoctors for the Environment Australia chair and neurologist Shaun Watson said removing gas would enhance the livelihood of Sydneysiders.\n\n“Burning gas indoors releases carbon dioxide which is heating the planet,” he said.\n\n“Gas used in the home also releases nitrogen dioxide, benzene and formaldehyde which are known to trigger childhood asthma and are linked to cancers.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDr Watson said the council’s move should inspire others to follow suit.\n\n“City of Sydney has just placed itself on the right side of history in the transition towards renewables and electrification which will help the environment and improve people’s health,” he said.",
        "source": "Yahoo"
    }
]